{
  "title": "NA Speaker commends exemplary professionalism of journalists",
  "link": "https://www.app.com.pk/national/na-speaker-commends-exemplary-professionalism-of-journalists/",
  "date_published": "2023-04-29T06:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): National Assembly Speaker Raja Pervez Ashraf has commended the Pakistani journalistic community for their responsible and professional work, recognizing them as an essential pillar of the country.\nAddressing a reception in honor of Pakistan Federal Union of Journalists (PFUJ) representatives at the Parliament House last night, Speaker credited the media for playing an instrumental role in restoring democracy by supporting politicians and ensuring the supremacy of the Constitution and Parliament.\nThe Speaker emphasized the Parliament’s commitment to solving all problems faced by the journalistic community while urging journalists to uphold and maintain the honour and respect of the Parliament, which belongs to all.\nHe stressed the importance of the Parliament as the home of 220 million people, and its supremacy as non-negotiable.\nAdditionally, he underscored the sanctity of the Constitution, emphasizing that its protection was a shared responsibility.\nExpressing his respect for the Supreme Court, the Speaker highlighted the importance of avoiding conflicts between institutions in the interest of the country.\nHe emphasized that only the Parliament holds the authority to amend or rewrite the Constitution, if necessary.\nThe Speaker mentioned that the Parliament had passed a law granting sou moto authority to three judges instead of one, but the Supreme Court had halted its implementation.\nThe Speaker urged all pillars of the State to operate within their legal domains and work together for the betterment of Pakistan, especially during the country’s challenging times on multiple fronts.\nThe Speaker also mentioned the celebration of the Golden Jubilee of the Constitution, where invitations were extended to representatives from all pillars of the State, including Supreme Court judges.",
  "retrievedAt": "2025-08-11T08:24:22.876Z"
}
