{
  "title": "President directs EOBI to pay female teacher’s pension within 30 days",
  "link": "https://www.app.com.pk/national/president-directs-eobi-to-pay-retired-female-teachers-pension-within-30-days/",
  "date_published": "2023-04-29T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): President Dr Arif Alvi has directed the Employees’ Old Age Benefit Institution (EOBI) to issue pension to a retired female teacher within 30 days and report its compliance to the Wafaqi Mohtasib.\nThe teacher had been deprived of her pension by the EOBI since February 2019 on the flimsy ground that the beat officer of the complainant had verified her service period of only three years.\nExpressing displeasure over the failure of EOBI to address the grievances of the complainant, the president regretted that EOBI had unnecessarily wasted its precious time by submitting representation against the decision of the Wafaqi Mohtasib who had referred the case to EOBI for resolution within 45 days.\nHe also directed the secretary, Ministry of Overseas Pakistanis and Human Resources Development to take effective measures to enhance the service delivery of EOBI immediately, President Secretariat Press Wing said in a press release on Saturday.\nAs per details, Zohra Bibi (the complainant) had stated that she served with the Oxford Public School, Hayatabad, Peshawar, w.e.f. 01-07-1996 to February 2019 (almost 23-years) and that the contribution from her salary had been deducted and this fact had been admitted by the Employees’ Old Age Benefit Institution (EOBI) that the concerned school was registered with it.\nAccording to her, after retirement she applied for grant of EOBI’s pension but to no avail.\nFeeling aggrieved, she approached Wafaqi Mohtasib who passed the order in her favour but the EOBI filed a representation with the president.\nThe president rejected EOBI’s representation and observed that the registration card dated 29-11-2006 of the pension scheme issued by EOBI was genuine and it was written on the card that the effective date was 07-05-1996; whereas the complainant was eligible for EOBI pension with effect from 01-07-1996.\nHe further pointed out that the contribution was deducted throughout from the monthly salary of the complainant and it was admitted by the EOBI that the concerned school was also registered with it.\nHe said that EOBI had failed to computerize the complete record of that school and also failed to recover its share, if any, from the school, and resultantly the low paid female complainant was kept deprived of her due pension since February 2019.\nIn his decision, the president said the pension was not a bounty rather an employee earned it by dint of long, continuous and faithful service and this constituted a fundamental right to livelihood under Article 9 of the Constitution of the Islamic Republic of Pakistan, 1973, adding that this hard-earned right could not be denied to a pensioner except in accordance with law.\nHe noted with grave concern that EOBI failed to redress the grievance of the complainant even after clear direction of the Wafaqi Mohtasib to the agency to dispose of the case within 45-days.",
  "retrievedAt": "2025-08-11T08:24:21.895Z"
}
