{
  "title": "Armed Forces will never hesitate from any sacrifice to safeguard future of next generations: COAS",
  "link": "https://www.app.com.pk/national/armed-forces-will-never-hesitate-from-any-sacrifice-to-safeguard-future-of-next-generations-coas/",
  "date_published": "2023-04-29T10:15:00.000Z",
  "source": "APP",
  "content": "KAKUL, Apr 29 (APP):Chief of Army Staff (COAS), General Syed Asim Munir on Saturday said that Armed Forces of Pakistan would never shy away from any sacrifice to stabilize, secure and safeguard the future of our next generations.\nThe Army Chief made these remarks as the chief guest while addressing the Passing Out parade of cadets of 147th Pakistan Military Academy (PMA) Long Course, 13th Mujahid Course, 66th Integrated Course, 6th Basic Military Training Course and 21st Lady Cadet Course held at Pakistan Military Academy (PMA) Kakul, an Inter Services Public Relations (ISPR) news release said.\nThe Army Chief said that the people of Pakistan were central to the unity of the state. “First and the foremost is loyalty to the State of Pakistan and commitment to the Constitutional role assigned to Armed Forces of Pakistan.”\n“To us, nothing is more sacred than the safety and security of our people and no duty is more binding than the defence of our motherland. Go out now, and deliver to the expectations of your nation,” the COAS said.\nThe Army imbibed on the vision of our Great Quaid signifying no distinction of caste, color, creed, gender or geography, he added.\nThe COAS said the Armed Forces’ efforts for peace should never be taken as a sign of weakness.\nThe COAS said, “We have the will, capability and capacity to protect our sovereignty and territorial integrity and we are well aware of the ways and means to do it. I assure the people of Pakistan that we will never hesitate in rendering any and every sacrifice necessary for the defence of our sacred motherland.”\n“Brave soldiers of Armed Forces of Pakistan don’t get fascinated with the numbers/ resources of their adversaries. Armed Forces of Pakistan stand firm with their strong will and determination while fulfilling the promises of Almighty Allah as true followers,” the Army Chief said.\nGeneral Asim Munir referred to the Quranic verse of Surah Al-Baqarah, translation of which is: ” How many times it happened that a smaller force vanquished a bigger force by the Will of Allah.”\n“Significant effort is being made by our adversaries to affect state and societal cohesion through multiple efforts. There is absolutely no space for spoilers of our hard earned peace,” the COAS said.\n“There is a dire need to identify the exposed and hidden enemies. In this regard, there must be a difference between reality and deception.\n“Our enemies are hell-bent upon driving a wedge between its people and Armed Forces,” he added.\nThe Army Chief vowed that the Army would ensure that the bond between the Armed Forces and the people of Pakistan was preserved and further solidified. “Stability, security and peace in Afghanistan remain fundamentals to our security.\n“We will continue to provide political, moral and diplomatic support to our Kashmiri brothers,” the COAS said.\n“Pakistan firmly stands with its Kashmiri brethren in their historic struggle for basic human rights and their legitimate quest for the right to self-determination. The international community must realize that without a just and peaceful resolution to the Kashmir issue, regional peace will forever remain elusive,” he added.\nThe cadets from Palestine, Bahrain, Iraq, Qatar and Sri Lanka were also among the passed out cadets.\nThe COAS reviewed the parade and gave awards to distinguished cadets. The coveted Sword of Honour was awarded to Academy Senior Under Officer Abdullah Bin Tariq and President’s Gold medal to Battalion Senior Under Officer Ali Amir of 147th PMA Long Course.\nThe Chairman Joint Chiefs of Staff Committee Overseas Gold Medal was awarded to Battalion Sports Sergeant Pasindu Dayananda from Sri Lanka. The COAS Cane was awarded to Course Under Officer Muhammad Adnan Munawar of 13th Mujahid Course, the Commandant’s Canes were awarded to Course Under Officer Adil Ali of 66th Integrated Course, Course Sergeant Major Fatima Khalid of 21st Lady Cadet Course and Course Under Officer Salman Khan of 6th Basic Military Training Course.\nThe COAS congratulated the passing out cadets and their parents on the successful completion of their training at PMA; the premier training institution.\nEarlier on arrival, the COAS was received by Commandant PMA.",
  "retrievedAt": "2025-08-11T08:24:16.607Z"
}
