{
  "title": "5 died, 3 injured as warehouse roof collapsed in Humak",
  "link": "https://www.app.com.pk/national/5-died-3-injured-as-warehouse-roof-collapsed-in-humak/",
  "date_published": "2024-08-27T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): In a tragic incident on Tuesday, the roof of an under-construction warehouse in Humak collapsed, resulting in the deaths of five laborers and injuries to three others.\nAccording to an Islamabad Capital Territory (ICT) administration spokesperson, eight workers were on site when the roof suddenly collapsed and they were buried under the debris.\nThe initial rescue operation led to the recovery of four bodies and three injured individuals, who were transported to a local hospital for medical treatment, he said.\nHe said rescue teams continued their efforts to locate one more laborer still buried under the rubble.\nHe said Deputy Commissioner ICT Irfan Nawaz Memon was present throughout the rescue operation, supervising the relief efforts alongside the Assistant Commissioner Rural and other officials.\nRescue officials reached at the scene soon after the incident, successfully pulling two workers out of the rubble in time to save their lives, he added.\nHe said despite the best efforts of rescue personnel, finding the fifth laborer proved both challenging and distressing. After an exhaustive operation, the fifth worker was eventually recovered from the wreckage, but he was found deceased.\nDC Irfan Nawaz Memon continued to supervise the operation until the last worker was evacuated, he added.\nIn response to the incident, the district administration has sealed the warehouse to facilitate a thorough investigation and prevent future accidents, he said.\nAn inquiry has been launched to determine the causes of the collapse and to assess if any precautionary measures were lacking, DC said.\nAccording to sources three of the deceased have been identified as residents of Taunsa Sharif in Dera Ghazi Khan district, Punjab, and one from Malir in Karachi.\nA committee has been formed to investigate the collapse and evaluate safety protocols. The district administration has pledged to provide updates as the investigation progresses and as more information becomes available.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:02:50.566Z"
}
