{
  "title": "Young Scientists to get fellowship opportunity under COMSTECH-MSTF joint venture",
  "link": "https://www.app.com.pk/national/young-scientists-to-get-fellowship-opportunity-under-comstech-mstf-joint-venture/",
  "date_published": "2024-08-27T08:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): August 31 will be the last date to apply for the Young Scientists’ Fellowship Program (YSTP) being executed through the support of the Mustafa (Peace Be Upon Him) Science and Technology Foundation (MSTF) and COMSTECH-the OIC Standing Committee on Scientific and Technological Cooperation.\nAccording to an official of COMSTECH, the fellowship program, to be conducted at the Sharif University of Technology, Tehran, Iran, has been designed to support the young scientists from the Islamic countries.\nThe YSFP has been initiated to support talented youth with the cooperation of prestigious scientific institutes and reputable Research and Development centers.\nThe fellowship program has been announced in the research areas of Mechanical Engineering, Renewable Energy and Turbines, IOT and ICT, Water and Environment, Oil and Gas, Earthquake, Electronics, Nano Biochemistry, Transportation, Data Science and AI, Entrepreneurship and Innovation, Biotechnology and Biomedical Engineering.\nThe initiative has been launched with the aim of capacity building and nurturing the young generation for the development of science, technology, and innovation in line with the values and needs of Islamic society.\nThe program provides short-term fellowships to young scholars, technologists, and faculty members under 40 years of age. About the eligibility, the official informed that the applicants must hold at least a Master’s degree.\nThe duration of fellowships in this program is 6-12 months, which can be more or less depending on the conditions and requirements, with the agreement of the host.\nThe fellowship opportunity will help the fellows get acquainted with novel scientific and technological achievements in the Islamic world; share capacities and exchange new findings through networking and streamlining, and strengthen international relations to help develop science and technology.\nThe initiative is also aimed at deepening and institutionalizing international communications and collaborations; improving the quality of researchers’ studies, expanding the border of knowledge, and helping to solve important scientific and technological challenges of the Islamic countries through the achievements made by international cooperation.\nAbout the application and evaluation process, the official informed that the applicants can apply online through the website: ysfp.mstfdn.org.\nThe primary evaluation of applicants is based on the information provided in the application form and attached documents, including education, research, teaching, grants, awards and honors, academic and professional activities, achievements, etc.\nThe applicants, who have a background of cooperation with Mustafa (peace be upon him) Prize Laureates as well, and winners of the KANS Scientific Competition, shall benefit from an extra score in the evaluation.\nThe applicants are ranked taking into account all the indicators and scores, the top of whom pass the secondary evaluation and a short list of eligible applicants is provided to the host for final review and selection.The candidates can apply online through the website www.ysfp.mstfdn.org.",
  "retrievedAt": "2025-08-11T05:04:26.704Z"
}
