{
  "title": "BISP introduces new banking model to ensure transparency in payments: Rubina Khalid",
  "link": "https://www.app.com.pk/national/bisp-introduces-new-banking-model-to-ensure-transparency-in-payments-rubina-khalid/",
  "date_published": "2024-08-27T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP):Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid Tuesday said that a new banking model has been introduced for the transparent payment of funds to deserving women.\nThis new banking model has been introduced to ensure transparency in payments of funds following the instructions of the President Asif Ali Zardari.\nSenator Rubina Khalid was speaking while giving a briefing to the Governor of Khyber Pakhtunkhwa, Faisal Karim Kundi on ongoing and newly introduced initiatives under the program.\nShe explained that BISP management is consulting with the State Bank of Pakistan to minimize human intervention, ensuring that women receive their funds without any deductions.\nSenator Rubina Khalid mentioned that savings accounts are being opened for deserving women through the BISP Savings Scheme, allowing aid money to be directly transferred into their accounts.\nShe also highlighted a new initiative under BISP, which involves a skill development program for deserving women and their family members.\nThis program will provide training in technical skills according to international standards, enabling them to improve their quality of life and contribute to the country’s economy.\nShe expressed that this initiative would help them graduate from poverty, thereby allowing more deserving families to benefit from the program.\nSpeaking on the occasion, Governor KP, Faisal Karim Kundi, stated that the BISP is the largest social safety net aimed at the welfare of the poor in Pakistan.\nHe emphasized the need to establish BISP offices at the Union Council level to enhance public services.\nHe also suggested deploying mobile registration vans in remote areas of Khyber Pakhtunkhwa to ensure that deserving women are registered in the program.\nKundi highly appreciated the skill development program and noted that it would promote human resource development, providing employment opportunities abroad for those who complete the training.\nHe also emphasized the importance of an awareness campaign to highlight the positive impact of the BISP.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:04:24.264Z"
}
