{
  "title": "Four reports laid in Senate, two bills referred to committees",
  "link": "https://www.app.com.pk/national/four-reports-laid-in-senate-two-bills-referred-to-committees/",
  "date_published": "2024-08-27T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP):The Senate on Tuesday witnessed presentation of four reports while two government bills were referred to the relevant committees after their introduction in the House.\nMinister for Finance and Revenue, Senator Muhammad Aurangzeb moved The Banking Companies (Amendment) Bill, 2024 which was referred to the committee concerned for further deliberations.\nThe Finance Minister also moved the second bill titled The Deposit Protection Corporation (Amendment) Bill, 2024 which was also referred to the committee concerned for further deliberations.\nThe House also approved the bill to amend the Elections (Amendment) Bill, 2024, as reported by the Standing Committee, which was moved by0 Minister for Parliamentary Affairs, Senator Azam Nazeer Tarar. The Minister informed that it was not a major amendment into the legislation but rather a correction of the nomenclature of “disqualified” which was notified by Senator Humayun Khan Mohmand.\nMeanwhile, Chairperson, Standing Committee on Federal Education and Professional Training, Senator Bushra Anjum Butt presented report of the Committee on the Bill to provide for the establishment of Wapda University Islamabad [The Wapda University Islamabad Bill, 2024], introduced by Senators Fawzia Arshad, Rana  Mahmood ul Hassan and Umer Farooq on 26th February, 2024.\nChairman Standing Committee on Communications, Senator Pervaiz Rashid presented report of the Committee on the National Highways Safety (Amendment) Bill, 2024, introduced by Senator Mohsin Aziz on 29th April, 2024.\nThe Chairman Standing Committee on Communications also presented report of the Committee on the subject matter of a Calling Attention Notice moved by Senators Jam Saifullah Khan, Zamir Hussain Ghumro, Muhammad Aslam Abro, Poonjo Bheel, Syed Kazim Ali Shah and Qurat-Ul-Ain Marri regarding inordinate delay in the completion of Sukkur-Hyderabad Motorway Project.\nMinister for Law and Justice and Parliamentary Affairs, Senator Azam Nazeer Tarar on behalf of Minister for Establishment Division, Senator Ahad Khan Cheema presented the Annual Report of the Federal Public Service Commission for the Year 2022.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:03:39.879Z"
}
