{
  "title": "River Indus continues to flow in medium, low flood: FFC",
  "link": "https://www.app.com.pk/national/river-indus-continues-to-flow-in-medium-low-flood-ffc-3/",
  "date_published": "2024-08-27T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP):The Federal Flood Commission (FFC) has said that except for River Indus which is flowing in “Medium Flood” in Sukkur-Kotri reach and in “Low Flood” at Guddu Barrage, all other major rivers of the Indus River System i.e. Jhelum, Chenab, Ravi and Sutlej including River Indus in Tarbela-Taunsa reach are discharging normal flows.\nAccording to daily FFC report on Tuesday, Tarbela reservoir is maintaining its Maximum Conservation Level (MCL) of 1550 feet for the last nine. In contrast, Mangla reservoir is currently at an elevation of 1217 feet, which is 25 feet below its MCL: 1242 feet.\nAccording to Flood Forecasting Division (FFD), Lahore, yesterday’s depression over Southeastern Rajasthan (India) has intensified into deep depression and has shifted South-Southwestwards, now positioned over North Gujarat (India).\nAnother low-pressure Area over Jharkhand (India) is expected to impact central parts of Pakistan starting from 30th August 2024. Trough of Westerly Wave is persisting over Northeastern Afghanistan while Seasonal Low lies over North-Western Balochistan.\nLight to moderate moist currents from the Bay of Bengal were penetrating into upper catchments of all major rivers while strong moist currents from the both Bay of Bengal and Arabian Sea were penetrating into Southern Sindh and adjoining areas up to 10,000 feet.\nFor the next 72 hours, FFD, Lahore has predicted scattered thunderstorm rain of Moderate Intensity with isolated Heavy Falls over Islamabad, Punjab (Rawalpindi, Sargodha, Gujranwala, Lahore, Faisalabad & Sahiwal Divisions) and Khyber Pakhtunkhwa including upper catchments of all major rivers of IRS.\nDuring the same period, widespread thunderstorm rain of Heavy to Very Heavy intensity with isolated Extremely Heavy Falls may occur over Southern Punjab (D.G. Khan, Multan & Bahawalpur Divisions), Sindh and Balochistan (Zhob, Loralai, Sibbi, Nasirabad, Kalat & Makran Divisions).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:03:40.458Z"
}
