{
  "title": "Pak-Oman BPC review bilateral cooperation",
  "link": "https://www.app.com.pk/national/pak-oman-bpc-review-bilateral-cooperation/",
  "date_published": "2024-08-27T16:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): The 8th session of Pakistan-Oman Bilateral Political Consultations (BPC) held in Muscat on Tuesday comprehensively reviewed all aspects of bilateral cooperation including political relations, trade and investment, security and defence, culture, health and consular matters.\nAdditional Foreign Secretary (Middle East), Ambassador Shehryar Akbar Khan and the Chief of GCC and Regional Neighborhood Department, Ambassador Sheikh Ahmad bin Hashil bin Rashid Al Maskari of Foreign Affairs of the Sultanate of Oman, led their respective sides, Foreign Office Spokesperson said in a press release.\nThe BPC also discussed Pakistan-Oman cooperation at multilateral fora.\nNoting the importance of Joint Ministerial Commission, the two sides agreed to hold the 8th session at an early date in Islamabad.\nThe two sides also agreed to further elevate bilateral trade volume and to enhance investment cooperation.\nThe Omani side was invited to invest in agriculture, minerals and Information Technology under the Special Investment Facilitation Council (SIFC).\nThe Omani side expressed support for the First Pakistani Business Expo to be held in Muscat on 13-14 October 2024. It also welcomed Pakistan’s decision to give visas on arrival to Omani nationals.\nRegional and global matters of mutual concern were also discussed.\nAdditional foreign secretary (Middle East) appreciated the Sultanate of Oman for its persistent and principled support on the Jammu and Kashmir dispute.\nThe two sides also expressed serious concerns on Israel’s war on Gaza and the genocide of the Palestinian people.\nThey stressed the need for an urgent and unconditional ceasefire and reiterated the call for the creation of a viable, sovereign and contiguous State of Palestine.\nThe Pakistani delegation also called on the Under Secretary for Diplomatic Affairs, Sheikh Khalifa bin Ali bin Issa Al-Harthy.\nThe under secretary shared Oman’s desire to further strengthen Pakistan-Oman relations and to advance bilateral dialogue and cooperation.\n“The Bilateral Political Consultations are an important dialogue mechanism between Pakistan and Oman to comprehensively review bilateral relations and to explore new areas of cooperation to further solidify the historic and strategic ties between the two countries,” it was added.",
  "retrievedAt": "2025-08-11T05:02:52.460Z"
}
