{
  "title": "OIC moot to adopt clear strategy on humanitarian crisis in Afghanistan",
  "link": "https://www.app.com.pk/national/oic-moot-to-adopt-clear-strategy-on-humanitarian-crisis-in-afghanistan/",
  "date_published": "2021-12-16T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Assistant Secretary General of the Organization of Islamic Cooperation Tariq Ali Bakheet Thursday said that the upcoming extraordinary session of the OIC Council of Foreign Ministers would play a key role to cope with the humanitarian crisis in Afghanistan.\nTalking to media, the assistant secretary general said the session, to be held on December 19, would adopt a clear strategy to deal with prevailing humanitarian situation in the war-torn country.\nHe said the OIC moot would adopt a very important comprehensive resolution as the forum was resolved to support the Afghan people in this critical time.\nHe said the conference was going to give the OIC a leading role in helping the Afghan people in order to alleviate their sufferings in terms of humanitarian and medical supplies and assistance in all forms.\nBkaheet said the OIC was going to mobilize its all financial institutions and member states to get more resources to support the country.\nAbout Pakistan’s role toward peace and stability in Afghanistan, the OIC Assistant Secretary General said Pakistan was the founding member of the OIC. The country played a very important role for solidarity of the Muslim Ummah.\nHe said Pakistan’s offer to host this meeting was a clear testimony to its commitment to Islamic solidarity.\nHe said Pakistan is also committed to regional security and international security.\nHe also thanked the Government of Pakistan for making good arrangements to host the moot.\nThe Assistant Secretary General said the OIC had already adopted multiple resolutions at the ministerial of heads of state level.\nThis session has been convened to adopt a clear strategy on the humanitarian situation in Afghanistan which would ultimately help address the sufferings of the Afghan people, he added.",
  "retrievedAt": "2025-08-11T21:43:18.928Z"
}
