{
  "title": "APS Martyrs – “I will never let down the survivors & parents of martyred children”: Imran Khan",
  "link": "https://www.app.com.pk/national/aps-martyrs-i-will-never-let-down-the-survivors-parents-of-martyred-children-imran-khan/",
  "date_published": "2021-12-16T06:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Prime Minister Imran Khan Thursday vowed zero-tolerance against violence and those using it as a tool and said he would never let down the survivors and parents of the children of the Army Public School, martyred in a terrorist attack in 2014, in Peshawar.\nOver 140 people including 132 children were martyred in the terrorist attack, sending the nation in a shock.\n“There is zero tolerance for violence & those using it as a tool,” the Prime Minister said.\nThe Prime Minister in a separate message on the day said when the terrorists attacked and martyred the innocent, defenceless future of the nation brave Army Public School teachers stood like a bulwark against the enemy to protect their students and laid down their lives.\nThe Prime Minister said, “time has proved that terrorism has no religion or nation. There is in fact, a nefarious political design behind it which can even target youngest children.”\nHe said, “the sacrifices of the martyrs of the Army Public School will not go in vain.”\nPrime Minister Imran Khan said following the tragedy, the morale of the brave Pakistani nation rose higher as they expressed their firm resolve against terrorism. The whole nation, he said, stood united and under the National Action Plan the enemies were targetted in their hideouts.\n“Today, I assure the entire nation that the enemy can never demoralize the Pakistani nation.”\nWhenever the evil elements tried to challenge the courage and fortitude of the nation, they were defeated, the Prime Minister remarked.\n“Let us pledge today that the whole nation stands united against those who spread sectarian, religious and ethnic prejudices, those who spread separatism and those who use such tactics to fulfil their nefarious political ambitions.”\nHe said the nation by identifying such elements, can help the State work better towards their elimination.\nThe Prime Minister prayed to Allah Almighty to shower his blessings on the martyrs of APS Peshawar and for the courage to their parents to bear this irreparable loss. He recalled the saying of Quaid-e-Azam Muhammad Ali Jinnah that “There is no power on earth that can undo Pakistan.”",
  "retrievedAt": "2025-08-11T21:43:21.659Z"
}
