{
  "title": "Ashrafi stresses implementing NAP for eradicating plaques being confronted by the country",
  "link": "https://www.app.com.pk/national/ashrafi-stresses-implementing-nap-for-eradicating-plaques-being-confronted-by-the-country/",
  "date_published": "2021-12-16T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP):Special Representative to the Prime Minister on Religious Harmony and Middle East Hafiz Tahir Mehmood Ashrafi Thursday said the solution to national issues and terrorism eradication lies in implementing National Action Plan (NAP) in true letter and spirit.\nTalking to media, flanked by Christian leaders and notables, he said the government was working to review the National Action Plan as the Prime Minister had already held a meeting in that regard.\nThe previous government used National Action Plan (NAP) only for removal of speakers from mosques, he said adding that the incumbent government would bring major changes in the NAP to eradicate extremism and terrorism from the country.\nHe said the every one living in Pakistan and following country’s law were equal citizens and enjoyed equal rights. He added that the non-muslim communities were not alone and as a majority all muslims would stand with them at every forum. No one would be allowed to take the law in their own hands and use the law to serve their own interest and if someone committed blasphemy, he should file case and lodge FIR, and leave the rest to law of the land.\nAs many as 137 blasphemy complaints were received during the current year which were duly addressed and resolved. He appreciated the political parties’ stance to not to allow the repeat of the Sialkot incident in future and showed solidarity with the non muslim community.\nHe said there was propaganda against the blasphemy law which saved the lives of various people. Ashrafi said today (Dec 16) was the day for the nation to move forward unitedly and make commitment to serve and defense the country. He said the government had provided relief not only to non muslims but also Masajid and seminaries.\nTahir Ashrafi said today was the anniversary of the Army Public School, Peshawar tragedy and as the nation was united on the tragedy, so did the national unity demonstrate on the Sialkot tragedy.“We were starting with the determination that Pakistan belongs to all irrespective of his or her affiliation or beliefs”, he added.",
  "retrievedAt": "2025-08-11T21:43:17.995Z"
}
