{
  "title": "Pakistan envoy presents credentials to Governor-General of Commonwealth of Bahamas",
  "link": "https://www.app.com.pk/national/pakistan-envoy-presents-credentials-to-governor-general-of-commonwealth-of-bahamas/",
  "date_published": "2021-12-16T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Ambassador of Pakistan to the United States of America Dr. Asad Majeed Khan presented his credentials to Governor-General of the Commonwealth of the Bahamas Cornelius A. Smith as non-resident High Commissioner of Pakistan at a virtual ceremony.\nHigh Commissioner Asad Majeed Khan, in his remarks, conveyed the greetings and good wishes of the president and prime minister of Pakistan to the leadership and people of the Commonwealth of the Bahamas.\nHe emphasized that Pakistan’s focus was shifting from geo-politics to geo-economics.\nHe expressed Government of Pakistan’s desire of enhancing trade and economic relations, tourism cooperation and people to people exchanges with the Commonwealth of the Bahamas.\nThe high commissioner highlighted that the Pakistan and Bahamas shared concerns on global impacts of climate change and the two countries should collaborate to counter its effects.\nHe also reaffirmed Pakistan’s commitment to working with Bahamas at various multilateral fora including the United Nations, Commonwealth and G77 on issues of common interest.\nGovernor General Cornelius A. Smith felicitated High Commissioner Khan and extended greetings to the leadership and people of Pakistan.\nAppreciating Pakistan’s efforts to control climate change, he stated that climate change was one of the biggest challenges for small island states like Bahamas.\nHe stated that the Government of Bahamas looked forward to strengthening its relations with Pakistan in the fields of trade, economics, education, health, sports and tourism. He assured full cooperation of his government in this regard.\nHigh Commissioner Khan also extended invitation to the Governor General on behalf of President of Pakistan Dr Arif Alvi to visit Pakistan at his earliest convenience, which the governor general accepted.",
  "retrievedAt": "2025-08-11T21:43:13.161Z"
}
