{
  "title": "Delay in review of sanctions on Afghanistan may undermine anti-terrorism, trafficking objectives: Qureshi",
  "link": "https://www.app.com.pk/national/delay-in-review-of-sanctions-on-afghanistan-may-undermine-anti-terrorism-trafficking-objectives-qureshi/",
  "date_published": "2021-12-16T13:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Minister for Foreign Affairs Shah Mahmood Qureshi said that the sanctions and assets freeze had crippled the banking system of Afghanistan, impeding transfer of funds for humanitarian purposes.\n“A review and reconsideration of sanctions is essential to save lives, enable basic services and maintain a modicum of public governance. Delays may result in unintended risks of the financial system falling into unregulated money exchanges. Such a scenario may undermine our shared objectives of countering terrorism and trafficking,” the foreign minister said in his article published in Khaleej Times.\nThe freeze of assets had also hampered the payment of salaries of workers in critical sectors such as public services, education and health.\nHe said the humanitarian supplies in Afghanistan faced logistical challenges due to harsh winter and remoteness.\nA fragile governance structure, severe liquidity shortage and financial sanctions present a clear and present danger of an economic meltdown in Afghanistan. The resultant human suffering, while likely, can and should be avoided, he added.\n“The people of Afghanistan need urgent attention. The humanitarian calamity afflicting Afghanistan is perhaps the worst in the world today. The UN system, which has decades of experience in analysing and managing humanitarian emergencies, has sounded alarm bells,” he remarked.\nUN Secretary-General António Gutteres has called for a “lifeline” to millions of vulnerable Afghans “who face perhaps their most perilous hour”, after decades of war and insecurity. Despite the grim prospects, this calamity is preventable.\n“Thanks to the generosity of many donors, the United Nations system, international organisations and humanitarian agencies have helped mobilise and supply critical food, medicines and other life-saving supplies,” Qureshi said.\nHe said despite modest resources and financial constraints, Pakistan was providing humanitarian support of over $30 million; provided air and land bridge for humanitarian supplies; and facilitated transit trade and cross border movement of Afghans in need.\n“And yet much more in humanitarian and other assistance is needed,” he remarked.\nThe UN estimates that over half-a-million Afghans are internally displaced. Nearly 22.8 million Afghans face acute food insecurity. According to the World Food Programme, “this winter, millions of Afghans will have to choose between starvation or migration”. Media reports indicate that Afghans, in their thousands, are trying to leave. It is a race against time!\nThe cumulative effects of a protracted conflict, prolonged drought in rural areas, disruption in economic activity in urban areas and the compounding socio- economic impacts of Covid-19 have resulted in serious hardships for the people of Afghanistan.\nThe foreign minister said it was not the time to abandon the people of Afghanistan. Giving in to the temptation to ‘move on’ from Afghanistan would be catastrophic. It would lead to exactly what the international community wants to avoid, an exodus, further instability and conflict, and the specter of terrorism emanating from the country.\n“The international community has legitimate anxiety over the state of human rights and the nature of power sharing in Afghanistan. These concerns should be addressed in all their dimensions; civil, political, social, economic and cultural,” Qureshi wrote.\nHe said helping Afghans inside the country was also a cost effective and a durable solution which requires to not just think of few but all.\nHe said the ordinary Afghans are neither responsible for the failures of their former rulers nor should they be penalized for the recent turn of events in the country.\nAmidst this crisis lies an opportunity to chart a path for Afghanistan that advances peace, security, development and human rights in mutually reinforcing ways.\nSuch a pathway requires prudent sequencing and prioritisation of actions. The pace of political and diplomatic engagement needs to be enhanced, in tandem with humanitarian and economic assistance.\nThat is why Pakistan is hosting an Extraordinary Session of the OIC Council of Foreign Ministers in Islamabad on December 19, 2021, to show solidarity with the Afghan people, and to help establish an effective channel for coordinated provision of humanitarian assistance to Afghanistan.\nAs the second largest intergovernmental organisation after the United Nations, the OIC is well-positioned to lead the way in helping the Afghan people. Pakistan hopes that the OIC member states and the international community will extend all possible support to the Afghan people in this hour of dire need.\n“We face a proverbial stitch in time saves nine situations in Afghanistan. We cannot afford to wait. The world must act, and act now,” Qureshi concluded.",
  "retrievedAt": "2025-08-11T21:43:16.419Z"
}
