{
  "title": "Rescue employees service structure in few days: CM Buzdar",
  "link": "https://www.app.com.pk/national/rescue-employees-service-structure-in-few-days-cm-buzdar/",
  "date_published": "2020-09-07T06:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 07 (APP):Punjab Chief Minister Sardar Usman Buzdar Monday announced notifying the service structure for the rescue employees within a few days.\nHe was addressing the inaugural ceremony of one of the five newly built rescue stations in Lahore, to ensure provision of timely emergency services to the residents of the expanding city.\nHe inaugurated the Harbanspura Rescue Station, built on the request of the Lahore Press Club president. Five new rescue stations have been built in Lahore including the Harbanspura, Walled City, Shadbagh, Maraka and Kot Abdul Malik rescue stations.\nThe chief minister said that the allowances of rescue staff deducted earlier would also be restored. He also announced that the fixed daily allowance of rescuers would be increased as per the analogy of police, and directed the additional chief secretary (Home) Punjab to implement that as early as possible.\nPunjab Law Minister Raja Basharat, Senior Minister Abdul Aleem Khan, Additional Chief Secretary (Home) Momin Agha, Secretary Information Raja Jahangir, Director General Punjab Emergency Service Dr Rizwan Naseer, Commissioner Lahore Zulfiqar Ghumman and Deputy Commissioner Danish Afzal, Regional and District Emergency Officers Rescue 1122 Lahore, Senior Officers from Rescue Headquarters and Academy, LPC president, and a large number of rescuers and residents of Harbanspura attended the ceremony.\nThe chief minister said the Punjab government had approved 76 new rescue stations across the province after which emergency services would be available in all tehsils of Punjab without discrimination in case of any accident, emergency or disaster. The Motorbike Ambulance Service would also be established in all districts of Punjab.\nThe CM congratulated the residents of journalist colony and Harbanspura over establishment of new rescue station in their area.\nHe also congratulated LPC President Arshad Ansari, who identified the need for rescue services and requested for establishment of a rescue station at Harbanspura. He appreciated the Communication & Works Department for the construction of all rescue stations in Punjab.\nAddressing the inaugural ceremony, the Punjab CM said that rescue service was a pride for the government. The lifesaving service was our pride and a ray of hope for the public. The services of rescuers are appreciated across Punjab. Rescue-1122 always remains available in case of emergencies and disaster whether it’s a flood, fire incidents, building collapse, bomb blast or corona, the department always timely responds to emergencies and helps the victims.\nThe Punjab CM said: “When I chaired the first meeting of the Punjab Emergency Council, I was briefed that it is being conducted after 15 years, though that was mandatory to address the rescue issues like service structure, regularisation and allowances.”\nEarlier, DG Rescue Punjab Dr Rizwan Naseer briefed the CM that the PES rescued over 8.4 million, saved over Rs 450 billion due to timely response and professional management of over 150,000 fire incidents, and became the first United Nations INSARAG Classified Team in South Asia. He said that due to his current team, the PES had gained professional capacity to respond to disasters like the 2005 earthquake, etc.\nBesides, over one million rescue scouts have been trained across Punjab and during coronavirus pandemic, rescuers provided services in shifting of patients, hospitals, disinfection and burials.\nRescuers and rescue scouts (volunteers) demonstrated lifesaving skills at the newly established station.",
  "retrievedAt": "2025-08-11T19:46:39.279Z"
}
