{
  "title": "Govt utilizing all out efforts to tackle with Covid-19 pandemic, its impact",
  "link": "https://www.app.com.pk/national/govt-utilizing-all-out-efforts-to-tackle-with-covid-19-pandemic-its-impact/",
  "date_published": "2020-09-07T08:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP): Director General National Commission for Human Development (NCHD) Hassan Baig said on Monday the government is utilizing all out efforts to tackle with the Covid-19 pandemic and its impact especially providing essential health services to the vulnerable and needy and protecting health systems.\nWhile addressing in senior management meeting here he said the govt had also launched multi-sectoral initiatives to mitigate the effects of this pandemic on economy, livelihoods and other sectors.\nHe said donors, UN agencies, International and national humanitarians actors/NGOs supported well to the government of Pakistan in the stern situation.\nDG NCHD said that, it is important to have situation analysed by conducting a comprehensive assessment analysis as that will help government and humanitarian agencies in understating the overall impact and the proportion of population at risk.\nThe assessment will provide the knowledge about the extent of vulnerability across geographics and various demographics, he further added. In addition it will give a look into the level at what humanitarian organizations and government authorities are responding to the pillars identified in National Action Plan (NAP) for the pandemic, he informed.\nWhile elaborating the statistics he said report of IMF projects that 40 percent of Pakistanis are living below the poverty line in COVID-19’s viral wake. Nearly 22 million children are now out of school, while 17 million children under five are missing routine vaccinations.\nAn additional 2.45 million people—beyond an existing 40 million—now suffer food insecurity, the study finds. Real GDP growth is expected to slow due to downturns in services and manufacturing.\nAgriculture had also lagged down due to lockdowns and disrupted needed transportation, logistical support, labor, and access to inputs for the next planting season, he briefed.\nThe commission which is mandated with the role to support and augment human development across the country had inked an MOU with Islamic Rescue Committee (IRC-IVAP) to conduct Coordinated Gap Analysis (CGA) at national level in the four provinces and federal capital (Khyber Pakhtunkhaw, Punjab, Sindh, Balochistan and ICT).\nThis analysis will provide an understanding how, why and the context in which humans and communities respond allows to anticipate unwanted scenarios and initiate mitigating measures.\nSecondly, the analysis will generate information that will become evidence for strategic planning, program implementation and response monitoring during COVID-19 outbreak. NCHD being the implementer will conduct this analysis in 41 districts covering 16,400 households.\nDG NCHD Hassan Baig further stressed that premeditated, strategic and joint efforts are required to mitigate the impact of COVID-19 on social, economic and fiscal scenario.",
  "retrievedAt": "2025-08-11T19:46:45.819Z"
}
