{
  "title": "CM reviews steps taken for agriculture sector",
  "link": "https://www.app.com.pk/national/cm-reviews-steps-taken-for-agriculture-sector/",
  "date_published": "2020-09-07T06:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 07 (APP):Punjab Chief Minister Sardar Usman Buzdar chaired a meeting\nin his office on Monday to review steps taken for the provision of facilities to the farmers and development of the agriculture sector.\nSecretary agriculture department gave a briefing about the departmental performance and facilities provided to the farmers, says a handout.\nThe CM expressed his displeasure over delay in some measures relating to the provision of facilities to farmers. The agriculture department has conducted only meetings during the two years and practical progress in the provision of facilities to farmers was negligible, the CM regretted.\nHe said that durable steps would have to be taken immediately by discontinuing\nthis practice and he would personally visit the agriculture department.\nHe added further delay in the adoption of steps aimed at provision of facilities to farmers would not be tolerated as the agriculture sector was the linchpin of the national economy. The agriculture sector has a lot of potential and there was no justification of the delay.\nThe department was needed to improve its performance, he stressed.\nThe chief minister directed to devise a comprehensive plan to harmonize the agriculture department with the latest needs as the provision of facilities to the farmers was the fundamental duty of this department.\nHe directed that legal aspects be given due attention in the procurement of bulldozers and a special technical committee be constituted. Similarly, reforms be introduced to run Punjab Seed Corporation as a modern corporate entity. Active personalities should be included in the PSC board, he directed.\nSimilarly, Ayub Research Institute and other such institutions were needed to give proper attention to Agri research as we can deal with new challenges by modernizing the Agri research sector according to the latest needs, the CM added.\nPunjab was an agrarian province and the development of its agriculture sector would strengthen the national economy. “I will personally monitor the progress made on various schemes of the agriculture department from now onwards,” the CM remarked .\nAgriculture minister Nauman Langrial, Adviser Dr Salman Shah, ACS (Agriculture)\nand others attended the meeting.",
  "retrievedAt": "2025-08-11T19:46:39.310Z"
}
