{
  "title": "Pakistan to ‘voluntarily’ restore one million hectares of degraded land under Bonn Challenge: Amin Aslam",
  "link": "https://www.app.com.pk/national/pakistan-to-voluntarily-restore-one-million-hectares-of-degraded-land-under-bonn-challenge-amin-aslam/",
  "date_published": "2020-09-07T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 07 (APP): Pakistan has decided to enter into the Bonn Challenge 2030, a global environmental restoration endeavor under which globally 350 million hectares of degraded and deforested land would be restored by 2030 through afforestation activities.\nThe press statement issued here on Monday stated that as a part of the global effort, one million hectares of degraded/deforested lands in different parts of the country would be restored, revealed Malik Amin Aslam, Prime Minister’s Special Assistant on Climate Change,\n“We have decided to join the daring global movement of the Bonn Challenge 20230 and are going to offer volunteer commitment of restoring one million hectares of degraded and deforested landscapes through national afforestation and environmental restoration programmes and activities,” Malik Amin Aslam said.\nHe said that the present government is implementing world-acclaimed programmes and projects including Ten Billion Tree Tsunami Programme, Protected Areas Initiative, Clean Green Pakistan Initiative and Recharge Pakistan, which are all together geared towards achieving Pakistan’s pledge of restoring one million hectares of degraded and deforested landscaps as a part of the Prime Minister Imran Khan’s vision for Clean and Green Pakistan.\nHe hoped that first such a national-level effort for restoring degraded and deforested landscapes would not only help stem biodiversity loss but also address various environmental challenges including land erosion, soil erosion, silting of rivers and soil infertility and contain growing food insecurity.\nThe Bonn Challenge 2020 target of restoring 150 million hectares degraded and deforested landscapes globally was launched at a high level event in Bonn in 2011 organized by the Government of Germany and IUCN.\nLater, it was endorsed and extended to 2030 by the New York Declaration on Forests of the 2014 UN Climate Summit. To date, 63 governments, private associations and companies have pledged over 172 million hectares to the Challenge.\nThe Bonn Challenge is, in fact, an implementation channel for national priorities such as water and food security and rural development while simultaneously helping countries contribute to the achievement of international climate change, biodiversity and land degradation commitments.\nThe first phase of the Bonn Challenge 2020 has already achieved the milestone of restoring the150 million hectares of degraded and deforested landscapes throughout the world in 2017.\nMalik Amin Aslam, who has remained instrumental behind the global movement of the Bonn Challenge, said that restoration of 150 million hectares of degraded and deforested lands in bio mes around the world under Bonn Challenge 2020 created around US$ 84 billion per year in net benefits that brought additional income opportunities for rural communities.\nAround 90 percent of this value is potentially trade able, meaning that it encompasses market-related benefits, he added.\nHowever, achieving the 350-million hectare goal under the Bonn Challenge 2030 aims to generate about US$ 170 billion per year in net benefits from watershed protection, improved crop yields and forest products, and could sequester up to 1.7 giga tonnes of carbon dioxide equivalent annually.\nSharing details of Pakistan’s commitment for the Bonn Challenge 2020 and its achievement, the prime minister’s special assistant Malik Amin Aslam said recalled that during the first phase of the Bonn Challenge 2020, Pakistan had voluntarily pledged to restore 0.35 million hectares of degraded and deforested landscapes in Khyber-Pakhtunkhwa province, which was surpassed thanks to the launch and successful implementation of the globally-acclaimed Billion Tree Tsunami Programme (BTTP).\nSpecial Assistant to Prime Minister, Malik Amin Aslam, whose BTTP was the brainchild, believes that Pakistan’s joining of the Bonn Challenge 2030 demonstrate Pakistan globally as an environmentally-responsible country and committed to tackling of the urgent issue of land degradation and deforestation, which affects over 3 billion people and over 30 per cent of Earth’s arable land.\n“We can address the challenge of restoring 350 million hectares of degraded and deforested land globally this by working together with countries, organizations and private entities worldwide by acting strongly and achieve together with other countries the ambitious target of the Bonn Challenge 2030,” he emphasized.\nMalik Amin said further that joining the Bonn Challenge movement would also help Pakistan align its climate, afforestation, environmental and biodiversity conservation programmes and actions with the UN-led Sustainable Development Goals (SDGs), the Aichi Biodiversity Targets, the Land Degradation Neutrality (LDN) goal and the Paris Climate Change Agreement, which all together provide a road map for a sustainable planet.\nHe cautioned that while the Bonn Challenge 2030 is a stern challenge, building global political support for restoration, providing policy and technical support are inevitable for the implementation of Bonn Challenge commitments in countries around the world.",
  "retrievedAt": "2025-08-11T19:46:42.620Z"
}
