{
  "title": "394 new coronavirus cases reported; tally reaches 6,542",
  "link": "https://www.app.com.pk/national/394-new-coronavirus-cases-reported-tally-reaches-6542/",
  "date_published": "2020-09-07T07:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 07 (APP): The total active COVID-19 cases in Pakistan on Monday were recorded 6,542 as 394 more people tested positive for the deadly virus during the last 24 hours.\nThree corona patients, who were under treatment in hospitals, died on Sunday, according to the latest update issued by the National command and Operation Centre (NCOC).\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan, while 87 ventilators elsewhere in Pakistan, out of 1920 allocated for COVID-19 patients, were occupied.\nSome 20,980 tests were conducted across the country on Sunday, including 8,999 in Sindh, 6,378 in Punjab, 2,560 in Khyber Pakhtunkhwa (KP), 2,274 in Islamabad Capital Territory (ICT), 271 in Balochistan, 209 in Gilgit Baltistan (GB), and 289 in Azad Jammu and Kashmir (AJK).\nAround 286,016 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic spread, a total of 298,903 cases were detected so far, including AJK 2,331, Balochistan 13,292, GB 3,008, ICT 15,750, KP 36,625, Punjab 97,226 and Sindh 130,671.\nAbout 6,345 deaths were recorded in country since the eruption of the contagion, including 2,423 in Sindh, one of them on Sunday, 2,210 in Punjab, two of them on Saturday,1,255 in KP, 176 in ICT and one of them died in hospital on Sunday, 145 in Balochistan, one of them on Sunday, 71 in GB, and 65 in AJK.\nA total of 2,778,689 corona tests have been conducted so far, while 735 hospitals are equipped with COVID facilities. Some 1,050 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T19:46:47.647Z"
}
