{
  "title": "Thousands rally in Malaysia to call for PM Anwar’s resignation - World - DAWN.COM",
  "author": null,
  "content": "Thousands of people rallied in the Malaysian capital on Saturday to demand the resignation of Prime Minister Anwar Ibrahim, as public discontent grows over rising living costs and allegations of failing to deliver promised reforms.\n\nProtesters — mostly wearing black t-shirts and bandannas carrying the slogan “Turun Anwar”, or “Step Down Anwar” — marched through the heart of Kuala Lumpur, before converging in the city’s Independence Square to hear speeches by top opposition leaders.\n\nPolice estimated at least 18,000 were in attendance.\n\nAnwar, who campaigned on a reformist platform before taking office in November 2022, has faced criticism over measures aimed at boosting government revenue, including an expanded sales and services tax and subsidy adjustments that some fear could lead to a spike in consumer prices.\n\nThe premier this week announced a cash handout, increased aid for poor households and a pledge to lower fuel prices, in a bid to quell worries over rising costs.\n\nProtester Nur Shahirah Leman, 23, a member of an Islamic students’ group, said she was worried that new taxes as well as higher electricity tariffs imposed on large businesses would eventually be passed down to consumers.\n\n“These taxes are levied on manufacturers, so it would automatically affect the prices of food,” she said.\n\nAnwar has also faced claims of judicial interference and doubts over his commitment to anti-corruption efforts, after prosecutors dropped graft charges against several figures allied to the government and following a recent delay in the appointment of the country’s top judges.\n\nAnwar has repeatedly denied interfering in the courts.\n\nFormer prime minister Mahathir Mohamad, who turned 100 this month, joined the rally and accused Anwar of misusing his position to prosecute political rivals, charges the premier has previously rejected.\n\n“Those who are innocent are charged, those who have done wrong are let go,” Mahathir told the crowd. Mahathir and Anwar, his former protégé-turned-rival, have been locked in an intense feud that has dominated Malaysian politics for nearly three decades.\n\nThe pair mended fences to oust the long-ruling Barisan Nasional government in 2018, but their coalition collapsed in less than two years amid infighting.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2621591124e1bb3.jpg",
  "retrievedAt": "2025-08-17T21:21:57.170Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926753/thousands-rally-in-malaysia-to-call-for-pm-anwars-resignation",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T17:15:57.000Z"
}
