{
  "title": "Police in terrorists’ crosshairs - Pakistan - DAWN.COM",
  "author": null,
  "content": "ACCORDING to the Global Terrorism Index 2025, the number of terrorist attacks on police in Pakistan in 2024 exceeded those on any other law-enforcement agency — civil or military.\n\nAs per PIPS, an independent Islamabad-based think tank, in 2024, terrorists martyred 140 policemen, 124 army officials, 78 FC and 13 Levies personnel. This recent shift in the terrorists’ targeting strategy, with greater emphasis on attacking police, indicated that to ensure public security, police capabilities must be enhanced, particularly in the two worst-affected provinces — KP and Balochistan — where almost 90 per cent of terrorist attacks and police deaths took place.\n\nAn analysis of the recent upsurge in terrorist attacks against police reveals three broad dimensions. Firstly, the steep increase in attacks has been going on consistently since 2020. In KP and Balochistan, these rose exponentially from 61 in 2020 to 416 in 2024 — almost 600pc. Secondly, the police targets hit by terrorists are many.\n\nFor instance, in KP, in 2024, the attacks ranged from targeting police personnel (47.8pc of attacks), police premises (39.8pc) and police transport (10.9pc), to attacks on police personnel’s families and residences, such as the setting on fire of the residence of a police officer in Lakki Marwat in April 2025, leaving his father severely injured. The same pattern exists in Balochistan and the other provinces.\n\nFinally, the attacks have become more sophisticated and lethal. The terrorists are using more modern weapons, including night vision devices and sniper rifles, and adopting tactics such as launching full-scale armed attacks on police premises and even repeatedly using explosive-laden quadcopters to attack police stations in Bannu. More brazenly, in Balochistan, terrorists temporarily seized 20 police stations/posts, holding policemen hostage or killing them, and snatching their official weapons before leaving.\n\nThis increased focus on stepping up attacks on police is part of the terrorists’ overall strategy to project the state as weak by attacking police, which the militants see as a vulnerable state symbol. Tactically, these attacks weaken the police’s will to fight the terrorists and intimidate communities, drying up the main source of police intelligence against the terrorists. Not only that, this tactic aims at expanding terrorists’ influence in the locality by limiting police presence to certain areas due to security concerns, thus enabling terrorists to fill the vacuum by setting up their own ‘courts’, carrying out snap checking, increasing extortion demands, etc.\n\nTo address this threat, the general response of the provincial governments has been piecemeal, sporadic and under-resourced, leaving policemen largely vulnerable. The KP government, after losing hundreds of policemen in recent years, has announced a comprehensive police security plan for some of the districts costing Rs15 billion.\n\nHowever, it has yet to cater for some dimensions of the threat, like the use of quadcopters. Going for some ad hoc measures, Balochistan is yet to come up with a comprehensive security plan. With almost half its police stations in insecure improvised buildings and roughly half the transport fleet needing to be replaced, the general security environment for police in Balochistan leaves a lot to be desired.\n\nThe plan to strengthen the police force against terrorism must be based on four broad pillars.\n\nAn analysis of public sentiments in KP and Balochistan on this issue brings out dissatisfaction with the existing response. There is widespread public opposition in KP against any military operation, as expressed in recent jirgas in Bannu, Lakki Marwat, Bajaur, Swat etc. These jirgas expressed confidence in the police and desired a greater role for them in countering terrorism and demanded their capacity building. Another demand by almost all these jirgas has focused on the ‘good Taliban’ vs ‘bad Taliban’ policy, which was making them more insecure. Similar sentiments exist in Balochistan, as evident from the many huge public gatherings protesting against the existing ‘missing persons’ policy. Needless to add, such public alienation vitiates the general security environment in the provinces.\n\nThe plan to strengthen the police force in its fight against terrorism needs to be based on four broad pillars:\n\nTarget hardening: Equipping police personnel with the latest weapons and protective gear, and making use of technology, is an essential prerequisite for enhancing public security. Instead of the existing piecemeal approach, we need comprehensive police vulnerability assessment reports at the provincial level, particularly in KP and Balochistan, to form the basis for a regular review of police security needs commensurate with the evolving terrorist threat.\n\nPolitical will: This is essential not only for the timely allocation of funds for target hardening but also to plug the gaps in the existing counterterrorism response. For instance, in Balochistan, it is imperative to convert all ‘B’ areas into ‘A’ areas to prevent terrorists from using them as safe havens. Moreover, improving governance in KP’s newly merged districts requires a broader and more integrated approach to security, which can be done only at the political level.\n\nCommunity support: Unlike the military, police have to live and work in the community to perform their lawful duties of crime control and law and order, making them highly vulnerable to terrorist attacks. This highlights the need to supplement the target-hardening measures with public support for police, which depends largely on the public’s approval of government policies generally. There is thus a need for provincial governments and police, specifically in KP and Balochistan, to strive to win over public support through inclusive development and responsive governance in order to improve the general security environment.\n\nInstitutional role clarity: Although the military’s role has been crucial in countering terrorism, the recent strong public opposition to its operations and tactics in KP and Balochistan signals a fundamental shift in ground realities. This necessitates a re-evaluation of the long-standing roles of the military and police in counterterrorism. In the light of these changes, a more nuanced approach, in accordance with current societal expectations, would mean gradually enhancing police capacity in both policymaking and field operations, sparing the military to intervene only when necessary.\n\nInvesting in police resilience and capability is thus a strategic necessity for any credible counterterrorism policy. Failure to realise that is likely to render the people, the military and police increasingly unsafe and vulnerable to the terrorist threat.\n\nThe writer, a former police officer, was Nacta’s first national coordinator.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6884147c1d2aa.jpg",
  "retrievedAt": "2025-08-17T21:23:04.322Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926676/police-in-terrorists-crosshairs",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:27.000Z"
}
