{
  "title": "Nepra told to conduct ‘technical survey’ of KE to verify claim of infrastructure improvement - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court (SHC) has asked the National Electric Power Regulatory Authority (Nepra) to conduct a technical survey to ascertain whether the K-Electric (KE) has improved its infrastructure, as claimed before the court.\n\nThe direction came as a two-judge bench comprising Justice Muhammad Faisal Kamal Alam and Justice Muhammad Hasan Akber took up a petition against prolonged loadshedding in the city, filed by nine chairmen of as many town municipal corporations (TMCs) and a member of the City Council of the Jamaat-i-Islami (JI).\n\nAt the outset of the hearing on Friday, counsel for KE filed a counter-affidavit along with documents, claiming that the power utility had made improvements in electricity supply to its consumers.\n\nNepra officials, along with their counsel, appeared in court and submitted that a penalty of Rs50 million had earlier been imposed on KE.\n\nThey sought additional time to submit their comments.\n\nSHC asks power utility, regulator to address issue of loadshedding\n\nHowever, the court was also informed that the appeal regarding the penalty was currently sub judice before the appellate tribunal under Section 12G of the Regulation of Generation, Transmission and Distribution of Electric Power Act, 1997 (Nepra law).\n\nAfter hearing all sides, the bench directed the appellate tribunal to decide the appeal within four weeks. It also asked Nepra to undertake a technical survey to ascertain whether KE had improved its infrastructure.\n\n“Nepra should also undertake a technical survey that whether during the years, K Electric has improved its infrastructure as claimed by its counsel today, for the betterment of the city of Karachi and other areas, where K-Electric is supplying the electricity,” the order reads.\n\nThe court observed that the metropolis continued to face prolonged power outages, particularly during the summer months, which added to the miseries of the residents of Karachi.\n\nIt further remarked that this persistent issue must be addressed by both the KE and Nepra.\n\n“We may observe that the basic of privatisation is that the state owned entity (SOE) once privatised would and should operate in an efficient and feasible manner, all the more, when the entity is tasked with the generating, transmitting and distributing of electricity, which is a public utility service,” it added.\n\nMeanwhile, the court also allowed Nepra’s request for additional time and directed it to submit its comments within 10 days and adjourned the hearing till Aug 12.\n\n‘KE will remain available for any technical surveys’\n\nLater in the evening, a spokesperson for the KE said in a statement that the power utility received the court’s order and it “will remain available for any technical surveys”.\n\nIt said that during the hearing of the case related to loadshedding in Karachi, the KE submitted before the bench that 70 per cent of its network was exempted from loadshedding.\n\nFollowing privatisation, KE had invested over $4 billion in its infrastructure and as a result of this investment, distribution losses had been halved and the customer base had doubled, the statement added.\n\nIt claimed that loadshedding was carried out only in areas with high electricity theft and losses.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:23:47.011Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926604/nepra-told-to-conduct-technical-survey-of-ke-to-verify-claim-of-infrastructure-improvement",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:02.000Z"
}
