{
  "title": "Four, including three women, die by suicide in Chitral - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHITRAL: Four persons, including three women, have reportedly died by suicide during the last two days with two incidents occurring on Friday.\n\nIn the first incident, a girl in her teens reportedly jumped into the river in the Chew Bazaar area. Her body was later fished out and handed over to her parents after a postmortem at the District Headquarters Hospital.\n\nAny eyewitness, Inamullah, who runs a medical store in Chew Bazaar, told Dawn that the girl was seen buying mantoo (Afghani snack) from a vendor in front of his shop, from there she proceeded to the centre of the bridge and jumped into the river in front of many passersby.\n\nSub-divisional police officer, city circle, Sajjad Hussain told Dawn that the parents of the deceased had migrated to Singoor village of Chitral town from the Mulkhow tehsil of Upper Chitral.\n\nThey all ended their life by jumping into river, say police\n\nHe said the immediate reason for her suicide could not be known, while the police had started an inquiry under section 174 of Criminal Procedure Code to ascertain the facts leading to the incident.\n\nIn the second incident, a newly-married young man, identified as Zar Nabi, ended his life in Raman village of Laspur valley of Upper Chitral by jumping into the river.\n\nMastuj sub-divisional police officer Sher Raja confirmed the incident and said the marriage of the deceased had taken place three days ago. He said the search for the body was in progress.\n\nHe said in another incident in Mastuj, a married woman from Nisur Gol ended her life by jumping into the river. Her body was later recovered.\n\nMr Raja said police had started an inquiry to ascertain the reasons in both cases.\n\nIn yet another incident, a girl student of grade-9 in Kosht village of Mulkhow ended her life in a similar fashion. Her body was still to be recovered.\n\nThe deceased admitted to a school in Islamabad had come to her village with her parents during the summer vacation.\n\nEXPEDITION: After the first successful trekking expedition to the base camp of Trich Mir, the second expedition left Chitral city on Friday morning, which will trek to the base camp via Oveer village.\n\nLower Chitral deputy commissioner Rao Hashim Azeem saw the participants off.\n\nTo mark the 75th anniversary of the first successful ascent to the highest peak of the Hindukush system of mountains, the Khyber Pakhtunkhwa government has declared 2025 as ‘Year of Terich Mir’ and is arranging and sponsoring expeditions to the base camp.\n\nIn this regard, a group of women will also leave Chitral in the first week of August for trekking to Trich Mir base camp.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/02/191215318b38c32.jpg?r=121534",
  "retrievedAt": "2025-08-17T21:23:12.370Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926568/four-including-three-women-die-by-suicide-in-chitral",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:21.000Z"
}
