{
  "title": "Peshawar residents complain of excessive power cuts - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Power consumers in different localities of the provincial capital have complained about facing ‘worst’ electric loadshedding despite paying bills regularly.\n\nThe residents of Hazar Khawani, Afridi Abad, Ganj, Kakshal, Lahori Gate, City Circular Road, Garhi Khana and other areas urged the Peshawar Electric Supply Company to ensure a smooth power supply.\n\n“We have to suffer frequent power breakdowns in short intervals despite the fact that we are paying power bills regularly,” Ihsanullah Allah, a trader, told Dawn.\n\nSome people said Lahori Gate, Gulbahar, Charsadda Road, Shaheen Colony, Swati Phattak areas never experienced unscheduled and prolonged power cuts in the past. They said excessive power cuts in hot and humid weather had put them in misery.\n\nPesco promises relief even on 75 high-loss feeders\n\nThe consumers said they could not sleep due to mosquitoes and suffocation in houses located in the narrow streets.\n\n“We have to buy ice as our refrigerators are not working properly due to low voltage and tripping,” a resident of Hazar Khawani said.\n\nHe said his father was suffering from different ailments and one of his family members had to constantly use hand fan to relieve him in the scorching heat, mainly at night.\n\nAnother resident of Gulbahar complained his area was considered to be posh locality but its inhabitants faced loadshedding. He said people were regularly paying the bills, but Pesco had connected the area with Hazar Khawani, which was known as a high-loss feeder.\n\nThe residents of Shaheen Colony, Swati Phattak criticised the local lawmakers for failing to resolve their issues.\n\nAn elder, Sadiq Babu, said people supported Pakistan Tehreek-i-Insaf but its leaders didn’t bother to return to their constituencies after the election. He said the people would come to the streets against the power and gas outages.\n\nGohar Ali Khan, a councillor from Daudzai area, said residents faced prolonged power outages.\n\n“Sometimes power supply is suspended for the whole night without any prior notice,” he complained.\n\nPesco attributes the increased loadshedding to high losses on certain feeders, exceeding 80% in some cases, stemming from electricity theft and non-payment of dues.\n\n“This is part of a broader effort by Pesco to overcome financial losses and ensure a more stable power supply,” a source said.\n\nThe source said Pesco had identified feeders with significant losses, leading to increased loadshedding.\n\nMeanwhile, a Pesco spokesman said efforts were on to reduce loadshedding through various measures, including providing relief on 75 high-loss feeders by reducing loadshedding to 12 hours for a 15-day period.\n\nHowever, he didn’t share details about the high-loss feeders.\n\nTo a query about increased loadshedding on certain feeders during the past some days, he said the decision had been reversed due to protest demonstrations in various areas of the provincial metropolis.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/221059494aea641.jpg?r=105957",
  "retrievedAt": "2025-08-17T21:23:11.339Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926570/peshawar-residents-complain-of-excessive-power-cuts",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:21.000Z"
}
