{
  "title": "PSB mandates prior approval before Indian event participation due to security concerns - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan Sports Board (PSB) on Saturday instructed all national sports federations to seek prior consultation and approval before participating in any sporting events held in India due to ’“security concerns”.\n\nPolitical tensions bet­ween the two nations over the years have cast a sha­d­ow over bilateral sporting events, causing major tournaments to hang in the balance. The countries’ teams have previously refused to travel across the border for sporting events, electing to play on neutral ground via a hybrid model instead.\n\nA circular issued today by the PSB said the decision was taken during the 34th board meeting held on Wednesday. The circular explicitly urged all national federations to strictly adhere to the directive.\n\n“In view of the current security situation, no national federation shall make any commitment or agreement regarding participation in sports events in India without prior permission from PSB,” it said.\n\nThe PSB cited prevailing security concerns as a reason for the new directive.\n\nThere has been a spike in tensions between India and Pakistan in the wake of a terror attack in Pahalgam earlier this year that left 26 tourists dead.\n\nIndia blamed Pakistan for the attack, an accusation Islamabad denies. The incident triggered a series of tit-for-tat diplomatic measures by the two countries against each other and a military conflict until a ceasefire was announced in May.\n\nIndia will host the women’s 50-overs World Cup this year, but Pakistan will play all their matches in Sri Lanka under an arrangement made by the International Cricket Council.\n\nIndia refused to travel to Pakistan for the Champions Trophy this year and played all their matches, including the March 9 final, in Dubai.\n\nLast week, a cricket match between Indian and Pakistani veteran players — part of the World Championship of Legends — was called off after Indian players, including Shikhar Dhawan, refused to play against Pakistan, citing the tensions between the two nations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2614314625d6539.jpg",
  "retrievedAt": "2025-08-17T21:22:17.703Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926716/psb-mandates-prior-approval-before-indian-event-participation-due-to-security-concerns",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T12:04:09.000Z"
}
