{
  "title": "Balochistan lawmakers urge private schools to follow provincial curriculum - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan Assembly on Friday adopted a resolution calling for all private schools in the province to align their curriculums with the Balochistan Textbook Board and to stop charging tuition fees during the three months of winter and summer vacations.\n\nThe resolution, moved by Syed Zafar Ali Agha, a JUI-F MPA from Pishin, was adopted without opposition during the session presided over by Speaker Abdul Khaliq Achakzai.\n\nSpeaking on the resolution, Mr Agha expressed concern that many private schools in the province follow curriculums that differ significantly from the Balochistan Textbook Board, which negatively affects student performance. He added that some institutions prioritise non-academic activities over education, depriving students of meaningful learning.\n\nHe also criticised the practice of collecting advance fees for vacation periods, particularly during the December to February winter break. “It is unjust to demand a three-month fee during the vacation, especially from students of low-income families,” he said.\n\nThe resolution urged the provincial government to ensure compliance with the Balochistan Textbook Board curriculum, ban non-academic activities and prohibit the collection of tuition fees during holidays — December to February in colder areas and May to July in warmer regions.\n\nResolution calls for end to fee collection during three-month vacations\n\nIt also called for the introduction of a standardised and reasonable fee structure up to the secondary level to ensure equitable access to quality education.\n\nResponding to the resolution, Provincial Minister Raheela Hameed Khan Durrani said a unified national curriculum is being rolled out nationwide. “We have moved far beyond the ‘Alif, Anaar, Bay, Bakri’ level,” she said while referring to outdated teaching methods.\n\nThe minister acknowledged issues in matriculation exam marking and announced a fact-finding committee to investigate the matter.\n\nMs Durrani added that many previously closed schools had reopened and new teachers have been hired. She noted that government schools offer free education up to matriculation, while private institutions follow independent fee structures.\n\nIn his speech, Chief Minister Sarfraz Bugti criticised mismanagement at the University of Balochistan. “New buildings are being constructed while staff salaries go unpaid,” he said.\n\nDr Abdul Malik Baloch of the National Party called for the establishment of catheterisation labs in provincial hospitals and proposed that the building of the Agricultural University be officially handed over to the university.\n\nCM Bugti responded that the Agricultural College had earlier communicated that it did not require the building, citing low student numbers. It is currently in use by the National Vocational and Technical Training Commission (NAVTTC), though not under ownership.\n\nHe added that Balochistan’s youth could become a valuable workforce if properly trained and stressed the need to reform universities’ management structure.\n\n“No one wants to see our teachers protesting on the streets,” he said, adding that 3,200 schools had reopened due to government policies and no school would be closed next year.\n\nProvincial Health Minister Bakht Muhammad Kakar acknowledged that healthcare in the province had historically been neglected and that doctors had not received promotions since 2013.\n\nHe said steps are now being taken to post doctors in rural areas to reduce patient overload in Quetta.\n\nThe minister also noted the lack of data within the health department and emphasised the need for doctors to serve in their home districts, including female doctors.\n\nProvincial Minister Noor Muhammad Dummar addressed social media rumours regarding land allotments in Harnai and Ziarat, urging the assembly to present official records.\n\nThe speaker directed the Revenue Department to submit a complete record of forest land allotments in Ziarat from 2010 to the present.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:24:48.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926659/balochistan-lawmakers-urge-private-schools-to-follow-provincial-curriculum",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:58:39.000Z"
}
