{
  "title": "Info minister apologises to boxer Shahzaib Rindh for ‘unjustified’ delay in monetary reward, support - Pakistan - DAWN.COM",
  "author": null,
  "content": "Information Minister Attaullah Tarar on Saturday apologised to mixed martial arts player Shahzaib Rindh for the “inordinate delay” in the government’s promised financial reward and support.\n\nIn September, Rindh made history when he won the Karate Combat Championship (KC-49) in Singapore, becoming the first-ever world champion from Pakistan after defeating Brazil’s Bruno Roberto De Assis in the final.\n\nFollowing the win, President Asif Ali Zardari had presented Rindh with a cheque worth Rs100 million, the Balochistan government announced Rs2m as a cash prize, while a former minister had also promised him 25 acres of land.\n\nTarar’s apology today comes after Rindh, in a post on X on Wednesday, had slammed the government for its “fake promises” of Rs5m in cash and an additional Rs80m to support his training and upcoming matches.\n\n“Our politicians are corrupt,” Rindh alleged, adding that the last time he won, Prime Minister Shehbaz Sharif had announced rewards for him.\n\n“It was all [a] lie; I never got [a] penny from them. They just take pictures, fake promises and forget shame,” he added.\n\nLast year, Prime Minister Shehbaz Sharif had issued a statement congratulating Rindh and met with him. However, a report on any announcement of a reward could not be found.\n\nTarar responded to Rindh’s criticism today, apologising for the delay in the promised support.\n\n“There seems to be some miscommunication. We sincerely apologise for this unjustified delay,” the minister posted on X.\n\n“Sportsmen like you are our real heroes and we value your achievements. You have brought great honour to the country and made us all proud.”\n\nHe added: “The prime minister has taken a serious notice of this inordinate delay and rest assured, it will be sorted out immediately inshallah.\n\n“The PM has further instructed that such mistakes must never happen in the future. We regret this unjustified delay and the inconvenience caused,” the minister said.\n\nIn response, Rindh welcomed the “acknowledgement”, saying: “I truly appreciate the prime minister’s attention to this matter and his commitment to supporting athletes like myself.\n\n“Representing Pakistan on the world stage is an honour, and I will always give my all for our country. Inshallah, with your support, we can continue to uplift and inspire the next generation of champions,” he added, saying he looked forward to the issue’s resolution soon.\n\nIn April last year, Rindh had decried the government’s lack of support, saying it was its “bad luck” that it did not support the country’s heroes after his 2-1 victory over India at Dubai’s Karate Combat 45 event.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/26150424b4af07f.png",
  "retrievedAt": "2025-08-17T21:22:27.872Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926714/info-minister-apologises-to-boxer-shahzaib-rindh-for-unjustified-delay-in-monetary-reward-support",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T10:52:48.000Z"
}
