{
  "title": "Punjab asks district admin, RDA to present proposal to tackle flood-like situation in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Punjab government has asked the district administration and Rawalpindi Development Authority (RDA) to present the proposal to avoid flood-like situation in the garrison city.\n\nPunjab Senior Minister Marriyum Aurangzeb held a meeting on Friday with the district administration and Rawalpindi Development Authority (RDA) officials as well as planning department officials and asked them to give suggestions to chalk out plan in this regard.\n\nSources said the provincial government wanted to solve the issue of flood in Leh Nullah and improve the condition of banks in this regard.\n\nThey said there were two proposals for the improvement of Leh Nullah to enhance the capacity of the nullah to discharge maximum water during monsoon season.\n\nA senior official of the district administration told Dawn that the district administration had given suggestion to start work on remodeling of Leh Nullah, make green belts on the banks and install fencing to avoid dumping of solid waste and construction material waste in the nullah.\n\nOn the other hand, Rawalpindi Development Authority (RDA) officials said that the only solution to the issue of flooding in the garrison city was to make flood channel, set up sewage treatment plant and erect fences along the nullah but it will create problem in cleaning and rescue services in future.\n\nThe senior provincial minister decided to take up the issue in next meeting scheduled for next week and asked the district administration and RDA to look into more options so that the government could start work on the better option to solve the issue of flooding in the garrison city.\n\nOn the other hand, the RDA has already started the process to launch new feasibility study for Leh Nullah Expressway and flood channel.\n\nA senior RDA official told Dawn that the process of hiring consultant for the feasibility study had been started.\n\nHe said the RDA would select the consultant after receiving documents from the aspirant firms.\n\nHe said three-month time would be given for the feasibility study and then the next work to award contract for the construction of roads on both sides of Leh Nullah woild be initiated.\n\nHe said the consultant would be given task to conduct a study for construction of roads on both sides of Leh Nullah from Jhelum Road near Lahore High Court Rawalpindi Bench to I.J. Principal Road at Kattarian bridge as well as construction of trunk sewer from Moti Mahal to Gorakhpur.\n\nHe said more than 5,500 kanals in Gorakhpur was available for the sewage treatment plant to treat water for agricultural purposes.\n\nHe said Parks and Horticultural Authority (PHA) constructed temporary nursery at the site but it was allocated for the treatment plant funded by the Asian Development Bank.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:23:17.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926608/punjab-asks-district-admin-rda-to-present-proposal-to-tackle-flood-like-situation-in-rawalpindi",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:16.000Z"
}
