{
  "title": "Sindh lawmakers, public asked to help identify run-down buildings - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Muttahida lawmaker voices concern over issuance of notices to 42 buildings in Gulistan-i-Jauhar by Cantonment Board Faisal\n• Saeed Ghani says 87 dilapidated structures evicted\n• Traffic police harassing motorcyclists on issue of number plates, alleges PTI MPA\n• House unanimously condemns couple’s murder in Balochistan\n\nKARACHI: Against the backdrop of the Lyari building tragedy that claimed lives of 27, Local Government Minister Saeed Ghani has appealed to the members from both sides of the aisle and the public to identify dilapidated and dangerous buildings across the province and report to the authorities.\n\n“If peoples’ lives are saved, they can also build their own roofs and the government can also help them,” he said while speaking at the Sindh Assembly session that began on Friday.\n\nResponding to a call attention notices and point of order, Mr Ghani explained that the collapsed building was an illegal structure built in 1980 and had already been served with demolition notices. “Forty-five families were residing there. Following the tragedy, we offered to relocate them to community centres, marquees, halls, and nearby hotels, but they preferred to stay with relatives,” Ghani added.\n\nHighlighting ongoing safety measures, the minister stated: “So far, 87 unsafe and dangerous buildings across the province had been vacated, including 66 in Karachi’s district South, displacing 325 families. We are not focusing on one building alone but taking a broader view to address all such cases with short- and long-term policies.”\n\nHe told lawmakers that the provincial government would increase the compensation for the families of the people killed in the Lyari building tragedy.\n\nHe said that Chief Minister Syed Murad Ali Shah had announced that Rs1 million each would be given to the families of the deceased occupants of the collapsed building.\n\n“PPP chairman Bilawal Bhutto-Zardari has asked the provincial government to increase the amount of compensation, so it will be increased,” he said adding that the injured victims would also be paid compensation.\n\nOn a point of order, Muttahida Qaumi Movement-Pakistan member Muhammad Usman said that the Faisal Cantonment Board had given notices to 42 buildings in Gulistan-i-Jauhar where over 16,000 people were living.\n\nMQM-P’s Najam Mirza demanded that a special parliamentary committee be formed on this issue in which the opposition should be included.\n\nThe LG minister said that there was a lot of criticism of the government for the building collapse in Lyari, which was justified to some extent. “I accept my responsibility as a minister,” he added.\n\nMQM’s Rashid Khan said on his point of order that notices had been given to 74 buildings in Hyderabad, and women were insulted by the police during eviction and people were made to sit in the dark streets of the night without any compensation.\n\nThe LG minister said that people should be evicted from the dilapidated and dangerous buildings. “Although evicting people from their homes is a painful process, exhuming bodies can be a more painful process,” he added.\n\nHe further said families displaced due to these evacuations were being immediately provided with three months’ rent to help them resettle in the first phase, while legislative committees are working daily to address the issue systematically.\n\nResponding to another call-attention notice raised by MQM-P’s Sikander Khatoon regarding the delay in cleaning stormwater drains in Shah Faisal Colony, the LG minister clarified that the drains were under the jurisdiction of Shah Faisal Town.\n\n“Due to delays on their part, the Karachi Metropolitan Corporation has taken up the task, and work is ongoing round-the-clock on these six drains,” he assured.\n\nObjections over Ajrak number plates\n\nThe opposition members also raised various objections regarding the issue of number plates printed with Ajrak design in Karachi.\n\nThe parliamentary party leader of the Pakistan Tehreek-i-Insaf, Shabbir Qureshi, said that people in Karachi were facing problems over the issue of new number plates. He said that the traffic police were harassing the motorcyclists on the issue of number plates and action should be taken against the policemen.\n\nProvincial Excise Minister Mukesh Kumar Chawla said that the new number plate having security features had been introduced in 2022. “Ajrak will remain on number plates, this is the culture of Sindh,” he added.\n\nThe minister said that Ajrak number plates had been in operation for two to three years. “If there are any issues, they should be discussed and Ajrak should not be made an issue,” he added.\n\nMQM-P member Najam Mirza said that Ajrak was not a problem but people were suffering as they were getting challans worth thousands of rupees.\n\nThe Sindh Assembly unanimously passed a resolution condemning the murder of a couple in Balochistan, demanding the strictest punishment for the culprits involved in the murder.\n\nThe resolution, presented by PPP’s Sadia Javed, asked the Balochistan government to conduct an impartial investigation into the incident.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/231000548025bb2.jpg?r=100304",
  "retrievedAt": "2025-08-17T21:23:46.376Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926605/sindh-lawmakers-public-asked-to-help-identify-run-down-buildings",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:59:02.000Z"
}
