{
  "title": "Pogacar exits Alps with Tour stranglehold as Arensman edges white-knuckle win - Sport - DAWN.COM",
  "author": null,
  "content": "LA TARENTAISE: Dutch rider Thymen Arensman picked up a second stage win at the Tour de France on Friday winning stage 19 at La Plagne ski resort as defending champion Tadej Pogacar closed in on a fourth title.\n\nArensman crossed the finish line in the rain two seconds ahead of title contender Jonas Vingegaard and his great rival Pogacar.\n\nHowever, barring a collapse, Team UAE rider Pogacar should claim his fourth Tour de France title aged just 26 years in Paris on Sunday.\n\nThe Slovenian exits the Alps with a lead of four minutes and twenty-four seconds on second placed Vingegaard.\n\nPogacar has dominated the 2025 Tour de France winning stages on rolling runs in the north and west at Rouen and the Mur de Bretagne in the first week, then on the mountain slopes of the Pyrenees on the Hautacam and Peyragudes in week two.\n\nAs the Tour entered its end game Pogacar unexpectedly simply protected his lead through the Alps rather than go on his trademark all out attacks.\n\nThe 2022 and 2023 champion Vingegaard had two off days, first on a time trial and secondly at Hautacam, leaving Pogacar to surge into a position of such stre­ngth he only needed to follow.\n\nGerman breakout star Florian Lipowitz strengthened his hold on overall third place and top spot in the under-25’s section on his debut Tour de France as he tracked the title rivals all the way to the summit finish for an impressive Tour debut with Red Bull Bora.\n\nFor Arensman and Ineos this was a symbolic victory as the British team begin their revival with the return to the helm of Dave Brailsford.\n\nArensman slumped to the ground in tears at La Plagne as he just held on with a white-knuckle struggle over the final kilometres.\n\nHe previously won stage 14 at another ski resort, at altitude in the Pyrenees at Superbagneres.\n\nMirroring Ben O’Connor’s winning tactic on the thrilling stage 18, climber Arensman attacked at the bottom of the final climb with the title rivals more concerned with tracking each other. But this time the breakaway stage winner had to sweat out the run in with the top trio closing fast.\n\nThe 25-year-old Ineos man fell over into the barriers exhausted at the line and broke into sobs of relief.\n\nThis final mountain stage was shortened overnight due to an outbreak of a cattle infection along the route, reduced to just 93km, which ran to a rowdy finish at 2050m altitude.\n\nThe stage however was largely uncontested in comparison to Thursday’s epic cat-and-mouse between Pogacar and Vingegaard, who attacked the champion 71km from the finish line without ever dislodging him.\n\nPublished in Dawn, July 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68840963b0280.gif",
  "retrievedAt": "2025-08-17T21:24:00.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926606/pogacar-exits-alps-with-tour-stranglehold-as-arensman-edges-white-knuckle-win",
  "dateList": "2025-07-26",
  "date_published": "2025-07-25T23:58:51.000Z"
}
