{
  "title": "White House seeks fines from other universities after Columbia deal - World - DAWN.COM",
  "author": null,
  "content": "The White House is seeking fines from several universities it says failed to stop antisemitism on campus, including Harvard University, in exchange for restoring federal funding, an official of US President Donald Trump’s administration said on Friday.\n\nThe administration is in talks with several universities, including Cornell, Duke, Northwestern and Brown, the source said, confirming a report in the Wall Street Journal.\n\nThe official, speaking on condition of anonymity, said the administration is close to striking deals with Northwestern and Brown and potentially Cornell.\n\nA deal with Harvard, the country’s oldest and richest university, is a key target for the White House, the official added.\n\nA spokesperson for Cornell declined to comment. Other universities did not immediately respond to requests for comment.\n\nTrump and his team have undertaken a broad campaign to leverage federal funding to force change at US universities, which the Republican president says are gripped by antisemitic and “radical left” ideologies.\n\nTrump has targeted several universities since returning to office in January over the pro-Palestinian student protest movement that roiled college campuses last year.\n\nColumbia University said on Wednesday that it will pay more than $200 million to the US government in a settlement with the administration to resolve federal probes and have most of its suspended federal funding restored.\n\nThe Trump administration has welcomed the Columbia deal, with officials believing the university set the standard on how to reach an agreement, the official said.\n\nHarvard has taken a different approach, suing the federal government in a bid to get suspended federal grants restored.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/26113520f929997.png",
  "retrievedAt": "2025-08-17T21:22:44.274Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926698/white-house-seeks-fines-from-other-universities-after-columbia-deal",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T06:52:35.000Z"
}
