{
  "title": "PTI influencing ECP verdict on prohibited foreign funding case: Sherry",
  "link": "https://www.app.com.pk/national/pti-influencing-ecp-verdict-on-prohibited-foreign-funding-case-sherry/",
  "date_published": "2022-08-04T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Federal Minister for Climate Change Senator Sherry on Thursday said that the Pakistan Tehreek-e-Insaf (PTI) was influencing the Election Commission of Pakistan (ECP) verdict on its prohibited foreign funding case.\nAddressing a media briefing here, the Minister said the PTI orchestrated their hoax narrative as they were already aware of the ECP verdict and tried to tarnish public opinion.\nSherry Rehman also held that the protest call by Imran Khan and PTI leadership was aimed to hide their incompetence and make minds of the masses that they [PTI] had done nothing wrong.\nShe asserted the PTI’s pack of lies could not be justified through any narrative or opinion making and protest, adding, “the PTI had extremely tried to influence ECP for 8 years and changed nine advocates during the case proceedings. The party insisted to hold in camera proceedings to keep the outcome secret.”\nThe Minister underlined that PTI Chairman Imran Khan’s declaration in the prohibited funding case was also false along with 13 unknown accounts that were first not accepted by PTI, and 34 prohibited funding sources that had become exposed.\n“There is no legal or constitutional reason for the protest call declared by the PTI. Its narrative has decayed and disintegrated. PTI is claiming that they are least bothered by the ECP verdict and on the other hand repeatedly announced to hold protests is pointless,” she said.\nThe PTI, she said had lied to their voters, the country and accused its opponents for plundering national wealth, adding, “This is a decisive moment that exposed the judicial system prevailing in the country and justice should prevail.”\nShe mentioned that foreign funding was being received by many departments but the government of Pakistan’s only concern was that they [PTI] had lied to the nation and had hidden its accounts.\n“Indifference or lack of information is no defence legally as you have to take responsibility of what you submit undersign to any authority,” she said.",
  "retrievedAt": "2025-08-11T15:20:27.930Z"
}
