{
  "title": "President urges insurance sector to upgrade digital means, involve Ulema to motivate masses",
  "link": "https://www.app.com.pk/national/president-urges-insurance-sector-to-upgrade-digital-means-involve-ulema-to-motivate-masses/",
  "date_published": "2022-08-04T08:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): President Dr Arif Alvi on Thursday urged the public and private insurance companies to advance the use of digital knowledge as per international standards to ensure maximum risk distribution.\nHe also proposed the companies on involving the Ulema (religious leaders) with an aim to encourage people and spread knowledge about the Islamic Takaful (insurance).\nAddressing a seminar on ‘Importance of awareness and technology in insurance industry’ here at Aiwan-e-Sadr, he said wider privacy and data protection issues required close attention given the digital component of the insurance sector.\nPresident Alvi said new technologies had the potential to bring innovation to the insurance sector and impact the regulatory practices of insurance markets.\nHe mentioned that innovation through new technologies was a key driver of change in the financial sector and could lead to risk distribution.\nHe said the insurance sector was no exception to advancements in technology with possibilities of new methods of service provision as well as greater opportunities for data collection.\nHe said the insurance sector could contribute to better risk identification and mitigate incidental losses.\nRegarding the use of artificial intelligence, he said the new technology could give an improved customer experience with precision and accuracy.\nHe mentioned that the blockchain, based on distributed computing, could prove helpful in improving the cyber security of data.\nAimed at risk distribution, he said social behaviours were another aspect of tracking records of the insurer besides the empirical evidence.\nPresident Alvi recalled that automobile insurance companies in the country used to offer GPS facility for lower insurance premiums, and said the incentives related to health insurance could also encourage people to get insurance.\nBesides doing marketing about the product, Dr Alvi proposed the insurance companies conduct a survey on why people avoided getting insured.\nThe event was attended by representatives of insurance companies and experts in the related field.",
  "retrievedAt": "2025-08-11T15:20:30.485Z"
}
