{
  "title": "Pakistani nation along with Kashmiris to observe Youm e Istehsal on August 5: FO Spokesperson",
  "link": "https://www.app.com.pk/national/pakistani-nation-along-with-kashmiris-to-observe-youm-e-istehsal-on-august-5-fo-spokesperson/",
  "date_published": "2022-08-04T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):The Pakistani nation will join the Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Azad Jammu and Kashmir and the world over in solemnly observing Youm-e-Istehsal on August 5 to denounce Indian atrocities.\nThe Foreign Office Spokesperson said in a weekly press briefing on Thursday that during the day, the nation and Kashmiris would denounce Indian atrocities and express full support for the realization of the right to self determination and peaceful resolution of the Jammu and Kashmir dispute in accordance with relevant UNSC resolutions.\n“Tomorrow, 5th August, marks the third anniversary of India’s illegal and unilateral actions of August 5, 2019 and subsequent steps that were designed to undermine the internationally recognized disputed status of occupied Jammu and Kashmir, and to alter the demographic structure of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) – all in violation of international law and relevant UN Security Council resolutions on the Jammu and Kashmir dispute.”\nHe said India had reneged on its obligations and the solemn commitments of its leadership to abide by the UNSC resolutions and let the Kashmiri people exercise their right to self-determination.\nIndia had let loose a reign of terror and suppression, gross and widespread violations of human rights and international humanitarian law, in an attempt to perpetuate its illegal and forcible occupation of IIOJK, he added.\n“And this situation has been particularly aggravated since India’s illegal actions of 5th August, that as you are aware, were accompanied by the inhuman siege, curfews, physical lockdowns and communication blackouts, enforced by over 900,000 Indian occupation forces, in what is considered the densest military occupation anywhere in recent history.”\nHe told that since August 2019, at least 660 Kashmiris had been martyred by Indian occupation forces in IIOJK.\n“Behind those figures is a systematic campaign of oppression, extra-judicial killings of innocent Kashmiris in fake encounters and so-called ‘cordon-and-search’ operations, custodial deaths, use of pellet guns, enforced disappearances, collective punishment, and incarceration of almost the entire Kashmiri leadership – their true representatives in order to prevent them from raising their voice for the peaceful and legitimate Kashmiri struggle for self determination.”\nIn parallel, he said there were a series of arbitrary legal and administrative steps including land confiscation, influx of non-Kashmiris, creation of alien settlements, and issuance of millions of illegal domicile certificates – all aimed at demographic engineering in order to turn the Kashmiri Muslim majority into a minority in their own land.\nIn an attempt to hide its atrocities, India, the serial violator of human rights, had employed censorship, and crackdown on civil society, human rights defenders, lawyers and journalists, who were harassed and persecuted under the draconian laws, the spokesperson informed.\n“Despite all these actions, India has miserably failed to dampen the resilient spirit of the Kashmiri people, who continue to stand firm in their total rejection of Indian illegal occupation.”\nHe said Pakistan appreciated prominent world leaders, parliamentarians across the globe, international media, civil society, think tanks and human rights organizations for upholding the cause of the Kashmiris.\n“We are grateful to the OIC for its principled and strong support, as well as the consistent position of the UN Secretary General on the Jammu and Kashmir dispute in accordance with the UNSC resolutions.”\n“We believe India must reverse its illegal and unilateral actions of August 5, 2019 and take the necessary steps to create an environment conducive for meaningful result-oriented engagement and dialogue – that leads to peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant Security Council Resolutions and the wishes of the Kashmiri people.”\nThe spokesperson said, “Till that time we continue to stand in solidarity with the Kashmiris. We pay rich tributes to their struggle and sacrifices and assure them of Pakistan’s unambiguous, steadfast and all possible support for the realization of their right to self-determination. Let me say that this support is based on complete unanimity and national consensus, and which will be on full display across the country tomorrow and showcased by many activities and diplomatic outreach by Pakistan missions abroad alongside the Kashmiri and Pakistani diaspora.”",
  "retrievedAt": "2025-08-11T15:20:23.023Z"
}
