{
  "title": "Japan provides $ 9 mln for sewerage, drainage services in Multan",
  "link": "https://www.app.com.pk/national/japan-provides-9-mln-for-sewerage-drainage-services-in-multan/",
  "date_published": "2022-08-04T17:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): The Government of Japan has agreed to provide new grant assistance worth 1,236 million Japanese Yen (around Rs 1,855 million) for upgrading the mechanical system for sewerage and drainage services in Multan.\nA signing ceremony for provision of the assistance held here at the Ministry of Economic Affairs, said a press release on Thursday.\nParliamentary Vice-Minister for Foreign Affairs of Japan HONDA Taro, Ambassador of Japan WADA Mitsuhiro, Chief Representative of JICA KINOSHITA Yasumitsu, Minister for Economic Affairs Sardar Ayaz Sadiq, Secretary Ministry of Economic Affairs Mian Asad Hayaud Din, and other officials from both countries attended the ceremony.\nMultan city has faced constant flooding of roads in the urban areas due to frequent sewer clogging, causing road closures and sanitary problems.\nAlthough the Water and Sanitation Agency (WASA) Multan continues to enhance their sewerage services through repairing their old equipment for cleaning sewer pipes and relocating reusable equipment to where most needed, it has been difficult to adequately respond to citizens’ requests for preventing sewer clogging.\nThe grant project will address the above issues by upgrading the sewerage equipment, such as cleaning equipment and drainage pumps, to effectively maintain the sewer pipes and channels. This will help improve sewerage services and contribute to sustainable sanitation in the region.\nSpeaking on the occasion, Parliamentary Vice-Minister HONDA said, “I am delighted to be able to visit Pakistan on the unique occasion of the 70th anniversary of the diplomatic relations between Japan and Pakistan. I will make every effort to strengthen the friendship between the two countries by continuous development cooperation, especially in the sectors such as water supply and sewage, disaster prevention, health, and education, as well as by promoting people-to-people exchanges and expanding trade and investment.”\nSardar Ayaz Sadiq expressed his deepest appreciation to the Government of Japan for its generous support, especially given the Japanese high quality and extensive development cooperation for decades.\nIt merits mention that Japan has been providing development assistance to Pakistan since 1954, and funded a total of $11.7 billion to the country to date.",
  "retrievedAt": "2025-08-11T15:20:37.665Z"
}
