{
  "title": "Youm-e-Istehsal to be observed in AJK on Friday",
  "link": "https://www.app.com.pk/national/youm-e-istehsal-to-be-observed-in-ajk-on-friday/",
  "date_published": "2022-08-04T14:49:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Aug 04 (APP): People on both sides of line of control (LOC) will observe August 05 as Youm-e-Istehsal against Indian act of abolishing special status of illegally Indian occupied Jammu and Kashmir (IIOJK) on this day in 2019 and subsequent measures to turn Muslims of the state into a minority.\nAll the political parties and Hurriyat conference have announced to bring out protest rallies, seminars and other functions to highlight India’s illegal and immoral acts and atrocities against innocent people of IIOJK.\nIn his message on this occasion, President Azad Jammu and Kashmir Barrister Sultan Mehmood Chaudhary said that with the repeal of article 35-A and 370 of Indian constitution India had changed the state laws regarding settlement of people in the valley from other parts of India in order to turn Kashmiri people into a minority.\nHe said all these acts were in violation of the United Nations (UN) resolutions on Kashmir and international law and the silence of the UN and world community on these acts was raising eyebrows.\nHe alleged that more than four million people from different parts of India had been brought and settled in the occupied valley by the Indian government to turn local people into a minority on their on land.\nPaying tribute to Kashmiri people, Sultan Mehmood recalled that despite the brutalities and worse atrocities they were standing against India and struggling for their just right to self determination. He assured them that people of AJK and Pakistan were fully backing them.\nAJK Prime Minister Sardar Tanveer Iliyas in his message on this occasion said that August 5, 2019 was a black day in Kashmir when Indian government withdrew the special status of IIOJK by abolishing article 35 A and 370 from its constitution.\nHe said the acts taken on this day by India were meant to snatch the identity, culture and language from the people of IIOJK and the objectives behind this plan were now open and clear to every citizen of the state of Jammu and Kashmir.\nHe said that the act had badly damaged the efforts of bringing peace in the region and after the August 5, 2019, situation was deteriorating in the region.\nHe appealed the international community to intervene for the sake of peace and justice in the region and said that though the article 370 was insignificant for Kashmiris but article 35-A was a protective bar against illegal occupation of lands of Kashmiri people and demanded that must be restored.\nHe expressed optimism that people of Jammu and Kashmir would continue their struggle for the right to self determination till the achievement of the goal and assured that people and government of AJK would continue supporting them.",
  "retrievedAt": "2025-08-11T15:20:20.837Z"
}
