{
  "title": "Youm-e-Istehsal darkest day of Kashmir’s recent history: APHC leader Nayeem Khan",
  "link": "https://www.app.com.pk/national/youm-e-istehsal-darkest-day-of-kashmirs-recent-history-aphc-leader-nayeem-khan/",
  "date_published": "2022-08-04T08:22:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) , Aug 04 (APP)::Senior leader APHC and Chairman of the JKNFNayeem Ahmed Khan while terming August 5 (Youm-e-Istehsal) as the darkest day in Kashmir ‘s recent history said the day marks the beginning of Indian settler colonialism that seeks to change the demography of IIOJ&K).\nIn a message from Delhi the Hurriyat leader while highlighting the India’s expansionistic designs said that the Indian move to strip Kashmir of its national identity was a part of its deep-rooted conspiracy to convert the Muslim majority of the state into a minority, says a report received here on Thursday.Terming the Indian government’s August 5, 2019 move as ultra vires, he said that the abrogation of article 370 and 35-A was not only in violation of the Indian constitution but also against the spirit of the UN resolutions and other international treaties.\n“The lopsided move was a brazen violation of the international law and the UNSC resolutions, which strongly prohibits the occupying state from altering the status of a disputed territory unilaterally”, he said.\nThe dangerous move fraught with serious political ramifications, he said was a well thought out plan to change the demography of the state and depriving them of their resources, jobs, identity, cultural, land and above all the promised right of self-determination.\nKashmiris, he said, have never accepted India’s forcible and illegal occupation of their motherland. “The valiant people of Kashmir have yet again refused to accept this forced annexation and bifurcation of the state”, Khan said adding that unlawful move by the Indian state has only increased the level of public resentment against the occupation.\nHe said that amendments in the state’s domicile law have evoked strong reactions from people hailing from Jammu, Kashmir and Ladakh. “Even the Dogra and Hindu community, who feel that they were betrayed by the BJP government, have raised their revolt against the induction of new laws in the state”, the APHC leader said.\n“Since 1947 India had extended a number of orders/ordinances to strengthen its unlawful control over the disputed territory of Kashmir but the fact remains that these steps have failed to subdue Kashmiris and break their will to fight for their political and democratic rights guaranteed to them by no less an authority than the United Nations”, Nayeem Khan said.\nKhan said that no piece of legislation by the Indian parliament can change the disputed nature of the Kashmir issue.\n“Indian governments can change its own law and constitution the way it suits them but how can they change the international covenants, the UN resolutions that stand witness to the fact that Kashmir dispute is all about the fundamental rights of the people of Jammu and Kashmir”, he said adding that rather than misleading their own people the Indian rulers should accept the ground reality and resolve the dispute peacefully in accordance with the universally accepted principle of right to self-determination.\nUrging the world community to take effective notice of the Indian expansionist designs he said it was high time that the world should respond positively to clarion calls emanating from Kashmir and influence the government of India to reverse and quash these unlawful laws.\nWhile reiterating his party’s call for observing Youm e Istehsal on August 5 Khan appealed Kashmiris on both sides of the line of control and the world over to raise their voice against India’s illegal move and expose its ugly face before the world.",
  "retrievedAt": "2025-08-11T15:20:31.029Z"
}
