{
  "title": "India accelerates pace of demographic terrorism in IIOJK",
  "link": "https://www.app.com.pk/national/india-accelerates-pace-of-demographic-terrorism-in-iiojk/",
  "date_published": "2022-08-04T10:15:00.000Z",
  "source": "APP",
  "content": "According to reports emanating from Indian and local Kashmiri media, the authorities sealed many houses during past two months with pretext that these were providing shelter to freedom fighters. The action is part of the Indian policy made on lines of Israel, who sealed and demolished houses to fight Palestinian resistance movement back in late 1980s.\nThe Narendra Modi government was specially focusing on demographic change of Kashmir valley which has around 97 percent Muslim population. The long-term objectives are to (a) disfigure Muslim identity of the state; (b) get the results of plebiscite (if held any point of time) in favour of India. While short-term aims include to (a) inflict damages to economy; (b) deprive Kashmiri people of all the basic human rights; and (c) crush the voice of freedom.\nIndian government had made several attempts on Kashmir’s demography in the past and gradually reduced the Muslim population of IIOJK. The state of Jammu and Kashmir was Muslim majority princely state at the time of partition, constituting 72.4 percent Muslim population which gradually has been reduced by around 4.13 percent to 68.31 as per census of 2011. Currently the IIOJK population stands at 12.541 million. The history is witness to the fact when around 500,000 Muslims were massacred and over 200,000 went missing from August to November 1947 in Jammu by Hindu fanatics.\nThis was the first attempt on transforming the demography of Jammu, one of the three regions of the state. Due to this genocide and migration of Muslims in large number, the Muslims, which prior to this massacre, were around 61 percent, became minority of just 30 percent in this region.\nAnother assault on demography of Jammu was made in 1976 when Agrarian Reforms Act 1976 was enacted that provided ownership rights to tillers of land and resultantly records were tempered and thousands of non-Kashmiris were shown tillers. Yet another attack on demography was made during the period from 2001-2011 where in unimaginable growth of cent percent was witnessed in Hindu population in Ladakh, another region of IIOJK. The Hindu population grew from 6.2 percent to 12.1 percent.\nAfter the abrogation of Articles 370 and 35A on August 5, 2019, the Indian government introduced many new laws and amended several others to facilitate issuance of domicile rights to non-Kashmiris, mostly Hindus. Till date, hundreds of thousands such certificates have been issued, making it very clear how Indian was fast changing demography of Kashmir.\nThe J&K Civil Services (Decentralisation and Recruitment) Act enables all those who lived in the occupied state for 15 years or studied there for seven years to apply for domicile. Even those who have appeared in class 10th or 12th examinations in Kashmir may also avail this opportunity.  The domicile holders have right to job in Kashmir besides they can purchase property and have ownership rights.\nThe Indian government in October 2020 also introduced new law i.e. Union Territory of Jammu and Kashmir Reorganisation (Adaptation of Central Laws) Third Order, 2020, enabling any Indian citizen to buy property in the territory.\n“Kashmiris fear the new laws, notified on Tuesday, are aimed at a land grab to dilute the Muslim-majority character of the region, whose partial autonomy was scrapped in August 2019, bringing it under New Delhi’s direct control,” reported AlJazeera on October 28, 2020.\nThe new laws also allow the lands acquired by the government for industrial or commercial purposes to be disposed of or sold to any Indian. These also authorize the Indian army to declare any area as “strategic” for operational and training purposes. This is a form of land-grabbing as Indian army is already occupying thousands of hectares of land in the occupied region.\nThe pro-Indian National Conference while voicing its concern over the act said the proposed amendments would undermine the civil authority and turn the entire region into a military establishment.\nThousands of hectares of land, the National Conference said, were already under the possession of the Army and other security forces. The new policy “will add to the pool of land under the procession of the army by cutting on the remaining arable and fertile land tracts available for agriculture activity,” NC said in a statement according to Outlook Magazine.\nIndia also follows Israel in land-grabbing techniques on various pretexts. For instance last year the fascist regime grabbed more than 9600 kanals of land in the name of creating 37 new industrial estates (IE) across Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe Bharatiya Janata Party (BJP) is poised to do away with Muslim domination of IIOJK and dye the state in saffron colour. It is high time for international community to wake up and help Kashmiris in their right to self-determination",
  "retrievedAt": "2025-08-11T15:20:29.896Z"
}
