{
  "title": "USFCo launches multiple programs in backward areas, tribal districts: Amin",
  "link": "https://www.app.com.pk/national/usfco-launches-multiple-programs-in-backward-areas-tribal-districts-amin/",
  "date_published": "2022-08-04T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):Minister for Information Technology and Telecommunication Syed Amin-Ul-Haque Thursday informed Senate that the Universal Service Fund Company (USFCo) has launched multiple programs including mobile broadband access and Optical Fiber Cable (OFC) projects in backward areas and tribal districts.\nIn a written reply to the House, the minister said that it was the mandated to provide access to telecommunication services to the underserved and unserved, rural and remote areas of the country.\nHe said the USFCo’s mobile broadband access projects provided voice and broadband data services (3-G/ 4-G) in underserved areas and under the same category, USFCo also initiated projects to provide coverage to unserved road segments of National Highways and Motorways.\nThe minister said the OFC projects have been designed to provide reliable high capacity backhaul to broadband networks. The USF, OFC Tehsil project aimed at connecting unserved Tehsil headquarters and en-route towns.\nTo achieve deep fiberization, the minister said the OFC Union Councils program has been initiated that connects Union Councils to national data backbone.\nHe said the USF has initiated multiple projects in all four provinces including ex-FATA region for provision of telecommunication services.\nIn accordance with the Pakistan Telecommunication (Re-organization), Act 1996 and Universal Service Fund Rules 2006, as amended, he said the USF conducted a reverse auction bidding process as per PPRA rules, for the award of subsidy to be paid to the successful applicant, to assist in meeting the costs of providing telecommunication services in identified underserved rural remote areas, for a contractual period of 10-years.\nAs per Universal Service Fund Rules 2006, as amended, he said that only licensed service providers who were contributors to the USF fund are eligible to participate in the bidding process.\nThe minister said the launch and award of projects were approved by the USF board, which was fully authorized. The contracts were awarded to lowest bidders through open competitive bidding process.",
  "retrievedAt": "2025-08-11T15:20:23.422Z"
}
