{
  "title": "Nuclear energy  key solution to reforming energy sector, mitigating climate change",
  "link": "https://www.app.com.pk/national/nuclear-energy-key-solution-to-reforming-energy-sector-mitigating-climate-change/",
  "date_published": "2024-12-24T17:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 24 (APP):Nuclear technology and its optimum utilisation holds the key to resolving energy-related woes of Pakistan besides helping the country achieve a sustainable solution to mitigate the climate change crisis.\nThis was the crux of the deliberations and discourse held during the seminar on ‘Peaceful Uses of Nuclear Energy’ held here on Tuesday.\nThe seminar was organised by the Center for International Strategic Studies Sindh (CISSS) in collaboration with DHA Suffa University (DSU) and Millennium Institute of Technology and Entrepreneurship (MiTE), at the DSU auditorium.\nThe seminar was divided into plenary and core sessions.\nProf Dr Huma Baqai, Rector MiTE chaired and opened the plenary session.She elaborated that according to the Government of Pakistan’s vision, 40,000 MW of electricity produced through nuclear power plants (NPP) by 2040, fulfilling a quarter of the total energy needs of the country, is an appreciable landmark and needs to be pursued in the best national interest.\nProf Dr Ahmed Saeed Minhas Vice Chancellor DSU delivered the welcome address. He highlighted the importance of collaboration between national departments for achieving sustainable goals for the country.\nMr Junaid Naqi, President, Korangi Association of Trade and Industry (KATI) closed the session with his concluding remarks highlighting the role of NPPs including four in Chashma and two in Karachi providing over 3500 MW of clean, energy to the national grid.\nHe further shed light on the role of nuclear energy being utilized by PAEC in radiopharmaceuticals, isotope production, non-destructive testing, water desalination and other venues which offer venues for collaboration between industry, academia, public and private sectors.\n“Energy fuels growth and growth empowers nations and use of Atom for Peace and Development is the out of box solution that the country direly needs and KATI vows to extend its full support in every step taken to this effect,” he added.\nThe keynote address of the session was delivered by Mr Khaqan  Hassan Najeeb, Former Advisor, Ministry of Finance.\nHe elaborated the energy reset vision. In his presentation, Mr Khaqan paid a rich tribute to Pakistan Atomic Energy Commission (PAEC) which he said is the best example of how a competent workforce equipped with autonomy in making independent decisions can work wonders.\nThe same model of success  needs to be replicated in all public sector departments. He stressed that there is nothing like ‘game-changer’ as only hard work and consistent efforts to stabilize the macro economy can help Pakistan come out of the crisis.\n“Reorganized Energy Architecture is the ultimate destination for Pakistan. A competitive market in the energy retail industry is the need of the hour. Approximately 3600 MW of electricity, fulfilling 10 percent of electricity needs of the country is being produced through nuclear power which is quite encouraging and this clean source of energy which is also baseload needs to be further prioritized,” he added. Mr. Najeeb further said that policy and tax reorganization and reforms is a must and it can be achieved only by hiring the competent human resource, incentivising demand of electricity and managing its cyclicity.\nExplaining the Economics of Nuclear Power he said, in 2023, nuclear provided 17% of the total electricity, which is an impressive success story and Pakistan needs more such good stories. “Nuclear Power Plants (NPPs) keep running for 70 to 80 years, which makes them a better option as compared to oil, gas, and coal powered plants. NPPs run with over 80% of the efficiency and capacity factor.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:00:54.339Z"
}
