{
  "title": "PM pays tribute to Quadi-e-Azam on his 148th birthday",
  "link": "https://www.app.com.pk/national/pm-pays-tribute-to-quadi-e-azam-on-his-148th-birthday/",
  "date_published": "2024-12-24T18:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):Prime Minister Muhammad Shehbaz Sharif, paying tribute to Quaid-e-Azam Muhammad Ali Jinnah on his 148th Birthday, said that Quaid-e-Azam was a leader of rare caliber who believed deeply in unity, justice and equality.\n“Today, as we celebrate the 148th birth anniversary of our founding father, Quaid-e-Azam Muhammad Ali Jinnah, we are reminded of his extraordinary vision, unwavering courage, and unparalleled determination. He achieved what many thought impossible and gifted us our homeland— Pakistan,” the prime minister said in his message.\nPM Shehbaz Sharif highlighted that his life continued to inspire countless people as an enlightened teacher, visionary lawyer, principled statesman, steadfast politician, and charismatic leader. “His journey is a testament to the power of conviction and the realization of dreams through hard work and dedication.”\nThe Quad once remarked, “Failure is a word unknown to me.” True to his words, he pursued his vision with relentless resolve and succeeded in carving out a nation for the Muslims of the subcontinent. For him, titles and accolades were secondary to his ultimate goal — a brighter future for his people, the prime minister added.\nHe said the Quaid dreamt of a Pakistan where every citizen could live with dignity, freedom, and equal opportunity, irrespective of faith or ethnicity. His vision for Pakistan was one of inclusivity, unity, and prosperity.\n“As we commemorate this special day, let us draw strength from Quaid-e-Azam’s legacy and reaffirm our commitment to the values he stood for. It is our duty as Pakistanis to work tirelessly for the progress, prosperity, and unity of our nation, the prime minister remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:00:54.342Z"
}
