{
  "title": "ICT Police deploy 1,500 personnel for foolproof security on Christmas and Quaid-e-Azam Day",
  "link": "https://www.app.com.pk/national/ict-police-deploy-1500-personnel-for-foolproof-security-on-christmas-and-quaid-e-azam-day/",
  "date_published": "2024-12-24T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):The Islamabad Capital Territory (ICT) Police have made comprehensive security arrangements to ensure the safety of citizens during Christmas and Quaid-e-Azam Day celebrations.\nA Public Relations Officer told APP that a total of 1,500 police officers and personnel will be deployed across the district to ensure security.\nHe said armed police personnel will be stationed at Christian places of worship, and security will be on high alert throughout the celebrations. Additional forces will be deployed at sensitive churches to ensure the safety of worshippers.\nDIG Syed Ali Raza, will personally oversee all security duties. Supervisory officers will maintain continuous communication with church administrations, ensuring effective coordination for security arrangements, he added.\nIG Islamabad Syed Ali Nasir Rizvi urged leaders of all faiths to promote interfaith harmony during Christmas. He also confirmed that the Safe City cameras will be used to monitor the Christmas and Quaid-e-Azam Day events in real time.\nThe Dolphin Squad, Ababeel Squad, and police teams will conduct effective patrolling around churches and Christian neighborhoods. Special flag marches, search, and sweep operations are also underway near churches and Christian communities before Christmas.\nIn addition, security will be strengthened at parks, recreational areas, foreign embassies, and other sensitive installations. The Chief Traffic Officer has been instructed to personally oversee traffic arrangements to ensure smooth operations during the celebrations.\nFor the safety of female citizens, female police officers will be deployed for checks, particularly at key locations during both Christmas and Quaid-e-Azam Day celebrations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:01:47.754Z"
}
