{
  "title": "Defence delegation of Azerbaijan calls on Air Chief Zaheer Ahmed Sidhu",
  "link": "https://www.app.com.pk/national/defence-delegation-of-azerbaijan-calls-on-air-chief-zaheer-ahmed-sidhu/",
  "date_published": "2024-12-24T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP): A high level defence delegation led by Deputy Minister of Defence of the Republic of Azerbaijan-Director General Agil Gurbanov, alongwith Lieutenant General Namig Islamzade, Deputy Minister of Defence-Commander of the Azerbaijan Air Force called on Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Air Staff, Pakistan Air Force here Tuesday at Air Headquarters.\nDuring the meeting, Chief of the Air Staff shared the recent achievements of Pakistan Air Force, symbolizing his vision of operational excellence in the realm of contemporary warfare domains, said a press release issued by Inter Services Public Relations (ISPR).\nThe Air Chief reiterated his resolve to further enhance the existing bilateral ties between the armed forces and particularly cooperation with Pakistan Air Force in operational and training domains.\nHe also highlighted the importance of training cooperation; wherein, a large contingent of Azeri air and ground crew is currently undergoing training at an operational PAF base.\nHe noted that the training program is on schedule, with over 50% of the training objectives successfully achieved.\nHe further emphasized that the initiative is expected to culminate within one-month timeframe, reflecting the commitment of PAF to enhance the operational capabilities of Azerbaijan Air Force.\nThe visiting dignitaries lauded the historic & exemplary professionalism demonstrated by the personnel of Pakistan Air Force and praised PAF’s notable progress in developing a thriving domestic capability in the aviation industry in a short timeframe.\nThe dignitaries expressed satisfaction on the training imparted to 70 aircrew & technicians getting trained in PAF and expressed their desire for enhanced Air Force to Air Force collaboration between the two sides.\nEmphasizing on the need to adapting to the evolving landscape of modern warfare, the Azerbaijan military leadership also proposed the establishment of a more comprehensive training regimen focusing on niche and disruptive technologies, as well as cyber and electronic warfare capabilities.\nLater the delegation visited PAF Cyber Command, established at Air Headquarters, where it was briefed about the operational capabilities and ongoing projects of PAF’s modernization drive.\nThe visit of this high level defence delegation from Azerbaijan to Air Headquarters Islamabad signifies a resolute commitment of both countries to reinforce their military partnership, fostering collaboration and promoting robust relations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:01:21.176Z"
}
