{
  "title": "Photography, painting exhibition held at ISA on Quaid Day",
  "link": "https://www.app.com.pk/national/photography-painting-exhibition-held-at-isa-on-quaid-day/",
  "date_published": "2024-12-24T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):Directorate of Electronic Media and Publications (DEMP) on Tuesday organized a digital photographic and painting exhibition to commemorate the 148th birth anniversary of Quaid-e-Azam Muhammad Ali Jinnah.\nThe event, held at the Information Service Academy (ISA), featured rare photographs and portraits of the founder of Pakistan, aiming to educate the younger generation about his monumental struggle and sacrifices for a separate homeland.\nA documentary showcasing Quaid-e-Azam’s life and achievements was also screened during the exhibition.\nDirector General (DG) Information Service Academy (ISA) Sayyed Mubashar Tauqir Shah was the chief guest. Executive Director General DEMP Ms Imrana Wazir, Director General DEMP, Ms Samina Farzin and other senior officials were also present.\nSpeaking on the occasion, DG ISA highlighted Quaid-e-Azam’s legacy, describing him as “a beacon of hope and determination” whose unwavering resolve led to the creation of Pakistan.\nHe lauded DEMP for its efforts in organizing this digital and pictorial exhibition and engaging students from Islamabad’s colleges and universities in the celebrations.\n“We must honor Quaid-e-Azam by embracing and practicing his ideals in our daily lives,” said Mubashar Tauqir.\nDuring the event, appreciation certificates were also distributed among the winners of the Quaid’s painting and documentary competition. The DGs toured the exhibition, commending the artistic and intellectual contributions of the participating students.\nA large number of art lovers, college and university students, intelligentsia attended the event and visited ‘Quaid Gallery’ to have a glimpse of different paintings of father of the nation Quaid-e-Azam.\nThe ceremony concluded with students and officials cutting a cake to celebrate Quaid’s birth anniversary, emphasizing the significance of his enduring legacy for future generations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:02:06.733Z"
}
