{
  "title": "Pakistan keen for Afghan peace due to its high stakes in regional stability: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-keen-for-afghan-peace-due-to-its-high-stakes-in-regional-stability-qureshi/",
  "date_published": "2020-09-03T07:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP): Foreign Minister Shah Mehmood Qureshi on Thursday said peace in Afghanistan was Pakistan’s top priority due to its high stakes in return of stability to Afghanistan and the region.\nThe foreign minister expressed these views in a phonic conversation with Acting Foreign Minister of Afghanistan Haneef Atmar. Qureshi said it was important that the Afghan leaders seized the historic opportunity and achieved an inclusive, broad-based and comprehensive political settlement in Afghanistan.\nHe welcomed the recent developments on the release of prisoners and urged all the parties to take requisite steps for the commencement of Intra-Afghan Negotiations at the earliest.\nFM Qureshi also expressed satisfaction at the successful holding of the second review meeting of Afghanistan-Pakistan Action Plan for Peace and Solidarity (APAPPS) in Kabul recently.\nHe stressed that the positive momentum after the APAPPS should be followed up by implementing all its decisions.  Both sides agreed that the APAPPS provided a comprehensive and pertinent forum to address all issues on key tracks of bilateral relations.\nHighlighting Pakistan’s contribution towards economic development in Afghanistan, Foreign Minister Qureshi expressed the hope that necessary steps would be taken to operationalize Ghulam Khan border terminal for Afghan transit trade, which would further facilitate Afghanistan’s trade with the rest of the world.\nHe said the return of peace and stability in Afghanistan would strengthen trade and energy corridor between Pakistan and Central Asia, and beyond. Qureshi underlined that the Intra-Afghan Negotiations would also provide an opportunity to address return of the Afghan refugees to their homeland with dignity and honour. It was critical that the return of Afghan refugees should be part of the peace and reconciliation process.\nHe assured his Afghan counterpart of Pakistan’s consistent support to Afghanistan on its path to peace and development.",
  "retrievedAt": "2025-08-11T19:45:55.172Z"
}
