{
  "title": "MoHR celebrates it’s growth and achievements over the last two years",
  "link": "https://www.app.com.pk/national/mohr-celebrates-its-growth-and-achievements-over-the-last-two-years/",
  "date_published": "2020-09-03T01:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP): Federal minister for Human Rights Shireen Mazari has called upon the European Union to implement the Responsibility to Protect and to intervene against the massive human rights violations by Indian forces in Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nHe said around 27 letters to UN Special Mandate holders were written in this regard as well as the ministry had highlighted the issue at the 43rd session of the Human Rights Council in Geneva, she added.\nAddressing the participants of an event organized by MoHR to celebrate its growth and achievements over the past two years, Shireen Mazari spoke about how no country in the world was free of human rights violations, and the importance of strengthening bilateral relations, international commitments, and accountability to improve human rights across the world.\nOver the past two years, the Ministry of Human Rights has successfully enacted six laws and drafted seven legislation besides taking practical measure to implement the laws through monitoring, training, institutional development and sensitization, she added.\nShe stated that significant progress has been made particularly with regards to the protection of children in the country, this included passing of the Zainab Alert, Response and Recovery Act, the ICT Child Protection Act 2018, and the Juvenile Justice System Act 2018.\nMoreover, a critical development was the insertion of “Child Domestic Work” in Part I of Schedule of the Employment of Children Act 1991 as a form of hazardous employment.\nhireen said that over the past two years, the MoHR has successfully established and strengthened grievance redressal mechanisms, and has taken up 6094 cases of human rights violations with the relevant authorities for redressal as well as around16924 complaints received on Pakistan Citizen Portal were processed, forwarded and referred in last two years, and 508 victims of human rights violations were given financial assistance of Rs. 6.52 million, she added.\nShe said that such event was aimed to celebrate MoHR’s growth and achievements over the past two years with relevant stakeholders, including donors, civil society organizations, members of the diplomatic community, and media representatives.\nShireen Mazari thanked all partners of the Ministry of Human Rights for their integral support, including UN organizations, the EU in Pakistan, the support of parliamentarians and the Cabinet, emphasizing the importance of strengthening collaboration and partnerships towards the promotion of human rights in Pakistan.\nFederal Secretary for Human Rights, Rabiya Javeri Agha addressing the audience spoke about the evolution of the Ministry of Human Rights, from a sub division of the Ministry of Law to a full-fledged Ministry with an expanding mandate.\nJaveri gave a presentation with a brief overview of critical developments of the Ministry of Human Rights in terms of strengthening legislation, institutional development, and progress in terms of awareness raising and advocacy for human rights in Pakistan.\nMost recently, this included the Reels for Rights Digital Film Festival which sought to raise awareness on a diverse array of human rights issues in Pakistan. Moreover, she highlighted the critical impact of strengthening treaty body reporting and implementation of human rights commitments in Pakistan. Notably, the Ministry of Human Rights successfully submitted 6 treaty body reports over the past 2 years.\nhe also highlighted recent advancements in terms of the rights of prisoners in Pakistan. The Ministry of Human Rights completed two reports on prison reforms and the plight of female prisoners in Pakistan.\nThe event was attended by Asad Umer, Minister of Planning Development & Special Initiatives; Shibli Faraz, Minister for Information and Broadcasting; Hammad Azhar, Minister of Industries and Production; and Shehzad Arbab, Special Assistant to the PM on Establishment. Ambassadors and foreign dignitaries from several countries were also present, along with representatives from UNDP, UNWomen, UNICEF and the EU Delegation in Pakistan.",
  "retrievedAt": "2025-08-11T19:45:57.460Z"
}
