{
  "title": "Asim Bajwa rejects allegations, says report meant to malign his reputation",
  "link": "https://www.app.com.pk/national/chairman-cpec-sapm-on-info-strongly-rebuts-baseless-allegations-levelled-against-him/",
  "date_published": "2020-09-03T15:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP): Special Assistant to the Prime Minister on Information and Broadcasting Lt Gen (retd) Asim Saleem Bajwa on Thursday categorically rejected the allegations levelled against him in a news item uploaded on a website by a journalist, which was totally false and aimed at maligning his reputation.\n“I have not shied away to explain the allegations shamelessly levelled against me. These allegations have been hurled at me to tarnish my image,” he said in a press statement.\nAsim Bajwa, who is also of Chairman of CPEC Authority, said a random mention had been made of the companies, businesses and properties, owned by his brothers and children, with sweeping allegations regarding their evaluation and propriety.\nEmphatically, all the adverse insinuations levelled in the news item in question were materially false, he added.\nI strongly rebut the baseless allegations levelled against me and my family.Alhamdolillah another attempt to damage our reputation belied/exposed.I have and will always serve Pakistan with pride and dignity. pic.twitter.com/j185UoGhx1\n— Asim Saleem Bajwa (@AsimSBajwa) September 3, 2020\nHe said the allegation that his declaration of assets and liabilities as an SAPM dated June 06, 2020 suffered from omission of investment of his wife abroad, was materially false. On the date of filing of the said declaration, his wife was no longer an investor or shareholder in any business of his brothers or anyone else, abroad.\n“My wife had disinvested all her interests as on June 01, 2020 in any entity abroad and such fact has been duly documented in the official records in the USA.”\nHe pointed out that the company registered in the Securities and Exchange Commission of Pakistan (SECP) in Pakistan was a liaison office of the companies in the United States of America (USA).\nThe process of change of name in the SECP in Pakistan, he added, had been conducted in due course, but that was only a ministerial function since the interest in the parent companies in the USA stood no more in the name of his wife as on June 06, 2020 – the date of filing of his declaration of assets and liabilities as an SAPM.\nKeeping in view the above mentioned actual figures, he said, it became clear that the news item was aimed at maligning his reputation.\nHe said during 18 years from 2002 to June 01, 2020, the total accumulated out of pocket investment made by his wife in the companies of his brothers in the USA stood at US $19,492.\n“This investment was made by my wife through my savings spread over a period of 18 years, all of which are fully accounted for,” he said, adding he did not violate rules or regulations prescribed by the State Bank of Pakistan at any stage.\nWith regard to the alleged investment of businesses of his brothers in the pizza chain PAPA JHON’S in the USA and DQ, UAE, Bajwa explained that Bajco Global Management, LLC was not parent of any company and was only a management company that provided management services to all Bajco related businesses on a fee basis.\n“Bajco Global Management, LLC does not have any ownership interest in any PAPA JHON’S in the USA, DQ, UAE or any real estate,” he added.\nRejecting another false claim that Bajco owned 99 companies, the CPEC Authority chairman said there were a total of 27 active companies in the US and two in the United Arab Emirates (UAE) and the report repeated the companies for multiple times.\nHe said during the time since 2002, his brothers purchased the franchise and assets related thereto and real estate to the tune of $70 million, out of which around $60 million were through bank loans and financial facilities.\n“Over a period of eighteen years the actual out of pocket cash investment into the said businesses by my brothers and wife has been about US$73,950.”\nHe further pointed out that out of US $73,950, his wife’s contribution, as stated aforesaid, was US$19,492, while the total out of pocket cash contribution of his five brothers, over a period of 18 years, stood at $54,458.\nThe cash contribution of $54,458 by his brothers was fully accounted for and relatable to their own sources and resources, he added.\n“Any further investments, over and above the amounts referenced above, by my brothers and my wife was done by reinvesting their share of profits from the businesses itself and are also fully accounted for.”\nAsim Bajwa said out of five brothers, two were qualified doctors; one brother had worked in the USA upto the status and position of a vice president in a US bank; one brother had worked up to the position of a controller of a restaurant operating company; and another brother had been an operating partner of a restaurant chain, before the start of their own businesses in 2002.\nHe clarified that none of his brothers was his dependent and their total out of pocket investment of $54,458 was fully documented and justified from their own sources.\nApart from his five brothers and his wife, he said, the businesses had at least 50 other investors.\nHe said it was out of question that how such highly qualified professionals working abroad managed to save $54,458.\nWith regards to allegations against his children’s businesses, he explained that the company in his son’s name, which was registered in the SECP, had never done any business and it had been dormant since inception.\nHe said his son owned only 50 percent shares of another company- Himalaya (Pvt) Ltd that was very small one which had earned accumulative profit of only less than Rs 500,000.\nHis son was the sole proprietor of a business entity namely Mochi Cordwainers, but it was a small entity and it had been in loss during previous five years, he added.\nClarifying the allegations that a business entity “Krypton”, owned by one of his sons, dealt with mines and minerals and was registered at the time when he was posted in Balochistan, Bajwa said the business entity was registered as a sole proprietorship in the FBR (Federal Board of Revenue)in 2019 but it neither opened any bank account not did any business.\nFurthermore, he said the companies, “Advance Marketing (Pvt) Ltd”  and Scion Natura LLC, owned by his sons were also dormant and had never conducted any business.\nReplying to the allegation that the company “Scion Management Group LLC”, owned by his sons had a house in the USA, the SAPM said the house in question was only bought for an amount of $31,000 in a cheap foreclosure proceedings, and the amount was fully justified by his two sons through their own independent sources.\nHe also termed the allegations as baseless that a business entity of his two brothers by the name of Silkline Enterprises (Pvt) Ltd had been formed to acquire CPEC (China Pakistan Economic Corridor) contracts.\n“It may be stated that this company has never acquired any CPEC contract. This company is in Rahim Yar Khan and has only provided labour/human resources to industries in Rahim Yar Khan region.”\nHe stated that one of his sons owned a house in the USA, which had been acquired through mortgage in the manner that 80 percent of loan/mortgage remains unpaid. It again was a small time-house and all his sons were above 18 years and none was his dependents,” he said adding that his sons completed their business degrees from reputable universities in the United States and had had well-paying jobs.",
  "retrievedAt": "2025-08-11T19:45:45.341Z"
}
