{
  "title": "Good ties with China, US sans joining any ‘camp’: PM Imran Khan",
  "link": "https://www.app.com.pk/national/good-ties-with-china-us-sans-joining-any-camp-pm-imran-khan/",
  "date_published": "2020-09-03T10:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP): Prime Minister Imran Khan has said that Pakistan enjoyed good relationship with both China and the United States without siding with any particular “camp”.\n“Pakistan does not have to be in any camp. Why can’t we have good relationship with everyone?,” the Prime Minister said in an interview with Aljazeera television, aired on Thursday.\nLIVE #APPNews : Prime Minister Imran Khan interview with Aljazeera TV https://t.co/mDo9FwF4MZ\n— APP   (@appcsocialmedia) September 3, 2020\nThe interview with senior correspondent Hashem Ahelbarra at ‘Talk to Aljazeera’ programme gave an insight into PM Imran Khan’s views on his first two years in office, fight against corruption, coping with geopolitical changes, economy, media freedom and the country’s response to coronavirus pandemic.\nThe prime minister said every country looked to its own interests and for Pakistan, “Our future is now linked to China, progressing at faster pace than any other country in the world”.\nHe dismissed any renegotiation with China over amending the terms of $62 billion Economic Corridor, saying that “the relationship with China was better than even before”.\nImran Khan said Pakistan would like to benefit from the way China made progress and lifted its people out of poverty.\nAsked if Pakistan considered ‘resetting’ ties with the US being critical of CPEC, he said, “We probably have the best relationship with US right now as compared to a few years ago, because in Afghanistan, we are ‘partners with peace’.”\nWould Pakistan favour a power-sharing agreement in future between government of Afghanistan and Taliban, the Prime Minister said, “Whatever the Afghans think is good for them, is good for us…After Afghanistan, the country which has stakes in the Afghan peace, is in fact Pakistan.”\n“With 19 years of war and bloodshed in Afghanistan, anyone to believe in this utopia that suddenly they will all live together, I am afraid it is a very complicated situation,” he said.\nHe mentioned that Pakistan tried its best to somehow get Taliban and the Afghan government sit on negotiation table, adding that “This is a miracle that’s actually happening.”\nImran Khan said Pakistan would use “whatever influence it could” in restoration of peace in Afghanistan and recalled his persistent stance of supporting a political rather than a military solution to the conflict.\nHe said spoilers, particularly India, did not want peace and stability to return to Afghanistan.\nOn India’s revocation of special status of Jammu and Kashmir, Imran Khan said Pakistan would continue highlighting the issue at international level, however he stressed that efforts were ‘not only to support Kashmiri people, but the fact that the issue can have serious regional and global implications”.\n“The ruling party in India inspired by RSS was thrice outlawed as terrorist organization and now, being nuclear-armed, it is controlling 1.3 billion people. This is a tragedy for sensible people of India to think over,” he said.\nHe said unfortunately, the commercial interests of certain countries made them ignore India’s “huge travesty of justice”.\nOn Foreign Minister Shah Mahmood Qureshi seeking greater role of Organization of Islamic Countries (OIC) in resolution of Kashmir dispute, he said, “Yes, we wanted OIC to take a more front role in the whole thing.” However, he stressed that “Saudi Arabia will always be a friend of Pakistan”.\nImran Khan said he had all the support of military on his government’s policies as both institutions worked in “complete coordination”.\n“The military stands with the democratic government’s policies whether it relates to India or peaceful solution to Afghanistan. Everywhere, the military stands with us,” he said, when asked to comment on relations with top army brass.\nThe governments in past had “chequered and uneasy relationships” with army, however, “We have an excellent relationship. I honestly think it is the most harmonious relationship,” he said.\nImran Khan said the biggest change that his government brought in two years was the country ridding of its elite capture.\n“The difference between the Pakistan of now and before is that our main concentration is people-centric policies to ensure better justice, education and health systems,” he said.\nHe mentioned that for the first time, health insurance was announced for poor and a uniform education syllabus would also be launched by next year.\n“We are changing the way Pakistan will emerge and grow,” he said.\nAsked if delivered his promises of economic turn-around, Khan recalled that his government inherited huge deficit, both external and internal, besides serious problems of power sector.\n“No country can immediately snap fingers to get reforms get implemented at once. It’s a struggle. Moving the economy and its reformation is not an overnight thing,” he said.\nHe said Pakistan was moving in right way with introduction of ease of doing businesses, however pointed that mindset of ‘incentive structure’ needed to be changed.\nTo a question on success against corruption as regarded by host “always a vocal critic of endemic corruption”, the Prime Minister said presently, there was “no mega corruption case in Pakistan after it was controlled by the government at top tier”. For the first time in our history, the powerful who misused authority to make money, are being held accountable, he said.\nHowever, he admitted that corruption prevailed at lower levels requiring a struggle and lots of steps to counter.  Asked about successful overcoming of the COVID-19 pandemic, the Prime Minister said going for the “difficult but best decision of smart lockdown instead of blanket lockdown” helped in decline of cases.\nHe mentioned that the step taken in humanitarian perspective saved the poor daily bread-earners and informal workforce, who otherwise could starve to death. On freedom of media, he rejected the impression of any clampdown or intimidation of journalists, saying that his government was the one that received open and strong criticism from media, even in a propaganda manner.\n“Unfortunately, it is us, the government and the ministers, who feel unprotected, it’s not the media,” he said, adding that “If someone publishes a fake news against a prime minister, who then takes him to the court, is that intimidation?\nImran Khan said spending 20 years in England, he was aware that if similar happened to the British prime minister, the media would have been sued by millions for libel. On issue of Palestine, the Prime Minister said any one-sided settlement imposed on Palestinians would not work. “Israel must recognize a just settlement for a viable state for Palestinians,” he said.\nAsked about the recent growing ties between the United Arab Emirates and Israel, he said “the issue was not going to die down even if some countries recognized Israel.”  It (issue) will just keep festering and it is in Israel’s interest to ensure a just settlement, he said.",
  "retrievedAt": "2025-08-11T19:45:48.978Z"
}
