{
  "title": "Modi using Islamophobia as a tool for furthering his political doctrine: Shibli",
  "link": "https://www.app.com.pk/national/modi-using-islamophobia-as-a-tool-for-furthering-his-political-doctrine-shibli/",
  "date_published": "2020-09-03T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP): Minister for Information and Broadcasting Senator Shibli Faraz on Thursday said the Muslims in India had been at high risk since the ascending to power of the Bharatiya Janata Party led by RSS (Rashtriya Swayamsevak Sangh) trained fascist Indian Prime Minister Narendra Modi, who believed in the concept of racial superiority and consolidated his vote bank largely around the hatred against them (Muslims).\nSpeaking as chief guest at a seminar “India – epicentre of Islmaophobia” here, Senator Shibli said the concept of Islamophobia had been a daunting reality as in its latest manifestation, it had become a tool in the hands of Modi, who cherished it as his key political doctrine.\n“Twice his election as a prime minister in 2014 and 2019, despite being the mastermind of brutal killing of countless Muslims during the Gujarat riots in 2002 clearly highlights that the so-called secular India is in the midst of turning officially into a country for Hindus only.”\nHe said Modi needed to be snubbed as his Islamophobic designs did not augur well for the global peace. Modi should understand that minorities in India deserved the right to equality before the law, freedom of religion and protection from religious hatred.\nModi’s notion, he said, bore serious ramifications for peace as he encouraged demonization of the Muslims on the basis of religion, and empowered right-wing ethno-nationalists, who had already started leashing out genocidal policies against minority groups in India, particularly the Muslims. “This authoritarian attitude not only puts the lives of millions of Indian Muslims at stake but predicts an imminent humanitarian crisis that may extend beyond borders,” he remarked.\nThe minister said,“Modi aims to wipe off Muslims from the political and social fabric of India in a sequential two-fold manner, that is vilification of Muslim history and depriving Muslims of their fundamental human rights like freedom of religion, participation in public affairs and protection as a minority.”\nHe said recently, Modi laid the foundation of Ram Temple on the anniversary of revocation of special status of Indian Illegally Occupied Jammu and Kashmir(IIOJK), whose Muslim majority had been struggling for their right to self-determination as per the resolutions of United Nations Security Council.\nThe IIOJK, he said, had been under a strict lockdown for more than one year now with communication links to the outer world cut off and demographic engineering was being carried out in the blood-stained valley via controversial domicile and property laws amid grave human rights violations, mass detentions and extra-judicial killings.\nShibli Faraz sadi the condition of Muslims in the rest of India was also not different. “They face extreme discrimination, mob attacks, lack of police protection and now even has the fear of loss of citizenship.”\nThe discriminatory Citizen Amendment Act (CAA) announced in December 2019, he said, “grants amnesty to religious minorities, including Hindus, Sikhs, Jain, Buddhist, Parsis and Christians who migrated to India prior to 2015 from Muslim majority countries like Pakistan, Afghanistan or Bangladesh. Unsurprisingly, the only major religion that has been left out is Islam – the second largest religion in India with over 200 million followers.”\nHe said the implementation of National Register of Citizenship (NRC) nationwide forced millions of Muslims to prove their citizenship or fear being taken to internment camps. “In order to qualify for inclusion in the official NRC in Assam, all Muslim residents have to provide the government with evidence that their families had migrated to India before 1971. Hence, to ensure their right to remain in the country of their birth, generations of Indian Muslim now need to provide their grand-parents’ legal documents – most of which did not exist anymore.\n“This transition of Indian politics towards Islamophobia has been gradual and well-thought out,” he said, reminding that the first major blow to religious diversity and inclusion in India came in 1992, when Babri Mosque in Ayodhya was stormed by tens of thousands of hardline Hindus. The ghostly face of Modi’s politics was fully exposed in 2002 during the Gujarat riots, which earned him the famous title ‘Butcher of Gujarat’.\nShibli Faraz said the violence that Modi instigated as the chief minister of Gujarat had now spread all across India like wild fire and “this time as a premier he has the leverage to play with national legislations and international politics as well.\n“Unfortunately, Modi’s doctrine is nothing but a campaign of racial and religious hatred. It is only a matter of time before this Modi fuelled fascism turns fatal and tears down the social fabric of India.”\nThe minister said today,  the slogan of ‘Shining India’ was scarred with incidents of mob lynching of Dalit ‘untouchable’ caste, beating up of Muslims on account of cow meat,  failure of police to protect minorities and deprivation of Muslims of their birth citizenship.\nHe said Prime Minister Imran Khan raised the issue of Islamophobia at the highest forum of United Nations and reiterated that Pakistan would continue to highlight the discrimination against Muslims at all forums.\nEarlier in his opening remarks, Secretary Information and Broadcasting Akbar Durrani said the seminar was part of the government’s endeavour to highlight Indian brutalities on the Muslims in India and IIOJK. Its objective was also to counter the Indian propaganda and expose Modi’s steps to convert India into a Hindu Rashtar.\nHe said the Kashmiris were the worst victim of atrocities of hard-line Indian regime, which imposed the military clampdown in the IIOJK in August last year, following illegal abrogation of Kashmir specific articles 370 and 35-A from the Indian Constitution protecting the Kashmiris’ rights.\nIndia, he said, also introduced the controversial Citizenship Amendment Act, which singled out the Muslims from the neighbouring countries in getting Indian nationality. The Modi government was using the coronavirus as a tool to crush the Muslims, who were subjected to one lockdown to another lockdown, he added.\nAkabr Durrani asked the international community to pressurize India to stop the wave of Islamophobia and let the Muslim community live peacefully in that country.\nCouncil of Islamic Ideology (CII) Chairman Qibla Ayaz said fear and hate of Islam also existed in the Europe and the United States.\nIndian PM Modi, he said, had a long history of Islamophobia and he pursued the fear of Islam as a tool to come to power. The repercussions of Islamophobia in India were not regional but global.\nHe said at a time when the entire world was fighting the coronavirus, India had discriminated the Muslims for their religious beliefs. The Muslim of IIOJK were not allowed to go out and get treatment during the outbreak of corona pandemic.\nProfessor Bakare Najamuddin of the National University of Science and Technology (NUST) said the notion of Islamophobia was being used by Modi to create fear among Hindus and increase his vote bank. The motto of Modi regime was based on the threat that either to become Hindu or face discrimination of the worst kind.\nThe sentiments of Islamophobia existed in India but the BJP and the RSS fanned them in a systematic manner, he added. Dr Shabana Imtiaz of the Quaid Azam University said the Muslims in India were discriminated and socially stigmatised for their religion Islam. India was the most fractured democracy of the world where Tableeghi Jamaat was blamed for spread of the pandemic.\nDr Zafar Iqbal said the Kashmiris already facing the worst Indian atrocities were further crushed in the name of lockdown after outbreak of the corona virus.\nFormer ambassador Abdul Basit said there was a collusion of media and corporate sector in India. In Modi’s India, the Muslims were facing the worst type of discrimination and were treated as second rate citizens.",
  "retrievedAt": "2025-08-11T19:45:46.900Z"
}
