{
  "title": "Misbah Khar meets Syrian Ambassador",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP):Advisor to the Chairman Senate and Ambassador for the Inter-Parliamentary Speakers’ Conference (ISC), Misbah Khar, on Tuesday held a meeting with the Ambassador of Syria in Pakistan Dr. Ramez Alrae, to discuss matters of mutual interest and parliamentary cooperation.\nDuring the meeting, Misbah Khar formally conveyed an invitation to the Syrian parliamentary delegation to participate in the upcoming Inter-Parliamentary Speakers’ Conference.\nShe highlighted that the conference, being organized under the theme “Peace, Security and Development”, will provide a significant platform for legislatures across the globe to deliberate on collective responses to pressing global and regional challenges.\nThe Advisor underlined Pakistan’s commitment to fostering dialogue, parliamentary diplomacy, and collaborative initiatives aimed at strengthening peace and development in the region and beyond.\nShe expressed confidence that Syria’s participation would contribute positively to the deliberations and enrich the outcomes of the conference.\nThe two sides also exchanged views on bilateral relations and agreed on the importance of enhancing institutional linkages through regular parliamentary exchanges, knowledge-sharing, and joint initiatives.\nThe Syrian Ambassador appreciated the invitation and acknowledged the relevance of the conference theme in the current global environment.\nHe expressed the hope that the participation of the Syrian parliamentary delegation would further promote understanding, goodwill, and closer ties between the two brotherly countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:39:45.284Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/misbah-khar-meets-syrian-ambassador/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T19:13:00.000Z"
}
