{
  "title": "Differences between PML-N, PPP ‘family matters’: Tarar",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP):Federal Minister for Law and Justice Azam Nazeer Tarar on Tuesday said that differences between the Pakistan Muslim League-Nawaz (PML-N) and the Pakistan Peoples Party (PPP) were internal matters, but their alliance remained intact and was based on ideology and sincerity.\nResponding to a point of order raised by PPP leader Syed Naveed Qamar in the National Assembly, he said, “If anyone has been hurt by words, we apologize. Politics comes with ups and downs, and such verbal exchanges happen. These issues will be resolved within the house, as our focus is to strengthen democracy and the country.”\nHe added that the alliance had delivered success for Pakistan “from Saudi Arabia to the United Nations,” stressing that it was founded on good faith. “Today, the Custodian of the Two Holy Mosques has declared Pakistan’s people as guardians of the Haramain Sharifain,” he noted.\nEarlier, speaking on a point of order, Syed Naveed Qamar highlighted the flood situation across the country, particularly in his constituency, where villages and farmland were submerged.\nHe said that people were distressed and looking to the national leadership for relief and rehabilitation.\nQuoting a Food and Agriculture Organization (FAO) report, he warned that upcoming Rabi crops were at risk and immediate recovery efforts were needed.\n“Speeches alone will not solve the crisis. We must show compassion for those whose responsibility lies on our shoulders,” he said.\nNaveed Qamar said PPP Chairman Bilawal Bhutto Zardari had visited flood-hit areas and even appreciated the Punjab Chief Minister’s response.\nHe said that while Punjab rarely faced such disasters, Sindh was affected every year, stressing the urgent need for post-flood rehabilitation.\nRecalling the World Bank-supported housing project in Sindh after previous floods, Naveed said it had succeeded and encouraged other institutions to extend assistance.\n“As coalition partners, we can advise, but criticism should not be taken negatively,” he added, expressing disappointment over recent political statements.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:41:45.490Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/differences-between-pml-n-ppp-family-matters-tarar/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T13:37:00.000Z"
}
