{
  "title": "Ayaz congratulates people, leadership of China on 76th National Day",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP):Speaker National Assembly, Sardar Ayaz Sadiq, on behalf of the Parliament and people of Pakistan, extended heartfelt felicitations to  Xi Jinping, President of the People’s Republic of China, Li Qiang, Premier of the State Council, Zhao Leji, Chairman of the Standing Committee of the National People’s Congress on the 76th National Day of the People’s Republic of China.\nThe speaker also extended felicitation to the Chinese nation, China celebrated the day annually on 1st October with tremendous zeal across China.\nPaying rich tribute to the visionary leadership and remarkable services of Chairman Mao Zedong, Speaker NA stated that Mao Zedong laid the foundation for China to emerge as a major global power and presented a revolutionary model for the developing world.\nHe further stated that the phenomenal achievements of modern China continue to serve as a beacon of inspiration for the international community. He added that the Pakistan-China friendship stands as a living testament to the shared vision of peace, prosperity, and stability in the region.\nSardar Ayaz Sadiq underscored that the unparalleled bond between Pakistan and China is built on mutual trust, respect, and shared interests, and has withstood the test of time. Appreciating China’s unwavering solidarity with Pakistan in the face of India’s recent aggression, he lauded Beijing’s firm stance on international and regional forums in support of Pakistan. He emphasized that China has consistently raised its voice against injustice, aggression, and all forms of terrorism.\nCommending the launch of CPEC 2.0, Speaker NA highlighted the initiation of five new corridor projects focusing on agriculture, information technology, artificial intelligence, minerals, and industrial relocation.\nHe said these projects would not only accelerate Pakistan’s industrial and economic growth but also enhance people-to-people linkages.\nAyaz Sadiq also appreciated the signing of joint ventures and agreements worth USD 8.5 billion during the second Pakistan-China Business-to-Business Investment Conference in Beijing, covering sectors such as agriculture, technology, and infrastructure.\nHe termed these agreements as a milestone in Pakistan’s long journey of economic progress. Referring to the 2024–2029 Joint Action Plan, he underlined its significance as a comprehensive roadmap for strengthening bilateral cooperation across diverse sectors. He further lauded ongoing collaboration in defense and technology, stressing that such cooperation would reinforce peace, stability, and defense capabilities in the region.\nSardar Ayaz Sadiq also appreciated the growing trade and investment initiatives between the two countries, including the 4th Health, Engineering, and Minerals Expo in Lahore, which witnessed the participation of 200 Chinese companies and resulted in a number of agreements and MoUs. He also acknowledged the MoUs signed during the recent visit of the President of Pakistan to China for enhancing cooperation in multiple fields, terming them a positive step towards regional prosperity.\nReaffirming the depth of the bilateral bond, Speaker Sardar Ayaz Sadiq remarked, “The friendship between Pakistan and China is higher than the Himalayas, deeper than the oceans, and sweeter than honey.” He expressed confidence that under the sagacious leadership of both nations, this unique and time-tested friendship would continue to grow stronger, opening new avenues of peace, development, and prosperity for Pakistan, China, and the entire region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:40:58.287Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ayaz-congratulates-people-leadership-of-china-on-76th-national-day/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T16:01:00.000Z"
}
