{
  "title": "Kamal chairs meeting on dengue situation",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP): A high-level meeting to review the current dengue situation was held on Tuesday under the chairmanship of Federal Minister for Health, Syed Mustafa Kamal.\nDuring the meeting, participants were briefed on the spread of dengue in Islamabad and other affected areas, the current number of cases, and the ongoing measures being taken to control the outbreak.\nThe Federal Minister stressed the need to make dengue prevention campaigns more effective and directed that dedicated wards be allocated in hospitals for dengue patients.\nHe also instructed that the availability of medicines, beds, and diagnostic facilities be ensured in all health facilities.\nKamal said the government is taking coordinated and effective steps to curb the spread of dengue, particularly in view of the recent rise in cases due to heavy rains. Special measures are being implemented in high-risk areas, including Bhara Kahu, with intensified surveillance, spraying, precautionary measures, and public awareness campaigns.\nHe further directed district administrations to play an active role in improving sanitation systems, while urging citizens to strictly follow the Ministry of Health’s guidelines for dengue prevention.\n“The protection of public health is the government’s top priority. We will utilize all available resources to safeguard people from epidemics and diseases,” said Federal Minister Syed Mustafa Kamal, emphasizing that media and civil society must also play a vital role in raising awareness.\nThe meeting was attended by the Federal Secretary Health, Additional Secretary, Director General Health, Joint Secretary Health, and District Health Officer Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:39:11.978Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kamal-chairs-meeting-on-dengue-situation/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T20:25:00.000Z"
}
