{
  "title": "CM Sindh, Ethiopian envoy pledge to deepen bilateral ties",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP):Ethiopian Special Envoy and Ambassador Extraordinary Dr. Jemal Beker Abdula called on Sindh Chief Minister Syed Murad Ali Shah in Karachi on Tuesday to discuss the growing bilateral cooperation between the two countries.\nThe various sectors, including trade, investment, aviation, tourism, culture, and climate change, were discussed between  them, said a press release issued here.\nDuring the meeting, both sides agreed to explore new avenues of partnership in agriculture, agro-processing, education, and health to further consolidate bilateral ties.\nAmbassador Dr. Jemal Beker lauded the Chief Minister’s recent initiative to host a high-level Ethiopian delegation for a Green Dialogue at the Chief Minister Sindh House recently. This visit, he added, plays a crucial role in formalizing bilateral cooperation against climate change.\nAmbassador Dr. Jemal Beker also briefed the Honorable Chief Minister on the preparations underway in Addis Ababa to host a large number of delegates for Pakistan’s Single Country Exhibition scheduled for October in Ethiopia.\nHe also praised the increasing connectivity between Pakistan and Africa, facilitated by Ethiopian Airlines, underscoring its key role in Pakistan’s Look Africa and Engage Africa policies.\nChief Minister Murad Ali Shah called Ethiopian Airlines as a game-changer for Pakistan-Africa relations, lauding the carrier as a key instrument of the Look Africa and Engage Africa policies.\nThe CM Sindh also appreciated the Ambassador’s effective role in strengthening the bilateral relations between the two countries.\nMurad Ali Shah vowed to further enhance bilateral cooperation to elevate the relationship to a high degree.\nMr. Ibrahim Khalid Tawab, Honorary Consul of the FDR Ethiopia in Karachi, was also present during the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:41:24.405Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cm-sindh-ethiopian-envoy-pledge-to-deepen-bilateral-ties/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T14:40:00.000Z"
}
