{
  "title": "SC continues hearing in super tax case",
  "author": null,
  "content": "ISLAMABAD, Sep 30 (APP):The Supreme Court’s constitutional bench on Tuesday continued hearing the case related to the imposition of super tax, as counsel for the companies, Shehzad Ata Elahi, concluded his arguments.\nThe five-member bench, headed by Justice Aminuddin Khan and comprising other senior judges, heard the matter.\nPresenting his arguments, Elahi contended that taxation should be applied in a routine and predictable manner, not through ad-hoc measures.\nHe said, “We are ready to pay all taxes, but there should not be a new levy introduced every now and then.\nJustice Muhammad Ali Mazhar questioned the structure of the Finance Bill, noting that it was intended for the upcoming fiscal year and not for retrospective application.\nCounsel Elahi also argued that while a 30 percent tax had been imposed on corporate entities, no such burden had been placed on non-corporate sectors, citing a relevant Sindh High Court judgment.\nAfter Elahi’s submissions, Justice Aminuddin Khan asked who would present arguments next. Senior counsel Salman Akram Raja stated that he required only an hour to make his submissions.\nWhen reminded that he was earlier expected to adopt the arguments of Makhdoom Ali Khan, Raja clarified that he had one specific point to raise independently.\nThe bench then decided that Raja would give his arguments before the break in the next hearing, after which counsel Farogh Naseem would begin his submissions.\nRaja, however, informed the court that he would not be available on Wednesday and requested an hour on Thursday to conclude.\nJustice Aminuddin Khan remarked that the court was keen to dispose of the case at the earliest. The hearing was then adjourned until Wednesday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:41:22.648Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-continues-hearing-in-super-tax-case/",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T15:09:00.000Z"
}
