{
  "title": "Australia celebrates growing bonds with Pakistan",
  "author": null,
  "content": "ISLAMABAD, May 22 (APP): The Australian High Commission hosted its annual Australia Day in Spring reception in Islamabad, celebrating the strong and growing connections between the people of Australia and Pakistan.\nThis year’s event focused on the theme of people-to-people ties, brought to life through a vibrant mix of cultural experiences.\nGuests were welcomed by kangaroos painted in Pakistani truck art style, the sounds of native Australian birds, and digital displays highlighting the natural beauty of Australia’s six states and two territories.\nIn his remarks, High Commissioner Neil Hawkins emphasized the deep roots and bright future of the bilateral relationship.\n“This relationship is powered by people,” he said. “From the Baloch cameleers who helped shape Australia’s outback, to the more than 100,000 Pakistanis who now call Australia home, and the 20,000 students currently studying in Australia—our ties are living, growing, and deeply rooted.”\nHawkins highlighted over four decades of cooperation in agriculture and water management, as well as longstanding defence collaboration. He also pointed to Australia’s continued support for climate resilience, education, and gender equality in Pakistan through grassroots partnerships.\n“Ours is a relationship built on cooperation and shared experience—scientists tackling salinity together, girls playing cricket, alumni shaping Pakistan’s future,” he said. “This friendship is not just official—it’s about connections between ordinary people. And it’s growing stronger every day.”\nThe event served as a vibrant reminder of the enduring friendship between Australia and Pakistan, grounded in mutual respect, collaboration, and community.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:47:31.627Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/australia-celebrates-growing-bonds-with-pakistan/",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T07:33:00.000Z"
}
