{
  "title": "Business confidence turns positive: OICCI survey shows 16-point surge in sentiment",
  "author": null,
  "content": "ISLAMABAD, May 22 (APP):The Overseas Investors Chamber of Commerce and Industry (OICCI) on Thursday unveiled the findings of its Business Confidence Index (BCI) Survey – Wave 27, reflecting a significant improvement in business sentiment across Pakistan.\nThe survey, conducted in March-April 2025, shows an increase in overall confidence from -5% to +11%, marking a 16-percentage point surge compared to the previous wave (October-November 2024).\nThe announcement followed a meeting between OICCI leadership and Federal Minister for Finance and Revenue Senator Muhammad Aurangzeb, during which the minister lauded the positive trend, calling it a reflection of Pakistan’s stabilizing economy.\nThe upward shift in business sentiment has been attributed to improving macroeconomic indicators, falling inflation, and optimistic projections for the next six months.\nThis sharp recovery in the Business Confidence in the  latest Wave 27 reflects the resilience of Pakistan’s business sector and its readiness to seize emerging growth opportunities.\nIt is heartening to see positive momentum across key sectors, which reflects improved sentiment and growing trust in the country’s economic\nThe BCI Wave 27 survey revealed increased optimism for the next six months, with 45 percent of the respondents expressing positive expectations.\nKey contributors to this positive outlook include economic growth, improved government policies, investment climate, and security situation.\nDespite the positive trend, 53 percent of the survey respondents reported a negative outlook on business conditions over the past six months, which is a substantial improvement from 66 percent negative sentiments in Wave 26.\nThe key concerns indicated in the survey related to political stability, Rupee FX parity, Energy, and trade policies.\nThe BCI of foreign investors, OICCI members randomly selected for the survey, showed a remarkable increase from positive 6 percent to 17 percent.\nThis improvement is primarily attributed to better global business climate, an improved industry environment in Pakistan over the past six months, and expectations of increased capital investment in the coming six months.\nAddressing a press conference, Abdul Aleem, Chief Executive/Secretary General OICCI, further highlighted, “The latest BCI Wave 27 results were better than anticipated, with positive expectations reflected across all major sectors. Employment prospects, expansion plans, and investment expectations demonstrated notable gains, particularly in the Manufacturing and Retail sectors.\nDespite notable improvement on the overall BCI”,Abdul Aleem added, “the\nnew investment plans overall showed an improvement of 19 percent, but remained negative, which is an area of concern and needs to be addressed to further accelerate economic growth, energize Large Scale Manufacturing, trade and export.”\nLooking ahead, the BCI Wave 27 respondents highlighted inflation, taxation, inconsistent government policies, and rupee devaluation as the key threats in order of priority.\nThe top two concerns remain unchanged from the previous wave, indicating ongoing challenges in these areas.\nThe OICCI BCI survey is conducted twice a year and reflects the views of major business  stakeholders representing nearly 80 percent of Pakistan’s GDP. The survey covers responses from various sectors, including Manufacturing, Services, and Retail/Wholesale, and assesses perceptions at regional, national, and business entity levels.\nThe survey is conducted face to face throughout the major business centers of the country including Karachi, Lahore, Rawalpindi /Islamabad, Peshawar, Faisalabad etc.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:47:06.493Z",
  "source": "APP",
  "link": "https://www.app.com.pk/business/business-confidence-turns-positive-oicci-survey-shows-16-point-surge-in-sentiment/",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T10:29:00.000Z"
}
