{
  "title": "Kashmiris to decide fate of J&K through plebiscite: DPM",
  "author": null,
  "content": "ISLAMABAD, May 22 (APP): Deputy Prime Minister and Foreign Minister Ishaq Dar Thursday said Jammu and Kashmir was a disputed territory and its fate will be decided by Kashmiris by exercising their right to self-determination in a plebiscite.\nHe was speaking at the All Pakistan Chambers Presidents conference.\nHe said India illegally revoked the special status of Jammu and Kashmir in its constitution after the Pulwama incident.\nIndia wanted to create its hegemony in the region but its designs were foiled during the recent operation conducted by Pakistan, he added.\nIshaq Dar said Pakistan achieved an unprecedented and historic military victory against India, adding Pakistan took steps in its defence against the aggression of India.\nPakistan shot down Rafale planes, which caused great humiliation for India in the world, he remarked.\nHe said India fired missiles into its own territory and then put the blame on Pakistan.\nPakistan was a peaceful country and its desire to keep peace should not be considered a weakness, he noted.\nHe said Pakistan offered to India an independent investigation into the Pahalgam incident.\nHe said after the Pahalgam incident, Indian media created a hype and blamed Pakistan for the incident. India asked Pakistan to reduce its diplomatic staff in High Commission New Delhi and cancelled valid visas of Pakistani citizens.\nIndia also closed the Attari border with Pakistan, he explained.\nHowever, he said Pakistan was not involved in the incident in any way and the Foreign Office issued a condolence.\nIndia took measures against Pakistan without naming it as responsible for the Pahalgam incident, he said adding India unilaterally suspended the Indus Waters Treaty.\nHe said during the crisis with India, Pakistani nation showed exemplary unity and resolve\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:47:35.346Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmiris-to-decide-fate-of-jk-through-plebiscite-dpm/",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T18:13:00.000Z"
}
