{
  "title": "Ground breaking ceremony of Public Facilitation Centre at SC held",
  "author": null,
  "content": "ISLAMABAD, May 22 (APP): The Supreme Court has taken the initiative to set up a dedicated Public Facilitation Centre, designed to place litigants and citizens at heart of judicial service delivery system.\nAt the ground-breaking ceremony, Justice Jamal Khan Mandokhel, Chairman of the Court’s Building Committee, performed the task in the presence of the Chief Justice of Pakistan, fellow Justices, the Attorney General for Pakistan, representatives of the Supreme Court Bar Association, and officers from the Capital Development Authority (CDA), NESPAK, and the Supreme Court administration.\nSpeaking on the occasion, the Chief Justice underscored that “litigants are the pulse of judicial reform,” stressing that every touch-point must be respectful, seamless, and located “under one roof.”\nHe noted that while many services already exist, their dispersion across different wings had burdened the visitors. The Centre will therefore consolidate filing counters, certified-copy desks, information kiosks, and facilitation booths into a single, citizen-centric hall, supported by modern technology integration such as biometric queue management, self-service e-kiosks, and real-time case-status displays.\nRegistrar, Muhammad Salim Khan, highlighted that the project originated from Justice Mandokhel’s vision to remove physical hurdles and create an accessible interface between the public and the court.\nNESPAK architects presented a brief overview of the design, which features barrier-free access, a digital help-desk, and a comfortable waiting lounge. The CDA has committed to establishing a dedicated bus stop and shuttle connection, ensuring smoother transit for visitors arriving from across the Capital.\nAppreciating Building Committee’s milestone achievement, the Chief Justice expressed confidence that the Centre will “translate constitutional promises into everyday convenience,” reaffirming the Supreme Court’s resolve to harness technology for faster, fairer, and more transparent justice system.\nHe further announced that the Public Facilitation Centre is scheduled to be completed within two months, marking one of the fastest civil-works turnarounds in the court’s history. Construction begins immediately, with phased service migration planned to minimise any disruption to ongoing court business.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:46:19.542Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ground-breaking-ceremony-of-public-facilitation-centre-at-sc-held/",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T12:44:00.000Z"
}
