{
  "title": "SC rejects pleas to postpone Reserved Seats hearing, approves Live Streaming",
  "author": null,
  "content": "ISLAMABAD, May 22 (APP): The Supreme Court’s Constitutional Bench on Thursday dismissed multiple petitions filed by the Sunni Ittehad Council (SIC), including objections to the composition of the bench and a request to delay proceedings until verdict on the 26th Constitutional Amendment was announced.\nThe court, however, accepted a separate request for live streaming of the proceedings.\nA full-court bench, comprising eleven judges, headed by Justice Amin-ud-Din Khan, heard the review petitions related to the earlier verdict on reserved seats.\nRepresenting the women affected by the July 12 decision, senior lawyer Makhdoom Ali Khan continued his arguments on the SIC’s miscellaneous applications. He contended that under Article 191A of the Constitution and the Practice and Procedure Act, the Supreme Court’s 1980 rules were not applicable to the current bench.\nJustice Jamal Mandokhail inquired which 1980 rules conflicted with the new constitutional amendment. Makhdoom Ali Khan responded that the 1980 rules did not align with the review jurisdiction as defined by the recent constitutional amendments.\nHe argued that previously, review petitions were heard by the same bench that issued the original verdict, but the 26th Amendment now mandated that constitutional benches heard reviews of constitutional interpretations. He also clarified that, in his view, the current bench consisted of thirteen judges, not eleven, and any decision on the review would require a majority of at least seven.\nExplaining the issue of live streaming, Makhdoom Ali Khan said a petition had been filed requesting live coverage of the proceedings. He emphasized that it was the Court’s prerogative to decide on the matter, and he had no objection if the court allowed it.\nRegarding the request to postpone proceedings until after the 26th Amendment ruling, he stated that it was solely up to the court to decide the hearing schedule and not based on individual preferences. He warned that accepting such a request could set a precedent, prompting other petitioners to make similar demands.\nAfter hearing the arguments, the court issued its decision approving the application for live streaming but rejected SIC’s objections to the bench composition and the request to postpone the hearing.\nThe Supreme Court ordered its IT department to make arrangements for live streaming of the review proceedings. The hearing on the review petitions regarding reserved seats was adjourned until May 26.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:46:20.883Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-rejects-pleas-to-postpone-reserved-seats-hearing-approves-live-streaming/",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T12:08:00.000Z"
}
