{
  "title": "Caretaker PM says govt. continuing its efforts to promote, safeguard human rights",
  "link": "https://www.app.com.pk/national/caretaker-pm-says-govt-continuing-its-efforts-to-promote-safeguard-human-rights/",
  "date_published": "2023-12-09T18:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar has said that the Government of Pakistan would continue its efforts to promote and safeguard human rights, both domestically and internationally.\nHe reiterated Pakistan’s unflinching resolve to further advance respect for and protection of the rights and freedoms of all our citizens as enshrined in the Constitution as well as in the Universal Declaration of Human Rights.\n“Pakistan has consistently demonstrated its commitment to this cause, evident through various initiatives and policies aimed at protecting the dignity and rights of its citizens,” the caretaker prime minister said in a message on the occasion of International Human Rights Day being observed on December 10.\nThe prime minister said that this year’s theme “Freedom, Equality and Justice for All” was very apt and relevant. Pakistan joined the international community in commemorating the 75th anniversary of the adoption of the Universal Declaration on Human Rights.\nThis historic declaration enshrined the inalienable rights to which all individuals were entitled – regardless of race, colour, religion, sex, language, political or other opinion, national or social origin, property, birth or other status.\nThe prime minister said that some key initiatives taken by the government of Pakistan included ratification of core human rights conventions, incorporation of fundamental rights in the constitution of Pakistan, enactment of human rights laws and establishment of institutions for prevention and protection of rights.\nSpecial laws have been enacted for the protection of the rights of vulnerable population including women, children, minorities, persons with disabilities, senior citizens and transgenders, he added.\nTo ensure implementation of these laws, the prime minister said the government had established the National Commission for Human Rights (NCHR) with the power to take cognizance of the violation of human rights, the National Commission on Status of Women (NCSW) with the mandate to inquire into violations of women rights, and the National Commission on the Rights of Child (NCRC) with the mandate to take all necessary measures for protection of child rights including inquiry into cases of violation.\nThe Family Protection and Rehabilitation Centre in Islamabad provided temporary shelter and psycho-social counseling to victims of violence, he said, adding similarly, the establishment of Zainab Alert Response & Recovery Authority (ZARRA) and Transgender Protection Center, Islamabad were also important human rights related initiatives of the government.\nThe caretaker prime minister said despite visible progress in the field of human rights, several challenges remain in achieving the desired milestones.\nIn this regard, collaborative efforts, both at the national and international level, were vital to address the complexities involved in dealing with issues related to human rights, he further stressed.\nPrime Minister Kakar said Pakistan also remained deeply concerned by the status of human rights in other parts of the world.\n“In South Asia, India is violating all norms and conventions of human rights in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). The illegal actions of 5 August 2019, aimed at demographic change and disenfranchising the Kashmiris from exercising their right to self-determination have further aggravated the scale of oppression and suppression of Kashmiri people’s basic rights, identity and fundamental freedoms,” PM Office Media Wing, in a press release, quoted the prime minister as saying.\nHe said Pakistan reiterated its call for ending egregious human rights abuses in IIOJK and reaffirmed to continue moral, diplomatic and political support to the Kashmiri people in their just struggle against India’s tyranny, occupation and oppression.\n“We urge the international community to press India to grant Kashmiris their fundamental rights including the right to self-determination as enshrined in the UN Security Council resolutions,” he reiterated.\nThe caretaker prime minister said that another pressing human rights situation had emerged in Palestine where Israel was egregiously violating human rights in Gaza, resulting in thousands of causalities, including innocent women and children. Israel’s purposeful, indiscriminate, and disproportionate targeting of people violated all standards of human rights and constituted a clear breach of international law.\nHe urged the international community to redouble efforts for an immediate ceasefire in Gaza and asked Israel to end its brutal occupation of Palestine and grant the Palestinian people their inalienable right to decide their own future.\nThe prime minister further emphasized upon working together to build a world where the inherent dignity and equal rights of all members of the human family were recognized and upheld.",
  "retrievedAt": "2025-08-11T10:55:54.950Z"
}
