{
  "title": "Water level  in Mangla Dam at continual reduction as seasonal discharge of water continues",
  "link": "https://www.app.com.pk/national/water-level-in-mangla-dam-at-continual-reduction-as-seasonal-discharge-of-water-continues/",
  "date_published": "2023-12-09T09:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK ): , Dec 09 (APP) ::Side by side with the seasonal scheduled power production, the discharge of water from the country’s second-largest Mangla dam is underway reducing the water level in the reservoir to  1168.60  feet against the maximum conservation level of 1242 feet with live storage of 2.597 MAF on Saturday.\nAs a result of the continual due inflow of water during the ongoing season, the water level in the country’s 2nd largest reservoir Mangla Dam was recorded as 1168.60  feet after discharge of 73.40 feet of water from the reservoir by Saturday.\nMangla Dam stands largest reservoir in terms of water storage in the country, was filled to its maximum conservation capacity of 1242 feet, on August 17, this year as seasonal impounding of the reservoir. official sources told APP on Saturday.\nAt present 2.597 million acre-feet (MAF) of water is available in the Mangla dam reservoir, the media wing of WAPDA told the news agency. The inflows of the Jhelum river at Mangla reservoir were recorded as 4800 cusecs with outflows of 26000 cusecs of water from the dam on Saturday.\nAt the same time, the position of the river inflows and outflows at Tarbela, Mangla and Chashma along with the reservoir levels and the barrages remained on Saturday as under:-\nRivers: Indus at Tarbela: Inflows 21700 cusecs and Outflows 45000 cusecs, Kabul at Nowshera: Inflows 6700 cusecs and Outflows 6700 cusecs, Khairabad Bridge: Inflows 12200 cusecs and Outflow 12200, jhelum at Mangla: Inflows 4800 cusecs and Outflows 26000 cusecs, Chenab at Marala: Inflows 7400 cusecs and Outflows 2000 cusecs.\nBarrages: Jinnah: Inflows 62100 cusecs and Outflows 57100 cusecs, Chashma: Inflows: 47400 cusecs and Outflows 45000 cusecs, Taunsa: Inflows 43500 cusecs and Outflows 43500 cusecs, Guddu: Inflows 44600 cusecs and Outflows 39400 cusecs Sukkur: Inflows 35800 cusecs and Outflows 9000 cusecs Kotri: Inflows 8600 cusecs and Outflows 500 cusecs Trimmu: Inflows 9800 cusecs and Outflow 3400 cusecs Panjnad: Inflows 8300 cusecs and Outflows 3200 cusecs.\nTarbela: Minimum operating level 1402 feet, present level 1488.50 feet, maximum conservation level 1550 feet, live storage today 2.629 Million acre feet (MAF).\nMangla: Minimum operating level 1050 feet, present level 1168.60 feet, maximum conservation level 1242 feet, live storage today 2.597 MAF.\nChashma: Minimum operating level 638.15 feet, present level 642.40 feet, maximum conservation level 649 feet, live storage on Saturday was recorded as 0.066 MAF.\nThe inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera, and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6.00 a.m. on Saturday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:56:25.674Z"
}
