{
  "title": "48th INSC; Chairman PAEC inaugurates ‘scientific spring’",
  "link": "https://www.app.com.pk/national/48th-insc-chairman-paec-inaugurates-scientific-spring/",
  "date_published": "2023-07-10T09:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):The 48th International Nathiagali Summer College (INSC) on Physics and Contemporary Needs was inaugurated at National Center for Physics (NCP) Quaid-e-Azam University on Monday.\nThe INSC was inaugurated by the Chairman Pakistan Atomic Energy Commission (PAEC), Raja Ali Raza Anwar.\nIn the 48th International Nathiagali Summer College, a distinguished group of 30 experts from developed countries such as the United States, United Kingdom, China, Russia, Canada, France, Germany, Holland, Australia, Spain, Türkiye, Romania, and Chile has been invited to deliver lectures on crucial topics throughout the two-week event.\nOut of a pool of over 1,200 applicants, approximately 250 researchers from universities and research organizations across Pakistan have been carefully selected to participate in the College.\nThis diverse gathering promises to facilitate meaningful exchanges and foster valuable connections among the participants, enriching the scientific community in Pakistan.\nThe scientific activities of the International Nathiagali Summer College (INSC) are designed to encompass a wide range of topics at the forefront of knowledge in Physics and related disciplines.\nEach year, the College focuses on three to five subjects that are of current interest, emphasizing their applications and their relevance to the specific needs of developing countries. In the 48th college, the topics being covered include ‘Advances in Plasma Physics and Allied Technologies’, Semiconductor Materials and Devices, Quantum Optics and Devices, Advances in Pulsed Power Technology and its application and New Trends in High Energy Physics.\nIn his inaugural speech, Chairman PAEC, Dr. Raja Ali Raza Anwar underscored the significance of science and technology in the current era of rapidly expanding frontiers of knowledge.\nHe emphasized that for a nation to achieve genuine progress and prosperity, it must prioritize the acquisition and effective utilization of scientific advancements.\nDr. Raja Ali Raza Anwar highlighted that the assimilation and intelligent application of technology serve as the driving force behind a modern economy.\nTo commemorate the 75 years of science and technology in Pakistan since its independence, a series of special seminars were also arranged highlighting the development of four key technologies.\nEminent scientists of the country elaborated the development of these technologies to reflect on the progress made and show case the achievements over the years.\nThe keynote speakers included Dr. Ansar Pervez, former Chairman PAEC, who provided an extensive account of the progress and advancements in nuclear technology in Pakistan and Dr. N.M. Butt, former Director General, Pakistan Institute of Nuclear Science and Technology (PINSTECH), who offered detailed insights into the development of materials technology within the country.\nThe other keynote speakers included Dr. Manzoor Ikram, Director, National Institute of Lasers and Optronics (NILOP), who shed light on the advancements in laser and quantum technology in Pakistan; and Dr. Shahid Mehmood Baig, Chairman, Pakistan Science Foundation (PSF), who shared valuable information on the progress and breakthroughs in the field of biotechnology in Pakistan.\nThe two-week scientific discourse activity referred as ‘scientific spring’ will conclude on July 22.\nThe idea of holding the International Nathiagali Summer College on Physics and Contemporary Needs came from the distinguished Nobel Laureate, Professor Abdus Salam who emphasized the vital need of communication for transferring and sharing scientific knowledge among the scientific community.\nINSC helps scientists to share knowledge and to learn from each other’s experiences.\nPAEC has been regularly organizing the college every year since 1976. The venue of the college is the famous tourist spot of Nathiagali, which attracts a large number of participants from across the world.\nThis unique opportunity enables young scientists hailing from developing countries to establish and renew connections with globally renowned scientists.\nThroughout its history, the INSC has attracted approximately 1,050 distinguished scientists and speakers, including 08 Nobel Laureates, from renowned universities, research centers, and industries in developed nations.\nThese eminent individuals have delivered lectures at the INSC, sharing their valuable knowledge and insights.\nTheir audience has comprised over 1,000 foreign scientists hailing from more than 75 developing countries, along with approximately 11,500 scientists from Pakistani research and development institutes and universities.\nThe INSC has served as a platform for global collaboration and knowledge exchange, fostering a rich and diverse scientific community.",
  "retrievedAt": "2025-08-11T08:52:38.296Z"
}
