{
  "title": "Green Pakistan Initiative to usher in agri revolution, create four mln jobs: PM",
  "link": "https://www.app.com.pk/national/green-pakistan-initiative-to-usher-in-agri-revolution-create-four-mln-jobs-pm/",
  "date_published": "2023-07-10T15:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):Prime Minister Shehbaz Sharif Monday said Green Pakistan Initiative would bring about second agriculture revolution in the country and would create four million jobs.\nAddressing a seminar on agriculture and food security here, he said agriculture was backbone of the country and the farmers worked hard to provide food to millions of Pakistani people.\nFarmers would be remembered in history as builders of Pakistan, he remarked.\nHe said incentives for the agriculture sector was the right of farmers and it was responsibility of the government to provide all possible assistance to them. “Farmers work hard but it is common knowledge that they are facing lack of resources.”\nThe prime minister said growth in the agriculture sector would bring Pakistan at part with the developed countries.\nHe said progress of Pakistan was inherent in hard work, adding green revolution in the 1960s was due to introduction of new varieties of seed, building of dams and canals and modern agriculture practices.\nHe said farmers should get more profits than the cost of production of their crops including wheat. The government increased the support price of wheat which led to record production of the commodity, he mentioned.\nHe was hopeful that due to the incentives given by the government, production of cotton would also rise.\nHe said it was responsibility of the government to provide better seeds, fertilizers and pesticides to the farmers and equip them with latest technology.\nShehbaz Sharif appreciated the new agriculture initiative for giving real time information about attacks of pests. He showed concern over the adulterated drugs given to the farmers and warned of action against the culprits.\nHe praised the vision of army chief Syed Asim Munir for development of agriculture sector. “We have to implement the vision for agriculture through collaboration among federal and provincial governments, agriculture departments and research institutes.”\nHe said the government was ready to fund the agriculture research centers, adding unfortunately research centers were not doing any worthwhile work and fell victim to the culture of favouritism.\nShehbaz said state owned enterprises were losing Rs 600 billion every year and bleeding the economy. Pakistan imported $ 4.5 billion of palm oil which was a burden on the national economy, he noted.\nThere was a time when Pakistan was producing more cotton than its neighbouring country but then it lost track and was now producing less of staple crops, he said adding Pakistan could not afford more foreign loans but was forced to save its economy from default by getting loans from friendly countries, he added.\nThe PM said gulf countries were ready to invest in the agriculture sector and bring modern machinery to boost crops production.Pakistan needed political stability to attract investment as in an unstable environment investors shy away, he asserted.\nPakistan could attract investment of $ 40 to 50 billion in the coming years and it could make food exports to the gulf countries which were presently importing food products worth $ 40 billion. He was of the view that Pakistan had to compete with the world and increase its exports and the economy of Pakistan would get revived in the coming two years. “It is demand of our national security that the country’s food security and economic security should be strengthened,” he added.\nChief of Army Staff General Asim Munir attended the seminar as guest of honour.\nHe also addressed the participants and assured the people of Pakistan and the government, army’s full support for all the initiatives being initiated under the ambit of Special Facilitation Investment Council (SFIC) including Green Pakistan Initiative.\nThe seminar was attended by federal ministers, chief ministers of Punjab and Sindh province, chief secretaries of provincial governments, agricultural experts and farmers from all the provinces.Foreign dignitaries and potential investors and experts from United Kingdom, Italy, Spain, China, Bahrain, Qatar, Saudi Arabia, Turkiye and various other countries also attended the seminar.\nSequel to the inauguration of Land Information Management System – Centre of Excellence (LIMS – COE), Green Pakistan initiative is being undertaken to enhance the food security of Pakistan, increase exports and reduce the agriculture related imports, thereby, contributing towards national economy.\nAgriculture experts and farmers highly appreciated the government’s landmark initiative and Pakistan army’s special focus on revolutionizing the agriculture sector by promoting modern contemporary technology, collaboration of public and private sectors and trickling down dividends to the local farmers to alleviate poverty.\nThe participants hailed the conduct of seminar and its attendance by experts, government representatives and potential investors as a success and first step towards bringing positive change in the agriculture and livestock sectors.\nThe attendees especially lauded the Pakistan army’s efforts in boosting the national economy by focusing on this critical sector. Later the prime minister visited the agriculture and livestock exhibition as well.",
  "retrievedAt": "2025-08-11T08:52:34.981Z"
}
