{
  "title": "Commerce Ministry in final stage to hire company for branding Pakistani products abroad: NA told",
  "link": "https://www.app.com.pk/national/commerce-ministry-in-final-stage-to-hire-company-for-branding-pakistani-products-abroad-na-told/",
  "date_published": "2024-09-09T15:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP): Minister for Commerce Jam Kamal Khan on Monday informed the National Assembly that the ministry was in final stage to hire a company for branding and promotion of various Pakistani products abroad especially at various new markets under commerce marketing and branding mechanism.\nReplying to various supplementary questions during Question Hour, the minister said that around 20 foreign chefs who participated at the food exhibition recently held at Karachi, also appreciated promotion of Pakistani mangoes.\nHe said this year mangoes’ export not only witnessed sharp increase but there also were visible difference in its value addition.\nHe said during the current year, Pakistani mangoes were marketed across the world as a mangoes’ diplomacy. For the first time, all Pakistani missions organized special one or two-day events featuring mangoes diplomacy, he said and added that 100-300 people including ambassadors were invited to these events for promotion of Pakistani mangoes and products prepared from it.\nHowever, he said that American and European countries have some certain quality compliance requirement process as these were included in perishable items, he added\nRegarding date, Jam Kamal said that Pakistan has huge potential of various varieties of date at Khairpur and some other areas including Balochsitan. Soon after, assuming a charge of the Ministry of Commerce, a plan has been chalked out by the Horticulture Department in order to reach out to the farmers so value additions of various products including date besides international compliances could be enhanced.\nThe minister said that the Trade Development Authority did remarkable job in last 8-9 months especially in agricultural sector under trade diplomacy. The commerce ministry organized a food exhibition at Karachi in which over 850 delegates participated. Some 150 delegates were from European countries, China, South America, German and Africa, he added.\nJam Kamal said around 6000 business to business (B2B) agreements were signed during the exhibition. Pakistan exports to Germany were around $ 2 billion plus and import stood around $ 700 million, he added.\nHe said we have taken various initiatives to further enhance our trade with Germany and German Trade Minister also visited Pakistan.\nTrade Development Authority of Pakistan (TDAP) regularly participates in various exhibitions and during FY 2023-24 eleven trade fairs were successfully organized in Germany, he added.\nThe minister said TDAP has planned nine international exhibitions and two outgoing delegations for Germany for B2B engagements. TDAP regularly conducts the series of webinars and seminars for market awareness. German trade delegations have also participated in TEXPO, FoodAg and Engineering and Healthcare exhibitions in Pakistan.\nHe said B2B meetings were arranged between German International Chamber and Sialkot Chamber of Commerce and Industry.\nResponding to GSP plus status, he said Secretariat of National Compliance Centre would soon be functional which would help cope with the emerging challenges especially to textile sector.\nHe said a concept of National Compliance Centre mechanism was developed to address reservations of European Parliament regarding human rights, right to information and other international compliance etc.\nHe said the ministry was engaged with all stakeholders including provinces and we were all on the same page.",
  "retrievedAt": "2025-08-10T20:54:26.273Z"
}
