{
  "title": "Senate defers legislative business due to minister’s engagement",
  "link": "https://www.app.com.pk/national/senate-defers-legislative-business-due-to-ministers-engagement/",
  "date_published": "2024-09-09T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP): The Senate deferred the legislative bills due to the minister’s absence in the 342nd session of the House here on Monday.\nSenator Farooq Ahmed Naek moved “The Rights of Persons Arrested, Detained or under Custodial Investigation Bill, 2020” defining the rights of a person arrested, detained or under custodial investigation as well as codifying the duties of the arresting, detaining and investigating officers and providing penalties for violations thereof as reported by the Standing Committee be taken into consideration at once.\nAs the bill moved in the House and was supported by Senator Mohsin Aziz. Minister of State for Information Technology and Telecommunication, Ms Shaza Fatima Khawaja requested presiding officer Sherry Rehman that Federal Minister for Law and Justice Azam Nazeer Tarar had to go back home for personnel emergency and he requested that the passage of bills from Items No 14 to 23 including the bills “The Rights of Persons Arrested, Detained or under Custodial Investigation Bill, 2020″, by Senator Farooq Naek, “The Factories (Amendment) Bill, 2023”,” The Criminal Laws (Amendment) Bill, 2023”, The Anti-Rape(Investigation and Trial) (Amendment) Bill, 2023,” and “The Guardians and Wards(Amendment) Bill, 2024” introduced by Senator Samina Mumtaz Zehri, to be deferred till his presence in the next session.\nThe presiding officer Sherry Rehman deferred the bills on the request till the next private day session to be held next Monday.\nMeanwhile Senator Palwasha Mohammed Zai Khan withdrew the bill introduced by her further to amend the Islamabad Capital Territory Private Educational Institutions (Registration and Regulation) Act, 2013 [The Islamabad Capital Territory Private Educational Institutions (Registration and Regulation) (Amendment) Bill, 2024”.\nThe House passed the withdrawal of the bill.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:54:46.573Z"
}
