{
  "title": "Senate Committee approves ‘Cannabis Control and Regulatory Authority Bill, 2024’ with amendments",
  "link": "https://www.app.com.pk/national/senate-committee-approves-cannabis-control-and-regulatory-authority-bill-2024-with-amendments/",
  "date_published": "2024-09-09T14:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP):The Senate Standing Committee on Science and Technology, unanimously passed the bill titled “The Cannabis Control and Regulatory Authority Bill, 2024” during a meeting held on Monday.\nThe meeting, chaired by Senator Kamil Ali Agha, was held at parliament house.\nThe Committee had detailed deliberations and passed the bill with amendments, including the inclusion of two members of the Senate, one of whom is a woman, as members of the Board of Governors of the authority, along with amendments to other clauses of the bill.\nChairman Pakistan Council of Scientific and Industrial Research (PCSIR), Dr. Syed Hussain Abidi, stated that the bill aimed to ensure public health by regulating the cultivation and manufacturing of cannabis and to generate revenue by utilizing the economic potential of the cannabis industry.\nHe highlighted that cannabis can be used for industrial and medicinal purposes and has an economic potential of 04 to 06 billion dollars.\nSenator Musadik Masood Malik asserted that cannabis use could be limited to medicinal use and that necessary safeguards should be in place to curb the abusive use of cannabis.\nSenators including Dr. Afnan Ullah Khan,Jan Muhammad,Husna Bano,Musadik Masood Malik,Nasir Mehmood and Syed Shibli Faraz attended the meeting.\nSecretary for the Ministry of Science and Technology, Sajid Baloch, Acting Secretary for the Ministry of Defence, Ashfaq  Kiyani,Chairman Pakistan Council of Scientific Research Dr. Syed Hussain Abidi and other senior officials from the relevant departments also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:54:50.442Z"
}
