{
  "title": "Federal govt sponsoring 101 PSDP projects worth Rs 947.5 bln in KP: NA told",
  "link": "https://www.app.com.pk/national/federal-govt-sponsoring-101-psdp-projects-worth-rs-947-5-bln-in-kp-na-told/",
  "date_published": "2024-09-09T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP):Minister for Planning, Development and Special Initiatives Ahsan Iqbal on Monday apprised the National Assembly that at present 101 PSDP projects, being sponsored and executed by various Federal Ministries/Departments were ongoing in Khyber Pakhtunkhwa (KP) with an estimated cost of Rs. 947.5 billion.\nResponding to various questions during Question Hour, he said an expenditure reported on the said projects up to  30-06-2024 is at Rs.304.8 billion. An amount of Rs. 52.4 billion has been allocated in PSDP of CFY 2024-25 for these projects, he added.\nHe said additionally, apart from ongoing projects, a total of 20 projects situated in Khyber Pakhtunkhwa, with estimated cost of Rs. 17.9 billion, have been completed by various Federal Ministries/Departments over the past two years.\nThe minister said there was no specific share of provinces including AJ&K and GB for investment in development projects by the Federal Government. After the 18 amendment, the provinces got around 58.5 percent share while the centre has only 42.5 per cent share in revenue, he added.\nHe said the federal government has very limited space to sponsor various development projects.\nHe said PML-N government during its 2013-18 tenure, enhanced the development budget upto Rs 1000 billion adding that record development projects worth Rs 3200 billion were completed during the said period. Pakistan’s economy was among top 5 emerging economies of the world, he added.\nHowever, a U-turn in 2018 had ruined the country’ economy which was growing at 6 per cent, he added.\nThe minister said the main purpose of public sector investment under the Federal PSDP, after the 18th Amendment to the Constitution, was to provide funding for large scale strategic projects of national interest. However, he said the Federal Government also invested under developed regions to bring them at par with other areas of the country, reduce poverty and empower the marginalized segment of the society.\nTo another question the minister said the Federal Public Private Partnership (PPP) Policy has been approved by the Federal Cabinet in its meeting held on 17th April 2024. The transparent and competitive procurement of PPP projects was the primary responsibility of the Implementing Agencies of the Federal Government under the P3A Act, 2017, he added.\nAhsan Iqbal said the Federal PPP Policy aligns project structuring and procurement with the Paris Agreement, covering the entire project lifecycle from identification to execution.\nTo a question, he said that National Economic Council was a national institution and all chief ministers of the provinces were also its members.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:54:26.978Z"
}
