{
  "title": "UNSG urged to prevent Modi regime’s election drama in IIOJK",
  "link": "https://www.app.com.pk/national/unsg-urged-to-prevent-modi-regimes-election-drama-in-iiojk/",
  "date_published": "2024-09-09T06:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 9 (APP):Mehmood Ahmed Saghar, Acting Chairman of the Jammu and Kashmir Democratic Freedom Party, has appealed to UN Secretary-General Antonio Guterres to prevent the Indian government’s attempts to mislead the world by staging so-called state assembly elections in occupied Jammu and Kashmir.\nIn a letter to the UNSG, Saghar highlighted the alarming deterioration of fundamental freedoms and civic space in Kashmir since India’s apartheid regime led by Narendra Modi-led Indian regime stripped the territory of its special status in 2019.\nHe said the Indian government is suppressing dissent, targeting critics, and committing human rights violations, including excessive force, arbitrary detentions, and enforced disappearances.\nSaghar emphasized that the elections are a farce, lacking fairness and transparency, and are being used by India to project a facade of democracy, de-legitimize the Kashmiris’ peaceful struggle for self-determination, and strengthen its control over the territory. He urged the UNSG to persuade the Indian government to respect the Kashmiri people’s fundamental human rights and resolve the Kashmir conflict peacefully.\nThe Jammu Kashmir Democratic Freedom Party believes that these elections are unlikely to satisfy the Kashmiris’ aspirations and cannot substitute for a UN-supervised plebiscite to determine their political fate. Saghar appealed to the UNSG to use his good offices to create an enabling environment for a peaceful solution to the long-standing Jammu and Kashmir dispute.\n“The people of Jammu and Kashmir reject Indian occupation and demand their universally recognized right to self-determination,” the letter wrote and added “The UNSC resolutions have pledged this right to the Kashmiri people, who have been struggling for over seven decades to achieve it.”\nIndia’s denial of this right is contrary to its claim of being a democratic republic and a violation of the UN charter. He urged all justice-loving people to support the Kashmiris’ right to self-determination, and India must be pressurized to honour its international commitments on Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:53:58.840Z"
}
