{
  "title": "Pakistan, Nepal discuss parliamentary ties, economic cooperation",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP): National Assembly Deputy Speaker Syed Ghulam Mustafa Shah on Tuesday welcomed a parliamentary delegation from the Federal Republic of Nepal at Parliament House with discussions focused on strengthening bilateral parliamentary ties, economic cooperation and matters of mutual interest.\nDeputy Speaker highlighted that Pakistan greatly values its longstanding relations with Nepal. He emphasized the importance of enhancing parliamentary linkages between the two countries, noting that such exchanges play a pivotal role in strengthening bilateral ties and bringing both nations closer. He apprised the delegation that a Pakistan-Nepal Friendship Group has been established in the National Assembly of Pakistan, which is actively contributing to fostering contacts and cooperation between the two countries.\nSyed Ghulam Mustafa underlined the vast potential for collaboration in tourism and other economic sectors. He also briefed the delegation on the formation of the Women Parliamentary Caucus in the National Assembly of Pakistan, comprising women parliamentarians, which is playing an active role in empowering women, safeguarding their rights, and promoting their welfare.\nDiscussing regional challenges, Deputy Speaker NA stated that climate change poses a major threat to Pakistan as well as other countries of the region. He pointed out that the recent monsoon season caused large-scale human and financial losses in Pakistan, adding that since 2022 the country has been consistently bearing the brunt of climate-induced disasters.\nMembers of the Nepalese delegation expressed heartfelt condolences over loss of precious lives and infrastructure caused by the recent cloudbursts & floods in Pakistan. They also extended felicitations to Deputy Speaker on 78th Independence Day of Pakistan. The delegation reiterated that Nepal values its friendly relations with Pakistan and underscored that people-to-people contacts are of vital importance in bringing the two nations closer.\nThe members of the Nepalese parliamentary delegation thanked Deputy Speaker Syed Ghulam Mustafa Shah for the warm welcome & hospitality extended to them. The Parliamentary delegation of Nepal comprised Members Ms. Nagina Yadav, Ms. Bhagabati Neupane, Ms. Puja Chaudhary and Ms. Gaura Nepali.\nOn this occasion, Country Director, Friedrich-Ebert-Stiftung (FES) Pakistan Office, Felix Kolbitz, was present along with other FES officials, Natalia Figge and Pabitra Raut.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:52:17.765Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-nepal-discuss-parliamentary-ties-economic-cooperation/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-20T00:51:00.000Z"
}
