{
  "title": "Newborn abduction drama ends: Father, accomplices held in ICT Police operation",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP): Islamabad Capital Territory (ICT) Police on Tuesday solved a dramatic case of a one-day-old baby’s abduction in Khanna area, revealing that the perpetrator was none other than the infant’s own father.\nA police spokesperson told APP on Tuesday that Khanna Police Station, under the supervision of Station House Officer (SHO) Amir Hayat, swiftly acted on a distress call received through Rescue services reporting that a newborn baby girl had been kidnapped from Bilal Town, Chishtia Market.\nHe said SHO Amir Hayat registered a case and launched an investigation on modern lines, reviewing CCTV footage and questioning hospital staff, midwives, nurses, doctors, and neighbours. Even a beggar woman sitting outside the house was interrogated.\nHe said suspicion gradually centered on the baby’s father, Ibrahim. Police seized all mobile phones and retrieved deleted data, including a message reading “Allah Hafiz, bye bye.” After repeated questioning, Ibrahim confessed that he had handed over the baby to his friend Shazia, who then delivered her to a woman named Iqra.\nHe said Iqra, who had deceived her in-laws by pretending to be pregnant for nine months using an artificial belly, received the child with the help of her husband Tayyab. Acting on leads, SHO Amir Hayat’s team arrested Shazia, who confessed, and later recovered the infant safely from Mananwala, Sheikhupura. Iqra, her husband, and other accomplices were also taken into custody.\nThe spokesperson said that senior police officials and local residents lauded the swift and professional action of SHO Amir Hayat, who not only recovered the innocent child but also resolved a complicated and dramatic case within a day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:51:51.604Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/newborn-abduction-drama-ends-father-accomplices-held-in-ict-police-operation/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-20T02:45:00.000Z"
}
