{
  "title": "Gilgit’s Aman Faraz Durrani honored as youngest Pride of Pakistan",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP):Aman Faraz Durrani, the youngest woman from Gilgit, was honored with the Pride of Pakistan Award during the 78th Independence Day celebrations, ‘Marka-e-Haq’, for her remarkable services in social welfare and humanitarian work.\nDurrani is the founder and CEO of the Durrani Welfare Trust, set up in 2017 to support orphans and underprivileged children. The Trust provides shelter, food, healthcare and education to more than 50 children, besides running various community support programs.\nDuring the COVID-19 pandemic, the Trust distributed food rations among over 800 families, while it has also provided clothing to 300 families and food assistance to 500 others in Gilgit-Baltistan. It also operates a free ambulance service for needy citizens.\nThe children of the Trust, known as “Our Stars,” regularly participate in national events, including Independence Day and Pakistan Day, showcasing their patriotism. Their efforts have been praised by senior officials, including former Commander FCNA Maj Gen Kashif Khalil, who supported the Trust by constructing classrooms and funding teachers’ salaries.\n“To further improve facilities, we need a dining hall and a multipurpose hall where our children can learn and grow through lectures and activities,” Durrani told APP. “Your support could be instrumental in helping us continue to provide quality care and education to our children,” she emphasized.\nOver the years, the Trust has also organized seminars and motivational sessions with the participation of government officials and noted personalities, encouraging youth and society to play their role in supporting vulnerable children.\nBelonging to Konodas, Gilgit-Baltistan, Aman Faraz Durrani is the daughter of Waheed Faraz Durrani, a respected businessman of the region. She recently completed her F.Sc. and continues her mission of service with dedication and resolve.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:53:53.319Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilgits-aman-faraz-durrani-honored-as-youngest-pride-of-pakistan/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T17:30:00.000Z"
}
