{
  "title": "NUST champions Ethical and Inclusive AI in Pakistan with Multistakeholder Dialogue",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP):The National University of Sciences and Technology (NUST) has taken a pioneering role in advancing Ethical and Inclusive Artificial Intelligence (AI) in Pakistan by hosting a high-level multistakeholder dialogue titled “Ethical AI for All”, organized in partnership with The Inclusion Lab and Digital Intellix 4PL, the event convened policymakers, industry leaders, innovators, and UN representatives at NUST’s Deep Learning Lab (DLL) to discuss strategies for eliminating bias, enhancing diversity, and ensuring AI benefits reach all segments of society—especially rural and marginalized communities.\nThe session opened with remarks from Dr. Irtiza, Principal SINES, who set the stage for a forward-looking discussion on responsible AI development.\nThe keynote speaker Mr. Julian Gorman, Head of GSMA Asia Pacific, emphasized the urgent need for robust digital infrastructure to make inclusive AI a reality.\nMs. Afke Bootsman provided the United Nations’ perspective on ethical AI frameworks, while Mr. Michael Schulz, Advisor and Board Director at The Inclusion Lab, outlined nine critical governance priorities for fostering inclusive AI systems.\nRepresenting NUST’s leadership in AI innovation, Dr. Faisal Shafait and Dr. Momina Moetesum showcased the university’s cutting-edge research and collaborative projects aimed at embedding ethics and fairness into AI solutions. The dialogue also featured active participation from industry giants, including Ericsson, Telenor, Ignite, Oracle, Mercurial Minds, and Khan Academy Pakistan, reinforcing the importance of cross-sector collaboration in shaping Pakistan’s AI future.\nAligned with the recently approved National AI Policy 2025, the event served as a pivotal platform for strengthening partnerships between academia, industry, and government to ensure AI advancements are ethical, inclusive, and transformative for all citizens.\nNUST remains committed to driving innovation that prioritizes social impact and equitable progress, solidifying its position as a national leader in responsible AI development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:52:37.988Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nust-champions-ethical-and-inclusive-ai-in-pakistan-with-multistakeholder-dialogue-2/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-20T01:04:00.000Z"
}
