{
  "title": "Gilani, Ethiopian envoy discuss trade, climate, global cooperation",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP):Chairman Senate Syed Yousuf Raza Gilani on Tuesday met Ethiopian Ambassador Dr. Jamal Beker Abdulla and discussed bilateral ties, trade, investment, environmental cooperation, and regional as well as global issues.\nAs part of the meeting, Gilani, senators, and the ambassador planted a sapling in the Friendship Garden at Parliament House to mark the ongoing tree plantation campaign.\nGilani said Pakistan and Ethiopia enjoyed historic ties and welcomed the opening of the Ethiopian Embassy in Islamabad and the start of direct Ethiopian Airlines flights between Karachi and Addis Ababa.\nHe termed both steps as key milestones in expanding relations and stressed the early signing of an air services agreement to boost trade and investment.\nHe thanked Ethiopia for supporting Pakistan’s candidature for a non-permanent seat at the UN Security Council (2025–26) and noted that cooperation at regional and international forums had further deepened ties.\nHighlighting the role of parliamentary diplomacy, he pointed to the Pakistan–Ethiopia Parliamentary Friendship Group and called for stronger delegation exchanges and people-to-people contacts.\nGilani underlined that economic diplomacy was central to Pakistan’s foreign policy and urged efforts to diversify trade. He highlighted Pakistan’s well-known exports—including rice, surgical instruments, pharmaceuticals, and FIFA-standard footballs—as potential areas for Ethiopia to import.\nHe also identified opportunities in IT, science, education, and vocational training.\nOn climate change, the Chairman Senate praised Ethiopia’s Green Dialogue Program and emphasized joint initiatives for a sustainable future. He also invited Ethiopia’s parliamentary leadership to attend the Inter-Parliamentary Speakers Conference in Islamabad this November.\nAmbassador Dr. Jamal Beker Abdulla endorsed Gilani’s views, praised his role in promoting Pakistan’s international relations, and assured Ethiopia’s continued cooperation.\nHe said that both countries shared common interests that could help strengthen their friendship further.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:53:07.601Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-ethiopian-envoy-discuss-trade-climate-global-cooperation/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T21:55:00.000Z"
}
