{
  "title": "EU lifts ban on PIA flights, services to Paris to resume: Senate told",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP): Minister for Parliamentary Affairs Dr Tariq Fazal Chaudhry on Tuesday informed the Senate that the European Union (EU) had lifted its ban on Pakistan International Airlines (PIA), paving the way for resumption of flights to Paris and other European destinations.\nResponding to questions during the session, the minister said the ban imposed after “irresponsible remarks” by a former minister about pilots’ licences had caused unprecedented financial losses to PIA and damaged Pakistan’s international reputation.\nHe said ten PIA routes had remained suspended for periods ranging from seven months to four years. While some were affected by EU Aviation Safety Agency (EASA) restrictions, others were halted due to traffic trends and commercial considerations.\nClarifying the fleet position, the minister said PIA had not acquired new aircraft during this period. However, like other global airlines, it diverted planes from low-demand routes to high-demand ones. The suspended routes included Islamabad–Paris, Lahore–Baku, Turbat–Sharjah, Turbat–Al Ain, Gwadar–Muscat, Quetta–Jeddah, Faisalabad–Jeddah, Faisalabad–Madinah, Lahore–Kuwait and Karachi–Peshawar.\nDuring supplementary questions, Senator Dinesh Kumar pointed to the 55-hour delay of PIA flight PK-734 in Paris on August 8, warning that such incidents could affect the airline’s recovery. The minister responded that technical faults were part of routine operations worldwide and the Paris issue was a mechanical fault that had been resolved before resuming service.\nSenator Dr. Mayoon Memon noted that several suspended routes — including Sharjah, Al Ain, Muscat, Jeddah and Madinah — were unrelated to the EU ban and urged that flights from smaller cities such as Quetta and Faisalabad not be compromised.\nDr.Fazal Chaudhry reiterated that route decisions were based on profitability, demand and operational viability. He assured the House that PIA was committed to service improvement and the government was considering long-term restructuring options for the airline.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:52:39.233Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/eu-lifts-ban-on-pia-flights-services-to-paris-to-resume-senate-told/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T22:36:00.000Z"
}
