{
  "title": "Pakistan, Nepal explore new avenues for women’s empowerment, education and cultural ties",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP):Pakistan and Nepal have agreed to intensify collaboration on gender development, women empowerment, and climate resilience, as a delegation of Nepali women parliamentarians on Tuesday visited the Institute of Regional Studies (IRS) in Islamabad.\nDuring their visit, President Amb. Jauhar Saleem underscored the importance of enhanced cooperation between Pakistan and Nepal on gender development, said a press release.\nHe noted the cordial relationship between the two countries and advocated for its translation into tangible cooperation across various sectors of mutual interest.\nHe commended the Parliamentarians’ dedication to addressing legislative and governance gaps that impede gender development.\nAmb. Saleem highlighted gender development as a key area for collaboration, alongside climate change, and educational and cultural exchanges between the two countries. He proposed allocating the existing 50 percent scholarship to Nepali students specifically for female, anticipating a significant boost to women’s empowerment in the region.\nMs. Nagina Yadav, delegation head and leading Nepali Congress Party figure, outlined Nepal’s gender development status and the delegation’s commitment to addressing gender challenges. She conveyed the delegation’s strong desire for concrete collaboration with Pakistan, recognizing Pakistan’s effective women empowerment initiatives.\nMs. Puja Chaudhary, of the Janata Samajbadi Party Nepal, emphasized the opportunity to harness strong bilateral relations for targeted working groups on business, education, culture, climate, and direct people-to-people exchanges. Also part of the delegation were Sarita Bhusal, a politician from the Communist Party of Nepal (Unified Marxist-Leninist), and\nMs. Gaura Nepali, Dalit rights activist and chairperson of the Centre for Dalit Women Nepal (CDWN).\nFelix Kolbitz, Country Director of Friedrich-Ebert-Stiftung (FES), Pakistan Office, identified climate change as a particularly promising area for collaboration, given the vulnerability of both countries.\nHe elaborated on FES’s commitment to fostering cooperation between Pakistan and regional countries like Nepal to advance women empowerment and address human security issues.\nEchoing what Kolbitz highlighted, Ms. Natalia Figge, Resident Representative, Friedrich-Ebert-Stiftung, Nepal Office noted that Nepal and Pakistan can develop synergy on gender equality through frequent exchanges as a practical means to accelerate gender parity efforts. Ms. Pabitra Raut, Program Manager at FES, Nepal also accompanied the delegation.\nThe interactive session with Nepali Parliamentarians concluded with Q&A, generating several constructive proposals for future collaboration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:51:51.594Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-nepal-explore-new-avenues-for-womens-empowerment-education-and-cultural-ties/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-20T03:01:00.000Z"
}
