{
  "title": "Rescue, relief operation in flood-affected areas being carried out in well  coordinated manner: Tarar",
  "author": null,
  "content": "ISLAMABAD, Aug 19 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Tuesday that rescue and relief operation in areas affected by urban flooding was being carried out in a well coordinated manner by the federal and provincial governments, National Disaster Management Authority, Armed Forces and other concerned departments.\nThis he said while addressing a press conference along with Director General Inter Services Public Relations (ISPR) Lt Gen Ahmed Sharif Chaudhry  and Director General National Disaster Management Authority ( NDMA) Lt Gen Inam Haider.\nHe said the PM had categorically stated that it was a national catastrophe and all governments and departments will work collectively to overcome this tragedy.\nHe said that NDMA was providing all necessary information to provincial governments and concerned institutions in real time in a well coordinated manner.\nHe said that in Khyber Pakhtunkhwa,  districts of  Buner, Shangla, Bajaur and Swat power distribution system was disrupted.\nHe said on the directives of Prime Minister Shehbaz Sharif, Federal Minister for Power Sardar Awais Leghari was present in flood affected area to personally supervise the entire restoration process. Similarly, he said Minister for Kashmir Affairs and Gilgit Baltistan Engineer Amir Muqam was in Bajaur whereas Minister for Communications Aleem Khan was supervising the restoration of the communication system in Gilgit.\nGiving details of power system disruption,  he 35 feeders were affected in Swat, out of which 25 have been restored, in Buner, nine feeders were affected  out of which three have been restored and work was underway on remaining six feeders. Tarar said till now about 70 per cent of electricity has been restored in the affected calamity-hit areas.\nHe said it was ensured that major hospitals in affected areas should get uninterrupted power supply.\nAbout road infrastructure, he said Malakand-Besham Road has been restored and Khazakhaila- Besham Highway ( N-90) has been opened in Malakand Division.\nHe said that Armed Forces and the federal government were making all out efforts to restore Astore bridge to reopen Jaglot-Skardu Road.\nRegarding relief goods, he said that about1200 tents have been sent to calamity-hit areas.\nHe said a special team of doctors has been sent from Pakistan Institute of Medical Sciences for treatment of injured.\nHe besides generators, dewatering pumps more medicines and  tents have been sent.\nMoreover, over five hundred medical camps have been established and 40 tons of ration packs have been sent to urban floods victims.\nIn the coming few days, early warning system has predicted  more rains in the Azad Jammu and  Kashmir and its government has also been informed about the situation.\nThe Prime Minister has given special instructions that all federal institutions should play proactive role in the restoration of provincial roads. The minister said that in difficult times, the nation should unite and play its role in reducing difficulties of the affected families.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:52:42.078Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rescue-relief-operation-in-flood-affected-areas-being-carried-out-in-well-coordinated-manner-tarar/",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T23:30:00.000Z"
}
