{
  "article_id": "2025-09-22_038ffde50328c498c821f0d0b4e5f9a1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-congratulates-saudi-arabia-on-95th-national-day/",
    "retrieved_at": "2025-10-11T23:23:57.605Z"
  },
  "metadata": {
    "title": "Pakistan congratulates Saudi Arabia on 95th National day",
    "author": null,
    "date_published": "2025-09-22T20:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 449,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 22 (APP): National Assembly Speaker Sardar Ayaz Sadiq on Monday extended warm felicitations to the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, Crown Prince Mohammed bin Salman, the Saudi Royal Family, Majlis Ash-Shura, and the people of the Kingdom of Saudi Arabia on the occasion of the Kingdom's 95th National Day, being marked on September 23, 2025. On behalf of the Parliament and people of Pakistan, he conveyed heartfelt wishes to the Saudi leadership and citizens on this historic occasion. He noted that this year's theme, celebrating the Kingdom's unification and rich heritage, resonates deeply with the values of unity, resilience, and cultural pride. Speaker highlighted the long-standing, brotherly ties between Pakistan and Saudi Arabia, founded upon common religious, moral, and social values. He lauded Saudi Arabia's status as a key Islamic country and revered its leadership and people as the esteemed Guardians of the Two Holy Mosques. He further appreciated the Kingdom's efforts in preserving and promoting the rich cultural and moral values that have long defined Arab civilization and inspired the broader Islamic world. Sardar Ayaz Sadiq also warmly congratulated the political and military leadership of both brotherly countries, namely, President of Pakistan Asif Ali Zardari, Prime Minister Muhammad Shehbaz Sharif, Deputy Prime Minister Muhammad Ishaq Dar, Chief of Army Staff, Field Marshal Syed Asim Munir, alongside King Salman bin Abdulaziz Al Saud, Crown Prince Muhammad Bin Salman, and Speaker of Majlis Ash-Shura Dr. Abdullah Bin Mohammed Al Sheikh, on the historic signing of the Strategic Mutual Defense Agreement (SMDA) on September 18, 2025. He termed this milestone a manifestation of the shared resolve of both nations to deepen cooperation for regional security and collective prosperity. Speaker prayed to Allah Almighty to bless the entire region, especially Pakistan and Saudi Arabia, with lasting peace, unity, and progress. He reaffirmed Pakistan's unwavering commitment to strengthening bilateral relations with the Kingdom of Saudi Arabia for a brighter and more prosperous future for both peoples. Deputy Speaker National Assembly Syed Ghulam Mustafa Shah also extended warm greetings to the Saudi leadership, Majlis Ash-Shura, and people of the Kingdom on their 95th National Day. He observed that the unique bond between Pakistan and Saudi Arabia is rooted in unshakeable foundations of faith, brotherhood, and mutual respect, and reiterated the profound admiration of the people of Pakistan for the Saudi role as Custodians of the Two Holy Mosques. Deputy Speaker NA further lauded the successful signing of the SMDA, terming it a landmark step toward strategic collaboration and enhanced defense cooperation between the two countries. He prayed for the continued strengthening of Pakistan-Saudi relations and for the prosperity and stability of the entire Muslim Ummah.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}