{
  "article_id": "2025-09-22_b8898bba23a49f7c9054785e2289c5d3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-sub-committee-clears-university-bill-ties-approval-to-hec-compliance/",
    "retrieved_at": "2025-10-11T23:22:18.828Z"
  },
  "metadata": {
    "title": "Senate sub-committee clears university bill, ties approval to HEC compliance",
    "author": null,
    "date_published": "2025-09-22T18:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 272,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 22 (APP):After detailed consideration and keeping in view the larger interest of the student community, particularly those from Balochistan, the Sub-Committee recommended passage of the bill by the Senate Standing Committee on Federal Education and Professional Training (FE&PT) with the condition that all HEC requirements for the establishment of a university be fulfilled at the earliest. A meeting of the Sub-Committee of the Senate Standing Committee on FE&PT was held on Monday at the Parliament House with primary agenda item for consideration was the Private Member's Bill titled \"The University of Business, Sciences and Technology Bill, 2025.\" The meeting was convened by Senator Dr. Afnan Ullah Khan and attended by Senator Naseema Ehsan and Senator Abdul Shakoor Khan. Representatives from the Higher Education Commission (HEC) were also in attendance, said a press release. In line with the directions issued during the previous meeting of the Sub-Committee held on 4 August, the HEC submitted a comprehensive report outlining recommendations for legislation pertaining to the establishment of new universities and Degree Awarding Institutes (DAIs). The HEC has recommended a total of thirty-two (32) cases for enactment by Parliament. During deliberations, both the Committee and HEC representatives underscored the importance of adhering to established legal and regulatory frameworks. It was collectively emphasized that, in certain cases, the establishment of an institute under existing provincial frameworks may be a more appropriate route, particularly in light of the devolved subject of education following the 18th Amendment to the Constitution of Pakistan. For establishment of university in the Islamabad Capital Territory (ICT), it was reiterated that all requisite criteria for university status must be strictly met.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}