{
  "article_id": "2025-09-22_7bfaa9223be9bf53da278d5fe3580072",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/us-europe-alliance-hierarchical-when-it-comes-to-middle-east-experts/",
    "retrieved_at": "2025-10-11T23:22:43.587Z"
  },
  "metadata": {
    "title": "US-Europe alliance hierarchical when it comes to Middle East: Experts",
    "author": null,
    "date_published": "2025-09-22T16:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 325,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 22 (APP):The United States continues to treat Europe as a junior partner in the Middle East, limiting its diplomatic maneuverability on Iran, experts observed during a webinar hosted by the Institute of Regional Studies (IRS) Islamabad. They analyzed the ramifications of \"snapback sanctions\" on Iran. Dr Sika Sadoddin, former fellow at Portland University (USA) was of the view that the US had always treated Europe as a secondary partner in the Middle Eastern affairs, said a press release issued on Monday. She analyzed Europe's quest for strategic autonomy as aspirational but limited in practice due to the financial and security dependence on the US. Dr Sadoddin pointed out that the US exploited secondary sanctions as a leverage against Iran and left little room for European diplomacy. Dr Sadoddin explained that any attempts by Europe to trade with Iran while bypassing US sanctions were rather symbolic. That's why Europe criticized Trump's withdrawal from JCPOA but was forced to adopt the sanctions regime against Iran. While comparing the approaches of different US presidents towards Iran, Dr Sadoddin mentioned that apart from Obama who preferred multilateral diplomacy, both Trump and Biden adopted unilateralism and US dominance in diplomatic spheres. Ms Silvia Boltuc, Founder and Managing Director of Special Eurasia (Italy) argued that Europe's policy towards Iran was contradictory. Europe's silence on Israeli attacks against Iran but condemnation of Iran's retaliatory attacks created mistrust in Europe-Iran relations, she mentioned. Ms Boltuc also alluded to the fact that giving space to banned opposition of Iran like National Council of Resistance of Iran (NCRI) in Europe's pubic spheres would further complicate the relations with the Islamic Republic. Within Europe, the views varied as Italy intended to keep more commercial ties with Iran while Germany and France despised the policy of appeasement, she said. However, Europe's insistence on negotiations was because of its own strategic interests to access Iran's energy reservoirs especially after the Ukraine War and sanctions on Russia.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}