{
  "title": "PM for digitization of education, proper teachers’ training",
  "link": "https://www.app.com.pk/national/pm-stresses-upon-digitization-of-education-proper-teachers-training/",
  "date_published": "2023-03-21T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 21 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday stressed that all resources and efforts should be utilized to introduce the modern modes of education including the digitization initiatives, besides imparting of the latest training to teachers.\nHe was addressing a launching ceremony of ‘Teleschool Pakistan App, Google for Education and Digital Continuous Professional Development’ initiative to further revolutionize the formal education medium in Pakistan.\nThe prime minister observed that teachers’ training in the country was not up to the mark which was unfortunate and cited his experience in Punjab province.\nHe said that he had directed for steps to improve the quality of about 40 training centers in the province during his tenure as the chief minister.\nThe prime minister urged the Minister for Federal Education to chalk out a mechanism in consultations with the provincial governments to improve the quality of teachers’ training.\nReferring to the significance of the latest technology in modern education, he underlined that if they wanted to equip the young generations with the latest education, they would have to give them laptops and other related gadgets, so that the future builders of the nation could get themselves acquainted with the new modes of education.\nHe said that about 100,000 laptops would be distributed among the high achievers across the country hinting that suck-like initiatives would be realized.\nThe prime minister opined that the vocational training programme should be taken forward in collaboration with the provincial governments and the private sector.\nInstead of making investments on the brick and mortar, they should invest over the young students by imparting them technical and skill training, he added.\nThe prime minister emphasized that the students should be directly trained by involving the private sector. The best institutions in the private sector should be hired in a transparent manner and investment be made on each student by imparting them proper training.\nThe prime minister said that they would also establish a network of Danish schools in the far-flung areas of Balochistan for which huge investments would be made.\nHe expressed the confidence that the quality education to the students in remote area of the province would help bring them at par with the rest of the students of the other parts of the country.\nHe also urged that the educational requirements of the orphan children should be taken care of.\nHe said imparting the latest education to the young generations should be the goal of life for them.\nAppreciating the efforts of the federal minister, ministry and other partners, the prime minister said it was a good day for the education sector of the country as the latest technology would be utilized to further improve the quality of education.\nSpeaking on the occasion, Minister for Federal Education and Professional Training Rana Tanveer Hussain said that quality of education was linked with teachers’ training which was being focused.\nThe covid-19 pandemic had provided the world with the opportunity to adopt distance school learning methods, he added.\nThe minister said under the initiative, six channels were being launched which would prove a milestone in the education system of the country.\nHe said in Pakistan there were about 22.8 million out-of-school children and resources were not enough to cater to them, he said, adding the recent initiatives would be helpful in covering the needs of these children.\nHe said that the technical and skill development of the youth was vital and observed that the country’s universities were not included among the world’s top leading educational institutions which was unfortunate.\nRepresentatives of development partners, parliamentarians and relevant officials were present during the ceremony.\nSecretary for Federal Education and Professional Training Waseem Ajmal presented an overview of the initiative.\nHe said digital contents would be created and made available on different medium. A total of six digital channels were being launched for different ages.\nHe said after the Covid pandemic, 6000 quality videos were prepared.\nTeachers would also be properly trained under the professional development initiative, he added.\nUnder the initiative, 150 chrome books were being distributed among the students while another 6,000 chrome books would be distributed soon, he added.\nPresident and GCEO PTCL Hatem Bamatraf, in his remarks, expressed that they felt pride on being part of the latest educational initiative which would help transform the educational system in Pakistan.\nEarlier, the prime minister also distributed chrome books among different students of Islamabad.",
  "retrievedAt": "2025-08-11T06:27:45.194Z"
}
