{
  "title": "Contaminated water a serious threat to millions in Pakistan’s flood-hit areas: UNICEF",
  "link": "https://www.app.com.pk/national/contaminated-water-a-serious-threat-to-millions-in-pakistans-flood-hit-areas-unicef/",
  "date_published": "2023-03-21T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): The United Nations Children’s Fund (UNICEF) Representative in Pakistan, Abdullah Fadil on Tuesday said that safe drinking water is not a privilege, it is a basic human right.\nSix months after catastrophic floods struck Pakistan, more than 10 million people, including children, living in flood-affected areas remain deprived of clean drinking water, leaving families with no alternative but to drink and use potentially disease-ridden water.\nEven before the floods, despite the country’s drinking water supply system covering 92 per cent of the population, only 36 per cent of the water was considered safe for consumption. The floods damaged most of the water systems in affected areas, compelling more than 5.4 million people, including 2.5 million children, to solely rely on contaminated water from ponds and wells.\nCountry representative UNICEF said, “Yet, every day, millions of girls and boys in Pakistan are fighting a losing battle against preventable waterborne diseases and the consequential malnutrition. We need the continued support of our donors to provide safe water, build toilets and deliver vital sanitation services to these children and families who need them the most.”\nThe prolonged lack of safe drinking water and toilets, along with the continued proximity of vulnerable families to bodies of stagnant water are contributing to the widespread outbreaks of waterborne diseases such as cholera, diarrhoea, dengue, and malaria. At the same time, open defecation has increased by more than 14 per cent in the flood-affected regions. To make matters worse, the lack of proper toilets is disproportionally affecting children, adolescent girls and women who are at added risk of shame and harm when defecating outdoors.\nUnsafe water and poor sanitation are key underlying causes of malnutrition. The associated diseases, such as diarrhea, prevent children from getting the vital nutrients they need. Moreover, malnourished children are more susceptible to waterborne diseases due to already weakened immune systems, which simply perpetuates a vicious cycle of malnutrition and infection. Tragically, a third of all child deaths globally are attributable to malnutrition and half of all undernutrition cases are linked to infections caused by a lack of access to safe water, adequate sanitation and good hygiene. In Pakistan, malnutrition is associated with half of all child deaths. In flood affected areas, more than 1.5 million boys and girls are already severely malnourished, and the numbers will only rise in the absence of safe water and proper sanitation.\nUNICEF has been on the ground with partners since the first day of the climate-induced emergency. Immediately following the floods, UNICEF installed numerous handpumps and water storage facilities. In the past six months, UNICEF and partners have provided safe drinking water to nearly 1.2 million children and families and distributed hygiene kits to more than 1.3 million people. UNICEF also supported the rehabilitation or rebuilding of water supply facilities benefiting over 450,000 people.",
  "retrievedAt": "2025-08-11T06:27:29.679Z"
}
