{
  "title": "Don’t take GSP+ for granted, says EU envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The European Union has warned Pakistan not to take its GSP+ status for granted.\n\nOlof Skoog, the EU Special Rep­resentative for Human Rights who is currently on a week-long visit to Pakistan, has also urged the government not to use military courts to pursue cases against citizens, and opposed recent moves to restrict freedom of expression.\n\nTalking to Dawn, he said he had conveyed these messages in separate meetings with top government functionaries, including the army chief, chief justice and members of the federal cabinet.\n\nThe focus of his visit is to engage with the government on pressing human rights issues, and learn about Pakistan’s plans to address them ahead of the upcoming GSP+ monitoring mission, due in June 2025.\n\nOlof Skoog urges Pakistan not to try civilians in military courts, limit freedom of expression merely to protect individuals from criticism\n\nThe envoy’s insights will be crucial to securing continued access to the Generalised System of Preferences Plus (GSP+), given Pakistan’s reliance on the scheme, which provides preferential access to EU markets.\n\nThe EU has previously expressed concern over the sentencing of protesters being tried over their role in the events of May 9 — when riots broke out following the arrest of PTI founder Imran Khan.\n\nIn a statement issued after the announcement of sentences handed down by military courts, the EU said “these verdicts are seen as inconsistent with the obligations that Pakistan has undertaken under the International Covenant on Civil and Political Rights (ICCPR)”.\n\nTalking to Dawn, Mr Skoog reiterated the same concerns, saying: “We have expressed [our] apprehensions and concerns about the use of military courts against civilians.”\n\n“I had that conversation and will continue having those conversations. Our view is that for civilians, there should be a civilian court system applicable… We have raised our concerns when there is an expansive use of military courts in response to demonstrations,” he said, clarifying that this was their general stance and that he would not comment on individual cases.\n\nFreedom of expression is another GSP+ condition, he said, even as journalists and opposition parties protested the passage of controversial amendments to the country’s cybercrime laws.\n\n“This is happening while I am visiting the country… I have been discussing [this] with government officials. Our view is there should be very limited restrictions on freedom of expression,” Mr Skoog said.\n\n“You can’t restrict freedom of expression just to protect the politicians, authorities or the system from being criticised, and these are the conversations we are having with Pakistan right now about where to draw the limits,” the special envoy said.\n\nMr Skoog said that the next round of the GSP+ scheme hinges upon what Pakistan does in terms of complying with the various international obligations they have made, adding that it “cannot be taken for granted that [GSP+] will be there for the next round”.\n\nSo far, the EU official has met Deputy PM Ishaq Dar, COAS Gen Asim Munir, CJP Yahya Afridi, law and commerce ministers, other officials, as well as civil society, media and human rights defenders.\n\n“I have and I will use my visit to convey to the concerned authorities that I have heard from civil society in Pakistan, and they relate to the problems we have discussed: freedom of expression, labour rights, death penalty, and people lingering in jail with no trial and sentencing. Those are part of the issues that we raised with Pakistan,” Mr Skoog told Dawn.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/300807452a28eab.jpg",
  "retrievedAt": "2025-10-12T01:03:24.845Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888586/dont-take-gsp-for-granted-says-eu-envoy",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:06:21.000Z"
}
