{
  "title": "‘Takes two to tango’: Govt offers PTI parliamentary committee to continue talks - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Thursday said that the government was ready to form a parliamentary committee to continue talks with the PTI as against the party’s demand to constitute a judicial commission to probe the protests of May 9, 2023, and November 26, 2024.\n\nAfter more than a year of heightened tensions between the government and the PTI, the two sides commenced negotiations in the last week of December to bring down political temperatures. But despite weeks of negotiations, the dialogue process stalled on major issues — the formation of two judicial commissions and the release of PTI prisoners.\n\nLast week, PTI decided to boycott the fourth round of talks (which were scheduled to take place on Jan 28) with the government, a day after it announced that party founder Imran Khan issued directions to call off negotiations due to a delay over the formation of judicial commissions.\n\nSpeaking at a cabinet meeting today, PM Shehbaz said, “We are ready to form a House committee. The committee that was formed in 2018 should also complete its probe, and a House committee should be formed to investigate the February 2024 elections to bring the facts to the forefront.”\n\nRegarding the Nov 26 protest, he said that a House committee should probe that, as well as the months-long sit-in staged by the PTI in Islamabad in 2014, when it was in the opposition.\n\n“It takes two to tango. This dialogue should move forward so that the country can progress, instead of bearing more harm due to their violent protests,” the premier said.\n\nRecalling the negotiation process, the premier said, “We genuinely accepted their offer, constituted a committee, and initiated dialogue with the help of the [National Assembly] speaker.”\n\n“The committee asked the PTI to present their demands in writing and the government also agreed to present a response in writing,” he said. “A meeting was supposed to be convened on the 28th of this month, but they refused the talks and ran away.”\n\nHe further said, “Our members told them that the [government] was ready to present a response in writing, and invited them to come to the table again.”\n\nThe premier referred to the parliamentary committee formed in 2018 under the former government to finalise the terms of reference (ToRs) to investigate the election rigging allegations.\n\nHe said, “After the 2018 elections when we [as the opposition] entered the parliament while wearing black bands in protest, Imran Niazi (who was the prime minister at that time) told me that his government was forming a committee and a thorough probe would be carried out.”\n\nRecalling that Imran then announced the formation of the committee, PM Shehbaz highlighted, “In 2018, they (the PTI) made a House committee, not a judicial commission.\n\n“They (the then-PTI government) offered the formation of a House committee and we accepted it, but the committee only held one or two meetings.”\n\nResponding to the premier’s reaching out during an interview on Geo News programme ‘Capital Talk’, Leader of the Opposition in the National Assembly Omar Ayub said: “Shehbaz Sharif’s offer totally rejected.”\n\nHe said the opposition had clear intentions and demands but the government could not fulfil them.\n\nQuestioned about the PTI reaching out to other opposition parties to form a political alliance for a movement against the government, he replied in the affirmative, saying the PTI was “actively” pursuing the matter with other parties.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/301442508f9c642.jpg",
  "retrievedAt": "2025-08-26T08:01:52.934Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888647/takes-two-to-tango-govt-offers-pti-parliamentary-committee-to-continue-talks",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T10:27:01.000Z"
}
