{
  "title": "Rebels in Congo move south to expand their control - World - DAWN.COM",
  "author": null,
  "content": "GOMA: Rwandan-backed M23 rebels in Democratic Republic of Congo were moving south on Wednesday towards Bukavu, the capital of South Kivu province, apparently bidding to expand their area of control in the country’s east after capturing the city of Goma.\n\nM23 forces were advancing south from the town of Minova, along the western side of Lake Kivu, according to five diplomatic and security sources, one of whom was in direct contact with the rebels.\n\nAny successful push south by M23 would see them control territory that previous rebellions have not held since the end of Congo’s major war 20 years ago.\n\nTo reach Bukavu, they would have to seize Kavumu, where the city’s airport is located, and overcome Burundian troops who have been deployed to beef up Congo’s defences.\n\nM23 forces seen patrolling border with Rwanda, cutting chains that had barred way for vehicles\n\nThe advance on Bukavu comes as M23 strengthened its grip on Goma, the capital of North Kivu and a hub for displaced people, aid workers, UN peacekeepers and Congolese forces.\n\nBoth North Kivu and South Kivu provinces have numerous mineral mines, and the struggle for control of Congo’s abundant resources is one of the drivers of conflict in the east of the giant country. These include coltan, which is used in smartphones.\n\nDespite a flurry of diplomatic activity, including the United States telling Rwanda it was “deeply troubled” by Goma’s fall to M23 fighters, there were growing signs the rebels were taking over the running of the city.\n\nIsolated gunfire sounded through some outlying districts of the lakeside city of two million where Monday’s rebel storming left bodies lying in the streets, hospitals overwhelmed and UN peacekeepers sheltering in bases.\n\nCongo government forces were nowhere to be seen in the city centre while M23 fighters were seen patrolling the border with Rwanda and cutting chains and padlocks that had barred the way for pedestrians and vehicles.\n\n“It feels like we are in a dual nation. We are in Congo and at the same time in Rwanda,” a resident of an upscale part of Goma said.\n\nMercenaries leave\n\nAt a border crossing between Goma and its Rwandan twin city of Gisenyi, dozens of muscular white men, some in fatigues, were seen coming over to the Rwandan side and lining up to have their luggage examined by police sniffer dogs. They submitted to being body-searched by Rwandan officers.\n\nUN sources and Rwandan officials said they were mercenaries hired by the Congo government. Several held Romanian passports. One told Reuters he was Romanian and had been in Goma about two years.\n\nAfter being searched, the mercenaries boarded coaches and were driven away.\n\nAs the Rwandan-backed rebels gained ground in the last two years, Congo turned to private military companies to try to shore up their defe­nces, but the mercenaries appeared to offer little resistance when M23 marched into Goma this week.\n\nM23 is the latest ethnic Tutsi-led, Rwandan-backed insurgency to roil Congo since the aftermath of the genocide in Rwanda 30 years ago, when extremist Hutus killed Tutsis and moderate Hutus, and then were toppled by the Tutsi-led forces led by Kagame.\n\nRwanda says some of the ousted perpetrators have sheltered in Congo since the genocide, posing a threat to Congolese Tutsis and Rwanda itself. Congo rejects Rwanda’s complaints, and says Rwanda has used its proxy militias to loot lucrative minerals.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679aa6270b689.jpg",
  "retrievedAt": "2025-08-26T08:02:23.154Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888579/rebels-in-congo-move-south-to-expand-their-control",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:00.000Z"
}
