{
  "title": "The pioneering science linking climate to weather disasters - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Extreme weather is becoming more destructive as the world warms, but how can we say that climate change intensified the fires in Los Angeles, typhoons in the Philippines, or flooding in Spain? That question was once difficult question to answer. But thanks to the pioneering field of attribution science, experts can quickly examine the possible influence of global warming on a specific weather event.\n\nThe fast-growing field began two decades ago and is now firmly established, but it is still sometimes hampered by a lack of data.\n\nReal-world impact\n\nAfter disaster strikes, an attribution study can quickly help tell governments, industry and ordinary people if climate change played a role.\n\n“It’s important for citizens, for decision-makers, and it’s also very important for scientists, because with each case study, we learn new things about our models, our observations and the problems we encounter with them,” said Robert Vautard, a leading scientist with the UN’s climate expert panel, who has supported the development of attribution studies.\n\nIn the future, these studies could also play a growing role in legal disputes. Already a 2021 scientific study was used by a Peruvian farmer in his battle against German electricity giant RWE, which he accused of playing a role in the melting of a glacier. That research found the glacier’s retreat was “entirely attributable” to global warming.\n\nDifferent approaches\n\nThe main questions attribution studies seek to answer are: did the warmer climate make a flood, heatwave, fire or storm more likely, and did it increase its ferocity? Several groups have developed methods that have been independently validated by other researchers.\n\nThe most active and influential group of researchers is World Weather Attribution (WWA), whose work is often reported in the media.\n\nUsing computer models, scientists can compare a simulation of a particular weather event against a world in which warming caused by the burning of fossil fuels and other human activities was not present.\n\nIn their most recent study, WWA researchers found that climate change increased the risk of the Los Angeles wildfires, which have killed at least 29 people and destroyed more than 10,000 homes since igniting on Jan 7.\n\nTinderbox conditions fuelling the blazes were approximately 35 per cent more likely due to global warming caused by burning fossil fuels, they found, reducing rainfall, drying out vegetation and extending the overlap between flammable drought conditions and powerful Santa Ana winds.\n\nOther organisations running attribution studies include Britain’s Met Office, which also compares today’s climate with simulations of a world with a climate more like the one before the Industrial Revolution. Yet others use more broad-brush techniques, including ClimaMeter, which describes itself as “an experimental rapid framework for understanding extreme weather events”.\n\nThe group uses historical observational data, rather than more complex computer models, as well as news reports and AI tools like ChatGPT, although it admits that its method is less effective at analysing very unusual events.\n\nNo single cause\n\nScientists stress that climate change should not be considered the sole cause of an extreme event and its impacts. “For instance, if a heavy smoker develops lung cancer, we would not say the cigarettes caused the cancer — but we might say the damage caused by the cigarettes made it more likely,” WWA explains on its website.\n\nResearchers also look at political or social factors that make a weather disaster more deadly or destructive — poor quality construction, for example, or badly maintained infrastructure. Some types of extremes have a well-established link with climate change, such as heatwaves or heavy rainfall.\n\n“More and more, we’re starting to have events that we can clearly say would have had a near-zero probability without our influence on the climate,” said Sonia Seneviratne, a climate scientist who has worked with WWA. “Events are now becoming so extreme that it’s easier to detect this influence,” she notes.\n\nOther phenomena like droughts, snowstorms, tropical storms and forest fires can result from a combination of factors and are more complex.\n\nSearch for data\n\nAnother limitation that worries researchers is the scarcity of observational data and measurements in certain parts of the world, particularly in Africa. That dearth makes it harder to study impacts, leading to inconsistency between different analyses.\n\n“The lack of observed data is penalising in certain regions. There is also a lack of model data, i.e. high-resolution climate simulations,” said Aurelien Ribes, a climate scientist at the French meteorological research agency CNRM.\n\nHe stressed the need for consistency and said that “any future use of this data in legal or compensation proceedings will have to be based on more systematic approaches”.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:03:24.287Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888570/the-pioneering-science-linking-climate-to-weather-disasters",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:46.000Z"
}
