{
  "title": "Joy turns to despair as Gaza returnees struggle to settle - World - DAWN.COM",
  "author": null,
  "content": "CAIRO: The joy of thousands of Palestinian families who made it back home in north Gaza after a ceasefire with Israel is turning to despair as the cold reality of uninhabitable, bombed-out homes and dire shortages of basic supplies sets in.\n\nMany have begun complaining about a lack of running water that forces them to queue for hours to fill plastic containers for drinking or cleaning. With most homes now heaps of rubble as far as the eye can see, returnees have scoured whatever useful items remain from their property to erect makeshift tents.\n\nAt night, residential districts laid to waste by Israeli airstrikes and shelling sink into darkness for lack of electricity or fuel to operate standby generators.\n\n“There is nothing, no life, no water, no food, no drink, nothing for living. Life is very, very hard. There is no Jabalia camp,” Hisham El-Err said on Wednesday, standing by the ruins of his multi-storey house in the biggest and mostly densely populated of the Gaza Strip’s eight historic refugee camps.\n\nEgypt refuses to be part of forced displacement from Gaza; Israeli forces kill two Palestinians in occupied West Bank\n\nHis extended family is now huddling in tents, which offer scant protection from Gaza’s mid-winter chill.\n\nBy late on Tuesday, Hamas authorities said most of the 650,000 people displaced from the north by the war had re-entered Gaza City and the north edge of the enclave from areas to the south where fighting was less intense and destructive.\n\nMany of those returning, often laden with what personal possessions they still had after months of being shunted around as battlegrounds shifted, had trekked 20km or more along the coastal highway.\n\nFahad Abu Jalhoum returned with his family to Jabalia from the Al Mawasi area in south Gaza but the destruction they found was so pervasive they had been forced to go back south.\n\n“It’s just ghosts without souls (in the north),” Abu Jalhoum said in Al Mawasi. “We all missed the north but when I went there I was shocked. So I returned to (the south) until we get relief from God.”\n\nA Hamas official who spoke on condition of anonymity said smaller amounts of fuel, cooking gas and tents had been brought into Gaza than what had been agreed in ceasefire negotiations.\n\nThe Gaza government media office put the initial need of tents at 135,000, but the Hamas official said only around 2,000 had got in since the deal took effect on Jan 19.\n\nHe also said work to rehabilitate hospitals and bakeries knocked out by the fighting had not begun and urged mediators to ensure more aid flows in, adding that dissatisfaction among militant groups could affect the truce.\n\nUnder the deal, 33 Israeli prisoners held by Palestinians in Gaza are to be freed in the first six weeks of the ceasefire in exchange for hundreds of Palestinian prisoners, many of them serving life sentences in Israel.\n\nSeven Israeli prisoners and 290 Palestinian prisoners have so far been exchanged. Three more Israeli prisoners are to be swapped for tens of Palestinian detainees on Thursday, according to Hamas and the smaller allied Islamic Jihad group.\n\nEgypt won’t be part of displacement\n\nEgyptian President Abdel Fattah al-Sisi said on Wednesday that forced displacement of Gazans is an “injustice that we cannot take part in”, after US President Donald Trump floated a plan to move Palestinians from the territory to Egypt and Jordan.\n\n“The deportation and displacement of the Palestinian people from their land is an injustice that we cannot take part in,” Sisi told a news conference in Cairo with Kenyan President William Ruto.\n\nSisi said Egypt’s historic position on the Palestinian cause “can never be compromised”.\n\nHe said Egypt supported “the establishment of a Palestinian state” and was “determined to work with President Trump, who seeks to achieve the desired peace based on the two-state solution”.\n\nIsrael kills two Palestinians in WB\n\nIsraeli forces killed two Palestinians in separate overnight raids in the occupied West Bank, including one in Jenin, the Palestinian health ministry said on Wednesday.\n\nThe ministry said in a statement that a 25-year-old man it identified as Osama Abu al-Hija was killed late on Tuesday in Jenin as a result of an Israeli air strike.\n\nShortly after midnight on Wednesday, the ministry said a 23-year-old Palestinian man it identified as Ayman Naji was killed in the northern city of Tulkarem by Israeli forces.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/30082216c931adf.jpg",
  "retrievedAt": "2025-08-26T08:02:28.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888584/joy-turns-to-despair-as-gaza-returnees-struggle-to-settle",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:00.000Z"
}
