{
  "title": "Lebensraum - Newspaper - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump has bent diplomacy full circle. He has reversed inter-state relations to a pre-Westphalian age.\n\nThe conduct of international political relations between states were enshrined in the 1648 Treaty of Westphalia. It introduced the concept of territorial integrity, that “states, regardless of size, have the right to self-governance”. Sovereignty shifted from a personal credo of kings to a national concept of citizen states.\n\nThat treaty brought a long-sought peace to Europe after centuries of internecine conflict. By 1648, a mature China was already midway between its ancient Ming and the Qing dynasties, and India had seen over a century of consolidated rule by five Mughal emperors, from Babar to his great-grandson Shah Jahan.\n\nSince then, international borders have undergone change — sometimes by force (Hitler’s Anschluss in 1938), by smokeless invasion (Nehru’s annexation of Goa in 1961), by occupation (Israel into Palestine), or by timely purchase.\n\nTrump can be forgiven for offering to buy Greenland.\n\nTrump can be forgiven for offering to buy Greenland from Denmark. He is imitating precedent. In 1803, the US purchased Louisiana from France for $15 million. This purchase doubled America’s size, making it one of the largest nations in the world.\n\nIn 1867, the US bought Alaska from Russia for $7.2m. In 1898, the US purchased the Philippines from Spain for $20m. In 1917, the US bought from Holland the Dutch Virgin Islands for $25m. When in 1867, the US bought Alaska, it offered also to purchase Greenland for $100m. The Danes refused. Trump must be wondering how much he would have to pay Denmark today for Greenland.\n\nThe ice-capped mass of Greenland (it is the world’s largest island, “one quarter of the size of the contiguous United States”) is proving an irresistible temptation to superpowers. Russia, China, and the US pursue their interest in Greenland for its strategic location, its mineral resources, and its unexplored Siberian potential.\n\nTechnically, Greenland, although integrated into Denmark since 1953, is autonomous and self-governing. It has an elected parliamentary system. Most of its 57,000 residents are indigenous Inuits.\n\nLike the Channel Islands to the UK, Greenland is part of the Danish royal kingdom which controls “citizenship, monetary policy, and foreign affairs, including defence”. Greenland does not have a military. Denmark offers it the umbrella of Nato.\n\nThe US maintains a military presence on Greenland through its Pituffik Space Base (previously Thule Air Base). Earlier, it had a secret nuclear-powered base called Camp Century. In 1968, a B-52G, with four nuclear bombs crashed while “attempting an emergency landing at Thule Air Base … causing extensive radioactive contamination”. One of the H-bombs on board is still missing. In time, a thermal thaw should reveal its location.\n\nWill Denmark be able to withstand Trump’s ham-handed advances? It might not have much of a choice. Nato, already beleaguered by Trump, may support Denmark but in the last resort will leave it (like the Ukraine) to extricate itself.\n\nGreenland is as vulnerable to the US as a Thanksgiving turkey. Should Greenland be invaded, Denmark which is 2,920 kilometres away is not in a position to defend it. It has a modest naval fleet of three squadrons, manned by 3,000 navy personnel.\n\nThe Kingdom of Denmark is not Mrs Thatcher’s United Kingdom. In 1982, Mrs Thatcher succeeded in sending a British armada 13,000km across the Atlantic to liberate the Falkland Islands. It managed to do so with America’s logistical support. Caspar Weinberger (then US defence secretary) received an honorary British knighthood for his timely cooperation.\n\nIf Trump is serious about Green­land, he has four options. He can invade Greenland, confident he will not be opposed. He can arm-twist Denmark into selling it to him as the prime bidder. He can induce Greenland’s electorate to vote for union with the US. Or he can make deals directly with Greenland’s ‘autonomous’ government and make it his obedient handmaiden.\n\nTrump’s example may tempt other world leaders to flex newly developed muscles. The thought must have crossed Prime Minister Modi’s mind to resolve the Jammu & Kashmir impasse, not by direct invasion, but by offering to buy Azad Jammu & Kashmir from its nominally independent government.\n\nThis would not be the first time. In 1846, Gulab Singh (then Raja of Jammu) bought Kashmir from the British for Rs75 lakhs in cash and was acknowledged as Maharaja of a united Jammu & Kashmir. In exchange for British protection, he agreed to pay an annual tribute of “one horse, twelve shawl goats, and three pairs of Cashmere shawls”.\n\nBuying and selling territory is not a foreign concept. Didn’t we in 1958 buy Gwadar port from Oman’s sultan for $2m?\n\nThe writer is an author.\n\nwww.fsaijazuddin.pk\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679ae0f24839a.jpg",
  "retrievedAt": "2025-08-26T08:01:55.271Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888597/lebensraum",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:17:46.000Z"
}
