{
  "title": "New US admin has nothing but respect for Pakistan, says Trump associate - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Beach plays down Richard Grenell’s pro-PTI remarks, says he may have been ‘misled’\n• Govt offers support as US investors eye Pakistan for investments in several areas\n\nISLAMABAD: An associate of US President Donald Trump, who is currently leading a delegation of investors to Pakistan to explore business opportunities, said on Wednesday the US administration has nothing but respect for the incumbent leadership of Pakistan, led by Prime Minister Shehbaz Sharif.\n\nGentry Beach, who also met PM Shehbaz, made these remarks at a press conference as journalists asked him questions about Richard Grenell — Trump’s special missions envoy in the new administration — who had tweeted in support of incarcerated PTI chief Imran Khan, stirring controversy.\n\nThe US investor said Mr Grenell “may have been misled” about Pakistan. “He personally told me there are a number of deepfakes, AI presentations on the internet … it’s not true or real,” he said in response to a question.\n\nAccording to Mr Beach, Mr Grenell had a very defined view and “supports everything we are doing in Pakistan”.\n\n“I believe [Grenell] probably has a better understanding today than he did previously of the current situation here … I have seen no evidence that our administration in the US has anything but respect for their leadership here. Period,” he added.\n\n‘Billions of dollars’\n\nMr Beach said US President Donald Trump believed in economic diplomacy and that their ongoing visit was part of that effort. “We plan on investing billions of dollars in Pakistan across a number of different areas, including critical minerals and real estate […] From a real estate perspective, we brought our real estate development partners, and I am going to build some of the most high-end and luxury properties ever seen in Pakistan,” he added.\n\nHe also mentioned energy, tec­hnology, artificial intellige­nce, and other areas that needed attention and investment.\n\nMr Beach said there were great investment opportunities in Pakistan with an amazing base of intelligent people, which he said remained “overlooked” in the past, across diverse fields.\n\n“We view Pakistan as one of the biggest global opportunities [ … ] which is very unique,” he said.\n\nMr Beach said he had remai­n­ed very close to the Trump adm­i­nistration for a long time, and that now the US was entering a new era of peace and prosperity under President Trump’s leadership.\n\nHe said the leadership of both the US and Pakistan shared the same vision for peace and prosperity, noting that for the last four years, “we all have been under attack” and criticised the policies of the Biden administration.\n\n“These are the things that Pre­sident Trump is cleaning up, and he has brought the right team to address them. I believe your leadership in this country is very aligned and like-minded, and I think it is very important that we build a strong bridge between both these groups,” he said while recalling the strong historical ties between the two countries.\n\nGovt offers support\n\nSeparately, PM Shehbaz Sha­rif reaffirmed his government’s unwavering commitment to fac­i­l­itating foreign investors by ens­uring a conducive business environment, streamlined processes, and robust institutional support.\n\nIn a meeting with a delegation of international investors led by Mr Beach, the PM underscored the country’s unique appeal as a global investment destination, highlighting its strategic location, skilled and youthful workforce, and rapidly expanding consumer market.\n\nDiscussing Pakistan’s dyna­mic investment landscape and promising economic potential, he exp­r­e­ssed gratitude for the delegation’s keen interest in exploring business opportunities in Pakistan.\n\nMr Beach commended Pakistan’s immense economic potential and conveyed his delegation’s enthusiasm to explore diverse investment opportunities across key sectors, including mining and minerals, renewable energy, infrastructure development, and technology.\n\nHe acknowledged the government’s pro-investment policies and expressed confidence in the nation’s future growth trajectory.\n\nNOTE: An earlier version of this report identified Gentry Beach as an aide to President Donald Trump. He is, in fact, an associate of the new US president. The report has now been edited to reflect this.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679aa93e29bf0.jpg",
  "retrievedAt": "2025-08-26T08:02:28.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888588/new-us-admin-has-nothing-but-respect-for-pakistan-says-trump-associate",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:06:21.000Z"
}
