{
  "title": "‘Champions Trophy to be held without opening ceremony’ - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: In an untoward development, it has emerged that there will be no opening ceremony of the ICC Champions Trophy starting in Pakistan next month, mainly due to the late arrival of England and Australian squads for the prestigious event.\n\nMoreover, it has been learnt that no warm-up matches will be held in the elite eight-nation tournament.\n\nA well-informed source has told Dawn that in accordance with the travelling schedule, which all the participating teams had conveyed to the International Cricket Council (ICC), England are set to arrive in Lahore on Feb 18, just one day before the first match of the event is staged in Karachi, between defending champions Pakistan and New Zealand.\n\nThe Australia squad, who are scheduled to play their first group stage game against England on Feb 22 in Lahore, will arrive in the provincial capital on Feb 19.\n\n“Due to the late arrival of England and Australian teams the initial plan to hold the traditional opening ceremony featuring the participating teams and their captains has been cancelled,” the source revealed.\n\n“However, the PCB is considering a plan to organise some sort of event on its own to mark the opening of the grand tournament,” added the source.\n\nAccording to some recent media reports, the Indian team and their captain may not travel to Pakistan to attend the opening ceremony, mainly because of the strained political relations between the two neighbouring countries.\n\nThe late arrival of England and Australian teams may also prove a blessing in disguise for the ICC to get rid of the controversy surrounding Indian squad’s chances of skipping the opening ceremony. Due to the Indian government’s staunch stance of not sending its cricket team to Pakistan, the ICC has already adopted the hybrid model under which India will play all their matches in Dubai, including the semi-final and final, if they qualify.\n\n“The England team is currently touring India for a limited-overs series which concludes on Feb 12 while the Australian squad, which is in Sri Lanka currently, will end the tour on Feb 14. Though both the teams could arrive in Pakistan a few days before the start of the Champions Trophy to [also] attend its opening ceremony, they preferred to give rest to their players after the long tours,” the source further said.\n\nAs Pakistan, South Africa and New Zealand will also be featuring in a short ODI tri-series in Lahore and Karachi from Feb 8 to 14, all of them will also not play any warm-ups.\n\nThough the Afghanistan squad will arrive in Lahore on Feb 12, they will not have any team to play a warm-up, as the two other participating teams — India and Bangladesh teams — will reach Dubai on Feb 15 to play their opening match there on Feb 20. Most likely India and Bangladesh will also not play any warm-up.\n\nAccording to the schedule, New Zealand will arrive in Lahore on Feb 5 and South Africa on Feb 6 to compete in the tri-nation series.\n\nThe Champions Trophy will also reach Pakistan on Jan 31 after which it will be taken to the cities, where the trophy could not be sent on its previous visit to the country.\n\nRECONSTRUCTION OF GADDAFI STADIUM\n\nMeanwhile, the reconstruction of the Gaddafi Stadium has entered its final stages, according to the PCB.\n\n“The chairs of all the enclosures will be installed by the end of Thursday night,” a PCB spokesman said in a media briefing held in Lahore on Wednesday.\n\n“The finishing of the pavilion and office building has also been completed and now the work to lay new furniture there has also started,” the spokesman added.\n\n“Moreover, all other tasks inside the stadium have been completed.”\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:03:55.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888552/champions-trophy-to-be-held-without-opening-ceremony",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:38.000Z"
}
