{
  "title": "NA panel questions quality negligence in rice exports - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Assembly Standing Committee on Commerce has expressed concerns about neglect in the quality inspection procedure, which has interrupted rice shipments to the European market.\n\nOn Wednesday, the committee meeting chaired by MNA Muhammad Jawed Hanif Khan in the parliament house discussed the calling attention notice of Ms Sharmila Shiba Faruqui Hashaam on disruption in Pakistan’s rice exports, particularly the 72 interceptions made by the EU.\n\nAt the outset, the committee expressed deep concern over this matter.\n\nThe committee pointed to quality control issues, particularly in the inspection process, as the root cause of these challenges. It was revealed that the National Food Security Department has been unable to address these quality issues effectively.\n\nAs a consequence of this issue, the government is now proposing a new regulatory authority to ensure better oversight. The committee noted that Punjab and Sindh together account for 5 million tonnes of rice exports, and the interceptions significantly impacted these exports.\n\nSecretary of the Ministry of Commerce Jawad Paul clarified that the EU issued no formal warning, dispelling any misconceptions regarding the issue. He explained that the lack of a national framework for food security had led to the proposal for a new empowered authority, which would be better equipped to handle such challenges with improved security and expertise.\n\nThe committee also reviewed the government’s ambitious export target of $60 billion in exports by the end of 2029. Members expressed scepticism about the feasibility of achieving this target, urging the Ministry of Commerce to provide more concrete details on the steps and strategies required to meet this goal.\n\nThe ministry was directed to share a more detailed plan in the next meeting.\n\nAmong major discussions, the committee urged the insurance companies operating under the ministry’s domain to increase their contributions to Corporate Social Responsibility initiatives and ensure these funds are effectively utilised.\n\nThe committee also discussed the Trading Corporation of Pakistan (TCP) performance, urging swift action to resolve long-standing issues of receivables and pending debts, particularly those owed by various ministries and organisations. It was emphasised that clearing these liabilities is crucial for the TCP’s financial health and operational efficiency.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/301118295dfbf99.jpg",
  "retrievedAt": "2025-10-12T01:15:01.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888556/na-panel-questions-quality-negligence-in-rice-exports",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:29.000Z"
}
