{
  "title": "Homicide prevention unit launched in Lahore to stem wave of murders - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore police on Wednesday launched the Homicide Prevention Unit (HPU), an intelligence-driven initiative aimed at reducing murders/killings and preventing violent disputes before they escalate.\n\nConsisting of trained police inspectors, the unit will be headed by Lahore Operations SSP Taswar Iqbal. A focal person from each division of the city will assist the HPU.\n\nAn official privy to the information told Dawn that Chief Minister Maryam Nawaz had grilled the entire provincial police regime at the CM Secretariat over frequent killings.\n\nIn the hours-long meeting with the CM, he said, the issue of homicide remained dominant.\n\nThe Lahore police high-ups, however, followed the CM’s instructions and came up with the dedicated force on Wednesday, the official said.\n\nHe said the HPU was raised in response to concerning homicide trends in the city, with 514 murder cases reported in 2024 — a reduction from 605 (15 per cent) in 2023, yet still a major challenge for law enforcement, as homicide remains a persistent issue fueled by old enmities, land disputes, monetary conflicts, and a culture of illegal weapons.\n\nThe data from 2024 reveals that out of the total 514 murder cases registered across the city, 380 of them were formally challaned.\n\nOf the total, he said, 91 cases remained untraced, indicating challenges in evidence collection and witness cooperation, besides the inability of investigation officers to bring them to a logical conclusion.\n\nThe area-wise analysis shows that certain hotspots continue to experience higher murder rates, necessitating targeted policing and community engagement strategies.\n\nThe HPU will work with a preventive approach rather than merely reacting to crimes after they occur, the official said.\n\nThe prime objectives of the unit include early identification of violent threats through intelligence gathering, collaboration with community leaders and agencies to mediate disputes, tracking habitual offenders and proclaimed offenders wanted in murder and attempted murder cases, enhancing de-weaponisation efforts to reduce gun violence, and resolving land and monetary disputes through alternative dispute resolution mechanisms in collaboration with the revenue department.\n\nHe went on to say that the HPU will operate under the operations wing, with specialized inspectors designated for intelligence gathering and data collection across all police divisions.\n\nThe workflow involves data-driven crime mapping to identify high-risk areas, targeted interventions for at-risk individuals and families, and increased surveillance and proactive law enforcement against organized criminal groups.\n\nHe said the police report identified several major factors behind murders in the city, including old enmities and revenge killings, land/property disputes turning violent, unresolved past enmities that reignite into new conflicts, a culture of illegal weapon possession, monetary disputes and financial disagreements escalating into violence, and cases involving abduction and forced marriages, which often result in murder.\n\nLahore Operations DIG Faisal Kamran claims that the HPU will prove to be a game-changer in crime prevention, focusing on root causes rather than just enforcement.\n\nThe unit will work closely with the community, government institutions, and dispute resolution bodies to ensure long-term crime reduction, the DIG said.\n\n“If proved successful, the initiative could serve as a model for other cities struggling with violent crime in Pakistan,” concludes DIG Faisal Kamran.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:01:58.850Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888530/homicide-prevention-unit-launched-in-lahore-to-stem-wave-of-murders",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:09:06.000Z"
}
