{
  "title": "Zardari okays changes to Peca amid outcry - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Also assents to Digital Nation, National Commission on Status of Women (Amendment) bills\n• Provisions added to cybercrime law challenged in LHC over free speech concerns\n\nISLAMABAD / LAHORE: President Asif Ali Zardari on Wednesday gave his assent to amendments to the Preven­tion of Electronic Crimes Act (Peca) 2016, despite widespread backlash from political parties, journalist bodies and human rights organisations.\n\nThe new provisions introduce harsher penalties for what the government considers “fake news”, expand state oversight of digital platforms and envisages the creation of new regulatory bodies to monitor social media.\n\nCritics view the legislation as a tool for suppressing dissent and silencing critical voices, while the government insists it is necessary to combat disinformation.\n\nA petition challenging the Pre­vention of Electronic Crimes (Amend­ment) Bill 2025 has also been filed in the Lahore High Court (LHC).\n\nAccording to the Presidency, the president also signed two other bills on Wednesday — the Digital Nation Pakistan Bill 2025 and the National Commission on the Status of Women (Amend­ment) Bill 2025 — both of which were recently passed by parliament.\n\nThe move came a day after the Senate approved the amended Peca, triggering backlash from journalists who have labelled the changes an “attack on freedom of expression”.\n\nThe PTI and other opposition parties have also rejected the legislation, accusing the government of attempting to suppress dissent through restrictive cyber laws.\n\nA key amendment in Peca introduces Section 26(A), which imposes severe penalties for spreading “fake news” online. The provision states that any individual who intentionally disseminates false information likely to cause fear, panic or unrest may face up to three years in prison, a fine of Rs2 million, or both.\n\nHuman rights organisations, including Amnesty Inter­national and the Human Rights Commi­ssion of Pak­is­tan, have condemned the law, arguing that it grants excessive power to authorities and undermines fundamental rights.\n\nAmendments challenged\n\nA petition challenging the Pre­vention of Electronic Crimes (Amendment) Bill 2025 has been filed before the LHC by journalist Jaffar bin Yar through Advocate Nadeem Sarwar.\n\nIt argues that no media organisations or key stakeholders were consulted before passing the law, and that the amendments were fast-tracked through parliament without proper debate.\n\nIt highlights concerns that the new provisions will stifle free speech by introducing harsh penalties for misinformation and expanding the powers of the Pakistan Tele­communication Authority (PTA). The newly created Social Media Regulation and Protection Authority (SMPRA) will have sweeping authority to block and remove content under ambiguous criteria.\n\n“These provisions grant authorities power to block and remove content based on vague criteria, which will violate the right to freedom of expression and fail to meet the standards of proportionality and necessity under international human rights law,” the petition said.\n\nThe petition contends that the law is disproportionate, opaque and designed to silence dissent, making it a tool for self-censorship rather than a legitimate measure against disinformation. It urges the court to declare the Peca amendments unco­n­s­titutional and strike down the law.\n\nKey changes\n\nThe amended Peca law introduces several structural changes to cybercrime enforcement. For instance, it envisages the dissolution of the Federal Investigation Agency’s (FIA) Cybercrime Wing, which will be replaced by the National Cyber Crime Investigation Agency (NCCIA) to investigate online offences.\n\nThe law also contains the establishment of a Social Media Complaint Council. In cases where social media platforms fail to comply with directives, the authority will have the power to approach the tribunal for enforcement.\n\nThe federal government will also establish a Social Media Protection Tribunal to enforce the provisions of the amended act.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:01:55.273Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888590",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:06:21.000Z"
}
