{
  "title": "GSMA slams Pakistan’s spectrum policy - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: GSMA has criticised Pakistan’s spectrum policy, warning that increasing the cost of spectrum is unsustainable and poses a significant threat to the future development of mobile services.\n\nGSMA, a global organisation representing mobile operators and entities across the mobile ecosystem and adjacent industries, has issued a paper emphasising that mobile network infrastructure is vital for Pakistan’s digital transformation, acting as the backbone for widespread connectivity and socioeconomic growth. It also highlights that countries such as the Philippines, Vietnam, Thailand, Bangladesh, and Indonesia have more spectrum than Pakistan.\n\nGSMA stated that ‘Digital Pakistan,’ the government’s flagship initiative launched in 2018, aims to enhance digital infrastructure and facilitate the rapid delivery of innovative digital services. However, the country faces several challenges that threaten the sustainability and growth of its mobile infrastructure.\n\nGSMA Intelligence’s analysis reveals that had spectrum been fully assigned in previous auctions, Pakistan could have realised additional benefits of approximately $300 million, or Rs80 billion, for the national economy.\n\nThe GSMA paper also referred to past auctions, such as in 2014 and 2021, which resulted in unsold spectrum, leading to reduced spectrum supply for mobile operators. “This has contributed to slower 4G rollout and adoption,” the paper added.\n\nGSMA emphasised that Pakistan’s upcoming spectrum auction should focus on enhancing the country’s digital infrastructure rather than prioritising government revenue. It highlighted the 600MHz set to be made available in the upcoming auction, including over 500MHz in core mid-bands such as 2.3GHz, 2.6GHz, and 3.5GHz, which are essential to addressing the country’s current shortfall.\n\nThe paper warned that excessive spectrum pricing has serious consequences for both the industry and consumers, citing a study by GSMA Intelligence and others that linked high spectrum prices to slower mobile data speeds, worse coverage, and slower rollout. Unsold spectrum in past auctions has already led to lost economic growth for Pakistan.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:02:14.998Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888557/gsma-slams-pakistans-spectrum-policy",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:29.000Z"
}
