{
  "title": "Defending champion Asjad ousted from National Snooker - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: The NBP 49th National Snooker Championship witnessed a major upset on Wednesday as defending champion Asjad Iqbal was ousted from the tournament after losing against Mohammad Sajjad 5-3 here at the NBP Sports Complex.\n\nWith the victory Sajjad booked an all-Punjab quarter-final clash against Mohammad Naseem Akhtar, who registered a narrow 5-4 win over Sindh’s cueist Zulfiqar A. Qadir in their last-16 match.\n\nIn Wednesday’s other matches, Mohammad Asif — Pakistan’s most successful cueist — survived a scare against Mubashir Raza to progress into quarters, where he will be up against Ian Mark John, who edged past Babar Masih 5-4.\n\nLast-year finalist, Awaisullah Munir kept his perfect run intact as he recorded a thumping 5-1 win over Sharjeel Mehmood to book a last-eight date with Abdul Sattar of Sindh. Sattar won a pre-quarter thriller against province-mate Abdul A. Jabbar 5-4.\n\nShahid Aftab and Sohail Shehzad completed the quarter-final line-up following identical 5-2 wins over Waseem Abbas and Mohammad Shahbaz, respectively.\n\nAsjad, who was seeking to retain his title, got off to a strong start, winning the first frame 25-61. However, Sajjad bounced back, taking the next two frames 65-39, 62-25. Asjad, though, struck back in emphatic fashion as he clinched the fourth frame with a break of 114.\n\nBut Sajjad halted the comeback immediately and wrapped up the victory as he bagged the next three frames 69-29, 78-11, 69-29.\n\nIn another exciting match, Asif — who won the World Amateur Championship last year — was stretched to the full distance by Mubashir.\n\nAsif, undefeated in the tournament so far, took an early lead, winning the first frame 86-8, but Mubashir turned the tide in his favour after he won the next two frames 81-13, 80-21 to take the lead.\n\nHigh-flying Asif kept the momentum on his side as he won the next three frames 56-47, 79-15, 70-1 to seemingly take a decisive advantage.\n\nBut Mubashir, undettered, staged a strong comeback as he struck back by winning two consecutive frames 66-46, 79-21 to level the match again. But Asif proved to be the better cueist as he clinched the deciding frame 71-30.\n\nThe 31-year-old Awaisullah, began the knockout phase with a convincing win over Sharjeel.\n\nAwaisullah, who won the 6-red championship in Riyadh last year, dominated the match, winning the first four frames 66-45, 90-35, 61-13, 68-0. Sharjeel won the fifth frame 68-0, but Awaisullah closed out the match with a commanding 90-1 win in the sixth frame.\n\nAll the quarter-finals will be played on Thursday at the same venue.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:02:13.599Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888546/defending-champion-asjad-ousted-from-national-snooker",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:38.000Z"
}
