{
  "title": "Women’s football matches cancelled in Bangladesh after protests - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: A women’s football match was cancelled in Bangladesh on Wednesday after protests by religious hardliners forced organisers to call off the fixture, the second such incident in as many days.\n\nAnalysts say that previously fringe religious movements have grown bold following the ouster of premier Sheikh Hasina last year.\n\nThe northern city of Joypurhat was due to host a friendly football match between its district women’s team and another from nearby Rangpur.\n\n“The Islamists in our area gathered in a field and marched toward the venue. There were hundreds of them,” tournament organiser Samiul Hasan Emon said.\n\n“The situation worsened, and we had to cancel today’s event.” Abu Bakkar Siddique, the headmaster of a madrassah, said he had joined the demonstration alongside his students, as well as teachers and pupils from several other madrassas.\n\n“Girls’ football is un-Islamic,” he said. “It is our religious duty to stop anything that goes against our beliefs.”\n\nThe incident came one day after another match was postponed in nearby Dinajpur following a similar demonstration. “The match was suspended half an hour before it was supposed to kick off. We had to quickly move the girls to a safer place,” teacher Moniruzzaman Zia said.\n\nLocal government officer Amit Roy said four people were injured in clashes after protesters and counter-demonstrators lobbed bricks at each other, but all had since been discharged from hospital.\n\nWednesday’s incident was swiftly condemned by the Bangladesh Football Federation.\n\n“Football is for everyone, and women have full rights to participate in it,” BFF media manager Sadman Sakib said in a statement.\n\nReligious groups in Bangladeshi have grown noticeably more prominent after years of suppression by Sheikh Hasina’s government.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/0309514463ee6ad.jpg?r=095244",
  "retrievedAt": "2025-08-26T08:02:13.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888577/womens-football-matches-cancelled-in-bangladesh-after-protests",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:46.000Z"
}
