{
  "title": "Foreigners withdraw 87pc money from T-bills - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan witnessed 87 per cent foreign investment withdrawal from treasury bills (T-bills) due to a sharp reduction in profit rates in almost seven months.\n\nThe returns on T-bills halved during the first seven months of the current fiscal year. These large outflows occurred despite a stable exchange rate for over a year.\n\nFinancial market experts said many other factors could contribute to the outflow of foreign investments from T-bills.\n\nAccording to the State Bank of Pakistan (SBP) data, T-bills attracted an inflow of $984 million from the start of July last year to Jan 17. In contrast, the outflow reached $852m during the period.\n\nSteep decline in returns said to be behind massive outflow\n\nThe returns on T-bills plunged more than 50pc from its peak of 24pc, mainly due to a steep fall in the interest rate since June 2024. The State Bank has slashed its policy rate by 1,000 basis points (bps) to 12pc.\n\nIn the last auction before the monetary policy announced on Jan 27, the government further reduced T-bill rates by up to 41bps for different tenors.\n\nThe return on a 12-month tenor was redu­ced by 41bps to 11.38pc compared to 49bps at the auction held on Jan 8, reducing the rate by 90bps to 11.38pc this month.\n\nMarket experts said the uncertainty regarding the debt servicing of $26.1bn in FY25 is still there despite the authorities’ claims that most of this problem has been resolved.\n\nForeign investors are the most sensitive elements of any economy as they leave the country before possible arrest in an economic trap, said a banker, adding that it was witnessed during the Covid pandemic when over $4bn left the country within a few months.\n\nIn the last auction held before the monetary policy, the return on benchmark 6-month T-bills was further reduced by 39bps to 11.4pc.\n\nFinancial experts believe that the T-bills are no longer attractive for foreign investors as the rates could go down further after a 100bps cut in the interest rate.\n\nThe outflow of foreign investment up to Jan 17 was $121.5m, higher than the inflow of $72m in the same period.\n\nIt was also interesting to note that $630m, accounting for 64pc of the total T-bills inflows during six and a half months, came from the UK with the biggest outflow of $457m.\n\nOther significant inflows in T-bills during this period were $152m from the UAE, $61m from Bahrain and $52m from Australia.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:15:00.214Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888560/foreigners-withdraw-87pc-money-from-t-bills",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:08:29.000Z"
}
