{
  "title": "Govt asked to speed up shifting to electric vehicles, renewable energy - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Senate Standing Committee on Climate Change chairperson Sherry Rehman on Wednesday asked the government to speed up shifting to electric vehicles and renewable energy as climate concern is mounting.\n\nAt a committee meeting, which was also attended by Federal Minister for Power Sardar Owais Leghari and other stakeholders, Senator Rehman criticised the sluggishness in production of electric vehicles .\n\nShe noted that only 60,000 EVs had been produced as yet, far short of the 600,000 target, while the transport sector remained the largest contributor to air pollution, accounting for 48pc.\n\nThe ministry of industries came under scrutiny at the meeting for failing to provide a comprehensive data on local EV production and charging infrastructure.\n\nSherry says transport sector largest contributor to air pollution\n\nThe committee was informed that Pakistan had set a goal of installing 3,000 EV charging stations by 2030, but so far just eight stations have been made operational. Over 1,000 individuals had registered to establish new charging points, yet Senator Sherry Rehman emphasized the need for rapid expansion. She also called on banks to introduce EV financing schemes to make electric mobility more accessible.\n\nOn the renewable energy front, 55pc of Pakistan’s electricity currently came from renewable sources, with a target of increasing this to 60pc by 2030 and 88pc in the long term.\n\nThe recent closure of five inefficient, high-emission furnace oil power plants — collectively generating 2,500 MW — was hailed as a significant step toward cutting pollution and saving billions in costs.\n\nSenator Rehman urged stronger incentives for investments in solar, wind, and hydro energy to further accelerate the transition.\n\nWater scarcity also emerged as a pressing concern, with Sindh and Balochistan facing critical shortages.\n\nSherry Rehman advocated for solar-powered irrigation systems to replace conventional drip irrigation, which she said was contributing to water depletion.\n\nPakistan’s reliance on fossil-fuel-powered motorcycles and rickshaws remains a significant environmental challenge, with these vehicles emitting 150 kilotons of carbon annually.\n\nMinister Leghari outlined plans to transition two and three wheelers, along with diesel-powered vehicles, to electric alternatives.\n\nThe committee put forward several key recommendations, including expanding EV charging networks and incentivising private investment, enhancing local EV production to meet national policy goals, promoting renewable energy use in homes and businesses and enforcing energy-efficient building codes nationwide.\n\nOther recommendations also included encouraging energy-efficient transport and improved public transit.\n\nThe chairperson reaffirmed the committee’s commitment to holding authorities accountable for climate action.\n\nThe meeting was attended by Senators Zarqa Suhrawardy Timor, Manzoor Kakar, Naseema Ehsan, Shahzaib Durrani and PM’s Coordinator for Environmental Change Romina Khurshid Alam.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:03:39.086Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888531/govt-asked-to-speed-up-shifting-to-electric-vehicles-renewable-energy",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:09:15.000Z"
}
