{
  "title": "Bahawalpur traffic cop held for bribe after video goes viral - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: A traffic police assistant sub-inspector (ASI) was arrested on Wednesday for taking bribe from the driver of a vehicle after a video clip showing him receiving illegal gratification was uploaded on social media.\n\nAccording to a police spokesman, action was taken against ASI Rashid Ahmed on the orders of District Police Officer (DPO) Aasad Sarfraz, after he took notice of the video clip showing the suspect taking bribe.\n\nAfter registration of a case (FIR No.83/25 ) under sections 155-C and 161 of the PPC, on the complaint of traffic Inspector Nasir Mahmood, the ASI was arrested and lodged in the lock-up at Hasilpur police station.\n\nIn his complaint the inspector said that the video clip showed the suspect received Rs2,000 from a driver as a bribe. The DPO also suspended the ASI from service.\n\nIn addition, Vehari Circle Anti Corruption Establishment (ACE) during a raid claimed to have arrested a grade-19 official, Mazhar Kaleem, principal officer of agriculture department, for accepting Rs70,000 bribe.\n\nAccording to ACE Circle Officer Mansoor Khan, the suspect received bribe from an agriculture department employee, Aziz Ahmed, for tampering with official record.\n\nARRESTED: The Federal Investigation Agency (FIA), Multan, claimed to have arrested a proclaimed offender (PO) in a human smuggling case from Bahawalpur.\n\nFIA officials said that the suspect, Munir, was allegedly involved in a human smuggling, but was absconding. He was declared as PO in the case by a court.\n\nOn Wedneday, on a tip-off about his presence in the city, an FIA team conducted a raid on a premises and arrested the PO.\n\nMeanwhile, Vehari police claimed to have arrested an inter-district drug smuggler , a resident of of and recovered from his possession a big consignment of over five maund charas along with 61 kilo opium worth lakhs of rupees along with a pistol from his possession.\n\nPolice spokesperson said drug trafficker Abid, a resident of Gujranwala, was arrested after offering strong resistance to the police raiding party.\n\nHe was found in possession of 200kg charas which he was to supply to different local drug sellers.\n\nFAKE COP HELD: Vehari police claimed to have arrested a man impersonating a deputy superintendent of police (DSP).\n\nAs per the police, Abdul Khaliq of Khairpur Tamewali, who was wearing uniform of a DSP, went to Head Islam where he tried to buy fish on discounted rates. However, the fish seller noticing that he was a fake cop, informed police and got him arrested.\n\nDEATH SENTENCE: The Kabirwala additional sessions judge handed down death sentence, along with a fine of Rs500,000 to a man on Wednesday.\n\nAccording to the prosecution, the convict, Ghulam Abbas Joyia had in 2016 murdered one Mazhar Lak on an old enmity in the limits of Sirai Sadhu police station.\n\nThe police had arrested him under section 302 of the PPC, along with his five accomplices, who were acquitted by the court, giving them the benefit of the doubt.\n\nPublished in Dawn, January 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:03:54.229Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888511/bahawalpur-traffic-cop-held-for-bribe-after-video-goes-viral",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T02:09:07.000Z"
}
