{
  "title": "Ceasefire with India, result of diplomatic efforts of many countries: Tarar",
  "author": null,
  "content": "ISLAMABAD, May 13 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Tuesday that the recent ceasefire between Pakistan and India was the result of diplomatic efforts of various countries.\nTalking to Sky News, he said that Prime Minister Shehbaz Sharif thanked US President Donald Trump for playing key role to ensure ceasefire.\nHe said that China, Saudi Arabia, United Arab Emirates , Turkey and Qatar also played an important role in the ceasefire.\nThe minister said that the US President’s second post on X expressed America’s desire to resolve the Kashmir dispute.\nHe said it was a good sign that President Donald Trump wanted to resolve the Kashmir issue.\nTo a question about Indus Water Treaty, he said India has not yet stopped the flow of water to Pakistan, as it did not have the capacity to stop the water. At present, the flow of water was continuing as usual, Attaullah Tarar remarked.\nThe minister said that Pakistan had expressed regret and sympathy over the Pahalgam incident.\n“Pakistan offered cooperation in a transparent investigation. India leveled allegations against Pakistan without evidence,” the minister lamented. India has not yet and could not present evidence, he said, adding no group had claimed responsibility for the Pahalgam incident.\nThe minister opined that the Pahalgam attack in the presence of seven lakh Indian troops in occupied Kashmir was a security and intelligence failure of India.\n” Indian intelligence has proven to be a complete failure,” Attaullah Tarar said.\nIndia, he added, has failed miserably in linking the Pahalgam incident to Pakistan.\nThe minister said that the first contact between DGMOs had been made after the ceasefire.\nPakistan, he said, was fighting the biggest war against terrorism, and operations against terrorists were ongoing on the western borders.\nIn the war against terrorism, Pakistan has sacrificed the lives of innocent civilians, soldiers, and officers, Attaullah Tarar said. The minister said no safe haven for any terrorist group in Pakistan. The ceasefire was not a weakness of Pakistan but a strategic success, he remarked.\nPakistan targeted Indian military installations and arms depots and its losses were in front of everyone.\nIndia was not in a position to bear further tension, Tarar said.\nThe entire nation stands with the Pakistani forces and Pakistan’s victory was quite clear.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:25:28.635Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ceasefire-with-india-result-of-diplomatic-efforts-of-many-countries-tarar/",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T08:04:00.000Z"
}
