{
  "title": "Lawmakers applaud armed forces for effective, unified response to Indian aggression",
  "author": null,
  "content": "ISLAMABAD, May 13 (APP):Lawmakers on Tuesday praised Pakistan’s armed forces for their effective and united response to Indian aggression, while mocking Indian Prime Minister Narendra Modi by calling him “Surrender Modi.”\nPakistan People’s Party (PPP) senior leader Hina Rabbani Khar condemned India’s aggressive behavior, calling it reckless and against international norms. “India acted irrationally; Pakistan acted responsibly. But our patience was mistaken for weakness,” she said.\nShe expressed disappointment over the silence of the international community on India’s move to revoke Article 370.  He said that US President Donald Trump has acknowledged Kashmir as a disputed territory.\nShe warned against justifying cross-border strikes in the name of counterterrorism. “If such logic is accepted, Pakistan could also justify striking inside India by presenting proof of Indian-sponsored terrorism,” she cautioned.\nPPP leader Abdul Qadir Patel paid tribute to Pakistan’s armed forces, Chief of Army Staff General Syed Asim Munir, and the Pakistan Air Force for their brave and united response. He mocked Modi by calling him “Surrender Modi,” and said, “Pakistan has shown the world that we want peace, but if war is forced on us, we will respond with full force.”\nHe accused India of being behind acts of terrorism in Pakistan and credited the country’s nuclear strength to the efforts of Shaheed Zulfikar Ali Bhutto and Shaheed Benazir Bhutto.\nHe also appreciated PPP Chairman Bilawal Bhutto Zardari for promoting Pakistan’s peace message internationally.\nMajlis Wahdat-e-Muslimeen MNA Hameed Hussain lauded the unity of the armed forces, political leadership, media, and public in resisting Indian attacks “under the cover of darkness.”\nPakistan Tehreek-e-Insaf (PTI) MNA Fazal Muhammad Khan expressed full support for the military and praised their professionalism and courage. “Our Army, Navy, and Air Force have once again proven their strength—not just in the region, but globally,” he said.\nJamiat Ulema-e-Islam’s Abdul Ghafoor Haideri praised the armed forces and thanked friendly nations like China and Turkey for standing by Pakistan during the tense period.\nMuttahida Qaumi Movement (MQM-P) MNA Syed Waseem Hussain appreciated the unity of the nation and the firm response by Pakistan’s armed forces.\nPPP’s Sehar Kamran praised the government’s foreign policy and noted that India faced diplomatic isolation during the recent tensions. She also lauded the nation’s unity during Operation Bunyanum Marsoos.\nParliamentary Secretary Gul Asghar Khan thanked China for its support and appreciated the government’s success in isolating India diplomatically. “India was left alone on the world stage,” he added.\nPPP’s Mirza Ikhtiar Baig congratulated the nation and praised the armed forces for their response, calling it a historic moment.\nHe said India was also defeated diplomatically.\nPPP MNA Mahesh Kumar Malani said the armed forces responded decisively by shooting down Indian drones and jets. He said that the entire nation—including minorities—stood shoulder to shoulder with the military against Indian aggression.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:25:28.976Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/lawmakers-applaud-armed-forces-for-effective-unified-response-to-indian-aggression/",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T10:44:00.000Z"
}
