{
  "title": "PM directs measures to broaden tax net; tech use to prevent evasion",
  "author": null,
  "content": "ISLAMABAD, May 13 (APP): Prime Minister Shehbaz Sharif on Tuesday calling for measures to broaden the tax net, directed the authorities concerned to take strict action against individuals and sectors involved in tax evasion.\nThe prime minister, chairing a review meeting on broadening the tax base and increasing tax revenue, said that the individuals and sectors capable of paying taxes must be brought into the tax net.\nHe also instructed the stringent accountability of officers and personnel assisting the tax evaders, according to a PM Office press release.\nThe prime minister lauded the efforts of the government’s economic team for swiftly heading toward achieving FBR’s revenue targets for the current fiscal year.\nHe said that expanding the tax net was the government’s priority to reduce the tax burden on the common man by lowering their tax rates.\nThe prime minister directed to complete the digital monitoring of cement and other sectors by next month. Besides, the efforts to increase tax revenue from the tobacco sector should be accelerated in collaboration with the provinces.\nHe directed that pending tax-related cases should be pursued effectively to ensure the recovery of the nation’s money.\n“By the grace of Allah, the national economy is stable and moving toward growth,” he said, and called for collective efforts for country’s development.\nDuring the briefing, the participants were told that the complete implementation of the Track and Trace System at cement plants nationwide led to a significant increase of billions of rupees in tax revenue. With the implementation of this system in the sugar industry, tax revenue increased by 35% from November 2024 to April 2025.\nIt was told that tax revenue target equivalent to 10.6% of GDP will be attained as a result of reforms in the FBR.\nFederal Ministers Azam Nazeer Tarar, Muhammad Aurangzeb, Ahad Khan Cheema, Attaullah Tarar, Chairman of FBR, and other senior officials attended the meeting.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:25:13.317Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-directs-measures-to-broaden-tax-net-tech-use-to-prevent-evasion/",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T08:53:00.000Z"
}
