{
  "title": "Nuclear option was never on table: hopefully sense will prevail: Dar",
  "author": null,
  "content": "ISLAMABAD, May 13 (APP): Deputy Prime Minister and Foreign Minister Senator Ishaq Dar has said that Pakistan did not consider deploying nuclear warheads to strike India when the tensions between the two countries mounted last week.\nThe deputy prime minister, in an interview with CNN, said that Pakistan “had no choice” but to launch strikes in “self-defense” following India’s May 7 cross-border attacks.\nTerming India’s strikes a “war” and a “wishful attempt to establish its hegemony” in Kashmir, he said, “There are certain times when you have to take very serious decisions… We were very sure that our conventional capacity and capabilities are strong enough that we will beat them both in air and on ground.”\nWhile the ceasefire agreement has so far appeared to hold, Dar told the interviewer that long-term negotiations between the two parties were “not done yet.”\n“We still hope sense will prevail,” he remarked.\nHe said that it was in the interest of everybody not to delay or to leave such issues beyond a certain reasonable time.\n“(The Indians) had seen what happened in the sky,” he added. “They could see how serious the damage was.”\nDeputy Prime Minister said that there was no direct contact between Indian or Pakistani officials, contradicting a previous assertion made by India’s director general of military operations, who reportedly received a message from his counterpart in Pakistan during the talks. Instead, he said that US Secretary of State Marco Rubio passed on the message that India was ready to stop the fighting.\nDar says “Kashmir is the root cause of this regional instability.”\nHe said that Pakistan was looking forward to establishing a path for long-term peace and security that would provide “dignity for both sides.”\nCalling Kashmir “the root cause of this regional instability” Ishaq Dar called for the granting the self-determination rights to the Kashmir people.\nHe reiterated that Pakistan was not behind last month’s attack in Pahalgam, saying, “We condemn terrorism in all forms and all manifestations.”\nDar added that he believed US President Donald Trump supported Pakistan’s antiterrorism efforts.\n“If they didn’t believe (in our efforts), they would not have cooperated the way (that they did),” Dar said, pointing to Trump’s social media post on “finding a solution” to the Kashmir conflict.\nHowever, Dar warned that the already precarious ceasefire could be threatened if the water issue was not resolved in the coming talks, referring to the Indian decision of holding the Indus Waters Treaty in abeyance.\nFailure to resolve the water issue “will amount to an act of war,” Dar said.\n\"There are certain times when you have to take very serious decisions... We were very sure that our conventional capacity and capabilities are strong enough that we will beat them both in air and on ground,\" says Dar.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:25:32.141Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nuclear-option-was-never-on-table-hopefully-sense-will-prevail-dar/",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T07:03:00.000Z"
}
