{
  "title": "Dr Tariq praises unity of nation, courage of armed forces against Indian aggression",
  "author": null,
  "content": "ISLAMABAD, May 13 (APP):Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry Tuesday praised the unity of Pakistani nation and the courage of the armed forces during the recent Indian aggression, calling it the rise of a “new Pakistan.”\nSpeaking in the National Assembly, he said the entire nation – including lawmakers – stood together during Indian aggression. “India wrongly assumed we were divided. That mistake led to their defeat,” he added.\nDr. Tariq highlighted the bravery of the Pakistan armed forces, saying, “India can never match the spirit of sacrifice and courage shown by our military. Their attack was stopped with strength and skill.”\nHe said the Indian miscalculation came at a time when their proxies were losing ground inside Pakistan due to the efforts of the armed forces. “India may have tried to shift our military’s focus from internal security to border defense, but we were fully ready.”\nHe appreciated the role of Pakistani media, noting it was praised internationally, while Indian media was mocked for spreading false news.\nDr. Tariq said Pakistan wants peace in the region, but true talks cannot happen without addressing the Kashmir issue. He added that the matter is once again gaining attention at the global level, and even the United States understands that peace in South Asia is impossible without resolving it.\nHe also praised Pakistan’s military leadership, especially Chief of Army Staff General Syed Asim Munir and Air Chief Marshal Zaheer Babar Sidhu for their professionalism.\nThanking God for Pakistan’s success, he said the country showed the world its strong defense, including the downing of Indian Rafale jets and intercepting missile attacks. “India now realizes that defeating Pakistan is not an option,” he said.\nDr. Tariq applauded the unity of both the Senate and National Assembly, saying all lawmakers stood above political differences for the country’s dignity and sovereignty.\nReferring to the Indian attacks on May 6 and 7, he said that night shattered India’s arrogance. “We brought down five Indian aircraft, including the Rafale jets they thought were unbeatable. The world is now asking how Pakistan did this – the answer lies in the passion and skill of our soldiers.”\nHe also said Pakistan achieved a diplomatic victory, as the global community recognized the country’s calls for peace, dialogue, and resolution of the Kashmir issue as per UN resolutions.\n“By Allah’s blessing, Pakistan’s role as a responsible country was acknowledged. Islamic countries congratulated us and showed strong support,” he said, adding that it is now clear to everyone – including India – that Pakistan knows how to defend itself.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:25:31.413Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dr-tariq-praises-unity-of-nation-courage-of-armed-forces-against-indian-aggression/",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T09:53:00.000Z"
}
