{
  "title": "Confessions of a youth from Skardu – Dark web of EU disinfo Lab continues to unravel",
  "link": "https://www.app.com.pk/national/confessions-of-youth-from-skardu-dark-web-of-eu-disinfo-lab-continues-to-unravel/",
  "date_published": "2021-02-03T10:22:00.000Z",
  "source": "APP",
  "content": "The intricately woven network of the EU disinfo Lab operating inside Pakistan continues to untangle slowly, showing the attempts for penetration by hostile intelligence networks and use of their proxies to create unrest in the country.\nThe peaceful locality of Kharmang valley in Skardu, surrounded by lofty mountains, grassy lush fields and roaring waterfalls seems to have recently grabbed media attention, not for its beauty, but for the shocking revelations made by one of its youth.\nMehdi Shah Rizvi son of late Haider Shah Rizvi, a resident of the picturesque valley is a hot topic on the social media, with his recently uploaded video message in which he made a confession of how he was used by like-minded groups from abroad to create dissent amongst the locals and fuel a separatist movement.\nMehdi Shah’s father Haider Shah Rizvi was also a sub-nationalist and worked for his handlers from abroad to achieve their desired objectives under the close patronage and linkage with the Indian intelligence outfit – Research and Analysis Wing – RAW.\n“It was just because of these cheap people that my father was declared anti-Pakistan,” he said and added that they never knew that they were being used.”\nHe revealed that international forums, operating under the cover of accredited NGOs working with the United Nations misled his father and forced him to give statements against the armed forces and the country.\nMehdi said he too was brainwashed and was told that his father was killed by “poisonous injections by the secret agencies.”\n“But my father was not anti-Pakistan. He was not anyone’s agent. He wanted to work for his people, but he got exploited by them [fake NGOs working for RAW].”\nHe said his father too was told lies and made to believe that he was serving his people, and was “used” by what he described as the “mafias” into following the anti-Pakistan path. He said after the death of his father on April 22, 2015, he also trod the same path, but later realized that he too had become a victim.\nMehdi Shah, who studied in Karachi and has several profiles on the microblogging site Twitter and Facebook, in a confession released on February 1 on various social media platforms admitted how he was being used for the anti-Pakistan rhetoric, by the Indian proxies.\nMehdi Shah said he began his career in the rightist group with Balawaristan National Front (Hameed Group), founded in 1995 by Abdul Hamid. In 1999, Abdul Hameed Khan left Pakistan and spent 20 years in India and Belgium. However, he unconditionally surrendered to Pakistani security officials on 8 February 2019, and the organization, BNF-H was banned by National Counter Terrorism Authority (NACTA) on 26 February 2019.\nMehdi Shah got a scholarship for studies in Italy, where he was again contacted by the members of the international NGOs – on the behest of RAW. He said he was contacted by Amjad Mirza and was told that Gilgit Baltistan was part of India and greater Ladakh and since he was the son of a martyr, they would help him achieve his father’s dreams.\n“They trapped me, told lies, and gave me money,” he said.\nThe same forums, mentioned by Mehdi Shah in his video, have been busted by a damning report of the EU disInfo Lab which uncovered a network of over 750 fake media outlets, spread in 116 countries; over 550 websites, and more than ten Non-Governmental Agencies (NGOs). The Indian Chronicles – part of India’s fifth-generation warfare – 5GW – against Pakistan.\nHe said that he was instigated to launch a verbal attack against Pakistan and said that the entire India was behind him. He said he was even told the words that he had to use to make his rhetoric forceful and effective.\n“I was promised money, and asked to be part of demonstrations against Pakistan,” he said and added that Amjad Ayub Mirza, an exiled Kashmiri separatist, who contacted him in Italy, promised to take him to New Delhi to meet “Modi gee”.\nMehdi Shah said in Paris he met other members of the ‘Gilgit Baltistan Bachao Tehreek’ – Save Gilgit Baltistan Movement and was told to support them in various forums.\nHe said he was portrayed as a victim, whose father was killed by the establishment and “asked to specifically write down against the ISI.” He said he also met Baloch separatists and some other Kashmiri leaders who all had similar agendas.\nIn his statement he named involvement of several other sub-national groups and people; including Dr. Amjad Ayub Mirza, a key figure in the EU Disinfo Lab based in Scotland, Sajjad Raja, head of the UK based NeP JKGBL, Shaukat Kashmiri head of the UKPNP, Advocate Mehboob Afaq Bilour, Shabbir Mayar, Ghiasuddin, Najaf Ali, Asif Naji, Qamar Najmi and many more.\nMehdi Shah said he was made to believe that he would be made the President of the National Equality Party Jammu Kashmir Gilgit Baltistan and Ladakh (NEP JKGBL) for the European Union and taken to the United Nations.\nMehdi Shah admitted that all of his videos against the army and the state institutions were scripted by officials of RAW and he was asked to attend several online conferences to incite youth against Pakistan. He said he was provided with prepared scripts to speak at such events.\nHe said rallies were held in Paris and the United Kingdom with a handful of people. Similarly, for the protest in front of the Pakistan embassy in Paris, he was given the script for speech.\n“I was told to arrange 200 people and said all payments would be made for them in any hotel in Paris. I was asked to use the speech videos, photographs, news coverage and to further disseminate through every possible social media service across the world.”\n“I don’t know how these people exploited our videos, photographs, and the stuff on social media, and for what purpose.”\nSimilarly, he said he was promised that all funds would be made available to him for managing at least one bus full of people from different towns and villages of Gilgit Baltistan for a rally in the city centre of Gilgit.\n“I was asked to hold a meeting on Zoom to tell the people back home how my father was murdered by the Pakistani intelligence, and I and my separatist friends in Pakistan were being persecuted and living under harsh conditions.”\n“I was provided scripts to incite hatred against Pakistan, its armed forces.”\nMehdi Shah said he was also provided “a script to be read at a UN Human Rights Council at Geneva from 14 Sept – 8 Oct.”\nHe said he was told to speak against the arrest of Baba Jan and other leaders who were arrested in Pakistan for creating a law and order situation and was asked to exploit the situation by inciting the people against Pakistan. He said large amounts of funds were provided to us for the purpose.\n“They took advantage of my poor financial condition and exploited me by making me believe that I was a victim and I would be made a leader.”\nSimilarly, there was a plan to hold a protest in front of the Pakistan embassy in Paris, and given the script for the speech. “I was told to arrange 200 people and said all payments would be made for them. I was asked to use the speech videos, photographs, news coverage and to further disseminate through every possible social media service across the world.\nHe said he was also asked to take a strong stance against the arrest of his group members back home and told to burn the Pakistani passport and flag in front of the Pakistan embassy in France.\n“But I refused, and I realized that I was being used as fodder. They wanted to do their politics on our dead bodies.”\n“I have deep regret for whatever I did on my own and on their insistence,” Mehdi Shah said and added “But I don’t want others to follow what I did. People like me … students, who get trapped by such people for their ulterior motives.”\nThe deep network is gradually unraveled shows a mystifying link between Baltistan Student Federation BSF, BNF, GB anti-Pak Liberal activists sponsored, all sponsored by the Indian Secret agency RAW to destabilized peace of Gilgit Baltistan and Pakistan.\nThe notorious Indian agency RAW has been using youth from Gilgit-Baltistan and Balochistan, residing in Europe, by taking advantage of their impoverished financial status and were being provoked against Pakistan by using the funding.\nThe Director-General ISPR in a media interaction also pointed to the wide network mentioned in the Indian Chronicles.\nThe revelations by Mehdi may not be new for the Pakistani counter-intelligence but should serve as an eye-opener for other the common Pakistanis how India was using Pakistan’s own youth, for spewing venom against the country at international forums, without realizing the motives of their handlers.\nForeign Minister Shah Mehmood Qureshi and the National Security Advisor Dr Moeed Yousaf in a press conference urged upon the United Nations and the European Union to hold an investigation into the manipulation of international platforms by fake NGOs, media outlets, and even fake parliamentarians.\n-Report by Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:18:38.526Z"
}
