{
  "title": "NCOC initiates national immunisation drive among all federating units",
  "link": "https://www.app.com.pk/national/ncoc-initiates-national-immunisation-drive-among-all-federating-units/",
  "date_published": "2021-02-03T08:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): The National Command and Operation Center (NCOC) on Wednesday simultaneously initiated national immunisation drive against Coronavirus across the country with all federating units including that of AJK and GB.\nThe NCOC held the inaugural ceremony of national Covid immunization program with Federal Minister for Planning, Development and Special Initiatives Asad Umar in chair flanked by National Coordinator NCOC Lieutenant General Hamood Uz Zaman Khan.\nCommercial Minister Counsellor China Xie Guoxiang was the chief guest where Federal Minister for Science and Technology Fawad Hussain Chaudhary, Special Assistant to the Prime Minister (SAPM) on Health Dr Faisal Sultan and SAPM on Poverty Alleviation Dr Sania Nishtar were also present on the occasion.\nSpeaking on the occasion, Federal Minister for Planning, Development and Special Initiatives Asad Umar lauded the sacrifices and meritorious services of Front line Healthcare Workers (FLHCWs) for serving the nation during the pandemic.\nپاکستان کی تمام اکائیاں ایک ہی وقت پر کرونا ویکسینیشن شروع کر رہے ہیں. ایک جھنڈا، ایک، ترانہ، ایک قوم. ہر زبان بولنے والا، ہر عقیدہ رکھنے والا شہری یکساں حقوق رکھتا ہے. جب بھی ہم اس طرح متحد ہوتے ہیں، کامیاب ہوتے ہیں. NCOC کی ٹیم کو اس مہم کی تیاری اور انتظام پر خصوصی مبارکباد pic.twitter.com/rO6WkBhGQL\n— Asad Umar (@Asad_Umar) February 3, 2021\n“Front line Healthcare Workers are our real heroes. No doubt they have put their lives at risk in their fight against COVID-19 and we pay tribute to all of them.”\nHe also thanked the government of Peoples Republic of China for supporting Pakistan during crisis of the COVID-19.\nHe also paid tribute to the team NCOC and provincial authorities working in close liaison in fight against COVID-19 at the forum.\nAsad Umar said the simultaneous inaugural ceremony was the center of national effort highlighting the unified collaboration of the provinces and the federal government collectively fighting the contagion.\nThe vaccine was administered to Rizwana yasmeen. She is working as charge nurse in Pakistan Institute of Medical Sciences (PIMS) isolation unit, she and her team has been working tirelessly in fight against Covid19 and she is representing all medical and paramedical staff of PIMS who have been involved in managing Covid19 patients.\nThe vaccinated individuals also included Javed Iqbal who is covid surveillance team member from DHO office Islamabad, he has been working in surveillance activities since first case of Covid19 was reported in Islamabad.\nHe and his team has been working tirelessly and has diagnosed over 10,000 positive cases in Islamabad by contact tracing and sampling.\nHe was representing all Covid-19 Surveillance teams who were the backbone of Covid19 management in Islamabad. Fahad Mehmood was also inoculated with vaccine who was working in pathology department of Shifa international dealing with Covid-19 testing.\nShifa international hospital has been testing a major bulk of Covid19 testing in Islamabad and has also been managing patients suffering from Covid19 infection. He was representing all people in Shifa international.\nThe Sindh ceremony was taken place at Dow university Ojha vaccination center where Chief Minister Murad Ali Shah was the Chief Guest.\nThe Chief Minister Punjab Usman Buzdar was the chief guest in the vaccination ceremony held at Lahore.\nIn Khyber Pakhtunkhwa, Chief Minister Mahmood Khan was the chief guest of inoculation ceremony.\nThe vaccination ceremony in Balochistan was held at Chief Minister Secretariat.\nIn Azad Jammu and Kashmir (AJK), the vaccination was held at the PM Secretariat whereas in Gilgit Baltistan (GB) inoculation was held at CS secretariat with Chief Minister GB as chief guest.",
  "retrievedAt": "2025-08-11T20:18:39.798Z"
}
