{
  "title": "Impartial plebiscite on Kashmir remains Pakistan’s ultimate objective: FM",
  "link": "https://www.app.com.pk/national/impartial-plebiscite-on-kashmir-remains-pakistans-ultimate-objective-fm/",
  "date_published": "2021-02-03T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Foreign Minister Shah Mahmood Qureshi on Wednesday said Pakistan’s ultimate objective remains the resolution of the Jammu and Kashmir dispute as per the wishes of the Kashmiri people and relevant resolutions of the United Nations Security Council through a free and impartial plebiscite.\n“We will not let anyone take away Kashmir from the Kashmiris. This cause and the struggle is just, sacred and non-negotiable,” the Foreign Minister said in his address at a seminar on ’Standing with Unheard Voices of Kashmir’ organized by Institute of Regional Studies.\nThe Foreign Minister said the people and government of Pakistan remained committed to extend full support to the just cause of Kashmiri’s right to self-determination.\nHe said the Kashmiris’ resolve for freedom from Indian occupation had only become stronger in the face of Indian atrocities.\n“Through their supreme sacrifices, Kashmiris have made it crystal clear that Jammu and Kashmir is not the so-called “integral part” of India,” he said.\nThe Foreign Minister said India’s re-invasion and re-occupation of the illegally occupied territory through barrel of the gun had further alienated the Kashmiri people.\nOver 900,000 occupation troops have perpetuated the worst reign of terror upon the innocent Kashmiris, he added.\n“It has been eighteen months, since the continuous military siege, communications blockade, media blackout, and unprecedented restrictions on the fundamental freedoms were imposed in Indian illegally occupied Jammu & Kashmir,” he said.\nQureshi mentioned that extra-judicial killing of young Kashmiris in fake “encounters” and staged cordon-and-search operations had become a regular occurrence in IIOJK with over 300 innocent Kashmiris martyred by the Indian occupation forces since 5th August 2019.\nHe said senior Kashmiri leadership including founding leader of Kashmiri organization “Dukhtaran-i-Millat” and the “Iron Lady of Kashmir” Asiya Andrabi, leader and founder of the Jammu & Kashmir Democratic Freedom Party Shabbir Ahmed Shah, prominent leaders such as Yasin Malik, Masarat Alam Bhat, Mohammad Ashraf Sehraie and others remain jailed including the infamous Tihar Jail in India on fake, malicious and trumped up charges.\nThe Foreign Minister said the real objective of the RSS-BJP regime behind its illegal actions of August 5th was to change the demographic structure of the occupied territory in violation of the UN Security Council resolutions and the international law, including the 4th Geneva Convention.\nHe said the world was witnessing rise of ultra-nationalism, racism, fascism, religious hatred and intolerance in India in the garb of “Hindutva” supremacist ideology, championed by the RSS-inspired BJP Government, which has been using violence to achieve its illegitimate objectives.\nThis “Hindutva” ideology is not only a threat to the Kashmiris, but to India’s own nationals as well, particularly Muslims, he added.\nHe mentioned targeted attacks and discriminatory measures against Muslims rampant in the BJP’s India — ranging from policies of systematically disenfranchising Muslims to physical assaults and other anti-Muslim actions under the boggy of “Love-Jihad” and “Corona Jihad” designed to demonize the Muslims.\nQureshi said several credible reports from human rights organizations and media outlets had already censured India on its ongoing military siege, clampdown on communications, media blackout and use of other measures to perpetuate its illegal occupation of IIOJK.\nHe said early resolution of the Jammu and Kashmir dispute was a pre-requisite for durable peace and stability in South Asia.\n“The unflinching belief of the Kashmiri people in their just struggle for freedom from Indian occupation fills our hearts with great pride. Their resilience in the face of unspeakable atrocities being perpetuated by Indian occupation forces is remarkable,” he said.",
  "retrievedAt": "2025-08-11T20:18:39.814Z"
}
