{
  "title": "$31tr debt threatens public services: UNCTAD - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Global public debt rose to $102 trillion in 2024, with developing countries accounting for nearly one-third — $31tr — of that total, according to a new report by the United Nations Conference on Trade and Development (UNCTAD). These economies paid a record $921bn in interest payments, severely straining public finances and threatening essential public services.\n\nIn its latest World of Debt report, released ahead of the fourth International Conference on Financing for Development in Spain on June 30, UNCTAD warns that mounting debt burdens, declining investment, and shrinking aid flows are derailing progress towards the Sustainable Development Goals (SDGs), especially for lower-income nations.\n\nSince 2010, public debt in developing countries has grown twice as fast as in advanced economies, the report states. Systemic inequalities in global financial systems have further exacerbated the crisis. Since 2020, developing nations have been forced to borrow at interest rates two to four times higher than those available to the United States.\n\nUNCTAD’s data reveals significant regional disparities. Asia and Oceania hold 24pc of global public debt, followed by Latin America and the Caribbean with 5pc, and Africa with just 2pc.\n\nDeveloping nations face record $921bn interest payments\n\nUNCTAD reports that 61 developing countries now spend at least 10pc of their government revenues on interest payments—leaving little room for investment in health, education, or climate action. Alarmingly, 3.4bn people now live in countries where interest payments surpass public spending on education or health. It calls for a fundamental overhaul of the international financial architecture.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/10/151252425d8ebf3.png?r=130046",
  "retrievedAt": "2025-08-20T04:29:38.665Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920441/31tr-debt-threatens-public-services-unctad",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:00:36.000Z"
}
