{
  "title": "Death of 20 babies at Pakpattan: DHQ hospital’s internal inquiry leaves many questions unanswered - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: The deaths of 20 children, mostly newborns, at the District Headquarters Hospital (DHQ), Pakpattan, raised many serious questions and sparked a fresh controversy following the findings of an internal inquiry committee formed to probe the deaths of only five children on June 19.\n\nReports confirmed that 15 of the 20 deceased were neonates and newborn babies. Dr Muhammad Muddasir, the convener of the inquiry committee, stated that all 20 neonatal deaths occurred between June 16 and June 22. According to medical experts, newborns in this age bracket undergo rapid physiological changes and require intensive care.\n\nOn June 19 alone, five babies reportedly died at the hospital’s pediatric ward. Grief-stricken families protested, alleging negligence on the part of doctors and paramedics as well as a shortage of oxygen cylinders. To address the growing unrest, DHQ Medical Superintendent Dr Adnan formed a three-member internal inquiry committee on June 21 that included Deputy Medical Superintendent Dr Muddasir as convener, Chief Consultant Pediatrician Dr Muhammad Adnan and Head Nurse Nighat Ara. The committee confirmed that 20 children died over the week, including 11 newborns, four one-day-olds, four five months old and one child who was five years old.\n\nSurprisingly, the committee’s report absolved the doctors and paramedics, giving them a clean chit, concluding that none of the deaths were linked to oxygen shortages or negligence of doctors and paramedics.\n\nIt stated that “all patients were neonates or infants who were already in critical condition upon arrival or admission and had received due attention from duty medical officers”. Interestingly, the report highlighted only ‘significant deficiencies’ in documentation of the deaths and directed the staff concerned to explain these lapses. It recommended a refresher course for the hospital’s medical personnel on proper documentation procedures.\n\nThis internal report has further angered the grieving families, many of whom are now demanding an impartial external investigation. The hospital administration has remained largely silent on the issue.\n\nMeanwhile, Secretary of Health and Population Dr Nadia Saqib made her routine visits where the matter of children’s deaths got the focus. Notably, internal blame-game has intensified—with the MS defending the doctors and nurses while administrative staff accusing the medical team of mishandling the situation. Both groups are blaming each other for the death of 20 babies.\n\nIn a significant development on Thursday, the MS surrendered the services of five administrative officials on the direction of the secretary. These included Finance and Budget Officer Zahid Saeed, Procurement Officer Abdul Basit, Khurram Kiyani (HR and Legal Officer), Audit Officer Mazhar Saeed and Logistics Officer Waleen Bin Malik.\n\nNow the question arises that when the three-member committee clearly says that documentation of babies’ death was not proper and the babies were critical, why the services of admin officers were surrendered.\n\nSpeaking to Dawn, independent sources reiterated the demand for an external, transparent inquiry into the tragedy.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:29:11.030Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920508/death-of-20-babies-at-pakpattan-dhq-hospitals-internal-inquiry-leaves-many-questions-unanswered",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T04:17:50.000Z"
}
