{
  "title": "Trump, Netanyahu ‘agree on rapid end’ to Gaza war - World - DAWN.COM",
  "author": null,
  "content": "• Spanish PM deplores ‘catastrophic situation of genocide’ as Israeli forces kill another 56 Palestinians\n• WHO delivers first aid shipment since March\n\nGAZA: Following the US strike on Iran, PM Benjamin Netanyahu and US President Donald Trump had agreed on a rapid end to the war in Gaza and expansion of the Abraham Accords, Israeli media reported on Thursday.\n\nAccording to the Israel Hayom, which cited “a source familiar with the conversation”, Trump and Netanyahu agreed in a phone call that the war in Gaza would end within two weeks.\n\nFour Arab states, including the UAE and Egypt, would jointly govern the Gaza Strip in place of Hamas. The group’s leadership would be exiled, and all hostages would be released, The Times of Israel reported.\n\nHowever, Arab allies have repeatedly asserted that they will not take part in the postwar rehabilitation of Gaza without Israeli acquiescence to the Palestinian Authority gaining a foothold there, as part of a pathway to a future two-state solution. Netanyahu has flatly rejected any PA role in the Gaza Strip, the publication said.\n\n‘Genocide’ in Gaza\n\nMeanwhile, Spain’s Prime Minister Pedro Sanchez on Thursday became the most prominent European leader to describe the situation in Gaza as a “genocide”, as rescuers in the war-ravaged Palestinian territory said Israeli forces killed 56 people.\n\nAfter more than 20 months of devastating conflict, rights groups say Gaza’s population of more than two million face famine like conditions.\n\nIsrael began allowing supplies to trickle in at the end of May following a blockade of more than two months, but distribution has been marred by chaotic scenes and near-daily reports of Israeli forces firing on those waiting to collect rations.\n\nSanchez said Gaza was in a “catastrophic situation of genocide” and urged the European Union to immediately suspend its cooperation deal with Israel.\n\nThe comments represent the strongest condemnation to date by Sanchez, an outspoken critic of Israel’s offensive who is one of the first European leaders, and the most senior, to use the term “genocide” to describe the situation in Gaza.\n\nSpeaking ahead of an EU summit in Brussels, Sanchez mentioned an EU report which found “indications” Israel was breaching its rights obligations under the cooperation deal, which forms the basis for trade ties.\n\nThe text cited Israel’s blockade of humanitarian aid for the Palestinian territory, the high number of civilian casualties, attacks on journalists and the massive displacement and destruction caused by the war.\n\nThe spokesman for Gaza’s civil defence agency, Mahmud Bassal, said Israeli forces killed 56 people on Thursday, including six who were waiting for aid in two separate locations.\n\nThe Israeli military said its troops had “fired warning shots” in order to prevent “suspects from approaching them” near the Netzarim corridor in central Gaza, where Palestinians gather each night for rations.\n\nAFP footage from a hospital in central Gaza on Wednesday showed Palestinians sobbing over bloodied body bags containing their loved ones who had been killed in an Israeli strike. “They (killed) the father, mother and brothers, only two girls survived. One of them is a baby girl aged one year and two months and the other one is five years old,” one mourner said.\n\nBeyond daily bombardment, Gaza’s health ministry says that since late May, nearly 550 people have been killed near aid centres while seeking scarce supplies.\n\nWHO aid\n\nThe World Health Organisation said on Thursday that it had delivered its first medical shipment into Gaza since March 2, adding though that the nine truckloads were “a drop in the ocean”.\n\nWHO chief Tedros Adhanom Ghebreyesus said nine trucks carrying essential medical supplies, 2,000 units of blood and 1,500 units of plasma were delivered via the Kerem Shalom crossing with Israel, “without any looting incident, despite the high-risk conditions along the route”.\n\nIsrael has stopped aid from entering northern Gaza but is still allowing it to enter from the south, two officials said on Thursday after images circulated of masked men on aid trucks who clan leaders said were protecting aid, not stealing it.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/685df97b3c974.gif",
  "retrievedAt": "2025-10-12T13:04:13.718Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920447/trump-netanyahu-agree-on-rapid-end-to-gaza-war",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:00:29.000Z"
}
