{
  "title": "Situationer: Lawmakers, FBR celebrate passage of ‘their budget’ - Business - DAWN.COM",
  "author": null,
  "content": "• ‘98pc’ of originally proposed draft adopted by NA, claims tax official\n• Final version incorporated ‘maximum amendments’, says Naveed Qamar\n\nAS the National Assembly passed the Finance Bill 2025 amid a flurry of last-minute amendments, a curious dissonance emerged — officials from the Federal Board of Revenue (FBR) insisted that the bill had undergone no meaningful changes, while the NA standing committee on finance celebrated the passage of the amended bill as a decisive victory for parliamentary supremacy.\n\nAt the centre of this debate lies a set of amendments — ostensibly modest in scope — that introduce procedural safeguards aimed at curbing the discretionary powers of tax officers.\n\nWhile the FBR downplays these changes as “administrative fine-tuning”, the committee frames them as a critical check on potential abuse of power.\n\nA senior tax official, speaking to Dawn on condition of anonymity, revealed that the FBR has introduced approximately Rs35 billion in additional tax measures through the revised amendments — on top of the Rs312bn revenue proposals outlined in the original Finance Bill 2025, tabled in parliament on June 10.\n\nThe FBR has also offered relief worth an estimated Rs8bn by reducing the sales tax on solar panel imports from 18pc to 10pc, he said.\n\n“Ninety-eight percent of the original Finance Bill has been approved by parliament,” the official clai­med, allowing only a 2pc margin for the standing committee’s input on the bill. However, he ack­now­ledged that the committee played a constructive role in refining the language of the original text and introducing safeguard measures to curb potential misuse of authority.\n\n“I do not see any major change in the enforcement-related provisions,” the officer asserted.\n\nBut MNA Naveed Qamar, who also chairs the National Assembly’s Standing Committee on Finance, said that voting was held on the committee’s final report, which incorporated all of its recommendations. He noted that the revised bill — approved by the National Assembly on Thursday — reflected the committee’s maximum input.\n\nMany versions\n\nControversy continues to swirl around the amendments approved by the National Assembly. The government initially tab­led the Finance Bill 2025, which was later followed by a revised draft submitted by the National Asse­mbly Standing Committee on Finance. On Thursday, Finance Minister Muham­mad Aurangzeb introduced a fresh set of amendments to the committee’s version of the bill.\n\nAs a result, the lower house voted on both the finance minister’s amendments and the committee’s draft. The FBR has now incorporated the approved changes, and a consolidated version of the bill will be forwarded to the president for assent, converting it into an act of parliament. However, tax experts have voiced concern over the dual drafts and overlapping revisions, warning that the process has created unnecessary confusion.\n\nMajor changes\n\nThe amended Finance Bill 2025 introduces procedural leniency in the suspension of bank accounts belonging to persons registered with the sales tax regime, set to take effect from July 1, 2025.\n\nIn the original Finance Bill, it was proposed to su­­s­pend the bank accounts of unregistered persons.\n\nUnder the revised Sec­tion 14AC, the FBR has outlined a stepwise mechanism whereby tax commissioners must provide three consecutive chances for voluntary registration before initiating intermittent three-day bank acco­unt suspensions. These suspensions — repeatable up to two additional times with week-long intervals — aim to bring non-compliant suppliers of taxable goods into the formal tax net without abrupt punitive action.\n\nA key provision of the Finance Bill 2025 is the insertion of Section 114C into the Income Tax Ordinance, 2001, which formally distinguishes between eligible and ineligible persons based on tax filing and asset disclosure.\n\nWhile the original Fin­a­nce Bill sought to bar ineligible individuals from major financial transactions — including large cash withdrawals and property purchases — the amended bill introduces a notable concession, such as individuals may now withdraw up to Rs100m annually across all their bank accounts. The shift marks a softening of the government’s earlier, more hardline ap­­proach to financial transparency and tax compliance.\n\nArrest powers\n\nThe amended Finance Bill 2025 also introduces a more structured and rest­rained framework for ar­­rests in major tax fraud cases. Under the revised Section 37A of the Sales Tax Act, 1990, the FBR must now seek approval from a three-member com­­­­­mittee including Mem­ber (Operations) and Member (Legal) before authorising arrest warrants in cases involving alleged tax losses exceeding Rs50m. Detainees must be presented before a magistrate within 24 hours.\n\nMoreover, arrests can only proceed if the accu­sed ignores three summons, attempts to flee, or is suspected of tampering with evidence. The amendments also extend liability to company directors or officers found personally complicit, without absolving the firm of its dues. Additionally, the law permits compounding of offe­nces upon full payment of tax, surcharge, and penalties, while mandating strict adherence to due process and the Code of Criminal Procedure 1898.\n\nCarbon levy\n\nThe amended Finance Bill 2025–26 has rebranded the controversial carbon levy as the Climate Support Levy, maintaining its rate at Rs2.50 per litre on petroleum products, including petrol, diesel, and furnace oil.\n\nThe amended Finance Bill 2025–26 also reshapes the governance of parliamentary privileges by introducing Clauses 4A and 4B to the Salaries and Perks of Members of Parliament Act. These provisions shift the authority to determine lawmakers’ benefits from the Parliamentary Secretariat to the House Committee—effectively placing control in the hands of legislators themselves. Additionally, the salaries of federal and state ministers have been aligned with those of Members of Parliament, standardising compensation across the executive and legislative branches.\n\nAn amendment to the Customs Act 1969 was also approved to introduce a cargo tracking system to curb smuggling. The system will electronically monitor imports, exports, and transit cargo.\n\nThe amended Finance Bill 2025 tightens compliance requirements for digital commerce platforms by introducing a tiered penalty regime.\n\nOnline marketplaces, payment intermediaries, and courier services that fail to submit mandatory monthly statements on time will face a penalty of Rs300,000 for the first default, escalating to Rs1m for each subsequent lapse within a year.\n\nAdditionally, platforms that facilitate e-commerce for unregistered sellers will incur the same penalties, signalling the government’s push to formalise the digital economy and enforce tax registration compliance.\n\nTax fraud\n\nThe amended Finance Bill 2025 introduced a tiered penalty regime for tax fraud, with harsher consequences for more serious offences. Individ­uals convicted under the more severe sub-clauses face up to 10 years in pri­son, fines of up to Rs10m, and repayment of the confirmed tax loss along with a 100pc penalty and default surcharge. Lesser offences carry a maximum sentence of five years, a Rs5m fine, and similar financial liabilities.\n\nIn parallel, the bill tightens restrictions on financial and property transactions by ineligible persons. Under the amended bill, such individuals would be barred from purchasing or registering motor vehicles above Rs7m, commercial properties over Rs100m, and residential properties exceeding Rs50m. They would also be prohibited from opening or maintaining investment accounts above Rs50 m in mutual funds, securities, or similar instruments.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:46:29.930Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920475",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:43:44.000Z"
}
