{
  "title": "Bilawal says New Delhi ‘lost global credibility’ after Pahalgam attack, military escalation with Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP Chairman and former foreign minister Bilawal Bhutto Zardari on Friday said that following the Pahalgam attack in occupied Kashmir and the brief but intense military escalation with Pakistan last month, India “lost its international credibility due to a lack of transparency and widespread disinformation”.\n\nEarlier this month, Pakis­tan launched a broad-based engagement campaign to present its perspective on the conflict with India to the world and counter New Delhi’s unproven allegations. As part of its global outreach, a delegation led by Bilawal visited the United States, London and Brussels.\n\nAddressing reporters at the National Press Club in Islamabad, the PPP chairman stressed that through spreading false information, both in the media and through diplomatic channels, India stripped itself of credibility.\n\n“Pakistan gained victory on the narrative front, which is beneficial,” Bilawal said. “The whole world saw what the Indian [and] Pakistani media were doing.\n\n“People all over the world were reading and accepting Pakistani media reports. The entire world knew that [the Indian] government was already lying, and their media had insinuated that they produced credible journalism,” the PPP chairman added.\n\nAddressing reporters, he said, “You showed in these five days that we have an impartial and credible media. Every country has their problems, but the Pakistani media community played the biggest role in the narrative victory during those five days, due to the media community’s credibility.”\n\nThanking the journalist community for their accuracy and reporting, Bilawal added that he was proud of how Gen Z — the first generation born into the digital age — handled social media during the four-day war.\n\n“For politicians, our word is our weapon; every political party handled the narrative the way they could, not just on local forums but internationally as well,” he stated. “But even more than that, Pakistani media’s role was historic, and their credibility was established on an international level during those five days.”\n\nSpeaking further, Bilawal emphasised that India, for the first time, spread disinformation through diplomatic channels, not just through the mass media.\n\n“This is the first time our neighbour was communicating lies on even diplomatic hotlines to different countries,” he lamented. “India didn’t show transparency, which is why its credibility suffered.”\n\nHe added that it took India a month to accept their missile “might have been neutralised”, while Pakistan openly confirmed shooting down a number of their aircraft in self-defence.\n\n“India’s war was based on lies; that’s when Pakistan stood with the truth,” Bilawal stated. “When they blamed Pakistan for the Pahalgham attack, we didn’t deny history. If our PM hadn’t asked for an impartial investigation on an international level, then India would have been successful in convincing the world that we were behind the Pahalgham attack.”\n\nBilawal said that Prime Minister Shehbaz Sharif “took the right decision at the right time, which is why we could establish credibility”. The PPP chairman also said that Pakistan’s own “credibility problem” was largely resolved through making the media more transparent.\n\n“We speak not just for the Pakistani people but for the Indian people, too. We don’t want hatred to pass down through generations. The new generation will not accept India’s message of hate.”\n\nThe PPP chairman noted that during the conflict, Pakistan not only established its credibility on the international stage, but it also highlighted that it is a military power on par with its much larger neighbour.\n\n“For Pakistan, it is a big victory that we shot down their missile,” he said. “We have established military parity.\n\n“Look at how big a defeat it is for India: as soon as we (the delegation) were leaving America, one of their military officers, under oath to their House, said that Pakistan is a phenomenal partner in the fight against terrorism,” he added, referring to US Central Command chief Army General Michael Kurilla. “This is their strategic partner saying this.”\n\nThe PPP chief also highlighted that following the operation, Chief of Army Staff Field Marshal Asim Munir was invited to the White House for lunch, hailing it as a “major achievement”.\n\nStating that Pakistan wants to resolve issues through dialogue and under the framework of international law, Bilawal accused India of pursuing a more warlike agenda, through steps such as Operation Sindoor and the suspension of the Indus Waters Treaty.\n\n“India’s case is that Pakistan is ‘Terroristan’, that they will stop our water and kill us through thirst,” the PPP chairman said. “They conspired to label Pakistan as a terrorist state. We foiled that conspiracy. We got Pakistan off the FATF (Financial Action Task Force) grey list and onto the white list. India failed on every front.\n\n“A ceasefire between Pakistan and India means dialogue should follow,” he maintained. “In principle, India should engage in dialogue. The Indian prime minister told Pakistan’s youth, ‘eat bread or face bullets’.”\n\nBilawal maintained that Pakistan was a nation that wants peace and operates with a “peace through strength” policy.\n\n“We want peace between both countries,” Bilawal said. “Principally, that is what India should do, but India now calls this ceasefire a ‘pause’. He (Indian PM Narendra Modi) is not a peacemaker but a warmonger.\n\n“Modi was once the Butcher of Gujarat, then the butcher of Kashmir, and now he wants to become the butcher of the Indus Valley Civilisation,” Bilawal warned, although he expressed hope that the US was “trying to fulfil the promise they made to us and to maintain peace”.\n\nSpeaking about the Kashmir issue, Bilawal highlighted that the dispute had become internationalised, contrary to New Delhi’s goals.\n\n“India constantly tried to keep the Kashmir issue an internal one, but after the war, it has become an international issue,” he said. “An issue which can lead to a war between two nuclear countries cannot be an internal issue. Even India, instead of calling it an internal issue, is calling it a bilateral issue now.”\n\nIn response to a question about the US-mediated ceasefire, Bilawal challenged Indian claims that New Delhi did not request one by saying: “If Modi says India didn’t wish for a ceasefire, he should simply say once that Trump is lying.”\n\nThe PPP leader also highlighted that there are no mechanisms between the two to resolve nuclear disputes.\n\n“We are the only two nuclear-armed countries that have no nuclear dispute resolution mechanism. We brought the threshold down so much that if there is any terrorist attack in any country, that means there will be a war,” Bilawal noted.\n\n“In such conditions, Pakistan’s stance is a position of a responsible state, a responsible nuclear power. India’s position is of a revisionist power that doesn’t abide by international law and the international rules-based order, and if it insists on keeping the entire world on tenterhooks, then it is not responsible enough to have a nuclear power,” the PPP chief stated.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/271727276f2daff.jpg",
  "retrievedAt": "2025-08-20T04:29:02.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920600/bilawal-says-new-delhi-lost-global-credibility-after-pahalgam-attack-military-escalation-with-pakistan",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T17:33:11.000Z"
}
