{
  "title": "Khamenei claims victory over US - World - DAWN.COM",
  "author": null,
  "content": "• In first appearance since truce with Israel, supreme leader hails ‘slap’ on the face of America\n• Hegseth insists strikes on N-facilities were successful\n• Iran’s legislature clears bill to suspend cooperation with IAEA\n\nTEHRAN / WASHIN­GTON: Even after Iran’s supreme leader accused President Donald Trump of exaggerating the impact of US strikes on Iranian nuclear sites, Washington continued to insist on the success of its actions, claiming that there was no evidence Tehran had been able to move any of its highly enriched uranium.\n\nIn his first public appearance since a ceasefire in the war with Israel took hold, Ayatollah Ali Khamenei hailed what he termed a “victory” over Israel, vowing never to yield to US pressure and insisting that the US had been dealt a humiliating “slap”.\n\n“The American president exaggerated events in unusual ways, and it turned out that he needed this exaggeration,” Khamenei said, rejecting US claims Iran’s nuclear programme had been set back by decades.\n\nThe strikes, he insisted, had done “nothing significant” to the country’s nuclear infrastructure.\n\nTrump, however, maintained that the attacks were devastating.\n\nPosting on his Truth Social platform, Trump dismissed speculation Iran might have removed enriched uranium prior to the raid, saying: “Nothing was taken out… too dangerous, and very heavy and hard to move!”\n\n“The cars and small trucks at the site were those of concrete workers trying to cover up the top of the shafts. Nothing was taken out of (the) facility,” Trump wrote on his social media platform, without providing evidence.\n\nBut Khamenei dismissed such claims, saying “the Islamic republic won, and in retaliation dealt a severe slap to the face of America”.\n\nTrue impact?\n\nIn Washington, the true impact of the strikes has sparked sharp political and intelligence debates.\n\nA leaked classified assessment suggested the damage to Iran’s nuclear programme may be less severe than initially claimed — possibly delaying progress by only a few months.\n\nThis assessment contrasts with statements from senior US officials.\n\nCIA Director John Ratcliffe said several facilities would need to be “rebuilt over the course of years”.\n\nDefence Secretary Pete Hegseth also said he was unaware of any intelligence suggesting Iran had moved any of its highly enriched uranium to shield it from US strikes.\n\n“President Trump created the conditions to end the war, decimating — choose your word — obliterating, destroying Iran’s nuclear capabilities,” he said at a press conference.\n\nTrump, who watched the exchange with reporters, echoed his defence secretary, saying it would have taken too long to remove anything.\n\nBut doubts remain about whether Iran quietly removed some 400 kilograms of enriched uranium from its most sensitive sites before the strikes — potentially hiding nuclear material elsewhere in the country.\n\nSeveral experts cautioned this week that Iran likely moved a stockpile of near weapons-grade highly enriched uranium out of the deeply buried Fordow site before the strikes, and could be hiding it and other nuclear components in locations unknown to Israel, the US and UN nuclear inspectors.\n\nThey noted satellite imagery from Maxar Technologies showing “unusual activity” at Fordow on Thursday and Friday, with a long line of vehicles waiting outside an entrance to the facility. A senior Iranian source told Reuters on Sunday that most of the 60pc highly enriched uranium had been moved to an undisclosed location before the US attack.\n\nThe Financial Times, citing European capitals, reported that Iran’s highly enriched uranium stockpile remains largely intact since it was not concentrated at Fordow.\n\nIAEA cooperation ended\n\nMeanwhile, Iran’s Guardian Council has approved a bill to suspend cooperation with the International Atomic Energy Agency (IAEA).\n\nLawmakers had voted in favour of the bill a day after a ceasefire ended a 12-day war with Israel.\n\nIranian officials have sharply criticised the International Atomic Energy Agency for failing to condemn the strikes, while Tehran criticised the watchdog for passing a resolution on June 12 accusing it of non-compliance with its nuclear obligations.\n\nIranian officials say the censure motion was “one of the main excuses” for the Israeli and US attacks.\n\n“The government is required to suspend all cooperation with the IAEA to ensure full respect for the national sovereignty and territorial integrity of the Islamic Republic of Iran,” Guardian Council spokesman Hadi Tahan Nazif told the official IRNA news agency.\n\nThe bill, which will now be submitted to President Masoud Pezeshkian for final ratification, would allow Iran “to benefit from all the entitlements specified under… the Non-Proliferation Treaty especially with regard to uranium enrichment,” Nazif said.\n\nParliament speaker Mohammad Bagher Ghalibaf said in a post on X that cooperation with the watchdog was “not possible” at this time until security at Iran’s nuclear facilities “is ensured.”\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/685e03b64b067.jpg",
  "retrievedAt": "2025-10-12T03:46:57.877Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920474/khamenei-claims-victory-over-us",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:34:54.000Z"
}
