{
  "title": "World Bank reaffirms support for Pakistan’s economic agenda - Business - DAWN.COM",
  "author": null,
  "content": "Federal Economic Affairs Minister Ahad Khan Cheema held high-level discussions on Thursday with the World Bank leadership in Washington DC, and welcomed the strengthened collaboration with the global financial institution in strengthening the economy, according to statement by the ministry on Friday.\n\nIn January, the World Bank pledged to provide $20bn to Pakistan under a 10-year country partnership framework (CPF) to support inclusive and sustainable development within the country.\n\nPrime Minister Shehbaz Sharif had welcomed a $40 billion “investment” by the World Bank, stating that the inflow will open “a new chapter” in various sectors of the economy.\n\nIn a meeting with WB Operations Managing Director Anna Bjerde and South Asia Regional Vice President Martin Raiser, the federal minister welcomed the strengthened collaboration between Pakistan and the Bank over the past year, the statement read.\n\nThis enhanced engagement has culminated in the development of the new country partnership framework (CPF) 2026-2035, a transformative ten-year strategy backed by $40bn commitment from the World Bank, it added.\n\nThe minister appreciated World Bank’s support, particularly during critical challenges, including the Covid-19 pandemic and devastating 2022 floods.\n\n“As our largest development partner, the World Bank has played an indispensable role in Pakistan’s socio-economic progress and improving the lives of our citizens,” Cheema stated.\n\nWith the CPF now successfully launched, the minister emphasised the government is focused on finalising a comprehensive implementation framework in collaboration with the WB.\n\nHe welcomed Pakistan’s transition to the WB’s Middle East and North Africa (MENA) region under Vice President Ousmane Dione, noting this move will “create valuable opportunities for knowledge exchange and regional synergy”.\n\nIn a separate meeting with WB Executive Director Abdelhak Bedjaoui, the minister acknowledged his effective representation of Pakistan’s economic interests.\n\nCheema suggested regular visits by the executive directors to constituent countries to better understand development needs and opportunities for the WB’s engagement. They discussed the Bank’s recent approvals, including the $700mn Reko Diq mining project and $400mn risk participation facility.\n\nThe minister reaffirmed Pakistan’s commitment to working closely with the WB country team to achieve the CPF’s development objectives and transformational impacts.\n\nThe WB leadership assured full support for the effective implementation of the CPF, underscoring the institution’s continued commitment to Pakistan’s sustainable economic development.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:29:06.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920564/world-bank-reaffirms-support-for-pakistans-economic-agenda",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T08:33:59.000Z"
}
