{
  "title": "Japan hangs ‘Twitter killer’ in first execution since 2022 - World - DAWN.COM",
  "author": null,
  "content": "Japan executed a man on Friday who killed nine people after contacting them on social media, the first use of capital punishment in the country in nearly three years.\n\nTakahiro Shiraishi had been sentenced to death for his 2017 strangling and dismembering of eight women and one man in his apartment in Zama city in Kanagawa near Tokyo. He was dubbed the “Twitter killer” as he contacted victims via the social media platform.\n\nJustice Minister Keisuke Suzuki, who authorised Shiraishi’s hanging, said he made the decision after careful examination, taking into account the convict’s “extremely selfish” motive for crimes that “caused great shock andunrest to society.”\n\nIt followed the execution in July 2022 of a man who went on a stabbing rampage in Tokyo’s shopping district Akihabara in 2008.\n\nIt was also the first time a death penalty was carried out since Prime Minister Shigeru Ishiba’s government was inaugurated last October.\n\nIn September last year, a Japanese court acquitted Iwao Hakamada, who had spent the world’s longest time on death row after a wrongful conviction for crimes committed nearly 60 years ago.\n\nCapital punishment is carried out by hanging in Japan and prisoners are notified of their execution hours before it is carried out, which has long been decried by human rights groups for the stress it puts on death-row prisoners.\n\n“It is not appropriate to abolish the death penalty while these violent crimes are still being committed,” Suzuki told a press conference. There are currently 105 death row inmates in Japan, he added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:47:22.774Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920489/japan-hangs-twitter-killer-in-first-execution-since-2022",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T03:33:22.000Z"
}
