{
  "title": "11 dead, 6 injured in KP flash floods as search operations continue in Swat - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 11 people died and six others were injured in Khyber Pakhtunkhwa’s Swat and Malakand districts on Friday amid flash floods triggered by heavy rains, according to the Provincial Disaster Management Authority (PDMA).\n\nEarlier today, Rescue 1122 spokesperson Bilal Faizi said that nine bodies were recovered among 16 people who went missing in the Swat River this morning, with three people being rescued. A search operation to find the four remaining people was underway, he added.\n\nThe PDMA data showed that 10 people were killed in Swat while one person was killed in Malakand. It also revealed that 56 houses had been damaged in Swat due to the flooding.\n\nThe report also said that a total of 120 people were trapped, with 107 of them being rescued by Swat Rescue 1122. “All concerned Departments, Rescue 1122 are actively deployed in the field, conducting round­the­clock operations to ensure maximum safety and relief,” it added.\n\nSeparately, KP Chief Secretary Shahab Ali Shah suspended Swat Additional Deputy Commissioner for relief Ihsan-ul-Haq, Babuzai Assistant Commissioner (AC) Nida Iqbal and Khwazakhela AC Muhammad Amir Khan.\n\nA notification from today, a copy of which was available with Dawn.com, cited “untoward incident” in Swat, ordering the immediate suspension of the officers under Rule-6 of the KP Government Servants (Efficiency & Discipline) Rules, 2011.\n\nThe floods in the district had inundated several areas, with reports of dozens stranded at different locations, an initial report by KP Rescue 1122 said, adding that search and rescue operations were underway for the remaining bodies in several areas.\n\nThree bodies were recovered from Ingaroderai, while one body was also recovered from Ghalegy, where seven people were stranded and rescue operations are still underway.\n\nAt least 120 Rescue 1122 personnel had been deployed in rescue operations.\n\n“More than 22 people were trapped in the water in Imam Dhirai, who were rescued safely by the team of Rescue Station 33,” the report stated, adding that the search operation of Rescue Station 44 was ongoing.\n\nSeven people are also reported to be trapped in Manyar, with Rescue Stations 44 and 55 working jointly in rescue activities.\n\nOne person was trapped at Panjigram village, where a rescue operation was underway, while at least 20 to 30 people were rescued from Bara Bamakhela, the report said.\n\n“All Rescue 1122 teams are present on site and rescue operations are in full swing,” the report said.\n\nA flood alert has been issued by the Charsadda Deputy Commissioner Qaiser Khan, directing relevant staff to be on high alert following the floods in Swat.\n\nA notice from the DC’s office said the “discharge at Khwazakela in River Swat has increased to 77,782 cusecs, categorised as a very high flood.”\n\nDC Khan told Dawn.com that rescue teams had been deployed to the banks of the River Kabul and River Swat.\n\n“Announcements were made via mosque loudspeakers to inform the public about the dangers of floodwater,” the DC said, adding that officials were instructing people to move to safer places.\n\n“We are keeping an eye on the Munda headworks; until 3pm, the flow was normal.”\n\nMeanwhile, former climate change minister and PPP Senator Sherry Rehman has said that the continued “sleepwalk” on climate stress was triggering such incidents.\n\nIn a post on X, she wrote, “The tragic drowning of several people in the River Swat is NOT the result of a random ‘natural disaster’.”\n\n“We need to understand that this and other disasters are the deadly impact of super heavy monsoons in Swat, all triggered by climate stress, and it is not just one area,” she added.\n\nRehman also said that the district and provincial administration had been alerted, but “early warning systems are being ignored by the general public in KP”.\n\n“Pakistan needs to understand that such hazards are triggered by global warming and climate change … So please stop calling it a natural disaster or a random flash flood that is disconnected from human actions or responsibility.”\n\nThe KP Provincial Disaster Management Authority (PDMA) issued a flood alert after water discharge levels at Khwazakhela in the Swat River surged to 77,782 cusecs, categorising it as a very high flood situation due to the ongoing heavy rainfall in the region.\n\nIn an official communication addressed to the Deputy Commissioners of Peshawar, Charsadda, and Nowshera, the PDMA advised all concerned authorities to take urgent precautionary measures to prevent any loss of life, damage to infrastructure, crops and livestock.\n\nThe PDMA directed local administrations to immediately identify vulnerable points and at-risk communities and put in place effective safety and mitigation measures. It emphasised maintaining a heightened state of alert, with constant monitoring of the evolving flood situation to ensure a timely response.\n\nRescue 1122, Civil Defence, and all other emergency services were instructed to stay on high alert, particularly in low-lying and high-risk areas.\n\nCommunities living along the banks of Kabul River and its tributaries are being sensitised to the expected rise in water levels.\n\nLocal authorities were advised to ensure the timely evacuation of at-risk populations in flood-prone areas per existing evacuation plans and to ensure the availability of shelter, food, and medical supplies in designated camps.\n\nFarmers and cattle herders were warned to move their livestock to safer locations away from low-lying riverbanks, while the general public is urged to avoid unnecessary travel or vehicle movement in vulnerable areas.\n\nThe PDMA also directed concerned departments to remain ready for road clearance operations in case of blockages or waterlogging, and to pre-position emergency equipment at critical locations.\n\nThe Provincial Emergency Operations Centre (PEOC) at PDMA remains active 24/7 and can be reached via helpline 1700 for any assistance or guidance.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/27175806760e13a.jpg",
  "retrievedAt": "2025-08-20T04:29:08.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920555/11-dead-6-injured-in-kp-flash-floods-as-search-operations-continue-in-swat",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T07:24:49.000Z"
}
