{
  "title": "PM lauds economic team, wants tight Muharram security - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Thursday lauded his economic team for preparing the federal budget for 2025-26 and directed authorities to ensure peace, law and order during the holy month of Muharram, which begins on Friday (today).\n\nEarlier, the federal cabinet approved the finance bill for the coming fiscal year during a meeting chaired by Sharif, with certain amendments to various laws.\n\nThe prime minister expressed gratitude to Finance Minister Muhammad Aurangzeb and his team for their dedication in preparing the budget.\n\nHe also thanked the federal cabinet and allied political parties for their support in finalising the budget.\n\nChairs cabinet meeting; discusses strengthening of Pakistan-US ties with Marco Rubio\n\nAddressing the recent regional developments, PM Shehbaz welcomed the Israel-Iran ceasefire, calling it “crucial to avoid further escalation and loss”.\n\nHe expressed gratitude to God for the peaceful resolution and acknowledged the role played by various countries, including Saudi Arabia, in brokering the ceasefire.\n\n“Iran openly thanked the people of Pakistan, its political parties, military, and political leadership for their role in ensuring the ceasefire between the two countries,” PM Shehbaz said.\n\nRegarding the recent attack by Iran on Qatar, he said Pakistan had issued a condemnation statement, reiterating the country’s strong ties with the “brotherly nation”.\n\nRegarding Muharram, PM Shehbaz ordered authorities to enforce strict law and order during processions and gatherings.\n\nHe instructed the interior minister to coordinate with provincial governments, Gilgit-Baltistan, and Azad Jammu and Kashmir to maintain peace and security during the month.\n\nEarlier, the cabinet offered Fateha for Major Moeez Abbas Shah, killed in an operation against terrorists in South Waziristan.\n\nThe meeting decided to form a committee on gas production and supply, which will submit its suggestions to the Supreme Court.\n\nPM Shehbaz also briefed the cabinet on recent decisions made by the National Security Committee.\n\nThe meeting paid tribute to PM Shehbaz, Field Marshal Asim Munir, and Deputy Prime Minister Ishaq Dar for their “effective role in de-escalating tension between Iran and Israel”.\n\nFinance Minister Aurangzeb later briefed the cabinet on proposed amendments and suggestions included in the finance bill.\n\nPM Shehbaz expressed satisfaction with the fiscal measures taken to stabilise the economy. Later, the federal cabinet approved determining the petroleum levy to the Ministry of Petroleum.\n\nTalks with Rubio\n\nMeanwhile, PM Shehbaz spoke with US Secretary of State Marco Rubio, the PM Office said in a statement.\n\nMr Sharif praised US President Donald Trump’s “bold and decisive leadership” that led to the ceasefire between Iran and Israel, according to the statement. The prime minister also thanked Rubio for the key US role in a separate Pakistan-India ceasefire.\n\nThe two officials agreed to continue working to strengthen bilateral relations, particularly through trade, the statement added.\n\nExchanging views on the current situation in the Middle East, the premier said Pakistan will maintain its constructive role in Middle East peace efforts.\n\nMr Rubio responded with desire to collaborate with Pakistan for regional peace and stability.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:29:39.752Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920446/pm-lauds-economic-team-wants-tight-muharram-security",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:00:29.000Z"
}
