{
  "title": "US Supreme Court curbs power of individual judges to block Trump - World - DAWN.COM",
  "author": null,
  "content": "The United States Supreme Court handed President Donald Trump a major victory on Friday by curbing the power of lone federal judges to block executive actions.\n\nIn a 6-3 ruling stemming from Trump’s bid to end birthright citizenship, the court said nationwide injunctions issued by district court judges “likely exceed the equitable authority that Congress has granted to federal courts”.\n\nThe top court did not immediately rule on the constitutionality of Trump’s executive order seeking to end automatic citizenship for children born on American soil.\n\nBut the broader decision on the scope of judicial rulings will remove a big roadblock to Trump’s often highly controversial orders and reaffirm the White House’s power.\n\n“Federal courts do not exercise general oversight of the Executive Branch; they resolve cases and controversies consistent with the authority Congress has given them,” said Justice Amy Coney Barrett, author of the opinion.\n\n“When a court concludes that the Executive Branch has acted unlawfully, the answer is not for the court to exceed its power, too,” Barrett said in an opinion joined by the other five conservative justices on the court.\n\nThe three liberal justices dissented.\n\nThe ruling has far-reaching ramifications for the ability of the judiciary to rein in Trump or future American presidents.\n\nThe case was ostensibly about Trump’s executive order signed on his first day in office ending birthright citizenship.\n\nBut it actually focused on whether a single federal district court judge has the right to issue a nationwide block to a presidential decree with a universal injunction while the matter is being challenged in the courts.\n\nTrump’s birthright citizenship order has been deemed unconstitutional by courts in Maryland, Massachusetts and Washington state, leading the president to make an emergency appeal to the Supreme Court in an effort to get the top court to strike down the use of nationwide injunctions.\n\nThe issue has become a rallying cry for Trump and his Republican allies, who accuse the judiciary of stymying his agenda against the will of voters.\n\nTrump’s executive order on birthright citizenship is just one of a number of his agenda items that have been blocked by judges around the country — both Democratic and Republican appointees — since he took office in January.\n\nDuring oral arguments in the case before the Supreme Court in May, both conservative and liberal justices had expressed concerns about the increasing use of nationwide injunctions by district courts in recent years.\n\nJustice Samuel Alito, an arch-conservative, said nationwide injunctions pose a “practical problem” because there are hundreds of district court judges and every one of them is “convinced” they know best.\n\nSolicitor General John Sauer compared nationwide injunctions to a “nuclear weapon”, saying they “disrupt the Constitution’s careful balancing of the separation of powers”.\n\nThe Trump administration had asked the Supreme Court to restrict the application of a district court’s injunction solely to the parties who brought the case and the district where the judge presides.\n\nPast presidents have also complained about national injunctions shackling their agenda, but such orders have sharply risen under Trump, who has seen more in two months than Democrat Joe Biden did during his first three years in office.\n\nTrump’s executive order on birthright citizenship decrees that children born to parents in the United States illegally or on temporary visas would not automatically become citizens.\n\nThe three lower courts ruled that to be a violation of the 14th Amendment, which states: “All persons born or naturalised in the United States, and subject to the jurisdiction thereof, are citizens of the United States.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/272037326a91fd4.jpg",
  "retrievedAt": "2025-08-20T04:29:04.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920602/us-supreme-court-curbs-power-of-individual-judges-to-block-trump",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T15:49:46.000Z"
}
