{
  "title": "India accused of illegal deportations targeting Muslims - World - DAWN.COM",
  "author": null,
  "content": "India has deported without trial to Bangladesh hundreds of people, officials from both sides said, drawing condemnation from activists and lawyers who call the recent expulsions illegal and based on ethnic profiling.\n\nNew Delhi says the people deported are undocumented migrants.\n\nThe Hindu nationalist government of Prime Minister Narendra Modi has long taken a hardline stance on immigration — particularly those from neighbouring Muslim-majority Bangladesh — with top officials referring to them as “termites” and “infiltrators”.\n\nIt has also sparked fear among India’s estimated 200 million Muslims, especially among speakers of Bengali, a widely spoken language in both eastern India and Bangladesh.\n\n“Muslims, particularly from the eastern part of the country, are terrified,” said veteran Indian rights activist Harsh Mander. “You have thrown millions into this existential fear.”\n\nBangladesh, largely encircled by land by India, has seen relations with New Delhi turn icy since a mass uprising in 2024 toppled Dhaka’s government, a former friend of India.\n\nBut India also ramped up operations against migrants after a wider security crackdown in the wake of an attack in the west — the April 22 killing of 26 people, mainly Hindu tourists, in Indian-held Kashmir.\n\nNew Delhi blamed that attack on Pakistan, claims Islamabad rejected, with arguments culminating in a four-day conflict that left more than 70 dead.\n\nIndian authorities launched an unprecedented countrywide security drive that has seen many thousands detained – and many of them eventually pushed across the border to Bangladesh at gunpoint.\n\nRahima Begum, from India’s eastern Assam state, said police detained her for several days in late May before taking her to the Bangladesh frontier.\n\nShe said she and her family had spent their life in India.\n\n“I have lived all my life here — my parents, my grandparents, they are all from here,” she said. “I don’t know why they would do this to me.”\n\nIndian police took Begum, along with five other people, all Muslims, and forced them into swampland in the dark.\n\n“They showed us a village in the distance and told us to crawl there,” she told AFP.\n\n“They said: ‘Do not dare to stand and walk, or we will shoot you.’”\n\nBangladeshi locals who found the group then handed them to border police who “thrashed” them and ordered they return to India, Begum said.\n\n“As we approached the border, there was firing from the other side,” said the 50-year-old. “We thought: ‘This is the end. We are all going to die.’”\n\nShe survived, and, a week after she was first picked up, she was dropped back home in Assam with a warning to keep quiet.\n\nRights activists and lawyers criticised India’s drive as “lawless”.\n\n“You cannot deport people unless there is a country to accept them,” said New Delhi-based civil rights lawyer Sanjay Hegde.\n\nIndian law does not allow for people to be deported without due process, he added.\n\nBangladesh has said India has pushed more than 1,600 people across its border since May.\n\nIndian media suggests the number could be as high as 2,500.\n\nThe Bangladesh Border Guards said it has sent back 100 of those pushed across — because they were Indian citizens.\n\nIndia has been accused of forcibly deporting Muslim Rohingya refugees from Myanmar, with navy ships dropping them off the coast of the war-torn nation.\n\nMany of those targeted in the campaign are low-wage labourers in states governed by Modi’s Bharatiya Janata Party, according to rights activists.\n\nIndian authorities did not respond to questions about the number of people detained and deported.\n\nBut Assam state’s chief minister has said that more than 300 people have been deported to Bangladesh.\n\nSeparately, Gujarat’s police chief said more than 6,500 people have been rounded up in the western state, home to both Modi and interior minister Amit Shah.\n\nMany of those were reported to be Bengali-speaking Indians and later released.\n\n“People of Muslim identity who happen to be Bengali speaking are being targeted as part of an ideological hate campaign,” said Mander, the activist.\n\nNazimuddin Mondal, a 35-year-old mason, said he was picked up by police in the financial hub of Mumbai, flown on a military aircraft to the border state of Tripura and pushed into Bangladesh.\n\nHe managed to cross back, and is now back in India’s West Bengal state, where he said he was born.\n\n“The Indian security forces beat us with batons when we insisted we were Indians,” said Mondal, adding he is now scared to even go out to seek work.\n\n“I showed them my government-issued ID, but they just would not listen.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/271244126ae99ba.png",
  "retrievedAt": "2025-08-20T04:29:08.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920561/india-accused-of-illegal-deportations-targeting-muslims",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T07:54:27.000Z"
}
