{
  "title": "Pakistan records its 13th polio case in KP’s Tank - Pakistan - DAWN.COM",
  "author": null,
  "content": "A poliovirus case has been confirmed in Khyber Pukhtunkhwa’s Tank district, marking the seventh case from KP this year and bringing the total countrywide tally to 13, the Regional Reference Laboratory for Polio Eradication at the National Institutes of Health (NIH) said in a press release on Friday.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress. This year, Pakistan has undertaken three nationwide Polio campaigns so far — in February, April, and May. Polio eradication efforts in Pakistan routinely face security issues.\n\nAccording to the press release, the case was detected in an 18-month-old child from the Union Council Amakhel in KP’s Tank district.\n\n“With this latest detection, the total number of polio cases in Pakistan in 2025 has reached 13, including seven from Khyber Pakhtunkhwa, four from Sindh, and one each from Punjab and Gilgit-Baltistan,” the statement said.\n\nThe case comes only a week after KP recorded its sixth case of the year in Bannu in a 33-month-old baby, while another two cases were recorded in the province last month.\n\nIn May, Pakistan launched its third drive of the year against the crippling disease aiming to vaccinate 45 million children under the age of five. The government has vowed to eradicate Polio by the end of this year.\n\n“The fight against polio has required a tremendous sacrifice from all stakeholders, including law enforcement personnel who have rendered invaluable services,” Federal Minister for Health Syed Mustafa Kamal said at an event in May.\n\n“This mission will continue until we reach complete eradication,” he added.\n\n“Polio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine (OPV) for every child under five during each campaign, along with timely completion of all essential immunisations,” the statement said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:29:05.242Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920572/pakistan-records-its-13th-polio-case-in-kps-tank",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T09:26:50.000Z"
}
