{
  "title": "Pakistan teams shine at Asian snooker team championship on first day - Sport - DAWN.COM",
  "author": null,
  "content": "COLOMBO: Pakistan’s snooker teams launched their Asian team championship campaigns impressively on the opening day of the team event, with both teams securing victories in their respective group matches here on Thursday.\n\nPakistan 1, featuring the formidable pairing of defending Asian 6-Red singles champion Awaisullah Munir and recent singles bronze medalist Mohammad Asif, showcased their class with two commanding performances.\n\nThey began their campaign with a resounding 3-0 whitewash of Cambodia. The Pakistani duo dominated the match, sealing victory with significant breaks: a 69 break [82(69)-30], a 51 break [59(51)-16] and culminating in a flawless 78 clearance [78(78)-0].\n\nTheir momentum continued against Qatar. Although they dropped the opening frame [47-81(60)] against a strong 60 break from their opponents, the national cueists swiftly regained control.\n\nThey powered through the next three frames, highlighted by a 55 break in the second frame [82(55)-23], followed by convincing wins in the third (63-30) and fourth (62-16) frames to secure a 3-1 victory.\n\nPakistan 2, comprising national champion Shahid Aftab and the experienced Mohammad Sajjad, faced a sterner test against Bahrain but displayed commendable resilience to emerge victorious 3-2.\n\nThe Bahraini pair started strongly, taking the first two frames with the help of a 53 break in the opener [41-87(53)] and a narrow win in the second (46-48).\n\nFacing elimination, Pakistani duo mounted a determined comeback. They claimed the third frame (73-41), dominated the fourth (80-35) and sealed the crucial deciding frame (60-16) to complete the fightback.\n\nPublished in Dawn, June 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:29:37.256Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920422/pakistan-teams-shine-at-asian-snooker-team-championship-on-first-day",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T02:00:43.000Z"
}
