{
  "article_id": "2025-10-17_b5454b813e6c990ebbc6a5195a707ec1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/muslim-world-league-secretary-general-leads-friday-prayer-at-parliament-house/",
    "retrieved_at": "2025-10-20T18:05:51.192Z"
  },
  "metadata": {
    "title": "Muslim World League Secretary General leads Friday prayer at Parliament House",
    "author": null,
    "date_published": "2025-10-17T17:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 17 (APP): The Secretary-General of the Muslim World League and Chairman of the Organisation of Muslim Scholars, Dr Muhammad bin Abdul Karim Al-Issa, led Friday prayer at the Parliament House Mosque in Islamabad, delivering a sermon calling for unity, tolerance and solidarity across the Muslim world. Addressing worshippers before the prayer, Dr Al-Issa underscored the need for cohesion, brotherhood and adherence to Islamic values to overcome the challenges facing the global Muslim community. He hailed Pakistan as a fortress of Islam, commending its long-standing role in promoting peace, stability and humanitarian service both regionally and internationally. Dr Al-Issa said it was a matter of honour and deep satisfaction to visit Pakistan, a nation he described as central to the Muslim world's collective strength. Following the prayers, he offered a special supplication for the unity, peace and prosperity of the Muslim Ummah and for global harmony. The congregation was attended by Federal Minister for Religious Affairs Sardar Muhammad Yousaf Zaman, Saudi Ambassador to Pakistan Saeed Nawaf Al-Maliki, and MNA Maulana Abdul Ghafoor Haideri, along with parliamentarians, senior officials of the National Assembly and Senate Secretariats, journalists and members of the public. Upon his arrival, Dr Al-Issa was received by Federal Minister Sardar Muhammad Yousaf Zaman and Parliament Mosque Khateeb Maulana Mufti Ahmad ur Rehman, who welcomed him on behalf of Parliament and the Ministry of Religious Affairs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}