{
  "article_id": "2025-10-17_9ec90179eebab6a6b9c5d752e4692db6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/four-envoys-present-credentials-to-president-zardari/",
    "retrieved_at": "2025-10-20T18:06:38.923Z"
  },
  "metadata": {
    "title": "Four envoys present credentials to President Zardari",
    "author": null,
    "date_published": "2025-10-17T21:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 362,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 17 (APP): Four newly designated envoys presented their credentials to President Asif Ali Zardari at a ceremony held at Aiwan-e-Sadr on Friday. Those who presented their credentials included Tarik Ali Khan, High Commissioner-designate of Canada; Abdulaziz Issa, Ambassador-designate of Republic of Lebanon; Robert-Jan Siegert, Ambassador-designate of the Kingdom of the Netherlands; and David Pine, Non-Resident High Commissioner-designate of New Zealand (based in Colombo). Upon arrival at the Presidency, the envoys were presented guard of honour by a smartly turned-out contingent of the Pakistan armed forces. Welcoming the newly accredited envoys, the President congratulated them on their appointments and expressed confidence that their tenures would further strengthen Pakistan's bilateral relations with their countries. The President highlighted Pakistan's longstanding and friendly relations with Canada, emphasising enhanced economic, trade, and investment cooperation, particularly in the IT, energy and minerals sectors. He noted the importance of people-to-people linkages and lauded the role of the vibrant Pakistani diaspora in Canada in promoting goodwill between the two nations. In his conversation with the ambassador of Lebanon, the President reaffirmed Pakistan's deep solidarity with the Government and people of Lebanon, strongly condemning Israel's aggression against civilians. He assured Pakistan's continued support for Lebanon's sovereignty and territorial integrity, and emphasised the need to enhance bilateral trade, security and counter-terrorism cooperation. During his meeting with the ambassador of the Netherlands, the President underscored the importance of further strengthening bilateral ties, especially in trade, investment, agriculture, and education. He appreciated Netherlands' partnership in areas such as water management, climate resilience and sustainable development, and invited greater Dutch investment in Pakistan. In his interaction with the Non-Resident High Commissioner of New Zealand, the President highlighted the shared Commonwealth heritage and democratic values between the two countries. He underscored the potential for enhanced cooperation in agriculture, livestock, fisheries, and clean energy and expressed appreciation for New Zealand's support for Pakistan's multilateral initiatives. The President extended his best wishes to all four envoys for a successful and productive tenure, expressing hope that their efforts would lead to stronger bilateral and multilateral partnerships for mutual benefit. Senator Sherry Rehman, Senator Saleem Mandviwalla, and the Secretary of Foreign Affairs were also present on the occasion.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}