{
  "article_id": "2025-10-17_8d792175466c2251a8ff0351b0b98f24",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-lauds-muslim-world-league-for-promoting-dialogue-tolerance/",
    "retrieved_at": "2025-10-20T18:06:41.171Z"
  },
  "metadata": {
    "title": "President lauds Muslim World League for promoting dialogue, tolerance",
    "author": null,
    "date_published": "2025-10-17T21:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 546,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 17 (APP): President Asif Ali Zardari Friday lauded the role of Muslim World League (MWL) in uniting the Muslim Ummah and promoting dialogue, tolerance, and compassion and reaffirmed Pakistan's desire to strengthen cooperation with MWL in areas of education, interfaith harmony and humanitarian relief. He was speaking to Secretary General of the Muslim World League (MWL) and Chairman of the Organisation of Muslim Scholars, Dr Mohammad bin Abdulkarim Al-Issa who called on him at Aiwan-e-Sadr. The Secretary General of MWL was accompanied by Nawaf bin Said Al-Malki, ambassador of the Kingdom of Saudi Arabia, Saad Masoud Al-Harthi, Advisor to the Secretary General of MWL and Regional Director, and Abdullatif Yousef Al-Mutlaq, Undersecretary for Legal Affairs, MWL. Welcoming Dr Al-Issa to Pakistan, President Zardari conveyed his greetings and best wishes to the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and to His Royal Highness Crown Prince and Prime Minister Mohammed bin Salman. The President appreciated Dr Al-Issa's leadership in promoting unity, moderation, and interfaith harmony, and acknowledged the League's humanitarian and educational initiatives around the world. Dr Mohammad bin Abdulkarim Al-Issa said that Pakistan holds a special place in the hearts of the Saudi people, and that bilateral relations between the two brotherly countries continue to grow stronger with each passing day. He described Pakistan-Saudi friendship as a matter of pride for the Kingdom, adding that he had followed President Zardari's political career and regarded it as inspirational. He also paid tribute to the life and legacy of Shaheed Mohtarma Benazir Bhutto, describing her as a role model, and lauded President Zardari for carrying forward her political vision and ideology. Dr Al-Issa further noted that the recent defence cooperation agreement between Pakistan and Saudi Arabia reflected the deep trust and strategic alignment between the two nations. President Zardari commended the MWL's efforts to counter extremism and Islamophobia and praised its focus on social welfare, women's empowerment, and education. He regarded the International Conference on Girls' Education in Muslim Communities, hosted by MWL in Islamabad earlier this year, as an important step towards strengthening the intellectual and moral foundations of the Muslim Ummah. Referring to MWL's partnership with Pakistan, the President said the Seerat-un-Nabi (Sallallahu Alaihi Wasallam) Museum, jointly inaugurated last year, symbolises the shared reverence of both sides for the Holy Prophet's life and message. While noting the proposed agreement between MWL and Pakistan's Ministry of Religious Affairs and Interfaith Harmony, the President emphasised the importance of a coordinated approach for projects spanning multiple sectors such as health, education, and humanitarian assistance. President Zardari reaffirmed Pakistan's support for the people of Palestine in their struggle for self-determination. He welcomed the peace efforts led by Saudi Arabia and MWL, including the Sharm El-Sheikh Peace Summit and the Gaza Plan, stressing that any peace initiative must ensure a lasting ceasefire, Israeli withdrawal, and the reconstruction of Gaza. The President said Pakistan's relationship with Saudi Arabia is historic and deeply rooted in shared faith and mutual respect. He looked forward to the forthcoming visit of His Royal Highness the Crown Prince to Pakistan and noted with appreciation the expanding cooperation between the two countries in defence, trade, investment and energy. Senator Sherry Rehman and Maulana Tahir Ashrafi were also present during the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}