{
  "article_id": "2025-10-17_681266c384bd6f28ac19a7af1224f6c1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-wants-security-boost-accountability-in-railways-affairs/",
    "retrieved_at": "2025-10-20T18:05:52.082Z"
  },
  "metadata": {
    "title": "NA body wants security boost, accountability in railways affairs",
    "author": null,
    "date_published": "2025-10-17T15:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 223,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 17 (APP): National Assembly Standing Committee on Railways Friday, directed to bolster railway security, expedite removal of encroachments, and ensure transparency in land leasing and project execution to strengthen efficiency and safety across Pakistan's rail network. The session, chaired by MNA Ramesh Lal in the absence of the Chairman, focused on the Jaffer Express blast, land encroachments, and the Karachi-Pipri Freight Corridor Project. Following a briefing on the 7 October Jaffer Express attack near Sultan Kot Railway Station in Sindh, the Committee directed Pakistan Railways to enhance security patrols in vulnerable areas and install three signal jammers in every train to safeguard passengers against future incidents. On the issue of land encroachments in the Sukkur Division, members expressed concern over the large-scale illegal occupation of railway property and instructed the Ministry to submit a detailed report on the criteria and procedure for leasing railway land across the country. The Committee also reviewed progress on the US$400 million Karachi-Pipri Freight Corridor Project, which aims to link Karachi Port with the M-9 Motorway. The project's first phase is expected to be completed within six months, with 17 freight trains operating daily once operational. Attendees included MNAs Ibrar Ahmad, Waseem Qadir, Haji Jamal Shah Kakar, Sadiq Ali Memon, and Ahmed Saleem Siddiqui, along with senior officials from the Ministry of Railways and Pakistan Railways.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}