{
  "article_id": "2025-10-17_239dca7515dceddd48fa90b2644e55de",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nlpd-hosts-certificate-distribution-ceremony/",
    "retrieved_at": "2025-10-20T18:05:26.451Z"
  },
  "metadata": {
    "title": "NLPD hosts certificate distribution ceremony",
    "author": null,
    "date_published": "2025-10-17T18:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 352,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 17 (APP): National Language Promotion Department (NLPD), in collaboration with the Institute for Community with Shared Future, Communication University of China, Beijing has hosted a certificate distribution ceremony under the theme \"Pakistan-China Exemplary Friendship: Reflections in Calligraphy.\" The ceremony was presided over by Professor Dr Muhammad Saleem Mazhar, Director General, NLPD, while Khalid Taimur Akram, Executive Director, Pakistan Research Center for a Community with Shared Future (PRCCSF) attended as the chief guest, said a press release here on Friday. The program commenced with the recitation of the Holy Quran by Hafiz Inam-ul-Haq. In his address, Khalid Taimur Akram expressed his delight at the successful collaboration between the two institutions, emphasizing that the exhibition and certificate ceremony highlighted the deep-rooted friendship between Pakistan and China. He stated that such cultural and artistic initiatives serve as milestones in strengthening bilateral ties at the people-to-people level. \"The Pakistan-China friendship is exemplary in every field and remains a guarantee of peace, prosperity, and development in the region,\" he remarked. He further noted that the participating calligraphers from Pakistan had also showcased their work at a calligraphy exhibition held at the Communication University of China, Beijing, alongside artists from various other countries. The exhibition helped project a new cultural image of Pakistan and served as a bridge connecting the two nations through shared artistic and civilizational values. Speaking at the occasion, Professor Dr Muhammad Saleem Mazhar said that the NLPD was honored to contribute not only to the promotion of literature and language but also to cultural exchange and understanding. He announced that the department aspires to establish a Pakistan-China Calligraphy Institute, where artists from both countries will receive joint training. \"In the first phase, we plan to send our calligraphy teachers to China, and later, Chinese artists will visit Pakistan to exchange skills and expertise,\" he added. Dr Mazhar appreciated the efforts of Khalid Taimur Akram, the faculty of the calligraphy department including Azhar Hussain and Nasir Seemab, as well as Dr Rashid Hameed, Dr Arif Hussain, Mahboob Khan Bugti, Kamran Mushtaq, Manzar Altaf Shami, and Razzaq Khan for their active participation and support.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}