{
  "title": "Need for safeguards",
  "author": "Editorial",
  "content": "Need for safeguards\nEditorial Published October 20, 2025  Updated 2 days ago\n0\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nONE of the key manifestations of extremism in Pakistan is the misuse of blasphemy laws. While sacrilege can never be condoned, it is the misuse of these laws to settle personal scores and persecute vulnerable groups that has led to frequent bouts of violence in society.\n\nIn this regard, the government has stated its intent to reform the laws in order to prevent abuse. While speaking at an event at the Supreme Court recently, the federal law minister said that “procedural safeguards” were being introduced in blasphemy-related cases to prevent misuse. At the same event, the chief justice of Pakistan highlighted the need for interfaith harmony.\n\nWhile specifics are not available, any progress in this regard should be welcomed, though it must be remembered that previous efforts at reform — even those led by the higher judiciary — have stalled due to the pushback from extremist lobbies.\n\nCalls for reform of the blasphemy laws, and legal safeguards, are by no means a defence of sacrilege. For harmony in society, no abuse against the revered figures and scriptures of all faiths can be tolerated, and there can be no room for hate speech. Instead, what activists have been saying for decades is that the misuse of the laws has to be prevented. We have seen far too many incidents where personal disputes have led to accusations of blasphemy, while in other instances, sacrilege allegations have been used to dispossess minorities of their land.\n\nMoreover, recently a gang of criminals was uncovered that would trap people online and blackmail them, threatening to go public with false blasphemy allegations against the victims unless they paid up.\n\nClearly, steps need to be taken, as innocent people have lost their lives simply on the basis of unproven claims and spurious ‘evidence’. Even the head of the Council of Islamic Ideology said last year that certain “religious elements” were misusing the laws and resorting to “mob justice”, which is “un-Islamic”.\n\nIf the state’s latest attempt to reform the said laws is to succeed, then there needs to be buy-in from mainstream clerics. Unless clergymen of all sects endorse the state’s move, and extremist voices are isolated, the initiative is unlikely to succeed. But beyond legal changes, to end the troubling culture of false blasphemy allegations, there needs to be grassroots change in society, so that sensitive religious issues are not used to target people.\n\nCountering violent extremism has been highlighted both in NAP and NAP 2.0, yet beyond solemn promises, successive administrations have done little on the ground to translate these aims into policy. Holding conferences and issuing statements is not enough. Conversations must be held in neighbourhood mosques, madressahs, schools and bazaars to communicate the message, and adopt a ‘whole-of-society’ approach against extremism.\n\nPublished in Dawn, October 20th, 2025\n\nNEWSPAPER\n0\nRead more\nSmog season\nBlame solves little\nNew captain\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": "https://www.dawn.com/_img/social-default.jpg",
  "retrievedAt": "2025-10-22T11:48:58.185Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950108/need-for-safeguards",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
