{
  "title": "Veteran Bollywood comedian Asrani passes away at 84 after prolonged illness",
  "author": "Dawn.com",
  "content": "Veteran Bollywood comedian Asrani passes away at 84 after prolonged illness\nDawn.com Published October 20, 2025  Updated a day ago\n   \n0\nA photo of Bollywood veteran comedy actor Govardhan Asrani who died due to a prolonged illness on Monday at the age of 84. — Asraniofficial Facebook\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nVeteran Bollywood comedy actor Govardhan Asrani died after a prolonged illness on Monday at the age of 84, Indian media outlets reported.\n\nA post on his Instagram account confirmed his demise, saying: “The news of the demise of Asrani ji, the king of laughter, ruling over millions of hearts has immersed us all in deep sorrow. He gave a new identity to Indian cinema with his unique acting, simplicity and humor. The life they put into every character, will live in our memories forever. Their departure is not just for the film industry, but the loss of everyone who ever smiled at their acting.”\n\nIndian wire agency ANI reported that his last rites were performed at Santacruz Crematorium in the presence of his family.\n\nHis manager, Babu Bhai Thiba, told the outlet that Asrani died at 3pm at Arogya Nidhi Hospital, Mumbai, Maharashtra. “He is survived by his wife, sister, and nephew,” the manager added.\n\nThe outlet added that over his long and successful career, Asrani became one of Hindi cinema’s “most loved faces” who became known for his “perfect comic timing and screen presence”, adding that he appeared in over 350 films across five decades.\n\nIt added that he began his career in the 1960s and reached his peak in the 1970s, “when he became one of the most dependable character actors of the time”.\n\nThe media outlet further said that among his “most memorable roles” were in Mere Apne, Koshish, Bawarchi, Parichay, Abhimaan, Chupke Chupke, Chhoti Si Baat and Rafoo Chakkar while among his hit films were Bhool Bhulaiyaa, Dhamaal, Bunty Aur Babli 2, R… Rajkumar, All The Best and Welcome, among others.\n\n“However, one of his most iconic performances remains his role as the eccentric jail warden in the 1975 classic Sholay, which became a part of Indian pop culture and is still remembered today,” the report added.\n\nThe Indian Express reported that he was born in Jaipur on January 1, 1941. It added that while reflecting on the “enduring appeal” of his Sholay character, Asrani told the BBC earlier this year, “As Sholay completes 50 years, I can tell you — there has not been a single function or event where I haven’t been asked to recite those dialogues. It’s all because of Sippy saab’s direction and the writing of Salim-Javed. I got a chance to learn how to truly prepare for a role, and what a lesson it was. I salute Ramesh Sippy saab, I salute Salim-Javed saab. Even after 50 years, people still remember that role and those lines by heart.”\n\nVarious Indian celebrities paid tribute to the actor on his passing and told about the impact he left on them.\n\nWORLD\n   \n0\nRead more\nIndian actor Manoj Kumar dies aged 87\nVeteran Bollywood star Dilip Kumar dies aged 98\nBeloved Bollywood singer Lata Mangeshkar dies at 92\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/202321190884097.webp",
  "retrievedAt": "2025-10-22T11:49:12.109Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950187/veteran-bollywood-comedian-asrani-passes-away-at-84-after-prolonged-illness",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
