{
  "title": "Pakistan down Bahrain in Asian Youth Games volleyball",
  "author": "The Newspaper's Sports Reporter",
  "content": "Pakistan down Bahrain in Asian Youth Games volleyball\nThe Newspaper's Sports Reporter Published October 22, 2025  Updated about 4 hours ago\n   \n0\nPakistan defeated hosts Bahrain 3-0 in their second Group ‘A’ match of the Asian Youth Games volleyball event. —Photo via Instagram/pakistanvolleyballofficial\nJOIN OUR WHATSAPP CHANNEL\n\nLAHORE: Pakistan defeated hosts Bahrain 3-0 in their second Group ‘A’ match of the Asian Youth Games volleyball event to book a place in the quarter-finals, the Pakistan Volleyball Federation (PVF) said late on Monday night.\n\nPakistan had earlier opened their campaign with a straight-sets victory over Mongolia. The scores against Bahrain were 25-17, 26-24, 25-23.\n\n“With this victory, Pakistan have secured the top position in Group ‘A’, winning both their group-stage matches — against Mongolia and Bahrain — without losing a single set,” the PVF statement said.\n\nView this post on Instagram\n\nPakistan will now face the second-placed team from Group ‘C’ — either Uzbekistan or Saudi Arabia — in the quarter-final fixture on Oct. 23.\n\nAccording to the PVF, the team’s success was powered by standout performances from Mohammad Yahya, Muhtad Ali Shah and Ajmal Junaid, who excelled in both attack and defence.\n\n“Their energy, confidence and coordination were key to Pakistan’s dominance over the host nation,” it added.\n\nThe team is being guided by head coach Saeed Ahmed Khan and managed by Naseer Ahmed, both of whom have played instrumental roles in developing the young squad’s confidence and technical skills.\n\nPublished in Dawn, October 22nd, 2025\n\nNEWSPAPER\n   \n0\nRead more\n53-member Pakistan contingent to feature in Asian Youth Games\nPakistan volleyball squad leaves for Bahrain\nCash prize for U-16 volleyball team\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n \n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\n \nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\n \nASEAN Summit: Everything You Need To Know\n \nCan International Law Stop Wars?\n \nPakistan-Afghanistan Conflict Analysis\n \nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\n \nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\n \nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/22125507b570bcf.webp",
  "retrievedAt": "2025-10-22T11:47:21.109Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950450/pakistan-down-bahrain-in-asian-youth-games-volleyball",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
