{
  "title": "Giuffre’s memoir goes on sale, piling pressure on Prince Andrew",
  "author": "AFP",
  "content": "Giuffre’s memoir goes on sale, piling pressure on Prince Andrew\nAFP Published October 22, 2025  Updated about 8 hours ago\n0\nA person poses for a photo with a copy of the book “Nobody’s Girl - A Memoir of Surviving Abuse and Fighting for Justice” by Virginia Roberts Giuffre, in central London on October 21. —AFP\nJOIN OUR WHATSAPP CHANNEL\n\nLONDON: The memoir of one of Jeffrey Epstein’s main accusers, whose claims sparked the downfall of Britain’s Prince Andrew, shot to the top of Amazon UK’s bestseller list as it went on sale on Tuesday, ratcheting up pressure on the disgraced royal.\n\nThe publication of Virginia Giuffre’s book has refocused attention on the Epstein saga in both Britain and the US, where a row is raging over the release of files on the convicted sex offender.\n\nIn the UK, the re-emergence of allegations that Giuffre was forced to have sex with Andrew three times, including twice when she was only 17, prompted the prince on Friday to renounce his royal title and honours.\n\nIt followed reported pressure from his brother, King Charles III, and nephew, the heir-to-the-throne Prince William.\n\nGiuffre, a US and Australian citizen, took her own life in April, aged 41, leaving behind her posthumous memoir “Nobody’s Girl”.\n\n“She would view it as a victory that he was forced—by whatever means—to give them up voluntarily,” the book’s ghostwriter, Amy Wallace, told the BBC, referring to Andrew’s titles.\n\n“His life is being eroded because of his past behaviour.” In another interview on Tuesday, the ghostwriter urged Andrew to cooperate with US authorities still probing Epstein’s crimes.\n\n“He saw things that were going on,” she told Times Radio, adding “he could share that information with investigators”.\n\n‘The prince had fun’\n\nUS Congressman Pete Sessions, who is on a congressional oversight committee investigating Epstein, echoed the sentiment.\n\n“It would be interesting to see what he did know, what he did see,” he told the BBC.\n\nAndrew, 65, who denies wrongdoing, agreed to pay Giuffre millions of dollars in 2022 to end her civil sexual assault case against him.\n\nHer chart-topping memoir recounts three sexual encounters with Andrew—one of which she claims was an orgy on Epstein’s island that included Epstein, the prince and “eight other young girls”.\n\nAt their first alleged meeting in March 2001, Giuffre recounts having sex with the prince at the London mews house of Ghislaine Maxwell, who was jailed two decades later for helping Epstein sexually abuse girls.\n\n“He seemed in a rush to have intercourse,” she said of Andrew. “Afterwards, he said thank you in his clipped British accent.” She recalled Epstein snapping the notorious photograph of the prince with his arm around her, standing side-by-side with Maxwell, earlier in the evening.\n\nGiuffre said Maxwell praised her the next morning, telling her: “You did well. The prince had fun.” Giuffre alleged Epstein soon gave her $15,000 for “servicing” Andrew.\n\nShe painfully recounts another incident on Epstein’s island with a man she describes as “a former minister”, without giving his nationality.\n\n“He wanted violence. He repeatedly choked me until I lost consciousness,” she wrote, adding she emerged bleeding from different parts of her body.\n\nMansion furore\n\nThe prince relinquished his royal duties and HRH title in 2019 following a disastrous TV interview about Giuffre’s claims.\n\nPublished in Dawn, October 22nd, 2025\n\nNEWSPAPER\n0\nRead more\nUK lawmakers urge govt to strip Prince Andrew of his titles\nUK lawmakers urge govt to strip Prince Andrew of his titles\nGiuffre’s memoir goes on sale, piling pressure on Prince Andrew\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/220908232fc0f1c.webp",
  "retrievedAt": "2025-10-22T11:48:05.219Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950508/giuffres-memoir-goes-on-sale-piling-pressure-on-prince-andrew",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
