{
  "title": "LHC informed CNIC of Arshad ‘chaiwala’ restored after Nadra verification",
  "author": "Tahir Naseer",
  "content": "LHC informed CNIC of Arshad ‘chaiwala’ restored after Nadra verification\nTahir Naseer Published October 20, 2025  Updated 2 days ago\n0\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nThe Lahore High Court (LHC) was informed on Monday that the computerised national identity card (CNIC) of social media personality Arshad Khan, who rose to fame as ‘chaiwala’, was restored by the National Database and Registration Authority (Nadra) after verification.\n\nKhan, who hails from Mardan, rose to fame back in 2016 when a photographer shared a photo of him pouring tea on Instagram, which went viral. He approached the LHC in April against the blocking of his identity documents by Nadra and the Directorate General of Immigration and Passports.\n\nAn order issued today by LHC Justice Justice Jawad Hassan noted that the petitioner informed the court his grievance was redressed.\n\n“Learned counsel for the petitioner … submits that after this court had taken cognizance of the matter, the competent authority called the petitioner to appear before the verification board constituted at the concerned office of Nadra and after due verification, his CNIC has been unblocked, thereby redressing his grievance,” the order noted.\n\nIt added that Khan’s counsel said the petitioner did not want to proceed with the main writ petition since his CNIC was unblocked by Nadra, also confirmed by the law officer after obtaining instructions from the concerned quarters.\n\nThe judge subsequently dismissed the main petition, noting it had “borne fruit”.\n\nSpeaking to the media after the hearing, Barrister Umer Ijaz Gilani said the issue was taken up at the government’s “highest level”, after which the verification process was initiated by Nadra, with the result being that the CNIC was determined to be wrongfully blocked.\n\nKhan himself said he was a Pakistani and would always remain one.\n\nKhan, who used to work at Islamabad’s Sunday Bazaar on Peshawar Chowk, had become popular overnight. Within no time, countless people had begun visiting his shop just to take selfies with him and soon, a modeling agency also entered into a deal with him and shot a few commercials to make good use of the craze.\n\nPAKISTAN\n0\nRead more\nNadra suspends nationality of viral Arshad ‘chaiwala’\nControversy over Chaiwala’s nationality persists\n‘Cat-eyed’ tea seller sparks soul-searching\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/2021362120f5753.webp",
  "retrievedAt": "2025-10-22T11:48:50.059Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950179/lhc-informed-cnic-of-arshad-chaiwala-restored-after-nadra-verification",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
