{
  "title": "Trump begins demolition of White House’s East Wing to prepare for ballroom",
  "author": "Reuters",
  "content": "Trump begins demolition of White House’s East Wing to prepare for ballroom\nReuters Published October 22, 2025  Updated about 8 hours ago\n   \n0\nA DEMOLITION crew takes apart the facade of the East Wing of the White House.—Reuters\nJOIN OUR WHATSAPP CHANNEL\n\nWASHINGTON: Demolition crews were tearing down part of the White House’s storied East Wing on Monday to begin building President Donald Trump’s ballroom, a project he had said would not interfere with the existing landmark.\n\nLarge construction equipment was seen picking apart the facade of the building, a part of the White House complex that has housed the first lady’s offices, a theatre and a visitor’s entrance that welcomes foreign dignitaries.\n\nThe ballroom project is expected to cost upwards of $250 million, which Trump said in July would be paid by himself and donors.\n\n“It will be beautiful,” Trump said at the time. “It won’t interfere with the current building. It won’t be — it will be near it, but not touching it. And pays total respect to the existing building, which I’m the biggest fan of. It’s my favourite.” It was unclear why the demolition of the East Wing’s walls was occurring despite Trump’s promise not to touch the existing building. The White House did not respond to a request for comment on Monday.\n\nTrump announced on Monday that ground had been broken on the project after images of the demolition began circulating in news reports.\n\nThe building was erected in 1942 during Franklin D. Roosevelt’s admin over a bunker built for the president’s use in case of emergency\n\n“Right behind us, we’re building a ballroom,” Trump told visiting college baseball athletes from Louisiana State University in the nearby White House residence’s East Room. “I didn’t know I’d be standing here right now ‘cause right on the other side you have a lot of construction going on, which you might hear periodically.” Future parties are set to start with cocktails in the East Room before guests are beckoned into what Trump has said will be the “finest” ballroom in the country, with views of the Washington Monument and room for 999 people.\n\n“Completely separate from the White House itself, the East Wing is being fully modernised as part of this process, and will be more beautiful than ever when it is complete!” he said later on Truth Social.\n\nTrump, who was a real estate developer before launching his political career, has made extensive cosmetic changes to the White House, hand-picking gold ornamentation for the Oval Office and redoing the Rose Garden in the style of his golf clubs. He has also taken an interest in the capital city of Washington and the surrounding area, proposing an Arc de Triomphe-style monument to celebrate the 250th anniversary of the United States in 2026.\n\nThe current East Wing was erected in 1942, during Franklin D. Roosevelt’s administration and amid World War Two, over a bunker built for the president’s use in case of emergency.\n\nBut the complex sometimes strains to hold the number of employees, visitors and guests of the president who wish to attend its events. Several White House state dinners, for instance, have been hosted in a tent erected on the South Lawn.\n\nPublished in Dawn, October 22nd, 2025\n\nNEWSPAPER\n   \n0\nRead more\nTrump jokes about installing missiles on White House roof\nPlanned Trump-Putin summit unlikely in ‘near future’\nTrump says he does not think Ukraine will win war\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/68f7fd7985490.gif",
  "retrievedAt": "2025-10-22T11:47:46.191Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950491/trump-begins-demolition-of-white-houses-east-wing-to-prepare-for-ballroom",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
