{
  "title": "Rawalpindi ATC again issues non-bailable arrest warrant for Aleema in Nov 26 protest case",
  "author": "Tahir Naseer",
  "content": "Rawalpindi ATC again issues non-bailable arrest warrant for Aleema in Nov 26 protest case\nTahir Naseer Published October 22, 2025  Updated about 4 hours ago\n0\nPTI Chairman Imran Khan’s sister, Aleema Khan, speaks outside the Islamabad High Court (IHC) on October 27, 2024. — Screengrab via Mohammad Asghar/ File\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nA Rawalpindi anti-terrorism court (ATC) again issued a non-bailable arrest warrant for PTI founder Imran Khan’s sister, Aleema Khan, on Wednesday in a case pertaining to protests staged by the PTI in November last year over her absence from the hearing.\n\nThis is the fourth time that the court has issued an arrest warrant for Aleema in the case.\n\nNovember 26 protests, as they famously came to be known as, saw more than 10,000 PTI protesters surge into Islamabad, defying a ban on public gatherings and a lockdown to skirmish with 20,000 security forces enlisted to turn them back. A day of clashes between security forces and protesters in the city’s Red Zone had ended in the PTI leadership’s hasty retreat, with the party announcing that it was calling off its planned protest sit-in “for the time being”.\n\nSubsequently, cases were registered against several PTI leaders under various sections of the Pakistan Penal Code and Section 7 of the Anti-Terrorism Act. Two of these cases were registered at the Taxila police station and one each at the Sadiqabad and Naseerabad police stations.\n\nProceedings for the case registered at the Sadiqabad police station were held at the ATC in Rawalpindi today, where 10 of the 11 suspects appeared before the court. Subsequently, the ATC again issued a non-bailable arrest warrant for Aleema over her failure to appear before the court.\n\nThe court also issued a show-cause notice to Superintendent of Police (Rawal Division) Saad Arshad and Deputy Superintendent of Police Naeem for filing a “bogus report”. Moreover, the court summoned them in their personal capacities over “contempt of court”.\n\nThe court remarked that the officials had said in the report that Aleema had gone into hiding. But, she was seen at the Adiala jail and also on social media channels, the court observed.\n\nDuring the last hearing, the court had directed SP Saad to arrest and produce Aleema before the court on Oct 22 (today). It had also ordered the confiscation of her surety bond and the verification of property documents submitted by her guarantor.\n\nAt today’s hearing, her guarantor’s surety bonds were confiscated and Aleema was directed to submit new surety bonds worth Rs1 million.\n\nMoreover, the surety bonds of the guarantors of four vehicles linked to the case, which had been acquired from the ATC, were also confiscated. The case has been adjourned till November 24.\n\nPrevious proceedings\n\nToday was not the first time when the court issued arrest warrants for Aleema in the case over her non-appearance.\n\nATC Judge Amjad Ali Shah had issued a non-bailable arrest warrant for her over her continued absence from the proceedings during the last hearing on Oct 20 as well.\n\nPrior to that, the court had issued a non-bailable arrest warrant for her during the hearing on Oct 14, noting that she had failed to appear twice before the court. It had also directed Sadiqabad police to arrest and produce her before the court by Oct 15.\n\nThe court had also rejected her counsel’s plea for exemption from personal appearance, observing that she was to be charged with criminal offences in connection with the Nov 26 protest.\n\nThe ATC had also issued a bailable arrest warrant for Aleem on Oct 8. Aleema was to be indicted during that hearing but didn’t appear before the court.\n\nPAKISTAN\n0\nRead more\nPTI protest: Amnesty demands transparent investigation into ‘deadly crackdown’ as 954 arrested\nRawalpindi ATC seeks arrest of ex-president Arif Alvi, other PTI leaders\nIHC clears KP CM’s plea regarding meeting with Imran\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/22124602851a4c0.webp",
  "retrievedAt": "2025-10-22T11:46:18.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950561/rawalpindi-atc-again-issues-non-bailable-arrest-warrant-for-aleema-in-nov-26-protest-case",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
