{
  "title": "Delhi gasps after firework frenzy",
  "author": "Reuters",
  "content": "Delhi gasps after firework frenzy\nReuters Published October 22, 2025  Updated about 8 hours ago\n0\nPEOPLE walk wearing face masks at a park in New Delhi amidst smog on the day after Diwali.—Reuters\nJOIN OUR WHATSAPP CHANNEL\n\nNew Delhi: Air quality in India’s capital New Delhi deteriorated to hazardous levels on Tuesday with readings the highest in the world, according to the Swiss group IQAir, partly due to the use of firecrackers during Diwali, the Hindu festival of lights.\n\nThe Supreme Court of India last week relaxed a ban on firecrackers in the city, permitting the use of so-called “green crackers” for a maximum of three hours each on Sunday and Monday, although witnesses saw crackers being set off outside the allotted times.\n\nEmissions from the crackers are 30pc to 50pc lower than conventional fireworks.\n\nIQAir’s reading for New Delhi was 442, making the Indian capital the world’s most polluted major city. Its PM 2.5 concentration was more than 59 times the World Health Organisation’s recommended annual guideline.\n\nPM 2.5 refers to particulate matter measuring 2.5 microns or less in diameter that can be carried into the lungs, risking deadly diseases and cardiac problems.\n\nIndia’s Central Poll­ution Control Board (CPCB) also rated the city’s air quality “very poor” with an air quality index (AQI) measurement of 350. CPCB considers an AQI of 0-50 as good.\n\nDelhi is unlikely to get relief in the coming days, with the Earth Sciences Ministry forecasting air quality will remain in the “Very Poor to Poor” category with AQI levels between 201 and 400.\n\nIndia’s capital and its neighbouring districts are prone to a thick smog every winter as cold, heavy air traps construction dust, vehicle emissions and smoke from agricultural fires, leaving many of its 20 million residents struggling with respiratory illnesses.\n\nIn the past, authorities have closed schools, stopped some building work and placed restrictions on private vehicles to tackle the problem. India is not alone among South Asian nations in battling toxic air.\n\nPublished in Dawn, October 22nd, 2025\n\nAIR POLLUTION\nWORLD\n0\nRead more\nSmog to intensify across Punjab after ‘Indian fireworks’\nInter-departmental operation against air pollution paying dividends, claims Punjab govt\nLahore, Karachi among top 5 most polluted cities in world\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/220839099559889.webp",
  "retrievedAt": "2025-10-22T11:47:54.666Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950500/delhi-gasps-after-firework-frenzy",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
