{
  "title": "Mosquitoes seen in Iceland for first time",
  "author": "AFP",
  "content": "Mosquitoes seen in Iceland for first time\nAFP Published October 22, 2025  Updated about 11 hours ago\n0\nIn this file photo, an Aedes aegypti mosquito with the dengue-blocking Wolbachia bacteria is seen at a laboratory in the Wolbito do Brasil plant in Curitiba, Parana state, Brazil on September 1, 2025. — Reuters/File\nJOIN OUR WHATSAPP CHANNEL\n\nREYKJAVIK: Mosquitoes have been discovered in Iceland in a first for the island nation, which has long been one of the world’s mosquito-free places, a researcher said on Monday.\n\nThree Culiseta annulata mosquitoes, two females and one male, were sighted around 30 kilometres (20 miles) north of the capital Reykjavik, according to Matthias Alfredsson, an entomologist at the Natural Science Institute of Iceland.\n\n“They were all collected from wine ropes... aimed at attracting moths,” the researcher said in an email, referring to a method of adding sugar to heated wine and dipping ropes or strips of fabric into the solution, which are then hung outside to entice the sweet-toothed insects.\n\nAlong with Antarctica, Iceland has long been one of the few places on earth without a mosquito population.\n\n“It is the first record of mosquitoes occurring in the natural environment in Iceland. A single Aedes nigripes specimen (arctic mosquito species) was collected many years ago from an airplane at Keflavik airport,” Alfredsson said, adding that “unfortunately, that specimen is lost”.\n\nPublished in Dawn, October 22nd, 2025\n\nNEWSPAPER\n0\nRead more\nIceland volcano erupts for ninth time since 2023\nFrance held in Iceland as Germany and Belgium close on 2026 World Cup\nIceland announces early disbursement of funds to UNRWA\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/22085730707834a.webp",
  "retrievedAt": "2025-10-22T11:47:57.625Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950496/mosquitoes-seen-in-iceland-for-first-time",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
