{
  "title": "Pakistan trade imbalance with 9 states deepens",
  "author": "Mubarak Zeb Khan",
  "content": "Pakistan trade imbalance with 9 states deepens\nMubarak Zeb Khan Published October 22, 2025  Updated about 9 hours ago\n0\nThis representational image shows containers at a port. — Reuters/File\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nISLAMABAD: Pakistan’s trade deficit with nine neighbouring countries surged by 34.54 per cent in the first quarter of the current fiscal year (FY26), rising to $3.93 billion compared to $2.921bn recorded during the same months last year.\n\nThe increase in deficit is mainly the outcome of a decline in Pakistan’s overall exports to regional countries, except China, where Pakistan’s exports showed signs of recovery in the first three months of the current fiscal year.\n\nA marginal increase was also recorded in exports to Sri Lanka, while shipments to Bangladesh and Afghanis­tan registered negative growth during the period under review, according to the latest data compiled by the State Bank of Pakistan.\n\nIn FY25, Pakistan’s trade deficit with nine neighbouring countries expanded by 29.42pc to $12.297bn compared to $9.502bn recorded during the same period last year.\n\nGap widens to $3.93bn in July-September\n\nThe value of Pakistan’s exports to nine countries — Afghanistan, China, Bangladesh, Sri Lanka, India, Iran, Nepal, Bhutan and the Maldives — dipped 5.07pc to $1.011 billion in July-September FY26 from $1.065bn over the same period last year.\n\nIn FY25, Pakistan’s exports to nine countries rose 1.49pc to $4.401bn in July-June FY25 from $4.336bn over the same period last year.\n\nContrary to this, imports surged 23.95pc to $4.941bn in 3MFY26 from $3.986bn over the same months of the previous fiscal year. In FY25, imports surged 20.66pc to $16.698bn in FY25 from $13.838bn over the same period of the previous fiscal year.\n\nFurther analysis showed that imports from China increased by 24.92pc to $4.861bn in 3MFY26 from $3.891bn over the same period last year. In FY25, imports from China totalled $16.312bn, up by 20.79pc from $13.504bn over the previous year. The bulk of imports in the region is sourced from China, with partial contributions from India and Bangladesh.\n\nPakistan’s exports to China slightly increased by 0.59pc to $562.39m in 3MFY26 from $559.07m over the same months in the preceding fiscal year. In FY25, Pakistan’s exports to China dipped 8.6pc to $2.476bn from $2.709bn over the same months in the preceding fiscal year.\n\nImports from India dipped by 36.41pc to $36.55m in 3MFY26 from $57.48m over the last year. In FY25, imports from India increased to $220.58m from $206.89m over the last year. Meanwhile, exports to India remained at $1.95m in 3MFY26. Exports to India totalled $3.669m in FY24 compared to $0.329m in the same period the previous year.\n\nExports to Afghanistan dipped 19.83pc to $161.83m in 3MFY26 from $201.88m last year. Imports stood at $4.52m in 3MFY26 against $6.38m in FY25. Last year, Pakistan’s main exports to Afghanistan included sugar.\n\nExports to Bangladesh declined by 4.93pc to $180.15m in 3MFY26 from $189.50m over the last year.\n\nExports to Sri Lanka dipped by 8.32pc to $102.56m in 3MFY26 from $111.86m over the last year. The imports rose by 19.68pc $17.33m in 3MFY26 from $14.48m.\n\nNo data is available as most trade with Iran is conducted via informal channels. Very little trade was recorded between Pakistan, the Maldives, and Nepal during the review period.\n\nPublished in Dawn, October 22nd, 2025\n\nFollow Dawn Business on X, LinkedIn, Instagram and Facebook for insights on business, finance and tech from Pakistan and across the world.\nNEWSPAPER\n0\nRead more\nExports fall in July-Sept as trade gap widens\nTrade gap with neighbours widens 29pc in FY25\nTrade with Central Asia shrinks amid rising imports\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/22074232e797b8e.webp",
  "retrievedAt": "2025-10-22T11:48:06.512Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950513/pakistan-trade-imbalance-with-9-states-deepens",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
