{
  "title": "Sindh govt downplays dengue outbreak, confirms 276 new cases in October",
  "author": "Mohammad Hussain Khan",
  "content": "Sindh govt downplays dengue outbreak, confirms 276 new cases in October\nMohammad Hussain Khan Published October 22, 2025  Updated about 7 hours ago\n0\nHYDERABAD: Anti-mosquito spray is carried out in the Paretabad area by a charity.—Umair Ali\nJOIN OUR WHATSAPP CHANNEL\n\n• In the latest report, the health department claims the number of cases from Oct 1-20 in Karachi and Hyderabad divisions stands at 124 and 82, respectively\n• Over 10,000 test positive for dengue in Hyderabad lab and its branches in just 20 days\n• DHO seeks inclusion of Diagnostic and Research Laboratory’s stats in the health dept’s figures\n\nHYDERABAD: Amid an alarming rise in dengue cases across Sindh, the provincial government seems to be intentionally downplaying the severity of the situation, as the health department claimed in its latest report that only 276 new cases of the mosquito-borne disease have been reported during the current month, bringing the total number to 920 this year.\n\nAccording to the health department report, Karachi Division remains the most affected, with 124 confirmed cases, followed by Hyderabad Division with 82, Mirpurkhas with 58, Sukkur with nine, Shaheed Benazirabad with two, and Larkana Division with one case.\n\nHowever, the official figures do not reflect the situation on the ground as various branches of the Diagnostic and Research Laboratory (DRL) had carried out tests of 24,019 patients between Oct 1 and Oct 20 in different cities and towns of the province (excluding Karachi), and 10,744 of them tested positive for dengue.\n\nBesides, the government has confirmed only one death, but in Hyderabad alone, nine dengue patients have lost their lives in just a couple of days. Their families confirmed that their loved ones had been infected with the dengue virus.\n\nOfficials said that the DRL figures are not being added to the health department’s tally for unknown reasons.\n\nOn Tuesday, the Hyderabad district health officer moved a senior official and requested him to direct the DRL administrator to share “detailed information of dengue positive cases” pertaining to the district Hyderabad on a daily basis.\n\nThe health department spokesperson was unavailable when reached for comment.\n\nMinister wants anti-dengue drive intensified\n\nIn a statement issued on Tuesday, Sindh Health Minister Dr Azra Fazal Pechuho stated that the provincial government had further intensified its anti-dengue campaign across Sindh.\n\n“Instructions have been issued to all districts to enhance spray operations, fumigation, and drainage systems to eliminate mosquito breeding sites,” she added.\n\n“All deputy commissioners and district health officers have been directed to ensure that no stagnant water remains anywhere, as it is the primary source of mosquito breeding,” the minister said.\n\nShe emphasised that the government’s priority is to give equal attention to both urban and rural areas.\n\nDedicated dengue treatment units have been established in all government hospitals, providing free testing and treatment facilities to patients.\n\nDr Pechuho also appealed to the public to avoid stagnant water in courtyards, rooftops, and flowerpots, use mosquito repellents, and immediately visit nearby hospitals in case of fever.\n\n“Dengue is a preventable disease, and with collective responsibility and public cooperation, we can control it effectively,” she added.\n\nThe health minister further assured that Sindh government’s dengue monitoring teams are actively working in the affected districts and are reviewing the situation on a daily basis.\n\nPublished in Dawn, October 22nd, 2025\n\nPAKISTAN\n0\nRead more\nKarachi, Hyderabad face dengue outbreak as cases spike alarmingly\nDespite chill in air, no let-up in dengue cases\nDengue claims year’s first life in Sindh\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/68f80c7f94e09.jpg",
  "retrievedAt": "2025-10-22T11:47:28.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950534/sindh-govt-downplays-dengue-outbreak-confirms-276-new-cases-in-october",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
