{
  "title": "Mehmood Khan Achakzai nominated for NA opposition leader",
  "author": "Ikram Junaidi",
  "content": "Mehmood Khan Achakzai nominated for NA opposition leader\nIkram Junaidi Published October 22, 2025  Updated about 8 hours ago\n   \n0\nPTI whip Amir Dogar and ex-NA speaker Asad Qaiser submit Mr Achakzai’s nomination to an NA official. — White Star\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nISLAMABAD: Pakistan Tehreek-i-Insaf (PTI) on Tuesday formally requested the appointment of Mehmood Khan Achakzai as Leader of the Opposition in the National Assembly.\n\nThe move was announced by former speaker Asad Qaiser, Chief Whip Malik Amir Dogar, Prince Nawaz Khan Allai and Shahram Tarakai at a joint press conference.\n\nMr Qaiser said the post has been vacant since the disqualification of Omar Ayub Khan and expressed hope the speaker would issue the notification “without delay” upon his return to the country.\n\n“Mehmood Khan Achak­zai is a senior and respected politician. We expect that no undemocratic means will be used in this process. The opposition leader’s seat should not remain vacant,” Mr Qaiser said.\n\nPTI hints at ‘small cabinet’ in KP as CM-Imran meeting remains pending\n\nMr Dogar said the nomination carried the signatures of 74 MNAs. “Meh­mood Khan Achakzai’s name carries significance for the survival and stability of democracy. The decision reflects our leadership’s consensus, and all members have endorsed it,” he said, adding that Mr Achakzai also remains PTI’s presidential nominee.\n\nCommenting on Pakistan-Afghanistan ties, Mr Qaiser said both countries should exercise patience and reopen trade routes, including onward access to Central Asia.\n\nHe also criticised the federal government for providing “non-functional” vehicles to the Khyber Pakhtun­khwa police.\n\n“Even a federal minister acknowledged this issue, but I do not wish to name him,” he added.\n\nHe also lamented that the province had yet to rec­eive its three per cent share of the national divisible pool under the NFC Award.\n\nSmall cabinet in KP\n\nSeparately, PTI Chairman Barrister Gohar Khan said the party may form a small cabinet in Khyber Pakhtunkhwa if the chief minister is not permitted to meet the PTI founder.\n\nSpeaking to reporters outside Adiala Jail, he said a full cabinet would be announced after a meeting between the chief minister and Imran Khan.\n\nReplying to a question, he said that Afghan refugees should be repatriated with dignity.\n\nPublished in Dawn, October 22nd, 2025\n\nNEWSPAPER\n   \n0\nRead more\nImran Khan nominates Mahmood Achakzai as NA opposition leader, Swati for Senate\nAchakzai as NA leader is a ‘back-up’ plan: PTI\nPTI formally taps Achakzai, Abbas to lead opposition\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/68f7fd373db09.jpg",
  "retrievedAt": "2025-10-22T11:47:47.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950488/mehmood-khan-achakzai-nominated-for-na-opposition-leader",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
