{
  "title": "Muthusamy, Rabada take South Africa into 71-run lead over Pakistan on day three of second Test",
  "author": "AFP",
  "content": "Muthusamy, Rabada take South Africa into 71-run lead over Pakistan on day three of second Test\nAFP Published October 22, 2025  Updated about 2 hours ago\n   \n0\nPakistan’s Asif Afridi celebrates after taking the wicket of South Africa’s Tristan Stubbs during the third day of the second Test cricket match between Pakistan and South Africa at the Rawalpindi Cricket Stadium in Rawalpindi on October 22, 2025. — AFP\nSouth Africa’s Senuran Muthusamy plays a shot during the third day of the second Test cricket match between Pakistan and South Africa at the Rawalpindi Cricket Stadium in Rawalpindi on October 22, 2025. — AFP\nPakistan’s Asif Afridi celebrates after taking the wicket of South Africa’s Tristan Stubbs during the third day of the second Test cricket match between Pakistan and South Africa at the Rawalpindi Cricket Stadium in Rawalpindi on October 22, 2025. — AFP\nSouth Africa’s Senuran Muthusamy plays a shot during the third day of the second Test cricket match between Pakistan and South Africa at the Rawalpindi Cricket Stadium in Rawalpindi on October 22, 2025. — AFP\nPakistan’s Asif Afridi celebrates after taking the wicket of South Africa’s Tristan Stubbs during the third day of the second Test cricket match between Pakistan and South Africa at the Rawalpindi Cricket Stadium in Rawalpindi on October 22, 2025. — AFP\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nSenuran Muthusamy and Kagiso Rabada hit fighting half-centuries as South Africa took a crucial 71-run lead over Pakistan on day three of the second Test in Rawalpindi on Wednesday.\n\nMuthusamy made a career-best 89 not out and Rabada struck his highest score of 71 as the visitors added 169 for the last two wickets.\n\nVeteran Pakistan spinner Asif Afridi ended the innings on 404 at the stroke of tea.\n\nThe 38-year-old Asif finished with figures of 6-79 and is the oldest man to take five wickets on a Test debut.\n\nThe afternoon session though belonged to South Africa as the World Test champions bid to square the two-match series, after losing the first Test by 93 runs in Lahore.\n\nMuthusamy defied the Pakistan spinners, hitting eight fours to improve on his previous highest of 68 not out against Bangladesh at Chattogram last year.\n\nMuthusamy added an invaluable 71 runs for the ninth wicket with Keshav Maharaj (30) and then increased the lead with a last-wicket stand worth 98.\n\nRabada smashed four sixes and as many fours, improving on the 47 he made against New Zealand at Christchurch in 2022.\n\nThe morning belonged to Asif, who at 38 years and 301 days overtook England’s Charles Marriott as oldest debutant to take five wickets.\n\nMarriott did so against the West Indies at The Oval in 1933 aged 37 years and 332 days.\n\nLike fellow left-armer Maharaj — who took seven wickets for the visitors in Pakistan’s 333 all out — Asif used the dry conditions to maximum effect.\n\nSouth Africa resumed on 185-4 and added 100 runs in the morning session.\n\nWith the turn on the Rawalpindi stadium pitch increasing considerably, Asif dismissed Kyle Verreynne caught behind by wicketkeeper Mohammad Rizwan for 10 with the fourth ball of the day.\n\nTristan Stubbs defied Pakistan’s spinners for 256 minutes before a fastish delivery from Asif trapped him leg-before for 76. His knock was studded with six fours and a six.\n\nAsif completed his five-wicket haul by trapping Simon Harmer leg-before for two while Noman Ali dismissed Marco Jansen in the same manner for 12.\n\nSPORT\n   \n0\nRead more\nMaharaj takes seven wickets with South Africa-Pakistan second Test in balance at stumps\nShoddy South Africa fielding helps Pakistan reach 259-5\nNoman, Shaheen spur Pakistan to 93-run victory over South Africa in first Test\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/10/22151201ef242d6.webp",
  "retrievedAt": "2025-10-22T11:46:17.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950560/muthusamy-rabada-take-south-africa-into-71-run-lead-over-pakistan-on-day-three-of-second-test",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T00:00:00.000Z"
}
