{
  "title": "Over Rs153 billion tax refunds disbursed to exporters, ensuring market liquidity: Aurganzeb",
  "link": "https://www.app.com.pk/national/over-rs153-billion-tax-refunds-disbursed-to-exporters-ensuring-market-liquidity-aurganzeb/",
  "date_published": "2024-09-10T12:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):Minister for Finance and Revenue, Senator Muhammad Aurangzeb on Tuesday told the Upper House of the Parliament that the Federal Board of Revenue (FBR) has provided over Rs153 billion tax refunds to the exporters ensuring market liquidity.\nHe was responding during the Questions and Answers session to a supplementary query of Senator Zeeshan Khanzada amid the seventh meeting of the 342nd Senate Session here with Deputy Chairman Senate, Syedaal Khan Nasar in chair.\nSenator Zeeshan Khanzada of Pakistan Tehreek-e-Insaf (PTI) in his query noted that the trade policy imposed in 2019 had expired in 2024 and no new policy and the government stance was shared so far.\nSenator Muhammad Aurangzeb responded that the federal government through FBR had expedited refunds and over Rs52 billion were dispersed to the exporters on July 1st, the first day of the fiscal year 2024.\nHe said the federal government was focussing on diversification of exports into agriculture and information and technology (IT) as these two sectors were real channels and levers of growth and a comprehensive policy was in place.\nThe Finance Minister in response to another query, said the question is pertinent and agriculture was the real lever of growth in Pakistan that saved the country economically through its 6% growth rate during the past fiscal year that averted default risk.\nHe assured the mover that the federal government would increase the financing for agriculture sector with large- and small-scale farmer financing including livestock and dairy financing as the latter comprised 60% of country’s agriculture sector GDP.\n“We are trying to promote dairy and livestock financing through banks and the point of the Member is well noted,” he said.\nHe informed that two years back in the agriculture credit committee under the governor State Bank of Pakistan, the banks were directed to focus provinces’ agriculture extensions and extension of credit. “The bank, I had served was asked to focus Balochistan. The agriculture financing into Balcohistan has gone up by multiple times the way it was two years back,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:57:11.321Z"
}
