{
  "title": "CPU inaugurated in Khyber to promote children rights",
  "link": "https://www.app.com.pk/national/cpu-inaugurated-in-khyber-to-promote-children-rights/",
  "date_published": "2024-09-10T11:17:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 10 (APP):In a significant step towards ensuring the protection and welfare of children in the Merged Districts of Khyber Pakhtunkhwa, the Khyber Pakhtunkhwa government has inaugurated a Child Protection Unit (CPU) in District Khyber.\nThe aim of the unit is to safeguard and promote the rights of children, providing prevention and response to cases of child abuse, neglect, and exploitation.\nThe Chief Guest of the inaugural ceremony was Additional Secretary Social Welfare Department KP, Muhammad Farooq.\nHe said that the establishment of this CPU reflected the government’s strong commitment to ensuring the protection of children at risk and fostering a safer environment for the most vulnerable members of society.\nHe appreciated the Department of Social Welfare for the successful inauguration of the Child Protection Units Khyber.\nThe establishment of CPU is a direct response to this persistent need he said adding that children face various forms of abuse, neglect, and exploitation in society and it was joint responsibility of all to build stronger systems to protect them from all forms of abuse and exploitation.\nThis unit would focus on identifying, preventing, and responding to child at risk, ensuring their fundamental rights to life, development, participation, and protection, he noted.\nMuhammad Farooq also stressed the importance of collective action in addressing the complex challenges of child abuse, violence, exploitation, and neglect.\nHe urged all relevant line departments to closely collaborate with the CPU Khyber and emphasized the significance of building strong partnerships with parents and communities to create a protective environment for children.\nHe thanked UNICEF, especially Sohail Ahmad Child Protection Specialist for his continuous technical and financial support for the Child Protection in MDs, and hoped this partnership would continue in future.\nHe assured to provide every possible support on behalf of the Government to protect child rights.\nIn his remarks by the Deputy Commissioner Khyber Sana Ullah Khan, added that the establishment of CPU was a direct response to protect needs of child at risk.\nHe said the district administration also emphasized its ongoing commitment to supporting the CPU and ensuring that all necessary resources were available to uphold the rights of children in Khyber.\nHe added that District Child Protection Committees has been notified in the district under KP Child Protection act 2010, chaired by the Deputy Commissioner to uphold children’s rights.\nEjaz Khan, Dy Chief/ Protection Officer KP-CPWC, highlighted the importance and implementation of the Child Protection and Welfare Act 2010 emphasizing that it provides essential protection for all children in the province, irrespective of their status and nationalities.\nHe presented The Journey of Child Protection System development in KP with focused of the Child Protection data in MDs, and shared statistics of District Khyber with participants.\nReshma Afridi – President of the Female Community-Based Child Protection Committees (CB-CPC), shared her experience with the participants.\nShe reflected on the challenges women previously faced in a male-dominated society, where they had little voice or right to express their concerns.\nNow, as the President of the CB-CPC, formally established under the KP Child Protection Act 2010, she and her committee have gained legal standing, highlighting the Government’s commitment to empowering communities to protect children’s rights and create a safer environment at the grassroots level.\nReshma added that after formation process and attending orientation sessions, the committee members now have easier access to the Child Protection Unit and are able to refer cases of child protection, especially Girls cases and issues.\nShe expressed her satisfaction as a female participant, highlighting the positive impact of forming the community-based structure, which ensures equal representation for women and adolescents in addressing child protection issues.\nAt the end of the event ribbon cutting Ceremony of the Child Protection Unit, District Khyber was held by the Additional Secretary Muhammad Farooq, Director Social Welfare MDs, Muhammad Naeem, Deputy Commissionaire Khyber Sana Ullah Khan, Obaid Ur Rahman Deputy Director Social Welfare MDs and Staff of PMU and CPU Khyber.\nThe Director of Social Welfare (MDs), Muhammad Naeem expressed his appreciation to the participants for attending the event.\nHe also extended his thanks to UNICEF for their ongoing support in strengthening the Child Protection Units in MDs.\nHe acknowledged UNICEF’s valuable contributions to building the capacity of staff, enhancing the effectiveness of the Community-Based Child Protection Committees (CB-CPC), and supporting district-level trainings initiatives for the social workforce.\nDirector Social Welfare Department (MDs), Muhammad Naeem, Deputy Commissionaire Khyber Sana Ullah Khan, Obaid Ur Rahman Deputy Director Social Welfare MDs, representatives from members of District Child Protection Committee Khyber, Male and female members of the community Based Child Protection Committees, Adolescents Members and Community volunteers participated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:57:22.335Z"
}
