{
  "title": "Trade Policy 2025 to be announced soon; Jam Kamal",
  "link": "https://www.app.com.pk/national/trade-policy-2025-to-be-announced-soon-jam-kamal/",
  "date_published": "2024-09-10T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):Federal Minister for Commerce and Trade Jam Kamal Khan has said the government was working to announce the Trade Policy 2025 which would be presented to the standing committees of the Parliament soon.\nReplying to the questions of Senator Zeeshan Khanzada in the 342nd session of the question and answer session of the House, he said the government was committed to facilitating trade and industry and expanding exports.\nKamal said that the incumbent government was determined to bring institutional and structural reforms, enhance regional connectivity, and diversify exports to ensure sustainable growth and stabilise the economy.\nJam Kamal said Prime Minister Shehbaz Sharif has conducted several meetings with relevant ministries and stakeholders to deliberate upon a range of issues so that a comprehensive strategy could be framed to do away with all the challenges being faced by the business and industry in Pakistan.\nHe said that the textile sector, which constitutes the major portion of the country’s exports, was under stress and we are considering different options for developing the sector.\nKamal informed that the present government had appointed a competent Head of the National Compliance Center on September 1. He told the House that textiles and apparel exports slightly increased by 0.93 per cent in the Financial Year (FY) 2023-24 as compared with FY 2022-23.\nThe minister added that the government was taking steps to redesign of Export Facilitation Scheme (EFS) of FBR for inclusion of all stages of the manufacturing for end-to-end coverage; exemption of registered units from sales tax on utility bills and removal of other procedural irritants to ease the imports for re-export purposes.\nLater the Chairman of the Senate Syed Yousaf Raza Gillani referred the matter at the request of Senator Zeeshan Khanzada with the consent of Minister Jam Kamal Khan to the concerned committee.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:56:44.853Z"
}
