{
  "title": "Anti-polio drive continues in ICT; 2 held for violations",
  "link": "https://www.app.com.pk/national/anti-polio-drive-continues-in-ict-2-held-for-violations/",
  "date_published": "2024-09-10T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):A five-day door-to-door anti-polio vaccination campaign entered its second day in the Federal Capital while a school principal was arrested for refusing to allow students to receive the polio vaccine.\nAll the Assistant Commissioners are actively participating in the field alongside polio workers to ensure the campaign runs smoothly, said the spokesman of Islamabad Capital Territory (ICT) administration.\nOn the occasion, the district administration urged full cooperation to ensure the success of the door-to-door campaign.\nFor this purpose, Assistant Commissioner (AC) Pothohar, Aneeq Anwar, visited the Jhangi Syedan area, while AC Secretariat Abdullah Khan oversaw the campaign in Bari Imam, Barah Kahu, and Phulgran.\nDuring their visits, some challenges faced by polio workers were identified. In response, they urged citizens to cooperate with health teams.\nOne person was arrested for refusing to let polio workers vaccinate children.\nThe district administration emphasized that it is crucial for parents to ensure their children receive polio drops, warning that refusal to vaccinate is a serious offense.\nIn a separate incident, the principal of a private school within the Nilore police jurisdiction was also arrested after he refused to let polio workers administer the vaccine to his students.\nAlthough the principal was released after discussions with the district administration, the incident highlights the legal requirement to cooperate with polio workers.\nThe authorities stressed that preventing polio workers from doing their job is a criminal act.\nThe district administration has appealed to all citizens, especially school administrations, to cooperate with the ongoing polio campaign. They reminded everyone that protecting children from polio is a collective responsibility and that refusing to vaccinate puts the wider community at risk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:56:43.188Z"
}
