{
  "title": "Senate body orders resolution of G-6 flats issue within six months",
  "link": "https://www.app.com.pk/national/senate-body-orders-resolution-of-g-6-flats-issue-within-six-months/",
  "date_published": "2024-09-10T18:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): The Senate’s Standing Committee on Housing and Works on Tuesday directed the CDA and police to resolve the issue of occupation of flats in Sector G-6/1 in line with a 2018 Supreme Court verdict ruling within six months and submit monthly progress reports.\nThe committee met with Senator Nasir Mehmood in the chair.\nThe Inspector General (IG) of Police told the committee that some 114 police officers were residing in the cited flats.\nHe said there were over 12,000 personnel of the Islamabad Police with only 314 flats were allotted to them.\nThe committee chairman, however, asked the police to vacate the respective flats occupied by them illegally as per the Supreme Court ruling.\nThe IGP argued that there was no SC decision specifically addressing the issue and suggested to form a committee for the purpose.\nSenator Mehmood countered that the apex court had given its verdict on the matter in 2018 and six years had lapsed with 114 houses still occupied by the policemen.\nHe directed the Secretary of Ministry to address the issue within six months as both the Capital Development Authority (CDA) and Islamabad Police fell under the Ministry of Interior.\nThe committee also directed the CDA to hold meetings with the Ministry of Interior and State Office to find an amicable resolution of the issue in line with the Supreme Court orders.\nThe CDA and Police were also directed to submit monthly progress reports to the committee.\nAt the outset, the Committee expressed concerns over the absence of the CDA Chairman and delayed submission of reports.\nAs regards the Islamabad Central Jail, the committee was informed that its construction was initiated a decade back. Now the work had resumed a month ago, which was expected to complete in December 2024.\nThe committee chairman also called for a performance report from all subsidiaries of the Secretary of Housing and Works.\nRegarding land acquisition and built-up property payments under FGEHA projects, it was reported that amounts of Rs 18,382,839 (Rs 18.52 billion) and Rs 4,088,879,567 (4.09 billion) respectively had been paid on that counts for various projects.\nThe Director General Housing and Works told the meeting that a fake contractor, whose bank guarantee for the project of G-14 was found to be fraudulent, was paid Rs 170 million.\nSenator Mehmood suggested eliminating the role of intermediaries in land transactions.\nIt was told that the FIA had been requested to place the contractor, project director, who was terminated on April 22, 2024, and consultant on a watch list. The sub-engineer was also suspended and issued a show-cause notice.\nThe committee directed the ministry to provide a complete record of related arrangements and correspondence.\nIt also reviewed the auction expenses for three mixed-use commercial plots in G-13, amounting to Rs 12,229,823 (Rs 12.23 million) .\nRegarding inquiries into corruption, mismanagement, and delays in FGEHA, PHA, and Pak PWD projects, officials reported no ongoing inquiries against PHAF officials. However, due to design faults by M/s JC CIV Tech, the design consultant for the KuchLak project in Quetta, Rs 8,563,189 (Rs 8.56 million) was deducted as a penalty. The Quetta PHA project was expected to be completed by December 2025.\nThe meeting was attended by Senators Bilal Ahmed Khan, Saifullah Sarwar Khan Niazi, Saifullah Abro, Khalida Ateeb, and Senator Husna Bano.",
  "retrievedAt": "2025-08-10T20:55:54.349Z"
}
