{
  "title": "2 bills including SC (Amendment) Bill, 2024 introduced in NA",
  "link": "https://www.app.com.pk/national/2-bills-including-sc-amendment-bill-2024-introduced-in-na/",
  "date_published": "2024-09-10T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): Two bills including the Supreme Court (Number of Judges) (Amendment) Bill, 2024 and the Pakistan Environmental Protection (Amendment) Bill, 2024 were introduced in the National Assembly on Tuesday.\nDanyal Chaudhary sought the leave to introduce the bill to further amend the Supreme Court (Number of Judges) Act, 1997 [The Supreme Court (Number of Judges) (Amendment) Bill, 2024] in the House while Nuzhat Sadiq moved the bill to further amend the Pakistan Environmental Protection Act, 1997 [The Pakistan Environmental Protection (Amendment) Bill, 2024].\nDeputy Speaker Syed Ghulam Mustafa Shah referred the bills to the standing committees concerned for deliberation as Information Minister Attaullah Tarar said that the government had no objection over the introduction of the bills.\nMehmood Khan Achakzai said that the bill related to the SC judges was very important and it should not be referred to the relevant committee without carrying out debate on it in the House.\nLater he pointed out quorum, but the House was found in order after making the count of the members.\nSyed Naveed Qamar also moved an amendment to the Rules of Procedure and Conduct of Business in the National Assembly, 2007.\nHe sought amendment in Rule 119 of the Rules of Procedure as: “That in the Rules of Procedure and Conduct of Business in the National Assembly, 2007, in rule 119, after sub-rule (1), the following proviso shall be added namely:- “Provided that in order for a Constitutional Amendment Bill, at least one-fourth of the total membership may stand in their seats to allow the amendment to be introduced.”\nThe Chair also referred the amendment to the standing committee concerned.",
  "retrievedAt": "2025-08-10T20:56:51.159Z"
}
