{
  "title": "SC dismisses review appeals against removal of restaurants from Margalla Hills",
  "link": "https://www.app.com.pk/national/sc-dismisses-review-appeals-regarding-removal-of-restaurants-from-margalla-hills/",
  "date_published": "2024-09-10T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): The Supreme Court on Tuesday dismissed the review appeals and upheld its verdict for the removal of restaurants including Monal, Lamontana and Gloria Jean from the Margalla Hills National Park.\nThe top court also withdrew its observation in which it had stated that the restaurants should be given priority in lease process of any other location.\nThe court, in its 13-page order authored by Chief Justice of Pakistan Qazi Faez Isa, said, “The cases were not heard in chambers nor by a single judge. They were heard in open court by this Bench (of three judges) and the short order dated 11 June 2024 was dictated in open court in the presence of everyone.\n“The documents filed by the Firm and its partners in the review petition and the listed applications confirm that the Firm and/or its partners are in illegal possession of the land situated in the Margalla Hills National Park (‘the National Park’) and illegally running restaurants (La Montana and Gloria Jeans.”\nThe court observed that the utter disdain and contempt for the laws of Pakistan and the degradation/destruction of the National Park was made possible by the complicity of those who were required to protect, preserve and conserve it; they were in the service of Pakistan, but were unmindful of their duty to serve the people, instead they served moneyed interests.\nThe order said, “The owner of Monal restaurant and of La Montana and Gloria Jeans had voluntarily offered to vacate the land of the National Park in their possession within three months, this court had appreciated this gesture of theirs and recorded this in order dated 11 June 2024, which was confirmed in the detailed judgment.\n“The said undertakings to vacate the premises were given in the presence of their respective counsel but they want now to resile therefrom. Making a mockery of solemn undertakings and to render them meaningless cannot be permitted, and those doing so must suffer the consequences.\n“Therefore, we have been persuaded by their contemptuous behaviour and misconceived contentions to review our said short order and detailed judgment and to withdraw/delete the portion where court instructed to give priority to them in lease of other locations.”",
  "retrievedAt": "2025-08-10T20:55:57.258Z"
}
