{
  "title": "BISP proves to be successful social protection intervention in history: Shazia Marri",
  "link": "https://www.app.com.pk/national/bisp-proves-to-be-successful-social-protection-intervention-in-history-shazia-marri-2/",
  "date_published": "2023-07-07T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP):Federal Minister for Poverty Alleviation and Social Safety Shazia Marri Friday said the Benazir Income Support Programme (BISP) had emerged as the most successful social protection intervention in the history of the country due to its positive impact on the lives of the poorest segments.\nSpeaking at the launching ceremony of a new initiative “Benazir Social Protection Accounts” for its beneficiaries, Shazia Marri said that the BISP, launched in the year 2008 and legalized in 2010, was conceived by Shaheed Mohtarma Benazir Bhutto to provide financial relief to the poor families.\nThe initiative was launched by Prime Minister Shehbaz Sharif in a ceremony in the presence of Minister for Information and Broadcasting (MOIB) Marriyum Aurangzeb and Special Assistant to the PM on Poverty Alleviation and Social Safety Faisal Karim Kundi.\nThe programme due to its apolitical nature sustained through different political government tenures and achieved international acclamations for its performance, structure and transparency.\nHighlighting the achievements of BISP, the federal minister stated, “The budget of the programme has been increased from Rs 235 billion in FY 2022 to Rs 404.2 billion in the FY 2023, registering a significant increase to extend its scope to more families.\n“The beneficiaries of BISP (Benazir Kafaalat) have increased from 7.6 million to nine million families with an increase in the stipend up to Rs 8750 which reflect political commitment towards the welfare of downtrodden segments. “\nAbout the Conditional Cash Transfer initiative of Benazir Education Stipends, Shazia Marri highlighted that the enrolment of children had increased from 2.6 million in FY 2022 to 7.52 million in FY 23, registering a 200 percent increase.\nShe said, “The number of Benazir Scholarships for Undergraduates has increased from 82,000 in FY 2022 to 92,003 in FY 2023.”\n“The program will be connected to the Poverty Score Card in future,” she added.\n‘Benazir Nashonuma’ Program which caters for the nutritional needs of pregnant and lactating mothers and children to prevent stunted growth and malnutrition in children has been expanded from 15 districts (FY 2022) to all the districts of the country in FY 2023.\n“So far, 0.77 million beneficiaries have been enrolled in the programme through 488 Facilitation Centers established countrywide,” she said.\nAbout the Fuel Subsidy program, which was initiated to mitigate the impact of increased fuel prices on poor segments, Shazia Marri said that the targeted subsidy of Rs 16.3 billion was given to 8.6 million families (Rs 2,000 per family.\nTo provide relief to the flood-affected population, the Benazir Emergency Cash of Rs 70 billion had been disbursed to 2.8 million beneficiaries (Rs 25,000 per family), she added.\nThe minister said that the 2.3 million households have been resurveyed during the four months under the ongoing dynamic survey aimed at identifying more poor households for registration in BISP.\nShe also highlighted the initiative of including Transgender Persons in the Benazir Kafaalat program as well as the families with differently-abled persons with relaxation in Poverty Score.",
  "retrievedAt": "2025-08-11T08:51:42.744Z"
}
