{
  "title": "Speakers for capacity building of provincial EMISs, education managers on SDG-4 data statistics",
  "link": "https://www.app.com.pk/national/speakers-for-capacity-building-of-provincial-emiss-education-managers-on-sdg-4-data-statistics/",
  "date_published": "2023-07-07T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP):The speakers at a training session have stressed the need for capacity building of provincial/area Education Management Information Systems (EMISs) and education managers on SDG-4 data collection, analysis, reporting and use for planning & monitoring besides collaboration among stakeholders for better use of education statistics.\nThe opening session was chaired by Salman Mufti, Additional Secretary, Ministry of Federal Education and Professional Training and Zafar Malik, Head of Education, UNESCO here on the other day.\nDr. Muhammad Shahid Soroya, DG, Pakistan Institute of Education (PIE) welcomed the participants and apprised them about various projects, initiatives and interventions implemented/initiated by PIE during the last few months including development of training manual for these workshops, providing technical input for SDG-4 Mid-Term review.\nAn exhaustive training needs assessment was conducted to assess the capacity of the provincial/ area EMIS teams and a customized training manual has been developed for knowledge/skills enhancement of the EMIS teams on the SDG-4 benchmarking, data collection, analysis, and reporting.\nThe workshop sensitized the education managers and policymakers on the SDG-4 data production and utilization through advocacy workshops.\nHands-on exercises, case-studies, and scenario exercises based on real-data were also conducted during the three days of the workshop.\nThe training was also imparted on producing education indicators from various sources including administrative data, household surveys, monitoring, censuses, etc.\nThe aspects of data quality, ethics, analysis and utilization were also discussed at length.\nThe closing session was chaired by Youssef Filali-Meknassi, Representative and Director UNESCO Islamabad.\nHe highlighted the importance of data especially after COVID-19 and Floods to identify the areas where the resources are needed the most.\nHe also stressed upon need of active collaboration among stakeholders for better produce and use education data/statistics.\nDr. Shahid Soroya in the concluding remarks shared the efforts made by stakeholders for producing quality data based on standardized methodologies and interpretation.\nIt was hoped that the skills and knowledge gained in the workshop would be applied by participants in their official work in producing quality data and its use in effective policy and planning.\nIt may be mentioned here that the federal government, by merging its two subordinate departments, established Pakistan Institute of Education (PIE) as a premier entity of Ministry of Federal Education and Professional Training to produce reliable and qualitative education statistics for guiding policy, planning, management, and monitoring at various administrative levels.\nThe PIE was established after emergence of two subordinate departments- Academy of Educational Planning and Management (AEPAM) and National Education Assessment System (NEAS).\nThe purpose to establish PIE was to overcome obstacles pertaining to availability of reliable and timely data in planning and policymaking especially in designing equity-based targeted interventions across Pakistan.\nNational and Provincial EMISs put the utmost efforts to produce quality education data for meeting the needs of policymakers, planners, and decision-makers, however, there were certain gaps in education data that hindered the policy and planning process.\nIn this backdrop, NEMIS-PIE and UNESCO collaborated to assess the gaps, needs, and challenges of stakeholders and data producing agencies in data production, analysis and ultimately its use for effective policy and planning purpose.",
  "retrievedAt": "2025-08-11T08:51:38.876Z"
}
