{
  "title": "ANP raises alarm in Senate over FC transformation - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Minister explains upgraded federal force will not be political or normal policing unit\n• More than 80,000 CNICs blocked over suspicion of being issued to aliens, Senate told\n\nISLAMABAD: The Awami National Party (ANP) on Tuesday raised alarm in the Senate over the government’s move to transform the Frontier Constabulary (FC) into a “nationwide federal force” mandated to operate in all provinces and territories.\n\nSpeaking in the House on a point of public importance, ANP chief Aimal Wali Khan said federal forces already have a presence in all the provinces. He said that the Frontier Corps had its deployment in Balochistan while the FC was for the northwestern Khyber Pakhtunkhwa (KP), to deal with security.\n\nHe wondered as to why the decision has been taken to convert FC into a federal force while the deployment of Rangers in Sindh and Punjab, and the Frontier Corps in Balochistan had not been disturbed.\n\nHe called the move a ‘direct attack of the federation’ on the rights of the people of KP. He demanded the government withdraw the decision and consider the conversion of Pakistan Rangers, Sindh or Punjab, into a federal force if required. “We should not be pushed to the wall,” he remarked.\n\nState Minister for Law and Justice Aqeel Malik in his response said that all four provinces, Gilgit-Baltistan and Azad Jammu and Kashmir altogether form one Pakistan. He said the FC was established by the British in 1915 under a law, which needed change due to ever-evolving and changing security and counterterrorism paradigm.\n\nThe minister said the government had introduced 108 amendments in the British-era Code of Criminal Procedure (CrPC) to bring it on par with the changing needs of time. He said the FC was being upgraded and reorganised to deploy it across the country and to transform it from a localised force into a national internal security agency. “This will not be a normal policing unit or a political policing unit,” he said, adding that its internal security functions include riot controlling, counterterrorism, protection and escort duties.\n\nMr Malik explained the structure of the force, having two divisions namely Security Division, which comprised existing staff and other is ‘Federal Reserve Division’, in which new inductions would be made from across the country. “People from KP would also be inducted in the Reserve Division besides from other federating units,” he said.\n\nDeputy Chairman of Senate Syedaal Khan who was presiding over the session ruled that Interior Minister Mohsin Naqvi should brief the House over the matter in the next sitting on Friday.\n\nCNICs blocked\n\nEarlier, during the question how Min­ister of State for Interior Talal Chaudhry confirmed that as many as 80,847 CNICs had been blocked over suspicion of these having been issued to aliens.\n\nHe said these included 28,645 in KP, 21,893 in Balochistan, 14,076 in Sindh and 13,890 in Punjab. He said majority of CNICs blocked were from KP and Balo­ch­­istan because most of the Afghans resided there. “There is no question of discrimination with any province,” he remarked.\n\nSenator Kamran Murtaza of JUI-F recalled how former Senator Hafiz Handullah’s CNIC had been blocked and said the case was pending with the Supreme Court. He said the CNIC of an MNA has also been blocked.\n\nDanesh Kumar of BAP revealed that CNICs of people from religious minority had also been blocked over the charge of coming from Afghanistan.\n\nPTI Senator Mohsin Aziz while speaking in the House complained his calling attention notices over the closure of utility stores had never been brought on the agenda. The chair then referred the matter to the standing committee concerned.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:34:41.115Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924525/anp-raises-alarm-in-senate-over-fc-transformation",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:30.000Z"
}
