{
  "title": "Pakistan, China reaffirm mutual support in security and agriculture on SCO sidelines - Pakistan - DAWN.COM",
  "author": null,
  "content": "Foreign Minister Ishaq Dar on Wednesday met his Chinese counterpart Wang Yi, where the pair discussed and reaffirmed mutual support in core sectors, including agriculture, mining, industry and security, Chinese media reported.\n\nDar was on a three-day visit to China for the Shanghai Cooperation Organisation’s (SCO) Council of Foreign Ministers meeting in Tianjin on Tuesday. According to the Foreign Office (FO), Dar and Wang were scheduled to meet on the sidelines of the event.\n\nThe Foreign Office (FO) said in a post on X: “The two leaders held wide-ranging discussions on key areas of mutual interest, including the China-Pakistan Economic Corridor (CPEC) and multilateral cooperation.”\n\nAccording to Chinese state-owned broadcaster CGTN, the top diplomats reaffirmed their mutual support on issues concerning each other’s core interests.\n\n“China is ready to work with Pakistan to implement the important consensus reached by the leaders of the two countries, and push forward the building of a China-Pakistan community with a shared future,” said Wang.\n\n“China will strengthen strategic dialogue with Pakistan, jointly build [CPEC] with high quality, deepen cooperation in fields such as agriculture, industry and mining, and plan celebratory events marking the 75th anniversary of the establishment of diplomatic relations next year.”\n\nWang also echoed China’s concerns about the safety of Chinese nationals working in Pakistan, but stated that Beijing supported Pakistan’s efforts in counter-terrorism and “expressed belief that Pakistan will continue to ensure the safety of Chinese personnel, projects and institutions”.\n\nMeanwhile, the FO said in its post on X that Dar congratulated Wang on successfully hosting the meeting and conveyed his gratitude to the Chinese government for its hospitality.\n\n“It was a pleasure to engage in meaningful discussions with my counterparts on the sidelines of the SCO Council of Foreign Ministers, covering a broad spectrum of regional and multilateral issues of shared interest,” Dar said in a post on his own X account.\n\n“Pakistan fully supports China’s preparations for the Shanghai Cooperation Organisation Tianjin Summit and looks forward to further deepening the all-round cooperation between the two sides,” Dar said, according to CGTN, adding that he pledged efforts to ensure the safety of Chinese personnel and institutions in Pakistan.\n\n“Pakistan adheres to the one-China principle and supports China on issues concerning its core interests,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1617073123a2d04.jpg",
  "retrievedAt": "2025-08-17T20:32:37.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924595/pakistan-china-reaffirm-mutual-support-in-security-and-agriculture-on-sco-sidelines",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T12:17:17.000Z"
}
