{
  "title": "UK lifts ban on Pakistani airlines, removes country from Air Safety List - Pakistan - DAWN.COM",
  "author": null,
  "content": "The United Kingdom on Wednesday removed Pakistan from its Air Safety List, thereby allowing Pakistani airlines to now apply to operate flights to the UK, according to a statement from the British High Commission in Islamabad.\n\nDebt-ridden Pakistan International Airlines (PIA) was banned from flying to the European Union, UK and the United States in June 2020, a month after one of its Airbus A-320s plunged into Karachi’s Model Colony, killing nearly 100 people. The ban on operating to Europe was lifted in November last year.\n\nToday’s development comes after a team from the UK Department for Transport concluded an aviation security ins­pection at Islamabad Inter­nat­ional Airport on Thursday, declaring Pakistan’s security arrangements “satisfactory and in line with international standards”.\n\n“Following air safety improvements, the UK’s Air Safety Committee has lifted UK restrictions on Pakistani carriers,” said a statement from the British High Commission.\n\n“Individual airline carriers will still need to apply for permits to operate to the UK through the UK Civil Aviation Authority.”\n\nBritish High Commissioner Jane Marriott was quoted as saying: “I’m grateful to aviation experts in the UK and Pakistan for their collaborative work to drive improvements to meet international safety standards.\n\n“While it will take time for flights to resume, once the logistics are in place, I look forward to using a Pakistani carrier when visiting family and friends.”\n\nIn a post on X, Marriott called the approval “an important step, and a testament” to PIA’s air safety improvements.\n\nDecisions on de-listing states and air carriers from the UK Air Safety List are made through an independent aviation safety process, according to the statement.\n\n“This is overseen by the UK’s Air Safety Committee, who have [sic] been closely engaging with the Pakistan Civil Aviation Authority over several years.\n\n“The committee has judged that necessary safety improvements have been made since its original decision in 2021. Therefore, based on this independent and technically-driven process, it has decided to remove Pakistan and its air carriers from the list.”\n\nPIA said it was all set to resume flights to the UK now.\n\n“It became possible after adherence to the most stringent flight safety standards, reviewed by the UK’s Air Safety Committee.”\n\nPrime Minister Shehbaz Sharif hailed the move, saying it will provide “ease in travel between the UK and Pakistan will help this vital trade relationship grow manifold”.\n\n“With over 1.6 million people of Pakistani heritage living in the UK and thousands of British nationals in Pakistan, today’s announcement brings long-awaited relief and new opportunities for families and friends to reunite,” he wrote on X.\n\nDeputy PM and Foreign Minister Ishaq Dar said the government had made concerted diplomatic efforts, in addition to technical and regulatory compliances, with the UK authorities on the matter to ensure the earliest possible lifting of the ban.\n\nReacting to today’s development, Aviation Minister Khawaja Asif commended the government led by his party for “crossing another milestone”. “Three years of continuous hard work have borne fruit,” he said on X.\n\n“The green crescent flag is once again soaring proudly in the skies,” Asif added, commending his aviation ministry for its efforts.\n\nIn a press conference in Islamabad, Asif said the aviation ministry would now apply for licences to restore routes to Britain.\n\nThe minister said Airblue had also been removed from the safety list: “According to my knowledge, they have allowed not just PIA but also Airblue.”\n\nAsif affirmed that the government was making efforts to resume New York flights.\n\nThe move adds to another positive development, with the UK government yesterday launching e-visas for Pakistani students and workers as part of an “enhanced” border and immigration system.\n\nA day prior to that, the two countries formally signed the Trade Dialogue Mechanism Agreement and decided to establish the UK-Pakistan Business Advisory Council to institutionalise bilateral economic cooperation.\n\nAsif hailed the removal of Pakistani airlines from UK’s Air Safety list, but stressed the need for fixing responsibility for the loss caused to the national carrier.\n\nAddressing a press conference in Islamabad, Asif strongly criticised the PTI government for the fiasco and reputational damage caused to PIA, which he called a “crime against state”.\n\nHe pinned the responsibility on former prime minister Imran Khan and then-aviation minister Ghulam Sarwar Khan, who had stated in the National Assembly after the 2020 crash that almost 40 per cent of the country’s pilots had fake licenses.\n\nThe minister called on the government to pursue whoever was responsible for this loss, as the nation’s image was affected and a negative impression was created about the national airline and its pilots.\n\n“Imran Khan and Ghulam Sarwar turned PIA into a graveyard,” Asif quipped.\n\nIn reply to a question, he said Sarwar’s speech was “enough to fix responsibility” as the national flag carrier’s image was affected. He suggested that the prime minister could order an enquiry to conduct an investigation and hold individuals accountable.\n\nThe minister noted that PIA suffered a drop in business, planes became dysfunctional and the pilots’ reputation was tarnished. He highlighted that overseas Pakistanis used the airline due to cheaper and direct routes.\n\nAsif hailed the civil aviation regulator and ministry officials for the “historic” day, saying that the decision has restored confidence in the national airline and aviation industry. He also thanked the UK and EU regulators for their guidance to plug loopholes and meet international standards.\n\nThe next step was privatising PIA, Asif noted, adding that the restoration of routes will assist the process as the government will receive a higher bid price. He asserted that the private sector would be able to revive the airline with higher investment, induct a new fleet and open new routes.\n\nSpeaking on Geo News programme ‘Aaj Shahzeb Khanzada Ke Saath’ later, Asif expressed hope that by September, Pakistani flag carriers would fly to the United States as well.\n\n“God willing, in September, regulators are coming from the US,” Asif said. “We are hoping our flights will start going there and we will start talks soon. Hopefully, they will be successful.”\n\nRecalling the Pakistan Democratic Movement-led government’s pursuit of resuming the services of Pakistani flag carriers, the minister said that the foundation for PIA’s revival was laid by then-railway minister Khawaja Saad Rafique.\n\n“Our regulator put in great efforts,” Asif said. “It was his competence, his international reputation and his contacts that made all of this possible.”\n\nAsif expressed hope that PIA flights to the UK would be resumed by August 14.\n\n“This is a success for our aviation industry as a whole,” he said. “Opening the aviation sector in Europe and the UK to us is a cause for happiness.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/16152147f270710.jpg",
  "retrievedAt": "2025-08-17T20:32:53.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924570/uk-lifts-ban-on-pakistani-airlines-removes-country-from-air-safety-list",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T09:32:55.000Z"
}
