{
  "title": "US asks Israel to stop attacks on Syrian troops in Druze region - World - DAWN.COM",
  "author": null,
  "content": "SWEIDA: Israel carried out strikes against Syrian government forces in southwestern Syria for a second day on Tuesday, vowing to keep the area demilitarised and to protect the Druze minority as deadly clashes continued in the region at the Israeli frontier.\n\nMeanwhile, the administration of President Donald Trump has asked Israel to stop its strikes on Syrian military forces, Axios reported on Tuesday, citing a US official.\n\nIsrael told the Americans that it would cease the attacks on Tuesday evening, Axios added, citing the official.\n\nA reporter said they heard drones and at least four strikes over the predominantly Druze city of Sweida, and saw a damaged tank being towed away. Bursts of gunfire were heard and three bodies were seen on the ground. Dozens of people have been killed in fighting in the region since Sunday.\n\nThe surge in violence underlines the challenges facing interim President Ahmed al-Sharaa, who has struggled to assert control over the area near the Israeli border since toppling Bashar al-Assad in December.\n\nWhile Sharaa has been buoyed by rapidly improving ties with US President Donald Trump’s administration, the violence has highlighted lingering sectarian tensions and distrust among minority groups towards his government — distrust that was deepened by mass killings of Alawites in March.\n\nSyria’s foreign ministry said it held Israel fully responsible for the attack and its consequences, vowing to protect all citizens, including the Druze. Syria’s presidency said the country would take legal action against “anyone proven to have committed violations or abuses, regardless of their rank or position”. US Syria envoy Tom Barrack said the United States was in contact with all sides “to navigate towards calm and integration”.\n\nIsrael, which has struck Syria several times in the name of protecting the Druze, carried out its latest strikes after influential Druze Sheikh Hikmat al-Hajri issued a statement accusing government troops of breaching a ceasefire and urging fighters to confront what he described as a barbaric attack.\n\nAfter al-Hajri appeared in a recorded statement, Syrian Defence Minister Murhaf Abu Qasra declared that a complete ceasefire was in place, and said government forces would only open fire if fired upon.\n\nAbu Qasra also said that military police had been ordered to deploy in Sweida to “control military behaviour and hold violators accountable”, state news agency SANA reported. The reporter saw men in fatigues burning and looting homes and shops, and setting fire to a store that sold alcohol.\n\nIsraeli Prime Minister Benjamin Netanyahu and Defence Minister Israel Katz said they had ordered Israel’s military to strike “regime forces” and weaponry brought to Sweida to be used against the Druze.\n\nIn a statement, they said the deployment of government forces was in violation of a demilitarisation policy that had called on Damascus to refrain from bringing forces and weapons that pose a threat to Israel into southern Syria.\n\n“Israel is committed to preventing harm to the Druze in Syria due to the deep brotherhood alliance with our Druze citizens in Israel,” they said. “We are acting to prevent the Syrian regime from harming them and to ensure the demilitarisation of the area adjacent to our border with Syria.\n\nThe latest violence in southwestern Syria began on Sunday with clashes between armed Druze groups and Bedouin fighters in Sweida.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/687584235c591.gif",
  "retrievedAt": "2025-08-17T20:34:07.212Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924515/us-asks-israel-to-stop-attacks-on-syrian-troops-in-druze-region",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:51.000Z"
}
