{
  "title": "Trump, White House race to stem Epstein conspiracy fallout - World - DAWN.COM",
  "author": null,
  "content": "For years, United States President Donald Trump and his Republican allies benefited from conspiracy theories that fuelled the conservative MAGA (Make America Great Again) movement and targeted his political enemies.\n\nNow the persisting furore over files related to accused sex trafficker Jeffrey Epstein has forced Trump into an unfamiliar role: trying to shut a conspiracy theory down.\n\nEpstein, a wealthy financier and convicted sex offender, was facing federal charges of sex trafficking minors when he died by suicide in jail in 2019. He had pleaded not guilty, and the case was dismissed after his death.\n\nThe saga burst back into the news last week after the Trump administration reversed course on its pledge to release documents it had suggested would reveal major revelations about Epstein and his alleged clientele. That reversal has enraged some of Trump’s most loyal followers.\n\nTo contain the fallout, Trump and White House officials are weighing a range of options, including unsealing new documents, appointing a special prosecutor and drafting executive actions on issues such as pedophilia, according to two White House sources with knowledge of the matter.\n\nTrump and senior aides have also reached out to key MAGA-aligned influencers, urging them to dial down their criticism of the administration’s handling of the Epstein investigation and shift focus to broader priorities for the America First movement, one source said.\n\nThe backlash over the Epstein case has laid bare tensions inside Trump’s coalition and is testing one of Trump’s most enduring political strengths: his ability to command loyalty and control the narrative across the right.\n\nThe outcry comes amid discontent among parts of Trump’s base over the US strikes on Iran, continued involvement in Ukraine and any hint of backsliding on the administration’s hardline immigration promises.\n\nThe two sources said the intra-party friction was damaging to the coalition and that the White House was actively trying to restore unity, though they did not expect the Epstein controversy to dent Trump’s core support.\n\nMany conservative influencers and hard-right media figures remain unconvinced by a Justice Department memo last week that concluded there was “no incriminating client list” or any evidence that Epstein may have blackmailed prominent people.\n\nThe review also confirmed prior findings by the FBI that concluded that Epstein killed himself in his jail cell while awaiting trial, and that his death was not the result of a criminal act such as murder.\n\nTrump knew Epstein socially in the 1990s and early 2000s. During the 2021 trial of Epstein’s associate Ghislaine Maxwell, the financier’s longtime pilot, Lawrence Visoski, testified that Trump flew on Epstein’s private plane multiple times.\n\nTrump has denied ever being on the plane and has not been accused of any wrongdoing.\n\nThat history now complicates Trump’s response, as he works to reassure a base steeped in long-running suspicions about Epstein and his connection to influential figures.\n\nTrump has defended Attorney General Pam Bondi against calls for her firing by some MAGA personalities. He has urged his supporters to move on from the Epstein saga.\n\n“I don’t understand why the Jeffrey Epstein case is of interest to anybody,” Trump told reporters on Tuesday. “It’s pretty boring stuff. It’s sordid, but it’s boring, and I don’t understand why it keeps going.”\n\nBoth White House sources said there were mistakes in how information about the Epstein files was shared with pro-Trump influencers, especially by Bondi, who had previously implied that a list of Epstein’s clients existed.\n\nThe Justice Department did not respond to a request for comment, and Bondi did not answer questions on Tuesday about Trump’s comments on the Epstein files at a press conference.\n\nWhen asked if she expected to keep her job, she said, “I am going to be here for as long as the president wants me here — and I believe he’s made that crystal clear.”\n\nIn a statement on Tuesday, the White House said Trump’s law-and-order team remains focused on “Making America Safe Again” and “restoring the integrity of our criminal justice system”.\n\nWhile some prominent voices outside the administration are falling back in line, others are not.\n\nCharlie Kirk, a key MAGA influencer who had amplified doubts about the Epstein probe, abruptly reversed course after a call with Trump, one of the sources said. On Monday, Kirk posted on social-media platform X: “I’m done talking about Epstein. I’m gonna trust my friends in the government.”\n\nTrump’s call for critics to back off is not landing everywhere.\n\nPodcast hosts, including Joe Rogan, Theo Von and Tim Dillon, whose large audiences are not necessarily pro-Trump but broadly anti-establishment and helped propel his election victory, are unlikely to let up, according to Angelo Carusone, president of the progressive nonprofit watchdog group Media Matters for America.\n\n“Trump seems very disconnected from the zeitgeist that put him into power in the first place,” Carusone said.\n\nSome of Trump’s staunchest political allies are also keeping the pressure on. House Republicans, including Speaker Mike Johnson, called on Tuesday for the Justice Department to release more Epstein documents.\n\nRepresentative Lauren Boebert, a hardline MAGA supporter, made her own demand on X: “We deserve the truth about the Epstein files. I’m ready for a Special Counsel to handle this.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/16225248943bedb.jpg",
  "retrievedAt": "2025-08-17T20:32:22.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924612/trump-white-house-race-to-stem-epstein-conspiracy-fallout",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T18:25:18.000Z"
}
