{
  "title": "LSM expands 2.29pc in May - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Large-Scale Manufacturing (LSM) sector posted a modest growth of 2.29 per cent in May compared to the same month last year, according to data released by the Pakistan Bureau of Statistics on Tuesday.\n\nThis marks the third consecutive month of positive growth, attributed largely to a significant cut in the key interest rate to 11pc. The LSM sector showed positive growth from December 2023 to May 2024 but slipped back into negative territory in June 2024. On a year-on-year basis, LSM declined by 2.65pc in August, followed by a 1.92pc drop in September.\n\nIt registered a marginal growth of 0.02pc in October before contracting again by 3.81pc in November, 3.73pc in December, 1.21pc in January and 3.51pc in February. A slight recovery was noted in March, with production increasing by 1.79pc.\n\nOn a month-on-month basis, LSM showed a significant growth of 7.93pc in May.\n\nThe LSM sector recorded a negative growth of 1.21pc during the first 11 months of the current fiscal year compared to the same period last year. In FY24, LSM contracted by 0.03pc against a 0.92pc growth in the preceding year.\n\nThe food group declined by 2.32pc in 11MFY25 on a YoY basis. Wheat and rice milling rose by 5.96pc and starch and its products by 0.76pc, primarily due to better crop harvests. However, production of vegetable ghee declined by 1.06pc, tea blended by 3.75pc and cooking oil by 0.02pc.\n\nThe textile sector grew by 2.79pc in 11MFY25 on a YoY. Cotton yarn production increased by 8.22pc and cotton cloth by 0.72pc. These two categories make up more than 80pc of the textile sector.\n\nGarment exports recorded a 5.20pc growth on a YoY basis, largely because foreign buyers diverted orders from Bangladesh to Pakistan.\n\nCoke and petroleum products grew by 4.74pc in 11MFY25. Petrol production rose by 2pc, high-speed diesel by 9.65pc and kerosene by 25.90pc. However, LPG production declined by 2.18pc and jet fuel oil by 10.62pc. The automobile sector registered a significant growth of 43.94pc in 11MFY25 on a YoY basis. This was driven by a 39.35pc increase in jeeps and cars, followed by 173.95pc growth in LCVs, 100.04pc in trucks and 72.63pc in buses.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/180951183aa77b4.jpg?r=095221",
  "retrievedAt": "2025-08-17T20:34:19.184Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924503/lsm-expands-229pc-in-may",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:38.000Z"
}
