{
  "title": "Who are the Druze and what is happening in Syria’s Sweida? - World - DAWN.COM",
  "author": null,
  "content": "In Syria’s Druze-majority city of Sweida, residents said they have been living in terror since the arrival of government forces who have been carrying out what witnesses and a war monitor have called summary executions.\n\nSyrian government forces entered the majority-Druze city of Sweida on Tuesday with the stated aim of overseeing a ceasefire agreed with Druze community leaders following days of fighting with local Bedouin tribes.\n\nSyria’s Druze community follows a religion derived from Islam and is part of a minority group that also has members in Lebanon, Israel, and the Israeli-occupied Golan Heights.\n\nIn Syria, the community is concentrated in the Sweida region bordering Jordan, in areas adjoining the Israeli-occupied Golan, and in Damascus’ Jaramana suburb.\n\nEchoing arrangements for the Alawites, French colonial authorities established a state called Jabal al-Druze centred on Sweida until 1936.\n\nAfter Syria’s civil war erupted in 2011, Druze held protests against Assad but were spared most of the mass violence that unfolded elsewhere in the country. They faced periodic attacks from other groups, including from President Ahmed al-Sharaa’s Hayat Tahrir Al Sham and other militants who regard their sect as heretical.\n\nThe Druze maintain a degree of secrecy about the practice of their faith that emerged in the 11th century and incorporates elements from Islam and other philosophies, emphasising monotheism, reincarnation and the pursuit of truth.\n\nFriction between Druze and Syria’s new authorities has broken out into fighting several times this year, notably in Jaramana and Suweida. Israel has intervened with airstrikes against Syrian government forces during the clashes with the stated aim of protecting the Druze.\n\n“A lot of my friends were killed, including a doctor who was going to the hospital,” said Osama, 32, by telephone on Wednesday, adding he was in the centre of the southern city.\n\n“There were summary executions in the streets,” he told AFP, crying, declining to provide his surname.\n\n“If they reach here, I’m dead,” he said, adding: “I fear massacres similar to those on the coast.”\n\nParamedic Munzer, 43, said he was stuck at home in Sweida, unable to respond to calls for help.\n\n“Entire families have been decimated. I know a family of four who were killed in their home,” he said.\n\n“The bombardment didn’t stop all night,” said Munzer, also declining to provide his surname. “We have nothing left to eat in the fridge, just some dry biscuits, and some fruit and vegetables that have gone bad because the power has been cut off for 48 hours.\n\n“I have four children, but I don’t know how to protect them.”\n\nBut the hardest thing, according to Munzer, is being unable to do his job as a paramedic.\n\nHe said he had received more than 50 calls for help and was worried about the “catastrophic situation” in the city’s main hospital, where he usually works.\n\nAn AFP correspondent in the city saw men wearing defence ministry uniforms, some with their faces covered, launching mortars near the bodies of two Druze fighters, as other combatants went house to house carrying out searches.\n\nThe city of some 150,000 residents was deserted, and shops were closed.\n\nAnother AFP correspondent saw on Wednesday some 30 bodies on the ground, including government forces and fighters in civilian clothes whose affiliation was not immediately clear.\n\nAccording to the Syrian Observatory for Human Rights monitor, more than 300 people have been killed since fighting erupted on Sunday between Druze fighters and Bedouin tribes, sparking government intervention, and Israeli strikes in support of the Druze.\n\nMost of the dead are fighters, but they also include 40 civilians, 27 of them summarily executed by security force personnel, according to the Britain-based Observatory, which relies on a network of sources inside Syria.\n\nThe Syrian presidency on Wednesday condemned “heinous acts” and vowed to punish those responsible.\n\nA committee tasked to investigate the coastal massacres in March was supposed to issue its findings earlier this month, but no report has been announced.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/16230341d15a6df.jpg",
  "retrievedAt": "2025-08-17T20:32:24.010Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924613/who-are-the-druze-and-what-is-happening-in-syrias-sweida",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T18:40:16.000Z"
}
