{
  "title": "Rawalpindi’s Leh Nullah narrowed by illegal dumping despite hefty dredging funds - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Despite the Punjab government spending millions of rupees each year to clear Leh Nullah ahead of the monsoon season, local administration continues to ignore rampant encroachments along its banks.\n\nOne particular example is behind the Ganjmandi police station, where construction waste is being dumped to create makeshift parking for trucks, raising serious flood risks.\n\nBecause of the encroachments, the width of the nullah has reduced to a few metres, increasing the threat of flooding in case of heavy rains.\n\nThe government allocated Rs150 million — Rs80 million for the cleanliness of Leh Nullah and Rs70 million for 11 other nullahs in the garrison city — ahead of the monsoon season. However, this appears to be going to waste due to persistent encroachments along the nullah’s banks.\n\nWasa asks RMC to remove unauthorised truck parking at Ganjmandi; residents say narrowing of nullah could cause water level to rise\n\nLeh Nullah, which passes through the city’s downtown areas, swells during monsoon, putting public life and property at risk.\n\nThe over 30km nullah starts from the foot of Margalla Hills in Islamabad and discharges into Soan River near the Lahore High Court Rawalpindi bench.\n\nA devastating flood in the nullah on July 23, 2001, swept away 35 people along with many slums and properties, inflicting a loss of millions of rupees.\n\nMohammad Tauheed, a local resident, said the narrowing of the nullah had left people spending sleepless nights, fearing that even moderate rainfall could cause the water level in Leh to rise dangerously.\n\nSuhail Raja, a resident of Ganjmandi, said the district administration had turned a blind eye to the dumping of construction material on the banks of Leh Nullah. He said parking of trucks for the last four years had created mess for the residents.\n\nJamaat-i-Islami (JI) senior leader Raza Shah said the government should take action against those encroaching land along Leh Nullah and other drains.\n\n“The width of Leh Nullah is reducing and instead of planting trees along its banks, parking areas are being created which is adding to the potential threat of flooding,” he said.\n\nApart from this, he said, RMC covered the main drains in Sadiqabad, Arya Mohallah, Naya Mohallah and other areas, creating mess as there was no proper cleaning throughout the year. When the water level increases in the nullah, it enters houses through sewage lines.\n\nA senior PML-N leader, speaking on condition of anonymity, told Dawn that the width of Leh Nullah had significantly narrowed at several points, including Dhoke Dalal, Dhoke Naju, Pirwadhai, and Ganjmandi. He warned that this would undermine the provincial government’s efforts to protect the city from flooding.\n\nWater and Sanitation Agency (Wasa) also wrote a letter to Rawalpindi Municipal Corporation (RMC) about the illegal parking at Ganjmandi and demanded to remove it.\n\nThe letter stated: “WASA, Rawalpindi has completed first cycle of dredging/desilting of Lai Nullah and its 15 tributaries in order to restore the flood carrying capacity of major drainage system of Rawalpindi city to prevent any untoward situation during Monsoon season 2025. However, extensive solid waste and building debris have been illegally dumped along banks of Leh Nullah, particularly on its both sides at Gawalmandi, Pirwadhai and Ganjmandi bridges.\n\nMoreover, at Ganjmandi bridge illegal dumping is being deliberately done to dispose of the building materials to facilitate illegal parking of trucks/ HTV vehicles which also hinder WASA desilting activities to remove this illegal dumping. Moreover, these solid waste and dumping materials flow down into Leh nullah bed during rainfall runoff and WASA have to clear these pockets after every rainfall. Illegal cattle sheds also exist at various points on the banks of Leh Nullah.“\n\nCommissioner Aamer Khattak said a zero tolerance policy had been adopted for encroachments on the instructions of the chief minister. He directed the municipal corporation to ensure continuity of operations to remove hurdles along the nullah.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6876d6d47301b.jpg",
  "retrievedAt": "2025-08-17T20:33:31.784Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924419/rawalpindis-leh-nullah-narrowed-by-illegal-dumping-despite-hefty-dredging-funds",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:50:10.000Z"
}
