{
  "title": "ECP hands PML-N another seat in KP Assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Party now has the same number of seats as JUI-F, making it eligible for another reserved seat\n• ECP allows PML-N to count independent ‘notified’ later among its tally, rejects similar plea from PTI-P\n• ANP also denied relief, told allocation is calculated on basis of general seats, not by-election\n\nISLAMABAD: The Election Commission of Pakistan has decided to allow the PML-N to retain a general assembly seat while rejecting a similar request by the PTI-Parliamentarians, saying it was not supported by the law.\n\nIn its decision on a case about the allocation of reserved seats in the Khyber Pakhtunkhwa Assembly, announced on Tuesday, the commission provided relief to the ruling party that had sought a greater share in the KP Assembly reserved seats on the basis of the additional general seat handed to the PML-N, which was initially declared to be held by an independent candidate.\n\nThe announcement followed a Peshawar High Court order, asking the ECP to redistribute reserved seats in the provincial assembly. With the addition of one more seat, the PML-N is eligible for an extra reserved seat in the KP Assembly and holds the same number of seats as the Jamiat Ulema-i-Islam (JUI-F).\n\nAfter the PML-N received the general seat, the ruling party and the JUI-F hold the same number of seats in the KP Assembly, and the former is entitled to get at least one more reserved seat in the provincial assembly.\n\nThe ECP had determined the quota of reserved seats for women and non-Muslims on the basis of party position as it stood on Feb 22 — the legal deadline for the issuance of victory notifications.\n\nIn its decision, the commission accepted the plea that Malik Tariq Awan — an independent candidate — who joined the PML-N a day after the allocation of reserved seats did not get three days to join a political party. Interestingly, a similar plea by the PTI-Parliamentarians has been rejected by the ECP.\n\nThe ECP order referred to proviso of Article 51(6)(e), read with Article 106 of the Constitution, which provides that the calculation of quota for the reserved seats shall be made on the basis of total number of general seats won by political party, which shall include the independent returned candidate or candidates who may duly join such political party within three days of the publication in official gazette.\n\nMr Awan was declared an independent returned candidate on Feb 22, 2024. The commission, after the passage of around one and a half years, now reached the conclusion that Mr Awan joined the PML-N on Feb 23, which was within three days of the victory notification.\n\nThe commission held that he was eligible to be considered as a member of for an additional seat on the basis of the same grounds was rejected by the ECP. The ECP order conceded that PTI-P won two KP Assembly general seats in the Feb polls, but it could not recalculate the reserved seats at the request of the party because it would be an ‘unending process’ if such a request was entertained.\n\nThe order said that at the time of calculation of quota, one seat was duly notified for PTI-P from PK-73 (Peshawar-III). Subsequently, another candidate of the said party from PK-103 was notified on Feb 27 after the calculation and allocation of reserved seats to the political parties.\n\nWithout explaining if the commission can punish a political party for belated issuance of a victory notification, the ECP said recalculation of quota for reserved seats for women and non-Muslims at belated stage after allocation of reserved seats to the political parties was not supported by the Constitution and law.\n\n“The rationale for calculation of quota for the reserved seats on the basis of party position on 22-02-2024 was to avoid unending controversies. For example, if a political party succeeds in getting more seats as a result of recounting or by-election or decision of the tribunal, the quota will be revised again and again and it will be an unending process which is against the spirit of Constitution and Law as enshrined in Articles 51(6) & 106 of the Constitution and Section 98 & 104 of the Elections Act, 2017 and Rule 92 of the Election Rules, 2017,” it noted, while dismissing PTI-P’s plea for another reserved seat.\n\nThe commission directed the office to take follow-up action in light of the order and submit the case to the commission accordingly.\n\nANP by-election seat\n\nMeanwhile, the Awami National Party (ANP) had secured one general seat from PK-75 Peshawar-IV during the General Elections 2024, which was notified on Feb 22. Subsequently, the ANP secured another seat from PK-22 Bajaur-IV, held on July 11, and the returned candidate was notified on July 25.\n\nThe order said in accordance with the Constitution and applicable legal provisions, the quota for allocation of reserved seats is calculated on the basis of general seats and not on the basis of subsequent by-elections.\n\n“Results of by-elections cannot be included as it is not the spirit of Constitution provided under Article 224(2) of the Constitution read with Section 98 of the Elections Act, 2017.\n\nIn case, this petition is accepted it will be un-ending processes which will result recalculation/fluctuation of seats from time to time after each and every by-election or decision of the tribunal,“ the commission observed while rejecting ANP’s plea for another seat.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:35:11.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924448/ecp-hands-pml-n-another-seat-in-kp-assembly",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:16.000Z"
}
