{
  "title": "Imran prohibits PTI members from going public with party’s internal matters - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI founder Imran Khan has prohibited his party members from publicly discussing the party’s internal matters, according to his conversation with his family and lawyers at Adiala Jail shared on his official X account on Wednesday.\n\nOn Sunday, Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur seemed to throw a wrench in the works of a nationwide protest, annou­nced by Imran, which is expected to climax on August 5, marking two years of the former prime minister’s imprisonment.\n\nAt a press conference on Sunday, where party leaders were expected to announce the plan for this protest, CM Gandapur caused confusion when he came up with a new 90-day timeline for what he called ‘a final push’, with PTI Punjab chief organiser Aliya Hamza Malik later expressing her reservations over this announcement.\n\n“Publicly airing internal matters or individual concerns before the media is entirely unacceptable,” Imran’s post read.\n\n“My instruction is firm: whether a senior officeholder or a junior member, no one is to express internal differences on social media, electronic media, print media, or any other platform,” he added.\n\n“At this time, many, including myself, are enduring some of the harshest imprisonments. Therefore, I direct every member of the party to put aside all personal grievances,” Imran continued.\n\nHe called upon the party to focus exclusively on the protest movement so that fundamental human rights are restored in Pakistan.\n\n“If any party official fails to participate in this movement, I will make the final decision about them myself, even from within jail.”\n\nMalik was conspicuous by her absence at the press conference by KP CM Gandapur. While PTI Secretary General Salman Akram Raja explained that she was “busy”, she questioned this claim in a subsequent tweet.\n\n“What strategy has been announced for the release of Imran Khan, how and where the protest campaign will begin? Who replaced the Aug 5 plan with 90 days?”\n\n“I myself do not know where I was busy for the past two days,” she said, in a jibe at Raja.\n\nThe dec­ision of the Supreme Court’s Constitutional Bench on the reserved seats dealt a serious blow to the PTI, which is already emb­roiled in numerous challenges, including internal disunity.\n\nBackground briefings revealed a complete lack of trust among PTI leaders, with doubts about each other’s sincerity and intentions, particularly regarding Imran’s messages.\n\nEarlier in June, as the KP government passed the budget for the upcoming financial year without the approval of the PTI founder, his sister Aleema Khan claimed that a “minus Imran” formula was now in effect.\n\nSpeaking to the media, Aleema had said that if KP CM Gandapur lacked the courage to stand his ground, he should have resigned.\n\nLater, she clarified that she meant that the government, not his party, was trying to isolate her brother.\n\n“Minus Imran Khan, is the government trying to minus him. Is it not minusing that they imprisoned him?” she had said.\n\nMany senior party members believed that the party was facing a crisis-like situation due to a “communication gap” and the leadership’s failure to hold regular meetings with the jailed leader.\n\nAnother senior leader suggested that Aleema Khan’s statement was emotional and provided an opportunity for Punjab Chief Minister Maryam Nawaz to criticise the party.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/140806187027028.png?r=080717",
  "retrievedAt": "2025-08-17T20:32:31.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924606/imran-prohibits-pti-members-from-going-public-with-partys-internal-matters",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T16:04:17.000Z"
}
