{
  "title": "Govt challenges IHC ruling on Aafia petition in Supreme Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The federal government on Tuesday approached the Supreme Court, seeking to overturn the May 16, 2025, order of the Islamabad High Court that allowed amendments to a previously settled petition concerning Dr Aafia Siddiqui — nearly a decade after its filing.\n\nIn its fresh appeal, the government argued that the IHC’s directive to amend the pleadings in a petition filed by her sister Dr Fowzia Siddiqui amounted to judicial overreach and undermined the finality of concluded litigation.\n\nDr Aafia Siddiqui, a neuroscientist and educator, was convicted by the United States District Court for the Southern District of New York and has been serving her sentence at the Federal Medical Centre (FMC) Carswell in the US since 2010.\n\nDr Fowzia had filed the petition in the IHC expressing concerns for her sister’s life, safety and physical and mental well-being, citing a lack of consistent and reliable updates about her condition while in custody.\n\nContends high court’s directive to amend plea amounts to judicial overreach, undermines finality of concluded litigation\n\nThe government maintained that by allowing amendments to the petition, the high court failed to consider the significant legal and foreign policy implications arising from the amended relief — directives which fall within the domain of the executive and implicate Pakistan’s obligations under international law.\n\nIt contended that Dr Fowzia had sought to amend her prayers in the original petition with mala fide intent, solely to keep the petition alive.\n\nIn her amended plea, Dr Fowzia sought a declaration that the government has a constitutional and international obligation to take all necessary measures for her sister’s release and repatriation and to ensure her rights and welfare, including adequate medical care from independent Muslim professionals, to be funded by Pakistan.\n\nThe government argued that the relief now sought had already been addressed when the prime minister, in October 2024, formally wrote to the US president in support of Dr Aafia’s clemency petition.\n\nIt said a high-level state delegation had also been dispatched while the government made serious efforts to negotiate both multilateral and bilateral prisoner transfer treaties with the US, which were declined by the American authorities.\n\nThe petition noted that the IHC had overlooked the applicability of the Vienna Convention on Diplomatic Relations (1961) and the Vienna Convention on Consular Relations (1963) — both of which carry the force of law in Pakistan through the Diplomatic and Consular Privileges Act, 1972.\n\nIt argued that Articles 3 and 41 of the VCDR 1961 prohibit interference in the internal affairs of the receiving state and require compliance with its laws. Similarly, Articles 5 and 36 of the VCCR 1963 stipulate that consular functions must be performed through diplomatic channels in accordance with the host country’s legal framework.\n\nThe government said that Dr Aafia’s clemency petitions had already been rejected twice by US authorities, and any renewed effort, especially through official diplomatic channels, could be seen as unwarranted interference in internal legal processes, potentially harming Pakistan’s bilateral relations and international standing.\n\nThe petition also asserted that the high court gave little weight to the official representations of the state, despite the presumption of institutional responsibility that attaches to such statements.\n\nIt emphasised that the IHC’s jurisdiction under Article 199 of the Constitution is clearly defined and does not extend to the expansive powers vested in the Supreme Court under Article 187 for doing complete justice.\n\nIn exceptional cases involving instituti­o­­nal dysfunction or violations of funda­mental rights, only the Supreme Court may invoke its special jurisdiction under Articles 184(3) and 187 to issue appropriate relief and directives, the government contended.\n\nThese extraordinary powers, it argued, are exclusive to the SC and cannot be exercised by high courts. By exceeding its jurisdiction, the IHC undermined the constitutional framework, warranting the reversal of its May 16 order. Furthermore, Article 175(2) of the Constitution unequivocally states that no court shall exercise jurisdiction unless conferred by the Constitution or law.\n\nThus, the May 16 order is void ab initio, untenable, misplaced, misdirected, unfounded, misconceived, unwarranted, unlawful, illegal, without lawful authority, and a nullity in the eyes of the law, the petition pleaded.\n\nThe government further argued that the high court erred in invoking the doctrine of continuing mandamus to justify the petition’s amendment. It noted that the original relief had already been addressed through tangible measures, including consular access, medical assessments, and diplomatic engagement. In these circumstances, the continued application of the doctrine to prolong the petition amounted to judicial overreach, the petition emphasised.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/2508524404bbe74.jpg?r=085315",
  "retrievedAt": "2025-08-17T20:34:47.542Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924527/govt-challenges-ihc-ruling-on-aafia-petition-in-supreme-court",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:30.000Z"
}
