{
  "title": "Perils of irrationality - Newspaper - DAWN.COM",
  "author": null,
  "content": "AFTER a brief hiatus in the wake of the four-day conflict with India, the government and the opposition are back to a confrontationist path. Pushed to the wall, the PTI now threatens to take to the street once again. Meanwhile, the party’s overseas supporters are approaching international forums to raise a voice against “political repression” in Pakistan.\n\nA US bipartisan congressional committee was due to meet early on Wednesday Pakistan time reportedly to examine “the government of Pakistan’s persecution of opposition political figures and journalists”. Nothing may come out of this hearing that could trouble the present dispensation, but it’s not all well for the hybrid power structure. It’s not that a fractured PTI can bring down the system through street power, yet the heightened political confrontation has once again highlighted the question of legitimacy of the current political setup.\n\nWhile the recent controversial judgment by the Supreme Court on the reserved seats for women and minorities may have given the ruling coalition a comfortable two-thirds majority in parliament, it has further exposed the dubiousness of the entire power structure. Not only has the control of the security establishment strengthened, but democratic space has also shrunk.\n\nThe perception of a compliant judiciary and a tamed press may have provided a semblance of stability, but the falseness of the existing power structure is evident. The latest crackdown on social media platforms is part of the move to stifle freedom of expression. It’s also a sign of weakness of a dispensation that cannot tolerate any kind of dissent. One can understand the desperation of the PTI to take its case to international forums with no judicial and political recourse available at home.\n\nIt may not be justifiable to take the domestic political battle outside and seek support from any other country but unfortunately, this happens when all democratic avenues are closed. Scores of PTI leaders and activists, including former prime minister Imran Khan, are incarcerated allegedly on concocted charges and human rights violations have become the norm. Speculation is rampant that the ruling alliance, with its newfound absolute majority, is planning to bring more changes to the Constitution to establish authoritarian rule. It should be a cause of serious concern for all democratic forces.\n\nAny move to unseat the KP government through engineering would turn the situation extremely volatile.\n\nA government installed in power allegedly through stolen elections doesn’t have any legitimacy. The ruthless use of force by the state to break up even peaceful protests, as witnessed last November in Islamabad, leaves no room for rationality on part of the opposition. The PTI’s call for countrywide protests and the government’s threat to use force to stop it have increased political uncertainty.\n\nThis politics of confrontation is extremely perilous for the country facing multiple external and internal security challenges and with its economy still not out of danger. According to some media reports there is now a move to dislodge the PTI’s government in KP following questionable allocation of reserved seats that has drastically altered the numbers game in the provincial assembly.\n\nAlthough the PTI’s majority in the house remains unassailable despite the party having been deprived of reserved seats, there is some talk about horse trading to buy the support of some provincial ruling party members. Any such move to unseat the PTI government through political engineering would turn the situation in the troubled province extremely volatile. Any undemocratic political change could exacerbate matters in a province already facing resurgence of violent militancy that has already claimed hundreds of lives, most of them soldiers.\n\nWorsening political instability could provide more space to terrorist groups operating from inside the province and across the border. It is a dangerous power game that presents a serious threat to national security. Instead of understanding the gravity of the situation and ending confrontationist politics, the federal government is now reportedly considering restoring the jirga system in the merged tribal districts against the wishes of the provincial government. Any such unconstitutional move would push the province into complete lawlessness.\n\nIt’s not just about KP; there is also a move to unseat some two dozen PTI legislators in the Punjab Assembly on the charge of disrupting the assembly proceedings. One cannot condone any kind of hooliganism by members violating the sanctity of the house. But unfortunately, such scenes of rowdyism have become a norm in our assemblies for long involving every political party while in opposition. Surely it’s important to maintain the sanctity of the house, yet there is no precedent of any member being unseated for disrupting the proceedings of the house. It is hoped sanity would prevail.\n\nWhile the main responsibility for ending political tension and restoring the democratic process mainly lies with the government, the PTI should also lower the political temperature. There is certainly lack of a coherent leadership that could guide the party to a rational path. It may be true that despite adversity the PTI has remained the most popular mass party, but it remains completely rudderless with so many leaders trying to pull the party in different directions.\n\nIt may also be the reason for the party’s failure to effectively mobilise its mass following. The biggest harm to the party has been done by the self-appointed party spokespersons operating from overseas who, through their reckless social media campaign, have also fueled confrontationist politics. Their irresponsible rhetoric has given ammunition to the hybrid rulers to suppress all kinds of dissent.\n\nTheir attacks are not only confined to the ruling alliance but they have also been targeting their own party leaders and lawmakers. Their hope to get American backing has massively damaged the party’s politics. Many of them even campaigned for Donald Trump hoping that he would get Imran Khan released. That did not happen.\n\nThe politics of confrontation and derailing of the democratic process has pushed the country to a serious crisis threatening its unity. The country can only safeguard its sovereignty when its people are free to exercise their democratic rights. Authoritarian rule and unelected forces cannot effectively deal with the serious challenges the country is facing.\n\nThe writer is an author and journalist.\n\nzhussain100@yahoo.com\n\nX: @hidhussain\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6876fb5cd7334.jpg",
  "retrievedAt": "2025-08-17T20:33:17.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924540",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T01:11:05.000Z"
}
