{
  "title": "Israeli action claims 18 lives in Gaza - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: Gaza’s civil defence agency said Israeli forces killed at least 18 people on Tuesday, including two women who were shot near an aid distribution point in the war-ravaged Palestinian territory.\n\nThe Israeli invasion since October 2023 has created dire humanitarian conditions for Gaza’s population of more than two million, displacing most residents at least once and triggering severe shortages of food and other essentials.\n\nThe civil defence agency said on Tuesday that its “crews have transported at least 18 martyrs and dozens of wounded since dawn”, most of them following Israeli air strikes on the northern Gaza Strip.\n\nOne strike hit a tent in Gaza City housing displaced Palestinians, killing six people, according to the civil defence agency. In the southern area of Rafah, two women were killed by Israeli fire near an aid distribution point, the agency said, adding that 13 people were wounded in the incident.\n\nUN says at least 875 Palestinians have been killed near aid sites\n\nThe United Nations said that at least 875 have died trying to access aid in Gaza since late May — when Israel eased a two-month aid blockade — with most killed near sites run by the US- and Israel-backed Gaza Humanitarian Foundation.\n\nOn the outskirts of Gaza City on Tuesday, a footage from Al-Shati refugee camp showed Palestinians searching for survivors through the rubble of a family home hit in a strike that the civil defence said killed five people.\n\nJihad Omar, who was using his bare hands to dig through the concrete ruins, said he was looking for two children. “Every day, we bury children, women and elderly people. Homes collapse on the heads of their residents,” the 48-year-old said.\n\n“Find a solution,” he said. “Let us raise those (children) who remain. We barely have any left.”\n\nHamas meanwhile announced the Israeli “assassination” of a member of its political leadership, Muhammad Faraj al-Ghoul, who once served as a minister in the group’s Gaza government.\n\nIsrael’s military offensive, now in its 22nd month, has killed at least 58,479 Palestinians, mostly civilians, according to the health ministry in Gaza.\n\nKillings near aid sites\n\nThe UN rights office said on Tuesday it had recorded at least 875 killings within the past six weeks at aid points in Gaza run by the US- and Israeli-backed Gaza Humanitarian Foundation and convoys run by other relief groups, including the United Nations.\n\nThe majority of those killed were in the vicinity of Gaza Humanitarian Foundation sites, while the remaining 201 were killed on the routes of other aid convoys.\n\nThe GHF uses private US security and logistics companies to get supplies into Gaza, largely bypassing a UN-led system that Israel alleges has let Hamas-led fighters loot aid shipments intended for civilians. Hamas denies the allegation.\n\nThe GHF, which began distributing food packages in Gaza in late May after Israel lifted an 11-week aid blockade, previously said that such incidents have not occurred on its sites and accused the UN of misinformation, which it denies.\n\nThe GHF did not immediately respond to a request for comment on the latest UN figures.\n\n“The data we have is based on our own information gathering through various reliable sources, including medical human rights and humanitarian organisations,” Thameen Al-Kheetan, a spokesperson for the UN Office of the High Commissioner for Human Rights, told reporters in Geneva.\n\nThe United Nations has called the GHF aid model “inherently unsafe” and a violation of humanitarian impartiality standards.\n\nThe GHF said it had delivered more than 70 million meals to Gaza Palestinians in five weeks, and that other humanitarian groups had “nearly all of their aid looted” by Hamas or criminal gangs.\n\nThe UN Office for the Coordination of Humanitarian Affairs has previously cited instances of violent pillaging of aid, and the UN World Food Programme said last week that most trucks carrying food assistance into Gaza had been intercepted by “hungry civilian communities”.\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:34:00.057Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924513/israeli-action-claims-18-lives-in-gaza",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:51.000Z"
}
