{
  "title": "New survey ordered amid doubts over Sindh’s ‘dangerous’ buildings list - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Saeed Ghani acknowledges possible misclassification of hazardous structures by SBCA\n• Sets up body to conduct province-wide survey\n\nKARACHI: As the dust has barely settled over the questions raised about the Sindh Building Control Authority’s (SBCA) role in the Lyari building tragedy, fresh doubts emerged on Tuesday about the competence, operational mechanisms and professional integrity of the building authority’s officials after Sindh Local Government (LG) Minister Saeed Ghani ordered a fresh province-wide survey of all “dangerous” buildings, acknowledging that some structures may have been “wrongly categorised as hazardous”.\n\nChairing the first meeting of the newly formed committee on hazardous and dilapidated buildings, Mr Ghani emphasised the need for transparency and accuracy in identifying structurally unsafe buildings.\n\n“While numerous buildings have been declared dangerous, there have been complaints suggesting that some designations were incorrect,” a statement issued after the meeting quoted the minister as saying.\n\nTo ensure a thorough and credible survey process, the minister announced that committees, under the supervision of respective deputy commissioners, will oversee district-level inspections. These committees, the statement said, will now include one representative each from the Association of Builders and Developers (Abad), the Pakistan Engineering Council (PEC) and the Pakistan Council of Architects and Town Planners (PCATP).\n\nThe meeting was attended by Additional Chief Secretary for Local Government Sindh Wasim Shamshad, Karachi Mayor Murtaza Wahab, Commissioner Syed Hassan Naqvi, SBCA Director General Shahmeer Bhutto, SBCA Director (Admin) Mushtaq Soomro, Abad Chairman Hassan Bakhshi, Vice Chairman Tariq Azeer, PEC representative Lt (retd) Muhammad Iqbal, PCATP member Suhail Bashir, Engineer Arif Bilgrami, South Deputy Commissioner Javed Latif Khoso and Municipal Commissioner Lyari Hammad N.D. Khan, among others.\n\nJust a day after the collapse of the Lyari building, which claimed 27 lives and left dozens homeless, the Sindh LG minister had addressed an emergency press conference and revealed that 588 buildings across the city had been declared hazardous — 456 of them located in District South, including 107 in Lyari alone.\n\nTuesday’s meeting held detailed discussions regarding the 588 identified dilapidated buildings, including 59 classified as “extremely hazardous”.\n\n“The Karachi commissioner presented an update, revealing that 29 of the 59 critically dangerous buildings have already been vacated and data on their residents compiled. Efforts are ongoing to evacuate the remaining buildings to prevent any potential disasters,” the statement said.\n\nHowever, it added that Mr Ghani had instructed that the revised survey be conducted swiftly, with progress reports to be submitted at the next committee meeting.\n\nThe minister also announced that the Sindh government would provide three months’ rent support to residents displaced from the already vacated 29 buildings and those affected in the Baghdadi area of Lyari. Further recommendations would be made by the committee regarding compensation or other assistance for tenants with pagri rights and owners, the statement added.\n\n“The Sindh government is committed to addressing this longstanding issue with full seriousness and transparency,” Mr Ghani said.\n\n“The committee has been designed to include not just public officials but also stakeholders from the private sector, including architects, planners, and engineers, to provide well-rounded and technically sound recommendations.”\n\nThe committee will formulate both short- and long-term policies to address the resettlement and compensation of affected residents. It will also evaluate whether certain buildings, with minor or moderate maintenance, can be made habitable again, rather than opting for complete evacuations.\n\n“Daily survey reports from district committees will be submitted to the Karachi commissioner, who will consolidate and present the findings at future committee meetings,” the statement said.\n\n“All members reaffirmed their commitment to ensuring that no unjust decisions are made and that every effort will be taken to rehabilitate and protect the rights of residents living in buildings that can be safely repaired. For structures deemed beyond repair, phased evacuations will be planned in consultation with technical experts and stakeholders from both the public and private sectors.”\n\nPublished in Dawn, July 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6876ef37953d9.gif",
  "retrievedAt": "2025-08-17T20:33:45.925Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924493/new-survey-ordered-amid-doubts-over-sindhs-dangerous-buildings-list",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T00:49:58.000Z"
}
