{
  "article_id": "2025-01-13_e9ce4c8c460e69cc4bd7df88778a5b79",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/education-minister-khalid-meets-with-ex-pm-norway/",
    "retrieved_at": "2025-08-27T11:37:16.175Z"
  },
  "metadata": {
    "title": "Education Minister Khalid meets with ex-PM Norway",
    "author": null,
    "date_published": "2025-01-13T11:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 547,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 13 (APP):Federal Minister for Education and Professional Training, Khalid Maqbool Siddiqui on Monday met with a high-level delegation led by former Prime Minister of Norway Kjell Magne Bondevik. The meeting was also attended by Secretary Education Mohyuddin Ahmad Wani and former Member of the Oslo Parliament, Norway, Aamir Javed Sheikh, said a press release. Dr. Khalid Maqbool welcomed the former Prime Minister of Norway Kjell Magne Bondevik. He said that Kjell Magne Bondevik is a friend of Pakistan who has always worked towards helping Pakistan in fighting its challenges. The minister said that the presence of His Excellency internationalized the agenda of the International Conference on Girl's Education. He said that Pakistan is taking the lead for the Islamic countries to tackle the issue of girl's education and Out of School Children in general. Dr Khalid Maqbool said that Pakistan faces a myriad of challenges in the field of education in the wake of climate change. He said that the present government has also declared an educational emergency. He said that currently the Ministry of Education is addressing the issues of access to schools, limited infrastructure, quality of teachers training and nutritional problems of children in collaboration with other ministries. Dr. Khalid said that due to our efforts the percentage of Out of School Children with respect to population is decreasing. He said that to develop and implement targeted interventions a special department called Pakistan Institute of Education has been developed to gather accurate data about challenges being faced by the Education sector of the country. The minister said that to address the cultural impediments of access to education for girls, the International Conference on Girl's Education will be a historic achievement. He said that religious scholars from all over the world supported the cause of girl's education. He said that Pakistan has taken the lead to eradicate the misconception surrounding girl's education in the Islamic countries. Kjell Magne Bondevik said, \"I have always worked towards helping Pakistan in resolving its numerous strategic and internal challenges.\" He said that Pakistan has made history by conducting the International Conference on Girl's Education. He said that Pakistan has huge potential and through proper management of resources all of the issues can be addressed. He praised the efforts of the Ministry for Education and the Federal Minister of Education in championing the cause of promoting girl's education. Secretary Education Mohyuddin Ahmad Wani said that Pakistan has adopted latest techniques and approached to tackle all of the challenges of the education sector. He said that Pakistan is focusing on effective disaster management to protect the educational infrastructure of the country. He said that climate change has presented unique challenges but the Ministry of Education has started targeted interventions to ensure positive outcomes, adding that a special pink bus program was launched in GB and Islamabad to ensure that female students do not have to face logistical issues of access to schools. He also said that a Schools Meals Program has also been launched which will ensure that the stunting issue of children is also addressed. He explained that under the leadership of Prime Minister of Pakistan a special task force on education was also formed which has been a guiding beacon for all of the efforts of the government.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}