{
  "article_id": "2025-01-13_33f45d9814e0984d779fcc4ae10191e9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/delegation-from-jamiyah-singapore-visits-iiui/",
    "retrieved_at": "2025-08-27T11:36:01.032Z"
  },
  "metadata": {
    "title": "Delegation from Jamiyah Singapore visits IIUI",
    "author": null,
    "date_published": "2025-01-13T17:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 355,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 13 (APP):A high-level delegation from Jamiyah Singapore visited the International Islamic University Islamabad (IIUI) to explore avenues for collaboration and mutual growth. The meeting, chaired by the Rector IIUI, Prof. Dr Mukhtar Ahmed, and President IIUI, Dr Ahmed Shuja Syed, served as a platform for productive dialogue on enhancing academic and cultural ties between the two institutions. It was also attuned by Prof. Dr Abdul Raheman, Vice President (A&F) IIUI, Director Generals, Deans and senior officials of the university. The delegation members included Prof. Dr Mohd Hasbi Abu Bakar, President of Jamiyah Singapore, accompanied by his spouse, Mdm. Noraini. Other members included Abdul Malik ABM, Director of International Relations, along with his spouse, Mdm. Noorjehan Isahak. The group also comprised of Mahmud Ahmed, Assistant International Relations; Jufri, Manager of Mass Communication; and Amrul, the photographer. In the meeting, both sides agreed to develop a comprehensive roadmap for joint research initiatives, faculty exchange programs, and collaborative efforts to promote interfaith harmony. The focus of the discussion included greater collaboration in the area of Arabic language acquisition with plans for exchange programs to leverage IIUIas expertise in this field, conducting joint workshops and conferences to enhance academic collaboration, and ensuring a regular exchange of delegations between the two institutions. The President of Jamiyah Singapore emphasized shared goals with IIUI and invited its scholars to a Muslim Festival featuring a Seerah exhibition and cultural activities. The IIUI Rector proposed hosting the next festival jointly in Islamabad to enhance collaboration. The Rector IIUI stressed the importance of creating an enabling environment for youth and reiterated IIUIas dedication to working on joint projects. He also highlighted IIUIas strength in theology, where the university ranks among the top 51-100 globally. During the meeting, the President IIUI provided an overview of the universityas global outlook, highlighting its diverse student body, which comprises individuals from over 40 nationalities, and its dynamic range of faculties. He emphasized IIUIas commitment to interfaith harmony, promoting the Arabic language, and undertaking impactful research. The delegation acknowledged IIUIas vision and expressed eagerness to collaborate on initiatives aimed at strengthening ties and academic exchange between the institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}