{
  "title": "Gilani meets parliamentary leaders of Tajikistan, Georgia in Baku",
  "author": null,
  "content": "ISLAMABAD, Nov 01 (APP): Chairman Senate, Syed Yousaf Raza Gilani, on Saturday held separate meetings with the Chairman of the Assembly of Representatives of Tajikistan, Fazali Idizoda, and Deputy Speaker of the Georgian Parliament, Nino Tsilosani, in Baku to discuss matters of mutual interest.\n\nIn the meeting with the Head of the Assembly of Representatives of Tajikistan, both sides emphasised further strengthening bilateral relations and inter-parliamentary cooperation, said a news release.\n\nBoth leaders underscored that the friendship between Pakistan and Tajikistan is rooted in mutual respect, shared religious values, and common goals of peace, progress, and prosperity.\n\nThe Chairman highlighted the importance of strengthening parliamentary linkages, stating that effective inter-parliamentary cooperation is essential for enhancing mutual trust, improving legislation, and advancing public interest–based policymaking.\n\nBoth leaders also stressed the significance of regular engagement between parliamentary committees and friendship groups so that best practices and expertise can be exchanged to tackle shared challenges such as economic development, environmental sustainability, and governance.\n\nThey expressed satisfaction over the growing cooperation in the defence sector, noting that collaboration in military training, capacity building, and intelligence sharing would contribute to regional peace and stability.\n\nSyed Yousaf Raza Gilani stated that Pakistan and Tajikistan maintain close coordination at international forums, especially the SCO and OIC. He added that both countries should continue joint efforts to enhance regional connectivity, develop infrastructure, address the impacts of climate change, and eliminate extremism.\n\nGilani extended an invitation to his Tajik counterpart to participate in the Inter-Parliamentary Speakers’ Conference (ISC), scheduled to be held in Pakistan from 10–12 November 2025.\n\nHe said the conference would serve as an important platform for dialogue on regional peace, security, and development, and further strengthen inter-parliamentary and intergovernmental cooperation.\n\nDuring the bilateral meeting with Nino Tsilosani, Deputy Speaker of the Parliament of Georgia, Chairman Senate discussed in detail the prospects of enhancing parliamentary cooperation, trade relations, educational and cultural exchanges, and partnerships in diverse fields.\n\nYousaf Raza Gilani stated that Pakistan is keen to further deepen friendly and constructive relations with Georgia.\n\nHe reaffirmed that Pakistan attaches great importance to cooperation with Georgia in economic, educational, cultural, and parliamentary spheres.\n\nHe expressed hope that both countries would continue joint efforts to enhance people-to-people and parliamentary contacts as well as promote economic and trade linkages.\n\nThe Chairman Senate also extended an invitation to the Speaker of Georgia’s Parliament to participate in the upcoming Inter-Parliamentary Speakers’ Conference in Islamabad, being hosted by the Senate of Pakistan from 10–12 November 2025.\n\nHe said the forum would provide a significant platform for promoting peace, development, and parliamentary cooperation.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/1761912423_883-e1762012855228.jpg",
  "retrievedAt": "2025-11-02T00:05:42.739Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-meets-parliamentary-leaders-of-tajikistan-georgia-in-baku/",
  "dateList": "2025-10-30",
  "date_published": "2025-11-01T17:28:36.000Z"
}
