{
  "title": "PM directs maximum punitive action against those responsible for artificial petrol shortage",
  "link": "https://www.app.com.pk/national/pm-directs-maximum-punitive-action-against-those-responsible-for-artificial-petrol-shortage/",
  "date_published": "2020-06-09T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP):Prime Minister Imran Khan while chairing the Federal Cabinet meeting on Tuesday directed that maximum punitive action must be taken against all those responsible for artificial shortage of petrol in the country.\nThe cabinet noted that the Oil and Gas Regulatory Authority (OGRA) and the Petroleum Division had legal authority to physically enter and inspect oil companies storage facilities. It directed the Petroleum Ministry to form joint raiding teams comprising representatives of the Petroleum Division, OGRA, Federal Investigation Agency (FIA) and district administrations, which would inspect all petrol depots/storage, and have all authority to enter any site.\nThe cabinet decided that anyone found involved in hoarding would face full force of law, including arrest and forced release of such stores. Any company found not maintaining the mandatory stocks and supply to its outlets, as per their license, would face punitive actions, including suspension and cancellation of license and heavy fines.\nThe prime minister directed that the Petroleum Division and OGRA to take all actions necessary to ensure regular supplies within 48-72 hours.\nThe Ministry of Energy informed the cabinet that in June 2019 total petrol supplies were 650,000 metric tons while 850,000 metric tons supplies were arranged for June 2020.\nThe cabinet urged the public not to engage in panic buying as the stocks that were being hoarded would be identified and ensured to be available in the market and action taken against hoarders.\nThe prime minister directed the minister for petroleum and OGRA to ensure that every oil marketing company (OMC) maintains 21 days stock to meet its license conditions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:05.300Z"
}
