{
  "title": "PM resolves to take sugar inquiry issue to its logical end",
  "link": "https://www.app.com.pk/national/pm-resolves-to-take-sugar-inquiry-issue-to-its-logical-end/",
  "date_published": "2020-06-09T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP):Prime Minister Imran Khan Tuesday reiterated his strong resolve to safeguard the rights of the people of Pakistan at all costs by taking the issue of sugar inquiry to its logical end.\nChairing the meeting of Federal Cabinet, the prime minister said the Pakistan Tahreek-e-Insaf’s (PTI) government strongly believed in complete transparency and securing rights of the people.\nHe assured that the price of sugar would be brought down at every cost and the public would feel that the government had the sole priority and that was to secure the interest of masses.\n“It is a fight for the people of Pakistan. Anyone found involved in it will face the action,” a press release of the PM Office Media Wing quoted the prime minister as saying.\nThe meeting was apprised about the steps taken on the recommendations of Sugar Inquiry Commission. After the prime minister’s approval, the action was being taken which had three dimensions. The first pertained to punishment and recovery, which entailed further seven different related actions including:-\n– The commission reviewed the issue of subsidy from the year 2014 to 2019 under which a subsidy of Rs 29 billion was given. However, under the prime minister’s direction, the said issue was referred to the National Accountability Bureau (NAB) that would consider the matter from 1985 especially during the 90s under its relevant jurisdiction and laws.\n– The issues of income tax and benami transactions were referred to the Federal Board of Revenue (FBR), which would complete the proceedings within 90 days. The commission had examined issues of nine mills, but now under the prime minister’s direction, the FBR was asked to investigate 88 other mills as well.\n– The issue of cartelization was referred to the Competition Commission of Pakistan that would complete its proceedings within 90 days.\n– The issues of waiver of loans, auctioning of mortgaged assets of banks and loans default were handed over to the State Bank to complete the task within 90 days.\n– The Security Exchange Commission of Pakistan (SECP) and the Federal Investigation Agency (FIA) would look into corporate fraud issue.\n– The commission of fraud and money laundering in imports had been handed over to FIA.\n– The relevant provincial anti-corruption departments would look into the issues of sugarcane prices and violation of provincial rules.\nThe cabinet was further apprised that the second part of commission’s report was related to regulatory framework under which the amendments in the relevant laws were under consideration, so as to tackle the issues like forward sale etc.\nThe meeting was briefed that a committee headed by the minister for industries and production was set up, which would present its recommendations over measures for bringing down sugar price, besides suggesting steps at the level of framing of policy.\nThe cabinet was apprised that the Federal Government would provide 1,000 more beds equipped with ventilators during the current month of June in all the four provinces to upgrade the health facilities in the country and to meet the requirement of COVID-19 affected patients.\nMoreover, for the relevant coronavirus information and awareness about the facilities, a web site and mobile application (RMS) were being utilized.\nThe prime minister said in the current situation, the role of leadership was very critical. He observed that a segment of the society had misconceptions about the contagion, which should be removed.\n“Considering the economical conditions of the country, the lockdown was not possible as the country confronted twin challenges of coronavirus pandemic and the poverty,” he added.\nThe prime minister stressed upon facing the situation instead of getting into panic and said its spread could be contained by fully implementing the standard operating procedures (SOPs).\nHe underlined the need to persuade the public and made them to strictly observe the SOPs.\nThe meeting was also apprised about the available corona treatment facilities in different hospitals of Islamabad. During the current month, an addition of 200 more beds would be made in these hospitals.\nThe cabinet was informed that for the National Assembly session, a mechanism over the SOPs had been agreed upon with the consultation of the speaker and the political leadership.\nThe prime minister also took notice of the poultry price hike and directed the advisor on finance to convene a meeting of National Price Monitoring Control Committee and submit a detailed report before the cabinet.\nHe also directed for expediting the introduction of e-filing and e-tracking systems in the ministries for bringing improvement in the performance of the government institutions and ensuring implementation of decisions in that regard within the set time frame.\nThe meeting was also briefed about the recommendations of a task force over the proper utilization of the abandoned properties and streamlining of Evacuee Trust Board affairs. It was told that under the abandoned properties category, there were a total of 47,000 such properties.\nThe prime minister directed for accelerating the identification process of such properties and completion of their geo-tagging process at the earliest.\nThe cabinet ratified the decisions of Economic Coordination Committee (ECC) meeting of June 3, 2020. While contemplating the ECC’s decision about the Pakistan Steel Mills, it noted that the present government’s agenda was reforms. The entire burden of non-functional institution had been put on the people, therefore, it was need of the hour to further advance the reforms agenda, it stressed.\nIt approved the recommendations of Advisor to the Prime Minister on Institutional Reforms and Austerity Dr Ishrat Hussain about the procedure for ensuring the induction of able and talented people in the government departments, particularly heads of the departments.\nSpecial Assistant to the Prime Minister Shahzad Arbab briefed the cabinet about making improvement in the performance of government departments, particularly fixing targets for the institutions and introducing a system of performance contract for its achievement.\nThe cabinet approved appointment of Dilshad Ali Ahmed as President/ Chief Executive Officer of SME Bank Limited.\nIt also approved allocation of Sector G-12 and Sector-G-12 for the Federal Government Employees Housing Foundation and in this connection approval was also given for acquiring land in these sectors. The cabinet was assured that flats would be constructed for the dwellers of Katchi Abaidis (slums) of G-12 in this sector.\nThe cabinet also approved the Board of Directors of Sui Northern Gas Pipelines Limited.\nIt accorded approval for the constitution of a committee to conduct inquiry about sabotaging of IRSA’s (Indus River System Authority) telemetry system, which was set up by WAPDA (Water and Power Development Authority) in 2002. The committee comprising Deputy Chairman Planning Commission, Secretary Aviation and Secretary Ministry of Commerce and Trade, would determine the involvement of members IRSA or any other person or persons in sabotaging the system.\nThe committee would also determine the causes of mismanagement in getting consultancy services in the World Bank project. The committee after completing its work, would submit its report in 15 days..\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:05.299Z"
}
