{
  "title": "Qureshi calls for re-validating principles of shared responsibility, burden for refugees’ hosting countries like Pakistan",
  "link": "https://www.app.com.pk/national/qureshi-calls-for-re-validating-principles-of-shared-responsibility-burden-for-refugees-hosting-countries-like-pakistan/",
  "date_published": "2020-06-09T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Tuesday called for re-validating the principle of shared responsibility and burden sharing for the large refugee hosting countries like Pakistan.\nThe Foreign Minister was addressing a high-level Webinar hosted by the Turkish Foreign Minister Mevlut Cavusoglu to discuss the situation of refugees and other displaced persons during the Pandemic and the need for international cooperation. He was joined by UN High Commissioner for Refugees, Foreign Ministers of Jordan, Iraq, Lebanon, Austria (ex-FM), EU Commissioner for Home Affairs, and Deputy Director General of World Health Organization (WHO).\nWhile sharing that Pakistan has provided protection, offered opportunities for education, health, livelihoods, vocational trainings, and social mobility to millions of Afghan refugees for over four decades, he added that the presence of three million Afghans was a clear illustration of Pakistani generosity, compassion and hospitality.\nForeign Minister Qureshi referred to the compassionate and holistic approach of the Government of Pakistan to combat impacts of COVID-19 including the US $ eight billion relief package announced by the Prime Minister Imran Khan. No State can handle the magnitude of this crisis, he added.\nThe foreign minister presented a seven-point agenda to enable large refugee hosting countries to combat COVID-19 wherein he highlighted the need for adequate financing of UNHCR’s Refugee Response Plans; continuity of regular support for refugees to host countries; provision of “liquidity” and necessary fiscal space for large refugee hosting countries; supporting the services infrastructure in the host countries; immediate provision of medicines and equipment; equal treatment of protracted large refugee situations with the new emerging ones; ceasing of any hostilities or conflict, and ceasefire in the countries of origin of the refugees and continued work on creation of “pull” factors for return and reintegration of refugees.\nForeign Minister Qureshi stressed that since the virus did not differentiate on the basis of nationalities, race, religion, ethnicity or colour, the international community especially the UN must not differentiate in different categories of Afghans in Pakistan in extending support.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:05.318Z"
}
