{
  "title": "IMF deal drives ‘positive March’ after two bearish months - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) witnessed its first positive month of the calendar year 2025 after two bearish months thanks to a Staff-Level Agreement (SLA) reached with the International Monetary Fund (IMF), boosting investors confidence as the deal will unlock substantial dollar inflows the country direly needs to meet its external debt obligations and sustain reforms to stabilise the economy.\n\nDespite a spectacular rally on Wednesday after the signing of SLA late Tuesday night, which aided the benchmark index surging by over 1,100 points, the short week closed in the red, snapping a six-week winning streak.\n\nHowever, the KSE 100 index rose 4 per cent month-on-month thanks to the IMF deal, progress on the circular debt resolution plan, and the government plans to reduce electricity prices.\n\nHowever, the sentiments turned cautious after the IMF announced that it had allowed a Re1 reduction in the power tariff rather than the Rs8 per unit cut discussed within government circles, undermining investor confidence in the last session as the index turned in a flat performance before long Eidul Fitr closure.\n\nThe PSX posted a positive performance in March and Ramazan. The benchmark KSE 100 index, which reached an intra-month high of 119,422 after opening at 113,499, fell to an intra-month low of 111,717. However, by the end of the month, it managed to close at 117,807, marking an increase of 4,555 points, or 4.02pc. The index depicted a decline of 635 points or 0.5pc week-on-week.\n\nAccording to Arif Habib Ltd (AHL), the KSE-100 index displayed mixed trends throughout the week, beginning negatively due to the proposed increase in royalty for cement companies and the IMF’s concerns over the proposed tariff cuts.\n\nHowever, the market rebounded later, driven by the SLA reached following the first review under the $7 billion Extended Fund Facility, paving the way for releasing the second tranche of $1.1bn. A new 28-month $1.3bn arrangement under the Resilience and Sustainability Facility (RSF) was also reached.\n\nPakistan’s GDP grew by 1.73 per cent year-on-year in 2QFY25, while GDP growth for 1HFY25 stood at 1.54pc compared to 2.33pc in 1HFY24.\n\nMeanwhile, the government raised Rs640bn, slightly below the T-bill auction target of Rs650bn.\n\nAKD Securities Ltd said the market witnessed a slight pullback during the outgoing week, retreating after reaching its highest-ever closing in the preceding week. The profit-taking was driven by substantial selling from insurance companies, alongside month-end rollovers, which added to investor uncertainty.\n\nHowever, several positive developments emerged during the week, including the SLA, $1.3bn RSF, pending approval of the IMF’s Executive Board.\n\nOn the currency front, the rupee largely remained flat against the greenback throughout the week, closing the week at Rs280.3.\n\nThe State Bank of Pakistan’s foreign exchange reserves plunged by $540m to hit a six-month low at $10.6bn week-on-week.\n\nThe average trading volume rose 38pc to 317m shares while the value traded increased 27pc to $87m week-on-week.\n\nAccording to AHL, the market will likely stay positive during the upcoming two-day trading week, shortened due to the Eidul Fitr holidays. This optimism is driven by the anticipated inflation, with CPI expected to clock in at 0.79pc — the lowest in six decades.\n\nThe KSE-100 is trading at a price-to-earnings ratio of 6.4x compared to its 10-year average of 8.0x, offering a dividend yield of 8.2pc compared to its 10-year average of 6.5pc.\n\nAKD Securities said the market would remain positive in the coming weeks, with the SLA as a key momentum trigger.\n\nThe KSE100 is anticipated to sustain its upward trajectory, with a target of 165,215 points by December, primarily driven by strong earnings in fertilisers, sustained ROEs in banks, and improving cash flows of E&P and OMCs, benefiting from falling interest rates and economic stability.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:32:38.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901019/imf-deal-drives-positive-march-after-two-bearish-months",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:15.000Z"
}
