{
  "title": "Crowds wait at railway station as no special Eid train announced from Pindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Though five special trains have been launched by the government on Eidul Fitr, no such service has been announced for passengers going to their hometowns from Rawalpindi.\n\nAs a result, an unusual rush of passengers was seen trying to catch available trains at the Rawalpindi Railway Station on Friday.\n\nOn the other hand, Pakistan Railways (PR) announced special 20 per cent discount in fares for the first three days of Eidul Fitr. According to a notification issued by PR, on the 1st, 2nd and 3rd day of the Eid, there will be a 20pc reduction in fares for all mail, express, passenger and intercity trains across all classes.\n\nHowever, no concession was provided on the five special trains because these were operated three days before Eid.\n\n12 extra coaches attached to trains heading for Lahore, Multan, Quetta and Karachi, says senior official\n\nMeanwhile, mostly people preferred trains while going to and from their hometowns because public transporters on the motorway and G.T. Road charged higher fares.\n\nPeople began turning up at the city’s railway station early in the morning but their number considerably swelled at noon after government and private offices closed for Eidul Fitr.\n\nAs a measure to cope with the heavy rush and keeping in mind the passengers’ convenience, the railway authorities attached additional coaches to several trains. The trains to Lahore, Karachi, Quetta and Multan were running with three additional coaches and one AC and two sleeper coaches.\n\nPR’s Divisional Superintendent Nooruddin Dawar told Dawn that the railway administration had made special arrangements for Eid. He said that no special train would be operated from Rawalpindi; however, the authorities managed to attach more than 12 extra coaches with trains to Lahore, Multan, Quetta and Karachi.\n\nHe said that he had directed the reservation office and ticket booths to adopt “first come first serve” policy, adding shortage of seats created problems.\n\nMr Dawar said that the railway police in collaboration with the city police had already tightened security at the railway stations in the wake of the recent terror attacks in the country. He said that only passengers with tickets would be allowed to enter platforms after being thoroughly checked through metal detectors.\n\nOn the other hand, passengers said the reduction in fares for three days starting from the Eid day was of no benefit for passengers going to their hometowns to celebrate Eid. People usually travel to their hometowns before Eid and return three days after Eid, they said.\n\nThey said that the railway authorities should improve services and follow the timetable if they really want to attract passengers to this mode of transportation.\n\nMaqsood Ahmed, who was going to Lahore, said he always preferred travelling with his family train because road transport was unpredictable. He also complained that private transporters overcharged and misbehaved with people on the occasions of Eid and other festivals.\n\nAbdur Rehman, who was going Peshawar, said he opted for a train to go to his hometown as the fares were economical as compared to buses.\n\nOn the other hand, the Punjab government has formed special squads to curb the tendency of overcharging by public transporters. Moreover, a control room and a complaint cell were established at the Regional Transport Authority Rawalpindi office.\n\nDeputy Commissioner Dr Hassan Waqar Cheema said no transport vehicle be allowed to run from a base, terminal or bus stand without a fitness certificate and a route permit.\n\n“Transporters should be obliged to receive fixed fare and strict legal action should be taken against violators. In addition, there will be no overloading. Mobile squads will perform checking duties at their designated areas from 9am to 8pm till Eid and will ensure compliance of these instructions,” he said.\n\nHe directed citizens to immediately inform the concerned officials in case of overcharging, overloading or any other violation so that effective action can be taken. He added that the presence of the concerned officers in the control room should be ensured and the complaints received should be resolved swiftly.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e71c6d6bd69.jpg",
  "retrievedAt": "2025-08-25T15:32:23.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900954/crowds-wait-at-railway-station-as-no-special-eid-train-announced-from-pindi",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:47.000Z"
}
