{
  "title": "The mechanics of trade wars - World - DAWN.COM",
  "author": null,
  "content": "PARIS: With his penchant for tariffs US President Donald Trump is raising the spectre of a trade war of rare intensity, threatening partner nations with penalties that risk disrupting global trade.\n\nWhile the US leader has delayed implementing some of his threats, he announced on Wednesday he was placing 25 per cent additional tariffs on cars and car parts entering the United States.\n\nHe has promised a further round on April 2, a date he has dubbed “Liberation Day.”\n\nRamp it up\n\n“A country appears weak if it doesn’t impose retaliatory measures” in the face of tariff increases, explained Aurelien Saussay, a professor at the London School of Economics.\n\nPromises of retaliation have duly been swift to arrive and be directly implemented.\n\nFollowing the opening Trump salvos, China responded by slapping tariffs on US agricultural products.\n\nThe European Union has vowed to respond by mid-April to the 25 percent tariffs that Trump could impose on the bloc on April 2. Beyond retaliatory measures that could multiply, the trade war could also prompt overproduction in producer countries.\n\n“This is particularly the fear of Europeans, who could not only export less to the United States but also see China attempt to flood their market in order to compensate for its decline in exports to the United States,” said Eric Dor, Director of Economic Studies at France’s IESEG School of Management.\n\n“Europe would in turn respond to that with an increase in tariffs to protect its industry.”\n\nFall in growth\n\n“The imposition of new bilateral tariffs and the associated worsening of political and geopolitical uncertainties will exert a dampening effect (on trade),” the OECD predicted in a mid-March report which revised global growth forecasts downwards.\n\nMechanically, raising tariff barriers leads to a decline in exports and therefore a decline in activity in producer nations.\n\n“Markets are disappearing, which threatens jobs and growth,” explained Saussay of the LSE.\n\nOne of the countries most threatened by the trade war is Mexico, a key US trading partner and which is expected to enter recession this year, according to the OECD.\n\nJapan, where around one in 10 jobs is linked to the automotive sector, is also highly exposed to the effects of tariffs. In “emerging” countries, such as Brazil, whose economies are very dependent on raw materials, the chain reaction emanating from a trade war is also being closely observed.\n\n“If the tight policy in the United States is very aggressive overall and we see global growth slowing down significantly, so much so that commodity prices take a hit, then that’s when we’re going to see a negative impact,” warned Benito Berber, chief economist with Natixis.\n\nThe increase in customs barriers that Trump’s policies could spawn if he carries out his threats would be unprecedented in nearly a century and would plunge global trade players into unknown territory.\n\nTrump is actually facing pressure from the markets as well as automotive manufacturers and could pay a heavy political price in the form of significant social or inflationary consequences at home caused by his decisions.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:32:38.195Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901018/the-mechanics-of-trade-wars",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:15.000Z"
}
