{
  "title": "11 killed in three traffic accidents in Islamabad, Kallar Kahar - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD/RAWALPINDI: At least six people lost their lives in two road traffic accidents in Islamabad while five travelers were killed on the motorway at Kallar Kahar on Friday.\n\nPolice said four persons were killed and eight injured when a dumper overturned and fell on vehicles on I.J.P Road near Mandi Mor in Islamabad.\n\nThe dumper loaded with sand and coming from Tarnol side first rammed into a footpath and overturned and fell a wagon, a Mehran car and a rickshaw. As a result, eight people sustained critical injuries. The driver escaped leaving behind the dumper.\n\nAccording to the police, six of the injured, including two women, were shifted to Pims where a woman and two men were pronounced dead.\n\nFour killed, eight injured after dumper overturns and falls on vehicles near Mandi Mor, say police\n\nThe two other injured were shifted to Holy Family Hospital in Rawalpindi. One of the deceased was identified as Khushal while the two injured at Pims were Haroon Rasheed and Hadayatullah.\n\nThe police said the accident occurred due to a break failure. However, a preliminary investigation by the capital administration showed that the dumper overturned after one of its tyre burst.\n\nIn another incident, two persons were run over and killed by a speeding car on Ninth Avenue near Peshawar Mor. The deceased were identified as Mohammad Ali, a native of Lakki Marwat, and Mohammad Wilayat of Peshawar.\n\nThe police said the two persons were sitting along the roadside when the recklessly driven car appeared from PARC Chowk and hit and killed them.\n\nThe driver escaped leaving behind the car. A case was registered against him at the Karachi Company police station.\n\nAccident on motorway\n\nFive people were killed and 13 others injured when a bus going to Vehari from Rawalpindi overturned on Islamabad-Lahore Motorway at Kallar Kahar.\n\nThe motorway police shifted the bodies and injured to the trauma centre in Kallar Kahar.\n\nA police spokesman said initial investigation suggested the accident occurred due to negligence of the driver. The Kallar Kahar police have registered a case against the bus driver Zahid, a resident of Vehari, and the owner on the complaint of senior motorway police officer Waqar Javaid. He said he was on patrol duty when at about 1:30am he received information about the accident. The police reached the scene and found the passenger bus (JB/5836) overturned.\n\nMohammad Zaheer, Ali Raza and an unidentified passenger died on the spot while two others succumbed to their injuries later. The injured included Abu Bakar, Mohammad Usman, Ali, Mohammad Ishaq, Mohammad Saleem, Mohammad Mumtaz, Azhar Hameed and Mazhar Hussain.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:15:56.757Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900958/11-killed-in-three-traffic-accidents-in-islamabad-kallar-kahar",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:47.000Z"
}
