{
  "title": "SHC throws out petitions against govt plan to buy costly off-roaders - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A Constitutional Bench of the Sindh High Court on Friday allowed the provincial government to procure 138 double-cabin vehicles for assistant commissioners (ACs).\n\nA two-judge bench headed by Justice Agha Faisal dismissed two petitions impugning a letter seeking funds from the finance department to purchase the costly vehicles for ACs.\n\nThe bench ruled that the petitioners had obtained ad interim orders at the very first date and consequently, the entire process for replacement of vehicles for government officials was suspended.\n\nJamaat-i-Islami’s MPA Mohammad Farooq, one of the petitioners, had submitted that it was misuse of public exchequer especially when the entire province was suffering from budgetary deficits and there was no justification to purchase such vehicles.\n\nPetitioners failed to present their case in favour of invoking ‘discretionary writ jurisdiction’ of SHC, rules constitutional bench\n\nOn Friday, the bench confronted the lawyers for the petitioners over the issue of maintainability.\n\nAdvocate Usman Farooq submitted that the impugned letter was contrary to the law, rules and policy and therefore ought to be quashed.\n\nHowever, he failed to satisfy the bench when the judges asked him to identify any law, rule or policy being offended by the letter in question.\n\n“Perusal of the record filed with the memorandum of petition demonstrated that no law, rule or policy was annexed and in addition to a copy of the impugned letter, the only inclusions were a purported press report, devoid of any apparent annotation demonstrating the source thereof and copy of a chapter, from an unidentified publication, regarding inflation,” the constitutional bench stated in its order.\n\nWhen asked to assist about the locus standi of the petitioners, the lawyer submitted that the petitioners are citizens of Pakistan and one of them is an MPA and they are entitled to maintain the petitions.\n\n“Upon being asked to befall the petitioners within the definition of aggrieved persons, as contemplated per Article 199 of the Constitution, the counsel remained unable to do so, however, insisted that the qualification was unnecessary since these were public interest petitions,” the order said.\n\nAdvocate General Jawad Dero submitted that the subject allocation was a constituent of a scheme; constituent of the Finance Act and the act was already in force and therefore, no case was made out to impugn the implementation of a constituent thereof.\n\nHe contended that transportation / conveyance was an integral requisite for the functioning of government and the last procurement took place in 2010/2012 and the efficient operational life of such vehicles ceilings at about 200,000 kilometres, but such vehicles had been operated for more than four times of the said quantum.\n\nThe bench noted that Article 199 of the Constitution contemplated the discretionary writ jurisdiction of SHC and such discretion may be exercised upon invocation by an aggrieved person and in the absence of an adequate remedy, but the counsel for petitioners failed to make such case.\n\n“In so far as the issue of public interest litigation is concerned, we have been assisted with no reason to disagree with the assertion of the learned advocate general Sindh that the present petitions appear to be an attempt to seek publicity, without any justifiable cause of action,” it added.\n\nAs per settled law, the bench also said, the public interest litigation ought not to be aimed at seeking publicity and the law required the court to ascertain whether the supplicant was acting in a bona fide manner.\n\n“Public interest litigation should not be a mere adventure, an attempt to carry out a fishing expedition and/or to settle personal scores. The court must distinguish between public interest litigation and publicity motivated litigation, private interest litigation and/or politically motivated litigation,” the court order said.\n\nIt stated that the court dismissed the petitions and ruled that the petitioners had been unable to set forth a case for the invocation of the discretionary writ jurisdiction of the SHC.\n\nLater, MPA Faqrooq told reporters on the SHC premises that he would challenge the decision before the Supreme Court.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:16:01.659Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900992/shc-throws-out-petitions-against-govt-plan-to-buy-costly-off-roaders",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:34.000Z"
}
