{
  "title": "Public debt swells to Rs74tr in July-December - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite a growth of about 10 per cent in total public debt to Rs74.103 trillion by the end of December 2024, the government has claimed that debt indicators are improving and risks are decreasing.\n\nIn its debt bulletin for the period ending December 31, the Ministry of Finance (MoF) on Friday reported the total public debt at Rs74.013tr, showing an increase of more than Rs6.683tr (10pc) over the comparable period when it stood at Rs67.330tr.\n\nThe MoF said the economic stabilisation and fiscal consolidation helped improve sustainability of public debt in the first half of 2024-25.\n\n“The stock of total public debt has increased by 3.9pc in 1HFY25, as against an increase of 7pc during the same period last year”, it said, adding that primary drivers for the rise in debt stock had been managed, with a significant federal primary surplus and stable exchange rate.\n\nPrimary balance posted a surplus of 0.9pc of GDP in FY24 (after 20 years) and 2.9pc in July-December FY25. International rating agencies upgraded Pakistan’s credit rating by one notch and outlook from stable to positive.\n\nGovt claims risks fall amid improved indicators\n\nKey debt risk indicators also showed marked improvement, the debt bulletin said, as the Average Time to Maturity (ATM) for domestic debt increased to 3.4 years from 2.9 in June 2024, while the external debt maturity period remained at the comfortable level of 6.2 years. External debt accounted for 32.6pc of total public debt, allowing the government to limit exposure to any possible adverse exchange rate movements, it said.\n\nThe federal fiscal deficit was almost entirely financed through domestic borrowing, particularly through issuances of medium-to-long-term Pakistan Investment Bonds (PIBs) and Government Ijarah Sukuks (GIS).\n\nThe highlight of this period was the launch of ‘Government Securities Buyback and Exchange Programme’, under which buyback of around Rs1tr was undertaken, resulting in savings of debt servicing by Rs31bn.\n\nOn the external front, most inflows continued from multilateral sources, with net retirement from bilateral creditors. The government defines total public debt as debt owed by the centre (including the federal and provincial governments) serviced out of the consolidated fund and debt owed to the International Monetary Fund.\n\nTalking about the IHFY25, the bulletin said the total public debt increased by 3.9pc compared with the end of June 2024, as against the increase of 7pc during the same period last year. The main contribution to this growth came from domestic debt, which increased by 5pc during 1HFY25.\n\nThis growth was still lower in comparison to the same period of FY24, in which the domestic debt grew by 9pc. Overall, the domestic debt comprises about 67pc and external debt at 33pc of total public debt.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:32:38.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901021/public-debt-swells-to-rs74tr-in-july-december",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:15.000Z"
}
