{
  "title": "Underage Karachi driver remanded in police custody for mowing down couple - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Friday remanded in police custody an underage car driver, who hit and killed a couple on Sharea Faisal two days ago.\n\nThe investigating officer (IO), Syed Shujhat Haider, brought Muhammad Aneeq Imam before Judicial Magistrate (East) Khalique Zaman. The IO claimed that the suspect was found to be an underage boy who did not possess a driving licence.\n\nHe informed the court that during interrogation, the suspect disclosed that the car involved in the accident belonged to the father of his friend Saad, identified as Asad. He further stated that he had booked car owner Asad on the suspect’s lead and he would arrest him.\n\nThe IO informed the court that the suspect’s age was 17, whereas upon inquiry by the court, the teenage boy stated that he was 16 years old.\n\nThe court asked the suspect whether he was driving the car, to which the teenage boy replied that he was driving while two to three of his friends were also present in the vehicle.\n\nOn the other hand, the defence counsel, Abid Zaman, opposed the physical remand, arguing that as per the Child Registration Certificate (CRC), also known as B-Form, the suspect was underage.\n\nAfter hearing arguments from both sides, the court remanded the suspect into police custody for three days to conduct an ossification test to determine his actual age. It also directed the IO to apprehend the car owner.\n\nA case was registered at Sharae Faisal police station under Section 322 (punishment for qatl-bis-sabab) of the Pakistan Penal Code on the complaint of victims’ relative Naseem Ahmed Ansari.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/29101236ec6d165.png",
  "retrievedAt": "2025-10-12T02:15:35.325Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900991/underage-karachi-driver-remanded-in-police-custody-for-mowing-down-couple",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:34.000Z"
}
