{
  "title": "VOA journalists scramble for options after sudden dismissals - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: For decades, journalists working for Voice of America (VOA) and its affiliated media outlets considered their jobs among the most secure and well-paid in the industry.\n\nThat changed this month, when President Donald Trump ordered the dismantling of the US Agency for Global Media (USAGM), effectively shutting down VOA, Radio Free Europe/Radio Liberty (RFE/RL), and Radio Free Asia (RFA).\n\nBuoyed by a court order that prompted Kari Lake, the newly installed senior adviser for the US Agency for Global Media (USAGM), to rescind the order to cancel funding for RFE/RL, those unceremoniously laid-off are still considering their options.\n\nHundreds of erstwhile VOA journalists, who have filed lawsuits in Washington and New York, are seeking to reverse their dismissals. Plaintiffs include VOA Director Michael Abramowitz, media advocacy groups such as Reporters Without Borders (RSF), and labour organisations.\n\nExperts warn USAGM shutdown may spell the end of US ‘soft power’ across the globe\n\nA couple of days earlier, Judge Royce Lamberth of the US District Court for the District of Columbia ruled that the USAGM cannot force RFE/RL to shut down with little explanation, even if directed by the president.\n\nUncertain job market\n\nA group of newly unemployed journalists, including more than 100 Pakistanis from VOA’s Urdu and Pashto services, spoke to the media recently about their plans to push for the restoration of their jobs and explore new options.\n\nThey acknowledged that the job market for journalists looks increasingly grim. A former VOA reporter highlighted troubling trends: “The Washington Post laid off 4pc of its workforce after losing $100 million in 2024, and other outlets like Vox Media and HuffPost also made cuts. Nearly 15,000 media jobs were lost in 2024 alone.”\n\nAccording to the US Bureau of Labour Statistics, employment of journalists is expected to decline by 3pc from 2023 to 2033. While traditional media is shrinking, digital platforms are expanding. Empl­oyment in internet publishing and broadcasting surged from 30,000 in 1990 to nearly 198,000 in 2016.\n\nDespite these challenges, some journalists remain optimistic. “The New York Times successfully expa­nded by acquiring The Athletic and Wordle,” one journalist noted. “Oppo­rtunities are few, but they exist.”\n\nDanger to laid-off journalists\n\nMedia advocates warn that the shutdown has serious implications for press freedom. VOA and its affiliates reach 420 million people in 63 languages across more than 100 countries, and their closures would undermine US public diplomacy, as well as its soft power.\n\nBut for many VOA journalists, the stakes are higher than simply securing financial stability, they fear returning to their home countries, where their ties to US-backed media could put their lives in danger.\n\nWhen this concern was raised, State Department spokesperson Tammy Bruce simply said, “If you believe returning to your home country puts you at significant risk, there are procedures to apply for asylum.”\n\nBut given the Trump administration’s recent crackdown on migration, both legal and illegal, it is highly unlikely that everyone affected will be able to secure such relief.\n\nEnd of ‘soft power’?\n\nIn a recent op-ed for Foreign Policy magazine, Senator Jeanne Shaheen said that shuttering VOA and its sister outlets was “a win for Putin and dictators around the world”.\n\nThe cuts hit key broadcasters such as Radio Martí in Cuba — a US-funded outlet that the country’s ruling Castro brothers tried to dismantle for decades — as well as other networks in Afghanistan, Belarus, Georgia, and Iran.\n\n“Without RFA, people living in China, North Korea, and Myanmar will be cut off from fact-based news,” she argued.\n\nVOA broadcasts have been a veritable “first line of defence for the US” against disinformation spread by dubious regimes, and it journalists have paid the price. For example, Senator Shaheen writes, four USAGM journalists are held in prison in Vietnam, two in Russia, one in Azerbaijan, one in Belarus, and one in Myanmar.\n\nAlthough the Trump administration has accused the outlets of promoting “left-wing propaganda”, their shutdown is being cheered by countries such as Russia and China — where VOA and its sister outlets provided an alternative to the tightly controlled state-run media.\n\nAs the Novaya Gazerta Europe noted, “propaganda is clearly in the eye of the beholder”.\n\nSince VOA‘s closure, The Moscow Times has reported how Kremlin officials were elated by the demise of the “purely propagandistic” outlets, while China’s Global Times celebrated the closure of what it called a “lie factory”, it wrote.\n\nPublished in Dawn, March 29th, 2025\n\nHeader image: A view of the Voice of America (VOA) building, a day after more than 1,300 of the employees of the media broadcaster, which operates in almost 50 languages, were placed on leave in Washington, DC, US on March 16, 2025. — Reuters/Annabelle Gordon/File",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/290947201488fd3.jpg",
  "retrievedAt": "2025-08-25T15:32:48.879Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900959/voa-journalists-scramble-for-options-after-sudden-dismissals",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:55:59.000Z"
}
