{
  "title": "Swabi journalist gets FIA notice over social media post - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: The vice-president of Swabi Press Club has received a notice from Federal Investigation Agency’s cybercrime wing, Peshawar, for an alleged offensive post on the social media.\n\nThe journalist, Mohammad Ayub told Dawn here on Friday that he had received the notice and would soon visit the FIA office in Peshawar.\n\nThe notice of attendance has been issued from the office of the deputy director cybercrime centre.\n\nThe notice shared with Dawn said that FIA Cybercrime Centre, Peshawar, is conducting a probe on gist of an allegation (a complaint regarding offence against the dignity of a natural person).\n\nIt further says, ‘therefore you are directed to appear in person to record your version in your defence at FIA Cybercrime Centre, Peshawar, within one week after receiving this letter, along with your original CNIC in interest of justice for fair trial process.’\n\nIn case of non-appearance, a case will be registered, and the arrest will be made, the notice said.\n\nMeanwhile, Ayub said that he had discussed the notice with his lawyers, Salim Khan Advocate, Mohammad Ishfaq Advocate and Asfandyar Khan Advocate.\n\nHe said that he was a professional journalist, and knew how he could perform his duty while bridging gap between the people and the government.\n\nMeanwhile, the press club’s president Jalil Ahmad Khan said that they would fully back Mr Ayub in his legal battle.\n\nSECURITY ENHANCED: The security of major seminaries and mosques in the district, where huge Eidul Fitr gatherings are expected to be held, has been enhanced, sources in the police department said on Friday.\n\nThey said extraordinary security steps had been taken due to the prevailing situation in the province to protect both the life and property of the people.\n\nThe sources said under the Eid security plan, all the entry and exit points would be guarded round the clock.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:32:22.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900939/swabi-journalist-gets-fia-notice-over-social-media-post",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:53.000Z"
}
