{
  "title": "KP govt urges president to call ‘long overdue’ NFC meeting - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government has formally urged President Asif Ali Zardari to convene a meeting of the 10th National Finance Commission to ensure the inclusion of the people of merged tribal districts in resource allocation.\n\nKP Chief Minister Ali Amin Khan Gandapur wrote a letter to the president on Thursday about the “long overdue” NFC meeting.\n\n“I want to draw your [the president’s] attention to this matter of critical importance. Following the 25th Amendment in 2018, Fata was merged with Khyber Pakhtunkhwa to integrate the region into the national mainstream, but despite the historic merger, 5.7 million people of the tribal districts remain financially excluded.\n\nDespite the extension of the district administration, civilian law enforcement, the absence of financial inclusion continues to hinder the development, peace and stability in the region,” he said.\n\nSeeks inclusion of tribal people in resource allocation\n\nThe chief minister said that the primary reason for the disparity was that the population of ex-Fata and its poverty indices had not been accounted for in KP’s share of the federal divisible pool under the NFC Award.\n\nHe said that despite the 25th Constitutional Amendment, the due share of the people of the erstwhile Fata still went to the federal government instead of KP, which was against the Constitution.\n\nMr Gandapur also noted that the 7th NFC Award has been effective since 2010, without any revision to reflect the merger of the erstwhile Fata in KP, which harmed the spirit of the federation and vitiated the operation of the Article 160 of the Constitution.\n\n“This continued extension of the 7th NFC Award since 2018 without adjustments for this constitutional change contradicts the very spirit of 25th Constitutional Amendment and the commitments made to the people of erstwhile KP,” he said.\n\nThe chief minister also pointed out that it won’t be possible for KP to acquiesce to the “unconstitutional, unfair and anti-federal extension” of the 7th NFC Award without an accurate share of the province.\n\n“An [NFC] award that has become infructuous of constitution cannot be extended any longer, so the long overdue meeting of the 10th NFC may be convened immediately to ensure the rightful inclusion of the people of the merged tribal districts in the resource distribution.”\n\nIn January this year, the KP government had informed the federal government that it wouldn’t accept any extension of the seventh NFC Award without making the funding for merged tribal districts part of the province’s share in the federal divisible pool.\n\nIn a letter, Chief Minister Ali Amin Khan Gandapur had requested federal finance minister Mohammad Aurangzeb to ensure that any future iteration of NFC arrangements should duly reflect the post-merger province and include its complete geography and population.\n\nHe insisted that from 2019 to 2024, the federal government had paid the province its share in NFC Award at a rate of 14.62pc, amounting to Rs3.046 trillion, but based on the revised NFC share of 19.64pc, the province’s share amounted to Rs4.092 trillion, resulting in a shortfall of Rs1.046 trillion.\n\nThe chief minister added that after accounting for the federal grants of Rs437 billion provided for the merged tribal districts during the period, the net shortfall exceeded Rs609 billion over the last six years.\n\nHe also pointed out that towards the cumulative shortfall of Rs568 billion under the Accelerated Implementation Programme against the federal commitment of the annual Rs100 billion over 10 years as part of the Tribal Decade Strategy to bridge development disparities in the merged tribal districts.\n\nMr Gandapur noted that since 2019, the KP government had spent Rs372 billion on operational expenditure in the region but the federal government had released Rs331 billion, leaving a deficit of Rs41.4 billion.\n\nPublished in Dawn, March 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:16:18.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900944/kp-govt-urges-president-to-call-long-overdue-nfc-meeting",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T01:56:53.000Z"
}
