{
  "title": "First Hajj Flight of 2025 departs from Islamabad with 427 Pilgrims",
  "author": null,
  "content": "ISLAMABAD, Apr 29 (APP): Pakistan’s Hajj 2025 operations officially began on Tuesday morning with the departure of the first Hajj flight from Islamabad to Madinah.\nThe inaugural flight, PK-713, took off at 5:21 AM, carrying 427 pilgrims who will perform the sacred journey in the Kingdom of Saudi Arabia.\nA special ceremony was held at Islamabad International Airport to mark the occasion. Federal Minister for Religious Affairs, Sardar Muhammad Yousaf, and the Ambassador of Saudi Arabia to Pakistan, Nawaf bin Saeed Al-Maliki, were present to see off the pilgrims. Other prominent attendees included Secretary of the Ministry of Religious Affairs Zulfiqar Haider, renowned religious scholar Maulana Tahir Ashrafi, CEO of Pakistan International Airlines (PIA), the Chief Operating Officer/Airport Manager, and the Director of Hajj.\nAs a gesture of goodwill and blessing, the pilgrims were presented with copies of the Holy Quran, fresh roses, and chocolates before departure. The Pakistan Airports Authority (PAA) made special arrangements to ensure a smooth and comfortable experience for the departing pilgrims, including the setup of a dedicated Hajj lounge at the airport.\nThe ceremony reflected the strong ties between Pakistan and Saudi Arabia and underscored the government’s commitment to providing quality services to pilgrims during the Hajj season. Further flights are scheduled in the coming days from various cities across the country as part of the national Hajj operation.\nThis marks the beginning of what is expected to be a smooth and spiritually fulfilling Hajj journey for thousands of Pakistani pilgrims heading to the holy land in 2025.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:00:59.758Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/first-hajj-flight-of-2025-departs-from-islamabad-with-427-pilgrims/",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T11:22:00.000Z"
}
