{
  "title": "PM&DC caps tuition fees for MBBS, BDS programs",
  "author": null,
  "content": "ISLAMABAD, Apr 29 (APP): In a major development aimed at improving affordability and transparency in medical and dental education, the Pakistan Medical and Dental Council (PM&DC) has announced a new tuition fee structure for MBBS and BDS programs across the country.\nAccording to the decision, made under Section 20 (7) and (8) of the PM&DC Act, 2022, the tuition fee for all private medical and dental colleges has been capped at PKR 1.8 million per session, with a 5% increase for the 2025 session.\nFrom 2026 onward, tuition fee hikes will be based on the Consumer Price Index (CPI).\nThe reform follows recommendations from the Committee on Medical Education Reforms, established by the Prime Minister and chaired by the Deputy Prime Minister of Pakistan.\nThe initiative is part of a broader effort to ensure fairness, transparency, and wider access to medical education.\nInstitutions that have charged fees exceeding the capped amount are now required to refund the difference or adjust it against future fees.\nFurthermore, private colleges wishing to charge up to a maximum of PKR 2.5 million must submit detailed financial justifications to the PM&DC for evaluation. Criteria for these assessments will be communicated in due course.\nStrict compliance has been mandated, with penalties for institutions that fail to adhere to the new structure.\nThe PM&DC has urged students, parents, and stakeholders to report any non-compliance via its official complaint portal for prompt resolution.\nThe council credited the collaborative efforts of PM&DC and the Pakistan Association of Medical Institutions (PAMI) under the leadership of the Deputy Prime Minister for bringing this vital reform to fruition.\nThis step marks a significant milestone in the ongoing efforts to make medical and dental education more equitable and sustainable in Pakistan.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:59:38.153Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pmdc-caps-tuition-fees-for-mbbs-bds-programs/",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T16:29:00.000Z"
}
