{
  "title": "Islamabad ranked among top 100 safest cities worldwide",
  "author": null,
  "content": "ISLAMABAD, Apr 29 (APP): Islamabad has been ranked among the top 100 safest cities in the world, surpassing major global capitals including London, New York, and Paris, according to the World Safety Index 2025 published by Numbeo.\nA public relations officer told APP that Islamabad is ranked 93rd among 380 cities worldwide with a safety index score of 67.9. In comparison, London is ranked 270th with a score of 45.8, Paris 303rd (41.9), Berlin 187th (55.3), Moscow 118th (64.6), and Lahore 130th (63.1). Previously, the United Nations had also declared Islamabad a “family station” for its staff due to its safety and livability.\nHe said under the dynamic leadership of Inspector General of Police (IGP) Islamabad, Syed Ali Nasir Rizvi, the Islamabad Police achieved remarkable progress in reducing the crime rate in 2024 and 2025.\nHe said the capital witnessed a 20 percent overall decline in crime during 2025 as a result of effective policing strategies, commitment, and teamwork of officers and personnel.\nHe said acting on the directions of the IGP Islamabad, a vigorous crackdown was launched against drug peddlers, liquor sellers, and their facilitators.\nHe said in 2025, incidents of street robbery dropped by 19 percent, theft by 12 percent, burglary by 74 percent, vehicle and motorcycle theft by 22 percent, and murder cases declined by 17 percent. Overall, 600 fewer crimes were reported in 2025 compared to the previous year.\nHe said following the IGP’s instructions, Islamabad Police launched a special awareness campaign titled “Nasha Ab Nahe” to educate youth about the harms of narcotics. Senior police officers visited educational institutions and engaged directly with students on the dangers of drug abuse.\nHe said a large-scale crackdown was also carried out against drug dealers, resulting in multiple arrests and seizures of narcotics across the city.\nHe said Islamabad Police also took strict action against illegal weapons. Several individuals involved in the illegal possession of arms were arrested and cases were registered following the recovery of firearms and ammunition.\nHe said Islamabad Police provided robust security to national and international VVIPs and VIPs throughout the year. He added that during major events such as the Champions Trophy, Pakistan Super League, and other key occasions, the police ensured full-scale security for foreign delegates, diplomats, and the general public.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:00:06.425Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-ranked-among-top-100-safest-cities-worldwide/",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T13:51:00.000Z"
}
