{
  "title": "PAFST launched to strengthen National Food Security and Climate Resilience",
  "author": null,
  "content": "ISLAMABAD, Apr 29 (APP):Senior government officials, development partners, researchers, and representatives from the private sector gathered on Tuesday for a closed-door consultation marking the inception of the Pakistan Alliance for Food Systems Transformation (PAFST).\nThe consultation was organized by the Sustainable Development Policy Institute (SDPI) in collaboration with the Global Alliance for Improved Nutrition (GAIN), said a press release.\nPAFST is launched to deliberate on food systems transformation in alignment with national, regional and international policies. It brought together key stakeholders to support policy reforms, promote climate-smart agriculture, and improve access to affordable and nutritious food. Further, the event discussed competing political interests and demands, limited budgets, and tight timelines to strengthen food systems.\nThe Alliance will also work to strengthen Pakistan’s voice in global food systems discussions, including those under the UN Food Systems Summit and climate negotiations.\nThe platform will be steered by the Ministry of National Food Security and Research, with SDPI serving as the secretariat and GAIN providing advisory support. The Alliance will focus on evidence-based policymaking, market system improvements, climate resilience, and knowledge sharing, with a special emphasis on youth, women, and farmers.\nSpeaking at the consultation, Dr. Abid Qaiyum Suleri, Executive Director, SDPI, said,\n“Food security is not just about hunger; it is about economic stability, resilience to climate change, and national security. Through PAFST, we are bringing together expertise and commitment from all sectors to drive real change. Our goal is to build a food system that is sustainable, inclusive, and capable of withstanding future challenges.”\nMinister of State Malik Rasheed Ahmed Khan, Ministry of National Food Security & Research stated, multisectoral approach is needed to enhance productivity, adopt water-smart solutions, and strengthen the resilience of our food systems”.\nFurther applauding the initiative, the Minister stated, “Ministry of National Food Security and Research, and the Government of Pakistan, fully support PAFST and will continue to extend facilitation and technical cooperation”\nThe consultation concluded with agreement on immediate next steps for PAFST’s operationalization, including the formation of technical working groups and the development of a detailed action plan for the coming year.\nPAFST is set to become a center of excellence, bridging research, policy, and practice to help achieve Pakistan’s commitments under the Sustainable Development Goals and contribute to building a stronger, healthier future for all Pakistanis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:00:29.774Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pafst-launched-to-strengthen-national-food-security-and-climate-resilience/",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T13:51:00.000Z"
}
