{
  "title": "Uneasy calm in Afghanistan as Taliban consolidate control",
  "link": "https://www.app.com.pk/national/362584/",
  "date_published": "2021-08-16T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): An uneasy calm spread across Afghanistan, a day after the fall of Kabul, the Taliban consolidated their hold, appointed officials at key positions, confiscated weapons from civilians and assued diplomats and people of full security.\nZabihullah Mujahid Spokesman of Islamic Emirate of Afghanistan in a message assured diplomatic missions and their staff that there was no danger for them.\n“We assure all embassies, diplomatic missions, institutions and residences of foreign nationals in Kabul that no danger is posed to them. All should be in Kabul with full confidence. The forces of the Islamic Emirate are tasked with maintaining security in Kabul and other cities of the country.” he said in a message on Twitter.\nUnlike the past when the Taliban used to make announcements and used couriers to convey hand written letters or messages, the Taliban in the year 2021 rely on the microbogging site Twitter to update the situation and also to convey their orders.\nIn another message he said the situation in Kabul was under control and pointed that a number of people have been arrested involved in “mischief.”\n“No one is allowed to enter the homes of former officials, demand cars from them and threaten them, they will be taken seriously, they are under serious persecution.”\nکابل ښار کې وضعیت د بشپړ کنترول کېدو به حال کې ده.هغه خپل سري کسان چې په شرارت او آشوب یې لاس پورې کړی وو اکثره نیول شوی دی.هیچاته اجازه نشته چې د پخوانیو چارواکو کورونو ته ورشي، د موټرو غوښتنه ترې وکړي او تهدید کړي، د هغوی مخه به په جدیت سره نیول کیږې، تر جدي تعقیب لاندې دي.\n— Zabihullah (..ذبـــــیح الله م ) (@Zabehulah_M33) August 16, 2021\nAfter taking over of the television station the videos on social media showed Taliban giving a roundup of situation and providing the viewers latest updates.\nHowever, despite the assurances several diplomatic missions continued to evacuate the staff. The embassies of Pakistan, China and Russia remained operational.\nChaotic scences were seen at the Kabul International.  Morteza Kazemian, a journalist from Afghanistan shared a video in which scores of people could be seen running along a US Air Force Boeing C-17A Globemaster III. In another video of the C-17 at least two people are seen falling off the aircraft, who had tried to cling on to it in a desperate bid to flee for safety.\nفیلم اندوه‌برانگیز دیگری از فرودگاه کابل و آویختن پناهجویان افغان به هواپیمای نظامی و در حال حرکت pic.twitter.com/xePDDMAjWd\n— morteza kazemian (@morkazemian) August 16, 2021\nThe United States temporarily halted all evacuation flights from Kabul to clear people who had converged on the airfield, a U.S. defence official told Reuters. He did not say till how long the pause would continue.\nNew high-resolution satellite imagery from Maxar Technologies ( made at 10:36 am local time, August 16) stored for the future generations to witness the chaos at Kabul’s Hamid Karzai International Airport in #Afghanistan as thousands of people converged on the tarmac and airport runways as countries attempt to evacuate personnel from the city.\nNew high-res #satellite imagery (10:36 am local time, August 16) of the chaotic scene underway at #Kabul’s Hamid Karzai International Airport in #Afghanistan as thousands of people converged on the tarmac & airport runways as countries attempt to evacuate personnel from the city. pic.twitter.com/L6lhlVms54\n— Maxar Technologies (@Maxar) August 16, 2021\nThe Pakistan International Airlines that had planned three special Boeing 777 flights to evacuate people from Afghanistan were cancelled after witnessing the mayham.\nAccording to Al-jazeera the Taliban fighters in the Afghan capital, Kabul, have started collecting weapons from civilians because people no longer need them for personal protection, says Taliban official.\nA Taliban in a video said situation in Kabul was under control. Special units of the Islamic Emirate have been deployed in different parts of the city to provide security.\nHe said the general public was happy with the arrival of the Mujahideen and satisfied with the security. The Mujahideen are providing security. Citizens should rest assured.\nDr M Naeem Spokesman of the Political Office of the Islamic Emirate of Afghanistan in a message shared the congratulatory message from Mullah Baradar Akhund, Deputy Political Deputy, on the victory in Afghanistan.\nپه افغانستان کې د فتوحاتو په اړه د سیاسي مرستیال محترم ملا برادر اخوند مبارکي پيغام pic.twitter.com/jKBR5bqE0v\n— Dr.M.Naeem (@IeaOffice) August 15, 2021\nHe said Islamic Emirate of Afghanistan (IEA) “has its door open for all those who have previously worked and helped the invaders, or are now standing in the ranks of the corrupt Kabul Adm[inistration] and already announced amnesty. We once again invite them all to come and serve the nation and the country.”\nThe spokesman for the Taliban’s political office had declared the war over in Afghanistan on Sunday and called for peaceful relations with the international community.\nSpokesman Mohammad Naeem said in an interview with Al Jazeera TV said the Taliban did not want to live in isolation and the type of rule and the form of regime would be clear soon. The group respected women’s and minorities’ rights and freedom of expression within Sharia law, Naeem said.\nHe said the Taliban wanted to have peaceful relations and was keen to develop several channels of communication it had already opened with foreign countries. “We ask all countries and entities to sit with us to settle any issues”, he said in the interview.\nMeanwhile in Islamabad Prime Minister Imran Khan chaired a meeting of the National Security Committee and directed to make all efforts to repatriate Pakistanis, diplomats, journalists and staff of international organizations seeking to leave Afghanistan.\nThe high level meeting attended by top Cabinet ministers and the military chiefs called on all parties in Afghanistan to respect the rule of law, protect fundamental human rights of all Afghans, and ensure that Afghan soil is not used by any terrorist organization/group against any country.\nThe NSC said now it was the time for the international community to work together to ensure an inclusive political settlement for long term peace, security and development of Afghanistan/ the region.\nTaliban took over control of entire country with a lightening speed as a highly equipped Afghan National Army, despite long training by the US army at a cost of billions of dollars surrendered in hoardes. Videos on social media from Kabul showed the Taliban greeting the ANA soldiers with open arms as they laid down the M16 assault rifles.\nA Journalist of China Xinhua News based in Kabul, Afghanistan shared a photograph of girls going to a school, a day after the fall of Kabul and said “I hope these girls are not deprived of schooling.”\nThe first day of Taliban rule in #Kabul, brave girls on their way to school.  I hope these girls are not deprived of schooling. pic.twitter.com/u8GPjRWa4D\n— jawidomid (@jawidomid) August 16, 2021\nDespite the fears of bloodshed, the fall of Kabul was relatively peaceful and not many in the city noticed that the flag of Afghanistan has been lowered on Kabul’s Wazir Akbar Khan hill.",
  "retrievedAt": "2025-08-11T21:05:27.505Z"
}
