{
  "title": "15th NA passes 100 bills in first three years as comparing 69 bills passed by previous assembly: PILDAT",
  "link": "https://www.app.com.pk/national/15th-na-passes-100-bills-in-first-three-years-as-comparing-69-bills-passed-by-previous-assembly-pildat/",
  "date_published": "2021-08-16T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):The 15th National Assembly has passed some 100 bills during the first three years as compared to 69 bills passed by previous assembly (14th National Assembly), in three years, showing 45 percent increase in the legislative business.\nAccording to a report issued by Pakistan Institute of Legislative Development and Transparency (PILDAT), the legislative activity has seen a sharp increase in the third year of the 15th National Assembly as it has passed 60 laws.\nThis is 100 percent increase over 30 bills passed in the second year by the Assembly.\nThe first year had seen the passage of only 10 bills, the reports said.\nPILDAT has released a review of performance of the third year of the 15th National Assembly from the citizens’ perspective.\nThe PILDAT analysis looked at Key Performance Indicators (KPIs) in reviewing performance of the 15th National Assembly of Pakistan as it completed third year of its 5-year term.\nIn addition to comparison between three years, the report also draws comparative analysis of performance between three years of the 15th National Assembly and the same period of 14th National Assembly.\nAnother positive development has been the decrease in the number of ordinances laid by the Government in the Assembly during the third year.\nAs many as 20 ordinances were laid in the Assembly in the third year, compared to 31 ordinances laid in the Assembly during its second year, which is a decrease of about 35 percent.\nSome 29 ordinances were laid by the previous government in the first 3 years of the 14th National Assembly compared to 58 ordinances laid by the current government in the 15th National Assembly in three years, showing 100 percent increase.\nDuring its third year, the 15th National Assembly has met for 79 working days, the report said, adding on the average, 15th National Assembly has met for 88 working days per year in its first 3 years.\nThe third year of the 15th National Assembly has also seen an average 65 percent attendance of MNAs which is slightly above the 64 percent average attendance of MNAs during the second year.\nThe combined average of MNAs attendance in first three years of the 15th National Assembly stood at 67 percent.\nThis is an improvement of 12 percent points over 55 percent average attendance of MNAs per year during the first 3 years of the previous 14th National Assembly.",
  "retrievedAt": "2025-08-11T21:05:25.069Z"
}
