{
  "title": "Pakistan summons Indian Chargé d´Affaires over ceasefire violations",
  "link": "https://www.app.com.pk/national/pakistan-summons-indian-charge-daffaires-over-ceasefire-violations/",
  "date_published": "2020-11-26T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Pakistan on Thursday summoned Indian Chargé d Affaires to the Foreign Ministry to register strong protest over ceasefire violations by the Indian occupation forces along Line of Control (LoC) on November 25, 2020.\nDue to indiscriminate and unprovoked firing by the Indian occupation forces in Bagsar Sector of the LoC, 33-year old Ansar, son of Muhammad Ashraf, resident of Garhi village, was martyred, Foreign Office spokesperson said in a statement.\nHe said the Indian occupation forces along the LoC and the Working Boundary (WB) had been continuously targeting civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons.\nThis year, India has committed 2840 ceasefire violations to date, resulting in 27 martyrdom of and serious injuries to 245 innocent civilians, he added.\nCondemning the deplorable targeting of innocent civilians by the Indian occupation forces, it was underscored that such senseless acts are in clear violation of the 2003 Ceasefire Understanding, and are also against all established humanitarian norms and professional military conduct.\nIt was told that these egregious violations of international law reflected consistent Indian attempts to escalate the situation along the LoC and are a threat to regional peace and security.\nIt was added that by raising tensions along the LoC and the WB, India could not divert attention from the grave human rights situation in the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nThe Indian side was called upon to respect the 2003 Ceasefire Understanding, investigate this and other such incidents of deliberate ceasefire violations and maintain peace along the LoC and the WB.\nThey were also urged to allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) to play its mandated role as per the United Nations Security Council (UNSC) Resolutions.",
  "retrievedAt": "2025-08-11T20:03:53.532Z"
}
