{
  "title": "Corruption remains a major problem in Asia; India tops the list: Transparency International",
  "link": "https://www.app.com.pk/national/corruption-remains-a-major-problem-in-asia-india-tops-list-in-asia-transparency-international/",
  "date_published": "2020-11-26T14:56:00.000Z",
  "source": "APP",
  "content": "A report released by Transparency International reveals that citizens across 17 countries in Asia report stagnant or rising levels of corruption, undermining equitable access to public services and trust in government.\nThe report, Global Corruption Barometer – Asia, finds that three-quarters of respondents believe that government corruption was a big problem in their country, with nearly one in five people (19 per cent) paying a bribe when accessing public services in the previous year. This is equivalent to about 836 million people.\nThe survey was conducted in Japan, South Korea, Taiwan, India, China, Malaysia, Indonesia, Thailand, Philippines, Myanmar, Nepal, Bangladesh, Cambodia, Mongolia, Sri Lanka and Maldives, between March 2019 and September 2020, in one of the largest and most detailed surveys of citizens’ views and experiences of bribery and corruption in Asia.\nAccording to the Transparency International from bribes to the use of personal connections, from vote-buying to sextortion, corruption takes many forms in Asia.\nIn its latest Global Corruption Barometer (GCB) – Asia, the report said citizens were well aware of the corruption across the region: 74 per cent of the 20,000 survey participants believe that government corruption was a big problem in their country, and 1 out of 5 people who used public services in the previous 12 months paid a bribe.\nIndia in most of the cases ranked much higher than the other 16 countries, particularly in bribery rates and use of personal connections for getting the things done. In India 89% of people believe that government corruption was a big problem, 39% said they paid bribe for public service and 46% said they used personal connections for public services, another 18% said they paid bribes in exchange for votes and 11% experienced sextortion.\nAs one of the largest surveys on corruption and bribery in the region, for the first time the GCB Asia sheds a light on vote-buying around elections, sextortion or the abuse of power to obtain a sexual benefit or advantage, and the use of personal connections in accessing public services such as health care or education.\nPersonal connections\nIn addition to bribery, the use of personal connections to access public services is also prevalent across Asia. The results found that more than one in five people (22 per cent) who accessed public services used their personal connections to receive the assistance they needed.\nWhen asked why, 24 per cent of people who paid bribes said they were asked to do so, while 30 per cent of people who used personal connections said they would not have received the service otherwise. This suggests that people are paying bribes to speed up essential services, highlighting red tape and inefficient bureaucracy, while pushing those without the means at their disposal to the back of the queue\nAge is another important factor. Young people aged 18 to 34 are more likely to pay a bribe or use personal connections than any other age group.\nElections, democracy under threat\nThe survey found corruption around elections is also prevalent. Nearly one in seven people were offered bribes in exchange for votes at a national, regional or local election in the past five years.\n“Protecting the integrity of elections is critical to ensuring that corruption doesn’t undermine democracy,” said Delia Ferreira Rubio, Chair of Transparency International.\n“Throughout the region, election commissions and anti-corruption agencies need to work in lockstep to counter vote-buying, which weakens trust in government.”\nAnti-corruption agencies, citizens offer hope\nAcross Asia, more than three out of four people (76 per cent) are familiar with the anti-corruption agency in their country, of which, 63 per cent think that the agency is doing a good job.\nPeople across the region were hopeful about the future of anti-corruption. More than three in five (62 per cent) think that ordinary people can make a difference in the fight against corruption.\nThe region was brutally but unequally hit by the COVID-19 pandemic and its economic consequences, and some countries are still suffering from these crises.\nDespite the economic and political pressure, the threats to freedom of expression and the fear of retaliation, an overwhelming majority of people believe that ordinary people can make a difference in the fight against corruption.\nThis offers a glimmer of hope and a powerful tool in the hands of reform-minded governments, businesses and civil society, the TI Survey said.\nReport by Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:03:47.294Z"
}
