{
  "title": "FM Qureshi meets OIC Secretary General in Niamey",
  "link": "https://www.app.com.pk/national/fm-qureshi-meets-oic-secretary-general-in-niamey/",
  "date_published": "2020-11-26T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Thursday met Secretary General of the Organization of Islamic Cooperation (OIC) Dr Yousef Al-Othaimeen in Niamey, the capital of Niger.\nThe meeting took place in the run up to the 47th Session of the OIC Council of Foreign Ministers (CFM), being held in Niamey on 27-28 November 2020.\nThe Foreign Minister emphasized that Pakistan, as a founding member of the OIC, attached utmost importance to the Organization as the sole and most prominent voice of the Muslim Ummah.\nThe exchange of views covered wide range of issues confronting the Muslim Ummah, including rising Islamophobia, the situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and Palestine, and challenges posed by the COVID-19 pandemic, a press release issued by the Ministry of Foreign Affairs here said.\nThe Foreign Minister conveyed Pakistan’s deep concern at the aggravating human rights and humanitarian situation in IIOJK, and India’s moves to alter the demographic structure of the occupied territory, in clear violation of UN Resolutions and International Law including the 4th Geneva Convention.\nHe expressed appreciation at the OIC’s consistent and historic support for the Kashmir cause.\nThe Foreign Minister also apprised the Secretary General about the initiative by Pakistan for adoption of a resolution on Islamophobia by the 47th CFM.\nThe Secretary General appreciated Pakistan’s role as a founding and active member of the OIC.\nThe Secretary General reaffirmed OIC’s steadfast support on the Jammu & Kashmir dispute and noted that his Special Envoy on Jammu & Kashmir visited Pakistan and AJK earlier this year and that the Special Envoy’s report would be submitted to the CFM.\nHe also shared his perspective on the issue of Islamophobia and apprised that the latest report of OIC’s Islamophobia Observatory was also due to be released at the CFM.\nOIC Secretary General’s Special Envoy on Jammu & Kashmir Ambassador Yousef Al-Dodeay, Foreign Secretary Sohail Mahmood, Pakistan’s Permanent Representative to the OIC and other senior officials were also present.",
  "retrievedAt": "2025-08-11T20:03:53.941Z"
}
