{
  "title": "FM Qureshi holds bilateral meeting with Chadian counterpart in Niger",
  "link": "https://www.app.com.pk/national/fm-qureshi-holds-bilateral-meeting-with-chadian-counterpart-in-niger/",
  "date_published": "2020-11-26T18:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Foreign Minister Shah Mahmood Qureshi on Thursday had a bilateral meeting with Chadian Foreign Minister Amine Abba-Siddick, on the sidelines of the 47th Council of Foreign Ministers (CFM) Session in Niger.\nThe exchange of views covered bilateral relations, regional developments and cooperation in multilateral fora.\nForeign Minister Qureshi highlighted that Pakistan attached great importance to its relations with Chad, which were marked by common faith, convergence of views and shared perspectives.\nThe people of two countries had deep historical linkages, with Pakistan extending support to the freedom struggle of their Chadian brethren, he added.\nThe Foreign Minister underscored the importance of deepening and expanding economic and commercial ties between the two countries.\nHe also stressed the importance of regular high-level exchanges, consultations mechanism between the Foreign Ministries, and enhanced cooperation in security and CT (Communications Technology) fields.\nThe Foreign Minister stated that, in line with Prime Minister Imran Khan’s vision, Pakistan had embarked on the “Engage Africa” initiative. The policy, inter alia, envisages greater collaboration with Chad and deepening of bilateral cooperation in diverse fields.\nHe apprised the Chadian Foreign Minister of the aggravating human rights and humanitarian situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) in the aftermath of India’s illegal and unilateral actions since 5 August 2019, and India’s moves to alter the demographic structure of the occupied territory, in clear violation of the 4th Geneva Convention.\nThe Foreign Minister also highlighted the issue of rising wave of Islamophobia in various parts of the world, while underscoring the need to strengthen the role of OIC to combat this menace.\nThe Chad Foreign Minister underlined the high importance Chad attached to its relations with Pakistan.\nHe welcomed Pakistan’s growing engagement with Africa and underscored Chad’s intention in developing cooperation in trade, investments, industry and security fields.\nThe two Ministers also discussed issues related to the Organization of Islamic Cooperation (OIC) and the Muslim Ummah. They agreed to remain in close contact.",
  "retrievedAt": "2025-08-11T20:03:52.900Z"
}
