{
  "title": "Parliamentary body reviews progress of CPEC",
  "link": "https://www.app.com.pk/national/parliamentary-body-reviews-progress-of-cpec/",
  "date_published": "2020-11-26T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): The Parliamentary Committee on China-Pakistan Economic Corridor (CPEC) met here to discuss various matters of the mega project including China Pakistan Free Trade Agreement (CPFTA) Phase-II and Afghan Pakistan Preferential Trade Agreement (APPTA) agreement.\nThe committee also deliberated upon the issues pertaining to Special Economic Zones (SEZs) Act, Rules and proposed regulations for Zone Enterprise Admission and sale of plots and Foreign Direct Investment (FDI), local investment and Pakistan’s regional competitiveness in terms of Industrial Trade and Investment.\nThe meeting that was held here under the chairmanship of Sher Ali Arbab noted that there is a greater need to pursue holistic and pragmatic approach for the inclusion of projects relating to socio-economic development under CPEC framework so that rest of money left out of 1 billion dollar grant could effectively and efficiently be utilized on priority areas and in less developed regions to bring them into mainstream and ensure shared economic progress and prosperity.\nThe Chairman said that the world is increasingly moving towards complex interdependence. Economy and trade should be our strategic instruments in these modern times.\nHe further observed that at the heart of CPEC is trade and commerce and Pakistan’s economy will not flourish unless we increase our trade volume with other countries of the world especially with China with whom CPEC engagement is also moving forward.\nPakistan has to embrace value addition in exports rather than only relying on increasing production capacity.\nIn this regard, Commerce Ministry and all other concerned need to look into market areas of China where we could export our locally manufactured products to make Pakistan an attractive destination for Chinese imports.\nMoreover, while signing Free Trade Agreements (FTAs) and Preferential Trade Agreements (PTAs) the concerned need to protect local industries from shrinking and encourage and incentivize the industries which have comparative advantage and performing well in terms of paving the way for enhancing exports.\nSecretary, M/o Commerce informed the Committee that currently favorable business environment prevails between Pakistan and Afghanistan due to important role played by Parliamentary Friendship Groups between Pak-Afghan Parliaments.\nThe efforts, rendered by the Parliament of Pakistan, to plug mutual trust-deficit between Pakistan and Afghanistan were highly appreciated.\nThe Chairman remarked that Afghanistan is highly keen to do business with Pakistan.\nAll the concerned have to ensure that problems lying on our side are resolved promptly so as to attract maximum investment from Afghanistan and the trade between two countries may further flourish.\nIn terms of Pakistan trade with China and Afghanistan, the Chairman directed Ministry of Commerce to provide strategy document regarding why the exports in certain goods have declined and in what products Pakistan has comparative advantage so that the list of the products could thoroughly be examined by the Committee and bottlenecks may be removed.\nThis is how Pakistan can increase its exports and protect its local industries.\nThe Chairman observed that “we need to focus on trade facilitation rather than tariff rationalization”.\nMeanwhile the Chairman noted that issues pertaining to the provision of facilities to foreign investors be resolved timely so that the country could move towards ease of doing business and make Pakistan an attractive destination for foreign direct investment.\nThe meeting was attended by MNAs Noor Alam Khan, Umer Aslam Khan, Mir Khan Muhammad Jamali, Nafeesa Inayatullah Khan Khattak, Ghous Bux Khan Mahar, Ahsan Iqbal Chaudhry, Murtaza Javed Abbasi, Zahid Akram Durrani, and Senator Mir Kabir Ahmed Muhammad Shahi.",
  "retrievedAt": "2025-08-11T20:03:54.887Z"
}
