{
  "title": "PM directs payment of compensation for damaged houses till March 11",
  "link": "https://www.app.com.pk/national/pm-directs-payment-of-compensation-for-damaged-houses-till-march-11/",
  "date_published": "2024-03-06T13:34:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 06 (APP): Prime Minister Muhammad Shehbaz Sharif Wednesday directed to ensure payment of compensation to the owners of houses damaged by rains and snowfall in Khyber Pakhtunkhwa till March 11.\nThe prime minister issued the directives while presiding over a high level meeting to the Governor House to review damages caused by the recent rains and snowfall in Khyber Pakthunkhwa and rescue and rehabilitation efforts.\nBesides others, the meeting was attended by Senator Ishaq Dar, Members of the National Assembly Khawaja Muhammad Asif, Attaullah Tarar, Engr Amir Muqam and Murtaza Javed Abbasi, and National Disasters Management Authority (NDMA) Chairman Lt Gen Inam Haider Malik.\nThe prime minister was also given a detailed briefing on the measures taken by the provincial administration, Provincial Disaster Management Authority, NDMA and National Highway Authority.\nIt was informed that a total of 40 persons were killed and 62 injured in the rain-related incidents across the province. Similarly, 635 houses were completely or partially damaged.\nOn the prime minister’s directives, the compensation of Rs 2 million each to the heirs each deceased and Rs 500,000 each to the injured, besides Rs 700,000 each for fully damaged and Rs 350,000 partially damaged houses, was being being given.\nIt was further informed that all main highways in the affected areas were partially opened as work on clearing landslides and snow was still underway.\nThe meeting was told that all the departments were fully prepared to cope with any emergency situation that might arise due to expected snowfall in next few days.\nThe prime minister said that the Federal Government stood with the affected people of KP in the hour of hardship and tribulation and would provide them maximum support.\nHe directed all the relevant organizations and departments to take part in the relief and rehabilitation activities in the affected areas.\nHe also directed the NDMA to join hands with the district and provincial administrations by taking every possible measure for speedy completion of the rescue and rehabilitation operations.",
  "retrievedAt": "2025-08-11T01:09:30.211Z"
}
