{
  "title": "Experts warn of early solution of food security issues amid severe climate crisis",
  "link": "https://www.app.com.pk/national/experts-warn-of-early-solution-of-food-security-issues-amid-severe-climate-crisis/",
  "date_published": "2024-03-06T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP): Sustainable Development Policy Institute Executive Director Abid Qaiyum Suleri emphasized the need to address the food security crises amidst worsening climate challenges, which has transcended into a human security challenge.\nHe was speaking at a seminar titled, “Climate Change and Impacts on National Security of Pakistan” organized jointly by Sustainable Development Policy Institute here on Wednesday.\nHe said that climate change is threatening Pakistan’s national, socio-economic and macro-economic stability with the country ranking 14th for economic and 25th for economic losses per unit GDP globally.\nChairperson SDPI Board of Governors, Ambassador Shafqat Kakakhel, said that Indus Water Treaty has delivered well on the agenda of water security and avoided water-driven conflicts between India and Pakistan. While India has constructed several power projects on Indus, Jhelum and Chenab, the permitted water capacity has not been availed yet, he highlighted.\nHe further said that as climate change exacerbates water insecurity and diplomatic efforts stalled, threat of water-driven conflict looms and seek the intervention of Asian Development Bank and International Centre for Integrated Mountain Development for multi-crisis diplomacy and peaceful resolution of crisis.\nPresident of Institute of Regional Studies, Ambassador Nadeem Riyaz, emphasized leveraging dialogues, working groups, water sharing data, regulatory treaties and think-tank collaboration while diplomacy is difficult between India and Pakistan.\nHe said that without political will and diplomacy there is no permanent and effective solution to the crisis.\nClimate Change Specialist, Ali Tauqeer Shiekh said that without multilateral diplomacy, there is no effective solution to the water crisis irrespective of national water management efforts. He added that climate issues must be delinked otherwise they will continue to be held hostage of security and border issues between the two countries.\nExecutive Director, Civil Society Coalition for Climate Change (CSCCC),  Aisha Khan, called for adoption of three focal lens for national security aligning food, water and population considerations, shift to regenerative agriculture and implement research backed agriculture practices. She highlighted thar alarming levels of stunting and wasting is an emerging threat for development.\nVice Chancellor, University of Agriculture Faisalabad Dr Iqrar Ahmed Khan, stressed the need for shifting from flooded irrigation to vertical hydroponic agriculture, farm mechanization.\nHe said genetic modified crops can address water wastage as well as food and climate issues. He added that the government intervention must allow market drivers to reset cropping patterns and increase farmers’ adoption of cropping suggested according to the agroecological zones.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:09:52.114Z"
}
