{
  "title": "Over 62 million people to benefit as KOICA, UNOPS complete water quality monitoring project",
  "link": "https://www.app.com.pk/national/over-62-million-people-to-benefit-as-koica-unops-complete-water-quality-monitoring-project/",
  "date_published": "2024-03-06T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 06 (APP): In partnership with KOICA, UNOPS Pakistan is supporting the Ministry of Climate Change to strengthen the technical and coordination capacity of the Government of Pakistan to monitor drinking water quality in close collaboration with Punjab and KP provincial governments, PCRWR and Pak-EPA.\nThis project will benefit over 62 million people in the provinces of Khyber Pakhtunkhwa and Punjab & Islamabad, said a press release.\nIn an event held in Islamabad, Senator Mr. Muhammad Sabir Shah (Chief Guest), Senator Ms. Keshoo Bai, Ms. Samar Ihsan, Additional Secretary EAD, Ms. Sadia Sarwat, Additional Secretary Ministry of Climate Change, Park Ki Jun, Ambassador of the Republic of Korea, Yeon Je Ho, Country Director KOICA Pakistan and Ms Jennifer Ankhom-Khan, Country Manager UNOPS Pakistan, attended the closing ceremony of the project “Enhancing Water Quality Monitoring System to achieve SDG 6 in Islamabad, Punjab and KP”\nAcknowledging the fundamental right to clean and safe drinking water, the initial and vital step is monitoring its quality. Pakistan faces a significant challenge, with almost 44% of the population lacking access to safe drinking water.\nIn response, the Korea International Cooperation Agency (KOICA) collaborated with UNOPS Pakistan to enhance water quality monitoring systems in Islamabad, Punjab, and Khyber Pakhtunkhwa (KP), Pakistan.\nUNOPS Pakistan is implementing this project in collaboration with the Ministry of Climate Change Pakistan (MoCC), Pakistan Council of Research in Water Resources (PCRWR), Pakistan Environmental Protection Agency (Pak-EPA) and Public Health and Engineering Departments of Government of Punjab & KP.\nThe $4.4 million project has been implemented in 35 district laboratories in Punjab, 8 divisional labs in KP and research and monitoring laboratories, PCRWR and Pak-EPA, in Islamabad.\nThe project includes significant upgrades to water-quality testing laboratories, encompassing the procurement and installation of advanced laboratory equipment, minor infrastructure enhancements to ensure a safe working environment, capacity-building initiatives for laboratory staff and the WASH Cell of the MoCC, the introduction of a Management Information System (MIS) for improved coordination, and the provision of 8 vehicles transformed into water-quality testing laboratories for the Government of KP and 1 vehicle for PCRWR.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:10:43.728Z"
}
