{
  "title": "Imam Hussain’s sacrifice teaches great sacrifices needed for great causes: Tarar",
  "link": "https://www.app.com.pk/national/imam-hussains-sacrifice-teaches-great-sacrifices-needed-for-great-causes-tarar/",
  "date_published": "2024-07-16T11:52:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 16 (APP): Federal Minister of Information, Broadcasting, National Heritage and Culture Attaullah Tarar here on Tuesday said that the incident of Karbala had taught the lesson that great sacrifices were needed for the great causes.\n“Lesson of the sacrifice of Imam Hussain ( A.S) was that no tyrant and oppressor should be allowed to play with the truth” he said during his visit to Imambargah Kashan Abbas to review the security arrangements here,\nThe minister said that the incident of Karbala was the difference between truth and falsehood until the Day of Resurrection.\n“The courage, patience, independence and prudence of all the companions of Imam Hussain are the beacon of light for us,” he maintained.\nTarar said that the battle between the forces of truth and falsehood continued even in this era. He said that today, the need to promote the spirit of self-sacrifice was needed more than ever.\nThe information minister inspected the route of the procession while also reviewing the security arrangements during the Majalis. He also met the organizers, mourners present in the Imambargah.\nOn this occasion, Syed Khurram Abbas Naqvi, administrator of Imambargah Kashan Abbas, briefed the federal minister regarding the security arrangements.\nAtaullah Tarar appreciated the arrangements and expressed his satisfaction over it. He said that the administration was in contact with all schools of thought for the maintenance of law and order in the holy month.\nPolice and administration are on alert to maintain peace during Muharram, he said adding fool-proof measures have been taken for the safety of the participants of Majalis and processions.",
  "retrievedAt": "2025-08-11T03:56:34.725Z"
}
