{
  "title": "Interior minister reviews security for 9th Muharram procession in Islamabad",
  "link": "https://www.app.com.pk/national/interior-minister-reviews-security-for-9th-muharram-procession-in-islamabad/",
  "date_published": "2024-07-16T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP): Federal Interior Minister Mohsin Naqvi here on Monday visited the main procession of the 9th of Muharram and personally reviewed the security arrangements put in place to protect mourners.\nThe interior minister inspected the procession route, met with organizers to inquire about arrangements and gave instructions to IG Islamabad Police Ali Nasir Rizvi and CDA Chairman Muhammad Ali Randhawa regarding security protocols.\nHe also conducted an aerial inspection of the entire procession route, ensuring that all necessary measures were in place.\nThe minister emphasized the importance of maintaining a high level of security throughout the mourning period, instructing the security personnel to remain on duty until the procession’s conclusion.\nHe also issued directives for the implementation of a special security plan across all four provinces, Gilgit-Baltistan and Azad Kashmir, ensuring strict adherence to the plan.\nThe use of drones in processions and gatherings has been banned nationwide.\nMohsin Naqvi highlighted the collaborative efforts of police, administration and law enforcement agencies in ensuring peace and order including the deployment of snipers on rooftops along procession routes.\nHe assured the public that the federal government was providing all necessary support to maintain peace in Islamabad, Azad Kashmir and Gilgit-Baltistan.\nThe minister also instructed the officials to implement an alternative plan for rallies and gatherings in case of rain and to strictly enforce the code of conduct across the country.\nFederal Interior Secretary Khurram Ali Agha, DIG and the Deputy Commissioner were also present during the inspection.",
  "retrievedAt": "2025-08-11T03:56:33.944Z"
}
