{
  "title": "Dr Firdous lauds Sialkot exporters for Air Sial Airline",
  "link": "https://www.app.com.pk/national/dr-firdous-lauds-sialkot-exporters-for-air-sial-airline/",
  "date_published": "2020-12-06T16:59:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Dec 6 (APP):Special Assistant to Chief Minister Punjab on Information Dr Firdous Ashiq Awan has said the exporters have written golden history after establishing the Sialkot International Airport and Air Sial Airline on self help basis.\nShe expressed these views while talking to the media at Air Sial Airline office here on Sunday.\nSpecial Assistant to the Prime Minister on Youth Affairs Usman Dar, Provincial Minister\nfor Special Education Ch Muhammad Ikhlaq, Chairman Air Sial Airline Fazal Jillani, CEO Air Sial Ameen Ahsan, Sialkot Chamber of Commerce and Industry (SCCI) President Qaisar Iqbal Baryar and the business community were also present.\nShe said the Sialkot exporters had proved a unique example of self help by establishing this airline after the Sialkot International Airport. She added that the dream of exporters of having their own private airline had become true.\nShe greeted the exporters for successfully completing the mega project of establishing the Air Sial Airline on self help basis after the Sialkot International Airport.\nShe said that Sialkot was paying taxes of billions of rupees to the provincial and federal governments and it was also playing a pivotal role in strengthening national economy by earning US $ 2.5 billion annually.\nShe said the Air Sial Airline was going to connect the world with Sialkot. Dr Firdous added that the Air Sial Airline would become recognition of people of Sialkot around the globe.\nThe government was providing all possible facilities and incentives to industrialists, traders and investors, she said and added that Pakistan was successfully moving ahead towards national development and prosperity under the dynamic leadership of Prime Minister Imran Khan.\nShe said the government was strengthening economy by promoting the private sector but the opposition was spreading chaos and unrest.\nDr Firdous said the PTI government was doing a lot for Sialkot and wanted to do more for its people.\nShe said the Punjab Intermediate City Improvement Programme was being launched in two cities with the financial support of the Asian Development Bank.\nShe said in Sialkot, under the Punjab Intermediate City Improvement Programme, Rs 16 billion will be spent on replacement of water supply lines, upgrade of sewerage system, supply of state-of-the-art solid waste management machinery, water treatment plants, bus terminal and parks upgradation.\nThe problems of people would be resolved and their living standard will also be raised, she said.\nKeeping in view needs of the next 30 years, supply and drain projects would be completed, she added.\nLike the rest of the world, coronavirus epidemic was spreading in Punjab, she said and added that 662 new cases were reported today.\nDr Firdous said the opposition was calling for a rally in Lahore on December 13 despite an increase in the cases of coronavirus. She said that the opposition wanted to derail the country’s economy.\nTo a question, she said those who plundered the country’s resources with both hands would go to jail.\nOn this occasion, Special Assistant to the Prime Minister on Youth Affairs Usman Dar said that development projects should be completed as soon as possible in the public interest.\nHe said that mega water supply, up gradation of parks and sewerage projects in the city had been finalized for providing advanced facilities to people of the city.\nHe said a modern hospital with 250 beds was going to be built in Sialkot at a cost of Rs 5.1 billion to provide the best medical facilities to people. Dar added that completion of these projects would directly benefit the citizens.",
  "retrievedAt": "2025-08-11T20:06:09.946Z"
}
