{
  "title": "PM Shehbaz, Chinese premier speak over telephone, agree to enhance bilateral cooperation",
  "link": "https://www.app.com.pk/national/pm-shehbaz-chinese-premier-speak-over-telephone-agree-to-enhance-bilateral-cooperation/",
  "date_published": "2023-04-27T06:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP):Prime Minister Muhammad Shehbaz Sharif and the Premier of China Li Qiang, spoke over the telephone on Thursday wherein they agreed to enhance their cooperation in all spheres so as to realize shared objectives of benefiting peoples of their countries, while also contributing to regional peace, prosperity and stability.\nThe conversation was marked by traditional warmth and cordiality that has always characterized Pakistan-China All-Weather Strategic Cooperative Partnership, the Prime Minister office said.\nThe Prime Minister extended his warm congratulations on the Chinese Premier’s recent election to this high office, which reflected the deep-seated trust of the Chinese nation and confidence in him, stemming from his many achievements in public service.\nAs All-Weather partners and close friends, Pakistan appreciated China’s peaceful development as a positive factor of international peace and stability, and was confident that China would continue to achieve milestones on its journey towards modernization and rejuvenation.\nThe Prime Minister reiterated Pakistan’s unstinting support to China on its core issues, including the “One China” policy, Taiwan, Tibet, Xinjiang, Hong Kong, and the South China Sea. He expressed Pakistan’s sincere gratitude for China’s principled position on the Jammu & Kashmir dispute, and support for Pakistan on core issues.\nThe Chinese Premier appreciated Pakistan’s support for China and reaffirmed China’s continuing support to Pakistan’s national development, sovereignty and territorial integrity. As an All-Weather Friend, China would continue to stand with Pakistan at all times.\nRecalling the Prime Minister’s visit to China in November 2022 and wide-ranging conversations with President Xi Jinping and the Chinese leadership, the two leaders took stock of bilateral cooperation in key areas, including China Pakistan Economic Corridor (CPEC).",
  "retrievedAt": "2025-08-11T08:23:27.036Z"
}
