{
  "title": "President for urgent blood donations for Thalassemia patients as lockdown intensifies shortage",
  "link": "https://www.app.com.pk/national/president-for-urgent-blood-donations-for-thalassemia-patients-as-lockdown-intensifies-shortage/",
  "date_published": "2020-04-03T02:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP):President Dr Arif Alvi on Friday called for urgent blood donations to fulfill the needs of Thalassemia patients in the country who faced shortage of blood supplies due to lockdown amid Coronavirus pandemic.\nDuring his visit to Pakistan Thalassemia Centre in F-9 Park, the President said motivation of volunteer donors during the ongoing situation was important to save the lives of Thalassemic children that solely depended on regular blood transfusion.\nThalassemia is an inherited blood disorder characterized by decreased production of hemoglobin and thus needs regular blood transfusion from a healthy person.\nPresident Alvi urged upon adults particularly students to come forward and join the noble cause of life-saving and donate blood at their nearest collection centres set up across the country.\nHe said suspension of inter-city transport also affected the treatment of children who came from far-flung areas.\nIn this regard, the President said, he contacted health ministers of Punjab and Sindh and urged them to search for blood donors and arrange supplies for the Thalassemia patients.\nPresident Alvi stressed observing necessary precautions to help control spread of Coronavirus as more exposure meant more administration of anti-viral dosage.\nHe expressed confidence that Pakistan would soon overcome the challenge of the infectious disease.\nThe President met the children with Thalassemia admitted at the Centre for blood transfusion, inquired about their health and distributed gifts among them.\nHe also interacted with a number of policemen who voluntarily donated blood for Thalassemic children at the Centre.\nDr Alvi lauded the joint efforts of Pakistan Baitul Mal, Inspector General Police and Sundas Foundation for arranging blood transfusion for Thalassemia patients.\nManaging Director Baitul Mal Aon Abbas Buppi gave a briefing to the President about the working of Centre for Thalassemic children.\nAccording to a report, approximately 100,000 patients are suffering from Thalassemia in Pakistan and every year 5,000 babies are born with this deadly disease.",
  "retrievedAt": "2025-08-11T19:02:34.939Z"
}
