{
  "title": "Power Division’s attached departments deposit Rs.113 million in PM relief funds",
  "link": "https://www.app.com.pk/national/power-divisions-attached-departments-deposit-rs-113-million-in-pm-relief-funds/",
  "date_published": "2020-04-02T23:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP):The attached departments of Power Division have deposited Rs 113 million in the Prime Minister’s COVID-19 Pandemic Relief Fund – 2020 to end financial sufferings of the people affected due to the economic slowdown caused by the coronavirus.\nAccording to a Power Division press release, the Oil and Gas Development Company Limited (OGDCL) has contributed about Rs 53 million to the fund.\nThe company has also offered its hostel building in Sector I-9, Islamabad for being used as a quarantine/isolation centre along with a well-equipped ambulance, 50 PPE (personal protection equipment) kits for medical staff, and provision of medicines and food.\nThe Pakistan Petroleum Limited (PPL) has also released a handout of Rs10 million for four districts of Sindh with the spirit of cash-support for procurement of necessary equipment in the province to combat the COVID-19 pandemic.\nSimilarly, the Pakistan State Oil (PSO) has deposited Rs 50 million in the prime minister’s relief fund realising its national responsibility in the challenging time.\nBoth the gas utilities, Sui Northern Gas Pipelines Ltd and Sui Southern Gas Company Ltd also undertook immediate measures to facilitate the people during the COVID-19 pandemic.\nThe SNGPL Bill App, recently launched by the company, helped the public to view their gas bills and pay the same through the mobile application. Same mobile App will be made available by the SSGC soon.\nMoreover, the gas bills of next crucial months can be paid through three easy installments amid the COVID-19 crisis.\nIn addition to above, the prices of petroleum products have already been reduced by Rs.15 to provide relief to the common man. It was part of the economic relief package announced by Prime Minister Imran Khan for the people.\nThe Petroleum Division was working round-the-clock to facilitate the public through dedicated teams to ensure supply and availability of gas and oil across the country, the press release said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:02:44.623Z"
}
