{
  "title": "PDM Chief advises residents to exercise caution during extreme monsoon spell",
  "link": "https://www.app.com.pk/national/pdm-chief-advises-residents-to-exercise-caution-during-extreme-monsoon-spell/",
  "date_published": "2024-08-16T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):Chief Meteorologist, Pakistan Meteorological Department Sardar Sarfaraz on Friday forecasted an intense monsoon spell across the region until August 19.\nHe said the concerned authorities strongly advised people living around rivers to exercise extreme caution and remain vigilant to mitigate the impending calamity.\nTalking to a private news channel, he reminded residents to stay vigilant and take necessary precautions to ensure their safety, adding that people living near nullahs and rivers asked to follow evacuation orders and prioritize their safety above all.\nThe situation is grave, but with precautions the impact of the disaster can be mitigated, he assured.  Chief Meteorologist Sardar Sarfaraz said that monsoon winds are expected to enter lower Sindh from August 16.\nHe said Karachi is likely to experience moderate rain with thundershowers between August 17 and 19.  “Heavy rain may occur in some areas,” he noted.  In anticipation of further monsoon activity, the National Disaster Management Authority (NDMA) has issued an urban flooding alert for parts of Khyber-Pakhtunkhwa until August 18, he added.\nThe alert of heavy rainfall, flash flooding, and urban flooding in low-lying areas, posed a significant threat to life and property, he said. Residents in affected areas are advised to exercise extreme caution, avoid traveling to flood-prone areas, and stay tuned for updates, he stressed.\nThe NDMA has also directed local authorities to take necessary precautions, including evacuating high-risk areas, setting up emergency shelters, and ensuring the availability of emergency supplies, he mentioned.\nWith the monsoon spell expected to intensify, residents are urged to take necessary precautions to ensure their safety and the safety of their loved ones, he mentioned. He said emergency control rooms are fully operational, and rescue teams are prepared to respond to any disaster situations.\nThe staff in the emergency control rooms and Rescue 1122 disaster response teams should also be kept on high alert, he said. With the urban flooding alert in place, all resources are being mobilized to ensure a swift and effective response to any emergencies that may arise, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:42:19.757Z"
}
