{
  "title": "Senate body stresses modernization of Pakistan Railways",
  "link": "https://www.app.com.pk/national/senate-body-stresses-modernization-of-pakistan-railways/",
  "date_published": "2024-08-16T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): The Senate Committee on Railways emphasized on Thursday that the modernization and enhancement of the railway system are crucial for ensuring the long-term well-being and prosperity of the nation.\nThe Committee’s meeting was chaired by Senator Jam Saifullah Khan.\nDuring the session, the Committee discussed measures to control corruption within the railway system and inquired about the number of officials held responsible or penalized for corruption charges over the past five years.\nSenator Shahadat Awan suggested that the Ministry of Railways provide comprehensive details regarding instances of fraud within the department. He further argued that attributing the entire loss to pension issues is not justifiable.\nSenator Jam Saifullah Khan, Chairman of the Committee, recommended that the Ministry deliver a detailed briefing on the issues raised by Senator Shahadat Awan, particularly concerning theft, corruption, monetary losses, and the actions taken against the perpetrators.\nThe Secretary of the Ministry of Railways informed the Committee that there is a clear directive of zero tolerance for corruption. He added that the Ministry is prepared to scrutinize matters as extensively as this august house deems necessary.\nHe emphasized that the Ministry will thoroughly review audit reports, guided by the Committee’s direction, and assured the Committee that all decisions will be made in strict accordance with rules and regulations.\nThe Committee members also engaged in an in-depth discussion on the ML-1 Project. Senior officials provided a briefing on the project’s operations, key milestones, and the status of existing railway lines.\nSenator Kamil Ali Agha inquired about the cessation of railway tracks following recent floods. It was reported that despite the complications caused by the floods, the ML-1 design is structured with environmental resilience in mind.\nOfficials asserted that the project is transformational for the Railways.\nSenator Jam Saifullah Khan recommended that the Ministry ensure the loan for this project is cost-effective and results in reduced travel time, as well as positive environmental impacts.\nIn response, the Secretary reiterated that the project is indeed cost-effective and includes favorable conditions for loan repayment. He also mentioned that private-sector investment is being sought for the project.\nSenator Kamil Ali Agha suggested that the Ministry of Railways present the original plan for the ML-1 project and review the reasons for changes in its financial cost and structural design.\nHe further recommended that the Ministry brief the Committee on the steps taken to incorporate measures addressing climate change in light of the heavy rains and floods in the country. Chairman Senator Jam Saifullah Khan emphasized the importance of prioritizing the ML-1 project and expediting its progress.",
  "retrievedAt": "2025-08-11T04:41:31.530Z"
}
