{
  "title": "COAS appreciates Arshad Nadeem’s remarkable achievement at Paris Olympics, attributes his commitment, perseverance",
  "link": "https://www.app.com.pk/national/coas-appreciates-arshad-nadeems-remarkable-achievement-at-paris-olympics-attributes-his-commitment-perseverance/",
  "date_published": "2024-08-16T13:29:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 16 (APP): Chief of Army Staff (COAS), General Syed Asim Munir on Friday appreciated Arshad Nadeem’s remarkable achievement of winning Pakistan’s first-ever gold medal in a singles’ event and setting a new Olympic record in javelin throw, attributing it to his commitment, perseverance, and passion for excellence.\nThe Army Chief hosted a ceremony at Army Auditorium GHQ to honour Olympian Arshad Nadeem’s historic achievement in Paris Olympics 2024 here, an Inter Services Public Relations (ISPR) news release said.\nThe COAS highlighted Arshad’s inspirational journey from humble beginnings to achieving greatness, emphasizing the importance of hard work and determination.\nThe Army Chief recognized Arshad Nadeem’s achievement as a national pride and highlighted that he has been honoured by the complete nation befitting his achievement.\nThe COAS reaffirmed the commitment to support and empower not only sportsmen, but the entire wealth of Pakistani youth to achieve excellence towards a prosperous Pakistan. The COAS highlighted the need for Youth Engagement, Development and Entertainment as essential cardinals of a healthy and prosperous society.\nThe event was attended by sports teams and legendary olympians including 1984 Olympic and National Hockey Teams, National Cricket Team, Street Football Team, Army Polo Team, Visually Impaired Cricket and Women Goal Ball Teams, Medal Winners of Common Wealth, SAF and Asian Games and participants of Paris Olympics 2024. Notable legends included Jehangir Khan, Isalah Ud Din, Shahbaz Senior, Sohail Abbas, Muhammad Asif and Aisam-ul-Haq. The event was also attended by Arshad Nadeem’s close relatives, associates and coaches.\nAthlete, Arshad Nadeem expressed gratitude and emphasized the immense potential of Pakistani youth, stressing the importance of hard work, positivity, and perseverance in overcoming challenges and achieving success.",
  "retrievedAt": "2025-08-11T04:42:49.140Z"
}
