{
  "title": "2,500 police personnel to perform duties on Eid",
  "link": "https://www.app.com.pk/national/2500-police-personnel-to-perform-duties-on-eid/",
  "date_published": "2022-07-08T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP): Islamabad Capital Territory (ICT) Police on Friday announced to deploy 2,500 personnel at Eid congregations, public places, shopping malls and other important buildings to prevent any suspicious activities.\nAccording to the spokesperson, the capital police have chalked out a comprehensive security plan to maintain peace and tranquility in the district on the eve of Eid-ul-Azh.\nHe said that following special orders of the IGP Islamabad Dr. Akbar Nasir Khan a comprehensive security plan for Eid Ul Azha prayer has been issued.\nAccording to the security plan, more than 1000 police personnel, including 4 SPs, 11 ASP/DSPs will shield Eid prayers to be offered in 1032 mosques and 28 imambargahs which have been categorized according to their sensitivity.\nLikewise, more than 100 police personnel will be deployed at Faisal Mosque to provide security cover to the devotees.\nAll the mosques, imambargahs, religious places, public parks and other important places would be provided maximum security on Eid adding that DIG Operations Sohail Zafar Chatha will monitor all the security arrangements in the city. Security of the city will also be monitored through safe city cameras and special police squads.\nLikewise, 800 personnel of the Eagle squad will be deputed in the city for patrolling all public and sensitive places while more than 150 personnel of the special branch will perform their duties during Eid prayer.\nSimilarly, 278 traffic officials, including one SP and 4 DSPs are deployed to ensure a smooth flow of traffic in the city.\nSSP Traffic will monitor the traffic arrangements. One wheeling will not be allowed and those violating traffic rules will be dealt with iron hands while public places, parks, and playgrounds will be kept under strict vigilance and security cover.\nIGP Islamabad,Dr Akbar Nasir Khan has strictly directed all the zonal officers that a large number of people will gather for Eid prayer and the concerned zonal officers would be responsible of the security around worship places in their respective areas.\nHe also asked for the physical presence of the SPs, SDPOs and SHOs in their respective areas.\nHe said that the eagles, falcons and police station vehicles will patrol around worship places, public as well as important places and buildings while special police teams of CTD will be deployed in Bhara Kahu areas.\nIslamabad police chief maintained that the purpose of all the security arrangements is to ensure the safety of congregations, avert any terrorist activity and maintain peace in the city.",
  "retrievedAt": "2025-08-11T15:13:12.418Z"
}
