{
  "article_id": "2025-09-11_d908ccc0e285622b8ddad5bd10cb0b4c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-assures-qatari-leadership-of-pakistans-full-support-amid-unjustified-israeli-provocation/",
    "retrieved_at": "2025-09-19T16:49:13.174Z"
  },
  "metadata": {
    "title": "PM assures Qatari leadership of Pakistan’s full support amid unjustified Israeli provocation",
    "author": null,
    "date_published": "2025-09-11T15:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 492,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "DOHA, Sep 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday assured the Qatari leadership of Pakistan's full solidarity and support in the face of unjustified provocation by Israel. The prime minister, during his meeting with the Amir of Qatar Sheikh Tamim bin Hamad Al Thani, the prime minister conveyed Pakistan's strongest condemnation of the Israeli attack on Doha on September 9, terming it a blatant and flagrant violation of Qatar's sovereignty and territorial integrity. He also conveyed deep sympathies on the loss of precious lives in this dastardly and heinous attack by Israel and prayed for speedy recovery of the injured. PM Shehbaz Shari undertook an official visit to the State of Qatar to express solidarity with the people and the leadership of the State of Qatar in the wake of the recent Israeli attack on Doha. The prime minister said that the leadership and people of Pakistan were deeply disturbed by this attack against the brotherly State of Qatar, that constituted a serious breach of international law. While reaffirming the historic, fraternal bonds between Pakistan and Qatar, the prime minister stated that the two countries had proudly stood with each other through thick and thin. It was in this spirit of brotherhood that Pakistan stood shoulder to shoulder withthe Amir, the Royal Family of Qatar and with the brotherly people of Qatar during this challenging time. He assured the Qatari leadership of Pakistan's full solidarity and support in the face of this unjustified provocation. He also conveyed deep sympathies on the loss of precious lives in this dastardly and heinous attack by Israel and prayed for speedy recovery of the injured. The prime minister emphasized that Israel's brazen aggression in the Middle East must be stopped and the Ummah needed unity among its ranks in the face of Israeli provocations. The prime minister appreciated Qatar's responsible, constructive and mediatory role in efforts to bring peace in Gaza, and stressed that such acts of Israeli aggression were clearly meant to undermine regional stability and threaten ongoing diplomatic and humanitarian efforts. PM Shehbaz Sharif said that at Qatar's request, Pakistan had requested for an emergency session of the UN Security Council to discuss the recent developments in the Middle East. He also welcomed Qatar's decision to host an Extraordinary Arab-Islamic Summit on September 15, and said Pakistan had indicated its willingness to the OIC to co-sponsor and co-convene this Summit. The prime minister also thanked the Amir for Qatar's strong support for Pakistan during its stand off with India earlier this year. The Amir of Qatar thanked the Prime Minister for his thoughtful gesture of visiting Doha to express his solidarity with Qatar at this time. Both leaders agreed to maintain close coordination in promoting regional peace, upholding international law and supporting the legitimate rights of the Palestinian people. This visit reaffirmed the deep rooted brotherly ties between Pakistan and Qatar and their shared commitment to peace and stability in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}