{
  "title": "Realistic, futuristic training imperative for maintaining operational readiness: COAS",
  "link": "https://www.app.com.pk/national/realistic-futuristic-training-imperative-for-maintaining-operational-readiness-coas/",
  "date_published": "2021-06-12T11:55:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 12 (APP): Chief of Army Staff (COAS) General Qamar Javed Bajwa Saturday said realistic and futuristic training corresponding to evolving threat was imperative for maintaining operational readiness.\nArmy Chief General Qamar Javed Bajwa, visited Sialkot and Kotli and addressed the troops undergoing various military exercises, said an Inter Services Public Relations (ISPR) news release here received.\nThe COAS attended closing session of Corps level war game at Sialkot where he was briefed on planning parameters and conduct modalities of the exercise.\nThe war game was based on defensive operations cycle of a corps under conventional battle field environment in line with Operational and Planning Directives of Pakistan army.\nCOAS appreciated sound planning and befitting application of varying operational response options to crystallise future plans in view of evolving threat matrix.\nEarlier on his arrival COAS was received by Corps Commander Lieutenant General Syed Asim Munir.\nCOAS also visited troops undergoing field training near Kotli at the conclusion of Corps level Field exercise “Takskheer-e-Jabal”.\nCOAS was briefed about conduct of ongoing exercise aimed at enhancing preparedness of formations for various defensive and offensive manoeuvrings in mountainous and semi mountainous terrain.\nTroops rehearsed tactical and operational responses to various contingencies under testing conditions.\nThe COAS also interacted with the participating troops. Appreciating hard work, high morale and professionalism of troops, COAS expressed satisfaction over conduct of the exercise.\nEarlier on his arrival COAS was received by Corps Commander Lieutenant General Azhar Abbas.",
  "retrievedAt": "2025-08-11T20:50:20.270Z"
}
