{
  "title": "Pakistan strongly condemns killing of another three Kashmiris",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-killing-of-another-three-kashmiris/",
  "date_published": "2021-06-12T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Pakistan on Saturday strongly condemned the killing of three more innocent Kashmiris by Indian occupation forces in Baramulla district of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe Indian occupation army has intensified extra-judicial killings of the Kashmirs in so-called “cordon-and-search” operations despite ravaging COVID-19 pandemic, Foreign Office spokesperson said.\nHe said more than 55 Kashmiris have been killed this year alone by the Indian occupation forces. Arbitrary detention of Kashmiri youth also continues unabated.\nThe incident triggered protest across the IIOJk when hundreds of the Kashmir people took to street to condemn the killings and demand their right to self determination guaranteed by the United Nations.\nThe spokesperson said India should be well aware that no amount of Indian brutalization would be able to subjugate the Kashmiris and break their will in their struggle for self-determination.\nProtest against the killing of 3 Kashmiris civilian by Indian occupational forces after they came under attact by the freedom fighters. Slogans against Indian occupational forces were raised in the procession. World must come together to end Indian occupation.#Sopore#Kashmir pic.twitter.com/Jxgj1rUuNH\n— Kashmir Speaks (@KashmirSpeak) June 12, 2021\nHe said Pakistan had consistently emphasized that gross and systematic violations of human rights being perpetrated by the Indian occupation forces in IIOJK warranted investigation by the UN Commission of Inquiry, as recommended by the OHCHR in its reports of 2018 and 2019.\n“Pakistan reiterates its call for independent inquiry under international scrutiny to investigate the unabated extra-judicial killings of Kashmiris by Indian occupation forces and to bring the perpetrators of these heinous crimes to justice,” the spokesperson added.\nIn her statement, Mushaal Hussein Mullick, Chairperson of the Peace and Culture Organization strongly condemned the inhuman act, intensified fake encounters conducted by the Indian forces in IIOJK especially the killing of three innocent youth.\nMushaal, the wife of Chairman Jammu and Kashmir Liberation Front Yasin Malik said she was shocked at the level of intolerance by the Indian state for intensifying and patronizing this state sponsored terrorism.\nMother of slain civillian blames Indian forces for killing his son.\nShe is seen abusing and cursing indian occupation and it’s cohorts in Kashmir. #Sopore #soporeAttack pic.twitter.com/Y3rtFHkT1c\n— Zaraar (@BlacKhurasaan) June 12, 2021\nShe also asked the United Nations that despite three reports of UN Human Rights Commission, why a UN commission of inquiry was not formed into such war crime, genocide and ethnic cleansing of Kashmir youth and Kashmir public which was unarmed and defenseless.\n“When will the Indian Army be penalized, be punished and be persecuted for these war crimes? How long the Kashmir people will have to go through this agony of hell of mourning of bloodshed everyday,” she questioned.",
  "retrievedAt": "2025-08-11T20:50:19.413Z"
}
