{
  "title": "Wait for trickle-down effect ends, budget focuses on inclusive growth:  Tarin",
  "link": "https://www.app.com.pk/business/wait-for-trickle-down-effect-ends-budget-focuses-on-inclusive-growth-tarin/",
  "date_published": "2021-06-12T08:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Federal Minister for Finance and Revenue, Shaukat Tarin said here Saturday that the main focus of the inclusive growth-oriented federal budget for the fiscal year 2021-22 was to uplift the poor so that they would not have to wait for trickledown effect of economic progress.\nFor the past seventy four years, the low-income people have been waiting for this trickledown effect, but their condition could not be improved and they remained deprived of houses, businesses, cash and health facilities, the minister said while addressing the post-budget press conference.\nHe said the government was now directly targeting the poorest of the poor and facilitating them with different initiatives to upgrade their life standard without waiting for trickledown effect, which he said needed around 20 years of stable economic growth to take effect.\nHe said that this was not an easy task, however thanked Almighty Allah for giving the incumbent government this vision to work for the poor.\nThe minister said that the government through this budget would utilize ‘bottom-up-approach, for around 6 million low-income households.\nUnder this initiative every household would be provided Rs5 lack interest-free business loan. Every farming household would be given Rs1.5 loans for every crop, Rs2.5 lack interest-free farming loans and Rs2 lakh interest free loans for buying tractor and machinery.\nHe said that low-interest bearing housing loans upto Rs2 million would be provided to help people buy their houses and besides that every household would be provided a Sehat Card to facilitate them in time of need.\nIn addition, the minister said that one person from every household would be provided free technical training to ensure employability so that the family earns respectable income.\nThe minister said that no doubt the government does not have space to provide these loans, which could be done through wholesale financing of commercial banks for which the government would be providing guarantees of recovery.\nThe minister said that the identification of the poorest households would be done through a non-political survey all over Pakistan. “We will not play politics with the poor,” the minister added.\nThe minister said that after achieving economic stability, now comprehensive was under progress to lead the country towards sustainable growth for which the country would need to enhance exports.\nSo, the minister added, another primary focus of the government was to promote exports and take them upto 20 percent of GDP from just current 8 percent, adding that for bringing stability in the country, there was dire need to enhance exports.\nThe minister said that for the first time growth oriented budget was presented which introduced innovation to enhance revenue collection,  expansion of incentives for exporters, abolished duty on local industry abolished and also brought innovation in auto industry.",
  "retrievedAt": "2025-08-11T20:50:23.731Z"
}
