{
  "title": "Govt presented growth oriented budget to create job opportunities, address poverty : FM Qureshi",
  "link": "https://www.app.com.pk/national/govt-presented-growth-oriented-budget-to-create-job-opportunities-address-poverty-fm-qureshi/",
  "date_published": "2021-06-12T16:14:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jun 12 (APP): Foreign Minister Makhdoom Shah Mahmood Hussain Qureshi Saturday said the government presented growth oriented budget to create maximum job opportunities and address issue of poverty.\nAddressing a press conference after reviewing different uplift schemes at Deputy Commissioner Office here, Makhdoom Shah Mahmood Qureshi stated that the government presented comprehensive budget which received immense appreciation from all sectors. In previous budgets, the government had focused on stabilization while in budget 2021-22, the growth and public sector development was focused.\nDuring stabilization phase, the country received highest ever remittance. Similarly, record production of wheat, maize, sugarcane and rice was also observed.\nHowever, there was decline in cotton, said FM Qureshi adding that the government was trying its best to improve cotton cultivation by upgrading research techniques and provision of best quality seeds.\nThe government was in contact with China to ensure availability of top quality cotton seed and transfer of technology. Qureshi stated that the government decided to offer interest free loans to peasants to improve crop’s productivity. In Industrial sector, he said, the country made unprecedented growth of 9 per cent.\nQureshi stated that federal excise duty and some other taxes were reduced to improve industrial sector. The government also gave relaxation of taxes in Special Economic Zones (SEZs). He hoped that the measures would surely help accelerate growth rate in the country.\nExpressing satisfaction, Makhdoom Shah Mahmood Qureshi maintained that public sector development allocations had been increased from Rs 630 billion to Rs 900 billion in the recent budget.\nTo address issue of inflation in the country, the foreign minister remarked, the government was paying focus to enhance productivity as it would help improve supply of commodities and help counter inflation.\nSimilarly, the government was also determined to increase per capita income. There was immense pressure for increase in tariff of electricity but the government denied because it could cause increase in cost of production and ultimately lead to inflation, said Qureshi.\nQureshi maintained that the government set target of 4.8 per cent growth and hoped that it would be further improved in coming years.\nAbout roads and communication infrastructure, the minister stated, the government earmarked funds for Sukkur to Hyderabad Motorway, Sialkot to Khharian, Quetta-Chaman & Karachi Circular Railways. Similarly, huge funds would also be utilized on Freight Corridor, ML-1 Railways and some other mega projects.\nThe government is negotiating with China for ML-1 Railways project, informed Qureshi and added that it would be completed in phases.\nSimilarly, the government earmarked Rs 118 billion for Energy projects with a focus on renewable energy schemes of hydel and solar system.\nQureshi added that the government would also improve irrigation infrastructure with cost of Rs 91 billions. Similarly, 10 dams would be completed within 10 years, he added.\nAbout regional equalization, the foreign minister said that huge funds were earmarked for development of backward areas of the country including merged districts of Khyber Pakhtunkhwa, Southern Balochistan, Gilgit Baltistan.\nAllocations were also made for Climate change, said Qureshi adding that climate change was one of the biggest challenge, affecting country’s agriculture sector.\nHe, however, maintained that the government provided relief to all sectors in the recent budget including farmer, industrialist, stock exchange, government employees and some others amid limited resources.\nQureshi hoped that the provinces would also follow federal government in their respective budgets and provide maximum relief to the masses.\nHe also hinted that South Punjab would have separate annual development allocations in the provincial budget.\nThe separate budget of South Punjab would be ring-fenced, said Qureshi maintaining that the ring-fenced budget would be utilized in South Punjab only. About South Punjab secretariat’s construction, Qureshi observed that tenders would be floated on June 20 and hoped that work on the secretariat would begin very soon.\nResponding to a question about cause of inflation, the foreign minister said there were different factors including keeping artificial control on dollar exchange rate, raise in commodities prices and import of food items especially wheat, sugar, pulses and oil at international level. He, however, added the government was taking measures to control inflation by lowering taxes and improving productivity.\nTo another question about improvement on electricity transmission line and issues of loadshedding, Qureshi said there was enough generation of electricity in the country and the government was spending huge amounts to improve electricity transmission system.\nTo another question about angry PTI parliamentarians,\nQureshi stated that they reposed confidence in the leadership of Prime Minister Imran Khan. However, the investigation process in Jahangir Tareen case was in progress as per law. The PM had categorically stated that neither he would give any concession nor he would victimize anyone, stated Qureshi.\nAbout Opposition’s reaction over the recent budget, Qureshi stated that the government presented best possible budget. Even, the opposition could not find any area for criticism.\nTo meet revenue targets, Qureshi said the government would broaden tax base and would employ track and trace technology in this regard.\nWhen questioned about different vaccines and entry of citizens in different countries, the foreign minister stated that huge funds were earmarked for purchase of vaccines.\nQureshi stated that the government introduced self assessment scheme to facilitate traders and other businessmen. The traders were often found complaining harassment by FBR officials. Now, a third party will conduct audit of the traders, if needed.\nResponding to another question about allocations and utilization of the funds, the foreign minister stated that District Monitoring Committees were introduced which would keep checking utilization of funds on regular basis.\nEarlier, FM Qureshi chaired a meeting and reviewed different uplift scheme of the city. He also informed about formation of District Monitoring Committee, comprised of parliamentarians and officers from different departments.",
  "retrievedAt": "2025-08-11T20:50:19.648Z"
}
