{
  "title": "UN agencies praise Pakistan’s efforts to eradicate polio",
  "link": "https://www.app.com.pk/national/un-agencies-praise-pakistans-efforts-to-eradicate-polio/",
  "date_published": "2021-06-12T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The United Nations Children’s Emergency Fund (UNICEF) and World Health Organization (WHO) have lauded the Government of Pakistan’s continued efforts to eradicate poliomyelitis from the country.\nThe UN agencies commended the concerted efforts made to make sure vaccination programmes continued even during COVID-19 surges in the country.\nBoth agencies urged for greater solidarity and more investment to sustain the momentum and reach every child with life-saving vaccines.\nThese reflections were made by UNICEF South Asia Regional Director George Laryea-Adjei and WHO Eastern Mediterranean Regional Director Dr Ahmed Al-Mandhari as they concluded a week-long joint visit to Pakistan.\nThe visit coincides with the first Polio Oversight Board visit to the country, and the launch of the Global Polio Eradication Initiative’s new 2022-2026 strategy.\nUNICEF Regional Director George Laryea-Adjei said “We know that the most important relationship in polio eradication is between the vaccinator and the child’s family. Without communication and trust, there is no vaccination.”\n“This week, I have seen a renewed focus on bolstering that relationship in the most high-risk areas of Pakistan. I appreciate the huge role played by frontline works in building that trust, and the support provided by the Government and partners to these front line workers. I leave Pakistan filled with hope that all hands are on deck to finish the last mile in the journey to eradicate polio in the country.”\nCommenting on this mission, WHO Regional Director Dr Ahmed Al-Mandhari said, “I have witnessed a back-to-basics approach to raise campaign quality and most importantly the need for laser focus on repeatedly missed children by provincial Health Ministers and Chief Secretaries – this is the only way we will slash the number of missed children down to zero.”\nHe added the GPEI leadership, including WHO and UNICEF, all have a role to play in turning the tide in Pakistan, but the real leader must be the Government of Pakistan on its emergency footing and best practices from its Covid response, and this mission has showcased the diligence and accountability Prime Minister Imran Khan and his government are applying to eradication.\nThe visit highlighted the impact of COVID-19 and the changes made in Pakistan’s national polio programme, he added.\nThe Regional Directors also noted the opportunity for Pakistan to capitalize on the very few polio cases in the country and for GPEI partners to optimize support to intensified efforts by national and provincial governments to end polio.\nThe Regional Directors visited Peshawar and Karachi and participated in field activities, including the ongoing polio vaccination campaign in areas that have persistently challenged the polio programme.\nIn order to stamp out polio for good, every child living in these high-risk areas must be reached with the oral polio vaccine multiple times.\nThe Regional Directors visited routine immunization centres, where there is a growing synergy between polio campaigns and routine immunization and attended health facilities designed to help high-risk populations access healthcare and boost vulnerable children’s immunity.\nPakistan and Afghanistan are the only countries where wild poliomyelitis is endemic, and together constitute one epidemiological block.\nAfter losing traction during the COVID-19 pandemic, a time when the polio programmes in each country retooled as pandemic support, cases of wild poliovirus are down once again, to just one to date in 2021 in each of Afghanistan and Pakistan.\nDuring their mission, Dr. Al-Mandhari and Laryea-Adjei commended the successes yet warned against complacency and urged to continue hard work until to reach the last child with vaccination.",
  "retrievedAt": "2025-08-11T20:50:18.122Z"
}
