{
  "title": "Budget 2021-22 growth-oriented, pro-people: Haleem Sheikh",
  "link": "https://www.app.com.pk/national/budget-2021-22-growth-oriented-pro-people-haleem-sheikh/",
  "date_published": "2021-06-12T11:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 12 (APP): Opposition Leader in Sindh Assembly, Haleem Adil Sheikh on Saturday said the budget 2021-22 presented by federal government was pro-people and\ngrowth-oriented.\nWhile addressing press conference here at Sindh Assembly, he said, “In this budget, all promises made to people have been fulfilled”.\nHaleem Shiekh was flanked by Members Provincial Assembly Tahira Dua Bhutto, Bilal Ahmed, Shah Nawaz Jadoon.\nHaleem said in the budget maximum relief was being given to the poor segments of the society.\nThe total allocation of Public Sector Development Programme has been increased to Rs 900 billion, Haleem said recounting that tax on withdrawing money from banks had been withdrawn.\nLoan schemes have been announced to give major benefits to youth and peasants, which would help boast economy, Haleem Adil added.\nHe said economic deficit has registered a decline which was an encouraging step for economy.\nMinimum wage has been increased from Rs.17000 to 20000, he said, informing that 10 percent rise in salaries of federal government employees has been announced to give relief to masses.\nApart from this, Rs.1000 billion has been earmarked for development schemes for the Sindh province in the federal budget which proved that the government has taken care of all without any discrimination, Sheikh added.\nSpeaking on the occasion, Member Provincial Assembly, Bilal Ahmed said the budget was growth-oriented and would boost economic activities in the country.\n“If business activities rise, it will ultimately generate employment opportunities in the country”, he stated.\nHe further said government has announced subsidies in the budget for providing relief to people.",
  "retrievedAt": "2025-08-11T20:50:22.175Z"
}
