{
  "title": "Senator Nasir Butt to lead artists in paying tribute to Armed Forces on Defence Day",
  "link": "https://www.app.com.pk/national/senator-nasir-butt-to-lead-artists-in-paying-tribute-to-armed-forces-on-defence-day/",
  "date_published": "2024-08-25T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Chairman, Senate Standing Committee on Housing and Works, Senator Nasir Mehmood Butt would lead artists of the twin cities of Rawalpindi and Islamabad to express solidarity with the Pakistani forces on the occasion of Defense Day under the supervision of the well-known writer and director Asma Butt.\nThe Artists will pay tribute to the martyrs of Pakistan Armed forces who sacrificed their lives while protecting the motherland through different activities.\nWriter and director Asma Butt along with a delegation of artists had an important meeting with the leader of Pakistan Muslim League-N and Senator Nasir Mahmood Butt, a news release said.\nDuring the meeting, Senator Nasir Mehmood Butt highly appreciated the artistic services of Asma Butt and said that artists are the spokespersons of the culture of the country. “Defense Day is around the corner, so like every sector of the country, it is the duty of the artists to pay homage to the services of their armed forces,” he said.\nAsma Butt thanked Senator Nasir Mehmood Butt and said that the love and devotion of artists towards Pakistan and Pakistan Army was conspicuous among all.\n“The artist community has always valued the services of Pakistan forces. Be it Quaid-e-Azam Day, Independence Day, Takbeer Day or Defense Day, artists have always expressed their love for the country in the form of plays and national songs,” she added.\nShe said, “While we are sleeping in our homes with peace, our Armed Forces are deployed on the borders to protect us. A major ceremony will be held on September 6th to pay tribute to the brave and incomparable soldiers of the Pakistan Army in a befitting manner.”",
  "retrievedAt": "2025-08-11T04:58:45.478Z"
}
