{
  "title": "Expressway Sabotage: commuters blame roadside mechanics for spike in punctures",
  "link": "https://www.app.com.pk/national/expressway-sabotage-commuters-blame-roadside-mechanics-for-spike-in-punctures-2/",
  "date_published": "2024-08-25T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Commuters on the Islamabad Expressway are grappling with an unprecedented surge in vehicle punctures, with many accusing roadside repair mechanics of orchestrating the crisis.\nThe incidents of frequent flat tires, on the 28-kilometer stretch from Faisal Masjid to Koral Chowk daily cleaned by the CDA’s automated machine, are reported, with numerous drivers alleging that these mechanics are intentionally scattering sharp objects to drive up their business.\nDespite mounting complaints, authorities have struggled to address the issue, leaving motorists increasingly frustrated and seeking answers.\nTahir Azad, a government employee who frequently travels by motorcycle, shared his frustration: “On my way home after night shifts, my motorcycle often gets punctured. I end up paying these repairmen whatever they ask because I have no other choice.” He attributed this damage to a network of roadside repair mechanics who are suspected of deliberately causing these issues to increase their repair business.\nReports suggest that these mechanics are well aware of the problems they are causing. Multiple motorcyclists have observed repairmen working in areas where punctures are most common, leading to suspicions that they may be deliberately creating hazards to secure more repair jobs.\nCommuters have also raised concerns over the exorbitant rates charged by these roadside repair mechanics, which far exceed standard market prices, calling them “Puncture Mafia”.\n“While a typical puncture repair might cost a modest fee elsewhere, these mechanics are reportedly demanding significantly higher amounts from stranded motorists exploiting the urgency faced by drivers who are often under pressure to reach their destinations promptly” another commuter Riaz Ahmed sharing his thoughts on the issue said.\nHowever, he noted that commuters do not oppose the livelihood of roadside mechanics, many of whom provide prompt and honest service. The majority of these mechanics may indeed be trustworthy, but the increasing frequency of puncture incidents has led citizens to suspect that something more sinister is at play.\nThis growing concern has prompted a call for a thorough investigation to determine if these incidents are part of a larger, deliberate scheme.\nA traffic police official Tariq, expressed frustration with the situation. “We see these mechanics operating openly, but we are constrained by legal and procedural limitations that prevent us from taking action against them,” he said. “It’s disheartening to see so many people suffering from this issue without a clear resolution in sight.”\n“I have brand new tubeless tires installed in my vehicle and I observed low air pressure daily when I wake up to leave for my job ultimately I use an electric air pump to maintain air pressure and get my vehicle repaired at a puncture shop near my office in Sitara Market. But the frequent occurences have made me believe there is something wrong going on the road”, said Muhammad Tariq a motor vehicle mechanic in Khadda Market who daily commutes from Jinnah Garden to Islamabad G-7 sector.\nThe situation is not limited to the Islamabad Expressway alone; similar reports have surfaced from other major highways in the city. The suspected scheme involves scattering sharp debris to cause vehicle damage, followed by offering overpriced repair services to affected motorists.\nAs the number of complaints continues to rise, there is a growing call for urgent intervention. Commuters are demanding that authorities take more decisive action to address the problem and restore safety and integrity to their daily commutes.",
  "retrievedAt": "2025-08-11T04:57:53.345Z"
}
