{
  "title": "MoHR  to review implementation of laws, policies",
  "link": "https://www.app.com.pk/national/mohr-to-review-implementation-of-laws-policies-2/",
  "date_published": "2024-08-25T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP):Ministry of Human Rights (MoHR) is working with mandate to review human rights and protection of labour rights situation in the country including implementation of laws, policies and measures.\nTalking to APP, an official said that the Ministry was also formulating various programmes for teaching of human rights at educational institutions.\nHe said that the Ministry was also working to implement the “Rules and Regulations for the Islamabad Capital Territory (ICT) Senior Citizens Act, 2021”.\nThe development of the Rules and Regulations for the ICT Senior Citizens Act is an important step in this process.”\nNumber of senior people is exceeding. It is thus critical to create an enabling and healthy environment to ensure that every human being, irrespective of age, was able to fulfill their potential with dignity and equality.\nThe year 2024 marked the 34th anniversary of the International Day of Older Persons as well as the initiation of the Decade of Healthy Ageing (2020-2030), he added.\nHe added that despite the Social Welfare Department setting up several old homes across the country to provide shelter to old people abandoned by their families, no senior centres exist for offering integrative recreational facilities and socialization opportunities to millions of elderly citizens in the country,\nHe further added that the legislation to protect the rights of elderly people living a less empowered social life.\nThe discussions focused on the draft rules and regulations for three key areas of Senior Citizens Card, Establishment of Old Age Homes and Privileges provided to senior citizens under the Act: (20% discount on the medical facilities and retirement benefits for the older people).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:59:10.373Z"
}
