{
  "title": "Speakers point out current agreements with IPPs as hinderance to economic progress",
  "link": "https://www.app.com.pk/national/speakers-point-out-current-agreements-with-ipps-as-hinderance-to-economic-progress/",
  "date_published": "2024-08-25T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Speakers at an in-house session on Independent Power Producers (IPPs) and Capacity Payment Issues in the Power Sector on Sunday pointed out current agreements with IPPs as a hinderance to economic progress of the country.\nThe Islamabad Policy Research Institute (IPRI) recently hosted a Roundtable Conference on “Independent Power Producers (IPPs) and the Capacity Payment Issues in the Power Sector.”\nThe speakers at the event included Ambassador (R) Inamul Haque; Former Caretaker Federal Minister for Commerce, Industries, and Production, Dr Gohar Ejaz; CEO of CPPA, Rihan Akhter; Former Chairman NDMA, Maj General Asghar Nawaz; Former SAPM CPEC, Khalid Mansoor; Senior Partner RIAA Barker Gillette, Husnain Naqvi; Partner Orrdignam & Co., Shahid Raza; CEO Attock Oil, Adil Khattak and GM WAPDA Irfan Rizvi, a news release said.\nThe discussion highlighted the challenges posed by Pakistan’s current energy policies, particularly the implications of the existing tariff structure is unsustainable and burdensome for the economy. The need for a comprehensive review of these tariffs was emphasized, noting that the high cost of electricity is stifling economic growth and making Pakistan’s exports less competitive on the global stage.\nThe conversation also addressed Pakistan’s continued reliance on coal power plants, a practice that has been slowly reduced in various countries. Some speakers strongly advocated for the retirement of these plants, arguing that they are economically unviable in the long term. It was highlighted that natural gas should also not be sold in Pakistan, unless absolutely necessary. A significant portion of the discussion focused on the role of IPPs in Pakistan’s energy sector.\nThe panellists critically examined the capacity payments being made to these producers. These payments, they argued, have placed a considerable strain on the national economy, particularly by inflating energy costs and reducing the competitiveness of Pakistani goods in the international market. It was pointed out that the existing agreements with IPPs need to be revisited to ensure that they do not continue to hinder economic progress. It was discussed that investors must be held accountable for the high prices being charged and that there is a pressing need to renegotiate these contracts to align them with current economic realities. It was stressed that the issues in Pakistan’s energy sector are rooted more in policy decisions than in production capacity.\nThe discussion called for a significant overhaul of planning capabilities and policies to create a more efficient energy framework. The speakers also discussed the importance of transitioning towards a free market for energy, where consumers play a more significant role in representing their interests. It was underscored that there is a need for transparency and international benchmarking in the energy sector.\nThe discussion concluded with a call for the government to facilitate the adoption of new technologies in the energy sector and to consider offering shares of IPPs in government-run companies that operate with a corporate outlook.\nThere was also consensus that government-run companies, with strong policies and timely implementation, could outperform private organizations in this sector.\nIt was reiterated that strong policies must be in place and their proper implementation must be ensured. They also emphasized the need for a dedicated space where future renegotiations with IPPs could take place under mutually beneficial terms.",
  "retrievedAt": "2025-08-11T04:59:12.501Z"
}
