{
  "title": "Naya Pakistan Housing project launched in Attock",
  "link": "https://www.app.com.pk/national/naya-pakistan-housing-project-launched-in-attock/",
  "date_published": "2020-07-20T03:01:00.000Z",
  "source": "APP",
  "content": "ATTOCK Jul 20 (APP):The Naya Pakistan Housing Programme (NPHP) has entered to its implementation phase as project ground breaking ceremony was held at Hazro town of Attock on Sunday.\nAdvisor to Prime Minister on Climate Change Malik Amin Aslam has performed the ground breaking ceremony. Naya Pakistan Housing Scheme spread over 400 kanals of land comprising 658 plots that include 90 plots of 10 marla each , 64 plots of 7 marla each,189 plots of 5 marla each and 400 plots of 3 marla each. The plots would be given to the people through ballot and on merit. The colony would have a park, walking track and commercial area comprising 38 shops. The project would be completed in December 2021 at the cost of Rs 37.972 million.\nSpeaking at the ceremony, Advisor to Prime Minister on Climate Change Malik Amin Aslam has said”The project is not only a step towards fulfilling the commitment made with the public by the party.”\nHe said the construction of five million houses for low-income segments of society across the country was a difficult task. The Government would on the other hand,took it as a challenge and necessary legislation was being made to provide loans to people. He said PTI Government was also striving to develop Pakistan as such a welfare state and the Naya Pakistan Housing Project was part of a process.\nHe vowed to help the country’s long-neglected stratum move from katchi abadis into swiftly constructed flats and high-rises in a bid to overcome the housing shortage for lower-income groups. He revealed that work on similar project in Attock had also been started and for Naya Pakistan Housing Project 700 kanal of land has acquired. Mr Aslam has said that 0.1 million Sehat Insaf card has so far distributed in Attock so far while 30 thousand cards to more people would be distributed in coming days. Spokesman PTI Punjab Qazi Ahmed Akbar speaking on this occasion has said that a state of the art trauma centre would be constricted at THQ hospital Hazro besides E library would also be constructed in Hazro with an allocation of Rs 7.50 million. Parliamentary Secretary for Planning and Development Malik Taimoor Masood Akbar and Director General Punjab housing authority Zia ud Din also spoke on this occasion.",
  "retrievedAt": "2025-08-11T19:31:16.873Z"
}
