{
  "title": "President underscores importance of E-commerce for economic boost",
  "link": "https://www.app.com.pk/national/president-underscores-importance-of-e-commerce-for-economic-boost/",
  "date_published": "2020-07-20T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP):President Dr. Arif Alvi Monday said promotion of E-commerce was highly essential for strengthening economy of the country as it provided access to distant markets, reduce cost of doing business and create employment opportunities.\nHe was chairing a meeting on E-commerce to review the action plan with regard to implementation of E-commerce policy in the country.\nHighlighting the importance of E-commerce, the president said it offered huge opportunities for small and medium enterprises that connected them with Pakistani online markets and international markets through global E-commerce platforms.\nAccording to a press release, the meeting was attended by Minister for IT & Telecom Syed Amin ul Haque, Advisor to PM on Commerce Abdul Razak Dawood, Deputy Governor State Bank of Pakistan Jamil Ahmed, Secretary to the President Tariq Najeeb Najmi, Secretary IT & Telecom Shoaib Ahmad Siddiqui, Additional Secretary Finance, Dr. Arshad Mahmood, Chairman FBR Muhammad Javed Ghanni, Member (IT), M/o IT&Telecom Syed Junaid Imam, CEO NITB Syed Shabahat Ali and Joint Secretary M/o Commerce Aisha Humaira Moriani.\nThe meeting was briefed about the E-commerce initiatives and their role in economic development of the country.\nIt was informed that the country had potential to increase its GDP by US$36 billion and create 4 million jobs by 2025 by using digital financial services.\nThe participants were apprized that E-trade in the country had crossed over Rs. 100 billion.\nIn order to promote E-commerce, the meeting underscored the need for tax incentive packages and availability of IT infrastructure and quality of services in the country.\nThe president asked NITB, FBR, SBP, ministries of IT and commerce to expeditiously complete work on their respective pillars.",
  "retrievedAt": "2025-08-11T19:31:14.343Z"
}
