{
  "title": "Ehsaas-a landmark initiative to financially empower weakest segments of society",
  "link": "https://www.app.com.pk/national/ehsaas-a-landmark-initiative-to-financially-empower-weakest-segments-of-society/",
  "date_published": "2020-07-20T03:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP):Ehsaas is the largest ever poverty alleviation program in Pakistan to help the poorest and weakest sections of society through making them financially independent. No other government has launched such a large-scale, large-budget public welfare and poverty alleviation program in the last 72 years.\nPrime Minister Imran Khan, from the very beginning, has been emphasizing on poverty alleviation, raising the living standards of the weaker sections of the society, promotion of education and better utilization of human and natural resources which are also an important part of Pakistan Tehreek-i-Insaf manifesto.\nAs soon as he took over the government after winning the 2018 general election, Prime Minister Imran Khan focused on policy making for poverty alleviation, improving the lives of poverty-stricken, promoting education and better utilization of human and natural resources.\nHe also launched the Ehsaas program on March 27, 2019 to complete this important agenda. Prime Minister Imran Khan has repeatedly cited the example of China in his speeches and conversations with the media on how China has lifted the nearly 700 million people living below the poverty line out of poverty due to which China is moving forward to become the world’s largest economic power.\nWith this in mind, he launched a comprehensive program like Ehsaas to lift the poor, especially women, out of poverty, provide higher education opportunities for intelligent children belonging to the poor sections and create such a business environment in the country where the youth can focus on business and entrepreneurship instead of looking for a job.\nThe poverty alleviation programs, introduced in the past, have only focused on cash payments and remained unable to disburse financial assistance among the real beneficiaries in a transparent way. The biggest example of this is the Benazir Income Support Program which has been termed as the most transparent program.\nHowever, the present government scrutinized BISP through the data of National Database Registration Authority (NADRA), found 800,000 ineligible beneficiaries including a large number of government employees and their families and expelled them from the list of beneficiaries. In the light of this experience, transparency has been given utmost priority in payments under Ehsaas and people have been allowed to benefit from this program only after thorough scrutiny from NADRA data.\nThe ongoing programs under Ehsaas include Ehsaas Emergency Cash, Ehsaas Ration Portal, Ehsaas Undergraduate Scholarship, Ehsaas Panagah (Shelter) and Langar Scheme, Ehsaas Kafalat, Ehsaas Interest Free Loans and Ehsaas Amdan and Assets Transfer Program. Under these programs, billions of rupees have been disbursed to benefit millions of people.\nBesides transparency, another important aspect of Ehsaas programme is expedited process of payments as the processes from launch to payment in all the programs of Ehsaas have been completed expeditiously due to the use of modern technology.\nEhsaas Emergency Cash Program was launched soon after the Coronavirus outbreak under which the entire payment process was completed in a short period of three months after its launch, including receiving applications, scrutiny and removal of practical hurdles.\nEhsaas Emergency Cash program has so far disbursed an amount of Rs. 157.25 billion among 12,997,237 lockdown affected persons. A total of Rs. 70.728 billion has been disbursed among 5,845,019 deserving families in Punjab, Rs. 47.252 billion among 3,918,902 families in Sindh and over Rs. 26.877 billion among more than 2,214,239 beneficiaries in Khyber Pakhtunkhwa.\nOver Rs. 7.846 billion has been disbursed among more than 645,936 persons in Balochistan, over Rs. 2.859 billion among more than 212,024 persons in Azad Jammu and Kashmir and over Rs. 1.149 billion among more than 94,039 people in Gilgit Baltistan.\nAn amount of over Rs.0.810 million has been disbursed among more than 67,078 beneficiaries in Islamabad. Special attention has been paid towards utilizing all the options for the poverty reduction and improvement of the weaker segments of the society during the launch of various programs under the umbrella of Ehsaas.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-1.mp4?_=1\nTalking to APP about the Ehsaas program, President, Lahore Chamber of Commerce and Industry, Irfan Iqbal Sheikh said, “I have never seen such a transparent and better program in the 72-year history of Pakistan.” It will benefit millions of people and the best thing is that people are being given money at their doorsteps in a transparent manner. He said that after the successful completion of the first phase, the Prime Minister has announced its second phase which would hopefully benefit the people with the same spirit. .Lahore Chamber of Commerce and Industry is actively participating in such initiatives as we have contributed Rs. 20 million to the Prime Minister’s Fund, Rs. 10 million to the Chief Minister’s Fund and also contributed amount to the Governor’s Punjab Fund. We are also doing charitable work by feeding the poor people. Irfan Iqbal Sheikh expressing his support to this initiative said that there is no precedent for the way in which Allah’s creatures are being served.\nOn the one hand, cash assistance of Rs. 12,000 has been disbursed among the poorest people who have lost their jobs due to closure of business amid Coronavirus lockdown while on the other hand, Ehsaas Ration Portal has been launched to save poor segments from starvation in which Ehsaas plays the role of the facilitator through creating bridge between charitable organizations, philanthropist and the deserving persons. The primary role of the government is focused on providing data of eligible people to the donors and creating liaison between them. Both the beneficiaries and donors register themselves at www.rashan.pass.gov.pk through providing the required information. The information provided by the deserving persons is scrutinized through using Ehsaas data analytics to determine their eligibility. Donor organizations are evaluated according to specific eligibility criteria to become partners in the program.\nAs many as 738869 people have registered themselves for ration assistance through the Ehsaas Ration Portal so far while the distribution of ration among the needy has been started. General Secretary, Islamabad State Agents Association, Chaudhry Zahid Rafique congratulated the Prime Minister, Imran Khan and Special Assistant, Dr. Sania Nishtar for launching the Ehsaas Emergency Cash program to provide financial assistance to the poor across the country at their door steps.\nHe said that there is no precedent of such a program in the whole world the way such a large amount has been disbursed among deserving people in a transparent way and short time period. Such programs should be continued as per the vision of Pakistan Tehreek-e-Insaf. Ehsaas scholarship program was another milestone in higher education sector under which 50,000 annual scholarships have been awarded to provide higher education opportunity to the low-income undergraduate students.\nThis number will reach 200,000 during the four years with 50 percent quota reserved for the female students.  The Undergraduate Scholarship Program is a major step in expanding access of deserving students to higher education under the government vision that no student should be deprived of education due to financial constraints.\nThis scholarship includes both tuition fees and stipend. 50 percent scholarships have been allocated for female students while the deserving students from less developed and remote areas are being especially encouraged. The eligibility criteria require admission of the students to any public sector university while the preference is being given to students from low-income families. Students can submit the application form online at http://ehsaas.hec.gov.pk/ or with complete data to the financial aid office of their respective university.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-4.mp4?_=4\nProfessor, Punjab University Institute of Education and Research, Dr. Abdul Qayyum Chaudhry appreciated the Ehsaas Undergraduate Scholarship program to benefit 50,000 students annually. The program will cover the educational expenses of the poor students, making them realize of someone is thinking of their welfare, he said.\nTalking to APP, Prof. Dr. Abdul Qayyum Chaudhry hoped that the government would launch more such programs like Ehsaas Scholarship and increase the budgetary allocation of health and education sectors.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-5.mp4?_=5\nAssistant Professor, Punjab University, Professor Dr. Muhammad Rashid said the prior focus of the Prime Minister Imran Khan in all his initiatives is the welfare of poor segments of society whether its is Ehsaas Kafalat program or housing scheme. Ehsaas program has given opportunity to the outstanding students from less privileged areas to complete their education. He recommended that this scheme should continue with expanding its scope and giving preference to the students of remote areas, enabling them to quench their thirst for knowledge.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-6.mp4?_=6\nStudent of M Phil in Punjab University, Madiha Khan termed the Ehsaas Scholarship as one of the best initiatives launched by the Prime Minister, Imran Khan to ensure access of the less privileged students of remote areas to continue their education on government expenses. She hoped that this scheme will continue to benefit thousands of the students who lack financial resources to continue their education.Besides all these initiatives, the government also realized the sufferings of those who compelled to sleep on roadsides, sidewalks, parks and open spaces due to the acute poverty and have to endure all the hardships of the extreme weather under the open sky.\nPrime Minister Imran Khan, in view of this situation, proposed the idea of ??setting up shelters in major cities of the country and implemented through establishing shelters in Islamabad, Lahore, Karachi, Peshawar, Multan and other major cities where poor and helpless people can get free shelter by showing their identity card.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-9.mp4?_=8\nZafar, a citizen of Azad Jammu and Kashmir, said when he came to Islamabad from Bagh district, he did not have any house. I am thankful to the Prime Minister, Imran Khan for establishing Panahgah where I live with dignity and the staff here is also very humble. Later expanding this program further, Ehsaas Langar Khanas were set up alongside these shelters and other locations, especially near the large hospitals. So far, a number of Langar points have been opened in Punjab, Sindh, Khyber Pakhtunkhwa and Islamabad under the public-private partnership. Prime Minister Imran Khan inaugurated the “Ehsaas Saylani Langar” scheme on October 7, 2019 in Islamabad and announced to open 112 Langar Khanas across the country in the first phase. These Langar Khanas will be opened in the areas where the labourers are suffering from unemployment and hunger. Muhammad Tariq, a daily wager in Islamabad said he gets three time meal in a day through Ehsaas Langar Khana which is a blessing for him in the lockdown days.\nHe appreciated this initiative of the government and said he found no issue related to food or drink since establishment of this Langar Khana.\nAccording to the Prime Minister, the government is providing all possible support for the development of businesses and industries. “It is a difficult time but we are fully aware of the sufferings of poor people and are trying to prevent people from starvation”.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-2.mp4?_=2\nExecutive member, Islamabad Chamber of Commerce and Industry, Babar Chaudhry said the Ehsaas program launched by Prime Minister Imran Khan led government is a great initiative to provide relief to those living below the poverty line.  He said the Ehsaas programme has provided temporary relief to the poverty-stricken daily wagers and piece-rate workers through providing them financial assistance in the lockdown situation amid Coronavirus which has enabled them to meet their basic necessities. Babar Chaudhry emphasized the need of launching more such programs and said “we should support the Prime Minister in his pro-poor initiatives”.\nhttp://http://reports.app.com.pk/wp-content/uploads/2020/07/Video-7.mp4?_=7\nWomen, comprising over more than half of country’s population, were unable to play their required role in societal development due to lagging behind in education and other fields of life. The women who are widowed or divorced and cannot get remarried lack any source of financial support and therefore cannot meet their household expenditures. For the welfare of this particular segment of society, the Ehsaas Kafalat program was launched on January 31, 2020 which benefited 4576463 deserving women, so far. Under this program, seven million women are being given Kafalat cards. The government wants Rs. 200 billion to reach the beneficiaries directly.\nIn this regard, Special Assistant to Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar said that the statistics of BISP were 10 years old and the present government has selected the beneficiaries through regular survey and NADRA data bank.  Ehsaas Kafalat program is fully biometric and the process of access to banks for deserving women has been made easier. Nasreen Bibi, a resident of Lahore, appreciated the Ehsaas Kafalat program which has provided financial relief to thousands of poor families.\nShe said the program was a sigh of relief for those daily wagers or labourers who were badly affected due to the Coronavirus lockdown. Prime Minister, Imran Khan is a ray of hope for the poor people; she said hoping this program will continue to financially assist the poor.\nAnother landmark initiative was the launch of the nationwide National Poverty Graduation Initiative (NPGI) in more than 100 districts of the country simultaneously to provide interest free loans and vocational and technical training facilities. The NPGI, at the estimated cost of Rs. 42.65 billion, aimed at graduating the poorest households out of poverty and set them on a course of economic prosperity.\nThis initiative is comprised over three schemes including Ehsaas Amdan programme (assets distribution), interest-free loans and skills development for better utilization of assets and loans. The main objective of this program is to reduce the dependence of deprived families on Zakat, Bait-ul-Mal and Benazir Income Support Program, making them financially independent. The program is supported by the Asian Development Bank and the International Fund for Agricultural Development and other 40 partners including Akhuwat and Rural Support Program. The program will benefit 16.28 million people in 100 districts, including 50 percent women.\nUnder Ehsaas Amdan program, around 200,000 assets will be provided to the poorest of the poor to start their businesses along with skills training and business planning. The average cost of the asset which will be given as a grant is Rs. 50,000. A total of 1.45 million people will benefit from this component. Ehsaas Amdan Program was launched on February 21, 2020. Under this program, small business assets worth Rs 1.5 billion have been provided to 25,054 families so far.\nThe provision of interest free loans is an important part of this program under which 80,000 loans ranging from Rs 20,000 to Rs 75,000 per month will be provided.\nA total of 3.8 million interest-free loans will be disbursed in four years. Besides, technical training will be provided to those who will get loans or assets to bring innovation in their businesses with the support of the Federal Ministry of Education and Professional Training and National, Vocational and Technical Training Commission (NAVTTC).\nThe Prime Minister launched the district portal ‘Data4Pakistan’ on March 10, 2020 under the Ehsaas program. The creation of this portal is a milestone in the government’s decision-making process at the federal, provincial and district levels based on facts.",
  "retrievedAt": "2025-08-11T19:31:12.328Z"
}
