{
  "title": "The war within - Newspaper - DAWN.COM",
  "author": null,
  "content": "PRESIDENT Donald Trump’s greatest challenge at home has come from the country’s judiciary, not the opposition Democratic Party that remains leaderless and in disarray.\n\nThe biggest blow to the US president’s trade policy was the ruling delivered by a federal court last month that declared illegal many tariffs he had imposed on countries across the world. Although the administration secured a temporary reprieve from an appeals court that paused the ruling, the legal battle is far from over. The appeal process has to play out and the case may even go to the US Supreme Court. Global financial markets welcomed the court order against tariffs but it leaves Trump’s trade plan hanging in the balance.\n\nTrump reacted furiously to the court of international trade’s decision calling it “wrong”, “political” and the “harshest financial ruling” ever. His officials went further, accusing judges of “judicial overreach” and an abuse of power to “usurp the authority of the president”. In fact, it was Trump who exceeded his emergency powers to levy global tariffs, according to the trade court. Trump had invoked the International Emergency Economic Powers Act to impose tariffs on April 2.\n\nDue to the adverse market reaction to that decision, he went back and forth on tariffs, pausing them, lowering some and then raising others. This spooked investors and sowed confusion among America’s trading partners. Trump switched course when markets tanked and there was a heavy sell-off in US bonds. After the markets, it was the turn of the courts to try to restrain Trump. As the Financial Times wrote in a recent editorial, America’s courts are playing a salutary role by “trying to rein in what Trump regards as his limitless powers as president”.\n\nLegal problems have cast a shadow over Trump’s trade agenda. They may impact trade talks underway with many countries, who might see their negotiating hand strengthened by challenges Trump’s policies face from the courts. Crucial negotiations lie ahead with America’s two key trading partners, China and the EU. They can be affected by legal issues at home, even though Trump and Chinese President Xi Jinping have recently had a positive phone conversation on trade issues.\n\nAmerica’s courts are trying to restrain Trump’s unbridled use of executive power.\n\nWhile the tariff ruling is arguably the biggest judicial jolt to Trump’s plans, he has encountered legal setbacks on other fronts too. According to one estimate, there have been court orders against 182 of Trump’s executive actions. Some injunctions have been of a temporary nature, but they have still acted as a check on Trump’s whimsical conduct. The petitioners have mostly included state governments, cities, labour unions, civil liberties and non-profit organisations. In the tariff case, it was a group of states led by Oregon that sued the administration over its use of emergency powers without congressional action.\n\nCases against the administration have involved Trump’s immigration and deportation policies, his downsizing of the federal government that entailed sweeping layoffs of the workforce, freeze on foreign aid, dismantling of US agencies, birthright citizenship rights, and assaults on universities and law firms.\n\nAmong the most controversial of Trump’s actions to be legally challenged are the drastic cuts in the size of the federal government by large-scale firing of civil servants, ceasing funding and closing down agencies. The task of executing this plan was given to Trump’s billionaire (now estranged) friend, Elon Musk, through his so-called Department of Government Efficiency (DOGE), which saw over three dozen cases challenging its authority and even more lawsuits contesting funding cuts and sacking of workers. Tens of thousands of federal employees were fired while thousands were placed on forced leave or left their jobs under resignation programmes.\n\nA California court ruling ordered a halt to the downsizing, questioning the legality of the move. Subsequently, in another blow for Trump, an appeals court upheld that decision, forcing the administration to maintain the pause on more cuts and firings. Musk’s exit from the government throws DOGE’s future into uncertainty, even though Trump has vowed its work will carry on.\n\nIvy League universities have also come under mounting pressure from Trump’s efforts to control these institutions and suppress dissent. The administration’s battle with Harvard University has seen funding withheld, and attempts to change its governance structure and bar its ability to host foreign students. Harvard resisted and asserted its rights in the face of government intimidation by suing the federal government. Its efforts succeeded when a federal judge blocked the order revoking its right to enrol foreign students. Trump then suspended visas for six months for foreign students enrolled for study at Harvard. But this effort to circumvent the court’s ruling will only intensify the legal battle.\n\nCourts have issued important rulings and provided temporary relief in some cases to foreign students whose visas were cancelled or threatened owing to their pro-Palestinian sympathies. The way foreign students have been arrested — some from the streets — handcuffed and sent to detention centres, with their visas abruptly revoked, sparked an outcry in America’s academic community. A California district judge has now barred the administration from ending the legal status of international students across the country. The ruling prevents the authorities from arresting, imprisoning or moving students elsewhere based on their legal status until their case is resolved.\n\nTrump’s response to judicial opposition to his policies has predictably been harsh. He and his officials have vilified judges and subjected some to strong public criticism. Of course, in some notable and consequential cases, courts have also ruled in his favour. But the administration is embroiled in scores of lawsuits and it remains unclear whether Trump will comply with court orders or try to circumvent them. He has already defied court rulings, especially in immigration issues, including a supreme court order in a deportation case. How the growing clash between the executive and judiciary plays out is hard to predict, but for now America’s courts are standing up to Trump’s arbitrary actions, striking them down in key cases and acting as a check on the unbridled use of executive power.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684354f5012be.jpg",
  "retrievedAt": "2025-10-12T03:28:37.894Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915948/the-war-within",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T23:40:28.000Z"
}
