{
  "title": "Colombia’s potential presidential contender Miguel Uribe shot; suspect arrested - World - DAWN.COM",
  "author": null,
  "content": "Colombian Senator Miguel Uribe, a potential presidential contender, was shot in Bogota on Saturday, according to the government and his party, as his wife said he was fighting for his life in hospital.\n\nThe 39-year-old senator, who was shot during a campaign event as part of his run for the presidency in 2026, is a member of the opposition conservative Democratic Center party founded by former Colombian President Alvaro Uribe. The two men are not related.\n\nAccording to a party statement condemning the attack, the senator was hosting a campaign event in a public park in the Fontibon neighborhood in the capital on Saturday when “armed subjects shot him from behind.\n\nThe party described the attack as serious, but did not disclose further details on Uribe’s condition. Videos on social media showed a man, identified as Uribe, being tended to after the shooting. He appeared to be bleeding from his head.\n\nUribe’s wife Maria Claudia Tarazona wrote on her husband’s account on X that he was “fighting for his life”.\n\nColombia’s Defence Minister Pedro Sanchez said a suspect had been arrested in the shooting and that authorities were investigating whether others were involved. Sanchez said he had visited the hospital where Uribe was being treated.\n\nThe government is offering some $730,000 as a reward for information in the case.\n\nColombia’s presidency issued a statement saying the government “categorically and forcefully” rejected the violent attack, and called for a thorough investigation into the events that took place.\n\nLeftist President Gustavo Petro sympathised with the senator’s family in a message on X saying, “I don’t know how to ease your pain. It is the pain of a mother lost, and of a homeland.”\n\nPetro later said in a speech on Saturday night that the person arrested was a minor and that the investigation would focus on finding who had ordered the attack.\n\n“For now there is nothing more than hypothesis,” Petro said, adding that failures in security protocols would also be looked into.\n\nThe United States’ Secretary of State Marco Rubio said in a statement that the U.S. “condemns in the strongest possible terms the attempted assassination” of Uribe, blaming Petro’s “inflammatory rhetoric” for the violence.\n\nUribe, who is not yet an official presidential candidate for his party, is from a prominent family in Colombia. His father was a businessman and union leader. His mother, journalist Diana Turbay, was kidnapped in 1990 by an armed group under the command of the late cartel leader Pablo Escobar. She was killed during a rescue operation in 1991.\n\nColombia has for decades been embroiled in a conflict between leftist rebels, criminal groups descended from right-wing paramilitaries, and the government.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0810272605a7fcb.jpg",
  "retrievedAt": "2025-10-12T03:28:46.588Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916017/colombias-potential-presidential-contender-miguel-uribe-shot-suspect-arrested",
  "dateList": "2025-06-08",
  "date_published": "2025-06-08T05:28:53.000Z"
}
