{
  "title": "Situationer: ‘Lights, camera, action’ needed to bring folk back to big screens - Newspaper - DAWN.COM",
  "author": null,
  "content": "• 67 cinemas closed since 2018, film distributor says\n• Only two movies being released this Eid\n• Costs, cultural constraints affect cinema industry amid OTT boom\n• Artists, producers say govt patronage key to silver screen revival\n\nWITH a shift from big cinemas — whose prices were more affordable to a larger segment of society — to high-end multiplexes, a dearth of quality films and the rise in over-the-top streaming services, it feels like the curtain is falling fast on the silver screen industry.\n\nThis is not just the story of one industry, rather a cultural loss, where avenues of community entertainment have dwindled over the years.\n\nSixty-seven cinemas have been closed all over Pakistan in the last seven years, known film distributor Sheikh Abid told Dawn. “Across Punjab, only 39 cinemas are left after the closure of as many as 37 cinemas.”\n\nEven Film star Shaan Shahid regretted that there were no films to run the cinema halls.\n\nOnly two Pakistani movies, Deemak and Love Guru, are being released this Eid.\n\nOn the list of the top 11 highest-grossing Pakistani films within local cinemas, there were four movies in 2018 and two in 2022 but none afterwards, indicating the waning flow of quality content.\n\nAt the same time, the affordability and diversity offered by Over-The-Top (OTT) services have increasingly pulled audiences away from cinemas.\n\nIn Shaan’s words: “Cinema perhaps is getting outdated, but not the content. Good films are always the outcome of good content.”\n\nHe says no attention had been paid to filmmaking over the years. “Young filmmakers should have been given a chance and should be financed to come up with films having good content. [In such case] The atmosphere of cinema cannot be replaced with social media platforms.”\n\nGrowth of OTTs\n\nHowever, streaming has already globalised Pakistani content, with Sunn Mere Dil, Dil-i-Nadan, Churails, Rukhsaar, Aik Jho­oti Love Story and Barzakh gaining traction in the Middle East, India, and among the diaspora.\n\nNetflix’s Jo Bachay Hain Sang Samait Lo starring Fawad Khan and Sanam Saeed is slated for later this year, signalling a leap in international visibility.\n\nCreative freedom and affordability are the main reasons for the growth of OTT platforms such as Netflix, Amazon Prime, Zee5 and iflix, drawing not only audiences but also artists away from mainstream cinema in Pakistan, which has struggled to evolve beyond formulaic storylines due to cultural or commercial constraints.\n\nFilm producer Kanwal Khoosat says, “Local and international are two different scenarios when it comes to films. It seems to us cinema has become old-fashioned, whereas OTT for its outreach and visibility is one of the essentials, but it’s a misconception.”\n\nIn Europe, she said, it is considered derogatory to screen films on OTT. “We in Pakistan have no diplomacy with [such] platforms, we need to rely on our own cinema for its revival. Regretfully, cinema is no more an entertainment for the ordinary man; modern cinema halls are for the elite.”\n\nGovt support, fee cut\n\nHowever, Yasir Nawaz, a noted director and producer, was of the opinion that cinema was experiencing a downfall across the world. He said OTT or AI were not the issue, what matters for cinema’s revival was “big support from the government” and “fee cut by exhibitors and distributors”.\n\nHe said no strategies had been laid out to revive the industry. “Expensive cinema halls led to less buying of tickets,” he said, adding even they did not offer discounts.\n\nNoted film director Nadeem Baig, who directed films such as Punjab Nahi Jaoon Gi and Jawani Phir Nahi Aani, said OTT platforms did give competition, but cinema could only be revived when filmmakers produced around 12 films a year.\n\nHe said government support was vital. “It is good Punjab and Sindh governments have realised spending on filmmaking is important,” he noted.\n\nHumayun Saeed beli­eves OTT platforms can’t affect cinema, asserting they could not create the effect that cinema had. But industry’s revival depended on supply chain and government support, he said. Production of more and diverse films was the mantra, he said.\n\nMentorship\n\nFor veteran actor Nayyer Ejaz, improved content is key to revive cinema. “Why OTT is being considered top of the line? Because they choose the best and different content,” he said. Government patronage is important, but young writers must learn screenplay from seniors, he said, adding the industry also needed to adopt modern techniques.\n\nFilm writer Pervaiz Kalim was of the opinion that young filmmakers could help revive cinema, while also underlining the need for mentoring budding filmmakers by seniors to boost film production.\n\nIf Pakistani content can get awards and nominations in international film festivals, there’s no dearth of talent or scarcity of original content.\n\nActor Wahaj Ali, however, thinks OTT and AI had nothing to do with the revival of cinema. “We need to enhance our productions. Pakistani dramas have a great international audience. If producers invest properly in films without fear of recovery, quality films can be produced.”\n\nScreenwriter, actor and host Vasay Chaudhry, too, believes OTT or any other social media platform could not replace cinema. “Cinema’s popularity just cannot be replaced,” he reiterated. People used to say after Covid that cinema wouldn’t survive, but many films were screened, he remarked.\n\nMany film enthusiasts, however, question if our known filmmakers, artists, distributors and exhibitors are prepared to take up the challenge, embrace innovation and hone the potential of young tech-savvy minds or still in denial mode, resorting to blame game and awaiting some external help to turn the tide.\n\nIndeed, when the brightest minds are empowered with the experience of yesteryears and the tools of tomorrow, miracles can happen.\n\nHassan Sheerazi in Karachi also contributed to this report\n\nPublished in Dawn, June 7th, 2025\n\nHeader image: WITH only two local films — Love Guru and Deemak — due for release this Eid, enthusiasts are asking why the industry doesn’t embrace modern tools and youthful thinking.—Instagram/Deemak",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/081058525348a43.jpg",
  "retrievedAt": "2025-08-20T03:49:20.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915927",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T23:39:22.000Z"
}
