{
  "title": "SMOKERS’ CORNER: THE LIES WE TELL OURSELVES - Newspaper - DAWN.COM",
  "author": null,
  "content": "Here’s some bad news for those who believe that the tendency in an increasing number of people to believe in lies can be mitigated if information is shaped and shared in a more responsible and mindful manner.\n\nAccording to the anthropologist Marcel Danesi, once people begin to believe in lies, they are unlikely to change their minds even when confronted with evidence that contradicts their beliefs. Danesi wrote, “They turn the contrasting information on its head, so as to make it fit their beliefs.”\n\nResearch in this regard shows that, once a lie is accepted, the brain becomes more susceptible to subsequent lying. So, does this mean one should be resigned to the fact that we will always be surrounded by folk who are only willing to believe what they want to believe? I’m afraid so.\n\nSupporters of the jailed former Pakistani prime minister Imran Khan continue to exchange ‘information’ about his release. They’ve been at it for over two years now. They keep exchanging dates of his ‘triumphant’ release, which never materialises. Yet, this hasn’t dissuaded his supporters from continuing to embrace new ‘information’ about his release and then waiting for another date.\n\nFrom Pakistan’s political myth-making to India’s media-fed fantasies of war, the truth is currently struggling against a tide of comforting falsehoods\n\nAnd when that date too passes without incident, this miss is spun with new ‘information’ in which, supposedly, the establishment and government are desperate to release Khan but he is refusing to come out himself, because he doesn’t want to strike any demeaning ‘deal’ with his opponents.\n\nLet’s take another case. On the evening of May 9, millions of Indians remained glued to their TV screens and on social media, excitedly applauding what their TV anchors were telling them was happening in Pakistan. Apparently, city after city in Pakistan was falling to the might of the Indian armed forces and a whole province had broken away to declare its independence. The government had fallen and the military chief had been removed.\n\nOf course, this was all hogwash. Wasn’t there even a single significant Indian who bothered to check other news sources? ‘News’ was flooding in from Indian media outlets of one nuclear country effortlessly dismantling another. So didn’t anyone gasping with excitement in India bother to check BBC, CNN, Reuters, Al-Jazeera etc.? All these have correspondents in Pakistan.\n\nEven when evidence began to emerge that it was India that had suffered millions of dollars’ worth of losses when the Pakistan Air Force shot down at least 5 Indian jets, the Indian media began to spin this as ‘minor losses’ suffered by a ‘giant’.\n\nThere were no apologies by those who went on a feeding frenzy on brazen ‘information’ being relayed to them by their ‘reporters’, and which they shouted out all evening in front of the cameras.\n\nThere are several overlapping factors that are at play in the two examples that I have provided:\n\n(1) Conformation Bias: people tend to accept information that bolsters their existing beliefs, making them less likely to question or reject misinformation.\n\n(2) Motivated Reasoning: in an essay for The Washington Post, the journalist Richard Sima wrote that people’s beliefs and desires can influence how they interpret and process information, making them more susceptible to lies that align with their goals or emotions.\n\nIf Khan is not released on the date his supports were ‘informed’ he would be, the likely truth that there was never any plan to release him is understood by his supporters as Khan himself not wanting to be released, because he’s a ‘principled’ man who doesn’t want to cut a deal with his ‘corrupt’ and ‘oppressive’ opponents.\n\n(3) The Illusory Truth Effect: repeated statements, even false ones, can become more believable over time due to increased familiarity. This propaganda tactic was first perfected by the Nazi regime in Germany. Recently, some Indian anchors confessed to using this ploy when they were caught spreading outright lies about Pakistan’s annihilation.\n\nBut the thing is, their claptrap in this regard was repeated over and over again in a matter of just a few hours and not months/years that it takes for this ploy to effectively achieve its purpose. However, if the purpose was to gain an evening full of TV ratings, then this tactic did work.\n\nMisinformation, when amplified on social media, creates echo chambers, where people are revealed only that information which confirms their biases. In these chambers, people often believe information that aligns with the beliefs of their ‘social/political tribe.’ One saw this on Indian social media when, on May 9, millions of Indians got guzzled by a giant echo chamber and lost all contact with the reality that existed outside.\n\nTruth often seems humdrum compared to a fantastical lie. Lies can trigger strong emotions. They are thus more attractive and compelling than the truth. Indians were told fanciful lies that played out like Bollywood blockbusters. The lies heightened emotions that completely overwhelmed any ability left in most Indians to apply critical thinking. This factor is especially potent if the lies have any relation to a ‘popular’ leader who is adored as a messiah of sorts.\n\nIn India’s case, it is PM Narendra Modi and, in Pakistan’s case, it is Khan. According to the American political historian Ruth Ben-Ghiat, once people bond with a populist leader, they may be inclined to dismiss any evidence that conflicts with his claims, or overlook contradictions in his messages. They may know he is lying, but they decide that they don’t care.\n\nKhan constantly contradicts himself in his statements that are relayed through his party’s X account. Interestingly though, he seems to be petrified that a deal with his opponents will embarrass him in front of his supporters. Truth is, they are likely to spin it into meaning something noble and gallant.\n\nThis is exactly what Modi’s most hardcore fans have also been doing when faced with increasing evidence that Modi’s gambit against Pakistan failed. Instead of believing this, they are trying to spin it as a “victory against terrorism.”\n\nTo Ben-Ghiat, investing in media literacy is essential, but so is education about the damages of populist models of power that turn leaders into infallible god-like figures with a network of lies and misinformation.\n\nPublished in Dawn, EOS, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68418b70bf713.jpg",
  "retrievedAt": "2025-08-20T03:49:17.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915614",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T03:20:26.000Z"
}
