{
  "title": "PAKISTANI STUDENTS AND THE ‘AMERICAN DREAM’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "Shayan* and his wife Aliya* spent the last couple of months preparing their travel plans, which included a potential Haj trip after a visit back home to their families in Pakistan.\n\nAt least, this was the plan up until the end of March. Shayan, a PhD student in the US who lives with his wife and daughter, found himself concerned about his travel plans when the Trump administration started revoking student visas.\n\nWhile Shayan has been in the US since the first Trump administration took office, Aliya only joined him two years ago, with their daughter. Aliya reveals that when Trump was re-elected, Shayan grew extremely anxious and she was the one who kept re-assuring him that things would be alright.\n\nThat was until the Trump administration’s sudden actions against foreign students, which led to hundreds of students and recent graduates having their visas revoked. As part of the crackdown, Trump’s team has frozen hundreds of millions of dollars in funding for universities and moved to deport students, while revoking visas for others.\n\nWith Shayan on a student visa, and Aliya and their daughter living there as his dependents, the couple is worried about potentially leaving the country and not being able to return. “Shayan’s coursework is still not completed,” Aliya says, “so if we travel abroad and are not able to return, my husband’s career would be over and he would have to start all over again.” Such an outcome, after all the time and investment the couple has put into starting a new life in the US, would be painstakingly difficult.\n\nThis is why, despite the fact that their two-year-old daughter asks to go to her “Nano’s [grandmother’s]” house every time she sees a plane flying overhead, the couple have made the decision to stay in the US for the remainder of the year — unsure as to when a trip back to Pakistan will be possible.\n\nAs US visa restrictions tighten, threats of visa revocations increase, university funding becomes limited and Islamophobia grows under the Trump administration, Pakistani students applying to the US find their futures hanging in the balance. For many, their dream of studying in the US is turning into a costly gamble they may no longer be able to afford — emotionally or financially\n\nTheir decision to not take the risk of travelling abroad was further cemented when they took a domestic flight within the US, only to find themselves under far more scrutiny from airport security than they’d ever experienced. At the airport, they found themselves dealing with increased screenings, and Aliya even had her hijab swabbed as part of the security check.\n\nAliya says, “The adviser who handles all the foreign students advised us not to travel.” The adviser also added that “if push comes to shove, change your dissertation topic [which required Shayan to travel] but do not travel.”\n\nShayan and his family are not the only ones in this position right now. With a travel ban hanging in the balance, and so many plans upended, being a student, or even a potential student, in the US is turning out to be more confusing and stressful than it has ever been.\n\nAcross the world, countless students are now living under the fear of what their future might look like. Pakistani students currently in the process of applying to universities in the US, those who had already gained admission to US universities, and those currently studying there now find themselves in uncharted waters.\n\nWhen it comes to how college counsellors in Pakistan are helping students navigate these unprecedented times, their first step is making sure students have alternative options. Putting all your eggs in one basket leads to a higher risk of emotional distress when that option doesn’t work out, and advisers want to be sure that their students have a back-up.\n\nThe latest development has seen the Trump administration order US embassies around the world to stop scheduling appointments for student visas, as it prepares to expand “social media vetting” of such applicants. This comes during a wide-ranging crackdown on some of America’s most elite universities, with Trump accusing many of these institutions of failing to combat “anti-Semitism” when pro-Palestinian protests have taken place on campuses.\n\nAside from the restrictions themselves and confusion around them, there’s also the very real emotional toll this process has been taking on everyone involved — from students, to parents and college advisers. For many young Pakistanis, securing a future in the US is the ultimate dream. For most young people, that future starts with a student visa and, as things stand, they’re no longer sure if they can get it.\n\nSEPARATING FACT FROM HYPERBOLE\n\nFollowing Trump’s re-election, there was a lot of media noise regarding a potential travel ban with countries across the world facing different restrictions. There was also some confusion about whether Pakistan would be on the yellow list or the more restricted orange list, which has worried potential visa applicants regarding their future. When leaked drafts made it to the news, both global and Pakistani media tried to deduce what it would mean for international travellers.\n\nStudents, in particular, would be one of the groups that would bear the brunt of these restrictions. One of the first orders that Trump passed focused on extended vetting and screening for visa holders — both those in the process of applying and those already in the country. The recent arrests and visa revocations from multiple universities across the US have only added to the fear students are facing.\n\nUS Secretary of State Marco Rubio, when talking about the increased scrutiny visa holders are facing, said that the department was targeting those who were involved in activities that “run counter” to US national interests.\n\nMuhammad Ali, a Senior Education Counsellor at The IEIS Education Group in Pakistan, believes that media attention regarding this issue — which he thinks has been exaggerated — is adding to the fear. “Our media has been quite heated with regards to US visa policies, talking about deportations and visas being revoked,” he says, while also pointing out that the situation is not as extreme and “it’s not like everything is being rejected.”\n\nHasan* is one of those students whose US visa came through recently. As he prepares to start his PhD in the US soon, he shares that he initially wasn’t even considering applying to the US, simply because he’d heard how difficult it now was to go through the visa process. The new directives that required the checking of applicant’s social media as part of visa applications also concerned him.\n\n“I hadn’t shared any posts that could be flagged, but I was still worried,” Hasan reveals. “My friend and teachers told me I wouldn’t know unless I tried, so I decided to do it,” he shares. But he also adds that a friend of his who had applied for his Master’s had had his visa rejected.\n\nJunaid Sohail, the CEO and founder of Endeavours Consultants, a company that advises Pakistani students on studying abroad and study visas, observes that the acceptance might hinge on a preference for certain subjects.\n\n“I have seen many cases of students who are applying for pre-med and Stem [Science, Technology, Engineering and Mathematics] subjects having a higher chance of visa acceptance than those applying for a business degree,” he says. He adds, “Parents are very concerned, especially after all the hype regarding this that they see in the media. We’re trying to explain to them that deportations only occur in the case of people breaking the law.”\n\nOn the other hand, Aliya believes that people in Pakistan haven’t understood this issue and its ramifications correctly. When she and her husband initially tried to reach out to their Pakistan-based Haj organisers to talk to them about potentially cancelling the trip, Aliya says the organisers didn’t understand how dire the situation was. Ultimately, they were able to get a refund.\n\nBut whether the Pakistani public fully understands the changes ushered in by the Trump administration, student arrests in the US are real, and they are causing concern. Increasing Islamophobia, arrests of students participating in pro-Palestine protests, students under increased scrutiny and the revocation of student visas has led to many Pakistani students reassessing their academic futures in the US.\n\nFUTURES AT RISK\n\nNaima* is a medical student currently in her fifth year at Dow University of Health Sciences. She has long been on track to apply to the US for further medical studies — a pathway many of her classmates, and previous alumni, have been through. The eventual goal is to go to the US for their electives, followed by a residency and then, hopefully, a job — one that pays back the extremely high investment Pakistani students have to put in just to secure their futures in the US.\n\nAccording to Naima, “The general culture at my university now is that you give your USMLEs [United States Medical Licensing Examinations] as fast as you can. A lot of people have now started giving it in their third, fourth and fifth year. The plan is to go to America as quickly as possible.” Naima, and many students like her, now have to navigate the pressures of medical school with the additional difficulty of US applications.\n\nFor Naima, who has already given all her USMLE Step exams — there are three — and has been planning for this since she began medical school, it’s hard to imagine a back-up. “I’m in my fifth year of med school and the Match process [through which medical students are matched with their residencies in the US] is already extremely stressful, and this uncertainty regarding studying in the US is only adding to it,” Naima says, as she talks about how it’s already become very hard to even get a US visa interview date.\n\nNaima’s original plan was, and still is, to go to the US in March 2026, which would then give her three months to take part in her electives — hands-on work experience in a US hospital that students get to undertake right before they graduate.\n\nBut electives can only be undertaken when a student is still registered in their programme at their university, and Dow has told its students it will officially have them graduate in June. Following their graduation, electives no longer remain an option and, while they can still gain experience under what’s called “observerships”, Naima points out that electives hold far more weight on one’s CV’s for future opportunities.\n\n“If I get my visa late, if I do end up getting it at all, that is, going after June would severely impact my chances, since I won’t be able to do an elective,” she says, pointing out that many of her classmates have got visa interview dates for March 2026.\n\nIt’s not just Naima and medical students who feel confused with these latest changes. Omair*, a student at the Institute of Business Administration (IBA), had received admission into Boston’s Northeastern University for a Master’s in Data Analytics. He was long set on pursuing this path for his future and felt so sure that it would work out that he didn’t even have a back-up plan in place. For him, it’s not even a case of long-term immigration to the US. Omair just hopes to get his degree, maybe some work experience and then move back home to work in his father’s business. So, when his US visa got rejected recently, the shock hit him and his parents very hard.\n\nCounsellors, such as Sohail and Ali, reveal that having a clear purpose for your visit and confidence in your future plans makes it extremely likely that you will get your US visa. After all, the visa interview officer really just wants to ensure that students aren’t going to drop out of college and resettle elsewhere in the country, Sohail says.\n\nBut Omair had both a strong sense of his future plans, and all his financial statements were in order. Yet he was rejected on account of not having “sufficient home ties”, which he says he found confusing, because the only family member of his currently in the US is his brother-in-law, with whom he has no blood ties. While they were both aiming to attend the same university, surely that shouldn’t be enough of a reason for a visa officer to question Omair’s plans?\n\nWhile Omair is trying again to get the visa, he’s not particularly hopeful: “To get an acceptance the second time is very difficult, and the problem is, I don’t even know what I did wrong the first time,” he says. He does think it may be a case of the interviewer being suspicious of why he seemed to only be applying mostly in or near the Boston area, although that was just a personal preference, but he won’t know for sure.\n\n“Initially I didn’t even have another plan so, once I got rejected, I got scared,” Omair says. “I had not applied to any other country except the US. After I got rejected, I applied to two other universities in the US outside of Boston. My counsellor told me to apply to other countries, and then I started applying for jobs as well.”\n\nBut while he’s ready to get up and try again, Ali, who’s counselled countless students over the last four years, says that many students are simply unable to deal with the rejection. He even had a student who considered ending his life because he couldn’t see a future beyond his hopes for studying in the US, which didn’t materialise. Many others find it hard to recover as well, just from the sheer effort that they often put into trying to make this work.\n\nTHE FINANCIAL AND EMOTIONAL BURDEN\n\nThe effort isn’t just the time alone — it’s the hundreds, if not thousands, of dollars that go into just the application. Furthermore, as the dollar rate continues to climb higher against the rupee, the financial pressure increases along with it. There are the application fees, the countless hours spent writing essays, the SEVIS (Student and Exchange Visitor Information System), IELTS (International English Language Testing System) and GRE (Graduate Record Examinations) fees, and even payment for the visa interview. “It just leaves you hanging, because you invest so much into it,” Omair says.\n\nDepending on what you’re studying, those fees may get significantly higher. Naima, like most medical students, has had to pay for the exam fees for her Step exams and has made a significant investment in procuring the materials needed to prep for the exams. She will also have to pay for her elective and fund living costs if she ends up in the US.\n\nWith the US getting more and more expensive, college counsellor Zara Malik*, who is also currently a Master’s student at Harvard University’s Department of Education, points out that there’s also the additional burden of finding financial aid, since a very small percentage of Pakistani students can even afford studying in the US without a scholarship or financial support.\n\nMalik has been a college counsellor for eight years, working with some of the most popular A-Level schools in Karachi before opening up her own private counselling firm. She’s noticed how there was already a decrease in the number of students applying to the US after the arrival of the Trump administration and because of how increasingly expensive studying in the US has become.\n\nTalking about how the uncertainty of the last few months has impacted student’s perceptions of the US as an ideal study destination, Malik says, “The onset of the Trump administration has created a lot of chaos. Even those who could afford it, have now been hit by visa cancellations.”\n\nMalik and the other counsellors point out that universities in Europe, Turkey and the Middle East are becoming increasingly popular, not only due to their high rankings but also because of what promises to be a much better and more affordable student experience.\n\nEven though Naima is still hoping to go through with her plans to go to the US, she knows it is not an easy decision. There are still students around her who are in the early stages of their application process and are now wondering if the time and money spent will be worth it. Naima says, “People have now been considering that, okay so we’ve given the Step 1 but do we still want to spend 7000 to 8000 dollars to go through this whole journey and not get a Match, or should we just explore other pathways?”\n\nAnd even though Naima has had extensive conversations with her fiancé — who’s also planning to go to the US — about their future, she’s started thinking about the possibility of a back-up. She hasn’t fully fleshed out her thinking yet, because she’s still hoping the US pathway works out, but she’s had to start thinking about what could happen if it doesn’t.\n\nFurther increasing the financial pressures is the Trump government’s new policy to cut back on federal funding to educational institutions, which would severely impact the amount of financial aid universities can give out. Harvard currently finds itself at the epicentre of Trump’s policy changes after the administration announced it was freezing more than $2 billion in federal contracts and grants with Harvard, which mostly fund scientific and medical research.\n\nSpeaking as a Master’s student, Zara Malik says, “A lot of people in my class at Harvard are worried they may not be able to get renewed funding, and these are domestic students very worried about funding. So, international students won’t be getting a lot of aid.”\n\nIn her opinion, the lack of financial support will be another way that the Trump government will exclude and discourage Pakistani students from applying to the US, and that’s not the only burden. Along with the financial burden, it’s the increasing emotional stress coming from fears of Islamophobia and what their student experience may look like in this new reality.\n\nMalik says that, based on her recent conversations with students, this is an increasing concern for many applicants to the US: “This seems like one of the final nails in the coffin for the declining popularity of the US, given the rising Islamophobia and issues of freedom of speech. The facade has really come off.”\n\nThe Trump administration also announced that it would revoke Harvard’s ability to enrol international students and force current foreign students to transfer to other schools or lose their legal immigration status. However, a federal judge has now issued a block on this order.\n\nThe implementation of any such policy would be disastrous for US universities given that a large chunk of their revenue comes from international students. According to the US-based census institute Open Doors’ 2024 Report on International Educational Exchange, the total number of international students at US colleges and universities reached an all-time high of more than 1.1 million students for the 2023 and 2024 academic year. This was a seven per cent increase from the previous academic year. According to Reuters, “Harvard’s 6,800 international students make up 27 per cent of its total enrolment.”\n\nWHAT COMES NEXT?\n\nWhen it comes to how counsellors are helping students navigate these unprecedented times, their first step is making sure students have alternative options. Putting all your eggs in one basket leads to a higher risk of emotional distress when that option doesn’t work out, and advisers want to be sure that their students have a back-up.\n\n“What we do is we make sure kids have an alternative option,” says Sohail. “We encourage them to apply to the UK, Cyprus, Malaysia or Dubai.” He adds: “If we can see that an applicant’s visa or admission might be at risk, we get them into international campuses of US universities and then help them to transfer their credits after a year or so.”\n\nTrepidation regarding studying in the US has also led to many students exploring local university options. According to Fuad A Mehdi, Head of Marketing and Communications at IBA, Karachi, “It is too early to comment on the overall number of applications as IBA admissions close at the end of June. Having said that, Round I applications for the undergraduate programmes this year have registered an increase of 13.68 percent compared to last year’s Round I undergraduate programmes’ applications. The average year-over-year increase in the number of applications is usually between 2-5 percent. The target intake [total seats] has remained unchanged for the past three years, therefore overall competition per seat is going up every year, but this year it is expected to be even more competitive.”\n\nZainab*, a student who has just completed her A-Levels, had been applying to business schools in the US since last year and has also received two conditional offers. But, after recent developments, she says that her parents told her to apply to local universities as well that offer a business degree. “I’d given my SAT [Scholastic Aptitude Test] exams with the sole intention of going to the US for my undergrad,” she says.\n\n“But I’ve now had to look at university options in Pakistan in case my visa doesn’t come through or if there is some other policy change regarding foreign students. The whole situation is quite taxing, for both me and my parents.”\n\nFor those students who do manage to make it to the interview stage, Ali encourages them to prepare well, saying that it’s extremely important to display confidence and understand the interviewer’s questions properly.\n\nBut at the end of the day, Ali, Sohail and Malik all agree that no matter how much you prepare or follow the supposed rules, there’s no guarantee. The Trump government seems far more extreme this time around.\n\nFor many students, that’s enough to let go of the ‘American dream’ and look elsewhere, where their experiences and identity will not be sacrificed for their education. Others will keep fighting their way through the process, even while knowing it won’t get any easier.\n\n*Name changed upon request to maintain privacy\n\nThe writer is a journalist and the founder of Echoes Media. X: @anmolirfan22\n\nPublished in Dawn, EOS, June 6th, 2025\n\nHeader image: Illustration made using Microsoft Designer",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68418ba50b06c.jpg",
  "retrievedAt": "2025-10-12T03:28:23.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915622/pakistani-students-and-the-american-dream",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T03:20:26.000Z"
}
