{
  "title": "Beware: Driving ‘wrong way’ in Sindh will cost up to Rs200,000 in fines - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Rs200,000 fine on govt vehicles for violating one way, Rs100,000 on private car drivers and Rs25,000 for motorcyclists\n• Driving without licence to cost Rs50,000 for four-wheelers, Rs25,000 for bikers\n• Meeting decides to ban four-seater rickshaws across Sindh\n\nKARACHI: The Sindh government has decided to amend the motor vehicle law to increase traffic violation fines and ban four-seater rickshaws.\n\nAfter the amendments, wrong-way driving will cost a car driver Rs100,000 and motorcyclist Rs25,000.\n\nThe decision to this effect was taken at a meeting, chaired by Home Minister Zia Ul Hassan Lanjar, to discuss amendments to the Motor Vehicles Rules.\n\nThe meeting, attended among others by Excise Minister Mukesh Kumar Chawla, law secretary, transport secretary and DIG Traffic, also approved mandatory fitness certification for both commercial and non-commercial vehicles, outsourcing vehicle fitness evaluations to third parties and a ban on the sale of paper car tints, fancy lights and sirens either online or at shops.\n\nFor wrong-way driving, the approved fines are set at Rs200,000 for government vehicles, Rs100,000 for other four-wheelers and Rs25,000 for motorcycles.\n\nDriving a vehicle without a valid licence will cost a fine of Rs25,000 for motorcyclists and Rs50,000 for car drivers. One-wheeling or drifting will result in a Rs100,000 fine for a first-time offence, going up to Rs200,000 and Rs300,000 for repeated violations.\n\nThese decisions were taken in the backdrop of a surge in traffic accidents, particularly involving dumpers and water tankers that killed nearly 500 people and injured 4,879 in 2024.\n\nThe meeting approved legal amendments to enforce a complete ban on four-seater rickshaws with the excise minister assuring full support from the excise department in enforcing traffic regulations.\n\nHe ensured the meeting that no registration or route permits would be issued for four-seater or larger rickshaws like Qingqi, as many accidents have taken place due to rickshaws colliding with trucks.\n\nThe excise minister further said that a crackdown would be launched against any such vehicles found operating on the roads. He promised a prompt completion of the vehicle fitness service structure and said that strict enforcement of fitness requirements would follow.\n\nHe said that it would be mandatory for water tankers and dumpers to install trackers and sensors.\n\nIt was decided that a comprehensive draft of the new regulations would be prepared and submitted to the Sindh government for approval and ratification.\n\nThe home minister said that only one-plus-two rickshaws would be allowed on the roads to reduce traffic congestion, accidents and rule violations.\n\nThe meeting also approved the mandatory installation of at least five cameras in heavy vehicles.\n\nIt was also decided that e-challans for traffic violations would be delivered to vehicle owners’ registered home addresses. Vehicles with unpaid fines will not be allowed to be sold or transferred.\n\nMr Lanjar further said that the traffic, transport and excise systems would be interlinked and moved online, and announced the appointment of a dedicated traffic magistrate to handle traffic law offence cases.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:49:19.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915847",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T23:40:03.000Z"
}
