{
  "title": "Police investigate family of 10-year-old suspect in infant murder case in Rawalpindi - Newspaper - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: After the police enlarged the scope of their investigation to determine the real circumstance surrounding the murder of a toddler allegedly by her 10-year-old cousin in Ratta Amral, it emerged that the suspect was mentally unstable.\n\nThis was revealed by the grandmother of the juvenile suspect during police investigation.\n\nThe suspect’s mother had left her husband’s house, along with her two children, including the 10-year-old boy, and started living with her parents in Ratta Amral. She had left behind her two other children with their father who was an addict.\n\nThe police investigated the family members of the suspect’s father to find out the motive behind the tragic death of one-year-old Maryam whose body was found in a sewerage line in Ratta Amral late Wednesday night.\n\nInitial postmortem examination suggested that sewage had entered her lungs and brain which caused her death. The little girl was laid to rest in a local graveyard on Thursday afternoon.\n\nMaryam’s grandmother, Musarat Bibi, said a large number of people, including her relatives and people from their neighbourhood, were visiting her house for condolence.\n\nThe police have already added murder section (302 of the PPC) in the FIR which had already been registered under kidnapping charges (363 PPC) and arrested the suspect. The boy was shifted to the Child Protection Bureau on the orders of a local court. Musarat Bibi told Dawn that police had investigated the suspect’s paternal grandmother who has revealed to the police that the boy was mentally unstable.\n\n“The boy loved Maryam as an elder brother but what compelled him to do such an act is beyond her understanding,” she said, adding that, “it was our fate”.\n\n“On one side, there is the daughter of my son and on the other is my daughter’s son,” Musarat Bibi said. During initial investigation, the suspect revealed that he picked up the girl from the street and took her to a sewerage line where he submerged her head which claimed her life.\n\nQuoting the 10-year-old boy, the police said he did not like her. However, the police are investigating all aspects.\n\nThe police traced the culprit through CCTV footage in which he could be seen taking the girl from the street.The girl’s body was handed over to her parents after postmortem and was laid to rest on Thursday afternoon.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:49:18.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915892",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T23:40:16.000Z"
}
