{
  "title": "Pakistan seeks global ‘intervention’ in issues with India as diplomatic team lands in London - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan has called for “intervention” from global powers in resolving key issues with India amid ongoing tensions, members of a high-level delegation presenting Islamabad’s stance said on Sunday after landing in London.\n\nEarlier this month, Pakis­tan launched a broad-based engagement campaign in the United States to present its perspective on the recent conflict with India, and counter New Delhi’s growing lobbying presence there. As part of its global outreach, the team has arrived in London and will also visit Brussels.\n\nThe delegation comprises former foreign ministers Bilawal Bhutto-Zardari, Hina Rabbani Khar and Khurram Dastgir; Senators Sherry Rehman, Musadik Malik, Faisal Subzwari and Bushra Anjum Butt; along with senior envoys Jalil Abbas Jilani and Teh­mina Janjua.\n\n“The resistance we faced is that the Americans think that since [US] President [Donald] Trump has mediated the ceasefire, there is no need for further intervention. This was exactly our mission: to make them understand that intervention is needed,” Dastgir told Geo News after arriving in the United Kingdom.\n\n“The diplomatic delegation fulfilled its objectives,” he asserted.\n\nThe former MNA added: “Our ministers also put forward this stance that if India does not come to the table for talks again, then due to [the water issue] and India’s irresponsible behaviour — saying that it does not need evidence for a war — a war in the subcontinent is certain.”\n\nSimilarly, Subzwari told Geo News: “We want global powers to tell India that two neighbouring nuclear states cannot move forward in such a dangerous environment. It is not just damaging for the region but for the world’s peace.”\n\nNoting that the delegation began its engagements with a multilateral forum, the United Nations, the senator stressed, “Despite showing our military prowess, we have come with an invitation to peace.”\n\nRehman, a former ambassador to the US, called the meetings “very positive”.\n\n“They understood our points and the risks. They all also agreed that the weaponisation of water is extremely wrong,” she said, terming India-occupied Kashmir as the “largest open-air prison after Gaza”.\n\n“Whatever the Indians do, good luck to them,” the PPP leader quipped, referring to the delegations sent by New Delhi to various countries on the matter.\n\nRehman highlighted: “India’s delegation does not know what its mission is, except for maligning Pakistan. [However,] we did not go [to US] to malign India, but to tell Pakistan’s story.”\n\nSenator Butt termed the response in both New York and Washington to Pakistan’s concerns on held Kashmir and the Indus Waters Treaty (IWT), which India unilaterally held in abeyance after a deadly attack in occupied Kashmir, as “fantastic”.\n\n“If the Indus Waters Treaty is overlooked today, then no treaty in the future will stand any ground,” she asserted.\n\nSummarising the delegation’s stance, former caretaker foreign minister Jilani stated: “Our message was that India committed aggression and that Pakistan is a peaceful country.”\n\nHe reiterated Islamabad’s desire for a peaceful resolution to the long-standing issues between the two nations.\n\nPakistan has appeared to be aiming to draw the US into a more proactive diplomatic role in South Asia.\n\nEarlier this week, Prime Minister Shehbaz Sharif called Trump a “man of peace”, while Bilawal said it was “reasonable to expect that an American role in arranging a comprehensive dialogue would also be beneficial for us”.\n\nOn June 4, the Bilawal-led delegation concluded its two-day visit to New York, where it met with United Nations Secretary General Antonio Guterres, along with elected and permanent members of the UN Security Council.\n\nIt then met with several US Congress members in Washington — including chairman of the House Foreign Affairs Committee — as well as think tanks.\n\nAnother delegation, led by Special Assistant to the Prime Minister Syed Tariq Fatemi, visited Moscow from June 2 to June 4. It met with Russia’s Foreign Minister Sergey Lavrov and a senior aide to President Vladimir Putin.\n\nOn its part, India had also announced that seven all-party delegations would visit key partner countries, as well as meet members of the UNSC, to present the country’s stance on terrorism and “project India’s national consensus”.\n\nOn June 5, the Indian delegation met US Vice President JD Vance, taking advantage of his links to India.\n\nBoth delegations lobbied for their countries on Capitol Hill, meeting senior US lawmakers and chairs of various Congress committees.\n\nThe Indian delegation met members of the Senate Foreign Relations and Intelligence Committees, including senators Dave McCormick, Jacky Rosen, Jim Risch, Mark Warner, John Cornyn, and Elissa Slotkin.\n\nThe Indian delegation is led by Congress MP Shashi Tharoor and includes Shambhavi Chaudhary (Lok Janshakti Party), Sarfaraz Ahmed (Jharkhand Mukti Morcha), G. M. Harish Balayogi (Telugu Desam Party), Shashank Mani Tripathi, Tejaswi Surya, and Bhubaneswar Kalita (all from the BJP), Mallikarjun Devda (Shiv Sena), former Indian ambassador to the US Taranjit Singh Sandhu, and Shiv Sena MP Milind Deora.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0813451152d5266.png",
  "retrievedAt": "2025-08-20T03:49:18.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916022/pakistan-seeks-global-intervention-in-issues-with-india-as-diplomatic-team-lands-in-london",
  "dateList": "2025-06-08",
  "date_published": "2025-06-08T07:55:51.000Z"
}
