{
  "title": "Batteries reshaping energy landscape - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: The growing adoption of battery energy storage systems (BESS) in Pakistan is set to reshape the energy landscape — enabling a more decentralised and consumer-centric system, even as it poses significant challenges to the existing grid infrastructure.\n\nThis was highlighted in a report by the Institute for Energy Economics and Financial Analysis (IEEFA), titled “Battery Storage and the Future of Pakistan’s Electricity Grid”. According to the report, the adoption of BESS is being driven by both off-grid and on-grid solar photovoltaic (PV) installations. Pakistan imported 27.6 gigawatts of solar PV modules between FY19 and FY24, with an additional 5.2GW imported in the first half of FY25.\n\nHowever, it is estimated that only half of the total imported capacity is currently installed across the country, and at least 11.5GW of this capacity exists off-grid. “It is unlikely that all rooftop and captive solar consumers will adopt battery storage systems because of the high upfront costs,” said the report.\n\nIf all existing net metering capacity were paired with equal-sized battery storage systems, it could reduce annual electricity demand from the grid by 1.5 terawatt-hours (TWh) or 1.1 per cent of the country’s demand.\n\nPakistan imported 32.8GW of solar PV modules in five years\n\nSimilarly, commercial enterprises like office spaces, which operate from 9am to 5pm, may not require battery storage at night. Assuming a conservative estimate where only 25pc of the energy produced by the imported solar panel capacity is stored, annual grid demand could be reduced by 11.5TWh, or 8.4pc of Pakistan’s actual demand.\n\nThe convergence of rising energy prices and falling costs for distributed energy resources (DER), such as rooftop solar PV systems and BESS, have encouraged consumers to adopt decentralised energy solutions, reducing reliance on the grid and energy costs. “Pakistan imported an estimated 1.25 gigawatt-hours of lithium-ion battery packs in 2024 and another 400 megawatt-hours in the first two months of 2025, a trend that is likely to continue,” said the report.\n\nPakistan’s growing adoption of battery storage is supported by lithium-ion battery imports from China — the global leader in BESS technology and production.\n\nChina’s abundant clean technology manufacturing capacity is forecast to continue expanding, further driving down prices. Bloomberg New Energy Finance (BNEF) predicts batteries will cross the $100/MWh threshold in 2025, while global benchmarks for wind and solar generation are also expected to decline.\n\n“BNEF’s projections for global levelised cost of electricity (LCOE) benchmarks for battery storage in 2035 show an almost 50pc drop, with storage costs declining to $53/MWh,” said the report.\n\nWhile solar PV module prices in Pakistan have consistently declined, emulating improving economics in China, the same is not true for BESS because of high taxes and customs duties.\n\n“The average price of lithium-ion battery packs in Pakistan ranges between $230/kWh and $360/kWh,” said the report. It added that on a macro level, the falling demand from the grid has led to financial losses and increased capacity payments for the government and remaining consumers.\n\n“The country’s rapid adoption of solar PV systems has already started impacting centralised grid generation. As more consumers shift to net metering and self-generation, the overall electricity demand from the national grid has started declining,” said the report.\n\nHowever, due to contractual obligations resulting from long-term power purchase agreements, the exit of paying consumers from the grid increases the financial burden on remaining users through higher fixed costs and capacity payments.\n\nA more direct way of assessing BESS adoption is by examining lithium-ion battery storage imports. According to analysis by IEEFA, around 1.25GWh of lithium-ion battery storage packs were imported into Pakistan in 2024.\n\n“This accounts for around 4.7pc of that year’s 25.6GW annual peak demand. Based on a daily charging-discharging cycle, installing the entire 1.25GWh of battery storage could mean a yearly deduction of 438GWh of energy demand from the grid,” said the report.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:28:42.922Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915907",
  "dateList": "2025-06-08",
  "date_published": "2025-06-06T23:39:44.000Z"
}
