{
  "title": "Senate reviews nine key legislative reports, grants time extensions to two reports",
  "author": null,
  "content": "ISLAMABAD, Jul 18 (APP):Reports from nine Senate standing committees on key issues and legislative bills were presented in the Upper House, while the House granted extensions for the submission of two committee reports, in line with the Rules of Procedure and Conduct of Business in the Senate.\nThe House approved Senator Faisal Saleem Rehman’s request to extend, by 60 days from July 18, 2025, the deadline for the Interior and Narcotics Control Committee’s report on the Islamabad Capital Territory Food Safety (Amendment) Bill, 2025, introduced by Senator Samina Mumtaz Zehri on May 19, 2025.\nThe House approved Senator Irfan-ul-Haq’s request to extend the deadline by 60 days, effective July 16, 2025, for the Foreign Affairs Committee’s report on Starred Question No. 24—raised by Senator Danesh Kumar on December 19, 2024—concerning deputation-based appointments in the Ministry of Foreign Affairs over the past five years.\nSenator Shahadat Awan, on behalf of Senator Farooq H. Naek, Chairman of the Standing Committee on Law and Justice, presented the Committee’s report on the Whistleblower Protection and Vigilance Commission Bill, 2025, aimed at establishing the Whistleblower Protection and Vigilance Commission.\nOn behalf of Senator Farooq H. Naek, Chairman of the Standing Committee on Law and Justice, Senator Shahadat Awan presented the Committee’s report on the Pakistan Navy (Amendment) Bill, 2025, which seeks to amend the Pakistan Navy Ordinance, 1961.\nSenator Shahadat Awan, on behalf of Senator Farooq Hamid Naek, Chairman of the Standing Committee on Law and Justice, presented the Committee’s report on the Legal Practitioners and Bar Councils (Amendment) Bill, 2025—introduced by Senator Naek on May 19, 2025—to amend the Legal Practitioners and Bar Councils Act, 1973.\nSenator Shahadat Awan, on behalf of Senator Farooq Hamid Naek, Chairman of the Standing Committee on Law and Justice, presented the Committee’s report on the Legal Practitioners and Bar Councils (Amendment) Bill, 2025—introduced by Senator Naek on May 19, 2025—to amend the Legal Practitioners and Bar Councils Act, 1973.\nSenator Fawzia Arshad presented the Functional Committee on Devolution’s annual report (April 2024–March 2025) on devolution issues under the 18th Constitutional Amendment, on behalf of Senator Zarqa Suharwardy Taimur, the Committee’s Chairperson.\nSenator Syed Waqar Mehdi, Chairman of the Committee on Rules of Procedure and Privileges, presented the Committee’s report on the Privilege Motion moved by Senator Syed Masroor Ahsan regarding misconduct by the Chief Operating Officer of the Karachi Water and Sewerage Corporation (KWSC).\nSenator Syed Waqar Mehdi, Chairman of the Committee on Rules of Procedure and Privileges, presented the Committee’s report on the Privilege Motion submitted by the Chairperson and Members of the Standing Committee on Information Technology and Telecommunication against the Deputy Secretary (Council) of the Ministry of Information Technology and Telecommunication for misleading the Committee.\nSenator Syed Waqar Mehdi, Chairman of the Committee on Rules of Procedure and Privileges, presented the Committee’s report on the Privilege Motion moved by Senator Mir Dostain Khan Domki concerning the irresponsible conduct of the Secretary, Communications and Works, Government of Balochistan.\nSenator Syed Masroor Ahsan, Chairman of the Standing Committee on National Food Security and Research, presented the Committee’s annual report for the period from June 2024 to May 2025.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:51:33.194Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-reviews-nine-key-legislative-reports-grants-time-extensions-to-two-reports/",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T08:31:00.000Z"
}
