{
  "title": "Ikhtiar Wali exposes Kohistan mega corruption, pointing to embezzlement of Rs. 200 billion in single district",
  "author": null,
  "content": "ISLAMABAD, Jul 18 (APP):Prime Minister’s Coordinator for Information Broadcasting on Khyber Pakhtunkhwa (KP) Affairs, Ikhtiar Wali Khan, on Friday exposed massive financial embezzlement and irregularities of 200 billion rupees in the Kohistan mega corruption scandal, terming it as the largest financial scandal in Khyber Pakhtunkhwa’s history.\nAt an emergency press conference held here, he said that this “shocking tale of corruption” began when a government account in Kohistan was illegally siphoned off Rs 200 billion through fraudulent means.\nWali Khan further revealed that the main accused, contractor Muhammad Ayub, was acting as a front man for a well-organized network, which allegedly included senior government officials.\nHe also claimed that this financial misappropriation began back in 2019 during the PTI government and continued for several years unchecked.\n“Those who claimed to be the champions of transparency, in fact, deceived the nation,” Wali Khan said.\nAccording to him, the National Accountability Bureau (NAB) had already carried out several operations in connection with this case, recovering luxury vehicles, gold, valuable properties and Rs. 5 billion cash, including foreign and local currency.\nHe further revealed that authorities have so far traced 30 houses, 25 luxury flats, 12 commercial shops, 4 farmhouses and 175 kanals of land acquired through illegal means.\nFurthermore, under the guise of a solarization project aimed at providing free solar panels to 32,000 households, a bribe of Rs. 1.25 billion was reportedly paid, he added.\n“If Rs. 200 billion can be looted from a single district, what could be the scale of corruption in the remaining districts”, he questioned.\nHe declared the Kohistan scandal a “test case” for the government and pledged that it would be taken to its logical conclusion.\nHe also criticized NAB KP for low recovery, assuring that the federal government would extend full support and security would be provided to the bureau’s officers.\n“This case has shaken the conscience of the nation,” he emphasized, stating, “We will not leave it unfinished. NAB officers must be given protection so they can conduct a fearless and impartial inquiry.”\nHe called upon the prime minister to ensure security for NAB’s KP investigators, focusing that only then the accountability process could be move forward.\n“The real face of the ‘captain’ and his team has now been exposed. Their corruption reached from personal drivers and cooks to contractors and public officials,” Wali Khan said.\nHe appealed to the public to use their vote in the upcoming elections to reject the so-called leaders of thieves and looters and support the government’s efforts to deliver real and uncompromising accountability.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:52:09.308Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ikhtiar-wali-exposes-kohistan-mega-corruption-pointing-to-embezzlement-of-rs-200-billion-in-single-district/",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T18:41:00.000Z"
}
