{
  "title": "PM’s committee caps private medical college fees at Rs 1.8m; Senate told",
  "author": null,
  "content": "ISLAMABAD, Jul 18 (APP): Minister for National Health Services, Regulations and Coordination Syed Mustafa Kamal on Friday informed the Senate that the Prime Minister’s high-level committee had fixed the annual tuition fee of private medical colleges at Rs 1.8 million to curb excessive charges.\nResponding to a question raised by Senator Abdul Shakoor Khan during the Question Hour in the Upper House, the minister said that the committee formed on the special direction of Prime Minister Shehbaz Sharif and headed by Deputy Prime Minister Ishaq Dar included all relevant stakeholders and was tasked with regulating the tuition fee structure of private medical and dental institutions.\nHe said complaints had emerged that certain institutions were charging exorbitant fees, prompting the government to intervene and enforce a standardized policy.\nHe clarified that as per the committee’s decision, no private college was permitted to charge above Rs 1.8 million annually, and those that have already collected higher amounts before the notification in May 2025 were required to refund or adjust the excess. He added that in exceptional cases, institutions with demonstrably high standards and facilities may apply for a higher fee. “If a college can prove that its facilities and quality are truly exceptional, the committee may allow them to charge up to Rs 2.5 million,” he stated.\nHe said the Pakistan Medical and Dental Council (PM&DC), empowered under Suo Moto Case No. 1/2010 and backed by the Law and Justice Division, is the sole authority authorized to approve and monitor fee structures.\nHe said robust oversight mechanisms have been introduced to ensure strict compliance, and violators will face legal consequences.\nHe said five complaints had already been received and resolved by the committee, and encouraged senators and citizens to report further violations directly to the ministry or PM&DC.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:49:59.039Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pms-committee-caps-private-medical-college-fees-at-rs-1-8m-senate-told/",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T14:01:00.000Z"
}
