{
  "title": "Shehla Raza attends seminar on flood relief activities",
  "link": "https://www.app.com.pk/national/shehla-raza-attends-seminar-on-flood-relief-activities/",
  "date_published": "2022-11-04T15:58:00.000Z",
  "source": "APP",
  "content": "BADIN, Nov 04 (APP):Sindh Provincial Minister for Women Development Syeda Shehla Raza on Friday arrived on a one day visit to Badin and attended a seminar organized by Research and development foundation(RDF) held at gymkhana.\nSpecial assistant for Information Technology Um-e-Habiba Qambrani wasalso accompanied by the Minister.\nSyed Shehla Raza, on the occasion, said that recent monsoon rainfall andflood has badly affected the country particularly Sindh provincehowever a comprehensive strategy would be devised to face suchcatastrophe.\nShe said that the Sindh Government was building modern houses toaccommodate and rehabilitate flood affected areas so that houses couldbe protected from heavy rain and flood however cooperation of masseswas much needed in this regard.\nShe emphasized upon the Population department to make efforts ascompared to previous particularly in rural areas to motivate women forunderstanding issues related family planning in order to keep motherand child healthy.\nRelying to a question about the directory preparedby RDF Shehla Raza said that that directory was need of hour and alsostressed to make bound officers included in the directory to helpflood hit people approaching for financial assistance and no laxitywould be tolerated in this regard.\nSpecial Assistant Tanzeela um-e-Habiba addressing the seminar said that a survey of compiling details of flood hit houses was underway which would be completed soonafter which rehabilitation work will start.\nDirector RDF Ashfaq Soomro said that our institution has prepared a directory with the help ofall public private departments working in the district with theobjective to find out problems faced by women, children and disablepersons and take help from relevant departments for resolving.\nDeputy Director Social welfare Abdul Ghaffar Khoso, DHO Dr. Sher MuhammadNohrio, Project Manager RDF Sanaullah Leghari were also present on theoccasion.",
  "retrievedAt": "2025-08-11T15:50:46.662Z"
}
