{
  "title": "27,000 schools remain inaccessible due to devastating floods: UNICEF",
  "link": "https://www.app.com.pk/national/27000-schools-remain-inaccessible-due-to-devastating-floods-unicef/",
  "date_published": "2022-11-04T09:15:00.000Z",
  "source": "APP",
  "content": "“Almost overnight, millions of Pakistan’s children lost family members, homes, safety, and their education, under the most traumatic circumstances,” said UNICEF’s Global Director of Education Robert Jenkins, upon returning from flood-affected areas in Pakistan.\n“Now, faced with the uncertainty of when they’ll be able to return to school, and having already endured some of the world’s longest school closures due to the pandemic, they are experiencing yet another threat to their future.”\nMore than two months since the devastating floods engulfed large areas of Pakistan, the tops of school buildings are only just becoming visible in some of the flood-hit areas. It is estimated that it will be weeks, even months before the flood waters completely subside, said a UNICEF press release issued on Thursday.\nIn addition to places of learning, schools are critical in providing children with access to healthcare, psychosocial support, and immunization. The longer schools remain closed, the greater the risk of children dropping out altogether, increasing their likelihood of being forced into child labor and child marriage, and exposure to other forms of exploitation and abuse. Many of the hardest-hit districts were already among the most vulnerable communities in Pakistan.\nBefore the current emergency, one-third of boys and girls in flood-affected areas were already out of school and 50 per cent of children suffered from stunting. These deprivations may be further exacerbated by prolonged school closures. During the height of the pandemic, schools across Pakistan were fully or partially closed for 64 weeks between March 2020 and March 2022 – some of the world’s longest school closures.\nLess than six months on, the destruction caused by the extreme floods means schoolchildren are once again locked out of learning. Excessive damage to infrastructure, including electricity and internet connectivity, has left remote learning largely inaccessible.\nUNICEF has established more than 500 temporary learning centres in the worst-affected districts and supported teachers and children with education supplies. To support children’s mental and physical health, UNICEF is training teachers on psycho-social care and health screenings and is preparing for back-to-school and enrollment activities for those schools that have been cleaned and rehabilitated.\n“For some children, who had never been enrolled in school before, these learning centres are their very first experience of education. We need to do all that we can to ensure they continue learning when they return to their homes,” said Jenkins.",
  "retrievedAt": "2025-08-11T15:50:50.468Z"
}
