{
  "title": "Religious fanaticism led to attack on PTI chief Imran Khan: Khawaja Asif",
  "link": "https://www.app.com.pk/national/religious-fanaticism-led-to-attack-on-pti-chief-imran-khan-khawaja-asif/",
  "date_published": "2022-11-04T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP):Defense Minister Khawaja Muhammad Asif told the National Assembly on Friday that Imran Khan’s some statements had hurt religious sentiments of an accused Naveed who attacked Imran Khan during his march.\nThe minister said that it was evident from the videos of an accused that his religious sentiments were hurt because of the language, former Prime Minster used time to time or crossed the red line of religion which compelled him to attack on him.\nThe entire duty staff of the police station including the Station House Officer (SHO) was suspended only for recording the statement of the accused and the Chief Minister transferred the case to the Police Station Kunja which falls in his constituency, said the minister.\nHe said at the very initial level of investigation, the issue is being politicized for political gain which is a mockery of the system.\nSo far, four people from Lahore to Gujranwala have lost their lives in the long march, they were either crushed by the container or they died after falling from the container, said the minister adding that Imran Khan had already predicted that his march would be bloody.\nHe said Imran Khan used to call Chief Minister Punjab Pervez Elahi, the biggest criminal of Punjab and today this incident happened under the same biggest criminal.\nHe said the government is interested to expose the real motive or a culprit behind this incident but the Pakistan Tehreek-e-Insaf (PTI) is not interested in fair investigations and politicizing this incident.\nHe asked to constitute a joint investigation team (JIT) consisting of credible bureaucrats or judges.\nHe regretted the statements of PTI leadership for leveling baseless allegations against the Prime Minister of Pakistan, Interior Minister and Director General (C) for the incident and advised to avoid such statements.\nThe entire world is keeping an eye on the fast changing situation of an atomic country, therefore we all have act and speak responsibly, said the minister.",
  "retrievedAt": "2025-08-11T15:50:49.908Z"
}
