{
  "article_id": "2025-03-22_2aafd97de3582f636a043d3ba129baca",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/earth-hour-2025-a-global-call-for-energy-and-water-conservation/",
    "retrieved_at": "2025-08-27T13:56:53.803Z"
  },
  "metadata": {
    "title": "Earth Hour 2025: A global call for energy and water conservation",
    "author": null,
    "date_published": "2025-03-22T18:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 526,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 22 (APP):The 19th edition of Earth Hour, the world's largest grassroots environmental movement, returned on Saturday, 22 March, with millions across the globe uniting for 60 minutes to celebrate and support the planet. Organized by WWF, Earth Hour 2025 coincided with World Water Day, amplifying the call for freshwater conservation and urgent climate action. From 8:30 pm local time, iconic landmarks, homes, and communities in over 180 countries and territories switched off non-essential lights, symbolizing a collective commitment to a sustainable future. In Pakistan, Earth Hour was observed with enthusiasm and purpose, as major cities including Islamabad, Karachi, and Lahore participated in the global movement. Key landmarks such as the President House, Prime Minister House, Parliament House, Supreme Court of Pakistan, Mohatta Palace, and Shalimar Gardens went dark for an hour, demonstrating the nation's resolve to combat climate change and protect natural resources. President, Asif Ali Zardari, emphasized the importance of energy conservation and environmental sustainability in his Earth Hour message. \"As we switch off non-essential lights, let this act serve as a symbol of our resolve to reduce energy consumption, minimize our carbon footprint, and protect Pakistan's ecosystems,\" he stated. Highlighting Pakistan's energy challenges, he called for decisive action to adopt renewable energy and reduce fuel consumption. Prime Minister Muhammad Shehbaz Sharif echoed these sentiments, noting Pakistan's vulnerability to climate change despite contributing less than 1% to global greenhouse gas emissions. He reaffirmed the government's commitment to renewable energy expansion, plastic waste reduction, and green job creation. \"Every action, no matter how small, strengthens the collective momentum toward a sustainable tomorrow,\" he said. Senate Chairman Syed Yousaf Raza Gilani underscored the alignment of Earth Hour 2025 with World Water Day, emphasizing the urgency of addressing Pakistan's water challenges. \"Energy and water conservation are critical to mitigating environmental degradation and building climate resilience,\" he added. Hammad Naqi Khan, Director General of WWF-Pakistan, highlighted the severe climate challenges facing the country, including super floods, heatwaves, and droughts. \"Earth Hour is a powerful reminder of the urgency of addressing these challenges. It is not just about switching off lights but about switching on a global movement for change,\" he said. WWF-Pakistan organized a series of events to mark the occasion, including tree plantation drives at Karachi University and the University of Sargodha, a webinar on climate change and water challenges, and interactive activities for children at malls and museums in Islamabad, Lahore, and Karachi. Corporate partner Selimpex International also supported the initiative. Goodwill ambassadors, including TV actress Ushna Shah, tennis star Aisam Ul Haq, and actor Ayesha Omar, rallied behind Earth Hour by sharing messages and videos on social media. Ushna Shah remarked, \"Earth Hour reminds us of our collective responsibility to create a more hopeful and resilient future for people and our planet.\" Since its inception in 2007, Earth Hour has grown into a global phenomenon, inspiring millions to take action for the planet. In 2024, supporters worldwide contributed over 1.5 million hours to environmental causes. This year, the theme \"Give an Hour for Earth\" encouraged individuals to spend 60 minutes doing something positive for the planet, from planting trees to raising awareness about sustainability.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}