{
  "article_id": "2025-03-22_3983d33b7293441412d50952e827d948",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pm-departs-to-pakistan-after-completing-official-visit-to-ksa/",
    "retrieved_at": "2025-08-27T13:56:35.897Z"
  },
  "metadata": {
    "title": "PM departs to Pakistan after completing official visit to KSA",
    "author": null,
    "date_published": "2025-03-22T09:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 200,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, March 22 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday departed to Islamabad from Jeddah after completing his official visit to the Kingdom of Saudi Arabia (KSA). At the Jeddah Airport, Governor Makkah Prince Saud bin Abdullah bin Jalawi bade the prime minister farewell, PM Office Media Wing said in a press release. The prime minister had undertaken an official visit to the KSA from 19 March to 22 March which was aimed at further strengthening of the bilateral ties and economic cooperation between Pakistan and the KSA, besides enhancing investment. During his visit, the prime minister met with Crown Prince and Prime Minister of KSA Mohammed bin Salman. Both leaders discussed different mechanism for enhancing trade, cooperation in key sectors and simplifying of means for enhanced economic cooperation. Moreover, the prime minister also held meeting with Saudi Investment Minister Khalid Al-Falih and Mohammad Al-Tuwaijri, Head of the Joint Task Force for Economic Engagement, during his official visit. The discussions focused on strengthening economic cooperation, attracting Saudi investments, and expediting joint initiatives in key sectors. At the end of his visit, the prime minister paid respects at Roza-e-Rasool (SAW) in Masjid-e-Nabvi Madina Munawara and performed Umrah in Makkah Mukarama.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}