{
  "title": "NA Speaker takes notice of delay in cancer treatment project worth Rs2 bln",
  "link": "https://www.app.com.pk/national/na-speaker-takes-notice-of-delay-in-cancer-treatment-project-worth-rs2-bln/",
  "date_published": "2024-10-23T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Speaker, National Assembly, Sardar Ayaz Sadiq on Wednesday took serious notice of delay in the free cancer treatment project to be developed with the assistance of an international company extending Rs 2 billion funding.\nThe Speaker was expressing his views during the question hour session underway amid seventh meeting of the 10th National Assembly session that commenced four minutes late against its scheduled time of 1100 hours here after observing the response on a query of Member National Assembly (MNA), Syed Rafiullah.\nSpeaker, Sardar Ayaz Sadiq said the project was intended to provide lifesaving treatment for cancer patients which should not be halted for the next budget but rather it should be taken up on priority basis to manage the funding from other sources with a proper a solution.\nHe vowed to personally request the Secretary Planning Division and the Minister for Planning to manage funding for the project. The Speaker directed the Parliamentary Secretary for Planning to seek a proper response from the Health Ministry in writing on delay in the project. The Health Ministry should be held accountable on the matter as this project was crucial importance that can help save human lives, he added.\nParliamentary Secretary for Planning and Development, Wajiha Qamar informed the House that the project was highly significant and it was for the Islamabad Capital Territory (ICT), Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB).\n“Rs2 billion will be contributed by Rosch and Rs 789 million by the federal government for lungs cancer, breast cancer and hepatocellular cancer,” she said.\nQamar underlined that the fulfillment of the codal formalities was important to ensure transparency. However, the PC-I for this project had reached Planning Commission on September 18, 2024 and as per PFM rules it was not to be added in that PSDP as it duration was lapsing in March, 2025.\nShe added that since it was not a development project then it could be issued recurring budget by the finance division in the form of grant of Rs789 million to be covered in five years.\nIncase of its status to be considered as a development project, the funding could only be sanctioned in the next financial budget, she said.",
  "retrievedAt": "2025-08-10T20:15:49.099Z"
}
