{
  "title": "President reiterates Pakistan’s full support to UN charter",
  "link": "https://www.app.com.pk/national/president-reiterates-pakistans-full-support-to-un-charter/",
  "date_published": "2024-10-23T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):President Asif Ali Zardari has reiterated Pakistan’s full support for the UN Charter and its multilateral system and said Pakistan stood ready to collaborate with all the UN Member States to achieve a peaceful and prosperous world for all.\nIn a message on the occasion of the United Nations Day being observed on October 24, the president said today, Pakistan joined the international community in commemorating the 79th United Nations (UN) Day.\n“The UN Charter embodies our collective determination to uphold international law and peaceful co-existence. It also provides for the development of friendly relations among nations, based on respect for the principles of equal rights and self-determination of peoples, and to take other appropriate measures to strengthen universal peace,” President Secretariat Press Wing, in a press release on Wednesday, quoted the president as saying.\nGuided by the vision of founding father, Quaid-e-Azam Muhammad Ali Jinnah, the president said, Pakistan had consistently championed the principles of the UN Charter.\n“We have maintained a firm and abiding commitment to multilateralism, with the UN playing a central role for the promotion of international peace and security, sustainable development and human rights for all. We have also made invaluable contributions to international peace and security, including by serving as a leading military and police contributor to UN peacekeeping operations,” he added.\nDespite its remarkable achievements over the past 79 years, President Zardari said, the UN Charter’s vision of universal peace, development and human rights for all was currently under threat by the blatant violations of its principles and purposes – nowhere more egregiously than in Occupied Palestinian Territory, and the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nThe UN remained an indispensable partner in addressing the pressing challenges being faced by the world today, and for shaping a more equitable future for all, he observed.\n“We must revitalize the values enshrined in the UN Charter, by prioritizing peace and actively resolving conflicts, as well as by fulfilling the hopes and aspirations of billions around the world,” the president opined.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:16:31.187Z"
}
