{
  "title": "United Nations celebrates UN Day to mark 79th anniversary",
  "link": "https://www.app.com.pk/national/united-nations-celebrates-un-day-to-mark-79th-anniversary/",
  "date_published": "2024-10-23T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): United Nations Celebrates UN Day in Pakistan to mark 79th anniversary of the UN and its common history with Pakistan.\nToday, the United Nations commemorated the 79th anniversary of its establishment, which began with the ratification of the UN Charter on October 24, 1945, says the press release.\nTwo years later, Pakistan joined the UN, forging a partnership that has spanned almost eight decades. UN Day, celebrated annually, underscores the guiding principles and purposes of the UN Charter that have shaped global cooperation for nearly 80 years.\nIn celebration of this occasion, the United Nations in Pakistan will host a public, family-oriented event this Saturday, October 26, at the Pakistan National Council of the Arts (PNCA) in Islamabad. The event will highlight the deep historical ties between Pakistan and the UN, celebrating the contributions Pakistan has made to the global institution over the decades.\nPakistan’s involvement in the United Nations has been marked by key contributions from prominent figures such as Begum Shaista Ikramullah and Ahmad Shah Bokhari, who played crucial roles in drafting the Universal Declaration of Human Rights and supporting the creation of UNICEF. The influence of renowned economist Mahbub ul Haq, who developed the Human Development Index, and Dr. Nafis Sadik, the first woman to head a major UN program, also stand as a testament to Pakistan’s ongoing impact on global governance.\nSaturday’s event at PNCA will feature live performances from popular Pakistani artists, including Shae Gill and performers from the Leif Larson Music Center in Hunza. Attendees will have the opportunity to explore UN career prospects at a special booth with advice from UN Human Resources teams. A ‘UN Market Place’ will showcase the work of 23 UN agencies operating in Pakistan, while a special exhibition will explore the shared history of the UN and Pakistan.\nChildren will be treated to fun activities, food stalls, and giveaways, while selfie corners will be set up to create lasting memories of the celebration. The event is open to the public from 3:00 pm with free entry.\nWith 24 UN institutions and 266 offices across Pakistan, the UN continues to collaborate with the Government of Pakistan in advancing progress for all citizens. From promoting gender equality and women’s empowerment to enhancing digital transformation and climate action, the UN remains a committed partner to Pakistan’s development.\nIn September 2024, world leaders gathered in New York to adopt the United Nations’ “Pact for the Future,” a comprehensive roadmap aimed at tackling global challenges, from sustainable development to digital governance. Despite current global challenges, the UN continues to play a unique role in shaping international norms and fostering cooperation.",
  "retrievedAt": "2025-08-10T20:16:16.201Z"
}
