{
  "title": "Capacity payment of Rs 1,411,669 mln paid to IPPs in last two fiscal years",
  "link": "https://www.app.com.pk/national/capacity-payment-of-rs-1411669-mln-paid-to-ipps-in-last-two-fiscal-years/",
  "date_published": "2024-10-23T08:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):A sum of total Rs 1,411,669 million has been paid to 36 Independent Power Producers (IPPs) under heads of capacity payments during the last two fiscal years 2022-23 and 2023-24.\nOut of total Rs 1,411,669 million, an amount of Rs 487,851 million has been paid to IPPs under capacity payments during fiscal year 2022-23 and Rs 923,818 million in FY 2023-24, official sources told APP here Wednesday.\nSharing details, they said out of total, 487,851 million payment, a sum of Rs 94,753 million was paid to China Power Hub Generation Company, Rs 39,609 million to Engro Powergen Thar (Pvt), Ltd, Rs, 55,747 million to Huaneng Shandong Ruyi Energy (Pvt) Ltd, Rs 34,556 million to Karot Power Company (Pvt) Ltd, Rs 28, 604 to Lucky Electric Power Company Ltd, Rs 10,573 million to Mira Power Limited, Rs 34,465 t Neelum Jhelum Hydropower Company (Pvt) Ltd, Rs 63,612 million to Port Qasim Electric Power Company (Pvt) Ltd, Rs 14,477 million to Star Hydro Power Limited, Rs. 22,187 million to Hub Power Company Ltd, Rs 16,985 to Uch-II Power (Pvt) Limited and Rs 11,508 million Thar Coal Block-1 Power Generation Company (Pvt) Limited.\nSimilarly, out of total Rs 923,818 million payments in 2023-24, an amount of Rs 139,181 million was paid to China Power Hub Generation Company, Rs 50,414 million to Engro Powergen Thar (Pvt), Ltd, Rs, 132,407 million to Huaneng Shandong Ruyi Energy (Pvt) Ltd, Rs 77,994 million to Karot Power Company (Pvt) Ltd, Rs 53,511 million  to Lucky Electric Power Company Ltd, Rs 16,592 million to Mira Power Limited, Rs 35,155 to Neelum Jhelum Hydropower Company (Pvt) Ltd, Rs 102,891 million to Port Qasim Electric Power Company (Pvt) Ltd, Rs 19,296 million to Star Hydro Power Limited, Rs. 21,381 million to Hub Power Company Ltd, Rs 21,900 to Uch-II Power (Pvt) Limited and Rs 105,102 million to Thar Coal Block-1 Power Generation Company (Pvt) Limited, Rs 31,167 million to Thar Energy Limited, Rs 34,733 million to ThalNova Power Thar (Pvt) Ltd and Rs 21,900 million to Uch-II Power (Pvt) Limited.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:16:19.705Z"
}
