{
  "title": "Justice Hasan Rizvi of SC issues extra note regarding NAB amendment case",
  "link": "https://www.app.com.pk/national/justice-hasan-rizvi-of-sc-issues-extra-note-regarding-nab-amendment-case/",
  "date_published": "2024-10-23T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):Justice Syed Hasan Azhar Rizvi of Supreme Court of Pakistan on Wednesday issued extra note in case pertaining to NAB amendments.\nIn a 22-page note, Justice Rizvi wrote, “Although I agree with the conclusion he reached, I regretfully find myself unable to endorse the reasoning. The majority judgment did not provide sufficient justification for the issues at hand. More importantly, unreasonable remarks were made about the Hon’ble former judges of this Court, whose judgment we are reviewing on appeal. In my humble opinion, judicial comity requires that, even when we disagree with the decisions of other judges, we do so with respect and constructiveness. Criticism should focus on legal principles rather than disparaging those who authored the original decision.”\nIt said, “Generally, an intra court appeal (ICA) is a legal mechanism that allows for an appeal within the same court, to a larger or more senior bench, rather than to a higher court. The purpose of the ICA is to provide a remedy for reconsideration when a party is dissatisfied with the decision of a single judge or a smaller bench, without requiring escalation to another tier of the judicial hierarchy. This ensures that errors or inconsistencies in legal judgments are reviewed within the same court, promoting fairness and thoroughness in judicial decision-making.”\nHe stated, “Mr. Imran Ahmad Khan Niazi (‘the respondent’) filed a petition under Article 184(3) of the Constitution challenging the validity of the National Accountability 2022 Amendments’ on the touchstone of the Fundamental rights. The petition was fixed before a three-member bench of this Court. During the hearing, the Original Bench, in paragraph 24 of the impugned majority judgment, limited the scope of the case by observing that although the respondent sought the nullification of nearly all the 2022 amendments, it was not convinced that every section of those amendments violated the Fundamental Rights of the people of Pakistan. The Original Bench concluded that prima facie judicial scrutiny was required only for sections 2, 8, 10, and 14 of the First Amendment and sections 2, 3, and 14 of the Second Amendment.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:16:41.043Z"
}
