{
  "title": "TRANSFORM Pakistan urges to take actions for limiting industrially produced trans fats",
  "link": "https://www.app.com.pk/national/transform-pakistan-urges-to-take-actions-for-limiting-industrially-produced-trans-fats/",
  "date_published": "2024-10-23T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): The TRANSFORM Pakistan on Wednesday urged the authorities concerned to take immediate action to limit industrially produced trans fats to less than 2g per 100g of total fat in all food sources and completely eliminate partially hydrogenated oils (PHOs), a major source of these harmful fats in our diet.\nThe TRANSFORM Pakistan campaign partners including Pakistan Youth Change Advocates (PYCA), the Ministry of National Health Services, Regulation and Coordination, the Global Health Advocacy Incubator (GHAI), Centre for Peace and Development Initiatives (CPDI) and Heartfile, said a press release.\nTrans fats are commonly found in margarine, baked goods, fried snacks, dairy products, and several other ultra-processed foods. While food manufacturers favor trans fats for their ability to enhance texture, shelf life, and flavour stability, the health costs far outweigh these benefits. Industrially produced trans fatty acids (iTFAs) have no known health benefits and significantly raise levels of low-density lipoprotein (LDL) or “bad” cholesterol while lowering high-density lipoprotein (HDL) or “good” cholesterol.\nThese silent killers are fuelling a health crisis in Pakistan, where non-communicable diseases (NCDs) account for over 58 percent of all deaths, with cardiovascular diseases claiming more than 200,000 lives annually. Research showed that even a modest increase in iTFA intake—a mere 2 percent rise in energy from trans fats—correlates with a 23 percent increase in coronary heart disease incidence. Alarmingly, iTFAs have also been found in infant formula milk, threatening the health of our youngest population and adding new risks for them.\nDespite these alarming statistics, Pakistan is on WHO’s “less restrictive” list for iTFA consumption, indicating that while some food products are regulated, many remain unmonitored. By 2023, the Pakistan Standards and Quality Control Authority (PSQCA) is able to regulate certain food categories, but ultra-processed foods, various snacks, and dairy products, including chocolates and ice creams, are largely unregulated, highlighting an urgent need for comprehensive policy reform.\nAdopting WHO’s best practice policy by limiting iTFAs to 2 grams per 100 grams of total fat in all foods and banning PHOs offers a clear path forward to deal with this menace. This two-pronged approach addresses the direct addition of iTFAs in food production and restricts their use as an ingredient, ensuring comprehensive coverage.\nImplementing these regulations will yield significant health benefits, directly reducing the incidence of cardiovascular and other NCDs, and ultimately saving thousands of lives each year. It will also alleviate the economic burden on our healthcare system, allowing resources to be reallocated to other critical public health initiatives. Countries that have adopted similar measures, such as Denmark, Argentina, England and others, have already reported positive changes in public health outcomes, proving that effective regulatory action is essential for improving health across all nations.\nPakistan must act decisively to limit trans fats in all food sources to less than 2 percent of the total fats and ban PHOs, prioritizing public health and paving the way for a safe and healthy food supply for all citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:15:38.983Z"
}
