{
  "title": "Govt plans expansion of Pink Bus Service to facilitate more women commuters in capital",
  "author": null,
  "content": "ISLAMABAD, Oct 14 (APP):The Ministry of Federal Education and Professional Training (MoFE&PT) is planning to expand and enhance the Pink Bus Service, which is a free-of-cost public transport facility for working women and girl students in Islamabad, to ensure wider accessibility, safety, and convenience for female commuters.\nAccording to an official source, the ministry’s plan focuses on expanding the service coverage to additional rural and peri-urban areas of the Islamabad Capital Territory (ICT), deploying trained female staff and security personnel to ensure safe travel.\nThe ministry also intends to introduce regular feedback mechanisms to address commuter concerns and strengthen coordination with local authorities and community stakeholders to align routes with educational and workplace hubs.\nThe official added that ongoing monitoring and evaluation are being carried out to maintain the service’s quality, efficiency, and responsiveness to women’s mobility needs.\nLaunched earlier under the special directives of the Prime Minister of Pakistan, the Pink Bus Service currently operates 22 buses across five major rural sectors of ICT during peak hours from 6:00 to 9:00 a.m. and 1:30 to 2:00 p.m. The initiative benefits more than 4,000 girl students and working women on a daily basis.\nThe official source said the project has been launched, operated, and supervised exclusively by the ministry through its own allocated resources, without any involvement or intervention of the Capital Development Authority (CDA).\nTo evaluate the service’s impact, the ministry also conducted a third-party validation which confirmed the initiative’s effectiveness in providing a secure and accessible transport facility. The report highlighted that the Pink Bus Service has significantly eased the daily commute for women, enhancing their mobility, comfort, and confidence.\nThe ministry is further considering a series of improvements, including increasing the number of buses, particularly during peak hours, improving route coverage, adjusting service timings, increasing frequency, and enhancing public awareness through better visibility of routes, stops, and schedules. These proposed measures, the source said, are subject to the availability of financial resources in the current fiscal year 2025–26.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:02:58.724Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-plans-expansion-of-pink-bus-service-to-facilitate-more-women-commuters-in-capital/",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T14:24:00.000Z"
}
