{
  "title": "Five bakeries and factories sealed; 200kg of expired food disposed of during IFA’s crackdown",
  "author": null,
  "content": "ISLAMABAD, Oct 14 (APP):The Islamabad Food Authority (IFA) has stepped up its inspection drive to ensure safe and hygienic food for citizens, sealing five bakeries and production units over poor cleanliness and expired food during surprise operations in various areas of the Federal Capital.\nAccording to the spokesman, the operations were conducted by the food safety teams under the supervision of Deputy Director of IFA, Dr Tahira Siddique. Inspections were carried out in Tarnol, 26 No, Jhungi Syedan and Shams Colony, where teams found unhygienic conditions and substandard items being used in food preparation.\nDuring the inspections, around 200 kilograms of expired food products were confiscated and destroyed on the spot to prevent their sale in local markets. The sealed outlets were also found violating basic food safety protocols, such as improper storage, lack of sanitation, and use of expired ingredients.\nOn the Occasion, Dr Tahira Siddique stated that the authority’s teams are conducting regular surprise inspections across Islamabad to ensure that all eateries, bakeries, and factories comply with food safety regulations. She said that any establishment found selling expired or substandard food would face strict legal action, including sealing and fines.\nThe deputy director emphasized that the primary goal of the Food Authority is to eliminate the sale of unsafe food and ensure citizens have access to healthy and hygienic products. She added that the teams will continue routine monitoring\nin both urban and rural areas of Islamabad without prior notice.\nDr Siddique further noted that the authority has been receiving public complaints about the sale of expired items, especially in local bakeries and small manufacturing units. In response, the food safety teams have intensified field inspections to verify quality standards and ensure public safety.\nShe said that awareness sessions and training programs are also being organized for food handlers, shopkeepers, and factory workers to educate them about cleanliness, food labeling, and proper storage practices.\nThe Islamabad Food Authority has also urged residents to report any violation of food safety standards through the official helpline or social media channels. Citizens’ cooperation, she said, plays a vital role in curbing the sale of low-quality and expired food items in the capital.\nAccording to the Food Authority’s ongoing monitoring report, several inspection teams are currently active across Islamabad’s rural and urban sectors. These teams are checking bakeries, restaurants, milk shops, and small production units to ensure full compliance with food safety rules.\nDr Tahira reaffirmed the administration’s commitment to continue strict action against violators, saying that the sale of expired and unhygienic food in Islamabad will be made impossible through consistent field operations and community participation.\nThe Islamabad Food Authority plans to expand its operations in the coming days to more localities, focusing particularly on small-scale food businesses and industrial kitchens operating without proper certification.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:01:55.455Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/five-bakeries-and-factories-sealed-200kg-of-expired-food-disposed-of-during-ifas-crackdown/",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T18:02:00.000Z"
}
