{
  "title": "Speakers of Türkiye, Azerbaijan visit PA, discuss strengthening trilateral ties",
  "author": null,
  "content": "LAHORE, Oct 14 (APP): The Speakers of the Grand National Assembly of Turkiye, Prof. Dr. Numan Kurtulmus and the Milli Majlis (Parliament) of Azerbaijan, H.E. Ms. Sahiba Gafarova, along with their respective parliamentary delegations visited the Provincial Assembly of Punjab on Tuesday to discuss enhancing trilateral relations and parliamentary cooperation.\nThey were warmly received by Speaker Punjab Assembly Malik Muhammad Ahmad Khan, Deputy Speaker Malik Zaheer Iqbal Channer, and other Assembly members. The delegation’s visit focused on expanding cooperation in trade, defense, education and energy sectors.\nSpeaker Malik Muhammad Ahmad Khan underscored the strong brotherly ties among Pakistan, Türkiye and Azerbaijan, emphasising joint efforts for regional peace and stability. He highlighted the importance of defense cooperation among the three nations.\nBoth visiting speakers expressed gratitude for the warm hospitality. Speaker Gafarova appreciated Pakistan’s steadfast support during the 44-day Patriotic War and stressed the need for continued trade and cooperation. Prof. Dr. Kurtulmus reaffirmed the unity of the three countries, calling for enhanced joint efforts against terrorism.\nThe speaker PA presented commemorative shields to the guests and escorted them on a tour of the Assembly Hall.\nEarlier, the both speakers, along with their delegations, arrived in Lahore by special flight, where Speaker PA Malik Muhammad Ahmad Khan warmly received them at the airport and presented bouquets.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:01:02.200Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/speakers-of-turkiye-azerbaijan-visit-pa-discuss-strengthening-trilateral-ties/",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T22:12:00.000Z"
}
