{
  "title": "Governor Punjab assures for providing quality education, clean drinking water to province",
  "link": "https://www.app.com.pk/national/governor-punjab-assures-for-providing-quality-education-clean-drinking-water-to-province/",
  "date_published": "2020-01-05T00:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Punjab Governor Chaudhry Muhammad Sarwar has assured to provide quality education to the students and clean drinking water to the residents of the province as number of projects had been kicked off in that regard.\nVice-Chancellors in various universities of Punjab had been appointed on purely merit to provide standard education as youth were assets of the country, he said talking to a private news channel.\nHe said the Pakistan Tehreek-e-Insaf (PTI) government had introduced reforms in education sector through uniform curriculum to streamline the system. Pakistan was a peaceful country and many foreign students were holding research conferences here, he added.\nChaudhry Sarwar said under the dynamic leadership of Prime Minister Imran Khan, the provincial government had launched numerous projects to provide clean drinking water to the residents of Punjab as many diseases were taking birth due to drinking dirty water. “We are educating the people for clean and green Pakistan.”\nReplying to a question, he said,”Pakistan is number one tourism industry in the world as it has great potential and historical sites.” People of world were showing keen interest in visiting Pakistan tourism sites, he said and added the tourism industry was flourishing here.\nThe governor said the PTI government would complete its constitutional tenure as people of the country had given mandate of five years and it was committed to fulfill all the promises made with them during the campaign of general election 2018.\nHe said the measures had already been taken to ensure good governance, alleviate inflation and poverty to facilitate the masses in this price hike.\nReplying to another question, he said when he was part of British parliament had raised voice by visiting different countries against atrocities and genocide on oppressed people of Kashmir and Palestine.",
  "retrievedAt": "2025-08-11T18:34:31.028Z"
}
