{
  "title": "Barrister Naseem Bajwa’s Book “Europe Ki Diary” rekindles passion for national building",
  "link": "https://www.app.com.pk/national/barrister-naseem-bajwas-book-europe-ki-diary-rekindles-passion-for-national-building/",
  "date_published": "2024-05-06T13:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP):The Sustainable Development Policy Institute (SDPI) on Monday organized the third edition of Renowned Columnist and Lawyer, Barrister Naseem Bajwa’s book “Europe Ki Diary” based on his columns published in various newspapers here in the presence of renowned historians and members of the civil society and lawyers’ fraternity.\nIn his opening remarks, Dr Abid Qaiyum Suleri, Executive  Director, SDPI eulogized the author’s contributions to Urdu journalism through his services at the BBC London Urdu Chapter and also as an educationist at the Atchison College.\nThe author, he said had a leftist ideological tendency that remained intact through his life’s eight decades beyond journey.\nDr Suleri mentioned that some of the chapters of the book focused on change in system of the country and also provided a way forward to achieve that goal.\nThe SDPI Executive Director wished the author good luck for the fourth edition of his book and recommended the youth to read the book online especially the tributes paid to Parveen Rehman and Asma Jehangir.\nHe termed the book as a guiding document for generation building.\nBarrister Naseem Bajwa, the author on the occasion shared his personal accounts, experiences and lessons learnt through out his lifetime from Pakistan Movement to shifting to a foreign country that motivated him to write articles for the betterment of the country and consequently writing a book out of them to propose recommendations for improvement in the system of the country.\n“The title is a little misleading as it takes some account of Europe and then the details of Pakistan’s history. I learnt from my experience at BBC to write like the audience is sitting before me that makes his writing style subtle and vivid,” he said.\nHe extended special gratitude to SDPI and Dr Abid Suleri and others.\nDr Farooq Adil, renowned historian and author said the Book would serve as a resource loaded with subject matter for historians to explore undiscovered aspects hidden in various chapters of the book.\nMuzaffar Mahmood Qureshi, former senior bureaucrat, said the books by Barrister Bajwa are a great source of understanding the politics of the country and the international level. However, the author has unique and convincing writing style, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:19:31.114Z"
}
