{
  "title": "Pakistan highly values its multifaceted ties with Italy: PM",
  "link": "https://www.app.com.pk/national/pakistan-highly-values-its-multifaceted-ties-with-italy-pm/",
  "date_published": "2024-05-06T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 06 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said that Pakistan deeply valued its multifaceted relations with Italy spanning over many decades, which had always been marked by goodwill and trust.\nThe prime minister expressed the views during a meeting with Ambassador of Italy Marilina Armellin who paid a courtesy call on him at the Prime Minister’s House, PM Office Media Wing said in a press release.\nThe prime minister said that the two sides also shared similar views on a number of important regional and global issues.\nExpressing satisfaction over the positive trajectory of Pakistan-Italy bilateral relations, the prime minister urged the two sides to enhance cooperation in the fields of education, trade and investment, legal migration, as well as cultural exchanges.\nThanking the Italian leadership for the congratulatory message that he received on his re-election, the prime minister conveyed his sincere commitment to work closely with Italy to further cement bilateral ties in the days ahead.\nEmphasizing the importance of high-level exchanges, the prime minister extended a cordial invitation to Prime Minister of Italy Giorgia Meloni to undertake an official visit to Pakistan.\nHe conveyed his appreciation for Prime Minister Meloni’s policies at home and abroad that had made Italy an important member of the EU.\nHe thanked Italy for hosting a large population of Pakistani diaspora who were acting as a bridge between both countries while also contributing to their economic growth.\nThe ambassador thanked the prime minister for receiving her and assured him that Italy was keen to further enhance its ties with Pakistan.\nShe said she would strive to promote stronger relations between the two countries.",
  "retrievedAt": "2025-08-11T02:18:45.262Z"
}
