{
  "title": "No overbilling in LESCO during April: Mohsin Naqvi",
  "link": "https://www.app.com.pk/national/no-overbilling-in-lesco-during-april-mohsin-naqvi/",
  "date_published": "2024-05-06T12:44:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 06 (APP):Federal Interior Minister Mohsin Naqvi said on Monday that no overbilling was found in Lahore Electric Supply Company (LESCO) during the month\nof April, whereas the same practice was stopped to a great extent in other\nAddressing a press conference, he appreciated the efforts of Federal Investigation\nAgency, Lahore team in controlling overbilling in the LESCO.\nHe said, “Ministry of Power has also supported us in our campaign against overbilling.”\nMohsin Naqvi said that 310 million units had been returned to consumers, adding\nthat it was a big relief for people and hoped no overbilling would be practiced in future.\nAs many as I02 FIRs had been registered against overbilling, he said and added\nthat Superintending Engineer of Sheikhupura had been arrested today as he was\ninvolved in overbilling issue at a massive scale and prior to this two XENs had also\nThe Interior Minister said that all these initiatives were required to stop overbilling\nRegarding his and Khawaja Asif visit to Lahore and Sialkot airports, he said that\neight counters would be added at Lahore airport to manage departure related rush.\nHe said that counters would also be added at Sialkot airport to tackle departure\nrush in a better way. The work on fast track option was also underway, he maintained.\nResponding to a question about wheat procurement issue, Mohsin Naqvi said that in\nhis personal opinion he does not think that there was any ill intention of caretaker\nfederal government in this regard. A new cyber body was being established while\nMohsin Naqvi said as far as terrorism was concerned, he appreciated the KPK police\nHe said that country’s law enforcement agencies were working effectively to root out terrorism.\nHe further said that proper plan was being evolved and soon the best results would be\nobtained with regard to controlling narcotics and provinces would also be taken on board\nMohsin Naqvi said that there was a need to make collective efforts to eradicate the\nHe said that timing of passport offices in any area would be increased on basis of requirement.\nRegarding weapon license, Naqvi said license would be issued only to those who would\nqualify for it while license of prohibited bore would not be issued at all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:19:32.986Z"
}
