{
  "title": "Webinar commemorates Ashraf Sehrai’s martyrdom anniversary, highlight Kashmir struggle",
  "link": "https://www.app.com.pk/national/webinar-commemorates-ashraf-sehrais-martyrdom-anniversary-highlight-kashmir-struggle/",
  "date_published": "2024-05-06T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP): The sacrifices made by All Parties Hurriyet Conference (APHC) leader Shaheed Muhammad Ashraf Sehrai were commemorated on his third martyrdom anniversary during a webinar organized by Friends of Kashmir International on Monday.\nPaying heartfelt tributes to the martyred Kashmiri leader, speakers at the event described Sehrai’s martyrdom as a custodial killing, highlighting the criminal negligence displayed by Indian authorities regarding his treatment during detention, a news release said.\nThey emphasized that Shaheed Sehrai not only sacrificed his life in Indian custody but also lost his son to the brutality of Indian forces.\nShaista Safi from the Youth Forum London expressed the view that Shaheed Sehrai’s martyrdom will continue to serve as a guiding light for the Kashmiri people and will ultimately lead to the liberation of Kashmir from Indian oppression.\nCustodial killings perpetrated by Indian forces are a matter of grave concern for the conscience keepers of the civilized world, Shaista remarked, urging the international community to take serious note of Indian atrocities.\nDr. Shazia Anwar from Charles University, Czech Republic, stressed the importance of Kashmiri people utilizing modern technology to inform the global community about Indian barbarism and the reality of the Kashmir issue. She noted that India is employing deceptive tactics to mislead world opinion and emphasized the necessity of countering this narrative through technological means.\nPervaiz Ahmed Shah, Advocate of Hurriyat Conference, underscored that India’s portrayal of the Kashmir issue as a mere land dispute disregards its status as an international conflict recognized by the United Nations. He lamented the UN’s failure to implement its resolutions on Kashmir.\nGhazala Habib, Chairperson of Friends of Kashmir International America, assured that the Kashmiri nation will always remember its martyrs and their sacrifices.\nAbdul Hameed Lone, Vice Chairman of Friends of Kashmir International, shed light on the sacrifices of Shaheed Sehrai in the struggle for Kashmir’s freedom, expressing confidence that the Kashmiri nation will eventually achieve liberation through the sacrifices of its martyrs.\nAli Raza Syed, Chairman of Kashmir Council EU, emphasized the importance of engaging European lawmakers and human rights activists to exert pressure on India. He called for collaboration with European, British, and US parliamentarians to raise awareness about the plight of Kashmiris.\nOther speakers who commemorated the martyrdom of Shaheed Sehrai included Dr. Saira Farooq Shah from Mirpur University, Saira Kazmi from Urdu University Islamabad, Hurriyat leader Syed Manzoor Ahmed Shah, and Haroon Abbas.",
  "retrievedAt": "2025-08-11T02:19:07.969Z"
}
