{
  "article_id": "2025-10-03_0968897d98b7eb6913ac0cb486ae0878",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-kazakhstan-to-boost-cultural-collaboration-in-fashion-and-music/",
    "retrieved_at": "2025-10-11T23:48:39.223Z"
  },
  "metadata": {
    "title": "Pakistan, Kazakhstan to boost cultural collaboration in fashion and music",
    "author": null,
    "date_published": "2025-10-03T13:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 03 (APP):Pakistan and Kazakhstan have agreed to strengthen cooperation in the fields of arts and culture, with a special focus on fashion and music. The understanding was reached during a meeting on Friday between Advisor to the Federal Minister for National Heritage and Culture Division Usman Shah and Ambassador of Kazakhstan to Pakistan Yerzhan Kistafin. Ambassador Kistafin said that Kazakhstan is preparing a comprehensive roadmap to expand cultural collaboration with Pakistan. \"We will share the details of this roadmap with Pakistan soon,\" he noted, adding that both countries are committed to deepening their cultural ties. He further disclosed that senior officials from Pakistan's Ministry of National Heritage and Culture had approached Kazakhstan with a proposal for jointly producing a film showcasing shared cultural heritage. Usman Shah emphasized Pakistan's longstanding relations with Kazakhstan and highlighted the significance of promoting people-to-people contacts and cultural exchanges. He also briefed the ambassador on the Department of Archaeology and Museums (DOAM), which operates under the Ministry of National Heritage and Culture, and shared details of Pakistan's initiatives to present its Buddhist heritage through 3D films. He stressed that cultural and educational cooperation plays a vital role in strengthening mutual understanding between the two nations. Ambassador Kistafin extended an invitation to Shah to visit Kazakhstan to meet local fashion designers and explore avenues for collaboration in the fashion industry. Accepting the invitation, Shah assured full cooperation in promoting Kazakh culture in Pakistan through the active participation of Pakistani artists.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}