{
  "article_id": "2025-10-03_df6290c6db8df89f2040c0c459b8e96a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bail-denied-fia-arrests-two-accused-in-app-mega-corruption-scandal/",
    "retrieved_at": "2025-10-11T23:48:14.008Z"
  },
  "metadata": {
    "title": "Bail denied, FIA arrests two accused in APP mega corruption scandal",
    "author": null,
    "date_published": "2025-10-03T15:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 03 (APP):The Islamabad High Court (IHC) on Friday rejected the interim bail of former executive director Adnan Akram Bajwa and co-accused Shahid Latif in the mega corruption case of Associated Press of Pakistan (APP). The Federal Investigation Agency (FIA)'s officials arrested both of the accused from the court premises after their bails were rejected. The IHC's Justice Muhammad Azam Khan heard the case. During the hearing, APP's legal advisor Rana Rohail and Khurram Baig Advocate appeared in the court and shed light on the role of the accused. Rana Rohail told the court that Adnan Akram Bajwa, the former ED APP, illegally allowed the transfer of the Provident Fund, after which the co-accused illegally transferred millions of rupees allocated for the employees, which were actually the trust of the employees, to other own accounts. Lawyer Khurram Baig Advocate took the stand that the accused Shahid Latif kept preparing fake salary sheets and credit sheets, on the basis of which illegal salaries worth millions of rupees were made, and a huge loss was caused to the national exchequer. After hearing the arguments of the parties, the court dismissed the interim bail applications filed by both accused. Immediately after the verdict, the FIA team arrested the accused from the court premises. It may be recalled that the FIA has initiated action against a total of 16 accused in this case, who are accused of embezzling millions of rupees of employee funds and the national exchequer.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}