{
  "article_id": "2025-10-03_13984b3cf40a4f01231b555b15802f64",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dengue-cases-lower-than-last-year-twin-cities-told-to-step-up-preventive-measures/",
    "retrieved_at": "2025-10-11T23:47:48.245Z"
  },
  "metadata": {
    "title": "Dengue cases lower than last year, twin cities told to step up preventive measures",
    "author": null,
    "date_published": "2025-10-03T18:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 03 (APP):Federal Secretary for Health Hamed Yaqoob Sheikh on Friday chaired a high-level meeting at the Capital Development Authority (CDA) Headquarters, where officials reported that dengue cases in Islamabad and Rawalpindi remain lower this year compared to the same period last year. Health officials briefed the meeting that 50 patients in Islamabad and 45 in Rawalpindi are currently under treatment at different hospitals, including four at Capital Hospital and one at the Pakistan Institute of Medical Sciences (PIMS). They assured that public hospitals in the twin cities have sufficient beds, medicines, test kits and other facilities to deal with patients. Sheikh directed both administrations to strengthen coordination, particularly in border areas, and launch joint operations to curb the spread of dengue. \"The administrations of the twin cities must act as one team and ensure strict monitoring of hotspot areas under all circumstances,\" he said. CDA Chairman and Chief Commissioner Islamabad Muhammad Ali Randhawa emphasized the importance of public awareness campaigns. \"Precautionary measures against dengue, especially among the elderly and children, must be widely communicated,\" he noted. Officials further informed the meeting that fogging operations are being carried out at a rapid pace to target mosquito breeding sites at an early stage and prevent the spread of larvae. The review meeting was attended by Commissioner Rawalpindi Amir Khattak, CDA Board Members, deputy commissioners of both cities, senior health officials, and hospital administrators.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}