{
  "article_id": "2025-10-03_5550c5c2340b227092f7e5ca49ae84bf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-urges-calm-vows-to-resolve-ajk-issue-through-dialogue/",
    "retrieved_at": "2025-10-11T23:48:39.973Z"
  },
  "metadata": {
    "title": "Ahsan urges calm, vows to resolve AJK issue through dialogue",
    "author": null,
    "date_published": "2025-10-02T23:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 334,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 03 (APP): Federal Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Thursday expressed optimism that the ongoing issue in Azad Jammu and Kashmir (AJK) would be resolved amicably through dialogue with the Joint Action Committee (JAC). In a televised media talk, he said that, on the directives of Prime Minister Shehbaz Sharif, a high-level government team had reached Muzaffarabad to hold negotiations with the JAC leadership to address their concerns and settle the matter in a peaceful and constructive manner. Ahsan Iqbal stressed that maintaining peace and stability across the country and AJK was imperative for economic recovery. The minister cautioned that negative images emerging from protests and disturbances, when circulated on social media, harmed the country's overall reputation. He observed that in today's world, such actions were part of hybrid warfare, where internal unrest could be exploited to tarnish a country's image at the global level. The minister noted that the people of AJK were highly patriotic and had rendered immense sacrifices for Pakistan, just as the Pakistani nation had sacrificed for the Kashmir cause. \"No one can weaken this bond,\" he asserted. He expressed hope that the issue would be resolved peacefully, appealing to the JAC leadership and the people of AJK to keep in view the prevailing regional and international context. He said that the world was already facing multiple conflicts, while Pakistan had achieved significant success in securing peace in its region. \"Our enemy country would not waste even a single moment in trying to exploit any internal crisis. Therefore, we must not ignite any spark that could damage Pakistan's image, spread unrest, or put lives and property at risk,\" Ahsan Iqbal underlined. Reaffirming the government's commitment, he said that every Pakistani and every citizen of AJK was dear to the state, and their protection was a collective responsibility. He stressed that dialogue and peaceful means were the only way forward to resolve issues, expressing confidence that, Insha'Allah, success would be achieved in this regard.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}