{
  "article_id": "2025-10-03_8c85e2aa3de63f30631458efb3748a23",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nab-returns-embezzled-funds-to-affectees-of-new-metro-city-gujar-khan/",
    "retrieved_at": "2025-10-11T23:47:49.882Z"
  },
  "metadata": {
    "title": "NAB returns embezzled funds to affectees of New Metro City Gujar Khan",
    "author": null,
    "date_published": "2025-10-03T18:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 292,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 3 (APP):The National Accountability Bureau (NAB) held a ceremony at its Islamabad headquarters on Friday to return recovered funds to victims of housing scams by distributing cheques to those affected by the New Metro City Gujar Khan project. NAB Chairman Lt. Gen (R) Nazir Ahmed presided over the ceremony while Prosecutor General Accountability Syed Ehtesham Qadir Shah, Director Generals, NAB senior officers, and a large number of affected individuals attended. NAB (Islamabad/Rawalpindi) initiated an inquiry in September 2024 after receiving complaints against the management of New Metro City Gujar Khan. Complainants stated that they paid for plots but the management of the project failed to deliver as promised. Due to NAB's timely intervention and efforts, the management of New Metro City Gujar Khan agreed to return affectees' money. As a result, Rs. 767 million has been returned to 383 victims, and cheques were distributed during the ceremony. Additionally, 57 affectees accepted plot allotments, which have now been processed. Addressing the ceremony, NAB Chairman Lt. Gen. (R) Nazir Ahmed reaffirmed that the recovery of public money lost through fraud is NAB's top priority. He urged citizens to carefully verify investment opportunities before committing their hard earned savings. He also commended the efforts of NAB (Islamabad/Rawalpindi), stating that due to the dedication of the NAB officers and investigation team, timely recoveries were made possible. On this occasion, Director General NAB (Islamabad/Rawalpindi) Waqar Ahmed Chauhan highlighted the Bureau's performance, stating that the return of looted funds to the public was made possible due to NAB's dedicated efforts and the respected Chairman's leadership and vision, aimed at ensuring timely justice for the common people. NAB Chairman Lt. Gen. (R) Nazir Ahmed also distributed shields to the members of the investigation team of the case.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}