{
  "title": "Omar Ayub expresses concern over fuel shortage; forms body to identify balck marketers",
  "link": "https://www.app.com.pk/business/omar-ayub-expresses-concern-over-fuel-shortage-forms-body-to-identify-balck-marketers/",
  "date_published": "2020-06-08T00:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 08 (APP):Minister for Energy Omar Ayub Khan on Monday expressed deep concern over fuel shortage, artificially created by some Oil Marketing Companies (OMCs) and dealers for maximum profits, and formed a committee to verify stocks availability, identify black-marketing and hoarding by some elements.\nChairing a video conference here at the Petroleum Division, he said some elements created artificial shortage of fuel across the country for their personal gains, which caused inconvenience to the general public, a news release said.\nThe meeting, attended among others by Special Assistant to Prime Minister on Petroleum Nadeem Babar and Secretary Petroleum Mian Asad Hayaud Din, besides representatives of Oil and Gas Regulatory Authority (OGRA) and OMCs, discussed ways and means to mitigate the fuel demand & supply challenges.\nThe meeting took a number of decisions including formation of a committee under the supervision of Director General Oil to verify stock availability, and identification of black marketing, and hoarding by OMCs.\nIt was also decided that “OMCs shall not be allowed to ration supplies of petroleum products to retail outlets,” and strict action would be taken against those dealers involved in overcharging and hoarding.\nThe meeting decided that OMCs would not be allowed to cancel or defer their planned cargoes for June 2020, while oil refineries had been directed to produce their committed volume of petroleum products.\n“OMCs to move Mogas from Karachi ports to main consumption centers immediately. In this regard, a committee has also formulated to inspect OMCs installations/depots to verify their stocks, physically. License of OMC(s) will be cancelled by the regulator if anyone found negligent,” the meeting decided.\nBesides, OMCs would ensure additional supplies to Malakand, Faisalabad and Hyderabad Divisions.\nOil Companies Advisory Council has been asked to issue a ‘press statement’ indicating that sufficient stocks of petrol were available in the country and all import of petroleum products was lined up to meet the demand.\nWhereas, OGRA had been given a task to deploy vigilance teams in the field to verify available stocks of OMCs, at depots and retail outlets.\nThe meeting also stressed that additional production by refineries as well as planned imports should be as per schedule aimed at meeting the monthly needs, observing that useable stocks of 214,536 Metric Tons petrol were available in the country, which were sufficient for 10 days requirements.\nThe meeting vowed to take proactive and appropriate actions jointly by Petroleum Division, OGRA and all relevant stakeholders, including provincial government, to normalize the fuel supply situation across the country.\nThe Petroleum Division urged the public and petrol dealers not to indulge in panic buying.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:53.891Z"
}
