{
  "title": "Keeping Climate Conversation on Track: UK marks King Charles III’s birthday with climate-themed event",
  "link": "https://www.app.com.pk/national/keeping-climate-conversation-on-track-uk-marks-king-charles-iiis-birthday-with-climate-themed-event/",
  "date_published": "2023-11-15T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): The British High Commission in Islamabad hosted the first ‘King’s Birthday Party’ since 1951, marking His Majesty, King Charles III’s 75th birthday.\nUtilized as a ‘national day’ by the UK, the event had an environment and climate change theme. This was reflective of both the King’s interests and the high priority given to this work by the UK.\nSpeaking to an audience of over 700 high-profile attendees, including the Chief Guest Foreign Minister, Jalil Abbas Jilani, the British High Commissioner to Pakistan, Jane Marriott CMG OBE, outlined the depth of UK-Pakistani cooperation on the environment and climate change. Noting that since the 2022 floods, the UK has more than doubled investment in climate finance, and climate resilience and adaptation in Pakistan.\nJane Marriott also used the occasion to announce the start of two new climate-related initiatives. This included the start of phase two of the UK’s Climate Finance Accelerator Programme, which will see eight innovative Pakistani-based projects receive technical support to help them find private investment to tackle climate-related issues. As well as a new program to expand a piloted AI-based ‘Early Warning Forest Fire Detection System’ to cover more forested areas of Khyber-Pakhtunkhwa as well as the Federal Capital Territory, which will help protect lives, jobs, livelihoods and Pakistan’s biodiversity.\nUK High Commissioner to Pakistan Jane Marriott CMG OBE said, “With terrible conflicts occurring around the world, international focus on climate change is being tested. However, with COP28 just around the corner, and with time not on our side, conversations and actions on climate change must continue. We are utilising our King’s Birthday Party – the UK’s National Day – events to do just this, with conversations ranging from how to build on Pakistan’s negotiating success on a Loss and Damage Fund at COP27, to how Pakistan can safeguard its marine economy via the Commonwealth’s Blue Charter.”",
  "retrievedAt": "2025-08-11T10:31:45.303Z"
}
