{
  "title": "PM reprimands “bizarre” justifications, narrative on killing of Gaza children by Israel",
  "link": "https://www.app.com.pk/national/pm-reprimands-bizarre-justifications-narrative-on-killing-of-gaza-children-by-israel/",
  "date_published": "2023-11-15T09:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday calling Israeli barbarism in Palestine unparalleled even in the medieval era, reprimanded the world’s double standards on war ethos and its “bizarre and surreal” rationalization of the killing of children in Gaza.\nThe prime minister, addressing the annual Margalla Dialogue 2023 conference held by Islamabad Policy Research Institute\non “Evolving World Environment: Charting the Course for Our Future,” said Israeli forces were targeting vulnerable people in hospitals and eliminating children.\nReferring to his discussions with some diplomats who defended Israeli actions by citing Israeli children’s deaths, he expressed his surprise at the argument. However, he reiterated that the killing of any child, regardless of faith or origin, is condemnable.\n“So how many Palestinian children have to be killed to appease and address the Israeli anger? One, five, ten, 500, 1000, 4,700? Can they give us a number so that we can satisfy those parents to wait as some 10,000 children needed to be killed to address the Israeli anger,” he remarked.\nHe said those claiming to be the followers of Prophet Moses, were actually following the footsteps of Pharaoh by killing the children which was “utterly unacceptable.”\nThe prime minister, who had also been the IPRI’s board member, highlighted the potential for connectivity with the countries in the region including India, and said Pakistan never shied away from establishing trade links with India but it could not beg that as trade should be for mutual benefits.\nHowever, he said before such links, it was essential to speak out on the Kashmir conflict as without addressing that issue, it was challenging to have normal relations with the current Indian regime.\nHe told the gathering that the Kashmir issue demanded attention aligned with the aspirations of its people as despite promises and UN guarantees, the Kashmiris could not be given their right to self-determination. Postponing the issue is not a solution as the historical resilience against colonization is evident, he added.\nHe observed that the right of Kashmiris people to decide their future could not be denied for long, though. “Neither Pakistan nor India should impose a solution on Kashmiris,” he added.\nHe talked about the western borders of Pakistan with Afghanistan and said that the day Kabul has a legitimate government, issues will start settling down.\nReferring to the Hindutva ideology infesting Indian society, he said such policies were a recipe for disaster.\nHe said contrary to the ongoing persecution in India, the minorities in Pakistan were sharing their destinies with Pakistan having deep entrenched roots in business as well as society.\nThe prime minister said Pakistan was faced with the challenge of non-state actors but the country was prepared to respond that, without needing anyone’s tangible assistance.\nGiving a historical account of human history to the formation of modern-day political groups, the prime minister said amidst the containment policy, China arose to become the second biggest economy of the world.\nHe said, unlike India, Pakistan never incentivized the conflicts.\nPrime Minister Kakar said the country was ready to give a push to its economy by exploiting its potential of land and mineral resources and that the energies of a huge youth population needed to be channelised which was yet under-invested in terms of human resource as well as skill development.\nComing to climate change, he said it was becoming an existential threat even more than a military challenge as recent floods caused devastation even more than some small conflicts. This challenge cannot be overcome by a single power or group of powers.\nTo a question, the prime minister said the government was designing the projects in renewable energy and other areas of focus which also required global coordination and cooperation as the country was trying to stimulate the discourse at domestic, regional and global levels.\nEarlier, IPRI President Ambassador Ambassador Raza Muhammad told the gathering that the conference featured six forums.\nThe event also marked the launch of an IPRI’s publication titled “Persecution of the Indian Minorities” highlighting the plight of the Indian minorities which faced a difficult time there.\nThe IPRI president also presented a copy of the book to the prime minister.",
  "retrievedAt": "2025-08-11T10:31:46.418Z"
}
