{
  "title": "‘Let power of intellect overrule military might to save humanity from wars,’ President tells world",
  "link": "https://www.app.com.pk/national/let-power-of-intellect-overrule-military-might-to-save-humanity-from-wars-president-tells-world/",
  "date_published": "2023-11-15T08:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): President Dr Arif Alvi on Wednesday said with wars and conflicts resulting in the massacre of innocent people, the world needed a unified approach to saving humanity from the violence of the powerful.\n“Power of intellect should be the world order taking precedence over the violent forces which quash the spirit of humanity and justice,” he said at the Annual Margalla Dialogue 2023.\nThe event themed ‘Evolving world environment: Charting the course of our future’ gathered diplomats, thinkers, and intellectuals from various countries.\nPresident Alvi said dehumanizing people had become a norm in the world where vested interests prevailed over humanity.\nWar, he said, was not a solution to resolve any conflict and always resulted in a never-ending vicious cycle of violence.\nHe pointed out that using the right of veto against the cessation of war questioned the ethical standards of the countries concerned.\nIn Gaza, he said the massive killings of Palestinians committed by Israel needed urgent attention by the international community to act and play its role in stopping the bloodshed.\nHe said Israel, in its justification to eliminate Hamas was “killing the Palestinians like savages” and calling the colossal deaths as collateral damage”.\nThe president mentioned that the world after several war-related deaths in Europe arrived at the culmination of peace treaties and bodies like the League of the Nations and the United Nations (UN).\nHe emphasized the role of the UN in waging peace initiatives to prevent disputes from escalating into conflicts and an effective mechanism to stop wars.\nBesides conflicts, he said, the world faced several threats affiliated with climate change, artificial intelligence, negative social narratives, unequal wealth distribution, and dissatisfied mankind.\n“The realistic solutions to these challenges need international cooperation requiring the adoption of viable systems and also embedding ethical morality into approach,” he said.\nPresident of IPRI Dr Raza Muhammad said as the world grappled with both natural and man-made disasters, it was time for a collective approach to save humanity from emanating the risks involved.\nHe highlighted the need for a global focus on conflict resolution, the economy, and climate change.\nEarlier, President Dr Arif Alvi and the guests in attendance observed a one-minute silence for the innocent people of Palestine who faced the barbaric acts of Israel.",
  "retrievedAt": "2025-08-11T10:31:47.092Z"
}
