{
  "title": "Joining Hong Kong Convention will boost ship recycling business; SAPM",
  "link": "https://www.app.com.pk/national/joining-hong-kong-convention-will-boost-ship-recycling-business-sapm/",
  "date_published": "2023-11-15T12:41:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 15 (APP): Special Assistant to the Prime Minister (SAPM) on Maritime Affairs, Vice Admiral (Retd.) Iftikhar Ahmed Rao, announced on Wednesday that governmental efforts are currently underway to secure Pakistan’s accession to the Hong Kong Convention (HKC). He expressed confidence that formal approval from the cabinet would soon be obtained for this purpose.\nSpeaking at the three-day International Maritime Organization (IMO) National Seminar titled ‘The Ratification and Implementation of the Hong Kong Convention, Pakistan-2023,’ the SAPM highlighted the prospective benefits of joining the HKC. Rao emphasized that this accession would likely draw a substantial number of ships to country’s ship breaking yards, thereby stimulating growth within the country’s ship-breaking industry.\nRao underscored the global shift towards recognizing ship-breaking as ship recycling, emphasizing its environmentally sustainable and energy-efficient nature. He lamented the decline of Gadani Ship Breaking Yard, attributing its regression to past neglect.\nMoreover, Vice Admiral (Retd.) Iftikhar Ahmed Rao asserted ongoing efforts to revitalize and restore the former prestige of Pakistan’s ship-breaking industry. He acknowledged the implementation of various international regulations governing ship-breaking, including waste disposal, labor safety, and the establishment of environmentally friendly yards. Rao expressed regret that the country had not timely joined the HKC, which came into effect in 2009.\nThe SAPM outlined future endeavors post-joining the HKC, highlighting aspirations to align with the European Union’s ship-breaking standards. Additionally, the concluding day of the seminar witnessed addresses by IMO consultants Takeshi Naruse, Gudrun Janssens, representatives from the Pakistan Ship Breakers Association, officers from the Ministry of Maritime Affairs, and others.\nDuring the event, the launch of Vice Admiral (Retd.) Iftikhar Ahmed Rao’s third book, “Maritime Security,” was announced. Rao shared insights into his literary works, explaining that his first book, “Elements of Blue Economy,” aimed to raise awareness about the blue economy. His second book, “Gwatar Bay to Sir Creek,” focused on the Pakistani coastline, while his third publication explored various aspects of security, delineating differences between Navy and Maritime Security.",
  "retrievedAt": "2025-08-11T10:31:31.416Z"
}
