{
  "title": "Eid Milad-un-Nabi (PBUH) celebrated in Faisalabad",
  "link": "https://www.app.com.pk/national/eid-milad-un-nabi-pbuh-celebrated-in-faisalabad/",
  "date_published": "2021-10-19T13:45:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 19 (APP):Eid Milad-un-Nabi, the birth anniversary of the Holy Prophet Hazrat Muhammad (Peace Be Upon Him) celebrated with religious zeal and fervor here on Tuesday.\nThe day started with special prayers and Durood-o-Salaam after Fajr prayers in almost all mosques of the city.\nState Minister for Information and Broadcasting Farrukh Habib presided over the main Milad function at Clock Tower Chowk and urged the people to follow Uswa-e-Hasna which was imperative to transform Pakistan into a true Islamic welfare state. The state minister unfurled the flag and cut Milad cake on the occasion.\nMore than 150 Milad processions emerged from various parts of the city. The main procession was taken out from Darbar Muhaddis-e-Azam Pakistan, Hazrat Abu Al-Fazal Allama Muhammad Sardar Ahmad Qadri Rizvi at Markazi Masjid Jhang Bazaar.\nThe participants, riding on decorated vehicles including cycles, motorcycles, rickshaws, scooters, cars, jeeps, wagons, coasters, mini loaders, buses and trucks paraded on various city roads before the culmination of the Milad procession. Some faithful, carrying banners and green flags, also wore Arabic dress and rode on decorated horses and camels.\nThe small Milad processions were also taken out from various parts of the city which joined the main procession and marched up to Chowk Clock Tower where Markazi Milad Committee staged a big public gathering to celebrate Eid Milad-un-Nabi (PBUH).\nA large number of people belonging to all walks of life including lawyers, doctors, journalists, traders, industrialists, businessmen and public servants, etc. thronged at Chowk Clock Tower to celebrate the Eid Milad-un-Nabi (PBUH).\nReligious scholars also addressed the participants and highlighted Uswa-e-Hasana, urging the Muslims to follow the teachings of the Holy Prophet Hazrat Muhammad (PBUH) for a successful life in this world and hereafter.\nLater, special prayers were also held there for the solidarity, integrity, sovereignty, progress and prosperity of Muslim Ummah.\nThe local philanthropists also arranged Langar (free food) on the routes of the Milad processions.",
  "retrievedAt": "2025-08-11T21:29:31.007Z"
}
