{
  "title": "PM taking revolutionary steps to transform Pakistan into true Islamic welfare state: Farrukh Habib",
  "link": "https://www.app.com.pk/national/pm-taking-revolutionary-steps-to-transform-pakistan-into-true-islamic-welfare-state-farrukh-habib/",
  "date_published": "2021-10-19T09:01:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 19 (APP):State Minister for Information & Broadcasting Farrukh Habib said on Tuesday that Prime Minister Imran Khan was taking revolutionary steps to transform Pakistan into a true Islamic welfare state by protecting the rights of neglected segments and providing justice to each and every person without any discrimination.\nHe was attending a Jashn-e-Milad function of Markazi Milad Committee here at Clock Tower Chowk where he also inaugurated the functions of 12th Rabiul Awwal to mark birthday of Holy Prophet Hazrat Muhammad (Peace Be Upon Him) by unfurling a flag.\nCongratulating the nation on the day, he said: “It demands us to renew our pledge to follow the footprints of holy Prophet (Peace Be Upon Him) as it is the only way through which we can get respect and dignity in this world and hereafter”.\nHe said the Holy Prophet (Peace Be Upon Him) established the first welfare state in the world where rights of downtrodden were protected and justice was done to everyone.\n“Prime Minister Imran Khan had announced to celebrate Ashra (10 days) Rehmatullil Aalameen from 3rd to 13th Rabiul Awwal and we are celebrating the Ashra by holding rallies, seminars and conferences which will continue during this Ashra”, he added.\nHe said: “The life of Holy Prophet (Peace Be Upon Him) is a beacon for Muslims and we must follow the educational system and learn that how the Holy Prophet (Peace Be Upon Him) treated the poor, orphans and other neglected persons.\nHe said that Prime Minister Imran Khan had also announced to form Rehmatullil Aalameen Committee] which would work and educate the new generation to follow the sacred life of Holy Prophet (PBUH).\nThe government also made Seerat an integral part of the curriculum. Similarly, the Prime Minister was committed to transform Pakistan into a welfare state like Riyasat-e-Madinah and in this connection “Langar Khanas” and “Panahgahs” were established for the poor who have no shelter and food, he added.\nHe hoped that the nation would not only pledge on this day but also start following the teachings of Holy Prophet (PBUH) to put the country on road to progress by alleviating poverty from it.\nHe said that during Ashra Rehmatullil Aalameen, Ulema would deliver lectures to educate the Muslim to toe the footprints of Holy Prophet (PBUH) so that Pakistan could be transformed into a true Islamic welfare state.\nOn this occasion, the state minister cut a cake to mark the birthday of Holy Prophet Hazrat Muhammad (PBUH).\nProvincial Parliamentary Secretary for Labor Shakeel Shahid, MPA Mian Tahir Jameel, President Markazi Milad Committee Mian Muneer Ahmad Noorani and others were also present on the occasion.\nLater, the minister visited a medical camp of Al-Mustafa Welfare Society near Clock Tower Chowk and also inaugurated ambulance service of the society.\nSocial President Prof Rehmatullah Sialvi, General Secretary Rafiq Lodhi and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:29:34.160Z"
}
