{
  "title": "PM stresses upon strengthening of economic dimension of Pak-Saudi bonds",
  "link": "https://www.app.com.pk/national/pm-stresses-upon-strengthening-of-economic-dimension-of-pak-saudi-bonds/",
  "date_published": "2021-07-27T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 27 (APP): Prime Minister Imran Khan Tuesday while reaffirming the deep-rooted and historic bonds between Pakistan and Saudi Arabia, particularly emphasized upon the need of strengthening the economic dimension of these ties by taking steps to realize the vast possibilities in trade, investment and energy.\nThe prime minister was talking to Foreign Minister of the Kingdom of Saudi Arabia Prince Faisal Bin Farhan Al Saud who called on him.\nThe Covid situation in the two countries and in the South Asia was also discussed.\nOn the situation in Afghanistan, the prime minister underscored the need for constructive engagement among the Afghan parties for securing a negotiated political settlement, which was critically important for peace and stability in the region.\nPrime minister Imran Khan appreciated the work related to activation of the Saudi-Pakistan Supreme Coordination Council (SPSCC), which was the highest-level platform designed to impart strategic direction to the development of Pakistan-Saudi Arabia relations.\nHe also lauded the important role of Pakistan’s community in Saudi Arabia in progress and development of the two countries.\nHe underlined that the strong people-to-people linkages helped building solid foundations of bilateral cooperation.\nNoting the difficulties being faced by Pakistani nationals due to Covid-related travel restrictions, the prime minister underlined the importance of timely measures for facilitation of their return to Saudi Arabia.\nHe thanked for the administration of Covid vaccines to Pakistanis living in the Kingdom.\nThe prime minister conveyed cordial greetings for the Custodian of the Two Holy Mosques King Salman Bin Abdulaziz Al Saud and Crown Prince Mohammed bin Salman and fondly recalled his visit to Saudi Arabia in May.\nIn line with the decisions taken on the occasion, the prime minister highlighted the assiduous follow-up and stressed the need for exploring new avenues of cooperation to further deepen bilateral relations in diverse fields.\nThanking the prime minister for the warm welcome accorded to the Saudi delegation, Prince Faisal underscored the importance that Saudi Arabia attached to its strong relationship with Pakistan, based on bonds of brotherhood.\nHe reaffirmed the resolve to taking all possible measures to further strengthen the bilateral relationship under the strategic direction set by the crown prince and the prime minister.\nPakistan and Saudi Arabia enjoy close fraternal elations, marked by close cooperation and mutual support. Saudi Arabia is a member of Organization of Islamic cooperation (OIC) Contact Group on Jammu & Kashmir and steadfastly supports the Kashmir cause.",
  "retrievedAt": "2025-08-11T21:00:34.114Z"
}
