{
  "title": "President’s strong notice leads to arrest of Hindu boy’s harasser in Sindh",
  "link": "https://www.app.com.pk/national/presidents-strong-notice-leads-to-arrest-of-hindu-boys-harasser-in-sindh/",
  "date_published": "2021-07-27T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 27 (APP): President Dr. Arif Alvi on Tuesday took strong notice of the harassment of a Hindu citizen in Sindh, which led to prompt action and arrest of the accused, Abdus Salam Abu Dawood, by the provincial police.\nThe President had directed Secretary Ministry of Interior and Inspector General (IG) Police Sindh for taking immediate action.\nThe President said that as any unfair treatment with minorities was not only against the spirit of Islam but was also a violation of the Constitution of Pakistan, such incident brought bad name to the country.\nHe said that the country’s Constitution guaranteed the protection of rights and religious freedom to minorities.\nThe President said that with the minorities enjoying all rights in the country, steps were being taken by the state to protect those rights, a press release issued by the President’s Media Media Wing here said.\nHe, however, added that curbing such incidents was the shared responsibility of all the people of society.\nMeanwhile, President Alvi in a series of tweets posted on his twitter handle on Tuesday also mentioned the incident and said he took strong notice of a video in circulation that showed a young Hindu boy being harassed in Tharparker.\nSecretary Interior and Inspector General (IG) Police Sindh were asked to confirm and arrest the harasser, he added.\nI took strong notice of a video in circulation today that showed a young hindu boy being harassed in Tharparker. Sect Interior & IG Sindh were asked to confirm & arrest harasser. Pakistan has & will always ensure protection to its minorities as enshrined in our constitution.\n— The President of Pakistan (@PresOfPakistan) July 27, 2021\nThe President said that “Islam protects minorities. Our constitution ensures equal rights, freedom & security. “\n“How dare anyone in this country violate our laws in such a manner. The State through Sindh Police promptly arrested the accused Abdus Salam Abu Dawood,” he added.\nIslam protects minorities. Our constitution ensures equal rights, freedom & security. How dare anyone in this country violate our laws in such a manner. The State through Sindh Police promptly arrested the accused Abdus Salam Abu Dawood.\nThe President further said that Pakistan had and would always ensure protection to its minorities as enshrined in the country’s constitution.\nOur society should remain alert. Such isolated ugly incidents are used to give a bad name to the country. I condemn it and I assure all citizens that we in Riasat-e-Madina cannot and will not allow this to happen.\n“Our society should remain alert. Such isolated ugly incidents are used to give a bad name to the country,” he added.\nThe President condemned the incident and assured all citizens that the present government in Riasat-e-Madina “cannot and will not allow this to happen”.",
  "retrievedAt": "2025-08-11T21:00:32.543Z"
}
