{
  "title": "Shazia for protecting constitution to ensure freedom, justice, human rights",
  "link": "https://www.app.com.pk/national/shazia-for-protecting-constitution-to-ensure-freedom-justice-human-rights/",
  "date_published": "2023-05-12T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):Federal Minister for Poverty Alleviation and Social Safety (PA&SS) and Chairperson Benazir Income Support Programme (BISP) Ms. Shazia Marri has said that the Constitution must be protected at all costs to ensure freedom, justice and protection of human rights.\nShe was chairing the International Parliamentary Convention titled “My Constitution Guarantee of My Freedom” held here on Friday.\nThe convention aimed to highlight the importance of constitutional guarantees for the protection of human rights and the role of the judiciary in ensuring the same.\nMs. Marri introduced her role as the minister and chairperson of the Benazir Income Support Programme, which has empowered 9 million women in Pakistan through various initiatives.\nShe stressed the importance of the Constitutional provisions and their protection for the development of the country.\nTalking about democracy in Pakistan, she said that separation of power is the fundamental principle of democracy which if trampled can impede development in the country.\nSenator Zafar Ullah Khan stressed the importance of the tracheotomy of power in protecting human rights and proposed making constitutional courts in Pakistan.\nFormer Senator Safdar Abbasi stressed the need for understanding the spirit behind the words of the constitution.\nThe federal minister introduced Dr. Joseph Kizito Mhagama, MP, Chairperson Governance, Constitution and Legal Affairs in Tanzania, who shared his experiences of his home country, stressing the need for the judiciary to give the protection of human rights the utmost importance.\nDr. Joseph also talked about the accountability of courts in Tanzania and the role of the judiciary in Africa at large. He shared the experiences of the judiciary in Tanzanian and the challenges faced by it. Dr. Joseph also informed the audience about the set-up of Constitutional Courts in Tanzania for the interpretation of the constitution and its amendments.\nIn her concluding remarks, the chair expressed the hope that the struggle for complete democracy will win over in the end.\nMs. Marri wished Dr. Joseph Kizito Mhagama the best of luck for his future role in upholding the principles of democracy as a legislator.\nThe convention was attended by various guests and stakeholders, who emphasized the need for dialogue to address the issues of human rights in Pakistan.",
  "retrievedAt": "2025-08-11T08:28:48.942Z"
}
