{
  "title": "HEC conducts capacity building workshop for teachers in Punjab affiliated colleges",
  "link": "https://www.app.com.pk/national/hec-conducts-capacity-building-workshop-for-teachers-in-punjab-affiliated-colleges/",
  "date_published": "2023-05-12T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The Higher Education Commission (HEC) Pakistan on Friday conducted the second cohort of capacity building training programme for faculty of Affiliated Colleges (ACs) of Lahore Division in collaboration with HED Punjab under the Higher Education Development in Pakistan (HEDP) project.\nA three-day capacity building workshop was conducted by the HEDP team at the University of Engineering and Technology, Lahore, for the faculty of 50 Affiliated Colleges (ACs) of Lahore Division. The batch comprising 91 participants included more than 60 percent women.\nThese included teachers from Lahore, Shahdara, Kasur, Pattoki, Phool Nagar, Chunian, Kot Rada Kishen, Mustafaabad, Kanganpur, Khudian Khas, Changa Manga, Muridke, Nankana Sahib, Narang Mandi, Shahkot, Sangla Hill, Bucheki and Sheikhupura.\nThe training was comprised of ten modules:  a) Transition to Semester System; b) Semester System Planning and Management c) Academic Advisement and Career Progression; d) Use of Technology in Teaching e) Use of Technology in assessment f) Learning Assessment and Feedback; g) Quality in Learning h) Curriculum development i) Course Development; and j) Teaching Methodology: Andragogy and Pedagogy.\nThe activity is led by the Post-Secondary Education Reform Unit (PERU) team, a component of the project responsible for the execution and the roll-out of UEP, in close coordination with the Higher Education Departments (HEDs) of the Government.\nThe HEDP project is focused on supporting the tertiary education system composed of ACs in Pakistan and several initiatives of the project including IT support, governance, capacity building and financial autonomy are aimed to support these institutions.\nThe training is an outcome of advocacy meetings held earlier with HED Punjab in which they have nominated 1600 faculty members from 800 Affiliated Colleges, whose capacity will be enhanced in a phased approach.\nThe training started with a pre-training test and was followed by an online post-test and feedback survey. The pre-test and post-test indicate that substantial value was added to the participants during the training.\nThe participants appreciated the efforts of HEC and suggested the need for regular trainings for faculty and staff and closer collaboration between Higher Education Department, Higher Education Commission (HEC) and Affiliating Universities (AUs).\nDeputy Secretary HED Punjab, Nadeem Asghar participated in the closing (certificate distribution) ceremony. In his remarks, he stressed effective coordination between federal and provincial bodies and the importance of such training for faculty development especially those of ACs.\nHe encouraged further collaboration between HED Punjab and HEDP/HEC Islamabad.\nAsad Khan, Program Specialist, HEDP led the activity on behalf of HEC along with other members of the HEDP/ PERU team.",
  "retrievedAt": "2025-08-11T08:28:51.220Z"
}
