{
  "title": "This Gen Z spirit",
  "author": "Muna Khan",
  "content": "I HAVE often written about going to graduate school in my mid-40s and how much I loved being in the classroom after a 20-year gap. I highly recommend returning to a classroom, even if for a short course, if you have the means to. This is because you will want to learn versus because you have to check college off your things to do in life. My most memorable moments from grad school are attending demonstrations, as they remind me of my time as an undergraduate in London participating in rallies for Palestine. I’m not narrating this for street cred as much as I want to say that there is a long history of protesting against Israel’s occupation. As a third-culture child who grew up sheltered in privilege, I owe most of my ‘real’ education to student groups — organising, learning to deal with different opinions and rallying for a common cause.\n\nI attended the women’s march in Washington, DC, in 2017 against Donald Trump’s misogynistic comments, seen as a threat to women’s rights. I had no skin in their game but I was glad to be part of this march, even if it was cute-sy in nature with pink hats and fun slogans. News reports estimated half a million attended the DC event and it was the largest single-day protest in the US. The other protest was on my campus, organised by Muslim groups against the so-called Muslim ban — Trump’s executive order banning entry of people from six Muslim-majority countries. While much smaller in scale, it was beautiful to be part of something that felt more personal. And it was wonderful to watch young students lead and bring in allies from various communities to participate.\n\nI’m reminded of this because of the recent protest at a university in Karachi against the harassment of a young female student for her choice of dress. She tried to file a complaint against the staff member, but instead of her grievances being addressed, she was reportedly expelled. Her post on social media prompted students to share their own experiences, organise and protest. The girl was reinstated. It’s the kind of good cheer one needs to read more of.\n\nAs an aside, I have witnessed the harassment of female students by administrators at one university I taught at before new leadership put a stop to this policing. I was pleased then at how the girls fought back and were supported by faculty members. If only we could spend this much energy on teaching students instead of moral policing them.\n\nIt was wonderful to watch young students lead.\n\nSocial media referred to the aforementioned recent event as a successful Gen Z protest, a reference to Gen Z protests across the Global South — from Bangladesh to Thailand, Nepal to Indonesia. Rage against the establishment fuelled students to take to the streets in these countries. While governments have responded in different ways, it’s not yet clear whether Gen Z protests will be able to wield influence in policy changes or policymaking.\n\nAccording to a 2020 paper by Harvard political scientist Erica Chenoweth, there’s been a decline in the effectiveness of non-violent civilian resistance. “From the 1960s until about 2010, success rates for revolutionary nonviolent campaigns remained above 40 per cent … [but] since 2010, less than 34pc of nonviolent revolutions and a mere 8pc of violent ones have succeeded.” Chenoweth puts this down to movements lacking “sustained grassroots civic action”, which she says is “critical” for non-violent movements to have lasting impact. She says that today’s movements “lack clear strategies for transforming protest demands into legislative priorities, finding ways to enter government and manage governance, and exercising leadership”.\n\nThis may prove useful for students and other grassroots mo-vements organising against so many is­­su­­es of injustice and discrimination. Face-to-face organising, it turns out, is key and requires determined activists willing to do the work. They also require strategy because just like students use social media to amplify their message and organise, so too do governments which spread division and disinformation and use force to intimidate. We see this all the time here.\n\nCorruption continues in Bangladesh; after some concessions, the Indonesian president has endorsed a crackdown on dissent; the youth-led movement that ousted the regime in Nepal has developed fissures and turned on the interim prime minister. Change takes time and we can look towards Sri Lanka to learn how the 2022 protests led to the election in 2024 of Anura Dissanayake of the National Peoples Power, a party that only secured 3pc of the vote in 2019. The BBC described him as “a disruptor to the old discredited political order”. His success was seen as a clear rejection to the old days and ways.\n\nI’m hopeful our Gen Z will find lessons from their Asian comrades and move forward with a steely will and courage.\n\nThe writer is an instructor of journalism.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6906b3be62a6a.jpg",
  "retrievedAt": "2025-11-03T12:32:26.647Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952688/this-gen-z-spirit",
  "dateList": "2025-11-03",
  "date_published": "2025-11-02T01:36:55.000Z"
}
