{
  "title": "Dar meets Turkish counterpart in Istanbul on sidelines of Gaza ministerial meeting",
  "author": "Dawn.com | Abdullah Momand",
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar arrived in Istanbul on Monday to attend a meeting focused on developments in Gaza, the Foreign Office (FO) said in a statement.\n\nThe FO had stated a day earlier that the foreign minister would be undertaking a one-day visit to Türkiye to attend the Coordination Meeting of Arab-Islamic Foreign Ministers to discuss the Gaza ceasefire deal.\n\nThe FO posted on social media today that Dar had reached Türkiye to participate in a meeting hosted by Turkish Foreign Minister Hakan Fidan “to discuss the recent developments in Gaza”.\n\nIt added that upon arrival, FM Dar was received by Ambassador Ahmet Cemil Miroğlu, Director General of Protocol, as well as officials of the Pakistan Embassy.\n\nThe talks are to begin at around 11am GMT (4pm Pakistan time) at an Istanbul hotel, with a news conference due several hours later, AFP reported.\n\nHamas and Israel had signed a ceasefire agreement on October 9, agreeing to free the Israeli captives in exchange for Palestinian prisoners, in the first phase of United States President Donald Trump’s initiative to end the Israeli onslaught in Gaza. Pakistan was one of the eight Arab and Muslim countries to work with Trump on the plan.\n\nHowever, despite signing the deal, Tel Aviv has already resumed its attacks on Gaza.\n\nToday’s meeting is expected to bring together the foreign ministers of Türkiye, the United Arab Emirates, Indonesia, Qatar, Pakistan, Saudi Arabia, and Jordan — the same countries that met with Trump on Sept 23 on the sidelines of the UN General Assembly.\n\nAFP, citing Turkish foreign ministry sources, reported that Ankara is set to urge the dignitaries to support plans for Palestinians to take control of Gaza’s security and governance.\n\nFidan is expected to “emphasise the importance of coordinated action by Muslim countries for the ceasefire to evolve into a lasting peace”, a Turkish foreign ministry source was quoted as saying by Reuters.\n\nMeanwhile, according to FO’s statement yesterday, Pakistan will emphasise the need for the full implementation of the ceasefire agreement and complete Israeli withdrawal from the occupied Palestinian territory, especially Gaza.\n\nIt will also call for the provision of unfettered humanitarian assistance to the Palestinians and the reconstruction of Gaza, while reiterating the need for an “independent, viable, and contiguous State of Palestine” based on pre-1967 borders.\n\nHamas is “determined” to stick to the truce, Turkish President Recep Tayyip Erdogan said today, adding it was crucial that Muslim nations play a leading role in Gaza’s reconstruction.\n\n“It seems that Hamas is quite determined to adhere to the agreement,” Erdogan told delegates from the Organisation of Islamic Cooperation (OIC) gathered in Istanbul for their annual economic summit.\n\nHe stressed it was “essential” that the OIC “play a leading role in the reconstruction of Gaza”.\n\n“At this point, we need to deliver more humanitarian aid to the people of Gaza and then begin reconstruction efforts. […] The Israeli government is doing everything in its power to prevent this,” Erdogan said.\n\nOn the eve of the meeting, FM Fidan welcomed a Hamas delegation led by its lead negotiator Khalil al-Hayya.\n\n“We must end the massacre in Gaza. A ceasefire in itself is not enough,” Fidan said, arguing for the two-state solution to the intractable Israeli-Palestinian conflict.\n\n“We should recognise that Gaza should be governed by the Palestinians, and act with caution,” he added.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03134737c3e137c.webp",
  "retrievedAt": "2025-11-03T12:46:54.275Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952919/dar-arrives-in-istanbul-to-attend-gaza-peace-moot-of-arab-islamic-countries",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T09:14:42.000Z"
}
