{
  "title": "18 booked for renting out property to illegal Afghan nationals",
  "author": "Mohammad Asghar",
  "content": "RAWALPINDI: As many as 63 cases were registered by the police, 18 of them against those who had rented out their properties to illegal Afghan nationals.\n\nMoreover, 216 Afghan nationals illegally residing in the garrison city were shifted to holding centres for their deportation.\n\nA crackdown has been launched against illegal Afghans and other foreigners in the city over the past five days in the light of directives issued by the Punjab government.\n\nCitizens have been asked to provide information about illegal foreigners to the police.\n\nA police spokesman said the cases had been registered in the police stations of City, Pirwadhai, Waris Khan, Bani, New Town, Sadiqabad, Ratta Amral, RA Bazaar, Race Course, Wah Cantt, Chaklala, Airport, Taxila, Saddar Wah, Civil Lines, Morgah, Naseerabad, Mandara, Jatli, Sadr Bironi, Gujar Khan, Dhamial, Kallar Syedan and Rawat.\n\nThe police said citizens should never rent out their property to illegal foreigners. Illegal foreigners cannot rent out houses, shops or any property. Citizens should not sell their property to any illegal foreigners.\n\nThey should also not give their vehicles, rickshaws or other items to illegal foreigners.\n\nThey should not do any kind of business dealings, transactions or business activities with any illegal foreigners.\n\n“No citizen should employ any illegal foreigners. Legally residing foreigners should ensure their registration in the relevant police station. All citizens are requested to keep an eye on their surroundings. Provide information about illegal foreigners to the police. Their names will be kept confidential.”\n\nThe instructions of the government should be strictly implemented otherwise legal action will be taken.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03103916291465c.webp",
  "retrievedAt": "2025-11-03T12:27:03.445Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952781/18-booked-for-renting-out-property-to-illegal-afghan-nationals",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:34:09.000Z"
}
