{
  "title": "Physical torture of an AMS : Services administration recommends action against 5 medics",
  "author": "Asif Chaudhry",
  "content": "LAHORE: The Services Hospital Lahore administration has recommended a strong departmental action against a postgraduate trainee (PGR), besides lodging a criminal case against five medics, for allegedly attacking and torturing a senior administrative officer of the institute.\n\nThe medical superintendent (MS) of the major government teaching hospital sprung into action after a PGR who was allegedly caught in an objectionable condition with a girl in the institute’s residential quarters, along with his fellows and two outsiders vented his anger by attacking Additional Medical Superintendent (AMS) Dr Shakil, for being questioned about his ‘conduct’.\n\nThe AMS was allegedly subjected to torture, and was left seriously injured.\n\nA video clip of the incident showed the medics torturing and using abusive language against the AMS on the hospital premises, disturbing patients and creating unrest among other employees of the institute. An official privy to the incident said the authorities first avoided criminal and departmental proceedings against the attackers, fearing it might damage the reputation of the government teaching institute.\n\nHe said initially a deputy medical superintendent (DMS) had held an inquiry into the matter involving a girl and the PGR and hushed up the incident, reportedly occurring in the official residential colony of the hospital, leading to the physical torture of the duty AMS.\n\nHowever, he said, when the video clip of the incident was uploaded on the social media, and the victim AMS obtained a medico-legal certificate because of the deep injuries he suffered, the institute had no option but to go for departmental and criminal proceedings against the offenders.\n\nServices Hospital MS Dr Abid Mehmood Ghouri said the alleged involvement of a PGR in immoral activities on the official residential premises of the hospital where other male and female employees of the institute also resided were highly objectionable.\n\nAs per initial report, he said, a lawyer who resided in the official quarters allegedly caught the PGR in an objectionable condition with a female and snubbed him for his act. The lawyer then visited the office of the concerned senior admin officer and complained about the immoral act of the junior doctor.\n\nThe MS said that following the incident, the PGR visited the AMS Dr Shakil’s office and asked him to expel the ‘complainant’ from the quarter, arguing that official flat was illegally allotted to a lawyer.\n\nDuring initial inquiry, Dr Ghouri said it transpired that the lawyer was husband of a staff nurse, who died some years back, adding that the official residence was allotted to her family following the “legal procedures.”\n\nHe said the PGR rejected the institute’s claim regarding the “legality” of the allotment of the official residence to a lawyer and entered into a heated argument with the AMS. However, the institute’s administration kept sticking to its stance.\n\nHe said the medic harboured a grudge against the AMS and later attacked and injured him,  adding that the inquiries held under his supervision found the PGR primarily responsible for the incident.\n\n“We have recommended to the health department [to take] strict departmental action against the guilty PGR on Sunday,” the MS said.\n\nAbout the criminal proceeding, he said that the injured AMS has lodged an FIR against five medics, including the PGR. The police has also been asked to identify the two “outsides” and act against them as well, the MS added.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/030918278c87d73.webp",
  "retrievedAt": "2025-11-03T12:25:27.719Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952800/physical-torture-of-an-ams-services-administration-recommends-action-against-five-medics",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:34:03.000Z"
}
