{
  "title": "Rising cases of dengue in Sindh expose govt inability to tackle disease",
  "author": "Mohammad Hussain Khan",
  "content": "• Unofficial mortality figures paint haunting picture of threat posed by dengue\n• Families claim 26 deaths in Hyderabad alone between Oct 1 and Nov 2\n• Health dept confirms six deaths in 10 months\n• Experts stress need for research into why the vector is proving so lethal this year\n\nHYDERABAD: After sitting idle amid rising cases of dengue, the Sindh health department has finally decided to tackle the outbreak of the mosquito-borne viral disease by adopting what some believe as a “proactive approach”, particularly in Karachi and Hyderabad — the two major urban centres of Sindh.\n\nHowever, before the department could take any concrete steps, some 30 precious lives — 26 in Hyderabad and four in Karachi — had already been lost from October 1 to Nov 2, according to the victims’ families. However, the health department has so far confirmed only six deaths in the province.\n\nThe death of a student has now led to the initiation of criminal proceedings, under a judicial order, against the doctors of Sindh’s second-largest tertiary care hospital and a teacher at Liaquat Medical University.\n\nAfter the media highlighted the rising number of dengue cases and political leaders expressed concerns, chief secretary of Sindh Asif Hyder Shah, lately, had to hold back-to-back meetings to review the situation. He told the officials to pull their socks up to ensure “robust coordination”. The pace of the fumigation drive has noticeably accelerated.\n\nThe health department has not yet shared complete statistics of cases despite a visible surge in number of dengue patients in Hyderabad.\n\nMeanwhile, the provincial health minister has also admitted that the available data doesn’t include cases from private laboratories. However, following the intervention of the chief secretary the health department started collecting figures from private health facilities.\n\nBut in case of Hyderabad, district health officer (DHO) didn’t include statistics of the largest pathological facility of the very Sindh government ie, Diagnostic and Research Laboratory (DRL) of Liaquat University of Medical and Health Sciences (LUMHS) having massive outreach in Sindh.\n\nIt was the same DRL that had worked in the 2020-2021 Covid-19 pandemic in Sindh, offering tremendous support to the government by performing a maximum number of Covid tests round the clock.\n\nSince the commencement of dengue season, the health department seems to be downplaying the onslaught of mosquitoes by sharing data only from a few hospitals.\n\n“When you don’t have actual numbers anywhere in case of an ailment you can’t plan your future strategy,” noted a senior pathologist.\n\n“We have been alerting Sindh health functionaries about the gradual rise in dengue cases but they didn’t take it seriously,” said a medical expert.\n\nThe health department had previously established a dengue surveillance cell when it first made its presence felt in the province over 10 years ago. Now dengue virus situation is being managed by Deputy Director General Vector Borne Disease (VBD).\n\nExceptional rise in cases warrants research as to why the vector is proving to be so lethal this year, said another expert.\n\nA look at the DRL’s dengue positive tests of 2023 and 2024 shows that a total number of 2,612 positive cases were reported in Jan-Dec 2023 and 4,283 in Jan-Dec 2024. Cases of Latifabad in both years topped the list with 1,995 in 2023 and 1,509 in 2024. Qasimabad with 1,249 cases stood second in 2024 after Latifabad. But from Oct 1 to 14, 2025, Latifabad had 2,013 cases and Qasimabad 1,688. Nobody has so far analysed why the incidence of dengue remained consistently on the higher side in Latifabad and Qasimabad besides city.\n\n“Yes, the data was discussed in recent meetings in addition to the number of patients admitted in government and private facilities,” said an official.\n\nCivic administrations have been asked to engage with health officials for any kind of support or coordination with them at district level, he added.\n\n“What about people having tests done at laboratories elsewhere in the city but not reporting to government hospitals for various reasons?” he wondered.\n\nMost dengue cases and death were reported in Hyderabad this year.\n\nHyderabad DC chaired a meeting on the issue last month and wrote to the health secretary, again belatedly, identifying inadequate arrangements in the LUH and Bhitai hospital Latifabad.\n\nHe also sent letters to DHO, Municipal Commissioner of Hyderabad Municipal Corporation (HMC), all TMCs, inviting their attention towards fumigation.\n\n“There is an acute shortage of dengue testing kits in LUH which resulted in several patients being turned away without proper consultation and care. It poses a significant risk to public health and may lead to escalation in cases in Hyderabad,” he told the health secretary.\n\nHealth officials still seemed reluctant to explain why there is so much burden of this vector borne infection.\n\n“We aren’t allowed to speak on it [dengue]. You should contact the health minister’s media coordinator,” said Director General Health Dr Waqar Mahmood when asked to explain the status of Sindh-wide dengue cases.\n\nWhen the minister’s media coordinator Meeran Yusuf was approached through a Whatsapp message, she referred this correspondent to Murad Waheed of the health department. Mr Waheed chose not to respond to Dawn’s questions till Sunday.\n\nProvision of dengue test kits is yet to be resolved — which has been halted due to some litigation on the tendering process — though Additional Secretary of Procurement Monitoring & Inspection (PM&I) Cell Ibrahim Memon insisted the tendering process issue had been resolved. “Tender proceedings for dengue were delayed due to departmental reasons as they had to be re-invited. But now it has been finalised and hopefully provision of kits will be actualised from next week,” according to Memon, who referred to court litigation over central tenders and stay was granted by court.\n\nSindh health department’s performance — particularly health secretary Rehan Iqbal Baloch — was under judicial scrutiny by the Sindh High Court Sukkur bench where a couple of litigations are underway and court has held him incompetent to hold this position.\n\n“Government leaders are told it is the health department that is letting us down,” observed a Sindh government official, alluding to orders passed against incumbent health secretary.\n\nPakistan Medical Association (PMA) Sindh chapter views the present situation with deep concerns and believes that desired fumigation exercise continues to elude people at mass level. “The fumigation that is being seen is only at the cost of some precious lives,” says PMA Sindh general secretary Dr Haleem Thebo.\n\n“It looks like fever/infection caused by dengue is severe this season and apparently there is some mutation of virus causing serious complications especially if there are comorbidities. Patients are taking weeks to recuperate. It requires research based findings,” he asserted.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03092704ca2e122.webp",
  "retrievedAt": "2025-11-03T12:27:53.161Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952820/rising-cases-of-dengue-in-sindh-expose-govt-inability-to-tackle-disease",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:57.000Z"
}
