{
  "title": "Lawyers, politicos assail 27th Amendment proposal as rollback of provincial rights",
  "author": "Dawn.com",
  "content": "The PPP on Monday said that its coalition partner PML-N has officially sought its support for a proposed 27th Constitutional Amendment — the idea of which had been floated soon after the 26th Amendment.\n\nThe development comes even as three dozen petitions challenging most of the 26th Amendment, which had also faced sizeable censure, are pending before the Supreme Court.\n\nAccording to PPP Chairman Bilawal Bhutto-Zardari, proposals include setting up constitutional courts, restoring executive magistrates, end of protection for provincial shares under the National Finance Commission and amendments to Article 243 of the Constitution, which pertains to the command of armed forces.\n\nWith the 27th Amendment’s introduction in the parliament now seeming to be on the horizon, the legal fraternity and political circles were quick to raise concerns about the proposed changes in the Constitution.\n\nBarrister Salahuddin Ahmed, a former Sindh High Court Bar Association president, noted that the proposed changes seemingly aimed to “dilute federalism through the NFC amendment and rollback of 18th Amendment devolution”.\n\nThe 27th Amendment, he said, also seemed to “alter the civil-military balance by amending” Article 243, and “finish last vestiges of independence in superior courts (through a new court and transfer powers) and in lower courts (executive magistracy)”.\n\nAhmed said he expected “enthusiastic agreement” between the PPP and the PML-N on the court-related changes, “some disagreement” on the NFC rollback, and “complete capitulation” on Article 243.\n\nReema Omer, legal adviser for the International Commission of Jurists, said on X: “None of PML-N’s proposals inspire confidence or give hope that this new wave of constitution-tweaking furthers the vision of a federal republic.\n\n“The 18th Amendment was a constitutional resistance. The proposed 27th Amendment seems to be a complete constitutional surrender,” she said.\n\nAdvocate Hassan A. Niazi commented, “Complete and utter authoritarian consolidation of Pakistan continues.”\n\nHe termed “each proposal worse than the last”, claiming that the public’s view had been “completely sidelined by an undemocratic and illegitimate parliament”.\n\n“The decision has already been made — why pretend on deliberations?” quipped Niazi, a partner at Lahore-based Common Law Chambers (CLC).\n\nThe PTI, one of the loudest voices against the 26th Amendment, also slammed the government’s wishes to make further tweaks in the Constitution.\n\nSenior PTI leader Asad Qaiser noted that the successors of ex-president Zulfikar Ali Bhutto, during whose rule the current 1973 Constitution was passed, and “his own party was bent on disfiguring that same Constitution”.\n\n“The wounds of the 26th Amendment are still fresh, and now the 27th Amendment is being discussed,” Qaiser said. He highlighted that the 1973 Constitution “binds together all units of the state in a beautiful bond”.\n\n“The current parliament is a creation of Form-47s and does not have any moral licence to make a major Constitutional Amendment of this nature,” the former National Assembly speaker said.\n\nThe PTI leader called on “all democratic forces of the country to stand united against this illegitimate amendment, else no one will get anything”.\n\nFormer Khyber Pakhtunkhwa minister Taimur Saleem Jhagra called the proposal a “disaster for the country”. In an indirect reference to the PPP, he said, “Now we will see where all these parties that claimed to be for devolution really stand.”\n\n“How can the entire constitutional structure of a country be changed? No one has a clue, and we just learn through some random tweet by Bilawal?” he wondered in another post.\n\nMuzammil Aslam, finance adviser to the KP chief minister, said on X: “Honestly, these amendments require national consensus: [they] need broader consultations for the good of the country.\n\n“Talking about NFC remodelling as KP finance adviser, we are completely blank. We need the proposed draft for consultation,” he added.\n\nOther politicians also assailed the proposed changes.\n\nNational Democratic Movement (NDM) leader Bushra Gohar termed the 27th Amendment a “rollback” of the 18th Amendment. “What are the proposed amendments to Article 243?” the former MNA wondered.\n\n“In my opinion, the 27th Amendment is a coup against the provinces and a blatant attempt to weaken the federation,” Gohar asserted.\n\n“This is dangerous,” said former Sindh governor Mohammad Zubair.\n\n“The ruling regime is now planning to literally scrap the 1973 Constitution. Whatever little was left after 26th Amendment will be taken away through the proposed 27th Amendment.\n\n“Resist now or be ready to remain subservient for the next 10 years,” the former PML-N leader added.\n\nFormer federal secretary Ahmad Nawaz Sukhera stressed: “An independent, competent and apolitical judiciary is vital for any society … including ‘protecting’ people from the wrath of the state!”\n\nJournalists and rights activists were another group expressing their concerns.\n\n“How can such issues of national importance be taken without a thorough public debate in parliament and outside?” asked journalist Munizae Jahangir.\n\nThe daughter of late Asma Jahangir added: “We need more transparency in what is being proposed. Without that, you will compromise the freedoms of Pakistanis for generations to come.\n\n“Be careful politicians, you may yet again end up harming yourselves!” cautioned Jahangir, also the co-chairperson of the Human Rights Commission of Pakistan (HRCP).\n\nHum News Investigation Editor Zahid Gishkori pointed out that Article 243 of the Constitution, which was proposed to be tweaked, was “about appointment, tenure and extension of armed forces’ heads”.\n\n“Move will likely outline the president’s authority to grant the title of Field Marshal to the prime achiever too,” he added.\n\nDawn journalist Nasir Jamal noted: “This proposal involves a significant rollback of the 18th Amendment, which the PPP has been defending all along. How will they walk back on what they’ve been saying since?\n\n“[Bilawal] and his party are in a tough spot,” he added.\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03180909af8dea6.webp",
  "retrievedAt": "2025-11-03T16:16:49.384Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952921/lawyers-politicos-assail-27th-amendment-proposal-as-rollback-of-provincial-rights",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T12:32:54.000Z"
}
