{
  "title": "China to ease chip export ban in new trade deal, White House says",
  "author": "Monitoring Desk",
  "content": "As part of a trade deal struck between the US and China, Beijing will begin easing an export ban on automotive computer chips vital to production of cars across the world, the White House has said.\n\nThe White House confirmed details of the deal in a new fact sheet, after Xi Jinping and Donald Trump met in South Korea, according to a BBC report.\n\nOne of the issues addressed in the deal was the export of automotive computer chips. There had been concern that a lack of chips from Nexperia, which has production facilities in China, could create global supply chain issues.\n\nNexperia is a Chinese-owned company, but is based in the Netherlands. About 70 per cent of Nexp­eria chips made in Europe are sent to China to be completed and re-exported to other countries.\n\nSpeaking on Sunday following the release of the fact sheet, Treasury Secretary Scott Bessent told CNN: “We don’t want to decouple from China… (But) they’ve shown themselves to be an unreliable partner.”\n\nThe fact sheet states that China will “take appropriate measures to ensure the resumption of trade from Nexperia’s facilities in China, allowing production of critical legacy chips to flow to the rest of the world”.\n\nIt follows Beijing saying on Satu­rday that it was considering exem­p­ting some firms from the ban.\n\nLast month, the likes of Volvo Cars and Volkswagen warned a chip shortage could lead to temporary shutdowns at their plants, and Jaguar Land Rover said the lack of chips posed a threat to their business.\n\nThe US and China had also reached agreements on US soybean exports, the supply of rare earth minerals, and the materials used in production of the drug fentanyl. The deal de-escalates a trade war between the world’s two largest economies after Tru­mp hit China with tariffs after he entered office this year, leading to rounds of retaliatory tariffs and global business uncertainty.\n\nMuch of what is in Saturday’s fact sheet was announced by Tru­mp and other officials following the meeting between the two leaders. Trump had described the talks, held in South Korea, as “am­a­zing”, while Beijing had said they had reached a consensus to resolve “major trade issues” — but did not immediately release deta­ils of the deal.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/030744328a29cf2.webp",
  "retrievedAt": "2025-11-03T12:29:15.449Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952869/china-to-ease-chip-export-ban-in-new-trade-deal-white-house-says",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:23.000Z"
}
