{
  "title": "Fortifying export productivity",
  "author": "Jawaid Bokhari",
  "content": "Notwithstanding improving stability and geopolitical relations, analysts say policymakers are struggling to address declining productivity across key industrial sectors.\n\nPakistan is among the world’s top-performing stock markets, but manufacturing output, unemployment and poverty have either deteriorated or remained stubbornly high, explained Dr Manzoor Ahmed in his The Express Tribune article in July titled ‘Profits without productivity and job creation’.\n\nOver two-thirds of recent stock market gains have come from the banking, fertiliser, and oil and gas sectors, he said, adding: a closer look reveals how government policies have driven their profits, often at the cost of broader private sector development.\n\nThe banking sector alone accounted for 40 per cent of the total index profitability, he noted, largely driven by investing in government securities.\n\nIndustrialists urge that the sector’s crisis is not driven by weak global demand but by domestic policies that make exporting uncompetitive\n\nOut of 22 major industries tracked by the Pakistan Bureau of Statistics, nearly 10 are reportedly producing less today than they did a decade ago. That includes automobiles, pharmaceuticals, and engineering goods.\n\nIndustry analysts say frequent energy shortages, inconsistent government policies, high interest rates, and limited access to raw materials have made it difficult for industries to sustain output, let alone expand.\n\nOn Oct 24, the Economic Committee of the Cabinet, chaired by Finance Minister Muhammad Aurangzeb, deferred a summary of the commerce ministry regarding proposed amendments to the procedure for the import of vehicles under the personal baggage, transfer of residence, and gift schemes. It directed the Commerce Division to undertake further consultations with relevant stakeholders and resubmit the proposal.\n\nAccording to Mian Sohail Nisar, Patron-in-Chief of the Pakistan Industrial and Traders Association Front, “The textile index has stayed below the 100 mark for 35 consecutive months.” This prolonged slump reflects a deeper structural issue, he says.\n\nThe textile output today, he pointed out, is even lower than what it was 10 years ago — a fact that starkly illustrates the story of Pakistan’s industrial decline.\n\nOut of 22 major industries tracked by the Pakistan Bureau of Statistics, nearly 10 are reportedly producing less today than a decade ago\n\nAgriculture that feeds industry with inputs is in bad shape as well. Cotton production has fallen sharply by 34pc to 6.8m bales in the 2025-26 season, below the target of 10.8m bales, according to an official document submitted to the Federal Committee of Agriculture.\n\nFor multiple reasons, national cotton yields dropped by nearly 50pc over the past decade and a half, according to agricultural scientists speaking at the ‘Cotton Mela 2025’ organised by the Centre of Agriculture and Biosciences International at the Business Incubator Centre of Sindh, Agriculture University, Tandojam.\n\nDr Sanaullah Abbasi, a former director-general of the Federal Investigation Agency, on Oct 21, explained that digital technologies have been transformed from tools of convenience into instruments of control. “Surveillance capitalism”, which he describes as a “new form of market”, poses an existential challenge to human autonomy, democratic governance and the concept of a self-determined future.\n\nThe challenge, Dr Abbasi stressed, is not to reject technology but to reclaim it for a future where it serves humanity. He also proposed technological alternatives be developed to prioritise human well-being over extraction.\n\nIndustry reportedly estimates that the country holds mineral assets up to $8 trillion, yet the sector contributes around 3pc of the GDP and less than 0.1pc of global mineral exports.\n\nTo shore up export-orientated industrialisation, on Oct 25, Prime Minister Shehbaz Sharif established eight groups led by business leaders to ‘rescue’ exports and industry.\n\nHe was told by industrialists that Pakistan’s crucial export sector “is collapsing”, warning that it provides the backbone of foreign exchange earnings, industrial employment, and national productivity.\n\nThey argued that the crisis is not driven by weak global demand but by domestic policies that make exporting uncompetitive.\n\nThe groups will recommend ways to make exports competitive through value addition, diversifying exports, attracting investment, creating jobs, and sustaining inclusive economic growth.\n\nAddressing a press conference the next day, Minister of State for Finance Bilal Azhar Kayani said the working groups would frame recommendations compatible with the International Monetary Fund programme, adding that any proposal would be shared with the Fund before implementation.\n\nSite Association of Industry President Ahmed Azeem Alvi says the central bank’s decision on Oct 27 to hold the interest rate at 11pc for the fourth consecutive meeting undermines the PM’s efforts to revive the economy through industrialisation and contradicts his vision. Domestic business considers the interest rate as anti-growth.\n\nHowever, in its biennial Perception and Investment Survey 2025, the Overseas Investors Chamber of Commerce and Industry said 73pc of its members recommend Pakistan as a viable destination for foreign direct investment, up from 61pc in 2023.\n\nIt will be worthwhile to study how China’s trade surplus with the world so far this year has reached $875bn. Its exports in September were the largest monthly total of $328.6bn.\n\nChina’s ruling political party has now unveiled its 15th five-year plan anchored on clearly defined guiding principles for economic and social development: upholding the party’s overall leadership; placing people first; pursuing high-quality development; comprehensively deepening reforms; promoting interplay between an efficient market and a well-functioning government; and ensuring both development and security.\n\nPublished in Dawn, The Business and Finance Weekly, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03083804279e0ca.webp",
  "retrievedAt": "2025-11-03T12:28:31.816Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952709/fortifying-export-productivity",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:35.000Z"
}
