{
  "title": "Punjab govt under fire for ‘manipulating’ air quality data",
  "author": "Imran Gabol",
  "content": "The Punjab government is facing criticism and allegations of data manipulation after climate analysts and social media users accused the Environment Protection & Climate Change Department (EPCCD) of deliberately shutting down air quality monitoring stations in Lahore during peak pollution hours.\n\nThe controversy erupted when climate and public policy analyst Dawar Hameed Butt posted a series of tweets on X, alleging that the EPCCD had turned off several monitoring stations, particularly those in the more polluted northern and eastern parts of the city.\n\n“EPCCD Punjab has turned off Monitoring Stations in Lahore,” Butt tweeted. “The ones left on are still ‘Beyond Index’. These are PAS officers, PhDs and ‘educated’ staff, and they think closing their eyes will solve the problem. Absolute failure unfolding now.”\n\nHe supported his claims with screenshots from the official government website, aqipunjab.com, which showed that data from multiple stations had not been updated for hours, still displaying readings from October 30.\n\nThe allegations were echoed by another social media user, Hassan Aftab, who suggested a “strategic motive behind the alleged shutdowns.”\n\n“Punjab government’s new air quality strategy: if pollution levels look bad, just turn off the monitors. [Eight] out of 10 monitors are shut beyond 10pm in Lahore (when air quality dips further) to lower the average. Lahore now breathing the cleaner air (on paper),” he tweeted.\n\nAftab tagged Senior Minister Marriyum Aurangzeb, urging transparency. “Let’s ensure there’s uninterrupted data from the monitors; it will only help you better strategise on how to solve this,” he added, noting the millions already spent on the monitoring infrastructure.\n\nIn a post on X, the EPCCD stated that due to a technical issue, AQI monitoring at some stations had been interrupted.\n\n“[A] technical team is working to restore regular data transmission. Current and any missing AQI data from Air Quality Monitoring Stations will be available soon,” the post read.\n\nWhen checked by Dawn at 5pm on Friday, the aqipunjab.com website appeared to have updated most stations, with only the Multan Road station lagging. However, the updated data itself painted a grim picture of the province’s air quality, underscoring the critical need for reliable monitoring.\n\nAt that time, Kasur was ranked the most polluted city in Punjab with an AQI soaring to a hazardous level of 500. Other major cities also recorded unhealthy air, with Gujranwala at 207, DG Khan at 190, Multan at 187 and Lahore at 175.\n\nIn response to the allegations, EPCCD spokesperson Sajid Bashir firmly denied the claims and told Dawn that the department updates air quality levels on an hourly basis and dismissed the social media users’ accusations as “false claims.”\n\nBashir rejected the screenshots shared by Dawar and others, asserting the department’s commitment to providing accurate data.\n\nEarlier this week, Lahore continued to rank as the most polluted city in the world in terms of air quality, according to the global monitor IQAir.\n\nIn response to the crisis, the Lahore Waste Management Company (LWMC) has also launched a large-scale anti-smog operation, deploying 16 mechanical washers, 50 regular washers, and 400 workers for road washing and water sprinkling.\n\nMeanwhile, Punjab Senior Minister Marriyum Aurangzeb, in a statement, praised the efforts of Punjab Chief Minister Maryam Nawaz in handling the anti-smog operations, calling her hard work “a testament to the success of the vision of improving the environment”.\n\n“In the coming years, Punjab will see improvements like Beijing,” she said.\n\nAurangzeb, in a statement released later in the day, said there was a “brief technical glitch” in the air quality monitoring network earlier today.\n\n“It was immediately flagged by the EPA’s Smog War Room, and the vendor resolved it by 3:00 p.m. the same day. The issue was purely technical, not administrative, and was transparently announced on the official portal,” said the statement.\n\nPraising the monitoring system, the minister said that the fact that the brief technical interruption was noticed “shows how widely trusted and publicly relied upon our system has become”.\n\nAurangzeb maintained that if the government wished to hide the air quality date, it would not have installed 41 monitoring stations across Punjab. It further claimed that the current provincial government has built “one of South Asia’s most transparent, data-driven air quality management systems accessible to every citizen”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/311920317424de0.webp",
  "retrievedAt": "2025-11-03T12:31:46.754Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952369/punjab-govt-under-fire-for-manipulating-air-quality-data",
  "dateList": "2025-11-03",
  "date_published": "2025-10-31T14:22:06.000Z"
}
