{
  "title": "PTI set to move Lahore High Court against Punjab local govt bill",
  "author": "Amjad Mahmood",
  "content": "LAHORE: The PTI is expected to challenge the Punjab Local Government Bill 2025 before the Lahore High Court (LHC) on Monday, and will be seeking a stay order agai­nst what it terms “unconstitutional provisions”.\n\nParty leaders formally filed a representation against the bill, which has been sent to the president, prime minister, Punjab governor, chief minister and other senior officials.\n\nPTI leader Ijaz Shafi said on Sunday the bill would be challenged in the LHC, along with a request for a stay order. He said objections have been prepared with the assistance of lawyers.\n\nThe representation has been submitted by Sheikh Imtiaz Mahmood, Ijaz Shafi, Muneer Ahmad and Mian Shabbir Ismail.\n\nAccording to the text of the representation, several provisions of the bill are in conflict with Articles 17, 32 and 140-A of the Constitution.\n\nPTI leaders have expressed strong reservations about the non-party-based, one-vote, multi-member union council model, saying that the non-party system would weaken the role of political parties and place administrative officers in control rather than elected local representatives, undermining local government powers.\n\nThey said the centralisation of financial powers goes against the spirit of local autonomy, while the authority to appoint administrators for an indefinite period is unconstitutional.\n\nThey demanded the restoration of direct elections for union council chairmen, the establishment of a fixed five-year tenure and a clear election schedule for local governments and strict restrictions on executive interference and administrators’ powers.\n\nThe bill was passed in mid-October.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03080025bc37c3e.webp",
  "retrievedAt": "2025-11-03T12:29:21.342Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952866/pti-set-to-move-lahore-high-court-against-punjab-local-govt-bill",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:29.000Z"
}
