{
  "title": "‘Neglected’ Iqbal Stadium in Faisalabad to host international cricket after 17 years",
  "author": "Tariq Saeed",
  "content": "TOBA TEK SINGH: International cricket is set to return to Faisalabad’s historic Iqbal Stadium after 17 years as Pakistan and South Africa face off in a ODI series starting Tuesday (tomorrow).\n\nWhile excitement runs high among citizens over the revival of international cricket, serious concerns persist regarding the stadium’s neglected condition and lack of any upgrades in over two decades.\n\nDespite generating millions of rupees annually, the stadium remains largely neglected. Nearly 90pc of the spectator stands lack proper seating, forcing fans to sit on bare concrete steps during matches, while the stands have no roofing.\n\nThe management of the Iqbal Stadium does not fall under the jurisdiction of the Punjab government or the Punjab Sports Board or the Pakistan Cricket Board (PCB). Instead, the stadium is controlled by the Iqbal Stadium Management Committee (ISMC), which comprises nine government officials and local businessmen.\n\nAccording to the documents obtained by a citizen named Naeem Khan under the Punjab Transparency and Right to Information Act, additional deputy commissioner (general) as the ISMC secretary informed that ISMC earned over Rs63 million annually, while its expenditures were Rs30.9 million.\n\nStadium is managed by the Iqbal Stadium Management Committee instead of the Punjab Sports Board or the Pakistan Cricket Board\n\nCovering over 36 kanals and 15 marlas, the stadium complex includes more than 100 commercial shops, offices, restaurants, and recreational facilities.\n\nThe revenue from these establishments was deposited directly into the ISMC’s account rather than the provincial treasury.\n\nThe documents further revealed that during the Champions Cricket Cup 2024 (held at the country level, , the ISMC did not spend a single rupee on arrangements. Instead. the PCB earned over Rs15 million in gate money, while the Punjab government covered Rs35 million in security and logistic costs from the public exchequer.\n\nCricket fans have urged the Punjab government to transfer the management of the stadium to the PCB, so that it could be upgraded and maintained on the same lines as Lahore’s Gaddafi Stadium.\n\nMeanwhile, all roads leading from the Faisalabad airport to the city were closed to traffic on Sunday during the arrival of the South African cricket team and strict security measures were adopted by the police.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6907f638e790e.gif",
  "retrievedAt": "2025-11-03T12:27:17.273Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952787/neglected-iqbal-stadium-in-faisalabad-to-host-international-cricket-after-17-years",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:34:04.000Z"
}
