{
  "title": "The RO ruse",
  "author": "Muddassir Rizvi",
  "content": "THE Election Commission of Pakistan’s recommendation to parliament that the election law be amended in favour of appointing judicial officers as District Returning Officers (DROs) and Returning Officers (ROs) is nothing short of an adverse comment on the performance of executive officers appointed to these positions to conduct General Election 2024 (GE-2024). This recommendation is part of the ECP’s post-election review annexed with its statutory annual report laid before the National Assembly in September.\n\nGE-2024 was challenged by opposition parties who alleged that ROs had manipulated the results. The ECP had appointed 144 DROs and 266 and 593 ROs for the national and provincial assembly constituencies, respectively, mostly drawn from the district management group. The ECP, however, believes that ROs from the judiciary have a better understanding of the laws and rules and hence can undertake poll activities more smoothly than executive ROs, who also command the district administrative machinery — necessary for the smooth conduct of any election.\n\nMany candidates blamed ROs in their constituencies for manipulating results (Forms 47 and 48) while expressing confidence in the results (Form 45) prepared at polling stations. Some alleged that the ROs were under pressure from the establishment, while others claimed that a ‘winning’ Form 48 was sold to the highest bidder. However, no allegation of foul play could be proved in court, nor does the ECP appear to have initiated an inquiry.\n\nIt is against this backdrop that the ECP’s recommendation becomes significant — almost a vindication of the allegations that executive officers did not perform their duties in accordance with legal and regulatory requirements. In fact, the report itself suggests that despite comprehensive training, “first-time ROs faced certain difficulties in performing the electoral activities”, indicating that the law and rules might not have been enforced as intended. The nature of these “difficulties” needs further elaboration to ensure they did not “materially affect” the result of any constituency. The ECP may also wish to clarify the number of first-time ROs and correlate the alleged irregularities with the constituencies of their appointments.\n\nBut it was not just the naïveté of “first-time ROs” that concerned the ECP; it was also their inaccessibility to perform poll duties. While the election law is explicit that any official appointed or deputed to perform election duties “shall be deemed to be under the control, superintendence, and discipline of the Commission…,” these executive officials were not easily accessible to the ECP. “…DROs and ROs, being administrative officers, remained involved in performing their principal duties and were not easily accessible for electoral duties,” reads the report.\n\nThe conduct of judicial officers in Pakistan has not always been above board.\n\nTheir inaccessibility is a serious offence and falls within the purview of another provision of the law, whose violation empowers the ECP to take strict punitive measures. If DROs and ROs were not easily accessible for poll duties, they breached Section 55 (3)(e), which bars any official on election duty from disobeying or avoiding compliance with any instruction issued by the ECP. Such inaccessibility goes beyond mere avoidance; it reflects disregard for the direct superintendence of a constitutional entity. Whether the ECP used its powers to penalise the “inaccessible” officials isn’t known.\n\nInstead of invoking its punitive powers to improve enforcement, the ECP has now asked parliament to amend Elections Act, 2017, by adding a provision to sub-section 1(c) of Section 50 binding the chief justices of the high courts to provide judicial officers for appointment as DROs and ROs when requested by the ECP. The binding clause has likely been proposed because the chief justices had refused a similar request by the ECP for GE-2024.\n\nHowever, Pakistan’s electoral history shows that the conduct of judicial officers has not always been above board. The PTI, for instance, alleged foul play by ROs drawn from the lower judiciary during GE-2013. Although a subsequent judicial commission led by the then Supreme Court chief justice ruled out allegations of rigging, it acknowledged “shortcomings of the ECP” in conducting the elections, including a disconnect between the ECP and ROs, implying that the latter may have acted independently. The ECP itself noted this in an April 2013 press release after several political parties raised concerns about how ROs were conducting candidate scrutiny.\n\nThe recommendation also raises a constitutional question. Article 220 binds only the executive authorities in the federation and provinces to assist the ECP in the discharge of its functions. Meanwhile, Article 175(3) provides for the separation of the judiciary from the executive. Binding chief justices to comply with the ECP’s requests may then need a constitutional amendment. Moreover, appointing judicial officers as DROs and ROs creates an institutional conflict of interest, as poll petitions are heard — under the existing law — by judges of the same high courts whose chief justices would be involved in appointing the lower court judges serving as DROs and ROs.\n\nInterestingly, the ECP has again taken an evasive position in its report, reasoning why it should not take direct responsibility for conducting poll processes at the constituency level. It may not have enough officials to fill all RO positions, but it can certainly appoint DROs from among its own ranks. The ECP should assume direct supervision of electoral processes by appointing district election commissioners as DROs and seek legal reforms to strengthen this position. In their capacity as DROs, DECs can continue to “coordinate multifarious electoral activities and provide technical assistance” to ROs — the very justification the ECP has given for not appointing them to roles directly related to the conduct of polls.\n\nThere is ample evidence that the quality of elections managed directly by ECP officials as DROs and ROs is far better than those managed by ‘borrowed’ officers. Such oversight at the district level is crucial to keeping ROs — whether drawn from the executive or the judiciary — in line and ensuring that elections are conducted in accordance with the law and rules. The ECP can best serve its constitutional mandate only when it assumes micro-level supervision of the entire electoral process and uses its punitive powers to ensure full compliance by all officials. Judicial officers are not the panacea for democratic disorder, which remains rooted in the public’s distrust of the electoral process.\n\nThe writer is based in Islamabad and works with the Free and Fair Election Network.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/69080ae955173.jpg",
  "retrievedAt": "2025-11-03T12:25:14.354Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952889",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:54:19.000Z"
}
