{
  "title": "Shaheen backs Babar ahead of ODI series against South Africa",
  "author": "Dawn Sport | AFP",
  "content": "Newly appointed captain Shaheen Shah Afridi on Monday backed Babar Azam ahead of Pakistan’s three-match ODI series against South Africa after the former captain helped the Green Shirts seal the T20 International series last week.\n\nOn Saturday, Babar showed his mastery with the bat after Shaheen led a sparkling bowling performance from Pakistan as the hosts cruised to a four-wicket victory over South Africa in the series-deciding third T20I.\n\nThe ODI series will be held at Iqbal Stadium in Faisalabad from November 4-8, after which Pakistan play another three-match ODI series against Sri Lanka at the Rawalpindi Cricket Stadium from Nov 11-15.\n\nSpeaking at a pre-match press conference today, Shaheen threw his full support behind Babar.\n\n“Every cricketer struggles, there are maybe a few who perform consistently. Babar must have realised in his last innings that he’s back in form,” Shaheen said.  “He’s not a bad player just because he performed poorly in a few matches.”\n\nShaheen went on to heap praise for the 31-year-old, who regained form after a brief slump and became highest T20I-run scorer during the second match.\n\n“He has been performing for Pakistan for the past four, five years and is the top T20 [run] scorer. He has the ability to play big innings, and the other players also have the ability to score runs and help win the match.”\n\nShaheen said it was an “honour” to represent Pakistan as a captain, just as it was when he was a player, though the role of captain came with added responsibilities. His first stint as T20I captain ended after a 4-1 defeat in New Zealand last year.\n\n“It’s a special occasion that Faisalabad is hosting an international match after 17 years; it will be good for the fans of the city,” Shaheen said. The central city in Punjab last staged an international match in 2008 when Pakistan and Bangladesh played an ODI.\n\n“We’re playing against a team like South Africa which has always played quality cricket,“ he said. “We played well against them in the T20I series and the boys are in good touch, so hopefully we have a strong performance in this series.”\n\nShaheen added: “It’s always been this way that when senior players perform, the team wins.\n\n“It’s exciting to step up when you’re senior and finish the match, and he showed that in the last match. I always try to lead from the front, whether I’m captain or not.”\n\nShaheen replaces Mohammad Rizwan as ODI skipper after the wicket-keeper led the team during a disastrous ICC Champions Trophy campaign before series losses in New Zealand and the West Indies.\n\nRizwan, handed captaincy in 2024, had led the team to series wins in South Africa, Australia and Zimbabwe in his early days as captain, however. But the recent failures apparently were a decisive enough factor for the Pakistan Cricket Board to sack Rizwan.\n\nFor Shaheen, it will be his second stint as the Pakistan captain, the left-armer having been snubbed after a short spell — five T20Is against New Zealand — at the helm after replacing Babar Azam in late 2023 following Pakistan’s dismal World Cup campaign.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03181000b42905a.webp",
  "retrievedAt": "2025-11-03T16:16:14.898Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952931/shaheen-backs-babar-ahead-of-odi-series-against-south-africa",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T13:18:38.000Z"
}
