{
  "title": "Blind to Xi-Trump summit, India hails ‘strategic’ US pact",
  "author": "Our Correspondent",
  "content": "• Analysts warn warming US-China ties may undermine India’s multipolar world vision, weaken Quad-like groups\n• Pakistan assessing impact of deal, says Foreign Office\n\nNEW DELHI: India and the United States on Friday inked a 10-year defence framework agreement, a deal India’s defence minister described as a “signal” of growing strategic alignment, even as warming US-China ties raised questions about the region’s geopolitical landscape.\n\nIndian reports confirmed the defence pact was sealed at a meeting here between Defence Minister Rajnath Singh and his American counterpart Peter Hegseth.\n\nThe “convergence” however seemed undermined by a potentially opposite view on the Obama era encircling of China that Chinese and US presidents presented at a globally watched meeting in South Korea.\n\nIndian newspaper The Hindu noted that the meeting of US President Donald Trump and Chinese President Xi Jinping in Busan “sent ripple effects to India”.\n\nFollowing the talks, US tariffs on China were cut to 47 per cent, leaving India and Brazil with the highest rate at 50pc.\n\nThe paper quoted unn­amed experts as saying the US-China “G-2” alliance could significantly impact the region. Considering that Pakistan is in clover with both countries, India’s diplomatic challenges have become only that much more forbidding.\n\nThe Singh-Hegseth mee­ting was not bereft of its ironies. “The firming up of the pact came amid efforts by the two sides to repair ties that came under severe strain following Was­hington’s slapping of 50pc tariffs on Indian goods,” The Hindu reported.\n\nMr Singh announced on X that the signing of the deal marks a new era in their already robust defence relationship, emphasising the growing strategic convergence and the importance of their partnership in maintaining a free, open, and rules-based Indo-Pacific region.\n\nMr Hegseth stated the agreement strengthens defence ties, crucial for regional stability, deterrence, coordination, info sharing, and tech cooperation. “Our defence ties have never been stronger,” he said.\n\nMr Hegseth and Mr Singh are in Kuala Lumpur for a meeting with ASEAN member states and dialogue partners.\n\nMoments before the summit, Mr Trump ann­ounced the “G-2 will convene shortly!”.\n\nWhen asked about the summit, according to The Hindu, India’s Ministry of External Affairs spokesperson Randhir Jaiswal was non-committal.\n\nThe spokesperson stated that the impact of the recent Trump-Xi talks on their domain was still being evaluated and he was unaware of the technicalities. When asked specifically about the G-2 reference, he suggested directing questions about US-China relations to either country.\n\nThe idea of a “G-2” to manage global issues was floated about 15 years ago during a 2009 summit between then-presidents Barack Obama and Hu Jintao. However, Obama never used the term, and Washington dropped the concept by 2011 as US-China tensions grew.\n\nOn his flight back to the US, Mr Trump mentioned plans to visit China in April 2026 and host Mr Xi later that year. No date is set for Trump’s India visit for the Quad Summit with PM Modi, and The Hindu suggested it won’t happen in 2025.\n\n“The question won’t just be whether he will be part of the Quad summit in India, but whether his new ‘G-2’ plans with China will dilute the group’s agenda to secure a free and open Indo-Pacific,” The Hindu concluded.\n\nMeanwhile, Pakistan’s Foreign Office stated that it is too early to comment on the pact, which is currently being assessed for its implications in South Asia.\n\n“The agreement is a recent development, implemented early this morning. We are currently assessing its implications, especially concerning peace, security, and stability in South Asia,” a spokesperson for the Foreign Office said.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690557902c3a3.gif",
  "retrievedAt": "2025-11-03T12:31:12.024Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952498/blind-to-xi-trump-summit-india-hails-strategic-us-pact",
  "dateList": "2025-11-03",
  "date_published": "2025-11-01T01:06:14.000Z"
}
