{
  "title": "‘They do not talk about it’: Trump claims Pakistan among countries testing nuclear weapons",
  "author": "Dawn.com",
  "content": "US President Donald Trump has included Pakistan among countries that he claims are “testing nuclear weapons”, saying that he did not want the US to be the only country that does not do so.\n\n“North Korea has been testing. Pakistan has been testing. […] But they don’t go and tell you about it,” he said in an interview on CBS News programme ‘60 Minutes’, where he was asked about his recent directives to the Pentagon to resume testing nuclear weapons. He also named Russia and China as testing nuclear weapons.\n\nIn a recent social media post, Trump had instructed the US Department of War to resume testing nuclear weapons “immediately”. Confusion has surrounded Trump’s order that the US begin testing, particularly if he meant conducting the country’s first nuclear explosion since 1992.\n\nWhen the matter was brought up during the interview, Trump said: “Well, we have more nuclear weapons than any other country. I think we should do something about denuclearisation. And I did actually discuss that with both Russian President Vladimir Putin and President Xi.\n\n“We have enough nuclear weapons to blow up the world a 150 times. Russia has a lot of nuclear weapons, and China will have a lot,” he said.\n\nAt this point, he was interrupted by the interviewer, who asked, “So why do we have to test our nuclear weapons?”\n\n“Well, because you have to see how they work,” replied Trump. “Testing is because Russia announced that they are gonna do a test. If you notice, North Korea is testing constantly, other countries are testing. We are the only country that doesn’t test, I don’t want to be the only country that doesn’t test.”\n\nHe was then asked to clarify whether he was saying that the US would start detonating nuclear weapons after more than 30 years.\n\nHe replied, “I am saying that we are going to test nuclear weapons like other countries do.”\n\nBut the only country that was testing nuclear weapons was North Korea, the interviewer pointed out. Russia and China have not carried out such tests since 1990 and 1996, respectively.\n\nTo that, Trump said Russia and China, too, were testing nuclear weapons. “You just don’t know about it.”\n\nWhen the interviewer pointed out that Russia’s recent test was that of a delivery system for nuclear weapons, which was essentially a missile, Trump asserted: “Russia is testing, and China is testing, but they don’t talk about it.”\n\nHe added: “We are an open society. We are different, we talk about it. We have to talk about it. Because, otherwise, you people are going to report. They don’t have reporters who can be writing about it. We do.\n\n“We are gonna test because they test and others test. And certainly North Korea has been testing. Pakistan has been testing. […] But they don’t go and tell you about it. And as powerful as they are — you know it’s a big world, you don’t necessarily know where they are testing. They test way underground where people don’t know exactly what’s happening with the test. You feel a little bit of a vibration.\n\n“They test, and we don’t test. We have to test. And Russia did make a, you know, little bit of a threat the other day when they said they were gonna do certain forms of a different level of testing. But Russia tests, China does test, and we are gonna test also.”\n\nTrump went on to say: “This just doesn’t make sense. You know, you make nuclear weapons and then you don’t test. How are you gonna do that? How are you gonna know if they work? We have to do that.”\n\nDawn has reached out to the Foreign Office for a comment on Trump’s assertion that Pakistan is among the countries that are testing nuclear weapons.\n\nDuring the conversation on ‘60 Minutes’, the interviewer also remarked that “apparently, we don’t need to test our nuclear weapons because they are the best in the world, according to experts I have spoken to”.\n\nTo that, Trump replied: “According to me, we have the best. And I was the one that renovated them and built them during a four-year period, and I hated to do that. Because the destructive capability is something you don’t even want to talk about. But if other people are gonna have them, we are gonna have to have them.\n\n“And if we have them, we have to test them. Otherwise, you don’t really know how they are gonna work. And we don’t want to ever use them.”\n\nAsked about Trump’s comments on Monday, China’s foreign ministry denied conducting nuclear weapons tests.\n\nAs a “responsible nuclear-weapons state, China has always … upheld a self-defence nuclear strategy and abided by its commitment to suspend nuclear testing”, spokeswoman Mao Ning said at a regular press conference in Beijing.\n\nShe added that China hoped the US would “take concrete actions to safeguard the international nuclear disarmament and non-proliferation regime and maintain global strategic balance and stability”.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/031212330679f3f.webp",
  "retrievedAt": "2025-11-03T12:25:05.863Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952912/they-do-not-talk-about-it-trump-claims-pakistan-among-countries-testing-nuclear-weapons",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T07:06:14.000Z"
}
