{
  "title": "Ex-Israeli military official at centre of Palestinian abuse video leak arrested after being reported missing: report",
  "author": "Dawn.com",
  "content": "The former advocate general of the Israeli military, who had resigned last week after admitting to leaking a video to the media that allegedly showed Israeli soldiers raping a Palestinian prisoner, was arrested hours after she was reported to have gone missing, according to the The Times of Israel.\n\nMajor General Yifat Tomer-Yerushalmi had resigned from the Israel Defence Forces (IDF) over a criminal inquiry into the leaking of a video that allegedly showed soldiers sexually abusing a Palestinian detainee arrested during the Gaza conflict. She said that she was stepping down because she had approved the video’s leak in August last year.\n\nIn a report on Sunday, the Times of Israel said that Tomer-Yerushalmi was reported missing by her family, which prompted a search by authorities.\n\n“The large search, involving police, rescue forces, and the military, was carried out after she was unreachable for several hours, and her car was later found at Hatzuk Beach near Tel Aviv. Hebrew media outlets reported that she had left a letter at home, which some characterised as a ‘suicide note’,” the publication said.\n\nHowever, Tomer-Yerushalmi made contact with her husband a few hours later and was found along a beach in the nearby city of Herzliya. She was reportedly taken for a health checkup before being arrested in connection with the video leak, the report added.\n\nThe Times of Israel reported that the ex-IDF legal chief had been on leave since a criminal investigation was launched by police last week into the leaking of the surveillance video.\n\nIn a separate report, the publication said that Israeli Prime Minister Benjamin Netanyahu expressed fury about the video leak, declaring it the “most serious public-relations attack” against Tel Aviv to date.\n\nThe incident “caused enormous reputational damage to Israel, to the IDF, and to our soldiers”, he was quoted as saying.\n\n“It is perhaps the most serious public relations attack Israel has experienced since its founding — I cannot recall one so concentrated and intense,” Netanyahu said. “This requires an independent and impartial inquiry, and I expect that such an investigation will indeed take place.”\n\nThe abuse investigation led to criminal charges against five soldiers and stirred an uproar. The inquiry drew condemnation from right-wing politicians and prompted protesters to storm two military compounds after investigators sought troops for questioning in the case.\n\nA week after the break-in at the bases, a security camera video showing the moments of the alleged abuse was leaked to an Israeli television channel.\n\nIt showed soldiers taking a prisoner aside and crowding around while holding a dog and blocking visibility of their actions with their riot gear.\n\nTomer-Yerushalmi defended her action as an attempt to fend off propaganda against the military’s legal department entrusted with upholding the rule of law, and which she said had been subjected to smears throughout the Gaza conflict.\n\nAdditional input from Reuters",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/031208204b7c5e5.webp",
  "retrievedAt": "2025-11-03T12:46:45.367Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952913/ex-israeli-military-official-at-centre-of-palestinian-abuse-video-leak-arrested-after-being-reported-missing-report",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T07:44:30.000Z"
}
