{
  "title": "Pakistan ‘natural maritime bridge’ between East and West, says Ahsan Iqbal as PIMEC kicks off in Karachi",
  "author": "Dawn.com",
  "content": "Planning Minister Ahsan Iqbal on Monday termed Pakistan a “natural maritime bridge” between the East and the West as he inaugurated the second edition of Pakistan International Maritime Expo and Conference (PIMEC) in Karachi.\n\nThe event is being held from today to November 6 (Thursday) at Karachi’s Expo Centre, and will see the participation of 45 countries, including Pakistan. It has been organised under the overall responsibility of the Pakistan Navy and with the support and patronage of federal and provincial departments.\n\nAddressing PIMEC, Iqbal highlighted that Pakistan had a unique geography as the regions of South Asia, Central Asia, the Middle East and Africa converged here, which positioned the country as a “natural maritime bridge between the East and the West”.\n\nHowever, despite these advantages, the maritime sector contributed less than 1pc to Pakistan’s GDP, compared to 4-7pc in several other maritime nations, he lamented.\n\nThe planning minister pointed out that Pakistan had a coastline of over 1,000 kilometres, an exclusive economic zone of nearly 290,000 square kilometres, and “vast offshore potential” in renewable energy, fisheries and mineral resources.\n\nNoting that the government’s Uraan Pakistan plan aimed to transform Pakistan into a $1tr economy by 2035, Iqbal underscored the importance of the 5Es framework — exports; e-Pakis­tan; equity and empo­werment; environment, and climate change; and energy and infrastructure.\n\nHe further said the government had identified “eight key drivers of export-led growth” — agriculture and food processing, manufacturing and industry, information technology and digital services, mines and minerals, manpower and skills export, creative and cultural industries, services sector and tourism, and blue economy.\n\n“In this age of interconnectedness, the oceans have re-emerged as the highways of global commerce, energy and communication, and these nations that harness them wisely are shaping the future of economic power,” Iqbal said.\n\n“The world’s prosperity literally sails on the seas,” the minister noted. Citing the United Nations Trade and Development (Unctad), he highlighted that over 80 per cent of the global trade by volume, and 70pc by value, is carried by sea.\n\nHe further said that the global blue economy contributes more than $2.5 trillion annually to the world’s GDP and sustains over 350 million jobs across shipping, ports, fisheries, coastal tourism and other areas.\n\nDuring his address, Iqbal termed the spirit of the modern blue economy as seeking God’s “bounty through trade, innovation and exploration while being grateful and responsible stewards of his creation”.\n\nSindh Chief Minister Murad Ali Shah also attended today’s inaugural ceremony.\n\nTerming PIMEC a “great opportunity”, CM Shah said in a statement that the event brings together national and international maritime business leaders, as well as opens new investment doors.\n\n“Sindh government is committed to promoting maritime trade, strengthening ties all over the world,” he asserted.\n\nPIMEC’s 2025 edition features 150 local and 28 global exhibitors.\n\nRepresentatives from 44 countries — such as the United Kingdom, Saudi Arabia, China, Egypt and Turkiye — are set to attend the event as part of 133 international delegations from Europe, Asia, North and South America, and the Far East.\n\nExperts have said Pakistan’s maritime sector could contribute over $100 billion annually to the national economy and called for urgent action to unlock its potential.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03124250aedc7b0.webp",
  "retrievedAt": "2025-11-03T12:46:53.213Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952911/pakistan-natural-maritime-bridge-between-east-and-west-says-ahsan-iqbal-as-pimec-kicks-off-in-karachi",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T07:58:01.000Z"
}
