{
  "title": "All that glitters is an investment opportunity",
  "author": "Afshan Subohi",
  "content": "Traders and experts in Pakistan see little chance of stability in the gold market — which has witnessed sharp volatility amid an overall rising price trend — anytime soon. They attribute the price swings to a rare mix of global and local factors; fluctuations in international gold prices, escalating armed conflicts that threaten to widen war zones, US tariff pressures under President Trump, dollar volatility, geopolitical tensions, and abrupt shifts in domestic economic policies.\n\nUltimately, market decisions rest with individual investors, as projections for Pakistan’s gold sector are shaped by traders/experts’ intuition rather than fact-based evidence. Comprehensive data on the country’s gold market remains unavailable, though, various institutions hold partial information on financial transactions and the inward and outward movements of precious metals in this largely self-regulated, informal sector.\n\nYet none, including the State Bank, the ministries of finance and commerce, or the Pakistan Bureau of Statistics, can provide credible, consolidated figures on market size, demand, supply or price trends. Moreover, gold prices for different categories are determined and announced daily by the gold merchant’ bodies, based not on demand and supply.\n\nGold prices in Pakistan have surged exponentially since the turn of the millennium. In 2001, 10 grams of gold traded for around Rs5,000; today, it exceeds Rs350,000, a staggering 70-fold increase. Returns in other asset classes, however, such as real estate and the stock market, have been even steeper over the same period.\n\nRising demand trends reflect a gradual shift from ornamental to investment purposes with gold increasingly serving as a hedge against inflation and rupee depreciation\n\nPakistan’s gold market witnessed sharp volatility last month. The price of 10 grams of gold swung within a wide band of Rs58,900 opening October at Rs343,200, peaking at Rs402,100 on the 17th, and closing the month at a lower Rs361,800.\n\nRegardless of its relative performance against other asset classes, gold remains an indispensable physical asset and a trusted store of value, especially in times of economic uncertainty. Beyond its financial appeal, the precious yellow metal holds deep cultural significance across the region, long cherished in the ornament trade as a symbol of prestige, security and regality.\n\nAn economist with close ties to the All Pakistan Gems and Jewellers Sarafa Association (APGJSA), commenting on the recent volatility, explained, “Gold is priced by a combination of global bullion dynamics such as US interest-rate movements, central-bank purchases, Exchange-Traded Funds [ETFs] flows and local structural factors such as rupee–dollar parity fluctuations, regulatory disruptions like import bans or standard regulatory order suspensions, smuggling, seasonal consumption spikes during weddings seasons and festivals and shifts in jewellery industry demand patterns.”\n\nGold-backed ETFs serve as a real-time barometer of global investment demand for the metal. Their performance influences international bullion prices, which in turn feed into Pakistan’s domestic gold rates through the London and Dubai benchmark prices and the prevailing rupee–dollar exchange rate.\n\n“Given the persistence of external risks, including global monetary policy shifts, geopolitical tension, and domestic vulnerabilities such as foreign exchange instability, informal trade, flood-related disruptions, further bouts of volatility are more likely than a sustained calm,” observed a leader of the APGJSA.\n\nExplaining the government’s decision to ban gold import and export in May and lift the restriction in October, an officer said privately that the initial move came after the outbreak of war with India, aimed at curbing the flow of gold and other precious metals to India via Dubai and conserving foreign exchange by limiting luxury spending. The ban was lifted last month following pressure from jewellers and strong investor demand, which had begun driving domestic gold prices higher.\n\nSome analysts note that rising inflation and the tense border security situation have driven people toward gold as a reliable store of value. They argue that the growing preference for physical assets like gold reflects heightened risk citizens now associate with other investment avenues.\n\nIn the absence of regularly published official data, reconciling numbers from multiple sources, such as Customs, the State Bank and the Federal Board of Revenue, is challenging, especially given gaps in reporting on recycling, informal and illicit flows, and domestic mines’ outputs. In this context, data from the World Gold Council (WGC), though likely underreported, serves as a useful baseline reference.\n\nAccording to WGC data, Pakistan’s gold demand has fluctuated between 60 and 90 tonnes in recent years. Demand reportedly peaked during FY17, driven by strong jewellery manufacturing and investment activity, but declined sharply following the pandemic shock.\n\nWhile investment demand for gold bars and coins has risen relative to jewellery, overall consumption has moderated in the post-pandemic period due to record-high prices, rupee depreciation and import restrictions.\n\nAccording to the WGC data, jewellery accounts for roughly 24-39pc of Pakistan’s total gold demand, while investment demand has steadily risen from about 11pc in 2010 to nearly 26pc in 2024. Together, these two segments make up around half of total consumption, with the remainder attributed to industrial and other uses. The trend reflects a gradual shift from ornamental to investment purposes, as gold increasingly serves as a hedge against inflation and rupee depreciation.\n\nMembers of the government’s economic team were approached for comment. But their responses were still awaited at the time of filing of this report. A spokesperson for the SBP said the queries had been forwarded to the relevant department, though the input had not arrived in time.\n\nChief Statistician Dr Naeem uz Zafar assured that customs data on gold trade and estimates of household gold holdings from the Household Income and Expenditure Survey would be shared. However, he cautioned that the figures might not be fully reliable, as respondents often underreport their assets. The said data was not timely shared.\n\nPublished in Dawn, The Business and Finance Weekly, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6907fa0046d32.jpg",
  "retrievedAt": "2025-11-03T12:26:11.358Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952826",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:35.000Z"
}
