{
  "title": "Louvre heist suspects ‘a couple with children’",
  "author": "AFP",
  "content": "PARIS: Small-time criminals are believed to be behind the spectacular jewel heist at the Louvre, the top Paris prosecutor said on Sunday, adding that two of the suspects are a couple with children.\n\nLast month, a four-strong gang raided the Louvre, the world’s most-visited art museum, in broad daylight, taking just seven minutes to steal jewellery worth an estimated $102 million before fleeing on scooters.\n\nThe thieves parked a truck with an extendable ladder below the museum’s Apollo Gallery housing the French crown jewels, clambered up, broke a window and used angle grinders to cut into glass display booths containing the treasures.\n\nTwo men suspected of being the pair who broke into the gallery while their two accomplices waited outside have been detained, charged and remanded in custody.\n\nProsecutors said on Saturday that two more suspects — a man and a woman — had also been charged and remanded in custody. Authorities have so far not recovered the stolen jewels.\n\nOn Sunday, Paris prosecutor Laure Beccuau said that the suspects, who lived in the French capital’s northern suburbs, were believed to be small-time criminals and not members of organised crime groups.\n\nTheir profiles do not correspond to those  “generally associated with the upper echelons of organised crime”, Beccuau told France Info. At least one other person is still being sought, she added.\n\nBeccuau said that the 37-year-old man and 38-year-old woman charged on Saturday were a couple and had children together. They have “denied any involvement”, Beccuau said, adding that the man refused to make any statement.\n\nThe suspects are “clearly local people”, she said. “They all lived more or less in Seine-Saint-Denis,” the prosecutor said, referring to a region north of Paris. “Some are connected, particularly the couple,” she said.\n\nTwo of the male suspects were convicted in a theft case together in 2015, she added.\n\nThe 37-year-old man has been charged with organised theft and criminal conspiracy, while his partner has been charged with complicity in organised theft and criminal conspiracy.\n\nThe woman was in tears as she appeared at a Paris court on Saturday, saying she feared for her children and for herself. The couple were arrested after their DNA was found in the basket lift used during the robbery.\n\n“Significant” DNA evidence linking the man to the crime was found in the basket lift, the prosecutor said. Traces of his partner’s DNA were also found, but they might have been transferred there through contact with a person or object, she added.\n\nPublished in Dawn, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6907fdbfbb9c0.gif",
  "retrievedAt": "2025-11-03T12:27:51.575Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952846/louvre-heist-suspects-a-couple-with-children",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:52.000Z"
}
