{
  "title": "Geoeconomic pivot",
  "author": "Aizaz Ahmad Chaudhry",
  "content": "ALTHOUGH there is no universally agreed definition of the term, geoeconomics is widely understood as the use of economic instruments to promote geopolitical aims. The term was initially used during the Cold War in a Machiavellian sense, suggesting that economic coercion could be used to advance a nation’s interests over its rivals. This interpretation began to change towards the end of the Cold War. In his 1990 article ‘From geopolitics to geoeconomics’ Edward Luttwak predicted that the logic of commerce would displace military methods and market penetration would be a higher priority than garrisons and bases. Did it happen this way? Of course not. As long as humans live, conflict can’t be avoided. SIPRI has documented armed conflict in 49 states as of last year, and observed a record-high increase in conflict-related fatalities in 2024.\n\nGeoeconomics must then not be seen as separate from geopolitics. It is essentially geopolitics by economic means. In these times, a wide range of economic instruments are being used, varyingly for friends and foes, to promote geopolitical goals, including tariffs, export bans, commodity prices, sanctions, subsidies, foreign aid and financial restrictions. A country that becomes relevant to global supply chains, financial systems, or advanced technologies, is better placed to use geoeconomics to promote its own interests. China, for instance, has successfully used its economic strength to advance its geopolitical interests, though it has lately started focusing on its military muscle too. Singapore, a small city-state, has leveraged its location to become a hub of global commerce and trade.\n\nIn Pakistan, the concept of geoeconomics was introduced only when the national security policy of 2022 was announced. This policy envisaged a more comprehensive definition of national security: traditional defence, economic and human security. In the realm of economic security, geoeconomics is seen as something that would leverage geography and prospects of regional connectivity to bolster national security. Pakistan is located at the confluence of three subregions of Asia: South, West and Central Asia. This economic geography connects countries that are home to billions of people, rich energy resources and young human resource. The question is: can Pakistan benefit from this economic geography? Yes, it can and it must. For that, Pakistan would need to join in efforts to make the region peaceful. It must also ensure a national ecosystem that is more conducive to economic growth and development.\n\nFirst, it must align with forces seeking to economically uplift the region. Pakistan’s economic cooperation with China through CPEC, and in turn with the Central Asian Republics and Eurasia, can yield huge dividends if internal security concerns are addressed on a priority basis. With its firm handling of recent security challenges, it appears that the government now fully realises the imperative of establishing the state’s writ to secure economic benefits from investments by China and other friendly countries. Second, Pakistan must remain engaged with the US, particularly in the field of oil and gas exploration and mineral development. The argument that it should choose one power over the other does not align with the present when competition and cooperation have to coexist globally.\n\nCan we benefit from our economic geography?\n\nThird, Saudi Arabia’s Vision 2030 opens up investment prospects which must be capitalised on, given the favourable climate created by the Pak-Saudi Strategic Mutual Defence Agreement. Fourth, in the wake of a rapprochement bet­we­­en Iran and Saudi Arabia, Pakistan must find innovative ways to boost economic coop­­er­a­tion with Iran, particularly through border markets.\n\nFifth, Pakistan must deal with forces blocking geoeconomic dividends for it. A major obstacle is India’s quest for regional dominance, which runs counter to the narrative of geoeconomics and blocks the region’s east-west connectivity. To add to the complexity, Afghanistan’s Taliban regime is teaming up with India to create trouble in Pakistan. The recent approach by Pakistan to deal with these challenges firmly has created room for these two countries to realise what they are missing out on in terms of cooperative regional geoeconomics.\n\nSixth, Pakistan must take measures to enable geoeconomics to work for it by making its trade and investment regime more attractive, improving ease of doing business, developing capacities to prepare feasibility studies, and building its legal capacity to make trade and investment deals that don’t harm industry. Finally, Pakistan must project the narrative of a country that is ready to benefit from its geography and associated economic opportunities.\n\nThe writer is a former foreign secretary of Pakistan and chairman of Sanober Institute.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6906b3f62dea8.jpg",
  "retrievedAt": "2025-11-03T12:31:14.656Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952689/geoeconomic-pivot",
  "dateList": "2025-11-03",
  "date_published": "2025-11-02T01:36:54.000Z"
}
