{
  "title": "SOCIETY: THE SHIELD OF ‘HONOUR’",
  "author": "Ali Ousat",
  "content": "Bilal sat in a Lyari police station in Karachi last October, explaining why he’d murdered four women in his family.\n\nIt wasn’t about honour, going by what he told investigators. His girlfriend wanted her name on a house deed. His mother refused. His sisters mocked him on TikTok. So, he killed them all — his mother Shamshad, sisters Madiha and Ayesha, and his nine-year-old niece — then threw the dagger into the sea.\n\n“He tried to frame it as honour,” says Senior Superintendent of Police (SSP) for Karachi’s District South Arif Aziz, who investigated the case. “But it was about property and control,” he continues. “His family was modern and powerful, unwilling to accept male domination,” the investigator tells Eos.\n\nAccording to Bilal’s charge sheet, he’d watched the Indian crime series Crime Patrol to learn how to avoid leaving evidence. The case is still in court.\n\nPolice say Bilal’s case reveals a disturbing evolution: honour is now a legal shield for murder driven by property disputes, male insecurity and the rage of patriarchy losing ground. Some would claim it always has been.\n\nDespite legal reforms, hundreds of women and men continue to be killed in the name of ‘honour’ in Pakistan. But it is not just in rural or tribal areas. Increasingly, the phenomenon is visiting urban areas like Karachi…\n\nTHE NOT-SO-SAFE HAVEN\n\nTwo years before Bilal’s rampage, a young couple from Bajaur District, in Pakistan’s tribal northwest, fled to Karachi after marrying against their families’ wishes. They’d survived a jirga [local court of elders] that had ordered their deaths. They changed cities — first Lahore, then Karachi — believing distance would save them.\n\nOn October 2, 2024, gunmen found them in a crowded Lyari bazaar and shot them dead. No one intervened. No one testified.\n\n“Who will chase the killers to Bajaur?” remarked one official at the Napier police station, in whose jurisdiction the murder had taken place.\n\nThe man’s relatives refused to collect the bodies, the station house officer (SHO) of Napier police station, Fida Marwat tells Eos. “They said it’s good he was killed and that he had shamed them,” he adds.\n\nEight months earlier, on the outskirts of Karachi, near Gulshan-i-Iqbal, a respected physician, Dr Rafiq Ahmed Sheikh, killed his 16-year-old daughter and her 17-year-old boyfriend, after discovering their relationship. He called the police himself to confess.\n\nIn Malir Jail, where Dr Rafiq awaits trial, he tells Eos: “Why didn’t they [the boy’s family] send a proposal? I am a father who gave my children a good education.”\n\nThe prison’s deputy superintendent, Zulfiqar Pirzada, says Dr Rafiq and his co-accused sons live comfortably in prison. “They have money and connections,” he says. “They believe they’ll get away with it.”\n\nPakistan’s legal code still offers honour killers an escape route disguised as ‘Islamic’ justice.\n\nUnder previous provisions of Sections 309 and 310 of the Pakistan Penal Code — the qisas [retribution] and diyat [blood money] provisions — a murder victim’s family could forgive the killer, often in exchange for blood money. In ‘honour’ killings, this created an absurd paradox: the murderers were the family. They could forgive themselves. Section 306 went further, explicitly exempting parents who killed their children from qisas altogether. A father who murdered his daughter could not be executed under ‘Islamic’ law, even if convicted.\n\n“These provisions allowed murderers to go free,” says Advocate Ali Barkat Baloch. “The killers, the heirs and the forgivers are often the same people,” he tells Eos.\n\nIn 2004 and 2005, Pakistan reformed its “honour killing” laws to plug exactly this loophole. The reforms failed. But in 2016, after the murder of social media star Qandeel Baloch, the parliament passed the Anti-Honour Killing Laws (Criminal Amendment Act) to close gaps and mandate life sentences, even if families forgive.\n\nIt has had a positive impact, points out Advocate Sabahat Rizvi. “It has strengthened prosecution cases and increased the conviction rate. “Now, it’s a state offence and not compoundable, even when an agreement or compromise has been reached between the parties, usually related by blood,” she tells Eos.\n\nYet, according to the Human Rights Commission of Pakistan (HRCP), hundreds of women are still killed annually for “honour.” HRCP data shows that there were at least 894 instances across the country, with Sindh and Punjab accounting for 80 percent of the deaths. In 2025, 690 such murders have been documented across Pakistan so far. Close to half the murders took place in Sindh, including 27 in Karachi.\n\nEven conviction remains poor, with Islamabad-headquartered Sustainable Social Development Organisation’s report, Mapping Gender-Based Violence (GBV) 2024, finding a 0.5 percent conviction rate in cases of ‘honour’ killings.\n\nENTERING THE URBAN LANDSCAPE\n\nDr Karim Ahmed Khawaja, the chairman of the Sindh Mental Health Authority, argues that ‘honour’ killings in Karachi reflect a deeper crisis: patriarchal systems collapsing under the weight of urbanisation.\n\n“Migration from rural Sindh, southern Punjab and Khyber Pakhtunkhwa brings feudal mindsets into Karachi,” he says. “But cities give women education, jobs, mobility — things that threaten male control,” he tells Eos.\n\nDr Khawaja traces the current crisis to Gen Zia’s ‘Islamisation’ policies in the 1980s, which redefined women’s modesty and autonomy as threats to social order. “Women became less human in the collective psyche,” he says. “Society began seeing free women as immodest, deserving of punishment.”\n\nHe proposes treating “honour killings” under the Anti-Terrorism Act, with collective punishment for families who shelter killers.\n\nDr Riaz Ahmed Shaikh, a PhD in Sociology, argues, however, that the state must move beyond punishment to prevention. “Create shelters and support houses for couples who marry by choice,” he tells Eos. “Provide counselling, skills training, mediation with families. Give them a path back.”\n\nDr Shaikh stresses that education alone won’t solve the issue. “Karachi University debates dress codes while educated doctors murder their daughters,” he points out. “It’s not about literacy. It’s about reforming mindsets through sustained social intervention.”\n\nUzma Noorani, who runs the Panah Shelter Home in Karachi, says her organisation admits, on average, five to eight women daily who are fleeing some form of violence, including ‘honour’ killings. “We provide them protection, a safe space, legal aid and help them rebuild lives,” she tells Eos.  “Being a private shelter, we can simply admit the person seeking assistance. In government shelters, it cannot happen without a court order.”\n\nBut once the girls are out of the shelter and back into society, continues Noorani, it gets difficult to keep track of their well-being.\n\nWhile Bilal’s case proceeds through Karachi’s courts, his father — the man Bilal claimed to want to “save” — has not commented publicly. Dr Rafiq awaits trial in Malir Jail, comfortable in his cell. The Bajaur couple’s killers remain free, shielded by tribal geography and official indifference.\n\nMeanwhile, Pakistan’s legal code and social mores continue to treat lives as negotiable.\n\nAdvocates say real change requires amending Section 306 to eliminate the parent-child exemption, enforcing the 2016 law rigorously and creating a national network of state-funded shelters for at-risk women and couples.\n\nNone of these reforms appear imminent.\n\nIn Pakistan, honour remains both weapon and shield — weaponised to assert power, shielded by law and culture. Until that changes, women and men will continue paying with their lives for the crime of choosing their own.\n\nAnd their killers will continue walking free.\n\nThe writer is a freelance journalist.\nHe can be contacted at\nousatali@gmail.com. X: @AliOusat\n\nPublished in Dawn, EOS, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03200049d2c49b8.webp",
  "retrievedAt": "2025-11-03T16:17:32.442Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952567/society-the-shield-of-honour",
  "dateList": "2025-11-03",
  "date_published": "2025-11-02T01:37:54.000Z"
}
