{
  "title": "Oil trade and the global divide",
  "author": "Syed Rashid Husain",
  "content": "India is acting defiant against the US dictates on buying discounted oil from Russia. That is the public posture, as Prime Minister Modi wants to keep his macho image intact. But the reality is not that simple. India today is more than ready to compromise and, courtesy of the behind-the-scenes understanding, the two countries are reportedly close to a trade deal.\n\nPresident Trump has been urging India to stop or at least reduce importing Russian crude. Increasing tariffs on Indian goods was just one of the levers he has used. Many say that President Trump has successfully used the Pakistan card with India to pressure New Delhi into accepting US demands. His objective is to increase pressure on Moscow and make it compromise towards a negotiated deal on stopping the war in Ukraine.\n\nBut to achieve that, President Trump needs India and China to reduce, if not stop, buying crude from Russia. Strangely enough, India remains his major target. When Trump began playing his tariff cards aggressively, he slapped a 50 per cent tariff on Indian goods. This was punishment for New Delhi for buying Russian crude.\n\nFrom the US view, the current situation is unacceptable. Today, Russia is New Delhi’s largest source of oil. India’s imports of Russian oil soared from four million tonnes in FY22 to over 87m tonnes in FY25 — a massive surge by 21 times in a few years.\n\nThe US and India skirt around trade deals and tariff talks as the latter continues its reliance on Russian crude\n\nThe surge was driven by discounts offered by Russia after Western sanctions, making its crude more attractive to Indian refiners. After FY22, Russian oil averaged a 14.1pc discount in FY23 and 10.4pc in FY24, saving India roughly $5 billion a year or 3–4pc of its crude import bill.\n\nAccording to Kpler, a shipping analytics company, India imported 4.5m barrels per day (bpd) of crude in September. Of that, Russian supplies accounted for roughly 1.6m bpd — or 34pc of the total.\n\nThat represents an eye-watering 2,250pc increase from January 2022, one month before Russia launched its full-scale invasion in Ukraine. At the time, India was importing just 68,000 bpd of oil from Russia.\n\nIn 2021, Russian crude accounted for just 3pc of imports at Reliance’s Jamnagar refinery, India’s largest private facility. By 2025, that share had surged to around 50pc, data from the Centre for Research on Energy and Clean Air (CREA) underlines.\n\nCREA has also calculated that the Jamnagar refinery of Reliance exported $85.9bn of refined products globally from February 2022 to July 2025. Reliance relied mainly on discounted Russian oil to produce and export these fuel products. Incidentally, an estimated 42pc ($36bn) of that has gone to countries sanctioning Russia. And the US wants all this to stop.\n\nThe Indian public posture remains defiant. Speaking at the Berlin Global Dialogue, Indian Commerce Minister Piyush Goyal emphasised that India doesn’t sign deals with guns to the head, nor does it decide friends based on considerations other than national interest.\n\nMr Goyal added that trade deals were long-term agreements based on mutual respect and national interest, and India was in talks with the European Union (EU) and the US, but it did not work under deadlines.\n\nIn the meantime, Karoline Leavitt, the White House press secretary, has claimed India has begun scaling back Russian oil imports. Her comments came during questioning about the fresh set of sanctions Washington had imposed on Russia’s top oil companies — Rosneft and Lukoil. “We know India has done the same at the request of the President,” Ms Leavitt said at a press briefing.\n\nReliance Industries, India’s largest private oil refiner and one of the biggest buyers of Russian crude since 2022, confirmed that it is adjusting its procurement strategy to comply with recent Western restrictions.\n\nIt is now being reported that Reliance Industries has effectively halted purchases of Russian crude, following the new sanctions. In a statement issued by the company on Oct 24, it conceded that it is “evaluating the implications” of the newly announced measures and will “fully comply with EU guidance regarding the export of refined products to Europe”.\n\nSeveral other Indian refiners have reportedly begun planning a gradual cut in Russian oil purchases, a Reuters report said late in October.\n\nInterestingly, the wedge between Indian public pronouncements and behind-the-scenes promises is getting wider. In mid-October, US President Donald Trump announced that Modi had privately agreed to end those purchases “within a short period of time”.\n\nIndia, however, immediately contradicted Trump’s statement of a pledge by Modi to reduce crude imports from Russia. Randhir Jaiswal, spokesperson for India’s Ministry of Foreign Affairs, told reporters the next day that he was unaware of a conversation between Trump and Modi the previous day.\n\nFormer US and Indian officials said the split between the two countries’ messages reflects their fragile relationship. Trump, they said, is eager to declare a diplomatic victory and ratchet up pressure on Russian President Vladimir Putin, while Modi does not want to appear to cave in to American coercion.\n\nSyed Akbaruddin, India’s former ambassador to the United Nations described it as “classic pressure politics” from Trump, Megan Messerly of Politico quoted him as saying.\n\n“Delhi’s vague response is deliberate. It’s a reminder that strategic autonomy rather than alignment guides its energy choices,” Mr Akbaruddin insisted. But he interestingly conceded, “India may adjust volumes quietly, but it will not be seen as bowing to US demands. The message is clear: cooperation, yes; coercion no.”\n\nMark Linscott, a former negotiator for the US Trade Representative’s Office who was involved in negotiations with India during Trump’s first term, described it as a “delicate dance” between “the President’s desire to go public and India’s desire to keep any understanding behind the scenes, as long as they can get the 25pc penalty tariff to go away and pave the way for a trade deal”.\n\nTo protect his public image back home, Modi also cancelled his trip to Malaysia to attend the Association of Southeast Asian Nations summit — apparently to avoid any public engagement with Trump as per media reports; a purely subcontinental mindset on display.\n\nThe writer is an energy analyst and has delivered talks at the Department of Energy in Washington and the International Energy Agency.\n\nPublished in Dawn, The Business and Finance Weekly, November 3rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0307303258947a1.webp",
  "retrievedAt": "2025-11-03T12:26:18.738Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952824",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T01:33:35.000Z"
}
