{
  "title": "PAKISTAN’S CHALLENGE ON THREE FRONTS",
  "author": "Ejaz Haider",
  "content": "“The peace of heaven is theirs that lift their swords In such a just and charitable war.” — William Shakespeare, King John, Act 2, Scene 1\n\n“Civil dissension is a viperous worm That gnaws the bowels of the commonwealth.” — William Shakespeare, King Henry VI, Act 3, Scene 1\n\nFollowing the four-day May war between Pakistan and India — sparked by India’s military aggression — certain propitious events seem to have raised Pakistan’s regional and international profile and, on the surface, diminished India’s.\n\nReference to US President Donald Trump’s praise for Pakistan resulting in warmer US-Pakistan relations, lower US tariffs on Pakistani exports, Pakistan’s participation in Trump’s so-called Middle East peace plan and a strategic pact with Saudi Arabia have got most analysts to declare that Pakistan is now in a geopolitical sweet spot. This assessment requires nuance.\n\nStates inevitably respond to external stimuli, but national security — a much broader concept — cannot merely rest on fortuitous events or the immediate. It is a set of systemic objectives, pursued through a complex structure of governmental and non-governmental actors, institutions, and bureaucracies. A system-analytical approach is therefore essential to evaluate foreign policy success, moving beyond the ephemeral nature of opportunistic gains. In other words, lottery wins are about serendipity, not strategy.\n\nIn the wake of recent diplomatic wins and military successes, Pakistan appears resurgent. But beneath the surface lies the volatile reality of a state stretched thin due to hostile neighbours to the east and west, and because of deepening crises within — which have rendered Pakistan unable to retreat, yet ill-equipped to advance\n\nTHE THREE FRONT PROBLEM\n\nThe central point of this article is that, far from being in a sweet spot, Pakistan might just be in more than a spot of bother. To clarify, I don’t intend to look the gift horses in the mouth. The absence of what’s good would have made matters worse and so what’s good is always welcome.\n\nMy contention is that just like one swallow does not make summer, a few favourable developments do not mean Pakistan is out of the woods; nor do they address the country’s structural weaknesses. If anything, Pakistan is facing a three-front conflict and lacks the depth, resources and strategies to resolve these conflicts.\n\nIn the east, we have a traditional adversary; in the west, a simmering conflict has boiled over. At home, the state is now in conflict with the citizens and, in at least two parts, Khyber Pakhtunkhwa (KP) and Balochistan, the conflict has not only turned bloody but developed linkages with the conflicts in the east and west.\n\nThis is an untenable situation for any state, even one that is very powerful and resourceful. Each of the three conflicts has to be analysed not just on the basis of its own dynamics but also how and where they might interact, making the situation and its resolution more complex. It’s also important to see what necessary condition(s) must be met before the state can move to the sufficient condition(s) for such mitigation.\n\nThe caveat is that I have no panacea. The complexity of human affairs defies any attempt to quantify it in mathematical terms and quod erat demonstrandum it. Structural analyses cannot rest on prescriptions that might seem obvious but ignore the constraints the structure puts on them. It is not enough to say that if we do A, B and C, that would result in D, E and F. The real issue is why A, B and C cannot be done even when doing so offer the optimal courses of action.\n\nThat said, and before I attempt to analyse the three conflicts I have identified, let’s look into how and when a conflict can move from emergence and escalation to de-escalation and a negotiated settlement.\n\nMUTUALLY HURTING STALEMATE\n\nThe term ‘Mutually Hurting Stalemate’ (MHS) was coined by the late American political scientist I. William Zartman and was articulated in his 1985 book Ripe for Resolution: Conflict and Intervention in Africa. The concept has since been refined and written about by several other scholars of conflict resolution and has become a cornerstone of modern conflict analysis and mediation theory.\n\nAt its core, MHS describes a point in a conflict where the warring parties perceive that they cannot win through continued escalation or military means. This is a necessary, though not sufficient condition. The parties must also determine that the cost of continued conflict is becoming intolerable or is worse than the anticipated benefits of a settlement.\n\nTo this end, Zartman says perception is central: the stalemate must be perceived by the warring parties. Zartman et al also argue that an objective stalemate observed by an outside analyst or potential mediator is irrelevant if the parties continue to believe that victory is possible.\n\nPut another way, the hurting element of the stalemate must have three elements: 1) pain (the cost in human lives, economic devastation, political instability, international pressure or military attrition is high and escalating); 2) the determination that it will be unbearable in the future — ie the parties foresee that the situation is likely to get worse, not better, if the conflict continues; and 3) the “way out” — the parties must believe that a negotiated solution is possible, the other side is also feeling the pain and may be ready to talk.\n\nThis is where mediators often play a critical role. The third element was where Zartman refined his MHS framework under the Ripeness Theory (the moment is ripe) and introduced the concept of Mutually Enticing Opportunity (MEO). While MHS is often necessary to make the parties want to talk, it is not always sufficient to make them agree. The pain can drive them to the table but, once there, they need a positive vision of the future to seal a deal. That’s where the MEO comes in to complement the MHS.\n\nA successful peace process often requires both. For instance, in Northern Ireland, the MHS was the prolonged and bloody stalemate of The Troubles. The MEO was the vision of power-sharing and economic cooperation laid out in the Good Friday Agreement, which gave all parties a tangible benefit to saying “yes”.\n\nIn contrast, the Angolan civil war continued despite interventions by external powers (the US, the Soviet Union, Cuba, South Africa). The mediation efforts prevented a clear MHS from forming because the external powers would prop up their preferred side, giving them hope for victory and thus prolonging the conflict. A true MHS emerged only when these external supports wavered, forcing the parties to confront the reality of their unwinnable situation.\n\nLet’s now get to our conflicts.\n\nTHE INDIA-PAKISTAN CONFLICT\n\nI begin with the India-Pakistan conflict because, notwithstanding its complexity and historical trajectory, it is also, unfortunately, the most traditional and taken-for-granted conflict. Like eczema, it has almost become an autoimmune disorder that wavers between periods of remission, recrudescence and flare-ups.\n\nI have written about this conflict before, so I will keep it short. At the moment, there’s no MHS between India and Pakistan for two broad reasons: military and political. Being military peer competitors, neither can compel the other to change course. Decisive victories and defeats (rare occurrences, by the way) can lead to changing the status quo, as do protracted, hurting conflicts.\n\nPost-World War II, while Germany was comprehensively defeated, the victorious European powers too, especially France, were in no better condition than the vanquished. With the US-led reconstruction plan and money, the Alsace-Lorraine region, a bone of contention between France and Germany since the Franco-Prussian War of 1870-71, became the basis for cooperation and the emergence of the European Coal and Steel Community.\n\nThat situation does not obtain between India and Pakistan. Even after India defeated Pakistan in 1971, the crescendo of its military prowess against Pakistan, it did not have the capacity to defeat West Pakistan. That situation has not changed — in fact, as demonstrated by short and sharp skirmishes since 2019, Pakistan has fast closed the conventional asymmetric gap between itself and India and might even have surpassed it in certain capabilities.\n\nThe second important factor is the impact Indian Prime Minister Narendra Modi’s Hindutva-driven ideology has had on India’s domestic politics. In the 11 years that Modi has been in power, with nearly four still remaining, he has presented himself as the strong leader India always needed.\n\nThat ‘strength’ has not meant much vis-a-vis China, but it has been fully on display in relation to Pakistan. The setbacks in 2019 and 2025 have further inflamed Modi. He just cannot afford, politically and ideologically, to change course. That would be political suicide.\n\nDomestic politics, like in any International Relations system analysis, is also moot in Pakistan’s case. Given the fragility and divisiveness of internal politics and uneven civil-military relations, the May war was a godsend for the army.\n\nSince 2021 it drives a plug-in hybrid where the civilian side is the inconsequential EV for democracy-friendly suburban consolation, while the vehicle still runs primarily on the army’s internal combustion engine. Add to that the highly controversial results of the February 8 national elections and the army needed a selling point. Modi obliged.\n\nIn a bizarre confluence of domestic politicking on both sides, Modi in India and the hybrid regime in Pakistan needed a win. By the looks of it, both have got it — or at least that’s what their perception is, given the differential between the actual conflict and its projection in the media.\n\nFor now, far from experiencing a mutually hurting stalemate, the two sides believe they have the space for military modernisation, honing their operational doctrines, addressing weaknesses and bolstering strengths.\n\nFurther, and this is a bigger problem, given its bidirectional causality, rulers in both countries continue to choreograph victory orchestras for political reasons, which further shrink the space for them to move to a cooperative paradigm. This means that continued conflict has higher payoffs than peace. Corollary: the two sides are primed for another round, not for de-escalation and negotiation.\n\nIn January this year, I wrote in these pages about the history of Pak-Afghan relations and Kabul’s irredentism so I won’t go into those details.\n\nBut just to recap, Afghanistan was the only country that refused to recognise Pakistan at the formation of the new dominion as a successor state to the Government of India. Kabul argued that Pakistan’s northwest frontier “should not be recognised as a part of Pakistan until the [Pakhtuns] of that area had been given the opportunity to opt out for independence.”\n\nWhile Afghanistan withdrew the negative vote in October 1947 and both sides exchanged ambassadors in February 1948, Afghanistan’s irredentism has refused to go. Successive governments have wanted to ‘reclaim’ Pakistani territory up to the east of Indus River, what’s described in geographical terms as cis-Indus. The irredentism has continued to lurk across decades. It has re-emerged with the unelected Taliban government in Afghanistan, with various Taliban leaders calling the border a “hypothetical, imaginary line.”\n\nTwo points must be flagged: trouble between Pakistan and Afghanistan at different times has owed to Kabul’s revanchism; and Pakistan’s policy, for all its flaws, has been a response to that and an attempt to find a partner in Kabul who will recognise the border and live amicably with Pakistan.\n\nFor various reasons — details are outside the scope of this piece — that has not happened. Once again, Pakistan has failed to get Kabul to accept the border, refrain from interfering in Pakistan’s western and north-western districts through overt and covert actions, and to keep a recognised, peaceful border soft to help the tribes on both sides through positive engagement. Ironically, Kabul wants a soft line not as a border but to ingress into Pakistan, forcing Islamabad to harden the border.\n\nCross-border attacks by the self-styled Tehreek-i-Taliban Pakistan (TTP) have continued. The group now has Afghan fighters too. The Tehreek-i-Taliban Afghanistan (TTA) continues to dissemble about the presence of the TTP in Afghanistan, even though Pakistan has directly talked to the TTP in Afghanistan multiple times. The TTP’s presence in Afghanistan has also been constantly flagged by the United Nation Security Council’s 1373 Committee, which deals with counter-terrorism.\n\nRecently, when Pakistan struck targets inside Afghanistan after a major attack on security forces inside Pakistan, the TTA/TTP combine attacked Pakistani posts at multiple points along the border. This begot Pakistani retaliation, in which many TTA/TTP personnel were killed and some border posts captured. Kabul sued for a ceasefire, which Islamabad ignored until Qatar and Turkiye stepped in.\n\nTalks in Qatar resulted in a statement that failed to mention the ‘border’ or acknowledge the presence of the TTP in Afghanistan or any reference to the group and its activities as terrorism. Similar fate has befallen the round of talks in Istanbul. Kabul has rejected Pakistan’s demand for a verifiable end to the TTP’s presence and its cross-border attacks. Instead, it has threatened to mount suicide attacks in Islamabad if Pakistan strikes targets in Kabul.\n\nGiven the structures of the problem, any deal is unlikely to hold.\n\nWhat will get Pakistan out of this problem from hell: talks, war, or a combo of jaw-jaw and war-war. At best it will depend on the ebbs and flows of the problem. Use of force must translate into utility of force — in other words, simply killing and destroying someone or something means nothing unless it opens up space for a dialogue and settlement.\n\nFor reasons totally different from the threat in the east, the use of force has limited utility against Afghanistan in terms of deterring it. Afghanistan is not a state in any modern sense of a state, at least not with the Taliban at the helm. To put it in perspective, Afghanistan is not India, which is far more powerful but vulnerable, like most states, precisely because a conflict would make it (as it would any state) lose much in economic, infrastructural and military terms.\n\nOther factors being constant, deterrence works when states are configured in similar ways. It seeks to maintain the status quo between them — a state can prevent another state from undertaking an undesired action by influencing the other state’s perception of the costs, benefits and risks of an action.\n\nWhether it is deterrence by denial (convincing an opponent that he will not get his objectives should he start one) or punishment (the threat of counter-force and counter-value targeting against the adversary), the strategies require understanding the adversary’s pain points.\n\nAfghanistan is not a target-rich country. Both the TTA and TTP cadres are expendable. Ideology infuses stoic fatalism. The kind of low-intensity conflict the TTP is fighting and the TTA is supporting doesn’t really require big numbers. It can attrit without big numbers.\n\nThe TTA wants Pakistan’s tribal districts to be controlled by the TTP. TTP obliges by presenting demands that cannot be accepted by the state: 1. reversing the legislative decision to merge erstwhile Federally Administrated Tribal Areas (Fata) into KPK; 2. TTP be allowed to return to their areas with their arms; 3. all troops to be withdrawn from the area; 4. all prisoners on terrorism charges be released and allowed to return to their areas; 5. Fata to be administered on the basis of “Sharia Law”; 6. no interference by the state in Fata’s affairs.\n\nThis is classical salami slicing. The TTA wants to capture Pakistani territory through the TTP, its kinship proxy. The TTP wants to exploit the territory to creep deeper into the Pakistani heartland. This is what former Taliban ambassador to Pakistan Mullah Abdul Salam Zaeef meant when he recently said that, while Afghanistan did not have fighter jets, missiles and ground air defences, it had something that could really hurt Pakistan: ideological presence inside Pakistan.\n\nThe current dispensation has decided that it will use force if challenged. The implications of that policy or how it should be formulated are outside our present purpose. What is important to flag, however, is the upshot: like in the east, in the west too, neither side has reached an MHS. If anything, Kabul has now shaken hands with New Delhi, which further complicates the situation for Pakistan. It also incentivises India and Afghanistan to continue with the present course.\n\nResult: we will continue to see the conflict unfolding with its ebbs and flows.\n\nWe now come to the third front: internal. It has two elements: structural fragility and violence in Balochistan and Khyber-Pakhtunkhwa.\n\nStructural fragility itself contains multiple aspects — dismal Human Development Index (HDI); political instability and repression; economic woes; institutional decline; violent religio-political mobs and utter disregard for any rules of the game.\n\nI refer to HDI because, as literature tells us, it is a good indicator of the broader governance issues that result in policy failures or flip-flops and is a reflection of a country’s performance in key areas like health, education and standard of living. But there are other issues too: inequality, poverty, human security, empowerment, gender discrimination, lack of upward social mobility etc. Literature also tells us how any number of states have suffered and moved from continued fragility to failure.\n\nI don’t have to muster arguments to detail where Pakistan stands on all these indices or metrics, if you will. The data is readily available and presents a very dismal picture. Data also indicates that Pakistan, structurally, is an internally weak entity if one moves away from the shiny display of military toys and Trump’s praise of its “great leaders.”\n\nAt the most basic, Pakistan has failed to invest in human resource, the engine that drives development and innovation. This is not a conflict per se (though some would argue it is in class, gender and other terms) but it establishes the fragility of Pakistan’s present and future in no uncertain terms and impacts sustainment.\n\nPolitical instability is another structural problem, the result, according to literature, of weak institutions, colonial state structures, extractive elites, failure to integrate ethnic groups and aggregate interests. Some would even refer to a flawed state construction.\n\nPolitical instability has had its highs and lows, the nadir being the secession of East Pakistan. Much has been written about it by scholars of note. The paradox is that, while the state is structured to cause instability, its response to instability becomes repressive, creating a dispiriting cycle. At that point, the state becomes, to phrase it in Orwellian terms, like a man who takes to drinking because he feels himself to be a failure and then fails all the more completely because he drinks.\n\nPakistan has the form of democracy. It just doesn’t have the substance. The Constitution has been keelhauled multiple times. For all its flaws, the result again of political and organisational interests, it is the document that establishes the compact and gives us the succession principle through elections. But it can’t enforce what it says. That enforcement must come through a normative acceptance of its role.\n\nIn Balochistan, sub-nationalist groups are fighting the state in order to secede while the genuine political voices in the province have been sidelined and are persecuted.\n\nThe issue becomes more intractable because the groups fighting the state have got sanctuaries on contiguous foreign soils and, at least in the case of Balochistan, are also being sponsored by India, which has ramped up its sub-conventional war against Pakistan. That nexus makes it even more difficult for the state to unilaterally change its approach to dealing with these groups. This is also a point we noted above apropos of the TTA.\n\nSo where do we go from here?\n\nThe state, as currently configured, thinks it can tackle all three fronts.\n\nIt also believes that the internal front is the easiest to deal with. It can beat up protestors and even shoot at them. It can throw political leaders and dissenters in the slammer and let them rot in there. They pose no real threat because social upheavals only happen in Sri Lanka, Bangladesh and Nepal. It also believes that Balochistan is a counter-terrorism problem and it has the means to deal with it. Ditto for KP.\n\nGame theory has a term: Nash equilibrium (remember the film A Beautiful Mind, with Russell Crowe playing John Nash?). In a game, the players reach a situation in which every (or each) player will continue with their chosen strategy because none has the incentive to unilaterally deviate from it, after taking into consideration the opponent’s strategy. Whether it results in a stalemate or a mutually damaging spiral, the strategy won’t change.\n\nIf State A is going to keep its troops at the border, my best option is to also keep my troops deployed, because withdrawing would be seen as weakness and would weaken my security. State B’s thinking will be the exact same logic in reverse. As should be obvious, the best possible decision may not be an optimal outcome but the players are nonetheless locked in it.\n\nThe State of Pakistan is now in a Nash equilibrium on all three fronts. In mediaeval/Elizabethan times, fighting external enemies was a noble activity and internal dissent was a viperous worm. That’s where we are stuck.\n\nThe state needs to mitigate at least one front, the internal, but it won’t. The best possible decision is not optimal, but the effect has become the cause, reinforcing the original cause and producing the same effect in an intensified form.\n\nGiving a way out is just an academic exercise. None of the players will take it.\n\nThe writer is a journalist interested in security and foreign policies.\nX: @ejazhaider\n\nPublished in Dawn, EOS, November 2nd, 2025\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/69060a289ca6b.jpg",
  "retrievedAt": "2025-11-03T12:31:13.206Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952568/pakistans-challenge-on-three-fronts",
  "dateList": "2025-11-03",
  "date_published": "2025-11-02T01:37:54.000Z"
}
