{
  "title": "Fearing fraud, Canada rejects most Indian study permit applicants",
  "author": "Reuters",
  "content": "Canada’s clampdown on international students has hit applicants from India particularly hard, government data shows, as what was once a preferred destination loses its allure for Indian students.\n\nCanada lowered the number of international student permits it issues for the second year in a row in early 2025 as part of a broader effort to reduce the number of temporary migrants and address fraud related to student visas.\n\nAbout 74 per cent of Indian applications for permits to study at Canadian post-secondary institutions in August — the most recent month available — were rejected, compared to about 32pc in August 2023, according to immigration department data provided to Reuters.\n\nBy contrast, about 40pc of study permit applications overall in each of those months were refused. About 24pc of Chinese study permits in August 2025 were rejected.\n\nThe number of Indian applicants has dropped as well, from 20,900 in August 2023 — when Indians formed just over one quarter of all applicants — to 4,515 in August 2025.\n\nIndia has been Canada’s top source of international students over the past decade. In August, it also had the highest study-permit refusal rate of any country with more than 1,000 approved applicants.\n\nThe spike in refusals of would-be students comes as Canada and India seek to mend ties after more than a year of tension.\n\nFormer Prime Minister Justin Trudeau accused the Indian government of involvement in the 2023 murder of a Canadian in Surrey, British Columbia. India has repeatedly denied the allegations.\n\nIn 2023, Canadian authorities uncovered nearly 1,550 study permit applications linked to fraudulent letters of acceptance, most of which originated from India, Canada’s immigration department told Reuters in an email.\n\nLast year, its beefed-up verification system detected more than 14,000 potentially fraudulent letters of acceptance from all applicants, it said.\n\nCanada has implemented enhanced verification for international students and has increased its financial requirements for applicants, the immigration department spokesperson said.\n\nThe Indian embassy in Ottawa said the rejection of study permit applications from students in India had come to its attention, but that the issuance of study permits is Canada’s prerogative.\n\n“However, we would like to emphasise that some of the best quality students available in the world are from India, and Canadian institutions have in the past greatly benefited from the talent and academic excellence of these students,” the embassy said in a statement.\n\nCanada’s Foreign Affairs Minister Anita Anand told Reuters during an October visit to India that Canada’s government is concerned about the integrity of its immigration system but wants to continue having Indian students in Canada.\n\nPeople who work with would-be international students say they are seeing a higher level of applicant scrutiny.\n\nMichael Pietrocarlo of Border Pass, which helps people apply for Canadian visas, said his firm prepares applicants to show their eligibility beyond what’s required on paper.\n\nHe says, for example, when students must demonstrate they have sufficient funds to support themselves, “it’s not enough just to say, ‘Here are some bank statements.’ They may have to go the extra mile and say, ‘Here’s where the money came from.’”\n\nThe University of Waterloo, home to Canada’s largest engineering school, has seen a two-thirds decline in the number of students from India entering its undergraduate and graduate programs over the past three to four years.\n\nIan VanderBurgh, its associate vice president of strategic enrolment management, said the drop was largely due to a government cap on foreign student visas and had altered the composition of the student body.\n\n“We pride ourselves on being an international university,” he said.\n\nThe University of Regina and the University of Saskatchewan have also reported a decline in the number of Indian students enrolled.\n\nWhen Jaspreet Singh, who founded the International Sikh Students Association, came to Canada from India in 2015 to study mechanical engineering, he remembers government posters exhorting newcomers to “Study, work, stay” in the country. That attitude has soured, he said.\n\nSingh is not surprised at the higher rejection rate for Indian study permit applicants, saying he knows fraud is a concern.\n\nBut as it becomes harder to get permanent residency or a job in Canada, he says some of those recently rejected appear to not mind: “They are happy they didn’t come.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/03193841aeb7c06.webp",
  "retrievedAt": "2025-11-03T16:16:24.158Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952938/fearing-fraud-canada-rejects-most-indian-study-permit-applicants",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T14:51:54.000Z"
}
