{
  "title": "Fisherman from Pakistan arrested, coerced into carrying out tasks for Indian intelligence agency: Tarar",
  "author": "Dawn.com",
  "content": "Information Minister Attaullah Tarar said on Saturday that a fisherman from Pakistan was arrested by the Indian Coast Guard and was coerced into carrying out tasks for the neighbouring country’s intelligence agency.\n\nAddressing a press conference in Islamabad alongside Minister of State for Interior Tallal Chaudhary, Tarar said that the Indian media was creating a false narrative in the aftermath of the four-day May conflict with Pakistan.\n\nThe minister said that law enforcement agencies had recently apprehended a fisherman named Ijaz Mallah while he was out fishing in the sea.\n\n“In September this year, when he was out fishing, he was arrested by the Indian Coast Guard and after the arrest, he was taken to an undisclosed location and was coerced and forced to do some tasks for the Indian intelligence agency,” he said.\n\n“He was told that he would be compensated and if he did not comply, he would have to stay imprisoned for two to three years,” the minister said.\n\n“So this common fisherman was eventually released by the Indian intelligence agency and was sent to Pakistan on a task to procure certain things … which included uniforms of the Pakistan Navy, the Pakistan Army and of Sindh Rangers,” he added.\n\n“He was tasked to procure uniforms with certain nametags, and certain fittings and measurements because this was part of a bigger plan of the Indian intelligence agency to launch a propaganda warfare against Pakistan,” Tarar said, showing pictures of items allegedly recovered from the fisherman.\n\nThe minister said that Pakistan’s intelligence agencies were well-equipped to deal with any situation, and put the fisherman in question under surveillance while he tried to procure the items.\n\n“While he was under surveillance, our law enforcement agencies were fully alert and following his trail. He was also told to get Pakistani currency, cigarettes, match boxes, lighters and was asked to specifically procure Zong SIM cards,” he said.\n\n“He procured all these items and he was on his way to India when law enforcement agencies apprehended him from the sea, arrested him and took these items into custody,” the minister said.\n\n“Let me make it very clear that Pakistan intelligence agencies and security agencies are always fully alert and diligent in their duty […] and ready to foil any conspiracy,” Tarar said, after playing a purported video of the arrested fisherman.\n\nThe minister noted, “This particular activity could be linked to the naval exercise being carried out by the Indian navy in the Kutch or Gujarat area, the Bujh area. Maybe this was a conspiracy to link this activity to those exercises. This is one possibility.”\n\nHe added that the government was placing the evidence before the entire world so India’s “nefarious designs could be exposed”.\n\nTarar highlighted that not only were the said items recovered, but the man’s statement was “legally on record”.\n\n“This is part of a greater plan by India to malign Pakistan and to use such propaganda items and disinformation and misinformation, and we have been very active countering the misinformation and disinformation by the Indian media and Indian state,” the minister said.\n\n“Now this is a glaring example of the extent the Indian state is going to to malign Pakistan because they are not able to digest the successes of Pakistan,” he said.\n\n“So this is the kind of propaganda warfare that they resort to, and detailed investigations have been carried out,” he said, adding that Mallah had also confessed to his crimes.\n\nThe information minister also highlighted that whenever state elections are about to take place in India, they “try to prepare for those elections well in advance”. He termed the arrest and the foiling of the “conspiracy” a big success for Pakistan’s security agencies.\n\n“After Kulbhushan Yadav, they are now resorting to common fishermen because they can’t risk sending their commissioned officers in the guise of businessmen,” Tarar quipped, referring to an Indian spy caught in 2016 in Balochistan.\n\n“After this fisherman was caught, maybe they will lower their level further because their capacity will no longer be there to penetrate inside Pakistan,” he added.\n\nThe press conference also included foreign media correspondents. After Tarar, Chaudhry briefed the media on the incident’s details in Urdu.\n\nHe also said that Pakistani agencies had evidence of the transactions worth “RS95,000” that took place between Indian officials and the fisherman. It was unclear whether Chaudhry was referring to Indian or Pakistani rupees.\n\nThe minister of state urged the public to remain vigilant and not be used by someone under pressure or out of greed.\n\nDuring the press conference, the ministers also played an audio recording allegedly of Mallah and his “Indian handler”, which was recovered via forensics of the fisherman’s mobile phone.\n\nIn the purported audio, the person tells Mallah to secure two sets each of uniforms worn by the Sindh Rangers, the Pakistan Navy and the Pakistan Army. He also says he had specified “six names” — two from each of the three security branches — for nametags that Mallah was supposed to procure.\n\nThe minister then proceeded to play a purported video of the fisherman, in which the man said he was apprehended by the Indian coast guards when he went fishing in August this year.\n\nIn the video, the man identified as Mallah detailed that he hailed from the Shah Bandar taluka of Sindh’s Thatta district, with fishing being a family profession.\n\n“After catching me, they (Indian coast guards) took me to a jail in an undisclosed location, where I was interrogated by an Indian secret agency’s official,” he said.\n\nThe man added that the Indian official told him he could face two to three years in jail for the offence he was held. “He (the official) told me that if I worked for them, then they could let me go,” Mallah said.\n\n“He also offered me money and gifts, so due to the fear of jail and for the reward, I accepted the offer … then he told me that bring so and so items, some uniforms of Rangers, coast guard, the navy and the army,” he added.\n\n“We also need three Zong SIMs, bring those, and three bills from a mobile shop,” the fisherman quoted the Indian official as saying. The official also instructed him to bring Pakistan-made cigarettes, match boxes and lighters, as well as currency notes of Rs50 and Rs100, Mallah added.\n\nThe fisherman said he was set free by the Indian agency, after which he returned to Pakistan and collected the said items. He claimed he sent a picture of those items to an Indian intelligence officer named Ashok Kumar.\n\n“After that, I headed towards the sea in October but was arrested by Pakistani security and other individuals with them,” Mallah said.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01195541834d703.webp",
  "retrievedAt": "2025-11-03T12:31:07.488Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952553/fisherman-from-pakistan-arrested-coerced-into-carrying-out-tasks-for-indian-intelligence-agency-tarar",
  "dateList": "2025-11-03",
  "date_published": "2025-11-01T10:41:10.000Z"
}
