{
  "title": "Christian, Muslim Nigerians push back on threatened US strikes",
  "author": "AFP",
  "content": "Nigerians across the religious spectrum pushed back Monday on US President Donald Trump’s threats of military intervention over the killing of Christians in the country.\n\nAfrica’s most populous country, which is roughly evenly split between a mostly Christian south and Muslim-majority north, is home to myriad conflicts, which experts say kill both Christians and Muslims without distinction.\n\nClaims of Christian “persecution” in Nigeria have found traction online among the US and European right in recent weeks.\n\n“Christians are being killed, we can’t deny the fact that Muslims are (also) being killed,” Danjuma Dickson Auta, a Christian and community leader, told AFP.\n\nTrump said on social media over the weekend that he had asked the Pentagon to map out a possible plan of attack.\n\nAsked by an AFP reporter aboard Air Force One if he was considering putting US troops on the ground or using air strikes, Trump replied: “Could be, I mean, a lot of things — I envisage a lot of things.”\n\n“They’re killing the Christians and killing them in very large numbers,” he said Sunday. “We’re not going to allow that to happen.”\n\nAuta, 56, hails from Plateau state, where Christians and Muslims have long lived side by side.\n\nThe state has also seen explosions of violence — including deadly sectarian riots in the capital Jos in 2001 and 2008.\n\nIn recent years, Plateau and other states in Nigeria’s “Middle Belt” have suffered deadly clashes between mostly Christian farmers and Fulani Muslim herders over dwindling land and resources.\n\nThe conflict has often resulted in massive death tolls on the side of the farmers, with entire villages razed.\n\nSmaller-scale attacks on herders — including retaliatory killings of random ethnic Fulanis or their cattle — often generate fewer headlines in both the local and international press.\n\nThough the violence often falls across ethnic and religious lines, experts say the root causes lie in poor land management and policing in rural areas.\n\nWords like “genocide” have been thrown around by those in Plateau frustrated by the escalating violence, though typically in ethnic, not religious terms.\n\nClaims of a “Christian genocide”, meanwhile, have been pushed in recent years by separatist groups in the southeast.\n\nUS-based firm Moran Global Strategies has been lobbying on behalf of separatists this year, advising congressional staff on what it said was Christian “persecution”, according to disclosure forms.\n\nNigeria also faces a long-running jihadist conflict in its northeast, and “bandit” gangs in the northwest who conduct kidnappings and village raids.\n\nThe north’s population is mostly Muslim — meaning most of the victims are, too.\n\n“Even those who sold this narrative of Christian genocide know it is not true,” said Abubakar Gamandi, a Muslim who heads a fishermen’s union in Borno state, the epicentre of the Boko Haram conflict.\n\nChukwuma Soludo, the Christian governor of Anambra state, also pushed back against US intervention, saying Washington “must act within the realm of international law”.\n\nOthers have used the controversy to point out long-festering insecurity in the country, and Trump’s rhetoric has resonated with some in Nigeria.\n\nReverend Joseph Hayab, chairman of the Christian Association of Nigeria for the country’s north, said he rejected the framing of “farmer-herder violence” and called Trump’s comments a “wake-up call”.\n\n“People are twisting the story as if Trump said he is coming to fight Nigeria. No, he is coming to deal with terrorists,” he told AFP.\n\nAmid Trump’s ratcheted-up rhetoric, the Nigerian presidency suggested a meeting between the two leaders to resolve the issue.\n\nDaniel Bwala, spokesman for Nigerian President Bola Tinubu, said, “Donald Trump has his own style of communication”.\n\nBwala suggested to AFP Sunday that Trump’s post was a way to “force a sit-down between the two leaders so they can iron out a common front to fight their insecurity”.\n\nTrump previously attacked South Africa over what he called a “genocide” against its Dutch-descended Afrikaner community, and has offered them refugee status.\n\nCritics of the president said the rhetoric was part of Trump’s hardline diplomatic strategy.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/031900320160fae.webp",
  "retrievedAt": "2025-11-03T16:16:13.598Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952933/christian-muslim-nigerians-push-back-on-threatened-us-strikes",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T14:01:12.000Z"
}
