{
  "article_id": "2025-01-30_dc352617d5d2732a0fdefa84f487d4bb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cold-and-dry-weather-to-prevail-in-most-parts-light-rain-snow-expected-in-upper-regions/",
    "retrieved_at": "2025-08-27T12:13:06.752Z"
  },
  "metadata": {
    "title": "Cold and dry weather to prevail in most parts; light rain/snow expected in upper regions",
    "author": null,
    "date_published": "2025-01-30T14:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 198,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 30 (APP):Cold and dry weather is expected to persist across most plain areas of the country on Friday, according to the Pakistan Meteorological Department (PMD). While upper regions, including Khyber Pakhtunkhwa, Gilgit-Baltistan, and Kashmir, may witness partly cloudy conditions with light rain and snowfall at isolated places. A westerly wave is currently affecting the upper parts of the country, bringing slight precipitation in some areas. Cold and dry conditions prevailed in most parts during the past 24 hours, with very cold temperatures recorded in hilly areas. Light rain and snowfall occurred in upper Khyber Pakhtunkhwa and Gilgit-Baltistan. The rainfall recorded during this period included 11mm in Dir (Upper), 3mm in Kalam and Mirkhani, 2mm in Kakul, and 1mm in Saidu Sharif and Mardan. In Gilgit-Baltistan, Bagrote received 3 mm of 1e. The snowfall was recorded at 04 inches in Kalam and 01 inch in Malam Jabba. The lowest minimum temperatures recorded today were -09 C in Leh, -06 C in Skardu, -05 C in Kalam and Gupis, and -03C in Parachinar, Malam Jabba, Astore, Bagrote, and Kalat. The PMD has advised residents in hilly areas to prepare for cold conditions and possible disruptions due to snowfall.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}