{
  "article_id": "2025-01-30_6d5bfdcad524b31aaf0877f698731ac0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/naqvi-pays-tribute-to-martyred-soldiers-in-nw/",
    "retrieved_at": "2025-08-27T12:14:44.721Z"
  },
  "metadata": {
    "title": "Naqvi pays tribute to martyred soldiers in NW",
    "author": null,
    "date_published": "2025-01-30T08:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 30 (APP):Federal Interior Minister Mohsin Naqvi on Thursday paid a heartfelt tribute to Major Hamza Israr and Soldier Muhammad Naeem, who embraced martyrdom while bravely confronting extremist terrorists in North Waziristan. The security forces successfully neutralized six terrorists in the operation, dealing a major blow to their nefarious plans. Naqvi acknowledged the supreme sacrifice of the fallen soldiers, stating, \"Major Hamza Israr and Soldier Muhammad Naeem laid down their lives for the peace of our homeland. Their bravery is a source of immense pride for the entire nation.\" He further emphasized that the sacrifices made by security personnel in the fight against terrorism would never be forgotten. \"The entire nation salutes the great sacrifice of our martyrs. These brave sons of the soil have become immortal by giving their lives for the country,\" he said. Expressing solidarity with the families of the martyrs, Naqvi assured them of the nation's unwavering support. \"We stand with the families of the martyrs in this difficult time,\" he stated. He also commended the security forces for eliminating six terrorists in the operation. \"The security forces have once again proven their commitment by thwarting the evil designs of extremist terrorists. The nation stands shoulder to shoulder with its defenders,\" Naqvi remarked. Pakistan's security forces continue their relentless efforts to root out terrorism, ensuring peace and stability in the region. The sacrifices of heroes like Major Hamza Israr and Soldier Muhammad Naeem will forever be remembered in the annals of history.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}