{
  "article_id": "2025-01-30_98e2a39839745c61be18d8f59043585b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-determined-to-eradicate-polio-pm/",
    "retrieved_at": "2025-08-27T12:12:37.446Z"
  },
  "metadata": {
    "title": "Govt determined to eradicate polio: PM",
    "author": null,
    "date_published": "2025-01-30T14:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 211,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 30 (APP):Prime Minister Shehbaz Sharif Thursday that the government was determined to eradicate polio and appreciated the administration of all provinces for the timely identification of the polio cases and for the recent decrease in their incidence. He was chairing a review meeting regarding the anti-polio campaign. He said since September 2024, the downward trend in the polio cases was evidence of the effectiveness of the anti-polio campaign. He said the decrease in polio cases in all provinces was made possible due to the untiring efforts of the administration of the provinces. He said the complete erasure of polio from the country became possible only with the cooperation between the federal government and provinces. The prime minister was informed about the progress made in the anti-polio campaign. The anti-polio campaign was continuing in the provinces with great momentum. The meeting was told that at the start of 2025, clear reduction was seen in the polio cases in the polio affected districts in Balochistan, Sindh and northern Khyber Pakhtunkhwa. All aspects of the polio campaign were being continuously monitored with an IT dashboard. Coordinator to the Prime Minister on National Health Services Dr. Mukhtar Ahmad Bharath, Senator Ayesha Raza Farooq and high level officials of departments concerned attended the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}