{
  "article_id": "2025-01-30_ceb286c1f7d2659f5b9d55573fbc7cb4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-cabinet-ratifies-me-green-initiative-charter-to-restore-200-mln-ha-land-plant-50-bln-trees/",
    "retrieved_at": "2025-08-27T12:13:24.133Z"
  },
  "metadata": {
    "title": "Federal cabinet ratifies ME Green Initiative charter to restore 200 mln ha land, plant 50 bln trees",
    "author": null,
    "date_published": "2025-01-30T13:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 470,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 30 (APP):The federal cabinet on Thursday ratified the charter of the Middle East Green Initiative that would enable restoration of 200 million hectares of land and plantation of 50 billion trees. The federal cabinet meeting was chaired by Prime Minister Muhammad Shehbaz Sharif held here at the Prime Minister House, a PM Office news release said. During the meeting, the officials of the Ministry of Climate Change informed the forum that Pakistan was among the founding members of the Charter and therefore the Ministry had recommended the forum to accord its approval. The cabinet approved the Off-the-Grid Captive Power Plants Levy Ordinance 2025 on the recommendation of the Petroleum Division. The forum was briefed on the statement made in Parliament in 2020 regarding the pilots of Pakistan International Airlines. The meeting was informed that the statement made by a former federal minister regarding the pilots of Pakistan International Airlines was irresponsible and exaggerated, which not only severely affected the image of the country and the national airline, but also caused serious damage to the national exchequer. The cabinet approved the formation of a fact-finding committee to review the said statement, which would probe motives behind it and also estimate the loss caused to the national airline. The federal cabinet approved the agreement between the Government of Pakistan and the European Union on the recommendation of the Ministry of Commerce regarding the distribution of tariff rates quota. The federal cabinet approved the reorganization of Accountability Court-III, Islamabad and its conversion into Special Court (CNS-III), Islamabad, on the recommendation of the Islamabad High Court and the proposal of the Ministry of Law and Justice. The federal cabinet also approved the additional charge of Chairman Karachi Port Trust, Rear Admiral Habib-ur-Rehman, for a maximum of two months. Prime Minister Shehbaz directed to complete the process of appointing a regular Chairman of Karachi Port Trust immediately. The federal cabinet approved a 25 percent reduction in the provincial quota in medical and dental colleges managed by the federal government. The initiative was taken in the context of extremely low quota for students domiciled in the Islamabad Capital Territory in provincial medical and dental colleges so that students domiciled in Islamabad could get better opportunities for education in such institutions. The federal cabinet, on the recommendation of the Rightsizing Committee of the federal government, has approved an amendment to the Rules of Business, 1973 regarding the merger of the Ministry of Kashmir Affairs and Gilgit-Baltistan and the Ministry of Frontier Affairs. The federal cabinet has ratified the decisions taken in the meeting of the Cabinet Committee on State-Owned Enterprises held on January 17, 2025. The federal cabinet also ratified the decisions taken in the meeting of the Cabinet Committee on Legislative Cases held on December 17, 2024 regarding amendments to the Citizenship Act, 1952.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}