{
  "title": "President for making PWDs equal, productive citizens of society",
  "link": "https://www.app.com.pk/national/president-for-making-pwds-equal-productive-citizens-of-society/",
  "date_published": "2022-12-24T15:39:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 24 (APP): President Dr Arif Alvi has stressed the need for making concerted efforts to improve the accessibility and inclusion of Persons with Disabilities (PWDs) into the mainstream of society so as to make them equal, productive, and active citizens of the country.\nThe president expressed these views during an interactive session with persons with disabilities (PWDs), organized by the World Health Organization (WHO) here on Saturday.\nWhile speaking on the occasion, the president underlined the need to enhance the inclusion of PWDs in all fields of life, besides providing them with education and employment opportunities in mainstream institutions.\nHe said that persons with hearing, visual, physical, and mental disability could be imparted formal education in schools.\nDr. Alvi urged for bringing in attitudinal changes towards PWDs at individual and societal levels to make them feel more welcome in society.\nHe said that globally the attitudes towards PWDs were changing and they were increasingly being facilitated and included in all streams of life, whereas Pakistan lagged behind in terms of the participation of PWDs in different activities.\nHe said that PWDs needed to be given jobs as per their quota and PWDs with mild and severe forms of disability also needed to be accommodated as per their abilities and skills in different jobs.\nHe further said that media had a special role to play in eliminating discrimination, negative stereotypes, and social taboos against PWDs, besides enhancing their acceptance in society.\nThe president said that in Pakistan there was a lack of correct data about the number of PWDs , however, as per different estimates they were more than 10% of our population.\nHe urged the NGOs and Sindh government to come up with solid documents, wherein Sindh Building Control Authority (SBCA) was bound by any law to make the public buildings accessible for PWDs.\n“No building should be made clear until it caters specific provisions for PWDs,” he remarked. He also referred to the codification of CDA in this regard.\nFirst Lady Begum Samina Arif Alvi, while talking to the participants, emphasized the need to make society more inclusive, provide Assistive Technology to PWDs, ease their registration with NADRA through one-window and online operations, fulfill job quota, and educate them in mainstream educational institutions.\nSindh Governor Mohammed Kamran Khan Tessori said that the spirit of mainstreaming PWDs must be inculcated in academia and public-private stakeholders should be encouraged to ensure inclusive education and employment in our society.\nHe thanked President Dr. Arif Alvi and First Lady Begum Samina Alvi for spearheading awareness on breast cancer and disabilities.\nThe interactive dialogue was attended by the representatives of Sindh department for persons with disabilities, different private organizations, chambers of commerce and industry, etc.",
  "retrievedAt": "2025-08-11T16:03:40.144Z"
}
