{
  "title": "Pakistan plays role to avert humanitarian crisis in Afghanistan: Dr Shahzad",
  "link": "https://www.app.com.pk/national/pakistan-plays-role-to-avert-humanitarian-crisis-in-afghanistan-dr-shahzad/",
  "date_published": "2022-02-07T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 07 (APP): Leader of the House in the Senate Dr Shahzad Waseem Monday said that Pakistan was playing a role of responsible and peace-loving nation to mitigate sufferings of the people of Afghanistan by making serious efforts to avert humanitarian crisis there.\nResponding to a motion moved by Senator Mushtiaq Ahmed to discuss the rapidly developing humanitarian crisis in Afghanistan and Pakistan’s role for regional peace/security and to avert humanitarian crisis in Afghanistan, he said Pakistan always gave a strong message that the people of Pakistan and the government were with the people of Afghanistan.\nHe said Pakistan along with friends and regional countries, played a proactive role to overcome the humanitarian crisis in Afghanistan after withdrawal of foreign military troops from the war-torn country.“Recognizing Afghanistan is another issue, but we need to engage Afghanistan just to end the sufferings of the people of Afghanistan,” he added.\nThe Leader of the House said that Pakistan had a very clear stance that the people of Afghanistan should be provided complete assistance by the international community for peace and stability in the country.\nHe said Pakistan was enjoying historical, religious, political, traditional and humanitarian relations with Afghanistan, paying tribute to the Afghans for standing firmly against all kinds of aggression. The enemies of Pakistan were trying to create a law and order situation, but Pakistan’s armed forces were fully capable of thwarting their nefarious designs, he added.\nDr Shahzad said the new regime in Afghanistan had ensured that it would now allow anyone to use its soil against any country.\nCommenting on the recent visit of Prime Minister Imran Khan to China, the Leader of the House said all goals of the visit had been achieved.\nHe said recent incidents of terrorism were meant to dent Pakistan’s image abroad especially when Prime Minister was scheduled to visit China where a host of issues including strategic, economic and CPEC-related matters were to be discussed.\nHe vowed that Pakistan would not fail nefarious designs of such elements but also continue moving on the consistent path to development and prosperity.",
  "retrievedAt": "2025-08-11T14:16:27.822Z"
}
