{
  "article_id": "2025-04-18_796862850c23339f6f1596ea981bba9a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-govt-to-prioritize-balochistan-in-upcoming-psdp-ahsan-iqbal/",
    "retrieved_at": "2025-08-27T14:39:05.934Z"
  },
  "metadata": {
    "title": "Federal govt to prioritize Balochistan in upcoming PSDP: Ahsan Iqbal",
    "author": null,
    "date_published": "2025-04-18T14:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 269,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA, Apr 18 (APP):Federal Minister for Planning, Development Ahsan Iqbal, along with Balochistan Chief Minister Mir Sarfraz Bugti, announced on Friday that federal government would prioritize and allocate funds for the development of Balochistan in the upcoming Public Sector Development Programme (PSDP). Speaking at a joint press conference, Iqbal emphasized that equal development across all provinces is vital under the \"Uraan Pakistan\" initiative, which aims to transform Pakistan's economy into a trillion-dollar economy. \"After the 18th Amendment, provinces have autonomy. Now it's time they play a crucial role in Pakistan's economic takeoff,\" he said. Iqbal highlighted Balochistan's strategic importance and vast mineral wealth, claiming the province could become the richest in the country if its resources are properly utilized. He stressed the potential of the Kachhi Canal to turn Balochistan green and committed to align all development projects with the needs of the common man. The minister also announced that key infrastructure projects, including the Quetta-Zhob-D.I. Khan and Quetta-Karachi highways, would be expedited to boost regional connectivity and economic growth. He praised CM Sarfraz Bugti's leadership and termed Balochistan a core partner in the Uraan Pakistan initiative. Chief Minister Bugti said that the provincial government will work hand-in-hand with the federal government to complete projects aimed at uplifting the people of Balochistan. Replying to a question, Ahsan Iqbal condemned recent acts of terrorism designed to hinder development in the province, noting the tragic loss of 43 Frontier Works Organization (FWO) personnel on the construction of Gwadar Road. \"Terrorists are targeting teachers, laborers, and civilians but we will defeat their agenda,\" he declared, adding that unity is essential for progress.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}