{
  "article_id": "2025-04-18_4a715e992b098d5a46f1951e69962e88",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-ready-for-fourth-take-off-emphasizes-for-political-stability-ahsan-iqbal/",
    "retrieved_at": "2025-08-27T14:37:04.315Z"
  },
  "metadata": {
    "title": "Pakistan ready for ‘Fourth Take-Off’, emphasizes for political stability: Ahsan Iqbal",
    "author": null,
    "date_published": "2025-04-18T13:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 779,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "QUETTA, Apr 18 (APP): Federal Minister for Planning and Development Ahsan Iqbal on Friday said that Pakistan is prepared for its \"fourth take-off\" towards progress, strengthening economy, enhancing exports and emphasized the need for national unity, political stability, and consistent policies to ensure sustainable development. Speaking at the \"Uraan Pakistan\" provincial consultative workshop in Quetta, organized by the Ministry of Planning, Ahsan Iqbal said that Pakistan had previously suffered due to political turmoil. He urged the nation to play active role for the development to strengthen the economy in order to make the country as economic hub. He announced that the federal government, in collaboration with the Balochistan government, will modernize infrastructure, education, healthcare, agriculture, and mining sectors under the Uraan Pakistan 2035 vision. The aim, he said, is to lift the people of Balochistan out of darkness and into the light of development. Through the \"Uraan Pakistan\" initiative, the federal government aims to bring the people of Balochistan out of the darkness of backwardness into the light of progress. He said stressed to identify and address the root causes of the problems facing by the country, and maintained law and order, political stability, and continuity of policies, the country would become one of the world's leading economies. Chief Minister of Balochistan Sarfaraz Bugti and provincial ministers, parliamentarians and officials were present at the event. Ahsan Iqbal appreciated the organizing of the provincial consultative workshop for Uraan Pakistan. Under the Uraan Pakistan 2035 plan, the goal is to make Pakistan's economy worth trillions of dollars. Highlighting past achievements, Iqbal recalled the progress made from 2013 to 2018, including the end of 18-hour electricity shortage, improved law and order, and the construction of hundreds of kilometers of roads in Balochistan. he said there was no proper road linking from Gwadar to Quetta in the past,\" he said. \"Now, improved connectivity has boosted local business and employment.\" Ahsan Iqbal paid tribute to the sacrifices made by security personnel during development projects, especially those who lost their lives in terrorist attacks while constructing roads in the province. \"Terrorists oppose such projects because they fear an educated and aware society,\" he said. The vision for 2035 includes reforms in education, health, infrastructure, agriculture, and the environment in Balochistan. The province has huge mineral potential. The federal government is educating locals so they can contribute to their province's development. Ahsan Iqbal stressed that Balochistan has immense mineral potential and that the federal government is committed to educate local youth so they can contribute to the province's growth. He also mentioned that the PML-N government in the previous tenure, has been allocated 5,000 scholarships for Balochistan and merged districts and international scholarships for Balochistan's lawyers. \"Political instability has held Pakistan back,\" Iqbal added. \"No country can progress without continuity of policies.\" The minister highlighted that in 2022, Pakistan avoided default due to 16 months of decisive governance. \"The Pakistan Stock Exchange index jumped from 40,000 to over 115,000 points a historic rise.\" Discussing future goals, he noted that the Uraan Pakistan vision aims to turn Pakistan into a trillion-dollar economy. \"Every ministry, province, and citizen must embrace this vision,\" he said. He also emphasized the importance of increasing exports and enhancing human resource development. Among key projects, Iqbal pointed to the expansion of the Chaman-Quetta-Karachi highway, integration of Gwadar into the national grid, promotion of renewable energy in Balochistan, and targeted development in the 11 most underdeveloped districts of the province. He added that Gwadar Port is the gateway for exports. Balochistan's strategic location plays a vital role in Pakistan's export logistics. The Reko Diq project is a significant milestone as it's the first drop, and investment will continue to flow into the country. \"Balochistan will become a prosperous province. Both the federal and provincial governments are equipping youth with IT skills. Gwadar is being linked to the national grid. Energy development in Balochistan is a top priority. The Prime Minister's vision is to make the Chaman-Quetta-Karachi highway dual carriageway. Road infrastructure will bring prosperity to the province,\" he added. \"The federal and provincial governments are working together to eliminate Balochistan's backwardness, Ahsan Iqbal said adding that out of the country's 20 most underdeveloped districts, 11 are in Balochistan. He said that targeted efforts will be made for the development of these districts. In the future, the greatest reliance will be on human resources. Under Uraan Pakistan, a health project worth Rs 64 billion aims to make Pakistan hepatitis-free. Around 38 to 40 percent of children suffer from stunted growth, he said and stressed that efforts would be taken urgently for the ensuring of balanced nutrition to overcome this issue and become a developed nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}