{
  "article_id": "2025-04-18_068b451401f0a8118024e06386cec2f0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mou-signed-for-holding-kps-largest-student-olympiad-at-fast-university/",
    "retrieved_at": "2025-08-27T14:37:56.240Z"
  },
  "metadata": {
    "title": "MoU signed for holding KP’s largest student olympiad at FAST University",
    "author": null,
    "date_published": "2025-04-18T10:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 529,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR, Apr 18 (APP):Metrix Pakistan and the Peshawar campus of the National University of Computer and Emerging Sciences (FAST-NUCES) have signed a memorandum of understanding (MoU) to jointly organise NUTEC 2025, a three-day student olympiad scheduled to take place at the varsity on May 2, 3 and 4. The MoU was signed by Director of Metrix Pakistan, Mohib Malik, and Faculty Head at FAST University Peshawar, Usman Abbasi. The signing ceremony was also attended by Rohail Iqbal, President of NUTEC 2025, along with members of the faculty and student body. Described by organisers as the largest student olympiad in Khyber Pakhtunkhwa, NUTEC aims to bring together students from across the country to participate in a wide range of competitions and cultural events. This year's edition will feature contests in software engineering, mobile app development, artificial intelligence, coding, and web technologies. Key competitions and prize amounts include a Software Engineering Quiz with a prize of Rs20,000, a Build with AI Hackathon offering Rs25,000, a Mobile App Development contest with Rs30,000 for the winning team, a Coding Competition with a prize of Rs15,000, and a Web Competition that carries the highest prize of Rs75,000. In addition to the competitive activities, the event will host a job fair, with national and local companies invited to recruit fresh graduates and early-career professionals. Organisers said the fair would serve as a bridge between academia and industry, providing real-time employment opportunities for participants. The olympiad will also include a Qawwali night, a live stream of TEDx talks, and a musical concert - elements that, according to organisers, reflect the event's focus on combining innovation with cultural expression. Speaking on the occasion, Metrix Pakistan Director Mohib Malik said the collaboration was aimed at creating a platform where young people could demonstrate their skills while gaining exposure to practical career paths. \"NUTEC is not just a set of competitions - it is a comprehensive platform that promotes innovation, leadership, and inclusion. This partnership with FAST University is rooted in our shared belief in empowering youth and building a more connected, opportunity-rich ecosystem,\" he said. Usman Abbasi of FAST University said the varsity was committed to nurturing talent and providing students with experiences that go beyond the classroom. \"Our goal is to ensure students are equipped not only with academic knowledge but also with real-world readiness. With Metrix Pakistan's support, we are scaling this event to new heights,\" he said. This marks the second consecutive year that Metrix Pakistan has partnered with FAST University for the olympiad. Last year's edition, also co-organised by the two institutions, attracted widespread participation and was praised for its inclusivity and scale. Metrix Pakistan is a youth-based organisation working across rural and underserved regions of Khyber Pakhtunkhwa. It is considered one of the country's leading platforms for promoting entrepreneurship, digital education, and youth empowerment. FAST University Peshawar, part of the NUCES network, is recognised for its academic rigour in computer sciences and emerging technologies. The varsity has become known for hosting events that foster creativity, critical thinking, and student-led initiatives. Officials said they expect this year's NUTEC to host a record number of participants, with registration already underway across campuses and institutions nationwide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}