{
  "title": "BISP to expand scope of country’s largest nutrition programme",
  "link": "https://www.app.com.pk/national/bisp-to-expand-scope-of-countrys-largest-nutrition-programme/",
  "date_published": "2024-09-03T10:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP):In order to combat malnutrition, Benazir Income Support Programme (BISP) has planned to expand the scope of Benazir Nashonuma initiative which is the country’s largest nutrition programme.\nIn this regard, BISP has signed a two-year agreement with the World Food Programme (WFP) in a ceremony held at Rome to extend the Benazir Nashonuma Programme which is also one of the major government-funded initiative in WFP’s history.\nAccording to an official source, this partnership strengthens BISP’s commitment to combat malnutrition in Pakistan, providing essential support to over four million pregnant women, breastfeeding mothers, and children less than two years of age.\nThe initiative will help build a healthier future for Pakistan’s children through collaborative efforts. World Food Programme (WFP) has been the lead implementing partner for Benazir Nashonuma initiative since its inception.\nBenazir Nashonuma initiative aims at addressing stunting among pregnant and lactating women (PLW) and their children less than two years of age through the provision of additional cash of Rs. 2,500 per quarter per PLW and boy child each and Rs. 3,000/- per quarter per girl child of BISP beneficiary families. While Rs.1500/ are given to the girls aged between 15-19 years.\nFor the flood affected areas, Rs. 3500 are given to per PLW and boy child each and Rs. 4000 for girl child. In return, mothers are required to attend regular antenatal health checks and awareness sessions during pregnancy, consume specialized nutritious food (SNF), and take their children for immunization and regular health checks.\nAccording to the statistics, Pakistan’s high rates of malnutrition (40.2 percent stunting, 28.9 percent underweight, and 17.7 percent wasting) are indicative of an ongoing child nutrition crisis.\nThe first 1,000 days of a child’s life are a window of opportunity to lay a strong foundation for later achievements. This time frame is a period of enormous change characterized by a high degree of plasticity in the child’s neurological development. Investments in the early years of life are the foundation of human capital, and human capital is a key driver of economic development in the modern economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:43:32.051Z"
}
