{
  "title": "KE’s first 220 MW solar-wind RE project secures 7 bids",
  "link": "https://www.app.com.pk/national/kes-first-220-mw-solar-wind-re-project-secures-7-bids/",
  "date_published": "2024-09-03T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP):K-Electric (KE), Pakistan’s only private electric utility, is building momentum towards doubling its solar capacity by adding clean energy into its generation mix.\nAfter breaking ground earlier this month with a total of 15 bids for 150MW solar power projects in Balochistan, KE has made yet another stride in the by receiving seven bids for its 220 MV site neutral hybrid project in Dhabeji, Sindh, said a press release issued on Tuesday .\nThis project is the first in Pakistan to integrate solar and wind energy for improved operational and financial efficiency. These unique specifications also made this project technically demanding. Therefore, the resounding investor interest is another outstanding success in the transition towards renewable energy.\nThe 220 MW project is part of the first tranche of KE’s ambitions. These renewable projects align seamlessly with NEPRA’s vision and directives to induct renewables, reduce generation costs, and gradually eliminate expensive imported fuel sources.\nThe tenders’ capacity has already been included in KE’s Power Acquisition Programme (PAP) that was submitted to NEPRA in early 2023 and will serve as a cornerstone for the utility’s long-term strategy to integrate renewables in the generation mix.\nFurther two projects in Karachi 120 MW project at Deh Halkani, and a 150 MW project at Deh Metha Ghar the deadline is slated for the end of September 2024 for which prequalification has already been conducted.\nSharing his views on the achievement, Moonis Alvi CEO KE said, “As of now, K-Electric’s renewable energy projects at Winder and Bela in Balochistan, and the latest one in Dhabeji, Sindh, totaling to 370 MW have received 2690 MW in offers”.\nHe said the site neutral hybrid project is in continuation of our milestones and testifies the investor confidence in K-Electric, as well as Pakistan’s growing potential. “We are indebted to NEPRA for continued support throughout the procurement process. We deeply appreciate all investors sharing the same vision and commitment to strengthening energy security, a testament of economic recovery and confidence in privatization process,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:42:44.056Z"
}
