{
  "title": "Pakistan not only cradle of Buddhist civilization but also preserved heritage as living tradition: Dr Sakya",
  "link": "https://www.app.com.pk/national/pakistan-not-only-cradle-of-buddhist-civilization-but-also-preserved-heritage-as-living-tradition-dr-sakya/",
  "date_published": "2024-09-03T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP): Senior monk from Thailand, Most Venerable (MV) Dr. Anil Sakya on Tuesday underlined that not only Pakistan was a cradle of Buddhist civilization but also this preserved heritage served as a living tradition inspiring and guiding the world in fostering peace and harmony in these challenging times.\nIn its latest edition of Thought Leaders Forum (TLF), the Institute of Strategic Studies Islamabad (ISSI) hosted a senior monk from Thailand, Most Venerable (MV) Dr. Anil Sakya. Organized by the China-Pakistan Study Center (CPSC), the session focused on “Buddhist Heritage of Pakistan: A Bridge to Peace and Harmony,” a news release said.\nDirector General ISSI Ambassador Sohail Mahmood, in his welcome remarks, highlighted MV Dr. Anil Sakay’s illustrious journey as a revered spiritual leader and a distinguished scholar, noting his significant contributions to the understanding of the Buddhist philosophy and heritage worldwide.\nHe emphasized Dr. Anil Sakya’s unique ability to bridge the traditional principles of Theravada Buddhism with the contemporary challenges faced by lay-people, making him a beacon of adaptability and relevance in today’s world.\nAmbassador Sohail Mahmood particularly highlighted the rich Buddhist Gandhara heritage of Pakistan, pointing out that the region was home to some of the most important and sacred Buddhist sites globally. These sites — including Taxila, Peshawar, Swat, Takht-i-Bahi —  were centers of learning and creativity during the peak of the Gandhara civilization.\nHe added that by preserving and promoting this heritage, Pakistan was not only honouring its past but also making a valuable contribution to global dialogue on peace and harmony.\nMV Dr. Anil Sakya, in his address, emphasized the profound significance of Pakistan’s unique Buddhist heritage, which dated back over thousands of years and represented some of the most authentic and ancient Buddhist sites and artifacts in the world.\nHe underlined that not only Pakistan was a cradle of Buddhist civilization but also this preserved heritage served as a living tradition inspiring and guiding the world in fostering peace and harmony in these challenging times.\nDrawing from his personal experiences, MV Dr. Anil Sakya spoke about his numerous visits to Pakistan over the past decades and his efforts to create better awareness about the country’s cultural and religious landscape.\nHe shared anecdotes from his teaching experiences in Thailand and the United States, where he emphasized the universality of Buddhist principles and the importance of Pakistan’s Buddhist heritage. He also recounted his work with Thai officials to foster enhanced cultural exchanges, including proposals for exhibitions in Thailand to showcase Pakistan’s Buddhist artifacts and promote a deeper understanding and appreciation of this rich heritage.\nEarlier, Dr. Talat Shabbir, Director CPSC, stressed the relevance of Buddhist teachings in today’s world, particularly in promoting peace, mutual respect, co-existence and harmony amidst global challenges.\nThe Forum was also attended by a Thai delegation led by Chalyapon Suk-leam, Director-General of the Department of Religious Affairs, Thailand. A cross-section of people including academics, think-tank experts, and members of civil society and the media participation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:41:58.627Z"
}
