{
  "title": "River Indus still experiencing low, medium flood: FFC",
  "link": "https://www.app.com.pk/national/river-indus-still-experiencing-low-medium-flood-ffc/",
  "date_published": "2024-09-03T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP):The Federal Flood Commission (FFC) has said that except for River Indus, which is experiencing “Low Flood” condition at Guddu Barrage and “Medium Flood” condition at Kotri Barrage, all other major rivers in the Indus River System (Jhelum, Chenab, Ravi and Sutlej) are discharging normal flows.\nAccording to daily FFC report on Tuesday, Tarbela Reservoir is maintaining its Maximum Conservation Level (MCL) of 1550.00 feet since August 19, 2024. The water level in the Mangla Reservoir is steadily rising and is currently at 1224.20 feet, just 17.80 feet short of its MCL of 1242 feet.\nThe combined live storage of the country’s major reservoirs (Tarbela, Chashma and Mangla) stands at 11.962 MAF, which is 89.58% of the total live storage capacity of 13.354 MAF.\nAccording to the Flood Forecasting Division (FFD), Lahore, well marked low earlier over South-western Chhattisgarh (India) has shifted Westwards and now is positioned over West Madhya Pradesh (India). Trough of Westerly Wave previously over Northeastern Afghanistan has moved to Northern Pakistan while Seasonal Low lies over Northwestern Balochistan. Moderate moist currents from the Bay of Bengal were penetrating into the upper parts of Pakistan.\nFor the ensuing 24 hours, FFD Lahore has predicted, scattered thunderstorm rain of Moderate Intensity with isolated Heavy Falls over Islamabad, Punjab (Rawalpindi, Gujranwala, Sargodha, Lahore, Faisalabad, Sahiwal, D.G.Khan, Multan & Bahawalpur Divisions), Sindh (Mirpur Khas, Larkana & Sukkur Divisions), Khyber Pakhtunkhwa (Peshawar, Kohat, Bannu & D.I.Khan Divisions) and Balochistan (Zhob, Loralai, Nasirabad, Kalat & Sibbi Divisions) including upper catchments of all major rivers of IRS.\nThe monsoon activity is expected to decrease over the next 48 hours.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:42:44.099Z"
}
