{
  "title": "SC issued judgment for removal of restaurants to protect environment: CJP",
  "link": "https://www.app.com.pk/national/sc-issued-judgment-for-removal-of-restaurants-to-protect-environment-cjp/",
  "date_published": "2024-09-03T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP):Chief Justice of Pakistan Qazi Faez Isa on Tuesday remarked that the top court has issued judgment for removal of restaurants from Margalla Hills National Park to protect the natural environment.\nThe court reserved its verdict on the review petition against the verdict for removal of restaurants including Monal from national park.\nA three-member bench headed by Chief Justice of Pakistan Qazi Faez Isa heard the review petition against the verdict for removal of restaurants. Lawyer Naeem Bukhari appeared before the court on behalf of the petitioner.\nThe CJP remarked that the country was destroyed by climate change, but the goal here is to just make money. If permission was given to build a small hut, big palaces were built.\nHe said that if restaurants are built everywhere in the National Park area, then Islamabad may be affected by landslides.\nChief Justice Qazi Faez Isa questioned, “What is the FIA’s business with this matter, because many times people get cases filed against themselves.\nHe remarked that this is a matter of fundamental rights, the rights of animals in the national park. Addressing the lawyer, he said that even though the High Court decision was there, you continued to do commercial activities and run the restaurant in violation of the rules.\nThe Chief Justice said that the Supreme Court had given the decision with the consent of all the parties then why review petition is moved.\nLawyer Naeem Bukhari earlier argued that everyone knows what happened in 1954.\nHe said that he did not ask to close the restaurant willingly, he spoke under compulsion. We had two options in front of us either finish the restaurant ourselves or it will be demolished. My client Dr. Amjad is a 66% shareholder who was not heard from while he was abroad.\nLawyer Naeem Bukhari said that FIA had conducted an inquiry against the restaurant owners in the past, after which no crime was proved.\nDuring the hearing, Director Legal, Brigadier (retd) Falak Naz said that I was deeply saddened by the remarks made by the court regarding me because my lack of knowledge was mentioned in the judgment.\nThe CJP said that the federal government through the Attorney General took a stand and not even filed a review case.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:42:20.070Z"
}
