{
  "title": "Govt focuses on power sector indigenisation to boost exports: Leghari",
  "author": null,
  "content": "ISLAMABAD, May 24 (APP): Federal Minister for Energy Sardar Awais Ahmed Khan Leghari on Saturday said the government is working to shift the country’s economic model from import dependence to export-driven growth, with a strong focus on indigenisation in the power sector.\nIn a video link address at a National Consultative Workshop on Power Sector Indigenisation organized by the National Grid Company of Pakistan (NGC) in collaboration with Lahore University of Management Sciences (LUMS), the minister said the government is committed to building strong linkages between the energy sector, industry, and technical experts to enhance local capabilities.\nHe announced the launch of Pakistan’s first Power Equipment Manufacturing Dashboard—a real-time digital platform aimed at tracking local production, vendor performance, and strategic investment opportunities.\nLeghari said the dashboard would promote transparency and data-driven decision-making in the sector, helping monitor progress on localisation and identify future opportunities. “Policy-making will now be guided by reliable data,” he added.\nThe minister also confirmed that the restructuring of the National Transmission and Dispatch Company (NTDC) is underway, while the establishment of the Independent System and Market Operator (ISMO) has been completed. The Energy Infrastructure Development and Management Company will also be activated soon, he added.\nLeghari emphasized that the “Made in Pakistan” label on power equipment would become a symbol of national progress, as the country moves toward self-reliance and sustainable energy solutions.\nHe said local manufacturing of energy sector equipments mark a major milestone and will significantly reduce import reliance. He noted that the energy sector is witnessing rapid growth in generation capacity, but is also facing new challenges due to evolving technologies.\nSpeaking on renewable energy, Leghari said the solar energy revolution has already begun in Pakistan, though it also poses integration challenges for the grid. He urged distribution companies to manage net metering carefully while adopting new solar technologies.\nThe minister also praised the Energy Data Portal developed under LUMS, calling it a valuable tool for all stakeholders. He said the government is setting specific timelines for achieving various energy targets, and the new data systems are making decision-making more accurate and efficient.\nHe further stated that plans are underway to supply around 7,000 megawatts of electricity to the export industry at highly competitive prices, helping to support Pakistan’s manufacturing base.\nLeghari appreciated the National Grid Company (NGC) for being the first national institution to implement the indigenisation policy under the National Electricity Plan 2023-27, saying its strategic procurement model is already delivering results.\nHe urged WAPDA, DISCOs, K-Electric, and both public and private power producers to follow suit and begin implementing the policy to ensure long-term energy security and economic resilience.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:52:02.712Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-focuses-on-power-sector-indigenisation-to-boost-exports-leghari/",
  "dateList": "2025-05-25",
  "date_published": "2025-05-24T19:00:00.000Z"
}
