{
  "title": "PM, Turkiye President renew commitment to further deepen multifaceted cooperation",
  "author": null,
  "content": "ISTANBUL, May 25 (APP):Prime Minister Muhammad Shehbaz Sharif and President of Turkiye Recep Tayyip Erdogan Sunday expressed a renewed commitment to further deepen the multifaceted cooperation between Pakistan and Türkiye.\nPrime Minister Shehbaz Sharif, who arrived on an official two-day visit to Turkiye, held a warm and most cordial meeting with President of Türkiye Recep Tayyip Erdoğan.\nThe two leaders pledged to continue working closely for regional peace, sustainable development, and the shared prosperity of their peoples.\nThe engagement reaffirmed the deep-rooted, historic, and brotherly ties between Pakistan and Türkiye, anchored in shared values, mutual respect, and a common vision for progress and prosperity.\nPrime Minister Shehbaz Sharif, who was accompanied by Field Marshal Syed Asim Munir, Chief of Army Staff, expressed heartfelt gratitude to the government and people of Türkiye for their unwavering support to Pakistan during the recent developments in South Asia, underscoring the strength of the fraternal bonds between the two nations.\nHe lauded Turkiye’s principled stance and the outpouring of support of goodwill of the Turkish people for Pakistan and termed it as a source of great comfort and strength for Pakistan.\nThe Prime Minister highlighted the commitment and courage and the spirit of sacrifice of the Armed Forces of Pakistan and the resolute patriotism of the people of Pakistan that was demonstrated in an unprecedented manner which contributed greatly to Pakistan’s overwhelming victory in Marak-e-Haq and Operation Bunyanum Marsoos in the defence of our homeland.\nEmphasizing the need to further strengthen economic cooperation, particularly through joint ventures and enhanced bilateral investment, the Prime Minister highlighted key sectors including renewable energy, information technology, defence production, infrastructure development, and agriculture as areas of mutual interest and potential.\nThe two leaders conducted a comprehensive review of the entire spectrum of bilateral relations and reiterated their resolve to elevate the strategic partnership to greater heights. They also followed up on the implementation of key decisions taken during the 7th session of the High-Level Strategic Cooperation Council (HLSCC), held in Islamabad on 13 February 2025. Both sides agreed to take steps for achieving 5 billion USD annual bilateral trade target as agreed earlier by the two leaders.\nIn addition to bilateral issues, Prime Minister Sharif and President Erdoğan discussed pressing regional and international developments. Both leaders reaffirmed their principled support for each other’s core concerns, including the Jammu and Kashmir dispute. They also expressed deep concern over the grave humanitarian situation in Gaza, urgently calling for an immediate ceasefire and unimpeded humanitarian access to the affected Palestinian population.\nDeputy Prime Minister Muhammad Ishaq dar, Information & Broadcasting Attaullah Tarar, SAPM Syed Tariq Fatemi and Pakistan’s ambassador to Turkiye Dr. Yusuf Junaid were also part of Pakistan delegation.\nTurkish President Erdogan also hosted dinner in honour of Prime Minister Shehbaz Sharif and the accompanying delegation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:52:02.650Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-turkiye-president-renew-commitment-to-further-deepen-multifaceted-cooperation/",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T17:52:00.000Z"
}
