{
  "title": "Afridi urges UN, OIC to form fact finding commissions to probe religious violence in IIOJK",
  "link": "https://www.app.com.pk/national/afridi-urges-un-oic-to-form-fact-finding-commissions-to-probe-religious-violence-in-iiojk/",
  "date_published": "2020-08-22T04:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 22 (APP): Chairman of Parliamentary Committee on Kashmir Shehryar Khan Afridi on Saturday urged the Organisation of Islamic Countries (OIC) to depute a fact-finding commission to investigate the cases of violence based on religion and belief in Indian Illegally Occupied Jammu and Kashmir (IIOJK) .\nAddressing the audiences of a reception held with regard to the International Day to observe the Victims of Violence based on religion here, Shehryar Afridi said that the UN and OIC needed to form the probe commissions on the basis of the successive reports of the Office of the United Nations Human Rights Commission in 2018 and 2019 on the Indian atrocities against Kashmiri Muslims.\nDismayed over the callous silence of the world over the ongoing bloodbath of Muslims in Kashmir, particularly the mysterious silence of the Muslim world towards the increasing acts of religious violence in IIOJK, he said that this was the time for the Muslims across the globe to rise to the occasion and raise the voice for their brethren in the occupied Kashmir who were suffering at the hands of the Indian fascist regime.\nAfridi said that the Hindutva ruler of India had repeatedly inflicted violence on the majority Muslim population in IIOJK, locked mosques, banned religious organisations and gatherings under a double lockdown.\nHe said that the granting of domiciles to the Indian Hindus, and granting them land for business was also an act of religious violence against the Muslims of the occupied territory.\nUrging the leadership of the OIC to take necessary steps to address the issue, Afridi said the global Muslim leaders should move beyond the customary statements and address the issue. He said IIOJK had been a victim of violence based on religion and belief.\n“Prior to 1947 at the hands of Dogra Hindus who inflicted insurmountable violence on Muslim Kashmiris, banned Islamic rituals attacked mosques, and converted them into barns. Those ‘violating’ the diktats of Maharaja were hanged,” he said. He said after the partition of the subcontinent, the Hindu terrorists led by RSS goons massacred more than 3,00,000 Muslims in Jammu.\n” Mosques were burnt and some were converted into temples. Over a million people were forced to migrate to Pakistan for their beliefs. Since then the Muslims of Jammu and Kashmir have always been at the receiving end,” he added. The chairman said the Indian state had been aiding and abetting violence against the Muslims in IIOJK.\n” Mosques are shut down for weeks, many times EID prayers are disallowed, seminars on religion are banned. The Jamia Masjid in Srinagar has been a primary target of the Indian fascist regimes. Since August 5 2019, only twice congregational Friday prayers were allowed in the mosque. in 2016 the mosque was shut for 18 consecutive Fridays, ” he concluded.",
  "retrievedAt": "2025-08-11T19:42:04.490Z"
}
