{
  "title": "Removal of encroachment on major nullahs from Aug 24: Asad",
  "link": "https://www.app.com.pk/national/removal-of-encroachment-on-major-nullahs-from-aug-24-asad/",
  "date_published": "2020-08-22T08:26:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 22 (APP): Federal  Minister for Planning, Development and Special Initiatives Asad Umar has reassured that Federal government will do its best for the revival and upgradation of Karachi’s infrastructure in cooperation with Sindh Government and other stakeholders.\nHe was speaking at a reception arranged for him by Vanthali Memon Association here Saturday evening.  Asad Umar said that in a meeting with Sindh Chief Minister Syed Murad Ali Shah here today it was decided that encroachment on major nullahs of the city would be removed from this Monday. Gujar nullah, Lyari River and Korangi nullah were included.\nNational Disaster Management Authority had been tasked with cleaning of main nullahs to ensure proper drain of rain water in future.\nUpgradation of the city’s infrastructure would need hundreds of billions of Rupees, however Pakistan Tehreek-i-Insaf government was ready to share the burden to the maximum possible level. But, he asserted, Sindh Government must on the ground. ” We as a team shall do this task,” he pledged.\nIn response to the speech from Chairman of Association of Boulders and Developers, Mohsin Sheikhani, the Federal Minister for Planning and Development said Prime Minister Imran Khan was personally taking interest to promote construction and housing industry and was regularly monitoring the progress.\n” Prime Minister holds regular weekly meetings of Coordination Committee on Housing to get update from all stakeholders,” he said.  After his continuous pursuance, the Prime Minister succeeded in getting concessions/support from International Monetary Fund during hard economic situation due to COVID-19 pandemic.\nHe acknowledged that the housing and construction industry could play a big role in strengthening the economy. He praised the Memon community’s charity and social services in different fields mainly education and health.\nChairman ABAD Mohsin Sheikhani praised Prime Minister Imran Khan and his team for extending unprecedented support and facilitation to housing and construction industry.\nHe assured that his association’s members would extend full cooperation to the government and help Imran Khan transform his dream of constructing five million low cost housing units into reality.\nHe called upon the government to engage private sector in building of Karachi.\nPatron-in-Chief, Vanthali Memon Association, Mansoor Memon, President of the association Haroon Qasim, President, Memon Professional Forum, Ibrahim Qasim and President, All Pakistan Memon Federation, M. Hanif Motlani also spoke.",
  "retrievedAt": "2025-08-11T19:42:01.975Z"
}
