{
  "title": "Pakistan on track of success, progress: Sh Rashid",
  "link": "https://www.app.com.pk/national/pakistan-on-track-of-success-progress-sh-rashid/",
  "date_published": "2020-08-15T06:05:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 15 (APP): Railways Minister Sheikh Rashid Ahmad said on Saturday that Pakistan was on road to success and progress under\nthe leadership of Prime Minister Imran Khan.\nAddressing the press conference at the Pakistan Railways (PR)\nHeadquarters, he said that Main Line-1 (ML-1) project would prove to be a game changer for the country, adding that a high profile personality from China was expected to lay foundation stone of the project soon.\n“Credit of ML-1 project goes to Prime Minister Imran Khan and Chief of Army Staff General Qamar Javed Bajwa who kept the project on top priority during their visits to China,” he added.\nHe said the present railway track was laid in 1861 which would be replaced and upgraded under the ML-1 project agreement with the cooperation of China.\nThe minister said that business in the stock exchange was improving, exports had increased and IPPs got agreed on reducing the price of electricity with the efforts of Prime Minister.\nHe said that coronavirus cases were significantly reduced due to visionary steps by the Prime Minister, whereas, approximately 1000 people were dying of COVID-19 daily in India.\nThe Minister said that Saudi Arab was a true friend of Pakistan and misunderstandings between the two friends had been removed, adding that the COAS was going to Saudi Arabia on Sunday which would help bring more improvement in the bilateral ties.\nTo a question about the diplomatic relations between the United Arab Emirates and Israel, Sheikh Rashid said the statement of Foreign Office should be enough for the media.\nTo another question, he said the Prime Minister was with Punjab Chief Minister Sardar Usman Buzdar and all rumours about CM Punjab were baseless.\nHe alleged that PML-N attempted to divert the focus of National\nAccountability Bureau (NAB) from the corruption cases against the PML-N leadership by managing stones pelting on NAB office.\nThe PTI government would complete its constitutional tenure, he added.",
  "retrievedAt": "2025-08-11T19:40:03.385Z"
}
