{
  "title": "Govt taking practical measures to ensure availability of electricity at affordable tariff: Shibli",
  "link": "https://www.app.com.pk/national/govt-taking-practical-measures-to-ensure-availability-of-electricity-at-affordable-tariff-shibli/",
  "date_published": "2020-08-15T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Saturday said that the government was taking practical measures to ensure availability of electricity to the consumers at affordable tariff rates.\nAddressing a joint press conference along with Special Assistant to\nthe Prime Minister on Power sector Shehzad Qasim here, he said that a\nbasic agreement had been signed with Independent Power Producers (IPPs) as a first major step towards providing cheap electricity to the consumers.\nHe said the Pakistan Tehreek-e-Insaf inherited the issue from its\npredecessors which completely neglected this important sector.\nHe promised that by 2023, the government would ensure supply of\naffordable electricity to the consumers as they no longer could afford to\nuse costly energy.\nThe minister said that past rulers signed power production agreements with IPPs at a costly rate for personal gains.  He said owing to the irresponsible attitude of the past governments, load shedding and circular debt hit the energy sector. Shibli Faraz said that these agreements not only forced the consumers to pay more cost of the electricity but they also affected exports due increase in cost of production.\nHe said after coming to power, the PTI government following its manifesto had taken steps to reform the energy sector. He said that a committee was constituted on IPPs which presented its report.\nThe minister said in the past, power plants were set up without planning and no attention was paid towards distribution and transmission lines.\nOne of the major flaws in the agreements with IPPs,he said, was indexing the price with dollar which resulted in tariff increases with every devaluation of rupee against dollar.  He said expensive electricity was the main concern of Prime Minister Imran Khan and he wanted to address the issue on an immediate basis. Hence a team was constituted which held negotiations with the IPPs to revisit the old contracts.\nThe minister said that issue had to be settled through parleys with the IPPs as the government could not change the agreements unilaterally due to sovereign guarantees involved.\nShibli Faraz said under the agreement signed with the IPPs, payments would only be made for the electricity acquired and consumed instead of the total installed capacity of a particular power plant. He said that the objective of the government was to ensure availability of power at affordable tariffs to the consumers.\nThe minister said that this was a long process but the MoU signed with IPPs was an important step towards that goal. Shibli Faraz said that in the past the renewable energy sector was totally neglected but the present government had planned to have up to 25 per cent renewable energy share in the energy mix by 2030 to ensure cheaper power production in the country.\nHe said that the objective of the report on IPPs was to learn about the reasons behind costly agreements and take steps to reduce their price.\nHe said that in the past the governments did not pass on the burden of\nincreased cost of electricity to the consumers due to political reasons which resulted in ballooning of circular debt.\nThe minister said that the PTI government took the corrective measures irrespective of their political fallout.",
  "retrievedAt": "2025-08-11T19:39:57.839Z"
}
