{
  "title": "Parliamentarians mark ‘World Democracy Day’ with pledge to uphold democratic values",
  "link": "https://www.app.com.pk/national/parliamentarians-mark-world-democracy-day-with-pledge-to-uphold-democratic-values/",
  "date_published": "2024-09-15T08:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):On World Democracy day, parliamentarians reaffirmed their unwavering commitment to the fundamental pillars of democracy, including respect for institutions, transparency, accountability and the recognition that democratic norms which are vital for fostering trust among citizens and ensuring the efficient operation of governments.\nIn an exclusive talks with PTV news channel, Parliamentarians emphasized that democracy serves as a robust pillar, bridging the gap between citizens and governments.\nMember of the National Assembly Mirza Ikhtiar Baig emphasized that democracy is not merely a system of governance but a way of life that fosters inclusivity, diversity and equal opportunities for all citizens.\nBaig urged continued efforts to strengthen democratic institutions, promote democratic values and ensure the active participation of citizens in the democratic process.\nMNA Aftab Ahmad Sheikh stressed that a robust democracy is essential for addressing the challenges facing the nation, driving social and economic progress and upholding the principles of justice, equality, and human rights.\nBy reinforcing democracy, he believes that Pakistan can unlock its full potential and create a brighter future for generations to come.\n“Democracy is the backbone of a progressive society and we must work tirelessly to nurture and strengthen it,” said Senator Rubina Khalid.\nShehla Raza, a prominent parliamentarian also paid a heartfelt tribute to the iconic leaders Benazir Bhutto and Zulfiqar Ali Bhutto, recognizing their unwavering struggle for democracy in Pakistan.\nShe acknowledged the significant sacrifices made by the Bhutto family, highlighting their unrelenting commitment to democratic values and principles.\nRaza praised Benazir Bhutto’s courage and resilience in the face of adversity, noting her pioneering role as the first female Prime Minister of Pakistan. She also honoured Zulfiqar Ali Bhutto’s vision and leadership which laid the foundation for democratic reforms in the country.\nBy paying tribute to the Bhutto legacy, Shehla Raza reaffirmed her dedication to upholding democratic ideals and continuing the fight for a more just and equitable society.\nHer words served as a poignant reminder of the importance of learning from the past and honouring the sacrifices of those who have shaped Pakistan’s democratic journey.\n“We must continue to uphold the principles of democracy, ensuring that every citizen has an equal voice and opportunity to participate in the democratic process,” stressed MNA Syeda Shehla Raza.\nThese parliamentarians also reiterated their commitment to protecting and promoting democratic norms, recognizing the importance of democracy in driving positive change and progress in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:07:24.589Z"
}
