{
  "title": "ADB President observes BISP’ initiatives",
  "link": "https://www.app.com.pk/national/adb-president-observes-bisp-initiatives/",
  "date_published": "2024-09-15T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):The President of the Asian Development Bank (ADB), Masatsugu Asakawa, visited the Benazir Income Support Programme (BISP) office to observe its initiatives aimed at providing cash assistance to the deserving families, supporting enrolment in schools and maternal and child health in Pakistan.\nDuring the visit to the BISP Tehsil Office in Taxila and the Benazir Nashonuma Centre at Wah General Hospital, the ADB President was briefed on BISP’s programs and their impact on the education, health and well-being of the poorest households.\nAccompanied by an ADB delegation, including Haruto Takimura, Chief Advisor to the President, Yevgeniy Zhukov, Director General, Yong Ye, Country Director PRM, Ms. Azusa Sato, Senior Advisor to the President and others, President Asakawa received a briefing from BISP Director General Naveed Akbar. The briefing covered BISP’s key initiatives, such as Benazir Kafaalat, Taleemi Wazaif, Nashonuma, and the Undergraduate Scholarship Program.\nDG Akbar also discussed new measures being implemented, including the New Payment Model, Mobile Registration Vans, Digital and Financial Literacy programs, and the extension of the Nashonuma Program to include adolescent girls.\nAt the Tehsil office, Taxila and Nashonuma Facilitation Center in Wah General Hospital, the ADB delegation interacted with beneficiaries and observed the registration process for the National Socio Economic Registry, the Taleemi Wazaif and Nashunuma Programs.\nThe visit also provided insight into the operational procedures of the BISP office and the facilitation center.\nBISP’s Director General acknowledged the role of international partners, including the ADB, in supporting various social protection programs in Pakistan.\nHe highlighted efforts through BISP to raise awareness on healthcare services such as immunization and hospital care during childbirth, reduction of out of school children, and school dropouts, which are part of BISP’s ongoing initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:07:27.023Z"
}
