{
  "title": "KLESF International Challenge to be held from Nov 08-10",
  "link": "https://www.app.com.pk/national/klesf-international-challenge-to-be-held-from-nov-08-10/",
  "date_published": "2024-09-15T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):The KLESF International Challenge 2024 will be organized in conjunction with the Kuala Lumpur Engineering Science Fair (KLESF) from November 08-10 in Kuala Lumpur.\nThe KLESF International Challenge will be held at the Mines International Exhibition and Convention Center (MIECC), Kuala Lumpur.\nThe challenge is aimed at encouraging young minds to explore science, technology, engineering, and mathematics (STEM).\nOrganized by the Kuala Lumpur Engineering Science Fair (KLESF), this challenge offers primary and secondary school students a platform to showcase their creativity and problem-solving skills through innovative STEM-related projects.\nAccording to an official of the ECO Science Foundation (ECOSF), Pakistan, the challenge has been designed to enhance school students’ interest in science, technology, engineering, and mathematics (STEM) and unleash students’ innovative potential via their STEM projects.\nThis competition will help promote students’ skills in problem-solving, communication, thinking, and innovation and foster greater interaction for schools, educators, industries, and public and private sectors to share information and experiences on projects in STEM.\nThe schools students from Malaysia and overseas including Pakistan with STEM projects may participate in the KLESF International Challenge 2024 by demonstrating their projects to the public.\nThe competition will be held in two categories including Primary School (12 years old or below) and Secondary School (13-18 years old).\nThe project must address the sustainable development goals `Good Health and Well-being (SDG 3)’ and `Sustainable Cities and Communities (SDG 11)’.\nThe prize-giving ceremony for the KLESF International Challenge will be held on November 10.\nThe deadline for submission is October 06. Further details can be accessed through https://ecosf.org/KLESF and https://www.klesf.net/klesf-challenge-2024/.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:06:36.683Z"
}
