{
  "title": "SUPARCO gears up to mark World Space Week through series of activities",
  "link": "https://www.app.com.pk/national/suparco-gears-up-to-mark-world-space-week-through-series-of-activities-2/",
  "date_published": "2024-09-15T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):Maintaining its previous traditions, Space and Upper Atmosphere Research Commission (SUPARCO)- the national space agency has planned a series of activities to mark the upcoming World Space Week, to be held from October 04-10.\nAccording to an official of SUPARCO, the Space Week will be marked under the theme of using space technology to fight climate change.\nThe SUPARCO has announced various contests for the general public in different categories revolving around the theme.\nThe first category is “Reuse, Reduce, Recycle for Climate Action: Show how small steps can make a BIG difference!” while the second category is, “Planting for a Greener Pakistan’: Let’s work together to plant a sustainable future!”.\nThe third category of the contest is “Space form limited:Video Challenge’: Share your creative ideas on how space technology can help save our planet!”.\nThe students, professionals or climate enthusiasts can participate in the contests to create a better world for future generations.\nWorld Space Week is an international celebration of science and technology, and their contribution to the betterment of the human condition.\nThe United Nations General Assembly declared in 1999 that World Space Week will be held each year from October 4-10.\nThese dates commemorate two events including `October 4, 1957: Launch of the first human-made Earth satellite, Sputnik 1, thus opening the way for space exploration’ and the other is `October 10, 1967: the signing of the treaty on principles governing the activities of States in the exploration and peaceful uses of outer space, including the Moon and other celestial bodies’.\nWorld Space Week consists of space education and outreach events held by space agencies, educational institutions, planetaria, museums and astronomy clubs around the world in a common time frame under the ambit of the United Nations to enhance awareness about space and related technologies and to highlight its role towards national development.\nSUPARCO being the National Space Agency annually organizes World Space Week (WSW) in Pakistan as WSW national coordinator since 2005.\nPakistan has managed to make its mark each year with the greatest number of events conducted globally.\nPakistan stood third in the year 2023 for conducting 7,836 space events in the country during the festive week which is an honour for the country.\nEvery year, WSW theme is selected by the World Space Week Association Board of Directors to highlight an aspect of space with broad appeal to humanity.\nThis year, the globally celebrated event of space will be conducted on the theme of ‘Space and Climate Change’.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:06:36.686Z"
}
