{
  "title": "Caretaker PM says slashed government expense, high revenue tops his agenda",
  "link": "https://www.app.com.pk/national/caretaker-pm-says-slashed-government-expense-high-revenue-tops-his-agenda/",
  "date_published": "2023-09-26T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday said that his foremost priority to fix the problems of the country during his tenure in office would be to cut the government’s expenditure and increase revenue.\n“The economy is extremely pressing right now and these are the problems which are hitting a common man very hard,” he told TRT World when asked about his vision during the last four months of the caretaker setup.,\nKakar said the International Monetary Fund (IMF) deal was an opportunity for the country to focus on how the economic behaviour was influencing the life of the common man in Pakistan.\n“I am quite positive that this current stint of ours no matter how short it is, we will try our level best to provide a blueprint for the future mandated government who can take some benefit of it, stay the course, and deliver on the economic front to the people of Pakistan,” he said.\nOn the transparency of the upcoming general election, he termed Pakistan as a transitional democracy and assured that the electoral process would be neutral, fair, and free.\nHe stressed that there would not be any organizational or institutional involvement, either in favor of one or a political group.\nOn protests by Imran Khan’s supporters, he said the protest, if remained peaceful, was their basic and democratic right. The government will try to protect the democratic right of any political party be it Pakistan Tehreek-e-Insaf, Pakistan Muslim League-N, and Pakistan Peoples Party, he said.\nHowever, he stressed that any kind of vandalism in the name of protest would not be allowed.\nAsked about the alleged involvement of the United States in the ouster of Imran Khan, he called it a conspiracy theory that was used for public consumption.\n“At times politicians do things for populist reasons, but as far as the responsible caretaker government is concerned, we ensure that no one whether it is United States of America or any other power, meddles in our domestic affairs,” he said\nPakistan is a sovereign country that exercises things according to its own interests, he said.\nKakar said the ouster of Imran Khan was “lawful” as it was carried out constitutionally and without a military coup.\nTo a question on civil-military relations, he said to ensure functional governance, the civilian institutions had been relying on the military due to its organizational capabilities and to deal with day-to-day challenges in areas including health, education, disaster management, and tax revenue collection.\nHe said the civil institutions needed to enhance their capability to improve service delivery.\nOn Pakistan’s national security, he said the country faced a perpetual challenge of attacks for 16 years and was quite successful in managing the violence to a certain level.\nHe mentioned that the Afghan-led government had the capacity issues to respond to certain terrorist groups on their soil, which he termed as a threat to Pakistan and the world.\nHe said Pakistan was the only nation that lost around 90,000 individuals in fighting terrorism.\nTo a question comparing Pakistan’s progress with India, he said there are cycles of life within the lifespan of an individual or nation with good and bad patches.\n“If you want to turn around your adversarial time and turn it into a fortune, you have to learn lessons and be quite optimistic and sanguine about the future,” he said.\nHe said though Pakistan faced difficult times in terms of economy and security, there was no reason to become paranoid and feel insecure due to India’s “apparent success”.\nKakar expressed confidence that Pakistan had a “very shining and promising future and would come out of the economic mess and security challenges”.\nOn Pakistan’s democratic process, he said even democracies die if political differences are turned into enmities.\n“If we turn our political differences into personal enmities, the kind of liberal democracy which we are hoping for would have very serious challenges and there would be forces who would jump in and rationalize the sort of a governance structure which probably would not be that great for many political players in the country,” he said.\nHe said Pakistan desired meaningful dialogue with all its neighbours including India.\n“We do want peace with India but with justice, which is linked with the resolution of the dispute of Jammu and Kashmir in accordance with the United Nations Security Council to hold a plebiscite in the valley.\nHe said India was pursuing a skewed political view by changing the religious and social background of Jammu and Kashmir with the introduction of Hindu population, terming it an “ambitious and dangerous” step having implications on Muslim, Christian and Sikh minorities.\nAsked about the status of minorities in Pakistan, he said the government fully supported their religious faith and rights.\n“The difference between the religious freedom of Pakistan and India is that Pakistan’s State and the government always stands with the oppressed, not with the oppressor,” he said.\nKakar mentioned that after an incident of ill-treatment to Christian community in Jaranwala, the top officials including the chief justice of the Supreme Court and the army chief were firm with their public position to sympathize and empathize with the affected minorities. The attacked church was renovated within 24 hours, he said.\n“Our minorities include Sikhs, Hindu and Christian minority and it is the moral, constitutional and religious duty of all the Pakistanis to protect our vulnerable groups,” he said.\nAsked about any change in blasphemy law, he said it was out of the legislative domain of the caretaker government, but the parliament was empowered to bring any change in it.\n“We have to wait for a parliament and there are multiple political parties including PTI, PML-N, PPP, and others who should actually debate and have a public discourse on such issues and bring it on the floor of the parliament. If they feel that there is a need to change the law,” he said.",
  "retrievedAt": "2025-08-11T09:49:28.706Z"
}
