{
  "title": "Annual all Pakistan Naat competition held at Z.A. Bukhari auditorium of Radio Pakistan",
  "link": "https://www.app.com.pk/national/annual-all-pakistan-naat-competition-held-at-z-a-bukhari-auditorium-of-radio-pakistan/",
  "date_published": "2023-09-26T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): In connection with Eid Mild-un-Nabi (SAWW), the annual All Pakistan Naat competition was held at National Broadcasting House here on Tuesday.\nTop position holders of Naat competitions in four provinces, Gilgit Baltistan, Azad Kashmir and Islamabad Capital Territory participated in the national level competition.\nThe competition was held in four categories including Boys under 15, girls under 15, Boys above 15 and girls above 15.\nIn the Boys under 15 category, Syed Muhammad Siraaj from Gilgit Baltistan grabbed first position, Muhammad Afhaam from Sindh stood second while Muhmmad Ibrahim from Punjab remained third.\nIn the Girls under 15 category, Madiha Naseer from Khyber Pakhtunkhwa stood first, Ayesha Rasheed from Sindh second and Zara Safdar from Punjab remained third.\nIn the Boys above 15, Muhammad Fahad from Khyber Pakhtunkhwa stood first, Muhammad Mannan from Sindh grabbed second position while Muhammad Usman from Punjab remained third.\nIn the Girls above 15 category, Sehrish Saeed from Punjab grabbed first position, Aleesha Nisar from Sindh stood second while Syeda Zahra from Khyber Pakhtunkhwa remained third.\nWinners and participants were given certificates and cash prizes.\nFirst position winners were awarded Rs. 100,000 cash prize, second position got 75,000 rupees while third position holders got Rs. 50,000 cash prize each. All other participants were awarded Rs. 25,000 cash prize each.\nCaretaker Minister for Religious Affairs and interfaith Harmony Aneeq Ahmed on the occasion he urged the people especially young children to truly follow the teachings of holy Prophet Hazrat Muhammad (SAWW). He quoted several verses of Holy Quran for the understanding of children.\nSpeaking on the occasion, Secretary Information and broadcasting Zahoor Ahmed commended Radio Pakistan for being the voice of millions of people.\nReferring to the famous and historical archives of Darood and Naat available with Radio Pakistan, the Secretary Information said this institution has trained generations of artists in different genres of art.\nHe also presented tribute to the Holy Prophet through his well-articulated poetic verses.\nEarlier, Director General Pakistan Broadcasting Corporation Muhammad Tahir Hassan said it is a great honour for Radio Pakistan to host this soulful gathering which is both an opportunity for spiritual rejuvenation, and a platform for the youngsters to show their talent.\nHe said the viability of Islamic teachings is becoming more evident in the contemporary world, therefore, the young generation should enlighten themselves in this regard.\nThe competition was broadcast live from Radio Pakistan’s Medium Wave, FM-93, FM-94 and FM 101 networks.",
  "retrievedAt": "2025-08-11T09:49:21.298Z"
}
