{
  "title": "Birthday of famous singer Naheed Akhtar celebrated",
  "link": "https://www.app.com.pk/national/birthday-of-famous-singer-naheed-akhtar-celebrated/",
  "date_published": "2023-09-26T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Fans celebrated on Tuesday the birthday of famous playback singer Naheed Akhtar also known as the “Nightingale of Pakistan”.\nBorn on September 26, 1956, in Multan Naheed Akhtar’s career began in the 1970s when she sang a duet with Khalid Asghar in “Raag Malhar” at Radio Pakistan Multan.\nShe has recorded songs in a range of styles, including Pakistani film music, pop, Ghazal, traditional Pakistani classical music, Punjabi folk songs, Qawwalis, Naat & Hamds, and others.\nShe was first discovered for films in the mid-1970s by veteran music director M. Ashraf who pursued her to sing in films. M. Ashraf played a key role in grooming her talent. Her first film as a playback singer “Nanha Farishta” was released in 1974 and in the same year, she sang songs in the blockbuster Shama. She was active in the Pakistani film industry all the way through the 1980s.\nOverall as a playback singer, Naheed Akhtar has lent her voice to about 600 songs in over 430 Urdu and Punjabi films.\nShe is considered one of the greatest female singers who ruled Lollywood during the 70s and 80s.\nMelodious songs such as ‘Piyar Kabhi Karna Na Kam’, ‘Yeh Aaj Mujko Kia Hua, and ‘Kisi Meherbaan Nay Aa Ke Meri Zindagi Saja Dee’,\n‘Allah Hi Allah Kia Karo’, ‘Jis Tarf Ankhon Uthaun’, ‘Teri Tasvira Hay’, ‘Baant Raha Tha Jab Khuda’, and ‘Per Kaheen Aankh Larai tau Larai Ho Gi’ gave her immense popularity.\nBesides she also sang classical Ghazals including ‘Shabe Gham Mujh Se Mil Kar Aisi Roi’, ‘Tumse Ulfat Ke Taqazey’, ‘\nJahan Tera Naqsh e Qadam Dekhtay Hein’, ‘Zinda Rahein To kiya Hai’ and ‘Khushi Se Dil Ne Sahein Bewafaiyan Kia Kia.\nDuring the late 1980s, she left singing and later married a journalist Asif Ali Pota.",
  "retrievedAt": "2025-08-11T09:49:25.045Z"
}
