{
  "title": "Jamal Shah proposes recommendations to fill gaps in ICESCO’s initiatives",
  "link": "https://www.app.com.pk/national/jamal-shah-proposes-recommendations-to-fill-gaps-in-icescos-initiatives/",
  "date_published": "2023-09-26T18:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Minister for National Heritage and Culture Jamal Shah on Tuesday proposed several recommendations to enhance initiatives of Islamic World Educational, Scientific and Cultural Organization (ICESCO) and emphasized the role of culture in transforming individuals into productive contributors and agents of positive change.\nDuring his speech at the 12th Conference of ICESCO in Doha, the minister commended the host country, Qatar, Culture Minister of Qatar, Sheikh Abdulrehman bin Jasim Al Thani and Dr. Salim M AlMalik, Director General of ICESCO, for organizing the significant conference.\nAccording to a message received from Doha, he presented his recommendations to ICESCO, intending to address certain hidden gaps in their impressive list of initiatives. Minister Jamal Shah suggested organizing a cultural caravan comprising tradition bearers from all member states. This caravan would embark on a tour of member states, interacting with local counterparts in each country and creating transformative works of art and crafts.\nThe journey, he said, would culminate in the next cultural capital during the subsequent ICESCO conference, taking the form of a festival and celebration, empowering children in the process.\nHe said that a similar initiative should target the youth of all member countries. Leadership camps and talent hunt events would be planned to groom and empower young individuals as future leaders.\nTo infuse aesthetics among students of religious seminaries and combat religious intolerance and extremism, Jamal Shah proposed teaching calligraphy.\nThe minister recommended creating huge Islamic public monuments in all capital cities of member countries. These monuments would incorporate traditional and modern tools, including AI, virtual reality, as well as holograms and to serve as powerful sources to counter extreme views about art and culture.\nJamal Shah emphasized promoting the arts and crafts of Palestinian and Kashmiri artists as expressions of solidarity with these regions, which have experienced exploitation by the developed world.\nHe said that it is a relationship that turns you into a productive contributor and agent of change, interested in sharing and turning his or her surroundings into a more livable place for all.\nHe referenced the renowned Pashto poet Rehman Baba, who urged the planting of flowers to transform your land into a garden, advising against sowing thorns as they would eventually harm your own feet.\nThe minister praised Doha as a modern cultural capital that effectively blends tradition, heritage, modernity, and innovation in its cultural infrastructure and master plan.\nHe underscored the importance of culture in fostering intimate relationships with one’s surroundings, enabling creativity, critical thinking, and informed decision-making. He emphasized the role of culture in transforming individuals into productive contributors and agents of positive change.\nIn conclusion, the minister urged ICESCO to create special opportunities for tradition bearers, craftsmen, musicians, writers, and filmmakers to showcase their works with Islamic countries and the world, representing the aspirations of their people.",
  "retrievedAt": "2025-08-11T09:49:44.056Z"
}
