{
  "title": "India involved in state-sponsored terrorist activities in various countries:AJK  President",
  "link": "https://www.app.com.pk/national/india-involved-in-state-sponsored-terrorist-activities-in-various-countriesajk-president/",
  "date_published": "2023-09-26T16:12:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Sep 26 (APP) : Azad Kashmir President Barrister Sultan Mehmood Chaudhry has said that India was not only involved in terrorist activities in the Indian-occupied Jammu & Kashmir but also in other countries.\nThe AJK president said this while speaking to a delegation of British Members of Parliament at Jammu Kashmir House in the federal metropolis on Tuesday.\nThe delegation was comprised of British MP and Chairman of Labor Friends of Kashmir UK Andrew Gwynne, Naz Shah, Sam Terry, and others.\nReferring to the killing of Sikh leader Hardeep Singh Nijjar in Canada by the agents of Indian spy agency RAW, he said, “The incident has proved beyond any reasonable doubt that India is a terrorist state that uses terrorism as a tool to achieve its objectives.\nHe said that the cold-blooded murder of the Sikh leader evoked widespread condemnations. He said that many countries of the world, including the United States, Britain, and Europe have voiced their anguish over the killing and demanded an independent investigation into the incident.\nReferring to the precarious situation in the Indian-held territory of Jammu and Kashmir, the president said that it was high time the United Kingdom took a tough stand against the systematic human rights violations being committed by the Indian forces against the Kashmiris.\nHe said that there was a dire need to counter India’s negative propaganda against Kashmiris’ legitimate struggle.\nHe said that the Modi government was in the habit of spreading lies to whip up anti-Muslim sentiment in India to boost its electoral gains.\nDuring the meeting, it was decided that a resolution on Kashmir would be passed in the Labor Party conference to be held in Great Britain on October 8.",
  "retrievedAt": "2025-08-11T09:49:48.166Z"
}
