{
  "title": "All parties including PTI are free to join polls: Caretaker Govt",
  "link": "https://www.app.com.pk/national/all-parties-including-pti-are-free-to-join-polls-caretaker-govt/",
  "date_published": "2023-09-26T06:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): The caretaker government on Tuesday said under the constitution and prevalent electoral laws, all political parties had the equal right to participate in the general elections and categorically stated that the remarks of the caretaker prime minister during a recent interview to the foreign wire service Associated Press had been “misunderstood and misreported”.\nThe Ministry of Information and Broadcasting in its official statement issued the original text from the Associated Press to clarify that Prime Minister Anwaar-ul-Haq Kakar was plainspeaking to suggest that whereas participating in the elections was a right, but retribution for crimes was legally warranted.\nThe ministry lamented that the interview had been “twisted by some outlets” to give the impression that someone will not be allowed to take part in the general elections.\nThe ministry drew attention to the following text of Prime Minister’s interview:\n“We are not pursuing anyone on a personal vendetta,” Kakar said. “But yes, we will ensure that the law is appropriate. Anyone, be it Imran Khan or any other politician who violates, in terms of their political behavior, the laws of the country, then the restoration of the law has to be ensured. We cannot equate that with … political discrimination.”\nKakar said fair elections can take place without Khan or hundreds of members of his party who are jailed because they engaged in unlawful activities including vandalism and arson, a reference to the violence that rocked the country following Khan’s initial arrest in May.\nThe caretaker prime minister added that the thousands of people in Khan’s party who didn’t engage in unlawful activities, “will be running the political process, they will be participating in the elections.”\nThe Information Ministry reiterated in its statement that Pakistan Tehreek-e-Insaf (PTI) and its leaders are free to participate in the elections like any other party. It has been clarified that there is no impediment to contesting elections by any leader of PTI or the party as a whole.\nThe statement further added that every citizen is equal before law and the law will take its course with respect to any person currently facing legal charges. The courts are free and independent and the caretaker government has neither authority nor intention to influence the courts at any level.\nIt was further clarified that any person aggrieved by any order or ruling of a statutory or judicial forum has a constitutionally guaranteed right to approach the next forum in judicial hierarchy for relief.\n“The caretaker government is committed to holding free and fair elections. The caretaker government will support the constitutional and legal structure for holding elections and would ensure that all orders and directions of the Election Commission of Pakistan and independent judiciary are complied with in letter and spirit,” the government said in its statement.",
  "retrievedAt": "2025-08-11T09:49:37.042Z"
}
