{
  "title": "PAEC Hospital NORI designated as IAEA “Anchor Centre”",
  "link": "https://www.app.com.pk/national/paec-hospital-nori-designated-as-iaea-anchor-centre/",
  "date_published": "2023-09-26T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): PAEC Hospital NORI, Islamabad is designated as IAEA “Anchor Centre” to Enhance Member States’ Capabilities in Cancer Research which is a significant achievement.\nAt a signing ceremony held in Vienna, organized on the sidelines of the 67th Session of the General Conference of the IAEA, Pakistan’s Nuclear Medicine, Oncology and Radiotherapy Institute (NORI) has been designated as an Anchor Centre under the IAEA’s “Rays of Hope initiative”.\nOn behalf of Pakistan, the Anchor Centre Agreement was signed by Dr. Raja Ali Raza Anwar, Chairman, Pakistan Atomic Energy Commission (PAEC) alongside the Director General of the IAEA, Rafael Mariano Grossi, said a news release.\nAnchor Centres are designated cancer treatment facilities which work with the IAEA to support and provide relevant expertise in the respective region.\nThese centres are part of the IAEA’s Rays of Hope (RoH) initiative, which aims to assist Member States in establishing or expanding their capacities in radiotherapy and multimodality medical imaging. Moreover, the designated Anchor Centres will train fellows, organise training courses for healthcare providers, participate in IAEA Coordinated Research Projects, promote networking, and provide experts and mentorship to other radiotherapy and medical imaging centres in their region.\nAlong with Pakistan, Anchor Centre Agreements with cancer institutes from Algeria, Egypt, Jordan, Morocco and Turkiye were also signed during the ceremony.\nWithin the health sector in Pakistan, the PAEC has used nuclear and other advanced techniques for the diagnosis and treatment of cancerous and allied diseases.\nIt is actively involved in the national cancer awareness, prevention, and diagnosis and treatment program. NORI, one of the 19 cancer hospitals run by PAEC, established in 1983 in Islamabad, is a state-of-the-art facility and the only fully fledged tertiary care cancer hospital of Pakistan specifically designed for diagnosing and treating cancer patients, equipped with state of the art equipment including Cyberknife.",
  "retrievedAt": "2025-08-11T09:49:19.919Z"
}
