{
  "title": "Climate change may push 41m more into extreme poverty by 2050 - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Climate change could significantly slow progress in poverty reduction and climate-induced income losses could push an additional 41 million people into extreme poverty by 2050, according to a new World Bank report.\n\nThe projections show the number of poor could rise by up to 148.8 million, with those in South Asia projected to be at 48.8m by 2030.\n\nAs per the findings — part of the report titled ‘The Future of Poverty’: Projecting the Impact of Climate Change on Global Pov­erty through 2050 — the number of people living in extreme poverty worldwide could be nearly doubled due to climate change.\n\nThe rise in poverty due to climate change is likely to be profound in Sub-Saharan Africa, South Asia, and Latin America and the Caribbean, where the effects of extreme weather events are likely to interact with existing structural vulnerabilities and weaker social protection systems.\n\nWB report emphasises need for social safety nets, subsidies for less privileged\n\nThe study emphasised international cooperation will be essential for addressing the global nature of the climate challenge.\n\nHigh-income countries, which have contributed the most to global emissions, have a responsibility to support low- and middle-income countries in their efforts to adapt to climate change, it said.\n\nThis includes providing financial resources, technology transfer, and capacity-building support to help countries build resilience to climate shocks and transition to low-carbon development pathways.\n\nThe WB report said efforts to reduce income inequality must be central to any poverty reduction strategy, as the projections show, even small increases in inequality can lead to large increases in poverty.\n\nPolicies that promote inclusive economic growth, reduce barriers to education and employment and enhance social protection systems will be critical for ensuring the benefits of economic development are shared more broadly, according to the study.\n\nIt stressed the need to streng­th­­­­en social safety nets and provide targeted support to the poorest and most vulnerable populations.\n\nThis includes expanding access to healthcare, education, and financial services, as well as improving the resilience of livelihoods through investments in agriculture, infrastructure, and climate adaptation measures.\n\nAccording to the report, climate change-induced rising food prices may significantly increase global poverty, particularly in the developing world, where food consumption accounts for a large share of household expenditures.\n\nIf nothing changes, the projections suggest that global economic output could be reduced by 23pc by 2100 compared to a world without climate change.\n\nIn most scenarios, projected global income losses exceed 20pc, underscoring the potentially severe economic consequences of inaction.\n\nThe report said even though rich and poor countries respond similarly to temperature chan­ges, the economic impacts are substantially larger for the latter, as these are predominantly located in already warm regions.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/67a92606e881a.jpg",
  "retrievedAt": "2025-08-17T20:51:54.424Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925293/climate-change-may-push-41m-more-into-extreme-poverty-by-2050",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:22.000Z"
}
