{
  "title": "Witch hunts, state silence - Pakistan - DAWN.COM",
  "author": null,
  "content": "PAKISTAN is passing through a defining moment in its history. While the power elites may claim credit for shaping this turning point, it is the weight of historical legacies and the churn of global and regional geopolitics that are more decisive.\n\nThese are testing times, not just for the state, but for the very mindset that governs decision-making. The choices made now will determine not only the future of those in power but also the trajectory of the nation.\n\nDecision-making in Pakistan is not detached from sociopolitical and cultural underpinnings. Elites — civil, military and religious — have long constructed identities around faith, using it both as a political tool and as a mechanism of control. This has led to a peculiar paradox: religion is deployed to mobilise, but faith-based discourse is often left untouched, even in areas where it could give rise to social breakdown or violence. Over time, a worldview has emerged, insulated from global values and even diverging from mainstream Muslim thought elsewhere, that sees dissent as sacrilege and doubt as betrayal.\n\nA recent decision by a judge of the Islamabad High Court (IHC) to mandate an inquiry commission on the misuse of blasphemy laws is a rare opening.\n\nIt allows the state to correct course. Yet, the reaction from religious hardliners and segments of the clergy suggests that the path ahead will be turbulent. Instead of confronting the facts, the accused parties are attempting to pressure the judiciary and twist the narrative, spreading disinformation and casting the commission as an attack on Section 295-C, even though the court explicitly made no such connection. Their objective is clear: to delegitimise the process and maintain their grip on a narrative that thrives on fear.\n\nLawyer Imaan Zainab Mazari rightly pointed out that if there was no foul play, then why the fear? The court merely ordered an investigation into possible collusion between certain FIA officials and private complainants, a necessary and legal step in a democratic society. But the backlash has been ferocious. Victims and their defenders are being threatened. Religious bigots, emboldened by the silence of the state and the indifference of religious scholars, continue to act with impunity.\n\nWe are trapped in a situation that many other nations have faced but overcame — collectively.\n\nPakistan finds itself trapped in a situation that many other nations have faced — but have ultimately overcome through collective effort. One close historical parallel is the case of US senator Joseph McCarthy in the late 1950s. He exploited anti-communist sentiment to silence society’s dissenters, branding them as enemies of the state, and targeting artists, intellectuals, and members of civil society in the process. His actions ruined careers and even claimed lives.\n\nMcCarthy’s downfall began when he turned his crusade against decorated US military heroes, which brought him close to impeachment. Though his campaign was eventually discredited, and ended, the damage he caused was widespread. The term ‘McCarthyism’ now refers to this era of fear-mongering and ideological persecution.\n\nOther episodes are worth mentioning where myths, weaponised through state and religious institutions, led to mass persecution. The most horrifying one pertains to the European witch hunts of the 16th and 17th centuries. As Yuval Noah Harari notes in his recent work Nexus, the myth of witches transformed suspicion into systemic violence. What began as scattered accusations turned into legal doctrine, enabled by courts and monarchs, and consumed entire communities. Women, particularly healers and midwives, were targeted, tortured and burned, simply because fear had been institutionalised.\n\nEurope eventually stepped back from the brink of hysteria. Monarchs such as Frederick II of Prussia and Louis XIV of France helped curtail witch trials through legal reforms and the influence of rationalist thought. The Church, once complicit, began to distance itself from the practice as witch hunts increasingly brought disrepute to the Christian faith. It worked to deconstruct the narratives that had fuelled the persecution, recognising the damage these trials inflicted on both society and faith.\n\nIronically, the Inquisition was at times more restrained than the local courts, which tended to act out of fear and popular pressure and on the basis of rumour. Over time, the values of the Enlightenment gained ground, emphasising reason, legal restraint and human dignity. But these shifts came only after entire regions had been scarred by collective hysteria, state-sanctioned cruelty, and institutionalised repression.\n\nIf this silence continues, Pakistan risks descending further into a state of perpetual fear, where beliefs are no longer a source of spiritual guidance but used as a tool to accuse and coerce. The cost will not only be paid by victims of blasphemy allegations but by society at large, producing a stunted generation, devoid of critical thought and locked in a cycle of moral panic.\n\nThis moment is a test. Not just of institutions, but of the national will. Will state and society push back? Can they summon the courage to break this cycle and reclaim a future grounded in justice, dignity and truth?\n\nToxic narratives drain the energies of nations, eroding their social fabric and weakening institutions. Overcoming such narratives requires collective resolve, honesty and consistent action. While other countries have confronted and dismantled similar ideological threats through national reckoning and reform, Pakistan has yet to demonstrate such commitment.\n\nDespite producing policy documents and establishing counterterrorism centres in each province, these initiatives often serve as smokescreens instead of leading to real solutions. They provide the illusion of progress, while the deeper ideological challenges remain unaddressed. The power elites are either in denial or lack the courage to initiate a unified and meaningful response.\n\nCrucially, there is no comparable state-led effort to counter extremism on the legal, political or ideological fronts. Legal reforms are absent, religious leadership remains largely passive, and intellectual resistance from the religious mainstream is minimal. Even those who present themselves as moderate or rational voices within the religious sphere remain silent, caught between fear, institutional pressure and quiet complicity.\n\nThe writer is a security analyst.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687c237850a74.jpg",
  "retrievedAt": "2025-08-17T20:49:58.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925378/witch-hunts-state-silence",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:49:01.000Z"
}
