{
  "title": "180 dead as country faces intensified monsoon - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Over 500 injured nationwide since rains began\n• NDMA blames climate change, glacier melt for floods\n• PDMA issues fourth spell alert as rivers swell\n• Rs5m relief package announced in Punjab\n\nISLAMABAD: As the country grapples with a monsoon season that has intensified by up to 60 per cent over previous years, the national and provincial disaster management authorities have predicted further rains in the coming days.\n\nAccording to the National Disaster Management Authority (NDMA), at least 180 people have already been killed and more than 500 injured so far since the rains began unusually early in July.\n\nThe Pakistan Meteorological Department (PMD) on Saturday forecast further rain, wind and thundershowers, with isolated heavy falls, in Sindh over the next 24 hours. Cities and districts likely to be affected include Karachi, Hyderabad, Sukkur, Thatta, Badin, Larkana, Jaco­babad, Nawabshah, Mirpurkhas and others.\n\nThe NDMA’s NEOC has also issued alerts for urban flooding in low-lying parts of Sindh. It advised citizens to stay indoors during intense rainfall, avoid travelling to vulnerable areas and ensure household drainage systems remain clear.\n\nThe Provincial Disaster Mana­gement Authority (PDMA) of Punjab also issued an alert about the fourth spell of monsoon rains starting from July 20 (today). It forecasted strong winds, dusty winds and rain in most districts of Punjab from July 20 to 25.\n\nRain with strong winds is predicted in Rawalpindi, Murree, Galiyat, Attock, Chakwal, Mandi Bahauddin, Hafizabad, Gujrat, Jhelum and Gujranwala. There are also chances of rain in Lahore, Faisalabad, Sialkot, Narowal, Toba Tek Singh, Jhang, Sargodha, Mianwali, Multan, Dera Ghazi Khan, Bahawalpur and Bahaw­alnagar from July 18 to 23.\n\nThe PDMA also issued a high-level flood pre-alert for all major rivers and associated streams acro­ss the province, warning of pote­ntial flooding from July 22 due to an incoming weather system.\n\nAccording to the Flood Forecasting Division, increased water flows are expected in the Chenab, Jhelum, Ravi, Sutlej and Indus rivers, along with their tributaries and low-lying areas, posing significant risks.\n\nKP, Islamabad on alert\n\nIn Khyber Pakhtunkhwa, the monsoon system and glacial melt pose serious risks of flash flooding, particularly in the rivers Kabul, Swat, Panjkora, Bara and Kalpani Nullah. The NDMA warned of potential disruptions in transport across hilly and mountainous regions.\n\nIn Islamabad and central Punjab, strong monsoon currents are forecast to bring moderate to heavy rainfall through July 24, increasing the risk of urban flooding.\n\nMeanwhile, due to rising water levels from recent downpours, the Rawal Dam reached its full capacity of 1,748 feet. Authorities announced the opening of its spillways at 6am on Sunday to reduce the level to 1,746 feet. Residents nearby have been advised to stay cautious.\n\nThree children die in Attock\n\nIn a series of rain-related incidents in Attock, three children lost their lives on Saturday. A six-year-old girl, Fatima, drowned in a water channel in Amanpur, 12-year-old Muhammad Suleman died when the roof of his house collapsed in Bhattar, and five-year-old Umer Ayub was electrocuted in Ghourghushti after touching a live electric pole.\n\nMeanwhile, in an incident unrelated to the rains, a man was shot dead in Mirza village in a targeted attack. Police said Inayat Rehman, 45, was going towards the mosque when two men hiding in a restaurant opened fire, killing him on the spot.\n\nOver 1,500 rescued in Punjab\n\nIn Punjab, Rescue 1122 has rescued 1,594 people since June 25 in rain and flood-related emergencies, according to Secretary Emergency Services Dr Rizwan Naseer. Of these, 449 were seriously injured and shifted to hospitals. Moreover, 119 deaths have been confirmed, the majority due to the collapse of dilapidated buildings.\n\nRescue efforts included pre-emptive evacuation of 444 residents from high-risk areas and the deployment of over 100 boats and 312 rescue personnel. Lahore recorded the highest deaths at 27, followed by 15 in Faisalabad, 11 in Sheikhupura and 10 in Rawalpindi.\n\nSince June 25, 369 building collapse incidents, 23 electrocutions, 62 rain-related crashes and multiple other emergencies have been reported, Dr Naseer said.\n\nHe urged the public to inspect rooftops, avoid contact with electric poles during rainfall and check forecasts before travelling to flood-prone or mountainous regions.\n\nMeanwhile, Chief Minister Maryam Nawaz Sharif directed the immediate restoration of flood-affected roads. Key arteries including Pind Dadan Khan-Jhelum Road, Matta Khurd Road, and Chakwal-Kallar Kahar Road have been reopened. In Rawalpindi, the Crowley Dhok Bridge and Dhok Parwana Road, damaged by floodwater, were also made accessible.\n\nThe chief minister also visited Chakwal on Saturday, where she announced Rs5 million in compensation for families of the deceased.\n\nFive lives were lost in Chakwal’s record-breaking 430mm downpour earlier in the week. CM Maryam chaired a briefing at the district complex and commended district officials for their round-the-clock rescue efforts.\n\nShe ordered the evacuation of families from houses deemed vulnerable ahead of the next spell, and ordered the installation of a steel bridge at Dumman on the Chakwal-Sohawa Road, a key artery damaged by soil erosion. She also sought reports on privately built mini-dams, which worsened flooding in parts of Chakwal and Talagang.\n\nThe Punjab government on Saturday decided to ensure drainage in private housing societies, install modern alarm systems around Rawalpindi Nallah Lei and evacuate people living near the basins of Ravi, Sutlej and Beas rivers.\n\nIntensified monsoon\n\nNDMA Chairman Lt Gen Inam Haider Malik stated that this year’s unusually severe monsoon season, which he said began a month earlier than usual in July, was forecast by the authority four months in advance.\n\nHe said the current monsoon season has intensified by up to 60pc compared to previous years. In an interview with PTV News, he emphasised that comprehensive disaster response measures had been put in place under the guidance of the prime minister, with coordinated efforts from the armed forces, PDMAs and key stakeholders including NGOs and industries.\n\nHe attributed the heightened rainfall and disaster risk to climate change and accelerated glacier melting.\n\nImran Gabol in Lahore, Aamir Yasin in Rawalpindi, Amjad Iqbal in Taxila and Nabeel Anwar Dhakku in Chakwal also contributed to this report\n\nWith input from APP\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/20074337c7ebb9a.jpg",
  "retrievedAt": "2025-08-17T20:49:34.295Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925323",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:16.000Z"
}
