{
  "title": "Rahul presses Modi for answers after Trump’s jets claim - World - DAWN.COM",
  "author": null,
  "content": "INDIA’S opposition Congress party has demanded that Prime Minister Narendra Modi provide a clear explanation after US President Donald Trump claimed that five fighter jets were shot down during the recent military confrontation between India and Pakistan.\n\nCongress leader Rahul Gandhi led the charge on Saturday, calling on Modi to address the nation regarding the fate of the jets.\n\n“Modi ji, what is the truth about the five [jets]? The country has the right to know!” Mr Gandhi posted on X, as criticism from the opposition mounted over the government’s han­­dling of the brief but intense conflict.\n\nThe controversy erupted after Trump, speaking at a White House dinner with Republican lawmakers on Friday, said, “In fact, planes were being shot out of the air. Five, five, four or five, but I think five jets were shot down actually,” referring to the hostilities between the nuclear-armed neighbours.\n\nIndian premier asked to ‘speak truth’\n\nTrump did not specify which side’s aircraft were downed, nor did he provide further details.\n\nFollowing the India-Pakistan war, Trump has repeatedly taken credit — over 60 times — for brokering the ceasefire he announced via social media on May 10, after Washington engaged in backchannel diplomacy with both sides.\n\nHowever, India has challenged his claim, disputing that the truce resulted from US intervention or the threat of cutting trade ties if hostilities continued.\n\nCongress general secretary-in-charge (communications) Jairam Ramesh accused Modi of failing to address Trump’s repeated assertions.\n\n“The Trump missile gets fired for the 24th time with the same two messages, two days before the Monsoon Session of Parliament begins,” Mr Ramesh said.\n\n“The prime minister has to now himself make a clear and categorical statement in Parliament on what President Trump has been claiming over the past 70 days.”\n\nAs the Indian Parliament prepares to convene for the monsoon session, the opposition has signalled that it will continue to press Mr Modi for answers.\n\nThe escalation between India and Pakistan was triggered by an attack in Pahalgam in India-held Kashmir in April.\n\nThe attack, which killed 26 men, led to a rapid military escalation, with Islamabad responding to what it called New Delhi’s “unprovoked strikes”. A ceasefire was brokered days later, following US intervention on May 10.\n\nPakistan has claimed it downed six Indian planes in air-to-air combat, while India’s top military official acknowledged in late May that the country suffered losses in the air on the first day of hostilities before switching tactics and regaining the advantage ahead of the ceasefire.\n\nOn May 10, Mr Trump announced on social media that Washington had held talks with both sides. “These are two serious nuclear countries and they were hitting each other,” he said.\n\n“We said, you guys want to make a trade deal. We’re not making a trade deal if you’re going to be throwing around weapons, and maybe nuclear weapons.”\n\nIndia, however, has pushed back against Trump’s claims, insisting that the ceasefire was the result of direct talks between New Delhi and Islamabad, without outside intervention.\n\nIndia maintains that it does not accept third-party mediation in its disputes with Pakistan.\n\nThe US counts both India and Pakistan as important partners in the region, with Washington seeking to deepen ties with New Delhi as part of its strategy to counter China’s influence in Asia.\n\nThe attack in India-held Kashmir, which New Delhi blamed on Pakistan, brought the two nuclear-armed countries to the brink of their fifth all-out war. Islamabad has denied any involvement and called for a neutral investigation.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:52:01.906Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925298/rahul-presses-modi-for-answers-after-trumps-jets-claim",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:21.000Z"
}
