{
  "title": "Beyond the surplus - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S current account posted a full-year surplus of $2.1bn — about 0.5pc of GDP — in FY25, marking the first such outcome in 14 years.\n\nAccording to State Bank data, the turnaround from a deficit of $2.07bn in the previous fiscal reflects a sharp though fragile improvement in external balances.\n\nThe surplus coincides with a rise in foreign exchange reserves to $14.5bn, enough to cover 10-12 weeks of compressed imports, but still less than the $16bn in bilateral debt rolled over annually by China, Saudi Arabia and the UAE to help Islamabad avert a default.\n\nThe development has led to celebratory statements from top officials. A current account surplus indicates that a country is exporting more goods and services than it imports, and also has a positive net income and transfers in the form of investment and official flows from abroad.\n\nHowever, this is not the case here.\n\nWe continue to spend more on the import of goods and services compared to what we export. The country continues to run a large trade deficit of over $29bn in goods and services, despite tight import controls.\n\nWith merchandise exports stagnating at $32bn — just 8pc of GDP — Pakistan is among the weakest global performers in trade competitiveness. Meanwhile, foreign private investment has plateaued around $2.5bn, or 0.6-0.7pc of GDP, one of the lowest regionally. Although we remain under an IMF programme, financial inflows from multilateral and bilateral sources have thinned.\n\nThe financial account shows subdued investment activity, limited credit access and stalled external borrowing, reflecting structural weaknesses. The government has failed to tap international bond markets due to poor credit ratings and investor scepticism over the quality of macroeconomic improvements. The current account surplus has materialised almost entirely due to a 27pc jump in remittances, which hit a record $38bn in the last fiscal. That is the real driver of the surplus — not a boost in exports or foreign inflows.\n\nThe surge in remittances offers only short-term relief. It is not a reliable or sustainable strategy for long-term balance-of-payments stability. Dependence on these inflows is akin to living on borrowed time.\n\nIt is no wonder that the economy is facing an acute dollar shortage, reviving grey market activity as demand for the greenback far exceeds supply, despite the current account surplus. The long-term solution to our recurring balance-of-payments crises lies in resolving the structural gaps such as low productivity, stagnant exports and weak competitiveness.\n\nWithout addressing these, the balance-of-payments outlook will remain vulnerable. A surplus driven by remittances and import curbs is hardly the foundation for sustainable growth. Real economic stability requires reforms, investment and export-led expansion — not temporary fixes like debt rollovers and import compression.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1820134994a36f5.jpg?r=201650",
  "retrievedAt": "2025-08-17T20:49:42.340Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925382/beyond-the-surplus",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:49:14.000Z"
}
