{
  "title": "Genocide keeps Bibi in saddle - World - DAWN.COM",
  "author": null,
  "content": "IT is not surprising that the New York Times has reported that Israeli Prime Minister Benjamin (Bibi) Netanyahu prolonged the Gaza war (genocide) to save himself from prosecution on corruption charges and to maintain his hold on government.\n\nWhat is surprising is how the democratic West, most notably the US, UK, Germany and France, claiming to be wedded to the ‘rules-based order’, unconditionally supported him and how the Arab/Muslim governments acquiesced in the mass murder of Palestinians in the Strip, by serving as conduits for essential supplies.\n\nThere can be no doubt that its very own kind of ‘final solution’ is being forced on Gaza, where the mass destruction of all infrastructure, from homes to hospitals to educational institutions, water, power and sewerage lines, is still continuing 22 months after the Hamas attack on Israel left 800 civilians and 400 security personnel dead, with many taken hostage (around 50 of the latter, including 20 alive) remain in Hamas captivity.\n\nNetanyahu has walked away from deals which could have seen the hostages return and reunited with their families in exchange for thousands of Palestinians who are no more than hostages of the apartheid State themselves, having been imprisoned on the so-called administrative orders of military courts, having no legal validity under the international law of human rights conventions.\n\nEver since US President Trump touted his ‘Gaza Rivera’ plan and was enthusiastically backed by Netanyahu, as it called for the displacement of some two million Gaza Palestinians from the Strip, Israel has stepped up not only the destruction of Gaza, having flattened some 80 per cent of the homes there, but also the mass murder of members of the intelligentsia.\n\nThe world that rightly said ‘never again’ is tolerating what is happening in Gaza.\n\nOn Friday, informed US website Axios reported that the Israeli external security service Mossad’s chief arrived in Washington to ask the US to exercise its influence on Indonesia, Libya and Ethiopia to accept those to be forcefully displaced in Nakba-II from Gaza.\n\nIt is beyond hypocritical of the US and even Israel to claim nobody will be ‘forced’ to leave and any displacement will be ‘voluntary’. Yes, hypocritical, because when some 58,000 people, including 15,500 children and a large number of non-combatant women, have been killed and the genocidal Israeli regime is obliterating any infrastructure that enables or supports the most basic form of ‘life’, what is ‘voluntary’? It is ethnic-cleansing.\n\nA young doctor working at a top trauma centre in the UK told me the week before last that three of his colleagues who rotate to Gaza to work there, saving lives on a voluntary basis, narrated a horrific experience. All of them carry on their person satellite identifiers which emit a signal that is used to pinpoint their exact location. The IOF monitors these signals.\n\nHe said that his colleagues told him that one day they worked 12 hours non-stop to carry out emergency operations at a Gaza hospital and left together after finishing their work. Half an hour later the hospital was bombed. IOF does seem to avoid killing Westerners working in Gaza, but no such consideration is shown towards the Palestinian healthcare staff, including doctors. The latter’s mass murder has been ‘normalised’, just like the mutilation and killing of young children. The Palestinians are seen as sub-human.\n\nAfter their mass murder and destruction of their homes and all infrastructure, the ultimate weapon is being used against them now. Hunger and starvation. The US-based organisation Gaza Humanitarian Foundation with its mercenaries, working in tandem with IOF, have created new killing fields in Gaza. The ‘food’ distribution points they are running are no more than extermination traps, with dozens of starving people being mowed down by automatic gunfire on a daily basis. The ‘we cherish our values’ West finds nothing unconscionable in this.\n\nEven this weekend, UNRWA made a plea in a tweet that it has food stocks to meet Gaza’s needs for three months and begged the authorities to open the gates of Gaza (no more than a prison of death, destruction and annihilation) so they could deliver supplies to the starving and desperate Palestinians who are forced daily to brave a hail of bullets to get a sack of flour to feed themselves and their families.\n\nThe Holocaust was one of the worst crimes against humanity of the last 100 years. The world that rightly said ‘never again’ is tolerating what is happening in Gaza. Why, is a question that baffles. Whether the Western world and the region’s despots endorse Netanyahu’s definition of the Palestinians as ‘Amalek’ (evil that should be eliminated), is not important. What is, is their arming, funding and unconditional support to a regime that is being called out for genocide by notable Jewish genocide scholars who, till a few months ago, were reluctant to reach that conclusion.\n\nInstead of reflecting on their policy, that has left in tatters their ‘rules-based order’, the US and its European partners — the UK, France and Germany to name a handful — are prosecuting and persecuting their own citizens who find the Gaza genocide a crime against humanity, a war crime, and protest. And this targeting has not spared Jewish citizens whose conscience does not allow them to be silent. This includes Holocaust survivors and the families of Holocaust survivors.\n\nAgainst this utterly depressing backdrop, there is a faint ray of hope in the muted suggestions that Netanyahu is waiting for July 28 to move on a peace deal due to privately conveyed international pressure, when the Israeli parliament and the supreme court go for a nearly three-month summer break.\n\nThis, so that his far-right (can you believe there is a right to Bibi’s right too?) coalition partners can’t topple his government and also the Supreme Court may not take up the corruption charges against him. This point of view holds that a peace deal will be followed by elections that Netanyahu now believes he can win. Admittedly, this is clutching at straws, but what more does one have?\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687c23a0ce320.jpg",
  "retrievedAt": "2025-08-17T20:49:57.709Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925379/genocide-keeps-bibi-in-saddle",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:49:01.000Z"
}
