{
  "title": "Rice slump drags down FY25 food shipments - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s raw food exports fell by nearly 4 per cent to $7.116 billion in FY25 from $7.369bn a year earlier, largely due to a sharp drop in rice exports.\n\nThe decline in raw food exports marks the end of a 20-month streak of uninterrupted growth, despite persistently high food inflation.\n\nAccording to data compiled by the Pakistan Bureau of Statistics (PBS), the export of traditional value-added products saw only marginal growth during the fiscal year.\n\nRice exports fell by 14.72pc year-on-year to $3.353bn from $3.931bn. While the volume of basmati rice exports increased by 4.48pc to 808,643 tonnes, its value dropped by 5.3pc to $830.57 million. Non-basmati rice exports decreased by 17.42pc in value to $2.522bn, with a 4.65pc decline in quantity to 5.009m tonnes.\n\nMeat exports also declined by 3.24pc in FY25. Domestic meat prices have surged significantly, with buffalo meat prices more than doubling from Rs700 to Rs1,600 per kg over the past three and a half years.\n\nExports of vegetables and fruits decreased by 14.53pc and 10.29pc, respectively. However, fish and fish product exports grew by 13.44pc during the same period.\n\nIn June 2024, the government allowed the export of 150,000 tonnes of sugar, but actual exports soared to 757,779 tonnes by March 2025. Since then, the government has imposed restrictions on further sugar exports.\n\nNon-textile shows mixed trend\n\nNon-textile exports were primarily driven by a few value-added segments, including leather, footwear, and engineering products. Engineering goods exports rose by 16.46pc, led by increased shipments of industrial machinery, transport equipment, auto parts, and rubber tyres.\n\nCement exports saw a 28.71pc increase in quantity and a 23.74pc rise in value. Footwear exports climbed 8.88pc, mainly due to a 10.12pc increase in leather footwear. Leather manufacturers’ exports rose by 4.87pc, with leather gloves contributing significantly with 11.8pc growth. Raw leather exports recorded a marginal rise of 0.45pc.\n\nPakistan remains a key global supplier of surgical instruments, but their export value remains low as foreign companies rebrand many products. This category saw only a modest 1.61pc growth.\n\nExports of carpets and rugs declined by 4.24pc, while sports goods dropped 2.74pc. Gur (jaggery) exports — not categorised under food — saw a steep fall of 34.82pc.\n\nJewellery exports rose by 10.59pc, handicrafts by 45.38pc, and furniture exports fell by 8.36pc. Molasses exports plunged by 68pc, while gem exports were down by 12.12pc.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/100929486865c94.jpg?r=093156",
  "retrievedAt": "2025-08-17T20:50:57.549Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925339/rice-slump-drags-down-fy25-food-shipments",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:55.000Z"
}
