{
  "title": "Retailers’ ignorance fuels illicit cigarette trade: study - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The illi­cit cigarette trade in Pak­is­tan has emerged as a ser­ious economic and public health concern, driven by weak regulatory enforcement and a significant knowledge gap among retailers, according to a new study.\n\nThe report, titled ‘Tax Stamps and Illicit Cigarette Sales in Pakistan: Understanding Retailers’ Knowledge Gap’, was released by Umeed-i-Sehar, a non-profit organisation focused on public health initiatives. Based on a survey of 2,000 retailers in seven major cities — including Karachi, Lahore and Islamabad — the study paints a troubling picture of regulatory neglect and widespread retailer unawareness.\n\nAn overwhelming 97pc of retailers said they had never been approached by Federal Board of Revenue (FBR) officials for compliance guidance, while 86pc were unaware of the government-imposed penalties for selling illicit cigarettes.\n\nOnly 27pc of retailers could differentiate bet­ween tax-paid and illicit cigarette packs.\n\nMeanwhile, 73pc did not understand the placement or purpose of tax stamps, relying instead on price as the main indicator of legality. While 86pc cited low price as the deciding factor, just 12pc considered the presence of a tax stamp.\n\nRegarding inventory, 59pc of retailers estimated that 30-60pc of the cigarette packs they sold lacked tax stamps, while 29pc believed that over 60pc of their stock was illicit.\n\nThe findings highlight the pivotal role retailers play in sustaining the illicit cigarette trade, which continues to undermine legitimate businesses. With over 50 local and international manufacturers and an estimated annual consumption of 80bn sticks, Pakistan’s tobacco industry faces significant challenges as illicit sales steadily erode the market share of tax-compliant firms.\n\nThe FBR had introduced the TransAct App to help retailers verify tax stamps, but the study revealed that 98pc of respondents were unaware of the app, and 99pc had never used it.\n\nAdditionally, 43pc of retailers said that consumer promotions and advertisements promoting cheaper, untaxed cigarettes influenced their purchasing decisions. Another 31pc cited high demand and low pricing as key factors behind stocking illicit brands.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/221018265303333.jpg?r=110229",
  "retrievedAt": "2025-08-17T20:51:19.208Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925344/retailers-ignorance-fuels-illicit-cigarette-trade-study",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:55.000Z"
}
