{
  "title": "‘Confident’ Pakistan ready for BD challenge, says Salman - Sport - DAWN.COM",
  "author": null,
  "content": "DHAKA: Pakistan captain Salman Agha is confident his new-look side is shaping up well towards next year’s World Cup as they take on Bangladesh in a Twenty20 series starting in Dhaka from Sunday.\n\nSalman has been leading the short format side with star batsmen Babar Azam and Mohammad Rizwan out since last year. Pace spearhead Shaheen Shah Afridi has been rested for the three-match series and seam bowlers Haris Rauf, Naseem Shah and Mohammad Wasim are also missing because of injuries.\n\nHe said the missing players could still be considered for the T20 World Cup in India and Sri Lanka next year.\n\n“We have changed the way we want to play but we are confident of our build-up and direction,” said Salman on Saturday. “We are going for this series with ample preparations as Bangladesh can be a challenging team in their home conditions. We know what the challenges will be thrown to us.”\n\nAdapting to conditions in Bangladesh would be key, Salman stressed with the wicket at the Sher-e-Bangla Cricket Stadium having a history of producing slow and low wickets, which often favour spinners.\n\n“Of course, condition does play a vital role wherever you go, because you have to give respect to the conditions… I think not only here, wherever you go in the world, the conditions will always play a key part,” he said.\n\n“Assessing the conditions is always going to be key. We will see what the conditions are and how we want to play. If the conditions allow us to play that aggressively, we will play. If they don’t, we’ll adjust accordingly. We want to score above par when we are batting and when we are bowling we want to restrict teams below over-par [totals].”\n\nNew Zealander Mike Hesson is Pakistan’s new white-ball coach. His first assignment was a 3-0 series win at home against Bangladesh last month.\n\nWith leg-spinner Shadab Khan also injured, Pakistan have picked two uncapped fast bowlers in Salman Mirza and Ahmed Daniyal.\n\n“The two fast bowlers are very exciting … they’re very good and I’m happy to have them on the team,” said Salman.\n\nSalman said the team was focused on playing good cricket, adding the team will be able to count on the experience of the players who have featured in the Bangladesh Premier League.\n\nThe majority of cricketers in Pakistan’s squad, namely Fakhar Zaman, Mohammad Haris, Saim Ayub, Faheem Ashraf, Khushdil Shah, Mohammad Nawaz, Hussain Talat, and Abbas Afridi, have played for various franchises in recent editions of the BPL.\n\n“Some players [in the side] have played in the BPL which is very important for experience,” said Salman. “We’ve had a chat with them and gained inputs.\n\n“We had a camp in Karachi where we tried to make the same pitches that we would face here. We practice [the situations] we will face in the games. We create scenarios that we will get and try to make sure we are game-ready.”\n\nBangladesh won a T20 series 2-1 in Sri Lanka last week.\n\n“What happened in Sri Lanka is in the past,” said captain Liton Das. “We have to face a new challenge starting tomorrow. We are ready for this challenge. We have the mentality to beat any team, but we have to play well on the particular day and not entirely bank on home conditions.”\n\nLiton, however, hoped there would be sporting wickets at the Sher-e-Bangla Stadium for the Pakistan series.\n\n“I agree that many players’ careers have gone down because of this surface,” Liton stated. “If I were a bowler, maybe my career would have improved playing here.\n\n“Obviously, the Bangladesh team has developed, as we’ve won those series here, and that’s a big plus. But at the same time, it’s been tough for batters. I don’t think it will be the same here again. The wicket looks good, and I hope it will be an even game.”\n\nLiton claimed that batters particularly suffered in two series back in 2021 against Australia and New Zealand, where Bangladesh won both series but received a lot of criticism for the tailor-made rank-turner wickets.\n\n“First of all, it’s not like batters always struggle here. Let me be clear, particularly batters faced difficulties in those two series [in 2021]. Yes, it’s challenging. The spinners get turn, but it’s not that runs don’t come at all. It offers help to pacers,” said Liton.\n\n“It’s a sporting wicket. It’s balanced for both teams, not just us. Pakistan have good pacers, quality spinners, and solid batters. We have to play good cricket, and that’s our target.”\n\nBangladesh have kept the same squad that went to Sri Lanka. The second and third matches are on Tuesday and Thursday, also in Dhaka.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2010333382d83b4.jpg",
  "retrievedAt": "2025-08-17T20:50:50.120Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925308/confident-pakistan-ready-for-bd-challenge-says-salman",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:48:23.000Z"
}
