{
  "title": "Seafood exports rise 13pc to $465mn - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan’s seafood exports rose to $465 million in FY25, reflecting a 13.4 per cent increase in value and an 8pc growth in quantity compared to the previous year, according to data released by the Pakistan Bureau of Statistics (PBS).\n\nThe country exported 216,350 tonnes of fishery products during FY25, up from 199,738 tonnes worth $410m in FY24. The Pakistan Fisheries Exporters Association (PFEA) attributed the increase to the dedicated efforts of fishermen and fish processors, who managed to expand the country’s footprint in the global seafood market despite tough conditions.\n\nPFEA Senior Vice-Chairman Saeed Fareed stated that the international seafood market remains depressed due to lingering trade disruptions caused by the tariff regime of the Trump administration. Demand has significantly weakened across Southeast and Far East Asian countries, particularly in China — the world’s largest seafood market.\n\nMr Fareed noted that limited access to high-value markets such as the European Union and the US ban on shrimp imports from Pakistan continue to hinder further growth. He said a sharp decline in raw material supply has forced most seafood processing plants to operate at just 20-25pc of their installed capacity.\n\nCapacity remains underutilised due to raw material shortages and market access issues\n\nOnce the country’s top seafood export, shrimp landings have drastically fallen over the past two decades. Pakistan’s seafood exports are now primarily reliant on cuttlefish, squid, and octopus.\n\nCiting studies by the Marine Fisheries Department and the UN’s Food and Agriculture Organisation (FAO), Fareed warned of a deteriorating fish stock situation. He urged the government to introduce urgent conservation and resource management measures and to formally engage with the European Commission, Saudi Arabia, and the United States to facilitate inspection missions for reopening market access for all certified processing plants.\n\nIndustry sources have said that exporters have long been striving to surpass the $500 million mark in seafood exports, but face considerable structural and regulatory challenges.Prime Minister Shehbaz Sharif had last year ordered a comprehensive revamp of the maritime sector, including fisheries.\n\nThe proposed initiatives included cluster-based shrimp farming in Sindh and Balochistan, collaboration with Iran on shrimp farming, setting up shrimp hatcheries, banning the use of trash fish in fishmeal production, and reducing post-harvest losses through on-board freezing technologies.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687c1a8eb87a5.jpg",
  "retrievedAt": "2025-08-17T20:51:09.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925340/seafood-exports-rise-13pc-to-465mn",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:55.000Z"
}
