{
  "title": "Civil society writes to CM Punjab to reconsider Yellow Line project - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Various civil society organisations on Saturday wrote a joint letter to Punjab Chief Minister Maryam Nawaz, raising serious concerns at the proposed Yellow Line project on the Canal Road.\n\nThe organisations include Lahore Conservation Society, WWF (World Wide Fund for Nature), IAP (Institute of Architects Pakistan), PCATP (Pakistan Council of Architects and Town Planners), HRCP (Human Rights Commission of Pakistan), Heritage Foundation & INTBAU, Shirkatgah, Heritage Pakistan, SOCH, Pilac, Sarang, WAF, CROM Lahore, Lahore Sangat, Urban Resource Centre and the Sarhad Conservation Network. The letter highlights the social, environmental and cultural costs of the project, which the coalition believes, could cause irreversible damage to the city.\n\nThe letter outlines key issues, stating that the project contravenes Supreme Court’s orders and violates the Canal Urban Heritage Park Act 2013, besides violating international convention. The project, if executed, will violate Unesco’s World Heritage Convention.\n\nIt further states that the project lacks public consultation, as required under the Lahore Master Plan 2050. Moreover, civil society’s approval for major development projects has not been sought.\n\n“There is a lack of transparency regarding the environmental approval process for the project. There is neither evidence of a public Environmental Impact Assessment (EIA), nor have key stakeholders or civil society been consulted — as mandated under the Pakistan Environmental Protection Act, 1997. The project threatens one of Lahore’s most important green corridors, which serves as a vital ecological buffer and oxygen source for the city. Approximately 1,400 mature trees are slated to be removed along the Canal Road, from Thokar Niaz Beg to Harbanspura,” it explains.\n\nThe proposed cost of over PKR 80 billion places a heavy financial burden on the public. Citizens demand that priority be given to urgent needs such as clean drinking water, improved sanitation and storm drainage systems, healthcare, and education.\n\n“The coalition urges the government to consider sustainable, low-impact transport solutions that align with global best practices. These include electric bus rapid transit with tree protection and tagging legislation, enacting and enforcing laws to protect and monitor Lahore’s urban trees,” it desires.\n\nThe letter seeks green zoning laws, policies, etc that prioritise the preservation of green spaces.\n\n“In addition, the coalition urges the government to redirect resources toward critical public services — such as clean water supply, improved sanitation and storm drainage, quality healthcare, and access to education – which are essential for a just, healthy, and resilient city,” the letter says.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/17125335d84774f.png?r=125343",
  "retrievedAt": "2025-08-17T20:50:12.953Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925349/civil-society-writes-to-cm-punjab-to-reconsider-yellow-line-project",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:48:42.000Z"
}
