{
  "title": "Lahore traders protest forces govt to postpone Circular Garden plan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The government has postponed its plan to demolish nearly 2,300 shops at Circular Road markets till provision of some alternative to the traders to avert further resistance to the restoration of Circular Garden launched by the Lahore Authority for Heritage Revival (LAHR).\n\nThe operation to raze shops has also been stopped keeping in view the protests amid massive anger and criticism by the traders.\n\n“There are as many as 2,285 shops in the area of Circular Garden. These shops had been constructed gradually in the past by the people by encroaching the entire garden developed in the British era after dismantling some walled city gates,” Lahore Deputy Commissioner Syed Musa Raza said while talking to Dawn on Saturday.\n\n“After encroaching the garden, the then administration/government declared them tenants and started getting monthly rent from them so as to earn revenue,” he added.\n\nUnderground markets to be built at three sites to relocate traders\n\nAccording to him, since the Circular Road turned to be a busiest place, the problems related to massive traffic jams, pollution and other civic issued continued increasing leaving the government with no option but to get rid of this mess. And finally, the government established a new authority (LAHR) to restore the garden, widen the Circular Road and do some other interventions to protect the heritage sites.\n\nSince this all was not possible without demolishing the shops, an operation was launched by the city administration. But the traders showed resistance demanding to first provide them with some alternative and then demolish their shops.\n\n“Earlier, we thought to provide them compensation including payment equal to their one-year profit on sale. But they didn’t agree, demanding to provide them with alternative shops. And finally a project was designed to construct underground parking lots with spaces dedicated for new shops at three spots, including Taxali, Sheranwala and Mochi gates. We also accepted their demand not to get the existing shops vacated till completion of underground plazas and markets,” DC Mr Raza said, adding that LAHR is mandated to restore and conserve the historical sites.\n\nTo a question, he said the project for affectees would be executed by the communication and works department.\n\nOn the other hand, Punjab Housing Minister Bilal Yasin held a meeting with the representatives/presidents of 18 Circular Road traders’ unions at DC office on Saturday.\n\n“The government has accepted your demands. And till completion of new shops [underground], you will not be relocated,” the minister, who was accompanied by Lahore DC Musa Raza and LDA Vice Chairman Mian Marghoob Ahmad, told the trader representatives.\n\nHe said Mian Nawaz Sharif, who also heads the LAHR as chairperson, has directed to construct the shops, parking plazas etc as per international standards.\n\nDuring the first phase, 2,285 shops and godowns would be constructed. The new markets would have all civic facilities - water, drainage, electricity, security. The shopkeepers would also have parking space for their vehicles, he added.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/11095605e9eac17.jpg",
  "retrievedAt": "2025-08-17T20:50:24.345Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925352/lahore-traders-protest-forces-govt-to-postpone-circular-garden-plan",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:48:42.000Z"
}
