{
  "title": "Trump, Xi might meet ahead of or during October APEC summit in South Korea, SCMP reports - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump might visit China before going to the Asia-Pacific Economic Cooperation summit between October 30 and November 1, or he could meet Chinese leader Xi Jinping on the sidelines of the APEC event in South Korea, The South China Morning Post reported on Sunday, citing multiple sources.\n\nThe two countries have been trying to negotiate an end to an escalating tit-for-tat tariff war that has upended global trade and supply chains.\n\nThe two sides have discussed a potential meeting between the leaders in the region this year, but they have not confirmed a date or location yet, according to a person familiar with the matter.\n\nTrump has sought to impose tariffs on US importers for virtually all foreign goods, which he says will stimulate domestic manufacturing and which critics say will make many consumer goods more expensive for Americans.\n\nHe has called for a universal base tariff rate of 10 per cent on goods imported from all countries, with higher rates for imports from the most “problematic” ones, including China: imports from there now have the highest tariff rate of 55pc.\n\nTrump has set a deadline of August 12 for the US and China to reach a durable tariffs agreement.\n\nA spokesperson for Trump did not respond to a request for comment about the reported plans for a meeting with Xi in the autumn.\n\nThe two countries’ most recent high-level meeting was on July 11, when US Secretary of State Marco Rubio and Chinese Foreign Minister Wang Yi had what both described as a productive and positive meeting in Malaysia about how trade negotiations should proceed.\n\nRubio said then that Trump had been invited to China to meet with Xi, and said that both leaders “want it to happen”.\n\nOn Friday, China’s Commerce Minister Wang Wentao said China wants to bring its trade ties with the US back to a stable footing and that recent talks in Europe showed there was no need for a tariff war.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/1616381794f0139.jpg?r=171601",
  "retrievedAt": "2025-08-17T20:48:44.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925451/trump-xi-might-meet-ahead-of-or-during-october-apec-summit-in-south-korea-scmp-reports",
  "dateList": "2025-07-20",
  "date_published": "2025-07-20T16:47:16.000Z"
}
