{
  "title": "Subsidised wheat stocks exhaust in GB amid supplies delay - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: A severe wheat shortage is intensifying across Gilgit-Baltistan (GB), depleting the region’s reserve stocks and raising fears of a food crisis after the federal government failed to release subsidised supplies more than two weeks into the new fiscal year, GB food department has said.\n\nOfficials with the food department said that wheat stocks have been completely exhausted.\n\nGB residents rely almost entirely on the subsidised wheat supplied annually by the federal government.\n\nWhile the federal government allocated Rs20 billion in its budget to procure over 170,000 tonnes of wheat for Gilgit-Baltistan for the current fiscal year, officials said not a single sack has been delivered.\n\nThe delay is putting immense strain on locals who say they cannot afford to buy flour from the open market.\n\nOfficials say not a single bag delivered though federal govt allocated Rs20bn for the purpose in budget\n\n“Local people make their monthly expenditure budgets according to the subsidised rate,” Imtiaz Hussain, a local resident, told Dawn. “The current shortage is causing trouble.”\n\nMr Hussain said the community is facing significant difficulty and demanded that the “federal government release the subsidised wheat without further delay.”\n\nThe situation has been worsened by recent flash floods and torrential rains, which have severely damaged road infrastructure and made transporting goods to remote areas extremely difficult.\n\nAn official with the food department told Dawn that the last of the small reserve stocks were distributed during the recent floods and are now gone.\n\nHe noted that frequent landslides on the Karakoram Highway, the Baltistan road, and other key routes have severely disrupted supply chains.\n\nTransporting goods from Pakistan Agricultural Storage and Services Corporation (Passco) warehouses in Islamabad to GB can now take several weeks, the official said.\n\nThe delivery of the remaining limited wheat from regional warehouses in Gilgit to remote areas also remains delayed because of blocked roads.\n\nOfficials fear that any further delay in supplies could plunge GB into a full-scale food emergency.\n\nPublished in Dawn, July 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687c2115d14f0.jpg",
  "retrievedAt": "2025-08-17T20:51:55.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925368/subsidised-wheat-stocks-exhaust-in-gb-amid-supplies-delay",
  "dateList": "2025-07-20",
  "date_published": "2025-07-19T23:47:27.000Z"
}
