{
  "title": "Seven cops ‘abducted’ in South Waziristan: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Seven police personnel of two police stations were allegedly abducted in two separate incidents on Sunday while patrolling in Khyber Pakhtunkhwa’s South Waziristan district, police said.\n\nUpper South Waziristan District Police Officer (DPO) Arshad Khan confirmed the incident and said efforts are underway to locate the policemen who went missing during routine patrolling.\n\n“Seven police personnel were patrolling when unidentified individuals took them away,” DPO Arshad told Dawn.com.\n\nHe said three policemen — Insaf, Abid and Ismail — were on patrol in the limits of Ladha police station when they went missing.\n\nIn a separate but similar incident, four policemen went missing from Tanga Chagmalai in the limits of Sarwakai police station. They include sub-inspector Abdul Khaliq, and constables Irfanullah, Habibullah and Imran.\n\nThe police officer said no information has been received about the missing policemen and a search operation is underway to locate them.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nThis comes a day after nine terrorists were killed and three security officers were injured during an exchange of fire as security forces and police carried out a joint operation in Hangu’s Zargari Shinawari area.\n\n“Hangu DPO Khalid Khan, the Doaba station house officer (SHO), and an officer of the security forces were injured in the exchange of fire,” a statement by KP Inspector General of Police (IGP) Zulfiqar Hameed read.\n\nOn June 24, two soldiers were martyred and 11 “Indian Proxy” terrorists were killed during an intelligence-based operation (IBO) in South Waziristan district, the military’s media wing said.\n\nA statement by the Inter-Services Public Relations (ISPR) said that the troops effectively engaged the terrorists’ location and “11 Indian sponsored khwarij” were killed, while seven were injured. During the intense fire exchange, Major Syed Moiz Abbas Shah and Lance Naik Jibranullah “fought gallantly and paid the ultimate sacrifice”, it added.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.\n\nKP has seen an increasing trend of terrorism-related incidents. Faced with increasing attacks by militants, security forces have also intensified counterterrorism operations in KP and Balochistan.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:49:17.196Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925434/seven-cops-abducted-in-south-waziristan-police",
  "dateList": "2025-07-20",
  "date_published": "2025-07-20T11:35:25.000Z"
}
