{
  "article_id": "2025-04-19_c20d0fcd830f9648ed6116ad252b9dd1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-un-discuss-enhanced-cooperation-in-peace-missions/",
    "retrieved_at": "2025-08-27T14:39:47.988Z"
  },
  "metadata": {
    "title": "Pakistan, UN discuss enhanced cooperation in peace missions",
    "author": null,
    "date_published": "2025-04-19T09:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 364,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 19 (APP): Federal Minister for Interior, Mohsin Naqvi, met with United Nations Under-Secretary-General for Peace Operations, General Jean-Pierre Lacroix, during his visit to the Ministry of Interior in Islamabad. The two sides discussed strengthening collaboration between Pakistan and the United Nations in peacekeeping missions across the globe. Minister of State for Interior Talal Chaudhry, Interior Secretary Muhammad Khurram Agha, and UN Secretary-General's Advisor Faisal Shahkar were also present during the high-level meeting. Welcoming the UN dignitary, Minister Mohsin Naqvi reaffirmed Pakistan's long-standing commitment to global peace and its continued support for UN peacekeeping efforts. He highlighted the significant contributions made by Pakistani military and police officers in various UN peacekeeping missions over the years, describing their performance as exemplary and professional. Naqvi noted that after several years, Pakistani police officers are once again actively participating in UN missions, and many are currently serving in various regions under the UN flag. \"We will continue to provide all possible support to future peacekeeping missions,\" he assured. Expressing pride in the achievements of Pakistan's law enforcement, the minister said it was a matter of honor that a senior officer from the Pakistan Police Service is currently heading UN Police operations. He stressed the importance of incorporating modern technology to enhance the effectiveness of peacekeeping missions globally. In a significant proposal, Minister Naqvi offered to host regional training courses for UN peacekeeping personnel at Pakistan's National Police Academy. He stated that the academy is undergoing a comprehensive reorganization to meet international standards and is being equipped with state-of-the-art facilities to enhance the capacity and training of police officers. He also emphasized Pakistan's commitment to gender inclusion, highlighting efforts to provide equal opportunities to women in the country's police force in line with the UN's gender policy. UN Under-Secretary-General General Jean-Pierre Lacroix appreciated the contributions of Pakistani officers and acknowledged the personal efforts of Minister Mohsin Naqvi in facilitating the re-deployment of Pakistani police personnel in UN peace missions. He also lauded Pakistan's continued dedication to promoting peace even in challenging circumstances. The meeting marks a step forward in Pakistan's collaboration with the United Nations, reinforcing its role as a vital contributor to global peace and security.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}