{
  "article_id": "2025-04-19_ea9d539b6b6c329c836c9c3225606770",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sardar-yousaf-reviews-hajj-arrangements-assesses-provision-of-vaccines-at-haji-camps/",
    "retrieved_at": "2025-08-27T14:39:40.675Z"
  },
  "metadata": {
    "title": "Sardar Yousaf reviews Hajj arrangements, assesses provision of vaccines at Haji Camps",
    "author": null,
    "date_published": "2025-04-19T15:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 19 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Saturday chaired a review meeting on Hajj arrangements assessing the provision of vaccines and other facilities at various Haji Camps across the country. Secretary Religious Affairs, Dr. Syed Ata-ur-Rehman, along with other senior officials, briefed the minister on the ongoing preparations. Sardar Yousaf said all Haji Camps are fully prepared to serve the guests of Allah (Ziyuf-ur-Rehman) during the upcoming Hajj season. He urged pilgrims to visit their designated Haji Camps according to the schedules provided in the \"Pak Hajj App\" to avoid any inconvenience. According to the briefing, vaccine administration for pilgrims will commence on April 21 in Islamabad, Lahore, Peshawar, and Multan. Meanwhile, in Karachi, Rahim Yar Khan, Sukkur, Faisalabad, and Sialkot, the vaccination drive will start from April 22. In Quetta, vaccination for intending pilgrims will begin on April 23. A temporary Haji Camp will operate in Rahim Yar Khan from April 22 to April 24 to facilitate pilgrims from the region. Pilgrims are required to receive mandatory vaccinations, collect packed medicines, and Hajj gifts from their respective Haji Camps. Additionally, two days prior to their departure, pilgrims must obtain their tickets, visas, identification lockets, stickers, and mobile SIM cards from the concerned Haji Camps.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}