{
  "article_id": "2025-04-19_b3abf05fb8f99500ff9ec492c4d0022f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pats-right-forum-to-combine-professional-military-skills-coas/",
    "retrieved_at": "2025-08-27T14:39:46.703Z"
  },
  "metadata": {
    "title": "PATS right forum to combine professional military skills: COAS",
    "author": null,
    "date_published": "2025-04-19T10:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 313,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Apr 19 (APP): Chief of Army Staff (COAS) General Syed Asim Munir, NI(M) has said that Pakistan Army Team Spirit (PATS) is the right forum, which appropriately combines professional military skills and tactical acumen of all participating soldiers fostering much needed team spirit in the face of evolving character of war. Addressing at the closing ceremony of 8th International PATS Competition, the COAS appreciated the participating teams for their professionalism, physical and mental endurance and high moral displayed during various stages of the exercise, said a news release by Inter Services Public Relations (ISPR) here Saturday. \"To this effect, Pakistan Army upholds rich soldierly attributes of \"character, courage and competence which has been amply displayed by our men in the face of fight against terrorism,\" he said and reiterated mutual learning during such exercises. The competition was conducted from 14 to 18 April 2025 at Kharian Garrison. The COAS graced the Closing Ceremony as the Chief Guest. The 60 hours long rigorous patrolling exercise was aimed at enhancing combat skills through sharing of innovative ideas / experiences by the participants of the forum. Seven teams from Pakistan Army along with a team from Pakistan Navy and fifteen teams from friendly countries including Bahrain, Belarus, China, Kingdom of Saudi Arabia, Maldives, Morocco, Nepal, Qatar, Sri Lanka, Turkiye, United States of America and Uzbekistan participated in the exercise. Additionally representatives from Bangladesh, Egypt, Germany, Kenya, Myanmar and Thailand witnessed the exercise as observers. The exercise was conducted in the semi mountainous terrain of Punjab. Over the years, the exercise has gained much prominence as a very competitive professional military activity for the friendly countries, it further said. Towards the end, the COAS gave away individual and team awards to the participants of the exercise. International observers and Defence Attaches of participating countries also attended the ceremony and appreciated the professional conduct of the event.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}