{
  "title": "Ashrafi calls for global support for Palestine, unity among Muslims",
  "link": "https://www.app.com.pk/national/ashrafi-calls-for-global-support-for-palestine-unity-among-muslims-2/",
  "date_published": "2023-10-22T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP):Pakistan Ulema Council Chairman, Hafiz Muhammad Tahir Mahmood Ashrafi unequivocally expressed support for Palestine and called on the global community to acknowledge the rights of the Palestinian people.\nHe, addressing a recent conference organzed to express solidarity with Palestinian people under the auspicious of Pakistan Ulema Council here, raised questions about the alleged military aggression in Syria and Lebanon and said Pakistan stood with Lebanon, Iraq, Iran, and Syria, in case of any aggression from Israel.\nAshrafi hinted that if this war continued, it would not be confined to Egypt and Lebanon, it would ultimately engulf the entire world.\nHe called on the Organization of Islamic Cooperation (OIC) to provide a roadmap for the Palestinian cause urging everyone to break their silence, warning that “if Palestinian children are targeted today, it may be children from other regions tomorrow.” With the Presidency of the OIC now in the hands of Saudi Arabia, he expressed hope that it would take concrete steps to support Palestine.\nHe mentioned that Chief of Army Staff General Syed Asim Munir reiterated Pakistan’s position in the Corps Commander Conference the other day, reemphasizing their unwavering support for Palestine. Highlighting the enduring blockade of Gaza, he said it had been a prison for sixteen years raising questions about the incident on October 7, which he attributed to the denial of Palestinian due rights.\nAshrafi called for international human rights organizations to investigate the hospital attack in Gaza, stressing that the suffering of Muslim children remained unseen. He emphasized that children were children, regardless of their origins expressing concerns over America’s intention to cover up this disastrous incident.\nHe acknowledged improved relations between Saudi Arabia and Iran and Syria and Arab nations. He reaffirmed the commitment to maintaining unity within the Ummah, rejecting any sectarian division. “We will not allow anyone to divide the Muslim Ummah based on the Shia-Sunni divide,” he stated. He emphasized the importance of global unity among Muslims and discouraged any division, highlighting the need to stand up against imperialism and extremist groups that aimed to divide and weaken the Muslim Ummah.\nAshrafi warned that colonial powers sought to establish extremist organizations to disrupt the unity of Islamic countries, referencing bomb blasts and terrorist attacks as part of this conspiracy.\nHe shared insights into past attempts to incite religious tensions in Pakistan, noting that the national security institutions and scholars had worked together to thwart such nefarious designs.\nIn his closing remarks, Ashrafi called for a boycott of Israeli products and expressed that Muslim nations should come together to protest the violence against Muslims in various regions including Kashmir, Palestine, and other parts of the world.\nPalestinian Deputy Head of Mission Nader K. Alturk, expressed heartfelt gratitude towards Ashrafi and the people of Pakistan for their unwavering support for the Palestinian cause.\nDrawing attention to the ongoing crisis, he said at this moment, Israel was committing genocide in Gaza, underscoring the urgency of the situation.\nHe pointed out that the powerhouses of the world were targeting Gaza, affecting the lives of children, women, and the elderly. He lamented that Israel continued to wage a relentless war on Gaza.\nSpeaking of the devastation brought by Israeli aggression, Alturk highlighted the impact on hospitals, schools, and homes in Gaza. He reiterated the desire for peace, security, and stability as the fundamental request of the Palestinian people. He raised a significant comparison, noting that the entire world was focused on Ukraine after the Russian attack, but Palestine’s plight remained unnoticed by the global community.\nAlturk lamented the lack of global response to the Israeli invasion and occupation, which had been ongoing since 1948, contrasting it with the recent global attention on the Russian-Ukrainian conflict. He emphasized that the Palestinian issue was a double standard in the international community’s conscience. He conveyed the urgent need for international support and solidarity to address the ongoing crisis in Palestine.\nSyrian Ambassador Dr Ramez Alraee claimed that Israel had launched the air strikes on their airports including Damascus and Aleppo causing damages to the installations, infrastructure and as well as human causalities.\nCondemning the Israeli aggression in the strongest terms, he said it was continuously violating the international law and the United Nations resolutions. He said Israel was posing serious threat to Palestine, Syria, Lebanon, Iran and other countries. He said schools, hospitals, houses, and even the United Nations related buildings were being attacked by Israel in Palestine.\nDr Ramez urged the United Nations to make Israel accountable in the light of its relevant resolutions particularly 242, 338 and 497 to restore peace and tranquility in the region.\nCouncil of Islamic Ideology Chairman, Dr. Qibla Ayaz said these were very difficult days not only for Palestine and Egypt but for all the civilized nations on earth. He mentioned that the United Nations had been failure in performing its constitutional obligation to stop the Israeli aggression against the innocent people of Palestine and others. He urged the international human rights watchdogs to let the Palestinian people to live their lives with peace and prosperity on their land.\nDr. Qibla highlighted that the current situation was totally against the rules of the United Nations as in its resolutions there was no room for genocide, ethnic cleansing, madness, crime against humanity, and massacre which Israel was committing with the support of United States in Palestine.\nHe condemned the statement of United States Secretary of State Antony Blinken for supporting Israel through thick and thin claiming himself a Jew. He further termed Blinken’s statement against the diplomatic norms.\nThe conference was attended by a number of religious scholars from all schools of thought, people from all walks of life and members of foreign missions in a bid to express unity with Palestine and its people. The conference was concluded with prayers seeking peace in Palestine and unity in all ranks of Muslim Ummah on the globe.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:11:11.252Z"
}
