{
  "title": "Rs.397.7 million fine imposed on 3109 power pilferers",
  "link": "https://www.app.com.pk/national/rs-397-7-million-fine-imposed-on-3109-power-pilferers/",
  "date_published": "2023-10-22T11:49:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 22 (APP):The Faisalabad Electric Supply Company (FESCO) caught 3109 power pilferers during last 44 days and imposed a fine of over Rs.397.7 million for stealing electricity in various areas of the company during the ongoing special anti-power theft drive.\nSpokesman Tahir Sheikh said here on Sunday that over 8.579 million detection units were charged. A sum of over Rs.217.8 million was also recovered from the defaulters.\nHe said that 2996 cases were registered against power theft in various police stations whereas the police also arrested 2476 pilferers so far.\nHe further said that the FESCO teams detected electricity theft at 1021 points in Faisalabad district and imposed a fine of Rs.129.4 million on them under the head of 2.775 million detection units.\nIn Jhang district, the FESCO teams caught 309 electricity thieves and imposed a fine of Rs.47.8 million under 1143,000 detection units.\nSimilarly, 324 cases of electricity theft were detected in Bhakkar district and the company fined them Rs.42.6 million under 836,000 detection units.\nHe further said that 348 electricity thieves were caught from Chiniot district and they were imposed a fine of Rs.39.6 million under 1064,000 detection units.\nIn Khushab district, 102 consumers were found involved in electricity theft and they were fined Rs.16 million for 334,000 detection units.\nThe FESCO teams also caught 376 power pilferers from Mianwali and they were fined with Rs.38.7 million for 845,000 detection units.\nIn Sargodha district, 349 cases of electricity theft were detected. Hence, a fine of Rs.38.7 million was imposed on the electricity thieves under 845,000 detection units.\nFESCO teams also caught 244 electricity thieves from Toba Tek Singh district. The company imposed a fine of Rs.31.2 million for 624,000 detection units, the spokesman added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:11:12.102Z"
}
