{
  "title": "GRC’s Taxila Chaupal denounces Israeli atrocities against innocent Palestinians",
  "link": "https://www.app.com.pk/national/grcs-taxila-chaupal-denounces-israeli-atrocities-against-innocent-palestinians/",
  "date_published": "2023-10-22T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP):The Gandhara Resource Centre Pakistan (GRCP)’s flagship program Taxila Chaupal on Sunday denounced the worst atrocities and brutalities of Zionist Israeli defence forces against innocent Palestinians that left over a million displaced, thousands martyred and several injured.\nThe “Taxila Chaupal” organised a special ceremony for the Book Launch of “RAWAL RAAJ” by Sajjad Azhar at the prestigious Al Aziz School and College in Taxila, Pakistan.\nThe focal point of this remarkable gathering was the literary prowess of the distinguished author, Sajjad Azhar, as well as the official unveiling of his latest work, “Rawal Raj.” The program’s flawless execution was attributed by Dr. Sanober Altaf ( NUML University Islamabad)\nDistinguished guests added grace to the event with their presence, including Senior Journalist Muhammad Nawaz Raza, President Hamid Shahid, and the esteemed Dr. Rawish Nadeem.\nThe resounding denouncement of Israeli injustices and brutality, articulated with fervent words, resonated throughout the program. A poignant minute of silence was observed in solidarity with the Palestinian people.\nThe program was further enriched by the presence of Parvez Khan, a highly skilled artist and prominent member of the Gandhara Resource Center Pakistan. Hailing from Taxila himself, Paevez Khan a renowned visual artist, presented an intricately crafted portrait of Sajjad Azhar, which was received with great appreciation. In return, Sajjad Azhar generously presented Mr. Khan with a copy of his book, “Rawal Raj,” complete with his autograph.\nThe culmination of the event saw a heartfelt social prayer offered for the well-being of Muslim brothers and sisters in Palestine, followed by a convivial tea gathering for all attendees.\nAt the end of the program, Sarah Mahmood, a member of the core committee, thanked all honourable guests for their time and participation. She highlighted the global representation of the Gandhara Resource Center Pakistan through its members from various countries, including Pakistan, India, the UK, the USA, Thailand, the UAE, Canada, KSA, Germany, and Australia. This information was well-received and appreciated by the audience.\nThe core committee members, including Maalik Ushtar Ali ,Riaz Ahmed, Malik  Iftikhar Ahmed, Iftikhar Uddin Saddiqui and Iqbal Khatak expressed their sincere gratitude to the esteemed guests.\nThe event was graced by speakers Mehtab Haider, Abubakr Mushtaq, Tariq Masood, Talib Ansari, and Malik Ishtiaq Ali. Additionally, participants, such as Aleemuddin, Atiq Kashmiri, Elias Awan, Elias Khatak, Kazim Ali Shah, Master Mahboob, Mazhar Shah, Ali Abbas, Raja Noor Muhammad Nazami, Waqas Ahmed Sadiqi, Simson, Ishtiaq Ahmed, Mawakar Mehdi, Begum Mawakar Mehdi, Saniya Kazmi, Raush, Rauf Shakir, Rafaqat Ali, Hasan Ali, Adeel, Captain Omar Farooq, and Salman Tahir from the Taxila Baithak, lent their support and participation in the event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:11:16.778Z"
}
