{
  "title": "Govt provided tax relief despite financial crisis: Afradi",
  "link": "https://www.app.com.pk/national/govt-provided-tax-relief-despite-financial-crisis-afradi/",
  "date_published": "2020-06-23T23:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Minister for States and Frontier Regions (SAFRON) and Narcotics Control, Shehryar Afridi on Wednesday said despite vast economic crunch, owing to the negative impacts of coronavirus, the government did not impose any new tax in the budget for the fiscal year 2020-21 to facilitate people and business community.\nParticipating in the budget debate in the National Assembly, the Pakistan Tehreek-i-Insaf lawmaker said due to coronavirus, the world economy was witnessing greatest-ever economic depression since 1929.\nHe said Gross Domestic Product (GDP) had drastically gone down both in developed and developing countries as all the economies of the world have been engulfed by the coronavirus affects.\nThe minister said oil prices have reduced to the lowest in last 18 years, hence affecting the countries having such natural resources. In these circumstances, all think tanks are confused, even World Health Organization (WHO) was not confident what to say and what to do, he added.\nHe said this time Pakistani government presented its budget for the upcoming fiscal year under these circumstances. He said that Rs20 billion were provided for health sector and Rs64 billon for education sector by the Federal government.\nHe said that after 18th amendment every province was allocating funds for these two sectors. He said that huge amount was also allocated in the field of medicine, adding that Pakistan was now producing export quality medical products.\nHe said that the government also launched Panagah programme to provide shelter and food to poorest of the poor of the country. Likewise, the allocations under Ehsaas programme were enhanced from Rs187 billion to Rs208 billion to facilitate low income people.\nHe said that the initiatives taken by the government to highlight Kashmir issue has instilled new spirit in the people of Kashmir who remain stand steadfast to achieve freedom from India.\nHe termed the Kashmir issues as burning point, which he said had been posing a constant threat to world peace, urging world bodies to help resolve this issue.\nHe said that Imran Khan exposed Modi’s fascist policies across the globe, adding that the neighboring countries of India including Nepal, Bhutan and Sri Lanka realized the Indian approach was dangerous for all the region.\nHe said that no political party of Pakistan would compromise on Kashmir issue and nuclear programme of the country. He also highlighted the importance of making Kashmir Committee more active to highlight Kashmir issue.\nThe minister also said that nobody would be allowed to indulge in blasphemy of Prophet (PBUH), his family and companions.\nMeanwhile, participating in the debate, James Iqbal said that proper attentions were required to improve direct taxation instead of focusing on indirect taxation. He also highlighted the importance of imposing taxes on agricultural sector.\nKishwar Zehra, of Muttahida Qaumi Movement while participating in the debate urged the government to announce a package for the skillful women who have been badly affected by the impacts of coronavirus. She said that the budget presented by the government was best possible budget in the prevailing situation.\nSyed Imran Ahmad Shah, while participating in the budget debate paid rich tributes to those who are fighting coronavirus at frontline. He demanded the government to further reduce petrol prices and electricity charges.\nHe urged the government to take measures and punish those involved in blasphemy of Prophet (PBUH) and his sacred family.\nJameel Ahmed Khan while participating in the budget said that despite the corona impacts, the government presented tax-free budget.\nHe said exports, industry and businesses were affected due to the spread of COVID-19, however added that there could not have been any better budget than the one presented by the government.\nHe said the government ensured social security of millions of deserving people and also provided packages to businessmen. He said that the share of National Finance Commission (NFC) award to provinces reduced as there was low revenue collection.\nHel urged the government to remove concern over the China Pakistan Economic Corridor budget. He also urged the government to enhance developmental allocation for Karachi, which has been contributing major portion in tax collection of the country.",
  "retrievedAt": "2025-08-11T19:23:12.611Z"
}
