{
  "title": "Pilot, ATC did not follow set landing procedure, cause PIA plane tragedy: Sarwar told NA",
  "link": "https://www.app.com.pk/national/pilot-atc-did-not-follow-set-landing-procedure-cause-pia-plane-tragedy-sarwar-told-na/",
  "date_published": "2020-06-24T02:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Minister for Aviation Ghulam Sarwar Khan while presenting interim inquiry report of PIA’s plane crash in the National Assembly, on Wednesday said pilot of the ill-fated aircraft and Air Traffic Controller (ATC) had not followed the set landing procedure that caused the tragedy and claimed lives of 97 persons on May 22.\n“The pilot was over confident and attempted to land the plane before certain height despite the ATC’s warning, asking ‘I will manage it.’ The ATC did not inform the pilot about the damage occurred to the engines when the plane touched the land thrice, and took off again. The ATC should have asked for the emergency landing,” the minister said sharing the interim report findings.\nAccording the cockpit voice recorder, he said the pilot was not focused and had been discussing the coronavirus throughout the flight, even during the landing attempt.\n“The pilots were both discussing COVID-19 e coronavirus as it had affected their families and were not focused on the aircraft” he added.\nThe minister said, “The pilot and co-pilot were highly experienced and fully medically fit, but not focused.”\nSarwar said the plane was 100 percent fit and had made six flights after during May 7 -22, after the government resumed the flight operation it had suspended to contain the virus spread.\nThe minister said the interim report had been compiled based on the evidence collected from the Data Entry Recorder, Cockpit Voice Recorder, plane debris and the incident site by the inquiry team.\nSarwar said as per the data record before landing of the aircraft, the landing gear were put down, but reason unknown the gear were taken back.\nThe minister noted that the aircraft touched the runway thrice without the landing gear which caused damage to its engines.\n“When the plane took off again, both its engines had been damaged,” he said. He said that without taking instructions, the pilot again take off the aircraft.\nThe minister said that the pilots had ignored the instructions of the air traffic control on the height of the aircraft. “The pilots and the ATC both did not follow the protocol,” he said.\n“The pilot ignored the instructions of the air traffic controllers and the ATC, on the other hand, did not inform the pilot about the engine colliding”.\nHe said that the aircraft was on auto landing but the pilot dis-engaged auto landing and brought it to manual landing.\n“Those who have passed away, May God forgive them. Those who are responsible will be held accountable,” he added.\nHe said that complete report of the aircraft crash will be presented in the House during the current year.\nHe said that the Bhoja air crash and the Air Blue tragedy had been caused as a result of the pilots’ faults.\nHe said it was an interim report and assured the House that the full-fledged report would be completed in a free, fair and transparent manner along with suggested action against the responsible would be completed within a period of one year.\nSoon after the tragedy, the minister said a four-member inquiry board, consisted of three experienced officers from Pakistan Air Force and one from Civil Aviation Authority , had been constituted on the same day and later two experienced pilots of A-320 aircraft and one from Turkish airline were included in the investigation team. While, a 10-member team of French experts, including the plane and engine manufacturers, participated in the probe.\nHe recalled that in the recent past, the exact reports of inquiries, conducted into the six airplane crashes including that of Bhoja airline crash in Islamabad , Air Blue crash in Islamabad, PIA ATR plane crash in Havelian and a crash landing in Gilgit, were not made public.\nHe said the government had compensated families of the victims by giving each of them Rs one million.\nHe told that the airplane crashed over civilian population had badly destroyed 29 houses and vehicles but people remained safe except three girls who were burnt in the buildings debris. Later one of the girls died and her family was also compensated. The two injured girls were given complete medical assistance by the government and PIA.\nHe said in the past PIA was politicised and 846 pilots and technical staff of the airline got jobs on fake degrees and licences as was revealed after the checking ordered by the Supreme Court on a suo moto notice.\nThe minister said out of 860 active pilots working in various airlines of the country, 262 had not appeared in the examination.\nAbout 30 percent of pilots working in Pakistan were flying aircraft with fake licenses. He said that these pilots had not given the exams themselves nor did they have the proper flying experience, he added.\n“Pilots are also appointed on political basis, unfortunately,” he said. “Whilst appointing pilots, merit is ignored,” he added.\nSarwar said that the government will take action against PIA pilots who were found guilty of the above offenses. He urged the political parties not to politicize this issue as it linked with national security issue.\nThe Minister categorically stated that PIA would not be privatized but its restructuring would be done to regain its past glory.",
  "retrievedAt": "2025-08-11T19:23:05.069Z"
}
