{
  "title": "Education Ministry to formulate policy for opening of technical institutes: Shafqat",
  "link": "https://www.app.com.pk/national/education-ministry-to-formulate-policy-for-opening-of-technical-institutes-shafqat/",
  "date_published": "2020-06-24T04:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Minister for Federal Education and Professional Training Shafqat Mehmood Wednesday said on the directions of prime minister, a uniformed policy would be formulated for opening of technical and professional training institutes to support the industrial sector.\nHe was presiding over a meeting of provincial education ministers, Chairman TVETs, and high officials from the National Vocational and Technical Training Commission(NAVTTC). The meeting also reviewed the strategy of phase wise opening of technical and vocational training institutes across the country, said a press release.\nShafqat said the technical training institutes across the country were divided into two parts. In the first one lie the institutes providing training directly in the factories, while second one were those providing training into class rooms. The first kind of institutes would be opened in Phase-I, while in the second phase the institutes providing education in class rooms would be opened.\nOn the issue, all provinces and the concerned departments also presented their opinions.\nThe minister directed the all provinces and concerned departments to present their suggestions in that regard to the Federal Education Ministry within three days.\nIn the light of all given suggestions, the education minister would present a report to the prime minister on final roadmap. After which a summary would be presented to NCOC for approval, he added.\nShafqat said the world had not seen such pandemic like corona in last 100 years.\n“We are passing through a crucial time in the history,” he said adding, “we have to take strong decisions in this crucial time for the development of economy, health and education sector.”",
  "retrievedAt": "2025-08-11T19:23:15.710Z"
}
