{
  "title": "PM committed to reforms agenda for country’s development, prosperity: Murad",
  "link": "https://www.app.com.pk/national/pm-committed-to-reforms-agenda-for-countrys-development-prosperity-murad/",
  "date_published": "2020-06-24T01:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Minister for Communications Murad Saeed Wednesday said despite all personal attacks over the years, Prime Minister Imran Khan was committed to his reforms agenda for the development and prosperity of the country.\nSpeaking on a point of personal explanation in the National Assembly, he said Prime Minister Imran Khan had faced personal attacks since the formation of Pakistan Tehreek-e-Insaf in 1996.\nHe said Imran Khan had won laurels for the country in the field of cricket, established cancer hospital and introduced corruption-free politics in the country.\nHe said the prime minister was not residing in the Prime Minister House but in his personal residence at Bani Gala to save the public money.\nMurad said despite all the unwarranted criticism against him, he achieved a huge mandate in the general elections 2018.\nHe said he did not bother about the personal attacks and always took up the issues logically.\nHe said when he directed for the recovery of millions of rupees from an opposition member, he pleaded him with leniency.\nMurad pledged to continue working under Imran Khan’s leadership to bring a significant change in the status quo of the country’s politics.\nMeanwhile, taking part in the budget debate, Dr Mukhtar Ahmed said the proposed budget did not meet the expectations of the people.\nHe said rapid increases in prices of electricity, gas, wheat, sugar and other commodities had added to the miseries of the people.\nSibghatullah said the government had reduced the current account deficit by 73 percent to three billion dollar and also brought down budget and trade deficits.\nThe government had presented a tax-free budget at a time when economies around the world were contracting, he added.\nNafeesa Shah said Pakistan was facing multiple challenges and the nation needed unity to overcome different problems and threats.\nShe lamented that enough steps were not taken to tackle locusts’ attacks and spread of coronavirus.\nKhawaja Saad Rafique accused different institutions of being biased and said they might harm the vital interests of the country.\nHe said people of Pakistan needed relief but it was unfortunate that no measures were taken to alleviate their economic hardships.\nIsrar Tareen suggested different projects to improve the road infrastructure in Balochistan and conserve water through new dams construction.\nMurtaza Mehmood said the government could not fulfill its promises made with the people in the election campaign.\nPakistan was going through a critical phase because of the dual attacks of coronavirus and locusts, he noted.\nThe house passed a unanimous resolution strongly condemning use of inappropriate language about Hazrat Fatima (RA) and Ahle Bait on the social media and asked the government to take action against the persons involved in the heinous act.",
  "retrievedAt": "2025-08-11T19:23:09.182Z"
}
