{
  "title": "PTI’s court arrest drive badly flopped due to least interest by people: Tarar",
  "link": "https://www.app.com.pk/national/ptis-court-arrest-drive-badly-flopped-due-to-least-interest-by-people-tarar/",
  "date_published": "2023-02-22T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Special Assistant to the Prime Minister (SAPM) on Interior Attaullah Tarar on Wednesday said the Pakistan Tehreek-e- Insaf’s drama of `Jail Bharo’ (court arrest) drive badly flopped as the people had shown least interest to stand by the ‘cheaters’.\nThe drive was, in fact, aimed at escaping from being jailed as no top PTI leader turned up to court arrest today, he said while addressing a press conference.\nAttaullah Tarar said PTI Chairman Imran Khan and his spouse would have to appear before the National Accountability Bureau (NAB) in connection with the charges framed against them.\nThere were past precedents, he added. The female family members of Aleem Khan, Jehangir Tareen and Prime Minister Shehbaz Sharif had to face trials while Maryam Nawaz was even imprisoned.\nHe said Imran Khan’s wife had sold out the Toshakhana gifts worth billions of rupees and her friend Farah Gogi was her accomplice in that crime.\nAll of them would have to face accountability for the embezzlement of the national wealth, he added.\nThe SAPM said Umar Farooq, who had purchased the watches stolen from the Toshakhana, had publicly presented the evidence, while the receipt made public by Imran Khan’s family that the watches were sold to a vendor in Sector F-6 of Islamabad, seemed to be fake.\nFarah Gogi, he said, even used a private jet for money laundering and selling the state gifts abroad. She (Farah Gogi) and her husband minted money over postings and transfers (of bureaucrats) in Punjab, Tarar added.\nThe SAPM said Imran Khan was scared of being imprisoned for the crime of stealing gifts from the Toshakhana and others and that was why he was trying to evade court trials.\nHe claimed that an amount of Rs 1.6 billion was embezzled and transferred to the accounts of Farah Gogi. A `cash boy’ of Farah Gogi was apprehended by the Federal Investigation Agency a few days back from the Islamabad Airport and an inquiry was underway in that regard.\nTarar said the Pakistan Muslim League-Nawaz (PML-N) appealed to the Chief Justice of Pakistan not to fix the cases of its leaders before the benches, including Justice Justice Ijaz-ul-Ahsan and Justice Mazahir Ali Akbar Naqvi.\nHe welcomed the decision of lawyers’ bodies, including the Pakistan Bar Council (PBC) to file separate complaints of misconduct in the Supreme Judicial Council (SJC) against a Supreme Court judge after the audio leak regarding his conversation with former Punjab chief minister Pervaiz Elahi about the fixation of a case before a particular bench or judge.\nHe alleged,”A judge does not listen to the cases of Imran Khan, while another judge, whose audio leak has recently surfaced, is listening to the cases against the PML-N leaders.”\nHe said the PTI chairman had been using delaying tactics in various cases, including the Toshakhana case instead of facing them, but he would have to ultimately face indictment in the Toshkhana reference.\nThe SAPM claimed that Imran Khan had allegedly contacted a former chief justice to use his contacts for relief to him in various cases. The former CJP should refrain from such matters as politicians would themselves resolve their matters.\nHe questioned how a bungalow was sold to a judge at the lowest price in the posh area of Lahore.\nHe said all the courts from the lower judiciary to the apex court had dismissed an appeal of PTI Chairman Imran Khan against striking out his right of defence in a defamation suit filed by Prime Minister Shehbaz Sharif against him. Imran Khan would to face the consequences of his baseless allegations against Shehbaz Sharif, he added.\nTo a question, he said the PML-N had left a prosperous Pakistan in 2018, with reducing 18-hour long load-shedding and completing several projects. However, the PTI’s inapt government ruined the national economy during its three-and-a-half-year tenure, he added.",
  "retrievedAt": "2025-08-11T06:09:27.075Z"
}
