{
  "title": "Rana Tanveer terms development of technical skills among youth pivotal for their economic uplift",
  "link": "https://www.app.com.pk/national/rana-tanveer-terms-development-of-technical-skills-among-youth-pivotal-for-their-economic-uplift/",
  "date_published": "2023-02-22T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Federal Minister for Education and Professional Training, Rana Tanveer Hussain Wednesday said that the development of technical skills in the youth was pivotal in enabling them to become more productive partner of national development.\n“All technical institutions in Pakistan need to play their part in equipping the youth of the country with the latest skills for achieving self sufficiency”, he stated during a signing ceremony of Memorandum of Understanding (MoU).\nThe MoU was inked between National University of Modern Languages (NUML) and the National Skills University Islamabad (NSU) to exchange skill based and language proficiency trainings among each other.\nSpeaking on the occasion, the minister reiterated the resolve of the present government to transform youth into skilled employees.\nHighlighting the problem of language barrier that Pakistani labour faces in foreign countries, Rana Tanveer hoped the MoU and the subsequent trainings of the youth would enable them to become productive citizens and enhance their demand in the foreign countries.\nThe minister was briefed that as per the MoU, the National Skills University would provide different skills-based technical education to NUML students in which they could develop expertise.\nSimilarly, the NUML will provide national and international language proficiencies to the students at National Skills University Islamabad and its Muridke Campus in related languages.\nNUML can also provide translation and interpretation services on demand to National Skills University.Rana Tanveer was briefed that NSU and NUML would hold joint educational and research activities in addition to seminars, lectures, conferences, workshops and symposia.\nThe scope of cooperation will also include special short-term and long-term academic programs and capacity training sessions and reciprocal visits of senior management of both the institutions.\nRana Tanveer congratulated NSU and NUML on the signing of the MoU while hoping this would prove as an important milestone towards employment generation through equipping the students with the latest skills and language expertise.",
  "retrievedAt": "2025-08-11T06:09:37.197Z"
}
