{
  "title": "President for promoting football in Pakistan, incentivizing athletes",
  "link": "https://www.app.com.pk/national/president-for-promoting-football-in-pakistan-incentivizing-athletes/",
  "date_published": "2023-02-22T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): President Dr Arif Alvi on Wednesday urged the need to incentivize the football players and promote football in the country by adopting international best practices in the field of football.\nThe president, talking to the members of Pakistan’s National Men’s and Women’s Football teams, at Aiwa-e-Sadr, called for developing linkages with international partners and promoting public-private partnerships, besides providing better training facilities and coaching to the football players.\nHe said that the FIFA-appointed Normalization Committee for the Pakistan Football Federation (PFF) should speed up its efforts to streamline the issues related to football affairs in the country.\nThe Chairman of the FIFA-appointed Normalization Committee (FNC), Haroon Ahmed Malik and members of the FNC were also present during the meeting.\nWelcoming the athletes, the president said that the sport of football was quite popular in Pakistan and there were millions of football fans in the country and the game should be promoted at the district and club levels.\nHe advised the athletes to make their country proud through their performance and work for improving the country’s image as they were Pakistan’s ambassadors in the field of sports.\nThe president remarked that he had high hopes from the players to lead Pakistan in regional and international competitions.\nHe regretted that the internal politics within the Pakistan Football Federation (PFF) had affected its performance and expressed the hope that with the help of the FIFA-appointed Normalization Committee, there would be a visible improvement in the performance of PFF.\nHaroon Ahmed Malik briefed the president that over 7 million people in Pakistan played football, and that FNC was making efforts to improve the functioning and administration of PFF through the FNC.\nHe informed that Women’s National Team played their first international game in eight years and Men’s National Team played their first international game in four years.\nHe stated that so far almost 4600 clubs from 163 districts of the country had been registered and the documentation and physical scrutiny process would be completed within the given timelines.\nIt was told that Men’s National Team would participate in the 2026 FIFA World Cup qualifiers and Women’s National Team would play in the Olympics Qualifiers for Paris 2024 this year.",
  "retrievedAt": "2025-08-11T06:09:30.199Z"
}
