{
  "title": "Murad Saeed unveils plaque to rename Kashmir Highway as ‘Srinagar Highway’",
  "link": "https://www.app.com.pk/national/murad-saeed-unveils-plaque-to-rename-kashmir-highway-as-srinagar-highway-2/",
  "date_published": "2020-08-03T05:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP):Minister for Communications and Postal Services Murad Saeed on Monday unveiled the plaque to rename the Kashmir Highway as ‘Srinagar Highway’ to express solidarity with people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) facing the worst ever suppression since August 5, 2019.\nAddressing the road renaming ceremony here, the minister said it would be the road leading to Srinagar. India had taken an illegal, immoral and unconstitutional action out of frustration as its around-the–clock curfew, communication blackouts, arrests, killings and forceful suppression of the protesters fell flat before the indomitable spirit and struggle of the Kashmiri people, whose commitment was getting stronger with every intensive move of the so-called secular state, he said.\nTerming Narendra Modi ‘Hitler’ of the new era, he said being a member of the terrorist organization RSS (Rashtriya Swayamsevak Sangh), the Indian prime minister was pursuing the Hindutva mindset.\nHe said Prime Minister Imran Khan, in his speech at the Parliament in August last year, had expressed serious concerns that India’s August 5 action would not only affect the people of Kashmir but also minorities living in India, and that had proven correct in due course of time.\nHe said Imran Khan presented the Kashmir case in an effective manner at the United Nations General Assembly and exposed the real face of India before the comity of nations.\nThe minister said disintegration of India had started with its last year’s illegal action of scrapping the special constitutional status of IIOJK. The occupation forces martyred Burhan Wani to suppress the Kashmiris’ indigenous movement, it got momentum for the right to self-determination.\nHe said the people of Pakistan and Kashmir would mark August 5 as ‘Youm-Istehsal’ to condemn India’s nefarious designs to change demographic apartheid of the IIOJK",
  "retrievedAt": "2025-08-11T19:35:41.875Z"
}
