{
  "title": "Youm-e-Istehsal to be observed with national zeal to expose real face of India: Shibli",
  "link": "https://www.app.com.pk/national/youm-e-istehsal-to-be-observed-with-national-zeal-to-expose-real-face-of-india-shibli/",
  "date_published": "2020-08-03T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP):Federal Minister for Information and Broadcasting Senator Shibli Faraz on Monday said Youm-e-Istehsal would be observed on August 5 with national zeal to expose the real face of India.\nTalking to the media here at the unveiling ceremony of special postal stamp in connection with the Youm-e-Istehsal along with Minister for Postal Services Murad Saeed, he said after its illegal action of scrapping the special constitutional status of the Indian Illegally Occupied Jammu and Kashmir last year, India laid its military siege and intensified tensions in the region.\nHe urged the masses to hoist the flags of both Pakistan, and Azad Jammu and Kashmir atop their homes on the day to tell the world that the Kashmiris were not alone in their just struggle, rather the entire Pakistani nation was supporting them.\nTo a question, he said the campaign for highlighting the Kashmir issue would be run in an effective manner.\nShibli said the issuance of commemorative stamps on the first anniversary of the Indian illegal action was symbolic to convey the message to the entire world that Pakistan stood with the Kashmiris in their struggle for right to self-determination.\nThe Foreign Ministry, he said, was doing its best to highlight the longstanding Kashmir dispute and other institutions were supporting it in its endeavours.\nShibli said soon after coming into power, the Pakistan Tehreek-e-Insaf started highlighting the Kashmir cause with a new spirit with Prime Minister Imran Khan himself leading from the front.\nTo a question about the less effective role of Pakistani foreign mission in highlighting the Kashmir cause, the minister said the diplomats followed the political leadership at the helm of affairs. As the prime minister himself had become the ambassador of Kashmir, the Foreign Office had become very active in highlighting the Kashmir cause and exposing Indian atrocities.\nHe said Pakistan would continue its moral, political and diplomatic support for the Kashmir cause till realization of the goal of freedom.",
  "retrievedAt": "2025-08-11T19:35:36.174Z"
}
