{
  "title": "Pakistan believes in friendly relations with all neighboring countries : NA Speaker",
  "link": "https://www.app.com.pk/national/pakistan-believes-in-friendly-relations-with-all-neighboring-countries-na-speaker/",
  "date_published": "2020-09-10T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): National Assembly Speaker Asad Qaiser on Thursday said Pakistan believed in friendly relations with all its neighboring countries and keen to enhance bilateral trade with Afghanistan and Azerbaijan.\nBoth the countries were brotherly Islamic states and enjoyed cordial relations based upon ties of mutual religious, socio-economic, cultural and economic, the NA Speaker said in a meeting with Pakistan’s Ambassador-designate to Afghanistan Mansoor Ahmed Khan and Ambassador-Designate to Azerbijan Bilal Hayee, said a press release.\nAsad Qaiser said Non-Tariff Barriers in the trade between Afghanistan and Pakistan must be eliminated at the earliest.\nHe said it was the first time in the history of Parliament that an executive committee was established under Pakistan Afghanistan Friendship Group that remained successful to remove bottlenecks on the border points between both the countries.\nHe expressed his confidence that ambassador had vast diplomatic experience and Pakistan Embassy in Kabul would work diligently under his leadership.\nHe stressed on the Ambassador to utilize all his expertise to further enhance the mutual ties.\nTalking to Bilal Hayee, the Speaker said Parliamentary contacts between Azerbaijan and Pakistan were on the verge of new start and expressed his confidence that the ambassador with his acumen would make these relations more fruitful for both the nations.\nMansoor Ahmed Khan expressed his gratitude to the Speaker for reposing trust in his capabilities. He resolved to fully utilize all his diplomatic experience and expertise to make Pakistani relations with Afghanistan more productive.\nHe said that Pakistan always desired to economic and trade relations between both the counties and he with his team would try to realize this dream.\nBilal Hayee expressed his resolved to make parliamentary contacts between both the nations more meaningful, adding that enhancing cooperation between the two countries in energy and trade sector would be his special focus.",
  "retrievedAt": "2025-08-11T19:47:35.653Z"
}
