{
  "title": "Naval Chief confers military awards upon Pakistan Navy personnel; inaugurates LTE network",
  "link": "https://www.app.com.pk/national/naval-chief-confers-military-awards-upon-pakistan-navy-personnel-inaugurates-lte-network/",
  "date_published": "2020-09-10T07:45:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 10 (APP):In an impressive Investiture Ceremony held at Bahria Auditorium, Chief of the Naval Staff Admiral Zafar Mahmood Abbasi conferred military awards upon Pakistan Navy personnel.\nThe Naval Chief also inaugurated Pakistan Navy’s Long Term Evolution (LTE) Network in Karachi, said a Pakistan Navy press release.\nThe Naval Chief, while inaugurating the LTE Network emphasized that LTE technology would greatly enhance Pakistan Navy’s Network Centric Warfare capability and provide information superiority against the enemy in both conventional and asymmetric threat situations.\nHe emphasized on the Commanders at all tiers to optimally utilize this capability taking due cognizance of information security aspects.\nEarlier during the Investiture ceremony, the recipients of Sitara-i-Imtiaz (Military) were Cdre Nasar Mahmood, Cdre Syed Faisal Ali Shah, Cdre Raas Karim, Cdre Shifaat Ali Khan, Cdre Amir Mahmood, Cdre Rashid Mahmood, Cdre Zafar Iqbal, Cdre Kamran Ahmed, Cdre Khan Mahmood Asif, Cdre Anwaar Ali Sabir, Cdre Muhammad Nauman Rafique, Cdre mtiaz Ali, Cdre Hammad Ahmad and Cdre ljaz Ahmad.\nThe recipients of Tamgha-i-Imtiaz (Military) were Capt Imran Javed PN, Capt Muhammad Azhar PN,Capt Atif Naveed Hadis PN, Capt Muhammad Hussain PN, Capt Shaikh Muhammad Jawad PN, Cdr Muhammad Hassan PN, Cdr Muhammad Tahir Fayyaz PN, Cdr Muhammad Zia ul Haq PN, Cdr Muhammad Adil Siddiqui PN, Cdr Khurram Shehzad PN, Cdr Hasan Shaheen PN, Cdr Farhan PN, Cdr Muhammad Kaleem Ahmed PN, Cdr Ahmed Raza Tahir PN, Cdr Imran Khan PN, Cdr Akber Mirza PN, Lt Cdr Qaiser Waheed PN, Lt Cdr Areeb Ashraf Cheema PN, Lt Cdr Atif Muhammad Sarwar Baig PN and Lt Cdr Muhammad Shakil PN.\nThe recipients of Tamgha-i-Basalat were Capt Amir Iqbal Khan PN, Lt Cdr Zulfiqar Ali PN, Lt Jamshid Hussain PN, Lt Bilal Nazir PN, Lt Noman Majeed PN, Mahboob Hussain CSFA and Perveez Ahmed CDT-I.\n47 Awards of TK(M)-I, 69 awards of TK(M)-II and 31 awards of TK(M)-III have also been conferred upon Master Chief Petty Officers, Chief Petty Officers and Sailors. Letters of Commendation from Chief of the Naval Staff have been awarded to 63 Officers, Master Chief Petty Officers, Chief Petty Officers, Sailors and Navy Civilians. The ceremony was attended by a large number of senior serving and retired officers of Pakistan Navy.\nOn Defence Day 6 Sep 20, President of Pakistan conferred military awards upon Armed Forces personnel. From Pakistan Navy the recipients of Hilal-i-Imtiaz (Military) were Rear Admiral Imran Ahmad, Rear Admiral Muhammad Shuaib, Rear Admiral Zaka ur Rehman, Rear Admiral Naveed Ashraf, Rear Admiral Ovais Ahmed Bilgrami and Rear Admiral Abdul Basit Butt. The recipients of Sitara-i-Basalat were Capt Syed Ailya Hasan and Lt Cdr Humair Iftikhar PN.",
  "retrievedAt": "2025-08-11T19:47:38.932Z"
}
