{
  "title": "Pakistan summons senior Indian diplomat; condemns targeting of civilians by Indian occupation forces along LoC: FO",
  "link": "https://www.app.com.pk/national/pakistan-summons-senior-indian-diplomat-condemns-targeting-of-civilians-by-indian-occupation-forces-along-loc-fo/",
  "date_published": "2020-09-10T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): A senior Indian diplomat was summoned to the Ministry of Foreign Affairs here on Thursday to register Pakistan’s strong protest over ceasefire violations by the Indian occupation forces along the Line of Control (LoC) on the night of September 8, 2020, resulting in serious injuries to three innocent civilians.\nDue to indiscriminate and unprovoked firing by the Indian occupation forces in Bedori Sector of the LoC, 57-year old Muhammad Altaf son of Muhammad Din, 27-year old Muhammad Aftab son of Muhammad Altaf and 40-year old Tahir Iqbal son of Muhammad Azam, residents of Banjori village, sustained serious injuries, Foreign Office Spokesperson Zahid Hafeez Chaudhri said in a statement.\nThe Indian occupation forces along the LoC and the Working Boundary (WB) have been continuously targeting the civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons.\nThis year, India has committed 2,199 ceasefire violations to date, resulting in martyrdom of 17 and serious injuries to 171 innocent civilians, he added.\nCondemning the deplorable targeting of innocent civilians by the Indian occupation forces, it was underscored that such senseless acts were in clear violation of the 2003 Ceasefire Understanding, and was also against all established humanitarian norms and professional military conduct.\n“These egregious violations of international law reflect consistent Indian attempts to escalate the situation along the LoC and are a threat to regional peace and security,” the FO statement said.\nIt was added that by raising tensions along the LoC and the WB, India could not divert attention from the grave human rights situation in the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nAccording to the spokesperson, the Indian side was called upon to respect the 2003 Ceasefire Understanding, investigate the current and other such incidents of deliberate ceasefire violations, and maintain peace along the LoC and the WB.\nThe Indian side was also urged to allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) to play its mandated role as per the United Nations Security Council (UNSC) resolutions.\\",
  "retrievedAt": "2025-08-11T19:47:35.912Z"
}
