{
  "title": "28 international firms, 150 local organisations to participate in PIMEC 25",
  "author": null,
  "content": "ISLAMABAD, Nov 01 (APP): Commander Karachi, Vice Admiral Muhammad Faisal Abbasi, Saturday said that the second edition of Pakistan International Maritime Expo and Conference 2025 (PIMEC 25) will be held from 3 to 6 November 25 at Karachi Expo Centre.\n\nBriefing the media at the Curtain Raiser ceremony, PIMEC 25 in Karachi, he highlighted that PIMEC 25 holds significance in advancing Pakistan’s Blue Economy road-map, and the event will witness representation from almost every region of the world.\n\nVice Admiral Muhammad Faisal Abbasi further informed that 178 exhibitors from across the globe, including 28 international firms and 150 local organisations, will participate in the exhibition.\n\nMoreover, 133 international delegations from Europe, Asia, North America, South America and the Far East, including representatives from 44 countries such as the United Kingdom, Italy, Iran, Turkiye, KSA, Australia, Egypt and China, will also attend the event.\n\nHe highlighted that in addition to local exhibitors, PIMEC 25 will also feature pavilions by the Governments of Sindh and Balochistan, showcasing potential and investment opportunities in the country’s maritime sector.\n\nThe Commander Karachi also acknowledged the media’s valuable role and expressed confidence in their support for the forthcoming event.\n\nPIMEC 25 will encompass a wide-ranging maritime exhibition, business-to-business (B2B) and business-to-government (B2G) meetings, signing of Memorandums of Understanding (MoUs), and media interactions.\n\nThese high-level engagements among foreign delegates, senior government officials, and maritime stakeholders are aimed at fostering collaboration and building partnerships across key maritime sectors, including ports, shipping, fisheries, and coastal development.\n\nRunning concurrently with the exhibition, the International Maritime Conference (IMC), a two-day event scheduled from 4 to 5 Nov 25, will be organised by the National Institute of Maritime Affairs (NIMA).\n\nThe conference, themed “Harnessing Blue Economy Potential for Sustainable Development,” will feature 14 papers presented by distinguished national and international scholars and professionals in four sessions. The briefing was attended by Pakistan Navy Officers and media representatives.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/WhatsApp-Image-2025-11-01-at-8.41.36-PM-e1762013148986.jpeg",
  "retrievedAt": "2025-11-01T16:28:32.036Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/28-international-firms-150-local-organisations-to-participate-in-pimec-25/",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T16:02:57.000Z"
}
