{
  "title": "Covid-19 : Federal govt providing all-out assistance to provinces : PM",
  "link": "https://www.app.com.pk/national/pm-visits-hmc/",
  "date_published": "2020-04-10T04:32:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 10 (APP):Prime Minister Imran Khan here Friday said that federal government was providing all-out assistance to the provinces to control spread of Coronavirus pandemic.\nThe Prime Minister expressed these views during his visit to Hayatabad Medical Complex (HMC) Peshawar where he was briefed about KP government’s relief efforts, arrangements for treatment of Coronavirus patients and measures adopted to contain spread of pandemic.\nThe prime minister assured that federal government’s support to all provinces would continue.\nHe directed Governor KP, Chief Minister Mahmood Khan and concerned ministers to visit the affected areas by themselves and ensure availability of facilities to the people at their doorsteps.\nThe Prime Minister briefed by Chief Secretary KP Dr Kazim Niaz was informed that provincial government has enforced Corona emergency on Fedruary 3.\nIt was further apprised to the PM that KP Governor, Chief Minister, Health Minister and other relevant authorities were monitoring the whole situation on daily basis.\nAs many as 275 qurantine centers have been established with the accommodation capacity of 18,000 persons in the province.\nThe PM was further informed that KP Chief Minister has announced Rs32 billion relief package.\nThe PM was further told that 583 ventilators were available in KP and numbers were being increased. Some 638 regular and 1299 contractual doctors have been recruited in the province.\nIn addition to it, 9000 retired doctors, nurses and paramedics have voluntarily registered and can be called if required.\nSimilarly, 400 rapid response teams have been constituted to deal with the Coronavirous situation.\nThe capacity of Coronavirus testing was being increased and district administration has been empowered to facilitate people.\nThe Prime Minister appreciated the measures of KP Government and said that in the present situation, the government was concentrating to prevent Coronavirous along with providing relief to poor segment of the society.\nThe prime minister was accompanied by Governor KP Shah Farman , Chief Minister KP Mahmmod Khan, Federal Minister Asad Umar, Minister of State Shahryar Afridi and Special Assistant to PM on Social Protection and Poverty Allievation Dr Sania Nishtar and health minister KP Taimur Salim Jhagra.",
  "retrievedAt": "2025-08-11T19:04:33.125Z"
}
