{
  "title": "COVID-19: Shehzad Akbar lauds business community for meeting food needs of poor",
  "link": "https://www.app.com.pk/national/covid-19-shehzad-akbar-lauds-business-community-for-meeting-food-needs-of-poor/",
  "date_published": "2020-04-09T22:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP):Special Assistant to Prime Minister on Accountability and Interior Shehzad Akbar on Friday said that business community had always demonstrated great generosity and cooperated with the government in difficult times.\nHe said this while addressing a ceremony held at Islamabad Chamber of Commerce Industry (ICCI) to distribute free food items among the people affected by economic slowdown caused by the coronavirus (COVID-19).\nMuhammad Aamir Zulfiqar Khan Inspector General Police Islamabad, DIG Operations Islamabad Waqar Ud Din Syed and Hamza Shafqaat Deputy Commissioner Islamabad were also present at this occasion.\nShehzad appreciated the business community and Islamabad police especially the efforts of IGP Islamabad Muhammad Aamir Zulfiqar and DIG (Operations) Waqar Uddin Syed in this challenging time.\nHe said that government strategy was to control the spread of COVID-19 and save business activities from destruction as well.\nHe said to open the construction industry and its allied industries, the government was working on SOPs and stressed that business community should fully abide those SOPs to save their own lives and lives of their workers.\nHe said that government was considering to address the issues of importers, hotel industry and other affected businesses. He said the providing relief in rents and utility bills to business community was also under consideration. He said that COVID-19 was a life changing pandemic and we all have to take extra precautionary measures to control its spread.\nHe hoped that ICCI would continue to provide free food items to poor people to complement the efforts of government for protection of these people.\nThe IGP Islamabad said that taking care of poor people in these testing times was the responsibility of us all.\nHe assured that Islamabad Police would fully cooperate with ICCI in distributing ration among poor families without any disturbance.\nHe said that Islamabad Police has cooperated in distribution ration among 8000 persons and would continue to play its role for this purpose. He also thanked D.Watson and Shaheen Chemists for providing protective equipment to Islamabad Police including masks, sanitizers, gloves etc.\nIn his welcome address, Muhammad Ahmed Waheed, President, Islamabad Chamber of Commerce & Industry said that business community always played frontline role in every crisis and would also play this role to reduce the difficulties of poor people due to lockdown caused by COVID-19.\nHe said that ICCI in collaboration with ICT Administration and Islamabad Police would distribute ration at the doorsteps of poor families in Islamabad.\nHe said that initially, ICCI Corona Relief Camp would provide free food items to 1000 families while later on more families would be provided ration so that poor people may not face shortage of food items.\nMian Akram Farid, Chairman Founder Group said that industrialists were ready to take all precautionary measures for their workers and government should gradually allow industries to start operations. He said that industrialists have paid salaries of their workers for the month of March, but if industries remained closed, it would be difficult for them to pay their more salaries. He also highlighted issues of importers and hotel industry and stressed that government should address them.\nHe said that government should also consider using Dam fund and EOBI Fund to protect the poor people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:04:43.241Z"
}
