{
  "title": "‘Ramazan Relief Package’ to remain effective till Eidul Fitr: Umer Lodhi",
  "link": "https://www.app.com.pk/national/ramazan-relief-package-to-remain-effective-till-eidul-fitr-umer-lodhi/",
  "date_published": "2020-04-09T21:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP):Managing Director of Utility Stores Corporation Umer Lodhi Friday said that the ‘Ramazan Relief Package’ on 19 essential kitchen items would remain effective till Eidul-Fitr where quality of products was being ensured at all utility stores outlets across the country.\nTalking to private news channel, Umer Lodhi said under Ramazan package, subsidy was being given from 5 rupees to 50 rupees on 19 daily use items including flour, ghee, cooking oil, pulses, baison, dates, rice, milk, drinks and spices.\n‘Ramazan Relief Package’ will start from April 17 and it will continue till Eid days at all utility stores of the country with fixed price and available stock, where subsidy will be given over 19 essential commodities, he added.\nHe also announced that from April 10 (today), USC had also launched a ‘Mobile Utility store’ facility for people living near Islamabad territory.\nUtility Stores Corporation MD said before Ramazan USC would add more than 100 new utility outlets in its network across the country in order to provide maximum relief to the people specially poor segment of the society.\nHe also said after Ramadan they would further add 200 more branches of utility stores, adding that no complaint of quality or shortage of items had been received at their country stores till now.\nUmer Lodhi said that surveillance teams of the corporation were strictly monitoring the quality, sales and services of the corporation across the country and any official involved in any mail practice would be dealt with iron hands, he warned.\nHe said that provision of quality products on economical rates to the masses during the holy month of Ramazan and afterward was the top priority of Imran Khan’s government.\n“The prices being charged by Utility Stores are less even from the Sasta Bazaars”, he added.\n“The quality of the commodities and other branded items being retailed at Utility Stores Corporation outlets was purely standard”, he added.\nThe government has announced Ramazan package worth 2.5 billion rupees for provision of essential commodities to the masses at reduced rates through the Utility Stores Corporation during the holy month, MD USC said.\nHe also mentioned that this Ramazan package will remain effective till Eidul Fitr, he, however, said subsidy on five essential items would be carried forward after the Eid.\nA monitoring mechanism regarding availability of items at the utility stores will be put in place at the district level, he added.\nHe said they were making their utmost efforts to ensure smooth supply of required stock at all the outlets.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:04:44.412Z"
}
