{
  "title": "Timely steps helped contain coronavirus in AJK: Masood",
  "link": "https://www.app.com.pk/national/timely-steps-helped-contain-coronavirus-in-ajk-masood/",
  "date_published": "2020-04-10T00:05:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Apr 10 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Friday said the timely precautionary measures taken by the state government had helped a lot in containing the novel coronavirus in the AJK.\nHe said this during a visit to Covid-19 Information Control Room in Muzaffarabad where he was briefed on the measures taken to prevent the spread of the pandemic in state, an AJK Presidential Secretariat press release said.\nSardar Masood said on the whole the AJK people while exercising courage, patience and discipline, had been cooperating with the government and the administration because they realized that the pandemic could be overcome only by preventive measures.\n“The more the people will demonstrate sense of responsibility, the sooner we will succeed in overcoming the pandemic,” he added.\nHe asserted that it was an encouraging development that the Covid-19 had not claimed any human life in the AJK so far, and by the grace of Allah, majority of the people infected with the disease were out of danger now.\nAppreciating the excellent performance of coronavirus information control room, he greeted Minister for Information Technology Mustafa Bashir Abbasi, Secretary Midhat Shehzad and Director General Dr Khalid Rafiq, and said the establishment of the control room immediately after the outbreak of coronavirus, collection of real time data, and establishing of web portal would certainly contribute a lot to the efforts to control the infectious disease.\nHe lauded the joint efforts of health department, the World Health Organization and the administration to contain the spread of pandemic through the web portal.\nThe AJK president directed the health department officials to identify some proper place for the screening and treatment of coronavirus patients by various hospitals of Paksitan and Punjab with the help of tele-health and tele-medicine technology.\nThe Information Technology Board should ensure provision of necessary technology in that regard, he added.\nHe hailed the spirit of information technology students of different public sector universities, for extending voluntary services to the IT department.\nEarlier in the briefing, Sardar Masood Khan was told that a total number of 34 corona positive patients, one in Muzaffarabad, three in Poonch, seven in Sadhnoti, two in Kotli, nine in Mirpur, and 12 in Bhimber had been reported in Azad Kashmir. Besides, a total of 642 suspected cases had been tested, and at present 159 people had been quarantined. One of the patients had recovered.\nMinister Dr Mustafa basher said the physicians, nurses and paramedical staff were fighting on the front line against the coronavirus, and they needed encouragement from the government, and appreciation from the people. Various teams of lady health workers, with the cooperation of police, revenue department and Information Technology Board, were visiting door to door in all the ten districts of the territory to collect the data regarding coronavirus.\n“We are trying to link Leepa valley and Neelum valley with the hospitals of Muzaffarabad through telehealth system on experimental basis shortly,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:04:39.032Z"
}
