{
  "title": "Rain, thunderstorms and snow expected in parts of Pakistan",
  "author": null,
  "content": "ISLAMABAD, Mar 11 (APP):The Pakistan Meteorological Department (PMD) has forecast rain-wind/thunderstorms with snowfall over the hills at isolated places in Khyber Pakhtunkhwa, Kashmir, Gilgit-Baltistan, Northern Balochistan, and Upper Punjab on Wednesday.\nMeanwhile, the rest of the country is likely to experience partly cloudy weather.\nCloudy weather with rain-wind/thunderstorms is expected in Islamabad and surrounding areas, with a 40% probability of precipitation.\nIn Khyber Pakhtunkhwa, isolated rain-wind/thunderstorms with snowfall over the hills are expected in Chitral, Dir, Swat, Kohistan, Shangla, Battagram, Mansehra, Abbottabad, Nowshera, Swabi, Mardan, Buner, Peshawar, Kohat, Karak, Bannu, Bajaur, Mohmand, Kurram, Khyber, and Waziristan.\nIn Punjab, mostly dry and partly cloudy weather is expected, except for Rawalpindi, Attock, Jhelum, Chakwal, Mandi Bahauddin, Sargodha, Mianwali, Khushab, Gujrat, Sialkot, Narowal, Lahore, Gujranwala, Faisalabad, and Sheikhupura, where rain-wind/thunderstorms are likely.\nMurree, Galliyat, and surrounding areas may experience cloudy weather with chances of rain and light snowfall.\nSindh will experience dry conditions across most districts, with partly cloudy skies expected in the upper parts of the province.\nIn Balochistan, dry weather is forecast for most districts, while Quetta, Zhob, Qila Saifullah, Ziarat, Chaman, and Musakhel may experience light rain-wind/thunderstorms, with possible light snowfall over the hills.\nCloudy weather with rain-wind/thunderstorms and snowfall over the hills is expected in various parts of Kashmir and Gilgit-Baltistan.\nCold and partly cloudy conditions prevailed across most parts of the country during the past 24 hours, with rain-wind/thunderstorms and light snowfall occurring in Upper Khyber Pakhtunkhwa, Kashmir, Gilgit-Baltistan, and the Potohar region.\nThe rainfall recorded in the past 24 hours (in mm) includes Parachinar 20, Kalam 11, Pattan 08, Saidu Sharif 07, Upper Dir and Malam Jabba 06, Mir Khani 04, Drosh, Balakot, and Kakul 02, Takht Bai and Peshawar City 01 in Khyber Pakhtunkhwa.\nIn Gilgit-Baltistan, Skardu recorded 05, Bagrote, Astore, and Hunza 03. In Kashmir, Kotli and Garhi Dupatta received 04, Muzaffarabad Airport 04 and City 02, while Rawalakot received 03. In Punjab, Islamabad Airport recorded 03, City 02, Murree 03, and Rawalpindi Katcheri 03 and Chaklala 01.\nThe lowest minimum temperatures recorded today were Leh -03C, Gupis -02C, Parachinar -02C, and Malam Jabba\nThe pollen concentration in the air today was recorded at 5,249 particles per cubic meter.\nThe citizens in the affected regions are advised to stay updated on weather conditions and take necessary precautions, especially in areas expecting thunderstorms and snowfall.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:32:50.315Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rain-thunderstorms-and-snow-expected-in-parts-of-pakistan/",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T18:33:00.000Z"
}
