{
  "title": "Govt not to take action under Article 6, prioritizes political stability: Law Minister",
  "author": null,
  "content": "ISLAMABAD, Mar 11 (APP):Federal Minister for Law, and Justice Senator Azam Nazeer Tarar, has announced that the government has decided not to take action under Article 6 of the Constitution, considering political maturity and stability. Article 6 pertains to treason and constitutional violations, allowing legal proceedings against any individual for breaching the Constitution.\nResponding to the opposition leader’s point of objection in the Senate on Tuesday, Senator Tarar emphasized that the government has chosen a political resolution over legal action.\nHe highlighted that elected members of the National and Provincial Assemblies have taken their oaths, and the Election Commission has announced the election schedule. In Khyber Pakhtunkhwa, the Sunni Ittehad Council’s Chief Minister was appointed, and despite the schedule being issued, the Chief Minister and Speaker refused to convene the provincial assembly session.\nHe further stated that the Peshawar High Court had directed the assembly session to be called. However, during the Senate elections across the country, the Speaker Khyber Pakhtunkhwa Assembly, acting on the Chief Minister’s instructions, did not summon the session.\n“If everything is illegal, then why is the opposition leader holding his position? PTI members are also chairing multiple parliamentary committees,” he added.\nSenator Tarar also remarked that if Article 6 were to be applied, it should have been implemented on the day when the vote of no confidence was moved against the then-Prime Minister and the Deputy Speaker dissolved the National Assembly. He noted that this matter had been deliberated upon multiple times during the PDM government.\nRegarding the absence of Khyber Pakhtunkhwa’s senators, he stated that the responsibility lies with the province’s Speaker and Chief Minister, who must answer for the situation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:33:41.027Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-not-to-take-action-under-article-6-prioritizes-political-stability-law-minister/",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T12:27:00.000Z"
}
