{
  "title": "Senators call for revising taxes on salaried class, medicines, property business, cement industry",
  "link": "https://www.app.com.pk/national/senators-call-for-revising-taxes-on-salaried-class-medicines-property-business-cement-industry/",
  "date_published": "2024-06-20T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): The senators on both sides of the isle on Thursday called for revising proposed taxes on the salaried class, medicines, cement industry and property business, besides minimizing power load-shedding in the country.\nTaking part in the debate on budget 2024-25 in the Senate, Pakistan Tehreek-e-Insaf’s (PTI) parliamentary leader Ali Zafar claimed that no relief was given in the budget rather new taxes were imposed which would further burden the people.\nHe said the finance minister should have proposed steps to reduce the government’s intervention into the market besides promoting a market driven economy. No concrete recommendations were suggested for economic growth and reduction in the government expenditures.\nThe economic growth would suffer with increase in the taxes to achieve the revenue target of Rs 3.8 trillion, he added.\n.\nKamran Murtaza of the Jamiat Ulema-e-Islam-Fazl said JUI-F said that the federal consolidated funds needed to be discussed at the forum.\nHe regretted that three governments remained in power but new National Finance Commission Award had been announced in violation of Article 160 of the Constitution.\nQuratulain Marri of the Pakistan Peoples Party said an amount of Rs 150 billion was allocated for electricity, and claimed that 20-hour power load-shedding was being carried out in her constituency.\nSimilarly, Rs 22 billion was earmarked for gas, which was also in short supply, she added.\nHaji Hadayatullah Khan of the Awami National Party said the new taxes proposed in the budget would erode the wages\n.\nHe called for revising tax on medicines as it would negatively impact the poor people.\nHe pointed out that meager funds were allocated for development projects in Khyber-Pakhtunkhwa, which should be enhanced.\nHe called for ending power loadshedding in the KP as the province was generating around 5,790 mega watt (MW) electricity. No new major scheme in the power sector in the province in the annual Public Sector Development Programme had been announced, he added.\nHe said the allocation of Rs 67 billion for higher education was not enough and it should be enhanced. He also called for slashing tax on people associated with property business.\nSimilarly, he said that increase in tax on cement would affect the construction business, besides directly affecting the poor people associated with it.\nHe said agriculture was considered as the backbone of the country for which only Rs 115 billion had been allocated. Kisan Card like facilities should also be extended to other provinces, he added.\nMuhamamd Faisal Vawda, while taking part in the budget, alleged that the PTI government had delayed issuance of an SRO to benefit a specific automobile industry. Vehicles were imported prior to its notification.\nHe said the House should ensure consistency of policies.",
  "retrievedAt": "2025-08-11T03:21:44.646Z"
}
