{
  "title": "Tarar regrets ‘smear campaign’ against Pak-China friendship by a political party on Eid",
  "link": "https://www.app.com.pk/national/tarar-regrets-smear-campaign-against-pak-china-friendship-by-a-political-party-on-eid/",
  "date_published": "2024-06-20T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Thursday took exception to a “smear campaign” launched by a specific political party against the Pakistan-China friendship on the occasion of Eid-ul-Azha.\nAddressing a news conference, the minister brushed aside the propaganda against Pakistan-China friendship particularly surrounding the upgradation of the China-Pakistan Economic Corridor (CPEC).\n“Undoubtedly, the lobbies against the Pakistan-China Dosti are active, and are completely perturbed by the CPEC’s upgradation, but such botch attempts are destined to fail,” he added.\nThe minister said the government fully understood that some powers which were stunned by the Pakistan-China friendship, were resorting to undue and unfounded criticism towards the CPEC, but nothing could harm the enduring bond between the two nations.\n“The people normally celebrate Eid-ul-Azha by slaughtering sacrificial animals and sharing sweets with their loved ones but there was one political party that exerted all its energies for conspiring against Pak-China Dosti,” he regretted.\nThe minister lashed out at the political party, which, he said, was bent upon running a “smear campaign” against Pakistan-China friendship instead of reflecting on the possibilities to resolve the issues to forge unity in accordance with the spirit of Eid which taught nothing but sacrifice and altruism.\nThe whole nation should celebrate the enduring bond of a friendship between Pakistan and China that had stood the test of time and was growing with each passing day, he added.\nTarar said a high-level Chinese delegation led by Minister of the International Department of the CPC Central Committee (IDCPC) Liu Jianchao would arrive in Pakistan today on a three-day visit till June 22.\nHe said the IDCPC minister had not only been in close coordination with the political parties of various countries but also had a critical role in the China-Pakistan Economic Corridor (CPEC) related projects.\nThe IDCPC minister, he said, would co-preside the Joint Consultative Mechanism on CPEC with Deputy Prime Minister and Foreign Minister Ishaq Dar to review progress on CPEC and explore new areas for its upgradation.\nMinister Liu Jianchao would also held meetings with the civil and military leadership of the country, he added.\nAccording to the information minister, the arrival of a high-level delegation from China was not only a good omen but also a leap forward towards the cooperation and collaboration forged by the recent visit of the prime minister to China.\nThe bureaucracy, media, academia, civil society and business community should continue to play their due role in the Pakistan-China friendship which “is higher than Himalayas, deeper than ocean and sweeter than honey”, the minister remarked.\n“Today, even our critics are describing the prime minister’s visit to China as the most successful in the history of Pakistan,” Tarar said while lashing out those who were criticizing the CPEC and Pakistan-China friendship just for the sake of criticism.\nHe said Senator Mushahid Hussain also lauded the prime minister’s visit to China as the “most successful” and calling the joint communique of both the governments after the PM’s visit as unprecedented.\n“It is an honour for Pakistan that China organized two banquets on the same day in honour of the prime minister and his delegation,” the minister said, adding Chinese President Xi Jinping hosted a dinner reception while PM Li Keqiang held a lunch reception for them.\nThe minister said both the Chinese leaders including President Xi and Premier Li had categorically discussed upgradation of the CPEC during the meetings.\n“The Chinese side had made statements about the upgradation of CPEC which is meaningful and substantial in nature,” he added.\nHe urged all the political parties to welcome and celebrate the arrival of high-level delegation from China and did not resort to criticism on the Pakistan-China friendship and CPEC.\nTarar lauded the Chinese Ambassador to Pakistan for playing an important role in mobilizing the high-level delegation from China to Pakistan.\nThe minister highlighted achievements made by Pakistan at international level under the leadership of Prime Minister Shehbaz Sharif. Pakistan garnered 182 votes to become a member of the United Nations Security Council that showed the trust reposed by the international community in it.\nHe said the national economy was on positive trajectory and all the indicators were positive that were being endorsed by international financial organization, citing the report released by Fitch that termed the next year’s financial budget “positive”.\nThe rating made by the Fitch recognized at international level which had ultimately boosted the confidence of business community and investors in the national economy, he said, adding the stock market had crossed 78,000 points today that was indication of a “feel good factor” in the business circle.\nHe said inflation had reduced drastically to 11 per cent from 38 per cent with a significant increase in foreign exchange reserves and IT exports, besides rupee gained strength against the dollar.\nTo a query, he said political stunts could not control loadshedding rather extensive efforts and close coordination between the federation and the provinces were required in that regard.\nHe said the Khyber Pakhtunkhwa chief minister should resolve the issues on table with the Federal Government instead of visiting grid stations.\nThe major reason behind the loadshedding was electricity theft and line losses which could only be resolved through strong coordination between the federation and the provinces, he said, adding the government understood the political compulsion of the provincial leaders, but the steps to promote differences between the provinces were unacceptable.\nTo another query, he said the Pakistan Peoples Party delegation would meet the prime minister shortly and discuss the matters related the budget.\nHe also extended condolences on the demise of the father of the President of the National Press Club Azhar Jatoi.\nAt the outset of the press conference, the minister said the Federal and Punjab governments had made comprehensive arrangements to ensure peace, security and cleanliness on the occasion of Eid-ul-Azha. To this end, all the relevant departments including law enforcement agencies performed their jobs in efficient and remarkable manners.\nHe said Prime Minister Shehbaz Sharif and Chief Minister Maryam Nawaz led from the front for ensuring that all arrangements in that regard were in place beforehand.",
  "retrievedAt": "2025-08-11T03:21:25.882Z"
}
