{
  "title": "Defence Minister’s contradictory take fuels conjecture over nuclear-angle in Saudi pact - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Khawaja Asif first suggests nuclear capabilities may be extended to KSA; later retracts, says nuclear weapons ‘not on the radar’\n• FO adopts cautious approach; cites ‘evolving doctrine’ but offers no specifics\n• Dar hints other states also interested in defence deals\n\nISLAMABAD: Defence Minister Khawaja Asif’s conflicting statements about Pakistan’s new defence agreement with Saudi Arabia have intensified speculation about the pact’s nuclear dimension.\n\nDuring an appearance on a TV talk show on Thursday night, Mr Asif had suggested that Pakistan’s nuclear capabilities could be made available to Riyadh under the new framework.\n\n“What we have, and the capabilities we possess, will be made available to (Saudi Arabia) according to this agreement,” he said, stressing that Pakistan has always acted as a responsible nuclear state.\n\nThe remarks were interpreted as the first explicit signal that Pakistan might extend its nuclear deterrence to the kingdom, particularly as Mr Asif was present at the signing ceremony in Riyadh.\n\nHowever, in a subsequent interview with Reuters, the minister denied that nuclear weapons were part of the accord, saying they were “not on the radar”.\n\nAmid the confusion, the Foreign Office on Friday seemed to choose ‘strategic silence’, adopting a cautious approach.\n\nAt the weekly media briefing, Foreign Office spokesman Shafqat Ali Khan sidestepped repeated questions on whether the pact alters Pakistan’s long-declared policy of keeping its nuclear deterrent India-centric, and not extending it to another country.\n\nAsked twice whether that stance had changed, Mr Khan only referred to an evolving doctrine. “The doctrine has evolved and continues to do so,” he said. “I am not here to comment on the specificity of the doctrine, but our position is well known.”\n\nPakistan has consistently declared its nuclear programme is intended to deter India alone.\n\nIn Dec, the Foreign Office said: “Pakistan has made it abundantly clear that our strategic programme and allied capabilities are solely meant to deter and thwart a clear and visible existential threat from our neighbourhood and should not be perceived as a threat to any other country.”\n\nMr Khan, while parrying question about whether rules of engagement related to troop deployment in Saudi Arabia have been revised, framed the agreement as a consolidation of longstanding ties with Riyadh.\n\n“Since the 1960s, defence cooperation has served as one of the principal pillars of Pakistan-Saudi Arabia’s all-encompassing bilateral relations,” Mr Khan said. “The strategic mutual defence agreement formalises this decades-old and robust defence partnership.”\n\nWhen asked if the agreement was aimed to check Israel’s aggressive designs in the region, he said, “It is defensive in nature and not directed against any third country. It will contribute to regional peace, security and stability.”\n\nSpeculation about extended deterrence was first sparked by a Saudi official who, shortly after the agreement was signed, hinted to a Western news agency that Riyadh would under the agreement get nuclear cover. Saudi commentators later amplified the claim.\n\nThe joint statement that announced the accord, formally titled the “Strategic Mutual Defence Agreement”, described it as an initiative “to develop aspects of defence cooperation between the two countries and strengthen joint deterrence against any aggression”.\n\nOther states ‘interested’: Dar\n\nSeparately, speaking to reports in London, Foreign Minister Ishaq Dar hinted that some other states were also showing an interest in building strategic defence agreements with Pakistan.\n\n“It’s premature to say anything, but some other countries want to enter into an agreement of this nature,” Mr Dar told reporters in London, replying to a question about whether other states will join the pact or ink similar deals. “This was not signed overnight; it has taken several months.”\n\nCalling the agreement a “historic pact”, FM Dar said Pakistan has always maintained an informal defence arrangement with Saudi Arabia, which is the same as the agreement signed on Wednesday.\n\n“I believe that both sides are very happy. Let’s be frank: Saudi Arabia has stood with us during difficult times, such as the sanctions. Their support was very relevant and important,” he added. “Similarly, during the current crisis since 2022-2023, when we needed IMF (International Monetary Fund) support, Saudi Arabia stood with us.”\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:16:32.729Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943355/defence-ministers-contradictory-take-fuels-conjecture-over-nuclear-angle-in-saudi-pact",
  "dateList": "2025-09-21",
  "date_published": "2025-09-20T00:56:12.000Z"
}
