{
  "title": "Punjab prohibits sale, purchase of land ahead of work on flyovers, underpasses - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The district revenue department has imposed Section 4 of the Land Revenue Act of Punjab while prohibiting the sale and purchase of land for the construction of three flyovers and three underpasses at Kutchery Chowk, Iftikhar Janjua Road, and Jinnah Park on Old Airport Road.\n\nA senior official of the district administration told Dawn that a total of 32 kanals will be acquired from Rawalpindi for three government projects: Kutchery Chowk, Iftikhar Janjua Road, and Jinnah Park on Old Airport Road. He stated that Section 4 was invoked to facilitate land acquisition.\n\nThe Punjab government has approved the project to build three flyovers and three underpasses costing Rs14.5 billion to alleviate traffic congestion.\n\nA senior official from the district administration informed Dawn that the combined cost of the two flyovers and one underpass at Kutchery Chowk is estimated at Rs6.6bn, the Jinnah Park Underpass and Flyover Project at Rs5.2bn, and one underpass at Iftikhar Janjua is estimated at Rs2.7bn.\n\n32 kanals will be acquired from Rawalpindi for three govt projects\n\nHe added that land sales and purchases will remain prohibited. “Rs2bn additional funds have been allocated for the projects in the initial phase,” he said, emphasising that this was a key step towards realising the project.\n\nWhen contacted, Rana Qamar Ali, the Executive Director of the Punjab Highway Department, confirmed that Section 4 had been imposed in the areas along the routes of the three projects to facilitate land acquisition.\n\nHe clarified that Section 4 covers land needed for road construction and related facilities.\n\nHe highlighted that the flyovers and underpasses are crucial projects that will reduce traffic load in the city and improve commutes for motorists.\n\nHe mentioned that land from Fatima Jinnah Women University, tax offices, commissioner’s offices, police lines, and Jinnah Park would be acquired, with military land also slated for use in the projects.\n\nHe added that some private lands would need to be acquired as well. Following the imposition of Section 4, the land acquisition process will commence.\n\nHe noted that the government has directed that the designs of the flyovers and underpasses should minimise structural disruption.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:36.572Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943474/punjab-prohibits-sale-purchase-of-land-ahead-of-work-on-flyovers-underpasses",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:51.000Z"
}
