{
  "title": "Three ‘Afghans’ among seven terrorists killed in DI Khan operation: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Seven terrorists were killed, including three “Afghan nationals”, by security forces during an intelligence-based operation (IBO) in Khyber Pakhtunkhwa’s Dera Ismail Khan district, the military’s media wing said on Friday.\n\nIn a statement, the Inter-Services Public Relations (ISPR) said that the operation was carried out in the Kulachi area upon the presence of “khawarij”.\n\nThe state uses the term Fitna al Khwarij to refer to terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP). It has also designated Balochistan-based groups as Fitna al Hindustan to highlight India’s alleged role in terrorism and destabilisation across Pakistan.\n\n“During the conduct of [the] operation, own troops effectively engaged the khwarij location and [as a result], seven Indian sponsored khwarij, including three Afghan National khwarij and two suicide bombers, were sent to hell,” the ISPR said.\n\nThe statement added that Pakistan expects the interim Afghan government, run by the Afghan Taliban, to uphold its responsibilities and deny the use of its soil to carry out acts of terror.\n\nRelations between Islamabad and Kabul have soured over the use of the latter’s territory to stage attacks. Earlier this week, Pakistan warned the UN Security Council that terrorist groups operating from sanctuaries inside Afghanistan pose the gravest threat to its national security. Kabul denies the allegations.\n\n“[A] sanitisation operation is being conducted to eliminate any other Indian sponsored kharji found in the area, as the security forces of Pakistan are determined to wipe out the menace of Indian sponsored terrorism from the country,” the statement concluded.\n\nEarlier this week, security forces killed 31 terrorists in two separate IBOs in KP’s Lakki Marwat and Bannu districts, the military’s media wing said on Monday.\n\n“On 13-14 September, 31 khwarij belonging to Indian proxy Fitna al Khwarij were killed in two separate engagements in [the] Khyber Pakhtunkhwa province,” the ISPR said in a press release.\n\nPakistan has lately been witnessing an uptick in terrorist activities, mainly in KP and Balochistan. In November 2022, the Tehreek-i-Taliban Pakistan, after breaking a ceasefire deal with the government, had vowed to escalate attacks against the security forces, the police, and other law enforcement agencies’ personnel.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/21164031f37648f.webp",
  "retrievedAt": "2025-10-12T00:08:03.300Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943671/three-afghans-among-seven-terrorists-killed-in-di-khan-operation-ispr",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T11:42:23.000Z"
}
