{
  "title": "Central Deve­lopment Working Party recommends Rs18bn health project for KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Scheme to enhance availability, quality of primary healthcare in 13 districts\n• World Bank to provide $62.5m assistance as part of $200m human capital programme\n• Assessments reveal severe gaps in province’s healthcare\n\nISLAMABAD: The Central Deve­lopment Working Party (CDWP) on Friday recommended an Rs18.14 billion health sector project for Khyber Pakhtunkhwa to improve the availability and quality of healthcare for locals and refugees, and to secure $62.5 million in assistance from the World Bank.\n\nThe CDWP meeting, presided over by Planning Minister Ahsan Iqbal, also cleared a paper for a Rs2bn nationwide programme to eliminate AIDS, tuberculosis and malaria from the country by 2030.\n\nUnder the financial rules, the CDWP is empowered to approve projects costing up to Rs7.5bn, while the projects with higher estimated costs require approval from the Executive Committee of the National Economic Council (Ecnec), based on the CDWP’s recommendations and technical clearance.\n\nThe CDWP recommended the revised Khyber Pakhtunkhwa Human Capital Investment Project (health component) to Ecnec for approval at a total cost of Rs18.137bn. The project will be implemented through an independent project management unit under KP’s health department, in line with World Bank procurement guidelines and financing rules.\n\nCovering 13 districts — particularly Peshawar, Nowshera, Swabi and Haripur — the project seeks to enhance the availability and quality of primary healthcare services for both host communities and refugees.\n\nIt is part of the World Bank’s $200m assistance under the KP Human Capital Investment Project, covering both health and primary education.\n\nThe health-focused activities under the project include upgrading primary care facilities, supporting flood-affected healthcare units and providing future emergency support. The project’s objective is to improve the overall human capital by focusing on health and education in the selected districts.\n\nThe World Bank has assessed that confidence in primary health facilities in the province is low, leading to overcrowding in secondary and tertiary hospitals. Assess­m­ents found that overall, 48 per cent of equipment in 24/7 facilities was non-functional.\n\nAll rural health centres (RHCs) assessed were missing at least one of the four basic requirements for round-the-clock functionality: human resources (93pc), back-up electricity (19pc), equipment (93pc) and maintenance of infrastructure (89pc).\n\nKP also faces severe human resource shortages, with an essential health workforce density of 1.15 per 1,000 population — less than half the international benchmark. Medicine availability is inadequate as well, with only 59pc of facilities maintaining a two-week stock of 25 essential medicines. Consequently, only a quarter of KP’s population uses public sector primary healthcare facilities, with 14pc going to RHCs and just 7pc to basic health units (BHUs).\n\nThis overloads secondary and tertiary hospitals, which many people use as their first entry point to healthcare. The findings un­­d­erline the urgent need to strengthen prim­a­­ry healthcare facilities, improve efficiency, and ensure better access for vulnerable gro­u­ps, especially refugees, women, and children.\n\nThe CDWP also approved a position paper for “Strengthening Common Management Unit for AIDS, TB and Malaria and Accelerating Response to Control the three Diseases in Pakistan” at a cost of Rs2bn.\n\nThe nationwide initiative aims to harmonise and strengthen institutional systems to eliminate AIDS, TB and malaria by 2030, in line with Pakistan’s global commitments under the Sustainable Development Goals (SDGs). An Integrated Technical Support Unit will provide oversight, surveillance and technical guidance to provinces, ensuring harmonised programming and capacity building.\n\nReviewing the position paper of the project titled “Responsive, Readiness and Resilient STEM Secondary Education in Punjab” (based on the ADB loan), the planning minister stressed that early childhood education must remain at the core of provincial and national education policies.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:42.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943558/central-development-working-party-recommends-rs18bn-health-project-for-kp",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:14.000Z"
}
