{
  "title": "Punjab ramps up steps to avert ‘wheat crisis’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Price control secretary says geotagging, verification of wheat stock decided for proactive planning; defends inter-provincial curbs to ensure ample supply\n• Mills barred from using wheat for manufacturing poultry feed\n\nLAHORE: The Punjab government has stepped up measures, including geotagging of stocks, to avert a potential wheat crisis in the province after floods in the eastern rivers washed away farmlands and destroyed stockpiles in its central districts.\n\nThe move comes amid restrictions on the interprovincial movement of the commodity by the provincial government, which has raised prices in Khyber Pakhtunkhwa by up to 68 per cent, also prompting protests by Sindh and KP.\n\nSources told Dawn that the decision to restrict the wheat trade was taken to ensure an ample supply of the grain in the province and to avert a looming crisis. Besides this measure, the Punjab Price Control and Commodities Management also decided to start geotagging and physically verifying wheat stocks in warehouses across the province.\n\nIts secretary Dr Kiran Khurshid notified a four-member departmental monitoring committee led by Deputy Secretary Shazia Rehman to collect data from all districts in collaboration with the Punjab Enforcement and Regulatory Authority (Pera) and the food directorate. Through this practice, the wheat stocks stored in government and private warehouses will be registered to meet the food crisis feared in the aftermath of the floods.\n\nDr Khurshid said her department would implement the government policy to avert the unpredictable and unforeseen crisis post-floods. She said people had lost massive wheat stocks in the recent floods and now it was the government’s responsibility to take care of its citizens.\n\nShe said the price control and commodities department was geotagging wheat warehouses to gather information about the actual stocks and resources for predictive analysis and anticipative planning.\n\n“The geotagging is just an intervention, not a solution,” she said, adding that it would take time to trace wheat.\n\nShe said the department had established a strategic management wing (SWM) to digitise the department’s assets, resources and activities of the department’s eight directorates. “All the scattered information would be available for the department and higher authorities in one dashboard for monitoring and taking informed decisions,” she said.\n\nThe Punjab Home Department, at the request of the price control department, had also imposed Section 144 and prohibited the mills in the province from using 10,184 metric tonnes of wheat for feed manufacturing.\n\nInterprovincial curbs\n\nSources said the provincial government was keeping a strict check on the movement of wheat at the exit points of the province. They claimed that Chief Minister Maryam Nawaz had made it clear that her foremost duty was to stave off a food crisis in her province and ensure that the citizens got their due wheat share through government packages or other means.\n\nShe had also been quoted as saying that some four million people had been affected by floods and the executive machinery needed to ensure the availability of wheat for the flood survivors.\n\nThe price control secretary, Dr Khurshid, also acknowledged that Punjab was monitoring the wheat movement at the Sindh and KP borders because “businessmen would always like to sell their commodities, where they would get a better price”.\n\n“In this situation, the government’s role is to ensure that wheat stocks in the province meet the needs of its people. It will be insane if the government lets its wheat go to other provinces at a lower price and later purchase it at a higher cost for its own people,” Dr Khurshid said. It may be mentioned that the government had not purchased wheat and there were no hefty stocks in government warehouses.\n\nMeanwhile, the department arrested 107 profiteers, fined 12,043 profiteers, and registered cases against seven individuals. In the matter of over-charging in wheat flour prices, the department officials arrested 18 officials, registered cases against four individuals and fined 1,074 persons. In a crackdown on hoarders, the department has already recovered 334,000 metric tonnes of wheat across the province.\n\nThese measures helped increase wheat stocks in flour mills by 165,000 metric tonnes this month alone.\n\nAdditionally, the grinding of 360,000 metric tonnes of wheat has ensured a steady supply of flour and brought down wheat prices from Rs3,800 to Rs3,000 per 40kg.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:35.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943576/punjab-ramps-up-steps-to-avert-wheat-crisis",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:37:59.000Z"
}
