{
  "title": "Indian skipper sidesteps handshake issue ahead of Pakistan-India rematch - Sport - DAWN.COM",
  "author": null,
  "content": "Indian captain Suryakumar Yadav sidestepped the no-handshake issue ahead of the Asia Cup rematch against Pakistan in Dubai on Sunday, choosing to focus instead on the cricket.\n\nThe Group A clash between the fierce rivals last Sunday ended on a bitter note when Indian players refused to shake hands with their opponents.\n\nIt was the first meeting between the regional neighbours since a four-day conflict in May left more than 70 people dead.\n\nWhile the match itself passed without incident, there was no shaking of hands between the captains at the toss or among the players at the end.\n\nThen, at the post-match ceremony, Indian captain Suryakumar Yadav seemingly ‘politicised’ the victory by bringing up the Pahalgam terrorist attack in India-occupied Kashmir, over which the two countries fought a four-day military conflict in May, saying the victory was “a perfect gift” for his country.\n\nThe Pakistan Cricket Board (PCB) called for match referee Andy Pycroft’s immediate removal for a code of conduct “violation” and considered withdrawing from the tournament before going ahead with Wednesday’s match. The board alleged that Pycroft told Pakistan skipper Salman Ali Agha not to shake hands with Indian counterpart Yadav before the match.\n\nYadav changed the subject when asked about the handshake issue and Pycroft’s presence, saying, “It will be a good contest between the ball and the bat”.\n\nHe added: “Close your room, switch off your phone and sleep. I think that’s the best thing to shut the noise. It’s easy to say, but sometimes it is difficult.”\n\nThe matter was settled after the PCB said ahead of yesterday’s match that Pycroft had apologised to the manager and captain of the Green Shirts over a controversy during the recent Pakistan-India match.\n\nPakistan’s last group game — which they won easily against the United Arab Emirates — was delayed for an hour due to the stand-off before the matter was resolved with Pycroft’s apology.\n\nPycroft remained the match referee for Wednesday’s game and is still scheduled to officiate on Sunday.\n\nIndian media have reported that the team plans to stick to its no-handshake policy for Sunday’s clash.\n\nIndia won all three of their group games, narrowly edging out a brave Oman by 21 runs in Abu Dhabi on Friday, as well as beating Pakistan by seven and the UAE by nine wickets respectively.\n\nSuryakumar praised minnows Oman, appearing in the Asia Cup for the first time, for putting up a good fight.\n\n“I feel they played a good brand of cricket,” he said of a team who ended on 167-4 in reply to India’s 188-8.\n\n“They batted very well, but we also managed to give a good outing to our players.”\n\nLast Sunday’s match had been coloured from the start by calls from across the border to ‘boycott’ the fixture. It seems the pressure got to the players as well, with the Indian team refusing to shake hands, as is customary, at the toss and after the match.\n\nA potential third India-Pakistan showdown looms if both sides qualify for the final on September 28 in Dubai.\n\nIndia lifted the Asia Cup in its last, 50-over edition and are the favourites to retain the crown.\n\nIndia and Pakistan advanced to the next stage from Group A, while Sri Lanka and Bangladesh qualified from Group B.\n\nAlong with regional bragging rights, the Asia Cup serves as a build-up towards the T20 World Cup in February-March in India and Sri Lanka.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/201825196a1266e.webp",
  "retrievedAt": "2025-09-21T11:28:07.172Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943436/indian-skipper-sidesteps-handshake-issue-ahead-of-pakistan-india-rematch",
  "dateList": "2025-09-21",
  "date_published": "2025-09-20T13:17:19.000Z"
}
