{
  "title": "105 shopkeepers booked for attacking officials in Toba Tek Singh - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: The Arrouti police of Pirmahal booked 105 shopkeepers on Saturday for attacking officials and damaging the vehicle of the Pirmahal assistant commissioner during an anti-encroachment drive in Sindhillanwali Town.\n\nTehsildar Imran Abbas claimed in his complaint that during an operation led by the Pirmahal AC, accused Rana Mustansar Riaz, his 14 nominated and 90 other accomplices armed with steel bars, axes and sticks attacked the Punjab Enforcement and Regulatory Authority (Pera) team.\n\nHe alleged that the men ransacked the official vehicle of the AC and an excavator. He alleged that they pelted stones on officials and blocked traffic on the Pirmahal Road.\n\nPolice were conducting raids to arrest the accused shopkeepers.\n\nAnjuman Tajiran leader terms the case completely baseless\n\nMeanwhile, Toba Tek Singh Markazi Anjuman Tajiran Senior Vice President Rana Khalid Mahmood condemned the case against the shopkeepers, including Anjuman Tajiran President Rana Mustansir Riaz, by the district administration.\n\nIn a statement, he claimed that the case was completely baseless, an act of revenge and a form of oppression. He demanded immediate withdrawal of the case and the release of the ‘innocent’ shopkeepers.\n\nHe said the shopkeepers belonged to the flood-affected villages and were living in desperate conditions after bearing losses. He said that at such a time, these actions were rubbing salt on their wounds. He announced that traders would raise their voice against this injustice and would take to the streets.\n\nMURDER: A man allegedly murdered his wife and father and critically injured his daughter in Chak 50-JB, Boorraywal, at Faisalabad in the wee hours of Friday.\n\nComplainant Liaqat Ali of Shahkot, Nankana Sahib claimed, in the FIR registered by the Nishatabad police, that his son-in-law accused Sajjad Jat suspected his wife Shazia Bibi (40) of having loose morals. He claimed that after an altercation with her, he fired on her.\n\nHe said when the father of the accused, Ghulam Fareed (60) and his daughter Tayyaba (14) attempted to stop him, he also allegedly shot both of them.\n\nLater, Shazia Bibi and Ghulam Fareed succumbed to their injuries, while Tayyaba was shifted to the Allied Hospital in a critical condition.\n\nPolice were conducting raids to arrest the accused, who managed to flee after the murders.\n\nMURDER CASE SOLVED: Jhang police claimed to have solved a blind murder case of a youth whose body was recovered on September 17 in the precinct of Shorkot City police station.\n\nPolice spokesperson said the deceased was identified as Nayyar Kodhan, who was shot to death. He said that the police succeeded in reaching the accused by using modern methods of investigation. He said that the keys and motorcycle recovered from the crime scene played an important role in solving the case.\n\nDuring the investigation, three accused involved in the murder, Abid, Irfan and Hassan, were taken into custody. He claimed that they had confessed to the killing over their indecent video made viral by the deceased.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:37.456Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943500/105-shopkeepers-booked-for-attacking-officials-in-toba-tek-singh",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:45.000Z"
}
