{
  "title": "Afghan govt spokesperson says leaders shouldn’t make ‘provocative’ statements, stresses need for talks - Pakistan - DAWN.COM",
  "author": null,
  "content": "The spokesperson for the Taliban government in Afghanistan Zabiullah Mujahid has said that leaders should refrain from making “provocative” statements and that his country could not be held responsible for attacks taking place in Pakistan.\n\nMujahid’s remarks come as Pakistan continues to raise alarm over terrorist outfits, particularly the banned Tehreek-i-Taliban Pakistan (TTP), using Afghan soil to carry out attacks across the border. Islamabad has repeatedly urged Kabul to choose between maintaining ties with its neighbour or harbouring terrorists, but Afghan authorities have consistently denied the allegations.\n\nHe made these remarks during an interview with Imtiaz Gul, the executive director of Islamabad-based think tank Centre for Research and Security Studies. According to Gul, the interview — conducted in the Pushto language — was recorded during his recent visit to Afghanistan’s Kandahar province.\n\nDuring the interview, Gul sought proposals from Mujahid to address recurring problems, such as the issue of TTP or “the negative propaganda in the media that harms and poisons the relations” between Pakistan and Afghanistan. The spokesperson was also asked whether he felt the need for some sort of “joint mechanism” on such matters.\n\nIn his response, Mujahid emphasised that leaders should avoid making “provocative” statements. If statements having “threatening” undertones were issued, “we cannot stop” others, he asserted. The Taliban government spokesperson went on to say that “giving statements to the media, spoiling the environment and taking military action is unwise”.\n\nInstead, he stressed that talks should be held. “There should be more visits, which would create trust on both sides,” Mujahid added.\n\nHe said his government was “unhappy with the current environment and propaganda that was happening presently” as it was not in the interest of either Pakistan or Afghanistan.\n\nMujahid also highlighted that attacks by militants and terrorists in Pakistan were not a recent occurrence. “It has been happening since 2003.”\n\n“Then Pakistan should take steps to foil such attacks”, he said. “Islamabad should also share information with Kabul so that we can make efforts to counter these threats as well.”\n\nBut, at the same time, Mujahid added that Afghanistan could not be held responsible for bomb blasts in Bannu or any other area of Pakistan.\n\n“Pakistan should ensure its own security,” he asserted, further recommending that Islamabad and Kabul should engage in talks to discuss the reasons behind the issue of terrorism.\n\n“You should take us into confidence if you believe that you face threats from [an entity] in Afghanistan.”\n\nMujahid’s remarks follow a recent statement by Prime Minister Shehbaz Sharif, in which he issued a stern message to Kabul, saying that Afghanistan must decide whether it stands with Pakistan or the TTP. The premier’s statement had come after he attended the funeral of 12 soldiers in Bannu, who were martyred during an exchange of fire with terrorists in South Waziristan.\n\nThe issue of terrorists using Afghan soil against Pakistan, along with frequent border skirmishes, has long strained ties between the two countries, with Islamabad repeatedly urging the interim Afghan government to stop allowing its territory to be used for attacks.\n\nGul also raised this issue during his conversation with Mujahid with respect to the strained ties between Pakistan and Afghanistan.\n\n“Pakistan seems to have drawn a red line as far as the TTP’s presence in Afghanistan is concerned,” Gul said, adding that this was seen as the main reason for growing tensions between the two countries. Gul asked Mujahid whether he agreed with this.\n\nMujahid, however, clearly stated that the TTP was Pakistan’s “internal issue”.\n\n“Pakistan should find a solution to this problem,” he said, adding that Islamabad should not spoil its ties with Kabul over this matter.\n\nHe also assured that Afghanistan was making efforts to make sure that “no one uses its soil against any other country”.\n\n“No armed person can go to Pakistan from Afghanistan […] The terrain in some areas is difficult, and some people may be able to take advantage of it.\n\n“We should find a solution to this problem through negotiations and Afghanistan should not be blamed for it […] We do not want fighting, bloodshed and difficulties in Pakistan.”\n\nEarlier in the interview, when asked what messages he and the Islamic Emirate had for those in Pakistan, he said he wanted to convey to leaders and officials that “Afghanistan wanted brotherly ties and that any issues between the two countries should be resolved through negotiations”.\n\n“Levelling allegations and making threats spoil the environment, which further complicates matters,” he said. The spokesperson also called for reforms in policy and urged religious scholars in Pakistan to play a role in maintaining good ties between the two countries.\n\nLastly, he said, he had a message for the people of Pakistan.\n\n“My final message is for the people of Pakistan. Afghans do not want lawlessness in Pakistan. Afghanistan does not want difficulties in Pakistan […] Afghanistan wants normalisation of ties with Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/211744439207e34.webp",
  "retrievedAt": "2025-10-12T00:08:06.694Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943679/afghan-govt-spokesperson-says-leaders-shouldnt-make-provocative-statements-stresses-need-for-talks",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T13:04:33.000Z"
}
