{
  "title": "Maritime minister warns of textile pollution impact - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s textile and garment industry may face stricter environmental regulations, as Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry on Saturday raised concerns over pollution caused by textile and fashion waste.\n\nOn World Clean-Up Day 2025, which focused on “Tackling Textile and Fashion Waste Through Circular Fashion,” the minister called for urgent action to implement sustainable practices that protect oceans and ensure a viable future for coming generations.\n\n“Pollution of the oceans is an increasing threat, not just to marine life but also to economic stability, climate resilience, and the well-being of future generations,” the minister said in a statement. He emphasised that the day, recognised globally, aims to address solid waste and marine debris, with particular attention on the growing issue of textile pollution.\n\nThe minister pointed out the government’s commitment to tackling climate change, highlighting the need for policies that balance environmental protection, economic growth, and public health. “The health of our oceans is directly tied to the well-being of our people and economy. I urge industries, policymakers, and citizens to recognise the dangers of textile waste and work together to create a circular economy that protects livelihoods and biodiversity,” he added.\n\nUrges sustainable practices to prevent environmental and economic risks\n\nPakistan’s textile and fashion sector, which accounts for nearly 60% of the country’s national exports, is also a major contributor to waste and pollution. Studies indicate that textile waste significantly contributes to microplastic contamination in rivers and seas, posing a threat to marine life, including fish, corals, and coastal ecosystems.\n\nEvery year, tonnes of textile waste end up in landfills and waterways, ultimately flowing into the Arabian Sea. Microfibers from synthetic fabrics are ingested by marine animals, disrupting food chains and exacerbating the pressure on species already threatened by climate change, overfishing, and habitat loss.\n\nThe minister highlighted that the economic impact extends beyond environmental concerns. Pakistan’s blue economy, which includes fisheries, shipping, tourism, and coastal industries, incurs major losses due to polluted waters and degraded habitats. Pollution-related losses in fisheries alone exceed $200 million annually, while the potential for coastal tourism remains largely untapped. If the current trends continue, the financial toll will grow, the minister warned.\n\nGlobally, the fashion industry loses around $500 billion each year due to underutilisation and lack of recycling, making the adoption of circular fashion an environmental and economic necessity. In Pakistan, embracing sustainable practices could help protect vital sectors from further losses and boost the country’s economy.\n\nThe maritime minister also pointed to the link between textile waste and climate change, noting that the sector is a major consumer of water and emitter of greenhouse gases. Discarded textiles in landfills release methane, a potent climate pollutant, further exacerbating global warming, particularly in coastal areas vulnerable to rising sea levels and extreme weather events.\n\nCircular fashion, which promotes longer-lasting, reusable, repairable, and recyclable products, offers a solution to reduce emissions, conserve resources, and address climate challenges. This approach is crucial for Pakistan, a country facing escalating environmental risks.“The challenge is too large for the government to address alone. Public-private partnerships, collaboration with academia, and active citizen involvement are essential,” the minister stressed.\n\nHe called for collective action, including supporting sustainable brands, reducing overconsumption, and recycling textiles, as crucial steps to protect marine ecosystems, enhance economic resilience, and create a sustainable future.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cf41455b249.gif",
  "retrievedAt": "2025-09-21T11:27:41.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943566/maritime-minister-warns-of-textile-pollution-impact",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:20.000Z"
}
