{
  "title": "Climate change may devastate millions of lives, economy by 2050: WEF - World - DAWN.COM",
  "author": null,
  "content": "• Warns of 14.5m excess deaths concentrated mainly in vulnerable regions\n• Says health, construction and agriculture sectors could lose over $1.5tr\n\nISLAMABAD: The World Economic Forum (WEF) warned in a fresh insight report that climate change, if left unaddressed, could result in 14.5 million excess deaths and trillion of dollars in economic loses by 2050, concentrated in the world’s most disadvantaged regions and populations.\n\nThe report, “Building Economic Resilience to the Health Impacts of Climate Change,” says deaths from extreme weather events in those regions have been about 15 times higher over the past decade.\n\nIt also warns that climate-health impacts threaten business resilience and that today, less than 5 per cent of global adaptation funding targets health protection. “This is a dangerous gap that also presents an opportunity for private-sector action,” the report said.\n\nThe WEF defines a Climate and Health Business Framework and applies it to four highly exposed sectors to identify specific climate-health risks and opportunities.\n\nIn food and agriculture, the report says an estimated 24m additional people will face hunger by 2050 and that agricultural workers are expected to face growing climate-health risks. It estimates a likely, mid-range scenario of $740 billion in worker-availability losses between 2025 and 2050.\n\n“Businesses that invest in resilient and precision agriculture practices and modified working practices will be best positioned to meet growing global needs for consistently available, healthy foods,” the report said.\n\nIn the built environment, the forum notes that more than half of the world’s population lives in urban areas and that most buildings and infrastructure are poorly adapted for climate extremes such as heat and air pollution.\n\nConstruction workers are particularly vulnerable; the report projects a likely, mid-range scenario that the industry will lose at least $570bn in worker-availability losses between 2025 and 2050. It says climate-resilient design and retrofits have the potential to safeguard communities and economy.\n\nThe health and health-care sector is expected to face at least $200 billion in worker-availability losses in a likely, mid-range scenario from 2025 to 2050 and to bear an additional $1.1 trillion treatment burden due to climate change by 2050, the report says, underscoring the need for a shift toward preventive care.\n\n“There is tremendous opportunity for companies to lead this transformation and build resilience by creating new climate-resilient medicines and robust care pathways, and improving public-health engagement,” it said.\n\nClimate change is also driving up claims in health, life and casualty coverage. The report cites Swiss Re forecasting 0.75pc excess mortality annually by 2050.\n\nMeanwhile, it notes, only about 8pc of people in low-income communities are covered by health insurance. Insurers, the report says, can support and accelerate resilience by offering innovative products, improving forecasting capabilities and incentivising risk reduction.\n\nTaken together, it says, worker-availability losses across food and agriculture, the built environment and health and health care are projected to exceed $1.5 trillion between 2025 and 2050, underscoring the magnitude of the climate-health challenge.\n\nWhile institutions in each sector can act, the report stresses that no sector can tackle the challenge alone.\n\n“Success depends on enabling coordinated action — through supportive policies, interoperable climate-health data systems and innovative financing to mobilise capital,” it said. Those foundations, the WEF added, can help ensure long-term, scalable resilience.\n\nThe report highlights practical measures that can reduce illness and mortality in vulnerable regions: providing workers with medical care, implementing cooling solutions and modifying work practices. It also calls for expanded investment in research and development to advance science and develop solutions for climate-linked health challenges.\n\n“By investing in research, businesses can help identify the root causes of climate-health risks and develop new treatments, technologies and preventive strategies,” the report said.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:43.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943570/climate-change-may-devastate-millions-of-lives-economy-by-2050-wef",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:06.000Z"
}
