{
  "title": "Suspected serial rapist confesses before Karachi magistrate - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Saturday recorded the confessional statement of a suspected serial rapist in six cases pertaining to subjecting underage girls to sexual assaults.\n\nThe investigating officer (IO) moved an application before a judicial magistrate (south) and submitted that the suspect was willing to record his confessional statement under Section 164 of the Criminal Procedure Code (CrPC) before the court.\n\nAfter completing the legal formalities, the magistrate recorded the statement of the suspect in which he confessed to having raped minor girls in these cases.\n\nAfter recording the confession, the magistrate sent him to prison on judicial remand and directed the IOs to complete investigations.\n\nThe prosecution said that the suspect was arrested from Qayyumabad on Sept 11 as the matter came to the authorities’ attention after one of his alleged victims managed to obtain a USB drive from the suspect and took it to a video shop where shop owner detected the presence of explicit content on the drive and informed area residents, who apprehended the suspect and beat him up before handing him over to the police. The videos have been sent to Punjab for forensic examination.\n\nSix cases have been registered against the suspect at the Defence police station under Sections 376 (punishment for rape) and 377 (unnatural offence) of the Pakistan Penal Code.\n\nA separate FIR was also lodged on the complaint of the state against the suspect and estate agent Ijaz Awan, who provided him accommodation on rent, under Section 11/3 of the Sindh Information of Temporary Residents Act and the court on Saturday also sent the suspected rapist to jail in this case, while the estate agent was on pre-arrest bail.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:38.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943525/suspected-serial-rapist-confesses-before-karachi-magistrate",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:39.000Z"
}
