{
  "title": "87 Palestinians killed as Israel intensifies Gaza City assault - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Israel’s military kept up its assault on Gaza City and the wider Gaza Strip on Saturday, dismantling underground shafts and booby-trapped structures in attacks that left 87 Palestinians dead, 70 of them in Gaza City.\n\nThe civil defence agency said 11 were killed when warplanes struck the Dughmush family in the city’s Al-Sabra neighbourhood.\n\nThe assault came as 10 countries including Australia, Belgium, Britain and Canada are scheduled to formally recognise an independent Palestinian state on Monday, ahead of the annual gathering at the UN General Assembly.\n\nIsrael’s intensified military demolition campaign targeting high-rise buildings in Gaza City began this week alongside a ground assault.\n\nIts forces, which control Gaza City’s eastern suburbs, have in recent days been pounding the Sheikh Radwan and Tel Al Hawa areas from where they would be positioned to advance on central and western parts of the city, where most of the population is sheltering.\n\nHamas warns lives of Israeli prisoners are in danger due to massive bombardment\n\nIsrael’s military estimates it has demolished up to 20 tower blocks over the past two weeks and believes some 350,000 people have left Gaza City since the start of this month. Another 600,000 or so remain, however.\n\nIncluded in that tally are some of the Israeli prisoners being held by Hamas.\n\nThe group’s military wing released an image of the prisoners on Telegram on Saturday, warning that their lives were at risk due to Israel’s military operation in Gaza City.\n\nIn almost two years of fighting, Israel’s bombardment has killed more than 65,000 Palestinians, spread famine, demolished most structures and displaced most of the population, in many cases multiple times.\n\nIsrael says the “war will end only if Hamas surrenders”, frees Israeli prisoners, disarms and disbands. Hamas says it will not disarm until a Palestinian state is established.\n\nA total of 48 of the 251 Israelis taken prisoner on Oct 7, 2023, are yet to be released, but 28 are thought to be dead.\n\nHospital director traumatised\n\nAs Israel presses on with its offensive to capture the territory’s largest urban centre, Palestinians are going through unimaginable trauma.\n\nThe director of Al Shifa hospital was shocked and devastated when two victims killed in a strike were delivered to his ward: his brother and sister-in-law.\n\n“I was shocked and devastated to see the bodies of my brother and his wife,” said Mohammed Abu Salmiya, who was working in the emergency department of the territory’s main hospital at the time.\n\n“Anything is possible now, as you receive your dearest ones as martyrs or wounded,” he said. “The occupation’s crimes continue, and the number of martyrs keeps rising.”\n\nA journalist saw ambulances with sirens blaring into the hospital compound, bringing more bodies of people killed by Israel’s bombardment of Gaza City.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cf42d67c297.gif",
  "retrievedAt": "2025-09-21T12:09:07.934Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943574/87-palestinians-killed-as-israel-intensifies-gaza-city-assault",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:06.000Z"
}
