{
  "title": "Pakistan poised to meet IMF targets - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan is expected to meet all seven Quantitative Performance Criteria (QPC) set by the International Monetary Fund (IMF) ahead of the second semi-annual review of the country’s Extended Fund Facility (EFF) programme, according to Topline Securities’ report released on Saturday.\n\nThe IMF team is scheduled to visit Pakistan on Sept 25 to review the country’s performance under the $7 billion EFF arrangement, covering the first half of 2025. The review will assess Pakistan’s progress in meeting key economic targets for the March-June quarter.\n\nBased on Topline’s estimates, Pakistan is likely to meet the IMF’s QPC, including targets related to net international reserves and swap positions. The primary balance numbers for FY25 are also well within the IMF’s projections, the report noted.\n\nIn addition to fulfilling IMF-mandated reforms, Pakistan is actively seeking foreign investment in emerging sectors such as offshore drilling, mining, and Web 3.0 technologies. A key milestone in this effort was the Pakistan Mineral Investment Forum 2025, held in April, which drew over 5,000 delegates from more than 50 countries.\n\nFund mission to assess economic performance from 25th as floods and inflation pressures persist\n\nThe report also highlighted renewed interest from the United States in Pakistan’s offshore hydrocarbon resources, which could play a crucial role in the development of the country’s untapped natural resources. The Reko Diq mining project, a flagship initiative, is expected to reach its financial close in the coming weeks.\n\nHowever, Pakistan is also grappling with severe floods and heavy rains, affecting much of the country except for a few regions like Balochistan and Azad Kashmir. While the central bank has noted that the intensity of the current floods is less severe than past events, Topline cautioned that the floods could temporarily disrupt economic reforms. The report added that Pakistan’s resilient economy should recover from the impact in the near term.\n\nThe floods are expected to increase relief spending and further strain government revenues, leading to a projected rise in the fiscal deficit for FY26. Topline has revised its fiscal deficit forecast to 4.8 per cent of GDP, up from an earlier estimate of 4.1pc.\n\nThe Federal Board of Revenue (FBR) is now expected to collect Rs13.6 trillion in tax revenues for FY26, down from the earlier target of Rs14.1tr. This revision reflects a slower economic recovery and the expected impact of the floods on GDP growth.\n\nGDP growth is now forecast to be between 2.75pc and 3.25pc, down from the previous range of 3.5pc to 4pc. Agriculture growth has been downgraded to 2.6pc, following expected crop losses of 15pc for rice and 10pc for cotton due to the floods.\n\nThe current account deficit is expected to remain within the 0-0.5pc range of GDP. Topline has revised its import growth forecast to 10pc (from 9pc), while lowering its export growth projection to just 1pc (from 4%). However, remittances are expected to grow by 6pc, with any higher growth in remittances acting as a positive offset to the current account deficit.\n\nThe report also indicated that the central bank is likely to maintain the policy rate unchanged through FY26, revising its previous assumption of a potential rate hike.\n\nThis shift is attributed to risks stemming from food inflation due to the floods, rising import bills, and geopolitical uncertainties, including recent tensions in Israel and Qatar, which could affect oil prices.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:31.487Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943563",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:20.000Z"
}
