{
  "title": "Events that led to the ‘demolition of Islamabad High Court’, in the words of its own judges - Pakistan - DAWN.COM",
  "author": null,
  "content": "“The demolition of the IHC and its independence, that is being witnessed today, is only because the petitioner judges dared to object to the executive’s interference in their judicial work and uphold their oath as judges of the IHC.”\n\nThese are the words of five Islamabad High Court (IHC) judges who have moved the Supreme Court (SC) against the IHC itself, and its top judge.\n\nJustices Mohsin Akhtar Kayani, Babar Sattar, Tariq Mah­mood Jahangiri, Saman Rafat and Ejaz Ishaq Khan have filed similar petitions in the country’s apex court. Their applications also outline the events that led to them making the move.\n\nHere’s how these events unfolded, as detailed in their pleas.\n\nDuring the tenure of the previous IHC chief justice, now Supreme Court Justice Aamer Farooq, the petitioners had raised the “issue of executive interference in judicial work and attempts to pressurise the judges to influence judicial outcomes in certain cases”.\n\n“These serious concerns” were first brought to the knowledge of the then-chief justice of the IHC, informally, in a meeting of all the judges of the high court. The same concerns were brought to the attention of the then-chief justice of Pakistan, Umar Ata Bandial, during a meeting at his residence in May 2023, and the petitioners continued to raise the issue, along with other administrative matters, in several meetings with the then-IHC CJ.\n\nAccording to the petitioners, these issues had a “serious impact on the administration of justice and independence of the judiciary”.\n\n“However, no response that would adequately address the serious concerns was forthcoming.”\n\nSubsequently, six IHC judges “felt constrained to formally notify the then chief justice, through a letter dated May 10, 2023, regarding the attempts to assert pressure to influence judicial outcomes”. These judges also included the ones who petitioned the SC on Friday.\n\nThe six judges had recommended to the then-IHC CJ to initiate appropriate proceedings under Article 204 of the Constitution — which deals with contempt of court — to address the matter.\n\n“No proceedings were, however, initiated.”\n\nIn this connection, the six IHC judges also met the senior-most judges of the SC — then-CJP Bandial, then-senior puisne judge of the apex court, Qazi Faez Isa, and Justice Ijazul Ahsan — the same month “in another attempt to seek appropriate response from within the institution”.\n\n“However, the attempts to pressurise and intimidate the judges continued and were reported to the relevant offices within the institution.”\n\nThen, in March last year, an SC ruling set aside the dismissal of former IHC senior puisne judge Shaukat Aziz Siddiqui. He had been dismissed as a judge of the high court in October 2018 by the Supreme Judicial Council (SJC) — which decides on cases of misconduct of the judges of the superior judiciary — over a fiery speech he had delivered that year at the Rawalpindi Bar Association targeting a security institution.\n\nIn his speech, Justice Siddiqui had accused Inter-Services Intelligence (ISI) of influencing court proceedings and ‘forming benches of its choice’.\n\nIn view of the SC’s 2024 ruling and “continued interference by the executive branch in the affairs of the Islamabad High Court,” the six judges had also approached the SJC members and SC judges to “seek guidance on the duty of a judge to report and respond to executive interference through their letter dated March 25, 2024”.\n\nIn April, the SC took suo motu notice of the matter, and in the first hearing, the SC directed all stakeholders, including the high courts, to furnish their proposals “as to what should be the institutional response and mechanism to address the issues like the ones raised in the letter.”\n\nBut, instead of convening a full court meeting to deliberate and discuss the proposals, then-IHC CJ Farooq “deemed it appropriate to only circulate the order and seek proposals”, the judges regret.\n\nSubsequently, Justices Arbab Tahir, Babar Sattar and Saman Rafat were “constrained” to write letters to the then-CJ, urging him to convene a full court meeting for consultation between members of a collegiate body, as opposed to merely circulating the order, and seeking proposals.\n\n“A full court meeting of the IHC was thereafter convened on April 23, 2024, wherein it was unanimously decided that a formal reporting mechanism and appropriate remedial action shall be taken in cases of any executive interference.”\n\nThe proposals were also submitted to the SC, but the matter remains “pending and no substantial proceedings have been conducted since last year”.\n\nIn the days following this development, “the takeover of Islamabad High Court” by way of transfer of judges from the provincial high courts to IHC was initiated, and already serving judges of the IHC were “deprived” of their “due seniority”. The transferred judges included incumbent IHC CJ Sardar Muhammad Sarfraz Dogar.\n\nThis move impacted the IHC’s seniority list, leading to Dogar’s appointment to the top post.\n\nKeeping in mind their code of conduct and comity of judges, the petitioner judges once again reached out to the then-IHC CJ to express reservations and concerns regarding any transfer with the clear intent to “penalise the already serving judges” of the IHC.\n\nSome of the petitioner judges also spoke to the then-chief justice of Pakistan, and voiced their concerns regarding such transfers and the “deleterious effect” they may have on the IHC and its independence. These transfers were carried out with “indecent haste”, which “forced” the petitioner judges to formally write to all relevant chief justices and ask them to hold “meaningful consultation” in line with Article 200 of the Constitution. This provision of the Constitution deals with the transfer of high court judges.\n\nThe chief justices were also asked to advise the president against any such transfer that would “erode the independence” of the IHC.\n\n“Nevertheless, three judges from different provincial high courts … were transferred to the IHC right before the elevation of the then-chief justice of the IHC.\n\n“Immediately after the transfer process was purportedly completed, the then-chief justice of the IHC issued a revised roster and seniority list on February 3, 2025,” the petition notes.\n\nThen, during a meeting of the Judicial Commission of Pakistan on February 10, convened to consider elevations of judges of high courts to the SC, then-IHC CJ Aamer Farooq was nominated as a judge of the country’s apex court.\n\nTwo days later, President Asif Zardari notified his appointment and CJ Dogar was appointed as the acting IHC CJ, “after having spent not even two weeks” at the Islamabad High Court.\n\n“Left with no other remedy, the petitioner judges were constrained to challenge the transfer of three judges and the revised seniority before the Supreme Court of Pakistan.”\n\nThe SC issued a short order on their plea on June 19, remanding the issue of seniority to the president. This order, however, was challenged through an intra-court appeal in the apex court. But “detailed reasons” for the SC ruling on June 19 are still awaited, and the subsequent appeals are yet to be fixed.\n\nThese events also led to the “ouster of senior-most judges of the Islamabad High Court from the administration of the Court and unlawful adoption of the Islamabad High Court Practice and Procedure Rules, 2025,” the judges say.\n\n“The intent behind the transfer became apparent immediately when, in complete violation of the applicable rules and the practice of the court”, a crucial administration committee of the IHC was reconstituted to comprise Justices Aamer Farooq, Dogar and Khadim Hussain Soomro. Notably, among them, Justices Dogar and Soomro were newly transferred to the IHC then.\n\n“Justice Dogar, at number 15 in the Lahore High Court, was a long way off from serving on the administration committee under the Rules and Orders of the Lahore High Court. Similarly, Justice Soomro, appointed as an additional judge as recently as April 14, 2023, was at seniority number 26, in the Sindh High Court, Karachi, but was made a member of the administration committee in the IHC.\n\n“In short, immediately after their transfers, Justices Dogar and Soomro were handed control of the administration of the IHC.”\n\nEarlier in February, Justice Babar Sattar had also written to the IHC registrar. Citing news reports, he had noted that the rules determining the composition of administration committee had been amended. The same month, Justice Saman Rafat also sought information about the reported amendments.\n\nIt was emphasised that the power to amend or promulgate rules applicable to the high court vests with the high court, as defined in Article 202 of the Constitution.\n\n“Any amendment to the rules without the approval of the full court is unconstitutional and illegal.”\n\nDays later, the IHC registrar “asserted” that the IHC Practice and Procedure Rules had been approved by the administration committee and were at the publication stage.\n\nThis led to more letters by Justice Rafat, to the IHC registrar and all IHC judges. In her letters, she emphasised that under the Constitution, only a full court was empowered to adopt new rules or changes to the applicable rules.\n\n“Since no full court meeting has been convened for this purpose, any purported amendment adoption is illegal.”\n\nUpon receiving no response, she sought an update on the matter on April 24, but, in “complete disregard of the law, the Constitution and settled practice”, the IHC registrar circulated a letter stating that the Practice and Procedure Rules, 2025 had been published through a gazette notification dated February 18, and that the file had been placed before the CJ for approval.\n\n“The Practice and Procedure Rules were purportedly adopted, approved and published without any approval of the full court and even after publication in the gazette, the judges of the Islamabad High Court had to wait for chief justice’s approval to receive a copy.\n\n“For months, the petitioner judges’ efforts to seek information regarding the rules being adopted or amended was met with deafening silence,” the petitions read.\n\nThe Practice and Procedure Rules and the Islamabad High Court Establishment (Appointment and Conditions of Service) Rules, 2025 were placed before a full court months after their adoption, “when the chief justice of the Islamabad High Court felt assured that he had the majority for, after-the-fact, endorsement in [the] full court. Both sets of rules were then endorsed by a majority of six to five votes without any deliberation”.\n\nAt the time the copy of the Practice and Procedure Rules was circulated, it became apparent that the rules were purportedly notified on February 7 after approval by and under the instruction of the “illegally constituted” administration committee, comprising the then-chief justice, who was scheduled to be considered for elevation to the SC within 72 hours, and two transferred judges who had assumed charge of the IHC merely 72 hours before approving the rules.\n\n“The petitioner judges, nevertheless, welcomed the long overdue convening of the full court meeting by the chief justice and hoped that it may be an opportunity to raise and discuss the striking issues relating to dispensation of justice by the Islamabad High Court.\n\n“These attempts were stymied during the meeting.\n\n“The conduct of the chief justice and his approach to institutional consultation left the petitioner judges horrified, who also declared that even the minutes of the full court meeting would not be shared with the judges. Consequently, some of the petitioner judges were constrained to write dissenting notes to document their opinion regarding the approval of the Practice and Procedure Rules in particular, and the manner in which the meeting was conducted in general.”\n\nIt was in these circumstances that Justice Dogar assumed the role of the IHC CJ. In this position, he would later use his administrative powers to “render the petitioner judges dysfunctional [and] undermine the independence of judiciary and credibility of the Islamabad High Court,” the judges say.\n\nJustice Dogar, since assuming charge as the IHC CJ, “has consistently used administrative powers in violation of settled principles of comity of judges and judicial independence to render the petitioner judges, who challenged his transter and seniority, dysfunctional”.\n\n“The chief justice, in complete disregard of the settled law by the Supreme Court, has repeatedly used administrative powers to restrict some of the petitioner judges from exercising their judicial functions and powers, and to interfere with the discharge of their judicial functions.”\n\n“Under Chief Justice Dogar’s watch, the office has refused to issue cause lists in breach of judicial orders and has transferred part-heard matters from the docket of one court to another without such powers vesting in the chief justice.\n\n“Chief Justice Dogar has used his administrative power to reconstitute benches and transfer cases being adjudicated from the bench seized of them to another.”\n\n“Chief Justice Dogar continues to use his power to issue the roster of sitting judges to render senior judges dysfunctional. Chief Justice Dogar has constituted divisional benches headed by junior judges and has relieved senior judges of such responsibility, including the senior puisne judge, who is no longer part of any divisional bench.”\n\n“Justice Babar Sattar and Justice Sardar Ejaz can no longer preside over single benches, and the cases pending in their dockets, including part-heard cases, have been arrogated to other judges. The purported excuse used to achieve this purpose is a policy decision taken in a meeting of the National Judicial Policy Making Committee to create a Commercial Litigation Corridor within high courts.”\n\n“Chief Justice Dogar has used administrative powers in a manner that lacks transparency in fixation of cases and bench constitution. There are no objective criteria guiding the composition of benches. IHC cause lists manifest arbitrary marking of cases. As against the high court rules that vest the function of marking cases in the office of the deputy registrar, all cases are fixed under the instructions of the chief justice.”\n\nThe petitioner judges say they have repeatedly raised the issue of bench formation and fixation of cases “for years now”. However, despite repeated efforts, the issue has remained unaddressed and the CJ continues to exercise powers regarding bench formation and fixation of cases “unilaterally without any specified objective framework and criteria”.\n\n“While exercising administrative authority in an opaque manner that impacts which judges hear what cases, Chief Justice Dogar refuses to engage in a conversation regarding the need for an objective framework to evaluate the performance of judges. [The] Islamabad High Court instead engages in issuing skewed statistics regarding the discharge of judicial work.\n\n“These statistics are designed to cultivate an impression that some judges work efficiently, while others do not work at all. These statistics are issued without any regard to the nature (and number) of cases marked to the performing judges versus others, and the nature, quality and length of orders that make up the disposal figures.”\n\n“Chief Justice Dogar, has opted to assume powers to transform the chief justice’s office into a monocracy. He has appropriated the power backed by no law to issue a circular requiring judges to seek an NOC (no-obejction certificate) from the chief justice to travel out of the country. Neither the Constitution nor the law vests such rule-making power in the office of the chief justice to lord over his peers,” the petitions state.\n\n“While the right to seek earned leave remains an entitlement under the presidential order regulating the terms and conditions of service of judges, to hold that the leave cannot be sought except during summer or winter holidays is tantamount to suspending a statutory entitlement. And to require judges to seek an NOC for travel abroad even during holidays or while a judge is on leave is plain absurd apart from being unconstitutional.”\n\n“A circular has also been issued barring individual court’s from uploading final judgements on the website of the IHC as a “means of controlling public access to judgements”.\n\n“Chief Justice Dogar has transformed the office of chief justice into an autocracy, in an effort to reduce the judiciary to a regiment. Such actions undermine judicial independence,” which is essential for the discharge of adjudicatory duties.\n\nRegarding the subordinate judiciary, the petitioner judges have raised the issue of failure to exercise effective supervision and control over lower courts.\n\n“The Islamabad district judiciary, staffed largely by deputationists, resembles the game of musical chairs, with judges on deputation enjoying no security of tenure. Chief Justice Dogar has taken affirmative steps to ensure that the Islamabad district judiciary remains a rag-tag ensemble, the members of which can be shunted back to their parent departments if they fall out of line.”\n\nThen, the exercise of administrative powers by Chief Justice Dogar is also marred by conflict of interest, the judges believe.\n\nAs the competent authority under the Protection against Harassment at Workplace Act, 2010, Justice Saman Rafat recently constituted an inquiry committee after receiving complaint by a female lawyer against Justice Dogar.\n\n“Acting in his own cause, the very same day, Chief Justice Dogar recalled the notification appointing Justice Rafat as the competent authority to administer the Protection against Harassment at Workplace Act, 2010, and appointed an additional judge replacing her as the competent authority.”\n\nMoreover, CJ Dogar has “initiated an unfortunate practice of using judicial powers that undermine the independence of the judiciary. In several cases, judicial powers have been exercised not only to transfer pending cases from one judge to another, but also an unprecedented practice of issuing writ of certiorari (i.e. suspending proceedings before the judges of the same court) has also started.”\n\nThis is happening when it is settled law that judges cannot issue writs in pending matters to the same court, the judges say.\n\nBut, “in Chief Justice Dogar’s time, we are witnessing this practice as a tool, to restrain the petitioner judges from proceeding to hear matters that are fixed for hearing before the court.”\n\nFor instance, recently, a division bench comprising CJ Dogar and Justice Azam Khan restrained Justice Tariq Mahmood Jahangiri from carrying out judicial work.\n\nIn this case, the exercise of judicial powers in “breach of principles of fair trial and due process” is a “potent example of self-cannibalisation by an institution!”\n\nIt is the “latest manifestation of the retribution that some of the petitioner judges have been threatened with, for exercise of judicial authority in a manner in select cases that powerful members of the executive found disagreeable.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:28:08.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943203/events-that-led-to-the-demolition-of-islamabad-high-court-in-the-words-of-its-own-judges",
  "dateList": "2025-09-21",
  "date_published": "2025-09-19T14:52:38.000Z"
}
