{
  "title": "Equities hit all-time high despite economic concerns amid floods - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) has marked a significant milestone, closing at an all-time high of 158,037 points, reflecting a week-on-week gain of 2.3 per cent.\n\nThis performance, achieved largely through institutional buying, signals strong investor confidence. Despite a challenging economic backdrop, including the ongoing floods and a decline in foreign direct investment (FDI), liquidity continues to support the market’s upward trajectory.\n\nSeveral developments contributed to the positive sentiment during the week. The current account deficit (CAD) for August narrowed to $245m, down from $379m in July, indicating a modest improvement in the external account. However, FDI dropped significantly, falling 30pc month-on-month and 45pc year-on-year, totalling $114m. On a more positive note, Large-Scale Manufacturing Index (LSMI) showed an 8.99pc year-on-year increase in output for July, with a month-on-month rise of 2.6pc.\n\nMarket participation surged, with the average daily traded volume reaching 1.54bn shares and a total traded value of Rs50bn. Notably, the market also recorded its highest-ever daily traded value of Rs87.4bn during the week. The rise in investor activity reflects optimism, driven in part by the Saudi-Pakistan defence pact, which has helped boost sentiment.\n\nKSE-100 index rose 2.3pc week-on-week, closing at 158,037 points\n\nOn the monetary front, the State Bank of Pakistan (SBP) opted to keep the policy rate unchanged at 11pc, citing a cautious stance in light of the ongoing floods, which have severely impacted the agricultural and industrial sectors. The situation has added uncertainty to the economic outlook, with supply chain disruptions, inflationary pressures, and potential declines in agricultural output creating additional hurdles. The floods, which have affected large swathes of the country, could undermine economic recovery, particularly in the short term.\n\nOther economic indicators showed mixed results. Power generation in August increased by 8pc year-on-year to 14,218 GWh, with the cost of generation falling by 18pc year-on-year, providing some relief to the energy sector. Technology exports also performed well, rising by 13pc year-on-year to $337m, although they fell by 5pc month-on-month. On the currency front, the rupee appreciated slightly by 0.03pc against the US dollar, closing at Rs281.46.\n\nThe SBP’s foreign reserves increased by $20.9m week-on-week, reaching $14.4bn. Despite this, inflationary pressures and external vulnerabilities continue to pose risks. Analysts are also closely monitoring the upcoming IMF review talks, which could influence market sentiment in the weeks ahead.\n\nIn terms of valuations, the KSE-100 index is currently trading at a forward price-to-earnings (PER) ratio of 7.8x for 2026, below its 15-year average of 8.59x. This suggests that the market remains relatively attractive from a valuation perspective, particularly given the dividend yield of approximately 5.8pc, which is near its historical average of 6.13pc.\n\nLooking forward, analysts remain cautiously optimistic about the PSX’s performance. While the market’s momentum could continue in the near term, much will depend on the outcome of the IMF talks, developments in the energy sector, and the broader impact of the floods on the economy.\n\nIn conclusion, the KSE-100 index’s record high is a testament to investor confidence, but the economic environment remains fragile. Floods, inflation, and geopolitical factors will continue to be key challenges as the market navigates through these turbulent times.\n\nPublished in Dawn, September 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-21T11:27:42.337Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943568/equities-hit-all-time-high-despite-economic-concerns-amid-floods",
  "dateList": "2025-09-21",
  "date_published": "2025-09-21T00:38:20.000Z"
}
