{
  "title": "US ambassador calls on Air Chief",
  "link": "https://www.app.com.pk/national/us-ambassador-calls-on-air-chief/",
  "date_published": "2024-01-16T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP): US Ambassador to Pakistan Donald Blome called on Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Baber Sidhu on Tuesday.\nDuring the meeting, the two dignitaries expressed their mutual desire to elevate the training momentum between the two sides through enhanced collaboration in air force to air force mutual exercises, a Pakistan Air Force (PAF) news release said.\nThey also emphasized the importance of fostering a robust exchange of delegations and knowledge sharing to bolster the capabilities of both the PAF and the US Air Force.\nThe discussion also centered around collaboration in the recently established techno parks, with a focus on leveraging technological advancements for enhancing operational effectiveness and efficiency.\nThe reorganization of mutual cooperation parameters was also deliberated upon, with an aim to fortify existing ties and explore new avenues for joint ventures and strategic partnerships.\nThe Air Chief accentuated the cordial relations that exist between the two nations while emphasizing his steadfast determination to elevate the existing synergistic partnership between the two key allies.\nHe said,”Pakistan deeply values its robust diplomatic, economic and defence ties with the United States of America which are firmly rooted in mutual consensus concerning all important matters pertaining to regional peace, security and stability.”\nThe US envoy lauded the commendable level of professionalism of Pakistan Air Force personnel and acknowledged the remarkable strides made by PAF through indigenization under the current leadership.\nHe also expressed his admiration for Pakistan’s unwavering commitment to facilitate regional peace and stability.\nBoth sides concurred to further optimize the existing military-to-military relationship between the two countries with specific focus on enriching training and bolstering operational competencies.\n“The meeting between the US ambassador and Chief of the Air Staff manifests the deep interest and willingness on both sides to further consolidate the longstanding bilateral strategic ties into concrete and mutually rewarding defence partnership,” the news release said.",
  "retrievedAt": "2025-08-10T23:38:54.701Z"
}
