{
  "title": "FM Jilani to attend NAM, Third South summits in Uganda from Jan 17",
  "link": "https://www.app.com.pk/national/fm-jilani-to-attend-nam-third-south-summits-in-uganda-from-jan-17/",
  "date_published": "2024-01-16T07:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Foreign Minister Jalil Abbas Jilani is scheduled to visit Kampala, Uganda from January 16 to 22 to participate in the 19th Summit of the Heads of State and Government of the Non-Aligned Movement (NAM) and the Third South Summit.\nThe NAM Summit is being held from January 17-20, 2024 and the Third South Summit from January 21-22, a Foreign Office press release said.\nThe two summits afford an opportunity for the members to reflect on and amplify common positions on a range of global, regional, political, and socioeconomic issues.\nAs a longtime member, Pakistan has contributed to and shaped the agenda of NAM and is strongly committed to further strengthening NAM’s role in responding to regional and global challenges relating to questions of peace and security.\nSimilarly, Pakistan has remained an active member of the Group of 77 & China and attaches high priority to cooperation among the Global South, including in sustainable development, poverty eradication and climate change, the FO statement added.\nAt the NAM Summit, Foreign Minister Jilani will share Pakistan’s perspective on endemic and contemporary global challenges related to international peace, security and development.\nHe will underline the need for strengthening multilateralism and reinvigorating the NAM’s role in promoting the purposes and principles of the UN Charter.\nAt the South Summit, the foreign minister will present Pakistan’s vision on enhanced cooperation and solidarity among countries of the Global South to respond to common challenges and agree on an agenda for a prosperous and united South.\nOn the sidelines of the two summits, the foreign minister is also expected to hold bilateral meetings with the heads of delegation of other participating countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:39:25.414Z"
}
