{
  "title": "President for sharing scientific knowledge to benefit entire humanity",
  "link": "https://www.app.com.pk/national/president-for-scientific-based-knowledge-sharing-tendency-to-benefit-entire-humanity/",
  "date_published": "2024-01-16T08:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Jan 16 (APP): President Dr Arif Alvi on Tuesday while alluding to the significance of the technological advancement and innovations in diverse fields and the availability of knowledge, stressed the need to share the latest scientific breakthroughs, experiences and achievements for the greater benefits of entire humanity.\nThe president said that the availability of knowledge should not be contained under the mere tag of ‘copyrights’ as greater accessibility could help humanity to move through the current economic, social and global challenges.\nThe president was speaking as a chief guest at a ceremony to mark the 29th-anniversary celebration of the Commission on Science and Technology for Sustainable Development in the South (COMSATS) at the Aiwan e Sadr.\nThe event was attended by members of the diplomatic corps, former diplomats, members of academia and the media.\nThe president said that scientific knowledge should be shared among the nations without any hindrance by resetting the priorities which were focused somewhat elsewhere.\n“Open knowledge resources should be utilized and the world should work for the mutual transfer of knowledge. The injustices should be addressed,” he emphasised.\nThe president further said that transformation in the world could take place in the presence of ‘ethics or humanity-based order’, adding the new world would be dependent upon these shifts. While the rules-based world order was dominated by material-driven priorities, he opined.\nHe regretted that contrary to the requirements of the world, the prevalent tendency was towards the ultra-rich who had been becoming richer while the poor of the world were mired in poverty and deprivation.\nHe stressed that just and equitable distribution of wealth in the world could alleviate the sufferings of humanity.\n“The world is not ready to change the exploitative attitude and end exploitation,” he said and referred to a recent report of OXFAM which said that billionaires had doubled their income while about 5 billion people in the world witnessed shrinkage in their earnings.\nPresident Alvi said that genome sequencing was one of the major breakthroughs in the scientific world which had become more accessible to people due to the exponential pace of scientific developments.\nThe world is heading towards exponential development as the technology will no longer remain static,” he added.\nIn future, he said, quantum computing could handle the data of billions of humans with regard to their health, besides opening up ‘tremendous possibilities in the agriculture sector’.\nThe president cited the agri-advancement of the Netherlands, which though a smaller country, became the second largest exporter of agri-products in the world, adding the country had tapped the water resources by conservation methods and promoting plant science.\nHe said Pakistan could also become one of the world’s leading nutrition-supplying countries by working on modern scientific lines. Citing costly power production, he said the advancement in solar technology could address the issue.\nThe president also expressed his satisfaction that the world including Pakistan had raised awareness about carbon emissions which still required wider cooperation among the nations.\nThe president also lauded the contributions of the COMSATS in the realms of science and technology among its 27 members.\nThe president also cut a cake along with the envoys of member states of COMSATS to celebrate the occasion.\nExecutive Director COMSATS Dr Nafees Zakaria, in his speech, said that in today’s rapidly evolving world, science and technology stood as the bedrock of progress and the key to unlocking solutions for pressing global challenges.\nHe also highlighted a series of new initiatives by COMSATS pertaining to information technology and its applications, artificial intelligence, genomic sequencing, renewable energy, electric vehicles, precision agriculture, industrial biotechnology and climate change.\nProf. Dr. Lin Zhaohui, Director, the International Center for Climate and Environment Sciences (ICCES), China, on the occasion, said the milestone in the journey of COMSATS needed to be cherished for the organization’s continued commitment to promoting South-South and triangular Cooperation in the realm of science, technology and innovation.\nHe also highlighted the issue of climate change as one of the imminent threats to the planet and appreciated COMSATS for being at the forefront of promoting sustainable solutions and environmental stewardship.\nCOMSATS an intergovernmental organization of 27 member states, has its Secretariat hosted by the Government of Pakistan, in Islamabad since 1994. Nobel Laureate and world-renowned scientist Prof. Abdus Salam was the brain behind COMSATS’ creation.",
  "retrievedAt": "2025-08-10T23:39:07.820Z"
}
