{
  "title": "Blockade of waterways due to illegal construction in hill torrent prone areas inflicting heavy losses: Dr Suleri",
  "link": "https://www.app.com.pk/national/blockade-of-waterways-due-to-illegal-construction-in-hill-torrent-prone-areas-inflicting-heavy-losses-dr-suleri/",
  "date_published": "2024-01-16T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Executive Director of Sustainable Development Policy Institute (SDPI), Dr Abid Qaiyum Suleri on Tuesday said that the blockade of waterways due to illegal construction after flooding in hill torrent prone areas was inflicting heavy losses to infrastructure, livelihoods and human lives.\nHe was speaking at a one-day roundtable titled: “Climate Resilient Water Governance Approaches for Hill Torrent Management in Pakistan”, organized by Sustainable Development Policy Institute (SDPI) in collaboration with Pakistan Rural Support Programmes Network (RSPN), and DAI.\nThe roundtable aimed to stir result-oriented dialogue among the public, private sector, and civil society stakeholders to mull over hill torrents’ floodwater governance issue. It incorporated community perspectives from representatives, who joined from hill torrent affected areas from D.I. Khan, Rajanpur, Swat apart from Sindh and Balochistan.\nDr Suleri said that population explosion, deforestation, and urbanisation are the major causes of fading away of water management systems and infrastructure. The temperature systems of La Nina and El Nino effects and weather change had already increased precipitation to an erratic level, he added.\n“SDPI’s climate change and water management teams are closely working on these areas, and it’s impacts that were above normal on girls, women, children and others,” he said.\nMr Ahmed Kamal, Chairman of Federal Flood Commission (FFC), said Pakistan has been facing the worst flooding due to reverse monsoon activity as monsoon used to start from Tarbella, but in 2022 the low pressure was built up in Sindh province that caused abnormal rains in Sindh and Balochistan.\nThe sporadic flooding in September 2022 in Swat and Kabul river also caused flooding in the areas, he said, adding that in Koh-e-Suleiman Range, Rajanpur and Dera Ghazi Khan areas hosted 11 hill torrents that caused havoc.\nHe noted that the total water storage capacity of the country was 3.43 million acres feet that comprised three dams, i.e. Tarbela, Chashma, and Mangla. He underlined that the country’s priority was low towards mitigating natural disasters that needs to be addressed.\nIn 2022, he said monsoon season not only prompted the public sector but also the civil society, community and private sector at large to better manage the hill torrents water.\n“More than 6,000 bridges have been established in the hill torrents’ prone areas. However, it was ill planned, and poorly implemented as the water flow overtopped the capacity of built structures,” he said and stressed the need to establish public, private sector and community nexus in this regard.\nDarren Saywell, Senior Lead Specialist, Water Security, Sanitation and Hygiene (WSSH) at DAI Global, said the context\nof the discussion was important as it was based on the improvement in water management, climate resilience, and Green Pakistan movement that is crucial for the country’s climate resilience.\n“Today’s roundtable will help align our assets to manage the water issues and learn best practices from the partners and community stakeholders. There is a tremendous experience in Pakistan on the issues of water and disaster management,” he added.\nSaywell said the DAI globally would add the international experience applicable to the public-private and civil society organisations (CSOs) level interventions.\nHe said that the Pakistan case study based on its experiences is important particularly in water governance. However, nothing changes unless there are incentives to adopt that change and therefore the incentives for hill torrents management needs to be identified.\nBilal Anwar, Chief Executive Officer, National Disaster Risk Management Fund (NDRMF), said the 2022 floods were a mammoth disaster and the entire efforts of the Fund in reconstruction were focussed on riverine floods and hill torrents management.\nPakistan, he said, largely faced the riverine floods due to unique river systems and Indus Basin topography.  The 2022 floods were an awakening call for the country whereas the risk modelling and assessment was focussed on riverine floods, he said.  Around 1,204 water conservation sites existed in the flood-hit areas, if preserved, could have become a huge source of water for the country and help manage the water crisis.\n“The large bulk of work was not done on those sites that resulted in 2022 floods devastation,” he said. Mr Anwer said inclusion of hill torrents in our national catastrophic policy discourse was critical, therefore, the NDRMF would roll out that model soon that will guide the endeavours of policymakers.\n“The value of working in collaboration and with institutions is important and essential feature of climate adaptation. The whole climate adaptation work is linked to riverine water management in Pakistan,” he added.\nMs Zainab Naeem, SDPI’s Associate Research Fellow, highlighted the existing areas being affected by hill torrents in Pakistan and the causes of flooding along the hill torrents.\nCEO, Pakistan RSPN, Shandana Humayun said there was a work going on ground in the realm of flood resilience and disaster management but it required collaboration and partnerships to galvanize its impact and benefits for the local communities.\n“It is very critical to bring that work at the community level through collaborations as partnerships are needed along with such forums where communities can sit with the government in the issues,” she added.\nArsalan Ali Faheem, the Country Director, DAI Pakistan, stated that the existing water governance structure is under resourced and was never setup to face challenges of large-scale devastation due to floods.\n“We need to gather realistic outputs and develop proposals which could support community led approaches for managing such challenges and also incorporate incentive based approaches for making inclusive and efficient decisions.”\nHe also stressed the  need to develop a framework inclusive of four elements. i.e. community structure, financial resources, technical know-how, and decision-making power.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:39:33.100Z"
}
