{
  "title": "Dr. Saif discusses digital collaboration with international organizations, global leaders",
  "link": "https://www.app.com.pk/national/dr-saif-discusses-digital-collaboration-with-international-organizations-global-leaders/",
  "date_published": "2024-01-16T08:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP): Caretaker Federal Minister of Information Technology and Telecommunication, Dr Umar Saif, discussed digital collaboration aimed to enhance Pakistan’s global image through the “Digital Pakistan” initiative during sideline meetings with international organizations and global leaders.\nThe minister is currently participating in the World Economic Forum held in Davos, Switzerland, from January 15 to 19, according to a news release.\nAccompanying the minister is a delegation, including the Chairman of the Pakistan Software Houses Association (P@SHA) Zohaib Khan and representatives from the Special Investment Facilitation Center (SIFC).\nThe IT delegation’s focus is to showcase the progress made by SIFC, including the 50% dollar retention policy for IT companies, the activation of the Special Technology Zones Authority (STZA) through the appointment of its board of governors, and the introduction of Pakistan’s First Space Policy, opening up new opportunities in the country’s space sector.\nThe delegation primarily engages in bilateral meetings with representatives from various countries on the sidelines of the World Economic Forum. Global leaders, including Pakistan’s Caretaker Prime Minister Anwaar-ul-Haq Kakar and other prominent figures, are expected to attend the event.\nDuring these meetings, Dr Umar Saif highlighted efforts to introduce the “Digital Pakistan” brand at an international level and expressed the desire to foster collaboration between Pakistan and various international entities.\nIn a meeting with the Secretary-General of the Digital Cooperation Organization, Deemah Al Yahya, discussions centred on digital cooperation, emphasizing the potential benefits of such collaborations.\nBilateral talks with Qatar’s IT Minister, Mohammed bin Ali bin Mohammed Al Mannai, and Rwanda’s Minister of Communication, Paula Ingabire, explored opportunities for mutual cooperation.\nA significant development is the expected collaboration between Pakistan’s Startups Fund and counterparts in various countries, focusing on joint initiatives in cloud services.\nDr Umar Saif’s visit included a tour of Google’s headquarters, where discussions with Vice President Behshad Behzadi delved into conversations about Generation AI technology. The minister said that he visited the Google House at Davos to explore the latest advancements in Google Generative AI technology.\nA mutual agreement on the dual use of artificial intelligence at both government and private levels in Pakistan was established, aiming for better utilization of AI resources.\nDr Umar Saif mentioned that collaborative projects between Pakistan’s Ministry of IT and Google are already underway, with a commitment to enhancing cooperation in information and communication technology.\nEmphasizing collaboration between the Digital Cooperation Organization (DCO) countries and Google, Dr Umar Saif expressed readiness to explore every possible avenue for cooperation in information and communication technology.\nDuring meetings with global organizations, he highlighted Pakistan’s trajectory towards becoming a ‘Digital Hub’ in the near future.\nThe global recognition of Pakistani talent in freelancing, skill development, and e-commerce was acknowledged during these interactions, showcasing the growing influence of Pakistan in the digital arena.",
  "retrievedAt": "2025-08-10T23:39:06.832Z"
}
