{
  "title": "Ahmed Faraz never compromised on principles: Shibli",
  "link": "https://www.app.com.pk/national/ahmed-faraz-never-compromised-on-principles-shibli/",
  "date_published": "2020-08-25T07:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Tuesday that famous Urdu poet Ahmed Faraz was a courageous person who never compromised on his principles and ideology.\nTalking to media after offering fateha at the graveyard of the great poet on the occasion of his 12th death anniversary, he said that he (Ahmed Faraz) had dedicated his life for a cause and never deviated from that cause.\nShibli said that the love and affection that his father Ahmed Faraz received from the people of Pakistan was unprecedented.\nHe said that the constituency of the late legendary poet was humanity, love and peace and he raised his voice against oppression in all parts of the world be it Kashmir, Palestinian or any African country.\nHe had universal approach but focus of his thoughts was Pakistan.\nThe minister said that poetry of great poets had many layers of meanings and we should try to understand the hidden message of those writers. He has always taken guidance from the poetry of his father, he added.\nHe said that he was thankful to the people of Pakistan who also gave him love and affection due to his father Ahmed Faraz.\nWhile paying tribute to Ahmed Faraz, Chairman of the Pakistan Academy of Letters Dr. Yousuf Khushk said that late Ahmed Faraz was ambassador of entire Pakistan’s literary circle. He said Ahmed Faraz was founder of the Pakistan Academy of Letter.\nEarlier, the minister laid wreath at the grave of late poet Ahmed Faraz and offered Fateha.\nLater speaking at a ceremony at Academy of Letters to pay homage to late Ahmed Faraz, he said that on the occasion of the birth and death anniversaries of literary figures, their contribution should be discussed and highlighted .\nHe said that writings of poets and other literary figures are a reflection of the times in which they live.\nTheir writings not only highlight the problems and issues of their times but also provide solution to them, Shibli said.\nHe said that unfortunately the society had been degenerated and ethics and values had lost their importance and wealth had become the criterion of respect.\nHe said he had emotional attachment with Academy of Letters because its founder was his father and expressed the hope that it would expand its canvass.\nHe said that Ahmed Faraz was a unique literary personality who had a strong bond with the common man and whose message was love and sincerity.",
  "retrievedAt": "2025-08-11T19:42:49.171Z"
}
