{
  "title": "Different cases registered against opposition leadership: Shibli Faraz",
  "link": "https://www.app.com.pk/national/different-cases-registered-against-opposition-leadership-shibli-faraz/",
  "date_published": "2020-08-25T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Federal Minister for Information and Broadcasting Senator Shibli Faraz said on Tuesday different cases had been registered against the leadership of the opposition parties and their leaders were trying to protect them from accountability.\nTalking to a private news channel, he said the opposition had demanded National Reconciliation Ordinance (NRO) indirectly by giving their points for amendment in the National Accountability Bureau (NAB) laws.\nThe minister said opposition had tried to blackmail the government regarding legislation of Financial Action Task Force (FATF), adding the opposition was not supporting the government for the purpose.\nShibli Faraz said FATF legislation was in favour of the country but not the government.\nHe said the Pakistan Tehreek-e-Insaf (PTI) leadership was honest as he (Imran Khan) was declared Sadiq and Amin by  the court but the Pakistan Muslim League Nawaz (PML-N) leadership was declared accused by the court.\nThe minister said PML-N could not face the truth because its leadership had looted the country and did massive money laundering during its last tenure.\nHe said PML-N had failed to present proof for the Evan Field flats in London and it had also failed to provide details that how  its leadership had increased their assets.\nReplying to a question, he said the government would adopt legal action to bring Nawaz Sharif back to the country, adding he went abroad for medical treatment but he did not get admitted in any hospital rather enjoying his life in London.\nShibli Faraz said opposition leader Shehbaz Sharif had given guarantee for Nawaz Sharif’s return and he should fulfill it adding Nawaz Sharif should return and face other cases which were registered against him.",
  "retrievedAt": "2025-08-11T19:42:50.023Z"
}
