{
  "title": "Glowing tributes paid to revolutionary Urdu poet ‘Ahmed Faraz’",
  "link": "https://www.app.com.pk/national/glowing-tributes-paid-to-revolutionary-urdu-poet-ahmed-faraz/",
  "date_published": "2020-08-25T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP):Rich tributes were paid to revolutionary modern Urdu poet ‘Ahmad Faraz’ for his unforgettable services on his 12th death anniversary on Tuesday (today).\nAhmed Faraz is ranked among the greatest Urdu poets of the current era.\nBorn on January 12, 1931 in Kohat, Ahmad Faraz was among those distinguished poets whose literal sense and multifaceted poetry became widely popular sometimes for romantic adolescent and other times for hailing revolution.\nHe held a Masters degree in multiple languages, including Urdu, Persian, and English Literature.\nHe belonged to the Sufi family of Haji Bahadur. Born as Syed Ahmed Shah, he rose to fame as Ahmed Faraz (pen name).\nHis first poetry collection Tanha Tanha was published in the 1960s when he was pursuing his Bachelor’s at Peshawar University.\nLike many other Urdu poets, Faraz was also inspired by Mirza Ghalib, Faiz Ahmed Faiz and Ali Sardar Jaffri for their progressive sentiments and traits.\nHe began his career as a script writer for Radio Pakistan and later became an Urdu teacher at Peshawar University.\nHaving versatile personality, he became active in politics too during General Zia-ul-Haq’s dictatorial tenure after raising his concerns for democracy.\nFaraz was exiled for six years for his liberal thoughts during that period, spending time in London, Canada and other European states.\nAhmed Faraz was conferred with numerous awards, including the Adam Jee Literary Award, Sitara-e-Imtiaz and Hilal-e-Imtiaz by the government of Pakistan in recognition of his literary contributions to the Urdu language.\nFrom 1950 to 2008, Ahmed Faraz received many accolades and praises internationally and locally.\nHe received six foreign awards for his literary contribution. Many famous singers of the Sub-Continent have crooned Faraz’s poetry including legendary vocalist Lata Mangeshkar.\nHe breathed his last on August 25, 2008 in Islamabad.\nHe left the world over 11 years ago yet remained alive through his poetry in the Urdu literary work. Faraz’s poetry instilled the spirit and verve of struggle, determination, and of course romance.",
  "retrievedAt": "2025-08-11T19:42:49.921Z"
}
