{
  "title": "ECP sets April 15th deadline for postal ballot applications for NA bye-polls",
  "link": "https://www.app.com.pk/national/ecp-sets-april-15th-deadline-for-postal-ballot-applications-for-na-bye-polls/",
  "date_published": "2023-03-30T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): The Election Commission of Pakistan (ECP) announced on Thursday that the last date for receipt of applications regarding postal ballot papers for the upcoming Bye-Elections in six constituencies of the National Assembly would be April 15th.\nUnder the law, the postal ballot facility has been extended to certain categories of voters, including persons in government service, members of the armed forces and their families who are registered voters and reside with them, but are stationed at a location other than their constituency.\nAdditionally, persons with physical disabilities who are unable to travel and hold a National Identity Card with a logo for physical disability issued by the National Database and Registration Authority (NADRA), as well as those who are detained in prison or in custody, are entitled to vote by postal ballot.\nThe announcement of the deadline for postal ballot applications is expected to provide an opportunity for eligible voters who meet the criteria to exercise their right to vote.The bye-elections are being held in the constituencies that include NA 22 Mardan-III; NA 24 Charsadda-II; NA 31 Peshawar-V;NA 108 Faisalabad-VIII; NA 118 Nankana Sahib-II and NA 239 Korangi, Karachi-I.\nPersons who are appointed by Returning Officers, including police personnel to perform any duty in connection with an election at a polling station other than the one at which they are entitled to cast their vote are required to apply for a postal ballot to the Returning Officer within three days of their appointment.\nTo apply for a postal ballot, individuals should use the prescribed form and submit it to the Returning Officer of the constituency. The application should be forwarded or endorsed by the office or department of the voter concerned to guard against unauthorized individuals applying for a postal ballot.",
  "retrievedAt": "2025-08-11T08:10:01.087Z"
}
