{
  "title": "More rains expected from April 01-04",
  "link": "https://www.app.com.pk/national/more-rains-expected-from-april-01-04/",
  "date_published": "2023-03-30T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):More rain-wind/thunderstorm with occasional gaps are expected from 1st April to 04 April, 2023 in various parts of the country.\nAccording to Met Office, another westerly wave is expected to enter the western & upper parts of the country on 01st April & likely to persist over Khyber Pakhtunkhwa, upper Punjab, Islamabad, Kashmir & Gilgit Baltistan till 04th April.\nMeanwhile, Met office informed that the ongoing westerly wave to persist upper parts of the country till March 31 (Friday) .\nUnder the influence of this weather system: Rain-wind/thunderstorm with isolated heavy falls and hailstorm is expected in Nokkundi, Dalbandin, Quetta, Zhob, Barkhan, Harnai, Qila Saifullah, Qillah Abdullah, Chaman, Pishin, Sibbi, Loralai, Kalat, Khuzdar, Lasbella, Panjgur, Awaran, Ketch till 31st March, 2023 while in Dera Ghazi Khan, Rajanpur, Bhakkar, Layyah, Multan, Sahiwal, Okara, Pakpattan, Khanewal, Bahawalnagar, Bahawalpur, Rahim Yar khan, Sukkur, Larkana, Jacobabad, Shaheed Benazirabad, Mirpurkhas, Hyderabad, & Karachi on March 30 (Thursday).\nRain-wind/thunderstorm (snowfall over the high mountains) with few moderate to isolated heavy falls with hailstorm is expected in Kashmir (Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur), Gilgit-Baltistan (Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar), Peshawar, Charsadda, Nowshera, Swabi, Bajaur, Kurram, Waziristan, Kohat, Karak, Bannu, Dera Ismail Khan, Chitral, Dir, Swat, Mansehra, Buner, Kohistan, Shangla, Haripur and Abbottabad, Islamabad, Murree, Galliyat, Rawalpindi, Attock, Chakwal, Jhelum, Khushab, Mianwali, Sargodha, Gujranwala, Gujrat, Hafizabad, Mandi Bahauddin, Sialkot, Narowal, Lahore, Faisalabad, Toba Tek Singh, Jhang, Kasur, Sheikhupura and Nankana Sahib till 31st March with occasional gaps.\nAccording to the details of possible impacts, strong wind & hailstorm may cause damage to loose infrastructure and standing crops (particularly wheat crop) in the country.\nFarmers should irrigate the crops keeping in view the PMD forecast.\nIt has also been informed that heavy rains may cause Flash Floods in Quetta, Chaman, Pishin, Barkhan, Musakhel, Jaffarabad, Kohlu, Zhob, Loralai & Hill torrents of D.G Khan, while in Dir, Swat, Kohistan, Nowshera, Mardan, Waziristan, Bajur, Islamabad/Rawalpindi and Kashmir and Urban flooding in Peshawar, Islamabad/Rawalpindi & Lahore from during ongoing rain spells.\nLandslides may occur in hilly areas of Khyber Pakhtunkhwa, Gilgit-Baltistan, Kashmir, Murree and Galliyat during the forecast period.\nDay temperatures are likely to fall significantly during the spell.Tourists are advised to remain more cautious during the forecast period.\nMet Office has asked all concerned authorities to remain “ALERT” to avoid any untoward situation during the forecast period.",
  "retrievedAt": "2025-08-11T08:09:57.828Z"
}
