{
  "title": "Dar proposes automated system to update population data in Pakistan",
  "link": "https://www.app.com.pk/national/dar-proposes-automated-system-to-update-population-data-in-pakistan/",
  "date_published": "2023-03-30T07:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Minister for Finance and Revenue Senator Mohammad Ishaq Dar on Thursday proposed replacing traditional census practices with a more cost-effective and efficient automated system that updates information using the National Database and Registration Authority (NADRA) and other modern technologies.\nDuring the Senate question hour, Dar responded to a question from Senator Bahramand Khan Tangi and emphasized the potential of technology to transform traditional practices and streamline the process of enrolling the population. The new approach would eliminate the need for expensive census expenditures.\nDar said the government spent billions of rupees on the 2017 census, but Sindh, Balochistan, and partially South Punjab raised objections over its accuracy. Eventually, the constitution was amended to allow the holding of the 2018 general elections based on the last census.\nRegarding the holding of separate general elections in Punjab and Khyber Pakhtunkhwa, Dar objected, stating that according to the 18th amendment, elections in the country should be held simultaneously. In October, there will be two sitting governments, and the question is whether they will be dissolved or if a caretaker government will be appointed to ensure impartiality. However, the constitution does not allow for this.\nMinister for Finance and Revenue Senator Mohammad Ishaq Dar stated that the Pakistan Bureau of Statistics (PBS) is making every effort to conduct the 7th Population & Housing Census digitally, in accordance with the decision of the Council of Common Interests (CCI) in its 45th meeting held on April 12, 2021.\nThe CCI directed that “the process of the next census should start as early as possible according to international best practices by using the latest technology.”\nTo ensure effective monitoring, coordination, and policy decisions, the CCI constituted the Census Monitoring Committee (CMC), comprising all stakeholders.\nIn its 5th meeting held on January 17, 2023, the CMC recommended initiating the Census Field Enumeration/Operation for the 7th Population & Housing Census from March 1, 2023, to April 1, 2023.\nThe census results will be finalized on April 30, 2023, and provided to the Election Commission of Pakistan after approval by the CCI.",
  "retrievedAt": "2025-08-11T08:10:16.428Z"
}
