{
  "title": "Govt sets target to enhance foreign reserves to $ 13 bln by June: Senate told",
  "link": "https://www.app.com.pk/national/govt-sets-target-to-enhance-foreign-reserves-to-13-bln-by-june-senate-told/",
  "date_published": "2023-03-30T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Minister for Finance and Revenue Muhammad Ishaq Dar on Thursday informed the Senate that the country’s reserves would jump to $ 10 billion by Friday adding that target has been set to enhance it to $ 13 billion by June.\nReplying to various supplementary questions during the Question Hour, the minister said that Pakistan would not default and arrange all financial liabilities. Not a single international obligation was deferred in last 11 months and actual external debt had also decreased, he said.\nHe said Pakistan Muslim League (PML-N) government inherited $ 4.6 billion foreign reserves when came into power in 2013.\nThe then PML-N government not only fetch the country out of financial crisis but also put it on road of progress and prosperity with 6 per cent gross domestic product (GDP) growth, he added.He said Pakistan’s economy was included among top 24 growing economy in the world and 5th best economy in Asia during the said period.He went on to say that he was punished merely for bringing fiscal discipline in the country. He had been already advocating since 2013 for charter of economy, he added.\nHe conceded that inflation was high in the country but it was due to flaws policies of the past government.\nRegarding State Bank of Pakistan (SBP), the minister said various amendments were made in the past in this regard. Now, the SBP was totally independent and fixed Monetary Policy accordingly, he added.\nThe minister said that the State Bank of Pakistan (SBP’s) Monetary Policy Committee (MPC) has raised the policy interest rate by 1,000 basis points, from 7 per cent to 17 per cent, since September 2021.\nThis makes Pakistan among the emerging markets with the strongest monetary policy response to inflation and external account stress, he said.\nThe interest rate increases are complemented by other measures taken by the SBP to restrict demand-side pressures.\nThey include administrative restrictions on imports; revisions in prudential regulations for auto and consumer financing; linking of mark-up rate on the SBP’s refinance schemes (EFS and LTFF) with the policy rate; and increase in the cash reserve requirement (CRR) for banks to 6 per cent from 5 per cent.\nHe said all these were aimed at moderating the demand-side pressures on inflation and the external account.",
  "retrievedAt": "2025-08-11T08:10:11.078Z"
}
