{
  "title": "DPM Dar unveils Pakistan’s diplomatic reset amid bold global engagement, strong economic diplomacy",
  "author": null,
  "content": "ISLAMABAD, Aug 29 (APP):Deputy Prime Minister and Foreign Minister (DPM/FM), Senator Mohammad Ishaq Dar on Friday unveiled Pakistan’s diplomatic rest what he called “one of the most active phases in Pakistan’s recent diplomatic history.”\nAddressing a media briefing here at the Foreign Office, the DPM provided details of his series of high-stakes visits, policy discussions, and multilateral engagements over July and August, and articulated a clear vision of Pakistan’s foreign policy priorities, rooted in regional peace, global connectivity, trade revival, and principled international advocacy.\nDar underscored Pakistan’s July presidency of the UN Security Council, during which it chaired multiple sessions, including one on Palestine. “A unanimous resolution calling for peaceful conflict resolution was adopted under Pakistan’s leadership which was a diplomatic milestone,” he said.\nIn Washington, Dar met US Secretary of State Marco Rubio on July 28 for a “frank and constructive” exchange on bilateral, regional, and global issues. He also engaged think tanks like the Atlantic Council, where his remarks on judicial independence were “misinterpreted” by local political actors. “The judiciary operates independently in Pakistan. Twisting English remarks for political mileage is unfortunate,” he clarified.\nDar reaffirmed Pakistan’s unwavering support for Palestine, citing his participation in the France-Saudi co-hosted international conference and the OIC Emergency Foreign Ministers’ Meeting in Jeddah on August 25. At the OIC, Pakistan categorically rejected the so-called ‘Greater Israel’ plan, calling it “illegitimate and unacceptable”, he added.\nHe also disclosed Pakistan’s quiet diplomatic efforts during the Iran-Israel conflict, noting that “sincere engagement” led to Iran acknowledging Pakistan as a true friend. “The Iranian Parliamentarians chanted ‘Shukriya Pakistan’ in their parliament. That speaks volumes,” he said.\nDar described his August 20 trilateral visit to Kabul, alongside the Chinese and Afghan foreign ministers, as “productive and strategic”, where talks centered on refugees, border security, trade, and infrastructure, with an agreement reached on the Pakistan-Afghanistan-Uzbekistan railway, and China agreeing in principle to extend CPEC into Afghanistan.\nIn Bangladesh (August 23–24), Dar engaged with top leadership from all major parties, including the Bangladesh National Party (BNP) and Jamaat-e-Islami, in a rare full-spectrum diplomatic outreach. However, six MoUs in multiple domains were signed, including visa waivers, trade cooperation, and cultural exchange. He also pushed for SAARC’s revival, stating Bangladesh was supportive but “one state’s resistance remains a hurdle.”\nDuring his August 17–19 visit to the UK, Dar met with Deputy PM Angela Rayner, parliamentarians, and the Commonwealth Secretary-General, launching major diaspora-focused services at the Pakistan High Commission in London, including: digitized Punjab land records, and ‘One-Window’ passport issuance system.\nDar also announced that UK flight restrictions on PIA had been lifted, following earlier success with the EU ban in November 2024. “Flights to Manchester will resume in September, and a UK-Pakistan Business Advisory Council has been launched to increase trade and investment flows,” he said.\nDar confirmed that Pakistan and China will celebrate 75 years of diplomatic relations in 2026, with a series of cultural and economic events planned. He revealed China’s growing interest in agriculture, mining, and industrial investment, and confirmed that 1,000 Pakistani graduates are being sent to China for advanced agricultural education.\nPakistan’s position on “One China Policy” remains unchanged, Dar stressed, noting China’s consistent support on Kashmir in return.\nWhether engaging in global peace forums, regional trade initiatives, or conflict mediation, Pakistan, he said, “is back on a confident and proactive diplomatic track.”\n“We’re not just reacting, we are shaping regional conversations and global dialogues,” Dar concluded. “Our foreign policy is rooted in principle, backed by experience, and aligned with the aspirations of the Pakistani people.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:39:58.495Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dpm-dar-unveils-pakistans-diplomatic-reset-amid-bold-global-engagement-strong-economic-diplomacy/",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T14:52:00.000Z"
}
