{
  "title": "Erdogan vows to stand with oppressed, reaffirms support for Palestine on Victory Day",
  "author": null,
  "content": "ISLAMABAD, August 29 (APP): Turkish President Recep Tayyip Erdogan, in a special message marking the 103rd anniversary of Turkiye’s Victory Day, reaffirmed his country’s resolve to defend justice, oppose oppression, and stand in solidarity with the Palestinian people amid ongoing atrocities in Gaza.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/08/rkg.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nThe message of President Erdogan was read out by Berk ECE, First Counsellor and Deputy Head of Mission of the Turkish Embassy in Islamabad, during a reception attended by diplomats, officials, and members of the Turkish community held here at a local hotel.\nPresident Erdogan recalled the decisive Battle of Dumlupinar on August 30, 1922, describing it as a turning point in Turkiye’s War of Independence that routed occupying imperial forces. He paid tribute to Ghazi Mustafa Kemal Ataturk, veterans, and martyrs who laid the foundations of modern Turkiye through sacrifice and resilience.\nLinking the spirit of the Great Victory to current challenges, Erdogan emphasized that Turkiye remained committed to eliminating terrorism, safeguarding national unity, and advancing prosperity for its 86 million citizens.\nHighlighting the dire humanitarian situation in Gaza, the Turkish leader condemned the “policies of destruction, occupation, and genocide,” and warned responsible for massacres would be held accountable before law and history.\n“Despite the countless attacks they have endured for nearly 80 years, our Palestinian brothers and sisters will, God willing, continue to live in their homeland till the end of time,” Erdogan said, pledging Turkiye’s unwavering support for oppressed nations across the globe.\nHe also urged the international community to unite on the “front for humanity” to establish lasting peace and stability in the region.\nThe Turkish President extended Victory Day greetings to the Turkish nation, Turkish Cypriots, and millions of citizens abroad, reiterating his vision of a “Century of Turkiye” built on peace, prosperity, and dignity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:39:09.113Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/erdogan-vows-to-stand-with-oppressed-reaffirms-support-for-palestine-on-victory-day/",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T17:57:00.000Z"
}
