{
  "title": "PNCA showcases ‘Miniature Marvels’ exhibition featuring emerging talents",
  "author": null,
  "content": "ISLAMABAD, Aug 29 (APP): The Pakistan National Council of the Arts (PNCA), National Heritage and Culture Division, inaugurated its group exhibition “Miniature Marvels” at the National Art Gallery on Friday, featuring the creative works of participants from a two-week Miniature Painting Workshop led by renowned artist Farrah Mahmood.\nThe exhibition was inaugurated by eminent visual artist Mr Amin Rehman, who also distributed certificates among the participants.\nThe workshop, held from July 28 to August 7, 2025, at the National Art Gallery, attracted participants from diverse professional backgrounds including engineers, doctors, advocates, architects, and artists.\nThe exhibition features the works of Attia Wadood, Azizah, Dua Amsal, Faiezah Shahid, Farzana Faisal, Fatima Farid, Hafssa, Muskan Janjua, Nayab Rizwan, Nusratje, Saima Shadab, Sania Ahmed, Shazia Javaid, Shirin Amir, Sofia Akhtar, Sumbul Nazir and Wania Ali.\nSpeaking on the occasion, Amin Rehman praised the “outstanding efforts” of workshop leader Farrah Mahmood and the PNCA Visual Arts Division team.\nHe acknowledged the contributions of Director Mariam Ahmed, Designer Saba Zia, Noshaba Naz, and Zahid ur Rehman, while also extending special thanks to Samreen and Fizza for their assistance in making the program a success.\nRehman highlighted that the collaborative effort of the PNCA team and Farrah Mahmood created a valuable platform for participants to learn and practice the intricate art of miniature painting.\nHe commended the participants for their “remarkable achievements” in mastering a traditional craft that demands precision, patience, and creativity.\nThe dedication of Farrah Mahmood Rana in promoting artistic excellence and nurturing new talent was widely recognized.\nHer exceptional teaching skills, combined with a patient and encouraging approach, provided participants with a supportive learning environment that helped them explore their creativity and refine their artistic expression.\nThrough the “Miniature Marvels” exhibition, PNCA aims to celebrate the creative accomplishments of the workshop participants while also promoting indigenous art forms and encouraging cross-disciplinary exchange.\nThe institution acknowledged Farrah Mahmood Rana’s invaluable contribution to the success of the initiative and expressed hope that such programs would continue to inspire and strengthen Pakistan’s art community.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:39:33.536Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pnca-showcases-miniature-marvels-exhibition-featuring-emerging-talents/",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T15:22:00.000Z"
}
