{
  "title": "NA body calls for strict oversight of private hospitals",
  "author": null,
  "content": "ISLAMABAD, Aug 29 (APP): The National Assembly Standing Committee on National Health Services, Regulations and Coordination on Friday discussed key issues relating to healthcare services, medical education, regulatory oversight, and employee service matters.\nA major focus of the meeting which was chaired by Dr. Mahesh Kumar Malani, was regulation of private hospitals and laboratories, and healthcare facilities in Islamabad.\nReviewing the report of its Sub-Committee, convened by Dr. Amjad Ali Khan, the committee noted widespread non-compliance with licensing requirements, poor waste management, and lack of transparency in operations.\nIt was revealed that several private facilities were running without valid licenses, while some Islamabad Healthcare Regulatory Authority (IHRA) board members had conflicts of interest due to their ownership of private setups.\nThe committee directed the Ministry of Health to strengthen IHRA, issue immediate show-cause notices to non-compliant hospitals, and establish a robust licensing and monitoring framework.\nIt also called for categorization of healthcare facilities and fixing of standardized service charges. A compliance report is to be submitted in the next meeting.\nThe committee also discussed the availability of life-saving emergency medicines, performance of Basic Health Units (BHUs) and Rural Health Centers (RHCs) in Islamabad Capital Territory, and response in flood-affected areas.\nAnother key agenda item was the plight of postgraduate medical trainees, particularly those in FCPS and MCPS programs.\nThe committee expressed displeasure that many trainees, especially at Isra University, were working without stipends despite clear government policy.\nReiterating that honorary training was not permissible, the committee directed Isra University to submit a written undertaking to pay stipends and provide disbursement records for the past three months.\nThe College of Physicians and Surgeons Pakistan (CPSP) endorsed the committee’s directives.\nEmployee service matters also came under discussion, particularly the cases of Pakistan Medical and Dental Council (PMDC) employees whose contracts had expired in June 2023, delayed promotions, and mishandling of disciplinary procedures.\nThe Ministry was asked to resolve these issues immediately and submit a compliance report by next week, while PMDC was instructed to present an inquiry report and ensure merit-based promotions.\nOn the longstanding issue of foreign medical graduates from Kyrgyzstan, the committee recommended that PMDC allow them to appear in the National Registration Examination (NRE).\nThe Ministry and PMDC were directed to submit within three days a detailed report of all foreign medical institutions recognized since 2020.\nEmphasizing the need for timely action, the committee warned regulatory bodies and institutions that failure to comply with directives would have consequences, including barring the Ministry from attending future meetings.\nThe chair underscored the committee’s resolve to protect patient rights, uphold medical professionals’ entitlements, and improve healthcare delivery systems.\nThe Committee deferred its legislative agenda, including Starred Questions 20, 23, and 49, along with “The Pakistan Nursing Council (Amendment) Bill, 2024” and “The Pharmacy (Amendment) Bill, 2024,” to the next sitting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:40:09.433Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-body-calls-for-strict-oversight-of-private-hospitals/",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T13:37:00.000Z"
}
