{
  "title": "CM Punjab lays foundation stone of Gymkhana Club expansion project",
  "link": "https://www.app.com.pk/national/cm-punjab-lays-foundation-stone-of-gymkhana-club-expansion-project/",
  "date_published": "2023-06-02T07:53:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 02 (APP): Chief Minister (CM) Punjab, Syed Mohsin Raza Naqvi here on Thursday night laid the foundation stone of Gymkhana Club expansion project.\nAddressing the participants, the CM said that clubs like Rawalpindi Gymkhana model would also be started in other cities of Punjab. Gymkhana clubs on self-help basis should be constructed in other cities of Punjab as this model is a successful, Mohsin Naqvi said.\nThe CM informed that Punjab’s new fiscal year budget would be for four months. “We will start work soon on Rawalpindi Ring Road Project by allocating funds in the budget,” he said adding that Kutchery Chowk flyover project would also be started soon.\nMohsin Naqvi said funds would also be allocated in the budget for Rawalpindi Safe City project.\nCommissioner Rawalpindi Division Liaquat Ali Chatha said that Potohar enclosure at Gymkhana Club would be completed in record period.\nPotohar enclosure and 38 guest rooms are being built with the support of the citizens and business community of Rawalpindi, he said adding, total cost of the project would be Rs 550 million.\nA library, food halls, coffee shop, grand cinema, table tennis lounge, snooker room and children’s fun zone would be constructed in the enclosure. It would also have a conference room, salons, admin wing and laundry, he said.\nProvincial Minister Housing and Urban Development, Azfar Ali Nasir, Advisor to the CM, Kunwar Dilshad, Regional Police Officer Rawalpindi, Syed Khurram Ali, Director General, RDA Saif Anwar Jappa, Deputy Commissioner Rawalpindi, Hasan Waqar Cheema, Director Development, Nazia Parveen, Group Leader, Rawalpindi Chamber of Commerce Industry, Sohail Altaf and others were present on the occasion.",
  "retrievedAt": "2025-08-11T08:36:29.059Z"
}
