{
  "title": "PM directs for preparing export-oriented development budget 2023-24",
  "link": "https://www.app.com.pk/national/pm-directs-for-preparing-export-oriented-development-budget-2023-24/",
  "date_published": "2023-06-02T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday issued clear directions to include on priority, such projects in the upcoming development budget that help in ensuring import substitutions, expanding export volume, and bringing innovation in various sectors.\nThe prime minister also directed to allocate special funds in the development programme for the welfare and development of the country’s youth.\nChairing a meeting here to review the budget proposals with respect to the Public Sector Development Programme (PSDP) 2023-24, Shehbaz Sharif said that in the upcoming budget, projects relating to higher education, professional training and job creation for the youth must be added in the programme.\nHe also asked for the establishment of Pakistan Endowment Fund to provide higher education to the youth.\nThe laptop programme should also be included in the upcoming PSDP to distribute free laptops among the top performing students to equip them with the modern technology skills, he added.\nHe said through the endowment fund, the youth should be given professional and higher education besides skilled based training in IT sector.\nThe prime minister also stressed the need to give special importance to merit and transparency while providing scholarships and education to the youth.\nPM Shehbaz directed to continue the projects initiated under the Kissan Package while renewable energy projects should also be made part of the development budget.\nThe prime minister also directed to allocate special funds in the upcoming budget for projects to bring innovation in the energy sector.\nHe said all the slow moving ongoing projects under the PSDP that had lost their importance should be removed from the development budget.\nAll stakeholders of the the relevant sectors and the allied parties should be consulted before including any development project in the budget and their proposals should also be considered, the prime minister directed.\nEarlier the meeting was briefed in detail about the proposals for adding new projects in the upcoming fiscal year and progress on the ongoing projects.\nIt was informed that as per the direction of the prime minister, projects related to the agriculture sector, renewable energy, higher education for youth, professional training and job raising schemes would be important part of the development budget.\nThe meeting was further told that the IT sector development and export boosting projects would also be part of the development budget.\nShehbaz Sharif was informed that the Prime Minister Kissan Package and Youth Empowerment Programme that were included in the budget 2022-23 were yielding fruits now as over 60,000 youth were being provided internship in various government development projects whereas the production of wheat broke the 10-year record this year.\nThe meeting was attended by federal ministers Ishaq Dar, Khawaja Muhammad Asif, Ahsan Iqbal, Rana Sanaullah, Rana Tanvir Hussain, Advisor Ahad Khan Cheema, Special Assistants to Prime Minister Malik Ahmad Khan, Ataullah Tarrar, Jehanzeb Khan and other relevant officials.",
  "retrievedAt": "2025-08-11T08:36:29.413Z"
}
