{
  "title": "Initiatives implemented to promote IT industry : Minister",
  "link": "https://www.app.com.pk/national/initiatives-implemented-to-promote-it-industry-minister/",
  "date_published": "2023-06-02T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP):Federal Minister for Information Technology (IT) and Telecommunication Syed Amin ul Haque on Friday said the initiatives implemented to promote the IT sector, freelancers, and start-ups had made Pakistan a digital hub.\nHe said this in an address as keynote speaker in a Panel Discussion at Digital Summit, GITEX-23 Morocco in Marrakech the Historic City of Morocco, said a press release.\nSyed Amin ul Haque said, “To achieve the target of Digital Pakistan his ministry is working round the clock, and it will drive entrepreneurial innovation, productivity, and economic growth.”\nThe minister said, “The Ministry of IT is working on different projects keeping 2050 in vision.”\n“The purpose of the conference is to inform about initiatives and various policies including Cyber Security, Freelancers Policy, and Personal Data Protection Bill.”\n“Pakistan is emerging as an important center of IT where wide opportunities and incentives are available for international investors,” he added.\nHighlighted the significance of start-ups in Pakistan, the minister said; “It is very well said that the entrepreneur always searches for change, responds to it, and exploits it as an opportunity. Since start-ups are centers of novel innovations, they generate jobs, which implies more career opportunities.”\n“More employment leads to a stronger economy, and a healthier economy has a direct bearing on the growth of cities where the start-ups locate.”\n“Pakistan is filled with talented professionals in different fields and start-ups provide them with the right platform to showcase their talent and this ultimately attracts multinational companies to invest in Pakistan.”\n“National Incubation Center (NIC) across Pakistan are working to boost start-ups and facilitate youth to have their own businesses,” he added.\nHe hailed the efforts GITEX-Africa organizers to host the mega event and manage to gather all Tech-Leader from across the globe.\nThe Digital Summit was attended by a number of prominent members from International leaders, entrepreneurs, industrialists, founders of different startups, and other notables from different walks of life.\nEarlier, during the sidelines meeting Daniel Schaer Ambassador at Large Africa Estonia, Janade Du Plessis Managing Partner – Launch Africa Ventures South Africa and other delegations called on Syed Amin ul Haque and discussed about bilateral issues relevant to the IT sector.\nFrom the Pakistan side, the meetings were attended by Member IT Syed Junaid Imam and Chairman PASHA Zohaib Khan.",
  "retrievedAt": "2025-08-11T08:36:29.736Z"
}
