{
  "title": "FAO joins hands with MNFS&R  to unlock potential of Pakistan’s livestock sector",
  "link": "https://www.app.com.pk/national/fao-joins-hands-with-mnfsr-to-unlock-potential-of-pakistans-livestock-sector/",
  "date_published": "2023-06-02T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP): The Food and Agriculture Organization of the United Nations (FAO) together with Ministry of National Food Security & Research (MNFS&R) concluded a national workshop in Islamabad to share the findings of the assessment of Pakistan’s existing animal disease surveillance system and provide valuable recommendations.\nThe Workshop was organized under the Technical Cooperation Program (TCP) which aims to improve the animal disease surveillance system and establish a real-time animal disease reporting system in the Pakistan.\nThe workshop brought together leading experts, officials from federal and provincial livestock departments, and other key stakeholders committed to safeguarding animal health and welfare. The workshop provided a platform to unlock the potential of the livestock industry and promote its development.\nHighlighting the importance of a comprehensive regulatory frame-work alongside the disease surveillance system, Dr Khalid Ashfaq, Animal Husbandry Commissioner said that the Ministry has developed a draft National Animal Health Act aligned with World Organization for Animal Health guidelines, which will be presented to workshop participants for review and recommendations. Once approved, this will be the first national-level document related to animal health legislation in Pakistan, he added.\nFAO Deputy Representative in Pakistan, Farrukh Toirov, during his inaugural remarks, said that there is a huge disparity between livestock sector’s potential and the resources allocated to this sector in Pakistan. To unlock the potential of the sector we need to improve the animal disease surveillance system and establish a real-time animal disease reporting system. Together with MNFS&R and other stakeholders, we aim to address this issue through this TCP.\nEmphasizing the importance of the feasibility study which is expected to be completed within the project tenure, Muhammad Afzal, Project Coordinator said that establishing a robust animal disease surveillance system in Pakistan is crucial, as the country struggles to meet its local per capita requirements and currently earns only USD 350 million annually in livestock exports. With the majority of livestock farmers living at a subsistence level, the Ministry of National Food Security & Research recognizes the immense challenge and aims to enhance livestock productivity and add value to the sector.\nThe workshop served as a platform for knowledge and idea-sharing among participants, concluding with a commitment from all stakeholders to foster collaboration and develop an effective and implementable animal disease surveillance system in Pakistan.",
  "retrievedAt": "2025-08-11T08:36:29.724Z"
}
