{
  "title": "Harmer stars as South Africa crush Pakistan to draw Test series",
  "author": "AFP",
  "content": "South Africa beat Pakistan by eight wickets in the second Test in Rawalpindi on Thursday to draw the series 1-1 with Simon Harmer taking a maiden five-wicket haul.\n\nThe 36-year-old off-spinner finished with 6-50, taking his 1,000th first-class wicket in the process, on a deteriorating Rawalpindi stadium pitch.\n\nSouth Africa reached the 68-run target for the loss of captain Aiden Markram (42) and Tristan Stubbs (nought), both to spinner Noman Ali, who finished with 2-40.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -0:00MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nRyan Rickelton, who scored 25 not out, hit Sajid Khan for a six to seal an emphatic win minutes before the lunch break for the World Test Championship holders.\n\nIn another battle of spinners, Pakistan managed 333 in their first innings before the South African tail wagged to help them pile up 404 for a crucial 71-run lead.\n\nSpinners took 34 of the 40 wickets to fall in the first Test in Lahore, which Pakistan won by 93 runs.\n\nThursday’s morning session saw Pakistan’s batters fold, adding just 44 runs after resuming the fourth day on 94-4.\n\nHarmer torpedoed Pakistan’s hopes of saving the Test when he trapped Babar Azam leg-before with the fifth ball of the day after the batsman had reached his 30th Test half-century.\n\nPakistan’s hopes had rested on Azam ending his century drought, having not scored a ton since December 2022.\n\nHis lean spell goes on.\n\nNine runs later Harmer had Mohammad Rizwan caught by close-in fielder Tony de Zorzi for 18.\n\nIn his next over the spinner dismissed Noman for nought, caught behind for Harmer’s 1,000 wicket in his 235th first-class match.\n\nHarmer is the fourth South African to take 1,000 or more first-class wickets, behind Mike Procter (1,417), Allan Donald (1,216) and Charlie Llewellyn (1013).\nHarmer’s previous best figures of 4-51 came in the first Test in Lahore.\n\nUnlike South Africa, Pakistan’s tail did not last long as they lost their last five wickets for just 33 runs in their second innings, just their latest batting slumps in the series.\n\nShaheen Shah Afridi was run out without scoring while Keshav Maharaj dismissed Salman Agha for 28 and Sajid Khan for 13 to swiftly wrap up the innings.\n\nMaharaj finished with 2-34 to follow up his 7-102 in the first innings.\n\nPakistan captain Shan Masood gave a vote of confidence to his country’s controversial policy of preparing slow, spinning wickets for home tests, even after it backfired as they lost to South Africa.\n\nPakistan have deliberately looked to produce dry and deteriorating pitches for their spin bowlers to thrive on in home tests over the last 12 months against England, West Indies and South Africa a decision that has attracted some criticism.\n\n“Look, it’s been four wins out of six since we’ve operated on these wickets,” he said.\n\n“Obviously, the wickets have got a bit better. They’ve been much more battable. Four out of six isn’t bad considering in the two test matches we’ve lost we got into winning positions. Had we finished those games off it could easily have been six out of six.”\n\nCritics of the Pakistan approach fear it holds back the development of their fast bowlers, and this would erode their competitiveness in away series.\n\n“There is a lot to work on,” said Masood who has now lost ten of the 14 Test as skipper. “The lower order batting, finishing the innings of the opposition, and our third innings batting are not perfect.\n\n“We had a great opportunity to close it out when we had a lead of 98 with two wickets to go but those last two wickets cost us dearly, putting us under a lot of pressure, and in these conditions it’s the difference between the first innings that leads into the third and fourth innings,” said Masood.\n\n“We have a lot to work on when it comes to lower order batting, when it comes to finishing the innings off, when it comes to the third innings of batting, also when it comes to the first innings where we could have posted something north of 400, but we didn’t,” he added.\n\nSkipper Markram says lessons learnt from the spin-dominated series will put South Africa in good stead for their tour of India next month.\n\nMarkram, standing in for injured skipper Temba Bavuma, praised his team’s fightback.\n\n“After the first Test we were put under pressure and the guys have put their hands up and excelled,” said Markram.\n\n“We have taken a lot of confidence from this win and we are in a great space to be in as a team, but we are still a work in progress in these conditions as we now head to India.”\n\nMarkram said his spin quartet was up to the challenge.\n\n“The unit out here had quality spinners,” said Markram of Maharaj, Harmer, Senuran Muthusamy and Prenelan Subrayen — who between them took 35 of the 40 wickets in the series.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/231252122053a55.webp",
  "retrievedAt": "2025-10-23T20:17:47.412Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950770/harmer-stars-as-south-africa-crush-pakistan-to-draw-test-series",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T07:14:15.000Z"
}
