{
  "title": "As Punjab govt mulls Basant revival, kite string leaves youth dead",
  "author": "Asif Chaudhry",
  "content": "LAHORE: A few days after the Punjab government reviewed a proposal to revive the Basant festival in the city on a limited scale under strict regulation, blatant violation of the ban on kite flying claimed the life of a young man late on Tuesday, as the police allegedly relaxed the crackdown on the violators.\n\nAs per initial reports, sharp string of a stray kite entangled around the neck of a young motorcyclist, later identified as Nauman Yousuf, in Nawankot area and slit his jugular veins.\n\nLast time, such an incident was reported in 2022, when a youth, Shahzad (20), had died in Nawnakot area after kite string slit his throat.\n\nA doctor says that jugular veins are a major blood vessel in the neck area, and their slitting may lead to significant blood loss, ultimately resulting in death of the injured person. He says the vascular injuries caused by kite string were uncommon, but in some cases are associated with morbidity and mortality.\n\nWitnesses told the police that apparently it was metallic or glass-coated string as it left the young man in a pool of blood within seconds.\n\nThey said that following the deep cut inflicted by the kite string, the youth lost control over the bike and fell onto the road, resulting in more injuries.\n\nThe police and the Rescue 1122 officials shifted the critically injured young man to the hospital soon after the incident, where doctors declared him dead a few minutes later.\n\nA police official says that the deceased was a medical sales representative associated with a pharmaceutical firm and the only breadwinner of his family, comprising a younger brother, two sisters and parents.\n\nHe says that following the incident, the police managed to trace the cell phone number of the victim’s cousin Usman and informed him about his death. The youth’s sudden death left his parents and siblings in trauma, he added.\n\nMany blame the recent high-profile meetings convened by the Punjab government to review the 18-year-old ban on kite flying, for the death of the young man.\n\nA source says the Punjab government recently initiated a moved to revive the Basant festival on a limited-scale in Lahore. The authorities had proposed a plan for holding two-day Basant celebrations on a weekend, he adds.\n\nHe says that the Lahore district administration had submitted Basant-related recommendations to the Punjab government, proposing the festival be confined to select areas of the Walled City.\n\nThe identified areas include Mochi Gate, Shahi Qila, Bhati Gate, Rang Mahal etc, he adds.\n\nMeanwhile, the source says that a senior provincial minister reviewed the proposal and discussed the necessary administrative and safety measures with the officials concerned.\n\nFollowing these official consultations, he says, the police relaxed the crackdown and the kite-flying buffs blatantly violated the ban and the safety regulations in most parts of the city, ultimately resulting in the unfortunate death of the youngster.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23083849916cde4.webp",
  "retrievedAt": "2025-10-23T20:18:47.869Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950736/as-punjab-govt-mulls-basant-revival-kite-string-leaves-youth-dead",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T02:30:07.000Z"
}
