{
  "title": "Punjab ‘ban’ on wheat movement violation of Constitution: KP CM Afridi",
  "author": "Bureau Report",
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Minister Mohammad Sohail Afridi on Wednesday condemned the Punjab government’s ‘move’ to restrict transportation of wheat and its flour to his province.\n\nThe chief minister termed the ‘ban’, a blatant violation of the Constitution and an attack on the rights of the KP citizens.\n\nThe chief minister, while presiding over a meeting, directed the food department high-ups to write a letter to the Punjab government demanding immediate removal of all restrictions to ensure free movement of wheat and its flour across the provincial borders, according to a statement issued from the chief minister’s secretariat.\n\nMr Afridi said hiding behind political differences to deprive citizens of basic necessities was unacceptable.\n\nHe also directed the food department to take pragmatic steps against all types of hoarding to ensure availability of essential food items at officially fixed rates.\n\nHe ordered the immediate registration of all warehouses across the province, the statement said.\n\nDuring the meeting, the chief minister was briefed on the province’s current wheat and sugar stocks and prevailing prices.\n\nOfficials from the food department informed the meeting that KP’s annual wheat and flour consumption was approximately 5.3 million metric tons, of which only 1.5 million metric tons were produced locally.\n\nThe remaining requirement, according to the statement, was met through supplies from Punjab and other provinces.\n\nThe chief minister was informed that at present, around 273,000 metric tons of wheat was available in godowns across the province.\n\nThe meeting was informed that the recent surge in flour prices was primarily caused by restrictions imposed by Punjab on the transportation of wheat and flour to KP.\n\nRegarding sugar, officials noted that the province’s annual requirement was around one million tons — 30 per cent for domestic use and 70 per cent for commercial consumption. The meeting was informed that KP had about 480,000 metric tons of sugar in stock right now.\n\nThe chief minister reaffirmed his government’s commitment to protecting the rights and welfare of the people of Khyber Pakhtunkhwa, stating that no political obstacle would be allowed to endanger food security or exploit citizens for partisan gains.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23092735c59b3e0.webp",
  "retrievedAt": "2025-10-23T20:19:04.971Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950629/punjab-ban-on-wheat-movement-violation-of-constitution-kp-cm-afridi",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:58:37.000Z"
}
