{
  "title": "How will the next UN chief be chosen and who wants the job?",
  "author": "Reuters",
  "content": "A new United Nations secretary-general will be elected next year for a five-year term starting on January 1, 2027.\n\nHere are the potential candidates so far and how the successor to current UN chief Antonio Guterres will be chosen:\n\nThe race will formally start when the 15-member Security Council and the president of the 193-member General Assembly send a joint letter soliciting nominations.\n\nThat letter is due to be sent by the end of the year. A candidate has to be nominated by a UN member state.\n\nThe job traditionally rotates among regions, but when Guterres — who is from Portugal — was elected in 2016, it was supposed to be Eastern Europe’s turn. Next on the list is Latin America; however, some diplomats expect candidates from other regions.\n\nWhile the race doesn’t formally begin until the letter is sent by the presidents of the Security Council and the General Assembly, there are already several publicly declared candidates:\n\nMichelle Bachelet — Chile: Chile will nominate the country’s former president, Michelle Bachelet, President Gabriel Boric said on September 23, 2025. Bachelet was Chile’s first female head of state and served as president of the South American nation twice. Bachelet was UN High Commissioner for Human Rights between 2018-2022 and executive director of UN Women between 2010-2013.\n\nRebeca Grynspan — Costa Rica: Costa Rica will nominate former Vice President Rebeca Grynspan, President Rodrigo Chaves said on October 8, 2025. Grynspan, a 69-year-old politician and economist, currently serves as Secretary-General of the UN Conference on Trade and Development (UNCTAD).\n\nRafael Grossi — Argentina: Grossi has long said he was considering campaigning to be secretary-general. When asked by Reuters on September 3, 2025 if he was definitely going to run, he said: “Yes, I am going to do that, yes.” A veteran Argentinian diplomat, Grossi is director-general of the International Atomic Energy Agency, a role he has held since 2019.\n\nThe 15-member Security Council will formally recommend a candidate to the 193-member General Assembly for election as the 10th UN secretary-general later next year.\n\nThe Security Council will hold secret ballots — referred to as a straw poll — until a consensus is reached on a candidate. The choices council members are given for each candidate in the straw poll are: encourage, discourage or no opinion.\n\nUltimately, the five permanent veto-wielding council members — the United States, Russia, Britain, China and France — must agree on a candidate.\n\nThe ballots for the veto powers in the straw poll are traditionally a different colour from those of the 10 elected members. When Guterres was chosen in 2016 to be recommended to the General Assembly, it took six straw polls for the Security Council to reach agreement.\n\nThe Security Council then adopts a resolution, traditionally behind closed doors, recommending an appointment to the General Assembly. The resolution needs nine votes in favour and no vetoes to pass.\n\nThe General Assembly’s approval of the appointment of a secretary-general has long been seen as a rubber stamp.\n\nThe United Nations has been working to improve the transparency of the historically opaque selection process.\n\nThe General Assembly, in a resolution adopted in September 2025, said each candidate should provide a vision statement when they are formally nominated and be given the opportunity to present it. It said the vision statement should also be publicised on a dedicated United Nations web page.\n\nThe Assembly said each candidate should disclose their sources of funding and that any candidates who already hold a UN position “should consider suspending their work in the United Nations system during the campaign, with a view to avoiding any conflict of interest that may arise from their functions and adjacent advantages.”\n\nThe UN Charter calls the secretary-general the “chief administrative officer” of the world body. The UN website describes the role as “equal parts diplomat and advocate, civil servant and chief executive officer.”\n\nGuterres currently oversees more than 30,000 civilian staff and 11 peacekeeping operations with around 60,000 troops and police. The core annual United Nations budget is $3.7 billion, while the peacekeeping budget is $5.6bn.\n\nSince the power to authorise military force or sanctions rests with the Security Council, the UN chief has little more than a bully pulpit. Many diplomats say the five council veto powers prefer a “secretary” rather than a “general.”\n\nNo. There is a growing push for the United Nations to choose the first female secretary-general in its 80-year history.\n\nIn the resolution adopted in September, the General Assembly noted “with regret that no woman has ever held the position of Secretary-General” and encouraged countries to “strongly consider nominating women as candidates.”\n\nHeader image: The General Assembly Hall is seen at the United Nations headquarters in New York City September 18, 2015. — Reuters",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2220214867e267a.webp",
  "retrievedAt": "2025-10-23T00:26:51.329Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950589/how-will-the-next-un-chief-be-chosen-and-who-wants-the-job",
  "dateList": "2025-10-23",
  "date_published": "2025-10-22T16:29:49.000Z"
}
