{
  "title": "Azhar laments lack of frequent Test cricket after Pakistan’s drubbing against South Africa",
  "author": "Dawn.com",
  "content": "Pakistan interim red ball head coach Azhar Mahmood lamented the lack of frequent Test cricket for the national side after the Green Shirts went down to South Africa by eight wickets in the second Test at the Rawalpindi Cricket Stadium on Thursday.\n\n“It’s unfortunate that we played a Test match before this in January and we will play next in March,” Azhar said at the post-match press conference.\n\n“We have to play Test matches regularly to be able to cope with these issues. We have played only four Test matches over the four years we meet after long gaps. That doesn’t really help.”Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nPrior to this, Pakistan played a Test against West Indies in January where the series was drawn. In December 2024, South Africa had a 2-0 win over Pakistan on home soil. October the same year saw Pakistan beat England 2-1 in Multan, while Bangladesh had a clean sweep against Pakistan 2-0 in Rawalpindi in August.\n\nSpeaking at today’s presser, Azhar noted that the pitches were “much better “than the West Indies wickets.\n\n“There was spin but there was also return for batters who applied themselves, while fast bowlers also flourished.\n\n“If we want to keep making such pitches then we have to ensure we provide the same in domestic cricket so that our batters learn how to go about their game in these conditions.\n\nHe added: “When you play regular domestic cricket, you learn how to respond to difficult periods. However, only playing Test cricket doesn’t give you that opportunity if you go through a bad patch. So, I think, domestic cricket is the best answer.\n\nThe biggest upset of the match was losing 22 wickets for 93 runs across the last four innings, which Azhar said was “not acceptable”.\n\n“In the recent camps, we’ve tried to send this message to the players. If your top seven scores 250-260 runs, the lower order also needs to show up. I think this was the difference between the two teams,” the head coach said.\n\nAt Sunday’s pre-match presser ahead of the second Test, Azhar had echoed a similar sentiment on the lower order after South Africa made 90 runs in their last four wickets.\n\nSpeaking today, Azhar said the players need to know their strong scoring shots.\n\n“You can take Muthusamy’s example. He scored from sweeps and reverse sweeps through the course of his innings. I think we were blocking a bit too much whereas we should have tried to challenge the opposition bowlers.\n\n“This requires a lot of mental toughness. A player should have full expertise and awareness about his attacking and defensive options,” he said.\n\n“The turning point of the match was when we failed to capitalise on a 300-plus score in the first innings as our last five wickets fell cheaply.\n\n“Then we also have to give credit to how Muthusamy and Rabada played, but we spilled around five chances in South Africa’s first innings. When you do that against a quality side, you pay for it.”\n\nPakistan will next play South Africa from October 28 to November 1 in a T20I series in Rawalpindi and Lahore, for which the National Selection Committee named a 15-member squad led by Salman Ali Agha.\n\nPakistan and South Africa will also feature in a three-match ODI series to be held at the Iqbal Stadium in Faisalabad from Nov 4-8.\n\nThe ODI series will be followed by another three-match ODI series against Sri Lanka at the Rawalpindi Cricket Stadium from Nov 11-15.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/231457195d2be8f.webp",
  "retrievedAt": "2025-10-23T20:17:45.214Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950776/azhar-laments-lack-of-frequent-test-cricket-after-pakistans-drubbing-against-south-africa",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T09:53:07.000Z"
}
