{
  "title": "Bangladesh court detains army officers in landmark trial",
  "author": "AFP",
  "content": "DHAKA: A Bangladeshi court remanded in custody on Wednesday 15 high-ranking army officers on charges of enforced disappearances and atrocities committed during the 2024 uprising that toppled the government.\n\nIt is the first time that formal charges have been brought for enforced disappearances in Ban­g­ladesh, and the first time so many senior military officials have faced a civilian trial.\n\nThe men, including five generals, are accused of running a secret detention centre during the tenure of the now-ousted prime minister Sheikh Hasina.\n\nAll have served in Bangladeshi military intelligence or the feared paramilitary Rapid Action Battalion (RAB).\n\nFive generals among 15 officers charged with enforced disappearances, atrocities during the 2024 uprising\n\nDefence lawyer Sarwar Hossain said all rejected the charges.\n\nThe army has said it will assist the judicial process, but the situation has been tense since the court issued arrest warrants earlier this month.\n\n“They declared their allegiance to the law of the land and their respect for the judicial process,” the court’s chief prosecutor Tajul Islam told reporters.\n\n“That was reflected in the cooperation they have extended.”\n\nUN Human Rights Chief Volker Turk, in a statement on Oct 15, said that the court process was an important step towards accountability. “It is a significant moment for victims and their families,” Turk said.\n\nThe officers were brou­ght by a prison van to the court, guarded by a heavy deployment of police.\n\n“These officers are confident of their innocence, and believe they will be released through due judicial process,” their lawyer Hossain said.\n\nBangladesh is prosecuting former senior figures connected to Hasina — now a fugitive in exile in India — and her now-banned Awami League party.\n\nUp to 1,400 people were killed in the clashes between July and August 2024 as the security forces tried to quash anti-government protests, according to the United Nations.\n\nDuring Hasina’s rule, RAB forces carried out scores of killings, and the organisation was sanctioned by the United States in 2021.\n\nHasina, 78, fled last year to New Delhi, where she has defied court orders to return to attend her ongoing crimes against humanity trial for ordering the deadly crackdown.\n\nHer trial in absentia is in its final stages, with Hasina’s state-appointed defence giving closing arguments. The prosecution demanded the death penalty for Hasina.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2308012781e9406.webp",
  "retrievedAt": "2025-10-23T20:20:01.438Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950674/bangladesh-court-detains-army-officers-in-landmark-trial",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:57:34.000Z"
}
