{
  "title": "US President Trump says he spoke to Modi about having ‘no wars with Pakistan’",
  "author": "Dawn.com",
  "content": "United States President Donald Trump has stated that he and Indian Prime Minister Narendra Modi had a phone call where they talked about having “no wars with Pakistan”.\n\nThe US president has repeatedly claimed credit for ending the conflict between Pakistan and India earlier this year in May. India has denied the claim that the US president was responsible for brokering the ceasefire via trade threats. Meanwhile, Prime Minister Shehbaz Sharif has praised Trump for his “leadership and proactive role” in helping the two neighbours achieve peace in the region.\n\nParticipating in a Diwali celebration at the White House on Tuesday, Trump said he had a “great conversation” with Indian PM Modi over the phone.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 1.66%00:00Remaining Time -10:03MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\n“We talked about trade — we talked about a lot of things, but mostly the world of trade, he’s very interested in that. Although we did talk a little while ago about let’s have no wars with Pakistan,” he said.\n\n“I think the fact that trade was involved, I was able to talk about that — and we have no war with Pakistan and India and that was a very, very good thing,” he said. Trump also called Modi a “great person”, saying that he had become a great friend of his over the years.\n\nThe US president also stated that Modi was keen to see the end of the Russia-Ukraine war.\n\n“We just have a very good relationship,” he said while talking about Modi. “And he’s not gonna buy much oil from Russia; he wants to see that war end as much as I do — he wants to see the war end between Russia and Ukraine … so they’ve cut it way back and they’re continuing to cut it way back.”\n\nTrump also lauded the US’ success in “forging peace all over the world”.\n\n“We’re putting America first; we’re getting everybody to sort of get along,” he said, highlighting the US role in securing “total peace” in the Middle East.\n\n“Nobody thought we’d ever see that happening,” he said. “We have levels of friendship with everybody … countries that hated each other now love each other,” he said.\n\nMeanwhile, Modi thanked the US president for his phone call and Diwali greetings.\n\n“On this festival of lights, may our two great democracies continue to illuminate the world with hope and stand united against terrorism in all its forms,” he said on social media platform X.\n\nTensions between India and Pakistan escalated sharply in early May after an attack in Indian-occupied Kashmir’s Pahalgam prompted New Delhi to launch “Operation Sindoor” which targeted sites inside Pakistan and causing civilian casualties.\n\nIndia blamed Pakistan without presenting evidence, further inflaming hostilities between the two nuclear-armed neighbours. Pakistan later launched a retaliatory operation called “Bunyanum Marsoos”, leading to heavy artillery and drone exchanges before a US-led push helped broker a ceasefire.\n\nBoth sides used fighter jets, missiles, artillery and drones during the four-day conflict, killing dozens of people, before agreeing to a ceasefire. In the immediate aftermath of the conflict, Pakistan said it took down six Indian fighter jets during the conflict, including the French-made Rafale. New Delhi acknowledged “some losses” during the conflict but denied losing six jets.\n\nMonth later in September, PM Shehbaz — during a United Nations General Assembly speech — said that the Pakistan Air Force turned “seven of the Indian jets” into scrap and dust. Later, Trump also described how he confronted both nations during a conflict that saw “seven aircraft shot down”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2211500778b242a.webp",
  "retrievedAt": "2025-10-23T00:27:38.646Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950554/us-president-trump-says-he-spoke-to-modi-about-having-no-wars-with-pakistan",
  "dateList": "2025-10-23",
  "date_published": "2025-10-22T07:12:58.000Z"
}
