{
  "title": "FO condemns Israel’s attempt to extend ‘so-called sovereignty’ over occupied West Bank",
  "author": "Abdullah Momand | Reuters | AFP",
  "content": "The Foreign Office on Thursday condemned Tel Aviv’s attempt to “extend its so-called ‘sovereignty’” over parts of the Occupied West Bank a day after a bill applying Israeli law to the occupied West Bank won preliminary approval from the Knesset.\n\nIsraeli lawmakers voted on Wednesday to advance two bills on annexing the occupied West Bank, barely a week after US President Donald Trump pushed through a deal aimed at ending Israel’s two-year military offensive in the Gaza Strip.\n\nIn a statement released today, the FO said, “Pakistan strongly condemns Israel’s attempt to extend its so-called ‘sovereignty’ over parts of the occupied West Bank, including illegal Israeli settlements, through a draft law introduced in the legislature of the occupying power.”Advertisements\n\n\n\n            Video Player is loading.Play VideoPauseLoaded: 0.00%0:00Remaining Time --:-UnmuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nThe FO said that these actions constituted a “flagrant violation” of international law, relevant United Nations Security Council resolutions, and the inalienable rights of the Palestinian people.\n\n“Such provocative and unlawful measures undermine ongoing efforts to achieve peace and stability in the region,” the FO said.\n\nIt called on the international community to take “urgent and decisive action” to halt these illegal steps and to hold the Israeli occupying forces accountable for their continued violations of international law.\n\n“Pakistan reiterates its commitment to working with regional and international partners to uphold the rights of the Palestinian people, including their right to self-determination, and to ensure peace, justice, and dignity for the Palestinians,” the FO said.\n\nThe FO also reaffirmed Pakistan’s unwavering support for the Palestinian cause, including the establishment of an independent, sovereign, viable, and contiguous state of Palestine, based on pre-1967 borders, with Al Quds Al Sharif as its capital.\n\nThe vote in the Israeli parliament on Wednesday was the first of four needed to pass the law and it coincided with the visit of US Vice President JD Vance to Israel.\n\nIsraeli Prime Minister Benjamin Netanyahu’s Likud party did not support the legislation, which was put forth by lawmakers outside his ruling coalition and passed by a vote of 25-24 out of 120 lawmakers. A second bill by an opposition party proposing the annexation of the Maale Adumim settlement passed by 31-9.\n\nMembers of Netanyahu’s coalition have been calling for years for Israel to formally annex parts of the occupied West Bank, territory to which Israel cites biblical and historical ties.\n\nIsrael argues the territories it captured in 1967 are not occupied in legal terms because they are on disputed lands, but the United Nations and most of the international community regard them as occupied.\n\nThe UN’s highest court in 2024 said that Israel’s occupation of Palestinian territories, including the West Bank, and its settlements there are illegal and should be withdrawn as soon as possible.\n\nThe Palestinian Authority exercises limited self-rule in some areas of the occupied West Bank.\n\nUS Secretary of State Marco Rubio on Wednesday warned Israel against annexing the West Bank, saying steps taken by parliament and settler violence threatened the Gaza peace deal.\n\n“I think the president’s made clear that’s not something we can be supportive of right now,” Rubio said of annexation as he boarded his plane for a visit to Israel.\n\nAnnexation moves are “threatening for the peace deal,” he told reporters.\n\n“They’re a democracy, they’re going to have their votes, and people are going to take these positions,” he said.\n\n“But at this time, it’s something that we … think might be counterproductive,” he said.\n\nAsked about increased violence by extremist Israeli settlers against Palestinians in the occupied West Bank, Rubio said: “We’re concerned about anything that threatens to destabilise what we’ve worked on.”\n\nBut Rubio voiced optimism overall for preserving the peace deal.\n\n“Every day there’ll be threats to it, but I actually think we’re ahead of schedule in terms of bringing it together, and the fact that we made it through this weekend is a good sign,” Rubio said.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23115844c66bbfe.webp",
  "retrievedAt": "2025-10-23T20:18:21.657Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950765/fo-condemns-israels-attempt-to-extend-so-called-sovereignty-over-occupied-west-bank",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T06:59:29.000Z"
}
