{
  "title": "Looting through fake ride offers spikes in Islamabad",
  "author": "Munawer Azeem",
  "content": "ISLAMABAD: Incidents of looting people in “short-term kidnapping” are allegedly increasing in the capital.\n\nSince the last week of September, police have registered five such cases but are reportedly reluctant to register another one that occurred recently, sources told Dawn.\n\nA victim of such an incident visited the Khanna police station twice to register her case, but the police gave her a cold shoulder and made ‘lame excuses’.\n\nTalking to Dawn, Mohammad Umer Saeed, son of the alleged victim, said his mother along with his sister, was waiting for a passenger vehicle on the Islamabad Expressway on Sunday when a car carrying three women stopped and called for passengers going to Gujar Khan. His mother and sister boarded the vehicle.\n\nAfter some time, the passengers inside the vehicle snatched a purse from the victim.\n\nWhen she raised an alarm, the suspects pushed her and her daughter out of the moving vehicle near Khanna and escaped. The purse contained a mobile phone and Rs2,000 in cash, he said.\n\nFollowing the incident, the victim and her daughter went to the Khanna Police Station, but the “police ignored them, pretending to be busy”.\n\nThey waited for the duty officer to listen to their complaint, but no one paid attention, the citizen said. After some time, the duty officer left the police station without hearing her case, forcing her to return to her hometown, Gujar Khan.\n\nThe next day (Monday), she returned to the police station with her son and submitted a written complaint to the duty officer. The officer took her to the station clerk (moharrar), who told her that the duty officer on duty the previous day was on leave and that the matter was his responsibility. The clerk accepted her complaint but did not provide any receipt, complaint number, or e-tag and asked her to return later.\n\nSince then, no one from the police station has contacted the family to inquire about the incident or inform them about any legal action.\n\nSources in the police said that since September 26, the capital police have registered five such cases. One case each was registered at the Secretariat and Tarnol police stations, where culprits looted Rs140,000 and Rs100,000 respectively.\n\nIn October, similar cases were reported at the Industrial Area, Secretariat and Khanna police stations, in which culprits looted Rs40,000, Rs80,000 and Rs300,000 respectively. The sources said that the gangs involved in these crimes operate with two distinct modus operandi. One group uses private cars to offer rides to people, while the other pretends to operate passenger vehicles.\n\nThe latter group also includes female accomplices who participate in the crimes and help lure victims. The gangs usually target people waiting at bus stops and pick them up under the pretext of taking them to their destinations before snatching their cash and valuables.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2308501516ad11d.webp",
  "retrievedAt": "2025-10-23T20:19:11.284Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950639/looting-through-fake-ride-offers-spikes-in-islamabad",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:58:27.000Z"
}
