{
  "title": "Explainer: How India, New Zealand and Sri Lanka can still make the Women’s World Cup semi-finals",
  "author": "Dawn.com",
  "content": "Three teams are chasing the last vacant spot in the ICC Women’s World Cup semi-final after South Africa, Australia and England booked their place during the knockout stage and finished top three in the league’s standings.\n\nIndia, Sri Lanka and New Zealand are chasing the coveted spot with four points each; Bangladesh and Pakistan are out of contention and at the bottom of the standings with two points each, with the latter crashing out of contention after a crushing defeat by South Africa on Tuesday.\n\nHow India can qualify (currently in fourth position; +0.526 NRR)\n\nIndia have two remaining matches against New Zealand on Thursday and Bangladesh on Sunday. If they win both, they progress to the semi-finals. Even if they win against New Zealand but not Bangladesh — which gives them six points and a total of three victories, they can still qualify for the semis.\n\nIf India lose to New Zealand but defeat Bangladesh, they will be relying on England defeating the White Ferns on Sunday in order to make the semis. Losing against both teams will mean India would crash out of a tournament they are hosting.\n\nIndia has registered two wins so far; an 88-run defeat to Pakistan and a 59-run win over Sri Lanka through the DLS method. The Women in Blue lost to England by four runs in a nail-biting encounter on home soil, and lost to South Africa by three wickets.\n\nHow New Zealand can qualify (currently in 5th position; -0.245 NRR)\n\nIn the event that New Zealand defeat both India and England in their remaining matches, they accrue a total of eight points and qualify for the semis.\n\nHowever, a win against India but a loss to England means the Kiwis will rely on Bangladesh to defeat India and their net run rate finishing higher than Sri Lanka (or Pakistan defeating Sri Lanka).\n\nOf the five matches the Kiwis have played so far, New Zealand has only won against Bangladesh by 100 runs. They lost to South Africa by 6 wickets and to Australia by 89 runs, while the matches against Pakistan and Sri Lanka were both washed out.\n\nHow Sri Lanka can qualify (currently in 6th position; -1.035 NRR)\n\nSri Lanka’s chances of securing a spot in the semis are slim and rely on other teams’ outcomes more than their own performance.\n\nThey would have to defeat Pakistan on Friday, require India to lose to both New Zealand and Banglades, and require New Zealand to lose to England for their net run rate to finish higher than the Kiwis.\n\nSri Lanka recorded their first win on Monday after edging out Bangladesh in a nerve-jangling finish after skipper Chamari Athapaththu took the ball herself and turned the game on its head.\n\nThey lost to England by 89 runs and to South Africa by 10 wickets through the DLS method, while the match against Australia was abandoned without a ball being bowled.\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/22193555b1fc83f.webp",
  "retrievedAt": "2025-10-23T00:26:35.821Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950576/explainer-how-india-new-zealand-and-sri-lanka-can-still-make-the-womens-world-cup-semi-finals",
  "dateList": "2025-10-23",
  "date_published": "2025-10-22T14:41:07.000Z"
}
