{
  "title": "Undefeated Rizwan slays yet another Indian opponent with first round win in MMA bout",
  "author": "Ahmed Ali",
  "content": "The record remains unblemished, the streak grows more formidable. MMA fighter Rizwan “The Haider” Ali, reinforced his status as kryptonite for Indian adversaries, systematically dismantling Rana Rudra Pratap Singh “The Rajput” to secure a first-round technical knockout at the Absolute Championship Akhmat in Dubai’s Agenda Arena on Thursday.\n\nThe victory marks his fourth win over an Indian opponent in two years — a perfect finishing rate he has maintained against all of them, keeping his pristine professional record intact at 11-0.\n\nThe tension was palpable from the start, a fuse lit long before the first punch was thrown. It manifested in a telling moment during the fighter introductions: Rizwan and Rudra Pratap (12-3) refused a glove touch, a silent acknowledgment that this was more than sport. This was conflict.\n\nFrom the opening bell, the clash was charged with the weight of the cross-border rivalry. Rudra Pratap, a 28-year-old force from Lucknow, shot for an immediate takedown, aiming to ground the aerial assault of the “Pakido Warrior”.\n\nBut Rizwan, a fortress of technique and power, sprawled perfectly, stuffing the attempt and seizing control.\n\nHe turned his opponent into the cage, a knee to the gut serving as a brutal punctuation before he slammed Rudra Pratap — who fought mostly at the bantamweight category — to the canvas.\n\nWhat followed was a cold, systematic dissection. Rizwan advanced through Rudra Pratap’s defenses with calm precision, securing a full mount — the king’s throne in ground combat.\n\nRudra Pratap — who has 11 finishes — tried to cling close, to survive the storm, but Rizwan, hailing from Rawalpindi, is a master of creating chaos in confined spaces.\n\nHe carved out room for his heavy hammer fists to descend. The concussive blows were a prelude to the final, relentless ground-and-pound that forced the referee’s intervention with just under two minutes left in the first round.\n\nThe victory was a statement of resurgence. The chip on Rizwan’s shoulder from a controversial split-decision win over Egypt’s Adham Mohamed was shattered, replaced by the definitive clarity of a violent finish.\n\nAs the arena roared, Rizwan climbed the cage, arms raised to a legacy he alone is building. The significance of the moment was further amplified when UFC superstar and middleweight champion Khamzat Chimaev, a revered figure in the combat sports world, greeted him cageside, offering a champion’s congratulations that signaled Rizwan’s arrival on the global radar.\n\nBut in a moment that transcended sport, Rizwan then turned from the adulation and embraced his fallen Indian rival, a powerful testament to respect that exists beyond the fray.\n\nThe pre-fight snub made the post-fight grace all the more profound. The warrior from Pakistan had spoken once again, not with words, but with the thunder of his fists.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23230432f2879a0.webp",
  "retrievedAt": "2025-10-23T20:16:28.487Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950802/undefeated-rizwan-slays-yet-another-indian-opponent-with-first-round-win-in-mma-bout",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T18:07:46.000Z"
}
