{
  "title": "PML-N leaders urge dialogue to resolve Balochistan issues",
  "author": "Saleem Shahid",
  "content": "QUETTA: PML-N leaders Nawab Jangayz Marri and Mir Dostain Khan Domki have expressed concern over the worsening law and order situation in Balochistan, calling for the immediate initiation of dialogue and reconciliation process to resolve issues being faced by the province.\n\nSpeaking to journalists at Domki House here, they criticised the provincial government and held Chief Minister Sarfraz Bugti responsible for the deteriorating situation. “Since Mr Bugti assumed the office of chief minister, law and order have started worsening,” they claimed.\n\nThe PML-N leaders praised Field Marshal Syed Asim Munir for restoring peace and guiding Balochistan towards development, but accused the provincial government of undermining his efforts. “Instead of focusing on improving governance, providing employment and reducing inflation, the provincial administration is involved in corruption, favouritism and mismanagement of public funds,” they alleged.\n\nBlame chief minister for worsening situation, poor governance\n\nJangayz Marri, who is chief of the Marri tribe and an MPA, said the PML-N leadership had recently met PM Shehbaz and briefed him on the province’s worsening political and security situation. “The prime minister assured us of effective steps,” he said.   He stressed that resolving Balochistan’s issues requires serious political engagement. “Peace and stability cannot be achieved without dialogue.”\n\nMr Marri also pointed to foreign interference and funding, including from India, in Balochistan’s affairs. “The provincial government cannot absolve itself merely by acknowledging this interference. If India is involved, we must act decisively to counter it,” he said.\n\nSenator Dostain Domki said the worsening situation in Balochistan is a direct result of the current failed policies. “Since the PPP came to power in 2008 and announced the Aghaz-i-Haqooq-i-Balochistan package, no meaningful progress has followed. Today, Balochistan is burning — businesses have shut down, train services are halted, and night-time transportation has stopped. Yet no one is addressing the people’s grievances,” Mr Domki said.\n\n“We have conveyed to the PM and PPP Chairman Bilawal Bhutto-Zardari our demand for an in-house change in Balochistan to improve the situation,” he said, emphasising that meaningful dialogue is the only way to achieve peace.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/230826034380c7b.webp",
  "retrievedAt": "2025-10-23T20:20:04.219Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950695/pml-n-leaders-urge-dialogue-to-resolve-balochistan-issues",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:57:42.000Z"
}
