{
  "title": "Trump pardons convicted Binance founder Zhao, White House says",
  "author": "Reuters",
  "content": "US President Donald Trump has pardoned convicted Binance founder Changpeng Zhao, a White House official said on Thursday.\n\nIn a statement, White House press secretary Karoline Leavitt said Trump had “exercised his constitutional authority by issuing a pardon for Mr. Zhao, who was prosecuted by the Biden Administration in their war on cryptocurrency.“\n\nBinance did not immediately respond to a request for comment.\n\nZhao, one of the most powerful people in the crypto world, had to step down as chief of Binance when the company agreed to a $4.3 billion settlement with the US government to end a years-long probe into misconduct at the world’s largest crypto exchange.\n\nTrump’s pardon of Zhao paves the way for the crypto mogul to return to the business he helped found in 2017. He has already served his time in prison after a judge sentenced him to four months.\n\nZhao’s pardon is the latest in a series Trump has doled out to executives convicted of white collar crimes.\n\nEarlier in April, he was appointed as a strategic adviser to the Pakistan Crypto Council (PCC), a press release issued by the Finance Division said.\n\nThe Pakistan Crypto Council (PCC) was officially launched earlier in April to “regulate and integrate blockchain technology and digital assets” into the country’s financial landscape.\n\nEarlier this year, Trump also pardoned the founders of crypto exchange BitMEX in connection with similar anti-money laundering violations and the founder of electric truck company Nikola, who was convicted of fraud. He has also commuted the sentence of the executive of the now-defunct start-up Ozy Media.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/232032025851aa5.webp",
  "retrievedAt": "2025-10-23T20:16:29.693Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950796/trump-pardons-convicted-binance-founder-zhao-white-house-says",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T15:36:35.000Z"
}
