{
  "title": "NA body orders climate ministry to tackle poor air quality",
  "author": "Jamal Shahid | Jamil Nagri",
  "content": "• Emission standards critically outdated, committee told\n• Official says Pak-EPA lacks financial, technical resources to do its job\n• Senate panel urges Centre to strengthen initiatives for climate-vulnerable Gilgit-Baltistan\n• Calls for sharing of early-warning data for disaster prevention in northern areas\n\nISLAMABAD / GILGIT: Critical inadequacies in Pakistan’s environmental oversight were highlighted on Wednesday, after a parliamentary committee heard that emission standards remain frozen at Euro-II levels, a benchmark long-abandoned by most nations.\n\nFollowing the revelation, the National Assembly’s Standing Comm­ittee on Climate Change and Environ­mental Coordination voiced serious concerns and directed the Ministry of Climate Change to present a mechanism for air-quality monitoring, along with a comprehensive action plan.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%0:00Remaining Time -0:00MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nDuring the sitting, the committee received a joint briefing from the ministry and the Islamabad Capital Terri­tory administration and was informed that country’s vehicle emission limits remain at Euro-II, far below modern Euro-V and Euro-VI standards.\n\nThe panel also noted that the current National Environmental Quality Standards only correspond to Euro-II levels, which have long lost relevance given deteriorating air quality and international shifts toward Euro-V and Euro-VI benchmarks.\n\n“There is no mechanism in place to check emissions or enforce compliance,” said MNA Munaza Hassan, who chairs the committee, characterising the situation as a fundamental failure of oversight.\n\nThe scale of the challenge became clearer when Islamabad Deputy Commissioner Irfan Nawaz Memon told the committee that the Pakistan Environment Protection Agency (Pak-EPA) — the body responsible for monitoring air quality — lacks both the financial resources and technical capacity to fulfil its mandate.\n\nHe said the agency had borrowed testing units from Punjab’s EPA, while the Capital Development Authority funded the purchase of five additional units.\n\nDirecting the climate ministry to prepare a comprehensive, time-bound air-quality improvement plan within four weeks, the committee called for increased funding and emphasised that the climate agenda must figure prominently in Pakistan’s foreign engagements.\n\nExperts invited to the meeting said targeted management actions could reduce air pollution by up to 30 per cent.\n\nThey proposed pragmatic interventions such as staggered school and office timings, improved road infrastructure and catalytic converters for older vehicles and motorbikes.\n\nFurther recommendations included incentivising retrofitting, mandating emission testing during vehicle transfers and transitioning to Euro-V-compliant fuels.\n\n“We should at least try to make Islamabad a model city,” Ms Hassan concluded.\n\nMore climate action in vulnerable GB\n\nMeanwhile, the Senate Standing Committee on Kashmir Affairs, Gilgit-Baltistan (GB) and SAFRON decided to recommend that the federal government enhance efforts to mitigate the impacts of climate change in the region.\n\nThe committee, chaired by Senator Asad Qasim, met in Skardu on Tuesday to discuss climate impacts, forest protection and the status of disaster-preparedness projects. “Gilgit-Baltistan is among the most vulnerable to climate change impacts,” Qasim told Dawn.\n\n“This year, GB experienced unprecedented climate change-induced disasters. Glaciers melting, cloudbursts and glacial-lake outburst floods badly affected GB.”\n\nQasim said the committee’s goal is to prevent future catastrophes and address challenges faced by the local population.\n\n“We don’t like to see these disasters again in future; we will work for mitigation of the climate change disasters,” he said. “We are listening to the challenges faced by local people from climate change impacts. We have come here to see for ourselves.”\n\nOfficials briefed the committee on forest protection efforts and were directed to share a working plan for forests.\n\nThey also called for incentives to create awareness and motivation for forest conservation within local communities.\n\nOfficials said a comprehensive legal framework is in place to protect forests and that 1.1 million cubic feet of illegal timber has been seized and a plan for its legal utilisation is being prepared.\n\nThey noted that residents often depend on wood for fuel because of a lack of electricity, but projects for clean energy generation are being completed on the prime minister’s special instructions.\n\nThe meeting was attended by Senators Nadeem Ahmed Bhutto, Nasir Mahmood and Ataulhaq, GB Additional Chief Secretary Waheed Shah, Director General GB Disaster Management Authority Zakir Hussain, Commissioner Baltistan Division Kamal Khan and Deputy Commissioner Skardu Hamza Murad.\n\nEarly warning systems\n\nA separate sitting of the Senate panel on the UNDP-funded GLOF-II and Early Warning System was also convened in Skardu to review disaster management and early-warning systems in GB and Khyber Pakhtunkhwa (KP).\n\nProject Head Muteeb Ali told members that of 292 early-warning stations established in GB and KP, 218 are fully functional; 77 face communication issues and civil work is underway at 23 others.\n\nThe committee directed full coordination among the Gilgit-Baltistan Disa­ster Management Auth­ority, district administrations, the Meteorological Department and the UNDP to make the system more effective.\n\nMembers also stressed that all relevant agencies should be given access to early-warning data and the dashboard to enable a timely, coordinated response during any emergency.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23071715f42656f.webp",
  "retrievedAt": "2025-10-23T20:20:28.273Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950704/na-body-orders-climate-ministry-to-tackle-poor-air-quality",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:57:27.000Z"
}
