{
  "title": "From hospital bed to cricket legend: How Sadiq Mohammad’s heroics saved Pakistan a Test match",
  "author": "Saeed Husain",
  "content": "A maiden career century at Melbourne in 1972-73 got Sadiq Mohammad, Pakistan’s dashing left-handed opening batsman, noticed in Tasmania, where Latrobe Cricket Club brought him over to both coach and play for them. He was the youngest of five brothers — Wazir, Raees, Hanif, Mushtaq and Sadiq — four of whom played Test cricket for Pakistan.\n\nPlaying cricket in Tasmania offered Sadiq a fat pay-check, and while the standard of cricket was still wanting (they were not yet part of the Sheffield Shield, Australia’s first-class circuit), this was a real chance for him to cement his status as a professional cricketer, at a time when playing for Pakistan still meant poor pay.\n\nIn 1974-75, the West Indies were coming to tour Pakistan, in one of Clive Lloyd’s first captaincy assignments, and recent debuts for two West Indies cricketers — Andy Roberts and Viv Richards. They were also on the back of a competitive 5-match series in India, which they had won 3-2.\n\nSadiq and Majid Khan had already established themselves as Pakistan’s premier opening partnership, and the Board of Cricket Control in Pakistan (BCCP, the precursor to the PCB) asked the former to come over for the two match Test series.\n\nHowever, Sadiq was told in Tasmania that he would not get paid for the matches he would miss while on national duty. Sadiq told Abdul Hafeez Kardar, president of the Board at the time, that for him to come back, the BCCP would have to pay both his Pakistan match fee, and the fees he would be missing from Tasmania.\n\nLatrobe would not have let Sadiq go so easily. Having won their maiden trophy in the 1973-74 season (also their first final) mainly due to their marquee player, the Pakistan call-up came right during the Australian cricket season. In that season, Sadiq had scored 542 runs at an average of 42, and claimed 67 wickets. In just the final game, he scored 162 and took 43-5 in the first innings, and 20-4 in the second.\n\nAs recorded in Summer’s Warriors, a compilation of cricket in North-Western Tasmania, for the 1974-75 season, “Latrobe’s chances took a big blow when Sadiq was called up by Pakistan selectors to meet the West Indians”.\n\n“Kardar ney zyada lift nahin karayi (he was not keen on it) and asked me to forgo the match fee and come back to play for our country,“ Sadiq told Dawn.com in a recent interview. “I reiterated that now I am a professional, and if the board was willing to pay for me to come back, only then I would,” he added.\n\nPakistan then went ahead with Agha Zahid, who ended up failing in the Lahore Test, his first and final match.\n\n“The Board was now ready to pay all fees as well as a return-ticket.”\n\nHowever, to the media, the Board gave a different story. In a Reuters wire titled, “Changed Plans”, published in The Canberra Times, it was reported that “Pakistani opener Sadiq Mohammad has changed his mind and returned from Australia to play for Pakistan in the Second Test against the West Indies, cricket officials said in Rawalpindi today.”\n\nSadiq then flew overnight from Hobart to Sydney, then from Singapore to Karachi, and reached a day before the Test fixture began on March 1.\n\nIn the first innings, Sadiq was out for 27, yet Pakistan declared at 406-8, with Wasim Raja getting his maiden Test century. A pitch invasion followed, causing the match to be suspended for almost two and a half hours.\n\nThe West Indies, in response, made 493, and this is where Sadiq’s call-up from Australia was about to be worth every single penny. However, tragedy nearly struck.\n\n“I was fielding at short-leg and told Intikhab Alam (captain) to move me. It was apparent that the West Indies were going to declare in a few overs,” Sadiq recalled to Dawn.com.\n\nIntikhab, however, stuck with his field.\n\n“He then bowled a full toss, and Vanburn Holder pulled it right at the top of my neck, behind my left ear,” said Sadiq.\n\nThings become slightly murky as to where Sadiq was standing and who hit him. Sadiq recalls that Holder struck him, which is reiterated in his brother Mushtaq Mohammad’s autobiography, Inside Out. The Guardian and ESPNcricinfo write that Bernard Julien, on the way to his second Test century, struck Sadiq.\n\nYet the scene was horrific. Mushtaq writes: “He was lying still but would have little nervous fits and I really thought he was going to go … The television cameras focused on me with my hands on my head looking horrified; I thought he was going to die.”\n\nHis brother, Hanif Mohammad, in his autobiography, Playing for Pakistan, writes: “I was giving expert comments on the match but my heart was no longer in the task, as I was really worried about him.”\n\nSadiq was rushed off the field and taken to Jinnah Hospital, around 20 minutes away, where Dr Omer Jooma, a renowned neurosurgeon, was in the operation theatre but came out to examine Sadiq.\n\n“On looking where the ball had struck, he said that had it been just slightly higher, I would have had my fateha read,” recalls Sadiq.\n\nDr Jooma gave him an injection, and some painkillers for the next day. Sadiq was taken back to the ground, but then saw that Pakistan had slipped to 90-4. The West Indies had a lead of 87 runs, so effectively, the hosts were batting at 3 with 4 down.\n\nThe next morning, Wasim Bari was run out on the first ball of the day.\n\n“So, in I walked at 90-5, taking Brufen to help with the pain. I had already made up my mind the previous evening that I would go out to bat, especially since no bone was broken. My mother also told me to go out and save the Test for Pakistan.”\n\n“That morning I was reading namaz and prayed that ‘Allah miyan please do a miracle that we save this Test’”.\n\nAfter Asif Iqbal was out on 77, the tail was exposed.\n\nSadiq then batted the first 6 deliveries of each over — for the 1974-75 season, Tests in Pakistan had eight-ball overs — and then looked for a single to give the tail-ender the strike for one or two balls. Sarfaraz Nawaz, Asif Masood, and Liaquat Ali, all three fast bowlers who barely batted, were now facing a relentless attack from Roberts and Holder.\n\nSadiq kept spitting out blood while batting, “At times, I felt loose-headed and would then take a minute or so to get myself in order.”\n\nIn the modern game, Sadiq would definitely not have been allowed to continue, but at the time this Test took place, helmets were not part of the game. Their first inclusion in Tests was still three years away.\n\nMeanwhile, Sadiq was not the only Pakistani fielding casualty. Wasim Raja had injured his ankle tendons while bowling and was off the field. When Liaquat Ali got out and Wasim was the only batter left. Sadiq was batting on 96.\n\nWasim then walked in wearing a plaster on his ankles. Sadiq had by now batted for over 5 hours.\n\nA Test century however, was not in the script. Confusion denied Sadiq his ton.\n\n“Zaheer Abbas came on as a runner for Wasim. I thought there were two balls left in the over, and hit the ball towards midwicket. Zaheer came running back for the third but I sent him back when he was two-thirds of the way down,” reminisced Sadiq.\n\n“To my surprise, the over was called, and I was on the striker’s end. I then crossed over and Wasim was bowled by [Lance] Gibbs in the next over. I was left stranded on 98.”\n\nThe Test however, was saved. There was less than an hour for the day to end, and when the West Indies came out, they had 25 minutes left to chase 170 runs. Zaheer Abbas bowled one over in which he conceded a no-ball, the solitary run of the innings.\n\n“I took a flight back to Australia that night, as part of my promise to return to Tasmania as soon as possible.”\n\nNews of Sadiq’s feat spread, with The Times of India writing: “Gallant Sadiq Saves Pakistan” and The Guardian proclaiming: “Sadiq Beats Pain to Force Draw”.\n\nBack in Australia, Sadiq narrowly missed out on claiming a second title for Latrobe despite an all-round performance in the final against Wynyard, where he scored 29 and took crucial wickets.\n\nThe youngest Mohammed brother had been defiant on two counts. Not only had he denied the West Indies a sure win, but his negotiations with the board and Kardar in particular, would be the precursor to the pay disputes between Pakistani cricketers and the board for years to come.\n\nThe author is Managing Editor of Folio Books. He holds an MPhil in Social Anthropological Research from the University of Cambridge.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2313482539bb5f9.webp",
  "retrievedAt": "2025-10-23T20:17:37.673Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950774/from-hospital-bed-to-cricket-legend-how-sadiq-mohammads-heroics-saved-pakistan-a-test-match",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T08:55:28.000Z"
}
