{
  "title": "UN rapporteur says Gaza truce plan is ‘insufficient against genocide’",
  "author": "AFP",
  "content": "JOHANNESBURG: UN rights expert Francesca Albanese on Wednesday criticised the US-brokered ceasefire plan in Gaza as “insufficient to address a  genocide of the Palestinian people by the United States and Israel”.\n\nThe plan is “absolutely inadequate and it doesn’t comply with international law”, said Albanese, the UN special rapporteur on human rights in the occupied Palestinian territories.\n\nThere needed to be commitment to “ending the occupation, ending exploitation of Palestinian resources, ending colonisation”, Albanese told reporters.\n\nIsraeli troops currently control around half of the coastal Palestinian territory.\n\n“It’s not a war, it’s a genocide where there is a determination to destroy a people as such,” said Albanese, who is mandated by the United Nations but does not speak on its behalf.\n\nUnited Nations investigators and several human rights groups, among them Amnesty International and Human Rights Watch, accuse Israel of committing genocide in Gaza, Israel has denied that charge as  “distorted and false”, while accusing the authors of antisemitism.\n\nAlbanese was in South Africa, which has laid a case of genocide against Israel at the International Court of Justice, to deliver a lecture on Oct 25.\n\nUnder US sanctions since July for her outspoken criticism of Israel, she will also present her next report to the United Nations from South Africa in the coming days.\n\n“The United States and Israel are leading not just the genocide in Gaza,” Albanese said.\n\n“They are leading to the erosion, the collapse of the multilateral system, threatening everyone who tries to advance justice and accountability,” she charged, mentioning four ICC judges also under US sanctions.\n\nRenewed discussions over the past months about a two-state solution to the Israel-Palestinian conflict have “been a pretence of doing something while the emergency was to discuss … how we stop the genocide,” she said.\n\nThe Italian lawyer said UN member states should be disengaging with Israel because they are “obliged not to aid and assist a state which commits wrongful acts”.\n\nThose “who still have ties with Israel, diplomatic, but especially economic, political and military ties, are all responsible in some measure”, she said.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f9587055cbe.jpg",
  "retrievedAt": "2025-10-23T20:19:47.538Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950686/un-rapporteur-says-gaza-truce-plan-is-insufficient-against-genocide",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:58:04.000Z"
}
