{
  "title": "Stocks lose 794 points on profit-taking",
  "author": "Muhammad Kashif",
  "content": "KARACHI: After two bullish sessions, the Pakistan Stock Exchange (PSX) witnessed considerable volatility on Wednesday, with the benchmark KSE-100 index dipping into negative territory towards the close amid profit-taking by investors.\n\nAccording to Topline Securities Ltd, the index experienced significant fluctuations throughout the day, hitting an intraday high of 816 points before falling by as much as 1,115 points. The KSE-100 eventually settled at 166,553.28, down 793.56 points, or 0.47 per cent.\n\nThe decline was primarily driven by substantial losses in key stocks, including Fauji Fertiliser, United Bank, MCB Bank, Habib Bank, and Fatima Fertiliser, which collectively accounted for a 647-point loss on the index. However, gains in companies like Pakistan Petroleum, Oil and Gas GDC, PSX, Bank of Punjab (BOP), and Sui Northern Gas Pipelines (SNGP) helped limit the overall decline, contributing 306 points to the index.\n\nMarket participation weakened, with trading volume dropping 13.76pc to 1.56 billion shares. The total value of traded shares also decreased by 3.08pc to Rs55bn. K-Electric was the most traded stock, with 241 million shares changing hands.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, noted that after two consecutive sessions of strong recovery, the market saw range-bound trading as investors took a more cautious approach. Although the KSE-100 briefly surpassed the 168,000 mark, profit-taking pushed the index back below 167,000.\n\nOn the macroeconomic front, the repatriation of profits and dividends surged year-on-year by 22.5pc to $159 million in September, although it dropped by 54.4pc on a month-on-month basis. Cumulatively, repatriations in the first quarter of FY26 increased by 85.8pc year-on-year, reaching $751.7m.Analysts predict that the KSE-100 index will likely consolidate within the 165,000-170,000 range in the near term, as investors balance profit-taking with selective buying ahead of the Monetary Policy Committee meeting scheduled for Oct 27.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/230748430013b75.webp",
  "retrievedAt": "2025-10-23T20:19:13.806Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950718/stocks-lose-794-points-on-profit-taking",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T02:04:12.000Z"
}
