{
  "title": "BCCI seeks to criminalise match-fixing ‘to protect cricket’",
  "author": "AFP",
  "content": "Indian cricket authorities have petitioned the country’s top court to make match-fixing a criminal offence in a bid to ramp up the pressure on illegal bookmakers and bent players.\n\nThe Board of Control for Cricket in India (BCCI), the world’s richest cricket body, has argued to the Supreme Court that “the act of match-fixing constitutes a criminal offence”.\n\nThe BCCI said it had stepped up to protect the sport, in court documents seen by AFP on Thursday.\n\n“The prevalence of corrupt practices in cricket matches has an adverse impact on the game and undermines the integrity of the sport,” the BCCI wrote in documents filed with the court registrar on October 14.\n\nThe BCCI’s legal argument is that match-fixing counts as cheating by deception — an existing offence under the Indian Penal Code (IPC) — and therefore should be counted as a crime.\n\nThe appeal stems from allegations of match-fixing during a state cricket league in 2018-2019 in Karnataka involving six people — including two players, the coach and team owner.\n\nThe High Court in the southern state dismissed it as a criminal case in 2022.\n\nThe first major scandal in Indian cricket to make headlines erupted in April 2000 when police intercepted calls between bookmakers and South Africa captain Hansie Cronje during his team’s tour of India.\n\nCronje confessed to throwing matches and named India’s then captain Mohammad Azharuddin as the person who introduced him to bookmakers.\n\nThe BCCI instituted its own anti-corruption codes in 2019, which give the board the power to issue fines and lifetime bans.\n\n“Public confidence in the authenticity and integrity of the sporting contest is vital,” the code reads, submitted to the court.\n\n“If that confidence is undermined, then the very essence of cricket will be shaken to the core.”\n\nAnother fixing controversy broke out in the Indian Premier League in 2013 when players and officials from Rajasthan Royals and Chennai Super Kings were found involved in spot-fixing and betting activities.\n\nKey players were banned for breaching the BCCI’s code of conduct and the teams suspended for two years.\n\nNeighbouring Sri Lanka introduced tough laws to tackle match-fixing in 2019, including up to 10 years in jail and fines of 100 million rupees ($333,000).\n\nThat came after then sports minister Harin Fernando said the game was riddled with graft “from top to bottom”.\n\nSri Lanka’s former spin bowler Sachithra Senanayake became the first to be prosecuted under the law in June. He denies wrongdoing.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/231624128acefad.webp",
  "retrievedAt": "2025-10-23T20:17:09.219Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950781/bcci-seeks-to-criminalise-match-fixing-to-protect-cricket",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T11:24:32.000Z"
}
