{
  "title": "After Zohran Mamdani, another South Asian Democrat makes waves in US",
  "author": "Anwar Iqbal",
  "content": "FAIRFAX (Virginia): Much like in New York, where droves of Indian- and Pakistani-American voters are backing Zohran Mamdani in the mayoral race, South Asian voters in Virginia also appear united in their choice for lieutenant governor — Ghazala Hashmi.\n\nHashmi, an Indian Muslim from Hyderabad with family ties to Karachi, has maintained close relations with both the Pakistani- and Indian-American communities. Those links, community leaders say, have helped her draw rare across-the-board support.\n\nHer campaign’s focus on education, healthcare, and immigrant representation resonates with both South Asian communities, who see in her a shared story of migration and belonging.\n\n“Pakistanis living in the United States should understand that for all practical purposes, they are Americans. Their attachment to Pakistan is emotional,” said Faiz Rahman, a Fairfax resident and a former staffer at the Voice of America’s Urdu Service.\n\nGhazala Hashmi’s campaign banking on across-the-board support from Pakistani- and Indian-Americans to secure Virginia Lt Governor seat\n\n“Her being of Indian origin is of little consequence for us.”\n\nShopkeeper Kuldip Singh expressed similar sentiments. “And not because she is an Indian,” he said. “I would vote for her because she is a Democrat — and Democrats are good for immigrants.”\n\nThe race has tightened in recent weeks, with Hashmi now holding a narrow 44pc-43pc lead over her Republican rival, John Reid, down from 46pc-36pc in July.\n\nThe contest briefly took an unusual turn when Reid, frustrated by Hashmi’s refusal to debate, staged a 40-minute YouTube debate against an AI-generated version of her. Democrats dismissed the stunt as a “shoddy gimmick”, but it appears to have resonated with some voters.\n\n“If you are a candidate, you cannot run away from political debates,” said Mansoor Qureshi, a Republican supporter. “People who plan to vote for her should reconsider.”\n\nHashmi, who has served in Virginia’s State Senate since 2020, was born in India, but raised in Georgia. She has often spoken about her experience as an immigrant and a Muslim woman in American politics.\n\n“I had to wonder whether, after living here nearly fifty years, I had a home anymore — whether I was welcome here,” she said after her 2019 election. “And I had to prove that answer, not just for myself, but for so many people who feel marginalised.”\n\nThat sense of shared struggle appeals to South Asian immigrants, who see their own life stories reflected in hers.\n\n“I am, and I plan on voting for Democrats down the ballot in the midterms,” said Hassan, an NGO-worker from Washington. “People like Ghazala remind us that this country belongs to everyone willing to work for it.”\n\nHashmi won the Democratic nomination for lieutenant governor in June, becoming the first Muslim and the first Indian-American to appear on the ballot for a state-wide office in Virginia. She defeated five other candidates to secure the nomination.\n\n“I’m supporting Senator Hashmi for lieutenant governor because I know she will stand for our values and our hard-fought Democratic accomplishments,” said State Senator Kannan Srinivasan of Loudoun, Va. “With her proven track record in improving education, the economy, and healthcare, she will continue to bring the best for Virginians.”\n\nCongressman Ro Khanna also endorsed her, saying, “I am excited to support State Senator Hashmi for lieutenant governor. Ghazala will fight tirelessly for our shared values — women’s reproductive freedom, strong public schools for all children, safe streets without fear of gun violence, and an economy where every family can thrive.”\n\nHashmi will now face Republican Reid, the first openly gay man to receive a major party’s endorsement for state-wide office in Virginia. He became the de facto nominee after his primary opponent withdrew from the race.\n\n“The Republican choice is bad — by default, Hashmi is a better candidate,” said Zafar Iqbal, a health researcher. “He is openly, not only anti-immigrant, but also anti-Black. Democratic planks that favor minorities, such as health insurance, will be removed under his policies.”\n\nIf elected, Hashmi would become the first Muslim and Asian American to hold statewide office in Virginia — a breakthrough that both Indian- and Pakistani-American communities are watching with hope.\n\nPublished in Dawn, October 23rd, 2025\n\nAnwar Iqbal is a correspondent for Dawn, based in Washington, DC.\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23080641c032644.webp",
  "retrievedAt": "2025-10-23T20:20:09.139Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950672/after-zohran-mamdani-another-south-asian-democrat-makes-waves-in-us",
  "dateList": "2025-10-23",
  "date_published": "2025-10-23T01:57:34.000Z"
}
