{
  "title": "ADB pledges $1.5 bln for reconstruction, resilience support to Pakistan",
  "link": "https://www.app.com.pk/national/adb-pledges-1-5-bln-for-reconstruction-resilience-support-to-pakistan/",
  "date_published": "2023-01-09T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP): The Asian Development Bank (ADB) on Monday pledged a total $1.557 billion for climate and disaster risk reconstruction as well as resilience support for Pakistan.\nThe pledge was announced at the International Conference on Climate Resilient Pakistan, co-hosted by Prime Minister Shehbaz and United Nations Secretary-General Antonio Guterres in Geneva, Switzerland, said an ADB press release.\nAddressing the conference, ADB Vice President Shixin Chen said going forward, the ADB would reprioritize up to $1 billion for climate and disaster risk reconstruction as well as resilience support over the next three years.\nThe key sectors of support included agriculture and natural resources, urban services, social protection, health, and public financial management, he added.\nShixin Chen said the ADB welcomed the continued efforts with development partners on co-financing to maximize the impact of their support to Pakistan.\n“Beyond our contribution to the Post-Disaster Needs Assessment (PDNA) and the government’s 4RF, we approved a $557 million emergency flood-assistance package to Pakistan on top of a $1.5 billion counter cyclical programme, which also partly supports social protection and food security in flood-affected areas.”\nMeanwhile, sizable additional co-financing had been mobilized, he added.\nHe also congratulated on the timely completion of the Resilient Recovery, Rehabilitation, and Reconstruction Framework (4RF) derived from the PDNA, which demonstrated the strong leadership of the Government of Pakistan with the joint efforts of development partners.\nHe highly commended the ownership of both national and provincial governments being well embedded in the framework.\nPakistan, he said, despite its very low carbon emissions, was one of the countries most affected by extreme weather events. The floods highlighted the importance of building back better with climate resilience.\nShixin Chen said as Asia and the Pacific’s climate bank, the ADB was aiming to deliver $100 billion in cumulative climate financing by 2030.\n“I recognize the urgency of our collective action to support Pakistan on its path to recovery and disaster resilience.”",
  "retrievedAt": "2025-08-11T05:42:08.269Z"
}
