{
  "title": "Hajj Expo 2023: Saudi Arabia revives Pakistan’s pre-pandemic Hajj quota",
  "link": "https://www.app.com.pk/national/hajj-expo-2023-saudi-arabia-revives-pakistans-pre-pandemic-hajj-quota/",
  "date_published": "2023-01-09T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 09 (APP): Saudi Arabia has revived Pakistan’s pre-pandemic Hajj quota of 179,210 pilgrims with the draft of annual Hajj agreement removing the upper age limit of 65 years.\nThe Ministry of Religious Affairs and Interfaith Harmony’s Spokesperson Muhammad Umar Butt informed APP that Minister Mufti Abdul Shakoor had requested the Saudi authorities to further reduce the mandatory Hajj expenses.\nIt would help lessen the maximum burden on the Pakistani pilgrims who wanted to perform Hajj, on which the Saudi Minister of Hajj and Umrah Dr Tawfiq Fawzan Al Rabiah gave a positive indicator into the matter, he added.\nThe spokesperson said the minister who is on an official visit to Jeddah, Saudi Arabia these days to attend the four-day Hajj Expo 2023 – a major exhibition and conference – met Osama Samkari, chairman of a bus transport company Nicaba Sayarat and discussed provision of better travel facilities to the pilgrims in Mina, Arafat and Muzdalifah.\nHe informed that Mufti Abdul Shakoor met with his Saudi counterpart besides other several important figures and visited various institutions.\nHe said the participants briefed on modern Hajj arrangements and facilities in the light of Saudi Vision 2030 in the conference.\nHe said this year, it would be mandatory for Hajj applicants to have a bank account in Pakistan and a machine readable passport which should not be expired before December 26, for Hajj 2023.\nUmar Butt said Hajj applications would likely to be called by the end of February and religious affairs minister would announce the final Hajj Policy 2023 after the cabinet’s approval.\nOn this occasion, Secretary Religious Affairs Dr Aftab Akbar Durrani, Saudi Ambassador to Pakistan Nawaf bin Said Al Maliki, Hajj Director Sajid Asdi and representative of Hajj Organisers Association of Pakistan (HOAP), an association of private Hajj scheme operators, were also present with the minister.",
  "retrievedAt": "2025-08-11T05:42:02.891Z"
}
