{
  "title": "OGRA for ensuring ‘conical baffles’ in gas geysers",
  "link": "https://www.app.com.pk/national/ogra-for-ensuring-conical-baffles-in-gas-geysers/",
  "date_published": "2023-01-09T08:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP):A spokesman for the Oil and Gas Regulatory Authority (OGRA) on Monday stressed the need for installation of ‘conical baffles’ in geysers to ensure efficient and sensible use of scarce gas in the peak winter season.\n“The federal government has decided to install conical baffles in geysers to ensure less consumption of gas. Under this decision, Sui Northern and Sui Southern Gas Companies have requested OGRA to amend their contracts for the supply of natural gas and RLNG for domestic and commercial use,” Spokesman Imran Ghaznavi said in a news release.\nAccordingly, he said, a public hearing was in progress here at the OGRA Head Office on the petitions filed by the Sui companies.\nHe said OGRA had invited all consumers, the general public and interested/affected persons and parties through newspaper advertisements, in view of the request of the gas companies.\nEarlier, the spokesman advised consumers to ensure careful use of gas appliances including heaters, geysers and stoves to avoid any untoward incidents.\n“Gas heaters and stoves pose serious health risks and are the main cause of many fatal incidents, so due care is needed in the use of gas appliances,” he said.\nImran Ghaznavi said carbon monoxide was colourless and odourless, adding “high levels of carbon monoxide in the air are very dangerous and may cause people to pass out or even die.”\nIn the winter season, he said people should consider ‘safe alternative’ ways of keeping themselves warm and remain extra careful, especially while using indoor gas appliances.\nHighlighting necessary precautionary measures, the spokesman suggested regular service of gas heaters, ensuring appropriate ventilation, and keeping away all flammable materials like clothes at least one meter away from the heater.\nHe asked consumers to never leave a gas heater running when while going to bed.The spokesman said consumers must switch off gas appliances in case of gas load shedding or blackout.\n“Never use or store solvents, aerosols or pressure pack cans near a gas heater – even if the heater is turned off, the pilot light may still be on,” he further said.\nHe was of the view that consumers should never dispose of rubbish such as tissue papers, cotton buds or other things in a gas fire as it could affect combustion and produce dangerous pollutants.\nBesides, he said, consumers should avoid using outdoor appliances inside like barbeques and patio heaters. “And never use or store a gas cylinder indoors.”\nHe said the authority had initiated a safety campaign through its stakeholders and licensees aimed at educating the general public to ensure safety as the priority to avoid loss of precious lives and property.",
  "retrievedAt": "2025-08-11T05:42:21.826Z"
}
