{
  "article_id": "2025-02-08_942e379776282ae04aa72ad83755b55e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/finance-minister-attends-funeral-ceremony-of-late-prince-karim-al-hussaini-aga-khan-iv/",
    "retrieved_at": "2025-08-27T12:30:15.820Z"
  },
  "metadata": {
    "title": "Finance Minister attends funeral ceremony of late Prince Karim al-Hussaini Aga Khan IV",
    "author": null,
    "date_published": "2025-02-08T12:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 08 (APP): Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb attended the funeral ceremony of late Prince Karim al-Hussaini Aga Khan IV, the 49th hereditary Imam of the Shia Ismaili Muslims, in Lisbon on Saturday. According to press release issued by finance ministry here, during the meeting with Prince Rahim al-Hussaini Aga Khan V, the 50th Imam of the Shia Ismaili Muslims, the Minister expressed heartfelt condolences on the sad demise of late Prince Karim Aga Khan on behalf of the President, the Prime Minister and people of Pakistan. The Minister lauded the services of late Prince Karim Aga Khan and the Aga Khan Development Network which has a focus on development of human capacity, generating economic growth, building resilient communities and honoring cultural heritage. He said the sad demise of Prince Karim al-Hussain was a monumental loss not only for his family, friends and followers but also for the underprivileged and destitute people of the world. He recalled late Prince Karim Agha Khan's special attachment to Pakistan and its people. The government of Pakistan declared 8th February, 2025 as the day of national mourning on the occasion of the funeral of Prince Karim Aga Khan, the press relase said adding Pakistani flag will remain on half-mast in the country and at Pakistan Missions abroad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}