{
  "article_id": "2025-10-02_a424a64905e7c03f4b132050f99ea618",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-by-election-on-oct-30-following-shibli-frazs-disqualification/",
    "retrieved_at": "2025-10-11T23:45:22.840Z"
  },
  "metadata": {
    "title": "Senate by-election on Oct 30 following Shibli Fraz’s disqualification",
    "author": null,
    "date_published": "2025-10-02T18:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 249,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 2 (APP):The Election Commission of Pakistan (ECP) announced on Thursday that a by-election will be held on October 30 to fill the vacant Senate General seat, got vacated due to the disqualification of Senator Shibli Fraz. The decision comes in the wake of Fraz's disqualification from office, prompting the need for a replacement through electoral process. According to an official notification, polling will take place on Oct 30 in the Khyber Pakhtunkhwa Assembly building. The ECP stated that a public notice regarding the election will be issued on October 7, marking the start of the electoral process. Candidates can submit their nomination papers from October 08 to Oct 09. The lists of nominated candidates will be published on October 10. The scrutiny of these papers will take place by October 13, while appeals against the acceptance or rejection of nominations must be submitted by Oct 15. The last date for disposal of appeals will be October 17. The Election Commission of Pakistan has appointed Provincial Election Commissioner Khyber Pakhtunkhwa, Saeed Gul, as the Returning Officer for the upcoming Senate election in the province. According to the official notification, several senior officials will serve as polling officers to oversee the electoral process. These include Muhammad Farid Afridi, Joint Provincial Election Commissioner (Elections); Muhammad Nadeem Khan, Director (Elections), Provincial Election Commission; Zaheer Ahmed, Deputy Director (Admin), PEC Khyber Pakhtunkhwa; Sohail Ahmed, Deputy Director (MCO), PEC; Fahad Ali Shah, Deputy Director (Elections), PEC; and Muhammad Amjad, Deputy Director (Law), PEC.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}