{
  "article_id": "2025-10-02_37aa061372cbd6097d8b1b4be4103092",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pti-protest-case-hearing-deferred-again-chairman-yet-to-record-statement-after-10-months/",
    "retrieved_at": "2025-10-11T23:44:54.348Z"
  },
  "metadata": {
    "title": "PTI protest case hearing deferred again, Chairman yet to record statement after 10 months",
    "author": null,
    "date_published": "2025-10-02T21:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 234,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 02 (APP):The District and Sessions Judge, Nasir Javed Rana, once again postponed proceedings on a private complaint filed by Pakistan Tehreek-e-Insaf (PTI) regarding alleged deaths and injuries during the party's protest on November 26. During Thursday's hearing, PTI Chairman Barrister Gohar Khan was unable to record his preliminary statement, a mandatory step for further progress in the case. His counsel informed the court that senior lawyer Latif Khosa was occupied in Lahore, requesting an adjournment. Accepting the request, the court fixed November 18 as the next date of hearing. According to court records, PTI has so far sought adjournments more than ten times in this matter. At least eight hearing dates have passed without any proceedings. Nearly ten months since the case was filed, Barrister Gohar has not recorded his initial testimony, which is required before the court can move forward. The party has presented various reasons for delays, including the need for death certificates, medical records, and the unavailability of its legal team. However, no substantial progress has been made in the proceedings. Earlier, a separate petition filed by a PTI worker seeking registration of an FIR over the same protest incidents was dismissed. Similarly, a plea against an alleged raid at the Khyber Pakhtunkhwa House was also rejected by the court. With the latest adjournment, the case remains at a standstill, awaiting the PTI chairman's testimony scheduled for November 18.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}