{
  "article_id": "2025-10-02_af7b5b6bdb034d4726a304907ccd4942",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pre-feasibility-of-karachi-hyderabad-motorway-project-completes/",
    "retrieved_at": "2025-10-11T23:44:28.857Z"
  },
  "metadata": {
    "title": "Pre-feasibility of Karachi-Hyderabad motorway project completes",
    "author": null,
    "date_published": "2025-10-02T13:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 373,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 2 (APP):The National Engineering Services Pakistan (NESPAK) has completed the pre-feasibility study of the newly proposed Karachi-Hyderabad Motorway (M-10), a major infrastructure project aimed at improving connectivity across Sindh and beyond. According to documents available with Wealth Pakistan, the National Highway Authority (NHA) engaged NESPAK to carry out the detailed design and commercial feasibility study on a fast-track basis. NESPAK successfully completed the pre-feasibility within the stipulated time. The NHA has proposed a 168-kilometer, six-lane motorway that would connect four major highways - N-25, N-5, N-55, and M-9. The M-10 will directly link Karachi with the under-construction M-6 Motorway at Jamshoro, passing through the Kirthar Mountain Range. The M-6 project, estimated at Rs363 billion, is currently in the tendering stage after approval by the Executive Committee of the National Economic Council (ECNEC). Following the completion of pre-feasibility, NESPAK has begun work on the final commercial feasibility study, which is currently underway. As per initial estimates, the M-10 project is expected to cost around Rs254 billion. It will be built in two sections: Section-I (150 km) will start from the endpoint of M-6 at Hyderabad and extend to Hub Chowki, while Section-II (18 km) will run from Hub Chowki to ICI Chowk in Karachi, partly elevated and partly at grade. The six-lane motorway will feature 10 interchanges and be designed for speeds of 60, 80, and 100 km per hour. NHA spokesperson Mazhar Hussain told Wealth Pakistan that once NESPAK completed the commercial feasibility, PC-I and PC-II would be prepared for board approval before the matter is forwarded to ECNEC for final clearance. He said the project would significantly improve road connectivity within Sindh and also link the province directly to Balochistan and Punjab. The motorway, he added, will enhance trade and transportation efficiency nationwide. Hussain further noted that the M-10 would help to divert heavy goods transport away from Karachi's main arteries, thereby reducing pressure on urban traffic. \"Under this plan, a direct high-speed link between the port and the national motorway network will bypass city traffic, automatically easing the traffic load in Karachi,\" he explained. He emphasized that both the M-6 and M-10 motorway projects would serve as catalysts for economic growth by improving logistics and connectivity across the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}