{
  "article_id": "2025-10-02_fb42cce82c7d89c5ace302d0581d4d2d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rubina-khalid-announces-acceleration-of-benazir-hunarmand-programme/",
    "retrieved_at": "2025-10-11T23:46:56.807Z"
  },
  "metadata": {
    "title": "Rubina Khalid announces acceleration of Benazir Hunarmand Programme",
    "author": null,
    "date_published": "2025-10-02T15:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 425,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 02 (APP):Chairperson Benazir Income Support Programme (BISP) Senator Rubina Khalid has said that work on the Benazir Hunarmand Programme has been started on a fast pace to provide skills and livelihood opportunities to deserving families. She said special measures are being taken to ensure that up to 60 percent of beneficiaries from Balochistan are included, making it a milestone initiative for uplifting underdeveloped regions. Addressing a press conference in Islamabad, Senator Rubina Khalid dismissed negative propaganda against BISP, stressing that the programme is a lifeline for millions of poor families rather than a political tool. She said she would not indulge in political debate but focus on the programme's performance and impact. Highlighting BISP's major initiatives, she said that through the Kafaalat Programme, financial support is reaching 10 million families, benefiting nearly 60 million citizens nationwide. \"For the wealthy, this amount may not mean much, but for the poor, it is of immense value,\" she remarked, emphasizing that the programme should not be looked down upon as it embodies the vision of Shaheed Benazir Bhutto, who wanted marginalized communities to live with dignity. She noted that BISP is simultaneously running the Kafaalat, Nashonuma, . Stipends and Hunarmand programmes. Speaking about the Nashonuma Programme, she said a healthy mother is the foundation of a healthy society. So far, 3.6 million mothers have been registered, and an Aga Khan University study has recorded a 3.6 percent decrease in child stunting nationwide, while stunting among children under 20 months has declined by 20 percent. She cautioned that if stunting is not addressed in the first two years of life, it becomes irreversible. Discussing the Education Stipends Programme, Senator Khalid said it was launched in 2012 and has enabled 17 million children to attend school. She added that 216 billion rupees have already been spent on children's education, and the results are evident. This year, 503 students from across the country secured top grades in matriculation examinations, including several who took first positions in their boards. She said that the Kafaalat Programme remains the backbone of BISP, providing regular cash support to the poorest households. The administrative cost of the entire programme is just one percent, while the remaining 99 percent goes directly to beneficiaries. Concluding her remarks, Senator Rubina Khalid said the Pakistan People's Party has always respected state institutions and sought to strengthen them. She reaffirmed that BISP, through its multiple initiatives, is not only serving millions of underprivileged families but also carrying forward the vision of Benazir Bhutto for an inclusive and dignified society.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}