{
  "title": "ICC honors PEC with ICC Global Award-2023",
  "link": "https://www.app.com.pk/national/icc-honors-pec-with-icc-global-award-2023/",
  "date_published": "2023-12-10T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):International Code Council (ICC) honored the Pakistan Engineering Council (PEC) with the ICC Global Award-2023 during the United Nations COP28 Climate Conference in Dubai on Friday.\nA four-member PEC delegation led by its Chairman Engr. Muhammad Najeeb Haroon, Dr. Nasir Mahmood Khan, Registrar PEC, Prof. Dr. Sarosh Hashmat Lodi, Convener PEC Technical Committee and Mr. Faiz ul Sibtain Secretary to Committee PEC/ Focal Person to ICC participated in the event, said a news release.\nMarisa Lago, Under Secretary US Department of Commerce along with Judy Zakreski, Senior Vice President of ICC Global Operations presented the prestigious ICC Global Award -2023 to PEC Chairman and delegation.\nWhile congratulating the PEC, she appreciated the PEC’s national role in updating the Building Code of Pakistan along with the development of the Green Building Code of Pakistan-2023 including the provisions of Rainwater Harvesting for Buildings.\nShe also acknowledged the serious efforts put forth by Pakistan to contribute to the global sustainability agenda to decarbonize the built environment in Pakistan by adopting and implementing these standards.\nThe Chairman of PEC ensured with his commitment that PEC being a global partner of ICC is very much conscious of working further with local stakeholders in the public and private sector including the financial support of national/ international organizations to enforce these codes through capacity building, policy making to incentivize the society by the government for conservation of energy, water and to reduce adverse impact of climate change on built environment in Pakistan.\nThe ceremony was globally live-streamed during the session on “Decarbonizing the built environment: Building Codes and Capacity Building for implementation and enforcement”.\nThe event was very well participated by the international community and relevant experts attending the UN COP28 Climate Conference. This prestigious award is a great honour not only for PEC but also for Pakistan, particularly the engineering fraternity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:56:51.593Z"
}
