{
  "title": "Founder’s legacy upheld: Pakistani govt, nation stands firm on Palestine issue; says Ashrafi",
  "link": "https://www.app.com.pk/national/founders-legacy-upheld-pakistani-govt-nation-stands-firm-on-palestine-issue-says-ashrafi/",
  "date_published": "2023-12-10T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): Prime Minister’s Special Representative on Religious Harmony and Pakistani Diaspora in the Middle East and Islamic Countries, Hafiz Muhammad Tahir Mahmood Ashrafi, on Sunday asserted that the government of Pakistan and the nation had remained steadfastly united on the issue of Palestine since day one.\nSpeaking at a press conference held at the Press Information Department, he emphasized that on this International Human Rights Day, he aimed to spotlight Israeli atrocities in Gaza at the global stage.\nAshrafi who is also the Chairman of Pakistan Ulema Council underlined that both Palestine and Kashmir were not only issues of humanity but also vital concerns for the Muslim Ummah. He stated that Pakistan had consistently shown unwavering support for Palestine throughout its history.\nHe emphasized the significance of acknowledging the vision of Pakistan’s founder, Quaid-e-Azam Muhammad Ali Jinnah, who advocated for an independent and sovereign Palestine state with Al-Quds as its capital.\nAshrafi said Caretaker Prime Minister Anwaar-ul-Haq Kakar reaffirmed this position at the recent Arab-Islamic Summit in Riyadh, aligning with Pakistan’s consistent support for the two-state solution expressed in OIC meetings from 2004, 2006, and preceding years.\nFollowing the Gaza events on October 7, Caretaker Prime Minister Anwaar-ul-Haq Kakar, Foreign Affairs Minister Jalil Abbas Jilani, and Chief of Army Staff General Syed Asim Munir had actively engaged in unwavering efforts for peace-building and voicing their concerns against Israeli aggression in Palestine at all the relevant forums globally.\nEmphasizing Pakistan’s stance in the Organization of Islamic Cooperation (OIC) and the United Nations, he said Pakistan highlighted the nation’s call for the establishment of a tribunal to address Israeli crimes in Gaza.\nHe disclosed that Pakistan, among the first three countries, promptly provided relief goods to Palestine, and the government subsequently doubled the relief package under the directives of the prime minister and the army chief.\nFurthermore, he mentioned Pakistan’s diplomatic efforts in addressing the Palestine issue through backdoor channels with friendly countries.\nDiscussing historic perspective on the two-state solution, Ashrafi highlighted its initial proposal and unanimous agreement during the 2002 Arab League meeting in Beirut, followed by endorsement in the 2004 OIC meetings in Malaysia and Iran. In 2006, the United Nations also adopted the solution, albeit not accepted by Israel, he added.\nDuring this period, certain OIC member countries forged diplomatic ties with Israel, exercising autonomy in their foreign policies. He said Pakistan respected their foreign policies, and consistently refrained from intervening in the internal affairs of other nations. It should be noted that, as of the present date, Pakistan had not accepted Israel and maintained no diplomatic relations with it, he added.\nAshrafi emphasized that since 2002, all political parties in successive Pakistani governments, with the inclusion of various religious groups, supported this solution. He said that grounded in international legitimacy, UN resolutions, UN Security Council resolutions, and the interests of Arab countries, Pakistan consistently backed this peace formula without opposition in OIC meetings.\nHe pointed out that there were certain elements objecting to this agreed peace formula mentioning that the Hamas movement recently expressed support for the two-state solution, as stated by its leader, Ismail Haniyeh, and his assistant Khaled Mashal, in a press announcement in Doha.\nAshrafi expressed concern that an unknown conspiracy might aim to distance Pakistan from Arab and Islamic countries.\nHe clarified that Pakistan was fostering positive relations with brotherly Islamic nations, which had a favourable impact on Pakistan’s economic conditions.\nHe highlighted recent financial cooperation and investment agreements with the United Arab Emirates, Kuwait, and Saudi Arabia as evidence. Additionally, he mentioned that other countries, including Qatar, had expressed interest in investing in Pakistan in the near future.",
  "retrievedAt": "2025-08-11T10:56:33.048Z"
}
