{
  "title": "Open burning of waste in Pakistan causing smog; threat to air quality, public health",
  "link": "https://www.app.com.pk/national/open-burning-of-waste-in-pakistan-causing-smog-threat-to-air-quality-public-health/",
  "date_published": "2023-12-10T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): The opening burning of agricultural, industrial and municipal waste in Pakistan is posing a serious risk to air quality and public health as it was causing smog in the region.\nHazardous emissions, including particulate matter, dioxins, and Volatile Organic Compounds, contribute to smog, leading to respiratory issues and cardiovascular problems.\nRecognizing the urgency, the Institute of Urbanism (IoU) and the Royal Academy of Engineering (RAE) jointly organized an X (formerly Twitter) Space to highlight the impact of open waste burning on smog and its threats to health and the environment.\nWith 48.5 million tons of annual municipal waste, cities like Islamabad face challenges in sustainable waste management. Inefficient waste collection strategies result in waste accumulation and open burning, especially in areas lacking proper services.\nThe open burning of waste is a prevalent practice in numerous cities across Pakistan. However, there is a scarcity of documented data pinpointing the areas where this practice poses the most significant issues or the underlying reasons for burning municipal waste.\nA recent survey conducted by IoU in Islamabad and Lahore revealed that a majority of respondents were uninformed about any existing laws against this practice, as well as the environmental or health hazards associated with it, said Ayesha Majid, Senior Program Coordinator at IoU, in her introductory remarks.\nWaste burning, a major source of toxic gases and black carbon, occurs in diverse settings, posing health and safety risks.\nOften hidden and seasonal, it lacks clear regulations and enforcement. The Royal Academy of Engineering addresses this with 19 global projects, focusing on vulnerable groups and promoting improved waste management, citizen reporting, and regulatory enforcement. Dr. Mansoor Ali, RAE’s Theme Lead, further stated that RAE’s programs aim at various levels, including national policies, city frameworks, and grassroots practices, recognizing the link between waste burning and livelihoods, especially for waste pickers.\nOnce known as the “city of gardens,” Lahore has transformed into a “gas chamber.” Over the past decade, the city has witnessed a worrisome 75% reduction in greenery, accompanied by a significant 10-degree rise in temperature. 60% of diseases in Lahore are linked to air pollution. The roots of Lahore Bachao Tehreek can be traced back to a case 16 years ago when a Motorway construction project proposed cutting 30,000 trees and converting 23,000 acres of green land into a road near the Lahore canal.\nThe Supreme Court’s historic judgment led to the introduction of the Canal Urban Heritage Path Act, which was passed through Parliament, recognizing the environment as a vital heritage and public trust for the first time. Imrana Tiwana, Environmental Activist, highlights how she started the Lahore Bachao Tehreek, a movement aimed at addressing the escalating issue of smog in Lahore.\nExposure to pollutants from open waste burning, especially during the smog season, poses serious health risks, including respiratory and cardiovascular issues, skin and eye irritation, increased cancer risk, and compromised immune systems. Vulnerabilities vary across demographics, with children, the elderly, and low-income communities facing higher risks. Urban areas witness frequent hospital admissions for respiratory diseases, while rural regions may face occupational exposure.\nIn daily practice, doctors observe how toxic air exacerbates existing health conditions, leading to respiratory and cardiovascular complications across diverse demographic groups. This was added by Dr. Abdullah Najam, a Postgraduate Resident Pulmonologist at the Pakistan Institute of Medical Sciences while sharing the impact of open burning of waste and smog on public health.\nA routine waste collection of 600 to 700 tons took place, with the disposal site being the I-12 sector from 2011 till the previous year. Notably, citizens lit fires in the winter for warmth, leading to serious air pollution threats. The need for public awareness to curb open burning of waste, pinpointing a higher incidence of cases in rural areas rather than urban regions of Islamabad.\nThis issue, as highlighted by Sardar Khan Zimri, former Director General of the Sanitation Department and current Director General of Water Management at the Capital Development Authority, could be effectively addressed through targeted awareness campaigns, thereby making substantial strides in reducing the environmental and health risks associated with open burning in the region.\nKarachi faces a daily challenge of 15,000 tons of municipal solid waste, leading to open burning issues in low-income areas. Karachi School of Business and Leadership’s (KSBL) ‘Mapping of Open Burning’ project aims to link these incidents with social vulnerabilities, using spatial mapping and key analytical tools. Simultaneously, impactful media coverage can draw attention to the correlation between open burning and smog, prompting communities to reconsider waste disposal practices and encouraging municipalities to implement cleaner alternatives, fostering positive change. This was stated by Shiza Aslam, Waste Management Specialist & Research Fellow at KSBL.\nWe cannot ignore the issue of open burning of Solid Waste since it results in the deterioration of the health of the public as well as degrades the environment. Mostly it happens due to a lack of knowledge and lack of understanding about the impacts of toxins produced due to burning.\nFarid Rais, Senior Anchorperson at Dunya News – who also moderated the Twitter space, highlighted this in his closing remarks. He also stated that there is a need to initiate massive awareness by engaging various stakeholders and through building partnerships with public and private institutions, media, academia, etc.\nThe Twitter Space served as a vital platform for raising awareness about the critical issue of open waste burning and its detrimental effects on air quality, public health, and the overall environment. The insights shared by an esteemed panel of speakers, representing diverse expertise, have shed light on the urgency of addressing this pressing concern in Pakistan.\nThe statistics regarding municipal waste production and the challenges faced by cities, particularly Islamabad, underscore the need for immediate and sustainable waste management solutions.",
  "retrievedAt": "2025-08-11T10:56:32.242Z"
}
