{
  "title": "MoU on maritime cooperation between Pakistan, Bulgaria signed",
  "link": "https://www.app.com.pk/national/mou-on-maritime-cooperation-between-pakistan-bulgaria-signed/",
  "date_published": "2023-05-29T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): Pakistan and Bulgaria signed the ‘Memorandum of Understanding on Maritime Cooperation’ on Monday in Sofia at a ceremony in the Ministry of Transport and Communication of Bulgaria.From Pakistani side, Mariam Madiha Aftab, the Ambassador of Pakistan to Bulgaria signed the MoU, while, Hristo Alexiev, Deputy Prime Minister for Economic Policies and Minister of Transport and Communication of Bulgaria, signed the document from Bulgarian side, says a press release.\nThe signing of this MoU will help the two countries formalize their collaboration in the field of maritime affairs. Under the MoU, the two countries would expand and deepen cooperation on matters relating to maritime transport, facilitate liaison between their respective bodies dealing with maritime affairs, increase private sector awareness and cooperation, create mutually beneficial economic opportunities and promote investments in this important field.\nSpeaking to media after the signing ceremony, the ambassador of Pakistan said that signing of this MoU was yet another milestone in the continuously strengthening bilateral relations of the two countries and will help the respective authorities of the two countries to establish mutually beneficial collaboration. She also highlighted that, earlier, last month the two countries held the fifth round of Bilateral Political Consultations during which proposals relating to collaboration between the two countries in diverse fields were discussed.\nOn the occasion, the Ambassador also held a separate meeting with the Minister of Transport and Communication of Bulgaria during which proposals to enhance collaboration between the respective ministries of the two countries were discussed.",
  "retrievedAt": "2025-08-11T08:34:55.274Z"
}
