{
  "title": "President directs FBR to make payment, apologize to citizen over wrongly auctioning three imported vehicles",
  "link": "https://www.app.com.pk/national/president-directs-fbr-to-make-payment-apologize-to-citizen-over-wrongly-auctioning-three-imported-vehicles/",
  "date_published": "2023-05-29T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): President Dr Arif Alvi has directed the FBR to apologize and make payment to a citizen whose three imported vehicles were mishandled by Customs Department and wrongly auctioned by Custom officials at a low price of almost Rs 3 million without any notice to him.\nThe Customs Duty paid by him was refunded to some unauthorized clearing agents, who later disappeared with the money, a President House press release said.\nThe president directed FBR to verify all receipts/documents, refund the amount as per the assessed value of the vehicles, and refund the duties/charges paid in favour of importers/owners.\nHe also directed the citizen to provide all documents and reconcile with Customs Department enabling FBR to make payment within 30 days.\nHe observed that interest should be added to the payment since the auction money was lying with the exchequer.\nPresident Alvi gave these directions while accepting a representation filed by Iftikhar Ahmed Awan (the complainant) against the orders of the Wafaqi Mohtasib.\nThe complainant had stated that overseas Pakistanis, living in Japan, legally imported three vehicles for the personal use of their families and the freight against the vehicles was paid.\nHowever, FBR didn’t release the vehicles and sold the three cars in an auction at a low price of Rs 3,019,385.\nFeeling aggrieved, the complainant approached the Wafaqi Mohtasib, who directed FBR to make payment of sale proceeds of vehicles to owners, after verification as to why they were being paid such a low amount.\nThe complainant then filed a representation with the president praying that Customs Department should be ordered to make payment of sale proceeds of the vehicles at prevailing market rates as well as refund all the duties/charges which were paid.\nDuring the proceedings, it was pointed out that after the completion of all formalities, the ship carrying the vehicles landed at another terminal and the Customs Department auctioned the vehicles without any notice to the importer, and that the Customs Duty was refunded to unauthorized clearing agents, which resulted in huge financial loss to the importers/owners.\nDuring the hearing, FBR’s representative admitted the fault of the Customs personnel in handling the matter due to a lack of communication and system barriers.\nHe said that as per Customs Rules, if the goods were not cleared within 15 days of the date of arrival at a Customs Station, the same could be sold in an auction.\nHe informed that FBR had initiated disciplinary proceedings against the delinquent officials involved in mishandling the matter and they had also been served a charge sheet in pursuance of the order of the Mohtasib.\nHe added that the licences of the agents, who disappeared with the money, had also been cancelled.\nThe president concluded that mishandling of the imported vehicles on the part of the Customs Department was not denied and maladministration had been established.\nHe said that due to the negligence of officials, importers/owners suffered a huge financial loss and mental agony.\nHe added that it was a fact that financial loss occurred due to negligence, lack of communication, and deviation from the established clearing system of the Customs.\nPresident Alvi said that the citizen was aggrieved by the wrong committed by Custom Officials and not due to fault of his own, therefore, his representation was accepted and FBR was directed to refund the amount as per the value assessed, duties/charges paid in favour of importers/owners, and add interest to the payment.",
  "retrievedAt": "2025-08-11T08:34:58.865Z"
}
