{
  "title": "Qualifier Maria completes fairytale run to Queen’s title - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Tatjana Maria completed her fairytale run at Queen’s Club as the German qualifier beat American Amanda Anisimova 6-3, 6-4 in Sunday’s final to become the oldest winner of a WTA 500 event.\n\nThe 37-year-old’s victory secu­red the fourth singles title of her career, and her first since 2023 on the clay in Bogota.\n\nWorld number 86 Maria is the first German to win a WTA 500 title since Angelique Kerber in 2018 in Sydney.\n\nIn the first women’s tournament at Queen’s since 1973, Maria is the event’s first female champion since Russia’s Olga Morozova 52 years ago.\n\nWhen Morozova won in west London, the prize money was just 1,000 ($1,353).\n\nMaria banked a cheque for 120,000 and more importantly earned a huge confidence boost ahead of Wimbledon, which starts on June 30.\n\nThe mother of two arrived at Queen’s on a nine-match losing streak and had to survive two rounds of qualifying matches to reach the main draw.\n\nDeploying her slice-heavy style to devastating effect, she stunned sixth seed Karolina Muchova, fou­rth seed Elena Rybakina and reigning Australian Open champion Madison Keys en route to the final.\n\nMaria, who has taken two maternity breaks from the WTA Tour, has never been past the second round of any Grand Slam except Wimbledon, where she reached the semi-finals in 2022.\n\nBut once again she proved a formidable force on grass, brushing aside Anisimova to secure her second title on the surface as her husband and young daughters Charlotte and Cecilia watched from courtside.\n\n“A dream come true. I came here I was never thinking I could hold the trophy at the end,” Maria said.\n\n“When we arrived my little girl said: ‘Wow that’s a nice trophy, so big’ and I said: ‘OK let’s go for it, I will try to win it’. And in the end I’ve won it, it’s incredible.\n\n“Everything is possible if you believe in it. You go your way, doesn’t matter which it is but you have to keep going. I want to show this to my kids and hopefully they are proud. It’s amazing.”\n\nAsked if she planned to celebrate with her family, Maria said: “For sure. This doesn’t happen every week so we have to celebrate with something. “I think the kids will probably want some crepes with Nutella!”\n\nAnisimova has struggled to live up to her early success after reaching the French Open semi-finals aged 17 in 2019.\n\nShe took an eight-month break from tennis and dropped out of the top 400 after suffering with depression bought on by the scrutiny and expectations that came with being a teen prodigy.\n\nThe 23-year-old returned last year and won the Qatar Open this February, reaching a career-high 15th in the rankings before underlining her renaissance by defeating Olympic champion Zheng Qinwen to reach her first grass-court final.\n\nHowever, Maria was too savvy on grass for Anisimova, who said: “It’s incredible to see Tatjana playing at this level. To have her family here, it’s super special.\n\n“I wouldn’t be surprised if we see her in the Wimbledon final. She really had me running out there today.”\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684f63550fa69.jpg",
  "retrievedAt": "2025-08-20T03:59:33.636Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917403/qualifier-maria-completes-fairytale-run-to-queens-title",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:12.000Z"
}
