{
  "title": "Bara Siyasi Ittehad opposes military operation in Tirah - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Bara Siyasi Ittehad (BSI) on Sunday strongly opposed the launch of any military operation in Tirah and forced displacement of people.\n\nIn a daylong seminar on the security situation in Tirah valley and impending military operation, the BSI leaders also announced to consider social boycott of both civil and military establishment in case any decision was forcefully imposed on them.\n\nTalking to journalists at the end of seminar, BSI president Hashim Khan Afridi said that previous examples showed that military operations brought misery to local population instead of clearing a particular area of undesirable elements.\n\nHe said that houses were demolished while social fabric was badly damaged due to mass exodus of locals wherever a military operation was conducted while terrorist groups were still operating in the affected areas.\n\n“Restoration of peace is responsibility of security forces and they should focus on tackling militant groups instead of forcing locals to vacate their houses,” he stated.\n\nMr Afridi also announced holding of a peace rally, a date for which will be fixed after consultations with all elders of Tirah and Bara and other relevant groups and organisations in order to muster maximum support for the ‘decisive’ show of strength and unity of all Afridi tribes.\n\nHe said that BSI took serious exception to exclusion of local parliamentarians, local government representatives and prominent tribal elders from the previous three rounds of talks between government officials and a handpicked group of pro-administration elders about the launch of a military operation and displacement of locals.\n\n“We will not agree to any such unilateral decision about military operation, which was made behind closed doors while keeping actual actors unaware about such proceedings,” he emphasised.\n\nHe said that BSI with the help and active assistance of local tribes would nominate actual representatives for any future parlays with the government functionaries rather than accepting officially-nominated elders. He said that alongside organising a huge peace rally, BSI would also hold press conferences in Peshawar and Islamabad to convey its disapproval of military operations and forced displacement from Tirah.\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:59:28.443Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917343/bara-siyasi-ittehad-opposes-military-operation-in-tirah",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:45.000Z"
}
