{
  "title": "One-time sellers, home-based business exempt from online registration: FBR - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) chairman has clarified that one-time sellers and women selling goods from their homes would be exempt from mandatory registration for online businesses.\n\nAccording to an official statement, the clarification by FBR Chairman Rashid Mahmood Langrial was given during a meeting of the Senate Standing Committee on Finance and Revenue, which discussed the federal budget presented last week.\n\nThe committee approved the proposal to impose sales tax on e-commerce items.\n\nThe FBR chairman said online businesses already collect tax from consumers but don’t deposit it with the FBR.\n\nHe further elaborated that courier services will now be designated as collection agents, since they possess the seller’s invoice.\n\nHowever, sales tax will not apply to services provided locally.\n\nThe government, in an attempt to tax digital businesses, has proposed mandatory registration of all digital vendors, including foreign e-commerce companies, if they sell goods to Pakistani customers.\n\nThe committee reviewed penalties for unregistered entities, with members expressing concerns about the impact on small and one-time online sellers.\n\nThe FBR chairman assured the members that housewives and those involved in one-time transactions will be protected and will not be required to register.\n\nThe meeting also discussed the powers granted to tax officials to arrest suspected tax evaders and the harsh penalties proposed for tax fraud.\n\nIn the Finance Bill, the government proposed 10 years imprisonment and fines for fraud exceeding Rs10 million.\n\nThe members also debated the scope of tax officers’ power under Section 37A of the Sales Tax Act, 1990.\n\nThe meeting was told that earlier, assistant commissioners were empowered to arrest suspected tax evaders.\n\nNow, it has been revised to require prior inquiry and the commissioner’s approval for arrest.\n\nMinister of State for Finance Bilal Azhar Kiyani said the amendment was “a step towards protecting procedural integrity and reducing arbitrary arrests”.\n\nHowever, committee members remained sceptical over the potential misuse of these powers.\n\nIn response to the objections, the FBR chairman assured the committee that a revised draft of the relevant provisions would be submitted today. The committee will continue the deliberation on the Finance Bill 2025-26 today (Monday), the press release said.\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:37:10.611Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917415/one-time-sellers-home-based-business-exempt-from-online-registration-fbr",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:05:59.000Z"
}
