{
  "title": "Fact check: Trump, Netanyahu viral comments about Pakistan on Iran-Israel clash are fake - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from users on multiple social media platforms since Sunday shared a clip of US President Donald Trump allegedly urging Pakistan to stay out of the Israel-Iran conflict. However, the viral clip is AI-generated and Trump said no such thing.\n\nNearly 80 people, including top army officers, were killed while civilians were among over 300 wounded in Iran as a result of Israel’s strikes on military sites and private residences on June 13. Iran subsequently launched its own retaliation with ballistic missiles fired at Israel and the two countries continued to exchange a volley over the weekend.\n\nPrime Minister Shehbaz Sharif expressed “complete solidarity” with Iran while Defence Minister Khawaja Asif said that Pakistan would “safeguard Iran’s interests” amid the conflict.\n\nOn Sunday, an X user posted a clip of Trump apparently commenting on the rising Middle East tensions, urging Pakistan to stay out of a potential Israel-Iran conflict.\n\nIn the clip he said: “Pakistan has also warned Israel and the US, because Israel mistakenly said Pakistan is number two after Iran. Pakistan is fully alert with its air, land and marine forces. Pakistan’s Defence Minister Khawaja Asif said if Israel attacks Iran again, Pakistan will totally destroy Israel.\n\n“But Harry’s, would I say Pakistan should not do that? Pakistan has no problem with us, their army is already very high alert. In my opinion, Pakistan should not get involved. This is Israel and Iran’s war. We need peace in the region. We need to stop the fighting, not get in the middle. That’s the truth. That’s a smart move.”\n\nThe post was viewed by over 620,000 people.\n\nThe video with the same claim was shared here gaining 246,000 views.\n\nIt was also shared on TikTok here, here, and here, racking up 2.6 million, 1.6m and 14,000 views, respectively.\n\nA fact-check was initiated to determine the veracity of the claim due to its high virality, keen public interest in the situation and widespread rumours about Pakistan’s alleged involvement in the ongoing conflict.\n\nObserving the clip showed several discrepancies, indicative of videos generated through AI, such as unnatural blinking, distorted facial expressions, robotic-sounding speech lacking a natural cadence and ebb and flow. Furthermore, the word “region” was unnaturally uttered in an extended manner at the 34-second mark of the clip.\n\nExamining the video using AI detection tools showed that Hive Moderation flagged it with a 98.2 per cent likelihood of AI generation, while Attestive.ai reported only a 7pc probability. Deepware did not detect the video as a deepfake.\n\nA keyword search for “Donald Trump”, “Iran” and “Pakistan” yielded no recent results or reports from credible US media outlets on the alleged comments.\n\nA reverse image search traced the clip to Trump’s May 30 address from the White House Oval Office — well before the current Israel-Iran escalation, which began on June 13.\n\nFurthermore, the US president has made no other public speech in his office since June 13.\n\nTherefore, the fact-check determined that the claim about a viral video of Trump urging Pakistan to stay out of Israel-Iran conflict is false. The clip is a deepfake and Trump has made no such comment.\n\nPosts from users on social media platforms since Saturday shared a video of Israeli Prime Minister Benjamin Netanyahu claiming that he threatened Pakistan, saying his goal is to prevent Iran and Pakistan from acquiring nuclear weapons amid the current Israel-Iran conflict. However, the statement is not recent or related to the ongoing conflict but was made in March 2011 where he conditioned his comment about Pakistan to a Taliban takeover and was not a direct threat.\n\nOn Saturday, a post on X by a user, describing himself as a journalist associated with a major news outlet, shared a video of Netanyahu with the following caption: “After Iran, Pakistan … Netanyahu’s threat.”\n\nIn the video, Netanyahu can be heard saying: “The greatest mission that we have is to prevent the militant Islamic regime from meeting up with nuclear weapons — or from nuclear weapons meeting up with the Islamic regime. The first is called Iran, and the second is called Pakistan. Because if these radical regimes have nuclear weapons, they will not obey the rules that have been obeyed in the last almost seven decades.”\n\nThe post was seen by more than 204,000 people and reshared 1,000 times.\n\nThe same video was also shared by multiple other X users, gaining over 77,000, 24,000, and 11,000 views, respectively.\n\nThe claim also circulated widely across platforms, appearing in additional posts on X here, here and here and on Facebook as well.\n\nA similar claim was also shared in a text post on Instagram, which received more than 13,000 likes.\n\nA fact-check was initiated to determine the veracity of the claim due to its high virality and keen public interest in the ongoing conflict between Israel and Iran.\n\nA keyword search for “Netanyahu,” “Pakistan” and “statement” yielded to a YouTube video of an interview aired on March 31, 2011, by Israeli news outlet Channel 2 and thus unrelated to the current tensions.\n\nReviewing the full 27-minute interview showed that Netanyahu made the remarks at the 25:43-minute mark.\n\nHowever, the viral clip had slightly altered Netanyahu’s remarks since in the original, he said the following about Pakistan at the 26:04-minute mark: “The second is called Pakistan, or more specifically a Taliban takeover of Pakistan.”\n\nHis comment was specifying Pakistan to a scenario in which it was taken over by the Taliban, however this part of his comment was edited out from the viral clip. Thus, there was no direct threat from Netanyahu to the Pakistani state amid the recent conflict or even in his original comments.\n\nTherefore, the fact-check determined that the claim that a video shows Israeli PM Netanyahu threatening Pakistan and saying his goal is to prevent it from acquiring nuclear weapons is false.\n\nThe viral clip is from 2011, unrelated to the current conflict and does not have a direct threat to Pakistan with Netanyahu conditioning his comment about preventing the acquisition of nuclear weapons to a possible Taliban takeover of Pakistan, with this part edited out of the viral clip.\n\nThese fact checks were originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/161114120b43fe6.jpg",
  "retrievedAt": "2025-08-20T03:59:18.642Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917469/fact-check-trump-netanyahu-viral-comments-about-pakistan-on-iran-israel-clash-are-fake",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T07:52:39.000Z"
}
