{
  "title": "Sindh budget: New year, same old broken tune - Business - DAWN.COM",
  "author": null,
  "content": "For the 15th time as Sindh’s finance minister, Chief Minister Murad Ali Shah presented a budget that, in essence, differed little from the previous one. It showed no sense of urgency on the provincial government’s part to identify or tackle the deep structural flaws that keep Sindh from realising its full potential.\n\nChoosing to defy the federal government’s guidelines, despite his party being part of the ruling coalition, Murad Ali Shah unveiled an expansive expenditure plan that projects a Rs38.4 billion deficit, with a total outlay of Rs3.4 trillion, marking a 12 per cent increase over last year. The federal government’s target to reduce the budget deficit to 3.9pc of the GDP depends on the provinces collectively delivering a cash surplus of Rs1.46tr.\n\nSindh has consistently lagged behind in multiple human development indicators under Mr Shah’s leadership during his one and a half decades at the helm of the province’s economic management team.\n\nAccording to the Human Development Index, based on regionally disaggregated data from the Population and Housing Census 2023, released by the Federal Bureau of Statistics, Sindh’s literacy rate has remained stagnant since 2019. The current literacy rate in Sindh stands at 57.5pc, compared to 66.3pc in Punjab and 61pc in Khyber Pakhtunkhwa (KP).\n\nThe school enrolment rate in Sindh is a notably low 53pc, compared to 73pc in Punjab and 62pc in KP. Despite increased resource availability following the National Finance Commission Award, instead of more cities breaking into the country’s top 10 urban centres, Sindh saw Sukkur drop off the list, leaving only Karachi and Hyderabad in that category. Whether in maternal care, child stunting or access to basic amenities, Sindh’s overall performance continues to fall short of expectations.\n\nDespite the province’s uneven and sluggish development, the budget offers no indication that the provincial government intends to strengthen data collection for evidence-based planning and more effective interventions\n\nDespite this dismal state of affairs, the chief minister did not hesitate to repeat in his budget speech, without explaining reasons behind the grave lapses, his familiar claim: “This budget will play a key role in unleashing Sindh’s untapped potential. It prioritises inclusive, sustainable, and robust development.”\n\nIt would have served him and his party better had he been more forthcoming and explained how the same approach will succeed now when it has failed to deliver in the past. If development has not gained momentum despite the 14 previous budgets he presented with similar promises, why should anyone take his assurances seriously this time?\n\nDelving into the Sindh budget’s complex jugglery of numbers and percentages seems futile if, in the end, the allocations fail to translate into tangible improvements in the delivery and quality of physical and social services for citizens and private businesses alike.\n\nAdditionally, there is no way for the provincial government or the chief minister, who also serves as finance minister, to absolve himself of responsibility for the persistent neglect of Karachi, the province’s largest and most productive city. Despite contributing the lion’s share to Sindh’s own resources and arguably to the national economy as well, Karachi residents and businesses continue to grapple with insufficient/inadequate basic amenities, including water, sewage, roads, public transport and security.\n\nTo his credit, Mr Shah has demonstrated impressive effectiveness if and when he chooses to act decisively. Under his leadership, Sindh has outpaced other provinces in launching major public-private partnership projects, managing the pandemic response, and providing sustainable housing for the flood-affected displaced population. It remains a puzzle, however, why he has not extended this same resolve and expertise to other critical areas that continue to demand urgent attention.\n\nA striking omission in the budget speech was the lack of emphasis on the landmark Agriculture Income Tax Act 2025 and its economic, social and political significance. Effective retroactively from July 2024, the Act aligns tax rates on agriculture income with those applied to other income sources. If implemented properly, it could substantially boost provincial revenues, correct a longstanding anomaly in the tax regime, and close an avenue often used for tax evasion, thereby making the system fairer. This conspicuous silence raises questions: does the omission signal the government’s reluctance to enforce the law rigorously, out of fear of alienating its rural aristocratic support base?\n\nDespite the province’s uneven and sluggish development, the budget offers no indication that the provincial government intends to strengthen data collection for evidence-based planning and more effective interventions. The Sindh Bureau of Statistics remains a dormant institution in dire need of revival. The chief minister could have addressed this gap by allocating funds to make the bureau functional and ensure its essential role.\n\nUnlocking Sindh’s economic potential, creating jobs and ensuring dignified livelihoods require higher investment in the province’s manufacturing base. This goal will remain out of reach unless the Pakistan Peoples’ Party rebuilds trust with the private sector, which still perceives it as anti-business due to nationalisation policies of the 1970s. Despite nearly two decades in power, the party has yet to win over this key driver of growth.\n\nPublished in Dawn, The Business and Finance Weekly, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:59:34.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917278/sindh-budget-new-year-same-old-broken-tune",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:05.000Z"
}
