{
  "title": "Parliamentary panel won’t be formed before parley on ECP names - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Nat­i­onal Assembly speaker has refused to form a parliamentary panel to pick a new chief and members of the Election Commission of Pakistan (ECP) before the completion of the consultation between the prime minister and opposition leader.\n\nEarlier, on Feb 11, Speaker Sardar Ayaz Sadiq said he had formally written to the government and the opposition, seeking nominations for the parliamentary panel.\n\n“The parliamentary committee will be formed once the nominations are received,” he had said during a sitting of the National Assembly.\n\nA spokesperson for the National Assembly said on Sunday that the speaker has so far not received any formal letter from the prime minister about the formation of the parliamentary committee for the appointment of the CEC and two members of the ECP.\n\n“The process will commence only once the letter is officially received”, the spokesman added.\n\nHe further said that the premier had already initiated the required consultation with the Leader of the Opposition on May 16, 2025, in accordance with Clause 2A of Article 213 of the Constitution.\n\n“This consultation is aimed at finalising three names each for the posts of Chief Election Commissi­oner and members of the Election Commission from Sindh and Balochistan.”\n\nThe spokesperson said that as soon as the consultation process is completed, the speaker will invite nominations from the respective parliamentary leaders in Parliament for the constitution of the said parliamentary committee, as per Clause 2B of Article 213 of the Constitution.\n\nMeanwhile, a senior official of the National Assembly Secretariat respo­nded to a letter written by Leader of the Opposition Omar Ayub Khan, seeking the formation of a parliamentary panel on the appointment of a new CEC and two ECP members.\n\nThe letter, seen by Dawn, draws the attention of the opposition leader to clauses 2A and 2B of Article 213 read with Clause 2B of Article 218 of the Constitution.\n\nClause 2A of Article 213 reads, “The Prime Minister shall in consultation with the Leader of the Opposition in the National Assembly, forward three names for appointment of the Commissioner to a Parliamentary Committee for hearing and confirmation of any one person”.\n\nClause 2B reads, “The Parliame­ntary Committee to be constituted by the Speaker shall comprise fifty percent members from the Treasury Benches and fifty percent from the Opposition Parties, based on their strength in Majlis-e-Shoora (Parlia­ment), to be nominated by the respective Parliamentary Leaders.”\n\nHowever, none of the two clauses appears to restrict formation of a parliamentary committee before the completion of the consultation process.\n\nOn June 4, Prime Minister Shehbaz Sharif had written a letter to Mr Khan inviting him for consultation on appointment of CEC and two members of the Commission without specifying any date.\n\nThe five-year term of the chief election commissioner and two ECP members had expired on January 26 but under a controversial amendment they will continue to hold their offices till the appointment of their successors.\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:59:55.398Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917402/parliamentary-panel-wont-be-formed-before-parley-on-ecp-names",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:05:44.000Z"
}
