{
  "title": "618 more Pakistanis repatriated from Iran, Iraq amid Middle East crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan on Monday repatriated another 618 nationals from both Iran and Iraq amid Tehran’s ongoing conflict with Israel, according to the Foreign Office (FO) and a district official in Balochistan.\n\nA day ago, the government was able to repatriate 450 zaireen (pilgrims) from Iran, with more to follow from the neighbouring country as well as from Iraq. Arrangements were made for the safe evacuation of Pakistani students currently residing in Iran, including 154 in the first batch.\n\nThe move came after Israel launched an air offensive against Iran on Friday, killing commanders and scientists and bombing nuclear sites in a stated bid to stop Tehran from building an atomic weapon, which the latter has consistently denied, saying its uranium enrichment programme is for civilian purposes.\n\nAround 350 Pakistani pilgrims stranded in Iran returned to their homeland on Monday after crossing the border at Taftan, according to a district official in Balochistan.\n\nChagai Deputy Commissioner Attaul Muneem told Dawn.com that 350 Pakistanis, including 45 students and 305 pilgrims, crossed the border and that arrangements have been made to house them at Pakistan House in Taftan.\n\n“The pilgrims and students who have arrived are being sent to Quetta,” he added.\n\nIn a statement from his office, Muneem said that Pakistanis stranded in Iran are attempting to cross the land border due to the conflict.\n\n“The district administration is arranging medical care, food, accommodation and travel facilities in Taftan so that Pakistanis returning from Iran do not face any difficulties,” the DC was quoted as saying.\n\nMeanwhile, the FO successfully repatriated 268 Pakistani zaireen through two special flights from the Iraqi city of Basra to Karachi and Islamabad, according to a statement.\n\nThe ministry said it is working closely with Iraqi Airways and Iraqi authorities to repatriate the zaireen and ensure their “safe and timely return”.\n\n“All Pakistani zaireen currently in Iraq are advised to remain in close contact with the Pakistan Embassy in Baghdad, designated mandoobs (representatives) and their respective airlines for timely updates regarding their travel arrangements,” the statement read.\n\nThe FO said that Iraqi Airways is operating daily flights on the Basra–Dubai route, which the zaireen used to return to Pakistan.\n\n“Those interested in travelling via this route are encouraged to contact the nearest Iraqi Airways office for booking and assistance,” the statement read.\n\n“All zaireen are further advised to remain prepared for travel at short notice,” the FO said, adding that it is monitoring the situation closely and “remains fully committed to facilitating the safe and orderly return of all Pakistani zaireen”.\n\nOn the day of the Israeli strikes, Prime Minister Shehbaz Sharif directed all relevant authorities to provide every possible assistance for the safe return and protection of Pakistani zaireen in Iran following Israel’s deadly strikes.\n\nIn light of the PM’s directives, a Crisis Management Cell was established at the Ministry of Foreign Affairs to monitor the situation and coordinate efforts.\n\nThe Pakistani Embassy in Iran has also been instructed to remain vigilant and actively assist the pilgrims. Earlier today, Foreign Minister Ishaq Dar shared the embassy’s hotline number: (0098)-2166941388.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/16225854cfc0cb1.jpg",
  "retrievedAt": "2025-08-20T03:59:11.867Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917511/618-more-pakistanis-repatriated-from-iran-iraq-amid-middle-east-crisis",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T17:21:17.000Z"
}
