{
  "title": "Many PTI leaders picked up after rally for Imran’s release in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A rally organised by the Pakistan Tehreek-i-Insaf (PTI) demanding the immediate release of the party founder Imran Khan and his wife Bushra Bibi ended in chaos on Sunday evening, as police detained several key leaders and participants, prompting strong condemnation from the party’s top provincial leadership.\n\nThe PTI officials said among those arrested were PTI Karachi Youth Wing President Jansher Junejo, senior leader Faheem Khan and Advocate Daniyal Magsi.\n\nScenes of tension were witnessed when a heavy contingent of police intervened near Bahadurabad during the concluding moments of the rally. The detained individuals were reportedly shifted to Ferozabad police station.\n\nTerming the arrests “a brazen attempt to silence peaceful dissent”, PTI-Sindh President Haleem Adil Sheikh called it a civilian dictatorship.\n\n“A civilian dictatorship has been imposed in Sindh as peaceful protest is now met with arrests,” he said. “The rule of law and supremacy of the Constitution no longer exist in the country.”\n\nThe rally, which began earlier in the day, was led by a number of PTI Youth Wing leaders including Jansher Junejo, Central Senior Vice President Mir Wali Magheri, Central Vice President Nisar Khan, Karachi Youth Wing General Secretary Mansoor Khattak and others.\n\nIt passed through major city thoroughfares including Hassan Square, Bahadurabad, Char Minar Chowk and Sharea Faisal.\n\nA large number of party workers and supporters participated in the rally, chanting slogans demanding the release of Khan and Bushra.\n\nThey carried banners and placards, asserting that the detentions of PTI leaders and restrictions on media and judiciary were “unconstitutional and undemocratic”.\n\nAddressing the rally before his detention, Mr Junejo said that Pakistan’s youth had awakened.\n\n“We will not remain silent until Imran Khan is freed. He has made unmatched sacrifices for this country and continues to inspire our generation,” he added.\n\nHe accused the ruling coalition of orchestrating a constitutional amendment to subvert the judiciary and suppress free speech through laws like the Peca.\n\n“Inflation is soaring, unemployment is driving youth to despair, and merit has been replaced by nepotism,” he said.\n\nHe also condemned the jailing of Bushra, calling it a “politically motivated move to break Khan’s resolve”.\n\nThe other speakers reiterated their demands for the immediate release of Khan, Bushra and all political prisoners, as well as the withdrawal of what they described as “fabricated cases” and a full restoration of judicial and media freedoms.\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:59:29.969Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917378/many-pti-leaders-picked-up-after-rally-for-imrans-release-in-karachi",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:25.000Z"
}
