{
  "title": "KP govt directed to take action against violators of environmental law - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has ordered Khyber Pakhtunkhwa government particularly its Environmental Protection Agency (EPA) to ensure implementation of the environmental protection law and take strict against those people, who are violating it.\n\nA single-member bench of Justice Syed Mudasser Ameer issued the directives while rejecting pleas of five stone crusher companies, seeking reversal of a stay order of KP Environmental Protection Tribunal (EPT) of stopping operation of their plants in Hazara region.\n\n“Accordingly, these petitions are dismissed and official respondents, particularly EPA, are directed to ensure implementation of Environmental Protection Act (KPEPA) and constitutional mandate of preservation and protection of environment in letter and spirit and take strict action in accordance with law against everyone and anyone violating any provision of these laws,” the bench ordered in its 32-page detailed judgement.\n\nThe bench ruled that in the absence of a valid environmental approval (EA) under Section 13 of KPEPA, no one could commence or continue any activity that had any adverse impact on environment. “The EPT’s order, based on inspection reports and material records, was not only legally justified but constitutionally necessary to preserve the ecological integrity of Thandiani region,” it added.\n\nPHC rejects pleas of stone crushers against environmental tribunal order\n\nJustice Ameer referred to judgements of superior courts and discussed environmental laws, national and international, and constitutional provisions related to environmental protection in detail.\n\nAlmost identical petitions were filed by Al-Khalid Stone Crusher and four others, challenging the Mar 11, 2025, order of EPT.\n\nA complaint was filed by Advocate Hashim Iqbal Jadoon with EPT, seeking its intervention against the present petitioners, allegedly for their persistent illegal operation of stone crushing machines, operating without legal authorisation despite being sealed multiple times by authorities.\n\nHe requested EPT to take strict action against the petitioners including permanently shutting down of their plants, heavy fines and criminal penalties. He had also moved application for interim relief, which was allowed on Mar 11, 2025.\n\nThe petitioners claimed that the complaint was malicious and was liable to be rejected.\n\nThey contended that they had legally established stone crushing plants after obtaining necessary approvals, including authorisation from mines and mineral department, NOCs from the industries and consumer department and environmental clearance from EPA.\n\nThe bench observed: “Stone crushing activities in Pakistan, particularly around areas like Margalla Hills, Taxila and Hazara division, have indeed caused significant erosion and environmental degradation. The industry, driven by demand for construction material, often relies on blasting and quarrying, leading to hillside denudation and potential damage to ecosystems and communities. Stone crushing operations, especially those involving blasting, cause significant erosion of hillsides, leading to land degradation and loss of vegetation.”\n\n“Many a times, honourable Supreme Court has also pointed towards this menace and the proactive approach that is needed to prevent further destruction. It is also disappointing and disturbing that EPA is only focused on air and noise pollution and doesn’t seem much bothered about the eroding mountains,” the bench observed.\n\nThe bench pointed out that as per report submitted to the apex court in the case of “Amir Ishaq and others versus province of KP” there were 900 crushing plants operating in KP by July 2024.\n\n“This poses a serious existential threat to mountains. The inspections conducted and guidelines provided by EPA available on record show various precautionary measures and safeguards related to air and noise pollution, however, there seems to be no such measure taken by EPA to ensure the safety and preservation of mountains,” the bench observed.\n\nThe bench ruled: “Without a comprehensive plan for preservation of these mountains, environmental approvals cannot and should not be issued.”\n\nThe bench wondered if stone crushing could be completely banned in Islamabad Capital Territory (ICT) to save mountains and environment, why not in KP. “The provincial government should also look into the matter and come forward to perform its constitutional duties in this regard,” the bench ruled.\n\nReferring to Article 9-A of the Constitution, the bench observed that constitutionally guaranteed fundamental right to a clean, healthy and sustainable environment was not abstract and it was a real and enforceable right.\n\n“The apex court in Shehla Zia’s case emphasised that prevention is better than cure and environmental threats or violations should be arrested from the very inception. Now to ensure the guarantee provided by Article 9-A, even more proactive role is required, particularly by those charged with the specific responsibility to protect and preserve the environment,” the bench observes.\n\nReferring to different provisions of KPEPA, the bench categorically ruled: “No matter how long it takes, no matter how difficult it might be, the commencement or operation of any project in the absence of an EA is illegal and must be stopped immediately. There is no exception provided in law, nor can one be created on any grounds whatsoever.”\n\n“Neither EPA nor EPT, nor any other authority for that matter, has been vested with any such powers. Any permission, conditional approval, interim approval, NOC, relaxation, exemption, interim-relief, stop-gap arrangement or any other such instrument, by whatever name called, allowing any person or project to commence or continue operations in the absence of an EA is also ab initio illegal, unlawful and void,” the bench ruled.\n\nThe bench also discussed the enforcement mechanisms available under KPEPA and the powers of EPA and EPT thereunder.\n\nPublished in Dawn, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:37:32.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917346/kp-govt-directed-to-take-action-against-violators-of-environmental-law",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:45.000Z"
}
