{
  "title": "Bits, gaps, and the farmers’ perspective - Business - DAWN.COM",
  "author": null,
  "content": "Given Pakistan’s specific economic structure, the nature and scale of its industrial base, rural-urban population ratio, and prevailing literacy and skills levels of our workforce, it is clear beyond doubt that the country’s path to economic development and poverty reduction lies primarily through its agriculture sector. Yet, for many years, the government has pursued a piecemeal approach — short-term fixes — to the sector, lacking a holistic and long-term vision. The same fragmented thinking is evident in the 2025-26 budget.\n\nIn recent years, the government has increasingly shifted the responsibility for transforming agriculture to the private sector and market forces while declaring its own role as merely that of an enabler and facilitator. As a result, the agriculture sector appears to be operating on autopilot. It lacks clear direction and prioritisation, especially regarding strategic crops, productivity enhancement, technology adoption, and the efficient use of natural resources. The announced budget did not address these critical concerns and is a mere replica of the previous year’s budget.\n\nHowever, a positive takeaway from the budget is that, although it offers no concrete measures for agricultural growth, the government has at least refrained from adding further burdens on farmers, particularly revising federal excise duty rates on fertilisers and pesticides. Such a move could have devastated the sector, which is already reeling from historic losses and negative growth across all major crops in 2024-25.\n\nAnother commendable initiative announced in the budget speech is to improve farmers’ access to finance for procuring agricultural inputs in the right quantity at the right time. The government has announced a Clean Financing Facility Programme to provide up to Rs100,000 in loans to 700,000 smallholders, without requiring any guarantees.\n\nThe FY26 budget fails to address critical agricultural concerns while also lacking direction and prioritisation and seems in many ways to be a mere replica of the previous year’s budget\n\nWhile details are awaited, a similar initiative — Punjab’s Kissan Card Scheme offering loans up to Rs150,000 — largely turned into a trap for most farmers. Loan repayments were scheduled right after the wheat harvest, forcing farmers to sell their produce at throwaway prices amid a seasonal market glut. Many ended up losing more than they gained. To make the new scheme genuinely beneficial, the government should consider introducing a nine-month loan tenure, with repayments starting at least three months after harvest.\n\nAnother pressing challenge is high production costs that make our farmers uncompetitive in global markets. The imposition of an 18 per cent general sales tax (GST) on solar panels in the current budget has dashed their last hope of cost reduction by switching from costly diesel- and electricity-powered tubewells to more affordable solar-powered alternatives.\n\nIn the recent budget speech, the finance minister announced that the government is finalising the Seed Policy 2025 and the National Agricultural Biotechnology Policy 2025, which aim to create an enabling environment for the private sector.\n\nDue to poor seed quality, Pakistan already suffers from low crop yields. In the face of mounting climate change threats, even maintaining the current levels of agricultural productivity will be challenging—let alone improving them—without access to climate-resilient, high-yielding seeds.\n\nAgricultural research has not been a priority in Pakistan, as reflected in the consistently inadequate funding for research centres and universities, and once again, the current budget followed suit, echoing past patterns\n\nCountries that have developed their agriculture immensely in recent decades — such as India, China, and Brazil — have all made sustained, focused efforts to develop high-yielding crop varieties. In contrast, agricultural research has not been a priority in Pakistan, as reflected in the consistently inadequate funding for research centres and universities. Once again, the current budget followed suit, echoing past patterns.\n\nThat is why, despite having over 200 agricultural research centres in the public sector, Pakistan’s dependence on imported seeds is growing rapidly across nearly all crops — except wheat, sugarcane, and some vegetables. It is worth noting that imported seeds are expensive, and in many crops they account for 25–30pc of the total production cost.\n\nGiven that public research centres have failed to deliver, the government now relies on the private sector to fill the vacuum. However, developing new seed varieties is a years-long and resource-intensive process that demands sustained efforts. With Pakistan’s inconsistent business and tax policies, most seed companies prefer importing and marketing seeds over investing in local research and development — many even avoid seed multiplication within the country. In this context, how will farmers’ critical need for quality seeds, adapted to local conditions, ever be met at affordable prices?\n\nIn his budget speech, the finance minister conveniently blamed climate change alone for the 13.94pc decline in major crops in 2024–25. While climate change is undeniably a serious challenge, it is not the sole cause of this disaster. The government appears to be in denial, ignoring other critical contributing factors, including seed quality.\n\nIronically, the government has significantly reduced allocations to the Public Sector Development Programme (2025-26) for ministries directly or indirectly linked to agriculture. Allocation for the National Food Security and Research Division has dropped drastically from Rs24 billion in 2024-25 to Rs4.3bn. The allocation for the Climate Change and Environmental Coordination Division fell from Rs5.3bn to Rs2.8bn, while the Water Resources Division saw a cut from Rs185bn to Rs133bn. In contrast, the National Highway Authority’s allocation increased from Rs161bn to Rs227bn. The data clearly reflects where the government’s priorities lie.\n\nIn conclusion, meaningful progress in Pakistan’s agriculture sector requires pro-growth and evidence-based government policies, public-private partnerships in agricultural research, investment in critical infrastructure, and the strategic management of natural resources — particularly land and water— to ensure higher productivity, food security, and resilience against climate challenges. Accordingly, budgetary allocations should be aligned every year.\n\nKhalid Wattoo is a farmer and a development professional, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad\n\nPublished in Dawn, The Business and Finance Weekly, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684f70f9e356f.jpg",
  "retrievedAt": "2025-08-20T03:59:19.462Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917429/bits-gaps-and-the-farmers-perspective",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:29:47.000Z"
}
