{
  "title": "Budget special: Tying down e-commerce with misguided reforms - Business - DAWN.COM",
  "author": null,
  "content": "What happens when you put accountants and commercial bankers in charge of the finance ministry instead of trained economists? Well, the budget becomes mostly a general ledger exercise where they try to play the same old numbers game and try to keep the books in balance, while complying with the International Monetary Fund conditionalities. By and large, this year was no different, where the status quo was maintained, notwithstanding the symbolic relief to the salaried class.\n\nBut beneath the main line items of revenue and expenditure lie changes too small for the headlines but substantial enough to change the landscape of an entire industry. This year, e-commerce became the (un)lucky subject, as the government has proposed a series of ‘reforms’ aimed at tightening tax compliance within the sector.\n\nOn paper, this should be a welcome move. E-commerce has grown rapidly, with estimates putting its size in the $7-8 billion range, and bringing it under the tax net is a logical step. Yet the way the government has chosen to go about it reveals a flawed understanding of the industry’s structure and a concerning disregard for its fragility.\n\nThere are a couple of major changes worth looking at. First, e-commerce will now face an 18 per cent general sales tax, meant to bring it on par with physical retail, with marketplaces and couriers barred from working with unregistered vendors. In principle, nothing seems wrong here, as the objective is to ensure offline and online channels are on equal footing.\n\nExcept that a large chunk of our physical retail is already in the informal net, either fully or partially. Some of the biggest names in food and groceries, with tens of outlets across the country, are still not registered with the Securities and Exchange Commission of Pakistan and rely on the “association of persons” structure to carry out operations.\n\nUltimately, both these measures are expected to have the same impact: the final cost of products increases as the impact of new taxation as well as working with a smaller subset of vendors gets passed on to the consumers. The issue is that even now, e-commerce in Pakistan is already more expensive than retail — just compare the price of your favourite restaurant directly on their own website versus that on Foodpanda. Selling online comes at a cost, be it in the form of higher technology or logistics expenses or due to the commissions paid to the marketplaces.\n\nSecondly, the latest budget has proposed withholding taxes between 0.5pc and 2pc on all products. To start with, such taxes are inherently unfair by design, for they are not levied on profits, and they outsource the responsibility of collection to a third party. In the case of e-commerce, it’s going to be even more distortionary since the withheld amount will be a percentage of the gross merchandise value and not just its revenue.\n\nTraditionally, banks have already played this role of withholding agents, for better or worse, and have learnt the trade and developed the capacity to handle it. But now, third-party logistics players have also been mandated to do the same, and they have little experience or resources for executing such tasks.\n\nMore importantly, instead of strengthening its own enforcement infrastructure, the Federal Board of Revenue (FBR) has shifted the responsibility onto private platforms and service providers. Online marketplaces and couriers are now expected to ensure that every seller they work with is formally registered with the tax authorities, in addition to furnishing detailed monthly or quarterly compliance reports, monitor vendor tax statuses, and ensure that withholding and sales taxes are deducted and deposited correctly. This delegation of responsibility blurs the line between the regulators and the regulated, effectively turning marketplaces and couriers into unpaid tax enforcers under threat of heavy penalties.\n\nWhat makes the situation even more troubling is the absence of any meaningful support mechanism. There seems to be no easing-in period, no graduated compliance framework, and no incentives or subsidies for small businesses that now need to overhaul their invoicing systems, integrate with the FBR’s e-Bilty cargo tracking software, or hire tax professionals just to stay afloat. Compliance is now a precondition for survival, and failure to do so can result in fines running into hundreds of thousands of rupees or complete removal from the marketplace ecosystem.\n\nInstead of incentivising small vendors to come above board, this framework threatens to push many back into the shadows or out of business entirely.\n\nMutaher Khan is co-founder of Data Darbar and works for the Karachi School of Business and Leadership\n\nPublished in Dawn, The Business and Finance Weekly, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684e209fde9ec.gif",
  "retrievedAt": "2025-08-20T03:59:41.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917280/budget-special-tying-down-e-commerce-with-misguided-reforms",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:06:05.000Z"
}
