{
  "title": "FM Dar rubbishes ‘fake, fabricated’ video of Iranian official about Pakistan attacking Israel with nuclear weapons - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Monday dismissed an alleged video circulating online of an Iranian official saying Pakistan will attack Israel with nuclear weapons, amid the ongoing conflict between Iran and Israel.\n\nNearly 80 people, including top army officers, were killed while civilians were among over 300 wounded in Iran as a result of Israeli strikes on military sites and private residences on June 13. Iran subsequently launched its own retaliation with ballistic missiles fired at Israel and the two countries continued to exchange a volley over the weekend.\n\nPosts from multiple Indian and others users on social media platforms and Indian media outlets since Sunday shared a video of Iranian National Security Council member Mohsen Rezaei, claiming that he said Pakistan told Iran that if Israel drops a nuclear bomb on Tehran, Pakistan would retaliate in kind amid current tensions. However, fact-checking platform iVerify Pakistan concluded that the video was doctored, and the Iranian official had not made any such statement.\n\nAddressing the matter during today’s Senate session, FM Dar said, “There is a video on social media where an Iranian general was quoted as saying: ‘If Israel nuke attacks Iran, then Pakistan will attack [Israel] with nuclear weapons.’”\n\n“This is irresponsible and false news,” he said, adding that the claims had become viral on the internet, and that even UK news outlet Daily Mail picked it up.\n\nHe said, “From our side, there has been no such statement. It was fabricated.”\n\nHe also addressed an alleged video of US President Donald Trump allegedly urging Pakistan to stay out of the Israel-Iran conflict. Similarly, he said that a widely circulated interview of Israeli Prime Minister Benjamin Netanyahu, purported to be recent, was in fact from 2011. Such deceptive content is causing confusion and is being monitored closely by the Foreign Office, he told the Senate.\n\nDar said, “We have checked that it was an AI-generated clip and it was fake.”\n\nHe cautioned that everyone must be careful, saying, “This is not a children’s matter. This is a serious war like ours with India.”\n\nSpeaking on the Iran-Israel conflict, the foreign minister said, “We wanted the Iran-US [nuclear] talks to be successful. I must appreciate the foreign minister of Oman and Iran, who kept me in the loop throughout the process of the four rounds of talks in Muscat and Rome.”\n\nDar said that the Senate’s statement on the conflict was widely circulated around the world, stating, “[The] House of Federation took a strong stance. We fulfilled our responsibility with clarity.”\n\nHe further said that Pakistan facilitated the UN Security Council meeting within 24 hours of the attacks. He added that the Iranian ambassador at the meeting acknowledged four countries by name, including Pakistan.\n\nDar also said that he spoke to the Iranian foreign minister on the night of June 13/14, quoting him as saying, “We [Iran] are ready for diplomatic dialogue if Israel does not attack again.”\n\n“We have conveyed the matter through different channels that Iran is ready if the other side can stop,” he added.\n\nHe highlighted some of the consequences for Pakistani students and zaireen (pilgrims) in Iran.\n\n“On June 13, the crisis management unit of the foreign ministry was activated.\n\n“We have so far evacuated 251 students. By tonight, they will reach Quetta. There are over 500 zaireen there. Three hundred of them travelled by air to go there while 209 went there by road,” he said, adding that Pakistan was in contact with other countries as well.\n\n“Iran approached us on June 14 to help bring back 20,000 Haj pilgrims in Saudi Arabia. We gave a positive response to this. Pakistan will give them a visa on arrival, and welcome them at Karachi airport … So we are fulfilling our responsibility.”\n\nDar also spoke on Pakistan’s nuclear programme, saying that Pakistan’s policy had not changed since 1998.\n\n“Even at that time, we said that it is Pakistan’s stated policy. It is for the purpose of self-defence. It is our deterrence. It was important for parity, peace and security in this region,” he said, adding that India’s “spectacle of having hegemony and supremacy over us [Pakistan]” was buried on May 10, following the recent Pakistan-India tensions.\n\nDar further said, “We are not signatories of the Non-Proliferation Treaty (NPT). Since 1998, our condition has been that we will sign it only when India does. So neither India nor Pakistan have signed it. Neither has Israel. But it is a serious crime to attack nuclear installations, whether you are a member or not.\n\n“It is a major violation of international law due to the unimaginable consequences of attacking nuclear facilities.\n\nThe foreign minister reiterated that Pakistan’s “nuclear power is for our security and stability as well as regional stability.\n\n“Israel dare not look at Pakistan. Pakistan has enough power to respond to any malafide [action]. Our armed forces are fully alert,” he added.\n\nSeparately, Defence Minister Khawaja Asif warned the global community to be “wary and apprehensive” of Israel’s nuclear arsenal, amidst Tel Aviv’s aggression against its neighbours in the region.\n\nIsrael possesses around 90 nuclear warheads, according to the US-based Centre for Nuclear Arms Control and Non-Proliferation. There are multiple United Nations (UN) resolutions concerning Israel’s nuclear arsenal, including UN General Assembly Resolution 41/93, which urged Tel Aviv to renounce its weapons and place its facilities under International Atomic Energy Agency (IAEA) safeguards.\n\nAfter months of attacking Gaza — flattening homes, targeting hospitals and aid workers, and starving a besieged population — Israel has now expanded its assault across borders, launching wide-scale air strikes against Iran last week. Israeli officials have claimed the strikes are part of a broader operation codenamed ‘Rising Lion’ to deter Tehran’s nuclear ambitions.\n\n“(The) world should be wary and apprehensive about Israel’s nuclear prowess, a country not bound by any international nuclear discipline, nor signatory to NPT or any other binding arrangement,” he said in a post on X.\n\n“We do not pursue hegemonic policies against our neighbours, which are being amply demonstrated by Israel these days,” Asif continued, referring to Israel’s aggression in the region,.\n\nThe defence minister added that Pakistan was a signatory to all international nuclear disciplines.\n\n“Our nuclear capability is for the benefit of our people and defence of our country against the hostile designs of our enemies,” Asif said.\n\nAsif said that the Western world must worry about conflicts being generated by Israel, adding that it would engulf the whole region and beyond.\n\n“Their patronage of Israel, a rogue state, can have catastrophic consequences,” Asif warned.\n\nIsrael was able to produce nuclear weapons by the end of the 1960s. It is estimated that there are about 90 plutonium-based nuclear warheads in this country and that Israel has produced enough plutonium for 100-200 weapons.\n\nTel Aviv is not a party to the NPT — a 1970 accord aimed at preventing the spread of nuclear weapons, promoting disarmament, and ensuring the peaceful use of nuclear technology.\n\n“Although Israel refrains from informing the international community about whether it possesses nuclear weapons, it is the only country in the Middle East that has not accepted the Comprehensive Safeguards Agreement, which allows the IAEA to inspect all kinds of civilian and military nuclear facilities and to carry out verification activities for the work carried out,” Heinz Gartner, a professor from the University of the Vienna told Anadolu Agency.\n\nPakistan is also not a signatory to the NPT but frequently reiterates its commitment to nuclear safety and non-proliferation principles through other international frameworks.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/1617411158494ce.jpg",
  "retrievedAt": "2025-08-20T03:59:13.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917503/fm-dar-rubbishes-fake-fabricated-video-of-iranian-official-about-pakistan-attacking-israel-with-nuclear-weapons",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T15:19:12.000Z"
}
