{
  "title": "China posts fastest growth in nuclear arsenal to 600 warheads: report - World - DAWN.COM",
  "author": null,
  "content": "China’s nuclear arsenal has grown faster than that of any other country, reaching an estimated 600 warheads by early 2025, adding momentum to the global arms race and raising strategic concerns, an international security think tank said on Monday.\n\nThe country’s nuclear stockpile has been expanding by roughly 100 warheads per year since 2023, the Stockholm International Peace Research Institute (Sipri) said in its Sipri Yearbook 2025, warning that a new and dangerous nuclear arms race is taking shape amid a widespread weakening of arms control frameworks.\n\nAccording to the report, by January this year, China built or nearly completed around 350 new intercontinental ballistic missile (ICBM) silos and could have at least as many ICBMs as either Russia or the United States by the turn of the decade.\n\nThe report, however, said that even if China reaches 1,500 warheads by 2035, this would still represent only about a third of each of the current Russian and US stockpiles.\n\nBeijing said it follows a nuclear strategy that “focuses on self-defence”.\n\n“China … always keeps its nuclear capabilities at minimum level as required by national security and never engages in arms race,” Foreign Ministry spokesperson Guo Jiakun told a news conference in Beijing.\n\nHe said Beijing “follows a policy of no-first use of nuclear weapons at any time and under any circumstances and has committed not to use nuclear against non-nuclear states”.\n\nChina is the “only nuclear state to adopt such a policy”, he said, adding that Beijing “will stay firmly committed to safeguarding its own legitimate security interests and keeping the world peaceful and stable”.\n\nThe report revealed that nearly all nine nuclear-armed states — the US, Russia, the United Kingdom, France, China, India, Pakistan, North Korea and Israel — continued to modernise and expand their nuclear capabilities in 2024.\n\nThe overall global nuclear inventory declined slightly to 12,241, the report said, while expressing concern that a “dangerous new nuclear arms race is emerging”.\n\nRussia maintains the world’s largest arsenal, at 5,459 warheads, while the US has 5,177 warheads. The two nations account for about 90 per cent of the world’s total, the report said.\n\nLongtime rivals Pakistan and India are believed to have expanded their nuclear programmes in 2024, according to the report.\n\nIndia is believed to have once again slightly expanded its nuclear arsenal in 2024 and continued to develop new types of nuclear delivery systems. It possesses 180 nuclear warheads compared to 172 last year.\n\nPakistan also continued to develop new delivery systems and accumulate fissile material in 2024, the report said. It is believed to possess 170 nuclear warheads, the same as in 2024. A brief armed conflict between the two nations in May highlighted the risks of escalation.\n\nIsrael has 90 warheads, although the country has not confirmed its nuclear arsenal. It is believed to be modernising its capabilities, and conducted a test of a missile propulsion system in 2024, and appears to be upgrading its plutonium production reactor site at Dimona.\n\nNorth Korea was estimated to possess around 50 nuclear warheads as of January, the same as last year. It possesses enough fissile material to produce up to 40 more nuclear warheads.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:59:15.000Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917486/china-posts-fastest-growth-in-nuclear-arsenal-to-600-warheads-report",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T11:33:42.000Z"
}
