{
  "title": "False promises and avoiding agricultural necessities - Business - DAWN.COM",
  "author": null,
  "content": "The federal agriculture budget this year would be remembered for “not doing what was necessary” rather than for the “actions it has taken”. A clear reflection of this new national policy can be seen in allocations for development schemes. The finance bill tells us that it has “spared Rs4 billion for 10 ongoing schemes and five new ones — 15 in total”. On average, it is an allocation of Rs260 million per scheme that would cover the entire country and all seven provinces — showing where the sector fits in the federal scheme of things.\n\nThese allocations have been made for a sector which grew only by 0.56 per cent — primarily because of livestock (4.72pc), forestry (3.03pc) and fisheries (1.42pc) — otherwise the crop sector had a reverse growth of 6.82pc, neutralising the hard work of all its sub-sectors.\n\nAnd this is also a sector that we want to grow by a miraculous 4.5pc. If this next year’s growth target is not a perfunctory joke, the federal setup needs a serious introspection — the gap between the actions and the claims looks unbridgeable, especially given the policy and financial vacuum the budget has created.\n\nOther actions it has taken also appear abstract. They include forming a national committee to consult with provinces for (finding ways to) improving the sector, starting a “Clean Financing Facility” for a loan up to Rs100,000 without collateral, forming a National Seed Development and Regulatory Authority to help develop seeds under the Green Pakistan Initiative so farmers can be helped to diversify crops, and finally sending 1,000 agriculture graduates to China for training in modern agricultural methods. And this sums up the entire planning for the agriculture sector for next year.\n\n“This happens when urban intellectuals sit with bureaucrats to save the agriculture sector. Results, invariably, are jargon-laden plans, which are heavy on terminology and fall way short of actions,” Khalid Khokhar of Pakistan Kissan Ittehad (PKI) sums up farmers’ annoyance with what they got in the federal finance bill.\n\nPunjab is furious, and so are the farmers; it had many long meetings with the federal Finance Division to find and suggest ways to reduce the cost of production. It thought that it had the centre’s word on many of the steps it had proposed. It fought for a reduction in fertiliser prices and a reduction in duties and taxes on imported fertiliser. It also wanted a decrease in massive duties on machinery imports that are essential for modernisation and dealing with harvest and post-harvest losses. Punjab planned its budget considering all of these steps as final and planning beyond it. It now has to struggle to redo what it has just finished; take a fresh look at its budget with limited options — duties and taxes are a federal subject.\n\nFarmers, on their part, also made a bee line to federal capital in the run-up to the budget to sensitise the federal government on how their sector is sinking below the commercial line and they, below the poverty line; all seems to have gone in vain, except for one — avoided general sales tax (GST) on agriculture inputs like fertiliser and pesticides. This measure received universal acclaim.\n\nTelling the government how fertiliser prices have tripled in the last few years — urea from Rs1,600 per bag in 2020 to the current Rs4,400 and DAP from Rs3,400 to Rs12,700 per bag — and how that has spelt disaster. Because of these prices, urea application dropped by 18pc cent this Rabi season, DAP by 29pc and potash by 23pc, denting the wheat crop.\n\nYet concerns remain unaddressed: how GST on local cotton is hobbling the crop to its basics, how up to 35pc taxes on the import of farm machinery are keeping farm practices archaic, how energy prices have become a deterrent for investment and finally, how climate changes have dealt a blow to the residual viability of the sector are all causes for concern. “We have varying levels of promises on all these issues, but none of them were delivered — telling farmers and farming that their importance is limited to official lip service and politics during elections,” says a farmer leader who does not wish to be named.\n\n“Take it from me, next year will be even worse if corrective measures, not seen in the budget, are not taken,” Mr Khokhar insists. Implementation of official policies is a huge problem in Pakistan. The budget goes to prove that the government is not ready to correct its books and policies, let alone their implementation. Take the example of the government getting out of the wheat pricing issue. After decades of pursuing it, all governments (provincial and federal) suddenly washed their hands of the process without creating an alternative mechanism. With official setups out of pricing and procurement, stockists and hoarders rule the market. Is this a fair policy?\n\nAvoiding GST on fertiliser and pesticides is a big relief, but not big enough to help revive the sector. Until and unless agriculture becomes profitable, no amount of lip service will revive it, and, unfortunately, the government is not ready to go beyond verbal consolation and sloganeering, Mr Khokhar concludes.\n\nKhalid Khokhar\nPresident, Pakistan Kissan Ittehad\n\nThis happens when urban intellectuals sit with bureaucrats to save the agriculture sector. Results, invariably, are jargon-laden plans, which are heavy on terminology and fall way short of actions. Take it from me, next year will be even worse if corrective measures, not seen in the budget, are not taken.\n\nPublished in Dawn, The Business and Finance Weekly, June 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684f7111959e3.jpg",
  "retrievedAt": "2025-10-12T03:36:50.108Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917431/false-promises-and-avoiding-agricultural-necessities",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T01:29:47.000Z"
}
