{
  "title": "Islamabad admin orders removal of billboards amid rising windstorm threat - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Gusty winds disturb life in twin cities\n• One killed, 10 injured in Attock; three injured in Rawalpindi, residents forced to take steps to protect their vehicles and other property\n\nISLAMABAD: As windstorms have become rampant in the federal capital, the district administration has decided to remove billboards in the city to avoid the risk of accidents.\n\nOn Tuesday, a billboard fixed at the National Press Club (NPC) fell down due to a windstorm. Moreover, a number of trees were broken and several fiberglass shades on terraces and rooftops dislodged and fell onto the roads.\n\nDeputy Commissioner Islamabad Irfan Nawaz Memon directed that all billboards within the limits of the federal capital be removed.\n\nIt is worth mentioning that in urban areas, there are only two locations — NPC and Srinagar Highway (near G-13) - where billboards have been displayed. However, there are a number of billboards in the rural areas of the city which are also under the administrative control of the deputy commissioner.\n\nMeanwhile, after the windstorm, the district administration directed all field teams to remain in the field and deal with any kind of emergency situation. “All the assistant commissioners were also directed to keep an eye on low-lying areas to avoid the risk of floods,” a spokesperson said.\n\nLast month, a hailstorm lashed Islamabad and its surrounding areas, causing severe damage to vehicles, solar panels, and property, especially in sectors located near the Margalla Hills. The incident panicked residents as they experienced a similar, though slightly less intense, hailstorm just a few days later.\n\nThis has strengthened the belief and fear that the city will continue to face similar situations in the coming months and years. The windstorm on Tuesday again disrupted life in the federal capital and forced residents to take steps to protect their vehicles and other property. As soon as the gusty winds began, a number of bikers took refuge under bridges, fearing injury from the hailstorm.\n\nRawalpindi\n\nThree people, including two children, were injured in different areas as gusty winds battered the garrison city on Tuesday afternoon. The light rain, accompanied by gusty winds, lashed the twin cities while providing some relief to residents from the heatwave.\n\nThe wind speed was recorded at 50 knots (98 kilometres per hour) from north to west at Islamabad International Airport, and 45 knots (80km per hour) from south to west at Zero Point. The Met Office recorded nine millimeters of rain at the Islamabad airport, 1mm at Golra in Islamabad, 2mm at Shamsabad and 1mm at Chaklala in Rawalpindi.\n\nThough the gusty winds blew away some signboards and shelters, there were no reports of damage to public property. The wind and rain made the weather pleasant and provided some relief to people who had been facing scorching heat and humid conditions in the afternoon.\n\nDistrict Officer Emergency Sibghatullah told Dawn that due to strong winds, two incidents were reported in the garrison city. He said two children at Girja Road and one person at Mir Haider Colony were injured.\n\nThe two children were injured at home when an iron door on the roof fell during the thunderstorm. Rescue 1122 rushed to Malik Colony, Girja Road and shifted the children to Rawalpindi Teaching Hospital. The children were identified as Anabia Zara, aged 10 months, and Rajab Ali, 12 years.\n\nIn the second incident, a person fell from a ladder during the gusty winds at Mir Haider Colony near Ashra Mubashara Masjid. Rescue 1122 shifted him to Military Hospital.\n\nA Met official said moist currents were also penetrating the upper and central parts of the country. A westerly wave is also affecting the western and upper parts of the country.\n\nHowever, she added that hot and dry weather was expected in most parts of the country, but partly cloudy weather with rain-wind/thunderstorms at isolated places in Kashmir, Gilgit-Baltistan and upper Khyber Pakhtunkhwa.\n\nShe said the temperature was expected to rise again on Wednesday morning. Due to high pressure in the upper atmosphere, day temperatures are likely to increase in most parts of the country.\n\nTaxila\n\nA storm swept through various parts of Attock on Tuesday resulting in the death of one person and leaving 10 others, including five minors, injured. The storm accompanied by heavy rainfall, strong winds and hail caused widespread disruption, uprooting trees, damaging property, walls and causing roof collapses in various parts of the district.\n\nAccording to Rescue 1122, a passenger van overturned due to rain and duststorm on Ghazi-Lawrencepur road near Ghazi Interchange in the limits of Hazro police station, resultantly in the death of one passenger and injuring five other.\n\nSeparately, four children aged between nine and 12 years were injured when the wall of their house collapsed during the windstorm in the village Rehmo in the limits of the same police station.\n\nA 25-year-old woman received multiple injuries when the roof of her house collapsed in the limits of the same police station. Moreover, an eleven-year-old girl was critically injured when the wall of her house collapsed in Saghirabad area in the limits of Jand police station. Rescue 1122 shifted all the injured to health centres for medical treatment.\n\nAmjad Iqbal also contributed to this story from Taxila\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/281141358cd6469.jpg",
  "retrievedAt": "2025-08-23T14:31:45.459Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913768/islamabad-admin-orders-removal-of-billboards-amid-rising-windstorm-threat",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:53.000Z"
}
