{
  "title": "Foreign students wary of US as Trump presses ‘dehumanising’ campaign - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s expanding crackdown on elite universities is prompting some international students to abandon applications to campuses in the United States and spreading stress and anxiety among those already enrolled.\n\nThe president has upended the country’s reputation among foreign students, who number around one million, as he presses a campaign against US universities he sees as obstructing his “Make America Great Again” populist agenda.\n\nHe has blocked Harvard from hosting international scholars in a manoeuvre being challenged legally, targeted non-citizen campus activists for deportation, and most recently, suspended student visa processing across the board.\n\nHarvard applied mathematics and economics student Abdullah Shahid Sial, 20, said the Trump administration’s campaign against US universities which the president accused of being hotbeds of liberal bias and anti-Semitism, had been “dehumanising”.\n\n“It’s really unfortunate that this is the case for 18, 19, and 20-year-olds who came here without any family, and in most cases, haven’t been to the US before,” said Sial, who is from Pakistan and hopes to be able to return to Harvard next academic year.\n\nSial said he advised acquaintances to have backup plans if US colleges became inaccessible, and that a friend applied to Harvard’s law school, as well as Columbia’s, and two less reputable British institutions, ultimately opting to go to the UK.\n\n“He definitely liked Harvard way more [but] he doesn’t want this amount of uncertainty surrounding his education,” Sial said.\n\nKarl Molden, a Harvard government and classics student from Austria, said Trump’s move to block the university hosting and enrolling foreign students meant he was unsure if he would be able to return after summer vacation.\n\nWhile that decision — affecting some 27 per cent of the overall Harvard population — was paused by a judge pending a hearing Thursday, the move still threw student plans into chaos.\n\n“I kind of figured I would be in the target group of Trump. I’m personally right in the middle of it, so an option for me would be to study abroad … I have applied to study at Oxford because of all the ‘action’ taken by Trump,” said Molden, 21. “It’s just really hard.”\n\nHarvard academics say they have already started to feel the impact of Trump’s vendetta against the school, in feedback from colleagues based outside the United States.\n\n“I’ve already heard this from professors in other countries who say ‘we encourage our best students to go to the United States’,” Harvard professor Ryan Enos told AFP at a noisy rally against Trump’s policies Tuesday, adding “we wonder if we can tell them that anymore.”\n\nThe halt to visa processing revealed this week is reportedly to allow for more stringent screening of applicants’ social media and protest activity.\n\n“International students already represent the most tracked and vetted category of nonimmigrants in the United States. It is a poor use of taxpayer dollars,” said the NAFSA Association of International Educators non-profit.\n\nTrump, meanwhile, continued his assault on Harvard, saying university leaders have “got to behave themselves”.\n\n“Harvard is treating our country with great disrespect, and all they’re doing is getting in deeper and deeper,” he said on Wednesday in the White House.\n\nOne Spanish student of politics and statistics, who declined to be named for fear of retaliation, told AFP she would not be deterred from pursuing her planned year abroad at Columbia University.\n\n“It’s scary, because we think to ourselves that all our activity on social networks could be monitored, for example, if we like pro-Palestinian posts or anti-Trump posts. All of that could see us denied a visa,” she said.\n\nStudents due to return to Harvard after the summer break are in limbo pending a ruling on Harvard’s exclusion from the foreign student system.\n\n“I’m completely in the dark,” said 20-year-old Alfred Williamson, a Welsh-Danish physics and government student in his second year at Harvard. “As for my other options, and like all other international students, I’m just clinging on to the hope that Harvard will win this battle against the White House.”\n\nSial, the Harvard student from Pakistan, said foreign students like him were “made to fight this battle which no one signed up for.” “It’s really unfortunate that it’s come down to that. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/282352086be1196.jpg",
  "retrievedAt": "2025-08-23T14:31:27.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913897/foreign-students-wary-of-us-as-trump-presses-dehumanising-campaign",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T18:54:11.000Z"
}
