{
  "title": "PTI rally in Karachi demands disposal of all pending poll-related matters - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Tehreek-i-Insaf (PTI) on Tuesday staged a protest sit-in outside the office of the Election Commission of Pakistan (ECP) in the city, demanding the disposal of all pending electoral cases related to the Feb 8, 2024 general elections.\n\nThe party also demanded immediate hearing of all pending cases against party founder Imran Khan.\n\nLed by the party’s Sindh chapter president, Haleem Adil Sheikh, scores of PTI workers, including women and candidates who contested the Feb 8 polls, gathered outside the Sindh High Court and then marched to the ECP office in the form of a rally.\n\nCarrying banners, placards and party flags, the participants chanted slogans while walking towards the ECP offices.\n\nHaleem asks judiciary to fix cases against Imran for immediate hearing\n\nSeveral PTI leaders, including Khurram Sher Zaman, Alamgir Khan, Jamal Siddiqui, Aftab Jahangir, Advocate Abdul Wahab Baloch, Advocate Zahoor Mehsud, Barrister Ali Tahir, Fouzia Siddiqi and many others, attended the protest.\n\nThe rally reached the ECP office, where leaders and workers staged a sit-in.\n\nSpeaking on the occasion, PTI leader Sheikh demanded that all pending cases against party founder Imran Khan, including the Al-Qadir Trust case, be fixed for immediate hearings.\n\nHe also called for the suspension of the representatives allegedly seated in the assemblies through “fake” Form-47 results and the restoration of what he termed the nation’s “stolen mandate,” based on Form-45s.\n\nHe accused the authorities of “using” the judicial system to deprive the PTI of its reserved seats, and added that the party’s mandate had already been stolen during the general elections.\n\nCommenting on the Al-Qadir Trust case, he claimed that Imran Khan’s case had not yet been fixed for a hearing, despite assurances from the chief justice of the Islamabad High Court following a previous protest.\n\nMr Sheikh also mentioned that the PTI candidates declared winners as per Form-45s have not had their cases heard in election tribunals.\n\n“The true public representatives of Sindh are on the streets, while those seated in the assemblies are products of forged Form-47s,” he said.\n\nPTI-Karachi President Raja Azhar echoed same sentiments, saying the judiciary had failed to schedule hearings of their cases.\n\n“After the 26th Amendment, the independence of the judiciary has come under question,” he said and demanded swift judicial action on all election-related cases based on Form-45s.\n\nPTI leader Jamal Siddiqui described Imran Khan as a “leader of the Islamic world” and called for all “false” cases against him to be dismissed immediately.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68364f9ce2cb6.jpg",
  "retrievedAt": "2025-08-23T14:31:45.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913713/pti-rally-in-karachi-demands-disposal-of-all-pending-poll-related-matters",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:40.000Z"
}
