{
  "title": "Balochistan ex-senator Lashkari to challenge mines law in court - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Former senator Mir Lashkari Raisani, while rejecting the Mines and Mineral (Amendment) Act, said on Tuesday he would challenge it in a court to protect Balochistan’s resources and rights at all costs.\n\nSpeaking at a press conference, he said Balochistan’s resources are being looted with impunity. He called upon opposition members who handed over the province’s resources to ‘others’ to either bring a resolution against the act or resign from the parliament.\n\nThe former senator said that there was no genuine opposition in Balochistan and held all parties responsible for the plundering of the province’s resources.\n\nHe urged everyone to “play their part for the survival of future generations”.\n\nLashkari rejects legislation, vows to protect resources of Balochistan\n\nMr Raisani criticised the current assembly for passing the law, saying the province no longer has authority over its mineral resources and the people of Balochistan have become “strangers in their own land”.\n\n“We have decided to challenge the act in court and will take other political parties into confidence on the matter,” Mr Raisani said, adding that in 2013, a political deal led to the formation of a government that passed the DHA Act in just five minutes, transferring control of unmeasured lands to the federal government.\n\nIn contrast, the 2008 government had granted provincial autonomy and powers through the 18th Amendment, which were undermined between 2013 and 2018. The 2008 administration had decided to make Gwadar the winter capital, but that decision was later reversed.\n\n“During Aslam Raisani’s tenure, the Reko Diq agreement was cancelled, but a $600 billion asset was later handed over through suspicious means, involving political parties.” he claimed. Mr Raisani emphasised the responsibility of political activists and social leaders to raise public awareness.\n\n“Those who take shortcuts through chaos and instability in the province have reached the height of power, and their path must be blocked,” he added.\n\nHe said that the chief of Sarawan tribe, Nawab Muha­mmad Aslam Raisani, has always defended Baloch­istan’s resources and rights and has never been part of any deal involving their sale. He also boycotted meetings related to Reko Diq.\n\nAs chief minister, he had demanded a powerful commission to investigate killings in the province, but no action was taken.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:59.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913796/balochistan-ex-senator-lashkari-to-challenge-mines-law-in-court",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:11.000Z"
}
