{
  "title": "Mohsen wins landmark elections to become new Pakistan Football Federation president - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Mohsen Gilani knows how to win elections. The former FIFA development officer proved his expertise by winning an election where he wasn’t the frontrunner; upsetting the odds to become Pakistan’s new football chief.\n\nIn the first elections of the Pakistan Football Federation in a decade, Mohsen won a duel with former friend Taha Alizai, edging the vote for the president 13-11 on Tuesday. Till Monday night, the scales seemed to have tilted in Taha’s favour with the Karachi United founder having claimed to have the backing of 13 of the 24-member PFF Congress.\n\nBut with electioneering continuing till the secret ballot, it was Mohsen who got the absolute majority of the votes. Two rounds of voting were required for the president’s position – the first round requiring two/thirds majority. Mohsen’s margin of victory in the first round was also 13-11.\n\n“Achieving anything meaningful is difficult,” Mohsen told reporters following his election victory. “But the important thing is that Pakistan football has won today … after years of crisis, there is an elected leadership at the helm.”\n\nMohsen’s impromptu press conference took place while the elections of the rest of the PFF Executive Committee were still going on. He spoke about inclusivity in the PFF, about not being vindictive and working together with their election opponents.\n\n“We are one football family and we will be together,” said Mohsen, with two of three vice-presidents in the newly-elected PFF being those who were part of Taha’s panel.\n\nFor long, Mohsen has worked behind the scenes in Pakistan football. He said he came to the fore for elections held by the FIFA-appointed Normalisation Committee because he felt “it was time for him to step in”.\n\n“For years, Pakistan football has suffered due to governance issues which now have to be resolved.”\n\nPakistan football has been mired in crisis and controversy since it held its last elections in 2015. In 2019, FIFA decided to appoint a Normalisation Committee to oversee the sport’s affairs in the country but it still took six years for it to finally move towards elections.\n\nInitially, there were three presidential candidates — Hafiz Zakaullah being the other. However, an alliance was formed between Mohsen and Zaka, which saw the latter withdraw his candidature. Mohsen rebuffed recent media reports that the alliance would see him step down a year into his four-year tenure and allow Zaka to take over as PFF chief. “Our deal is to develop football together,” he said.\n\nLOOKING TO THE FUTURE\n\nThe long-anticipated elections done and over with, the transition period begins with the newly-elected PFF leadership taking over from the NC. Mohsen stressed that instead of dwelling on the past, the focus should shift towards building the future of Pakistan football.\n\n“Governance has been the core of our issues and I’ll look to strengthen that,” said Mohsen. “Then we have to establish competitions, focus on the progress of the national team, technical development and try to produce more coaches and referees.”\n\nBy the time the Electoral Congress ended, members of Taha’s panel had secured seven executive committee positions along with the two vice-president spots secured by Dr Mohammad Ali and Naveed Aslam Lodhi. Zaka was elected the other vice-president.\n\n“The beauty of this election is that the elected PFF comprises both panels and we will work together for the betterment of Pakistan football … we have to move on from the acrimony of the past,” Mohsen, whose panel won both executive committee positions from the Punjab province, said after he was garlanded with flowers.\n\nTwo executive committee positions from Khyber Pakhtunkhwa remain to be decided in the next PFF Congress. With most of the government departments and institutions having backed Taha in the election, Mohsen pleaded that the government will support the newly-elected PFF.\n\n“We have to promote the image of our country through football,” he said. “Football should be used for diplomacy, international cooperation and tourism. I request the government institutions to support us. Without their support, it cannot happen.”\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:59.136Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913780/mohsen-wins-landmark-elections-to-become-new-pakistan-football-federation-president",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:28.000Z"
}
