{
  "title": "Toddler allegedly tortured to death by father in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: An 18-month-old girl was allegedly tortured to death by her father in the Chaklala area, police said on Tuesday.\n\nPreliminary medical and police reports indicated that the toddler sustained bruises on her chin, blackened ears and multiple torture marks on her abdomen.\n\nAsia Kausar, a resident of Nasir Colony in Chaklala, lodged an FIR with the police, stating that she earns her livelihood by working as a maid in various homes. She said she got divorce from her first husband 10 years ago and had a nine-and-a-half-year-old daughter who lives with her grandmother.\n\nEight years ago, she married Hassan Iqbal, a resident of Chakwal. It was also Iqbal’s second marriage and he had a son from his previous marriage who lives in the village.\n\nShe said she had four children from her second marriage with Iqbal: Abira, six; Ajiha Fatima, five; Moosa Ali, four; and Anaya Fatima, the 18-month-old victim.\n\nAccording to Kausar, she left her house for work in Bahria Town at about 8:30am on Sunday, leaving her husband at home with the children. Around 4pm, her husband called and asked her to return home, claiming Anaya had fallen down the stairs.\n\nWhen she reached home, she discovered that her husband had already taken their daughter to Benazir Bhutto Hospital (BBH). She rushed to the hospital and found her daughter lying dead on a stretcher in the emergency ward with her husband standing nearby.\n\nShe said Anaya’s body showed clear signs of torture, including bruises and blackened eyes. When she questioned her husband, he slipped away from the emergency ward.\n\nKausar stated that her daughter Abira told her that Anaya had been kicked, punched, and thrashed by her father. She added that her husband had a history of torturing their children.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:42.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913763/toddler-allegedly-tortured-to-death-by-father-in-rawalpindi",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:53.000Z"
}
