{
  "title": "Pakistan highlights US role in easing tensions with India - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Following deadly clashes in May that claimed over 50 lives, Pakistan’s ambassador to the United States, Rizwan Saeed Sheikh, on Tuesday highlighted America’s role in easing recent India-Pakistan tensions while delivering a pointed warning about New Delhi’s “ideological drift” and regional ambitions.\n\nIn briefings, Ambassador Sheikh praised the US, particularly President Donald Trump, for helping defuse the situation. “The US has played a key role in the ceasefire between India and Pakistan,” Mr Sheikh said.\n\nHe noted that Pakistan appreciated the US president’s “ongoing interest in resolving the Kashmir dispute.”\n\n“We hope these efforts will continue and the issue will be resolved as per the established framework,” he added.\n\nMr Sheikh identified Kashmir and water as “twin fault lines.”\n\nHe accused India of attempting to turn water into a coercive tool.\n\n“Blocking water for a population of 250 million would be considered a declaration of war,” the ambassador warned, referencing India’s move to hold Indus Waters Treaty in abeyance.\n\nA Pakistani delegation, expected in Washington from June 3 to 6, will raise India’s recent suspension of the treaty, which Islamabad deems a violation of international norms.\n\nAccusing Indian leaders of promoting a “terrorist mindset”, Ambassador Mr Sheikh also focused on what he described as India’s “ideological hardening” under Hindutva. “Statements from Indian leadership are fuelling tensions and reflect the terrorist mindset of Hindutva ideology,” Mr Sheikh said.\n\nHe pointed to a map of “Akhand Bharat” displayed in the Indian Parliament as “a reflection of hegemonic mentality and sinister intentions”.\n\nAdditionally, Mr Sheikh drew attention to India’s alleged role in destabilising Balochistan.\n\n“India’s role in Balochistan is no secret,” he said.\n\n“Terrorists and their ideological and financial patrons, who stain their hands with the blood of innocent children, are the worst examples of humanity. These people are a disgrace to humanity.”\n\nIslamabad’s strategic message, conveyed by Mr Sheikh, is that while Pakistan is ready for peace, India’s ideological direction and regional behaviour present a persistent, structural threat to South Asian stability, making the recent conflict more than an isolated incident.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:59.196Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913798/pakistan-highlights-us-role-in-easing-tensions-with-india",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:11.000Z"
}
