{
  "title": "KP govt asked to lift eight-year ban on import of animals from Afghanistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The demand for lifting of eight-year-old ban on import of sacrificial animals from Afghanistan via Torkham border has gained momentum again in local circles in Khyber as Eidul Azha draws closer.\n\nTehsil chairman Shah Khalid chaired a meeting of local elders, livestock dealers and civil society activists in Landi Kotal on Tuesday that unanimously called for lifting of the ban submitting that livestock dealers were ready to fulfil all legal requirements for import.\n\nThe meeting reminded relevant authorities that people residing close to both sides of the border in all countries were entitled to relaxation in cross-border movement along with import of ‘necessary items’ as per requirements of local community without any trade documents and complicated customs formalities.\n\n“In keeping with the internationally recognised border norms and our decades-old traditional ties with tribes across the border, we appeal to relevant authorities to allow local livestock dealers to bring Afghan sheep to this side of the border prior to Eidul Azha,” the meeting demanded.\n\nLivestock dealers pledge to fulfil all legal formalities for the process\n\nPakistan imposed a ban on import of sacrificial animals from Afghanistan, especially sheep, in September 2017 while demanding of the livestock dealers to fulfil legal requirement of two weeks quarantine of all the animals.\n\nPrior to imposition of the ban, local dealers would bring an unspecified number of sheep from Afghanistan throughout the year while paying a nominal amount to the erstwhile political administration in former Fata (Khyber Agency).\n\nThe ban in September 2017 not only affected livestock business but also unearthed the clandestine deal between the previous political administration, custom authorities and livestock dealers.\n\nThe issue had been lingering since then with livestock dealers and locals vehemently demanding lifting of the ban as it had resulted in considerable increase in prices of sheep and mutton in local market.\n\nLivestock dealers during the Tuesday’s meeting in Landi Kotal said that while they agreed to fulfil all legal requirements for sheep import, the ministries of livestock and commerce in Islamabad were dragging their feet on issuing them permits for legal import of a specified number of sacrificial animals.\n\nThey informed the meeting that local veterinary staff had also agreed to establish a quarantine centre with a capacity of keeping 2,000 sheep for a one week mandatory quarantine period.\n\nThey said that custom authorities and clearing agents too were willing to cooperate in import of sacrificial animals from Afghanistan. They said that the Afghan government too had off late set the condition of allowing Afghan dealers to bring cattle from Pakistan.\n\nLivestock dealers said that with the continued ban on import from Afghanistan, they were compelled to purchase sacrificial animals, especially sheep, from local market at higher prices and sell them at inflated prices to consumer prior to Eidul Azha.\n\nMeanwhile, National Logistic Cell authorities send the faulty electronic scanning machine to Islamabad on Tuesday as the technical fault it developed on Friday could not be removed till Tuesday.\n\nNLC officials said that the faulty scanning machine would be examined by Chinese technicians in Islamabad and would be brought back once it was repaired.\n\nThe malfunctioning of the export scanning machine has badly affected export to Afghanistan during the last five days with customs officials resorting to manual examination of hundreds of stranded vehicles to clear the backlog.\n\nThe other scanning machine was repaired locally on Sunday which helped in restoring import from Afghanistan.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:41.909Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913753/kp-govt-asked-to-lift-eight-year-ban-on-import-of-animals-from-afghanistan",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:59.000Z"
}
