{
  "title": "7 dead as rainstorms wreak havoc in parts of country - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Three die in Azad Kashmir due to ‘cloud-burst’; two each killed in KP, Punjab\n• Babusar Top receives heavy snow; authorities say extreme conditions likely to persist through May 31\n\nISLAMABAD: Seven people were killed and over two dozen others sustained injuries on Tuesday as severe rain and windstorms swept through parts of Punjab, Khyber Pakhtunkhwa, as well as Azad Jammu and Kashmir (AJK).\n\nThis is the second time in a week that a storm of such intensity wreaked havoc in many parts of the country, damaging crops, properties, and other infrastructure. At least 19 people were killed and over 90 others injured as powerful windstorms and heavy rains had battered many areas in Islamabad, Punjab and KP on Saturday.\n\nOn Tuesday, two people were killed and around 20 injured after a thunderstorm swept through various parts of Punjab. The storm, accompanied by heavy rainfall, strong winds, and hail, caused widespread destruction.\n\nAccording to Rescue 1122, a passenger van overturned due to rain and dust storm on Ghazi-Lawrencepur Road near Ghazi Interchange in Attock, which resulted in the death of one passenger and left five others injured.\n\nSeparately, four children aged between nine and 12 years were injured when the wall of their house collapsed during the windstorm in Rehmo village of Attock district. Also, a 25-year-old woman received multiple injuries when the roof of her house collapsed in the same area. An 11-year-old girl was critically injured when the wall of her house in Saghirabad area of Attock collapsed.\n\nAccording to the Rescue 1122’s provincial headquarters, a man was killed after lightning struck him in Mianwali’s Kalabagh.\n\nThe district experienced multiple emergencies including a wall collapse that left one person injured at the Makkharwal police station and a falling solar panel that inju­red another resident.\n\nIn Gujran­wala, a young girl fell from roof due to powerful gusts.\n\nIn Taunsa Sharif, a woman was injured when the wall of her house collapsed.\n\nThree people, including two children, were inj­ured in Rawalpindi as gusty winds battered the garrison city in the afternoon.\n\nAccording to the PDMA, these ext­r­eme conditions are likely to persist through May 31, with upper and central Punjab districts inc­luding Rawalpindi, Lahore, Gujranwala and Faisalabad, facing the highest risk.\n\nTwo killed in KP\n\nIn Khyber Pakhtun­khwa, two people lost their lives and another 10 sustained injuries in rain-related incidents.\n\nRains lashed many areas of the province, leaving several people injured.\n\nA child died while four others were injured in a roof collapse incident in Swabi. Another person died and three members of the same family were injured in a lightning strike in Shangla district. In the Mattani area of the provincial capital, three persons were injured when the roof of their house collapsed, while another one was injured in another rain-related incident in the Badershi area of Nowshera district.\n\nThe upper parts of the Hazara division on Tuesday received heavy downpour and snowfall, blocking the Karakoram Highway to all sorts of traffic at two locations in the Lower Kohistan.\n\n“The floodwater carrying heavy rocks and stones from nearby mountains blocked the Karakoram Highway at two points in our district,” Mohammad Duraj, an official from Rescue 1122, Lower Kohistan, told reporters. Babusar Top, the highest point in the Kaghan Valley, received heavy snowfall, significantly dropping temperatures across the district.\n\nKP’s Provincial Disaster Management Authority (PDMA) in a statement issued here said that the spell will continue till May 30. It said the rain caused widespread damage to the crops.\n\nPDMA said wheat, vegetables and fruit crops were badly damaged in Mardan and its surrounding areas due to the hailstorm. Besides, rains also disrupted the power supply across the province as 113 of Peshawar Electric Supply Company tripped due to rain and thunderstorm.\n\nThree killed in AJK\n\nIn Kashmir, three women lost their lives and a man went missing while several properties were damaged after a “cloudburst-induced flood” wreaked havoc in a suburban area of Muzaffarabad on Tuesday afternoon, officials said.\n\nSaeed Qureshi, a senior director at the State Disaster Management Authority (SDMA), told Dawn that the “cloudburst” triggered a flood in a water channel in Balgran village, located around 35 kilometres from Muzaffarabad on the right bank of the Neelum River, at about 4pm.\n\nAmong the victims were Zaiwar Jan, 75, and her daughter Shireen Bibi, 35, who died when the raging current swept into their house and filled it with mud.\n\nStation House Officer (SHO) of Panjgran Iftikhar Awan, who spoke to Dawn from the affected village, said the mother’s body was recovered immediately, while the daughter’s body was later pulled from the debris.\n\nIn another severely affected house nearby, rescuers found 35-year-old Gori Bibi critically injured and unconscious. She was rushed to the Tehsil Headquarters Hospital in Patikka, where she succumbed to her injuries later in the evening.\n\nGori Bibi’s father, 65-year-old Jalal Deen, was reported missing.\n\n“We have been trying to locate him, but to no avail,” said SHO Awan.\n\nVideos shared by residents showed muddy water gushing through the ground floor of the village’s main mosque, which was built almost along the course of the water channel, where water flow is usually minimal. According to SHO Awan, the flood, which lasted for about half an hour, completely destroyed the mosque.\n\nMr Qureshi from the SDMA said initial assessments indicated partial damage to 20–25 houses and the mosque. However, SHO Awan feared that the figure could be higher. “At the moment, our priority is to assess the human losses. Material damages will be evaluated in daylight on Wednesday,” he said.\n\nSeparately, in Islamabad, the district administration decided to move billboards out of the city after a hoarding fixed at the National Press Club collapsed due to a windstorm that had also uprooted several trees.\n\nImran Gabol in Lahore, Manzoor Ali in Peshawar, Amjad Iqbal in Taxila, Aamir Yasin in Rawal­pindi, Ikram Junaidi in Islamabad, and Tariq Naqash in Muzaffarabad contributed to this report\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683664f1c8ef0.jpg",
  "retrievedAt": "2025-10-12T03:20:01.583Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913807/7-dead-as-rainstorms-wreak-havoc-in-parts-of-country",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:27:57.000Z"
}
