{
  "title": "Mother turns out killer of her two children in Gujrat - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: A woman turned out to be the killer of her two minor children in the Rangpur locality of the city as A-Division police on Tuesday claimed to have resolved the mystery of the double murder case.\n\nThe suspect confessed to strangling her five-year-old son and three-year-old daughter to contract a second marriage with a man.\n\nA spokesman for Gujrat police said Shafay and Naimat, the children of one Usman Ahmed, were found dead under mysterious circumstances at their house on Feb 6. The police had lodged a murder case against unidentified suspects. Their mother, Nazish Usman, went missing some days after the incident and police lodged a kidnap case against unidentified suspects.\n\nDistrict Police Officer Dr Mustanser Atta Bajwa constituted a team under the DSP city circle to trace the suspects involved in both cases.\n\nShe strangled her son, daughter to contract second marriage\n\nLater, the police traced and detained Nazish who revealed that she wanted to contract marriage with Samar Abbas of village Mohlan Kalan who had asked her to first eliminate her children if she wanted to marry him. At this, she had killed her children through asphyxiation.\n\nPolice said Samar Abbas had fled abroad and the process for his arrest through Interpol had been initiated.\n\nHONOUR KILLING: A youth was gunned down for contracting a love marriage allegedly by firing of his wife’s father and brother at village Majra near Kunjah.\n\nMuhammad Jameel had contracted a court marriage with Habeeba Fatima of village Saroki some time ago and the couple was living at village Majra.\n\nOn Tuesday, Jameel along with Habeeba and other family members was going home on a motorcycle-rickshaw near Govt Primary School, Majra, when the suspects, including Habeeba’s father Shahid Manzoor and her brother Sajawal Sandhu intercepted them.\n\nThe armed suspects opened firing at Jameel, leaving him critically injured. He was shifted to Kunjah Shabbir Sharif Hospital where doctors referred him to the Aziz Bhatti Shaheed Teaching Hospital due to the critical condition. He breathed his last at the ABSTH.\n\nThe police have registered a case against the nominated suspects on the report of Shakeel, brother of the deceased.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:31:45.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913731/mother-turns-out-killer-of-her-two-children-in-gujrat",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:47.000Z"
}
