{
  "title": "Murad says Sindh takes lead in innovation investment - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah has reaffirmed his support for universities and their research and development initiatives, stating that this is the only sustainable approach to fostering a strong economic environment in the province by harnessing the potential of the youth in a constructive and productive manner.\n\nAddressing the 1st Sindh Innovative Start-ups Exhibition 2025, organised by the Sindh Higher Education Commission (SHEC) in collaboration with the Federation of Pakistan Chambers of Commerce and Industry (FPCCI) at the Federation House on Tuesday, he pointed out that Sindh allocates the most funds for the universities among all provinces.\n\nHe sought FPCCI’s role in investments into the technology startups in the province through matchmaking.\n\nHe said the event is not merely another academic event; it is a statement, and Sindh is ready to invest in innovation, talent, and the future.\n\nHe urged all vice-chancellors and university leaders to draw inspiration from this initiative and leverage their Offices of Research, Innovation, and Commercialisation (ORICs) to cultivate a local culture of invention, entrepreneurship, and applied research.\n\nMr Murad said the provincial government allocates the highest development budget for universities, amounting to Rs35 billion, with an additional Rs8bn for development portfolios. This funding surpasses the combined allocations of the other three provinces and the federal government, he claimed.\n\nWhile urging the youth to contribute to national investment and defence, he said during the recent conflict with India, the power of the people combined with technology played a vital role.\n\nHe was of the view that universities produce not just graduates but innovators, creators, and problem-solvers and that developing platforms for student and faculty engagement with industry is crucial.\n\nAccording to FPCCI’s press release, Dr Tariq Rafi stressed that the exhibition is a major initiative that SHEC and FPCCI have worked on together like previously launching the Sindh Research Support Programme, besides organising events spotlighting university-based inventions aimed at bringing local solutions to local industries.\n\nFPCCI President Atif Ikram Sheikh believed that the future of Pakistan’s economy lies in innovation, entrepreneurship and knowledge-based collaboration.\n\nThe time has come for industry to open its doors to academia — not just as a partner; but as a driver of future growth and competitiveness.\n\nSaquib Fayyaz Magoon, FPCCI Senior Vice-President, said that industries lead innovation all over the world with the help of universities, as they can determine real-world needs and market-driven uses of technologies.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68368196a5b1d.jpg",
  "retrievedAt": "2025-10-12T03:19:50.326Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913824/murad-says-sindh-takes-lead-in-innovation-investment",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T03:18:14.000Z"
}
