{
  "title": "King Charles highlights Canadian ‘self-determination’ as Trump looms - World - DAWN.COM",
  "author": null,
  "content": "OTTAWA: King Charles III stressed Canada’s proud independence on Tuesday as he delivered a major speech to open parliament in Ottawa set against US President Donald Trump’s threat to take over the country.\n\n“Democracy, pluralism, the rule of law, self-determination, and freedom are values which Canadians hold dear, and ones which the government is determined to protect,” Charles said, adding that Canada was facing a “critical moment.” Prime Minister Mark Carney invited the 76-year-old British monarch — who is the Canadian head of state — to the capital, accompanied by Queen Camilla.\n\nThe king has never publicly commented on Trump’s repeated talk of making Canada the 51st US state, but his language was closely watched for veiled references. Although the speech was read by the king as if his own words, it was written by the prime minister’s office to set out the government’s priorities to “build Canada strong” and how it aims to achieve them.\n\nIn addition to his annexation threats, Trump has also launched tariff wars, particularly targeting Canada, a member of the 56-nation British Commonwealth. “The system of open global trade that, while not perfect, has helped to deliver prosperity for Canadians for decades, is changing,” Charles said, in cautious words. “We must be clear-eyed: the world is a more dangerous and uncertain place than at any point since the Second World War.”\n\n‘Symbolism’\n\nThe speech was delivered in the Senate — a former railway station that has been converted while parliament undergoes renovations — with past prime ministers, Supreme Court justices and Indigenous leaders in feather headdresses in attendance.\n\n“You see the enthusiasm for our institutions,” Carney said in reference to cheering crowds awaiting the king. “Our sovereignty is strong.” King Charles’s “speech from the throne” was the first by a monarch in nearly half a century. It was delivered by Charles’s mother, the late Queen Elizabeth II, in 1957 and 1977.\n\n“In terms of symbolism, it’s extraordinary,” said Felix Mathieu, a politics professor at the University of Quebec in Outaouais. Tuesday’s event, Mathieu said, was a message to Trump to show him that “Canada is not alone in this fight.” Carney has vowed to oversee the biggest transformation of Canada’s economy since the end of the Second World War to enable it to “stand up” to Trump.\n\nCharles said in the speech that Canada would also “build new alliances” and seek out “reliable trading partners and allies around the world,” while reinvesting in its military and Arctic defence.\n\n“Canada is ready to build a coalition of like-minded countries that share its values, that believe in international co-operation and the free and open exchange of goods, services, and ideas,” he said.\n\nFestive welcome\n\nThousands gathered along a parade route for a chance to see their monarch arriving in a carriage escorted by Royal Canadian Mounted Police horses. The atmosphere was festive with people waving Canadian flags, a 21-gun salute and a fighter jet flypast. The king stopped several times to speak with people along a security fence before and after his speech.\n\nKirsten Hanson, 44, said she welcomed the king’s show of support as the pressure grows from the United States. “If there’s anything that he can do to demonstrate Canada’s sovereignty I think that that’s fantastic,” she said.\n\n“Nobody wants to be absorbed into the US.”\n\n“Elbows up,” said Marion Hand, 88, in reference to Carney’s battle cry in the face of Trump’s annexation threats. She traveled from Mississauga, Ontario for the event and was visibly giddy after a handshake with the king and queen.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6836604cf1a06.jpg",
  "retrievedAt": "2025-10-12T03:19:54.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913781/king-charles-highlights-canadian-self-determination-as-trump-looms",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:34.000Z"
}
