{
  "title": "US halts new student visa interviews as it weighs social media vetting - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The Trump administration has ordered a halt to new student visa interviews as it considers requiring foreign students to undergo social media vetting as part of their application to study in the United States, Politico reported on Tuesday, citing a diplomatic cable.\n\nLast week, Homeland Security Secretary Kristi Noem revoked Harvard’s ability to enroll foreign nationals, throwing the future of thousands of students and the lucrative income stream they provide into doubt.\n\nShe had threatened last month to block international students at the school unless it turned over records on visa holders’ “illegal and violent activities.” But a judge quickly suspended the move after the university sued to “stop the government’s arbitrary, capricious, unlawful, and unconstitutional action.” There will be an injunction hearing on Thursday, a court filing showed.\n\nHarvard President Alan Garber said in a statement that the attempted foreign students ban “imperils the futures of thousands of students and scholars across Harvard and serves as a warning to countless others at colleges and universities throughout the country who have come to America to pursue their education and fulfill their dreams.”\n\nIn addition to undermining the independence of storied US universities — which attract top students from around the world and produce much of the country’s lucrative scientific research — Trump has sought to dismantle the government’s traditional soft power tools, including humanitarian aid and the Voice of America radio network.\n\nMeanwhile, the US government intends to cancel all remaining financial contracts with Harvard, a senior official said on Tuesday, in President Donald Trump’s latest attempt to force the prestigious university to submit to unprecedented oversight.\n\nThe administration “will send a letter to federal agencies today asking them to identify any contracts with Harvard, and whether they can be canceled or redirected elsewhere,” the official said.\n\nThe ending of contracts — estimated by US media to be worth $100 million — would mark the severance of business ties between the government and an institution that is both the country’s oldest university and a global research powerhouse. Amid a broad push to amass power in the White House, Trump has singled out Harvard for particularly fierce punishment.\n\nHis administration accuses the Cambridge, Massachusetts university of permitting anti-Semitism and pervasive liberal bias.\n\nHarvard has rejected orders to allow a series of extraordinary measures, including an audit of political leanings on campus and a ban on students deemed to be “hostile to the American values.”\n\nIn the last few weeks, the elite educational bastion has seen billions of dollars in federal grants frozen and an attempt — paused last Friday by a court ruling — to end its ability to host foreign students.\n\nThe university is fighting back, arguing that the Trump attacks are unconstitutional and would cripple its ability to function.\n\nOn Monday, Trump vowed he would prevail in the increasingly public struggle. In a social media post he claimed that foreign students at Harvard included “radicalised lunatics, troublemakers.”\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:19:31.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913788/us-halts-new-student-visa-interviews-as-it-weighs-social-media-vetting",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:28:34.000Z"
}
