{
  "title": "SBP buys $6bn to bolster its forex reserves - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The State Bank of Pakistan (SBP) has purchased $5.9 billion from the currency market since June 2024 to bolster its reserves despite receiving support from the International Monetary Fund (IMF) and friendly countries.\n\nThe higher remittance inflows provided sufficient room for the State Bank to purchase dollars, but it was unable to achieve the target it had projected for itself.\n\nFollowing unexpectedly higher inflows from overseas Pakistanis, the SBP revised its foreign exchange reserves target to $14 billion and remittances to $38bn for FY25.\n\nAccording to Topline Securities, the SBP purchased $223 million in February, while the total dollar buying reached $5.9 billion from June 2024 to the end of February.\n\nThe SBP reserves, after the inflow of $1 billion from the IMF on May 16, reached $11.5 billion, reflecting that about half of the reserves were increased through the purchase of dollars from the market. The SBP has been buying dollars from the currency market, but this year, the amount of purchased dollars could be a record.\n\nWith the inflow of the second tranche under the $7bn Extended Fund Facility, Pakistan expects to receive $1.4bn in climate funding already approved by the IMF under its Resilience and Sustaina­bility Facility (RSF).\n\nThe financial sector believes that Pakistan has reached a deal with the United Arab Emirates for $1bn. The money may come this month or early next month.\n\nExperts in the financial sector felt that following a strong and effective response to Indian aggression, Pakistan had restored its regional position, and foreign investors could view the country as a stable economy for long-term investment.\n\nHowever, the foreign direct investment (FDI) during the first 10 months remained slightly below that last year. It is believed that long-term regional peace following the Indian misadventure could attract a large number of foreign investors.\n\nAlthough the country has experienced poor economic growth over the last three years, leading to significant unemployment, it is in a comfortable position, with a current account surplus of $1.88 billion during the first 10 months of FY25.\n\nDespite a comfortable level of dollar liquidity in the market, currency dealers recently stated that the SBP has maintained restrictions on imports.\n\nThe April trade deficit was record high, while the repatriation of profits on foreign investments was also unprecedented in FY25. Some currency dealers said the SBP does not allow imports easily. This is common in the financial market that the State Bank not only buys dollars from the market but also manages the exchange rate.\n\n“The SBP gets dollars from the currency market easily but is not enough since the country needs $26.2bn for debt servicing in FY25 while an identical amount would be required for FY26,” said an analyst.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:18:56.718Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913825/sbp-buys-6bn-to-bolster-its-forex-reserves",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T03:24:21.000Z"
}
