{
  "title": "In world first, Mexican voters to elect all judges - World - DAWN.COM",
  "author": null,
  "content": "Mexico is set to become the world’s only country to let voters elect all of their judges, sparking sharp disagreement about whether the reforms will diminish or strengthen criminal influence over the courts.\n\nThe government says the unprecedented popular vote for judges and magistrates at all levels — including the Supreme Court — is needed to address rampant corruption and impunity.\n\nCritics argue it will undermine the judiciary’s independence and warn the participation of controversial candidates — such as a former lawyer for notorious drug lord Joaquin “El Chapo” Guzman — means it is doomed to backfire.\n\nOn Sunday, voters will choose several thousand federal, district and local judges and magistrates. Another election for the remainder will be held in 2027.\n\nNot just anybody can run for one of these jobs. Candidates must have a law degree, experience in legal affairs, what is termed “a good reputation,” and no criminal record.\n\nOpponents, including judicial workers, have held a series of mass street protests in an unsuccessful attempt to stop the reforms.\n\n“Justice is not something you vote for”, and it needs people with experience and specialised knowledge, said Olimpia Rojas Luviano, a 28-year-old lawyer.\n\nBut Maria del Rocio Morales, a judge who is standing to be a magistrate in the capital, said she was happy to take part.\n\n“For the good of my city and my country, I will do it,” she said.\n\nPresident Claudia Sheinbaum has played down signs that many voters are unlikely to take part in the vote.\n\n“People are very intelligent and know who they are going to vote for,” the veteran left-winger said.\n\nAccording to surveys by the El Universal and El Pais newspapers, only half of voters know the election date and only four out of 10 are certain they will participate.\n\nWhile judicial elections are not new — the United States and Bolivia, for instance, allow voters to pick some judges — Mexico will be the only nation to elect them at all levels.\n\nThe reform was championed by Sheinbaum’s predecessor and mentor Andres Manuel Lopez Obrador, who criticised the judicial system as “rotten,” corrupt and serving the interests of the political and economic elite.\n\nMexico has a long history of human rights violations that remain unpunished, including the disappearance of 43 students from a teacher training college in 2014, allegedly at the hands of drug traffickers and corrupt authorities.\n\nDespite dozens of arrests, there have been no convictions.\n\nMexico’s criminal justice system “is profoundly ineffective at ensuring accountability for criminal violence and abuses by security forces,” according to New York-based Human Rights Watch.\n\nLopez Obrador frequently clashed with the judiciary, in particular the Supreme Court, which impeded some of his policies.\n\nSheinbaum, who replaced him in October, is a staunch supporter of the sweeping changes. Her opponents say they will eliminate democratic checks and balances.\n\nSheinbaum’s ruling party already dominates both houses of Congress.\n\nOpponents warn that elected judges could be more vulnerable to pressure from criminals, in a country where powerful drug cartels regularly use bribery and intimidation to influence officials.\n\nRights group Defensorxs has identified around 20 candidates it considers “high risk” for reasons including allegations of cartel links, corruption and sexual abuse, even though one of the requirements for running is to have no criminal record.\n\nThese people include Silvia Delgado, a former lawyer for “El Chapo,” the Sinaloa cartel co-founder imprisoned in the United States.\n\nDefensorxs describes her as a candidate who “defends alleged drug traffickers.”\n\nDelgado, who is standing to be a judge in the northern state of Chihuahua, told AFP: “Every person has the right to counsel.”\n\nAnother controversial candidate seeking to be a district judge in the northern state of Durango served prison time in the United States for drug crimes, according to Defensorxs.\n\nA major concern for voters is the complexity of a vote that will require people in Mexico City to mark nine ballots for local and federal judges.\n\n“I think even the people who devised it don’t know how to do it,” said Rojas Luviano.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/282215331211353.jpg",
  "retrievedAt": "2025-08-23T14:31:21.996Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913890/in-world-first-mexican-voters-to-elect-all-judges",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T17:17:47.000Z"
}
