{
  "title": "Government plans curbs, incentives to push cashless economy - Business - DAWN.COM",
  "author": null,
  "content": "• Finance minister vows to shift tax burden away from salaried class, other documented sectors\n• Meets commercial banks, regulators, industry bodies to gather input for budget\n• Stakeholders agree incentives must make digital payments more appealing than cash\n• Ceramic tile manufacturers say import dependence cut from 74pc to 4pc\n• New digital financing model being developed to support small-scale farmers\n\nISLAMABAD: As part of pre-budget consultations with stakeholders, Finance Minister Muhammad Aurangzeb on Tuesday promised to shift the tax burden away from the salaried class and documented sector to others through digitisation, and hinted at major steps towards the compulsory use of digital payments to maximise a cashless economy and increase documented transactions.\n\nA Ministry of Finance team, led by the minister, had a series of meetings with commercial banks, development financial institutions, regulators and industrial representatives, including ceramics manufacturers and steel producers, to discuss policy measures for inclusion in the next year’s federal budget.\n\nSome of the proposals finalised during these meetings are believed to be strategic in nature to capture most of the undocumented economy through digitisation, including additional tax measures on cash transactions, incentives on digital payments and outrightly blocking cash payments in certain critical sectors to be identified by the Federal Board of Revenue with the support of Karandaaz, the Pakistan Revenue Automation Limited and the banking sector.\n\nOne of the meetings on accelerating Pakistan’s transition to a digital and less cash-dependent economy finalised a host of measures for inclusion in the federal budget to expand access to digital financial services, encourage the use of digital transactions, and reduce reliance on cash in everyday economic activity.\n\nThe meeting decided to fine-tune measures for the budget given the fact that digital payment options were widely available and accessible across various sectors, including retail, services and public sector transactions.\n\nThe participants supported steps that would encourage broad-based interoperability, leveraging Raast instant payments system in particular, leading to improved consumer choice in using digital payments platforms, according to a statement.\n\nThe meeting agreed that creating a more level playing field between cash and digital transactions was essential, and that incentive structures should be rebalanced to make digital payments more attractive and cost-effective for both consumers and businesses.\n\nThe importance of imp­r­oving cost structures related to digital transaction infrastructure, including merchant acquisition and service provision, was taken as a priority to enable wider outreach, especially for small merchants and underserved communities.\n\nThe finance minister believed that moving towards a cashless economy was not simply a policy aspiration, but a practical necessity for long-term fiscal resilience, competitiveness and inclusive growth.\n\n“Digitalisation is the foundation of a modern financial system. We must move with urgency and coordination to create a payments environment that is inclusive, interoperable, and focused on ease of use for every Pakistani citizen,” he said.\n\nEngagements with industry\n\nIn a meeting with a delegation of the All Pakistan Ceramic Tiles Manufacturers Association (APCTMA) and Pakistan Association of Large Steel Producers (PALSA), Mr Aurangzeb said the government was committed to shifting the tax burden away from the already compliant formal sector and the salaried class towards segments of the economy that have so far remained undocumented or under-taxed.\n\nThe prime minister is personally leading high-level meetings to drive forward reforms that enhance transparency, documentation and economic equity across all, he said, adding that broadening the tax base is essential to achieving fiscal balance and promoting fairness in the economy.\n\nThe ceramic tiles manufacturers reported the manufacturing capacity at about 560,000 square metres per day, backed by over Rs100 billion in investments, nearly 60 per cent of which is foreign direct investment from China. They said the industry has reduced import dependency from 74pc to just 4pc and now relies almost entirely on local raw materials and labour.\n\nThe minister also assured the delegation that reforms in the energy sector were a top policy priority and envisaged a series of measures aimed at improving affordability, ensuring reliability, and moving towards a more efficient and targeted energy pricing structure.\n\nHe also pledged to simplify regulatory procedures, reduce compliance burden, and create a stable and predictable policy environment to attract further investment.\n\nCredit access for small farmers\n\nThe finance minister also chaired a meeting of the Task Force on National Initiative to Unlock Un-Collateralised Credit for Small Farmers Through Tech-Driven Solutions. He reviewed the recommendations for the National Subsistence Farmers Support Initiative, aimed at unlocking uncollateralised financing for small-scale farmers through innovative, technology-based solutions and enhanced access to credit.\n\nThe proposed scheme would employ an end-to-end digital process to ensure transparency, efficiency, and a seamless customer experience.\n\nDesigned as a federal programme with nationwide coverage, the initiative aims to align provincial and national efforts to boost agricultural productivity, enhance food security, and contribute meaningfully to GDP growth through inclusive agri-development.\n\nA revised scorecard was presented by the task force with a greater emphasis on agronomic factors — raising the weightage of agronomy from 40pc to 60pc — while maintaining a 40pc weight on financial indicators, thereby rebalancing priorities to better reflect the realities of smallholder farming.\n\nThe prototype scheme, developed by the Ministry of Finance’s Task Force on Access to Finance, calls for a multi-bank and microfinance institution (MFI) delivery model implemented through a unified methodology, ensuring wide outreach and operational standardisation across financial institutions.\n\nIt was decided to make the entire process time-bound and action-oriented to achieve lasting impact and then replicate a parallel, tech-supported model for the dairy and livestock segment, as most smallholder farmers maintain herds but faced difficulties in securing financing for livestock acquisition, maintenance, and dairy product marketing.\n\nThe delegation of Large Steel Producers raised critical challenges facing the steel industry, including high energy costs, regulatory inconsistencies, and the need for a stable policy environment to ensure long-term investment and growth. They also highlighted the impact of taxation policies on formal businesses and sought government support to level the playing field.\n\nThe finance minister promised to resolve these challenges and reiterated that every sector must play its role in stabilising and growing the economy.\n\n“We cannot allow the burden to fall solely on the formal sector and the salaried class,” he was quoted as saying, adding that the government was pursuing a broad-based strategy to expand the tax base, reduce reliance on over-taxed segments and bring the undocumented economy into the fold.\n\nPublished in Dawn, May 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:20:19.945Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913808/government-plans-curbs-incentives-to-push-cashless-economy",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T01:27:57.000Z"
}
