{
  "title": "Premier hails $2bn investment by Maersk - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Tuesday stressed the need for establishing Pakistan as a reliable and effective economic corridor for transit trade in the region to ensure development of the national economy.\n\nDuring a meeting with Robert Maersk, the chairman of Board of Directors of A.P. Moller-Maersk, the premier welcomed the global shipping company’s $2 billion investment in Pakistan, a PM Office news release said.\n\nThe PM directed the authorities concerned to form a technical working group to expedite the process of forming a partnership agreement in the maritime sector with the global shipping company.\n\nHe also directed the authorities to ensure that the memorandums signed with A.P. Moller-Maersk in the previous year should be transformed into agreements as soon as possible.\n\nThe prime minister directed the working group to submit recommendations within a month and said that it was high time to remove all barriers and bring the maritime sector on a par with global competitive standards.\n\nMeets Moller-Maersk chief, Azerbaijan, Turkiye ministers\n\nThe PM underlined that in the recent global scenario, Pakistan’s importance as a corridor for trade and transportation in the region has increased. He invited A.P. Moller-Maersk to explore more investment opportunities in Pakistan.\n\nSpeaking on the occasion, Robert Maersk said the clients of A.P. Moller-Maersk all over the world have expressed interest in investment and business opportunities in Pakistan. He expressed his interest in investing in Pakistan’s seaports.\n\nMeetings with Azerbaijan, Turkiye ministers\n\nAzerbaijan’s Minister for Economy Mikayil Jabbarov met PM Shehbaz along with his delegation, where the two sides agreed to further strengthen cooperation in sectors such as minerals and mining, oil exploration, renewable energy, information technology, infrastructure development for regional connectivity, defence, hospitality and tourism, and human resource development.\n\nThe prime minister, while mentioning the expected visit of the president of Azerbaijan, expr­essed satisfaction at the mutual interest and high-level efforts to enhance bilateral trade to $2 billion.\n\nMeanwhile, Pakistan and Turkiye on Tuesday agreed to enhance cooperation in the energy sector, especially in the area of renewable energy. PM Shehbaz was talking to a nine-member delegation led by Turkiye’s Minister for Energy and Natural Resources Alparslan Bayraktar at the PM House.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f5c69e51ea2.gif",
  "retrievedAt": "2025-10-12T02:26:42.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903044/premier-hails-2bn-investment-by-maersk",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:53.000Z"
}
