{
  "title": "Over 1,000 Pakistani doctors obtain US residency in one year: PMDC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Around 1,061 Pakistani doctors — the highest ever in a single year — have obtained residency positions in the United States (US), Pakistan Medical and Dental Council (PMDC) President Professor Rizwan Taj revealed on Tuesday.\n\nNotable institutions, from where the maximum number of doctors have achieved residency positions include King Edward Medical University, Allama Iqbal Medical College, Dow Medical College, Shifa College of Medicine, Jinnah Sindh Medical University (JSMU) and Khyber Medical University.\n\nMr Taj claimed that the “impressive performance of the doctors exemplified the standards set by the PMDC in overseeing medical education in the country and its strong curricula and training programmes”.\n\nHe reiterated the commitment to develop academic excellence among doctors and described this initiative as the start of a transformative journey aimed at further improvements, the statement said.\n\n“With a rigorous system of checks and balances, the PMDC has played a crucial role in guiding Pakistani medical and dental colleges to establish robust curricula and comprehensive training programmes,” Dr Taj said.\n\nHe also said that the residency application process in the US was highly competitive and candidates have to demonstrate exceptional academic performance, pass the rigorous United States Medical Licensing Examination (USMLE) and navigate a demanding application process that includes interviews and the submission of comprehensive documentation.\n\nOnly the most dedicated and resilient candidates thrive in the challenging selection, the statement read. Professor Taj further added that the success will further improve the PMDC’s vision of mounting excellence in medical education in preparing future healthcare professionals to meet global standards.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:05:03.883Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903083/over-1000-pakistani-doctors-obtain-us-residency-in-one-year-pmdc",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T04:33:11.000Z"
}
