{
  "title": "PTI yearns for engagement with ‘powerful quarters’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Salman Akram Raja says his party available for talks, rules out ‘apology’\n• Swati says willingness to talk shouldn’t be construed as ‘deal-seeking’\n\nISLAMABAD: The PTI continues to yearn for engagement with the corridors of power, insisting that it is ready for talks with the “all-powerful” establishment.\n\n“If we talk, we will talk to the establishment because the government is powerless,” PTI Secretary General Salman Akram Raja said on Tuesday.\n\nIn an appearance on DawnNewsTV, he insisted that they were not hiding in tunnels and were ready to come to the table.\n\n“We will negotiate with those who are blocking democracy and the Constitution, but an apology is out of the question,” Mr Raja said, referring to the military’s long-standing demand for an apology over the events of May 9, 2023, when PTI supporters swarmed a number of military installations following the arrest of their party founder, Imran Khan.\n\nMr Raja maintained that he and his party colleagues would be available for initial engagement, but the talks would proceed under the guidance of their incarcerated party founder.\n\n“All decisions will be taken by Imran Khan, but we are available for initial discussions,” Mr Raja said.\n\nHe said that powerful quarters should realise the need for engagement, given the direction the country is heading in. “Look at the situation in Balochistan, it is their job to sit with us and bring stability to the country,” he said.\n\n“We are not looking for a backdoor, nor would we compromise on our principles,” Mr Raja said.\n\nSwati’s new video\n\nMeanwhile, PTI leader Azam Swati, who recently claimed that Mr Khan was ready to negotiate with the establishment, released another video on Tuesday.\n\nIn the fresh video, Mr Swati claimed the PTI founder had not closed the doors on talks since 2022, but that his willingness to talk should not be construed as willingness to make a deal.\n\n“In 2022, we convinced Imran Khan for talks and he is still ready. However, do not associate the offer of negotiations with a deal. My leader is happier in jail compared to Zaman Park (his Lahore residence),” Mr Swati claimed.\n\n“We convinced Imran Khan for talks in the best interest of Pakistan. It does not show any weakness; it is for the sake of the country,” he claimed.\n\nEarlier this week, Mr Swati had claimed that he had secured Mr Khan’s blessing to engage in efforts to bring both sides to the table.\n\nNadir Guramani and Ikram Junaidi in Islamabad contributed to this report\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:27:17.657Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902977/pti-yearns-for-engagement-with-powerful-quarters",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:42.000Z"
}
