{
  "title": "Record number of 6,500 Sikh pilgrims expected from India for Baisakhi - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: A record number of over 6,500 Indian Sikh pilgrims will visit Pakistan to attend the annual Baisakhi festival on Thursday, the Evacuee Trust Property Board (ETPB) said on Tuesday.\n\nBaisakhi, the spring harvest festival, celebrated primarily in Punjab and northern India, marks the beginning of the Sikh New Year and symbolises spiritual rejuvenation.\n\nDuring their ten-day pilgrimage from April 10-19, ETPB officials said the pilgrims will visit various religious sites.\n\nSikh devotees regularly travel to Pakistan to offer religious rituals under the 1974 Pakistan-India Protocol on Visits to Religious Shrines.\n\nUnder the protocol, Pakistan issues 3,000 visas every year.\n\nBut for the first time in history, a record number of visas have been issued.\n\nETPB Additional Secretary Shrines Saif Ullah Khokhar said that the first batch would arrive at Gurdwara Punja Sahib on Thursday.\n\nAfter offering religious rituals for three days, the pilgrims would depart for the Nankana Sahib on Saturday.\n\nThe second contingent of devotees will arrive at Gurdwara Punja Sahib on April 15.\n\nAfter offering religious rituals, the visitors would proceed to Lahore on April 17.\n\nMr Khokar said that a large number of pilgrims from other countries including the United Kingdom, France, United States, Canada and the United Arab Emirates (UAE) were also expected to arrive in Pakistan.\n\nHe said that the board and the Pakistan Gurdwara Committee will renovate and illuminate religious places in various cities in connection with the annual festival.\n\nSardar Ravinder Singh Jaggi, a local Granthi (religious leader) said that Baisakhi also marks the day when Gobind Singh, the 10th and final guru of Sikhism, established the discipline of Khalsa, through which the faithful can aspire to the ultimate state of purity.\n\n“It is a day to celebrate 1,699 – the year when Sikhism was born as a collective faith.\n\n“As a whole, the message of Baisakhi is of peace and love”, he added.\n\nMeanwhile, the Attock district administration said it has finalised security arrangements for the upcoming festival at Gurdwara Punja Sahib in Hassanabdal.\n\nHere, pilgrims perform rites such as Akhand, Paath Sahib, Bhog, Ardas and Hukamnama every year.\n\nTalking to journalists, Attock Deputy Commissioner Rao Atif Raza said, “We, with the collaboration of ETPB and Pakistan Sikh Gurdwara Parbandhak Committee (PSGPC), have finalised plans for security, food and accommodation at the gurdwara for the pilgrims.” He said that around 1,000 police officers and personnel, including six SDPOs, 17 inspectors, 103 upper superintendents, 94 head constables, 667 constables and 36 lady constables will be deployed to ensure security.\n\nHe said that apart from this, 50 security cameras, 12 walkthrough gates and 40 metal detectors would be installed as well.\n\nMr Rao said that 26 sections of elite commandos would be on high alert while shops close to the gurdwara would be closed.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:05:03.959Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903072/record-number-of-6500-sikh-pilgrims-expected-from-india-for-baisakhi",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T02:40:00.000Z"
}
