{
  "title": "National Highway Authority told to give top priority to Hyderabad-Sukkur Motorway - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A Senate panel on Tuesday directed the National Highway Authority (NHA) to give top priority to much-awaited M6 Hyderabad-Sukkur Motor­way (HSM).\n\nThe Senate Standing Commit­tee on Planning and Development reviewed HSM project and direc­ted the NHA leave all other road projects and immediately start HSM.\n\nSenator Quratulain Marri presided over the meeting of the Senate panel.\n\n“Dissolve National Highway Authority and hand over national highways and motorways to provinces,” she said while expressing annoyance for not initiating the construction work on HSM.\n\n“Halt all other projects unless and until Hyderabad-Sukkur Motorway is started,” she added.\n\nM6 project has already been delayed by six years despite being an integral part of CPEC\n\n“How the money is being spent on the Lahore-Sahiwal Motor­way, if the NHA has no funds for Hyderabad-Sukkur Motorway,” she questioned.\n\nOn the occasion, Planning Minister Ahsan Iqbal assured the panel members to implement all decisions of the panel and agreed that the first priority should be given to HSM project.\n\nAnother committee member, Faisal Sabzwari, said it was a common international practice that Motorways are started from the port city. “But here the situation is totally different,” he said.\n\nIn a statement last month, Mr Iqbal had said that work on the much-delayed HSM project along with the reconstruction of the Karachi-Hyderabad Motorway would start next year.\n\nHe had also floated an option to bifurcate the whole HSM project into three separate portions.\n\nMeanwhile, two firms had submitted “unsolicited” conceptual plans to the NHA for the construction of the long-awaited 306km-long HSM.\n\nThe project has already been delayed by six years despite being an integral part of the China-Pakistan Economic Corridor.\n\nThe two conceptual plans were moved by Zahir Khan and Brothers (ZKB) and Techno Engineering Services (TES), through the Special Investment Facilitation Council (SIFC) and National Accountability Bureau (NAB), respectively.\n\nAccording to the NHA, the un­­solicited concept proposal by ZKB has been submitted to SIFC with a request to forward the same to Public-Private Partner­ship Authority. A copy of the same has also been submitted to NHA.\n\nHowever, TES, which had won the construction contract over two years ago with a bid of Rs307.71bn, claimed it was ready to execute the project with the same bid, with a difference of interest rate and Kibor.\n\nThe firm submitted its plan to senior NHA officials in a meeting, presided over by NAB chairman, sources said, explaining that NAB had been tasked by the Sindh High Court to probe allegations of irregularities, corruption and delay in the project’s execution.\n\nNAB Sukkur held a meeting with TES to discuss and investigate reasons of the delay and other allegations that led to cancellation of the contract in 2024. Later, NAB held another meeting with TES, presided over by NAB chairman, during which the firm presented its plan.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:05:32.645Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903038/national-highway-authority-told-to-give-top-priority-to-hyderabad-sukkur-motorway",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:48.000Z"
}
