{
  "title": "Flooded and forgotten: The haunting reality of flood-ravaged schools in Sindh - Prism - DAWN.COM",
  "author": null,
  "content": "Approximately 20 kilometres from Sindh’s Dadu district, a man waits inside a crumbling building, where the air still carries the scent of damp earth from past floods. On paper, it’s a fully functional school. But what was once a bustling hub of bright minds now stands hollow.\n\nMajeed Leghari, a primary school teacher from Dadu, confronts the formidable task of shaping young minds amid the ruins left behind by the catastrophic floods that hit Pakistan almost three years ago.\n\nLeghari, who teaches the fourth and fifth grades at the Government Primary Ibrahim Leghari School, witnessed the disaster first-hand. The visuals that emerged from the flood currents are still etched in his memory; floating debris, entire villages reduced to swamps, families clinging to whatever they could salvage, and children wading through waist-deep waters and mud. He said that the sight wasn’t all too new as the people of Sindh have endured such nightmares time and again.\n\nDuring the 2022 floods, Sindh was declared the worst affected province — a race no one wants to lead — accounting for nearly 70 per cent of total damages. According to the World Bank, the disaster claimed over 1,700 lives, displaced 33 million individuals, and wrought economic devastation to the tune of $40 billion. The damage caused profound losses, one of which is the blow to education.\n\nThe crisis is not exclusive to Sindh. It stretches far beyond Pakistan’s borders, forming an ominous pattern of climate induced educational loss that now spans continents.\n\nA recent Unicef report reveals that over 242 million students in 85 countries had their schooling disrupted due to extreme weather events, including heatwaves, storms, floods, and cyclones last year alone. The El Niño weather effect — climate event that causes the surface water in the central and eastern Pacific Ocean to warm, resulting in extreme weather — unleashed havoc across Africa, triggering floods in the east and droughts in the south.\n\nWealthier nations weren’t spared either; torrential rains in Italy and Spain forced thousands of children out of classrooms. The same report stated that 128 million students saw their education derailed due to climate disasters in South Asia.\n\nThe statistics show that three-fourths of the affected students were from lower-middle-income countries, where education systems are already struggling to keep up.\n\nIn vulnerable regions like Sindh, where poverty and crumbling infrastructure already set the stage for hardship — climate catastrophes serve as cruel accelerants, pushing education further out of reach.\n\n“In 2022, Sindh faced a dual catastrophe of significant magnitude,” said an official of the Sindh government’s department for Planning Development and Research (PDR), who asked not to be named because he was not authorised to speak to the media.\n\n“At first, unprecedented downpours lashed the region for eight consecutive days. Next came the torrential floods. Districts bordering the Kirthar range bore the brunt of this calamity,” he explained.\n\nWhen the storm finally passed, 19,808 schools lay in ruins, as per the Sindh Education Foundation — semi-autonomous organisation with a mandate to support education in the province through multifarious interventions. Of these, 7,503 were rendered completely unusable, while another 12,305 were partially damaged.\n\nA Post-Disaster Needs Assessment (PDNA) was conducted to gauge the extent of damage, along with a survey by the provincial education department’s Reform Support Unit to provide further insights. These assessments, designed with technical assistance from Unicef and the World Bank (WB) classified “schools suffering over 40pc quantum of damage as fully destroyed, while those with less damages were deemed partially damaged,” the official clarified.\n\nHe shared data with Dawn.com, revealing that 2.3 million out of 4.6 million students were affected across the province.\n\nThe data further showed that the floods left a trail of destruction across Sindh, hitting some districts harder than others. Khairpur Mir tops the list, with 2,243 completely and partially damaged schools, followed by Naushahro Feroze, with 1,369 schools left in ruins. Umerkot and Shaheed Benazirabad each faced destruction of 1,060 schools, while Ghotki and Badin also suffered severely, with 1,054 and 1,016 schools affected, respectively.\n\nAt the time, the government in collaboration with Unicef, carried out necessary repairs for schools, in some cases providing alternative structures and classroom setups. “This adaptability helped us avoid a significant drop in enrolments. While not all students could be accommodated immediately, we managed to keep as many as we could within our schooling system,” he added.\n\nHowever, infrastructure development and reconstruction of all schools remain a colossal task. The latest figures presented by the PDR official indicate that out of the total damaged schools, 4,089 have been taken up for rehabilitation, while 15,895 have yet to be restored. This means only about 20.4pc of affected schools have seen progress, while a staggering 79.6pc are still awaiting reconstruction.\n\nAccording to the official, the government allocated substantial funds to address the needs of partially damaged schools. “We initially utilised the provincial fund, followed by the federal government’s Public Sector Development Programme (PSDP) scheme, which approved a shared allocation of 13,000 million. Additionally, grants from global funders and humanitarian aid organisations provided invaluable support,” he said.\n\nHe added that rehabilitation efforts are currently backed by the World Bank, Asian Development Bank (ADB), European Union (EU), and Japan International Cooperation Agency (JICA). These international financial institutions, along with Sindh’s provincial Annual Development Program (ADP), have been instrumental in mobilising resources and driving the reconstruction efforts forward.\n\nSehar Taimoor, an education advisor at Save the Children added that the non-profit organisation co-leads the education sector working group alongside Unicef and the Ministry of Federal Education and Professional Training (MOFEPT). Together, they have orchestrated joint needs assessments and developed comprehensive resource plans since the floods struck Sindh.\n\nYet, she admitted that the progress has been slow, hampered by the enormity of the task and the constant need for resources, adding that the road to recovery remains fraught with challenges.\n\nThe physical and economic consequences of the floods were profound, but the unacknowledged weight of psycho-social trauma was perhaps the most insidious.\n\nAccording to Leghari, what began as bureaucratic indifference, spiralled into a cycle of violence, where frustration flowed downward, sparing no one in its path. “The apathy of government officials in the wake of the floods set off a chain reaction of despair. Frustration, festering in powerless men, found its first outlet in their wives, who have historically been victims of misplaced rage. From there, the burden of this unaddressed anger bore down on the children, imprinting wounds far deeper than those left by floodwaters,” he added.\n\nDawn.com spoke to teachers who described the scars that Sindh’s children have borne since the disaster; those that cannot be seen, only felt. They recalled that the students were paralysed with fear from the scenes of the floods to an extent where even after two years, the slightest thunder sends them trembling in their seats. Many still suffer from vivid flashbacks — a reminder of a time that has stripped them of their sense of security.\n\nSave the Children confirmed that these children continue to show signs of severe stress, anxiety, and depression as they have faced losses beyond measure. “They have seen their worlds turn upside down,” Raza Hussain Qazi, Director of Advocacy, Campaigns, Communication and Media (ACCM) at the organisation said. “They’ve lost their homes, their schools, their friends, and in many cases, their family members.”\n\nDelving into the link between floods and their impact on mental health, Qazi pronounced climate change as the most pressing threat to the children’s future. The floods of 2022 were a brutal reminder of this truth as they revealed not just the vulnerabilities of the present but also the dark possibilities of the future. The multifaceted impacts of climate change — on physical and mental health, nutrition, education, and overall well-being — were laid bare for all to see.\n\nTaimoor, the education advisor agreed, adding that the spectre of climate change that looms large in Pakistan cannot be downplayed when it comes to the psychological impact of natural disasters on children. She said that repeated exposure to life-altering events resulting in displacement, loss of livelihood, and feelings of extreme uncertainty have a cumulative effect, increasing the risk of chronic mental health conditions like post-traumatic stress disorder (PTSD).\n\n“It’s not that the government has done nothing,” said Pir Muzaffar, a school teacher in Naushahro Feroze. “It’s just that it hasn’t done enough.” He said that there is discernible laziness in the system; the government sporadically makes efforts that seem to slip through the cracks. “While officials focus on enrolment numbers, they downplay the scarcity of basic resources,” he added.\n\n“For the longest time since the floods, textbooks were not provided and when they were finally given, they barely covered 20pc of the total requirement.” Muzaffar continued, “What’s the point of enrolling more children if eight out of 10 don’t even have a textbook?”\n\nSimilarly, Arif Qureshi, a school teacher from Tando Muhammad Khan, claimed that the government’s pledge to prevent education losses fell flat as the number of students declined despite enrolment efforts. “A campaign in 2023 aimed to enrol 5,000 to 6,000 children, but a lack of textbooks led to another wave of dropouts,” he noted.\n\nWhere the supplies did arrive, he said, some schools never ended up receiving them as they were pilfered by private shops and sold at higher rates. Powerful waderas and politicians of the village hoarded the resources, rendering the aid distribution process a failure, Qureshi alleged.\n\nSindh Education Minister Syed Sardar Ali Shah acknowledged that there was an issue with publishing enough textbooks last year. “The budget had been set in 2015 and since then the cost of paper became five times more expensive due to inflation. As a result, the required number of books could not be published during the caretaker government,” he explained.\n\nHowever, he said that the School Education and Literacy Department (SELD) received adequate grants from the Sindh government, and the desired number of textbooks were published and distributed on August 1, 2024. “I have personally overseen the distribution of the textbooks to ensure no student sits in a classroom without it,” Shah confirmed.\n\nAddressing allegations of hoarding resources, Shah said, “There may have been a few instances, and while they’re unfortunate, the Sindh Education Department has no involvement in them, nor does it fall within our scope to control such activities.”\n\nDespite the distribution of textbooks, Leghari claimed that larger structural issues persist. He recalled that teachers had to conduct classes in unstable buildings and makeshift premises for months.\n\nThe teachers, after a thorough inspection, reported to the education department that the schools were unsafe. However, they were simply instructed to use the allegedly ‘safe’ areas in those schools. This directive led to multiple incidents where roofing material collapsed, injuring both students and teachers.\n\nAllahdad Jamali, a teacher in Nawabshah, echoed similar concerns, stating that the government-mandated shelters for displaced families turned schools into makeshift refuges. Bereft of resources, the desperate families burnt school furniture for warmth during the winter months. Since then, there has been no conversation about the installation of new infrastructure, he added.\n\nThe floods magnified the already existing problem of poverty — one of the most powerful impediments to education in Pakistan.\n\nIt is unrealistic for parents barely scraping by to afford the tools needed for learning, the school teacher said. “The prices of these books have skyrocketed — what once cost Rs5 or Rs10 now demands Rs30.”\n\nLeghari told Dawn.com that in his experience, students were acutely aware of their family’s financial hardships following the floods. “I’ve seen the humiliation they feel when they have to ask a classmate for a pencil and a sheet of paper, as they do not even have that.”\n\nHe said that students want to study, but when floods wash away their homes, their fathers stuck in a financial rut instruct them to forgo schooling and earn an income instead. The sole aim? To put food on the table — “to make a simple salan and buy atta”.\n\n“Needless to say, education is reduced to an afterthought. And with what moral authority can anyone blame them?” he lamented.\n\nQuershi recounted that when the floods struck in 2022, young girls found themselves trapped in schools and colleges, the roads leading to their homes impassable. “These girls faced harassment and were stranded and drenched, with nowhere to go,” he recounted. “It was an emergency declared by the Senior Superintendent of Police (SSP) who eventually rescued them, but the trauma lingers.”\n\nHe added that to this day, the girls have not healed from what happened two years ago. This, compounded by other factors, has taken a toll on their attendance.\n\nLeghari concurred. “There were 15 girls enrolled in the fifth grade. After the floods, only about eight returned,” he pointed out. He said that others were forced to drop out, often to shoulder responsibilities at home. Cultural norms rooted in gender disparity add another layer to the problem. “In our village, girls are expected to receive education up till primary school. By the time they move back to the village, unki parhne likhne ki umar nikal chuki hoti hai (their age to read and write has passed),” he added.\n\n“Girls are often reduced to an extra set of hands to help with recovery efforts after floods, such as assisting with ruined crops and rebuilding, fetching clean water, cooking, and caring for younger siblings. This imposed labour detracts from their time and ability to attend school,” Leghari continued.\n\nIn a similar vein, Qazi stated that for many girls, the floods spelt the end of their academic journeys due to the lack of safe learning environments. Safety concerns make it harder for girls to travel long distances to attend school. “The destruction of local schools has forced many to abandon their studies, putting them at the risk of child marriage and exploitation,” he added.\n\nIn August 2024, following widespread criticism from teachers in Sindh over the deteriorating state of education in the province, the Sindh government issued a report, placing the blame squarely on chronic absenteeism among teachers. The Directorate of Monitoring and Evaluation of the SELD identified 6,342 teachers in Sindh as absent from duty for periods ranging from one to five years.\n\nThe report stated that despite prior warnings and the availability of verified data through the Human Resource Management Information System (HRMIS), no substantial action had been taken against these employees. In response, the Sindh government directed district education officers to notify the absconding teachers, requiring them to appear before a designated committee within three days. Failure to comply would result in the blocking of their official IDs and the imposition of major penalties.\n\nThe findings prompted renewed scrutiny of the province’s education sector.\n\nThe issue drew a reaction from the provincial president of the Pakistan Tehreek-i-Insaf (PTI), Haleem Adil Sheikh, who called for the resignation of the education minister of the province, attributing the situation to alleged mismanagement and inefficiencies within the department. He accused the PPP of “pushing the education system in Sindh to the brink of collapse”, with thousands of government schools reportedly “converted into cattle pens.”\n\nSheikh claimed that Sindh has over 12,000 non-functional schools, more than 26,000 schools without access to drinking water and over 31,000 without electricity.\n\nIn a press release issued by PTI Sindh media cell, he criticised extensive corruption within the department alleging that “perpetually absent teachers” were drawing salaries from public funds while failing to perform their duties. “The government has allocated Rs2,374 billion to the education sector over the past 16 years, yet nearly six million children in the province remain out of school,” he said.\n\nSheikh noted that the conversion of these schools into non-educational facilities is not due to a lack of funding but rather the absence of responsible management on the ground.\n\nHe further accused the Sindh government of failing to ensure the effective distribution of scholarships and free textbooks, pointing out that corruption had tainted these provisions. He emphasised that when those entrusted with delivering vital resources to the most vulnerable students neglect their duties, the entire system is undermined.\n\n“At least 528 children lost their lives, and over 16 million were thrust into a battle for survival. The lucky ones, if they could be called that, were left in conditions barely fit for life — no clean water, scant food, and essential health and education services denied,” said Raza Qazi from Save the Children Pakistan.\n\nIn response, the humanitarian organisation for children established nearly 200 temporary learning centres (TLCs) and distributed essential learning kits. Alternative education initiatives like the catch-up programme, under the ECHO project, were rolled out — six-month-long classes aimed at bridging the gaps in learning.\n\nHowever, the infrastructure in over half of the damaged schools is still in ruins, and the road to recovery is steep.\n\nIn the crossfire between the government and educators, it is the children who ultimately pay the price. The economic imperative of child labour in flood-prone regions lays bare a deeper, systemic issue: the glaring absence of concrete support structures.\n\nDespite rebuilding efforts, many students still face insurmountable barriers to learning. Why the gap between meaningful initiatives and tangible progress yawns wide is anyone’s guess.\n\nIn the wake of such calamities, the hierarchy of needs is unmistakable. Parents have no choice but to sacrifice their children’s educational prospects for the sake of a single meal. When survival is at stake, the privilege of sitting in a classroom is strictly reserved for the fortunate.\n\nThere is something fundamentally unsettling — even unreasonable — about expecting traumatised children, who’ve had to pack their entire lives into small bags and flee their homes, to return and focus in classrooms with broken infrastructure and minimal resources. Leghari lamented that most children in his district live without the anchors they desperately need — routine, safety, and a sense of normalcy. “Without sustained aid and decisive action from the government, it’s hard to even console them with the hope of better days ahead.”\n\nHeader image: In Nawabshah, a student wearing a school uniform, tends to goats instead of going to school. — image provided by Allahdad Jamali, a schoolteacher.\n\nAll images in this piece were provided by schoolteachers in Sindh.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/091111311d5f342.jpg",
  "retrievedAt": "2025-08-25T14:05:01.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1844377/flooded-and-forgotten-the-haunting-reality-of-flood-ravaged-schools-in-sindh",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T06:09:09.000Z"
}
