{
  "title": "Barrick Gold to raise $3bn for Reko Diq project - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Canadian mining giant Barrick Gold is set to raise $3 billion in international financing for the multi-billion-dollar Reko Diq Copper & Gold Project in Balochistan.\n\nBarrick’s President and CEO Mark Bristow told Dawn on Tuesday that a financing pact with the World Bank and its commercial arm International Finance Corporation (IFC) was expected to be signed by mid-year and final financing packages by third quarter this year for $650 million. “We expect to drawdown about $500m by 4th quarter,” he said.\n\nBristow said details of financing from other financiers could not be disclosed at this stage, pending final approvals. He said the first phase of the project to be completed by 2028 required $6bn, of which half would be provided by Barrick and Pakistan as equity. The 32-year second phase would cost another $3.5bn to be generated by the project itself.\n\n“First phase is far more expensive,” he said.\n\nMr Bristow said it would be for the first time that the World Bank would finance a mining project.\n\nHe said all big western institutions led by the IFC would be part of the $3bn financing — a combination of loans of financing and credit guarantee that would “enable us to raise funds from private bank institutions”.\n\nHe said US Exim Bank, IFC, US Sovereign Fund, Germany, Asian Development Bank, Japan, South Korea and some of the Scandinavian countries were part of the financing consortium.\n\nThe remaining $3bn financing would include $1.7bn from Barrick Gold and $1.4bn from Pakistani state-owned companies.\n\nResponding to a question if the $6bn Reko Diq project cost also included smelters to process copper and gold at site, the Barrick president said it was not feasible until end of the first phase and unless some other similar project comes up in the near proximity. Also, it would increase the project unnecessarily.\n\nThe project would be operated though a 150MW power plant to be run on heavy fuel oil (HFO) initially, followed by another 150MW of solar plant and then supported through intake from the national grid that would require upgrade.\n\nIn total, the first phase would need 180MW electricity to be followed by another 150MW in the second phase, he said.\n\nMr Bristow said the project would have a 45m-tonne of throughput per annum (mpta) for the first five years and then 90mpta for the following 32 years of second phase.\n\nBased on existing reserves, the Reko Diq project is expected to yield production of 13.1m tonnes of copper and 17.9m ounces of gold over the life of the mine (100pc basis), according to OGDCL — one of the shareholders.\n\nThe feasibility study has also confirmed a lucrative 25pc rate of return on investment on one of the biggest copper-gold project, informed sources said.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f5c58473b3c.gif",
  "retrievedAt": "2025-08-25T14:05:17.796Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903043/barrick-gold-to-raise-3bn-for-reko-diq-project",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:53.000Z"
}
