{
  "title": "PM Shehbaz urged to form body to address Balochistan crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A lawyers’ delegation on Tuesday met Prime Minister Shehbaz Sharif and urged him to form a high-powered committee comprising senior politicians to initiate negotiations with the Balochistan National Party-Mengal (BNP-M) and other protesting political factions.\n\nThe delegation comprising Supreme Court Bar Association (SCBA) President Mian Muhammad Rauf Atta, High Court Bar Association of Balochistan President Mir Attaullah Langove and member Balochistan Bar Council Khalil Panezai “requested the prime minister that the federal government play an effective role in improving the law and order situation in Balochistan”.\n\nThey briefed the prime minister on governance issues in the province and sought his leadership and guidance in resolving all related challenges.\n\nThe SCBA president described the situation as extremely dire, stating that fundamental rights guaranteed under Articles 9 (Security of Person), 15 (Freedom of Movement), 16 (Freedom of Assembly), and 19 (Freedom of Speech) “are effectively non-existent”.\n\nAdditionally, frequent road closures and the unavailability of mobile networks are further exacerbating the situation, he added.\n\nFundamental rights are effectively non-existent in province, SCBA president tells prime minister\n\nHe also informed the prime minister about his discussions with several key leaders from mainstream political parties, especially those from Balochistan, in an effort to foster a broad national consensus on the challenges facing the province.\n\nHe emphasised that the only solution to these very issues lies in negotiation and dialogue. He expressed concern that important ministries of the province were being “controlled from outside the province”.\n\nHe urged the PM and the federal government to take an active role in addressing such concerns and suggested the establishment of a high-powered committee with full authority and mandate.\n\nNaming senior politicians such as Dr Abdul Malik, Maulana Abdul Wasay, Nawab Aslam Raisani, Syed Khursheed Ahmed Shah, Sardar Chandio, Ayaz Sadiq, Khawaja Saad Rafique, Aimal Wali Khan and Barrister Gohar, he suggested that the committee be given full mandate to initiate negotiations with the BNP-M and other parties to address their genuine grievances and pressing issues in Balochistan.\n\nThe delegation appreciated the prime minister’s commitment to prioritising the development of Balochistan and the federal government’s efforts for the welfare of the people of the province.\n\nThe PM promised to continue efforts for uplift of Balochistan and said: “The talented human resource of Balochistan is a valuable asset for Pakistan.”\n\nThe delegation praised the initiative of Daanish Schools that provide quality education to students from economically disadvantaged backgrounds and requested the establishment of such schools in Khanozai and Mangochar (Kalat).\n\nFurthermore, the delegation lauded the hundreds of scholarships previously awarded to Balochistan students for higher education and requested the revival of this program.\n\nThe prime minister issued immediate directives to the relevant authorities for implementation on these matters.\n\nFederal Minister for Law and Justice Azam Nazeer Tarar also attended the meeting.\n\nIn its recent report, the Pak Institute for Peace Studies (PIPS), an Islamabad-based think-tank, said terrorism-related deaths in the country surged by 73 per cent in February, compared to the previous month, with nearly 62pc of the total fatalities occurring in Balochistan, highlighting the growing insurgency in the province.\n\nA total of 121 people were killed and 103 others injured in 54 terrorist attacks recorded across the country during the month, it said.\n\nOut of the total 121 casualties recorded during February, as many as 75 occurred in Balochistan.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/091015462167a0f.jpg",
  "retrievedAt": "2025-10-12T02:27:04.346Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903039/pm-shehbaz-urged-to-form-body-to-address-balochistan-crisis",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:48.000Z"
}
