{
  "title": "PIA ‘achieves net profit’ after 21 years - Business - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The bo­­ard of directors of Pakis­tan International Airlines (PIA) has approved its fin­ancial results for 2024, which show the airline achieving a net profit after around 21 years, a PIA spokesperson said on Tuesday.\n\nAccording to the results for FY2024, PIA earned an operational profit of Rs3.9 billion and a net profit of Rs2.26bn.\n\nThe airline’s operating margin was more than 12pc, which is on a par with the performance of any of the best airlines in the world, the spokesperson said.\n\nThe airline last achie­v­­ed profit in the year 2003. Recently, the struggling airline had undergone comprehensive reforms and restructuring.\n\nIn this process, PIA’s ma­­npower and expenditu­res were considerably red­uced, while measures such as ensuring stability in profitable routes, shutting down loss-making rou­tes and restructuring its balance sheet were taken.\n\nIn a post on X, Defence Minister Khawaja Asif — who also holds the aviation portfolio — celebrated the news, saying that process of the airline’s privatisation would benefit from this development.\n\nAccording to Bloomberg, the results mark a turnaround for the airline whose financial losses have seen its aircraft being impounded at foreign airports, flights cancelled, and the carrier running close to a default in recent years.\n\nThe government tried, and failed, to sell its airline last year after the initial bid fell short of the minimum price of about $306 million. Now, it is making another push, with initial bids due later this month.\n\nFor the sale of the airline, the government has carved out about three-quarters of the airline’s debt to government books to make the sale more attractive.\n\nIt has now removed all the debt, and the companies that participated earlier have shown renewed interest, Bloomberg quoted privatisation secretary Usman Bajwa as saying in February.\n\nOperational gains had previously been eroded by the substantial debt servicing burden from the mounting losses.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:05:32.785Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903037/pia-achieves-net-profit-after-21-years",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:48.000Z"
}
