{
  "title": "Fulbright in limbo after US State Dept nixes exchange programme - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Funding cut for UGRAD-Pakistan, which allowed students to spend a semester in US\n• Applications for 2026 cycle already in; scholars currently in US not getting full stipend\n• HEC chairman says such students should be allowed to complete their studies\n\nWASHINGTON / ISLAMABAD: The Trump administration’s funding freeze on nearly all “non-essential” federal programmes is threatening the long-standing Fulbright scholarship programme — which has given scores of talented Pakistani students the opportunity to study at top US universities over the years.\n\nOn Tuesday, a formal announcement regarding the closure of a separate undergraduate exchange programme — that has been going for around 15 years — also came as a blow to the ambitions of scores of Pakistani students, who would have benefitted from spending a semester in top US colleges and universities.\n\nLong seen as the crown jewel of US-Pakistan exchanges, the Ful­bri­ght programme has been in limbo since February, when the State Dep­artment abruptly suspended all cultural and academic exchanges admi­n­is­tered by its Bureau of Educational and Cultural Affairs (ECA).\n\nThe scholarship usually covers travel, living stipends, health insurance, and tuition for a student’s entire study period.\n\nInitially described as a temporary 15-day freeze, the suspension remains in place more than two months later, with no official explanation or timeline for resumption.\n\nThe Institute of International Education (IIE), which administers the Fulbright Programme and other ECA-managed scholarships and fellowships, had indicated last month that their employees were being furloughed.\n\nRecent communications sent to Fulbright scholars currently in the US have also indicated that the payment of their stipends would be affected by the State Department’s funding ‘pause’.\n\nDespite this, the United States Educational Foundation in Pakistan (USEFP) went ahead with accepting applications for the 2026 cycle. The foundation is currently reviewing submissions in the hope that the programme will resume, but insiders indicate that this seems unlikely.\n\nThe Fulbright programme had a particularly strong presence in Pakistan, offering financial support for Masters and PhD programmes, as well as a Fulbright Foreign Language Teaching Assistant fellowship.\n\nAccording to the US Embassy in Islamabad, over 4,000 Pakistani students have availed the Fulbright scholarship since it was launched in 1951.\n\n“Since its inception, more than 9,300 Pakistanis and over 935 Ameri­cans have participated in USEFP-managed exchange programmes,” according to the embassy’s website.\n\nExchange programme shuttered\n\nMeanwhile on Tuesday, the USEFP formally announced the closure of its Global Undergraduate Programme, another ECA-administered programme that provided students from Pakistan the opportunity to attend US universities and colleges for non-degree academic study for one semester.\n\nSources said that every year, over 100 Pakistani students availed this opportunity in the spring and fall sessions.\n\n“We regret to inform you that after 15 incredible years, the Global Undergraduate Exchange Programme for Pakistan has come to an end. The US Department of State informed USEFP that the Global UGRAD-Pakistan Programme will no longer be offered. We understand that this news may be disappointing, especially for those who applied this year and were looking forward to this opportunity,” USEFP announced on its website and social media platforms.\n\nAlthough no specific reason was cited for the program’s termination, USEFP acknowledged the disappointment it may cause and encouraged students to explore other exchange and scholarship opportunities.\n\nTalking to Dawn, Higher Education Commission (HEC) Chairman Dr Mukhtar Ahmed described the programme as being “very useful” for Pakistani students.\n\n“In my personal opinion, this should have continued… It was very good programme,” he said.\n\nScholars already in US also worried\n\nDr Mukhtar also acknowledged reports that students who were already studying in the US under the Fulbright programme were also facing uncertainty.\n\n“Since the HEC has no direct link with the programme, we do not have exact information”, he said, adding that his office was still trying to get a clear picture.\n\nHowever, he maintained that students already in the US should be given the chance to complete their studies.\n\nThe lack of clarity from Washington has deepened anxieties, not only about the fate of the Fulbright programme, but also the broader environment for Pakistani students in the US. Many now fear that visa restrictions, regulatory overreach, and changing political attitudes are threatening the future of academic mobility.\n\nA number of Pakistani students Dawn spoke to said that even minor infractions — such as traffic violations or administrative delays — have led to visa complications. These issues are often discovered only when a student tries to re-enter the US or applies for work authorisation.\n\nIn some cases, students lost their legal status without notification, as federal agencies no longer inform universities of such changes.\n\n“There’s a constant fear now,” said one student at a major Midwestern university. “You don’t know whether a simple mistake will cost you your degree, your status, or your future.”\n\nThese fears are particularly acute with the summer break approaching. Many students face a wrenching choice: travel home to reunite with family and risk being denied re-entry, or remain in the US, isolated and uncertain about their legal footing.\n\nAccording to recent data, around 11,000 Pakistani students were enrolled in US institutions during the 2023–24 academic year — a 16 per cent increase from the previous year. Pakistan now ranks as the 15th-largest source of international students in the US.\n\nPublished in Dawn, April 9th, 2025\n\nHeader image: The Pakistani students who will take part in Global UGRAD this year hail from every region of the country. — Photo courtesy: US Embassy Pakistan Flickr/File",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/090913337a904be.jpg",
  "retrievedAt": "2025-10-12T02:26:36.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902981/fulbright-in-limbo-after-us-state-dept-nixes-exchange-programme",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T01:31:36.000Z"
}
