{
  "title": "Nadra suspends nationality of viral Arshad ‘chaiwala’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Jawad Hassan of the Lahore High Court issued notices to the federal government and other respondents after social media personality Arshad Khan, who rose to fame as ‘chaiwala’, challenged the blocking of his computerised national identity card (CNIC) and passport.\n\nArshad Khan, who hails from Mardan, rose to fame back in 2016 when a photographer shared a photo of him pouring tea on Instagram, which went viral.\n\nRepresented by Barrister Umer Ijaz Gilani, the petitioner approached the court under Article 199 of the Constitution, claiming that the blocking of his identity documents by Nadra and the Directorate General of Immigration and Passports was both unlawful and unconstitutional.\n\nDuring the hearing, Mr Gilani argued that Arshad Khan symbolised the quintessential Pakistani dream — rising from humble beginnings to international fame after a candid photograph of him selling tea in Islamabad went viral. Despite his global recognition, the actions of Nadra and other authorities have jeopardised his future career and tarnished his reputation.\n\nLHC seeks response from govt after Arshad’s passport, ID card blocked\n\nHe further asserted that the demand by Nadra for pre-1978 proof of residency was based on mala fide intent and lacked legal justification, especially when Mr Khan’s family had a documented citizenship history. Citing articles 4, 9, 14, and 18 of the Constitution, the lawyer emphasised the violation of Mr Khan’s rights to livelihood, dignity, and lawful treatment.\n\nThe court was also informed of precedents from the Sindh High Court, Islamabad High Court, and previous judgements of the Lahore High Court, where the blocking of CNICs and passports without due process was declared illegal. In response, the assistant attorney general and Nadra’s law officer questioned the maintainability of the petition, arguing that the petitioner failed to submit sufficient documentation proving Pakistani nationality.\n\nJustice Hassan issued notices to the respondents for April 17 seeking para-wise comments and instructing senior officials from Nadra and the Directorate of Immigration and Passports to appear with relevant records to justify their actions.\n\nThe court also restrained the authorities from taking any adverse action against the petitioner as well.\n\nIn a related development, Justice Hassan also restrained the authorities from taking any coercive action against a petitioner seeking recognition of Pakistani citizenship by birth until the determination of his status.\n\nThe decision was handed down by a single bench comprising Justice Jawad Hassan, while hearing a plea, filed by the petitioner through Advocate Fatima tuz Zahra Butt.\n\nThe petitioner, born in Pakistan to Afghan refugee parents, presented a birth certificate issued by the Government of Pakistan. He approached the court seeking the issuance of a CNIC and official recognition of his citizenship under Section 4 of the Pakistan Citizenship Act, 1951, which affirmed the principle of jus soli — citizenship by birth.\n\nThe court observed that the petition was maintainable and directed Nadra to conduct a hearing and decide the petitioner’s claim within one month. The decision must be rendered through a speaking order in accordance with law, he added. Importantly, the court also barred any government agency from taking coercive measures against the petitioner until Nadra concluded its determination.\n\nPublished in Dawn, April 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/091154341b14469.jpg",
  "retrievedAt": "2025-08-25T14:05:03.667Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903068/nadra-suspends-nationality-of-viral-arshad-chaiwala",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T02:26:48.000Z"
}
