{
  "title": "Senate body passes two bills",
  "link": "https://www.app.com.pk/national/senate-body-passes-two-bills/",
  "date_published": "2020-08-17T04:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): The Senate Standing Committee on Interior on Monday passed two bills included The Islamabad Capital Territory Trust Bill 2020 and The Anti-Terrorism (Amendment) Bill, 2020.\nThe Islamabad Capital Territory Trust Bill 2020 was considered and discussed in detail in the meeting of the Standing Committee.\nThe Bill was introduced by Federal Interior Minister Ijaz Shah. The Secretary Interior briefed the Committee that in order to enhance the effectiveness of the implementation of the Orders passed by the Federal Government to cater effective administration and financial monitoring and evaluation of the trusts relating to registration, administration and monitoring of trusts registered within the territorial limits of Islamabad Capital Territory.\nFurthermore, the facilities required for meeting the necessary expenses through exemptions are also required to be incorporated in detail.\nSenator Farooq H. Naek pointed out that in (d) of section 2 of Islamabad Capital Territory Trust Bill, 2020 after the word “for” the word “SRBs” shall be substituted with word “Statutory Regulatory Bodies” and there is a need to specify the Sections of Islamabad Capital Territory Trust Bill, 2020 where the Anti-Money laundering Act. 2010 (VII of 2010) shall be applicable.\nChairman Committee Senator A. Rehman Malik invited Senator Farooq H. Naek and other members of the committee to present their proposed amendments in the Bill if any.\nHe also offered that the matter of the Bill can be finalised on the presentation of the proposed amendments the next day.\nThe majority of the Members were of the view that the Bill should be passed on presentation of undertaking by Senator Muhammad Azam Khan Swati, Minister for Narcotics Control that the said amendments shall be taken under consideration within 30 days after passage of the Bill. Senator Farooq H. Naek also expressed his satisfaction on the proposal.\nChairman Committee asked Senator Farooq H. Naek to present his amendments in the Committee; however he expressed his satisfaction on the undertaking given by Senator Muhammad Azam Khan Swati, Minister for Narcotics Control.\nThereafter, the Chairman Committee put the Bill for vote. All members present in the meeting voted in favour of the Bill except Senator Farooq H. Naek who abstained.\nIn view of the above, the Committee recommends that “The Islamabad Capital Territory Trust Bill, 2020” as introduced in the House, sent the Senate.\nThe Senate Standing Committee on Interior in its meeting considered and discussed in detail the Anti-Terrorism Amendment Bill 2020 introduced by Federal Interior Minister Ijaz Shah.\nSecretary Interior briefed the Committee that in order to enhance the effectiveness of the implementation of the Orders passed by the Federal Government under the Anti-Terrorism Act, 1997 (XXVII of 1997) and the United Nations (Security Council) Act, 1948 (XIV of 1948), the amendments are considered essential in the Anti-Terrorism Act, 1997.\nThe scope of the application of the penalties needs to be extended to those who are involved in terrorism in any manner outside the boundaries of the country.\nChairman Committee Senator A. Rehman Malik invited Senator Farooq H. Naek to present his proposed amendments in the Bill. He also offered that the matter of the Bill can be finalised on the presentation of the proposed amendments the next day.\nThe majority of the members were of the view that the Bill should be passed on presentation of undertaking by Senator Muhammad Azam Khan Swati, Minister for Narcotics Control that the said amendments shall be taken under consideration within 30 days after passage of the Bill.\nSenator Farooq H. Naek also expressed his satisfaction on the proposal. Senator Javed Abbasi said that there is no need to write the reason of FATF in the aims and objectives of every bill as we all have a responsibility to improve our laws in the interest of the country and the nation.\nSenator Muhammad Azam Khan Swati, Minister for Narcotics Control presented an undertaking dually signed by him that the reservations expressed by Senator Farooq H. Neak shall be addressed by bringing proposed amendments in the Anti-Terrorism (Amendment) Act, 2020 within 30 days.\nThereafter, the Chairman Committee Senator A. Rehman Malik put the Bill for vote and all members present in the meeting voted in favour of the Bill. In view of the above, the Committee recommends that “The Anti-Terrorism (Amendment) Bill, 2020” as introduced in the House, sent to Senate.\nMeanwhile Senator A. Rehman Malik said that FATF is putting undue pressure on Pakistan and he been raising it again and again that FATF is discriminating against Pakistan. He said that we are amending our laws on the will of FATF while FATF has a soft corner for India.\nSenator Kauda Babar said that people of Balochistan are facing many problems due to closure of Gwadar border and even people cannot even go for condolence and cannot take their patients to hospitals.\nHe said that this issue was raised earlier and the committee should recommend that Gwadar border be opened.\nRehman Malik directed the Ministry of Interior to address the issue of the people of Balochistan in consultation with Senator Kauda Babar.\nThe meeting was held under the chairmanship of Senator A. Rehman Malik here at the Parliament House and was attended among others by Senator Dr. Shehzad Waseem, Senator Kulsoom Parveen, Senator Mohammad Javed Abbasi, Senator Sardar Mohammad Shafiq Tareen, Senator Mohammad Azam Khan Swati, Senator Rana Maqbool Ahmed, Senator Farooq H Naik, Senator Kahda Babar and Senator Haji Momin Khan Afridi besides Secretary Interior Yousuf Naseem Khokhar, Additional Secretary Home, DG Islamabad Syeda Shafaq Hashmi, DG Nekta and other senior officials also attended the meeting.",
  "retrievedAt": "2025-08-11T19:40:41.359Z"
}
