{
  "title": "Electricity issues of Haripur district to be resolved for next 70 years after projects’ completion: Omer Ayub",
  "link": "https://www.app.com.pk/national/electricity-issues-of-district-haripur-would-be-resolved-for-next-70-after-completion-of-ongoing-projects-omer-ayub/",
  "date_published": "2020-08-17T04:07:00.000Z",
  "source": "APP",
  "content": "HARIPUR, Aug 17 (APP): Federal Minister for Power Omer Ayub Khan Monday said with the completion of ongoing power projects, the electricity issues of the Haripur district would be resolved for next 70 years.\nHe was addressing a public gathering after the inauguration of Khoi Nara Vijjian Sui gas provision project.\nThe said Prime Minister Imran Khan was working hard to bring transparency in the system and eliminate corruption from the society. The transparent disbursement of Rs 125 billion among the needy people was the proof of his dedication for a change in the system.\nOmer Ayub said due to the outbreak of coronavirus the the country’s development process had slowed down, however, it would now start on fast-track basis.\nHe said the Haripur district kept deprived of the development projects and that was why its people had been facing many problems, including shortage of electricity. The Pakistan Tehreek-e-Insaf government initiated many electricity projects in the district, including setting up feeders and grid stations in Khanpur, Hattar and other areas costing billions of rupees, to resolve the power issues.\nTalking about the electricity and gas provision schemes worth Rs104.3 million for Kohi Nara and Vijjian, he said the agriculture in both the areas would be developed after completion of the projects.\nEarlier, Member of Khyber Pakhtunkhwa Assembly Arshad Ayub Khan said thee development projects launched in the area were the result of the people’s confidence, who had voted for the PTI and his family in the last general election.\nHe said Haripur was the only district in KP where development schemes worth Rs 20 billion were initiated.",
  "retrievedAt": "2025-08-11T19:40:36.674Z"
}
