{
  "title": "GIS introduced in NHA to optimize revenues, ensure transparency: Murad Saeed",
  "link": "https://www.app.com.pk/national/gis-introduced-in-nha-to-optimize-revenues-ensure-transparency-murad-saeed/",
  "date_published": "2020-08-17T04:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Minister for Communications and Postal Services Murad Saeed on Monday said, landmark Geographic Information System (GIS), has been introduced in NHA to optimize its revenues and bring transparency in the institution.\nAddressing the launching ceremony of Geographic Information System of National Highways Authority (NHA), he said that it was revolutionary step under which digitization of the complete information regarding utilities and commercial amenities in the Right of Way (ROW) of the NHA network has been done.\nAbout the two year performance of the NHA, he said in comparison with the last two years of the PML-N government and first two years of the PTI government had built 546 kilometer more roads which were the difference of 48.2 per cent.\nMurad Saeed said that the past two years performance of the NHA was exemplary as the government had taken steps to strengthen the national institutions.\nHe said  Sukkur-Hyderabad (M-6) Motorway will bring a development revolution in interior Sindh.\nHe said that the 306-KM will be constructed on a build-operate-transfer (BOT) basis while construction of Hyderabad-Sukkur Motorway would start soon and after its completion commuters would enjoy motorway facility from Peshawar to Karachi.\nNHA has also planned to build Sialkot-Kharian and Kharian Rawalpindi Motorways on BOT basis and their feasibility studies would be completed this year.\nSimilarly Balkasar-Mianwali road and Mianwali-Muzafargarh Road would be dualized under the PPP model, he said.\nHe said Multan- Muzafargarh-D.G. Khan road was also being planned to be built on the PPP-BOT model.\nHe said that work on Western alignment of China Pakistan Corridor has become a reality and many more road projects in Balochistan were under process.\nHe said that Phase-II of the Swat Motorway would be launched by end of this year.\nMurad Saeed said a welfare state based on justice and compassion was the vision of Imran Khan and provision of shelter to the homeless people through Panaghahs was a step towards that direction.\nThe minister said that now number of Panahgahs had launched 200 figure which were providing residence to the labor class and those coming in search of jobs, he added.\nPrime Minister Imran Khan launched the Ehsaas Nash-o-Numa programme last week under which, the provision of satisfactory food for deserving pregnant women and children below 2 years of age, quarterly stipend for children would be given.\nHe said that during past one week many good news were given which included record increase in remittances, emergence of Pakistan Stock Exchange has emerged as the second fastest growing market of the world, Moody’s declaring Pakistan economy as stable, revival of economy despite corona virus, signing of agreement for up-gradation  of ML-1 rail track.\nHe said trade deficit decreased, and current account deficit controlled. He said that the corona virus curve was flattened as a result of timely and effective decision making and appropriate measures by the government under the leadership of Prime Minister Imran Khan.\nHe said that the most modern housing project in history of Pakistan “Ravi City” had been inaugurated near Lahore and Peshawar residents had been provided access to state-of-the-art and fully self-sufficient means of transportation in the form of BRT.\nHe said that the foundation stone of Diamer Bhasha Dam had been laid, and dozens of small water reservoirs were being prepared to meet water and power needs of the country.\nThat as a first major step towards providing cheap electricity to consumers, the government signed a basic agreement with Independent Power Producers (IPPs).\nHe said that $1.5 billion were saved in Karkey project which were equal to Rs240 billion whereas Rs 400 billion were saved in Gas Infrastructure Development Cess (GIDC).\nMoreover he said Rs604 billion would be saved in new agreement with Independent Power Producers (IPPs).",
  "retrievedAt": "2025-08-11T19:40:36.618Z"
}
