{
  "title": "Ulema evolve consensus on SOPs regarding Muharram processions",
  "link": "https://www.app.com.pk/national/ulema-evolve-consensus-on-sops-regarding-muharram-processions/",
  "date_published": "2020-08-17T04:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): The religious scholars of various schools of thought and government on Monday evolved consensus on standard operating procedures (SOPs) to curb the spread of Covid-19 during the Majalis and processions of Muharram-ul-Haram.\nThe consultative meeting, chaired by Minister for Religious Affairs and Interfaith Harmony Sahibzada Noor ul Haq Qadri, agreed upon the SOPs, said a press release.\nThe representatives of ministries of interior, health and district administration of Islamabad Capital Territory (ICT) were also present in the meeting.\nAccording to the SOPs, only licensed and traditional processions will be allowed.\nThe wearing of masks and use of hand sanitizers are mandatory. Common glass for drinking water will be avoided during the processions and Majalis. The number of participants of gathering should be kept at minimum possible level besides keeping the Majalis briefed.\nAged persons will not be allowed to participate in the processions. The processions will not be stopped at narrow places except at airy and spacious ones.\nThe volunteers will be assigned to ensure the implementation of the SOPs.\nAmong the agreed SOPs are included social distancing in gatherings, marking for sitting, no-entry without mask, no use of carpet, management to provide masks at the entry points of Imam Bargahs, Ban on hand shake or hugging, besides the take-away of food instead of servings.\nThe Covid-19 tests of Zakareen should be made mandatory and only those having negative Covid-19 reports should be allowed to conduct Majalis.\nWearing of masks should be made mandatory for Zakarian. In closed doors, the use of air conditioners should be avoided. The mourners should not be allowed to touch Alam (flag), Taazia and Shabih.\nAll the sects would promote love, tolerance and congenial atmosphere among themselves and any contentious issue among them will be resolved amicably.\nCriticising the opponents at mass gatherings should be avoided. Ulema should also highlight the plight of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) while narrating Karbala events.\nThe federal government has asked the provincial governments to hold such meetings at their respective provincial capitals for ensuring congenial atmosphere during the holy month of Muharram ul Harram.\nEarlier, Pir Noor ul Haq Qardi told the participants of the meeting that the enemies were busy in creating unrest in the country by fanning sectarian bigotry. He asked the Ulema to frustrate the strategy of such elements.\nImposing one’s opinion on others was wrong, he said adding the pandemic was under control right now, however, any negligence could prove destructive.\nHe said Pakistan was the only country where mosques were remained open during the peak of coronavirus pandemic. The persons trying to fan hatred on social media should be taken to the task, he added.\nMinistry of Religious Affairs and Interfaith Harmony Secretary Sardar Ijaz Khan Jaffar said the ministry was playing its role to check the publication of hate material coming from neighbouring country.\nHe urged the Ulema to visit each other’s mosques and seminaries for promotion of congenial atmosphere.\nUlema including Allama Arif Wahidi, Syed Buzarg Shah Al Azhari, Dr Zafar Jalali, Maulana Sharif Hazarvi and others attended the meeting.",
  "retrievedAt": "2025-08-11T19:40:36.578Z"
}
