{
  "title": "Smartwatch may help boost treatment for depression",
  "link": "https://www.app.com.pk/national/smartwatch-may-help-boost-treatment-for-depression/",
  "date_published": "2024-02-24T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP):Smartwatches may not only help count steps, and sleep but can also offer mental health clinicians valuable information about depression symptoms, according to a new study.\nWearable technology is part of a focus on precision medicine that will allow clinicians to better tailor treatment for individual patients, said Joshua Curtiss, Assistant Professor of applied psychology at Northeastern University, US.\n“The purpose of this type of research was to figure out if we can use passive sensor data to predict the things we care about — to see if it is associated with changes in depression severity or symptom severity,” Curtiss said.\n“It showed the very individualised ways depression manifests in people,” he said, in an article published in the New England Journal of Medicine.\nFor the study, the team took data from anonymised patients at Massachusetts General Hospital (MGH), who wore the Empatica E3 wristband to track sleep, acceleration and movement, heart rate variability and other physiological indicators, Health Daily reported.\nAlterations in the pattern of sleep — too much or too little — can be symptoms of depression, as can lack of physical activity and social isolation.\nAll of these symptoms can be tracked by wearable technology in the form of digital watches and smartphones, Curtiss said.\nIn the case of socialisation with others, for instance, clinicians can view data to see how often text messaging apps have been used, he said.\n“I think passive sensor data can offer an incredible tool for getting more information that otherwise is really difficult to get,” Curtiss said.\n“This is not to supersede clinical judgement,” Curtiss said.\n“We combine (sensor) information with our clinical judgement and what the patients are telling us to get a full picture.”\nIf the data shows the patient hasn’t had much physical activity, which could indicate fatigue or anhedonia — lack of enjoyment in life — the clinician could bring it to the patient’s attention and discuss what’s going on, he said.\nThe same goes for sleep patterns, Curtiss said.\nWhile patient accounts are critically important, it’s normal for patients to under report or over report symptoms, either because they forgot something, have grown accustomed to being in distress or have tired of filling out mental health questionnaires, Curtiss said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:54:14.041Z"
}
