{
  "title": "ECP assigns Non-Muslim special seats to parties following February elections",
  "link": "https://www.app.com.pk/national/ecp-assigns-non-muslim-special-seats-to-parties-following-february-elections/",
  "date_published": "2024-02-24T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP): The Election Commission of Pakistan (ECP) has issued a notification allocating non-Muslim special seats to various political parties in proportion to the seats won by each party in the National Assembly elections held on February 8.\nAccording to the notification, out of a total of 10 minority seats, Pakistan Muslim League Nawaz (PML-N) clinched 4 Non-Muslim seats, while the Pakistan People’s Party (PPP) secured 2 seats, and the Muttahida Qaumi Movement (MQM) obtained 1 seat, making a total of 7 seats distributed among the parties.\nPML-N’s non-Muslim members in the National Assembly include Kesoo Mal Kheal Das, Darshan, Nelson Azeem, and Isphanyar M Bhandara. For the PPP, Ramesh Lal and Naveed Aamir won non-Muslim seats in the NA. Mohan Manjaini secured a seat in the NA as an MQM nominee.\nLikewise, In Khyber Pakhtunkhwa, a notification has been issued for 5 seats specifically designated for women on reserved seats in the provincial assembly. Two seats each for women have been allotted to the Pakistan Muslim League (N) and Jamiat Ulema e Islam (JUI), while the Pakistan People’s Party has been allocated one reserved seat for women in the Khyber Pakhtunkhwa assembly.\nJUI’s declared elected MPAs for reserved women seats include Rehana Ismail and Asima Alam. PML-N’s declared elected MPAs for reserved seats include Sobia Shahid and Shehla Bano. The declared elected MPA for PPP is Nelofar Babar.\nThe Election Commission is still deliberating on the allocation of specific seats to the Sunni Ittehad Council, as well as deciding on 26 seats in the Khyber Pakhtunkhwa Assembly, which include 21 reserved seats for women.",
  "retrievedAt": "2025-08-11T00:53:53.383Z"
}
