{
  "title": "Stock market ends lower after range-bound session - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange ended slightly lower on Friday following a lacklustre and range-bound session, with the benchmark KSE-100 Index shedding 312.77 points, or 0.26 per cent, to close at 119,649.\n\nThe index fluctuated sharply during the day, hitting an intraday high of 544 points and a low of 421 points, as investors largely opted to stay on the sidelines ahead of the weekend. Analysts attributed the muted session to a lack of new triggers, particularly after the index touched its all-time closing high earlier in the week.\n\nAccording to the brokerage house Topline Securities, the most positive contributions to the index came from Engro Holdings Limited, Systems Limited, Bank Al Habib, United Bank Limited and Bank Alfalah, which collectively added 271 points.\n\nOn the flip side, negative contributions came from Fauji Fertiliser Company, Lucky Cement, Mari Petroleum, Oil and Gas Development Comp­any, Pakistan State Oil and Engro Fertilisers, which collectively drag­ged the index down by 476 points.\n\nIn terms of traded value, Hub Power Comp­a­­ny led the charts with tur­nover of Rs1.24 billion, fol­­­lowed by Pakis­tan Sta­te Oil (Rs1.21bn), Nishat Mills Limited (Rs820 million), Pak Elektron Limited (Rs817 m) and Uni­­ted Bank Limited (Rs756m).\n\nSome momentum was seen in the second half of the session, particularly in the engineering sector. The sector, heavily reliant on imports, recorded gains after Prime Minister Sheh­­baz Sharif approved a major reform in the tariff regime.\n\nThe government announced plans to phase out additional customs duty (currently between 2pc and 7pc) and regulatory duty (ranging from 5pc to 90pc) over the next four to five years.\n\nA cap of 15pc on customs duty was also approved, down from current levels that can exceed 100pc on certain items. The policy is expected to ease cost pressures on industries dependent on imported inputs.\n\nTotal traded volume for the day stood at 570m shares, while the traded value clocked in at Rs29bn.\n\nDespite Friday’s dip, the market wrapped up the week on a highly positive note. According to Arif Habib Limited, the KSE-100 Index posted its highest weekly gain in five years, rising by 12,475 points, or 11.64pc, on a week-on-week basis.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6827e6047347a.gif",
  "retrievedAt": "2025-10-12T03:06:53.548Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911524/stock-market-ends-lower-after-range-bound-session",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:59.000Z"
}
