{
  "title": "Security forces kill two assailants after they attempt to attack FC post in Turbat: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces killed two armed assailants on Friday night in an encounter after they tried to attack a Frontier Corps (FC) check post in Balochistan’s Turbat city of Kech district, according to the police.\n\nFaced with increasing attacks by militants, especially in Khyber Pakhtunkhwa and Balochistan, security forces have also intensified counterterrorism operations.\n\nAccording to a police statement, Kech SSP Zohaib Mohsin said, “Unidentified armed men tried to attack an FC check post last night, but the forces killed the two armed men in retaliation.\n\n“While chasing the two armed men, they were surrounded and killed in Sangani Sar and their bodies were later handed over to the administration. However, the identities of the slain men have not been ascertained yet,” the statement quoted him as having said.\n\nIn another incident in Nasirabad, 40 kilometres from Turbat, women and children were injured when a grenade was thrown at a house.\n\nAccording to police office Zahoor Ahmed, unidentified motorcyclists threw a grenade at a house in Nasirabad.\n\nAs a result, Meeral Qasim, Ayesha Shabbir, Fatima Shabbir and Shahzad Shabbir were injured,\n\nFour Levies personnel were also martyred in an armed attack on their check post in the Nasl area of Khuzdar district late on Friday night.\n\nEarlier in the week, one person was killed and 10 others injured when a blast struck the convoy of PPP MPA Ali Madad Jattak in Quetta on Wednesday, but the lawmaker was unharmed.\n\nEarlier in the week, Balochistan Chief Minister Mir Sarfraz Bugti declared that the ongoing insurgency in Balochistan will soon meet the same fate as the Kurdish movement in Turkiye, asserting it is an India-backed conflict driven by self-interest rather than a fight for rights.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:54.145Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911598/security-forces-kill-two-assailants-after-they-attempt-to-attack-fc-post-in-turbat-police",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T11:55:04.000Z"
}
