{
  "title": "HBL PSL 2025: Action resumes after nine-day hiatus with playoffs race wide open - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The HBL Pakistan Super League (PSL) is set to resume on Saturday after a nine-day hiatus with the league entering a decisive phase as five teams remain in the hunt for the four playoff spots.\n\nThe league was postponed due to cross-border tensions taking place between Pakistan and India between the early hours of May 7 and May 10, when the escalation seized after a ceasefire agreement.\n\nThe disruption had seen overseas players fly out of the country before the Pakistan Cricket Board’s decision to resume the tournament got the six franchises scrambling to get their squads back together.\n\nWith only eight matches left in the league stage of the 34-match season, the battle for qualification has intensified, with last year’s finalists Multan Sultans already knocked out of contention after losing eight of their nine matches.\n\nThe Rawalpindi leg will host the final round of league matches before the playoffs shift to Gaddafi Stadium in Lahore, scheduled from May 21 to 25, with May 24 marked as a rest day.\n\nSaturday’s clash between David Warner-led Karachi Kings and Babar Azam’s Peshawar Zalmi will mark the resumption of the tournament and set the tone for a high-stakes final week.\n\nKings, currently second on the table with 10 points from nine games, require at least one more win to seal their playoff berth. Zalmi, placed fifth with eight points from eight games, are under pressure to win both of their remaining fixtures to secure qualification and preserve their record of reaching the playoffs in every PSL edition.\n\nQuetta Gladiators have already booked their place in the playoffs with 13 points, and will take on the eliminated Multan Sultans on May 18. While that match may have no bearing on the qualification race, it will offer Gladiators an opportunity to fine-tune their playing XI and test their new signings ahead of the playoffs.\n\nIslamabad United and Lahore Qalandars, both sitting on eight points from nine games, have one fixture left each and must win to stay in contention. Qalandars face Zalmi on May 18 in a virtual eliminator, while United’s final game will be against Karachi Kings on May 19.\n\nA number of international players have returned to bolster their respective squads for the final stretch. Karachi Kings will be reinforced by the return of skipper Warner along with James Vince, Tim Seifert, Mohammad Nabi, Ben McDermott and Scotland’s George Munsey.\n\nIslamabad United, whose last outing saw them halt a four-match losing streak after a blistering start to the season, have recalled Alex Hales, Rassie van der Dussen, Ben Dwarshuis, Jimmy Neesham and Tymal Mills.\n\nLahore Qalandars, hit by injuries to Tom Curran and Daryl Mitchell, have brought in Bangladesh all-rounder Shakib Al Hasan and Sri Lanka’s Bhanuka Rajapaksa. Zimbabwe’s Sikandar Raza will also rejoin the squad for the crucial match against Zalmi but will depart before the playoffs due to international commitments.\n\nPeshawar Zalmi, whose campaign has seen a late revival, will rely on returning overseas players including Tom Kohler-Cadmore, Max Bryant, Najibullah Zadran and left-arm pacer Luke Wood.\n\nHowever, they will miss the services of Alzarri Joseph and Mitchell Owen due to other league commitments. Quetta Gladiators have confirmed the continued availability of key overseas performers Rilee Rossouw and Finn Allen, while also adding Dinesh Chandimal, Avishka Fernando and Gulbadin Naib to their ranks.\n\nMultan Sultans, out of the playoff race, will field replacement overseas players to meet league requirements. Peter Hatzoglou and Dilshan Madushanka have been named, following injuries and unavailability of their earlier foreign contingent.\n\nHeading into the final week of the league stage, the top run-scorer is Multan’s Mohammad Rizwan with 363 runs, earning him the Hanif Mohammad Cap, followed by Sahibzada Farhan (321) and Fakhar Zaman (309).\n\nOn the bowling front, Mohammad Abbas Afridi and Jason Holder are joint leaders with 15 wickets apiece, while Abrar Ahmed and Hasan Ali have taken 14 wickets each.\n\nPeshawar’s Mohammad Haris leads the wicketkeeping charts with 10 dismissals, and Rilee Rossouw of Gladiators tops the catching list with 11 grabs.\n\nWith playoff hopes hanging by a thread for several teams, and key fixtures set to take place over three consecutive days in Rawalpindi, the tenth edition of the PSL is poised for a dramatic conclusion to the league stage before attention turns to Lahore, where the champion will be crowned on May 25.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:05:52.147Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911495/hbl-psl-2025-action-resumes-after-nine-day-hiatus-with-playoffs-race-wide-open",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:05.000Z"
}
