{
  "title": "National Assembly passes landmark bill to criminalise child marriages in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Assembly on Friday unanimously passed a significant bill seeking stringent laws and penalties to curb child marriages and protect girls from becoming mothers in their teens.\n\nThe bill, tabled by MNA Sharmila Faruqui, was not on the agenda of the proceedings but was introduced by suspending relevant rules. Once the bill becomes an act, it will be implemented in the federal capital and no court other than that of the district and sessions judge shall take cognizance of or try any offence under it.\n\nWhen the bill becomes a law, the Child Marriage Restraint Act 1929 will stand repealed to the extent of the Islamabad Capital Territory (ICT). However, all orders made, decisions taken, judgements passed by any court shall be deemed to have been validly made, taken and passed under this act.\n\nThe bill was introduced with the object to curb, discourage and eventually eradicate the concept and phenomenon of child marriages.\n\nNo nikah khwan shall register a marriage where one or both contracting parties are below 18 years of age, says bill\n\n“In this modern day and age, we have the resources and the research which invariably proves that child marriage is harmful to both genders and especially girls who have hit puberty and are able to bear children. Furthermore, child marriages are in complete violation of the rights of children and international obligations and goal 5 of the United Nations Sustainable Development Goals focuses on gender equality and includes a target to end child marriage by 2030,” stated the bill, whose copy is available with Dawn.\n\nIt said: “Therefore, in order to restrain child marriages and protect the basic rights of children, it is expedient to enact a law for the ICT.”\n\nThe bill said no Nikah registrar shall register a marriage where one or both the contracting parties are below the age of 18 years and any person solemnising Nikah must ensure that the contracting parties possess valid Computerised National Identity Cards (CNICs) duly issued by the National Database and Registration Authority (Nadra), clearly showing their respective dates of birth.\n\nIt said whoever contravened with or failed to comply with sub-section (1) and (2) shall be liable to be punished with simple imprisonment for a term which shall not be more than one year and with fine amounting to Rs100,000, or both, unless he proved that he had reason to believe that the marriage was not a child marriage.\n\nThe bill sought further punishment for male adults above 18 years of age marrying a child and said: “Whoever, being a male above eighteen years of age, contracts a child marriage shall be punished with rigorous imprisonment which may extend to three years but shall not be less than two years and shall be liable to fine.”\n\n“Any form of co-habitation, before attaining the age of eighteen years, with or without consent, resulting from a child marriage shall be considered child abuse under this Act.\n\n“Any person who induces, forces, persuades, entices or coerces any child bride or child groom to engage in any such activity prohibited by sub-section (1) or commits an act of child abuse shall be punished with imprisonment for a term which shall not be less than five years and may extend up to seven years and with fine which shall not be less than Rs1 million, or both.”\n\nThe bill stated that any person who recruits, harbours, transports, provides or obtains any child for the purpose of marriage shall be punished with imprisonment of either description for a term of three years with fine.\n\nIt also proposed punishment for the parent or guardian concerned in a child marriage and said: “Where a parent or guardian or any other person in any capacity, lawful or unlawful, does any act to promote the child marriage, child abuse or permits child marriage to be solemnised, or negligently fails to prevent it from being solemnised, shall be punished with rigorous imprisonment which may extend to three years but shall not be less than two years and shall also be liable to fine.”\n\nThe bill said notwithstanding anything to the contrary contained in any other law, the court may, if satisfied from information laid before it through an application that a child marriage in contravention of this act was going to be arranged or was about to be solemnised, issue an injunction prohibiting such marriage: provided that where a parent of a child involved in a child marriage or third party has laid the information before the court and requests to keep his/her identity hidden from the contracting parties or from the parents or guardians of the contracting parties or the other parent, then the court shall adopt appropriate measures to protect the identity of the third party or parent who has made the application before the court.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:59.361Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911451/national-assembly-passes-landmark-bill-to-criminalise-child-marriages-in-islamabad",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:36.000Z"
}
