{
  "title": "Experts sceptical about longevity of ceasefire between Pakistan and India - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Experts at a programme held on Friday, which included speeches and a panel discussion on “South Asia in Crisis: Implications of Pakistan-India Tensions”, were of the opinion that it is still too soon to say that the ceasefire between Pakistan and India is going to last.\n\nThe event was organised by the Karachi Council on Foreign Relations (KCFR) and the Sindh investment department at the Quaid-i-Azam House Museum. Speaking on the occasion, defence analyst Ikram Sehgal said that May 7 was an all-out Indian offensive.\n\n“They started probing with drones, then they attacked us with missiles before we effectively grounded their air force. They kept on attacking us with their drones until we responded with our missiles on May 10, and India was no longer the dominant power in the region.\n\nMeanwhile, Pakistan is a force to be reckoned with,“ he said. “We want peace,” he added, “but I don’t think we will ever have peace with India. It is not their mindset,” he pointed out.\n\nSharing some takeaways from the events of the last few days, Washington-based analyst on South Asia Michael Kugelman said through a recorded message that this was the closest that India and Pakistan came to war since Kargil in 1999. “This was also the biggest test of nuclear deterrence,” he said.\n\n“It was the first time that India and Pakistan used drones in conflict, along with starting a kind of competition among the suppliers of weaponry,” he added.\n\nHe also pointed out how a significant amount of disinformation was spread. This also involved the use of AI to make deepfakes. “And finally, the key takeaway in all this is US diplomatic intervention. Taking an aloof stance initially, they did get involved after all,” he said.\n\nUnable to join in person due to pressing engagements in Islamabad, Senator Mushahid Hussain Sayed also sent a recorded message in which he said that it only took 15 hours to change the geo-strategic dynamics of South Asia.\n\n“With a larger army, better technology, sophisticated weaponry and a bigger nuclear threshold, India was the bully of the block. But it no longer is after Pakistan responded to Indian attacks,” he smiled.\n\n“India wanted to bury the Kashmir issue but it has ended up reviving it thanks to the intervention by US President Donald Trump. India had said that it will never accept third-party intervention although it did that exactly,” he said.\n\nLater, the event was followed by a panel discussion on the way forward where Dr Huma Baqai was seen in conversation with former chairman of the Federal Board of Revenue Shabbar Zaidi, Defence analyst Syed Wajeeh Ul Hassan and senior journalists Owais Toheed and Mazhar Abbas.\n\nMr Zaidi said that the people of both sides, Pakistan as well as India, are not ready for the truth. “There are 650,000 troops in India-Occupied Kashmir and Pakistan can never militarily occupy Kashmir,” he said.\n\n“It is the Kashmiris, who are the real party who will decide what is to become of Kashmir. Otherwise, nothing will change,” he added. Mazhar Abbas said that it is important to understand Narendra Modi and how he developed himself after the Gujarat earthquake in 2001. “The failure of Atal Bihari Vajpayee in Kargil and his engaging President Musharraf by inviting him to Arga showed that India wanted its issue with Pakistan to be resolved.\n\nBut then after India voted BJP to power, it basically threatened nuclear war,“ he said, adding that he personally believed that the war was not yet over.\n\nOwais Toheed said that there have been several phases in Indian society with Jawaharlal Nehru laying the foundation of secular India, Manmohan Singh’s economic policy and now Modi who targets the social philosophy of India and influences their business institutes and media.\n\nIn fact, the Indian media think that they need to toe the BJP line to survive. Wajeeh ul Hassan reminded that it is not just Modi who is inclined towards war with Pakistan. The 1971 war with India was backed by the Indian Congress and Indira Gandhi.\n\nAsked if India would accept the recent ceasefire, the answer was that “ceasefire does not mean that war has ended. It means that we are ready for war, though not fighting at the moment”. It was pointed out by Mr Hassan then that India is an enemy who thinks of itself as powerful. It is also wounded and humiliated at the moment, and it will find reasons to attack again.\n\nEarlier, KCFR Chairperson Nadira Panjwani said that the recent events have brought up an extraordinary crisis between two nuclear powers. “With our military triumph, the myths about India’s supremacy were busted. As our journalists acted responsibly with so much restraint, there were the Indian journalists who made a laughing stock of themselves,” she added\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:06:06.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911486/experts-sceptical-about-longevity-of-ceasefire-between-pakistan-and-india",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:22.000Z"
}
