{
  "title": "PTI leader Ali Zafar asks world to denuclearise India - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As India came under fire in the Senate on Friday for recent unprovoked aggression against Pakistan and for targeting civilians, a PTI leader called for nuclear disarmament of the hostile neighbour for being an irresponsible atomic power.\n\nOn recent tensions with India, PTI’s parliamentary leader in the House Barrister Ali Zafar said India had proved itself to be an irresponsible state that violates international law. “India’s nuclear arsenal poses a threat to peace in the region and beyond. The international community must act to denuclearise India in the interest of humanity,” he said.\n\nHe said India’s propaganda that Pakistan’s nuclear weapons were not safe has failed and it has shown that its own nuclear assets were not safe.\n\nHe said the international community must denuclearise India and stop giving it arms, as these could be used against innocent civilians. He said the recent hostility and the powerful response to aggression shattered India’s dream of regional hegemony.\n\n“Our air force proved during a single night to be the king of the skies,” he said, adding that after recent developments, the Kashmir dispute has once again taken the centre stage. He advised Indians to get rid of extremist Narendra Modi and choose a leader who wants to live in peace with neighbours.\n\nRumpus in Senate over Nawaz’s silence during tension with New Delhi\n\n“The Indian nation should see where Modi is taking them,” he said, adding that the people and political parties were united for Pakistan. “The war is not over yet. There is no need to celebrate much. Modi is heartbroken, he is like a wounded rat,” he said.\n\nHe also propos­ed setting up a parliamentary committee on the Indus Waters Treaty. Stressing that national unity was need of the hour, Ali Zafar called for ending the persecution of PTI. He demanded the immediate release of all political prisoners and the withdrawal of fabricated cases against PTI leaders.\n\nPML-N parliamentary leader Irf­a­nul Haq Siddiqui in his speech said Pakistan stands for peace but was capable enough to defend its ter­­ritorial integrity and sovereignty.\n\nHe said that the national unity witnessed during recent tensions, will also be remembered as a shining chapter in Pakistan’s history. Senator Siddiqui said that the most positive aspect of India’s aggression and Pakistan’s resounding victory is that today, the government and opposition stand united. “This national unity is the real success,” he remarked.\n\nCriticising India’s regional policies, he noted that India’s history was marred by strained relations with neighbouring countries.\n\n“Whether it’s Nepal, Bhutan, Pakistan, or Sri Lanka, India has never maintained friendly ties with any of them. India can never turn Pakistan into Gaza, and this message has been firmly conveyed to it. Our valiant forces have proven that wars are not just fought with weapons, but with spirit, courage, and determination,” Mr Siddiqui said.\n\nNawaz’s silence questioned\n\nThe House also witnessed an up­­roar and a war of words after PML-N supremo Nawaz Sharif’s silence du­­ring heightened tension with India was questioned by a PTI lawmaker.\n\nPTI Senator Aon Abbas Buppi said the people of Pakistan demonstrated an unprecedented unity when the country had to face an unprovoked aggression. The atmosphere became tense when Buppi turned his guns towards Nawaz Sharif and chided him for keeping mum during escalation of tensions with the hostile neighbour.\n\nHe drew a comparison between PTI founder Imran Khan with PML-N supreme Nawaz Sharif in the conflict and said that his party leader Imran Khan in a post on X said those who cannot stand against Prime Minister Narendra Modi’s war were not Pakistanis.\n\n“At the same time, some people remained silent for two weeks and did not utter a single word against Modi. Perhaps, they have some business interests,” he said. “It would be written in history that a person whose party was imposed on the nation and was the biggest beneficiary of the system and whose daughter was the chief minister (of a province) didn’t utter a word about Modi till today.”\n\nHe also targeted Defence Minis­ter Khawaja Muhammad Asif and said that no one demeaned and em­­b­­arrassed the country more than him.\n\nAmidst an uproar in the House Presiding Officer Senator Sherry Rehman noted that Senator Buppi has tried to “pollute the atmosphere of the House, though no one did this during the session. “You are in violation of the spirit of the House. Ple­ase take your words back,” she said.\n\nParliamentary Leader of PML-N in the House Senator Irfan Siddiqui said that the leadership of all political parties was always respected on a reciprocal basis. He stressed that his party could criticise PTI leader Imran Khan for a number of reasons, but insisted this was not an occasion for such things. “If you disrespect my leader, your leader will also be disrespected,” he added.\n\nPTI Senator Humayun Mohmand sarcastically said that he was misunderstood that Mr Sharif was silent over the issue but it was Punjab Information Minister Azma Bokhari who revea­led that the ex-premier designed the whole operation against India. “Perhaps he was designing this operation while sitting at a secret place,” he added. The PTI lawmaker also said the superior judiciary has undermined its independence and said that it was now trying to steal the reserved parliamentary seats from PTI.\n\n“This practice of judiciary is a threat amid the ongoing war with India,” he added. PPP lawmaker Jam Saifullah Dharejo staged a walkout from the House after Presiding Officer Senator Sherry Rehman refused to allow him to deliver a written speech.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:16:17.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911522/pti-leader-ali-zafar-asks-world-to-denuclearise-india",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:50.000Z"
}
