{
  "title": "Challengers, Strikers register hard-fought wins in National Women’s T20 - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Brilliant performances by Sadaf Shamas and Eyman Fatima powered Challe­ngers and Strikers to victories over Stars and Invincibles respectively in the National Women’s T20 Tournament here on Friday.\n\nAt the National Bank Sta­dium, Challengers edged past Stars by five wickets in a last-over thriller. Chasing 109, the side recovered from 47-5 to reach the target with one ball remaining, thanks to an unbroken 65-run stand betw­een Aliya Riaz (48 not out off 34 balls, seven fours) and skipper Rameen Shamim (28 not out off 19, one six and two fours).\n\nEarlier, after opting to bat first, Stars were rattled by Sadaf Shamas’ incisive spell of 5-17, as they were reduced to 32-5.\n\nOnly Kaynat Hafeez offered resistance, top-scoring with a gritty 48 off 52 balls (four fours), while Waheeda Akhtar contributed an unbeaten 21 off 16 balls to help the side post 108-9 in 20 overs.\n\nRabia Rani also impres­sed with the ball, claiming 3-17.In reply, Anosha Nasir struck thrice for Stars, finishing with 3-11, but Aliya and Rameen’s calm heads ensured Challengers reached 112-5 in 19.5 overs. Sadaf was named player-of-the-match.\n\nAt the Oval Academy Ground, Strikers secured a convincing seven-wicket victory over Invincibles.\n\nChasing 144, Strikers rode on a blistering unbe­aten 74 off 39 balls from Player of the Match Eym­an, who struck 10 fours and two sixes.\n\nShe was well supported by captain Gull Feroza, who compiled a steady 49 off 46 balls (five fours), as the duo added 105 runs for the third wicket after Strikers had lost two early wickets.\n\nThe chase was completed in 17.4 overs.Invincibles, after a solid 72-run opening stand, had earlier posted 143-5. Muneeba Ali top-scored with 67 off 58 balls, hitting four boundaries and two sixes, while Ayesha Zafar made 36 off as many balls. However, a middle-order collapse limited their total, with Noreen Yaqoob picking up 2-21.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6827d4c6ade1a.gif",
  "retrievedAt": "2025-08-23T14:16:02.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911499/challengers-strikers-register-hard-fought-wins-in-national-womens-t20",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:05.000Z"
}
