{
  "title": "MNA alleges pharma companies creating artificial drug shortages - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Members of the National Assembly on Friday expressed serious concerns over an alleged artificial shortage of essential medicines, particularly for diabetes, accusing pharmaceutical companies of deliberately manipulating supply to drive up prices in the black market.\n\nMNA Dr Shazia Sobia Aslam Soomro brought the issue to light during the National Assembly’s question hour. She criticised the unavailability of critical medicines in hospitals and pharmacies, alleging that they could still be easily found in the black market at inflated rates.\n\nResponding to the concern, Parliamentary Secretary for National Health Services, Regulations and Coordination, Nelson Azeem, stated that the Drug Regulatory Authority of Pakistan (DRAP) had not received any formal complaints regarding the shortage or illicit sale of diabetes medications. He added that medicine prices in Pakistan were either on par with or lower than those in neighboring countries.\n\nNelson Azeem highlighted that medicine prices were regulated under the Drug Pricing Policy 2018, approved by the federal cabinet, to ensure transparency and fairness.\n\nHe said DRAP was actively promoting generic drug production by simplifying the registration process and supporting local manufacturers to enhance affordability.\n\nTo counter overpricing, he said DRAP had instructed its field teams to conduct regular market surveys. Legal action had already been taken against four pharmaceutical companies caught overcharging, with action approved by the cabinet. He added that provincial health departments had been asked to enforce the Drugs Act, 1976, which assigns provinces the responsibility of monitoring medicine storage and sales.\n\nDespite the assurances, MNA Samina Khalid Ghurki expressed dissatisfaction with the response and demanded a more comprehensive explanation. “Why are the prices of essential medicines increasing every month?” she asked.\n\nSpeaker Sardar Ayaz Sadiq also intervened, urging the parliamentary secretary to address the issue of shortages, which he noted had become a recurring concern in the house.\n\nMinister of State for Health, Dr Mukhtar Ahmad Malik, acknowledged the possibility of specific brands being in short supply but maintained that alternative medicines containing the same active ingredients were available.\n\nHe noted that non-essential medicines had been deregulated under the previous caretaker government, with their prices now determined by market demand and supply.\n\nMr Malik said DRAP was closely monitoring price trends to assess whether increases were justified. “A comprehensive report will be submitted to the Prime Minister on the impact of the deregulation policy,” he announced, adding that full details, including the percentage of price increases, would be presented to Parliament.\n\nDespite the ministry’s stance that alternatives were available, lawmakers remained unconvinced, insisting that the shortage of key medicines continued to affect patients across the country and demanded government action.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:59.342Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911445/mna-alleges-pharma-companies-creating-artificial-drug-shortages",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:37.000Z"
}
