{
  "title": "Aleema Khanum and PTI’s Kanwal Shauzab face off in tense court exchange over leaked video - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI founder Imran Khan’s sister Aleema Khanum and former party MNA Kanwal Shauzab had a tense exchange in court on Saturday over a video that surfaced of the latter criticising the former.\n\nIn the recently surfaced video, Shauzab can be allegedly heard and seen criticising Aleema for disrespecting party office-holders and interim chairman Barrister Gohar Ali Khan, saying that Imran’s sister should not dent the party. Shauzab allegedly said she would confront Aleema herself over the issue.\n\nThat happened today as Shauzab approached Aleema in the Rawalpindi anti-terrorism court (ATC), saying she wanted to talk to her. However, Imran’s sister said: “Just leave it. What you said was right. Many other people speak against us. We are now used to such accusations.”\n\nTo this, Shauzab told her that she wanted to speak with her in this regard to which Aleema rebuffed her, saying: “I am not angry with you, [now] go.”\n\nShauzab replied: “A specific part of an old video of mine was used against me.” Aleema subsequently told her that many from the PML-N and other parties also spoke against her. Imran’s sister thereafter left while ignoring the party member.\n\nMeanwhile, ATC Judge Amjad Ali Shah rejected Aleema’s petition requesting permission to exempt her from court appearances so she could travel abroad.\n\nTalking to the media outside the court, she said she had been visiting the courts for the past week due to “newer and newer cases”, alleging that they were being filed to impede her travel abroad.\n\nShe questioned who was afraid of her and why for going abroad.\n\nAleema further alleged that there were around 50-60 cases against her for delivering her brother’s messages to the people.\n\nEarlier this week, Islamabad High Court Justice Khadim Hussain Soomro had directed the removal of her name from the Provisional National Immigration List and Passport Control List.\n\nAleema had approached the court to challenge the inclusion of her name in the travel ban lists. The court had allowed her to seek permission to travel abroad by approaching the relevant trial court handling the cases registered against her.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/17172046d2a81a4.jpg",
  "retrievedAt": "2025-08-23T14:15:53.554Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911605/aleema-khanum-and-ptis-kanwal-shauzab-face-off-in-tense-court-exchange-over-leaked-video",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T13:00:51.000Z"
}
