{
  "title": "Tariff reform - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE planned import policy reforms to recalibrate tariffs in line with Pakistan’s industrialisation and export aims signify a major positive shift in the government’s economic and growth strategy.\n\nPrime Minister Shehbaz Sharif has approved a roadmap to drastically slash average customs tariffs from 19pc to 9.5pc in the next five years, besides eliminating decades-old distortive tariff protections for carmakers, steel producers, textiles manufacturers, the chemical sector, and others against foreign competition. Another key reform focuses on reducing the number of existing custom duty slabs from five to four, with peak tariffs lowered from 20pc to 15pc.\n\nThe roadmap also envisages doing away with numerous regulatory and additional taxes on thousands of imported items to bring certainty, transparency and uniformity to cascading margins. The reforms are expected to boost exports by $5bn once the adjustments are phased in, starting with the next budget.\n\nMore importantly, the lower tariff barriers will go a long way in helping Pakistan integrate into the global economy with considerable ease. The tariff reforms should also boost our industrial competitiveness, and allow manufacturers to become part of global supply chains by giving them greater access to raw materials and semi-finished goods.\n\nTrade policy professionals generally agree that the high import taxes are a regressive form of taxation as they make businesses more inward-looking, thus creating an anti-export bias in the overall economic policy framework. Our tariff policy is a testament to that. For decades, we have imposed some of the highest tariffs, a major reason why Pakistan has failed to move to manufacturing high-quality, value-added goods. And regionally, its export-to-GDP ratio remains one of the lowest. High import tariffs and the inability to acquire goods that can support technological progress exacerbate the economic challenges.\n\nIndeed, there are concerns that lower tariffs, which Pakistan has until now used as a major source of tax revenue collection rather than for industrialisation and export growth, would lead to higher imports and, ultimately, to another balance-of-payments crisis. But such concerns are exaggerated and are being raised by those who have made money using tariff protections. There is no doubt that imports would rise but exports will grow at a much faster pace, reducing trade deficit and creating more jobs.\n\nHowever, the assumption that a reformed tariff policy can do the magic on its own is misplaced. Although Pakistan’s import taxes remain higher than its peers, these have come down considerably since the early 1990s when the country embarked upon the path to economic and trade liberalisation.\n\nYet the fall in the average tariffs since then has not translated into proportionate export growth or significant integration into the global economy. This means there also are other policies that need to be fixed along with tariffs.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:56.681Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911546",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:47:34.000Z"
}
