{
  "title": "Iran’s Khamenei says Trump is lying when he speaks of peace - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Supreme Leader Ayatollah Ali Khamenei accused Donald Trump on Saturday of lying when the US president said during his Gulf tour this week that he wanted peace in the region.\n\nOn the contrary, said Khamenei, the United States uses its power to give “10-ton bombs to the Zionist (Israeli) regime to drop on the heads of Gaza’s children”.\n\nTrump told reporters aboard Air Force One after departing the United Arab Emirates on Friday that Iran had to move quickly on a US proposal for its nuclear programme or “something bad’s going to happen”.\n\nEarlier on Saturday, Iranian President Masoud Pezeshkian said Trump speaks about peace while simultaneously making threats.\n\n“Which should we believe?” Pezeshkian said at a naval event in Tehran.\n\n“On the one hand, he speaks of peace and on the other, he threatens with the most advanced tools of mass killing.”\n\nTehran would continue Iran-US nuclear talks but is not afraid of threats.\n\n“We are not seeking war,” Pezeshkian said.\n\nHis remarks, said Khamenei, “aren’t even worth responding to.”\n\nThey are an “embarrassment to the speaker and the American people,” Khamenei added.\n\n“Undoubtedly, the source of corruption, war, and conflict in this region is the Zionist regime — a dangerous, deadly cancerous tumour that must be uprooted; it will be uprooted,” he said at an event at a religious centre in Tehran, according to state media.\n\nWhile Trump said on Friday that Iran had a US proposal about its nuclear programme, Iranian Foreign Minister Abbas Araqchi in a post on X said Tehran had not received any such proposal.\n\n“There is no scenario in which Iran abandons its hard-earned right to (uranium) enrichment for peaceful purposes…” he said.\n\nAraqchi warned on Saturday that Washington’s constant change of stance prolongs nuclear talks, state TV reported.\n\n“It is absolutely unacceptable that America repeatedly defines a new framework for negotiations that prolongs the process,” the broadcast quoted Araqchi as saying.\n\nPezeshkian said Iran would not “back down from our legitimate rights”.\n\n“Because we refuse to bow to bullying, they say we are source of instability in the region,” he said.\n\nA fourth round of Iran-US talks ended in Oman last Sunday.\n\nA new round has not been scheduled yet.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:55.506Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911586/irans-khamenei-says-trump-is-lying-when-he-speaks-of-peace",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T07:42:16.000Z"
}
