{
  "title": "Police launch investigation as Ahmadi doctor shot dead in Sargodha - Pakistan - DAWN.COM",
  "author": null,
  "content": "The police launched an investigation into the murder of locally renowned Ahmadi doctor, Sheikh Muhammad Mahmood, 58, who was shot dead in Punjab’s Sargodha on Friday.\n\n“We cannot comment on whether the doctor was targeted on a religious basis or for some other reason as it would be premature to say,” Sargodha District Police Officer Sohaib Ashraf told Dawn.com.\n\nHe said one person was involved in the murder and the police were already gathering information after launching an investigation.\n\nThe first information report of the incident was filed at Shahid Shaheed Police Station by a relative of Dr Mahmood under Pakistan Penal Code Section 302 (murder).\n\nIt said the deceased was a practitioner at Sargodha’s Fatima Hospital and a renowned individual of the city. The complainant said he reached the hospital with the deceased around 2:35pm.\n\nThe FIR stated that an individual wearing a uniform of the ‘Saaf Suthra Punjab’ initiative approached the deceased and took out a pistol while saying: “I won’t spare you today Mahmood,” and shot the doctor two times in the back.\n\nIt added that the culprit soon fled, with the relative following after him to catch him but the former turned his weapon on the latter as well. The FIR said that another person arrived on a motorcycle and two soon fled away.\n\nA press release by Ahmadi community spokesperson Amir Mahmood said the gastroenterologist had been receiving threats for a while from extremist elements, which had forced him to change the location of his job.\n\n“He was a very charitable person and had no enmity with anyone,” Mahmood said about the deceased, saying Dr Mahmood was a well-known Ahmadi and was receiving threats because of his faith.\n\n“The spokesperson said that this was the third Ahmadi to be targeted in the past month. The sudden increase in the continuous target killing of Ahmadis due to differences in faith is indicating a systematic wave. This is increasing the sense of insecurity among Ahmadis. This requires immediate attention and effective measures from the law enforcement agencies,” the statement said.\n\nThe spokesperson alleged that extremist elements were active against Ahmadis in Sargodha for some time now, as in other areas with baseless cases being registered and hate speeches being made to prevent the community from performing religious rituals.\n\n“The continuous increase in hate incidents against Ahmadis is condemnable. The higher authorities should take notice of these incidents and bring the perpetrators to justice according to the law.”\n\nTwo suspects were arrested last month for the alleged murder of an Ahmadi man and injuring another in Punjab’s Kasur district.\n\nEarlier in April, a 46-year-old businessman was lynched when a few hundred supporters of a religiopolitical party stormed a place of worship belonging to the Ahmadi community in Karachi’s Saddar area to prevent it from observing religious rituals, according to officials.\n\nIn March, the Human Rights Com­­mission of Pakistan said it had observed a growing trend of mob-led attacks on the homes of families belonging to religious minorities, as well as their places of worship.\n\nThe report, titled Under Siege: Freedom of Religion or Belief in 2023-24, said over 750 persons were in prison on charges of blasphemy, as of October last year. It documented at least four faith-based killings, three of which targeted the Ahmadi community.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1700122504bfa01.jpg",
  "retrievedAt": "2025-10-12T03:06:11.568Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911437/police-launch-investigation-as-ahmadi-doctor-shot-dead-in-sargodha",
  "dateList": "2025-05-17",
  "date_published": "2025-05-16T19:20:52.000Z"
}
