{
  "title": "Mianwali District Headquarter Hospital corruption probe ‘shelved’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "MIANWALI: No action has been taken on an inquiry concluded in December 2024 on the charges of corruption, inefficiency and misconduct against the Mianwali DHQ Hospital Medical Superintendent (MS) and three other officials.\n\nThe inquiry found the accused guilty of all charges and recommended their removal from their positions and forwarded the case to the DG Anti-Corruption Punjab.\n\nThis inquiry was initiated on the complaints of Hakim Khan and Mansoor Khan against DHQ Hospital MS Dr Ameer Ahmed Khan, IT & Statistical Officer Shehzad Iqbal, Biomedical/Logistics Officer Mohammad Arsalan, Data Entry Operator Fateh Khan and former Procurement Officer Ahmed Hassan.\n\nThe Mianwali Deputy Commissioner appointed Additional Deputy Commissioner Salman Ahmed Lone to hold an inquiry on the complaint against the MS and others for involvement in corruption, misconduct, misappropriation and embezzlement of government funds.\n\nThe complainants alleged that the MS indulged in corrupt practices during his service tenure starting from 2008. They alleged that in the most recent instance, a fraudulent and illegal payment of Rs 9.12mn was made for purchase of sub-standard medicines. They further alleged that the medicines were purchased from a dummy firm with the connivance of three other employees of the hospital.\n\nThe inquiry report, a copy of the 10-page report is available with Dawn, detailed previous corruption charges and inquiries against the accused dating back to 2008. It said the MS was caught red-handed in 2008 stealing electricity while posted as Medical officer at RHC Daudkhel.\n\nIn 2008, he was dismissed from service by then EDO Health for working illegally at RHC Kamar-Mushani, in 2010 as MS DHQ he was charged by then Mianwali DC under the PEEDA Act proceedings. In 2019, Sargodha Health Director unearthed corruption of Rs 23.025mn in procurement of fuel against him as Mianwali DHQ MS.\n\nThe report said that during his various tenures as Mianwali DHQ MS in 2021, 2022 and 2023 medical store of the hospital was mysteriously set on fire and no inquiry reports had been made public. During 2024, with the additional charge of Mianwali Health CEO, he illegally cut down old trees in the DHQ hospital.\n\nIn 2019, the Pakistan Medical Association (PMA) Mianwali wrote to high ups complaining about the attitude of Dr Ameer and called for a complete audit from 2018 to 2024 during his posting as Mianwali DHQ MS for alleged corruption of billions of rupees.\n\nAn application from a citizen is also pending against the MS for the construction of his hospital without getting an NOC and the same was confirmed by Civil Defense Officer in 2021. However, no action was taken against any of the inquiries.\n\nThe inquiry officer also issued notices to the complainant and accused with the opportunity of personal hearing and took their written statements.\n\nThe inquiry was completed and the report was submitted to the Mianwali DC on December 9, 2024. The DC forwarded the report to the Health department. However, no action had been taken so far on the findings of the report.\n\nDawn tried to speak to the DC but he was not available.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:57.383Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911558/mianwali-district-headquarter-hospital-corruption-probe-shelved",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:58:07.000Z"
}
