{
  "title": "Islamabad, Delhi gained nothing but miseries from wars: PM Shehbaz - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif has offered India to sit for a comprehensive dialogue to settle contentious issues including Kashmir and joi­ntly fight terrorism, remi­nding New Delhi that the neighbouring countries fought three wars in the past and gained nothing but miseries of the people.\n\n“After settling disputes like Kashmir and water distribution, we can talk on trade and counter-terrorism as Pakistan is the worst affected country by terrorism which lost 90,000 lives and over $150 billion economic losses,” PM Shehbaz said while addressing a ceremony here on Friday.\n\nThe ceremony, marking the Youm-i-Tashakur (Thanks­giving Day), was held at Pakistan Monument and attended by PM Shehbaz, Chairman Joint Chiefs of Staff Committee (JCSC) Gen Sahir Mirza, Chief of Army Staff (COAS) Gen Syed Asif Munir, Air Chief Marshal Air Marshal Zaheer Ahmed Babar, Naval Chief Admiral Naveed Ashraf, federal cabinet members, diplomats, the families of martyrs, sports personalities and showbiz celebrities, as the nation celebrated Pakistan’s victory in the recent clash with India.\n\nAddressing the ceremony, PM Shehbaz said, “We have won the war but we want peace. We have taught our enemy a lesson but we condemn aggression. We want this part of the world to be as prosperous and progressive as others through hard work, undying efforts and living like peaceful neighbours.”\n\nIndia asked to sit for talks on Kashmir issue, water distribution, joint fight against terrorism\n\nHe said a war between the two nuclear powers (Pakistan, India) could endanger the lives of over 1.6 billion people living in the Subcontinent. “If there would be nuclear tussles who will live to tell what happened,” he said.\n\nWhile reminding the world that Pakistan’s civil and armed forces had been on the front line in the ongoing fight against terrorists for a long time, he said, “If our armed forces had not engaged them (terrorists), they would have been roaming around in many other countries.”\n\nHe also unveiled details of his late-night meeting with the armed forces heads on May 9 when India attacked three of Pakistan’s airbases. “After Indian attacks, our Army Chief Gen Syed Asim Munir sought permission to retaliate. His voice was full of commitment, courage and patriotism. Later, you saw that how Indian airbases in Pathankot, Udhampur and many other places were hit,” he added.\n\nThe next morning Gen Asim Munir called him to apprise him that Pakistan has given a befitting response to India and that India is seeking ceasefire, PM Shehbaz said, adding that Gen Asim Munir asked him if Pakistan military should accept India’s demand for ceasefire.\n\nThe PM also said he was later informed through evidences that Pakistan had downed six Indian aircraft, including three latest Rafale jets.\n\n“Action of our Air Force with indigenous technology and Chinese planes and gadgets gave such a blow to India that the whole world was stunned how Pakistan achieved such technology silently. Our action demoralised enemies and boosted the confidence of our friends,” he added.\n\nCelebrating the victory, Youm-i-Tashakur (Thanksgiving Day) began with a 31-gun salute after Fajr in the federal capital and a 21-gun salute in the provincial capitals, followed by hoisting of the national flag at PM House, holding of rallies and ceremonies in all major cities.\n\nOn the occasion, the PM in his message highlighted that India while acting cowardly attacked Pakistan on the night between May 6 and May 7, resulting in the martyrdom of innocent citizens.\n\n“We were forced to respond for the sake of these innocent citizens,” he said, adding that the world saw that within a few hours an enemy that was many times bigger came to its knees and the planes that India boasted of turned into ashes and became sign of a bitter lesson of history.\n\n“Our Shaheens hammered the enemy and gave it a befitting reply,” he said. The brave and professional armed forces of Pakistan effectively and fully responded in the language of the enemy and wrote a golden chapter in the military history and foiled the designs of the enemy.\n\nLater PM Shehbaz, accompanied by Defence Minister Khawaja Muhammad Asif and Chief of the Army Staff General Syed Asim Munir, visited Combined Military Hospital (CMH) in Rawalpindi to inquire after the health of troops and civilians injured in the Battle of Truth against India.\n\nThe PM also visited the residence of martyr Squadron Leader Usman Yousaf, offered condolences to his family, and paid tribute to the martyr’s services for the country and his sacrifice while defending the homeland.\n\nHe praised the armed forces for their exceptional bravery, determination, and sense of duty during the battle.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/170807094649f83.png",
  "retrievedAt": "2025-10-12T03:06:48.014Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911473/islamabad-delhi-gained-nothing-but-miseries-from-wars-pm-shehbaz",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:38.000Z"
}
