{
  "title": "PTI’s Shah Mahmood Qureshi moved to cardio institute due to heart pain - Pakistan - DAWN.COM",
  "author": null,
  "content": "Former foreign minister and PTI leader Shah Mahmood Qureshi has been moved from Lahore’s Kot Lakhpat Jail to the Punjab Institute of Cardiology (PIC) on Saturday after he suffered heart pain, his lawyer said on Saturday.\n\nQureshi has been indicted in multiple cases pertaining to the May 9, 2023 riots and has remained behind bars since August 2023.\n\nSpeaking to Dawn.com today, Advocate Rana Mudassar, Qureshi’s lawyer, said his client suffered heart pain early in the morning after Fajr prayers. He underwent a medical assessment by prison doctors.\n\n“He was shifted to the PIC by Rescue 1122 after his health failed to improve,” Mudassar said, adding that Qureshi was currently undergoing various tests at the hospital.\n\nThe PTI leader’s family had been informed about his condition, the lawyer added.\n\nIn a post on X today, Qureshi’s son urged the nation to pray for his speedy recovery.\n\nIn July 2024, the PTI vice-president was indicted by a Lahore anti-terrorism court in a case registered by the Shadman police over allegedly attacking and burning the police station.\n\nThe same month, he was transferred from Adiala Jail in Rawalpindi to Kot Lakhpat on a police request. It had stated that frequent transportation of the PTI leader from Rawalpindi to Lahore was not feasible for the authorities as well as for the jailed ex-minister.\n\nIn November last year, a Lahore ATC indicted Qureshi and other senior PTI leaders in multiple cases relating to May 9 riots. The former foreign minister has pleaded not guilty to all charges.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:55.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911580/ptis-shah-mahmood-qureshi-moved-to-cardio-institute-due-to-heart-pain",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T07:02:47.000Z"
}
