{
  "title": "PM Shehbaz forms committee to implement five-year tariff policy - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif has constituted a high-powered steering committee to implement the five-year National Tariff Policy aimed at boosting industrialisation and exports from the country.\n\nFollowing the anticipated approval of unprecedented tariff revisions, the committee will be led by Finance Minister Muhammad Aurangzeb and will comprise 10 members, including two former bureaucrats — Dr Manzoor Ahmed and Dr Robina Athar — as well as noted economist Dr Ijaz Nabi.\n\nThe committee, officially notified by the Ministry of Commerce’s Tariff Policy Wing, includes key government officials such as the ministers for commerce, petroleum, national food security & research, and railways. It also features senior bureaucrats and economic experts, with the finance minister serving as convener.\n\nAccording to the notification, the committee’s terms of reference include utilising tariffs as a strategic tool to unlock export growth, identifying industrial units impacted by tariff rationalisation, and devising appropriate support strategies.\n\nThe steering committee will oversee the implementation of the National Tariff Policy to ensure its effectiveness, monitor macroeconomic indicators related to tariffs, and develop a strong narrative to attract foreign investment and generate industrial surpluses for export. The Ministry of Commerce will provide secretarial support to the committee, which is also empowered to co-opt additional members from the public or private sector as needed.\n\nAccording to an official announcement, PM Shehbaz approved a gradual yet significant reduction in import tariffs to promote exports and investment in the country. He said no effort would be spared in strengthening the economy, generating employment opportunities, and eradicating inflation. A comprehensive economic reform plan has been developed after consultations with domestic and international economic experts.\n\nUnveiling major tariff reforms, the prime minister announced that customs duty will be capped at a maximum of 15 per cent. He directed the complete elimination of additional customs duty, currently ranging from two to seven per cent, and regulatory duty, which ranges from five to 90pc, over the next four to five years.\n\nFurthermore, the number of customs duty slabs has been reduced to four in order to simplify legal complexities surrounding imports and provide a level playing field for various industries.\n\nThe prime minister noted that the reduction in tariffs would help stabilise the current account deficit and contribute to higher revenue collection. He also established an implementation committee to ensure timely execution of the reforms.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:06:33.039Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911530/pm-shehbaz-forms-committee-to-implement-five-year-tariff-policy",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:59.000Z"
}
