{
  "title": "NA passes money bill along with eight others - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Citizenship amendment bill deferred, two others introduced\n• MNA flags delay in ADB-funded bridges on Kalam Road\n\nISLAMABAD: The National Assembly on Friday passed nine bills, including a money bill that had been blocked by the opposition a day earlier. Only one bill — aimed at amending the Pakistan Citizenship Act, 1951 [The Pakistan Citizenship (Amend­ment) Bill, 2024] (Section 4) — was deferred.\n\nMeanwhile, two new bills were introduced by suspending the rules and were also passed. These were related to child marriages and trade organisations.\n\nLater, the proceedings of the lower house of parliament were adjourned until Monday.\n\nFinance Minister Muhammad Aurangzeb moved a bill to amend the Income Tax Ordinance, 2001 [The Income Tax (Amendment) Bill, 2024], commonly referred to as the ‘money bill’, which had been blocked by the opposition on Thursday. The treasury benches later managed to get the bill passed by a majority vote.\n\nThe Income Tax (Amendment) Bill, 2024 is already in effect, having originally been introduced last year in the form of an ordinance. However, since the ordinance is about to lapse after completing its constitutional period, it was mandatory for the government to have it passed by the assembly to continue its enforcement.\n\nAccording to the statement of objects and reasons, the bill is aimed at removing certain difficulties faced by taxpayers in implementing higher tax rates on income from federal government securities. It also seeks to rationalise the standard tax rate on the overall business income of banking companies.\n\nThe government had faced an embarrassing situation in the National Assembly on Thursday when the opposition cleverly blocked the passage of the important money bill mid-process by walking out and pointing out a lack of quorum. As the number of treasury members was below the required strength, Deputy Speaker Ghulam Mustafa Shah, who was presiding over the session, adjourned the proceedings.\n\nEducation Minister Khalid Maqbool Siddiqui moved a bill to further amend the Federal Board of Intermediate and Secondary Education Act, 1975 [The Federal Board of Intermediate and Secondary Education (Amend­ment) Bill, 2024], which was subsequently passed.\n\nAnother bill, introduced by Interior Minister Syed Mohsin Naqvi to amend the Extradition Act, 1972 [The Extradition (Amendment) Bill, 2025], was also passed.\n\nA separate bill to amend the Pakistan Citizenship Act, 1951 [The Pakistan Citizenship (Amen­d­ment) Bill, 2024], also moved by Mr Naqvi, was passed as well.\n\nThe interior minister also tabled a bill to amend the Naturalisation Act, 1926 [The Naturalisation (Amendment) Bill, 2024], which the house passed.\n\nLaw Minister Azam Nazeer Tarar moved a bill to amend the Civil Servants Act, 1973 [The Civil Servants (Amendment) Bill, 2025], which was also passed.\n\nCommerce Minister Jam Kamal Khan introduced and succeeded in passing a bill to amend the Anti-Dumping Duties Act, 2015 [The Anti-Dumping Duties (Amendment) Bill, 2025].\n\nTwo new bills introduced\n\nTwo new bills not included in Friday’s agenda were also introduced in the National Assembly. One, moved by MNA Sharmila Faruqui, aims to curb child marriages within the territorial limits of Islamabad. The second, tabled by MNA Ali Musa Gilani, pertains to trade organisations.\n\nLater, MNA Amjad Ali Khan drew the attention of Minister for Communications Aleem Khan to an urgent matter regarding the non-construction of 12 bridges on Kalam Road (N-95) under an Asian Development Bank-funded project initiated in 2013.\n\nHe also highlighted the non-rehabilitation of a six-kilometre stretch of road that was washed away by floods. Despite Prime Minister Shehbaz Sharif’s announced rehabilitation packages, no progress has been made, causing grave concern among the public.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:03:45.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911475/na-passes-money-bill-along-with-eight-others",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:38.000Z"
}
