{
  "title": "Balochistan, GB celebrate military victory over India - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA / GILGIT: Youm-i-Tashakur (Thanksgiving Day) was observed with enthusiasm across Balochistan and Gilgit-Baltistan on Friday to honour the armed forces for their victory against Indian aggression.\n\nThe day commenced with 21-gun salutes in provincial capitals Quetta and Gilgit. Recitations of the Holy Quran were held after Fajr prayers in Balochistan.\n\nAcross both regions, citizens from diverse backgrounds, including political and religious party workers, public representatives, students, and government officials, participated in rallies, flag-hoisting ceremonies, seminars, and cultural programmes.\n\nIn Balochistan, events were held in Quetta and numerous other towns and cities including Khuzdar, Hub, and Zhob. Participants paid tribute to the armed forces, with speakers highlighting their bravery and sacrifices in defeating a “fivefold bigger enemy”.\n\n“The sacrifices of the Pakistan Army for the security and sovereignty of the country are unforgettable,” was a sentiment echoed throughout Balochistan, with people vowing to “stand by the defence of the country at all costs”.\n\nCitizens, officials laud military’s sacrifices, pledge national unity and defence\n\nStudents from Higher Secondary School, Qila Abdullah Bazaar, held a rally, while in Khuzdar, a flag-hoisting ceremony took place at the DC office. In Hub, Deputy Commissioner Nisar Ahmed Langove hoisted the flag. Special prayers for the freedom of occupied Kashmir were also arranged in mosques.\n\nIn Gilgit-Baltistan, rallies and functions were held in Gilgit, Skardu, Shigar, and other districts. The main ceremony in Gilgit was held at the FCNA Headquarters, where flowers were laid at a martyrs’ memorial.\n\nGilgit-Baltistan Chief Minister Haji Gulbar Khan, after hoisting the national flag in Chinarbagh, Gilgit, praised the armed forces. “The Pakistani forces have shown their defensive capabilities,” he told the media. Gulbar Khan added that the forces “not only protected the country’s integrity but also taught the enemy a historical lesson”.\n\nOne participant in Gilgit-Baltistan said the day “is not only a day to pay tribute to the sacrifices of our martyrs, but also makes us feel the responsibility to unite and always make our Pakistan safe”.\n\nSpeakers at various seminars attributed the defeat of India to the unity of the Pakistani nation and its support for the armed forces and leadership.\n\nBehram Baloch in Gwadar, Abdul Wahid Shahwani in Khuzdar and Ali Jan Mangi in Nasirabad also contributed to this report\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/17121800f860ade.png",
  "retrievedAt": "2025-10-12T03:06:30.981Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911518/balochistan-gb-celebrate-military-victory-over-india",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:50.000Z"
}
