{
  "title": "Current account surplus shrinks to $12m in April - Business - DAWN.COM",
  "author": null,
  "content": "• July-April surplus still high at $1.88bn compared to $1.337bn deficit a year ago\n• Foreign direct investment plummets to $140.8m in April from $394.5m last year\n\nKARACHI: The country’s current account recorded a surplus of $12 million in April, helping the cumulative surplus for the first 10 months of the current fiscal year to reach $1.88 billion, the State Bank of Pakistan (SBP) said on Friday.\n\nAlthough April’s surplus was a steep decline from the record $1.2bn posted in March and $315m in April last year, it remained in positive territory.\n\nFrom July to April of fiscal year 2024-25, the current account posted a net surplus of $1.88bn, a significant turnaround from a $1.337bn deficit during the same period last year.\n\nFinancial experts attributed the reduced surplus in April primarily to a record trade deficit of $3.388bn in March. The country’s export industry relies heavily on imported raw materials, and with the government relaxing import restrictions to boost exports, trade imbalances have widened.\n\nOfficials have set an ambitious $60bn export target over the next five years. However, achieving this goal would likely exert additional pressure on foreign exchange reserves, as higher export volumes require increased imports.\n\nDespite these pressures, the government remains confident due to the current account’s positive trajectory, supported in large part by remittance inflows.\n\nThe SBP expects remittances to reach $38bn in FY25, almost 27 per cent higher than last year, providing a vital cushion against external liabilities.\n\nDebt servicing, however, remains a substantial burden. Pakistan is expected to pay $26.2bn in external debt repayments during FY25. The SBP said that a major portion of this amount has already been rolled over or repaid, with the remaining obligations due by the end of June 2025.\n\nExperts warned that without a significant rise in exports, the same challenge will persist in FY26. Sources said efforts have been made to boost labour exports to Arab countries, which may explain the rise in remittances, although official data on manpower exports is unavailable.\n\nBankers said they were cautious amid a brief conflict with India, with concerns over potential capital outflows. However, the situation de-escalated swiftly, preventing any major impact on trade or the currency market.\n\nThey also pointed to improved investor sentiment following the International Monetary Fund’s (IMF) approval of the second tranche under a $7bn loan package, and an additional $1.4bn allocation related to climate change. These inflows helped support the local currency and contributed to exchange rate stability.\n\n“The current account surplus is in a comfortable position for the government, but the domestic situation is against it since both the main sectors — agriculture and large-scale manufacturing — are down,” said Amir Aziz, a manufacturer and exporter of finished textile products.\n\nFDI declines sharply\n\nForeign direct investment (FDI) plunged to $140.8m in April from $394.5m a year ago, reflecting investor caution amid regional geopolitical tensions.\n\nAccording to the SBP, total FDI during July-April FY25 declined by 2.8pc to $1.784bn, down from $1.836bn in the year-ago period.\n\nAnalysts linked the sharp drop in April’s FDI to rising tensions with India following an incident in India-held Kashmir on April 22, which led to a deterioration in bilateral relations and a cautious investment environment.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:16:12.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911531/current-account-surplus-shrinks-to-12m-in-april",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:39:59.000Z"
}
