{
  "title": "China’s LandSpace launches improved methane-powered rocket - World - DAWN.COM",
  "author": null,
  "content": "A new methane-powered rocket developed by China’s LandSpace Technology launched six satellites into orbit on Saturday, doubling down on a cheap, cleaner fuel that the private startup hopes will help it develop reusable rockets.\n\nThe Zhuque-2E Y2 carrier rocket blasted off at 12:12pm (09:12am PKT) from the Jiuquan Satellite Launch Centre in northwest China, marking the fifth flight for the Zhuque-2 series, according to a company statement.\n\nBeijing-based LandSpace became the world’s first company to launch a methane-liquid oxygen rocket in July 2023, ahead of US rivals including Elon Musk’s SpaceX and Jeff Bezos’ Blue Origin.\n\nInterest has grown in recent years in launching carrier vehicles fuelled by methane, which is deemed less polluting, safer and cheaper than more commonly used hydrocarbon fuels and a suitable propellant in a reusable rocket.\n\nLandSpace has increased the rocket’s payload, reflecting increasing demand in China’s expanding commercial space industry amid growing competition to form a constellation of satellites as an alternative to Musk’s Starlink.\n\nIts first successful methane-powered launch did not carry any real satellites, but the second launch in December 2023 successfully sent into orbit three satellites. Saturday’s launch put six satellites into orbit.\n\nReusable rockets, pioneered by SpaceX, have demonstrated that they can lower costs for launch vehicles and space transportation.\n\nLandSpace founder and CEO Zhang Changwu has said the company had started developing reusable rockets and expected to conduct a test launch in the second half of 2025.\n\nThe latest model in its Zhuque-2 series includes technical improvements that will help the company’s goal of launching a reusable rocket.\n\nSaturday’s launch marked the first time LandSpace has deployed a propulsion method that involves chilling both liquid oxygen and methane below their boiling points, boosting thrust.\n\nChinese commercial space firms have rushed into the sector since 2014, when the government allowed private investment in the industry. LandSpace was one of the earliest and best-funded entrants.\n\nFounded in 2015, LandSpace has secured funding from investors including venture capital firm HongShan, known at that time as Sequoia Capital China, the investment arm of Chinese property developer Country Garden and the state-backed China SME Development Fund.\n\nLandSpace raised 900 million yuan ($120mn) in December from a state-owned fund focussed on advanced manufacturing, while in 2020 it raised 1.2 billion yuan ($170mn), Chinese corporate databases showed.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:56.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911579/chinas-landspace-launches-improved-methane-powered-rocket",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T06:06:04.000Z"
}
