{
  "title": "New facilities introduced for Haj pilgrims, says DG of Haj Mission - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has added new comfort for 88,380 Haj pilgrims this year, maintaining highest standards of service excellence such as air-conditioned Mina tents, family-friendly accommodations, optimised luggage systems and high-quality transportation.\n\nAbdul Wahab Soomro, Director General (DG) at Pakistan Haj Mission in Saudi Arabia, stated in a report that additional facilities had been introduced for pilgrims this year.\n\nThese include round-the-clock pilgrim support services with a dedicated team of 1,200 Pakistan-based staff and 600 Saudi-based local welfare personnel to assist pilgrims at every stage of their journey.\n\n“From airport assistance and accommodation logistics to transportation coordination to Haramain, this extensive support network ensures smooth operations.” Additionally, staff members have been deployed to address food arrangements, luggage handling and complaints, guaranteeing a hassle-free and memorable Haj experience for all pilgrims.\n\nMr Soomro said a cost-effective and affordable Haj scheme was introduced by the government of Pakistan which offers the lowest-cost Haj package globally. To further enhance accessibility, a short Haj scheme was introduced for the first time last year, attracting 17,000 pilgrims with registrations increasing to 21,000 in 2025. This initiative ensures affordability without compromising on essential services.\n\nMoreover, family rooms are provided free of charge wherever possible, enabling families to stay together.\n\nThis enhancement ensures a more comfortable and cohesive experience for pilgrims traveling with loved ones.\n\nHowever, due to the non-uniform nature of buildings in Makkah, accommodations are allocated based on pilgrim profiling, ensuring optimal convenience based on integration with flight schedules and departure points.\n\nThis systematic approach balances fairness with logistical efficiency, he added.\n\nTo minimise the risk of lost belongings, unique, standardised luggage has been provided to all pilgrims, designed to be easily identifiable even from a distance. Additionally, bags have been introduced to discourage pilgrims from carrying large bags into Mina, reducing congestion and inconvenience for others.\n\n“The Haj mission of Pakistan has introduced revolutionary upgrades in Mina accommodations for the first time, providing air-conditioned tents with gypsum board partitions and sofa beds.”\n\nThese sofa beds feature head partitions, which help prevent the spread of communicable diseases, allergies and bad breath.\n\nOverhead shelves have also been installed to store Mina bags, effectively addressing space constraints in the tents.\n\nAs 56 per cent pilgrims will be accommodated in the old Mina and 44 per cent will stay in new Mina this year, the transportation in Mashair will be facilitated mainly by train usage followed by buses.\n\nThe director general Haj said for the second consecutive year, all the pilgrims will be housed in Madina Markazia, ensuring proximity to Masjid an-Nabawi, while the accommodations in Madinah range from three to five-star buildings.\n\nTo safeguard the health and well-being of pilgrims, around 400 medical and paramedical officers are deployed across dedicated healthcare facilities. These include one well equipped hospital and nine dispensaries in Makkah along with one hospital and two dispensaries in Madinah.\n\n“The robust healthcare network ensures 24/7 emergency care, routine medical assistance and prompt response to health concerns, providing pilgrims with peace of mind throughout their journey,” he added.\n\nPublished in Dawn, May 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:16:00.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911444/new-facilities-introduced-for-haj-pilgrims-says-dg-of-haj-mission",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T01:40:37.000Z"
}
