{
  "article_id": "2025-07-09_bc7cce98654280c7c85e0b18b48fd98c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/dpm-fm-dar-appreciates-pak-turkiye-growing-bilateral-cooperation/",
    "retrieved_at": "2025-08-27T09:24:19.007Z"
  },
  "metadata": {
    "title": "DPM/FM Dar appreciates Pak-Turkiye growing bilateral cooperation",
    "author": null,
    "date_published": "2025-07-09T10:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 337,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, July 09 (APP): Deputy Prime Minister/Foreign Minister Mohammad Ishaq Dar Wednesday underscored the close and brotherly relations between Pakistan and Turkiye and appreciated the growing momentum in bilateral cooperation. He also stressed the importance of expanding collaboration in areas such as trade, investment, and energy. On the invitation of DPM/FM Dar, Minister of Foreign Affairs of the Republic of Turkiye, Hakan Fidan, co-chair of the Joint Commission under the High-Level Strategic Cooperation Council (HLSCC) framework, and the Minister of National Defence, Yasar Guler, co-chair of the Joint Ministerial Commission, visited Islamabad, Foreign Office Spokesperson, said in a press statement. The Turkish foreign minister conveyed warm greetings from President Recep Tayyip Erdogan and reaffirmed Turkiye's strong desire to deepen cooperation with Pakistan. He highlighted the profound historical, cultural, and religious bonds that underpin the enduring relationship between the two nations. The two sides also exchanged views on a range of regional and global developments. They reaffirmed their shared commitment to peace, security, and development in the region. \"It may be recalled that during the last session of the HLSCC, held in Islamabad in February this year, both sides had agreed to establish a Joint Commission, co-chaired by the two Foreign Ministers, to review the progress of the twelve Joint Standing Committees working under the HLSCC framework. Today, marked the first meeting of this Joint Commission,\" it was added. The DPM /FM expressed satisfaction in sharing that all twelve Joint Standing Committees had either already met or were scheduled to meet in the coming weeks. In addition, both sides noted the upcoming meeting of the Joint Ministerial Commission (JMC), which is expected to be held in the coming weeks. The JMC will be co-chaired by the Minister of National Defence of Turkiye Yasar Guler, and the Minister of Commerce of Pakistan Jam Kamal Khan. This important platform is expected to further bolster economic cooperation between the two countries. This visit underscored the sustained dialogue between Pakistan and Turkiye and their mutual resolve to further deepening their multifaceted partnership.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}