{
  "article_id": "2025-07-09_4745d65a669dcfd5ebe50c481e99bb69",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-turkiye-reaffirm-commitment-to-boost-ties-target-5-billion-trade-volume/",
    "retrieved_at": "2025-08-27T09:24:17.261Z"
  },
  "metadata": {
    "title": "Pakistan, Turkiye reaffirm commitment to boost ties, target $5 billion trade volume",
    "author": null,
    "date_published": "2025-07-09T10:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 565,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 9 (APP): Pakistan and Turkiye on Wednesday reaffirmed their resolve to deepen bilateral cooperation across key sectors, including defence, trade, energy, culture, education, and infrastructure, pledging to enhance the bilateral trade volume to $5 billion. During a joint press stakeout of Turkish Foreign Minister Hakan Fidan and Deputy Prime Minister and Foreign Minister Ishaq Dar here, the two sides expressed satisfaction over the ongoing progress of the 12 joint standing committees established under the High-Level Strategic Cooperation Council (HLSCC). Deputy Prime Minister Dar recalled that during the last session of the HLSCC, held in Islamabad in February this year, both sides had agreed to establish a Joint Commission, co-chaired by the two Foreign Ministers, to review the progress of the 12 Joint Standing Committees working under the HLSCC framework. He expressed satisfaction in sharing that all twelve Joint Standing Committees have either already met or are scheduled to meet in the coming weeks. In addition, he said the meeting of the Joint Ministerial Commission (JMC), was expected to be held in the coming weeks. \"The JMC will be co-chaired by the Minister of National Defence of Turkiye, Yasar Guler, and the Minister of Commerce of Pakistan, Jam Kamal Khan. This important platform is expected to further bolster economic cooperation between the two countries,\" he added. The deputy PM praised Turkiye's successful indigenization of its defence industry, which had grown from 20% to 80% in recent years and said that Pakistan was keen to benefit from its experience. He said the Pakistan side was pursuing the establishment of a Special Economic Zone in Karachi dedicated to Turkish enterprises, while efforts were underway to revive the Istanbul-Tehran-Islamabad rail corridor. \"Our delegations are meeting in coming weeks to finalize a road map in this regard.\" Dar also confirmed that land had been allocated in Muzaffarabad for the construction of a Maarif school. He added that several major projects involving Turkish firms were being considered, including the Jinnah Medical Complex, Danish University, offshore drilling operations, and participation in the privatization of power distribution companies. Pakistan is also working to benefit from Turkish expertise in ship-breaking and water management, he added. Capacity building in counter-terrorism is also on the agenda, he said adding that \"These initiatives are seen as laying the groundwork for the 8th HLSCC to be held in Turkiye next year\". Reaffirming the close bond between the two nations, Ishaq Dar described Turkiye as a \"trusted friend and reliable brother,\" emphasizing Pakistan's solidarity with the Turkish people. Turkish Foreign Minister Hakan Fidan hailing the productive meeting with DPM Dar today, said that the bilateral relations between the two nations were strengthening each day. \"We are aiming to increase our commercial relations up to $5 billion by enhancing cooperation in diverse areas including energy, mining, education, and transportation,\" he added. He also stressed the need to further strengthen air, sea, land and railway connections between the two countries, saying that technical activities in this regard were ongoing. On regional issues, The Turkish foreign minister praised Pakistan's restraint during recent tensions with India and reiterated Turkiye's support for peace and dialogue. \"All international societies have seen the wisdom and calm attitude of Pakistan during the tension,\" he added. He also condemned Israel's attacks in Gaza and Iran, calling them a \"violation of international law,\" and pledged continued Turkish efforts for a permanent ceasefire and humanitarian aid in Gaza.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}