{
  "article_id": "2025-07-09_e02d5362ea1bc17c68edd7bce49fde63",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/indias-nefarious-intentions-part-of-organized-conspiracy-to-disrupt-security-in-pakistan-dg-ispr/",
    "retrieved_at": "2025-08-27T09:24:17.302Z"
  },
  "metadata": {
    "title": "India’s nefarious intentions, part of organized conspiracy to disrupt security in Pakistan: DG ISPR",
    "author": null,
    "date_published": "2025-07-09T11:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 381,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jul 09 (APP): Director General of Inter-Services Public Relations (ISPR) Lt General Ahmed Sharif Chaudhry has said that India's nefarious intentions were part of an organized conspiracy to destabilize and disrupt security in Pakistan, particularly in Balochistan. In an exclusive interview with Al Jazeera TV, he said that India had adopted state-sponsored terrorism as a policy against Pakistan. WhatsApp Video 2025-07-09 at 16.11.37 The DG ISPR's reaction came after last month's bomb blast in Waziristan in which 16 soldiers embraced martyrdom while over 20 people sustained injuries, according to Al Jazeera TV. The attack was claimed by Fitna al-Khawarij (Taliban), it was further said. The DG ISPR said that Pakistan had a clear stance that India was directly involved in these attacks. \"India is not only supporting but also financing terrorist activities in Pakistan,\" he added. He explained the term Khawarij referred to armed groups that attacked the Armed Forces and state of Pakistan. \"The current Fitna al-Khawarij is a continuation of the misguided ideology that has historically led to the killing of Muslims under a false religious narrative,\" he said. He said that in Islam, the right to Jihad or armed conflict lies solely with the state - no individual, organization, or group is authorized to declare it. \"Fitna al-Khawarij has no connection with Islam, humanity, Pakistan, or Pakistani traditions,\" he said. Ahmed Sharif said that the term Fitna al-Hindustan was used in Pakistan to describe terrorists who were supported by India. \"Fitna al-Hindustan is particularly active in destabilizing the country, especially in the province of Balochistan,\" he said. The DG ISPR said Pakistan has made it clear that any aggression against the Islamic state was a threat to regional stability. \"Even India's political leadership has admitted multiple times to supporting terrorism within Pakistan,\" he added. He pointed out Ajit Doval as the mastermind behind the Indian state-sponsored terrorism network. Even United States and Canada have also acknowledged Indian state terrorism, he said. The DG ISPR reiterated Pakistan's political and diplomatic support for Iran, which he said had been a target of Israeli aggression. He said that Pakistan was a responsible and declared nuclear power and its nuclear program was completely secure. \"Our nuclear capability is invincible and no one can dare to target our nuclear program,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}