{
  "article_id": "2025-07-09_c21b3e92deaced8553b05d124d80f676",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nepra-notifies-relief-of-pkr-4-0349-per-unit-for-ke-under-april-2025-fca/",
    "retrieved_at": "2025-08-27T09:23:01.052Z"
  },
  "metadata": {
    "title": "NEPRA notifies relief of PKR 4.0349 per unit for KE under April 2025 FCA",
    "author": null,
    "date_published": "2025-07-09T17:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 09 (APP):The National Electric Power Regulatory Authority (NEPRA) has issued its decision regarding K-Electric's (KE) petition of provisional monthly Fuel Charges Adjustment (FCA) requested for April 2025, indicating a relief of PKR 4.0349 per kWh. This will be passed on to customers in their July 2025 bills, said a press release issued here on Wednesday. NEPRA has provisionally retained an amount of PKR 0.8 billion in respect of adjustments on account of partial load, open cycle and degradation curves along with start-up cost pursuant to NEPRA's Decision regarding Generation Tariff for the control period July 2023 onwards from the FCA for April 2025 to be adjusted against the pending claims of KE to ensure that consumers are not burdened at later stage. Fuel charge adjustments are incurred by utilities due to global variations in fuel prices used to generate electricity, and the changes in generation mix. These costs are reflected in customer bills following NEPRA's scrutiny and approval. Customers also benefit from negative FCA in their bills when global fuel prices decrease. Rates charged to customer bills are determined by NEPRA and notified by the Federal Government. As per the Regulatory Authority's decision, the FCA shall be applicable to all the consumer categories except lifeline consumers, domestic protected consumers, Electric Vehicle Charges Stations (EVCS) and prepaid electricity consumers of all categories who opted for prepaid tariff.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}