{
  "article_id": "2025-07-09_09c939c167b9a407222058bb0edb82c9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-partners-with-baku-experts-to-boost-city-beautification-efforts/",
    "retrieved_at": "2025-08-27T09:23:25.490Z"
  },
  "metadata": {
    "title": "Islamabad partners with Baku experts to boost city beautification efforts",
    "author": null,
    "date_published": "2025-07-09T17:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 09 (APP):The Capital Development Authority (CDA) has accelerated efforts to enhance Islamabad's urban aesthetics, with a renewed focus on green spaces, landmark beautification, and international collaboration. In a high-level meeting held at the CDA headquarters, Chairman CDA Muhammad Ali Randhawa, was briefed by visiting horticulture experts from Baku on ongoing and upcoming beautification projects across the capital. The delegation from Baku highlighted major progress in the beautification of key areas, including Srinagar Highway, Melody Market, and Saidpur Village. One of the central initiatives discussed was the transformation of the CDA Model Nursery under the \"Gardenia Hub\" project, which aims to upgrade the nursery into a modern horticultural center featuring international-standard flower shops, plant varieties, and advanced greenhouse facilities. \"This partnership reflects our commitment to sustainable and visually appealing urban development,\" said Chairman CDA Muhammad Ali Randhawa. \"We will also ensure that nursery staff are trained to operate and maintain this new facility to international standards.\" Experts from Baku are collaborating with local architects and CDA teams to bring international landscaping practices to Islamabad. Chairman Randhawa emphasized the importance of using eco-friendly and climate-appropriate plant species, especially for median strips and roadside landscaping along major highways. \"All beautification work must align with our long-term city planning,\" he added, calling for continued close cooperation between CDA and Baku teams. As part of a broader vision, Randhawa announced that the CDA will also engage the private sector in these beautification efforts under Corporate Social Responsibility (CSR) initiatives. \"Renowned brands and businesses will be invited to participate in tree-plantation and urban greening campaigns, helping to strengthen Islamabad's image as a green and livable city,\" he said. The meeting was attended by senior CDA officials, including Member Administration & Estate Talat Mahmood, Member Finance Tahir Naeem, Member Environment Esfandyar Baloch, Member Engineering Syed Nafeesat Raza, and Member Planning Dr. Khalid Hafiz. Various city development and beautification issues were also reviewed, with strict directives issued for timely implementation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}