{
  "title": "Pakistan keen to benefit from UAE’s experiences in modern management system: PM",
  "author": null,
  "content": "ISLAMABAD, Jun 16 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said the United Arab Emirates has positioned its country among the developed countries with its modern management system, and Pakistan was keen to benefit from its experiences.\nThe prime minister made these remarks in a meeting with UAE’s Deputy Minister of Cabinet Affairs for Competitiveness and Knowledge Exchange, Abdulla Nasser Lootah here, a Prime Minister’s Office news release said.\nPrime Minister Muhammad Shehbaz Sharif met with a high-level delegation from the United Arab Emirates led by Abdulla Nasser Lootah, Deputy Minister of Cabinet Affairs for Competencies and Knowledge Exchange and flanked by UAE Ambassador, Hamad Obaid Al Zaabi and Abdullah Al Balouki and Ibrahim Al Ali from the Government Knowledge Exchange Office.\nPM Shehbaz said that Pakistan has taken steps such as digitization and paperless economy to improve its administrative structure. In addition, a faceless customs system has also been implemented.\nThe prime minister underlined that Pakistan wanted to benefit from the experiences of the UAE to achieve good governance so that these steps could be made more effective as effective steps were being taken to improve\nThe prime minister, recalling his meeting with UAE President, Mohamed bin Zayed Al Nahyan during his previous visit to Abu Dhabi, said that the meeting was very fruitful. The UAE played a significant role in reducing tensions between Pakistan and India during the Pakistan-India conflict, he added.\nOn the occasion, UAE Minister Abdulla Naseer said that the UAE and Pakistan have long-standing brotherly relations and appreciated the important role of the Pakistani community in the development of the UAE. He said that the UAE was happy to exchange experiences and information with Pakistan.\nLater, Prime Minister Shehbaz Sharif and Abdulla Naseer attended the signing ceremony of a Memorandum of Understanding (MoU) between the two countries. Under this MoU, the two countries will cooperate in improving government performance by exchanging knowledge and mutual experience, guidance and development models\nThe MoU covers cooperation in areas such as good governance, development planning, public sector reforms, human resource development, urban planning, and science and technology, among others.\nDeputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, Minister for Planning and Development Dr. Ahsan Iqbal, Minister for Commerce Jam Kamal Khan, and Special Assistant Syed Tariq Fatemi were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:11:49.152Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-keen-to-benefit-from-uaes-experiences-in-modern-management-system-pm/",
  "dateList": "2025-06-16",
  "date_published": "2025-06-16T13:48:00.000Z"
}
