{
  "title": "PM reviews measures for increasing exports",
  "author": null,
  "content": "ISLAMABAD, Feb 20 (APP):Prime Minister Shehbaz Sharif Thursday chaired a meeting to review measures for increasing exports of the country.\nHe directed formulation of a comprehensive and effective strategy to take the exports to $ 60 billion in the next five years.\nHe instructed his economic team to introduce sustainable reforms for the system of tariff to achieve economic progress and enhance exports.\nHe said the tariffs should be brought down and the system should be made easy and simple.\nThe prime minister said a strategy should be adopted to increase the production capacity of the industries by bringing reforms in the tariff structure.\nHe stressed that special attention should be paid to the sectors of services, information technology and agriculture.\nHe said economic progress based on exports was an important element of “Uraan Pakistan” vision, adding\nnecessary reforms should be introduced in the governance of Export Development Fund for development of export industries.\nDuring the meeting, the prime minister was briefed about the steps taken to reform the Ministry of Commerce and increase the export target to $ 60 billion in the next five year.\nIt was informed that the tariff was gradually decreased in the last two years.\nThe Ministry of Commerce was hosting international level exhibitions every year in Pakistan to expand exports.\nThe meeting was told that consultation was continuing with all stakeholders on the Strategic Trade Policy Framework 2025-30.\nThe consultation on the Ecommerce policy was in the final stage of completion and would be presented for the approval of the cabinet next month.\nA National Compliance Center was ready to harmonize Pakistani products with the international standard.\nThe center would create programmes for increasing capacity of the export industries in Pakistan and hold trainings.\nMinister for Commerce Jam Kamal Khan, Minister for Economic Affairs Ahad Khan Cheema, Minister for Finance Muhammad Aurangzeb, Chairman Federal Board of Revenue Arshad Mehmood Langrial and high level officers of the relevant departments attended the briefing.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:55:22.535Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-reviews-measures-for-increasing-exports/",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T15:11:00.000Z"
}
