{
  "title": "Model Town Tragedy: ATC dismisses PAT’s plea for stopping trial till formation of new JIT",
  "link": "https://www.app.com.pk/national/model-town-tragedy-atc-dismisses-pats-plea-for-stopping-trial-till-formation-of-new-jit/",
  "date_published": "2024-02-02T17:47:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 02 (APP): An anti-terrorism court (ATC) on Friday dismissed an application filed by Pakistan Awami Tehreek (PAT) for stopping the trial of Model Town tragedy case and consigning it to record till the formation of a new joint investigation team (JIT).\nThe court held that the trial could not be stopped as it was a nine-year old case, adding that the case would be heard twice a week. The court adjourned further hearing till February 6.\nATC Judge Arshad Javed Chadhar heard the application filed by the PAT and announced the verdict after hearing detailed arguments of the parties.\nIn the course of proceedings, the defence counsel, Advocate Burhan Moazzam Malik, argued that the case was nine-year old and its 123 hearings had taken place. He submitted that the PAT was using delaying tactics as its counsel did not cross examine the witnesses and sought adjournments. He submitted that the accused were appearing at every hearing and the matter should be heard twice a week for concluding it, in light of the Supreme Court Judgments.\nHowever, a counsel for the PAT argued that the trial should be stopped till the investigation report of the new JIT. He said that the PAT had approached the Lahore High Court for a new JIT and a fresh investigation and the matter was still pending.\nIt is pertinent to mention here that a total of 124 accused were nominated in the case. The court had already acquitted five accused, including  former inspector general of police Punjab Mushtaq Ahmad Sukhera, in the matter, whereas four more accused, including former SSP Umar Virk, former DSP Khalid Abu Bakar, former DSP Mian Shafqat and former inspector Bashir Niazi, had filed acquittal applications.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:12:16.915Z"
}
