{
  "title": "President for promoting chess at grassroots levels, organizing tournaments",
  "link": "https://www.app.com.pk/national/president-for-promoting-chess-at-grassroots-levels-organizing-tournaments-2/",
  "date_published": "2024-02-02T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP): President Dr Arif Alvi on Friday called for promoting chess, especially at the grassroots levels, through collaborations with international chess organizations, the private sector, and organizing chess championships in the country.\nThe president expressed these views while talking to a delegation of the International Chess Federation (FIDE), which called on him, at Aiwan-e-Sadr.\nThe delegation included President FIDE and former Deputy Prime Minister of the Russian Federation, Arkady Dvorkovich, President of the Asian Chess Federation and son of the late President of UAE, Sheikh Sultan bin Khalifa Al-Nehayan, Managing Director FIDE, Dana Reizniece-Ozola, British Chess Grandmaster, Dr Nigel Short, Secretary General of Asian Chess Federation, Hisham Al Taher, Chief Patron of Chess Federation of Pakistan, Jauhar Saleem, and members of FIDE, Asian Chess Federation, Chess Federation of Pakistan, FIDE Chess in Education Commission, Islamabad Scrabble Association, and Pakistan Scrabble Association.\nTalking to the delegation, the president highlighted the need to promote healthy activities, including chess in the country. He stated that chess had mental and educational benefits, and it needed to be included in the education system. He further said that the game of chess could help relieve stress, besides enhancing intellect as well as boosting mental faculties.\nThe president highlighted the need to encourage chess by organizing chess competitions and tournaments in the country. He also stressed the need for developing collaborations among the public and private sectors to patronize and promote chess in Pakistan.\nThe delegation briefed the President about the role of the International Chess Federation in promoting chess in the world.\nThe delegation highlighted that there was great potential to expand chess-related activities in Pakistan. It was apprised that a large number of people in Pakistan were fond of the game.\nThe delegation suggested that chess should be promoted at the primary level in schools, adding that chess players could also participate online in World chess tournaments.",
  "retrievedAt": "2025-08-11T00:12:25.336Z"
}
