{
  "title": "Mandatory Hajj ritual training to begin on February 12",
  "link": "https://www.app.com.pk/national/mandatory-hajj-ritual-training-to-begin-on-february-12/",
  "date_published": "2024-02-02T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP):The first phase of mandatory Hajj ritual training for intending pilgrims of the Government Scheme will commence on February 12 in seven Haji camps located nationwide.\nA spokesman of the Ministry of Religious Affairs and Interfaith Harmony said in a statement that over 69,000 government scheme pilgrims will undergo training in two phases in various districts of the country.\nThe second training phase would be started after the holy month of Ramadan. Details of the training schedule will be communicated to the successful intending pilgrims through mobile messages and the Hajj app.  Hajj pilgrims will attend training workshops at their convenient local venues.\nThe spokesman said the chief hajj trainer while addressing the ministry’s 90 officers and official’s training workshop, said that special attention in training has been given to Hajj rituals as well as discipline and administrative issues.\nThe training curriculum has already been finalized by Ahmed Nadeem Khan, Joint Secretary Administration of the Ministry, along with Director General Syed Mushahed Hussain Khalid and Chief Trainer Nasir Aziz Khan.\nHajj training will be conducted across seven Hajj camps situated in various districts. Quoting the trainers, the spokesman said the new extensive training program will cover the ‘Pak Hajj’ mobile app, guidance for Hajj preparations, understanding rituals, addressing challenges during Hajj, and providing general instructions.\nThe chief trainer mentioned that model tents resembling Mina Valley style have been set up in the training centres. Pilgrims will receive guidance from Master Trainers using 3D videos and interactive question-and-answer sessions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:12:42.818Z"
}
