{
  "title": "Rescue operation continues in Murree to evacuate stranded tourists",
  "link": "https://www.app.com.pk/national/around-19-killed-after-vehicles-got-struck-in-traffic-snarl-due-to-heavy-snow-in-murree/",
  "date_published": "2022-01-08T07:29:00.000Z",
  "source": "APP",
  "content": "Rescue and relief operation led by Pakistan army and local administration was underway on Saturday to evacuate stranded tourists in Murree, provide relief to them in emergency shelters and open roads blocked due to heavy snow falling for the last many days.\nThe troops of Pakistan Army engineers and Frontier Works Organization (FWO) dozers had opened Murree Expressway and Jhika Gali-Gharial Road whereas the Army had established four camps at various locations to provide relief to stranded tourists in the snow hit areas of Murree and Galiyat.\nThe Inter Services Public Relations (ISPR) in separate updates on the rescue efforts informed that the FWO dozers were working on expressway road opening. The Army had established four camps at Military College Murree, Jhika Gali, APS Kuldana, and Station supply Depot Sunny Bank.\nIt added, the stranded people were moved to Army Public School (APSs) Kuldana for shelter and food. It said that the dozers were moved from Muzaffarabad to assist the road clearance operation while the troops from 111 brigade of the Army were opening road at Bahara Kahu and providing necessary food items to the masses.\nIt added that all resources were placed at the disposal of Murree division in terms of the engineers and machinery mobilized to execute the rescue and relief efforts.\nThe federal government had deployed personnel of Pakistan Army and other civil armed forces as around 22 people died in their vehicles in Murree.\nIn a video message, Minister for Interior, Sheikh Rashid Ahmed said that five platoons of the Pakistan Army had been called in for rescue operation, while Rangers and Frontier Corps would be deployed on an emergency basis.He said the administration and police of Rawalpindi and Islamabad had continued their rescue operation in the area while the locals were providing food and blankets to the stranded people.\nAfter reaching Murree to monitor rescue operation, Sheikh Rashid Ahmed said that the administration would continue rescue operation to evacuate all stranded tourists. He said roads from Punjab side were clear now as around 1,000 vehicles had been evacuated.He said heavy machinery would clear further roads in Gudana and Paharian while remaining 70 to 80 percent of roads had been cleared.He said all government rest houses had been opened to help tourists on the direction of Chief Minister Punjab. He added that helicopter service would be started soon as the weather conditions got better.The rescue teams of Islamabad police were shifting tourists from Murree to Capital who were returning on foot from there due to road blockage.According to details, Islamabad police had started operation on emergent basis and assisting pedestrian tourists returning from Murree. Policemen were present in the area of Bhara Kahu and assisting all deserted tourists whose vehicles were either broken out on the way or they forgot their way.Meanwhile, Punjab Chief Minister Sardar Usman Buzdar had imposed emergency in Murree and adjacent areas in view of current situation due to snowfall.In a statement issued here on Saturday, he said that an emergency had been declared in all departments including the police, administration, Rescue-1122 and all hospitals to deal with the situation.He directed the Chief Secretary, Inspector General of Police, Relief Commissioner, Director General Rescue-1122 and DG provincial disaster management to lead therescue activities.The chief minister had also reserved his personal helicopter for rescue operation whereas all state rest houses located in Murree and adjacent areas had been opened for tourists.Regional Police Officer, Rawalpindi had also reached Murree on Saturday to monitor relief and rescue operation, he said.The Islamabad Capital Territory (ICT) administration had banned the entry of tourists from Islamabad to Murree amid extreme weather conditions.“Entry from Islamabad to roads leading to Murree from Islamabad is hereby closed in public interest because of traffic jams and rush of visitors,” Deputy Commissioner Islamabad Muhammad Hamza Shafqaat said in a tweet.He appealed the visitors to avoid travelling to Murree and Galiyat and postpone their plans for now as entry from Islamabad would remain close till Sunday night.Later, talking to APP, he said the district administration and capital police was taking measures to facilitate tourists. He said ICT administration teams and other law enforcement agencies were in the field since last night to serve the visitors.\nCommissioner Rawalpindi Division, Gulzar Hussain Shah had reached Murree to monitor the activities to rescue the citizens. He informed that over 23,000 vehicles stranded due to heavy snowfall had been safely evacuated while the administration was providing food and other essential items to the tourists, he added.Deputy Commissioner, Rawalpindi, City Police Officer, Rawalpindi, Assistant Commissioners of Murree and Kotli Sattian and other officers remained in the field on Friday night and monitored all the activities to rescue stranded tourists.\nInspector General National Highways and Motorway Police Inam Ghani said that NH&MP officers and National Highway Authority (NHA) were working on clearing the Murree Expressway.In a tweet, he said there was congestion in Murree and on Expressway as people in the hotels for the night had come out on the roads. Inspector General Motorway Police said that carbon monoxide is odorless, very hard to detect, and it can quickly cause death.The authorities concerned of Rawalpindi District administration, Rescue-1122 and Police had been directed to accelerate the ongoing operation to rescue all the stranded tourists in Murree.",
  "retrievedAt": "2025-08-11T14:03:15.390Z"
}
