{
  "title": "E-sports events in Pakistan to further attract investors: President",
  "link": "https://www.app.com.pk/national/e-sports-events-in-pakistan-to-further-attract-investors-president/",
  "date_published": "2022-01-08T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP): President Dr Arif Alvi Saturday while welcoming the organizers of a two-day esports event in Islamabad, said the tournament would involve Pakistani youth and bring further investments in the country in future.\nIn his virtual message at the opening of the esports tournament organized by Galaxy Racer here, he said, “I am glad that the investment is taking place in the special technology zone and the fact that this investment is in the fastest growing industry of video gaming.”\nHe congratulated the patron of Galaxy Racer Sheikh Ahmed Al Maktoum and his entire team for their launch event in Pakistan.\n“This investment will harbinger a new era of cooperation between the United Arab Emirates and Pakistan.”\nThe president thanked Sheikh Ahmed Al Maktoum for his special interest in Pakistan.\nHe noted that there was a youth bulge in Pakistan and such esports events could be highlighted and started in Pakistan with tremendous youth involvement.\n“I am happy that the Galaxy racing event and subsequent events will be later generated in Pakistan. There is talent in Pakistan for software writing and esports development.”\nThe event showed that the youth bulge in Pakistan was going in the right direction, he added.\n“Our colleges, universities and our government are working hard to make sure that Pakistan is able to supply software resources to the entire world. There is a tremendous need for this software talent within Pakistan and even throughout the world.”\n“Everywhere I visited over the last few years the governments have been requesting Pakistan to support human resource development in their countries.”\nHe observed that the Special Technology Zone Authority chaired by Amir Hashmi was a very good platform to invite investments.\n“I made a special effort when I was in Dubai to request investors to look in this area as there is a ten-year holiday from income tax, customs and duties.”\nHe said, “All the special technology zones are the areas where investment in information technology can take place besides investments in brick and mortar.”\nPresident Alvi remarked that virtual reality was an important part of artificial intelligence in future.\n“The chips made for virtual reality were the basic foundations for the mathematical calculations which were needed for neural networks and artificial intelligence,” he explained.\n“The gaming chips, in fact, led to the ability to have tremendously broad and extensive neural networks through which artificial intelligence is taking over the world.”\nHe thanked the investors and artist Fakhar Alam – a great link and proponent of Pakistan throughout the world, for organizing the mega event.\n“I must thank Amir Hashmi and must thank the participants who are here and the organizers for making a venture in Pakistan which will not only increase prosperity but the ability of Pakistan to become a player in the world in the field of gaming and software.” He wished good luck to the participants of the gaming event.\nSheikh Ahmed Dalmook Al Maktoum of the United Arab Emirates (UAE) inaugurated the Gamers Galaxy, Pakistan’s biggest esports festival, with a grand prize pool of 20,000,000 Pakistani Rupees, presented by Mountain Dew and organized by Galaxy Race.\nVisitors gathered in huge numbers at the main arena to witness intense battles in the tournaments of PUBG Mobile Gamers Galaxy, Valorant, HER Galaxy Valorant Spike Rush 2v2 (Pakistan’s first-ever female esports tournament), and the community tournaments of FIFA 22, and Tekken.\nThe finalists will compete for a 2 CRORE Pakistani rupees prize pool.",
  "retrievedAt": "2025-08-11T14:03:16.485Z"
}
