{
  "title": "President, PM condole over loss of lives in Murree incident",
  "link": "https://www.app.com.pk/national/president-pm-condole-over-loss-of-lives-in-murree-incident/",
  "date_published": "2022-01-08T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP): President Dr Arif Alvi and Prime Minister Imran Khan on Saturday expressed sorrow over the loss of precious lives in the tragic incident in Murree.\nIn his condolence message, the President prayed Allah Almighty to rest the departed souls in eternal peace and grant courage to the bereaved families to bear the loss with fortitude.\nHe expressed hope that the Murree administration would safely evacuate the people stranded in the resort town.\nPrime Minister Imran Khan on Saturday expressing his shock and grief over the tragic deaths of tourists in Murree, ordered an inquiry and regulations to avert such tragedies in future.\nThe prime minister observed that heavy snowfall and a huge rush of tourists caught the district administration unprepared, he tweeted.\nFederal Minister for Information and Broadcasting Chaudhry Fawad Hussain said that the government was fully alert and standing with the people in this difficult time and added that the situation was improving as all the relevant departments were busy to overcome the situation.\nThe minister said in the last 48 hours, Murree received unprecedented snowfall, which resulted in loss of precious human lives. He said that Kuldana and Barian were the most affected areas and loss of human lives also occurred in these areas.\nThe information minister said that Prime Minister Imran Khan had taken notice of the incident and directed Punjab Chief Minister Sardar Usman Buzdar to reach there.\nHe said that the Murree administration was working there, five platoons of Pakistan Army were also working whereas Frontier Works Organization (FWO) had moved its machinery there to remove snow from the roads.\nFawad Hussain said that according to the latest reports, Expressway had been cleared while Khyber Pakhtunkhwa government had opened all routes from Nathia Gali side.\nHe said the Punjab government was taking all possible measures to manage the situation.\nFederal Minister for Education and Professional Training Shafqat Mahmood, who is also Pakistan Tehreek-e-Insaf Punjab President, said that all party workers and organizations had been directed to extend all possible support within their capacities with regard to Murree situation.\nMinister of State for Information and Broadcasting Farrukh Habib had expressed deep grief and sorrow over the loss of precious lives in Murree due to heavy snowfall.\nTalking to a private news channel, he said that Pak Army soldiers and relief teams were mobilized to rescue the tourists. “The evacuation of stranded visitors is our foremost priority,” he remarked.\nHe commended the role of locals which helped the stranded tourists by providing them warm clothes, blankets and food items in this difficult situation.",
  "retrievedAt": "2025-08-11T14:03:02.910Z"
}
