{
  "title": "Under India’s patronage, non-local spouses of IIOJK women to illegally get domiciles",
  "link": "https://www.app.com.pk/national/under-indias-patronage-non-local-spouses-of-iiojk-women-to-illegally-get-domiciles/",
  "date_published": "2021-07-22T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 22 (APP): The local government of Indian Illegally Occupied Jammu and Kashmir (IIOJK), in pursuance of India’s illegal act of revocation of the Valley’s status, has decided to issue domicile certificates to the husbands of local women married to people from outside the state.\nThe step is aimed at changing the demography of the Muslim-populated area and turn them into a minority by giving domicile to the outsiders.\n“The significant move will allow them to buy land or property in the Union territory, or apply for government jobs,” Hindustan Times said in its report by a Srinagar-based correspondent.\nThe certificates will be issued by district officials on producing proof of marriage.\nCommissioner secretary to Jammu and Kashmir government, Manoj Kumar Dwivedi, issued an order dated July 20 in which he specified that rules that make spouse of domicile certificate holder eligible for getting the certificate.\n“In exercise of the powers conferred by the proviso to Article 309 of the Constitution of India, read with section 15 of the Jammu and Kashmir Civil Services Act 2010, the government hereby directs in sub-rule (1) of rule 5 of the Jammu and Kashmir Grant of Domicile Certificate Rules 220, after S.No/Clause 6,” the order read.\nWomen married to residents of the Union Territory are automatically granted domicile status.\nAfter Jammu and Kashmir’s special status was revoked and the region split into two Union territories in August last year, the government in May notified Jammu and Kashmir Grant of Domicile Certificate (Procedure) Rules, 2020.\nPakistan’s Foreign Office has always maintained that IIOJK is an internationally recognized disputed territory.\n“India’s unilateral and illegal actions in IIOJK remain in violation of international law and numerous United Nations Security Council (UNSC) Resolutions,” says the FO, regarding India’s illegal act of August 5, 2019.\nFor its part, the FO says, Pakistan will continue to resolutely oppose Indian attempts to change the demographic structure and status of IIOJK as a disputed territory.\nEarlier Foreign Minister Shah Mahmood Qureshi had said that the Indian government had issued over 1.8 million bogus domicile certificates to non-Kashmiris as part of New Delhi’s plan to change the demographic structure of the occupied territory.\nHe had termed the Indian design in the occupied territory a “direct violation of the resolutions of the UN Security Council and international law, including the 4th Geneva Convention”.",
  "retrievedAt": "2025-08-11T20:59:42.416Z"
}
