{
  "title": "India should refrain from its smear anti-Pakistan propaganda drive: FO",
  "link": "https://www.app.com.pk/national/india-should-refrain-from-its-smear-anti-pakistan-propaganda-drive-fo/",
  "date_published": "2021-07-22T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 22 (APP): Pakistan Thursday denouncing the gratuitous and unwarranted remarks by Spokesperson of Indian Ministry of External Affairs (MEA) about the recent incident involving the daughter of Afghan Ambassador urged India to refrain from its smear propaganda campaign.\n“India has no locus standi, whatsoever, on the matter,” Foreign Office Spokesperson Zahid Hafeez Chadhri stated while responding to media queries regarding the remarks made by the Spokesperson of Indian MEA about the incident.\nHe said that India’s malicious smear campaign against Pakistan was well-known and independent organizations including EU DisinfoLab had established India’s credentials as purveyor of anti-Pakistan propaganda globally.\nEven in the wake of the reported incident involving the daughter of the Afghan Ambassador, the Foreign Office Spokesperson said that Indian propaganda machinery against Pakistan was active and fake pictures of the Ambassador’s daughter were being circulated by Indian Twitter handles and websites.\n“It is unfortunate that India used such an incident to peddle false narrative against Pakistan,” he added.\nThe Spokesperson said that the only domains where India had set standards were state-sponsored terrorism, illegal occupation, disregard of UN resolutions, mass murders and repression against women in the territory under its illegal occupation, political violence against minorities, and running organized fake propaganda networks around the world; and was, therefore, in no position to pontificate on ‘standards’ for other countries.\n“While calling upon India to refrain from its smear propaganda campaign against Pakistan, we remain determined to pushback against unabated Indian machinations and also to draw attention towards India’s role of a spoiler in the ongoing Afghan peace process,” he maintained.",
  "retrievedAt": "2025-08-11T20:59:39.743Z"
}
