{
  "title": "Pakistan won’t allow handful of venomous minds affect Pakistan’s support to Afghans for peace, stability: Dr Moeed",
  "link": "https://www.app.com.pk/national/pakistan-wont-allow-handful-of-venomous-minds-affect-pakistans-support-to-afghans-for-peace-stability-dr-moeed/",
  "date_published": "2021-07-22T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP): National Security Adviser Dr Moeed Yusuf on Thursday said Pakistan would not let a handful of venomous minds affect Pakistan’s support to all Afghans for peace and stability.\nThe National Security Adviser in a series of tweets on his official Twitter handle said, “Pakistan remains committed to facilitating an inclusive political settlement in Afghanistan.”\nPakistan remains committed to facilitating an inclusive political settlement in Afghanistan. In this spirit, PM Imran Khan agreed to meet President Ghani recently to continue our engagement.\n— Moeed W. Yusuf (@YusufMoeed) July 22, 2021\nIn this spirit, he added Prime Minister Imran Khan agreed to meet President Ghani recently to continue our engagement.\nReferring to Afghan Vice President Amrullah Saleh’s recent statement, he wrote that vitriolic and delusional statements from some spoilers in Kabul who, unfortunately for our Afghan brothers and sisters, were imposed on them as their senior officials and were constantly attempting to vitiate bilateral relations on purpose to deflect attention from their own failures.\nAfghanistan is being embarrassed daily due to these idiotic statements. Afghans should rest assured that everyone can see through the nefarious agenda of these spoilers. We will not let a handful of venomous minds affect Pakistan’s support to ALL Afghans for peace and stability.\n“Afghanistan is being embarrassed daily due to these idiotic statements,” he added.\nDr Moeed concluded that Afghans should rest assured that everyone could see through the nefarious agenda of these spoilers.",
  "retrievedAt": "2025-08-11T20:59:42.467Z"
}
