{
  "title": "PM relief package widely hailed in KP",
  "link": "https://www.app.com.pk/national/pm-relief-package-widely-hailed-in-kp/",
  "date_published": "2020-03-25T02:10:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 25 (APP):People from all walk of life here Wednesday highly lauded the Prime Minister’s Relief Package worth Rs1000 billion that would Immensely help provide the much-needed assistance to masses in the wake of Corona virus cases in the country.\nThey said the multiple sectoral mega relief package would help provide assistance to people of all walks of life including motorists, laborers, farmers, employees, agriculturists, electricity consumers, buyers and general public.\nMohibullah Khan, Minister for Agriculture, Livestock and Dairy Devolopment has welcomed the PM package and termed it inclusive and wide-ranging.\nHe said the agriculture package worth Rs100 billion along with promotion of small and medium industries would immensly help the farmers, agriculture growers and livestock sectors in the country.\nFormer Information Officer, Misal Khan has highly welcomed the package and termed it a leap step forward to provide relief to people in the present Corona crises.\nHe said Rs3000 per month package to poor families would help provide relief to laborers, daily wages and low income groups of the society.\nHe said allocation of Rs200billion for laborers and Rs150 billion for provision of Rs3000 per month assistance to extremely poorer for four months was a positive step in the right direction.\nHe also appreciated the decision of taking electricity bills in three installments from poor consumers and termed it an important step to provide relief to poor segment of the society.\nEconomists expert, Sumbul Riaz has also welcomed the PM package and allocation of Rs50 billion for utility stores that would help control price hike and inflation besides provide essential commodities on affordable prices.\nShe said Rs 280 billion allocation would help ensure wheat flour to people besides providing relief to farmers.\nShe said medical workers were playing significant role in present Corona Crises and allocation of Rs 50billion for purchase of equipment would help them in provision of medical treatment to patients with ease.\nTribesman Asghar Afridi, Malik Irfan, journalist Shafiq Khan and others have welcomed reductions in petrol and diesel prices by Rs15 per liter that would help provide relief to common man.",
  "retrievedAt": "2025-08-11T18:59:53.032Z"
}
