{
  "title": "230 talented male, female from 12 countries prepared to create future in Arab world",
  "link": "https://www.app.com.pk/national/425713/",
  "date_published": "2022-01-29T18:40:00.000Z",
  "source": "APP",
  "content": "JEDDAH, Jan 29 (APP): In the context of spreading the culture of talent and supporting and nurturing the gifted in the Arab world, the results of the first edition of the “Arab Talented” initiative, organized in partnership between King Abdul Aziz and his Companions Foundation for Giftedness and Creativity (Mawhiba) in the Kingdom of Saudi Arabia, and the Arab League Educational, Cultural and Scientific Organization (ALECSO), were announced Saturday.\nThe announcement came during a press conference held in Jeddah, Saudi Arabia, in the presence of Mawhiba Secretary-General Dr. Saud bin Saeed Al-Mathami, ALECSO Director-General Dr. Mohamed Ould Amar, and Chairman of the Executive Council of ALECSO Hani bin Moqbel Al-Moqbel.\nDr. Al-Mathami thanked the ALECSO Executive Council and member states, as well as the ministers of education in the participating countries for their support of the initiative and keenness on its success, raising the level of its impact, contributing to achieving its goals and aspirations, and serving the peoples of the Arab world.\nThe Mawhiba Secretary-General revealed the names of 230 Arab talents who obtained the highest scores in the “Arab Talented 2021” initiative, representing 12 Arab countries, namely: Saudi Arabia, the United Arab Emirates, Bahrain, Qatar, Oman and Palestine, Jordan, Iraq, Yemen, Tunisia, Mauritania, and Libya, divided into three categories for gifted students: “Exceptional Talent”, “Talented” and “Promising Talent”.\nMawhiba Secretary-General Al-Mathami said that among the identified talented students, there were 60 exceptional talented, 87 gifted students, and 83 promising talented. He explained that the Mawhiba Foundation will provide a package of programs to develop the capabilities of the qualified Arab talents in the initiative and refine their talents. The Foundation will provide the exceptional talents with several in-person and remote care programs, including the “Excellence Program for Enrollment in Prestigious Universities”, which includes providing guidance, consultancy and leadership training, in addition to the Mawhiba Global Enrichment Program and the Mawhiba Academic Enrichment Program.\nFor his part, ALECSO Director-General Mohamed Ould Amar thanked the Kingdom of Saudi Arabia for its interest, support and sponsorship of this initiative, and for all participating Arab countries.\n“The identification of talented Arabs and the development of their capabilities reflects the interest in the scientific, social and cultural challenges posed by the Fourth Industrial Revolution (4IR), and as a stimulus to ensure a better future for the emerging Arab generations in light of global trends to achieve sustainable development, within the investment in human capital, talent and creativity,” Ould Amar said.\nIt is noteworthy that the “Arab Talented” initiative was launched in April 2021 in partnership between Mawhiba Foundation and ALECSO. The activities of the second session of the “Arab Talented 2022” initiative will be launched next February with the participation of all Arab member states, to achieve a number of goals, most notably empowering talent and creativity as they are the main source of prosperity for the Arab world; creating an environment that stimulates talent and creativity in the Arab world; and promoting a passion for science to build promising young Arab leaders to lead the Arab world towards a prosperous future; as well as emphasizing that investing in the care of talented people is one of the most important components of sustainable development in societies; in addition to leading a scientific movement to discover, nurture and embrace talented and creative people in the Arab world.\nKing Abdulaziz and his Companions Foundation for Giftedness and Creativity “Mawhiba” aims to identify and nurture the talented and gifted students, contribute to building a system for talent and creativity locally, regionally, and globally, deriving that from its vision of empowering talent and creativity as the foundation for human prosperity, and its clear message, towards creating a stimulating environment and promoting a passion for science and knowledge to build future leaders.During its functioning that has lasted for more than 20 years, Mawhiba’s giving has crossed borders, after embracing the world’s most comprehensive approach to identifying, nurturing, and empowering talented people.",
  "retrievedAt": "2025-08-11T14:12:30.265Z"
}
