{
  "title": "China attending OIC moot for partnership with Muslim world, cooperation on multilateralism: Wang",
  "link": "https://www.app.com.pk/national/china-attending-oic-moot-for-partnership-with-muslim-world-cooperation-for-multilateralism-wang/",
  "date_published": "2022-03-21T17:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): State Councilor and Foreign Minister of China Wang Yi Monday said that China was attending the 48th meeting of OIC’s Council of Foreign Ministers, scheduled here on Tuesday, for developing a partnership with the Muslim world besides promoting unity and cooperation for the multilateralism.\nThe Chinese foreign minister, after his bilateral meeting with Foreign Minister Shah Mahmood Qureshi, told media that the CFM’s theme of “Building Partnerships for Unity, Justice, and Development” had great significance in the current scenario and was also the main purpose of Chinese participation.\nIn what Foreign Minister Qureshi called a “very comprehensive and detailed meeting,” the two foreign ministers discussed bilateral cooperation, regional situation as well as international issues including Afghanistan and Ukraine.\nQureshi told the media that it was for the first time that the Chinese foreign minister would attend and address the CFM moot which manifested the strong partnership between Pakistan and China.\nEarlier, both the countries also signed documents for enhancing cooperation in the fields of higher education and agriculture at a ceremony also witnessed by the two foreign ministers.\nQureshi said they also discussed the extension of China Pakistan Economic Corridor to Afghanistan in what the Chinese FM assured for a review considering the changed situation in the war-torn country.\nWhile discussing trade and investment cooperation, Qureshi said, China expressed the desire for the export of Pakistani rice and wheat in order to enhance the country’s exports.\nThe two foreign ministers discussed the counter-terrorism cooperation and a coordinated approach to deal with the terrorist outfits including ETIM and TTP.\nWang Yi spoke high of Pakistan’s steps for the security of Chinese nationals in Pakistan also lauded the strict action against those involved in Dasu terrorist attack which had killed the Chinese nationals.\nForeign Minister Qureshi thanked China for supporting Pakistan in Financial Action Task Force (FATF) and told media that Chinese FM had assured the country for its constant support till its removal from the Grey List.\nHe also thanked China for giving a rollover of $2 billion to the State Bank of Pakistan to support Pakistan’s economy and also mentioned his upcoming visit to China within a few days which he said showed the limit of interaction cooperation and understanding.\nWang Yi, who is on his first visit to Pakistan after COVID-19 pandemic, said China would expand its support to Pakistan in poverty reduction, modernizing the agriculture sector for sustainable development. He called for closer multilateral cooperation on regional and international issues including Afghanistan and Ukraine.",
  "retrievedAt": "2025-08-11T14:34:26.506Z"
}
