{
  "title": "FMs, member states’ delegations & int’l observers arrive to attend OIC moot",
  "link": "https://www.app.com.pk/national/fms-member-states-delegations-intl-observers-arrive-to-attend-oic-moot/",
  "date_published": "2022-03-21T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):The Foreign Ministers and delegations from the Organization of Islamic Cooperation (OIC) Members States, Observers and representatives of the International Organizations on Monday arrived here to attend the 48th session of the OIC Council of Foreign Ministers.\nThe delegations were received warmly at Islamabad International Airport, where a special red carpet was rolled out for the dignitaries. The International lounge was also decorated with flags of the OIC Member States and the dignitaries were escorted on traditionally decorated polo carts from the run way to the lounge.\nSecretary General of Organization of Islamic Cooperation (OIC) Hissein Brahim Taha also arrived to attend OIC moot. He was warmly welcomed by Minister of State for Information and Broadcasting Farrukh Habib, Special Representative on Religious Harmony Muhammad Tahir Ashrafi and officials of Ministry of Foreign Affairs at the Islamabad International Airport.\nThe Foreign Ministers of Egypt, Somalia, Niger, Gambia, Bangladesh, Uganda, Tunisia, Tajikistan, Guinea Bissau, Cote d’ Ivoire and Bosnia reached the federal capital this morning.\nMeanwhile, the delegations of Indonesia, Azerbaijan, Libya, Malasiya and Mozambique led by Deputy Foreign Ministers also arrived in Islamabad to attend the OIC meeting.\nMaldives’ Permanent Representative to OIC, Mohemed Khalil also arrived to attend the OIC moot.A delegation from Turkey also reached to participate in the OIC Council of Foreign Ministers.Bangladesh’s Permanent Representative to OIC Mohammad Javed Patwary also reached.President Islamic Development Bank (IDB), Mohammad Sulaiman Al Jasser also arrived to attend 48th session of the OIC moot.\nA delegation from Lebanon led by Permanent Representative of Lebanon to OIC Dr. Fawzi Mohamad Mounzer Kabbara also arrived this morning.Other delegations from Sweden, Chad, SESRIC, IPHRC, ICDT and IRCICA also arrived in Islamabad to attend the 48th session.\nAll the distinguished guests were warmly welcomed by the officials of the Ministry of Foreign Affairs.Talking to media at Airport, the OIC Secretary General said that he was very happy to be back and visit Pakistan. He said during the upcoming OIC Foreign Ministers meeting all important issues related to Muslim Ummah would be discussed.He said that UN General Assembly recently adopted resolution to observe March 15 as day against Islamophobia which was a big development.\nPresident Islamic Development Bank (IDB) Dr Muhamamd Sulaiman Al Jasser said that he was grateful to the government of Pakistan for hosting second meeting of OIC Foreign Ministers to address the issues of Afghan people.He said that chapter for humanitarian trust fund for Afghanistan has been signed and hoped that it would usher new ways of helping Afghan people after years of strife.\nHe said that IDB has always been in the forefront of the organisations helping the 57 member countries of the OIC and this time the call was very important and the bank was ready to do everything to bring about some relief to Afghan brethren.",
  "retrievedAt": "2025-08-11T14:34:38.150Z"
}
