{
  "title": "Pakistan’s constitution gives right to freedom of speech: Gill",
  "link": "https://www.app.com.pk/national/pakistans-constitution-gives-right-to-freedom-of-speech-gill/",
  "date_published": "2022-03-21T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):Special Assistant to the Prime Minister on Political Communications Dr Shahbaz Gill on Monday said Pakistan’s constitution gives every citizen and political party the right to put their opinion in front of the people peacefully.\n“It can be a public gathering, newspaper column, social media post. The constitution gives us the right to freedom of speech and freedom of assembly.” he said.\nHe recalled that Pakistan People’s Party (PPP) leader Bilawal Bhutto Zadari organized a long march from Sindh to D chowk and Pakistan Muslim League Nawaz (PML-N) also held public gatherings due to the freedom of speech that is given by the constitution.\nNow Pakistan Tehreek-e-Insaf (PTI) is doing the same thing,” he said while talking to media outside the Supreme Court here.\nHe said the opposition wanted to come to Islamabad on March 27 on the same date which Khan had announced just to create problems. “They may have the power of money but not of the people who trust in Imran Khan. There is much space here where the (opposition) can hold a public gathering at one place while PTI on the other side,” he said.\nGill said we won’t talk about a person who sells him for money but if anybody confronts him with harsh words, then we would speak against him. “This is the hypocrisy which has brought this country at this place. We have to use tell a person on his face if he is a thief or broker.\nHe urged the media to focus on horse trading that was going on instead of other inadequate things. “Anyone who has won a seat in the general elections on PTI’s name should first resign from the party and then contest a new election and comeback.\nOn PML-N leader Maryam Safdar, he said the word neutral was talk of the town these days. “Not even a single person of this country can put the country’s sovereignty, peace at stake and give it in the hands of thieves. How can we be neutral when we see Rupees 16 crore in the account of a peon,” he said.\nGill said from the past three to four days, institutions were being abused by using PTI’s name on social media.“It is PML-N which had been abusing institutions and PTI is not like them as our institutions are our pride. We have made a brief report and will be handing it over to the FIA to investigate and take action against the culprits involved in using PTI’s name. No PTI social media worker can ever talk against the institutions as Imran Khan is the biggest ever defender of the institutions and the country,” he said.\nTo a question on the return of irked members to the party, he said anyone can return to good side anytime. “Leaving the good side to go to the corrupt is something bad,” he said.",
  "retrievedAt": "2025-08-11T14:34:34.862Z"
}
