{
  "title": "Pakistan made solid  progress in past 75 years: Fawad",
  "link": "https://www.app.com.pk/national/pakistan-made-solid-progress-in-past-75-years-fawad/",
  "date_published": "2022-03-21T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Monday said in a span of 75 years, Pakistan had made solid progress by becoming the fifth largest country and one of the seven nuclear powers of world.\nSpeaking as the chief guest at the ‘Digital Photographic and Painting Exhibition to Celebrate Pakistan Day’ here, he said when Pakistan came into being with only one university and the number had now increased to over 200.\nSimilarly at the time of independence, he said, the country had inadequate health facilities, with hardly six or seven large hospitals, and now even at the district level, a complete network of health facilities was available.\nPakistan, he added, started its journey in difficult circumstances as providing shelter to millions of migrants was a difficult task.Now after 75 years, Pakistan had the sixth largest army in the world, while its canal system was one of the biggest ones, he added.\n“Our services to the world are unparalleled, the Pakistani youth are playing an unmatched role for the world,” Fawad remarked.He said in 2018, the book “Faces of Pakistan” was published, showcasing the beauty of Pakistan. Now the book had been digitized, with the addition of more pictures of the Quaid-e-Azam Muhammad Ali Jinnah.\nThe pictures with subtitles were available for the first time in the beautiful book released by the Ministry of Information and Broadcasting, he added.“We are also bringing an authentic version of Quaid-e-Azam’s speeches so that they can be arranged properly,” the minister maintained.\nHe said an important conference of the Organization of Islamic Cooperation (OIC)was being held on 75th National Day of Pakistan, with foreign ministers of the Muslim countries from all over the world visiting Pakistan.“The OIC Foreign Ministers’ Conference is a major global event hosted by Pakistan on the occasion of its 75th year of creation,” he said and congratulated the entire nation over holding of such a big event.\nThe minister also referred to a quotation of the Quaid-e-Azam that “there is no power on earth that can undo Pakistan”.",
  "retrievedAt": "2025-08-11T14:34:32.096Z"
}
