{
  "title": "FM, OIC Sec. Gen. review CFM agenda",
  "link": "https://www.app.com.pk/national/fm-oic-sec-gen-review-cfm-agenda/",
  "date_published": "2022-03-21T10:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi and Organization of Islamic Cooperation (OIC) Secretary General Hissein Brahim Taha on Monday reviewed the agenda of 48th Council of Foreign Ministers and exchanged views on the main outcomes expected from the conference.\nThey also discussed the issues confronting the Islamic Ummah and the role of the OIC in that regard.\nThe OIC secretary general is visiting Islamabad for participation in the 48th Session of the OIC Council of Foreign Ministers (CFM).\nThe foreign minister highlighted the special significance of the 48th OIC-CFM for Pakistan, as it was coinciding with the celebration of the 75th year of Pakistan’s independence.\nWhilst highlighting the grim human rights and humanitarian situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), the foreign minister expressed appreciation for OIC’s principled position and consistent support for the just struggle of Kashmiris for their right to self-determination.\nWelcoming the recent adoption of the resolution at the United Nations General Assembly designating 15 March as the International Day to Combat Islamophobia, the foreign minister lauded the support extended by the OIC and its member states to Pakistan’s initiative.\nHe commended the proposal to appoint OIC’s Special Envoy on Islamophobia to help coordinate the work of the Organization and its member states for addressing discrimination and stigmatization of Muslims all over the world.\nReferring to the humanitarian and economic crises faced by the Afghan people, Qureshi stressed the importance of the implementation of decisions taken at the extraordinary session of the OIC-CFM held in Islamabad on December 19 last year and welcomed the operationalization of the Humanitarian Trust Fund for Afghanistan.\nThe OIC secretary general assured the foreign minister of the OIC Secretariat’s full support and cooperation during Pakistan’s chairmanship of CFM.",
  "retrievedAt": "2025-08-11T14:34:41.958Z"
}
