{
  "title": "PM Khan will deliver speech at D-Chowk gathering: Faisal Javed",
  "link": "https://www.app.com.pk/national/pm-khan-will-deliver-speech-at-d-chowk-gathering-faisal-javed/",
  "date_published": "2022-03-21T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):Pakistan Tehreek-e-Insaf (PTI) Leader Senator Faisal Javed Khan on Monday said that preparations are in full swing to hold largest public gathering on March 27 at D-Chowk, Islamabad.\nAddressing a press conference, he said the entire nation was standing by Prime Minister Imran Khan at this critical juncture.\nHe said, “The Prime Minister will also make a historic speech at the gathering where he will present his future strategy.”Faisal Javed Khan who is also Chairman Senate Standing Committee on Information and Broadcasting said that the Opposition parties’ leaders were exposed as their interviews also resurfaced about horsetrading, adding, other PTI MNAs were also approached by opposition and they were offered huge bribes which they refused to accept.\nHe said that Changa Manga era was no more existed as this was social media’s era and nothing was hidden from the masses.He said that PM Imran Khan has come into politics to build the county as a strong state.\nHe said that the previous rulers have made corruption and money laundering known as a common practice, adding, “People know very well about the good and bad practices adopted by the politicians”.\nHe said that from day one, the government plainly rejected the National Reconciliation Ordinance (NRO), demanded by the opposition. He said that the opposition also tried their best to bargain over each public interest legislation, adding, they also held long march, threatened to submit their resignation from the assemblies and held protests but Prime Minister Imran Khan clearly denied to give them the NRO.\nFaisal Javed Khan added that the country’s economy was strengthened despite COVID-19 pandemic.He said that PTI would also win the upcoming General Elections 2023 with two third majority.",
  "retrievedAt": "2025-08-11T14:34:30.957Z"
}
