{
  "title": "Preparations to celebrate Pakistan Day in full swing",
  "link": "https://www.app.com.pk/national/preparations-to-celebrate-pakistan-day-in-full-swing-2/",
  "date_published": "2022-03-21T09:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): The preparations to celebrate Pakistan Day in a befitting manner were in full swing as nation geared up to mark the passing of the Lahore Resolution, when a separate nation for the Muslims of the British Empire was demanded on March 23, 1940 in Lahore.\nAs Pakistan Day holds a significant place in the history of Pakistan and to mark it in a befitting manner Armed Forces, Para Military Forces and Civil Armed Forces, Scouts, Girl Guide and others are busy in rehearsals and drills at ‘Shakarparian’ parade ground to celebrate the day in a spectacular way.\nVarious organizations and departments, both public and private, have planned a number of activities including seminars, conferences and discussion programs to highlight the historical significance of Pakistan Day. Cultural organizations including the Pakistan National Council of Arts (PNCA), Pakistan Academy of Letters, National Book Foundation, National Institute of Folk and Traditional Heritage (Lok Virsa) were all set to hold various events and activities in connection with Pakistan Day.\nOnly one day left in the celebrations of Pakistan Day, famous brands have also started offering sales on dresses, shoes and other accessories to provide an opportunity to the buyers for having a good stock of required stuff at the advent of the summer season.\nThe Directorate of Sports, Culture and Tourism has organised special events to celebrate Pakistan Day at the cricket ground in Fatima Jinnah Park.  Special ‘dua’ ceremonies would be organised at the Mosques after Fajar prayers, seeking solidarity, integrity and prosperity of the country.\nMeanwhile, Islamabad Traffic Police (ITP) have devised a special traffic plan for the convenience of the road users in connection with the Pakistan Day Parade on March 23 and the Organization of Islamic Cooperation (OIC)’s Foreign Ministers conference to be organized on March 22 and 23.\nAccording to the ITP spokesman, a traffic plan had been issued by Senior Superintendent of Police (Traffic) Rai Mazhar Iqbal. Entry of heavy transport vehicles (HTV) would be banned in Islamabad on March 22 and 23 from 12 am to 2 pm.\nThe ITP had also finalized arrangements for alternative routes to facilitate Light Transport Vehicles (LTV) to avoid any inconvenience. All heavy vehicles would be stopped at Rawat T-Chowk, Chungi No. 26, 9th Avenue, Metro Ground, Sabzi Mandi, and Satra Meel Toll Plaza, he said adding, restricted areas include the I-8 signal on IJP road, ADBP checkpoint on Murree Road, Khanna Pul Expressway, Zero Point Faisal Avenue, Garden Flyover, Best Western Hotel, Murree Road, Chand Tara Chowk, and Dhokri Chowk. Light vehicles coming from Rawat would be allowed to move through T-Chowk to get to Rawalpindi Saddar Road, Peshawar GT Road, and the motorway.\nTraffic coming from old Airport Rawalpindi would be able to access Expressway via Khanna Pul, Lehtrar Road, Captain Naeem Tufail Shaheed Chowk (Taramri Chowk), Park Road, Jinnah Road, Korang Road through Murree Road to get to G and F sectors of Islamabad and Srinagar Highway.\nThe traffic would be able to make a turn from Malpur U-turn to reach Bhara Kahu and Murree. Similarly, the vehicles coming from Srinagar Highway, heading towards Rawalpindi Airport and Jhelum would use 9th Avenue, Murree Road, Rawal Road and will have to take a right turn from Koral flyover to get to Jhelum road. Only those individuals who have a permit would be able to travel on Expressway.\nThe traffic arriving from the motorway would use Srinagar Highway, for travelling to Aabpara, Bhara Kahu, and Murree. He informed that Expressway, Faisal Avenue (Zero Point) Murree Road (Rawal dam to Faizabad), and IJP Road (I-8 signal Faizabad) would remain closed for all kinds of traffic on March 22 and 23 between 5 am to 2 pm.\nMurree Road from Rawal Dam Chowk to Faizabad would remain closed for all kinds of traffic on March 21, 22 and 23 from 5 am to 2 pm.  The motorists commuting from Islamabad’s Sector F, Sector G, and Srinagar Highway to Rawalpindi Airport would use Rawat T-Chowk while traffic going towards Jhelum would travel through Koryan Wala Chowk, Korang Road, Jinnah Road, Dhokri Chowk, Park Road, Lehtrar Road, and Khanna Pul.",
  "retrievedAt": "2025-08-11T14:34:37.053Z"
}
