{
  "title": "Pakistan believes that steps taken by S.Arabia to ensure global economic stability: Ashrafi",
  "link": "https://www.app.com.pk/national/pakistan-believes-that-steps-taken-by-s-arabia-to-ensure-global-economic-stability-ashrafi/",
  "date_published": "2022-10-19T14:55:00.000Z",
  "source": "APP",
  "content": "CAIRO, Oct 19 (APP):: Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Wednesday said that Pakistan believed that steps taken by Saudi Arabia would ensure global economic stability and any kind of rhetoric against its leadership would not be acceptable under any circumstances.\nTalking to international media in Cairo (Egypt), Ashrafi who also holds the portfolios of Chairman Pakistan Ulama Council and Secretary General International Tazeem Haramain Sharifain Council, made it clear that Saudi Arabia was a sacred land for Muslims and they had strong spiritual attachment with it and this was the basic reason that the entire Islamic and Arab world would not tolerate any kind of rhetoric and action against Saudi Arabia.\nHe said that Pakistan had described the statements against Saudi Arabia as regrettable in the context of the OPEC+ decision adding that the Saudi stance was based on the fact, that was why; Pakistan along with all other Islamic and Arab countries was supporting it.\nAshrafi said that Pakistan’s position was very much clear and “we express solidarity with the people and leadership of Saudi Arabia and appreciate its concerns to ensure the global economic stability.”\nHe said that Pakistan’s relationship with Saudi Arabia was the relationship of faith and belief and Pakistan had supported its stance on the issue of oil in the context of global situation.\nHe said that under the auspices of the International Tezeem Haramain Sharifain Council, an ‘International Tezeem Haramain Sharifain Conference’ was being held in Nigeria on October 22, in which important leaders of the Islamic world would express solidarity with the leadership of Saudi Arabia and people and pay tribute to the matchless services of Saudi Arabia in the context of Haramain Al-Sharifain and Hajj and Umrah pilgrims. On this occasion, the future strategy would also be unveiled, he disclosed.\nMeanwhile, he met Palestinian Mufti Azam Muhammad Hussain and Qazi Al-Qaza Dr Mahmood Al-Habash in Cairo the other day and expressed full support to the government and the people of Palestine on behalf of the government and the people of Pakistan.\nHe said that Pakistan had a clear-cut stance on the Palestine issue as Palestine and Indian Illegally Occupied Jammu and Kashmir were problems of the Muslim Ummah and without their settlement, peace could not be established in the world.\nHe thanked Palestinian President Mahmoud Abbas for the aid to the flood victims in Pakistan and Palestinian people for expressing their solidarity with Pakistan.",
  "retrievedAt": "2025-08-11T15:45:24.217Z"
}
