{
  "title": "Int’l Day to end Impunity for crimes against journalists observed tomorrow",
  "link": "https://www.app.com.pk/national/intl-day-to-end-impunity-for-crimes-against-journalists-observed-tomorrow/",
  "date_published": "2022-11-01T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP):Like other parts of the world,  International Day to End Impunity for crimes against journalists would be observed on Wednesday.\nAccording to details, the theme and tribute of this years would be goes to renowned Journalist Arshad Sharif who was killed in Kyena Police last week.\nThis landmark resolution condemns all attacks and violence against journalists and media workers.\nIt also urges Member States to do their utmost to prevent violence against journalists and media workers, to ensure accountability, bring to justice perpetrators of crimes against journalists and media workers, and ensure that victims have access to appropriate remedies.\nIt further calls upon States to promote a safe and enabling environment for journalists to perform their work independently and without undue interference.\nThe United Nations General Assembly proclaimed 2 November as the ‘International Day to End Impunity for Crimes against Journalists’ in General Assembly Resolution A/RES/68/163.\nThe Resolution urged Member States to implement definite measures countering the present culture of impunity. The date was chosen in commemoration of the assassination of two French journalists in Mali on 2 November 2013.\nEnding impunity for crimes against journalists is one of the most pressing issues to guarantee freedom of expression and access to information for all citizens. Between 2006 and 2020, over 1,200 journalists have been killed for reporting the news and bringing information to the public. In nine out of ten cases the killers go unpunished, according to the UNESCO observatory of killed journalists.\nImpunity leads to more killings and is often a symptom of worsening conflict and the breakdown of law and judicial systems.\nWhile killings are the most extreme form of media censorship, journalists are also subjected to countless threats – ranging from kidnapping, torture and other physical attacks to harassment, particularly in the digital sphere.\nThreats of violence and attacks against journalists, in particular, create a climate of fear for media professionals, impeding the free circulation of information, opinions and ideas for all citizens. Women journalists are particularly impacted by threats and attacks, notably by those made online.\nAccording to UNESCO’s discussion paper, The Chilling: Global trends in online violence The United Nations General Assembly proclaimed 2 November as the ‘International Day to End Impunity for Crimes against Journalists’ in General Assembly Resolution A/RES/68/163.\nwomen journalists, 73 percent of the women journalists surveyed said they had been threatened, intimidated and insulted online in connection with their work.",
  "retrievedAt": "2025-08-11T15:49:48.323Z"
}
