{
  "title": "WAPDA generates 34 bln units hydel electricity in 2023",
  "link": "https://www.app.com.pk/national/wapda-generates-34-bln-units-hydel-electricity-in-2023/",
  "date_published": "2023-12-29T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP):The outgoing year 2023 has been a satisfying year for hydropower and water sectors in Pakistan as WAPDA generated about 34 billion units of low-cost, clean and green hydel electricity, which is 2.2 billion units more than that of the last year.\nThe country witnessed increased generation of hydel electricity, while under-construction WAPDA projects in water and hydropower sectors also achieved major milestones in 2023, according to a press release on Friday.\nThis increased hydel generation helped national exchequer save about Rs. 106 billion, if same quantum of electricity was to be generated through expensive, imported fossil fuels.\nMost importantly, WAPDA hydel electricity costs only Rs. 3.51 per unit; and it constitutes about 30% of the total electricity provided to the National Grid.\nWAPDA owns and operates 22 hydel power stations including Neelum Jhelum with cumulative generation capacity of 9459 Megawatt (MW). According to the generation details of 2023, Tarbela generated 12.9 billion units, Tarbela 4th Extension 4.4 billion units, Ghazi Barotha 6.8 billion units, Mangla 4.7 billion units, Neelum Jhelum 1 billion unit, Warsak 0.8 billion units, Chashma 0.9 billion units, and rest of WAPDA hydel power stations cumulatively generated 2.5 billion units.\nYear 2023 also augured well for under-construction WAPDA projects. Despite the the cosmic crunch, construction work on eight WAPDA projects continued unabated. WAPDA achieved the landmark of river diversion at Dasu Hydropower Project in February 2023, while diverted River Indus at Diamer-Basha Dam through test-run. WAPDA is likely to achieve the milestone of river diversion at Mohmand Dam Project in next three to four months.\nWAPDA is developing eight mega projects for water, food and energy security of the country. These projects are scheduled for completion from 2024 to 2028-29 in a phased manner. On completion of these projects, 9.7 million\nacre feet will be added to the gross water storage capacity. In addition, hydel generation of WAPDA will almost be\ndoubled to 20,000 MW with an increase of approximately 10,000 MW in next five years.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:18:01.131Z"
}
