{
  "title": "Pakistan missed 2023 global deadline to regulate Trans-fats across all foods",
  "link": "https://www.app.com.pk/national/pakistan-missed-2023-global-deadline-to-regulate-trans-fats-across-all-foods/",
  "date_published": "2023-12-29T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP):As 2023 comes to a close, it is apparent that Pakistan has missed the World Health Organization’s (WHO) 2023 deadline to eliminate industrially-produced Trans Fats (iTFAs) from all food sources.\nDespite efforts by the Nutrition Wing of the Ministry of National Health Services Regulations and Coordination earlier this year to regulate iTFAs in specific food sources such as banaspati ghee, bakery wares, and bakery shortenings with the help of Pakistan Standards and Quality Control Authority (PSQCA), public health experts stress that this progress, while a positive step forward, remains insufficient.\n“Many commonly consumed sources of transfats such packed snacks, dairy products, street foods, and several types of ultra-processed foods remain outside the realm of iTFA standards,” stated Munawar Hussain, Country Coordinator Pakistan at the Global Health Advocacy Incubator (GHAI) as part of a press statement issued by the TRANSFORM Pakistan Campaign. “It is imperative that Pakistan does not allow the matter of regulating iTFAs to linger any further, and all efforts should be made to ensure that trans-fats across all dietary sources are regulated in accordance with WHO guidelines at earliest.”\nDr. Khawaja Masuood Ahmed, National Coordinator Nutrition and NFA at the Ministry of National Health Services, Regulations, and Coordination (MoNHSR&C) commented on ongoing efforts, stating, “The Ministry of Health is closely collaborating with civil society organizations, and providing technical support to the PSQCA to regulate Trans-fats to 2% in all food sources and safeguard the health of the Pakistani nation. We are committed to adopt the best practice policy to cover all foods under iTFA limits as per WHO Standards, through a single regulation if required.”\nEarlier this year, Pakistan Youth Change Advocates (PYCA), with support from GHAI and the Ministry, collaborated with civil society actors such as the Centre for Peace and Development Initiatives (CPDI) and Heartfile to launch the TRANSFORM Pakistan campaign. Afshar Iqbal, Director of Media and Communications at PYCA, highlighted their efforts, stating, “Through the TRANSFORM Pakistan Campaign, we aim not only to raise mass awareness about the ill effects of iTFAs in our dietary sources but also to work with all relevant stakeholders to expedite the regulation of trans-fats across all food items in Pakistan. We are grateful to our national and international partners, collaborators, and the Ministry of Health for their support in advancing this critical cause.”\nMukhtar Ahmed, Executive Director of CPDI, shed light on the civil society’s role in regulating iTFAs, saying, “Civil society is in close communication with the Ministry of Health, PSQCA, and provincial food regulatory bodies. Our collaborative efforts are focused on ensuring that, after missing the 2023 global deadline, Pakistan does not encounter further roadblocks in enforcing government-mandated regulation on the presence of trans-fats in all foods across the country.”\nDr. Saba Amjad, CEO Heartfile, raised a concern that failure to take decisive action at earliest could lead to further increase in non-communicable diseases, particularly heart diseases and diabetes in Pakistan.” The urgency to address this issue is paramount for the well-being of the nation.”\nWith 2023 coming to a close, it is crucial for all stakeholders, including government bodies, civil society, and international partners, to intensify their efforts to regulate trans-fats across all dietary sources in Pakistan, ensuring the health and well-being of the population.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:17:58.750Z"
}
