{
  "title": "Senate body on petroleum discusses suspension of gas supply of Sindh industrial sector",
  "link": "https://www.app.com.pk/national/senate-body-on-petroleum-discusses-suspension-of-gas-supply-of-sindh-industrial-sector/",
  "date_published": "2023-12-29T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP): The Senate Standing Committee on Petroleum, chaired by Senator Mohammad Abdul Qadir, on Friday discussed the issue regarding the suspension of gas supply of Sindh industrial sector, resulting in a substantial 28% production loss.\nOfficials from the Ministry for Energy (Petroleum Division) while briefing the committee said that each year the country was witnessing a depletion of more than 10% of gas reserves at various gas fields, with a simultaneous increase in its demand.\nThis year, Sui Southern Gas Limited (SSGC) was grappling with a reduction of approximately 90 MMCFD compared to the previous year.\nSecretary of the Ministry for Energy (Petroleum Division), Mohsin Agha, highlighted the sustained decline over the past 8 to 10 years, emphasizing the need for a comprehensive plan to scrutinize the policymaking.\nThe committee members conducted an in-depth analysis of supply statistics and gas depletion over the years, urging Ministry for Energy officers (Petroleum Division) to address discrepancies for conclusive results.\nFurthermore, ministry officials provided insights into LPG rates, clarifying that OGRA (Oil and Gas Regulatory Authority) determines prices for producers, the margin of Marketing Companies (MCs), and consumers.\nPricing is based on various parameters, including the monthly determination of the producers’ price per metric ton according to the Saudi Aramco Contract Price (40% Propane: 60% Butane).\nThe distribution margin is fixed at Rs. 35,000 per metric ton, equivalent to Rs. 413 per cylinder.\nAdditionally, a petroleum levy on indigenous production stands at Rs. 4,669 per metric ton, translating to Rs. 55 per cylinder. The officers explained that GST, previously at 17% and now increased to 18% since February 2023, applies to these parameters. They clarified that the compilation of these figures makes up the consumer price.\nThe Secretary of the Ministry for Energy (Petroleum Division) added that active exploration of indigenous sources is underway, addressing infrastructure constraints in efforts to stabilize gas prices.\nChairman of OGRA, Masroor Khan, provided the committee members with insights into the reasons behind the increase in oil and gas prices. Senator Saadia Abbasi highlighted that the rise in cylinder prices is attributed to taxes imposed on people.\nSimilarly, Committee Chairman Mohammad Abdul Qadir suggested that officers explore and utilize gas transportation via seaports and large ships to mitigate price increases, ultimately benefiting the larger population struggling with rising costs.\nThe Chairman of OGRA mentioned that their FBR mechanism already operates at the sea border.\nHowever, operating on large ships is currently not feasible, and efforts are underway to determine how to increase LPG operations at Karachi ports.\nChairman Mohammad Abdul Qadir recommended that officers from the Ministry of Energy (Petroleum Division) reach out to international companies and encourage them to invest.\nHe noted that since 2015, the ministry has been limited to purchasing LNG from 2-3 bidders, despite numerous bidders worldwide. Allowing private entities to participate could enhance competitiveness.\nHe also highlighted that several government and private companies are non-operative due to minor disputes, suggesting that the ministry should resolve petty matters to achieve positive collective results.\nThe Secretary of the Ministry for Energy (Petroleum Division) assured the committee members that they are actively pursuing a comprehensive plan and policy review, with improvements expected within a few weeks.",
  "retrievedAt": "2025-08-11T11:17:37.131Z"
}
