{
  "title": "Govt. fully committed to facilitate Hajj pilgrims; Secretary Religious Affairs",
  "link": "https://www.app.com.pk/national/govt-fully-committed-to-facilitate-hajj-pilgrims-secretary-religious-affairs/",
  "date_published": "2023-12-29T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP): Highlighting the government’s commitment to facilitating pilgrims, Secretary Religious Affairs Atta-ur-Rehman outlined the government’s concerted efforts to enhance facilities for all pilgrims embarking on this sacred journey.\nTalking to Pakistan Television News on Friday, he stated that as the balloting for Hajj 2024 was announced, the Ministry was gearing up for the preparation of Hajj 2024.\nAccording to details, 69,438 applications were received under the Regular Hajj Scheme, and 63,805 of them were successful in the balloting. “A waiting list of 5,633 unsuccessful applicants has been prepared based on their cities of departure,” he added. Speaking on national TV, the secretary mentioned that, for the first time ever, short Hajj is being facilitated by Pakistani authorities.\nIn a move aimed at enhancing the pilgrims’ experience, the Secretary emphasized the introduction of short-term Hajj facilities within Pakistan. Notably, each pilgrim will receive a suitcase with a network SIM with a QR code, enhancing security and preventing the misplacement of luggage. Moreover, he said the Ministry plans to provide complimentary Pakistani flag-themed abayas for all women pilgrims, along with a free 7GB data card, further enhancing the Hajj journey experience.\nUnlike previous years, the training period has been doubled, focusing more on practical training than lectures. Pilgrims will undergo training in camps with an emphasis on social interactions and community engagement, addressing issues during the training, he added.\nAddressing the financial aspect, Atta-ur-Rehman mentioned the reduction of the Hajj package cost by one lakh rupees. Additionally, efforts are underway to minimize airline ticket expenses, prioritizing the convenience of the pilgrims, especially those from Karachi included in the Road to Makkah initiative, he expressed.\nHe said that pilgrims were required to have two vaccinations, both of which will be available within the camp at the appropriate time. He expressed gratitude for the aid the Saudi Arabian government had given and mentioned the possibility of more relief in a number of sectors.",
  "retrievedAt": "2025-08-11T11:17:35.880Z"
}
