{
  "title": "Ethiopian industrial sector attracts Pakistani investors",
  "link": "https://www.app.com.pk/national/ethiopian-industrial-sector-attracts-pakistani-investors/",
  "date_published": "2023-01-23T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):The efforts of the Embassy of Federal Democratic Republic of Ethiopia in Islamabad has started yielding results as a major business group from Pakistan has flown to Addis Ababa, the other day, to explore investment opportunities in its industrial sector.\nA high-level delegation of Arif Habib Group visited Addis Ababa where they met with business people and officials of the government of Ethiopia and discussed prospects of investing in the country’s production sector, a press release said.\nOn Tuesday, January 17, 2023, the delegation led by Arif Habib Group of Companies Chief Executive Officer (CEO) Muhammad Kashif met with Commissioner of Ethiopian Investment Commission (EIC) Enginer Lelise Neme and expressed keen interest to invest in manufacturing of fertilizer, cement and steel in Ethiopia.\nAmbassador Extraordinary and Plenipotentiary of the Federal Democratic Republic of Ethiopia to the Islamic Republic of Pakistan Jemal Beker Abdula was also present during the meeting.\nDuring the meeting, the EIC commissioner briefed the delegation on the ease of doing business, incentive packages, and investment climate in Ethiopia which was conducive and favorable for investment operations.\nOn the occasion, the ambassador extended gratitude to the delegation for visiting his country and said it was high time for the foreign investors to invest in Ethiopia which offered lucrative opportunities, business-friendly environment, cheap cost of production as well as multiple incentives on foreign direct investment.\nThe ambassador said Ethiopia had undergone a lot of transformation since Prime Minister Dr Abiy Ahmed came into power who had a vision to transform the country into a major investment destination not in Africa but also in the world.\n“We are committed to facilitating the investors in our country, that is why we have established a one-window operation for them,” he added.\nHe assured the delegation of the government’s support in starting and doing business in Ethiopia which had been producing 96.4 per cent electricity from water and geothermal sources that provided at cheap rate.\nThe delegation of Arif Habib Group has held a meeting with officials of Ministry of Foreign Affairs, Agriculture and Mines in which they were briefed them about the policies, opportunities and commitment and support of government to harvest the availed opportunities in agriculture, manufacturing, mines and services.\nArif Habib Group is a giant company with $2.5 Billion net assets that has a diversified portfolio of investments ranging from financial services, industries and real estate development and advisory.\nIt has a history of building Joint Venture (JV) partnerships and is continuing to expand business collaborations with domestic as well as foreign entities.",
  "retrievedAt": "2025-08-11T05:48:03.423Z"
}
