{
  "title": "Those involved in anti-state activities are ‘rebels’: Mufti Taqi Usmani",
  "link": "https://www.app.com.pk/national/mufti-taqi-usmani-terms-those-taliban-rebel-fighting-against-pak-army/",
  "date_published": "2023-01-23T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): Renowned scholar Mufti Muhammad Taqi Usmani on Monday issued a Fatwa (decree) that any armed activity against the state of Pakistan was a “rebellion”, which was “haram” and proscribed according to the Islamic law.\nThe Tehreek-e-Taliban Pakistan (TTP), who were fighting against the Pakistan Army and were involved in anti-state activities, were “rebels”, he said while virtually addressing the Paigham-e-Pakistan National Conference on ‘Countering Violent Extremism, Radicalism and Hate Speech, organized by the International Islamic University, Islamabad here at its Faisal Masjid Campus.\nThe decree was also unanimously adopted by the Ulema and Mashaykh of all schools of thought present in the conference.\nMufti Taqi Usmani said during his meetings in Kabul while heading a delegation, the Afghan Taliban also expressed their resentment against the TTP elements who were carrying out terrorist activities in Pakistan.\n“Fighting against national security agencies and carrying out anti-state activities come under mutiny and it has nothing to do with Jihad,” he added.\nCouncil of Islamic Ideology Chairman Dr Qibla Ayaz said the sad incident of Army Public School had united the entire nation on one platform to cope with the menace of terrorism.\nWith the help of Ulema, Mashaykh and religious scholars, he said, the government evolved a unified policy in the shape of “Paigham-e-Pakistan” to bridge the communication gap and remove the religious differences for peace and tranquility in the country.\nHe proposed that the ‘Paigham-e-Pakistan’ should be given a constitutional cover by the parliament so that it should be implemented at the grassroots level.\nPrime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi said political instability was one of the main factors causing economic meltdown in the country.\nHe urged the media to play a responsible role and avoid publishing or broadcasting fake news because it severely affected the business activities.\nHe said there were certain elements who wanted to create chaos but the Ulema and Mashaykh had renewed their pledge to foil the nefarious designs of enemy against the peace and security.\nCentral Ruet-e-Hilal Committee Chairman Maulana Syed Muhammad Abdul Khabir Azad said the “Paigham-e-Pakistan” had united the nation and it was playing a constructive role in the country’s development and prosperity. The Ulema and Mashaykh stood with the Pakistan Army and other security agencies, and they were countering the enemy’s agenda, he added.\nFormer religious affairs minister Hamid Saeed Kazmi said they had to make collective efforts to net the “masterminds”, who were polluting the minds of youth.\nAllama Iftikhar Naqvi said the “Paigham-e-Pakistan” was yielding positive results and there was need for concerted efforts to make the people at every nook and cranny of the country aware of it.\nCriticizing the Pakistan Tehreek-e-Insaf chief, he said Imran Khan was promoting polarization in society in a bid to grab power.\nZiaullah Shah Bukhari said there were certain elements fueling sectarianism on the social media and they could be countered through dialogue or otherwise taking legal action.\nMaulana Fazlur Rehman Khalil said,”We should make concerted efforts to bridge the gap between the Ulema of Pakistan and Afghanistan.”\nAllama Hussain Akbar said the “Paigham-e-Pakistan” should be part of national curriculum to educate the young generation.\nHe said a copy of the “Paigham-e-Pakistan” should be provided to the local government institutions across the country to further implement it at the lower level.\nDr Raghib Naeemi, Dr Attur Rehman, Allama Tauqir Abbas, Mufti Nauman Naeem, Mufti Gulzar Ahmed Naeemi, Pir Syed Ali Raza, Mufti Muneeb-ur-Rehman, Qari Muhammad Hafeez Jalandhari, Muhammad Adil Attari, Pir Chiragh Uddin Shah, Maulana Hamidul Haq Haqqani, Maulana Tayyab Qureshi, Pir Hassan Haseeb ur Rehman, Maulana Zahid Rashidi, Yasin Zafar, Pir Muhammad Azhar Saeed, Pir Khalid Sultan Bahu, Senator Sajid Mir, Mufti Abdul Raheem and Planning Minister Ahsan Iqbal also expressed their views.",
  "retrievedAt": "2025-08-11T05:47:57.006Z"
}
