{
  "title": "Pakistan’s nuclear programme safest, globally endorsed, says Khawaja Asif",
  "link": "https://www.app.com.pk/national/pakistans-nuclear-programme-safest-globally-endorsed-says-khawaja-asif/",
  "date_published": "2023-01-23T13:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): Minister for Defence, Khawaja Muhammad Asif Monday said Pakistan was a responsible state and its nuclear programme had been globally endorsed as one of the safest programmes in the world.\nWhile talking to media persons here, he said no such thought should be considered pertaining to the protection of the country’s nukes.\n“We can protect all our defence assets as per global laws and regulations. I give my 200% confidence that the country’s nuclear programme was secure and well-guarded,” he added.\nCommenting on the rising inflation and economic situation, he said the prevailing crisis was mainly what the coalition government of Pakistan Democratic Movement (PDM) had inherited after the failure of Project Imran Khan, “we received only wreck.”\nResponding to another query, he said he had told media that after the success of no confidence motion, the PDM would have gone into fresh elections and get fresh mandate for five years. “But any interim government in that scenario had failed to run the system and the country might have got default at that time as International Monetary Fund (IMF) had not negotiated with the interim government,” he added.\nThe minister underlined that the PDM—ally parties had paid the price for its decision. The masses were facing huge crisis and it should not be put in the PDM’s credit rather Imran Khan should be held accountable.\n“Imran Khan has changed his narrative and backed out from his anti-America narrative,” he remarked.\n“We are struggling to improve the system and paying a huge political cost for our decision. No government can fulfill its claims in six months or a year,” he added.\nThe minister underlined that the Pakistan Muslim League-Nawaz (PML-N) would continue its narrative of “Respect for Vote” which was the part of the constitution, adding, “I took oath on it and its applicable on all of us.”\nHe also underlined that the journalists’ impartiality was not their obligation and they could have a tilt towards any political ideology. “There are many channels and journalists having political inclinations.”\nKhawaja Asif said, “I claim with full confidence that all constitutional requirements will be met under the interim government. The parliamentary board has been formulated and preparations are underway for elections.”\nThe minister also spent three days in his constituency in Sialkot where all the existing members of Punjab Assembly and new candidates were preparing for elections.\nResponding to another query, he said not a single inch of Pakistan was under terrorists’ influence rather the peace was hard earned due to the sacrifices of the nation’s martyrs. “Our neighbours in the west are sharing culture, faith and national ties for centuries. In case of Afghanistan, we have been inhabiting 3.5 to 4 million Afghan Refugees and are part of our economy. Many of them did not repatriate and there is no chance of it.”\nThe minister told that Pakistan had brotherly relations with Iran and it did not accuse it of allowing its soil use to terrorists against Pakistan. “We are in contact with Tehran and Kabul to stop use of each other’s soil against the sovereignty of the three brotherly states,” he added.\nReplying to a query, he brushed aside rumours of senior party leader Shahid Khaqqan Abbasi’s giving up the party.",
  "retrievedAt": "2025-08-11T05:48:05.960Z"
}
