{
  "title": "Imran Khan heading gradually to complete failure: Khawaja Asif",
  "link": "https://www.app.com.pk/national/imran-khan-heading-gradually-to-complete-failure-khawaja-asif/",
  "date_published": "2023-01-23T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): Minister for Defence Khawaja Muhammad Asif on Monday said Imran Khan was heading gradually towards a complete political failure as all his decisions were proving wrong and miscalculated.\nAddressing a news conference here, the minister responded to Pakistan Tehreek-e-Insaf (PTI)’s objections and criticism on the appointment of Mohsin Raza Naqvi as interim Chief Minister Punjab and revocation of their resignations from the National Assembly.\nAsif in the prologue of his media briefing congratulated the interim chief minister for assuming his new responsibilities. He wished that under his leadership free and fair elections would be held in Punjab.\nHe also welcomed the Election Commission of Pakistan (ECP)’s decision being taken as per law and said that the entire process was done according to the constitution.\nThe minister clarified that the nominees presented by PTI and others did not have good exercise as one the nominee a serving government employee and the other was a dual national. “Their vetting was not good for these nominees. So that’s why they had to face humiliation in this case,” he added.\nMoreover, the government’s nominees had one ex-civil servant and one media personality, he said, adding, “PTI also gave the name of another honourable bureaucrat who himself apologised to take the task. Hence the PTI’s objection on Naqvi’s appointment is a fake cry.”\nWhile clarifying the media over the allegations of plea bargain against the interim Punjab chief minister, he said Naqvi’s name was dragged into an issue of NAB plea bargain but the fact was he had taken some loan from the accused in Haris Steel Mill Case in the National Accountability Bureau (NAB).\n“Naqvi provided a cheque with a letter during the probe and returned the loan to the accused. A few news articles erroneously reported it as a matter of plea bargain whereas one letter could not be considered as a plea bargain. And, if he has done anything illegal then we are not going to defend him,” he added.\nThe Minister said Naqvi was the coalition government’s nominee and it was his right to defend him.\nIn Khyber Pakhtunkhwa (KP), he said it was propitious to have a unanimous nomination for KP interim Chief Minister.\nBerating former Chief Minister Punjab, Asif said, “However, Chaudhry Pervaiz Elahi and PTI had most of the objections. Elahi at this age has gone against all his relatives and may God bless him with a long life. He has gone against his eldest brother Chaudhary Shujjat, and Naqvi is his son-in-law in relations. He must do efforts to unite them.”\nCommenting on the National Assembly (NA) situation, he said the PTI tendered resignations at th NA after hurling abuses on the Assembly and used foul language against the Parliament which was known to all. “Imran Khan used indecent language against the NA and now they all want to return to the same platform. They (PTI) are demanding justice from the Election Commission of Pakistan (ECP) whom they rebuked indiscriminately.”\nThe Minister said the PTI leaders and MNAs were demanding withdrawal of their resignations, whereas they should have led the opposition earlier and avoided confrontation with the Parliament. “The PTI should stop believing that the institutions like Courts, ECP and Parliament will pay the price for their wrong decisions.”\nImran Khan, he said was a failed project and he wanted to revive himself on the political scene, adding, “I believe that he is gradually losing ground in the political arena.”\nHe said that historically, Imran Khan always resigned after becoming an MNA. “Back in November 1, 2007, he tendered his first resignation then boycotted, later in 2013 and 2014 he first resigned and then withdrew it, and now recently in 2022 he again gave his resignation and is demanding its withdrawal,” said Khawaja Asif.\nBesides, Khan had contested eight elections and his companions claimed that he would contest on 35 seats which now increased to 70 vacant constituencies. As per his antecedent, he would also resign and recontest, the Defence Minister said.\n“Imran Khan is losing sanity and becoming obsessive as his behavior, his political conduct and backing out of political decisions qualify him to an uncertain state of mind. Any individual with a stable mind can never make such statements and decisions. The price for that is being paid by his workers and MNAs,” Khawaja Asif said.\nHis MNAs, he noted that were still living in the Parliament Lodges despite after one year of resignations and were enjoying all perks. “This means it was not a conclusive decision and not a final verdict on consensus in the party.”\nHe claimed that this issue would settle after general elections to be held as per the Constitution and it would further prove how much popularity Imran Khan has and what status he bears in the country.\n“Khan used to praise former Chief Justice of Pakistan, Justice Iftikhar Chaudhary then criticized him. He also praised former ECP head late Justice (R) Fakhruddin G. Ibrahim who was a great person and then also passed degraded remarks against him. They used to praise former COAS, General Bajwa a lot and then their remarks are also evident to the nation. Gen (R) Bajwa and the nation are also listening to it what they (PTI leadership) used to say earlier.”\nHe said Khan was not loyal to anyone including his mentors, this country, this soil and his companions, adding, “He has lust for wealth and power and I don’t want to add more.”\nResponding to media queries, he said the general elections would be held on time by the will of Allah. He added that the appointment of interim Chief Minister Punjab Mohsin Naqvi could not be challenged as the process has passed all codal formalities starting from the leader of the opposition to the ECP.\nThe matter in KP, he said was resolved with consensus, however, in Punjab no agreement was met so the case was resolved by the ECP as per the procedure. “If they challenge it in the court then it’s a legal battle and will be contested as per the law by the coalition government.”\nThey tried on roads starting from 2.5 mln and came to 25k people then what next he must call for 2500.",
  "retrievedAt": "2025-08-11T05:48:13.232Z"
}
