{
  "title": "Establishing ‘Wildlife Conservation Centre’ imparts hope for Islamabad Zoo’s revival",
  "link": "https://www.app.com.pk/national/establishing-wildlife-conservation-centre-imparts-hope-for-islamabad-zoos-revival/",
  "date_published": "2023-01-23T14:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): The Islamabad Zoo has finally received an allocation of Rs 500 million to resurrect a “most-modern” ‘Wildlife Conservation and Information Centre’. The said amount is being earmarked for the Public Sector Development Programme (PSDP 2022-23).\nThe present government was very keen on reviving the Islamabad Zoo as a constructive wildlife rehabilitation facility and a wild species learning centre where experts, students and the general public could learn more about the indigenous species of the Margalla Hills National Park (MHNP).\nThe National Park has become a repository of the endangered common Asian leopards and pangolins, the most trafficked anteater, Chairperson, of Islamabad Wildlife Management Board (IWMB) Rina Saeed Khan told APP while sharing her insights on the issue.\nShe added that the Zoo was made non-operational after the judgement of former Chief Justice Islamabad High Court Justice Athar Minallah due to poor management of the wildlife including the Asian Male Elephant Kaavan.\nKhan said the blueprint for the Wildlife Centre was ready, designed by famous architect Raza Ali Dada who had created the conceptual design of the Centre.\nShe noted that the major issue of land was resolved as the 25-acre piece of land was given to the IWMB by the Capital Development Authority (CDA) and the no objection certificate (NOC) was issued. “All codal formalities have been met and only the federal cabinet’s ratification is left which will be fulfilled soon,” she added.\nThe initial concept paper or PC-I was submitted and the nomenclature for the institution was proposed as “Margalla Wildlife Centre”, the Chairperson said.\nRina Saeed Khan informed that many international non-governmental organisations (INGOs) working on wildlife protection such as ‘Free The Wild’ and others were interested in future collaborations with the IWMB, particularly to enhance capacity for the rescue centre.\nShe said the Board has rescued and rehabilitated many black bears and there was also need to work out for their future.\n“The Ministry is working under and with the Ministry of Climate Change,” she added.\nThe wildlife centre as proposed by the ministry would possess advanced technological solutions to provide wildlife information to its visitors. It would become the first with virtual reality and bring ‘visitors closer than ever before to animals.’\n“High-tech movies and documentaries will be played and a virtual show will be arranged on a daily basis while a part of the land will also be used to keep rescued animals. Visual gallery and 3D shows will be arranged to apprise the public about the wildlife and the need to preserve their freedom,” she said.\nA period of nearly one and half months has been set to start the construction work on the revival effort of the Islamabad Zoo.\nChairperson IWMB Rina Saeed said that two-third of the land would have entertainment area for the citizens, whereas one-third of the land would be used to establish a rescue and rehabilitation center at the zoo. This rescue center will also be the first of its kind to bring rescued animals from all over Pakistan and provide them with medical care.",
  "retrievedAt": "2025-08-11T05:48:03.375Z"
}
