{
  "title": "July 13, 1931, will always be remembered in history as a dark day: Pervez Ashraf",
  "link": "https://www.app.com.pk/national/july-13-1931-will-always-be-remembered-in-history-as-a-dark-day-pervez-ashraf/",
  "date_published": "2022-07-12T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Speaker National Assembly Raja Pervez Ashraf and Deputy Speaker Zahid Akram Durrani have said that the people of Occupied Kashmir have made eternal sacrifices for the sake of independence.\nThey said that the blood of unarmed Kashmiris who were martyred by the Indian forces would not go in vain and the day was not far when the people of Kashmir would see the dawn of freedom in occupied Kashmir through their struggle for their right to self-determination, said a news release issued here on Tuesday.\nThey said that the Kashmir issue is an unfinished agenda of partition of the subcontinent without which lasting peace in South Asia is impossible. They expressed these views in their separate messages on the occasion of Kashmir Martyrs’ Day which is observed on 13th July every year.\nOn this occasion, the Speaker said that the day reminds us of a great tragedy in the history of Kashmir when the army of Dogra Maharaja martyred 22 protesters due to the recitation of Adhan.\nHe said that the blood of innocent Kashmiris who were martyred by the forces of Dogra Maharaja on July 13th, 1931 would never go in vain.\nThe Speaker further said that thousands of innocent children have been martyred in Occupied Kashmir for the last 75 years and thousands of incidents of desecration and rape of women have taken place.\nHe said that the hands of the so-called democratic government of India were stained with the blood of thousands of Kashmiri martyrs.\nHe urged the international community to take stern notice of the atrocities perpetrated by India in Kashmir and play its role in ending the ongoing human rights violations in occupied Kashmir.\nSpeaker Raja Pervez Ashraf said that the resolution of the Kashmir issue was essential for the establishment of lasting peace in the region. He called on the United Nations to play its role in finding a peaceful solution to the Kashmir issue in accordance with Security Council resolutions.\nReiterating Pakistan’s principled stand for the struggle of the Kashmiri people for independence, the Speaker said that Pakistan would continue to provide moral, political, and diplomatic support to the Kashmiri people in their struggle for self-determination at every forum.\nHe said that the present Parliament has passed several resolutions to resolve the Kashmir issue in accordance with the UN Security Council resolutions and to stop the atrocities committed by Indian forces in the Occupied Territories.\nHe said that the forcible occupation of Kashmir by India was against the moral values of a civilized society and the basic right of the people to self-determination.\nOn this occasion, Deputy Speaker Zahid Akram Durrani said that today is a reminder of the brutality of Dogra Maharaja’s forces when they martyred 22 Kashmiri soldiers on July 13, 1931, for giving the call to prayer. He said that the blood of the martyrs of July 13, 1931, would never go in vain.\nHe also expressed confidence that the Kashmiri people would soon see the dawn of independence and have a chance to breathe freely.\nThe Deputy Speaker said that the Government and people of Pakistan have always stood by their Kashmiri brothers and sisters and would continue their moral, political and diplomatic support.\nHe urged the international community to take stern notice of the atrocities perpetrated by India in Kashmir.",
  "retrievedAt": "2025-08-11T15:14:12.105Z"
}
