{
  "title": "Political parties asked to file assets’ statement till Aug 29",
  "link": "https://www.app.com.pk/national/political-parties-asked-to-file-assets-statement-till-aug-29/",
  "date_published": "2022-07-12T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): The Election Commission of Pakistan (ECP) has asked the political parties to file their statement of accounts for financial year 2021-22 before August 29.\nAccording to ECP spokesman, Political parties were required in terms of section 210 of the Elections Act, 2017 read with Section 204 of the Act ibid and rule 159 & 160 of the Election Rules, 2017, thereof, that they were required to file with ECP their statement of accounts for financial year, ended on June 30.\nIt may be recalled that Section 210 of the Elections Act, 2017 provides that a political party shall, in such a manner as may be prescribed, submit to the Commission, within sixty days from the close of a financial year, a consolidated statement of its accounts audited by a chartered accountant on Form-D containing: (a) Annual income and expenses; (b) Sources of its funds; and (c) Assets and liabilities.\nThe statement to be submitted to the ECP shall accompany the report of a chartered accountant with regard to the audit of accounts of a political party and a certificate signed by an office-bearer authorised by the party head stating that: (a) No funds from any source prohibited under the Elections Act, 2017 were received by the political party; and (b) The statement contains an accurate financial position of the political party. The statement of accounts is to be submitted on Form-D as provided in the Elections Act, 2017.\nPrinted Forms were available, free of cost, in the Election Commission Secretariat, Islamabad and in the offices of the provincial election commissioners, Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan. Form-D/Proforma for source of funds were also available on ECP’s Website. Overwriting should be avoided. The membership / certificate issued by ICAP in respect of Auditor engaged shall be annexed to the Form-D along with last valid renewal certificate.\nThe Form-D shall also accompany a legible copy of each of the bank statements for the period of 01.07.2021 to 30.06.2022 of the party, along with a bank reconciliation statement. The statement shall be addressed to the Secretary, Election Commission of Pakistan, Constitution Avenue, G-5/2, Islamabad and shall be delivered through an office bearer of the party, duly authorised by the party head in terms of rule 156 of the Election Rules, 2017. Statements received through post, fax, courier service or any other mode shall not be accepted.",
  "retrievedAt": "2025-08-11T15:14:14.799Z"
}
