{
  "title": "Malaysia underscored the importance of localizing SDG",
  "link": "https://www.app.com.pk/national/malaysia-underscored-the-importance-of-localizing-sdg/",
  "date_published": "2022-07-12T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): The Ministry of Foreign Affairs and the Economic Planning Unit in collaboration with the All-Party Parliamentary Group Malaysia for Sustainable Development Goals (APPGM-SDG) co-organized a side event entitled “Building Back Better in Localising SDGs”.\nA Case Study of Malaysia and Three Southeast Asian Country Experiences of the Partnership Model” at the margins of the 2022 High-Level Political Forum on Sustainable Development (HLPF) at the United Nations Headquarters in New York, said a news release issued by the Malaysia embassy in Pakistan here on Tuesday.\nThe side event, which was held in a virtual format, highlighted Malaysia’s experience, as well as three other Southeast Asian countries namely, Indonesia, the Philippines and Thailand, on the achievements and challenges in localizing SDGs.\nMinister in the Prime Minister’s Department (Economy), YB Dato’ Sri Mustapa Mohamed in his welcoming remarks recognised the importance of localizing Sustainable Development Goals (SDGs) in the achievement of the 2030 Agenda for Sustainable Development (2030 Agenda).\nAs the world worked to recover from the impacts of the COVID-19 pandemic, Dato’ Sri Mustapa Mohamed highlighted the urgent need for countries to work together and enhance their commitment to implement the SDGs.\nHe commended the role of the APPGM-SDG and the Malaysia CSO SDG Alliance in forging stronger collaboration between Parliamentarians, state and local governments, as well as local communities in implementing 121 local solution projects in 30 parliamentary constituencies.\nPanellists speaking at the event shared experiences, priorities and lessons learned from the implementation of the SDGs at the local level. They also shared respective national implementation efforts, challenges and good practices in the course of achieving the 2030 Agenda.\nMinister of Foreign Affairs Malaysia, Dato’ Sri Saifuddin Abdullah, in his closing remarks, stressed the importance of joint action by all stakeholders including government, the private sector and civil society; in addressing poverty and inequality, climate change, gender-based discrimination, ethnicity or class with a strong inclusive agenda especially, when reaching out to the most vulnerable communities in localizing SDGs.\nThe HLPF is the main United Nations platform on sustainable development and it has a central role in the follow-up and review of the 2030 Agenda and the SDGs at the global level. Localization of the SDGs refers to the process of defining, implementing, and monitoring strategies at the local level to achieve the global, national, and subnational goals of the 2030 Agenda.",
  "retrievedAt": "2025-08-11T15:14:12.126Z"
}
