{
  "title": "All set to commemorate supreme sacrifices of lives by valiant sons of the soil",
  "link": "https://www.app.com.pk/national/all-set-to-commemorate-supreme-sacrifices-of-lives-by-valiant-sons-of-the-soil-2/",
  "date_published": "2022-07-12T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Special congregations will pay rich tributes to the Kashmiri martyrs at both sides of the LoC on Wednesday, July 13, in remembrance of valiant 22 sons of soil for laying down the supreme sacrifices of their precious lives 92 years ago this day (July 13) in 1931 in front of Central Jail in today’s’ occupied Srinagar.\nJammu Kashmir people living both sides of the Line of control including AJK and IIOJK, besides rest of the world are all set to observe the 92nd Kashmir Martyrs Day on Wednesday, July 13, with the renewal of the pledge to continue the grand mission of the Kashmiri martyrs through continuing the freedom struggle, with full vigor, for the achievement of the birth right of self determination and for the liberation of occupied Jammu & Kashmir from the tyrannical Indian rule.\nSymposium and meetings will be the hallmark of the Kashmir Martyrs Day across Azad Jammu & Kashmir as well as at various places in the bleeding Indian occupied Kashmir valley and rest of the world to observe the day with due solemnity and reverence to remember the Supreme sacrifices of the valiant sons of the soil.\nIt was on this day in 1931 when the Dogra troops had shot dead 22 Kashmiris in front of the Central Jail Srinagar.\nA large number of people had gathered outside the jail protesting against the trial of a young man – Abdul Qadeer for treason inside the prison.\nIn Azad Jammu Kashmir, it was a state holiday to facilitate the people to participate in the events of the day from all over the liberated territory.\nThis year too, the Kashmir Martyrs Day will be flanked by a sign of a new hope, that if India agrees to the ground realities without any reservations and learns a lesson from the historical facts that New Delhi cannot rule Kashmiris by force, may help bring a lasting peace and prosperity in the region through the early peaceful settlement of the Kashmir issue in line with the aspirations of the people of entire Jammu & Kashmir.\nIn AJK people from all walks of life will manage special prayer meetings besides staging rallies and seminars to pay rich tributes to Kashmiri martyrs were held at various places in AJK to mark the day.\nSpecial Kashmir Martyrs Day meetings will be hosted at all the district and tehsil head quarters including Mirpur, Muzaffarabad, Kotli, Bagh, Rawalakot, Sudhanoti, Neelam valley, Haveili, Hattiyan and Bhimbher and all other small and major towns and cities under the spirit of various social, political and religious Kashmiri outfits besides the civil society belonging to all spheres of life including the business community, lawyers and the media groups in various parts of the state.",
  "retrievedAt": "2025-08-11T15:14:08.630Z"
}
