{
  "title": "NDMA alerts departments amid vigorous monsoon, torrential rains across country",
  "link": "https://www.app.com.pk/national/ndma-alerts-departments-amid-vigorous-monsoon-torrential-rains-across-country/",
  "date_published": "2022-07-12T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP):The National Disaster Management Authority (NDMA) on Tuesday issued advisory to the provincial and federal departments to stay vigilant and alert amid fresh weather forecast of vigorous monsoon and torrential rains.\nThe press release said that as per fresh forecast by Pakistan Meteorological Department (PMD) monsoon currents were penetrating upper and central parts of the country and another strong Monsoon Low Pressure Area system was likely approaching Sindh, which was forecast to continue from July 13 to July 17 and to cause more heavy rains.\nThe NDMA has issued instructions to the concerned federal ministries, departments, respective provincial governments, their line departments including press information departments (PIDs),\nprovincial, Gilgit Baltistan and State disaster management authorities PDMAs, GBDMA and SDMA respectively, district administrations and DDMAs, municipal administrations and major metropolis to remain watchful and take all necessary precautionary measures to deal with any untoward situation.\nThe departments were also directed to ensure pre-placement of emergency equipment including de-watering pumps and availability of emergency personnel to respond to any emergency especially in case of any blockage, road closure and damage, it said.\nIt also directed to ensure timely evacuation of population from low-lying and flood prone areas as per evacuation plans and make certain availability of shelter, food and medicines in relief camps.\nThe NDMA further urged the relevant authorities and departments to conduct mass public awareness and alert population about possible risks associated with the monsoon rains and avoid unnecessary travelling during the said period.\nThe provincial authorities were also directed to instruct law enforcement agencies along with traffic police to guide travelers and tourists regarding likely situations and dangers of waterlogged areas and underpasses and avoid unnecessary travel and movement.",
  "retrievedAt": "2025-08-11T15:14:12.062Z"
}
