{
  "article_id": "2025-05-12_c6fe962ca80f4cb324de1ac7dff5e52a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-rubina-khalid-stresses-urgency-of-launching-new-digital-payment-system-in-seven-districts/",
    "retrieved_at": "2025-08-27T15:22:00.951Z"
  },
  "metadata": {
    "title": "Senator Rubina Khalid stresses urgency of launching new digital payment system in seven districts",
    "author": null,
    "date_published": "2025-05-12T18:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 263,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 12 (APP): In a significant move towards enhancing digital financial inclusion, Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid emphasized expediting the rollout of a new digital payment system through RAAST in seven selected districts across the country. She stated this while chairing a high-level meeting at BISP Headquarters with Karandaaz Chief Digital Officer, Mr. Sharjeel Murtaza on Monday. The meeting centered on accelerating the pilot phase of the project, which is aimed at improving the transparency, efficiency, and security of cash disbursements to BISP beneficiaries. \"Mobility and biometric verification of beneficiaries is essential and cannot be compromised,\" said Senator Rubina Khalid. \"We aim to make the lives of our 10 million beneficiaries easier. We must adopt a proactive approach to ensure a timely and smooth rollout.\" Mr Murtaza assured BISP leadership of Karandaaz's full commitment to the project, noting that the pilot is being implemented in close collaboration with BISP. \"Pilot projects are critical to achieving scale, and we are making every possible effort to ensure its success,\" he said. The meeting also discussed the potential introduction of mobile wallet payments on a pilot basis in selected low-workload areas, aimed at testing the feasibility and impact of the new payment channel. Key officials, including Mr. Zohaib and Mr. Umar from Karandaaz and BISP's DG Conditional Transfers, Mr. Inam ur Rahman Malik, shared strategic insights and operational plans to support the rollout. It was agreed that additional stakeholders would be brought on board in subsequent meetings to further streamline the process and ensure broader success of the digital transformation initiative.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}