{
  "article_id": "2025-05-12_ee8c5d60a13aa0dc5cfc080c2f6b8528",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kmu-ipdm-organize-successful-dental-awareness-camp/",
    "retrieved_at": "2025-08-27T15:23:45.779Z"
  },
  "metadata": {
    "title": "KMU-IPDM organize successful dental awareness camp",
    "author": null,
    "date_published": "2025-05-12T10:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 280,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, May 12 (APP):Khyber Medical University (KMU), Institute of Pathology and Diagnostic Medicine (IPDM), successfully organized a Dental Awareness Camp aimed at providing free dental checkups and promoting awareness about oral and dental health among university students, faculty, and staff. The camp was spearheaded by Dr. Benish Aleem, Head of the Oral Pathology Department, who encouraged enthusiastic participation from students, teachers, staff, and members of the local community. Under the supervision of expert doctors, free dental checkups were conducted, accompanied by interactive sessions on oral hygiene education and dental care. A dedicated team of experienced dental professionals, faculty members, and student volunteers offered expert consultations on dental examinations, diagnosis, and essential treatments, emphasizing the importance of maintaining good oral health. Speakers from Colgate and ClearPath Orthodontics Pakistan delivered insightful talks on dental hygiene practices and modern treatment options. An interactive Q&A session provided attendees with the opportunity to engage directly with dental experts, enhancing their understanding of oral care. Distinguished university leaders including Prof. Dr. Rubina Nazli (Dean, Basic Medical Sciences), Prof. Dr. Inayat Shah (Director, IBMS), Prof. Dr. Yasir Yousafzai (Director, IPDM), and Dr. Ehsan Ullah (Head of Microbiology, IPDM) praised the initiative and highlighted its importance in promoting public health. The free dental checkups were conducted inside a mobile dental clinic set up by ClearPath Orthodontics on the university campus, where over 600 individuals were examined. Colgate Pakistan distributed free dental hygiene kits to all participants. Meanwhile, KMU Vice Chancellor Prof. Dr. Zia ul Haq appreciated the efforts of the organizing team, particularly Dr. Benish Aleem, and thanked the sponsors. He reaffirmed the university's commitment to promoting healthy living and responsible oral care through continued community engagement initiatives.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}