{
  "article_id": "2025-05-12_2e3d56d68e74865208a42698c3f421f1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-missile-attacks-forced-india-to-bow-down/",
    "retrieved_at": "2025-08-27T15:24:05.874Z"
  },
  "metadata": {
    "title": "‘Pakistan’s missile attacks forced India to bow down’",
    "author": null,
    "date_published": "2025-05-12T08:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "HYDERABAD, May 12 (APP):Chairman Sindhi Adabi Board, Makhdoom Saeed-ul-Zaman said that after launching operation Bunyan-un-Marsoos Pakistan's missile attacks forced India to bow down. In a statement, he said that Pakistani armed forces have won a decisive victory over the enemy with the help of their bravery, comprehensive strategy and modern technology. Makhdoom said that as a result of \"Operation Banyan Al-Marsoos\", key air and military bases of India have been completely destroyed, while the latest Rafale fighter jet of the enemy was also shotdown in the air during the aerial encounter. This operation was a necessary step for national security, peace of the region and to face the increasing aggression of the enemy, in which the brave soldiers and air experts of the Pakistan Army responded to the enemy face to face with their efficiency. Makhdoom Saeed-ul-Zaman \"Aatif\" further said that as a result of our military leadership and determination, technical skills and sacrifices of our soldiers, the enemy has suffered a terrible loss. The destruction of Rafale jets proves that Pakistan's air capability is not low in any way. Saeed u Zaman further said that We are always ready to protect our borders, freedom and dignity of the nation. as the bravery, strategy and strong morale of Pakistan Army today is an example not only for Pakistan, but for the entire Islamic world. He said that the children of Palestine were being trampled in blood, innocent Muslims were being martyred, now the time for silence is over. The action of Pakistan Army gives the message that if there is will, faith and courage, no enemy will be able to escape defeat. As the leader of world peace, justice and human rights, Pakistan invites the Muslim countries for unity, courage and action so that they too raise their voices against oppression and take practical steps.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}