{
  "title": "Govt earmarks Rs. 60 bln for higher education in PSDP 2024-25",
  "link": "https://www.app.com.pk/national/govt-earmarks-rs-60-bln-for-higher-education-in-psdp-2024-25/",
  "date_published": "2024-06-12T18:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The Federal Government has allocated Rs. 60,000 million under the Public Sector Development Programme (PSDP) for the 141 ongoing and 19 new schemes of the Higher Education Commission (HEC) during the fiscal year 2024-25.\nAccording to the budget document issued here on Wednesday, around Rs.41,871.792 million has been earmarked for the ongoing schemes and Rs 18,128.208 million for the new schemes.\nAmong the ongoing schemes, an amount of Rs. 900 million is allocated for Award of Allama Muhammad Iqbal 3000 scholarships to Afghan students (Prime Minister’s Directive), while Rs 450 million have been reserved Construction of Academic Block, Shaheed Zulfiqar Ali Bhutto Medical University (SZABMU), Islamabad (Revised).\nSimilarly, Rs 400 million each allocated for development of Main Campus, Bacha Khan University, Charsadda and development of National University of Medical Sciences (NUMS), Rawalpindi (Revised).\nFurthermore, Rs 400 million have been reserved for establishment of Campus of Government College University, Faisalabad at District Chiniot (to be revised), Rs 500 million for establishment of Kamyab Jawan Sports Academies (High Performance & Resource Centers) and Youth Olympics – HEC, Rs 500 million for establishment of University of\nBaltistan at Skardu – (Revised).\nAn amount of Rs 759 million has also been allocated for Fulbright Scholarship Support Program HEC-USAID (Phase-III), while Rs 3890 million are reserved for Overseas Scholarship for MS/M.Phil leading to Ph.D. in selected fields (Phase III) – HEC (Revised), Rs 3000 million allocated for Ph.D Scholarship Program under Pak-US Knowledge Corridor (Phase-I)-(Revised). It is worth mentioning here that Rs 100 million have been allocated for establishment of Institute of Sports.\nAmong new schemes, the government has allocated Rs. 10,000 million for Higher Education Development Programme of Pakistan (HEDP)-(Revised), while Rs 6000 million are allocated for Prime Minister’s Laptop Scheme.\nSimilarly, Rs 30 million for PM’s Youth Internship Program, Rs 100 million for establishment of Manufacturing Technology, Automation and Innovation Center.",
  "retrievedAt": "2025-08-11T03:12:15.597Z"
}
