{
  "title": "PM orders building Health Tower in Islamabad to house hospitals, medical, nursing universities",
  "link": "https://www.app.com.pk/national/pm-orders-building-health-tower-in-islamabad-to-house-hospitals-medical-nursing-universities/",
  "date_published": "2024-06-12T05:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Prime Minister Shehbaz Sharif on Wednesday directed the authorities concerned to build a health tower of international standard in the federal capital to house hospitals, medical and nursing universities, modern laboratories, and diagnostics centers.\nThe prime minister, chairing a meeting to review the matters related to the Ministry of National Health Services, instructed to formulate a strategy to build the said tower through the public-private partnership.\nHighlighting the significant responsibilities of the health sector to save human lives, the prime minister expressed his concerns about the reported new polio cases in the country and resolved the elimination of the disease by utilising all-out- resources in collaboration with partners.\nHe also called for carrying out the third-party audit of the laboratories working under the purview of the Ministry of National Health Services, besides appointing well-qualified health professionals in the ministry and its allied departments.\nVowing to personally monitor health-related matters, Prime Minister Shehbaz also ordered the third-party audit of the Drug Regulatory Authority of Pakistan and the formulation of a strategy to bifurcate the drug processing from the Authority.\nBesides, he also instructed outsourcing the human resource of all government hospitals in Islamabad and their waste treatment plants, besides the audit of countrywide nursing schools and colleges.\nDuring the briefing, the prime minister was told that a National Blood Transfusion and Blood Products Policy would be introduced soon, and work on a nursing and midwifery policy framework was in the final stage.\nIt was told that an evening shift was being introduced in the nursing colleges to increase the number of graduates. Moreover, work on a revised National Action Plan 2025-30 has been started to control the population growth.\nAs the prime minister was told about the installation of new health equipment worth Rs 711 million in Islamabad’s hospitals, he instructed the third-party audit of the purchase of the said equipment.\nIt was informed that a modern hospital management system would be installed in Islambad’s hospitals and that waste management plants were operating in the capital city’s five public and four private sector hospitals.\nThe participants of the meeting were told that a strategy for insulin manufacturing in the country was being formulated.\nThe prime minister was also apprised of the plans to produce different types of vaccines in the country, building plasma fractionation centers and pharma park, and provision of machinery and equipment to Quetta’s tertiary care hospitals.\nIt was told that a 50-bed hospital would be set up in Musakhel, a tertiary care and Teshil headquarters hospital in Azad Jammu and Kashmir, and an Institute of Medical Sciences and Daanish Hospital in Gilgit Baltistan.\nFederal ministers Ahsan Iqbal and Ahad Khan Cheema, PM’s Coordinators Malik Mukhtar Ahmed and Rana Ehsan Afzal, and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T03:12:41.393Z"
}
