{
  "title": "Ziaullah Langua hails EU, UN for supporting Rule of Law Sector",
  "link": "https://www.app.com.pk/national/ziaullah-langua-hails-eu-un-for-supporting-rule-of-law-sector/",
  "date_published": "2024-06-12T17:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP):In his concluding remarks at the 7th Steering Committee meeting of the European Union-funded ‘Deliver Justice Project’, Balochistan Home Minister,  Ziaullah Langua, hailed the European Union and UN partners for supporting the Government’s rule of law reform agenda.\nHe further said, “It is a journey that we all look forward to as we take the work under the new Rule of Law Roadmap to the next level to realize our vision of a people centered rule of law in Balochistan,” said a UNODC press release issued here.\nHe also appreciated the Police, Levies, Prosecution, Probation and Parole, and Prisons for their commendable work by improving their legal and operational capacities.\nChairing the 7th Project Steering Committee meeting, Additional Chief Secretary (Home), Government of Balochistan, Zahid Saleem, congratulated all partners for their longstanding collaboration with UNODC and other UN agencies, particularly UN Women and UNDP.\nHe praised their institutional support by emphasizing the importance of achieving desired results while aligning ongoing efforts on legislative, police, prison, and women-focused reforms. Additionally, he highlighted the importance of citizen-centered and evidence-based rule of law initiatives.\nDuring the meeting, key stakeholders reaffirmed their commitment to advancing evidence-based reforms in the rule of law sector to enhance public trust and confidence in law enforcement institutions in Balochistan. The Rule of Law Roadmap was initially approved for four years (2018–2022) and expired in May 2022.\nA recent evaluation informed a revised RoLR for another four years (2023–2026) to consolidate, sustain, scale up, and institutionalize good practices and data-informed approaches in the justice sector of Balochistan.\nHighlighting the need for Government’s ownership and provision of matching resources for effective implementation of the Rule of Law Roadmap, Mr. Jeroen Willems, Head of Cooperation, EU Delegation to Pakistan stated that revalidated Rule of Law Roadmap 2023-2026 was pivotal in advancing justice, peace, and security, particularly for women and girls.\nHe also said that data-centric, results-based approaches remained the backbone of the roadmap, serving as a tool to monitor progress and make timely decisions, while citizen-centric interventions aimed to enhance public trust in the justice system.\nDr. Jeremy Milsom, Representative, UNODC Country Office, thanked the Government of Balochistan for their vision and commitment and facilitating the revalidation and approval of the revised Roadmap.\nHe also emphasized the need for institutional leadership to embrace evidence-based approaches to improve performance, noting the effectiveness of such methodologies in order to measure institutional performance and implementing robust reforms. Additionally, Dr. Milsom expressed gratitude to the European Union for their continued support in enhancing the rule of law and transforming the Balochistan rule of law sector into a citizen-friendly and demand-driven.\nMr. Arsalan Malik, Criminal Justice and Reforms Advisor from the UNODC Country Office in Pakistan, presented project updates and the 2024 work plan.\nHe commended the Government of Balochistan’s commitment, as evidenced by the adoption of PC-1 and the initiation of the second phase of reforms through the endorsement of the Action Plan 2024–26.\nHe stated that with EU support, the partners are well-positioned to further enhance the capacity of criminal justice actors in Balochistan.\nRepresentatives from the Balochistan Police, Prosecution, Prisons, Levies, and Reclamation and Probation Departments presented their progress against provincial RoL targets. They shared the challenges and successes of\ncriminal justice institutions in addressing fundamental issues through sector coordination. The way forward for the implementation of the RoLR was also discussed and agreed upon.\nThe milestones achieved under the roadmap include, but are not limited to, capacity building and the establishment of facilitation centers such as the Women and Juvenile Facilitation Centre (WJFC), Smart Police Stations, Serious Crime Investigation Wing (SCIW) with gender facilitation desks, etc.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:12:41.047Z"
}
