{
  "title": "Chairman WAPDA reviews inspection of Neelum Jhelum Project’s Head Race Tunnel’",
  "link": "https://www.app.com.pk/national/chairman-wapda-reviews-inspection-of-neelum-jhelum-projects-head-race-tunnel/",
  "date_published": "2024-06-12T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Chairman WAPDA Engr Lt Gen Sajjad Ghani (Retd) Wednesday visited Neelum Jhelum Hydropower Project to review ongoing inspection of the Head Race Tunnel.\nHe reached Dam (Weir) site of the Project located at Nauseri, Azad Jammu & Kashmir, said a press release issued here.\nThe Chairman visited in detail the de-watered head race tunnel to inspect and review damages that might have occurred to the tunnel.\nHe was accompanied by Project Manager, Neelum Jhelum Consultants James Stevenson. The Consultants, the Contractors and the Project Team briefed the Chairman about the progress achieved so far.\nIt was briefed that de-watering of 48-Km long head race tunnel had been completed from the elevation of 1012 feet to 607 feet above mean sea level.\nSubsequently, inspection of the head race tunnel has commenced. The process for engaging International Experts had also been initiated, as directed by the Prime Minister during his visit to the Project last month.\nThe International Experts would ascertain the causes of fault in the headrace tunnel and make recommendations for carrying out the remedial works.\nSpeaking on the occasion, the Chairman directed the Project Management to chalk out a comprehensive rehabilitation strategy once the detailed inspection of the headrace tunnel was done and the recommendations were made by the International Experts. He emphasized upon the team to adhere to all precautionary measures while carrying out inspection of the headrace tunnel.\nIt is pertinent to mention here that Neelum Jhelum Hydropower Project was constructed in a weak geological and seismic-prone area. Decrease in headrace tunnel pressure led to suspension of electricity generation from the project last month.\nPrior to its suspension, the Project had provided more than 20 billion units of clean and green electricity to the National Grid since 2018.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:14:09.148Z"
}
