{
  "title": "PRCS empowers flood-affected families with livelihood assistance through Loader Rickshaw distribution",
  "link": "https://www.app.com.pk/national/prcs-empowers-flood-affected-families-with-livelihood-assistance-through-loader-rickshaw-distribution/",
  "date_published": "2024-06-12T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP):Under the leadership of Chairman Sardar Shahid Ahmed Laghari, the Pakistan Red Crescent Society (PRCS), in collaboration with the International Federation of the Red Cross and Red Crescent Societies (IFRC), on Wednesday has successfully distributed 210 loader rickshaws among the families affected by the monsoon floods of 2022. This initiative is crucial part of PRCS’s Livelihood Assistance Program during the Recovery Phase.\nThe loader rickshaws have been allocated to deserving families in five districts of Sindh province, including Dadu, Khairpur, Shikarpur, Larkana, and Qambar Shahdadkot, with each district receiving 35 rickshaws. Additionally, 35 loader rickshaws were distributed in Jaffarabad district of Balochistan. The distribution of loader rickshaws in Punjab and Khyber Pakhtunkhwa will take place after Eid-al-Adha. This initiative aims to strengthen the affected communities by providing a source of income. It is part of PRCS’s ongoing efforts to empower communities to regain their livelihoods and move towards a brighter future.\nThe distribution ceremonies were attended by Secretary General PRCS, Muhammad Abaidullah Khan, Dr. Asfar Shams, Health Coordinator, IFRC Country Delegation Pakistan, officials from the provincial and district branches of PRCS and IFRC Country Delegation, volunteers, community members and local notables.\nChairman PRCS Sardar Shahid Ahmed Laghari praised the relentless dedication of PRCS staff and volunteers, who continue to provide crucial support to flood-affected communities. He emphasized PRCS’s steadfast commitment to restoring normalcy through multifaceted programs, including livelihood assistance, shelter construction, cash assistance, and health and hygiene initiatives.\n“We remain dedicated to our mission of serving humanity and stand ready to support communities in their journey towards recovery and resilience,” Chairman Laghari stated. “Our efforts are ongoing, and with the support of our partners and the tireless work of our team, we are making significant strides in helping communities rebuild their lives.”\nAccording to Piwi Ophoff, Head of Country Delegation, IFRC Pakistan, “IFRC is supporting PRCS in the implementation of the Flood Recovery Programme, through which, as one of the livelihood activities, the distribution of loader carts among the flood-affected communities will help them recover from the impacts of the 2022 floods, which affected their livelihoods. They will be able to earn a decent living and support their families. The beneficiaries of this initiative have been identified after necessary due diligence, so that only the most vulnerable communities receive it.”\nWith the support of Red Cross and Red Crescent Movement partners, PRCS continues its tireless efforts to aid flood-affected populations, ensuring sustainable and effective recovery interventions. Previously, PRCS distributed buffaloes to flood-affected communities in the aforementioned districts as part of its livelihood program.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:13:37.404Z"
}
