{
  "title": "Govt allocates Rs 500 mln for Hajj Complex Lahore",
  "link": "https://www.app.com.pk/national/govt-allocates-rs-500-mln-for-hajj-complex-lahore/",
  "date_published": "2024-06-12T18:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 12 (APP): The federal government has allocated Rs 500 million for the ongoing project of the Ministry of Religious Affairs and Interfaith Harmony, focusing on the construction of the Hajj Complex Lahore under the Public Sector Development Programme (PSDP) for the fiscal year 2024-25.\nThe allocation was detailed in the budgetary document released on Wednesday, underscoring the government’s commitment to improving facilities for religious activities and pilgrimages.\nThe Hajj Complex Lahore is poised to become a crucial hub for pilgrims, providing essential services and accommodations for those embarking on the sacred journey to the Kingdom of Saudi Arabia.\nThe Ministry of Religious Affairs and Interfaith Harmony has emphasized the importance of this complex in facilitating the Hajj process. The new infrastructure is expected to streamline various logistical aspects of the pilgrimage, ensuring a smoother and more comfortable experience for the pilgrims.\nThe Hajj Complex would feature state-of-the-art facilities, including administrative offices, residential accommodations, and training centers. These amenities are designed to equip pilgrims with necessary information and support, enhancing their overall Hajj experience. Additionally, the complex would serve as a central point for coordination and management, further improving the efficiency of Hajj operations.\nLocal religious leaders and community members have welcomed this announcement, expressing optimism about the positive impact of the Hajj Complex. They believed that this development would not only benefit the pilgrims but also contribute to the socio-economic growth of the region by creating job opportunities and attracting visitors.",
  "retrievedAt": "2025-08-11T03:12:14.160Z"
}
