{
  "title": "Budget 2024-25: No duty increase on import of essential items",
  "link": "https://www.app.com.pk/national/budget-2024-25-no-duty-increase-on-import-of-essential-items/",
  "date_published": "2024-06-12T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The government has proposed several tax relief measures in the Federal Budget for the fiscal year 2024-25 such as no increase of duties on the import of essential items, providing relief to the common man, promoting and protecting domestic industry and enhancing import-substitution, promoting energy efficiency and conservation, incentivizing agriculture sector, besides encouraging exports.\nFollowing are the proposed Custom Relief Measures:\n-Exemption of ACD on raw materials of Fluids and Powders for use in Hemodialyzers.\n-Exemption of Customs duties on Bovine lipid extract surfactant.\nREVIEW OF REGULATORY (RD)REGIME:\n– Levy/increase of RD on certain items to encouraging local manufacturing.\n– Rationalization of RD on import of new and used vehicles.\n-Increase / levy of RD on flat rolled products of iron and non-alloy steel.\n-Withdrawal of exemption of RD on import of ground nuts and margarine imported by Food Confectionary.\n-Continuation of RD on import of Chloroparafins liquid.\n– Withdrawal of RD on import of Sliver cans and Lollipop sticks.\nREVIEW OF EXEMPTION REGIME:\n– Withdrawal of concession of customs duties on import of fresh & dry fruits.\n– Review exemption of duties on import of inputs for Home Appliances.\n– Withdrawal of concessions of duties on import of Hybrid Vehicles.\n– Reduction in concession of customs duties on import of Electric vehicles having value above US$ 50,000.\n– Incentives for manufacturing of Solar Panels and Allied Equipment.\n– Extension in scope of exemptions on import of machinery and equipment for farming and processing of Fish/Shrimp and Seafood.\nTARIFF RATIONALIZATION:\n-Increase of Customs duty on Import of Containers for Aerosol Products.\n-Rationalization of Customs duty on import of parts of submersible pumps.\n-Rationalization of Customs duties on import of Wheat, Sugar, HSD, LNG.\n-Streamlining the imports of Aviation Related Good.\n– Levy of Additional Customs Duty on localized auto parts to incentivize local manufacturing sector.\n– Creation of new PCT codes for Rice Flour, Night vision goggles, Blood Collection Tubes, Solar Cable, Tyre Tube Valves to facilitate trade.\nLEGISLATIVE CHANGES:\n-Definitions of “Nuclear Material” and “Radioactive Material” included, for implementation of National Nuclear Detection Architecture (NNDA) regime.\n-Establishment of Directorate General of National Targeting Centre (NTC), as a national single window of enforcement for all LEAs and Directorate General of Trade Based Money Laundering for cognizance of offences related to trade-based money laundering.\n-Officers of National Command Authority (NCA) and Pakistan Nuclear Regulatory Authority (PNRA) empowered to implement and enforce Customs Act.\n-Intelligence Bureau (lB) added in the list of Government agencies mandated to assist Customs in investigations.\n-Power for extension of detention period assigned to Additional Collector or Additional Director for smooth functioning.\n-Two new penal clauses are proposed to take cognizance of offences related to nuclear and radioactive material.\n-Rationalization of pitch of penalty for the importers seeking clearance of declared confiscated goods against payment of redemption fine.\n-Enhanced prescribed penalty against a police officer who having seized goods fails to deliver such goods to custom house.\n-Penalties enhanced to deter smugglers and miscreants from attacking Customs personnel, in view of recent attacks on Customs staff.\n-To deter the possibility of illegal removal and pilferage of smuggled goods liable to confiscation placed in the custody of owner, penal provision is proposed.\n-Changes are made with the objective of making the system more efficient by accelerating the disposal of pending cases in the Customs Appellate Tribunal.\n-Changes are made with a view to ensure that the cases are swiftly decided in the High Courts and also to meet the principles of natural justice and fair trial and Strengthening the provision of Alternate Dispute Resolution mechanism.",
  "retrievedAt": "2025-08-11T03:12:59.358Z"
}
