{
  "title": "Govt earmarks Rs 267,952 mln for various ongoing, new schemes of power sector",
  "link": "https://www.app.com.pk/national/govt-earmarks-rs-267952-mln-for-various-ongoing-new-schemes-of-power-sector/",
  "date_published": "2024-06-12T18:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The government has allocated an amount of Rs 267,952.773 million for various ongoing and new schemes of power sector in annual public sector development programme (PSDP) for year 2024-25.\nAccording to the budgetary document released here Wednesday, out of total allocation, a sum of Rs 113,760.301 million has been specified for ongoing schemes through PSDP, Rs 17,401 million for new schemes and Rs 136,791.472 million (own resources) for year 2024-25. Out of total allocation, the local component stands at Rs 135,564 million and foreign loan component is Rs 132,388.208 million during the said period.\nFor ongoing schemes, a sum of Rs 4500 million each has been earmarked for 220/132 Kv GIS substation Dhabiji and 220 Kv Haripur Substation, Rs 6,000 million for 220Kv Swabi Substation, Rs 6,500 million for 500 Kv Allama Iqbal Industrial City, Rs 1,424.360 million for electrification works at different valleys of district Chitral, Rs 4,536.225 million for 220 kV Quaid-e-Azam Apparel and Business Park Grid Station, Rs 38,000 million for installation of 2×600 MW Coal Fired Power Project GENCO-I (Jamshoro), Rs 3,808 million for Power Distribution Enhancement Investment Program-II, Rs 4,499 million electricity distribution efficiency improvement project (MEPCO), Rs 3,691.509 million for electricity distribution efficiency improvement project (HESCO) and Rs 2,600 million for 500 kV Matiari—Moro-Rahim Yar Khan.\nFor New Scheme, an amount of Rs 6,250 million has been earmarked for land acquisition for installation of 1200 MW solar power plant Layyah, Rs 4,500 million for electricity distribution improvement and Rs 6,000 million for installation of assets performance management system on 100 kV and 200 kV distribution transformers. Similarly, a sum of Rs 34,148.335 million has been specified for evacuation of power from Dasu HPP stage-1, Rs 16,801 million for evacuation of power from Suki Kinari, Kohala, Rs 2,200 million for evacuation of power from Tarbela 5th Extension, Rs 1,007 million for evacuation of power from wind power projects (Jhimpir), Rs 2,344 million for installation of pilot battery energy storage system, Rs 11,341 million for upgradation of NTDC telecommunication, Rs 6,600 million for 220 kV Dharki-Rahim Yar Khan, Rs 7,230 million for extension and augmentation of existing 500 kV and 220 kV grid stations, Rs 4,615.686 million for 500 KV Islamabad West, Rs 2,750 million for 220 kV Arifwala Substation and Rs 4,430.200 million for 500/220kV Sialkot Substation.",
  "retrievedAt": "2025-08-11T03:12:11.920Z"
}
