{
  "title": "Key experts urge Innovative Financing, Policy Reforms to derisk RE investments",
  "link": "https://www.app.com.pk/national/key-experts-urge-innovative-financing-policy-reforms-to-derisk-re-investments/",
  "date_published": "2024-06-12T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The key experts have urged the government to roll out innovative financing and policy reforms to derisk Renewable Energy (RE) investments at the Renewables First (RF), a leading think tank for energy and environment, pivotal event titled “Renewable Energy Finance Insights – Assessing Risks in a Changing Landscape” here on Wednesday.\nThis initiative aimed to bridge the gap between financial sector stakeholders and power sector policymakers, fostering a collaborative dialogue on critical issues, particularly the high cost of financing for solar and wind energy in Pakistan, a news release said.\nPakistan has made notable strides in utility-scale solar and wind projects; however, attracting further investments remains a significant challenge due to Pakistan’s risk profile and macroeconomic conditions.\nTo address these issues, Ahtasam Ahmad from Renewables First presented its latest study, “Capitalizing on Green: A Stocktake of Renewable Energy Finance for Pakistan.” The report maps the current state of renewable energy financing and highlights the obstacles that have kept the cost of capital high, thereby stalling progress in renewable energy investment. The event brought together regulators, lenders, investors, developers, advisors, and public sector representatives, creating a platform for collaborative discussions and potential de-risking measures.\nMr. Farid Ahmed Khan, CEO of Bank of Punjab highlighted the scarcity of capital market investors in renewable energy and encouraged both local and foreign entrepreneurs to invest in this sector. He pointed out the high-risk nature and resultant high costs that drive up prices, proposing solutions such as promoting Development Finance Institutions (DFIs) and increasing capital market participation in energy projects.\nShehzad Abdullah, Head of Investment Banking at JS Bank, reflected on the evolution of wind power financing since 2011, emphasizing the learning curve through successive generations of financing. He noted the pivot in market dynamics and highlighted the need for consistent policies and more engaging conversations to drive progress. Navid Goraya, Chief Investment Officer at Karandaaz, highlighted the need for exploring alternate mechanisms for financing renewable energy projects, presenting securitization as an avenue to free up liquidity for the financial sector.\nAli Khizar, head of BR research at Business Recorder, and Afia Malik, Senior Economist at PIDE, advocated for decentralization and the use of local currency in financing, respectively.\nDevelopers from China Three Gorges, Foundation Wind, and UEP stressed the importance of integrated planning, robust transmission infrastructure, and streamlined permitting and land acquisition processes to reduce the risk profile of renewable energy technologies.\nMr. Shah Jahan Mirza, Managing Director of PPIB emphasized the need for a concerted effort from all stakeholders to pave the way forward for sustainable energy solutions in Pakistan.\nThe discussants unanimously agreed that reviving the renewable energy finance space is crucial, and exploring alternate financing channels through innovative instruments and de-risking measures is imperative to unlock the sector’s potential.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:12:57.204Z"
}
