{
  "title": "Balochistan not ignored in federal budget; says CM Bugti",
  "link": "https://www.app.com.pk/national/balochistan-not-ignored-in-federal-budget-says-cm-bugti/",
  "date_published": "2024-06-12T15:55:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 12 (APP): Chief Minister of Balochistan, Mir Sarfaraz Bugti, stated that Balochistan was not overlooked in the federal budget. I presented Balochistan’s case at the federal level, provided suggestions, and ensured the inclusion of several schemes in the federal budget, he said on Wednesday\nBalochistan has always felt neglected in terms of allocation, but many projects for the province have been reinstated in the federal budget.\nChief Minister Mir Sarfaraz Bugti also mentioned that a decision has been made to introduce 67 reforms for all departments, including the food department. Since the wheat procurement issue is currently under judicial consideration, it would be inappropriate to comment on it.\nHe emphasized that he had always respected the courts and does not consider court summons to be a humiliation.\nHe reiterated that Balochistan was not ignored in the federal budget and highlighted that Balochistan’s case was presented with suggestions and the inclusion of many schemes.\nThe Chief Minister acknowledged that Balochistan has always had complaints about the lack of attention to its allocations, but many of its projects have been included again in the federal budget.\n“The provincial government is determined to prepare a people-friendly budget for Balochistan, focusing on education, health and student scholarships, he said adding that Efforts are being made to generate resources to increase Balochistan’s own revenue.\nMir Sarfaraz Bugti emphasized that restoring law and order in Quetta and across Balochistan was a priority of the incumbent government. Reforms are underway to eliminate street crime, and improvements are expected to be seen in the coming months, he hoped.",
  "retrievedAt": "2025-08-11T03:13:00.850Z"
}
