{
  "title": "Science & Technology sector receives allocation of Rs. 7,000 million in PSDP 2024-25",
  "link": "https://www.app.com.pk/national/science-technology-sector-receives-allocation-of-rs-7000-million-in-psdp-2024-25/",
  "date_published": "2024-06-12T18:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): The federal government has allocated a total of Rs. 7,000 million for Science, Technological and Research Division in the Public Sector Development Programme (PSDP) 2024-25.\nAccording to the budgetary document issued on Wednesday, Rs. 6,690 million has been earmarked for the 30 ongoing schemes while Rs. 310 million has been earmarked for the only one new scheme to be executed by the Science and Technology sector.\nAmong the ongoing projects, the major allocation of Rs. 757.783 has been made forthe project ‘Cultivation and Processing of Medicinal and Industrial Cannabis on Experimental Fields and Establishment of testing and product development facilities at Pakistan Council of Scientific and Industrial Research (PCSIR) Laboratories Complex, Lahore, Peshawar and Karachi’.\nAn amount of Rs. 625.773 has been allocated for ‘Establishment of Material Resource Centre and development of additive manufacturing and Reverse Engineering Centre at PCSIR’.\nThe ongoing revised project titled `Quality Seed Production and Supply to the Farming Community for Ensuring Food Security in Pakistan’ got an allocation of Rs.500 million.\nRs. 400 million each has been earmarked for the ‘Establishment of Medical Cannabis Greenhouses for Biotechnology Derived Bio-Products National Hemp and Cannabis Analytical Laboratory and National Industrial Hemp and Medicinal Cannabis Authority’ and ‘Development of Computer Controlled Fermentors and Production of Biochemicals and Bioproducts’ while Rs. 350 million has been allocated for `Medical Equipment and Devices Innovation Center’ (MEDICen).\nThe only new scheme `Establishment of Centre of Research in Surface Engineering (CoRiSE), NUST’ received an allocation of Rs. 310 million.",
  "retrievedAt": "2025-08-11T03:12:11.938Z"
}
