{
  "title": "SC adjourns petitions regarding May 9 riots accused till Monday",
  "link": "https://www.app.com.pk/national/sc-adjourns-petitions-regarding-may-9-riots-accused-till-monday/",
  "date_published": "2023-06-23T16:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):The Supreme Court on Friday adjourned the hearing of the petitions pertaining to trial of May 9 riots accused in military courts till June 26 (Monday).\nA seven-member bench headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz ul Ahsan, Justice Mansoor Ali Shah, Justice Munib Akhter, Justice Yahya Afridi, Justice Mazahar Ali Naqvi and Justice Ayesha Malik heard the petitions.\nAt the outset of hearing, the chief justice remarked that it was a wrong perception that a civilian could never be tried in army court. A civilian could be tried in army courts if he was accused of instigating army personnel against institution for sedition\nHe, however, said the procedure adopted to bring the accused of May 9 incidents in the jurisdiction of army courts would have to be viewed. It would also be viewed that on which grounds the anti-terrorism courts allowed to shift the trials, he added.\nThe chief justice observed that it was understood that the institution would identify the crimes under the Official Secret Act and it could file the request to the ATCs for the custody of civilian accused.\nCJP Bandial said harassing the legal fraternity was not legal and also asked the Attorney General for Pakistan that what was the policy of government about journalists. He asked the AGP to contact the acting provincial governments and took their stance about the lawyers and journalists.\nThe role of lawyers and journalists was essential for the self-confidence of the society, he added.\nAGP Mansoor Usman Awan said that no any accused was in the custody of Islamabad Police regarding the May 9 incidents, while four persons were in the custody of Khyber Pakhtunkhwa Police. About 41 persons were arrested in Punjab under MPO and 141 were taken in custody under the Anti-Terrorism Act (ATA).\nA total of 81 women were arrested in Punjab, out of which 42 had been released, he added.\nThe AGP said 172 accused were in the judicial custody in Sindh, and 70 of them got bails. Some 117 persons were arrested in Sindh under 3-MPO and 102 were in army’s custody. No woman, child, lawyer or journalist was in military custody in connection with the incidents of May 9 and 10, he added.\nMansoor Awan said the Federal Government had a clear stance that no journalist or lawyer would be arrested for May 9 riots and no action would be taken against any innocent person too.\nThe CJP remarked that the court would neither take a suo-motu action nor it would pass a judicial order but it was noting everything.\nEarlier, Justice Ijaz ul Ahsan observed that a reference could be sent to the Federal Government if the custody of a civilian was required to the institution as per law and then former would take a decision in the matter.\nHe said the top court had declared in the 21th Constitutional Amendment case that army courts were set up for certain circumstances like war situation.\nThe basic rights of army personnel would be suspended under the Army Act but the civilians would have protection under basic human rights in every condition, he added.\nJustice Mansoor Ali Shah said trial under the Official Secrets Act would be conducted only when there was a matter of national security. When and how the civilian accused had violated the OSA and under what law the arrests had been made, he asked.\nHe remarked that the Constitution did not allow the court to view the Army Act then how it could take a decision about it.\nJustice Mazahar Ali Naqvi asked that how the commanding officer could request the custody of a civilian accused. He noted that the sections of OSA were not applied as per the crime report produced before the bench and asked that when those sections were added in cases after May 9.\nJustice Ayesha Malik asked on which grounds civilian accused were being tried under the Army Act and how it used to be decided that a case would be registered under the Army Act or the OSA. She asked the counsel of the civil society Faisal Saddiqui that what were the extraordinary situations under which the trial of civilian accused could be conducted by army courts. The question was that if the crime of the accused fell in jurisdiction of OSA or not, she said.\nJustice Ayesha Malik said the magistrate concerned could not grant custody of an accused on the request of someone.\nPetitioner Jawad S. Khawaja’s counsel also prayed the court to form a larger bench into the matter if there were solid reasons for that.\nKhawaja Ahmed Hussain Advocate said the trial of civilians in army courts was an illegal act as it would affect the rights of accused given under Articles 9, 10 and 25. Only in extraordinary situations civilians were tried in military courts in the United States and Britain, he added.\nThe counsel for the civil society Faisal Saddiqui also gave arguments earlier in this case.\nThe court adjourned further hearing of the case till coming Monday. The chief justice said that the bench wanted to conclude the case till coming Tuesday. He asked Salman Akram Raja to give arguments in the case on next hearing.",
  "retrievedAt": "2025-08-11T08:46:33.200Z"
}
