{
  "title": "Pilgrims: Custodian of the Two Holy Mosques’ guests program for Hajj Serves Islam and Muslims",
  "link": "https://www.app.com.pk/national/pilgrims-custodian-of-the-two-holy-mosques-guests-program-for-hajj-serves-islam-and-muslims/",
  "date_published": "2023-06-23T17:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): A number of pilgrims of the Custodian of the Two Holy Mosques’ Guests Program for Hajj and Umrah expressed their gratitude and appreciation to the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and His Royal Highness Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister, for their generous hosting as part of the program to perform the Hajj rituals.\nThey appreciated the efforts made by the wise government to serve the pilgrims, praying to Allah the Almighty to safeguard the religion, security, stability, prosperity, and wise leadership of the Kingdom.\nMember of the Foundation of the Mauritanian Ulama, Dr. Abu Bakr Al-Mukhtar, said that the generous hosting by the Custodian of the Two Holy Mosques for more than a thousand pilgrims reflects the Kingdom’s great concern for Muslims and its keenness to care for Muslims from 90 countries worldwide.\nRagheb Mansour Abdelkader, an Egyptian pilgrim, expressed his appreciation for the program that embodies the true meanings of King Salman’s concern and perception of the needs of Muslims worldwide.\nHe prayed to Allah the Almighty to reward the Custodian of the Two Holy Mosques and the Crown Prince with the best reward for Islam and Muslims.\nMohammad Afdal Shaudry, a pilgrim from Pakistan, affirmed that the great efforts provided through the Custodian of the Two Holy Mosques’ Guests Program for Hajj and Umrah highlighted the Kingdom’s esteemed position in caring for pilgrims.\nDr. Mahmoud Youssef Abdelrahman, head of the Arabic Language Department at Dhaka University, pointed out that the Kingdom has been committed to providing various forms of care and attention to the pilgrims during their performance of the Hajj rituals, as the Custodian of the Two Holy Mosques’ Guests Program for Hajj and Umrah serves as an excellent model of this.\nHe added that the program had demonstrated great success in previous years.",
  "retrievedAt": "2025-08-11T08:46:29.694Z"
}
