{
  "title": "PM urges international community to deliver commitments made at COP27",
  "link": "https://www.app.com.pk/national/pm-urges-international-community-to-deliver-commitments-made-at-cop27/",
  "date_published": "2023-06-23T07:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):Prime Minister Shehbaz Sharif on Friday urged the international community to deliver the commitments made at COP 27 in Sharm al-Sheikh and also operationalise Loss and Damage Fund on the principle of equity.\n“The international community should deliver on the commitments they made at COP 27 in Sharm al-Sheikh, including the operationalisation of Loss & Damage Fund on the principle of equity; provision of grants that don’t increase indebtedness of developing countries; enabling climate-vulnerable countries to access the Fund on the basis of a climate vulnerability index,” he said in a tweet.\nThe prime minister is currently visiting Paris, France to attend the two-day Summit for New Global Financing Pact. French President Emmanuel Macron is chairing the Summit which is attended by over 50 heads of states.\nShehbaz Sharif said as part of his interactions during the Summit for a New Global Financing Pact, he drew world leaders’ attention to the exogenous shocks that created polycrisis for developing countries like Pakistan.\nThese shocks, he said resulted in stalling growth, supply chain disruptions caused commodity prices to soar, leading to back-breaking inflation and then extreme weather events precipitated unprecedented floods that cost Pakistan $30 billion in losses.\n“The inability to bridge the financing gaps to achieve Sustainable Development Goals (SDGs) coupled with the cost of realising climate goals is inflicting a heavy cost on the world, running into trillions of dollars annually,” he added.\nThe prime minister said the world should use present economic and climate turbulence as an opportunity for course correction. The starting point could be rethinking the global financial architecture where IFIs design their programs to be pro-growth and aligned with SDGs and climate justice goals.\n“The world faces a moment of truth. Let us all vow to rise to the challenge hand in hand in a spirit of solidarity and compassion,” he added.",
  "retrievedAt": "2025-08-11T08:46:45.292Z"
}
