{
  "title": "PM urges expatriates to expose anti-Pakistan propaganda, condemn May 9 arson",
  "link": "https://www.app.com.pk/national/pm-urges-expatriates-to-expose-anti-pakistan-propaganda-condemn-may-9-arsons/",
  "date_published": "2023-06-23T14:10:00.000Z",
  "source": "APP",
  "content": "PARIS, Jun 23 (APP): Prime Minister Shehbaz Sharif on Friday urged the overseas Pakistanis to play their role to expose the anti-Pakistan propaganda in their respective countries, besides condemning the arson that took place on May 9.\nThe prime minister, in an interaction with the representatives of the Pakistani community in France as well as the Pakistan Business Forum, told the expatriates that the arsonists of May 9 were spreading lies to instigate the people abroad.\nThe prime minister is visiting Paris to attend the New Global Financing Pact Summit hosted by France.\nHe said the overseas Pakistanis were Pakistan’s ambassadors and an asset, and that their services for the country’s development were laudable.\nPrime Minister Shehbaz told the community members that through its tough economic decisions, the incumbent government saved the country from default.\nDuring the last four years, the economy was pushed to the verge of collapse, and unemployment and inflation were at their peaks, he added.\nThe prime minister said that having inherited an isolated Pakistan on the diplomatic fronts, his government made constant efforts throughout the year to revive foreign relations.\nHe said the recently unveiled Economic Revival Plan would prove to be a milestone to restore Pakistan’s economic position and that a Special Investment Facilitation Council had been established to remove impediments to investment.\nPrime Minister Shehbaz said that only economic sovereignty and stability could guarantee a safe future for Pakistan.\nMinister for Information and Broadcasting Marriyum Aurangzeb and Special Assistant to the PM Tariq Fatemi also attended the meeting.\nThe representatives of the overseas Pakistanis in France also presented a bouquet to the prime minister.",
  "retrievedAt": "2025-08-11T08:46:33.820Z"
}
