{
  "title": "President for enhancing economic, cultural cooperation with Korea, Sri Lanka",
  "link": "https://www.app.com.pk/national/president-for-enhancing-economic-cultural-cooperation-with-korea-sri-lanka-2/",
  "date_published": "2023-06-23T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): President Dr Arif Alvi on Friday called for further promoting bilateral economic, trade and cultural cooperation with the Republic of Korea and Sri Lanka to further cement bilateral ties.\nThe president expressed these views while talking to the outgoing Ambassador of the Republic of Korea, Suh Sangpyo, and the outgoing High Commissioner of Sri Lanka, Vice Admiral (r) Mohan Wijewickrama, who made separate calls on him here at Aiwan-e-Sadr.\nTalking to the outgoing Ambassador of the Republic of Korea, the president said that Pakistan highly valued its multidimensional relationship with Korea, which involved collaborations in various fields such as political, economic, scientific, cultural and people-to-people relations.\nHe highlighted that Pakistan was open for business and investment for all its friends and partners, and would especially welcome Korean investment in various sectors.\nHe stated that Pakistan wanted to increase cooperation with Korea, particularly in the areas of Information Technology and Agriculture. The president also called for further promoting cultural cooperation with Korea, adding that Pakistan offered some of the most exotic mountaineering and religious tourism sites and would welcome tourists from Korea to visit Buddhist sites.\nHe remarked that Pakistan was home to the Gandhara Civilization and some of the most sacred relics in Buddhism, which could be a source of attraction for Korean tourists.\nTalking to the outgoing High Commissioner of Sri Lanka, the President said that Pakistan attached great importance to its long-standing friendship and cooperative ties with Sri Lanka, which was its second-largest trading partner in South Asia.\nHe added that Pakistan wanted to further expand economic cooperation and trade relations with Sri Lanka under the Pak-Sri Lanka Free Trade Agreement.\nHe stated that both countries should explore ways to rejuvenate SAARC and work together to fight poverty and promote peace, economic growth, and development for the benefit of the entire region.\nHe also recalled Pakistan and Sri Lanka’s support for each other at the UN and other international bodies and expressed the hope that this cooperation would continue at international fora.\nThe president appreciated the role of outgoing envoys in improving bilateral cooperation with Pakistan in all areas of mutual interest.",
  "retrievedAt": "2025-08-11T08:46:44.027Z"
}
