{
  "title": "India behind bacteriological warfare against the children of Pakistan; Experts",
  "link": "https://www.app.com.pk/national/india-behind-bacteriological-warfare-against-the-children-of-pakistan-experts/",
  "date_published": "2023-06-23T11:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): The experts at a guest lecture on Friday said that India was behind the bacteriological warfare conducted against the children of Pakistan, supporting the claim by citing the significant number of hepatitis patients as evidence.\nThe Centre for Aerospace and Security Studies (CASS), based in Islamabad, successfully concluded a Guest Lecture on ‘Indus Waters Treaty: A Critical Appraisal and Way Forward for Pakistan.’\nThe lecture shed light on India’s detrimental actions within the IWT, urging a fresh perspective to safeguard Pakistan’s water resources and address the pressing challenges ahead. Distinguished speaker Engineer Suleman Najib Khan, Convener, Water Resource Development Council (WRDC) shared his insights and recommendations on the treaty’s impact and the way forward, said a news release issued here.\nDirector of Non-traditional Security Threats at CASS, Air Vice Marshal (R) Nasser ul Haq Wyne introduced the subject and emphasized that various factors contributing to Pakistan’s water crisis were population growth, climate change, overuse of water resources, and inefficient water management.\nHe acknowledged that while the Treaty ensured access to a reliable source of water for irrigation and drinking purposes, but on the other hand, it had also limited Pakistan’s ability to develop its own water resources. He further noted that it remained to be seen whether India and Pakistan would be able to renegotiate the Treaty and reach a new one that met the needs of both countries or a status quo would be maintained.\nGuest Speaker, Engineer Suleman Najib Khan began by shedding light on the illusory nature of the IWT, revealing that the Treaty from the beginning could have been negotiated in a way which was more beneficial for Pakistan and explained that how India had deceived Pakistan for four decades.\nHe emphasised India’s intention to nullify IWT-I and negotiate IWT- II, potentially exacerbating the challenges faced by Pakistan.\nDrawing attention to flaws in the Treaty, Engineer Khan specifically mentioned Pakistan’s acceptance of four major drains from East Punjab under Article-4. This acceptance had led to the contamination of groundwater used for agricultural purposes, calling attention to the pressing issue of environmental damage caused by India’s actions.\nThe speaker stressed the importance of raising global awareness about this ‘ecocide’ faced by Pakistan due to Indian machinations.\nEngineer Khan further explained how Pakistan was losing approximately 27 million acre-feet (MAF) of surface flows from the Eastern Rivers, which constituted 20 percent of the total flow.\nHe characterized India’s hydro aggression as unprecedented in modern history, underscoring the immediate need to protect Pakistan’s water rights and sovereignty.\nThe guest speaker lamented the lack of collaboration between military and civilian engineers, as well as the absence of a brain trust in Pakistan to consolidate scientific hydro knowledge and effectively counter India’s tactics. He stressed the abundance of renewable resources in the country, and implored the importance of formulating and implementing a comprehensive national energy policy.\nEngineer Khan highlighted the vital role of a robust water policy in ensuring Pakistan’s solvency, with a need to build more dams that could play a pivotal role in flood control and the nation’s survival. He convincingly argued that water was the only source that could break the cycle of poverty, which was why he termed water a ‘strategic asset’ too serious to be ignored.\nHe recommended to seek relief from the IWT through the United Nations’ International Institute for the Unification of Private Law (UNIDROIT) Charter. He also advocated for the establishment of two new national-level organizations; Commission for Indus Basin Strategic Analysis (CIBSA) and the Pakistan Energy Planning and Execution (PEPE).\nCIBSA would serve as a Research and Development organization in the water sector, helping regulate the internal politics surrounding water resources and countering false propaganda. PEPE, on the other hand, would focus on energy planning and execution, ensuring deep coordination with CIBSA.\nAdditionally, Engineer Khan emphasized the urgency of settling the constitutional status of Gilgit-Baltistan and approaching the International Court of Justice (ICJ) to address Indian mischief aimed at obstructing the development of the Indus Cascade and related projects.\nIn his Concluding Remarks, Air Marshal Farhat Hussain Khan (Retd), President of CASS, Islamabad, commended Engineer Suleman Najib Khan for shedding light on the deficiencies within the IWT.\nHe underlined the need for a balanced approach to resource utilization and fostering specialists and critical thinkers who could contribute effectively to national development.\nHe concurred Engineer Suleman’s recommendation for a dedicated Institute or a think tank, comprising experts who should always be thinking proactively to mitigate water crises in Pakistan along with anticipating and offsetting possible Indian water aggression.\nAir Marshal Khan also emphasized the importance of institution-based decision-making rather than relying solely on individual-based decisions.\nHe expressed optimism that, in the current global discourse on ecology and environment, Pakistan should raise its concerns and confront India in international forums. He emphasized that instead of bilateral talks on IWT, international forums should also become part of the negotiations and the discussions should take into account subjects like ecology, climate change, along with a fair formula of water distribution. He concluded that water, being an integral part of national security, warranted a re-evaluation of Pakistan’s approach to handling security issues.\nThe Guest Lecture drew significant attention, with a healthy turnout and an engaging question and answer session. Attendees actively participated, reflecting their keen interest in understanding the complexities surrounding the IWT and its implications for Pakistan.\nThe event served as a platform for informed discussion and a call to action, emphasizing the need for comprehensive solutions and institutional collaborations to ensure a sustainable and secure water future for Pakistan.",
  "retrievedAt": "2025-08-11T08:46:43.317Z"
}
