{
  "title": "Saudi Arabia hosted 99 million pilgrims over 54 Years",
  "link": "https://www.app.com.pk/national/saudi-arabia-hosted-99-million-pilgrims-over-54-years/",
  "date_published": "2023-06-23T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Saudi Arabia’s endeavor to serve pilgrims and make Hajj an easy journey has been exceptionally successful Makkah, June 23, 2023, SPA — For Muslims, Hajj, the fifth pillar of Islam, has been a distinguished ritual that the faithful have always been keen on performing when they could.\nTo perform Hajj, Muslims from all over the world, irrespective of their country, race or status, travel to Makkah.The journey of Hajj, including arriving in Makkah, witnessing Kaabah and visiting the holy sites, is a goal and wish for all believers.\nMeans of transporting pilgrims in the past and present but traveling to Makkah was not always easy.\nAccording to Dr. Fawaz bin Ali Al-Dahas, former director general of the Makkah History Center, in the past “the means of transport were primitive and slow.\nPilgrims faced all sorts of difficulties, travelling from all around the world to Makkah by ships, on camelback and some even on foot.\nThis journey was not easy. It was unsafe and quite adventurous.\nThe roads leading to Al-Hijaz were undeveloped, the lack of water stations could mean death from thirst, and raiders could attack pilgrims’ caravans and steal the luggage and food they carried.”\nPilgrimage routes were long, winding and unsafe, and the trip to Makkah was seen as a risk; scenes of pilgrims bidding goodbye to their relatives would often depict loss of hope in the success of this journey, which could span several months on difficult and dangerous roads.\nBut a new chapter opened with the establishment Saudi state when conditions improved tremendously and the pilgrimage journey became easy thanks to the safety and security in Saudi Arabia and the steady development of the means of transport until aviation made it possible for pilgrims from various corners of the world to reach Makkah within hours. For seafaring pilgrims, modern vessels equipped with comfortable amenities make the voyage across oceans and seas to Jeddah Islamic Port a pleasant journey.\nThose traveling by land enjoy air-conditioned buses that travel along highways stopping often for rest and refuel.\nAl Mashaaer Al Mugaddassah Metro line, inaugurated by the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud, is integrated in the transport and logistics system provided by the Kingdom to pilgrims, reflecting the Kingdom’s care for pilgrims, its desire to facilitate the flow of pilgrims, according to the highest standards of quality and safety. The train helps alleviate traffic congestion and makes movement easy, safe and fast.\nIn the pre-Islam era and up to Caliph Abu Bakr Al-Siddiq, Dr. Al-Dahas said in his book “Hajj Through the Ages” that the total area of the Grand Mosque was estimated at 1,490 square meters. During Omar ibn Al-Khattab time, specifically in the year (17 AH), a sweeping flood known as the “Umm Nahshal” hit and uprooted the shrine of Ibrahim (pbuh) from its position, so Omar ibn Al-Khattab returned it to its place. The mosque had no walls surrounding it, houses surrounded it and the place was too crowded.\nOmar ibn Al-Khattab, the second Muslim Caliph, decided to buy the houses near the Holy Mosque and demolish them. Some owners refused to take the price for the house, while others refused to sell, so the prices of their houses were placed in the treasury of the Kaaba until they took it later.\nOmar encircled the mosque with a short wall. This was the first expansion of the Grand Mosque in Makkah, whose area now increased by 860 square meters, become a total of 2,350 square meters. During Othman bin Affan, the third Caliph to rule after the death of the Prophet Mohammad, the area increased by 2,040 square meters, making the total 4,390 square meters.\nDuring the time of Abd Allah ibn al-Zubayr, the area of the Grand Mosque witnessed an expansion of 4,050 square meters, bringing the total area up to 8,440 square meters, and during the reign of the Abbasid Caliph Abu Jafar al-Mansur the area was increased by 4,700 square meters, bringing the total area of the Grand Mosque to 15,440 square meters.\nIn the time of the Abbasid Caliph al-Mahdi, two more expansions happened: one of 7,950 square meters, the other was 2,360 square meters, bringing the area to 25,750 square meters.\nThe Grand Mosque was expanded during the reign of the Abbasid Caliph al-Mu’tadid by 1,250 square meters, and during the reign of the Abbasid Caliph al-Muqtadir Billah by 850 square meters. These two expansions brought the total area of the Grand Mosque to 27,850 square meters.\nDuring the Saudi era, the Grand Mosque enjoyed the highest level of development, attention and care, which it received from the founder of the state, King Abdulaziz, who ordered, in year 1344 AH, a complete restoration of the Grand Mosque.\nEverything that required repair was fixed, the entire mosque was clad in marble.\nIn 1345 AH, King Abdulaziz ordered the installation of pavilions in the courtyard (Mataf) of the mosque, to protect worshipers from the heat of the sun.\nDr. Al-Dahas said that in the same year, King Abdulaziz ordered that the 395.35-meter-long and 20.5-meter-wide floor of Masa’a be tiled with square flintstones, fixed with lime mortar.\nIn 1346 AH, he ordered another repair of the Grand Mosque, which included restoration and painting, as well as Maqam Ibrahim, the Dome of Zamzam, and Shazrawan of the Holy Kaaba were restored.\nIn early 1373 AH, King Abdulaziz ordered the installation of a pump to bring Zamzam water up, and a year later, in 1374 AH, he ordered the construction of a building for al-Siqaya (where Zamzam water is given to pilgrims) in front of the Zamzam well. In 1375 AH, he ordered the replacement of the six lanterns of Hijr Ismail (pbuh) with electric lights, as well as the tiling of the floor of Safa and Marwa.\nIn 1375 AH, King Saud delivered his historic speech initiating the expansion of the Grand Mosque, which was ordered by the founder, and construction work started on the 4th of Rabi` al-Akhar in 1375 AH. This expansion consisted of three floors, the basement, the ground floor, and the first floor, the construction of the two-floor corridors between Safa and\nMarwa and the expansion of the Mataf. The Zamzam well was thus situated now in the basement.\nDuring the reign of King Faisal in 1387 AH, the Maqam Ibrahim was covered in a glass cover. In 1391 AH, King Faisal ordered the construction of a building for the library of the Holy Mosque of Makkah, and in 1392 AH, construction works began on the complex for manufacturing the Kaaba Kiswa in its new location in Umm Al-Joud.\nIn 1396 AH, King Khalid completed the construction and first expansion of the Grand Mosque. Also during his reign, in 1397 AH, the factory of Kaabah Kiswah was inaugurated.\nIn the year 1398 AH, the Mataf courtyard was expanded to its current size, and its floor was tiled with heat-resistant marble brought from Greece, to increase the comfort of worshipers and pilgrims.\nThe expansion of the Mataf courtyard entailed moving the pulpit and the makbariya, expanding the basement where the Zamzam well is situated, and moving its entrance close to the edge of the old mosque, in the direction of Masa’a. Moreover, spouts were installed for drinking water, and a glass wall surrounded the well.\nAt the beginning of 1406 AH, King Fahd bin Abdulaziz ordered tiling the floor surface of the first Saudi expansion with cold- and heat-resistant marble.\nIn 1409 AH, King Fahd laid the foundation stone for the start of the second Saudi expansion, and in 1411 AH large courtyards surrounding the Grand Mosque were created and prepared for performing prayers, especially in times of great crowding. At the time, these courtyards, covering 88,000 square meters, were tiled with cold- and heat-resistant marble and were illuminated and furnished.\nIn 1415 AH, Safa area was expanded on the first floor to facilitate the movement of those who perform Tawaf between Safa and Marwa.\nIn 1418 AH, Al-Raquba Bridge was constructed; it connects the roof of the Grand Mosque to Al-Raquba area from Marwa side, to facilitate entry and exit to the roof of the Grand Mosque.\nEarly in 1432 AH, King Abdullah bin Abdulaziz inaugurated the largest expansion in the history of the Grand Mosque, raising the total capacity of the mosque – which also included an expansion of the Tawaf courtyard – to 1.850 million worshippers, which may be reached during peak time.\nWork had begun at the time to triple the capacity so that 150,000 people could circumambulate per hour. Complementary to the approach of the Kings of this holy country, Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud inaugurated five major projects within the comprehensive project of the Third Saudi Expansion for the Grand Mosque in 1436 AH.\nThey include the main building expansion project, the courtyards project, the pedestrian tunnels project, and the central service station project for the Grand Mosque.\nThe Third Saudi Expansion includes four minarets 135-m high, and one movable and six fixed domes in the expansion building. To facilitate the movement of worshippers, 680 escalators are included in the project. The total area of the project is estimated at 1,371,000 square meters.\nIntegrated services to millions of pilgrims\nOperating Hajj and Umrah successfully year after year, with the effective participation of security, health and logistical personnel, is one of the Kingdom’s most prominent achievements.\nThe success registered is due to Allah Almighty, in the first place, and to the material and human capabilities earmarked by the Custodian of the Two Holy Mosques and HRH the Crown Prince to serve the pilgrims and enable the largest possible number of Muslims to perform the Hajj and Umrah rituals.\nTo make it even more successful, the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud launched the Pilgrim Experience Program (PEP), which will greatly contribute to achieving Saudi Arabia’s Vision 2030. The program aims at improving services provided to pilgrims and enriching their religious and cultural experience.\nHajj and Umrah have seen many important developments over the past few years, thanks to the great priority attached to the sector.\nMultiple initiatives were launched to organize the sector and improve the quality of services it offers, including issuing e-visas for Hajj and Umrah performers from all countries, extending the duration of Umrah season and launching the Makkah Bus project.\nOther initiatives were developing Islamic historical sites and facilitating the arrival of Umrah pilgrims from outside the Kingdom through several types of visas, including issuing tourist visas upon arrival at Saudi entry ports, tourist e-visas and visitor visas.\nOther initiatives regulating the sector were launched by the Ministry of Hajj and Umrah, such as the Nusuk app (Eatmarna previously), the Hajj smart cards, the Bag-Free Hajj initiative, and the important Makkah Route Initiative, implemented through coordination among a number of authorities with the aim of facilitating entry procedures for pilgrims.\nThese and other initiatives and services aim at helping pilgrims perform the Hajj and Umrah rituals with ease and comfort in a spiritual atmosphere.\nEmanating from the Kingdom’s keenness to enable the largest possible number of Muslims to perform Hajj this year, 1444 AH, the Cabinet approved in its session chaired by the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud on January 10, 2023, to host pre-pandemic numbers of pilgrims.\nFrom 1390 AH to 1443 AH, the Kingdom received more than 99 million pilgrims, according to data by the General Authority for Statistics.\nMeanwhile, the Kingdom aims to be able to receive over 30 million Umrah pilgrims by 2030, which is one of the goals of Saudi Arabia’s Vision 2030.",
  "retrievedAt": "2025-08-11T08:46:29.727Z"
}
