{
  "title": "Ministry of Environment, Water and Agriculture completes preparations at holy sites for this year’s Hajj season",
  "link": "https://www.app.com.pk/national/ministry-of-environment-water-and-agriculture-completes-preparations-at-holy-sites-for-this-years-hajj-season/",
  "date_published": "2023-06-23T17:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): The Ministry of Environment, Water and Agriculture confirmed the readiness of the ministry’s sectors to serve the pilgrims during the Hajj season 1444 AH, announcing the pumping of more than 1.36 million cubic meters per day of potable water to the holy sites in Makkah and Madinah, adding that the quantities of water planned to be pumped during this year’s Hajj season amount to more than 78.5 million cubic meters of potable water to serve the pilgrims around the clock.\nThe ministry cooperates with more than 11 government agencies to monitor and observe the abundance of food commodities and supervises 600 markets for public benefit in all regions of the Kingdom, and dedicated 425 slaughterhouses for the slaughter of sacrificial sheep, cows, goats, and camels, in addition to the deployment of teams to control disease vectors in several locations in Makkah and Madinah.\nThe ministry also implements field visits to monitor and raise the level of environmental commitment, supervise the safety of shipments and ensure that they are free of diseases, and launched an operations room to monitor the progress of work in quarries, laboratories, slaughterhouses, and public benefit markets, in addition to monitoring air, water and soil quality, measuring noise levels, as well as launching an environmental awareness campaign, and a smart electronic platform for early warning of the weather.\nThe Environment, Water and Agriculture system continues implementing the operational plan for the Hajj season 1444 AH and is fully prepared to provide comfort for the pilgrims.",
  "retrievedAt": "2025-08-11T08:46:32.085Z"
}
