{
  "title": "Pakistan, China joined in long term all weather strategic cooperative partnership: Sanjrani",
  "link": "https://www.app.com.pk/national/pakistan-china-joined-in-long-term-all-weather-strategic-cooperative-partnership-sanjrani/",
  "date_published": "2020-12-16T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Chairman Senate Muhammad Sadiq Sanjrani on Wednesday said China was our closest friend and both the countries worked together in a broad-based, long-term ‘All-Weather Strategic Cooperative Partnership.’\nAddressing a virtual meeting with Mr. Wang Yang, Chairman, Chinese People’s Political Consultative Conference which took place here in Islamabad, he observed that in recent years our ties have further deepened.\nThe Chairman said Pakistan adhered to One-China Policy and Pakistan has always stood by China in matters of its core national interest, said a press release issued on Wednesday.\nPakistan values Chinese support in upholding our sovereignty, territorial integrity and national development, said Sadiq Sanjrani.\n“We are grateful for the support provided by China at the UN in the wake of India’s illegal unilateral steps in IIOJK”, the Chairman Senate said.\nHe further said that both Islamabad and Beijing have maintained high level exchanges of parliamentarians on a regular basis and all political parties in Pakistan supported further deepening of Pakistan-China bilateral friendship.\nHe said China was Pakistan’s largest single investment and trading partner. While mentioning bilateral cooperation in the fight against COVID-19 pandemic, Chairman Senate said both the countries shared the finest traditions of standing by each other through thick and thin.\nHe appreciated the role played by China in controlling virus in a country with\npopulation of 1.4 billion people.\nHe observed that China extended tremendous support to Pakistan to fight the pandemic and the Chinese government and people have firmly stood by their Pakistani brethren in the fight against COVID-19.\nHe said Pakistan received critical medical supplies and a team of Chinese medical experts also visited Pakistan on the instructions of President Xi Jinping to contain the pandemic.\nChinese doctors’ experience, the Senate Chairman said, greatly helped Pakistan understood COVID-19 pandemic and found better and practical ways to deal with it.\nSanjrani also appreciated President Xi Jinping’s declaration of COVID-19 vaccine as ‘global public good.’\nRegarding cooperation under Belt and Road Initiative and CPEC, Chairman Senate observed that Pakistan has great potential for regional connectivity connecting South Asia with Central Asia, West Asia, and China and inversely connecting the region with the Middle East and Africa.\nHe said CPEC would bring prosperity to three billion people of the region, including China, Central Asia and the Middle East.\n“We are developing Gwadar as an energy, trade and logistical hub for the region, which will deepen regional connectivity” Chairman Senate remarked.\nHe said Pak-China relationship has stood the test of times. The support extended by our two nations in the fight against COVID-19 was no different.\nHe highlighted that Senate of Pakistan unanimously passed a resolution on February 10, wherein it expressed support to the government, parliament and people of China to combat COVID-19.\nHe emphasized the need for more bilateral exchange of visits to further deepen our legislative understanding and oversight practices observed by both the parliaments.\nThe Chairman CPPCC appreciated Chairman Senate’s views on Pakistan China relations.\nHe lauded Chairman Senate efforts for strengthening bilateral cooperation between the two countries.\nHe said that Pakistan was an important country for China and they greatly acknowledge Pakistan’s support on various issues. Both sides agreed to further enhance bilateral and multilateral linkages in diverse sectors for benefit of people of both sides.\nSenator Mushahid Hussain Sayed, Sajjad Hussain Turi , Mirza Muhammad Afridi, Manzoor Kakar, Dilawar Khan, Muhammad Ali Saif and Secretary Senate Mohammad Qasim Samad Khan also attended the meeting.",
  "retrievedAt": "2025-08-11T20:08:57.747Z"
}
