{
  "title": "PM stresses for more sports facilities to youth",
  "link": "https://www.app.com.pk/national/pm-stresses-for-more-sports-facilities-to-youth/",
  "date_published": "2020-12-16T10:44:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 16 (APP): Prime Minister Imran Khan here Wednesday said Pakistan was a sports loving country and stressed necessary steps to be taken for promotion of all those sports which had given identity and recognition to the country at international level.\nThis was stated by the Prime Minister after laying the foundation stone of Hayatabad Sports Complex Upgradation Project here on Wednesday.\nUpon his arrival at the stadium, the Prime Minister was received by Governor KP Shah Farman, Chief Minister Mahmood Khan, Provincial Minister for Finance and Health, Taimour Salim Jhagra and officials of KP Sports Department.\nBefore start of the ceremony, one minute silence was observed to pay rich tributes to all those martyred students and teachers of Army Public School on their sixth martyred anniversary observed today.\nThe Prime Minister said PTI Government has started a number of mega projects for promotion of sports and strengthening of sports infrastructure in KP and Hayatabad sports complex upgradation project was a testimony of it.\nHe said unfortunately no proper attention was paid in the past for promotion of sports. He said Pakistan has second highest youth population in the world, therefore, international level sports facilities should be provided to youth by engaging them in positive and healthy activities.\nThe Prime Minister was told that under the upgradation project, an international standard cricket ground would be constructed besides increasing seating capacity for spectators, installation of digital score board, general public stands and all others related sports facilities to hold international level matches on this venue.\nThe Prime Minister also inaugurated a fitness gymnasium and swimming pool for women having modern facilities.\nThe Prime Minister was briefed about ongoing construction work at Arbab Niaz Cricket Stadium at Peshawar besides laying foundation stone of Cricket Stadium at Kalam and Grassy Cricket Sports Ground at Swat.\nThe Prime Minister was also briefed about laying of hockey trough at five districts of KP to promote sports facilities for youth besides laying of tartan tracks for the athletes in four districts. Projects related to Regi Sports City for promotion of Squash also came under discussion.",
  "retrievedAt": "2025-08-11T20:08:59.843Z"
}
