{
  "title": "Commemorative ceremony for APS Peshawar terrorist attack victims held in Ankara",
  "link": "https://www.app.com.pk/national/commemorative-ceremony-for-aps-peshawar-terrorist-attack-victims-held-in-ankara/",
  "date_published": "2020-12-16T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): To pay homage to the schoolchildren and staff martyred in the brutal terrorist attack on Army Public School (APS) Peshawar in 2014, a solemn ceremony was held on Wednesday at Keçiören, Ankara.\nAmbassador of Pakistan Muhammad Syrus Sajjad Qazi, Keçiören Municipality Deputy Mayor Metin Akdemir and Pakistan Embassy officials attended the event, a press release issued by Pakistan Embassy in Ankara said.\nIn his remarks on the occasion, Ambassador Syrus Qazi recalled the tragic event of 16 December 2014, at APS Peshawar and said 133 innocent children and 17 school staff lost their lives.\nHe noted that the carnage was one of the most tragic events in the country’s history that had left every Pakistani in utter shock and grief.\nAmbassador Qazi thanked the people of Turkey who were among the first in the world to reach out and express strong solidarity with the people of Pakistan.\n“The moral gesture of Keçiören Municipality of planting a tree for each martyr was a source of strength for the grieving families and the Pakistani nation and this would keep their memory alive in Turkey forever,” he underlined.\nWhile reaffirming the strong solidarity of the people of Turkey with Pakistan, Deputy Mayor of Keçiören, Metin Akdemir condemned the terrorist attack and said nothing can justify such a brutal and inhuman act.\nHe said that the people of Turkey would continue to stand by their Pakistani brothers.\nThe participants placed flowers at the memorial, followed by prayers for the departed souls.\nWhen the heinous APS Peshawar attack happened on 16 December 2014, the people and leadership of Turkey extended spontaneous support to Pakistan and Turkey declared a day of national mourning.\nMoreover, as a show of solidarity, Keçiören Municipality and Youth Wing members of the Justice and Development (AK) Party planted trees, one for each martyred, at the AK Party Memorial Forest in Keçiören, Ankara.",
  "retrievedAt": "2025-08-11T20:08:55.209Z"
}
