{
  "title": "India planning false flag operation in Kishtwar district: Security source",
  "link": "https://www.app.com.pk/national/india-planning-false-flag-operation-at-kishtwar-district-security-sources/",
  "date_published": "2020-12-16T08:48:00.000Z",
  "source": "APP",
  "content": "The Indian Army is planning yet another false flag operation on the pretext of a fake encounter of three Kashmiri detainees, already held in police custody in Kishtwar District of the IIOJK, a security source said Wednesday.\nThe operation was aimed at “crafting fabricated stories against Pakistan,” the source said.\nAccording to details, some of the already confiscated weapons were likely to be displayed as recovered from Marwah or Metwan area of the Kishtwar District in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), the source said.\nThe Indian local commander in Kishtwar District has already spoken to the Senior Superintendent of Police of the area regarding the detainees Ghulam Hussain, Iqbal Lone, and Bashir Matu.\nThe Indian army is notorious for conducting similar false flag operations in the past, including the one at Pulwama, after which it attacked a fictitious “training camp” at Balakot, Pakistan.\nPrime Minister Imran Khan was already on record for warning the world of an imminent false flag operation from India to divert the world’s attention away from its ongoing genocide in the IIOJK. The prime minister in May had twice warned of a false flag operation.\nDirector-General of Inter-Services Public Relations (ISPR) Major General Babar Iftikhar, in an interview with a local news channel in June, advised the Indian military leadership not to play with fire.\n“We will respond any aggression with full might,” he was reported as saying.\nThe DG ISPR warned India that there would be consequences of any military misadventure in the region and those would be uncontrollable. “Let us not play with fire. We will respond any aggression with full might,” he had said.\nAccording to the security source, India was desperate after facing repeated humiliations at various international fora on its gruesome human rights records. Particularly after the huge leak by the EU DisinfoLab through Indian Chronicles, which pointed to a clandestine operation by setting up 750 fake media houses in 119 countries.\nHe said India was frantically making efforts to cover up its tracks by launching an aggressive hybrid war against Pakistan.\nThe government of Prime Minister Narendra Modi is already hostage to the 21-day long strike of farmers, with the support of 14 political parties, which has gained momentum with the joining of transport and other sectors in the country and has had successful lockdowns.\nReport by Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:08:59.853Z"
}
