{
  "title": "National covid positivity surges at 7.2 percent; 2,510 patients critical",
  "link": "https://www.app.com.pk/national/national-covid-positivity-surges-at-7-2-percent-2510-patients-critical/",
  "date_published": "2020-12-16T07:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): The national COVID-19 positivity ratio on Wednesday was recorded 7.2 percent where 2,510 coronavirus patients were in critical condition across the country with the number of critical patients rising at a fast pace.\nThe highest positivity ratio was observed in Karachi which was 18.76 percent followed by Hyderabad 16.56 percent and Peshawar 15.99 percent, according to the latest update issued by the National Command and Operation Center (NCOC).\nThe positivity ratio in various federating units was as in Azad Jammu and Kashmir (AJK) was 5 percent, Balochistan 4.9 percent, Gilgit Baltistan (GB) 1.6 percent, Islamabad Capital Territory (ICT) 2.9 percent, Khyber Pakhtunkhwa (KP) 11.3 percent, Punjab 3.2 percent and Sindh had 14.8 percent.\nIt also mentioned the province wise COVID-19 positivity ratio breakdown that indicated in Punjab, Lahore had 6.04 percent, Rawalpindi had maximum of 6.15 percent, Faisalabad 2.67 percent and Multan 2.71 percent and Gujranwala had 0.77 percent.\nIn Sindh, Karachi had 18.76 percent, Hyderabad 16.56 percent, in KP, Peshawarhad 15.99 percent, Abbotabad 3.80 percent and Swat had 3.46 percent, in Balochistan, Quetta had 5.08 percent, in ICT 2.94 percent positivity ratio was prevailing. In AJK, Mirpur had 5.31 percent positivity ratio and Muzaffarabad 1.8 percent and GB had 1.45 percent.\nThe update also showed mortality analysis during the prevailing pandemic outbreak as a total of 9,010 deaths were recorded with prevailing fatality rate of 2.02 percent against the global death rate of 2.22 percent.\nIt added that as per the gender analysis of the deceased around 70 percent were males with 77.5 percent over the age of 50-year with age median of 61-year.\nAs many as 73 percent of the perished COVID-19 patients had chronic comorbidities (affected with another disease prior to contracting Coronavirus).\nOut of the total died COVID patients 91 percent of the deceased remained hospitalised whereas 58 percent of the hospitalised patients remained on ventilator, it added.",
  "retrievedAt": "2025-08-11T20:08:58.467Z"
}
