{
  "title": "Pak-Turkey relations deeply entrenched in common Islamic heritage, values: Firdous",
  "link": "https://www.app.com.pk/national/pak-turkey-relations-deeply-entrenched-in-common-islamic-heritage-values-firdous/",
  "date_published": "2020-02-14T02:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Special Assistant to the Prime Minister on Information and Broadcasting, Dr. Firdous Ashiq Awan on Friday said that Pak-Turkey relations are deeply entrenched in common Islamic heritage and values.\nDuring a meeting with Dr. Serdar Cam, Deputy Tourism Minister of Turkey, she said this relationship is not confined between the two states but reflective of an unfathomable bond between the people of two countries.\n“We are proud the way Turkey has advocated the Kashmir cause as innocent Kashmiris deserve attention of the International community particularly, the Muslim Ummah”, she said.\nThe SAPM said that signing of two protocols on cooperation between PTV and PBC with their Turkish counterpart, TRT, will further reinforce ties between the two countries in the fields of media, information and culture.\nThe cooperation will enable both sides to exchange TV/ Radio programmes and help reinforce narratives to promote the cause of Muslim Ummah.\nDr Firdous also stressed the need to fortify cooperation in the area of film and cinema.\nShe said that hosting the 6th High Level Strategic Cooperation Council (HLSCC) Session will prove to be another milestone in our bilateral relations which span over seven decades.\n“I am also pleased to see a memorandum on tourism cooperation being inked today as this subject is close to the heart of Prime Minister Imran Khan”, she said.\nReferring to the address of President of Turkey Recep Tayyip Erdogan, she said it was encouraging to note that he highlighted the importance to boost ties in the area of investment and economy. She said that media can be an affective tool to promote cooperation in all sectors.\nThe SAPM said that development of Pakistan tourism sector is our key priority and formal collaboration in this sector would afford us an opportunity to learn from Turkish experiences and best practices.\nDr Serdar Cam said that the Turkish delegates are happy to be here in our second home, Pakistan.\nHe said that all departments and organizations are ready to extend cooperation to their Pakistani counterparts in the field of tourism. There is lot of scope for promotion of tourism in Pakistan, he said.\n“I wish and desire more and more Turkish people to visit Pakistan as tourists”,\nDeputy Minister for Tourism said.\nHe said Pakistan and Turkey enjoy a unique history of solidarity and cooperation in areas mutually beneficial for the people of both countries.\nDr Serdar Cam also extended an invitation to the Special Assistant to the Prime Minister on Information and Broadcasting to visit Turkey.\nThe meeting was also attended by Akbar Durrani (TI), Secretary Information, Amir Manzoor, Managing Director, PTVC, Ms. Samina Waqar, Director General, PBC and Saeed Javed, DG External Publicity Wing, Ministry of Information and Broadcasting.",
  "retrievedAt": "2025-08-11T18:47:55.557Z"
}
