{
  "title": "PM woos Turkish investors assuring all-out facilitation",
  "link": "https://www.app.com.pk/national/pm-woos-turkish-investors-assuring-all-out-facilitation/",
  "date_published": "2020-02-14T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Prime Minister Imran Khan Friday wooed the Turkish business community to explore trade and investment opportunities in Pakistan’s multiple sectors, assuring his business-friendly government’s all-out support in their ventures.\nAddressing the Pakistan Turkey Business and Investment Forum held here during the ongoing visit of Turkish President Recep Tayyip Erdogan, the prime minister said his government could do anything to improve trade relations with Turkey.\nThe event was also attended by the Turkish president, Advisor to the PM on Commerce Abdul Razzak Dawood, Turkish Trade Minister Ruhsar Pekcan, federal cabinet members and top businessmen from both the countries.\nHe said Pakistan would like Turkish investment in the tourism sector to learn the best experiences for implementing in the country supported by a well-developed infrastructure, which it was lacking.\nHe said Pakistan had been enlisted among the top tourist destinations by a United States magazine.\nThe prime minister said Turkey could also extend cooperation in information technology, mining and agriculture sectors. Pakistan had huge mining potential with most of it being untapped, while Turkey had vast experience in the sector.\nHe assured the Turkish investors that his government, the most business friendly one in Pakistan’s history, would be extending full facilitation to them. Moreover, Pakistan had also jumped by 28 points in the World Bank’s index of ease of doing business. Constantly, the government was trying, for ease of the businessmen, to reduce the regulations which came their way.\nThe prime minister said he looked forward the interaction between the Turkish and Pakistani business communities. He desired the business community to take the lead as the political leadership was much closer than the business community of the two countries so far and urged the businessmen to take benefit of closer political relationship.\nPresident Recep Tayyip Erdogan, in his address, thanked the government and the people of Pakistan for great hospitality, saying he regarded Pakistan as his second home.\nHe expressed the hope that the interaction between the two business communities would help further strengthen the bilateral relations and open up new avenues of investment.\nHe said despite increase in investment, both the countries lagged behind to tap their true potential and called for enhancing the bilateral trade to $ 5 billion by taking necessary steps.\nThe two sides had to take measures towards common objectives and with having industries which complimented each other they should focus on those areas, he added.\nHe said Turkey had increased its investment in Pakistan and wanted the Pakistani companies to invest in that country in diverse areas.\nPresident Erdogan said Turkey not only supported the international investment but also offered its Turkish citizenship and Pakistani brothers should also take benefit of it.\nHe also presented an economic outlook of Turkey which had reduced its public debt by 30 percent, provided new employment to 900,000 people in tourism and attracted US $ 22 billion in investment.\nWith a strong banking sector, flourishing aviation industry and increasing exports, Turkey was continuing to achieve economic progress despite various hurdles, he added.\nPresident Erdogan said with Pakistan taking important steps in facilitating business environment under the leadership of Prime Minister Imran Khan, bilateral cooperation between the two brotherly countries in the areas of defence, transportation, housing, health care was becoming deeper.",
  "retrievedAt": "2025-08-11T18:47:51.578Z"
}
