{
  "title": "Govt to put in place effective mechanism for ensuring no price hike in future: PM",
  "link": "https://www.app.com.pk/national/govt-to-put-in-place-effective-mechanism-for-ensuring-no-price-hike-in-future-pm/",
  "date_published": "2020-02-14T04:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): Prime Minister Imran Khan Friday said a proper mechanism was being put in place for putting in place an early warning system for detecting shortage of essential food items and no recurrence of price hike in future.\nDescribing the recent price hike of edible items as “avoidable”, the prime minister said he was awaiting the report of a high-level probe into sharp increase in the prices of wheat flour and sugar that caused widespread criticism on the government.\n“We will fix responsibility and find why it happened,” Imran Khan told reporters at a media interaction here at the Prime Minister House. The joint investigation team had submitted its report about the factors leading to the price hike, however, he had returned it “to fill the voids”.\n“We will share the information with the public and put in place a system so as to ensure there is no such repeat,” he said.\nWhen asked whether the report pointed the finger at Jehangir Tareen and Khusro Bakhtiar, Imran Khan said, “There were no names. It had [report] gaps, and we have asked to submit a more comprehensive one.”\nThe prime minister’s interaction with the media came as the government had taken a number of measures to control prices of everyday essential items by announcing a Rs 15 billion package for the Utility Stores, initiation of Ration Cards for the poorest of the poor and fixing responsibility for the lapse.\nImran Khan said there were cartels in every sector of economy and pointed to the dismal performance of the Competition Commission of Pakistan, which was not accomplishing the tasks it was assigned. The government was going to fix it as unless it started working effectively, there could be no check on the cartels, which could raise the price of any commodity at will.\nHe was optimistic that his government would be able to tackle the issue, as he had no business interests. He gave the example of Pakistan Medical and Dental Council, whose inefficient working led to the forced return of over 5,000 doctors from Saudi Arabia. “When we tried to change it the whole mafia of fake degrees and dubious medical colleges got activated against the government.”\nImran Khan said his government was also going to bring in necessary changes in the electoral laws of Senate so as to adopt the “show of hands” procedure for voting and do away with the current secret balloting system, which led to leveling of allegations of bribery.\n“We had to show door to 20 of our MPAs in Khyber Pakhtunkhwa for just this reason, as we got information that they sold their votes,” Imran Khan said and added that his government wanted to create a transparent system.\nHe said change was also in the offing in the electoral laws and use of modern biometric technology so that any losing party could not claim that it was the outcome of rigging. The opposition had been levelling baseless allegations of rigging, and were not really interested in finding a permanent solution to the issue, he added.\nThe prime minister, when asked about the remarks of Jamiat-e-Ulema Islam-F leader Maulana Fazlur Rehman wherein he claimed that the PTI government was about to be ousted, said, “Article 6 needs to be invoked on making such remarks.”\n“Who gave you [Fazlur Rehman] this indication?” Imran Khan questioned and said the government was deliberating on the future course of action in that regard, in response to a question. He said the Kashmir issue was at its peak, when diversion was deliberately caused and a sit-in staged in Islamabad. The entire effort to highlight the Kashmir issue at the United Nations was put on the back-burner.\nHe said the opposition parties had no interest in the issue of price hike, and their only worry was about whether they would go to jail or not for their corruption, and how to create instability in the country.\n“I faced six cases and did not seek refuge in London. I submitted 60 documents to give my money trail of bringing in dollars from abroad to Pakistan. While they [leaders of PML-N and PPP] did not submit even a single original document.\nWhen asked about the differences in his party and with the allies, the prime minister questioned, “In which political party you do not find difference of opinion? Just see the situation in the two main opposition parties, or for that matter in any other political party in the world.”\nThe concerns of the allies had already been addressed, he said.",
  "retrievedAt": "2025-08-11T18:47:51.658Z"
}
