{
  "title": "Coronavirus national action plan implementation to be ensured: Mirza",
  "link": "https://www.app.com.pk/national/coronavirus-national-action-plan-implementation-to-be-ensured-mirza/",
  "date_published": "2020-02-14T03:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Special Assistant to the Prime Minister on Health Dr Zafar Mirza on Friday said that national action plan to ensure preparedness and response against Novel Coronavirus was being implemented in coordination with all stakeholders.\nChairing the emergency core group meeting for Novel Coronavirus preparedness and response here, he said that all necessary steps were being taken to protect people from the disease.\nThere was, so far, no case of the disease in Pakistan as strict vigilance was being maintained at the airports with screening of incoming travelers and their follow up by dedicated public health teams and airport health authorities.\nUnder the National Action Plan, in line with WHO guidelines and in accordance with international best practices both isolation facilities at designated hospitals and quarantine arrangements were an essential requirement to meet any eventuality, added Dr Zafar Mirza.\nIsolation wards were established in major designated hospitals across the country whereas a quarantine facility was being established as per WHO guidelines.\nWith the approval of the prime minister, Hajj Complex in Rawalpindi has been designated for the purpose. All necessary arrangements at the quarantine facility were now in place with the support of Ministry of Religious Affairs and NDMA.\n“I would like to express special gratitude to Ministry of Religious Affairs and NDMA for completing all arrangements at the facility in the shortest possible time,” Dr Zafar Mirza said.\nHe assured that the government would take all actions keeping the protection of the health of our people supreme and guided by the science of public health. “We are working round the clock and maintaining high level of vigilance to counter the public health challenge posed by Novel Coronavirus pandemic,” Dr Zafar Mirza said.\nHe added that he was pleased to confirm that four Pakistani students in China who were infected by the virus have fully recovered and had been discharged from the hospital.",
  "retrievedAt": "2025-08-11T18:47:53.302Z"
}
