{
  "title": "Punjab govt intensifies Monkeypox prevention measures, airport screening: Minister health",
  "link": "https://www.app.com.pk/national/punjab-govt-intensifies-monkeypox-prevention-measures-airport-screening-minister-health/",
  "date_published": "2024-08-24T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): Punjab Health Minister Khawaja Salman Rafique Saturday revealed that the provincial government has launched a proactive campaign against monkeypox, featuring airport screenings and heightened hospital vigilance to safeguard public health and prevent the virus’s spread.\nAdditionally, nine dedicated centers have been established to enhance the response to the potential outbreak, he said while talking to a private news channel.\nMinister further elaborated on the measures being taken, stating that airport authorities have been instructed to conduct rigorous screening of passengers arriving from affected countries to detect any potential cases of monkeypox.\nTo ensure effective screening, the Institute of Public Health (IPH) has been directed to train master trainers who will then train airport staff and healthcare workers on identifying symptoms, testing protocols, and infection control\nmeasures, he mentioned.\nThis multi-layered approach aims to prevent the spread of the virus and ensure prompt response in case of any suspected cases, he added.\nSalman Rafique also emphasized the crucial role of public awareness in preventing the spread of monkeypox.\nHe urged citizens to remain vigilant and informed about the virus, its symptoms, and prevention measures.\nThe government, he said, is launching a comprehensive awareness campaign to educate the public on the risks associated with monkeypox and the steps they can take to protect themselves and their loved ones.\nBy working together, the minister emphasized, we can mitigate the risk of an outbreak and ensure the health and safety of the people of Punjab.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:56:44.659Z"
}
