{
  "title": "US govt spent $100mn for addressing malnutrition out of $215mn provided for flood relief: Lalley",
  "link": "https://www.app.com.pk/national/us-govt-spent-100mn-for-addressing-malnutrition-out-of-215mn-provided-for-flood-relief-lalley/",
  "date_published": "2024-08-24T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): US Mission Pakistan Spokesperson, Jonathan Lalley on Saturday said that out of over $215 million the United States provided for flood relief and recovery, nearly $100 million has gone toward addressing malnutrition in the 2022 floods’ impacted areas of Pakistan.\nIn a video message here, the US Mission Pakistan Spokesperson said that Pakistan’s 2022 floods have devastated the lives of millions of Pakistanis.\n“Women and children were hit especially hard. Even today, millions of Pakistani children are at risk of dying from malnutrition. We partnered with the World Food Program to provide emergency food and nutrition,” Jonathan Lalley said.\nWith UNICEF, he said the Mission treated nearly 135,000 malnourished children, provided pre-natal care to some 74,000 pregnant women, and offered essential health care services.\nMoreover, with the World Health Organization, the Mission established 12 nutrition stabilization centers across Balochistan and Sindh to provide essential health services, he added.\n“Just this month, U.S. Ambassador Blome delivered an additional 486 tons of ready-to-use therapeutic food to treat an additional 39,000 children,” he said.\nWith that donation, he said the United States has delivered emergency therapeutic food to more than 317,000 Pakistani mothers and children and enabled 779,000 front-line healthcare workers to provide nutrition counseling to parents and caregivers to prevent malnutrition in the first place.\n“The United States will continue to work urgently with Pakistan to address the malnutrition crisis.\nBecause every Pakistani child deserves the opportunity to grow up, to be healthy and strong, and to reach their full potential,” he reiterated.",
  "retrievedAt": "2025-08-11T04:56:41.173Z"
}
