{
  "title": "APHC condemns BJP govt’s repressive tactics in IIOJK, urges global intervention",
  "link": "https://www.app.com.pk/national/aphc-condemns-bjp-govts-repressive-tactics-in-iiojk-urges-global-intervention/",
  "date_published": "2024-08-24T06:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):The All Parties Hurriyet Conference (APHC) has sharply condemned BJP-led Indian government’s use of military force, harsh black laws, and coercive cordon and search operations as a part of a deliberate strategy to undermine the Kashmiri people’s demand for political justice.\nIn a statement issued in Srinagar, APHC spokesperson Advocate Abdul Rashid Mihas criticized New Delhi for its aggressive suppression of dissent in Indian illegally occupied Jammu and Kashmir (IIOJK) through draconian laws such as the Public Safety Act (PSA) and the Unlawful Activities (Prevention) Act (UAPA).\nMihas voiced concern over the ongoing state terrorism and the arbitrary arrest of Kashmiri youth by Indian forces’ personnel during the so-called cordon and search operations.\nThe APHC denounced the BJP regime for systematically violating the fundamental rights of the Kashmiri people, including their freedoms of expression, press, and political, social, business, and religious activities. The statement called on the international community to not remain passive in the face of these ongoing abuses in IIOJK.\nMihas urged India to abandon its imperialistic stance on Kashmir, acknowledge the current realities, and address the Kashmir dispute in accordance with commitments previously made by Indian leaders at the UN and in public statements.\nThe APHC emphasized that the dire situation in IIOJK demanded urgent global attention.\nThe spokesman appealed to the United Nations to fulfill its role in resolving the Kashmir dispute in line with its resolutions and the aspirations of the Kashmiri people, in order to ensure lasting peace in South Asia.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:57:27.884Z"
}
