{
  "title": "Mental health experts call for regulatory body to curb malpractices",
  "link": "https://www.app.com.pk/national/mental-health-experts-call-for-regulatory-body-to-curb-malpractices/",
  "date_published": "2024-08-24T09:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): Head of the Psychology Department at the National University of Modern Languages (NUML), has called for the establishment of a regulatory body for psychologists which could register practitioners, set rules, and provide an ethical foundation for the profession.\nTalking to APP on Saturday, Dr. Ulfat pointed out that there are regulatory bodies such as the Nursing Council, Tib Council and Homeopathic Council but surprisingly, there is no council or regulatory body for psychologists, despite mental health being a pressing global concern. “There is no forum where a patient can file a complaint when things go wrong”, she added.\nShe highlighted the growing number of unqualified individuals entering the counseling field, portraying themselves as life coaches, gurus, or motivational speakers despite lacking proper psychological training. She expressed concern that some non-professionals are even prescribing mental health medications which is a task reserved for psychiatrists.\nDr. Ulfat warned that young female psychologists might be unaware of the dangers posed by certain clients who exploit them for inappropriate conversations. Less experienced professionals, she added, are often unable to recognize these situations.\nShe expressed concern that students with limited knowledge often enter the field of counseling, struggling to manage complex and chronic cases. She noted that while online healthcare platforms were a blessing during the COVID-19 pandemic, some unqualified psychologists exploited these platforms for financial gain.\nTalking to APP, Director of Psychaffinity, Kiran Aamir stressed the urgent need for mental health laws in Pakistan. She highlighted the mistreatment of addicts at some rehabilitation centers and called for the establishment of Psychiatric Community Centers similar to those in developed countries.\nShe noted that current health regulatory bodies lack the expertise to properly monitor rehabilitation centers, as their focus is on traditional hospitals and clinics.\nKiran Aamir urged the Pakistan Psychological Association to take a more active role in promoting authentic rehabilitation centers and addressing malpractice within the community.",
  "retrievedAt": "2025-08-11T04:56:45.427Z"
}
