{
  "title": "Flood Devastation; Pakistan needs assistance from neighbours, world community: Khawaja",
  "link": "https://www.app.com.pk/national/flood-devastation-pakistan-needs-assistance-from-neighbours-world-community-khawajah/",
  "date_published": "2022-09-17T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): Minister for Defence Khawaja Muhammad Asif on Saturday said the country would need assistance from its neighbours and the world community due to massive floods as large-scale crop losses might cause famine.\nThe Defence Minister revealed in a media conference while sharing the updates of the Prime Minister’s visit along with his delegation to Uzbekistan at Shanghai Cooperation Organisation (SCO) Summit of the Council of Heads of State in Samarkand.\nKhawajah said the Prime Minister during his one-on-one interactions, bilateral meetings and speeches at the SCO Summit had highlighted that the global north damages to ozone layer caused the disaster that directly impacted over 33 million people in Pakistan.\n“He [Prime Minister] reiterated that in the coming days Pakistan would need the assistance of its neighbours and world community due to massive damage to its agriculture that would cause food security crisis,” the Minister said.\nHe appreciated that the UN secretary general was playing the role of Pakistan’s spokesperson for spreading the word for assisting Pakistan in crisis.\nKhawaja said, “The country never needed such unity and solidarity before aa the 220 million masses had to stand together to help disaster hit masses. The winter season is approaching and the flood crisis could cause famine in Pakistan.”\nDuring the visit, he said it was visible that the world leaders at the SCO Summit sent their greetings to Mian Nawaz Sharif and recalled their meetings with him.\nThe position of Pakistan among the comity of nations was due to the initiatives taken during Mian Nawaz Sharif’s tenure and that tradition was continued by Prime Minister Shehbaz Sharif, he added.\nWhile recalling the Prime Minister’s meeting with Chinese President Xi Jinping, he said, “President Xi in a meeting said I remember Mian Shehbaz as an efficient and pragmatic leader and we believe that we will start CPEC with same spirit, efficiency and hardwork.”\nHe added that President Xi also discussed  the railway line project that was in the doldrums, CPEC projects, road network projects in our region and beyond.\nThe Chinese President reaffirmed that China was the all weather strategic friend of Pakistan and wished that they wanted Pakistan to overcome crises and achieve stability, he said.\nThe Chinese President, the Defence Minister said also extended all out support to Pakistan in this regard.\n“The Prime Minister is in Tank right now and DI Khan areas to observe rescue and relief efforts.\nHe will then leave for UK to attend the last rituals of the Queen and then he will leave to New York to attend UN General Assembly session,” he informed.\nThe Minister also briefed that Russian President Vladimir Putin appreciated Pakistan’s position on Russia-Ukraine War in the UN and internationally.\n“No leader claimed that their governments had proposed Pakistan to buy oil. No one wrote any letter to Pakistan. However, there have been discussions on oil, gas and wheat supplies from Russia. Russia has proposed that its gas pipelines infrastructure has been extended to Central Asian states  which can be extended to Pakistan through Afghanistan to provide gas supplies.”\nThe Russian authorities had also extended offer for wheat supplies as a food supplies shortage was looking in the country due to flood devastation, he added.\nHe noted that the Prime Minister got great attention at his maiden appearance at an international forum and got unprecedented acclaim which was evident from the pictures.\nResponding to media queries, he said no personal bias or politics could overcome national interest. Prime Minister Shahbaz Sharif during the Pakistan Tehreek-e-Insaf (PTI) rule proposed a charter of economy which was rejected by the Imran Khan regime.\n“Imran Khan is not talking about floods rather continuously demanding power. Khan’s statement should never become topic of politics. Did Khan and his Chief Minister made any visit to flood affectees?”\nHe continued that the flood affectees were in pathetic condition in South Punjab and Khyber Pakhtunkhwa (KP) but there was no commitment of government of PTI.\nOn a query pertaining to Chief of Army Staff (COAS) appointment, he said the policy was as per the constitution as any sitting Prime Minister in November would have to decide the nomination of the next COAS.\n“Nawaz Sharif had done the process four times and this time Shahbaz Sharif will do it. This issue had never become popular on media and Imran Khan had played a very negative role in this regard. This is a constitutional procedure and should be done on it’s time. The Army Chief had his loyalty to the state and it’s constitution. No one should have any question about it.”\nHe alleged that there were persistent attacks on the national security and stature of the nation as\nImran Khan was a national criminal for sabotaging relief efforts and barring intrnational agencies to stop aid to Pakistan.\nThe Defence Minister told the media that the PM would convene National Security Committee meeting after his return and the issues would be discussed pertaining to Imran Khan statements jeopardizing national security.\nThe law as per the constitution should be applied without any discrimination to all, he said.",
  "retrievedAt": "2025-08-11T15:35:22.601Z"
}
