{
  "title": "Punjab minister stresses reviving cultural values",
  "link": "https://www.app.com.pk/national/punjab-minister-stresses-reviving-cultural-values/",
  "date_published": "2021-03-16T13:20:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Mar 16 (APP):We must revive our golden, glorious and prestigious cultural values in order to further strengthen our rich heritage in addition to expediting the process of development in Punjab and Pakistan, said Mian Khayal Ahmed Castro, provincial minister for Culture and Colonies.\nAddressing a special function, organised by the Faisalabad Chamber of Commerce & Industry (FCCI) here to mark the Punjab Culture Day, he said that initially he was perturbed when the culture portfolio was given to him.\nHowever, later on, he along with his friends and colleagues understood the vitality of culture which actually means to build nations. He said that we should be proud of being Punjabi as our culture is one of the richest and oldest cultures in the world.\nEthical, social and societal values are directly linked with culture which is the main cause of its survival even after passage of 5,500 years. He appreciated the Punjab government which took a bold step to revive our unmatched traditions of love, brotherhood, harmony affinity, hospitality and unity and now every inhabitant of this province must contribute its role for the revival of our glorious past.\nHe paid rich tribute to Engineer Hafiz Ihtasham Javed, president FCCI, for organising the colorful show by following corona standard operating procedures (SOPs). He said that on the special directive of Punjab government, high civil and police officials performed their official obligations by wearing traditional Punjabi dresses.\nHe said that he is now contemplating to direct all officers to wear Punjabi dress in their offices at least once in month.\nDivisional Commissioner Saqib Manan said that generally we mix up culture and religion, which are two separate identities. He narrated an incident of his mother during migration saying that the elders of each village accorded them full protection in addition to providing them food and shelter on their way to Pakistan in 1947.\n“They actually maintained high cultural values which we must revive to educate and sensitise our younger generation,” he said.\nEarlier, Engineer Hafiz Ihtasham Javed said that we must be proud of our cultural heritage so that we could make this society more vibrant and effective. He also mentioned some leading Punjabi poets of “Sandal Bar” and said that they have very successfully documented the culture of their era.\nMian Aftab, Director local government, presented his Punjabi song in a poetic way to enthrall the audience.\nLater, Ihtasham Javed along with Mian Javed Iqbal presented the FCCI shield and gift to Khayal Castro and Divisional Commissioner Saqib Mannan.\nTraditional turbans were presented to the honorable guests before the start of the function.\nThe function was also attended by Senior Vice President Chaudhry Talat Mahmood, Vice President Rana Ayub Aslam Manj, Rana Muhammad Sikandar Azam Khan, Chaudhry Muhammad Nawaz, Mr. Muzammil Sultan, Chaudhry Ghulum Sarwar, Mr. Shafiq Kashif and Khalid Mahmood Shauq.",
  "retrievedAt": "2025-08-11T20:29:55.140Z"
}
