{
  "title": "Minister for timely completion of undergoing development projects",
  "link": "https://www.app.com.pk/national/minister-for-timely-completion-of-undergoing-development-projects/",
  "date_published": "2021-03-16T12:10:00.000Z",
  "source": "APP",
  "content": "BAHAWALPUR, Mar 16 (APP): Federal Minister for Housing and Works Tariq Basheer Cheema on Tuesday directed concerned officers to ensure timely completion of undergoing development projects to let people benefit from them to the fullest.\nHe made these remarks while presiding over a meeting to review the progress of Development Projects of Bahawalpur district. He said the quality of work should be maintained and no compromise to be made on standards of construction material.\nHe instructed officers to make periodic field visits to the sites of these development projects to monitor their progress. Deputy Commissioner Bahawalpur Muzaffar Khan Sial briefed the meeting that there were 23 development schemes undergoing in the district under the Community Development Programme for which funds of Rs 163.277 million were released.\nSo far, an amount of Rs 104.420 million has been spent on these schemes and three of these have already been completed. He further said that amount of Rs 1148.982 million was released for 89 development schemes of the Special Package, of which 30 have been completed and funds of Rs 799 million were utilized.\nHe also informed that 81 development schemes were initiated under Sustainable Development Goals Achievement Programme-1 for which Rs 146 million were released. Of these, 65 schemes have been completed and an amount of Rs 144 million was spent.\nHe further briefed that an amount of Rs 146.428 million was released for 69 development schemes of Sustainable Development Goals Achievement Programme-2.\nAs many as 25 of these schemes were completed and funds of Rs 94 million were utilized.\nDeputy Commissioner told the meeting that work on 44 schemes was started under the Annual Development Programme and funds of Rs 346.820 million were released.\nOut of these, Rs 227.820 were spent and 18 schemes were completed. The meeting was attended by MPA Dr Muhammad Afzal, MPA CH Ehsaan-ul-Haq and officers of concerned departments.",
  "retrievedAt": "2025-08-11T20:29:56.171Z"
}
