{
  "title": "PR takes steps to recover Rs8375 million from various departments",
  "link": "https://www.app.com.pk/national/pr-takes-steps-to-recover-rs8375-million-from-various-departments/",
  "date_published": "2021-03-16T09:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Pakistan Railways (PR) was making all out efforts to recover the outstanding amount of Rs8375million payable by the departments of the federal and provincial governments on account of using its different services.\nThe federal departments had to pay an amount of Rs709.084 million, provincial departments Rs1980.217 million and autonomous and private bodies Rs5685.736 million, an official in the Ministry of Railways told APP.\nOn the directives of Minister for Railways Azam Khan Swati, he said the Ministry of Railways has approached the federal and provincial departments for recovering the outstanding amount.\nTo a question, he said that Pakistan Railways has retrieved around 439.8 acres precious land worth billion of rupees from private individuals under its anti-encroachment operation across the country during the last two and half years.\nThe official said the encroachment operation has been launched with the assistance of railway police and district administrations.\nGiving details, he said the department retrieved 230.33 acres land in Punjab, 115.92 acres from Khyber Pakhtunkhwa, 81.81 acres from Sindh and 11.74 acres from Balochistan.\nThe official said that out of the total land, 66.687acres were commercial, 285.9 acres were residential and 87.213 acres were the agricultural land of the Pakistan Railways.\nHe said the government was taking several steps to retrieve encroached land from the land grabbers including detailed survey was being carried out to identify the encroached land, occupied by the individuals and under illegal occupation of various government departments.\nThe official said the campaign was being monitored by the Divisional Superintendents, Headquarters office and Ministry of Railways.\nThe Standard Operating Procedure (SOP) and joint procedure order have been issued since for strict implementation of this policy, the official added.\nHe said that First Information Reports (FIRs) were being lodged and cases were registered and sent to Pakistan Railways Judicial Magistrates for expeditious trial.",
  "retrievedAt": "2025-08-11T20:29:59.103Z"
}
