{
  "title": "Naval Chief meets top military leadership of Kingdom of Bahrain",
  "link": "https://www.app.com.pk/national/naval-chief-meets-top-military-leadership-of-kingdom-of-bahrain/",
  "date_published": "2021-03-16T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi during his official visit to Bahrain met top military leadership of Kingdom of Bahrain and discussed matters pertaining to maritime security and bilateral defence collaborations.\nDuring the visit, the Naval Chief called on Commander-in-Chief Bahrain Defence Forces (BDF) Field Marshal Shaikh Khalifa Bin Ahmed Al Khalifa, Commander Bahrain National Guard (BNG) Major General Sheikh Mohammed Bin Isa Bin Salman Al Khalifa, Commander Royal Bahrain Naval Forces (RBNF) Rear Admiral Mohammed Yousif Al Asam and Deputy Commander U.S. Naval Forces Central Command (US NAVCENT) Rear Admiral Curt Renshaw, in separate meetings, said a Pakistan Navy press release received here on Tuesday.\nUpon his arrival at RBNF Headquarter, the Admiral was received by Commander RBNF and a ceremonial Guard of Honour was presented to the Naval Chief on the occasion.\nA comprehensive briefing was also given to the Admiral regarding RBNF.\nDuring the separate meetings with military leadership of the Kingdom of Bahrain, matters related to maritime security and bilateral defence collaborations were discussed.\nThe Naval Chief highlighted Pakistan Navy’s initiative of Regional Maritime Security Patrol and contributions of Pakistan Navy to maintain peace and order at Indian Ocean Region.\nThe dignitaries greatly appreciated role and contributions of Pakistan Navy in maintaining peace and stability in the region.\nLater, the Naval Chief also called on the Deputy Commander HQ NAVCENT, Rear Admiral Curt Renshaw and discussed shared commitment towards maritime security.\nIt is expected that the visit of Chief of the Naval Staff to Bahrain would greatly enhance bilateral cooperation between both the countries in general and navies in particular.",
  "retrievedAt": "2025-08-11T20:29:58.712Z"
}
