{
  "title": "Islamabad Dialogue to hold objective discourse; bring local and global intellectuals",
  "link": "https://www.app.com.pk/national/islamabad-dialogue-to-hold-objective-discourse-bring-local-and-global-intellectuals/",
  "date_published": "2021-03-16T11:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): The Islamabad Security Dialogue, a two-day international conference, being organized by the National Security Division will bring together local and global intellectuals together for an objective discourse on traditional and non-traditional national security issues.\nThe two-day international conference being held from March 17 to 18 would be inaugurated by the Prime Minister whereas the second day session would be opened by the Chief of Army Staff General Qamar Javed Bajwa, said an official of National Security Division.\nThe opening session will hold extensive discussions on diverse issue ranging from Comprehensive National Security, security challenges in a transforming global and regional environment to Pakistan’s security imperatives, and the country’s perception among the comity of nations.\nThe session will be moderated by National Defence University.\nThe second session will shed light on the vision of Economic Security and the importance of economic diplomacy.\nPresident, Center for Aerospace and Security Studies (CASS) former Air Chief Marshal (R) Kaleem Saadat will convene the session with a diverse panel of local and international experts and economists.\nThe second day, to be opened by the Army Chief, will garner expert opinions on multifaceted issues of Instituting a Human Security Paradigm discussing diverse matters of Poverty Alleviation, managing Covid-19, championing Climate Change and, terrorism and violent extremism.\nThe fourth session will discuss regional peace and security whereas the last session will engage experts on the issue of evolving world order and Pakistan’s challenges and opportunities.\nThe Dialogue will be attended by federal ministers, global and regional experts and media. The event is being conducted in hybrid format with only limited participants invited to attend physically under strict Covid protocols.\nHowever, the dialogue would be telecast live at the official website of islamabad dialogue.com and multiple social media outlets.",
  "retrievedAt": "2025-08-11T20:29:58.709Z"
}
