{
  "title": "UNHCR appreciates international support for Afghan refugees",
  "link": "https://www.app.com.pk/national/unhcr-appreciates-international-support-for-afghan-refugees/",
  "date_published": "2021-03-16T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):UN refugee agency (UNHCR) on Tuesday appreciated the commitment of international community to continue support to Afghan refugees and host communities in Pakistan.\n“Pakistan has been hosting Afghan refugees for forty long years, many of them hoping to return home when they see conditions improve inside Afghanistan,” said UNHCR Representative, Noriko Yoshida, adding “But Pakistan deserves more of our support. Today’s visit to a refugee village in Haripur shows the international community’s resolve and solidarity to meet the needs of Afghan refugees and their host communities.”\nYoshida made these remarks during a field visit in Khyber Pakhtunkhwa accompanying a delegation of several European countries – including Belgium, Hungary, Italy, Poland, Spain, Sweden, Switzerland as well as the European Union.\nUNHCR and the delegation met with Afghan refugees and Pakistani host community members in Haripur to listen their stories and how they live together side by side as communities, as well as their outlook on the future.\nIn Kalabat Township, the delegation also visited a vocational and technical training center. Countries within the delegation have been contributing to technical and vocational training as part of UNHCR’s sustainable livelihoods programmes for Pakistani host community and Afghan refugee youth.\nYoshida said that the field visit was an opportunity for the delegation members to see how their support was being translated into tangible benefits for host communities and refugees in Pakistan.\nThe Commissionerate for Afghan Refugees was also represented during the field visit. They helped provide further information about the local reality that Afghan refugees face, and the impact of both humanitarian and development assistance.\nYoshida welcomed the European Union’s participation in the field. The European Union will take a lead role in 2021 as the inaugural chair of a group of countries – the Core Group – that will join their common efforts to help renew international support to a Solutions Strategy for Afghan Refugees.\nThe Strategy was devised first in 2012 by the Islamic Republics of Afghanistan, Iran and Pakistan, and UNHCR.\nIts aim is to foster support for Pakistan and its effort to protect and assist refugees, as well as ensure support for host communities.\nThe Strategy also focuses on the support needed for voluntary repatriation and the sustainable reintegration of refugees in Afghanistan.\nA Support Platform, which includes all three countries and UNHCR, was established in 2019 at a Global Refugee Forum in Switzerland to better guide sustained efforts to drive forward the Strategy.\nThe Core Group, which the European Union will chair in 2021, is composed of donors who are committed to working with the Support Platform as part of a common agenda to find solutions for Afghan refugees.",
  "retrievedAt": "2025-08-11T20:30:04.520Z"
}
