{
  "title": "Federal cabinet launches ‘Hurmat-e- Parcham’ campaign, shares pictures on social media with national flag",
  "link": "https://www.app.com.pk/national/federal-cabinet-launches-hurmat-e-parcham-campaign-shares-pictures-on-social-media-with-national-flag/",
  "date_published": "2024-07-25T07:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):The federal cabinet on Thursday launched “Huramat-e-Parcham campaign” in reaction to the attack by the angry protesters on the Pakistani embassy in Germany and the removal of the national flag.\nThe federal ministers released their pictures along with the Pakistani flag on social media.\nThe federal ministers also wrote messages of love and affection for the national flag on the social media platforms.\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Federal Minister for Power Sardar Awais Leghari, Minister for Privatization Abdul Aleem Khan, Minister for Industries and Production Rana Tanveer, Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar and other ministers also released pictures on social media with the national flag.\nFederal Minister for Information Ataullah Tarar also posted a picture with the national flag on social media with the couplet   “Chand Roshan Chamakta Sitara Rahey, Sab Se Oncha Yeh Jhanda Hamara Rahey” and said it was a clear message to the enemies of Pakistan.\nMinister for Petroleum Dr. Musadik Malik, Minister of State for Finance and Revenue Ali Pervaiz Malik and Minister for Commerce Jam Kamal Khan also released pictures with the national flag and the message ‘Pakistan Zindabad’.\nAttaullah Tarar appealed to political activists, journalists, intellectuals, teachers, lawyers, doctors, farmers, labourers, students, businessmen, patriotic Pakistanis abroad and Pakistani youth to be a part of the “Harmat Percham Campaign”.\nHe said that flag of Pakistan was a symbol of national identity and sovereignty which represented the unity and solidarity of the nation.\nHe said that the coming month August was the month of Pakistan’s independence, and the ” Hurmat- e- Percham campaign would be continued.\nTerming the sanctity of national flag a national responsibility, he said it was the duty of every Pakistani to follow it.\nIt should be noted that the “Hurmat-e-Parcham” campaign of the federal ministers was being well received on the social media.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:06:09.279Z"
}
