{
  "title": "Senate education body for resolving degree attestation issue by HEC",
  "link": "https://www.app.com.pk/national/senate-education-body-for-resolving-degree-attestation-issue-by-hec/",
  "date_published": "2024-07-25T15:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):Chairperson Senate Standing Committee on Federal Education and Professional Training Senator Bushra Anjum Butt on Thursday committed to addressing the widespread challenges of attestation and equivalency faced by students across all regions, including students involved in the pending cases.\nChairing the Senate Standing Committee on Federal Education and Professional Training, she expressed her dedication to youth empowerment through education.\nShe emphasized the need to collectively resolve these issues without dwelling on past grievances, stressing that politics should not be played at the stake of the future of the nation’s youth.\nSenator Butt acknowledged the concerns of the HEC’s chairman and expressed readiness to collaborate towards resolution.\nConsequently, the committee decided to convene a detailed session at HEC to outline the way forward on attestation matters. They also resolved to handle each case individually for fair treatment, and proposed a checklist on the HEC website outlining mandatory attestation and equivalency document requirements from universities.\nButt reiterated that a rigorous monitoring will have to be taken place in order to prevent issuance of fraudulent degrees, along the process, safeguarding the nation’s integrity. Additionally, universities facing issues were invited to an upcoming meeting to discuss their challenges.\nThe committee members unanimously prioritized student welfare, emphasizing swift resolution of students cases.\nAddressing concerns about fraudulent degrees and attestation, Senator Butt highlighted the HEC’s responsibility to identify and mark universities issuing fake degrees, advocating for clear public messaging and awareness campaigns.\nShe stressed accountability for failing to identify and penalize such universities, proposing measures to support affected students.\nThe committee decided that universities found issuing fraudulent degrees would face bans, and students would undergo testing for future admissions, with universities required to compensate affected students financially.\nThe committee urged HEC to take decisive actions against fraudulent universities and encouraged genuine universities to collaborate closely.\nSimilarly, discussions also covered New Port Institute of Communication and Economics Karachi, South Asia University Lahore, and Preston Institute of Management Science and Technology Karachi, Lahore, and their affiliated campuses. Details were provided regarding pending court cases and an ICA against WP filed by students of unlawful NICE Karachi campuses seeking degree recognition.\nThe HEC briefed on an initiative of constituting a committee to deliberate and propose a plan of action to address challenges faced by students and administrative issues in educational institutions.\nThe chairman committee also requested for an in camera meeting to unveil the fraudulence of these  universities by providing evidences on the same.\nAdditionally, the committee ratified Ms. Butt’s membership at Pakistan Institute of Fashion and Design Lahore and welcomed Senator Kazim Ali Shah and Gurdeep Singh as members of the Federal Board of Intermediate and Secondary Education.\nEarlier, the committee unanimously passed the “WAPDA University Islamabad Bill, 2024” proposed by Senators Fawzia Arshad, Rana Mahmood-Ul-Hassan, and Umer Farooq, endorsed by both the ministry and committee members.\nThe committee meeting was attended by Senators Syed Masroor Ahsan, Falaz Naz, and Fawzia Arshad, Chairman HEC, alongside senior officials from related departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:07:17.626Z"
}
