{
  "title": "Local leadership may be strengthened for improved disaster response: Speakers",
  "link": "https://www.app.com.pk/national/local-leadership-may-be-strengthened-for-improved-disaster-response-speakers/",
  "date_published": "2024-07-25T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):The speakers at a result validation workshop on humanitarian partnership landscape in Pakistan on Thursday underscored the need to harness the potential of international non-governmental organisations (INGOs) to strengthen local leadership at all community level for improved disaster response.\nThe Sustainable Development Policy Institute (SDPI) in collaboration with Oxfam Pakistan organised a one-day result validation workshop on the report titled “How has the Humanitarian Partnership Landscape Change in the Light of the Grand Bargain and Charter for Change (C4C) in Pakistan.\nDr Shafqat Munir said the country’s recurrent phenomenon of extreme weather events have exposed the vulnerabilities of the prevailing systems to catch up with the pace of natural calamities for a matching response.\nHe said the minute analysis of the 2010 and 2022 devastation floods have increased the demand for enabling local leadership with a clear role to lead disaster resilience efforts at the community level.\nThe Report, he said provides a detailed analysis and comparison of humanitarian aid by INGOs in the previous and most recent disasters that indicated a steady decline in the global partners response.\nIn his technical presentation research paper author, Salman Danish highlighted that whooping climate change impacts have made Pakistan the fifth most vulnerable country with intense flooding, melting glaciers, erratic rainfall and extreme heat waves as new normal.\nHe underlined that the international funding has been shifted from Pakistan to Africa region due to legislative constraints and bureaucratic hiccups in the system issuing no objection certificates (NOCs) and operating procedures.\nHowever, he underlined that in the absence of international relief the local communities have stepped up for humanitarian aid and response that indicated the potential need to promote local actors who have come forward and the research had focussed on this aspect.\n“The 2010 floods have impacted 22 million population of the country and some 158 INGOs had responded to the crisis whereas the 2022 floods affected 32 million masses but only 70 global humanitarian organisations responded the call.\nDuring the panel discussion, Member National Assembly (MNA), Farah Naz Akbar commended the study author for meticulously observing the crisis and presenting workable recommendations to come up with alternatives to the impending risks.\nShe said the country’s prevailing economic crisis demanded the quarters concerned to review the existing humanitarian response mechanisms.\nThe repeated occurrence of floods and natural disasters have affected our economy and society at an unprecedented scale, she added.\nThe legislator emphasized upon the need to critically review the decline in international humanitarian aid for the course correction of the country, MNA Farah Naz said.\nShe demanded that the nation should forge collaborations and cohesion for resilient partnerships at different tiers of disaster management and risk reduction to demonstrate its resilience against adverse climate crises.\nHead of Localisation and Partnerships, Pak Mission Society, Qamar Iqbal said the report needs to highlight specific recommendations pertaining to crosscutting themes and sectors for targeted interventions to enable promising outcomes.\nMoreover, a national reference of Grand Bargain needs to be introduced in the country for better understanding and adoption of the modern global concept.\nGlobal Expert on Corporate Governance and Sustainability, Prof Dr M Naveed proposed to link the study with sustainable development goals for a broader scope of the research to garner government support in this regard.\nCountry Director, Human Appeal, Daud Saqlain said the geopolitical tensions post Ukraine-Russia War and international dynamics have changed the global humanitarian aid perspective that demands the governments and local partners to act smartly for favourable outcomes while negotiating with INGOs and international donors.\nThe session ended at a healthy question hour session with members of civil society, government and private sector, and media representatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:07:22.618Z"
}
