{
  "title": "TikTok celebrates release of Jimin of BTS’ second solo album, MUSE, with exclusive in-app experience",
  "link": "https://www.app.com.pk/national/tiktok-celebrates-release-of-jimin-of-bts-second-solo-album-muse-with-exclusive-in-app-experience/",
  "date_published": "2024-07-25T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):TikTok, the go-to platform for music discovery, launched an immersive in-app experience celebrating the release of Jimin of BTS’ highly anticipated sophomore album, MUSE.\nThe #Jimin_Who hub offers fans worldwide a unique opportunity to engage with exclusive content, participate in challenges, and unlock limited-time rewards, said a news release.\nBy searching for related terms like ‘Jimin’ and ‘BTS’, will be presented with challenges to unlock a limited-time exclusive profile frame.\nAdditionally, the hub features top-performing content from Jimin, including his solo work and collaborations, Fan Spotlight showcasing standout members and their creations, and an immersive experience celebrating Jimin’s sophomore album, MUSE.\nThis initiative underscores TikTok’s commitment to empowering artists and fans to connect and create. With #kpop emerging as one of the fastest-growing genres on the platform, generating 59.8M posts and amassing 602B video views, and BTS being one of the most popular accounts, this experience is set to resonate with the global TikTok community.\nSince debuting over a decade ago, BTS (@bts_official_bighit) has established themselves as 21st century pop icons, breaking countless records and becoming the fourth leading artist account on TikTok.\nWith over 65.5M followers and 1.4B likes, hashtags related to the group continue to generate huge engagement, with #bts appearing in 94.1M creator videos and #bts_official_bighit in 33.4M. Jimin’s solo content has inspired millions of creator videos and views, cementing his status as a global superstar.\nHashtags related to #jimin have been featured in more than 22.9M creator videos. After releasing his debut solo album FACE last year, Jimin’s #1 song, ‘Like Crazy’, inspired more than 300K creator videos, and the dance video posted on the group’s TikTok was viewed over 36.2M times and received more than 8.6M likes. Jimin recently shared an exclusive behind the scenes video of the pre-release single “Smeraldo Garden Marching Band (feat. Loco)” from MUSE, which has been viewed by 11M fans and garnered 2.5M likes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:07:24.320Z"
}
