{
  "title": "PHC stays ECP action against PTI’s Shibli Faraz, Omar Ayub - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Peshawar High Court (PHC) on Wednesday halted the Election Commission of Pakistan (ECP) from taking any action against PTI leaders Shibli Faraz and Omar Ayub.\n\nThe ECP on Tuesday disqualified Faraz as the Senate opposition leader, Ayub as the National Assembly equivalent, then-MNAs Zartaj Gul, Sunni Ittehad Council chief Hamid Raza and other PTI lawmakers following their convictions in cases related to the May 9 riots.\n\nOn May 9, 2023, PTI supporters, protesting the party founder Imran Khan’s arrest, staged violent protests throughout the country, vandalising military installations and state-owned buildings, while also attacking the Lahore corps commander’s residence. Following the riots, thousands of protesters, including party leaders, were arrested.\n\nAn anti-terrorism court in Faisalabad last week senten­ced over PTI 100 leaders and workers to jail terms of up to 10 years in connection with the riots. Faraz, Zartaj Gul and Opposition Leader in the National Assembly Omar Ayub Khan were among those awarded rigorous imprisonment.\n\nIdentical orders issued today by a bench comprising Justice Arshad Ali and Justice Farah Jamshed said that Faraz and Ayub were in the process of appealing their convictions in the Lahore High Court (LHC) and had surrendered themselves before the PHC so they could approach the LHC.\n\nThe orders said that their convictions were not final and the ECP had not waited for the outcome of their appeals before disqualifying them. They directed notices be issued to the respondents in the matter and meanwhile, “the ECP shall not take any further process” under its notifications to disqualify the PTI leaders.\n\nThe orders adjourned both cases to Aug 20. The bench had granted protective bail to the two and Gul earlier today.\n\nTalking to the media, Ayub said the ECP had disqualified him without following due procedure. He thanked the PHC for granting transit bail so he could file his appeal.\n\nA day prior, Ayub lambasted the ATC’s “bogus verdict” in a post on X, saying that he would contest it and the ECP’s disqualification in court.\n\nHe also posted a video of himself at the PHC with other PTI leaders and lawyers, saying the court had given him a few days and bail would be granted to him on filing his appeal.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/3114475449f73b5.jpg?r=145013",
  "retrievedAt": "2025-08-16T07:07:26.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929106/phc-stays-ecp-action-against-ptis-shibli-faraz-omar-ayub",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T12:35:35.000Z"
}
