{
  "title": "PM calls for expanding low-cost loans for farmers, SMEs - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Directs ZTBL authorities to speed up reforms within bank\n• Terms SMEs engine of inclusive growth, innovation, employment\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Tuesday directed the authorities to simplify and expand access to low-cost agricultural loans for small- and medium-scale farmers and take measures for boosting of the Small and Medium Enterprises (SMEs) in the country.\n\nPresiding over a review meeting, the PM called it a critical step for boosting agricultural productivity and ensuring economic dignity for the country’s rural backbone.\n\nThe PM emphasised that small farmers must be treated with respect and given due facilitation, particularly when it comes to acquiring low-interest loans for their agricultural needs, a Prime Minister’s Office news release said.\n\nDuring the meeting, PM Shehbaz instructed authorities concerned to the accelerate reforms within the Zarai Taraqiati Bank Limited (ZTBL), and encourage private banks to step forward in offering concessional loans to the agricultural sector on easier terms.\n\nThe prime minister announced that he will chair review meetings every three weeks to monitor the implementation of loan facilitation initiatives and reforms at ZTBL.\n\nThe PM reiterated his government’s commitment to agricultural development and the empowerment of small farmers through institutional support, financial inclusion, and practical reforms.\n\nOfficials briefed the prime minister on the ongoing reform efforts at ZTBL, the bank’s performance, and proposed strategies to improve agricultural lending. The meeting also reviewed the role of private banks in supporting the agri-sector through credit disbursement.\n\nSmeda meeting\n\nLater, presiding over a separate meeting of the steering committee of the Small and Medium Enterprises Development Authority (Smeda), PM Shehbaz underscored the significance of SMEs as the engine of inclusive growth, innovation, and employment and termed them as enablers of national strength saying, “empowering them means empowering Pakistan”.\n\nHe underlining the government’s commitment to promote small and medium enterprises (SMEs) as a backbone of economic growth.\n\n“The growth of SMEs is among the top priorities of the government, and we are implementing reforms and initiatives on a fast-track basis to support this critical sector,” he said.\n\nOther major developments shared during the meeting included the outsourcing of the development of a credit scoring model for SMEs, strategic planning to enhance exports, legal framework for SME sub-contracting, and a national survey in collaboration with the Pakistan Bureau of Statistics to assess 20 key economic sectors.\n\nThe prime minister concluded the meeting by directing Smeda and relevant institutions to accelerate work on all pending initiatives, ensure effective coordination among stakeholders, and prioritise facilitation for women and micro entrepreneurs.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06095051ede53c4.png",
  "retrievedAt": "2025-08-16T07:09:16.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929029/pm-calls-for-expanding-low-cost-loans-for-farmers-smes",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:22:42.000Z"
}
