{
  "title": "PM directs FBR to eliminate bureaucratic barriers - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Urges full reform implementation by tax authority\n• Asks federal, provincial govts to maintain reform momentum\n• New Urdu tax forms expected to benefit over 80pc of filers\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Tuesday directed the Federal Board of Revenue (FBR) to ensure the full implementation of reforms by removing bureaucratic hurdles and institutional barriers.\n\nChairing a weekly review meeting on proposed reforms within the FBR, PM Shehbaz also expressed satisfaction over the increase in the country’s tax-to-GDP ratio, which rose from 8.83 per cent in FY24 to 10.24pc in FY25, its highest level in 23 years. He attributed the improvement to the implementation of structural reforms in the tax machinery.\n\nAn official announcement said the premier reaffirmed that he, along with the federal government, will fully support and safeguard the reform initiatives undertaken by the relevant authorities.\n\nThe premier was informed that the FBR has achieved its tax collection target for the first month (July 2025) of the current fiscal year and is expected to achieve its targets in the coming months as well.\n\nOfficials also briefed the meeting on the updated income tax return form, now available online in Urdu via the FBR website. The new form is designed to be more user-friendly and accessible, which is expected to benefit approximately 84pc of return filers.\n\nAccording to the announcement, PM Shehbaz also stressed the need for uniform and effective enforcement of “revolutionary” customs clearance reforms across the country.\n\nThe prime minister emphasised that integrating technology into the customs clearance reform agenda should substantially reduce procedural delays and improve institutional efficiency.\n\nHe urged both federal and provincial governments to maintain close coordination and adopt a unified strategy to preserve the momentum in tax collection achieved through FBR-led reforms in the upcoming fiscal year. He noted that the effective enforcement of existing tax measures would be critical to further boosting revenue.\n\nThe premier directed the formulation of a comprehensive strategy — developed in consultation with the FBR, relevant federal agencies and provincial authorities — to continue improving the tax-to-GDP ratio. He reaffirmed the approved timeline for FBR’s tax collection targets and reform milestones will remain unchanged.\n\nThe PM underscored the need to strengthen the institutional capacity of both FBR and the customs clearance system. He instructed the information ministry to raise public awareness about the reform agenda and its long-term benefits.\n\nThe meeting was informed that digital enforcement stations for customs clearance are being prioritised nationwide. The complete implementation of the Centralised Assessment Unit and faceless customs system is expected to significantly enhance efficiency and transparency.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06075108704c53a.jpg",
  "retrievedAt": "2025-08-16T07:09:28.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928960/pm-directs-fbr-to-eliminate-bureaucratic-barriers",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:22:25.000Z"
}
