{
  "title": "Two die, 13 injured as bus plunges into pond near near Ahmedabad link road - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: Two persons died and 13 others were injured when a speeding bus plunged into a pond near Ahmedabad Town on Tuesday.\n\nAs per Rescue 1122 officials, the accident occurred when the driver of the bus, going to Zafarwal from Gujranwala, lost control of the vehicle. As a result, the bus overturned and fell into a roadside pond near the Ahmedabad link road.\n\nOn being called, Rescue 1122 teams led by District Emergency Officer Engineer Muhammad Aurangzeb immediately reached the spot and launched an operation to rescue the passengers, including women and children, from the bus that had filled with dirty water from the pond.\n\nThe rescuers retrieved bodies of two passengers, identified as Sohaib (30) and Sadia Bibi (38), besides rescuing the injured, including Zarqa (13), Ali Raza (23), Fatima (5), Faisal (22), Qasim Ali (24), Suraiya Bibi (55), Obaidullah (50), Usman, Afzal, Shahid Mahmood, Riaz and Khalid Mahmood.\n\nThe Rescue 1122 medical team provided first aid to the injured and shifted them to the hospital. According to eyewitnesses, Tufail and Nasir Hussain, the accident occurred due to the high speed of the bus and the dilapidated road.\n\nAccording to Rescue 1122 sources, the condition of two of the injured passengers is said to be critical.\n\nMeanwhile, a woman died and eight other members of a family were injured when a speeding motorcycle-rickshaw crashed into a parked trailer at Sheikhupura.\n\nRana Haroon Ali, spokesperson for Rescue 1122, Sheikhupura, said that a speeding rickshaw, going to Lahore from Farooqabad, rammed into a trailer parked in front of City Centre, Kot Abdul Malik on Lahore Road.\n\nHe said that on being called, a rescue team immediately reached the spot and started operation. He said a woman, identified as Parveen Bibi (55), died on the spot, while eight other members of her family were injured in the accident.\n\nThe unidentified rickshaw driver fled the scene after the accident.\n\nThe Rescue 1122 medical team provided first aid to the injured and shifted them to the government hospital, while the body of the woman was handed over to the local police.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689290ded5817.gif",
  "retrievedAt": "2025-08-16T07:08:21.767Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928966/two-die-13-injured-as-bus-plunges-into-pond-near-near-ahmedabad-link-road",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:23:16.000Z"
}
