{
  "title": "Musk versus Modi: Inside the battle over India’s internet censorship - World - DAWN.COM",
  "author": null,
  "content": "In January, an old post on Elon Musk’s social media platform, X, became a concern for police in the Indian city of Satara. Written in 2023, the short message from an account with a few hundred followers described a senior ruling-party politician as “useless”.\n\n“This post and content are likely to create serious communal tension,” Inspector Jitendra Shahane wrote in a content-removal notice marked “Confidential” and addressed to X.\n\nThe post, which remains online, is among hundreds cited by X in a lawsuit it filed in March against India’s government, challenging a sweeping crackdown on social media content by Prime Minister Narendra Modi’s administration.\n\nSince 2023, India has ramped up efforts to police the internet by allowing many more officials to file takedown orders and to submit them directly to tech firms through a government website launched in October.\n\nX argues India’s actions are illegal and unconstitutional, and that they trample free speech by empowering scores of government agencies and thousands of police to suppress legitimate criticism of public officials.\n\nIndia contends in court documents that its approach tackles a proliferation of unlawful content and ensures accountability online. It says many tech companies, including Meta and Alphabet’s Google, support its actions. Both companies declined to comment for this story.\n\nMusk, who calls himself a free-speech absolutist, has clashed with authorities in the United States, Brazil, Australia and elsewhere over compliance and takedown demands.\n\nBut as regulators globally weigh free-speech protections against concerns about harmful content, Musk’s case against Modi’s government in the Karnataka High Court targets the entire basis for tightened internet censorship in India, one of X’s biggest user bases.\n\nMusk said in 2023 that the South Asian nation had “more promise than any large country in the world” and that Modi had pushed him to invest there.\n\nThis account of the behind-the-scenes battle between the world’s richest person and authorities in the world’s most populous country is based on a Reuters review of 2,500 pages of non-public legal filings and interviews with seven police officers involved in content-removal requests.\n\nIt reveals the workings of a takedown system shrouded in secrecy, some Indian officials’ ire over “illegal” material on X, and the broad spectrum of content that police and other agencies have sought to censor.\n\nWhile the takedown orders include many that sought to counter misinformation, they also encompass directives by Modi’s administration to remove news about a deadly stampede, and demands from state police to scrub cartoons that depicted the prime minister in an unfavourable light or mocked local politicians, the filings show.\n\nX didn’t respond to Reuters’ questions about the case, while India’s IT ministry declined to comment because the matter was before the court. Modi’s office and his home ministry didn’t respond to questions.\n\nThere have been no immediate signs of souring personal relations between Musk and Modi, who have enjoyed a warm public rapport. But the showdown comes as the South African-born entrepreneur, whose business empire includes EV maker Tesla and satellite internet provider Starlink, gears up to expand both ventures in India.\n\nEven supporters of Modi’s Bharatiya Janata Party (BJP) have faced scrutiny of their online musings from police officials newly empowered by the IT ministry to target social media activity.\n\nKoustav Bagchi, a lawyer and BJP member, posted an image on X in March that depicted a rival, West Bengal chief minister Mamata Banerjee, in an astronaut suit. State police issued a takedown notice, citing “risks to public safety and national security”.\n\nBagchi told Reuters the post, which is still online, was “light-hearted” and that he wasn’t aware of the takedown order. The chief minister’s office and state police didn’t respond to Reuters’ queries.\n\nOf the earlier 2023 post, Shahane, the Satara police officer, told Reuters he couldn’t recall the takedown order, but said police sometimes proactively ask platforms to block offensive viral content.\n\nFor years, only India’s IT and Information & Broadcasting ministries could order content removal, and only for threats to sovereignty, defense, security, foreign relations, public order, or incitement. Some 99 officials across India could recommend takedowns, but the ministries had the final say.\n\nWhile that mechanism remains in place, Modi’s IT ministry in 2023 empowered all federal and state agencies and police to issue takedown notices for “any information which is prohibited under any law”. They could do so under existing legal provisions, the ministry said in a directive, citing the need for “effective” content removal.\n\nCompanies that fail to comply can lose immunity for user content, making them liable for the same penalties a user might face — which could vary greatly depending on the specific material posted.\n\nModi’s government went a step further in October 2024. It launched a website called Sahyog — Hindi for collaboration — to “facilitate” the issuance of takedown notices, and asked Indian officials and social media firms to get on board, memos contained in court papers show.\n\nX didn’t join Sahyog, which it has called a “censorship portal”, and sued the government earlier this year, challenging the legal basis for both the new website and the IT ministry’s 2023 directive.\n\nIn a June 24 filing, X said some of the blocking orders issued by officials “target content involving satire or criticism of the ruling government, and show a pattern of abuse of authority to suppress free speech”.\n\nSome free-speech advocates have criticised the government’s stricter takedown regime, saying it is designed to stifle dissent.\n\n“Can a claim that some content is unlawful be termed as indeed unlawful merely because the government claims so?” said Subramaniam Vincent, director of journalism and media ethics at Santa Clara University’s Markkula Centre for Applied Ethics.\n\n“The executive branch cannot be both the arbiter of legality of media content, and the issuer of takedown notices.”\n\nCourt filings reviewed by Reuters show federal and state agencies ordered X to remove around 1,400 posts or accounts between March 2024 and June 2025.\n\nMore than 70 per cent of these removal notices were issued by the Indian Cybercrime Coordination Centre, which developed the Sahyog website.\n\nThe agency is within the home ministry, which is headed by Modi aide Amit Shah, a powerful figure in the ruling BJP.\n\nTo counter X in court, India’s government filed a 92-page report drafted by the cybercrime unit to show X is “hosting illegal content”. The unit analysed nearly 300 posts it deemed unlawful, including misinformation, hoaxes, and child sexual-abuse material.\n\nX serves as a vehicle for “spreading hate and division” that threatens social harmony, while “fake news” on the platform has sparked unspecified law-and-order issues, the agency said in the report.\n\nThe government’s response to X’s lawsuit highlighted examples of misinformation.\n\nIn January, the cybercrime unit asked X to remove three posts containing what officials said were fabricated images that portrayed Shah’s son, International Cricket Council chairman Jay Shah, “in a derogatory manner” alongside a bikini-clad woman.\n\nThe posts “dishonour prominent office bearers and VIPs”, the notices said.\n\nTwo of those posts remain online. Jay Shah didn’t respond to Reuters queries.\n\nOther directives went beyond targeting fake news. X told the court India’s railways ministry has been issuing orders to censor press reports about matters of public interest.\n\nThese included February directives seeking the removal of posts by some media outlets, including two by Adani Group’s NDTV, that contained news coverage of stampede at New Delhi’s biggest railway station that left 18 dead.\n\nThe NDTV posts are still online. NDTV didn’t respond to Reuters queries and the railways ministry declined to comment.\n\nIn April, police in Chennai asked X to remove many “deeply offensive” and “provocative” posts, including a now-inaccessible cartoon featuring a red dinosaur labelled “inflation”, which portrayed Modi and the chief minister of Tamil Nadu state as struggling to control prices.\n\nThe same month, police demanded the removal of another cartoon that mocked the state government’s lack of preparedness for floods by showing a boat with holes.\n\nX told the judge the cartoon was posted in November, and it could not “incite political tensions” several months later, as the Chennai police asserted. The post remains online.\n\nThe state government didn’t respond to a request for comment.\n\nWhen Reuters visited the Chennai cybercrime police station that issued these directives, Deputy Commissioner B. Geetha criticised X for seldom acting on takedown requests.\n\nX does not “fully grasp the cultural sensitivities”, she said. “What may be acceptable in some countries can be considered taboo in India.”",
  "tags": [],
  "categories": [],
  "image": "www.dawn.com/news/1922534",
  "retrievedAt": "2025-08-16T07:07:32.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929096/musk-versus-modi-inside-the-battle-over-indias-internet-censorship",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T11:24:55.000Z"
}
