{
  "title": "Modi to visit China for first time in 7 years as tensions with US rise - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi will visit China for the first time in over seven years, a government source said on Wednesday, in a further sign of a diplomatic thaw with Beijing as tensions with the United States rise.\n\nModi will go to China for a summit of the multilateral Shanghai Cooperation Organisation (SCO) that begins on Augst 31, the government source, with direct knowledge of the matter, told Reuters. India’s foreign ministry did not immediately respond to a request for comment.\n\nHis trip will come at a time when India’s relationship with the US faces its most serious crisis in years after President Donald Trump imposed the highest tariffs among Asian peers on goods imported from India, and has threatened an unspecified further penalty for New Delhi’s purchases of Russian oil.\n\nModi’s visit to the Chinese city of Tianjin for the summit of the SCO, a Eurasian political and security grouping that includes Russia, will be his first since June 2018. Subsequently, Sino-Indian ties deteriorated sharply after a military clash along their disputed Himalayan border in 2020.\n\nModi and Chinese President Xi Jinping held talks on the sidelines of a BRICS summit in Russia in October that led to a thaw. The giant Asian neighbours are now slowly defusing tensions that have hampered business relations and travel between the two countries.\n\nTrump has threatened to charge an additional 10pc tariff on imports from members — which include India — of the BRICS group of major emerging economies for “aligning themselves with anti-American policies”.\n\nTrump said on Wednesday his administration would decide on the penalty for buying Russian oil after the outcome of US efforts to seek a last-minute breakthrough that would bring about a ceasefire in the war in Ukraine.\n\nTrump’s top diplomatic envoy, Steve Witkoff, is in Moscow, two days before the expiry of a deadline the president set for Russia to agree to peace in Ukraine or face new sanctions.\n\nMeanwhile, India’s National Security Adviser Ajit Doval is in Russia on a scheduled visit and is expected to discuss India’s purchases of Russian oil in the wake of Trump’s pressure on India to stop buying Russian crude, according to another government source, who also did not want to be named.\n\nDoval is likely to address India’s defence cooperation with Russia, including obtaining faster access to pending exports to India of Moscow’s S400 air defence system, and a possible visit by President Vladimir Putin to India.\n\nDoval’s trip will be followed by Foreign Minister Subrahmanyam Jaishankar in the weeks to come.\n\nUS and Indian officials told Reuters a mix of political misjudgement, missed signals and bitterness scuttled trade deal negotiations between the world’s biggest and fifth-largest economies, whose bilateral trade is worth over $190 billion.\n\nIndia expects Trump’s crackdown could cost it a competitive advantage in about $64bn worth of goods sent to the US that account for 80pc of its total exports, four separate sources told Reuters, citing an internal government assessment.\n\nHowever, the relatively low share of exports in India’s $4 trillion economy is expected to limit the direct impact on economic growth.\n\nOn Wednesday, the Reserve Bank of India left its GDP growth forecast for the current April-March financial year unchanged at 6.5pc and held rates steady despite the tariff uncertainties.\n\nIndia’s government assessment report has assumed a 10pc penalty for buying Russian oil, which would take the total US tariff to 35pc, the sources said.\n\nIndia’s trade ministry did not immediately respond to a request for comment.\n\nThe internal assessment report is the government’s initial estimate and will change as the quantum of tariffs imposed by Trump becomes clear, all four sources said.\n\nIndia exported goods estimated at around $81bn in 2024 to the U.S.\n\nThe South Asian nation’s goods exports to the US constituted 2pc of GDP in 2024. Its total goods exports globally were at $443bn in 2024.\n\nThe proposed tariffs on India’s high-value exports face “erosion of price competitiveness encountering intensified rivalry from countries subject to lower duties”, two sources said, citing the internal assessment.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06165607ae6a84c.png",
  "retrievedAt": "2025-08-16T07:07:33.835Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929105/modi-to-visit-china-for-first-time-in-7-years-as-tensions-with-us-rise",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T12:09:36.000Z"
}
