{
  "title": "Hiroshima marks 80 years as US-Russia nuclear tensions rise - World - DAWN.COM",
  "author": null,
  "content": "Japan marked 80 years since the atomic bombing of Hiroshima on Wednesday with a ceremony reminding the world of the horrors unleashed, as sabre-rattling between the United States and Russia keeps the nuclear “Doomsday Clock” close to midnight.\n\nA silent prayer was held at 8:15am (4:15am PKT), the moment when US aircraft Enola Gay dropped “Little Boy” over the western Japanese city on August 6, 1945.\n\nOn a sweltering morning, hundreds of black-clad officials, students and survivors laid flowers at the memorial cenotaph, with the ruins of a domed building in the background, a stark reminder of the horrors that unfolded.\n\nIn a speech, Hiroshima mayor Kazumi Matsui warned of “an accelerating trend toward military buildup around the world”, against the backdrop of Russia’s invasion of Ukraine and the chaos in the Middle East.\n\n“These developments flagrantly disregard the lessons the international community should have learned from the tragedies of history,” he said.\n\nPrime Minister Shigeru Ishiba said it was Japan’s mission “to take the lead… toward a world without nuclear weapons”.\n\nThe final death toll of the Hiroshima attack would hit around 140,000 people, killed not just by the colossal blast and the ball of fire, but also later by the radiation.\n\nThree days after “Little Boy”, on August 9, another atomic bomb killed 74,000 people in Nagasaki. Imperial Japan surrendered on August 15, bringing an end to World War II.\n\nToday, Hiroshima is a thriving metropolis of 1.2 million but the attacks live on in the memories of many.\n\nOn the eve of the ceremony, people began lining up to pay their respects to the victims in front of the cenotaph.\n\nBefore dawn on Wednesday, families who lost loved ones in the attack also came to pray.\n\nYoshie Yokoyama, 96, who arrived in a wheelchair with her grandson, told reporters that her parents and grandparents were bomb victims.\n\n“My grandfather died soon after the bombing, while my father and mother both died after developing cancer. My parents-in-law also died, so my husband couldn’t see them again when he came back from battlefields after the war.\n\n“People are still suffering,” she added.\n\nWednesday’s ceremony was set to include a record of around 120 countries and regions including, for the first time, Taiwanese and Palestinian representatives.\n\nThe US — which has never formally apologised for the bombings — was represented by its ambassador to Japan. Russia and China were absent.\n\nNihon Hidankyo, the grassroots organisation that last year won the Nobel Peace Prize, is representing the dwindling number of survivors, known as hibakusha.\n\nAs of March, there were 99,130 hibakusha, according to the Japanese health ministry, with the average age of 86.\n\n“I want foreign envoys to visit the peace memorial museum and understand what happened,” the group’s co-chair, Toshiyuki Mimaki, told local media ahead of the commemorations.\n\nPope Leo XIV said in a statement that “in our time of mounting global tensions and conflicts”, Hiroshima and Nagasaki remained “living reminders of the profound horrors wrought by nuclear weapons”.\n\nUnited Nations Secretary-General Antonio Guterres warned that “the very weapons that brought such devastation to Hiroshima and Nagasaki are once again being treated as tools of coercion”.\n\nThe attacks remain the only time atomic bombs have been used in wartime.\n\nKunihiko Sakuma, 80, who survived the blasts as a baby, told AFP he was hopeful that there could eventually be a nuclear-free world.\n\n“The younger generation is working hard for that end,” he said ahead of the ceremony.\n\nBut in January, the Bulletin of the Atomic Scientists’ “Doomsday Clock” shifted to 89 seconds to midnight, the closest in its 78-year history.\n\nThe clock symbolising humanity’s distance from destruction was last moved to 90 seconds to midnight over Russia’s invasion of Ukraine in 2022.\n\nRussia and the US account for around 90 per cent of the world’s over 12,000 warheads, according to the Stockholm International Peace Research Institute (SIPRI).\n\nSIPRI warned in June that “a dangerous new nuclear arms race is emerging at a time when arms control regimes are severely weakened,” with nearly all of the nine nuclear-armed states modernising their arsenals.\n\nEarlier this month, US President Donald Trump said that he had ordered the deployment of two nuclear submarines following an online spat with former Russian president Dmitry Medvedev.\n\nHeader image: Doves are released after the Peace Declaration during the annual memorial ceremony at the Hiroshima Peace Memorial Park to mark 80 years since the world’s first atomic bomb attack, in Hiroshima on August 6, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06145308b391b8f.jpg",
  "retrievedAt": "2025-08-16T07:07:40.744Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929088/hiroshima-marks-80-years-as-us-russia-nuclear-tensions-rise",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T10:22:43.000Z"
}
