{
  "title": "Non-tax bonanza pushes tax ratio to 21-year high - Business - DAWN.COM",
  "author": null,
  "content": "• Official data shows overall tax-to-GDP ratio at 15.7pc in FY25, highest since 2004\n• Non-tax revenue up by 68pc\n\nISLAMABAD: The overall tax-to-GDP ratio increased by a record 3.2 percentage points in fiscal year 2025 to reach 15.7pc — the highest in over two decades.\n\nThe record earnings came on the back of heavy taxes imposed by the government to implement strict conditions outlined in the IMF loan programme and last-minute windfalls from non-tax revenue (NTRs).\n\nDuring FY2024-25, the non-tax revenue grew by 68 per cent against a 26pc growth in tax revenues, indicating the government’s focus remained more on revenue numbers than tax reforms.\n\nAccording to the fiscal operations data released by the Ministry of Finance on Monday, the tax-to-GDP ratio has hit a 21-year peak of 15.7pc.\n\nThe previous high was 18pc in FY04. Since then, the ratio has been faltering between 10 to 15pc, except for 15.5pc and 15.2pc in FY17 and FY18, respectively and then again at 15pc in FY20 — all under IMF monitoring.\n\nThe growth of 3.2 percentage points in the overall tax-to-GDP last fiscal year was also the highest single-year increase. The previous record was 2.3pc in FY20 when the then government had imposed massive taxes as part of the IMF loan programme.\n\nRecord non-tax revenue\n\nThe non-tax revenue collection stood at Rs5.27tr for FY25. It amounted to 4.6pc of GDP, the highest in 16 years. Non-tax revenues include levies like the State Bank profit, markup collection from public sector entities, passport fee, oil and gas royalties, Gas Infrastructure Develop­ment Cess, Petroleum Development Levy, etc.\n\nThe non-tax revenue also surpassed the budget target of Rs4.84tr.\n\nThe ministry attributed the increase in revenues mainly to 68pc growth in non-tax collection as a consequence of higher collection of SBP profit and PDL.\n\nThe MOF had reported petroleum levy collection at Rs1.16tr in the 2026 budget.\n\nHowever, updated data has now put the figure at Rs1.22tr, showing a windfall of about Rs60bn.\n\nAnother Rs108bn windfall came in the shape of markup collection from public sector entities. It was reported to be at Rs150bn in budget documents but finalised at Rs258bn. These windfalls reduced the fiscal deficit to a 9-year low of 5.4pc in FY25, about 1.4pc lower than 6.8pc of FY24.\n\nThe primary fiscal surplus — difference between total revenues and expenditures except interest payments — stood at 2.4pc of GDP or Rs6.17tr.\n\nIt was the highest since this new indicator was adopted for fiscal monitoring about a decade ago.\n\nThe Ministry of Finance had revised the FBR’s final revenue collection to Rs11.74tr against estimates of Rs11.9tr in the 2026 budget and the original target of Rs12.97tr.\n\nThis translated into a tax shortfall of Rs1.23tr, the country’s highest ever tax shortfall.\n\nTotal expenditure stood at 21.1pc of GDP (or Rs24.16tr), the highest since FY21.\n\nTotal federal mark-up payments and debt servicing for FY25 stood at Rs8.89tr, of which Rs7.98tr was for domestic debt servicing and Rs890bn for external debt servicing.\n\nThe total primary current expenditures for FY25 were recorded at Rs12.64tr, of which the federal portion amounted to Rs6.81tr, while provincial governments accounted for Rs5.83tr.\n\nIn FY25, total development and net lending expenditures was Rs2.97tr, including Rs786bn for the federal PSDP, including Rs2.12tr for provincial development.\n\nThe total statistical discrepancies were reported at negative Rs329bn, comprising Rs193bn from the federal government and Rs136bn from the provinces.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68929d88925e5.gif",
  "retrievedAt": "2025-08-16T07:08:53.346Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929033/non-tax-bonanza-pushes-tax-ratio-to-21-year-high",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:22:49.000Z"
}
