{
  "title": "Trump jokes about installing missiles on White House roof - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Donald Trump made an unexpected appearance on Tuesday on a White House rooftop and joked about installing nuclear missiles at a time of escalating tensions with Russia.\n\nThe US president, flanked by bodyguards and under the protection of snipers, strolled for 20 minutes on the flat roof above the press room as he looked across to the site of his proposed new ballroom.\n\nAsked why he was on the roof, he replied he was just “taking a little walk.” Quizzed about what he intended to build, he joked “nuclear missiles,” before appearing to mimic the launch of a weapon with his arm.\n\nThe United States and Russia have engaged in heated rhetoric for several days. Trump last week ordered the deployment of two nuclear submarines near Russia in response to remarks he deemed provocative by former Russian president Dmitri Medvedev.\n\n$200 million project\n\nWith his planned ballroom and other projects, Trump is determined to leave an imprint on the White House, drawing inspiration from the opulent style of his private properties.\n\nHe has paved the lawn of the famous Rose Garden and adorned the Oval Office with lavish golden ornamentation. The 79-year-old leader recently announced plans for the ballroom, in what is shaping up to be the most significant project at 1600 Pennsylvania Avenue in over a century.\n\nHe has vowed that he — with perhaps some help from private donors — would pay for all the work, estimated at $200 million. “It’s just another way to spend my money for the country,” he said.\n\nA former reality TV host, Trump is known for his public appearances that are half-comical, half-provocative, delighting his supporters and providing television networks with the images they relish.\n\nIn 2015, he announced his presidential candidacy after slowly descending a golden escalator.\n\nAnd during the last presidential campaign, he staged photo ops in a garbage truck cabin and served fries in a McDonald’s restaurant.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68929951b9935.gif",
  "retrievedAt": "2025-08-16T07:08:34.657Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929011/trump-jokes-about-installing-missiles-on-white-house-roof",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:23:02.000Z"
}
