{
  "title": "High-stakes bid for Telenor faces key test - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Tele­com­munication Company Ltd (PTCL) on Tues­day presented a detailed business development plan to the Competition Commission of Pakistan (CCP), marking a crucial step in the ongoing process of acquiring Telenor Pakistan. This submission comes after the CCP had earlier agreed to the acquisition of Telenor Pakistan (Pvt) Ltd and Orion Towers, contingent on certain conditions.\n\nThe CCP had raised multiple concerns regarding PTCL’s proposed takeover, particularly its ongoing financial losses. Despite these concerns, the commission granted conditional approval, allowing PTCL to proceed with the acquisition, provided the company made significant investments in the country’s telecom sector.\n\nDuring the hearing, which was chaired by CCP Chairman Dr Kabir Ahmed Sidhu, along with members Salman Amin and Abdul Rashid Sheikh, PTCL responded to the CCP’s objections. The commission had previously requested a resubmission of the business plan, seeking clarification on various aspects of the merger’s potential impact on competition and consumers.\n\nThe PTCL delegation offered a comprehensive briefing on its proposed business plan, claiming potential efficiencies and regulatory compliance, while highlighting the benefits of economies of scale resulting from the merger.\n\nPTCL submits business plan to CCP for acquisition, addressing objections and highlighting efficiencies\n\nThe CCP bench raised key questions regarding the source of investment for the proposed merger, as well as the expansion plans for the combined entity, which would include PTCL, Ufone, and Telenor Pakistan. PTCL representatives reassu­red the commission that the merger would lead to greater operational efficiencies by eliminating redundant infrastructure, such as towers and offices.\n\nAnother significant issue raised was the restrictions imposed by the Pakistan Telecommunication Authority (PTA) on PTCL. The PTA has designated PTCL as a significant market player in six out of 11 telecom segments, although PTCL has challenged this decision in the Sindh High Court.\n\nThe CCP also probed PTCL’s financial health, specifically regarding its “Regulatory Accounts,” pointing to PTCL’s continuous losses despite the profitability of competitors such as Zong, Jazz, and Telenor Pakistan. Ufone, PTCL’s cellular arm, was also noted for its long-standing losses.\n\nThe PTCL Group, which also owns Ubank, a microfinance bank, is expected to submit further clarifications on these matters to the CCP. The acquisition case, first announced by Telenor in December 2023, is still pending regulatory approval.\n\nPTCL is a state-owned entity, with the Government of Pakistan holding a 62pc stake. The remaining 12pc is publicly traded, and in 2006, Etisalat, a UAE-based telecom operator, acquired 26pc of PTCL’s shares, assuming management control. Prior to this transfer, PTCL had reported a net profit of Rs20.78bn in 2005-06, but it has been operating at a loss since then.\n\nA recent finance ministry report revealed that PTCL ranked seventh among the top loss-making state-owned enterprises (SOEs) for the first half of fiscal year 2023-24. The same report also highlighted that PTCL’s pension liabilities stood at Rs42.84bn.\n\nFurther complicating the merger, the finance ministry has warned that the integration of Telenor’s operations, systems, and workforce with PTCL and Ufone could be challenging. These integration issues could lead to operational disruptions, cultural clashes, and potential customer churn.\n\nApart from its operations in Pakistan, Telenor Group has telecom businesses in several other countries, including Grameenphone in Bang­ladesh (55.8pc ownership), CelcomDigi in Malaysia (33.1pc ownership), and True Corporation in Thailand (30.3pc ownership). The group also maintains regional offices in Bangkok and Singapore.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/141019552ecf86d.jpg?r=102035",
  "retrievedAt": "2025-08-16T07:08:54.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929035/high-stakes-bid-for-telenor-faces-key-test",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:22:48.000Z"
}
