{
  "title": "Pakistan starts deporting registered Afghan refugees: UNHCR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan has started to deport documented Afghan refugees ahead of its deadline for them to leave, according to the United Nations, in a move that could see more than 1 million Afghans expelled from the country.\n\nThe country’s decision follows the interior ministry’s announcement on July 31 that Proof of Registration (PoR) cardholders — the last category of Afghans legally residing in Pakistan without visas — became unlawful residents after their cards expired on June 30.\n\nHowever, the federal government has informed the provinces that the formal repatriation and deportation of over 1.3 million Afghan refugees holding PoR cards will begin on September 1.\n\nThe United Nations High Commissioner for Refugees (UNHCR) said that it had received reports of arrests and expulsions of legally registered Afghans across the country before Pakistan’s September 1 deadline for them to leave.\n\nThe UNHCR said that sending the Afghans back in this way was a breach of Pakistan’s international obligations.\n\n“UNHCR is calling on the government to stop the forcible return and adopt a humane approach to ensure voluntary, gradual, and dignified return of Afghans,” it said in a statement.\n\nThe voluntary return of the documented refugees shall commence forthwith, said a Pakistan’s interior ministry order seen by Reuters. It said the formal deportation process will start after the deadline.\n\nBut Qaisar Khan Afridi, a spokesman for the UNHCR, told Reuters on Wednesday that hundreds of legally registered Afghan refugees had already been detained and deported to Afghanistan from August 1 to August 4.\n\nThe interior ministry did not respond to a Reuters request for a comment.\n\nMore than 1.3 million Afghans hold documentation known as PoR cards, while 750,000 more have another form of registration known as an Afghan Citizen Card.\n\nMany Afghans have been settled in Pakistan since the 1980s, to escape cycles of war in Afghanistan.\n\n“Such massive and hasty return could jeopardise the lives and freedom of Afghan refugees, while also risking instability not only in Afghanistan but across the region,” UNHCR said.\n\nPakistani authorities have said that Islamabad wants all Afghan nationals to leave, except for those who have valid visas.\n\nThe repatriation drive by Pakistan is part of a campaign called the Illegal Foreigners Repatriation Plan, launched in late 2023.\n\nPakistan has in the past blamed militant attacks and crimes on Afghan citizens, who form the largest migrant group in the country. Afghanistan has rejected the accusations and has termed the repatriations as forced deportation.\n\nIn addition to the repatriation from Pakistan, Afghanistan also faces a fresh wave of mass deportations from Iran.\n\nAid groups worry that the influx risks further destabilising the country.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:07:33.130Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929095/pakistan-starts-deporting-registered-afghan-refugees-unhcr",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T11:07:58.000Z"
}
