{
  "title": "Missed signals, lost deal: How India-US trade talks collapsed - World - DAWN.COM",
  "author": null,
  "content": "After five rounds of trade negotiations, Indian officials were so confident of securing a favourable deal with the United States that they even signalled to the media that tariffs could be capped at 15 per cent.\n\nIndian officials expected US President Donald Trump to announce the deal himself weeks before the August 1 deadline. The announcement never came.\n\nNew Delhi is now left with the surprise imposition of a 25pc tariff on Indian goods from Friday, along with unspecified penalties over oil imports from Russia, while Trump has closed larger deals with Japan and the EU, and even offered better terms to arch-rival Pakistan.\n\nInterviews with four Indian government officials and two US government officials revealed previously undisclosed details of the proposed deal and an exclusive account of how negotiations collapsed despite technical agreements on most issues.\n\nThe officials on both sides said a mix of political misjudgment, missed signals and bitterness broke down the deal between the world’s biggest and fifth-largest economies, whose bilateral trade is worth over $190 billion.\n\nThe White House, the US Trade Representative office, and India’s Prime Minister’s Office, along with the External Affairs and Commerce ministries, did not respond to emailed requests for comment.\n\nIndia believed that after visits by Indian Trade Minister Piyush Goyal to Washington and US Vice President JD Vance to Delhi, it had made a series of deal-clinching concessions.\n\nNew Delhi was offering zero tariffs on industrial goods that formed about 40pc of US exports to India, two Indian government officials told Reuters.\n\nDespite domestic pressure, India would also gradually lower tariffs on US cars and alcohol with quotas and accede to Washington’s main demand of higher energy and defence imports from the US, the officials said.\n\n“Most differences were resolved after the fifth round in Washington, raising hopes of a breakthrough,” one of the officials said, adding negotiators believed the US would accommodate India’s reluctance on duty-free farm imports and dairy products from the US.\n\nIt was a miscalculation. Trump saw the issue differently and wanted more concessions.\n\n“A lot of progress was made on many fronts in India talks, but there was never a deal that we felt good about,” said one White House official. “We never got to what amounted to a full deal — a deal that we were looking for.”\n\nIndian Prime Minister Narendra Modi, who visited Washington in February, agreed to target a deal by fall 2025, and more than double bilateral trade to $500bn by 2030.\n\nTo bridge the $47bn goods trade gap, India pledged to buy up to $25bn in US energy and boost defence imports.\n\nBut officials now admit India grew overconfident after Trump talked up a “big” imminent deal, taking it as a signal that a favourable agreement was in hand.\n\nNew Delhi then hardened its stance, especially on agriculture and dairy, two highly sensitive areas for the Indian government.\n\n“We are one of the fastest growing economies, and the US can’t ignore a market of 1.4bn,” one Indian official involved in the negotiations said in mid-July.\n\nNegotiators even pushed for relief from the 10pc average US tariff announced in April, plus a rollback of steel, aluminium and auto duties.\n\nLater, India scaled back expectations after the US signed trade deals with key partners including Japan, and the European Union, hoping it could secure a similar 15pc tariff rate with fewer concessions.\n\nThat was unacceptable to the White House.\n\n“Trump wanted a headline-grabbing announcement with broader market access, investments and large purchases,” said a Washington-based source familiar with the talks.\n\nAn Indian official acknowledged New Delhi wasn’t ready to match what others offered.\n\nSouth Korea, for example, struck a deal just before Trump’s August 1 deadline, securing a 15pc rate instead of 25pc by offering $350bn in investments, higher energy imports, and concessions on rice and beef.\n\n“At one point, both sides were very close to signing the deal,” said Mark Linscott, a former US Trade Representative who now works for a lobby group that is close to the discussions between the two nations. “The missing component was a direct line of communication between President Trump and Prime Minister Modi.”\n\nA White House official strongly disputed this, noting other deals had been resolved without such intervention. An Indian government official involved in the talks said Modi could not have called, fearing a one-sided conversation with Trump that could put him on the spot.\n\nHowever, the other three Indian officials said Trump’s repeated remarks about mediating the India-Pakistan conflict further strained negotiations and contributed to Modi not making a final call.\n\n“Trump’s remarks on Pakistan didn’t go down well,” one of them said. “Ideally, India should have acknowledged the US role while making it clear the final call was ours.”\n\nA senior Indian government official blamed the collapse on poor judgment, saying top Indian advisers mishandled the process. “We lacked the diplomatic support needed after the US struck better deals with Vietnam, Indonesia, Japan and the EU,” the official said. “We’re now in a crisis that could have been avoided.”\n\nTrump said on Tuesday he would increase the tariff on imports from India from the current rate of 25pc “very substantially” over the next 24 hours and alleged that New Delhi’s purchases of Russian oil were “fuelling the war” in Ukraine.\n\nTalks are ongoing, with a US delegation expected in Delhi later this month and Indian government officials still believe the deal can be salvaged from here.\n\n“It’s still possible,” one White House official said.\n\nThe Indian government is re-examining areas within the farm and dairy sectors where concessions can be made, the fourth official said. On Russian oil, India could reduce some purchases in favour of US supplies if pricing is matched.\n\n“It likely will require direct communication between the prime minister and the president,” said Linscott.\n\n“Pick up the phone. Right now, we are in a lose-lose. But there is real potential for a win-win trade deal.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06112345b14bbe1.png",
  "retrievedAt": "2025-08-16T07:07:47.390Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929068/missed-signals-lost-deal-how-india-us-trade-talks-collapsed",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T08:12:39.000Z"
}
