{
  "title": "Enforced disappearances, other issues fuelling public alienation, political instability in Balochistan: HRCP - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Human Rights Commission of Pakistan (HRCP) on Wednesday revealed that enforced disappearances and other issues were fuelling public alienation and political instability in Balochistan following a fact-finding mission to the province.\n\nAccording to the report, titled Balochistan’s Crisis of Trust, the HRCP undertook the mission from July 9-12 to respond to the “escalating concerns over the deteriorating state of fundamental rights and civic freedoms in the province”. The mission aimed to examine the state of fundamental freedoms in the province and the broader impact of conflict and militarisation on civilian life, the report said in its terms of reference.\n\nIn a press release issued today, the HRCP said: “The mission’s findings reveal a disturbing pattern of continued enforced disappearances, shrinking civic space, erosion of provincial autonomy and unchecked impunity — conditions that continue to fuel public alienation and political instability.”\n\nThe mission observed that the state’s framing of the issue “risks normalising what international human rights law considers a crime against humanity”, it said, adding that the report called for independent investigations into alleged reprisals against those who spoke up against enforced disappearances.\n\nWhile stating that terrorist attacks on ordinary citizens, including non-Baloch settlers, were “indefensible and must be prosecuted”, the HRCP called the passage of the Anti-Terrorism (Balochistan Amendment) Act, 2025, “deeply problematic”.\n\n“The law permits 90-day detentions without meaningful judicial oversight, raising concerns about the potential for torture and abuse,” the HRCP said, urging the government to withdraw the act and ensure compliance with human rights obligations in all counterterrorism efforts.\n\nCiting the report, the press release said that electoral manipulation and political sidelining of nationalist parties had “severely undermined public trust in democratic processes”.\n\n“The mission recommends that the state ensure transparency, fairness and accountability in all electoral processes by investigating credible allegations of rigging and depoliticising administrative structures to avoid further political disaffection,” it added.\n\nIt continued, “The mission has called for the demilitarisation of civilian law enforcement and for a unified civilian police force with adequate resources and training in community-based, rights-compliant policing to replace the current overreliance on paramilitary and military forces.”\n\nThe HRCP urged the state to “publicly affirm” the role of human rights defenders and guarantee their protection, stating, “The report also underscores the delegitimisation of civil society movements such as the Baloch Yakjehti Committee (BYC), observing that equating human rights advocacy with militancy only deepens alienation, especially among the youth.”\n\nIt also called on the government to reinstate constitutional protections under the 18th Amendment and respect provincial autonomy in natural resource management, while highlighting “controversial projects such as Saindak and recent amendments to the Balochistan Mines and Mineral Act”.\n\nThe HRCP further said that the state must initiate a “transparent, inclusive and rights-based political solution” to prevent the political and security conditions in Balochistan from deteriorating.\n\n“Importantly, the mission notes that the risk of ethnic reprisals beyond the province is real and growing, threatening national cohesion, and accordingly calls for principled leadership rather than further securitisation,” it added.\n\nThe report looked at the scale and impact of media censorship and threats to journalists, “including violence, intimidation, and restrictions on news coverage”, and the consequences of internet shutdowns, university closure and other restrictions on civic life and access to information, it said.\n\nThe fact-finding mission aimed to assess the scale of “enforced disappearances, extrajudicial killings, and arbitrary detentions, particularly of activists, students and members of the BYC” and examine the alleged repression of rights-based movements and peaceful protest, including the use of anti-terrorism and preventive detention laws against non-violent activists and demonstrators, the report said.\n\nThe report termed the issue of enforced disappearances as the “most urgent and widespread human rights concern” and said that the testimonies from political leaders, civil society actors and law enforcement officials highlighted the “scale, impunity and evolving character of this practice”.\n\nIt stated, “Accounts suggest that the phenomenon, far from being isolated or exceptional, has become systematic, thereby undermining the rule of law and severely eroding public trust in state institutions.\n\n“A key theme that emerged was the shift in the pattern of enforced disappearances from prolonged incommunicado detention to allegations of an increasingly common ‘kill-and-dump’ approach.”\n\nCiting data provided by the police, the report said that there were 356 reported cases of enforced disappearances, 116 people were traced, 36 were removed from records due to incomplete information, 12 individuals were killed in police encounters and 192 cases remained unresolved.\n\nIn 2025, the Balochistan police registered 46 new cases of enforced disappearance, it said, adding that around 1,300 individuals among the 5,000 reported by Balochistan National Party-Mengal (BNP-M) leader Sardar Akhtar Mengal were said to have been “recovered”.\n\nThe report said that the victims’ families and friends continued to face “harassment, intimidation and denial of justice” when attempting to report such cases or raise public awareness.\n\n“In multiple cases, family members say they were followed, subjected to surveillance, and in some instances detained or denied professional credentials,” it added.\n\nHRCP highlighted the state’s perspective on enforced disappearances, stating that Balochistan Chief Minister Sarfraz Bugti “acknowledged” that the issue was a concern, but “attempted to reframe the issue as a ‘complex’ and ‘contested’ one”.\n\n“Bugti further argued that militant groups such as the Baloch Liberation Army were also responsible for abductions, although such claims could not be independently verified by the mission,” it said.\n\nThe report quoted Governor Sheikh Jaffar Khan Mandokhail as saying, “disappearances happen when insurgencies take place”, stating that this framed them “as a byproduct of conflict rather than as a violation of fundamental rights”.\n\nRespondents from the Balochistan High Court, meanwhile, argued that amendments to the act mirrored developments in the now-merged Federally Administered Tribal Districts in Khyber Pakhtunkhwa: detention for “90 days without an FIR, under the pretext of ‘aid of civil power’”.\n\n“They (respondents) expressed concerns that this would violate the right to due process and protection against arbitrary detention and custodial torture,” the report reads.\n\nThe mission noted with concern that state narratives had framed enforced disappearances as part of the broader conflict in Balochistan, which “risks normalising what is considered a crime against humanity in international human rights law”.\n\nAccording to the HRCP’s report, state lawmakers had “implied” that efforts for dialogue were postponed in the wake of an attack on non-Baloch citizens; a reflection of a broader pattern in which security goals overshadowed political resolution.\n\n“Despite the finality of the Supreme Court’s landmark verdict in the Mohabbat Shah case (December 2013) — which explicitly identified the involvement of state elements in enforced disappearances and directed the government to ensure accountability — there has been little meaningful progress in implementing these directives,” the report read.\n\n“The failure to act on the court’s findings reflects a broader pattern of impunity and lack of political will to hold security agencies accountable, thereby undermining both judicial authority and victims’ right to justice,” it added, noting that allegations of enforced disappearances must be taken seriously and investigated.\n\nHRCP noted the increase in militant violence in Balochistan, but warned that amending the Anti-Terrorism Act would be “counter-productive to curbing militancy and crime”.\n\n“Rather, the law is likely to further erode due-process protections, particularly in the absence of judicial oversight, and increase resentment among residents of Balochistan,” the report read, noting that it remains unclear whether those detained have access to their families or legal counsel.\n\n“The mission notes that despite the state’s claims that it has enforced its writ through administrative control and legal reforms, significant structural, institutional and political deficits continue to hinder effective law enforcement and civilian oversight in Balochistan,” the report added.\n\nThe report expressed particular concern over the delegitimisation of human rights defenders such as Dr Mahrang Baloch and other BYC members, warning that “tarring (violent) militancy and (peaceful) advocacy with the same brush is likely to further alienate Balochistan’s population and particularly its youth”.\n\nIt added that “unless it (the state) urgently seeks an enduring, transparent and inclusive political solution to Balochistan’s legitimate grievances, the ongoing insurgency will remain difficult to quell.”\n\nThe HRCP recommended that enforced disappearances should be brought to an immediate end, urging the implementation of the International Convention for the Protection of All Persons from Enforced Disappearance and domestic legislation against the practice passed in 2022.\n\n“Disband the Commission of Inquiry on Enforced Disappearances, which has failed to hold accountable those responsible for such practices (despite having the prosecutorial powers to do so), and instead establish a new commission with effective leadership and a fresh mandate to prosecute any state elements found responsible for perpetrating enforced disappearances,” it added.\n\nThe report also recommended ensuring a transparent and fair electoral process and investigating allegations of electoral manipulation, stating that such actions would restore faith in democratic governance.\n\nHRCP also recommended withdrawing the Anti-Terrorism (Balochistan Amendment) Act and reviewing all security-related legislation to ensure it lines up with international law and human rights standards.\n\n“Guarantee due process and judicial oversight in all instances of detention and dismantle any form of indefinite or arbitrary detention,” the report recommended.\n\nNoting that internment centres were replicated from those in KP, the report urged the state to decide pending appeals against the Peshawar High Court judgment on detention and formally notify these detention facilities as sub-jails.\n\nAdditionally, the HRCP urged that all individuals involved in militancy and crime be held accountable through transparent judicial processes in line with national laws and international human rights standards.\n\n“The state must replace extrajudicial and opaque measures with credible, impartial investigations and fair trials, thereby reinforcing the rule of law and demonstrating the state’s commitment to justice and accountability,” the report recommended.\n\nThe report also recommended reinstating constitutional guarantees of provincial autonomy under the 18th Amendment, particularly regarding resource and minerals management, as well as demilitarising the province to create conditions that would enable meaningful dialogue.\n\n“In the first instance, this could take the shape of a high-level national truth and reconciliation commission to promote interprovincial trust and reaffirm Pakistan’s commitment to a federal and inclusive democracy,” the report read.\n\nThe report also recommended integrating Category A and B areas under civilian police control, ending Balochistan’s reliance on paramilitary bodies such as the Levies for law enforcement. It also urged the state to provide civilian police with equipment and training to perform their duties in line with human rights standards.\n\nThe HRCP additionally urged the state to cease actions against human rights groups, recommending that these groups be protected and treated in keeping with international human rights commitments. Additionally, the report recommended that the state act against those posing as polio workers who harass human rights defenders.\n\n“Engage constructively with peaceful voices — even when they are critical of state policy — to foster a culture of democratic dialogue,” the report recommended.\n\n“Immediately halt state interference, financial coercion and intimidation of media outlets and journalists,” the report recommended. “Ensure freedom of expression by facilitating unrestricted media coverage of human rights issues, public protests, and criticism of state policies, consistent with Article 19 of the Universal Declaration of Human Rights.”\n\nThe report also recommended opening the border crossings with Iran and Afghanistan to facilitate cross-border trade and reduce unemployment, while urging the state to halt the deportation of Afghans.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06195241e9bca85.jpg",
  "retrievedAt": "2025-08-16T07:07:09.900Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929114/enforced-disappearances-other-issues-fuelling-public-alienation-political-instability-in-balochistan-hrcp",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T17:25:45.000Z"
}
