{
  "title": "Bangladesh vows ‘democratic renewal’ on anniversary - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Thousands of exultant Bangladeshis gathered in Dhaka on Tuesday to mark the first anniversary of mass protests that toppled Sheikh Hasina, as the interim government unveiled a road map for democratic reform with a national election next year.\n\nRallies, concerts, and prayer sessions were held in the capital as people celebrated what they called a “second liberation”. The events culminated with Nobel peace laureate Muhammad Yunus reading out the “July Declaration”, which seeks to give constitutional recognition to the 2024 student-led uprising in response to repression and economic hardship that forced Hasina, then prime minister, to flee to India on Aug 5.\n\n“The people of Bangladesh express their desire that the student-people uprising of 2024 will get proper state and constitutional recognition,” said Yunus, who heads the interim government installed after Hasina’s fall, as representatives of political parties looked on.\n\n“The July Declaration will feature in the schedule of the reformed constitution as framed by the government formed through the next national election, he said.\n\nSupporters see the charter as a foundation for institutional reform; critics say its impact could be largely symbolic in the absence of a legal framework or parliamentary consensus. Yunus said he would ask the election commission to organise national elections to be held in February 2026.\n\n“We must ensure that no future government can become fascist again. The state must be repaired in such a way that whenever signs of fascism are found anywhere, it can be eradicated immediately,” he said.\n\nThousands join rallies, concerts one year after Hasina’s ouster\n\nPolitical parties, particularly the Bangladesh Nationalist Party (BNP) led by former Prime Minister Khaleda Zia, have urged that elections be held before the end of 2025 to avoid a political vacuum.\n\nYunus said next year’s election could be peaceful, fair and transparent. While Hasina’s Awami League remains suspended, many believe it should be allowed to participate despite its top leadership facing prosecution for alleged human rights violations during last years protests.\n\n“Fallen autocrats and their self-serving allies remain active,”, Yunus said, urging unity to protect the gains of the uprising while his government holds talks with political parties and civil society. His government had already launched sweeping reforms while trials for those responsible for the “July killings” of 2024 were progressing swiftly, he said.\n\nMixed emotions\n\nCrowds waving flags, holding placards, and chanting slogans gathered near parliament, including some who had been injured in the protests. “On this day in 2024, the tyrant Sheikh Hasina fled the country,” said Ahmedul Hasan. was here last year too. I’ve come again to remember that moment and join the celebrations.“ Others were less exuberant.\n\n“Even after all the bloodshed and sacrifice, a truly liberal democracy in Bangladesh still feels like a distant dream,” said Sabbir Ahmed, a college student who joined the protests last year.\n\nPolice were on alert throughout the capital, with armoured vehicles on patrol to deter any attempt by the Awami League to disrupt events. “Let this anniversary not be a day of retrospection, but a rallying cry for a brighter tomorrow,” Hasina said in an open letter to the people of Bangladesh, adding that she had never resigned as prime minister.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/06103354e97dcea.jpg",
  "retrievedAt": "2025-08-16T07:08:39.719Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929018/bangladesh-vows-democratic-renewal-on-anniversary",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:23:01.000Z"
}
