{
  "title": "Pakistan women lose by 11 runs in first Ireland T20 - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan lost by 11 runs to Ireland on Wednesday in the first Twenty 20 International (T20I) of their series in Dublin.\n\nSkipper Fatima Sana was the pick of the bowlers for the Green Shirts at the Clontarf Cricket Club Ground, getting a career-best 4-26 as the team looked to kickstart a packed international calendar — featuring two white-ball World Cups — with a winning performance after bowling the Irish side out for 142.\n\nHowever, that was not meant to be, as the Irish side restricted the visitors to 131 in their chase, with all-rounder Orla Prendergast being adjudicated player of the match for her three wickets and 26 runs.\n\nIn the first innings, Sadia Iqbal, the number one ranked T20I bowler in the world, started her spell by conceding a boundary to Ireland opener Amy Hunter.\n\nSkipper Fatima struck in just her second over, bowling an inswinger to dislodge her opposite number Gaby Lewis’s middle stump.\n\nThe Irish side then recovered to score 48-1 at the end of the powerplay — courtesy five boundaries from opener Hunter.\n\nLeft-arm spinner Nashra Sandhu came into the attack to bowl the seventh over, conceding just five in her first over.\n\nShe got the breakthrough in her next over — removing Hunter for 37 when the Irish batter was bowled round her legs while attempting to sweep, and the ball crashed into her stumps.\n\nAt the halfway mark of the innings, the Irish side were meandering along at 70-2 before Prendergast and left-handed Leah Paul got together at the crease to try to up the momentum.\n\nTheir efforts were cut short though when Rameen Shamim got the next wicket for the Green Shirts when Prendergast tried to sweep her — only to top-edge the ball to a gleefully waiting Fatima at short fine leg.\n\nThe Karachi-born spinner broke the partnership just before the Irish innings got going again.\n\nPaul was the next to fall for Ireland, top edging a shot off Sadia to be caught at long-on after scoring a brisk 28 off 19. The Pakistani skipper then returned for the 17th over to claim two more Irish wickets.\n\nIreland continued to lose regular wickets, with Fatima bowling Jane Maguire with a yorker in the penultimate over of the innings.\n\nPacer Diana Baig got her first wicket in the 20th over of the Irish innings, with the Irish team getting bowled out for 142 after losing their last two batters to runouts.\n\nThe Pakistani reply did not get off to the best of starts as they lost southpaw opener Muneeba Ali for just 5 when she hit a Prendergast delivery straight to mid-off.\n\nHer fellow opener Gull Feroza could also not last for long at the crease — getting bowled by pacer Jane Maguire for five in the fourth over of the innings.\n\nVeteran bat Sidra Amin — Pakistan’s leading run scorer in the ICC World Cup Qualifiers earlier this year then steadied the ship with the hard-hitting Aliya Riaz.\n\nBoth batters, who had top-scored for the Green Shirts in a victory in their previous encounter against the Irish side in the Qualifiers in Lahore, fell in quick succession to soft dismissals.\n\nAva Canning and Cara Murray got the wickets of Sidra and Aliya respectively in the 8th and 9th over of the innings to leave the visitors reeling at 42-4.\n\nDebutant Eyman Fatima combined with Natalia Pervaiz at the crease to bring up Pakistan’s 50 in the 11th over of their innings.\n\nEyman subsequently got run out in a stroke of bad luck when Natalia hit a full toss back towards Murray, who got a hand to the ball before it crashed into the stumps.\n\nSkipper Fatima was the next batter at the crease, getting going from the get-go by hitting a boundary off Murray — only to be given out caught behind in the next over by spinner Lara McBride.\n\nThe Pakistan captain made her disapproval of the decision well-known before exiting the field, not getting a chance to review as the decision review system was not available.\n\nNatalia tried to up the rate with a brisk 34 partnership with Rameen before she fell to a straightforward length delivery by Prendergast.\n\nDespite some resistance by Rameen till the penultimate over, Pakistan still fell short of the below-par target by 11 runs.\n\nThis is the fifth bilateral T20I series between the two sides. The record so far stands even, with both Pakistan and Ireland having won two series each. However, the overall head-to-head is tilted heavily in Pakistan’s favour, with the visitors winning 15 of the 19 encounters since their first meeting in Dublin in 2009 going into the match.\n\nThe series follows a productive month of preparation for Pakistan, who held a 17-day skills camp and a five-day pre-tour camp at the Hanif Mohammad High Performance Centre in Karachi before arriving in Dublin on August 3.\n\nIreland, meanwhile, entered the series high on confidence after a dominant showing against Zimbabwe women last month, where they swept both the T20I and ODI series at home.\n\nBefore participating in the 50-over ICC Women’s World Cup in September, Pakistan will play one series consisting of three matches against South Africa in Lahore from Sept 16 to 22.\n\nThe World Cup is scheduled to be held in India from Sept 30 to Nov 2, but Pakistan will play their matches of the global event in Sri Lanka under the hybrid model, according to which neither India nor Pakistan will visit each other’s venues due to political strains between the nuclear-armed neighbours.\n\nPakistan’s highly anticipated clash with arch-rivals India is scheduled for October 5, followed by encounters against defending champions Australia on October 8 and 2017 champions England on October 15.\n\nThe national side will then face New Zealand (October 18), South Africa (October 21), and co-hosts Sri Lanka (October 24) to conclude their round-robin stage.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/062344528aebccf.jpg",
  "retrievedAt": "2025-08-16T07:07:26.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929112/pakistan-women-lose-by-11-runs-in-first-ireland-t20",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T14:53:48.000Z"
}
