{
  "title": "US envoy Witkoff meets Putin for 3 hours as Trump’s sanctions deadline nears - World - DAWN.COM",
  "author": null,
  "content": "United States envoy Steve Witkoff held talks with Russian President Vladimir Putin in the Kremlin on Wednesday, two days before the expiry of a deadline set by US President Donald Trump for Russia to agree to peace in Ukraine or face new sanctions.\n\nWitkoff flew to Moscow on a last-minute mission to seek a breakthrough in the three-and-a-half-year war that began with Russia’s full-scale invasion in 2022. Russian state TV showed a brief clip of him shaking hands with Putin at the start of their meeting.\n\nRussian news agencies said the talks ended after about three hours, and Witkoff’s motor convoy was seen leaving the Kremlin.\n\nRussian investment envoy Kirill Dmitriev, who earlier greeted Witkoff on arrival and strolled with him in a park near the Kremlin, posted on social media: “Dialogue will prevail.” There was no immediate statement from either side on the substance of the talks.\n\nLater, Trump called the meeting “highly productive” in a post on Truth Social.\n\n“Great progress was made!” the US president wrote. “Afterwards, I updated some of our European allies. Everyone agrees this war must come to a close, and we will work towards that in the days and weeks to come.”\n\nA White House official said that the meeting went well, adding that Washington still planned to proceed with secondary sanctions on Friday.\n\n“The Russians are eager to continue engaging with the United States. The secondary sanctions are still expected to be implemented on Friday,” the White House official said.\n\nTrump, increasingly frustrated with Putin over the lack of progress towards peace, has threatened to impose heavy tariffs on countries that buy Russian exports.\n\nHe is exerting particular pressure on India, which, along with China, is a huge buyer of Russian oil. The Kremlin says threats to penalise countries that trade with Russia are illegal.\n\nIt was not clear what Russia might offer to Witkoff in order to stave off Trump’s threat.\n\nBloomberg and independent Russian news outlet The Bell reported that the Kremlin might propose a moratorium on air strikes by Russia and Ukraine — an idea that was mentioned last week by Belarusian President Alexander Lukashenko during a meeting with Putin.\n\nSuch a move, if agreed, would fall well short of the full and immediate ceasefire that Ukraine and the US have been seeking for months. But it would offer some relief to both sides.\n\nSince the two sides resumed direct peace talks in May, Russia has carried out its heaviest air attacks of the war, killing at least 72 people in the capital Kyiv alone. Trump last week called the Russian attacks “disgusting”.\n\nUkraine continues to strike Russian refineries and oil depots, which it has hit many times.\n\nUkrainian President Volodymyr Zelensky said on Wednesday that Russia had attacked a gas pumping station in southern Ukraine in what he called a deliberate and cynical blow to preparations for the winter heating season.\n\nRussia said it had hit gas infrastructure supplying the Ukrainian military.\n\nAndriy Yermak, chief of staff to Zelensky, said on Wednesday that a full ceasefire and a leaders’ summit were required. “The war must stop and for now, this is on Russia,” he posted on Telegram.\n\nPutin is unlikely to bow to Trump’s sanctions ultimatum because he believes he is winning the war and his military goals take precedence over his desire to improve relations with the US, three sources close to the Kremlin told Reuters.\n\n“The visit of Witkoff is a last-ditch effort to find a face-saving solution for both sides. I don’t think, however, that there will be anything of a compromise between the two,” said Gerhard Mangott, an Austrian analyst and member of a group of Western academics and journalists who have met regularly with Putin over the years.\n\n“Russia will insist it is prepared to have a ceasefire, but [only] under the conditions that it has formulated for the last two or three years already,” he said in a telephone interview.\n\n“Trump will be under pressure to do what he has announced — to raise tariffs for all the countries buying oil and gas, and uranium probably as well, from Russia.”\n\nThe Russian sources told Reuters that Putin was sceptical that yet more US sanctions would have much of an impact after successive waves of economic penalties during three-and-a-half years of war.\n\nThe Russian leader does not want to anger Trump, and he realises that he may be spurning a chance to improve relations with Washington and the West, but his war goals are more important to him, two of the sources said.\n\nPutin’s conditions for peace include a legally binding pledge that Nato will not expand eastwards, Ukrainian neutrality, protection for Russian speakers and acceptance of Russia’s territorial gains in the war, Russian sources have said.\n\nZelensky has said Ukraine would never recognise Russia’s sovereignty over its conquered regions and that Kyiv retains the sovereign right to decide whether it wants to join Nato.\n\nWitkoff, a real estate billionaire, had no diplomatic experience before joining Trump’s team in January, but has been simultaneously tasked with seeking ceasefires in the Ukraine and Gaza conflicts, as well as negotiating in the crisis over Iran’s nuclear programme.\n\nCritics have portrayed him as out of his depth when pitched into a head-to-head negotiation with Putin, Russia’s paramount leader for the past 25 years, and at times accused him of echoing the Kremlin’s narrative.\n\nIn an interview with journalist Tucker Carlson in March, for example, Witkoff said there was no reason why Russia would want to absorb Ukraine or bite off more of its territory, and it was “preposterous” to think that Putin would want to send his army marching across Europe.\n\nUkraine and many of its European allies say the opposite. Putin denies any designs on Nato territory, and Moscow has repeatedly cast such charges as evidence of European hostility and “Russophobia”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/0619142073b110c.jpg",
  "retrievedAt": "2025-08-16T07:07:27.610Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929120/us-envoy-witkoff-meets-putin-for-3-hours-as-trumps-sanctions-deadline-nears",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T15:05:57.000Z"
}
