{
  "title": "Building peace in South Asia - World - DAWN.COM",
  "author": null,
  "content": "SAARC was established with the goal of promoting cooperation in the economic, social, technological and cultural fields. It was hoped it would eventually provide a framework for regional peace and development.\n\nWith Afghanistan becoming a member, this hope was further enhanced. However, after 40 years, Saarc has little to show for itself. The success of Asean provides a study in contrast. While it has contributed enormously to the strengthening of peace and development in Southeast Asia, Saarc has practically ceased to exist.\n\nThe reasons given include political tensions and bilateral conflicts, differing threat perceptions, institutional weaknesses, lack of political will, limited intra-regional trade, etc. The major reason, however, is that India has always been more interested in regional domination than regional cooperation.\n\nIn particular, the Indian demand that the issues of Kashmir and terrorism be resolved exclusively on the basis of its own demands has conveyed to the smaller countries of Saarc that if this is India’s attitude towards Pakistan, what chance will they have of getting a fair deal with regard to their own issues with India. As a result, Saarc has been unable to agree on a unified political agenda for peace and development.\n\nIndia is much larger than all the other member states combined in area, population and size of economy. After its chastening experience of Operation Sindoor, one might have hoped India would now consider the possibilities for cooperation over hegemony.\n\nThe recent conflict also demonstrated that China has become a South Asian military, economic, political and strategic factor. This is a massive strategic development which seems to have stunned India into strategic paralysis. It is at a loss whether to continue the war or to cut its losses and embark on a course of regional cooperation and development, in which it could still be a leader if not a hegemon.\n\nAs long as India insists on regional hegemony, building peace and security will remain a pipe dream.\n\nThere have been other changes in South Asia. The change of government in Bangladesh; moves towards halting the deterioration in Pak-Afghan relations; the failure of the US to openly side with India against Pakistan; the failure of India to convince the international community that Pakistan was responsible for Pahalgam; and the international highlighting of the human rights situation in Indian-occupied Kashmir.\n\nAll this has compounded India’s regional predicament and domestic embarrassment, although the Modi government seems to be in no immediate danger.\n\nThe smaller countries of South Asia have always sought some sort of counterbalance to the overwhelming presence of India. The strategic entry of China into South Asia along with its globally attractive BRI, CPEC, and BRICS initiatives has confronted India with a strategic challenge. None of India’s alternatives to Saarc such as BBIN (Bangladesh, Bhutan, India and Nepal) or Bimstec (Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation) have much attraction for the smaller countries of Saarc when compared with what China has to offer.\n\nSo, how can peace be built in South Asia? As long as India insists on regional hegemony, building peace and security will remain a pipe dream. Moreover, as long as India chooses to be a key player in the US Indo-Pacific Strategy of containing China, neither Pakistan nor any of the other smaller countries of Saarc will have much interest in seeing US global strategy prevail.\n\nNevertheless, Pakistan should not abandon efforts to improve relations with India. If they succeed, they will alleviate the concerns of the smaller Saarc countries that are not able to challenge India individually or collectively.\n\nThey will also reduce Indo-Pakistan tensions, which can progressively address the unending repression in occupied Kashmir. That can help revive Saarc as a credible regional organisation. It can also facilitate China’s vision for Asia as a region of shared prosperity instead of the US insistence on it being an accomplice in its quest for global hegemony.\n\nMeanwhile, Pakistan will need to improve its global and regional image which depends on the quality of its democratic and economic governance including respect for the people’s demonstrated political preferences, the whole gamut of human rights, social justice, institutional credibility, space for dissent and protest, etc, far more than the prowess of its military on the battlefield or the astuteness of its diplomacy in the chancelleries of the world.\n\nUnfortunately, Pakistan’s international ratings on good governance are among the worst in the world with all their implications and consequences.\n\nBecause an India normalisation policy is almost a non-starter today, Pakistan will need an effective ‘Rest of South Asia’ policy to present a credible alternative to Indian hegemony.\n\nPakistan must also disabuse itself of the illusion of balancing relations between the US and China. It should, of course, develop its bilateral relations with the US to the extent possible. But never at the risk of China suspecting the commitment of Pakistan to the fullest development of strategic relations with it. This risk is real because the US makes no secret of its strategy to contain the rise of China, and to assess its relations with China’s neighbours, especially Pakistan, according to the extent of their cooperation with this strategy.\n\nAfter Operation Sindoor and Pakistan’s raised stature in the Muslim world and the Global South, there will be even less US tolerance for Pakistan maintaining any sort of ‘balance’ between the US and China.\n\nMoreover, with the weakening of Iran, Trump and the US deep state as well as Israel will prioritise the prevention of Pakistan from becoming any kind of inspiration for resistance to Israeli and US genocide-based hegemony in the Muslim heartland.\n\nPakistan’s nuclear deterrence and its conventional military ‘fusion’ with China will become their policy focus.\n\nIn conclusion, for Pakistan to think it can sustain a strategic balance with the US and China is utterly unrealistic. Accordingly, the recent statement that ‘Pakistan-US ties must not be seen through China’s lens’ is very troubling, even if China has observed an eloquent public silence in response. The US will want to hold Pakistan to this unfortunate statement.\n\nThe writer is a former ambassador to the US, India and China, and head of UN missions in Iraq and Sudan. The article is based on a talk he gave at Institute for Regional Studies, Islamabad.\n\nPublished in Dawn, August 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/6892a3411d624.jpg",
  "retrievedAt": "2025-08-16T07:08:10.293Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929049/building-peace-in-south-asia",
  "dateList": "2025-08-06",
  "date_published": "2025-08-06T00:37:34.000Z"
}
