{
  "title": "FIR lodged over illegal killing of protected deer in Margalla Hills National Park",
  "author": null,
  "content": "ISLAMABAD, Jul 05 (APP):The Islamabad Wildlife Management Board (IWMB) has lodged a First Information Report (FIR) following the illegal killing of a barking deer in Margalla Hills National Park, a serious violation of federal wildlife protection laws.\nAccording to an IWMB spokesperson, the FIR was filed based on a formal complaint submitted by the board, calling for legal action under the Islamabad Nature Conservation and Wildlife Management Act, 2024.\nThe act classifies the barking deer as a protected species under Schedule-I, making its hunting or killing strictly prohibited.\n“The FIR seeks legal proceedings under relevant provisions of the 2024 Act,” the spokesperson said. “The barking deer is a protected animal, and its unlawful killing is a punishable offense under the law.”\nUnder the updated law, individuals found guilty of such violations face a fine of up to one million rupees and/or imprisonment for up to one year. The IWMB emphasized that the law applies even if the animal is found dead, stating that all wild animals—whether alive or deceased—are considered federal property under Section 23 of the Act.\n“This law is clear: no one is allowed to harm or possess protected wildlife, even in dead form,” the spokesperson added.\nMargalla Hills National Park, a protected area under federal jurisdiction, is home to several endangered and vulnerable species.\nWildlife officials and conservationists have long raised concerns about poaching, habitat loss, and human interference threatening the park’s delicate ecosystem.\nThe filing of this FIR signals a renewed effort by the authorities to crack down on illegal hunting and better enforce wildlife laws in the capital region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:16:05.079Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fir-lodged-over-illegal-killing-of-protected-deer-in-margalla-hills-national-park/",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T17:31:00.000Z"
}
