{
  "title": "Sanjarni seeks report on violation of tax exemption extended erstwhile FATA",
  "link": "https://www.app.com.pk/national/sanjarni-seeks-report-on-violation-of-tax-exemption-extended-erstwhile-fata/",
  "date_published": "2021-04-20T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): Chairman Senate Muhammad Sadiq Sanjrani has sought a report from Ministry of Finance, FBR and Ministry of Law on violation of tax exemption extended to traders and investors of erstwhile FATA through a legislative process in the Parliament.\nThe report was sought by the Chairman Senate after a meeting of a 40 members delegation of industrialists from ex FATA with the Chairman here at Parliament House on Tuesday, said a press release.\nThe delegation apprised the Chairman senate that after the merger of FATA in 2018, tax exemption was given for 5 years, but on the contrary, through various tactics, the steel and Ghee industry had been deprived of this exemption in the Finance Bill 2019.\nThe Chairman Senate assure the delegation that relevant Ministers and representatives of concerned Ministries and departments would be called for a meeting to solution of the issue.\nEarlier, a 40-member delegation of investors and industrialists from erstwhile FATA called on the Chairman Senate Muhammad Sadiq Sanjrani here at the Parliament House.\nThe delegation while apprising the Senate Chairman regarding the behavior of FBR said that the board does not facilitate nor give concessions as per law.\nThe traders delegation told the Chairman that after the integration of FATA in 2018, tax exemption was given for 5 years but on the contrary and playing various tactics, the steel and Ghee industry had been deprived of this exemption in the Finance bill 2019.\n“The most ironic is that all kinds of bank accounts of the business class associated with these industries have been frozen”, the delegation apprised the Chairman.\nDue to the unwanted behavior of the concerned authority, more than 40 steel units and some units of Ghee industries were shutdown, left thousands unemployed.\nChairman Senate Muhammad Sadiq Sanjrani assured the delegation that their rights would never be compromised in any way and tax exemption for 5 years would be ensured accordingly and in line with Law.\nThe Chairman has sought a report from the Ministry of Law, Ministry of Finance, and FBR in that regard and in the light of the demands of the trade delegation.\nHe ensured the delegation that after two days, Ministers and representatives of concerned Ministries and Institutions would be called for sorting out an appropriate solution of the prevailing issue. He further added that the Prime Minister had also, on several occasions directed the concerned ministries to provide concessions for the promotion of trade activities and development of industries in the Ex-FATA to develop these areas at par with other parts of the country.\nHowever, the law passed by the concerned departments against the industries of the erstwhile FATA was being violated which would not be allowed in any case, he assured.\nThe Chairman asked the delegation to remain optimistic about the resolution of the matter and focus on promoting business activities and creating jobs in erstwhile FATA.\nHe said that the business community of EX-FATA should also be fully prepared for the post-concession situation so that they could compete with the industries established in other parts of the country.",
  "retrievedAt": "2025-08-11T20:38:41.914Z"
}
