{
  "title": "Inimical forces slip deeper into despondency after successful talks with TLP : Ashrafi",
  "link": "https://www.app.com.pk/national/inimical-forces-slip-deeper-into-despondency-after-successful-talks-with-tlp-ashrafi/",
  "date_published": "2021-04-20T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): Special representative to Prime Minister on Religious Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday said success of talks between the government and the Tehreek-e-Labbaik Pakistan (TLP) has triggered a sense of despondency among the inimical forces wanted to fan hatred and chaos in country.\nTalking to Ulema and religious scholars, he said Parliament’s decision regarding French ambassador as well as blasphemous sketches would be implemented.\nHe said country’s foreign policy could not be devised at the will of any group, party or faction and the relevant forum for foreign policy would do its job, said a statement issued here.\nThe Special Representative said the extremist and terrorist elements as well as\nanti-Pakistan forces wanted to create chaos and massacre in the country.\nHe urged patriotic political and religious forces to play a positive role in eradicating chaos and riots. Nothing would and could not be done against the law and the constitution.\nHe said there would be a debate in the National Assembly on the condemnation of the sketches of the Holy Prophet (PBUH) in France and the expulsion of the French Ambassador. The decision of the parliament would be accepted by the government and\nthe nation.\nA proposal was under consideration to convene a meeting of organizations and leaders of various Islamic countries after Ramazan to ponder measures for curbing blasphemy and Islamophobia.\nAmong those who met were Maulana Asadullah Farooq, Allama Zubair Abid, Maulana Muhammad Ashfaq Patafi, Allama Tahir-ul-Hassan, Maulana Muhammad Shafi Qasmi, Pir Asad Habib Shah Jamali, Maulana Noman Hashir, Maulana Tahir Aqeel Awan, Maulana Abu Bakar Sabri, Maulana Aslam Siddiqui. Maulana Aseed-ur-Rehman Saeed, Maulana Abdul Hakim Athar, Maulana Hassan Ahmad Hussaini, Maulana Habib-ur-Rehman Abid, Maulana Muhammad Aslam Qadri, Maulana Mubashir Rahimi, Qari Shams-ul-Haq.",
  "retrievedAt": "2025-08-11T20:38:41.364Z"
}
