{
  "title": "Minimum Fitrana fixed at Rs140 per person",
  "link": "https://www.app.com.pk/national/minimum-fitrana-fixed-at-rs140-per-person/",
  "date_published": "2021-04-20T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):This year’s minimum Sadqa-e-Fitr or Fitrana, an obligatory charitable donation all Muslims are required to pay during Ramazan, has been set at Rs140 per person, said former Central Ruet-e-Hilal Committee Chairman Mufti Muneebur Rehman on Tuesday.\nUnder the Islamic Shariah, the rate for Fitrana per person can be based on one of the prices of flour, dates, raisin, cheese, or barley.\nThe minimum amount that should be given in charity is Rs140 with respect to wheat, in accordance with barley it is Rs320, with respect to price of dates and raisins it is Rs960 and 1,920 respectively.\nThe Fidya amount needed to be paid for the 30 days with respect to wheat price is Rs8,400; with respect to barley Rs19,200; with respect to dates Rs57,600; and with respect to raisins Rs115,200.\nSadaqa-tul-Fitr, also known as Zakatul-Fitr, is a small amount of food to be given in charity before Eid-ul-Fitr prayers. It is not advisable to pay after Eid prayer. However, if a person has failed to pay Fitrana at proper time, then he/she should pay it as soon as possible.\nThis amount is separate from the annual payment of Zakat, which is one of the pillars of Islam.\nUnlike Zakat, which is calculated annually as a percentage of extra wealth, the Sadaqat-ul-Fitr is to be paid equally by every Muslim man, woman and child.\nAccording to the Prophet Hazrat Muhammad Peace Be Upon Him each person should give away in charity an amount equivalent to one ‘sa’a (an ancient measure of volume, approximately between 2.6 Kg to 3 Kg of grain’). A sa’a is a unit of measurement equal to 4 handfuls of an average man. As such, the exact weight differs based on the foodstuff in question.\nEach individual Muslim, who has financial power is to give away this amount — man or woman, adult or child, sick or healthy, old or young. These are the minimum Fitrana and Sadaqah rates.Those who have been given abundance in sustenance by Allah, considering their financial status, can pay fitrana accordingly.\nIslam obligates its followers to pay the required amount to the most deserving people including relatives or neighbours before offering the Eid prayers to ensure that monies donated are able to be distributed amongst those most in need in order for them to join in with Eid celebrations.\n“The Messenger of Allah (peace be upon him) ordained Zakat ul Fitr [Fitrana] to purify the fasting person from indecent words or actions, and to provide food for the needy.\nIt is accepted as Zakat for the person who gives it before the Eid prayer; but it is a mere Sadaqah for the one who gives it after the prayer.” [Abu Dawud and Ibn Majah].\nMeanwhile, Darul Ifta Peshawar has announced Rs120 as Fitra with respect to wheat; Rs280, barley; Rs700 dates and Rs1,400 per head with respect to raisin.",
  "retrievedAt": "2025-08-11T20:38:36.048Z"
}
