{
  "title": "COVID-19 claims 137 lives, infects 5,445 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-137-lives-infects-5445-more-people/",
  "date_published": "2021-04-20T08:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):The national tally on Monday of total active COVID-19 cases recorded 83,298 with 5445 more people tested positive for the deadly virus while 137 more people died from the disease during the last 24 hours.\nOut of total 137 corona patients died during past 24 hours, of whom 122 were under treatment in hospital and 15 out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by Khyber Pakhtunkhwa. Out of the total 137 deaths occurred during last 24 hours, 53 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 85 percent, Mardan 95 percent, Gujranwala 88 percent and Lahore 82 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) were also occupied in four major areas including Gujranwala 85 percent, Peshawar 72 percent, Nowshera 68 percent and Swat 65 percent.\nAround 549 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in, Gilgit Baltistan (GB) and Balochistan.\nSome 68,002 tests were conducted across the country on Monday, including 14,109 in Sindh, 41,074 in Punjab, 7,027 in Khyber Pakhtunkhwa (KP), 4,233 in Islamabad Capital Territory (ICT), 710 in Balochistan, 247 in GB, and 602 in AJK.\nAround 667,131 people have recovered from the disease so far across Pakistan making it a significant count.\nSince the pandemic outbreak, a total of 766,882 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 15,741, Balochistan 21000, GB 5,191, ICT 70,609, KP 107,309, Punjab 273,566 and Sindh 273,466.\nAbout 16,453 deaths were recorded in country since the eruption of the contagion. Around 4,556 have perished in Sindh, out of three died in hospital on Monday.\nHowever, 7,561 had died in Punjab so far, with 104 deaths occured in past 24 hours, out of which 89 of them died in the hospital and 15 out of hospital.\n2, 920 in KP where 21 of them died in hospital on Monday, 645 in ICT among three deaths occurred in hospital during past 24 hours, 225 in Balochistan out of which two died in hospital on Monday, 104 in GB out of which one died in hospital during last 24 hours and 422 in AJK among three of them succumbed to the deadly virus in hospital on Monday.\nA total of 11,272,531 corona tests have been conducted so far, while 630 hospitals were equipped with COVID facilities. Some 5,314 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:38:37.602Z"
}
