{
  "article_id": "2025-06-19_da37f56c32bdc2428944ad6ac91d874c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/shaza-fatima-calls-for-novel-urgent-interventions-to-increase-employability-of-it-graduates/",
    "retrieved_at": "2025-08-27T16:14:10.933Z"
  },
  "metadata": {
    "title": "Shaza Fatima calls for novel, urgent interventions to increase employability of IT graduates",
    "author": null,
    "date_published": "2025-06-19T17:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 813,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP): Federal Minister of Information Technology & Telecommunication Ms. Shaza Fatima Khawaja Thursday reiterated the Government's commitment to facilitating the academia, industry and all relevant stakeholders in removing the hurdles blocking the employability of Computing graduates. She was addressing a national conference titled 'Zero-Day Employability of Computing Graduates' organized by Higher Education Commission (HEC), Pakistan in collaboration with MoIT&T and Pakistan Software Export Board (PSEB) on Thursday. Chairman HEC Dr. Mukhtar Ahmed, Secretary MoIT&T, Zarraz Hasham Khan, Vice Chancellors of a large number of universities, faculty members, and IT industry representatives attended the conference. Ms. Shaza Fatima emphasized the need for economic impact in the country through digital transformation by unlocking the country's IT potential. She said the Ministry is determined to achieve the target of elevating the country's IT exports to $15 billion exports by 2029. She underlined that a future-ready human resource is the key component for achievement of this target. She highlighted that Pakistan is blessed with talented youth and there is a need to hone this asset. She noted it is the high time for introspection, identification of challenges, and exploitation of strengths to set a right direction. She said the Government is cognizant of the challenges, however, it is pivotal to be on the path of addressing the challenges. She asserted that conferences are literally determining the future of Pakistan. She raised thought-provoking questions to know if the country's systems, including the manufacturing and services patterns adequately, are ready for the future. \"We either have to keep pace with the world by putting right efforts or to lag behind by not picking up the pace with the emerging technology,\" she underlined. The minister urged the universities to prepare the youth for the future technological advancements and produce graduates who make the IT sector viable. She underlined the significance of rewarding and penalizing the universities for the performance in order to materialize the vision of IT sector's growth. There is, she noted, a tsunami of change wherein everything has been automated. She made a collective call to action to come out of the existing structures and propose innovative interventions. In his welcome address, Chairman HEC Dr. Mukhtar Ahmed highlighted HEC's measures to bridge the gap of liabilities in the IT sector. He said that academia-industry linkages are a vital means to cope up with the industry's hampered growth, as it is high time to upgrade the systems. He informed the audience that HEC has developed a new Computing Education curriculum and has shared it with the universities for adoption. He said that the curriculum is based 80 percent on hands-on skills. He hoped that it will open up a window for employability of graduates. The Chairman highlighted that Pakistani youth have been achieving huge success in the Huawei Imagine Cup competitions. He said the country's youth has a great potential in all the areas including technology. He added that the Pakistani university graduates and the HEC scholarship recipients are playing their appreciable role in taking up Pakistan in the technological sphere. He noted that the demand of IT graduates is increasing at the national and international levels owing to the rapid technological advancements. He said HEC has played a key role in upgrading the universities by providing them with state-of-the-art IT facilities. He appreciated National University of Sciences and Technology and FAST National University of Computer and Emerging Sciences for the quality of Computing Education offered by them. He urged all the universities to make progress towards improved quality of education at their campuses. Secretary MoIT&T, Zarrar Hashim Khan shared a detailed presentation on the National IT Roadmap drafted in consultation and deliberations with stakeholders. He pointed out the key challenges in the IT industry triggering low exports such as systemic and structural issues, educational and skill development issues, and workplace and industry dynamics. \"If we do not address them structurally, we will lag behind,\" he emphasized. He also presented recommendations to put in action for sectoral growth, including having a standardized testing mechanism, skill-based certification courses integrated with curricula, and work with industry by final year students. He stressed the need for academic and workforce readiness and strong collaboration between the IT industry and academics to address employability gap. He underlined that the industry's productivity and a remarkable increase in consistent exports are among the top objectives to be followed. The conference featured three panel discussions on Standardization of ICT Curriculum Across Pakistan: Integrating Internationally Certified Courses for Industry Readiness; Feasibility and Impact of a Centralized Competency Test for IT Graduates Nationwide; and Linking Final Year Projects with Industry: A Placement-Based Approach to Enhance Productive Employability. The panelists expressed their insights on the subjects and finalized recommendations. Rector Virtual University of Pakistan Dr. Arshad Saleem Bhatti presented the recommendations while concluding the conference. The recommendations will be disseminated to all the stakeholders for practical steps.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}