{
  "article_id": "2025-06-19_ffc2ced6a0568fbd0b408a541b3d9e6c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/railways-minister-meets-with-rana-sanaullah/",
    "retrieved_at": "2025-08-27T16:15:19.076Z"
  },
  "metadata": {
    "title": "Railways minister meets with Rana Sanaullah",
    "author": null,
    "date_published": "2025-06-19T13:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 222,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Advisor to Prime Minister on Political and Public Affairs, Rana Sanaullah Thursday met with Federal Minister for Railways, Muhammad Hanif Abbasi and to discussed strategic measures for transforming Pakistan Railways into a modern, secure and efficient institution. During the meeting, the minister informed that nine trains have already been outsourced and preparations are underway to outsource eleven more. He also said that a decision has been made to outsource railway-operated schools and hospitals. The minister further shared that an information desk has been set up at Rawalpindi Railway Station to provide passengers with timely and accurate travel updates. Highlighting recent developments, Hanif Abbasi said that a contract with the Rawalpindi Waste Management Company has led to significant improvements in station cleanliness. Hanif Abbasi said that with the introduction of a modern sanitation system, passengers now experience a clean and more comfortable travel environment. He said that the efforts are underway to repair of train bogies, procurement of new coaches and the implementation of an advanced tracking system. Hanif Abbasi emphasized that considerable enhancements are being made to ensure better facilities for passengers. Rana Sanaullah appreciated the initiatives and assured the Ministry of Railways of full governmental support. He said that the Prime Minister's Office will continue to extend complete cooperation for the progress and development of the railways sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}