{
  "article_id": "2025-06-19_b37fa61265ef71f6db68f52d472de6e4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/strengthening-parliamentary-cooperation-key-to-advancing-pakistan-uk-relations-ayaz/",
    "retrieved_at": "2025-08-27T16:15:20.471Z"
  },
  "metadata": {
    "title": "Strengthening Parliamentary cooperation key to advancing Pakistan–UK relations: Ayaz",
    "author": null,
    "date_published": "2025-06-19T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 479,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Speaker National Assembly Sardar Ayaz Sadiq has said that enhancing parliamentary cooperation is key to further solidifying bilateral ties between Pakistan and the United Kingdom. During a meeting with British High Commissioner to Pakistan, Ms. Jane Marriott here, he said that Pakistan deeply values its long-standing relationship with the UK and noted that stronger inter-parliamentary engagement is essential for shared progress. Ayaz Sadiq has said that a series of structural reforms aimed at modernizing Parliament, saying, \"This is the first Parliament in the world that has been transformed into a Green Parliament through complete solarization,\" he added. He also said that more than 60,000 applications were received for the three-month Parliamentary Internship Programme and over 200 interns were selected through a merit-based, gender-inclusive process that ensured representation from minority groups and major universities. \"It is vital to engage young people in democratic processes through meaningful parliamentary exposure,\" he said. Ayaz Sadiq also said that the whole staff of the National Assembly was interviewed by himself to ensure better resource management. He further shared that he had personally met with over 1,400 employees to understand their concerns and ensure their welfare was addressed. The Parliamentary staff is also being trained in Artificial Intelligence (AI) and Information and Communication Technology (ICT). \"While AI presents certain challenges, its potential benefits for governance are significant,\" he added. Ayaz Sadiq said that the Legislative Council, established in 2014, continues to strengthen parliamentary committees. Technical staff has been assigned to assist committees in enhancing their performance. \"Even Private Members' Bills, which were previously overlooked are now referred to the relevant committees,\" he said, adding that legislative proposals are shared across party lines to promote inclusive scrutiny. He said for the first time, the National Assembly's Finance Committee is reviewing the federal budget 2025-26, reflecting strengthened institutional oversight. The Speaker identified population growth and socio-economic disparities as pressing challenges requiring coordinated and forward-looking policy responses. He also briefed the High Commissioner on the successful conduct of the 18th Speakers' Conference, which sought to harmonize legislative efforts between federal and provincial legislatures. Additionally, the formation of an Association of Public Accounts Committees (PACs) was highlighted as a milestone in promoting coordination between the National Assembly and Provincial Assemblies, he added. Ayaz Sadiq reaffirmed that Pakistan always pursues a policy of peace and restraint as it becomes evident in recent Pakistan victory in war with India. He said that global peace is essential as it is a common man who suffers the most due to conflicts and war. Ms Jane Marriott praised the Speaker's inclusive and consultative approach, especially his efforts to involve all political parties in the legislative process. She lauded Pakistan's sustainability initiatives and emphasized the value of sharing Parliamentary experiences to strengthen lawmaking. Jane Marriot reaffirmed the UK's continued support to Pakistan in the areas of education, climate resilience, and social development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}