{
  "article_id": "2025-06-19_884e7bcb516fa1bca25e2f67164a5d55",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/igp-rizvi-directs-foolproof-security-for-muharram-processions-majalis/",
    "retrieved_at": "2025-08-27T16:13:42.465Z"
  },
  "metadata": {
    "title": "IGP Rizvi directs foolproof security for Muharram processions, majalis",
    "author": null,
    "date_published": "2025-06-19T08:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 231,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Inspector General of Police (IGP) Syed Ali Nasir Rizvi chaired a high-level meeting on Thursday to review security arrangements for the upcoming month of Muharram. An official told APP that the meeting was attended by all DIGs, SSPs, SPs, SDPOs, and SHOs of the capital police. The officers briefed the IGP on the security plans in their respective jurisdictions for religious processions, Majalis, and Imambargahs. IGP Rizvi directed that security preparations be initiated immediately across all zones. \"Senior officers must visit Imambargahs, the routes of processions, and the venues of Majalis to ensure foolproof arrangements,\" he said. IG Rizvi instructed that organizers of Imambargahs and scouts be engaged for close coordination, and specialized training sessions be arranged for scouts participating in security support. \"Bushes and shrubs along the procession routes must be cleared, and all resources should be used for surveillance around processions and Imambargahs,\" said IG Rizvi. He emphasized the importance of launching search, combing, and intelligence-based operations throughout the district ahead of Muharram. The IG Rizvi announced that a special control room would be set up in the Safe City Islamabad headquarters for centralized monitoring of the security arrangements. \"Drone cameras and surveillance equipment will be used to ensure real-time monitoring,\" he added. IG also instructed all officers to hold daily briefings for deployed personnel to keep them informed and prepared throughout the month of Muharram.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}