{
  "article_id": "2025-06-19_422185baa9491de3191056c95d09e2a9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pre-monsoon-rains-expected-across-pakistan-from-june-20-23-pmd/",
    "retrieved_at": "2025-08-27T16:16:09.553Z"
  },
  "metadata": {
    "title": "Pre-monsoon rains expected across Pakistan from June 20-23: PMD",
    "author": null,
    "date_published": "2025-06-19T10:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 389,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):The Pakistan Meteorological Department (PMD) has forecast pre-monsoon rains across various regions of the country from June 20-23 with occasional gaps, subsiding the intense heat wave affecting several parts. The expected wet spell will bring dust storms, rain-wind, and thundershowers, while isolated areas may also experience heavy rainfall and hailstorms. According to the Met Office, moist currents from the Bay of Bengal and the Arabian Sea were entering upper and central parts of the country. A westerly wave was also likely to approach the upper regions on June 20, which will contribute to the development of unstable weather conditions during this period. From June 20 to 23, rain-wind/thunderstorms with isolated heavy falls and hailstorms are expected in parts of upper and central Punjab, including Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Lahore, Faisalabad, Jhang, Toba Tek Singh, Hafizabad, Mandi Bahauddin, Gujranwala, Gujrat, Sialkot, Narowal, Sargodha, and Mianwali. Rain and thunderstorm activity are also likely in the upper districts of Khyber Pakhtunkhwa such as Peshawar, Mardan, Swabi, Nowshera, Charsadda, Abbottabad, Mansehra, Haripur, Chitral, Dir, Swat, Malakand, Battagram, Shangla, Kohistan, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Kohat, Bannu, Karak, Dera Ismail Khan, and Waziristan. Azad Jammu and Kashmir, Gilgit Baltistan, Murree, and Galliyat are also expected to receive scattered rain and thunderstorms during this period. From June 21-23, duststorm and rain-wind/thunderstorm activity is predicted in parts of south Punjab and northeastern Balochistan, including Zhob, Barkhan, Musakhel, Kalat, Dera Ghazi Khan, Multan, Bahawalpur, Bahawalnagar, and Sahiwal. Meanwhile, from June 22-24, the upper districts of Sindh, particularly Sukkur, Larkana, Dadu, and Jacobabad, are also likely to receive duststorms and thundershowers. The Met Office warned that windstorms and lightning may cause damage to vulnerable structures such as electric poles, trees, solar panels, and parked vehicles, especially in upper and central regions including Islamabad. The intense heatwave currently affecting many parts of the country is expected to gradually subside during the forecast period. There is a risk of urban flooding in low-lying areas of Lahore, Rawalpindi, Gujranwala, and Islamabad during heavy downpours. Farmers are advised to manage their crop activities in line with the forecast. General public, travelers, and tourists are urged to take precautionary measures and avoid unnecessary travel to vulnerable or flood-prone areas. The PMD has advised all concerned authorities to remain on alert and take necessary measures to prevent any untoward situation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}