{
  "article_id": "2025-06-19_4bc5d4407d7294454a13690bcf37fd49",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-to-attend-session-of-oic-cfm-2/",
    "retrieved_at": "2025-08-27T16:13:22.169Z"
  },
  "metadata": {
    "title": "DPM to attend session of OIC CFM",
    "author": null,
    "date_published": "2025-06-19T18:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 225,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Deputy Prime Minister/Foreign Minister, Senator Mohammad Ishaq Dar will visit Turkiye, to participate in the 51st Session of the Council of the Foreign Ministers (CFM) of the Organization of Islamic Cooperation (OIC) being held on 21-22 June 2025. During the plenary session, the Deputy Prime Minister/Foreign Minister, will share Pakistan's perspective on the developments in South Asia, following the ceasefire arrangement between Pakistan and India and the situation in the Middle East, after Israel's recent aggression against Iran and other regional states. Reaffirming Pakistan's steadfast commitment to the Palestinian cause, the DPM/FM will emphasize the pressing need to establish peace in the Middle East and provide humanitarian aid to the people of Gaza. The DPM/FM will also urge the international community to take decisive actions to combat the escalating tide of Islamophobia and need to urgently address other contemporary global challenges including rising extremism and terrorism and climate change. He will reiterate Pakistan's unwavering commitment to the objectives and principles of the OIC and its efforts to address the issues confronting the Muslim Ummah. On the sidelines, the Deputy Prime Minister will hold bilateral meetings with his counterparts from other OIC member states. Prior to the CFM, the DPM/FM will participate in the award ceremony for the grant of \"OIC Youth Forum Grand Youth Award\" to President of Turkiye, Recep Tayyip Erdogan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}