{
  "article_id": "2025-06-19_9ce8c3b3c54556017f549e6b1c5c91c7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-for-finalizing-industrial-policy-at-earliest-to-boost-production/",
    "retrieved_at": "2025-08-27T16:12:59.627Z"
  },
  "metadata": {
    "title": "PM directs for finalizing industrial policy at earliest to boost production",
    "author": null,
    "date_published": "2025-06-19T09:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 221,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday directed to finalize the industrial policy at the earliest to increase production and provide sustainable solutions to the challenges faced by industries. He also issued directions to the relevant authorities that the industrial policy be finalized in consultation with all relevant stakeholders. Describing the industrial sector as the backbone of the countryas exports, the Prime Minister stressed that the development of industries is essential to achieving export-led economic growth. Chairing a meeting on the promotion of the Industrial sector, the prime minister underscored that equipping local industries with a skilled workforce and modern technology to international standards was the governmentas top priority. aInvestment in the country will be promoted through tariff rationalization,a the prime minister said, adding that aUncertain industrial policies have hindered industrial growth. Through an effective policy, we will take industrial development to new heightsa. The recent economic policies, he said, were formulated keeping in view the development of the countryas industrial sector. During the meeting, recommendations for the development of national industries were presented to the Prime Minister. He was informed that the manufacturing sector of the country will be revived through an effective industrial policy. The meeting was attended by Minister for Economic Affairs Ahad Khan Cheema, Special Assistant Haroon Akhtar and other relevant high officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}