{
  "article_id": "2025-06-19_691c1994b1d752c1cc2a0e3efaf14fcc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-continues-budget-debate-set-to-take-up-key-legislation/",
    "retrieved_at": "2025-08-27T16:13:18.468Z"
  },
  "metadata": {
    "title": "Senate continues budget debate, set to take up key legislation",
    "author": null,
    "date_published": "2025-06-19T09:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 280,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Presided over by Chairman Senate Syed Yousaf Raza Gillani, the Upper House on Thursday continued discussion on the Finance Bill, 2025, after taking up significant legislative business, including the presentation and introduction of key bills. Senator Rana Mahmood-ul-Hassan, Chairman of the Standing Committee on Cabinet Secretariat, presented committee reports on two bills. The first was the Civil Servants (Amendment) Bill, 2025, aimed at updating the Civil Servants Act, 1973. The second was the Pakistan Telecommunication (Re-organization) (Amendment) Bill, 2025, proposing changes to the existing telecommunication regulatory framework. Senator Talal Chaudhry, representing Senator Syed Mohsin Raza Naqvi, Minister for Interior and Narcotics Control, introduced the Criminal Laws (Amendment) Bill, 2025. The bill seeks to amend the Pakistan Penal Code, 1860 and the Code of Criminal Procedure, 1898. The bill was referred to the relevant standing committee for further consideration. Senator Khalil Tahir Sandhu introduced the Legal Practitioners and Bar Councils (Amendment) Bill, 2025. With the House's consent, Chairman Senate Syed Yousaf Raza Gillani referred the bill to the relevant standing committee for detailed discussion and consideration. Minister for Law and Justice Azam Nazeer Tarar, representing Senator Ahad Khan Cheema, Minister for Establishment, moved the Civil Servants (Amendment) Bill, 2025, as reported by the standing committee, for consideration and passage. The House passed the bill accordingly. Following the legislative business, the House resumed debate on the Finance Bill 2025, with several senators expressing their views on the fiscal measures proposed for the financial year 2025-26. The debate is being held under the motion moved by Minister for Finance and Revenue Muhammad Aurangzeb on June 10, seeking the Senate's recommendations for the National Assembly under Article 73 of the Constitution.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}