{
  "article_id": "2025-06-19_3d40a2efa66951986d3292bb1a78140c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-chose-truth-reforms-over-populism-naseer-sidhu/",
    "retrieved_at": "2025-08-27T16:14:35.343Z"
  },
  "metadata": {
    "title": "Govt chose truth, reforms over populism: Naseer Sidhu",
    "author": null,
    "date_published": "2025-06-19T15:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 480,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):Pakistan Muslim League (PML-N) Member of the National Assembly, Chaudhry Naseer Abbas Sidhu, while taking part in budget debate said that the government has announced basic reforms essential for economic revival, safeguarding national sovereignty, and providing public relief. Opening his speech Sidhu commended government's firm stance in support of Iran against Israeli aggression and reiterated that the unity of the Muslim world is closely linked to Pakistan's security, said a press release issued here on Thursday. He said the government had presented a realistic budget under extremely challenging circumstances. He stated that the government did not make false promises or boast of fake achievements-we told the truth and chose the path of reforms. If inflation remains under control and citizens are spared further financial hardship, he said, that would be the real success of the government. Ch. Naseer strongly criticized the former PTI-led government, citing data to highlight the drastic increase in essential commodity prices between 2017 and 2022. \"In 2017, under Nawaz Sharif, a 20kg bag of flour cost Rs800, sugar Rs60 per kg, petrol Rs77 per liter, and the dollar stood at Rs105,\" he said. \"By 2022, during PTI's tenure, these prices had doubled and tripled.\" He alleged that PTI was not a political party but a \"chaotic group imposed on the country through conspiracies.\" Referring to the May 9 violence and attacks on military installations, he said that they burned Jinnah House, defamed our institutions, and launched vile campaigns against the Pakistan Army. Ch. Naseer paid tribute to the armed forces, calling them the pride and shield of the nation. \"It is our soldiers who defend us in the skies, on land, and in the seas-let us strengthen their hands and boost their morale,\" he urged. He said the budget included major steps such as curtailing government expenditure, reducing reliance on subsidies, and increasing the tax-to-GDP ratio to 11%. He emphasized that a Rs3 trillion increase in tax revenues within two years was a major achievement and expressed confidence that next year's Rs14 trillion target would also be met. Ch. Naseer welcomed agricultural incentives in the budget, including \"no new taxes on fertilizers or agrochemicals\" and \"interest-free loans of up to Rs100,000 for small farmers.\" However, he urged the government to take further steps for affordable access to fertilizers, tractors, and farm machinery. He lauded overseas Pakistanis as \"true heroes of the economy,\" noting that \"they sent $38 billion in remittances this year, which have played a critical role in supporting Pakistan's economy.\" He appreciated the proposed legal protections and educational quotas for expatriates' children and appealed for even more facilitation, especially at airports and in official dealings. Ch. Naseer emphasized the need to \"depoliticize the economy, ensure continuity of reforms, and share the national burden collectively.\" He also praised Chairman Bilawal Bhutto Zardari for effectively representing Pakistan's case on the global diplomatic stage.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}