{
  "article_id": "2025-06-19_ce161404fee337c05fe2c3ed207bfd07",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/saba-hails-asim-munir-president-trump-meeting-as-landmark-moment-for-pakistan/",
    "retrieved_at": "2025-08-27T16:14:33.727Z"
  },
  "metadata": {
    "title": "Saba hails Asim Munir–President Trump meeting as landmark moment for Pakistan",
    "author": null,
    "date_published": "2025-06-19T16:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 377,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):In a strong show of support for Pakistan's civil-military leadership, Parliamentary Secretary for Human Rights MNA Saba Sadiq on Thursday lauded the recent meeting between Field Marshal Syed Asim Munir and U.S. President Donald Trump, calling it a \"historic breakthrough\" for Pakistan and the region. She credited divine mercy, visionary leadership, and the Pakistan Army's strategic resolve for enhancing the country's global standing. Speaking to APP on Thursday, MNA Saba Sadiq described the high-level meeting at the White House as a moment of honor for Pakistan, emphasizing that Field Marshal Asim Munir's leadership had earned international recognition. She noted that Pakistan's response to recent Indian aggression was widely acknowledged, citing the strategic role played by the army under leadership of Field Marshal Asim Munir and the diplomatic efforts of the Prime Minister Mian Muhammad Shehbaz Sharif. She stated that the Pakistan Army's calculated response not only thwarted enemy designs but also boosted national morale, effectively countering India's influence in the region. When asked about the humanitarian crisis in Gaza, MNA Saba Sadiq condemned Israeli actions, labeling Israel a \"terrorist state\" and Prime Minister Netanyahu the \"head of the terrorists.\" She criticized Israel's disregard for international law and UN resolutions, highlighting attacks on schools, hospitals, and shelters that resulted in the martyrdom of innocent civilians. She urged global organizations, including the OIC and NGOs, to take coordinated action against Israel's continued brutality. Talking about recent tragic incidents in Islamabad involving the murder of two girls, she said the Prime Minister Mian Shehbaz Sharif had ordered strict action, and the Islamabad Police were actively pursuing the case. She confirmed that the suspect was in custody and assured that the government would present strong evidence in court to ensure justice. Referring to cases like those of Sana Yousuf and Eman Afroz, she stressed the government's commitment to preventing such incidents. She revealed that new SOPs were being developed for women's private hostels to ensure their safety and establish regulatory oversight in coordination with the administration. On the federal budget 2025-26, Saba Sadiq stated that efforts were made to provide maximum relief to the public. She added that funds were allocated while prioritizing essential sectors such as health and education to meet the basic needs of the population.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}