{
  "article_id": "2025-06-19_42a492e448fa49202db218fc7e19d953",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bisp-navttc-sign-mou-to-empower-beneficiaries-through-skills-under-benazir-hunarmand/",
    "retrieved_at": "2025-08-27T16:14:57.021Z"
  },
  "metadata": {
    "title": "BISP, NAVTTC sign MoU to empower beneficiaries through skills under Benazir Hunarmand",
    "author": null,
    "date_published": "2025-06-19T15:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 263,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):BISP and NAVTTC have signed a key Memorandum of Understanding (MoU) to collaborate under the Benazir Hunarmand Program (BHP), aimed at providing skill training to BISP beneficiaries and their family members. The signing ceremony was held at NAVTTC headquarters and was attended by BISP Chairperson Senator Rubina Khalid and NAVTTC Chairperson Ms. Gulmina Bilal. The MoU was signed by Dr. Asim Ijaz, Director General NSER BISP, and Dr. Muhammad Ishaq Rao, Director General NAVTTC. Other notable attendees included Executive Director NAVTTC Muhammad Aamir Jan and Chairman TEVTA Punjab Brig. Muhammad Sajid Khokhar. The objective of the MoU is to establish a collaborative partnership between BISP and NAVTTC to jointly work on the poverty graduation of BISP beneficiaries through skill development initiatives under the BHP. The partnership also aims to build linkages between TVET institutions and industries to promote demand-driven training programs and to provide hands-on learning opportunities such as internships and apprenticeships. Furthermore, it will oversee the certification process for individuals completing vocational training to ensure quality standards and the recognition of skills at both national and international levels. Senator Rubina Khalid shared that following the recent launch of the Benazir Hunarmand Portal by President Asif Ali Zardari on June 21-Shaheed Mohtarma Benazir Bhutto's birthday-BISP will further streamline the processes of registration, training, and employment for its beneficiaries. Both institutions reaffirmed their shared vision of empowering women and vulnerable communities through skill development and employment, making a meaningful contribution to poverty alleviation and economic independence. They also committed to developing a joint action plan and expanding training opportunities in future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}