{
  "article_id": "2025-06-19_629e04e82ea30c5ac3cc507f88c1438e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/judicial-commission-of-pakistan-meets/",
    "retrieved_at": "2025-08-27T16:13:47.971Z"
  },
  "metadata": {
    "title": "Judicial Commission of Pakistan meets",
    "author": null,
    "date_published": "2025-06-19T18:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 19 (APP):The Judicial Commission of Pakistan has extended the term of the Constitutional Benches of the Supreme Court of Pakistan till 30th November, 2025 and of the Sindh High Court for six months while a broad based committee has formed to for the Annual Judicial Performance and Evaluation the judges of the High Courts. Two meetings of the Judicial Commission of Pakistan were held, in the Conference Room of the Supreme Court Building here on Thursday. In the first meeting, the Commission by majority of its total membership has extended the term of the Constitutional Benches of the Supreme Court of Pakistan till 30th November, 2025. The Chairperson has been pleased to constitute a broad-based committee for the Judicial Performance Evaluation of Judges of all High Courts, comprising members from the Judiciary, Parliament, Executive, and the legal fraternity, to prepare draft rules for the Annual Judicial Performance Evaluation of High Court Judges. In the second meeting, the Commission by majority of its total membership has extended the term of the Constitutional Benches of the High Court of Sindh for a period of six months w.e.f 23rd July, 2025, with the following new nominations and replacements. Mr. Justice Adnan Iqbal Chaudhry and Mr. Justice Jaffar Raza are newly nominated as replacement of Mr. Justice Agha Faisal and Mr. Justice Sana Akram Minhas to the Constitutional Bench of the High Court of Sindh.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}