{
  "title": "US-Taliban peace deal, a great moment for Afghanistan, honor for Pakistan: FM",
  "link": "https://www.app.com.pk/national/us-taliban-peace-deal-a-great-moment-for-afghanistan-honor-for-pakistan-fm/",
  "date_published": "2020-02-27T23:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP):Foreign Minister Shah Mahmood Qureshi Friday said that the peace deal, scheduled to be signed between  the United States and Afghan Taliban on Saturday (February 29), was a great moment for Afghanistan and Afghan people, besides being an honor for Pakistan.\n“Tomorrow is a great day for Afghanistan and Afghan people. God willing, Afghanistan is heading towards peace and reconciliation. Tomorrow’s agreement will pave way for an intra-Afghan dialogue,” the foreign minister said talking to Afghan media in Doha where he was to represent Pakistan at the signing ceremony.\nIn a separate statement, the foreign minister hoped that the peace deal would be signed on Saturday and representatives from around 50 countries would attend the ceremony.\nHe said Pakistan had been invited to become part of this process as the world was appreciative of Pakistan’s role for Afghan peace. “This is a great honor for Pakistan and recognition of its efforts,” the foreign minister remarked.\nHe said amid the presence of world media, that arrived in Doha to cover the peace deal, two matters including the peace agreement and genocide in New Delhi were the subjects of everyone’s discussion including the international media.\nThe members of the US foreign relations committee, the intellectuals, actors, and musicians of the world were also speaking up on the ongoing situation in India. “Pakistan’s perception is enriching while India’s is downing,” Qureshi commented.\nHe said Pakistan was playing a central role at the international level by foiling the Indian attempts for its isolation. Even India had to bite the dust in its utmost efforts to blacklist Pakistan in the FATF, he added.\nThe foreign minister said the world was questioning the so-called secular face of India where a judge was transferred from New Delhi to Haryana when he moving to do justice.\nHe said during the US President Donald Trump’s visit to New Delhi, both the countries could\nnot agree on a trade deal. Even a curfew like condition prevailed in some parts of New Delhi with military patrolling there.\nHe said under the police patronage, the RSS goons were torching the public properties, attacking the Muslims and even raising Hanuman flags over mosques. The world is witnessing all this happening, he added.\nEven, the foreign minister said India tried to impede the US-Taliban peace deal and it would be a great success if it took place despite all that.",
  "retrievedAt": "2025-08-11T18:52:29.564Z"
}
