{
  "title": "AJK President lauds British Kashmiris vibrant role for highlighting K-Issue",
  "link": "https://www.app.com.pk/national/ajk-president-lauds-british-kashmiris-vibrant-role-for-highlighting-k-issue/",
  "date_published": "2020-02-28T01:38:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 28 (APP):Azad Jammu & Kashmir President Sardar Masood Khan while cautioning about the India’s sordid designs to eliminate Pakistan and the liberated territory, has stressed that we should militarily prepare ourselves to counter India.\n“The Indian Hindu fanatics are bent upon repeating the episode of Delhi, in the whole of South Asia including Pakistan and Kashmir,” he declared.\nSpeaking as the chief guest at a reception hosted by the Vice Chairman of Jammu and Kashmir Salvation Movement and Hurriyat leader Altaf Ahmed Butt in honor of the leader of Tehrike Kashmir UK Raja Fahim Kayani at the Kashmir House in federal capital on Thursday, Sardar Masood Khan said that the Pakistani armed forces were fully prepared and alert to defend the motherland the way they had given a befitting response to aggressor India on February 27 last year, AJK Presidential Secretariat said in a statement released to media late Thursday night.\nHe, however, maintained that India still has dangerous and heinous designs against Pakistan, and there is a need to prepare the whole nation particularly the youth to frustrate these designs.\nThe AJK president asserted that the history is evident that big powers eliminate the nations which remain weak or ignorant of the dangers confronting their sovereignty, and we would have to strengthen our defense keeping in view India’s fanatic and aggressive designs.\nAppreciating political and diplomatic efforts of Tehrike Kashmir UK abroad for the right of self-determination of the Kashmiri people, he said that the Tehrik and its young leader Fahim Kayani particularly after India’s actions of August 5 last year, had united the Kashmir community across the UK, and by holding rallies and demonstrations in all big and small cities including London, had projected the ongoing human crisis and the human rights violations in occupied Kashmir.\nThe AJK president particularly mentioned the efforts of the president of Tehrike Kashmir UK which had made possible an important parliamentary Kashmir conference in the UK parliament on the occasion of the Kashmir solidarity day.\nThe conference was attended by more than 50 MPs, and they had raised their voice against India and in support of the Kashmiri people. President Khan also appreciated the passion, commitment and untiring efforts Vice Chairman Kashmir Salvation Movement Altaf Ahmed Bhat for promotion of Kashmir issue. The way Altaf Bhat narrated the plight of Kashmiri people in a conference in London highly impressed the MPs present in the conference.\nSardar Masood Khan also appreciated the President of Tehrike Kashmir Italy Mehmood Sharif, and Hanif Raja who had come from Glasgow Scotland, and paid glowing tributes to them for their efforts for the Kashmir liberation movement.\nThe reception was also addressed among others by Chairman Azad Kashmir Public Accounts Committee Abdur Rashid Turabi, Maulana Moid Yousuf, Hurriyat leader Sheikh Abdul Matin, Engineer Mehmood, Chaudhry Shakil, Hannan Abbasi, leader of Muslim League UK Chaudhry Shakil, and Deputy Lord Mayor of Glasgow City Council Hanif Raja.\nEarlier, a six member delegation of Tehrike Kashmir led by Fahim Kayani held an exclusive meeting with the AJK President Sardar Masood Khan, and discussed the efforts for the realization of the right of self-determination of the Kashmiri people.",
  "retrievedAt": "2025-08-11T18:52:26.136Z"
}
