{
  "title": "WHO urges public to follow basic preventive measures against coronavirus",
  "link": "https://www.app.com.pk/national/who-urges-public-to-follow-basic-preventive-measures-against-coronavirus/",
  "date_published": "2020-02-27T22:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP):World Health Organization (WHO) on Friday urged the public to obtain the latest information on coronavirus (COVID-19) from key sources and follow and promote the recommended basic preventive and protective measures.\nAccording to WHO, after a series of rigorous tests and investigations, the government of Pakistan is now treating the two patients as per standardized clinical protocols.\nIt added that agencies such as WHO are stepping-up provision of immediate support to the government so that preparedness and response measures are in place to handle the situation as it develops.\nIt said Pakistani health authorities confirmed two cases of COVID-19. Both confirmed cases are from citizens who traveled to Iran for pilgrimage and subsequently returned to their hometowns of Karachi and Rawalpindi with initial respiratory symptoms of the virus.\nThe representative of the WHO in Pakistan, Dr Palitha Mahipala, expressed concern over the current situation. “I am impressed by the swift and diligent way the government has handled the crisis so far, and WHO is committed to support them every step of the way.”\nHe added that the COVID-19 outbreak is a public health emergency of international concern and all countries neighboring Pakistan like Iran, Afghanistan, China and India have registered at least one confirmed case of the virus.\nIt is critically important that countries and international organizations work hand in hand to minimize the spread of the virus, he said.\nTo date, WHO has assisted Pakistan’s preparedness and response to COVID-19 in various ways. As a priority, screenings of travelers at all points of entry to the country have been set-up.\nScreenings are currently being carried out for international travelers who are arriving at airports in Islamabad, Lahore, Sialkot, Peshawar, Quetta and Karachi. Screenings at Gwadar, Taftan and Chaman ground-crossing points have also been established for those entering from neighbouring Afghanistan or Iran.\nMoreover, WHO is supporting to bolster the surveillance system to ensure suspected cases are investigated in a timely manner and confirmed as per the set international standards.\nWHO has been supporting healthcare providers and facilities to build their capacity for the preparedness and response. These measures included training health care providers on contact tracing and case definition for suspected and confirmed cases, case management and the infection, prevention and control measures, distributing personal protective equipment to health facilities, including at points of entry, for managing suspected and confirmed cases, activating or alerting rapid response teams and distributing information education and communications materials to raise public awareness and counter rumors and misinformation.\nTo assist the response, WHO has provided eight kits of medical equipment to the relevant Provincial Disaster Management Authorities (PDMA) and Departments of Health.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:52:31.104Z"
}
