{
  "title": "US$142m amazing steel bridges at Koh-e-Suleman start accommodating inter-provincial traffic",
  "link": "https://www.app.com.pk/national/us142m-amazing-steel-bridges-at-koh-e-suleman-start-accommodating-inter-provincial-traffic/",
  "date_published": "2020-02-28T01:02:00.000Z",
  "source": "APP",
  "content": "MULTAN, Feb 28 (APP)::An amazing combination of steel bridges that cut through magnificent rocky Suleman Mountain Range as a marvel of Japanese architecture and engineering technology has started supporting inter-provincial and cross-country traffic to accelerate economic activity through DG Khan-Fort Monroe segment of N-70 highway.\nThe mind boggling exercise to decorate the difficult most topography of Suleman Mountain Range with the Steel Box Girder Bridge began back in July 2016 with 142 million US dollar funding from Japan (Japan International Cooperation Agency, Jica) as a concessional loan at a very low mark up of 0.2 per cent payable in 40 years with a 10-year grace period.The formal inauguration is likely to be held in April before start of the Holy month of Ramzan, according to the officials.\nIt looks glorious symbolising Japan-Pakistan friendship and the support of the people of Japan to the people of Pakistan, says Teruki Hanazawa, the first secretary and deputy head of economic and development, embassy of Japan, during a visit to the project site along with a group of journalists last Wednesday, Feb 26.\nHanazawa was accompanied by a consultant Ms. Naoka Kogure and media director Sajid Abbasi and the team also visited a middle school at Baseera in district Muzaffargarh for inauguration of its building that was completed recently utilizing Japan’s Grant Assistance for Grassroots Human Security Projects (GGP) amounting to US$ 88,355.\nProject Director, Hafeezullah Buzdar, briefed the visitors about the steel bridge project stating that the challenging assignment was completed in a record three-year duration at over Rs 13 billion cost and was supporting traffic from Balochistan besides cross-country traffic.\nThe Steel Box Girder Bridge was built under project titled Widening & Strengthening of National Highway 70 (N-70) under Japan’s Official Development Assistance and executed jointly by Japanese company Taisei corporation, National Highway Authority (NHA), CTI, Oriconsul, Exponent engineers etc.\nN-70 is a 450-km main artery connecting Punjab and Balochistan from Qila Saifullah to Multan and an 11.5-km Rakhi Garj to Bewata section, near Fort Monroe hill station of South Punjab, was a major traffic bottleneck that had been bothering the motorist since long, and resolved finally after the state-of- the-art seven steel bridges were erected.\nThe Japanese technology masterpiece was built with box- shaped girders made of weather resistant special steel that can be maintenance-free for 75 years and special embankment wall strengthened with light and strong materials to avoid land sliding. Girdo More on DG Khan-Fort Monroe road was the most troublesome turn to negotiate particularly for trucks who used to apply handbrakes to let the traffic from opposite direction pass and then move on.\nEngineers had to build work stations and for dangerous turns, the likes of Girdo, they moved a bit away from the rock and installed bridges with strong pillars to support.\nNow the single-truck road has been expanded to double-truck and sharp curves with a radius of 8 meters has been enlarged to 30 meters enabling convenient traffic flow with steep hills on one side and the fearsome depth on the other.\nAs the result of the project, heavy-weight trailers can be passing with over 40 km/h, which would promote smooth transportation between the east and west of the nation.\nDirector construction NHA South Sulait Ahmad said that N-70 has emerged as a preferred route for commuters between Balochistan and Punjab after construction of the bridge and added that NHA weigh stations are active in Balochistan and Sakhi Sarwar in Punjab to check the weight of the heavy vehicles to avoid overloading. The bridge has a life span of 100 years but can last longer, Sulait remarked. People believed the bridge would be instrumental in accelerating economic activities and promoting tourism to Fort Monroe and other scenic and historical spots Suleman Mountain Range is known for.\nLater, Mr. Teruki Hanazawa and Ms. Naoka Kogure inaugurated new building of a middle school of an NGO, Health Oriented Preventive Education (HOPE). School organizers said, students’ strength has increased by 23 per cent and risen to 283 including 150 girls after construction of new building and in addition to education they are also being trained on tailoring and embroidery.",
  "retrievedAt": "2025-08-11T18:52:27.419Z"
}
