{
  "title": "Govt not to allow burden of corruption, administrative mismanagement on common man: PM",
  "link": "https://www.app.com.pk/national/govt-not-to-allow-burden-of-corruption-administrative-mismanagement-on-common-man-pm/",
  "date_published": "2020-02-28T08:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP):Prime Minister Imran Khan on Friday said the government would not allow anybody to put the burden of corruption and administrative mismanagement in institutions on the common man.\nThe prime minister was chairing a meeting to review the impact of government’s subsidies in various sectors to provide relief to the low-income and downtrodden segments of the society.\nThe meeting was attended by Minister for Energy Omar Ayub, Minister for Planning Asad Omar, Advisor on Commerce Abdur Razak Dawood, Advisor on Finance Dr Abdul Hafiz Shaikh, Special Assistant to the PM on Information and Broadcasting Dr Firdous Ashiq Awan and high officials.\nThe meeting was briefed about the provision of subsidies by the government in energy, food and fertilizers sectors, besides the Ehsaas programme for social protection, provision of amount and its usage to increase exports, and promotion of higher education.\nThe prime minister said apart from the provision of subsidy, it should be ensured that the amount provided should be utilized for the specific purpose, and was fruitful for the people concerned. He also stressed the need to review effects of the subsidies.\nImran Khan expressed satisfaction over the success of staff level agreement with the International Monitory Fund (IMF), saying the IMF’s trust in the government’s economic policies and its direction, with protection to the people in the current fiscal year was the success of government.\nHe directed the Energy Division to fully concentrate on busting big power thieves, besides taking action against the elements who had somehow become cartels leading to illegal profiteering so that the people could be protected from electricity theft, flaws in the system and exploitation.\nThe meeting was told that the basic purpose of providing subsidies by the government was to provide relief to the low income and downtrodden segments of the society, promotion of industries and to access to the higher education.\nIt was also informed that as a whole Rs 251 billion subsidy was being provided in the energy sector. About Rs 162 billion had been allocated for the current fiscal year to provide subsidy to those domestic consumers who utilized upto 300 electricity units.\nSimilarly, Rs 8.5 billion was earmarked to provide subsidy for tube wells (agriculture) in Balochistan while Rs 18 billion was being provided to the people of merged tribal areas of Khyber Pakhtunkhwa, Rs 3 billion to the Azad Jammu and Kashmir. and Rs 25 billion to the K Electric.\nTo provide electricity and gas to the industrial sector at reasonable rates, Rs 10 billion and Rs 24 billion had been allocated.\nThe meeting was told that billions of rupees subsidy was being provided to keep prices of wheat and flour in control. Rs 5 billion had been allocated to ensure strategic resources, Rs 8 billion for payment of arrears of wheat in Gilgit-Baltistan, Rs 2.5 billion for the Utility Stores for Ramzan Package and Rs 21 billion subsidy under the head of the Prime Minister Relief Package.\nRs 6 billion had been allocated under the wheat package for Gilgit-Baltistan during the current fiscal year, it was told.\nThe meeting was informed that Rs 192 billion had been allocated for social protection under the Ehsaas Programme while full details of the amount provided for Kafalat, Waseela Taleem, Undergraduate Scholarships , poverty alleviation, shifting of assets and interest-free loans were also presented.\nIt was informed about the amount allocated for increase in exports and railways.",
  "retrievedAt": "2025-08-11T18:52:22.044Z"
}
