{
  "title": "PM will give away Ehsaas Undergraduate Scholarships on March 2",
  "link": "https://www.app.com.pk/national/pm-will-give-away-ehsaas-undergraduate-scholarships-on-march-2/",
  "date_published": "2020-02-28T00:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP):Prime Minister Imran Khan will give away need based Ehsaas undergraduate scholarships to the first batch of deserving bright students on March 2, 2020.\nThis four year, Rs.24 billion initiative will support 200,000 students (50% girls) from low income backgrounds.\nAs part of the Ehsaas scholarships policy, 2% scholarships will be exclusively awarded to students with special needs, said a news release issued here.\nOverall, 50,000 scholarships will be given every year to enhance financial access to higher education for the deserving.\nThe continuation of scholarship in following years will depend upon the maintenance of academic performance.\nThe need and merit-based scholarship covers tuition fee as well as a living stipend.\nThe prime objective of Ehsaas scholarships program is to ensure that no eligible student is deprived of higher education because of financial need.\nThis program is unique as it reflects a historic shift in scholarship policy of the government. Unlike past scholarships that aimed at MS or PhD level programs, this project specifically focuses on undergraduate education, which is the surest way of rising out of poverty.\nFollowing the official launch of the Ehsaas undergraduate scholarships by the PM on Nov 4, 2020, the Higher Education Commission’s (HEC) online portal had been opened for applications till Dec 24, 2020.\nBy the closing date, as many as 132,192 undergraduate students (49,841 girls) applied for scholarships for the academic year 2019-20 under the first phase of the project.\nAll students from low-income backgrounds studying in undergraduate programmes across 119 public sector universities recognized by HEC were eligible to apply.\nSubsequently, the universities’ scholarship award committees made provisional decisions based on applications and documents received and recommended them for ratification by the program steering committee.\nThe provisional decisions were confirmed after formal ratification as well as follow up scrutiny, including income verification, verification of supporting documents, and personal interviews by the scholarship award committee.\nReflecting on the significance of Ehsaas scholarships program, Dr. Sania Nishtar, Prime Minister’s Special Assistant on Social Protection and Poverty Alleviation stated, “Pakistan has one of the youngest populations in the world and the government could not afford to waste the demographic dividend that is key to building a strong and sustainable economy.\nBy offering these Ehsaas undergraduate scholarships to the deserving best and brightest minds across our country we are enriching the Pakistani workforce, encouraging diversity across all our professions and investing in the leaders of tomorrow.”\nShe then reiterated, “With fifty percent girls’ inclusion in these scholarships, Pakistan will also benefit the measures in this program to tackle gender discrimination in education, which negatively impacts our nation’s health and economic growth.”\nThe project is being overseen by the Ehsaas Scholarships Steering Committee, co-chaired by Dr. Nishtar and Chairman HEC.\nAs part of this shared initiative, a joint monitoring and evaluation framework has been set up to ensure that the program is running in a transparent, equitable, and accountable manner. The monitoring and evaluation system reports directly to the Ehsaas Scholarship Steering Committee.",
  "retrievedAt": "2025-08-11T18:52:28.688Z"
}
