{
  "title": "Mushaal expresses concern for continued human rights violations in IIOJK valley",
  "link": "https://www.app.com.pk/national/mushaal-expresses-concern-for-continued-human-rights-violations-in-iiojk-valley/",
  "date_published": "2023-09-17T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): Special Assistant to Prime Minister (SAPM) on Human Rights and Women Empowerment, Mushaal Hussein Mullick on Sunday expressed serious concern over the plight of illegally detained Hurriyat leaders in the Indian Illegally Occupied Jammu and Kashmir territory.\nTalking to a private news channel, she urged the United Nations to play an active role in their release and asked India to stop systematic human rights violations in IIOJK.\nShe said changing the demography of the territory by granting voting rights to Indian citizens in the internationally recognized disputed territory is a big violation of international law.\nShe said it is highly unfortunate that the Modi regime has closed doors of all peaceful means to resolve the long-pending Kashmir dispute by resorting to the worst kind of extremism and fascism and converting the occupied territory into a military garrison.\nShe added it is the responsibility of the UN and all relevant Human rights organizations to settle the Kashmir dispute by implementing its relevant resolutions to protect the lives of the people of IIOJK.\nMushaal said the Indian government was pro-longing the illegal detentions of Kashmiri political prisoners who have been put behind bars for peacefully struggling for the political resolution of the Kashmir dispute as guaranteed by the United Nations Security Council resolutions.\nThe worsening situation in Indian illegally occupied Jammu and Kashmir needs urgent international attention and the world community must act immediately to protect Kashmiris from Modi’s onslaught.\nKashmiri families, whose loved ones are in Indian jails, cannot think of any occasion of joy and happiness because they are worried about the health of their loved ones in filthy and congested Indian jails, she added.\nReplying to a question, she said Indian Army had a long history of gross human rights violations and fake encounters in the territory.",
  "retrievedAt": "2025-08-11T09:40:50.603Z"
}
