{
  "title": "IAEA regional training course on cancer on Monday",
  "link": "https://www.app.com.pk/national/iaea-regional-training-course-on-cancer-on-monday/",
  "date_published": "2023-09-17T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP):The second regional training course (RTC) organized by the International Atomic Energy Agency (IAEA) in collaboration with the Government of Pakistan through Atomic Energy Cancer Hospital (AECH) NORI will commence here tomorrow (Monday).\nThe title of this RTC is “Palliative Radiotherapy for Brain Metastases and locally advanced Head and Neck Cancers”.\nNuclear Medicine, Oncology and Radiotherapy Institute (NORI), a flagship cancer-care hospital running under the aegis of the Pakistan Atomic Energy Commission (PAEC), is hosting this IAEA RTC.\nInternational delegates from nine IAEA Member States including Bangladesh, China, Cambodia, Indonesia, Japan, Malaysia, Mongolia, Myanmar, Philippines, and Vietnam are participating in the event, said a news release.\nDirector General (DG) Nuclear Medicine and Oncology (NM&O), PAEC, Dr. Ahmad Qureshi is expected to be the chief guest of the course inauguration ceremony.\nThe technical experts in the course will include Director NORI, Dr. Muhammad Faheem, Head Oncology and Radiology, Dr. Humera Mahmood; Consultant Clinical Oncologist Shaukat Khanum Cancer Hospital, Lahore, Dr. Arif Jamshaid; Consultant Oncologist NCCI Karachi, Dr. Azher Rasheed; RIHS, Prof. Dr Kamran of PIMS, Islamabad, Prof. Dr. Altaf Hussain; the Lead Country Coordinator of the IAEA Project, Director Department of Radiation Medicine, Quantum Science Technology Hospital Chiba Japan, Dr. Mararu Wakatsuki and the Course Coordinator NORI, Dr. RafiaToor.\nAtomic Energy Cancer Hospital NORI is one of the 20 Atomic Energy Cancer Hospitals run by PAEC across the country. All these AECHs are equipped with the latest machines and techniques for diagnosis as well as therapy of the cancer disease and cater to more than 70% of the cancer patients of the country.\nNORI has successfully achieved several milestones in the recent past and has successfully adopted more advanced and evolving cancer treatment practices across the world.\nThe Institute is the only public sector cancer care hospital in Pakistan that is equipped with the most advanced treatment facilities including Cyberknife and True Beam Linear Accelerator and is providing state-of-the-art treatment that meets the International Standards.\nThe hospital treats and manages all types of cancers, irrespective of the stage.\nParticipants from all over the country will also join the event.\nThe event would cover various aspects of palliative radiotherapy for brain metastases and locally advanced head and neck cancers including different practices across the world, radiotherapy treatment protocols, types of machines and facilities available, contouring and planning techniques used, case discussions and expert opinions.\nThe practical aspects of this educational activity include hands-on training sessions on contouring, treatment planning, dosimetry and quality assurance.\nThe regional training course will continue for four days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:41:12.420Z"
}
