{
  "title": "Somalia Launches National ID System with Pakistan’s Help, A Milestone ID4Africa”",
  "link": "https://www.app.com.pk/national/somalia-launches-national-id-system-with-pakistans-help-a-milestone-id4africa/",
  "date_published": "2023-09-17T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): The Federal Republic of Somalia has launched a national identification system with the support of NADRA Pakistan, a milestone for the ID4Africa movement, which aims to provide all Africans with a digital identity by 2030.\nH.E. Somali Prime Minister Hamza Abdi Barre inaugurated the Somalia National ID on September 16, 2023, during the first National ID conference held by NIRA Somalia in Mogadishu.\nThe event was attended by Somalia’s development partners, including Pakistan, the EU, the World Bank Group, the UK, the USA, Gulf countries, ID4Africa, diplomats, and UN agencies, a press release said on Sunday.\nThe Prime Minister of Somalia expressed his gratitude to the Prime Minister of Pakistan and NADRA for their support in implementing the Somali National ID system. He also thanked them for their assistance in capacity building for NIRA Somalia.\nhttps://x.com/NadraPak/status/1703425259620213000?s=20\nOther dignitaries at the event, including the UN Special Representative of the Secretary-General for Somalia, Catriona Laing, and the British Ambassador to Somalia, Mike Nithavrianakis, appreciated NADRA’s robust systems and congratulated the governments of Pakistan and Somalia on this successful accomplishment.\nThe Somalia National ID System is part of a multi-million dollar grant extended by the Government of Pakistan to Somalia. It will enable NIRA and the Ministry of Interior Somalia to implement their mandate of enhancing the country’s governance, security, and socio-economic development by providing citizens of Somalia with a secure and universally recognized form of identification.\nThe system will also facilitate more efficient public service delivery, including social welfare programs, healthcare services, and electoral processes, leading to improved governance. It has the potential to streamline the distribution of humanitarian aid, ensuring it reaches those who need it most promptly. The identity system shall also promote financial inclusion in Somalia by enabling citizens to access banking and financial services easily, fostering economic growth.\nChairman NADRA Asad Rehman Gilani said, “NADRA takes immense pride in the successful execution and launch of Somalia’s National Identification System, a testament to the power of collaboration and innovation. This achievement reinforces Pakistan’s vision for a more secure and prosperous Somalia, where every citizen has access to reliable identification. The National ID System will not only bolster security but also pave the way for inclusive development, financial empowerment, and improved governance. It is a shining example of NADRA’s commitment to excellence and our dedication to our global partners.”\nGilani said that the delivery of Somalia’s National ID complimented the Government of Pakistan’s ‘Look Africa’ policy, where NADRA had been playing a pivotal role in providing secure identity and passport solutions under the transfer of technology to various governments in Africa, including Kenya, Sudan, and Nigeria, which held the largest ID database of over 100 million identities in Africa.\nThe Somalia National ID System is a state-of-the-art biometric identification system that will provide Somalis with a secure and universally recognized form of identification.\nThe system will be used to verify identities for a variety of purposes, including banking and financial services, voting, and accessing government services.\nThe system is expected to have a significant positive impact on Somalia’s economy and security.\nThe launch of the Somalia National ID System is a major milestone for the ID4Africa movement, which aims to provide all Africans with a digital identity by 2030.\nThe launch of the Somalia National ID System is a significant achievement for both Somalia and Pakistan. The system is expected to have a major positive impact on Somalia’s economy and security, and it is a shining example of the power of collaboration and innovation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:41:06.992Z"
}
