{
  "title": "‘Govt implementing zero-tolerance policy against power theft mafia’: minister",
  "link": "https://www.app.com.pk/national/govt-implementing-zero-tolerance-policy-against-power-theft-mafia-minister/",
  "date_published": "2023-09-17T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): Caretaker Minister for Energy, Power, and Petroleum, Muhammad Ali Sunday reassured that the interim government was implementing a zero-tolerance policy against the power theft mafia in the country and would not spare any person who proved guilty of having connivance with electricity thieves.\nWhile talking to a private news channel, the minister said with strict directives IESCO had launched the crackdown against electricity thieves and their facilitators in all circles, adding that we are collaborating with all related departments and law enforcement agencies on the district level to ensure that the process is carried out swiftly.\nThe crackdown will continue against the elements involved in electricity theft with the cooperation of the relevant departments, he added.\nReplying to a query, he replied that because of the electricity thieves and those who refuse to pay bills, others have to pay higher bills, adding that we need to stop these practices with the hope that electricity prices may come down.\nHe further said that the govt focused on improving the management of power-related departments, adding, that we are looking at their board of governors and will make changes in the management.\nTo another question, the minister said that the ministry had prepared a list of officers who were involved in the theft, adding that involved officers were being reshuffled and they would be removed from field jobs.\nHe also stressed for bringing reforms into the power sector on a priority basis and highlighting the importance of reforms in the energy sector that reforms were crucial in the energy sector for the economic growth of the country.",
  "retrievedAt": "2025-08-11T09:40:49.617Z"
}
