{
  "title": "PIMA launches nationwide awareness campaign on World Hepatitis Day",
  "author": null,
  "content": "ISLAMABAD, Jul 27 (APP):Pakistan Islamic Medical Association (PIMA) has announced a hepatitis awareness campaign to highlight the importance of prevention, timely diagnosis and effective treatment of hepatitis, in connection with World Hepatitis Day, being observed on July 28, 2025.\nAs part of this campaign, awareness seminars, walks, free screening camps and CME programs will be organized across the country for both the general public and healthcare professionals.\nPIMA Islamabad organized a free medical camp on Saturday in collaboration with the National Press Club Islamabad. The camp offered free screening and medical check-up for Hepatitis B and C, Hepatitis B vaccination, free referrals and further consultation with specialists for deserving patients, along with essential laboratory tests.\nProf. Dr. Atif Hafeez Siddiqui, Central President of PIMA, stated that the leading cause of hepatitis transmission in Pakistan is the use of contaminated and reused syringes and unsafe injections. He added that about 90 percent of people infected with viral hepatitis are unaware of their condition, and that testing is the first and essential step toward timely treatment.\nHe further explained that Hepatitis A and E spread through contaminated water and unsafe food, while Hepatitis B, C, and D are transmitted via infected syringes, surgical instruments, and unsafe blood transfusions.\nDr. Atif emphasized that timely diagnosis and treatment of Hepatitis B, C, and D can not only save lives but also prevent life-threatening complications such as liver cancer.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:12:44.706Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pima-launches-nationwide-awareness-campaign-on-world-hepatitis-day/",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T12:17:00.000Z"
}
