{
  "title": "Abbasi highlights global respect for Pakistan, announces major reforms in Railways",
  "author": null,
  "content": "LAHORE, Jul 27 (APP):Minister for Railways Muhammad Hanif Abbasi said that Pakistan had earned unprecedented global respect, crediting Prime Minister Muhammad Shehbaz Sharif and Chief of Army Staff Field Marshal General Syed Asim Munir for the nation’s elevated international standing.\nSpeaking at the “Meet the Press” event at the Lahore Press Club on Sunday, Abbasi asserted, “Pakistan today is a changed Pakistan. We now walk in the world with our heads held high.” Highlighting Pakistan’s foreign policy successes, Abbasi said that countries like Türkiye and Russia view overseas Pakistanis with respect, and nations such as China, Türkiye, Azerbaijan, Malaysia, and Bangladesh have stood by Pakistan in difficult times. He took a jab at India, alleging its “proxy war” in Balochistan and Khyber Pakhtunkhwa and claiming that the U.S. confirmed five Indian aircraft were shot down in the May conflict . “India is licking its wounds,” Abbasi remarked, sarcastically thanking India for “uniting the entire Pakistani nation.”\nThe minister also addressed domestic critics, accusing some of ingratitude despite benefiting from Pakistan’s resources. “Those who went from riding bicycles to owning BMWs are now badmouthing the country,” he said, criticizing jailed individuals for “screaming and hurling abuses” unlike his own conduct in prison.\nOn the economic front, Abbasi claimed inflation has dropped from 38 per cent to zero due to government policies, though tough decisions were necessary to stabilize the economy. He vowed to crack down on “big crocodiles” looting the country and announced the closure of ten Independent Power Producers (IPPs), with fifteen more to follow.\nTurning to Railways, Abbasi outlined sweeping reforms to modernize the sector. He highlighted improvements such as outsourcing cleaning services at seven stations across Rawalpindi, Karachi, and Lahore, enhancing food quality, and installing free Wi-Fi at Lahore Railway Station. Escalators and information desks have been introduced at stations, and a 105-kilometer railway track for coal transport is set to be completed by April 30, reducing electricity costs from Rs. 15 to Rs. 4.5 per unit. Additionally, a Business Train with Wi-Fi-equipped coaches and high-quality dining will be inaugurated on July 29 to be inaugurated by Prime Minister Muhammad Shehbaz Sharif.\nAbbasi emphasized infrastructure upgrades, including a soon-to-be-finalized agreement for the Rohri-Karachi railway section and a Rs 50 billion allocation from Punjab Chief Minister Maryam Nawaz to improve the Lahore-Rawalpindi track, cutting travel time to two hours. He also announced plans to digitize the railway system, link sixteen banks to the Railway’s app, and install ATMs at 348 stations. To address inefficiencies, three railway companies have been shut down, and long-leave employees will be recalled.\n“Pakistan Railways is the pride of Pakistan,” Abbasi declared, promising to make it profitable if the federal government covers pensions and salaries. He stressed that the railway’s issues stem not from laborers but from unnamed individuals who looted the system.\nReflecting on his personal journey, Abbasi shared that he was born in Lahore, studied at FC College, and began his political career as a student. He praised the Lahore Press Club as the largest in Pakistan and reaffirmed his good relations with journalists.\nHe emphasized the need for investment in Railways to boost the national economy, warning that major reforms are imminent and bureaucratic inefficiencies will not be tolerated. Hanif Abbasi announced that Pakistan Railways remains resolute in the face of challenges, emphasizing the continued operation of the Jafar Express and Bolan Express as a bold message to adversaries. “We are not afraid,” Abbasi declared, highlighting the resilience of the railway network.\nHe outlined several initiatives to strengthen and modernize Pakistan Railways. Sports development is a key focus, with plans to promote football, cricket, and hockey. “Sports are among our priorities, and we will devise a comprehensive plan to support them,” he stated.\nAddressing employment concerns, Abbasi revealed a compassionate approach to contract workers. “We could dismiss contract employees with a one-month salary, but instead, we are considering reassigning Railway sanitation staff to their local areas,” he shared, signaling a commitment to employee welfare.\nThe “Suthra Punjab” initiative will be extended to Railway colonies, aiming to enhance living conditions for staff and their families. Abbasi also claimed unprecedented improvements in cleanliness across the railway system, stating, “The level of cleanliness we have now achieved in Railways has never been seen before.”\nCracking down on illegal activities, Abbasi issued a stern warning against ticketless travel and related offenses. “Smuggling and theft used to plague Railways. Now, anyone traveling without a ticket or aiding such activities will face imprisonment,” he cautioned.\nTo bolster security, Pakistan Railways has recruited 500 new personnel for the Railway Police and plans to acquire scanners and metal detectors using the department’s own budget. Abbasi also noted that outsourcing is a common global practice for railway operations, hinting at potential modernization strategies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:12:16.090Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/abbasi-highlights-global-respect-for-pakistan-announces-major-reforms-in-railways/",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T13:37:00.000Z"
}
