{
  "title": "Mothers unknowingly creating virtual autism among screen-addicted children",
  "author": null,
  "content": "ISLAMABAD, Jul 27 (APP)::In countless homes, mothers reach for phones, tablets or laptops to quiet restless toddlers, seeking brief relief in busy days. But this simple act is fueling a hidden crisis. By choosing screens over real interaction, they are unknowingly raising children vulnerable to virtual autism, a condition that stunts emotional growth and social skills during critical early years. What feels like a moment of peace today could cost a lifetime of challenges tomorrow.\nThe most vulnerable are children between the ages of 2 to 7, a period when the brain is forming critical neural connections. This is when children develop speech, imagination, emotional control, and social skills. But instead of learning through play, bonding, and exploration, many children now spend these vital years staring silently at phones and tablets.\nHanding a 3-year-old a phone to keep them quiet may feel like a small parenting hack, but it can trigger a chain of neurological consequences. What looks like calm today often becomes emotional instability, anxiety, and delayed development tomorrow.\nMany mothers openly admit they don’t use phones out of necessity, but for convenience, to manage chores, enjoy a tea break, or scroll through social media. In the short term, it offers relief. But the long-term impact is far more damaging,  screen dependency, delayed language, poor eye contact, and trouble forming relationships, classic markers of virtual autism.\nIn Pakistan, doctors are already raising the alarm.\nDr. Iqbal Afridi, a senior psychologist, and Ilsa Malik, a clinical psychologist in Islamabad, talking to APP warned that screens are damaging children’s memory, emotions, and sleep.\nDr. Tipu Sultan, a medical practitioner in Lahore sees toddlers becoming anxious and cranky, often resistant to human interaction.\nKarachi-based psychiatrist Dr. Nargis Asad and pediatrician Dr. Mubina Agboatwalla both report rising cases of speech delay and attention disorders, when asked about the rising virtual autism in children by APP.\nIn Rawalpindi, Dr. Tayyab Afghani notes how mobile addiction is straining children’s emotional development and even harming their eyesight, calling it a curse to keep away from children .\nSara Khan, mother of a 6-year-old boy from Islamabad speaking to APP said,\n“My son spends hours on YouTube and games. He used to play outside but now he cries when I take the phone away. He even skips meals just to keep watching”.\nAyesha Malik, mother of a 4-year-old girl from Lahore has an excuse to handover phone to her daughter but regrets saying,\n“I gave my daughter the phone to help me cook and finish work. Now she refuses to sleep without watching cartoons. I regret introducing her to the screen so early.”\nMother of a 5-year-old boy Maria Khan from Lahore and  Samina Shehroz, a 3-year-old boy from Gujranwala have similar stories of repent to share with APP, and said,\nAt first, they thought it was harmless, just ten minutes so they could relax. But ten minutes turned into hours. Now, when the battery dies, they cry, and he do not even recognize family members anymore. they only sings the poems they watch online. They regret it deeply, never realizing how harmful a phone could be.\nThe effects are showing up in schools, too. Teachers report children unable to sit still, follow instructions, or share with peers. Many cannot handle boredom or delay gratification, signs of brains overstimulated by screens and underdeveloped in real-world emotional coping.\nThe government must introduce clear restrictions on screen use for children under 7. Hospitals, schools, and social programs should run aggressive awareness campaigns, especially targeting mothers. Where neglect is repeated, real consequences must follow to safeguard children’s health.\nTech companies must also be held accountable. Apps and content designed for children under 7 should face strict regulation, including mandatory screen time limits and age locks.\nGiving a child a phone or a digital screen is not a clever fix. It is a decision that shapes brain chemistry, emotional growth, and long-term well-being. We cannot keep excusing this behaviuor with stress or exhaustion. Those may be real, but screens are not the solution. They are the problem.\nChildren don’t need phones, tablets or laptops. They need faces, voices, stories, hugs, patience, and love.\nThey need parents who choose presence over distraction.\nUntil mothers make that choice, this crisis will only grow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:13:20.393Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/mothers-unknowingly-creating-virtual-autism-among-screen-addicted-children/",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T09:12:00.000Z"
}
