{
  "title": "Govt making concerted effort to contain hepatitis epidemic: PM",
  "author": null,
  "content": "ISLAMABAD, Jul 27 (APP):Prime Minister Muhammad Shehbaz Sharif said the government of Pakistan was making concerted efforts to contain the hepatitis epidemic and has launched the Prime Minister’s National Programme for the Elimination of Hepatitis C, which aimed to screen over 165 million people by 2030 and provide free treatment to all positive cases.\nIn a message on the occasion of World Hepatitis Day, he said, “This is a national movement that is a testament to our collective commitment to saving lives and securing the future. To make this vision a reality, we call on different segments of society to contribute to the efforts to end this scourge.”\nHe said, “On this World Hepatitis Day, we join the international community in reaffirming our commitment to eliminate hepatitis and protect the health of our people.”\n“Pakistan is among the countries that are widely affected by the global hepatitis C epidemic. Viral hepatitis is one of the global public health challenges,” he remarked.\nHe said, “A large number of people infected with hepatitis B or C remain undiagnosed and untreated. While hepatitis poses a threat to all segments of society, certain segments of population remain at higher risk, including those receiving unsafe blood transfusions, patients undergoing unregulated medical procedures, newborns of infected mothers, healthcare workers, while the user of contaminated equipment or reused syringes, inadequate infection control, especially in rural and under-resourced areas, increase the risk.”\nThe prime minister said, “Raising awareness about hepatitis is essential not only to break the stigma surrounding the disease, but also to prevent new infections and ensure timely treatment for those affected. We must encourage people to get tested, seek medical advice, and not put off treatment due to fear or stigma.\nOur healthcare professionals, researchers, and frontline workers are working tirelessly, and they need the support of the entire community.”\n“Today, we reaffirm our collective responsibility to build a healthy, safe, and hepatitis-free Pakistan,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:11:14.310Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-making-concerted-effort-to-contain-hepatitis-epidemic-pm/",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T18:58:00.000Z"
}
