{
  "title": "Ahsan for medium-term framework to deregulate sugar industry",
  "author": null,
  "content": "ISLAMABAD, Jan 01 (APP):Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Wednesday directed developing a medium-term framework for deregulating sugar industry, stressing industries to ensure data uniformity, crop zoning and backward integration.\nHe passed these directives while chairing a meeting of Prime Minister’s Committee on Sugar stocking, forecasting and planning, notified in December last to develop a foolproof system of monitoring and report authentic position of sugar stocks for timely decisions on exports, a news release said.\nThe meeting was attended by Minister for Industries and Production Rana Tanveer Hussain, and Minister of State for Finance Ali Parvez Malik.\nBesides, Director General Land Information and Management System Rawalpindi, Chairman and Member (IR operations) FBR, Joint Director General Intelligence Bureau, Executive Director Sustainable Development Policy Institute, Deputy Director General Trade Pakistan Bureau of Statistics, Senior member Pakistan Sugar Mills Association, Director General Agriculture Policy Institute, Senior Joint Secretary Ministry of Industries and Production, Member Industries Ministry of Planning were present in the meeting.\nSenior member of Pakistan Sugar Mills Association briefed the minister that in the previous years, availability of acquiring accurate data had been a persistent problem for the association. He acknowledged the role of FBR as it worked with Sugar Mills Association last year for the first time to review data. He suggested taking data from one source to maintain accuracy.\nThe representative also said correct and uniformed figures were not reported as most of the sugar mills do not provide data on time. “Technically sugar prices should decrease after every successful export but by providing protection to consumers, the sugar mills have been paralyzed financially.”\nPakistan Sugar Mills Association also suggested fixing a date to review 12 months’ performance of mills.\nLauding government efforts to stop sugar smuggling, he said that the government had maintained an effective track and trace system to stop smuggling.\nAddressing the meeting, Planning Minister said that it was imperative for all institutes of government to maintain effective coordination.\nHe also advised the stakeholders to establish coordination with SUPARCO for satellite based data gathering.\nHighlighting the importance of data uniformity and accuracy, the minister said, “The problem of data variance should be solved as soon as possible by involving experts and researchers to ensure that data sets used by all institutes are unified.”\nAhsan Iqbal further gave directions to concerned ministries to prepare a medium term framework for development of agriculture industry. “The Planning ministry developed a cluster based agriculture report in under Vision 2025 in 2017-18 which was completed in 2020 with an aim to produce analytical insights for agriculture policy making and the sugar industry cluster was examined thoroughly.”\nQuoting the examples of competitive sugar mills across the world, he said that the world’s most productive mills have effective recovery rates but Pakistan’s sugar mills were inefficient in terms of recovery rates.\nThe minister said the three most important targets for the sugar industry should be recovering more sugar, producing surplus sugar and exporting surplus to other countries.\n“By making a medium term policy for government to deregularize the sugar industry, the next 10 years can be spent following the planned vision,” he said directing the meeting participants to form a committee for achieving the task.\nAs suggested by the minister, the committee would be chaired by chief statistical officer and must include representatives from Ministry of industries, FBR, Pakistan Sugar Mills association and SUPARCO.\nThe minister stressed, “Planning Ministry is dedicated to facilitate active forecasting and ensure strategic decision making to promote the development and deregularization of sugar industry.\nReferring to the weak link between production and productivity, he said Pakistan was the fifth largest sugar producer in the world but in terms of yield, its ranking was alarmingly low.\nThe minister also urged maximizing the agricultural portfolio of Pakistan through crop zoning. “Whether it is edible oil, wheat, cotton or sugar sector that needs to be made self-sufficient, crop zoning can help local governments to designate areas of land for farming and protect them from incompatible land usage.\nHe also said that backward integration could help the sugar industries achieve faster growth as evident from the success of FMCGs that followed backward integration.\n“A medium term master plan should cover at least 10 years and provide a vision regarding how much productivity is expected to gain from a specified area of land,” he added.\nThe minister asserted that the industries sector must get beyond production obsession and ensure backward integration, assuring the industrial stakeholders that their problems will be solved on priority.\nHe also affirmed government’s commitment to balance the need to support domestic sugar producers with ensuring adequate supply and stable prices for local consumers.\nThe PM’s Committee would be working under Terms of Reference (TORs) of analyzing all data sources related to sugar production, consumption and stocks; assessing causes of variation in different data sources and underlying assumptions; fixing responsibility for presenting inaccurate data for sugar consumption, stocks and surpluses during preceding year, leading to delayed decisions on permissible export quantum; developing and presenting a foolproof mechanism for maintaining credible data for evidence based public policy decision making; and suggesting a medium term framework for the sector with possible development of efficient market of the product, leading to positive outcomes for consumers, industry, economy and government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:14:54.568Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ahsan-for-medium-term-framework-to-deregulate-sugar-industry/",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T16:54:00.000Z"
}
