{
  "title": "Interior Ministry launches biometric B-Forms for Children over 10 to enhance security",
  "author": null,
  "content": "ISLAMABAD, Jan 01 (APP): The ministry of Interior, on directives of Interior Minister Mohsin Naqvi, has announced the introduction of a new B-Form equipped with advanced security features for children aged 10 and above.\nThis initiative aims to enhance identity verification and curb crimes such as identity theft, human trafficking, and illegal passport acquisition.\nThe new B-Form will now include mandatory fingerprint impressions and photographs of children in the specified age group.\nAccording to officials, the phased rollout of these enhanced B-Forms will commence on January 15, 2025.\nSpeaking on the development, Minister Mohsin Naqvi said, “These measures will prevent the misuse of children’s identity information and strengthen our national identification system. I commend NADRA and the Passport Department for their swift action in implementing these reforms.”\nIn the first phase, children between the ages of 10 and 18 will need to visit NADRA centers, accompanied by a parent or legal guardian, to provide their fingerprints and photographs.\nGuardians must also present their Computerized National Identity Card (CNIC) and the child’s computerized birth certificate issued by the Union Council or Town Committee.\nOnce the process is completed, NADRA will issue a new B-Form featuring the child’s photograph and biometric details. The updated document will be a prerequisite for obtaining a new passport for children in this age group.\nThe Ministry of Interior spokesperson confirmed that the old B-Form, which lacks biometric details, will no longer be accepted for children over 10 years old. Additionally, further reforms, such as integrating iris scans and enhancing services through the Pak-ID Mobile App, are planned for future phases.\nThis initiative is part of a broader effort to integrate NADRA’s systems with provincial civil registration databases and ensure the issuance of Digital IDs to all Pakistani citizens. “These steps will play a crucial role in securing the identity of our citizens and combating crimes effectively,” said the spokesperson.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:15:02.763Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-ministry-launches-biometric-b-forms-for-children-over-10-to-enhance-security/",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T10:00:00.000Z"
}
