{
  "article_id": "2025-05-06_bb1a493079b727e27eae2bfb63658927",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/retired-pak-military-veterans-stand-behind-armed-forces-in-any-aggression-from-india/",
    "retrieved_at": "2025-08-27T15:09:37.581Z"
  },
  "metadata": {
    "title": "Retired Pak military veterans stand behind armed forces in any aggression from India",
    "author": null,
    "date_published": "2025-05-06T14:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 945,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 06 (APP):A group of retired senior military officers from Pakistan's Armed Forces have voiced strong support for the Pakistan Army, pledging their readiness to return to the front lines in the event of any aggression from India. Addressing a press conference here on Tuesday, notable figures including Major General (Retd) Javed Aslam, Major General (Retd) Khalid Jaffery, Brigadier (Retd) Zareen Khan, Brigadier (Retd) Jamal, Air Vice Marshal (Retd) Faheem Arshad, and Major (Retd) Waseem expressed unwavering commitment to national defense. Addressing the gathering, Maj Gen (Retd) Javed Aslam stated, \"We are a force of two million retired servicemen who stand ready to defend our homeland. Our bodies may have aged, but our spirits remain youthful and our resolve stronger than ever.\" He added that Pakistan's territorial integrity would be safeguarded at all costs, warning that any act of aggression from India would receive a \"decisive and overwhelming\" response. Air Vice Marshal (Retd) Faheem Arshad highlighted the Pakistan Air Force's technological and human resource strengths, claiming that PAF had outperformed the Indian Air Force during the 2019 standoff and has only advanced further since. \"Our pilots are among the finest in the world,\" he said. \"The training they undergo and the spirit they carry set them apart. We do not rely on machines alone-it's the men behind the machines who make the difference.\" Speaking on Kashmir, Brigadier (Retd) Zareen Khan delivered an emotionally charged address, calling for the implementation of longstanding UN resolutions. \"We've waited over 70 years. If the UN continues to ignore us, we may be left with no choice but to act,\" he said. Claiming that over 100,000 trained ex-servicemen from Kashmir were ready to mobilize, he urged the government to recognize the urgency of the situation. Major General (Retd) Khalid Jaffery accused India of engaging in false flag operations and historical misinformation. He cited past incidents-including the Ganga hijacking, Sikh massacres during U.S. presidential visits, and the Pulwama attack-as examples of what he termed \"orchestrated narratives\" aimed at vilifying Pakistan. \"India's pattern of blame and denial is well documented,\" Jaffery said. \"Our troops have consistently earned respect in international competitions, and if given a target, we will achieve it without fail.\" Maj Gen Javed Aslam reinforced the message of readiness, stating that Pakistan's armed forces were conducting ongoing drills and were \"fully prepared\" for conflict. He cautioned India against underestimating Pakistan's capabilities, referencing the downing of Indian aircraft and the capture of Wing Commander Abhinandan in 2019. \"We may be outnumbered, but we're not outmatched,\" he said. \"If war is forced upon us, we are prepared to respond with full might.\" Waseem also emphasized that the desire for peace should not be mistaken for weakness. \"In Islam, war is a last resort. But if provoked, we will defend our nation with everything we have. Our soldiers are trained, motivated, and spiritually grounded.\" Brig (Retd) Jamal supported the veterans' statements and called on the international community to recognize India's provocations. \"Pakistan has always advocated for peace, but India's aggression and disinformation campaigns must be addressed. We challenge India to allow independent investigations if they have nothing to hide.\" Responding to questions about the Indian Air Force's Rafale jets, AVM (Retd) Faheem Arshad acknowledged their capabilities but argued that effective air combat requires more than hardware. \"Pakistan's command and control systems, along with real-time communication and electronic warfare expertise, give us a strategic edge. India's own lapses-like shooting down its own helicopter during Pulwama-reveal their weaknesses.\" To a question, Brigadier (Retd) Zareen Khan, reiterated that the Kashmir conflict lies at the heart of India-Pakistan tensions. \"Until Kashmir is resolved justly, peace in the region will remain elusive,\" he said. Major Waseem, while responding to questions, highlighted Pakistan's preparedness in the face of potential threats. He stated that India's acquisition of the S-400 missile defense system has triggered concerns, but emphasized that Pakistan possesses the HQ-9P system with China's support, which he claimed is superior in terms of range and performance. He added that this system is deployed to protect major cities like Islamabad, Lahore, and Karachi and has the capacity to intercept up to 100 missiles simultaneously. Major Waseem replying tona question rgued that India tends to escalate border tensions during times of internal political instability or upcoming elections to distract public attention. \"When their internal affairs are in crisis, they turn to aggression against Pakistan,\" he said, urging for a neutral international inquiry into such actions. Responding a question, Maj Gen Javed Aslam(Retd) aasserted that Pakistan's unity and resolve remain strong. He stressed that the Indian narrative is increasingly being challenged from within its own borders, with criticism arising even from Hindu citizens and members of the Indian Parliament. \"Even the Hindu community is raising their voice for minorities and questioning Modi's aggressive tactics,\" he noted, describing India's actions as a long-term strategic failure driven by extremist ideology. To another question, Air Vice Marshal Faheem(Retd) reinforced Pakistan Air Force's readiness, stating that combat air patrols are ongoing and surveillance is heightened. He warned that any act of aggression from the Indian side would be met with a \"firm and unforgettable response.\" Faheem also stressed the need for reclaiming Indian-occupied Kashmir, either through diplomacy, peaceful means, or-if necessary-force. The officials jointly emphasized the need for global solidarity against oppression and urged the international community, to take notice of the growing humanitarian concerns. They also highlighted the importance of media in modern warfare and thanked Pakistani outlets for their role in presenting the national narrative. At the end, they call for unity, with the veterans reaffirming that the Pakistani nation-its people, armed forces, and leadership-stands together in the face of threats and injustice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}