{
  "article_id": "2025-05-06_232dc15ff23eed6377a80f762032dae4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-qatar-discuss-regional-peace-bilateral-ties/",
    "retrieved_at": "2025-08-27T15:10:27.658Z"
  },
  "metadata": {
    "title": "Pakistan, Qatar discuss regional peace & bilateral ties",
    "author": null,
    "date_published": "2025-05-06T11:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 336,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 06 (APP):Interior Minister Mohsin Naqvi met with Qatar's Prime Minister Mohammed bin Abdulrahman Al Thani during his visit to Doha on Tuesday where the two leaders held important discussions on strengthening bilateral relations and addressing regional security concerns. During the meeting, both sides expressed commitment to enhancing cooperation between Pakistan and Qatar in various fields, including diplomacy, trade, and security. The leaders agreed that stronger ties between the two countries would benefit regional stability and development. A major part of the discussion focused on the recent tensions between Pakistan and India. Minister Mohsin Naqvi shared Pakistan's firm and principled stance on the situation, particularly in light of the recent Pahalgam incident in India. He rejected India's accusations against Pakistan and warned that such baseless claims pose serious threats to regional peace. \"India's unfounded allegations and aggressive actions could destabilize the entire region,\" said Naqvi. \"Pakistan has offered an impartial investigation into the Pahalgam incident, which reflects our commitment to truth and peace.\" He further added that the international community should be aware of who the real masterminds and beneficiaries of the incident are. He also expressed concern over India's attempts to use the incident to undermine the Indus Waters Treaty, which he described as Pakistan's \"lifeline.\" Naqvi reiterated Pakistan's desire for lasting peace in the region but made it clear that the country will not remain silent in the face of aggression. Qatar's Prime Minister Mohammed bin Abdulrahman Al Thani emphasized the importance of diplomatic efforts to reduce tensions. \"We support a policy of de-escalation in the region,\" he stated, expressing hope that diplomatic initiatives would help bring peace. The Qatari Prime Minister also conveyed his best wishes to Prime Minister Shehbaz Sharif and praised his efforts to steer Pakistan's economy in the right direction. Pakistan's Ambassador to Qatar, Muhammad Aamir, and senior officials from both countries were present at the meeting. This high-level engagement reflects the growing partnership between Pakistan and Qatar and their shared vision for peace and stability in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}