{
  "article_id": "2025-05-06_8ef1e77f4496f71fe3b9cda006868bd9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/seven-soldiers-embrace-martyrdom-in-mach-terrorists-attack/",
    "retrieved_at": "2025-08-27T15:09:21.377Z"
  },
  "metadata": {
    "title": "Seven soldiers embrace martyrdom in Mach terrorists attack",
    "author": null,
    "date_published": "2025-05-06T13:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 220,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, May 06 (APP): Seven brave sons of soil on Tuesday embraced martyrdoms when terrorists belonging to Indian proxy, so called 'Baloch Liberation Army' targeted their vehicle with an improvised explosive device in general area Mach, Kachhi District. Those who embraced Shahadat included Subedar Umar Farooq (age 42 years; resident of Karachi), Naik Asif Khan (age 28 years; resident of District Karak), Naik Mashkoor Ali (age 28 years; resident of District Orakzai), Sepoy Tariq Nawaz (age 26 years; resident of District Lakki Marwat), Sepoy Wajid Ahmed Faiz (age 28 years; resident of District Bagh), Sepoy Muhammad Asim (age 22 years; resident of District Karak) and Sepoy Muhammad Kashif Khan (age 28 years; resident of District Kohat), said an Inter Services Public Relations (ISPR) news release. \"Sanitization of the area is being carried out to eliminate any terrorist present in the area, and perpetrators of this henious and cowardly act will be brought to justice,\" it further said. Security forces of Pakistan, in step with the nation, remain determined to thwart attempts at sabotaging peace, stability and progress of Balochistan, and such sacrifices of brave soldiers further strengthen the resolve. \"Nefarious designs of India and its proxies operating on Pakistani soil will be defeated by the valiant security forces, LEAs and the brave nation of Pakistan, InshaAllah,\" the press release said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}