{
  "article_id": "2025-05-06_13dca094590972c6a12eafadebb17fc9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sapm-reaffirms-govts-commitment-to-boost-automotive-sector/",
    "retrieved_at": "2025-08-27T15:10:09.279Z"
  },
  "metadata": {
    "title": "SAPM reaffirms govt’s commitment to boost automotive sector",
    "author": null,
    "date_published": "2025-05-06T11:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 6 (APP):Special Assistant to Prime Minister on Industries and Production Haroon Akhtar Khan on Tuesday reaffirmed the government's commitment to support local manufacturers, emphasizing the importance of boosting the automotive sector. He said during a meeting with representatives from the Pakistan Automotive Manufacturers Association (PAMA) to discuss their issues including tariff rates, the upcoming budget, regulatory duties, and long-term policies, said a news release. The meeting was attended by key automotive manufacturers including Honda, Toyota, Suzuki, Kia, Hyundai, Yutong, and Sazgar. He further highlighted that the Prime Minister's vision focuses on providing incentives for the promotion of electric vehicles. Akhtar Khan assured the manufacturers that every possible step would be taken to promote the sector and ensure its growth. He also stressed that the Prime Minister's vision aims at long-term sustainability and development, ensuring that all the challenges faced by automotive manufacturers would eventually be addressed and resolved. Additionally, Haroon Akhtar Khan assured the automotive manufacturers that the government is fully aware of the difficulties they are facing and would continue to stand by them. He instructed the PAMA to collaborate with the Ministry of Industries and Production in preparing a proposal to address the sector's concerns and requirements.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}