{
  "article_id": "2025-05-06_fed7fefdf2fc17b81a1aa94664f4f148",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nlpd-holds-poetry-session-in-honour-of-poetess-saima-zaidi/",
    "retrieved_at": "2025-08-27T15:09:38.431Z"
  },
  "metadata": {
    "title": "NLPD holds poetry session in honour of poetess Saima Zaidi",
    "author": null,
    "date_published": "2025-05-06T14:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 319,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 06 (APP): National Language Promotion Department (NLPD) held a poetry session in honour of acclaimed poetess Saima Zaidi, here on Tuesday. Organized by the literary and cultural organization Dabistaan-e-Pothohar in collaboration with the NLPD, the event brought together both renowned and emerging poets from across the country in a vibrant poetic gathering. Presided over by the celebrated literary figure and poet Haleem Qureshi, the event welcomed esteemed guests Dr. Waheed Ahmad and Dr. Arshad Mahmood Nashad as chief guests. Saima Zaidi's sister, Naghma Subuhi, graced the event with her special appearance. The evening was skillfully moderated by Dabistaan-e-Pothohar's Secretary Farzand Ali Hashmi alongside Dr. Mehnaz Anjum. The poetry recital featured a rich tapestry of poetic voices, with participants receiving enthusiastic applause from an engaged audience. Saima Zaidi presented her latest poetic works, which resonated deeply with listeners and added a memorable touch to the evening. Professor Dr. Muhammad Saleem Mazhar, Director General of the NLPD, emphasized the importance of such events in preserving cultural heritage. \"Language and culture define our identity. These gatherings connect the younger generation to our traditions and are a source of pride for us,\" he noted. President of the session Haleem Qureshi remarked, \"These are not merely poetry events; they are essential for the continuity of language, culture, and intellectual traditions. They nurture creativity among the youth and play a significant role in promoting the national language.\" The chief guests lauded the event as a meaningful and purposeful literary engagement, highlighting its role in encouraging writers and poets while advancing the cause of the Urdu language. Among the poets who recited their work were Farzand Ali Hashmi, Dr. Mehnaz Anjum, Dr. Arshad Mahmood Nashad, Haleem Qureshi, Dr. Waheed Ahmad, Junaid Azhar, Naghma Subuhi, Farah Diba, Dr. Asad Munir, Haseeb Jamal, Sajid Qureshi, Dr. Munir Fayyaz, Shazia Akbar, Dr. Mazhar Abbas Rizvi, Momina Waheed, Iqbal Tariq, Ali Shuaar Bangash, and Fakhira Noreen, among others.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}