{
  "article_id": "2025-05-06_1eede7938527069f47c64fbbf593e0e3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-saudi-arabia-pledge-stronger-ties-to-combat-drug-trafficking/",
    "retrieved_at": "2025-08-27T15:08:49.736Z"
  },
  "metadata": {
    "title": "Pakistan, Saudi Arabia pledge stronger ties to combat drug trafficking",
    "author": null,
    "date_published": "2025-05-06T15:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 06 (APP):Pakistan and Saudi Arabia have agreed to strengthen bilateral cooperation in the fight against drug trafficking, reaffirming their shared commitment to eliminating the global narcotics threat. The understanding was reached during a high-level meeting between Pakistan's Minister of State for Interior, Talal Chaudhry, and the Director General of Saudi Arabia's Anti-Narcotics Authority, Major General Muhammad bin Saeed Al-Qarni, who visited Islamabad with a senior delegation. The Saudi delegation included Ambassador Nawaf bin Saeed Al-Maliki, Major General Turki bin Abdul Aziz, Brigadier Raji bin Muslim, Lieutenant Nawaf bin Muhammad Al-Hanki, Fawaz bin Khalid, and Colonel Saeed Muhammad. From the Pakistani side, Federal Interior Secretary Muhammad Khurram Agha, Additional Secretary for Interior, and senior officials of the Anti-Narcotics Force (ANF) attended the meeting. Speaking on the occasion, Talal Chaudhry emphasized that Pakistan maintains a strict zero-tolerance policy against drugs and continues to combat narcotics trafficking despite limited resources. He highlighted the achievements of the ANF, revealing that Pakistan seized drugs worth over $21 billion last year alone. \"Drug smuggling is a global challenge. Only through mutual cooperation between friendly nations can we defeat this menace,\" he stated. He also noted that over 40% of the world's drug production originates in Afghanistan, directly impacting Pakistan and the region. Chaudhry further clarified that Pakistan's crackdown on illegal residents is rooted in national security concerns related to drugs and terrorism. On the Saudi side, Major General Al-Qarni praised the brotherly and exemplary relationship between Saudi Arabia and Pakistan. He called for enhanced joint efforts to address the drug problem effectively and ensure regional stability. At the end of the meeting, Talal Chaudhry presented honorary shields to the Saudi delegation on behalf of Interior Minister Mohsin Naqvi and conveyed his best wishes. This high-level engagement marks another step forward in the growing partnership between Pakistan and Saudi Arabia in combating transnational threats.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}