{
  "title": "Government has presented historical, youth oriented budget: PM",
  "link": "https://www.app.com.pk/national/government-has-presented-historical-youth-oriented-budget-pm/",
  "date_published": "2023-06-13T07:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP):Prime Minister Shehbaz Sharif on Tuesday said the government had presented a historical budget 2023-24 specifically designed for youth to help start their entrepreneurship activities that would also create more jobs in the country.\nHe said that the confidence and the hope could be restored by eliminating disappointments and ensuring socio-economic development of the country.\n“By the will of Allah Almighty, the upcoming year will be the year of increased income generation of the people and the country,” he said in a statement issued by the Prime Minister Office.\nThis was the budget of economic stability and quick development in various sectors including industry, agriculture, information technology and energy, he said adding that the budget would also provide youth the opportunity to create jobs for others by starting their own entrepreneurship.\n“Youth are the country’s future and saving their future has always been my top priority,” he added.\nPM Shehbaz said with the help of initiatives announced by the government in the budget 2023-24, the youth would become the architects of Pakistan’s development by starting their own businesses in IT, industry and agriculture sectors.\nHe said the government was providing 100,000 laptops and small loans to the youth on concessional rates for their start ups.\nThe government, he said had also offered tax exemptions in the Budget 2023-24 for businesses in IT for encouragement of the youth.\nThe prime minister said the Rs 2000 billion Kissan Package would further expedite the country’s journey of agriculture development and prosperity.\nHe said the government would offer more facilities in the agriculture sector through the budget 2023-24 to ensure food security and to make the youth an important stakeholder in agriculture development of the country.\nHe said the farmers and the youth of the country would become prosperous by availing the agriculture and business loans offered by the government in the budget 2023-24.",
  "retrievedAt": "2025-08-11T08:42:04.571Z"
}
