{
  "title": "No need to panic amid Biparjoy’s intensification, authorities on alert: Sherry Rehman",
  "link": "https://www.app.com.pk/national/no-need-to-panic-amid-biparjoys-intensification-authorities-on-alert-sherry-rehman/",
  "date_published": "2023-06-13T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): The Tropical Cyclone Biparjoy was approaching the coastal areas of Sindh province whereas the federal and provincial departments along with the armed forces were on alert with necessary coordination to manage the natural hazard and save the masses.\nFederal Minister for Climate Change and Environmental Coordination Senator Sherry Rehman on Tuesday briefed the media here on Tropical Cyclone (TC) Biparjoy’s imminent impact on the coastline of the Sindh province and urged the masses to avoid panicking on the ground as federal and provincial authorities were ensuring proper measures to address the natural hazard and protect the masses.\nThe federal minister for climate change was flanked by Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik to provide a detailed synopsis of the ongoing tropical cyclone that emerged in the Arabian Ocean and aggravated after June 5.\nSenator Rehman said the TC Biparjoy was under monitoring for the past many days, and the information being shared through media had to be conveyed to the local masses in a responsible manner.\nShe underlined that these cyclones could unexpectedly change their course, therefore the situation demanded strict stocktaking and continuous monitoring to take adequate measures for coping with any emergent situation.\nThe Minister informed that the cyclone’s landfall had started at the coastline of Gujrat, India, and was heading towards Pakistan. The Makran Coastline would be impacted less but Sindh province was still under threat.\nShe pointed out that the NDMA Chairman had visited Sindh and held a detailed meeting with stakeholders, whereas all law enforcement agencies (LEAs) and departments were vigilant.\nThe coastal areas of Keti Bundar, Thatta, and Badin would definitely face cyclone landfall. The Space and Upper Atmosphere Research Commission (SUPARCO) and Pakistan Meteorological Department (PMD) offices were coordinating with 16 other met offices for data gathering and accurate modeling of the TC.\nShe added that the TC had attained the state of very severe cyclonic storm that was currently located near Latitude 20.7° N and Longitude 67.1° E, roughly 460 km south of Karachi and 450 km south of Thatta, and 565km southeast of Ormara.\nIt had a northward trajectory and it was expected to touchdown by the June 15th (Thursday) morning with high-risk areas of Thatta, Sujawal, Badin, Tharparkar, Mirpurkhas & Umerkot from June 13 – 17.\nHowever, dust, thunderstorm, and rain, with few heavy falls and gusty winds (60-80 km/h) were likely to prevail in the Districts of Karachi, Hyderabad, Tando Muhammad Khan, Tando Allayar, Shaheed Benazirabad, and Sanghar from June 14 – 16, she added.\nThe Minister highlighted that the Sindh province was the worst impacted due to the 2022 floods and was again going to embrace a very extreme cyclonic storm whereas advisories were sent to the relevant departments, and residents of sea view Karachi were asked to voluntarily evacuate along with strict direction to the fishermen to abstain from venturing in the open sea during the forecast time period.\nSenator Sherry Rehman mentioned that the heavy rains and strong winds might damage weak infrastructures like mud houses, solar panels, billboards, electric poles, etc. The masses particularly the elderly should circumvent close contact with fragile infrastructure like glass windows and billboards that could hurt them, she added.\nCommenting on population evacuation, she said the government was trying to evacuate the native populous from weak infrastructures in the high-risk and vulnerable areas.\nShe added that mandatory evacuation was made in the Keti Bunder area.\nKeeping in view the weather conditions and strong wind projections, the government would update the media and public on flight schedule on June 14 (Wednesday).\nAt present, she said the entire coastline was on high risk, as the TC could create 8-12 ft high waves on the shores and 150-200km/h speed windstorms.\n“We have done an early warning without creating panic among the people. As precaution is a must and provincial governments’ guidelines need to be implemented for the public good,” she added.\nThe Minister underlined that the vacations of all government officials and staff had been canceled and hospitals were placed on high alert. Some 25,000 evacuations have been done so far and more to be done further, she said.\nShe announced that the Ministry of Climate Change would request the Prime Minister to provide funds to the affected areas of Sindh.She noted that all departments were alert and were holding their coordination meeting after every three hours, whereas Chief Minister Sindh was also on a visit to vulnerable areas.\n“We will brief the Prime Minister on the cyclone situation and will also request him to provide full support to Sindh province. The funds for flood relief and cyclone disastrous impacts should be separately earmarked in this budget. The flood-impacted districts of Sindh have not received financial assistance yet and would request the federal government and NDMA to extend relief and assistance,” she said.\nSenator Rehman underlined that there were deep excavations done in some areas of Karachi and authorities concerned were directed to refill the giant pits to avoid any disaster.\nThe Minister shared the helpline numbers of control rooms established to assist cyclone-impacted masses including Control Room South Karachi 021-99205628, Korangi 021-99333926, Kemari 021-99333176, Malir 021-99249916, Badin 029-7920013 and Sujawal 029-8510833.\nWhile chipping in the news conference, Chairman National Disaster Management Authority NDMA Lieutenant General Inam Haider Malik informed the media that the cyclone outlook projected before them was created by their technical and satellite data resources generated by various institutions reporting climate, weather, and hurricane situations after consensus.\nHe added that the NDMA had issued early warnings and advisories to the concerned based on the PMD’s early warning of heatwaves that would trigger glacial lake outburst floods (GLOFs) in the north and oceanic storms or cyclones due to projected extreme heatwaves onset.\nThe NDMA, he said had kept a check on the TC Biparjoy that intensified after June 5th whereas its latest curve would be confirmed tomorrow (Wednesday) in the morning. Its direction was bending towards north and northeastward, he addedAccording to predictions, its intensity had increased and had been declared from a severe to a very severe cyclonic emergency, the NDMA chairman said.\n“The cyclone landfall onset to start at Keti Bunder and Indian Gujrat by June 15 afternoon and will impact south and southeastern parts of Sindh and adjoining areas.”\nHe informed that the Keti Bunder coastline and adjoining areas have been alerted whereas the security and law enforcement agencies, provincial departments, and volunteers have been engaged who had been shifting the population to safer places.\nHe added that the evacuated population would remain in the relief shelters till the situation normalizes as strong windstorms and rains would take place.\n“All volunteers and non-governmental organizations (NGOs) who have been working during post-2022 floods would also be engaged in the process as some 100,000 people would be evacuated which will be completed by early June 15th. Moreover, the government of Sindh and other developments are engaged with NDMA for relief activities,” he added.\nResponding to media queries, the federal minister said the Keti Bunder area had been evacuated, whereas the population of areas of Sujawal were partially shifted to the specific camps established at safer locations and would complete by today evening.\nShe informed that in Badin some 8 relief camps in public schools and technical institutions’ buildings were established including two relief camps in Badin, Keti Bunder has 3 in one UC and 7 in the other based in public schools.\nReplying to APP’s query, she said the National Council on Climate Change could not decide budgeting but the budget session was underway and the Climate Change Ministry could request the finance minister and the Prime Minister to provide funding to Sindh and Balochistan.\nShe added that the Asia Pacific Center in Bangkok and 17 centers including NASA were providing data on weather providing models to Pakistan and there was no need for any coordination in such domain with India.\nThe Chairman NDMA added that initially, the Authority was focusing on the provision of shelter and ration to the affected people whereas proper data on the evacuated population was being maintained.",
  "retrievedAt": "2025-08-11T08:42:14.479Z"
}
