{
  "title": "BIPARJOY poses no major risk to power infrastructure, measures ready for unimpeded power supply: Dastgir",
  "link": "https://www.app.com.pk/national/biparjoy-poses-no-major-risk-to-power-infrastructure-measures-ready-for-unimpeded-power-supply-dastgir/",
  "date_published": "2023-06-13T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): Federal Minister for Power, Khurram Dastgir on Tuesday stated that there was no major risk to power infrastructure in the Sindh province due to tropical Cyclone BIPARJOY and all relevant measures were in place to ensure unimpeded power supply.\nIn a joint media briefing, the Federal Minister for Power was flanked by Federal Minister for Climate Change and Environmental Coordination Senator Sherry Rehman and Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik provided a detailed account of decisions taken in a high level meeting with Prime Minister Shehbaz Sharif on intensifying Tropical Cyclone BIPARJOY.\nKhurram Dastgir said liquified natural gas (LNG) shipments were not coming to Pakistan due to the severe cyclone as shipment schedules had been changed.\n“Our power infrastructure at 1000km away from the cyclone have been impacted. We have decided that the gas supply has been diverted to power stations to continue energy production. Expected impacts like strong winds can impact our wind turbines in Chimb as the wind gusts beyond 90km/h can have effects on its functioning,” he added.\nHe added that the other critical area to be impacted was transmission lines at the local level and also major transmission lines due to cyclonic winds.\nMoreover, the increased power infrastructure was also vulnerable like in South Thar 2,000 MW of energy has been installed, he said.\n“We are prepared to manage that power outage.The Prime Minister and Water Resources Minister have allowed increasing power production from Tarbela,” he informed.\nKhurram Dastgir said in order to make up for the power shortage 48-96 hours oil production would be introduced for power generation.He added that the Power Division would ensure energy generation and no offset would be faced in it whereas no further add up to occur in the existing power outage.\nThe vulnerable power infrastructure area was lying mainly in Hyderabad Electric Power Supply Company which were on alert. “We have restored power infrastructure in the floods in record time and will ensure the same during the cyclone,” he vowed.\nSenator Sherry Rehman said the media briefing purpose was to update on the meeting with the prime minister.\nShe said all preventive measures were taken and relocation to continue all night from coastal areas.“We are not taking any risk and exposing anyone to this situation whereas no medical emergencies reported yet,” she added.\nHowever, Thatta and Badin were mostly selected for relocation whereas basic amenities like drinking water would be ensured as per the Prime Minister’s direction whereas Power Minister would be sent to Sindh to manage power outages.She added that cyclonic winds had started and 24/7 monitoring was underway and would continue till June 18th.\n“Shipping schedules have already been impacted whereas small crafts and fishermen were not taking advisories seriously. The small craft fishermen will have to return from open sea for their safety,” the Minister said.\nShe reiterated that there was no need to panic as government has taken in time action and issued timely alerts to the relevant departments.\n“Evacuations help in saving lives and we will do it forcibly as it has been done in Keti Bunder. However, Karachites must not panic and take individual precautionary measures,” she added.\nNDMA and other departments would continuously ensure social media feed news update on cyclone situation, she said.\nThe Minister informed that the Petroleum Minister was also directed to ensure smooth fuel supplies to the vulnerable areas whereas the government would have to manage schools and traffic during the course of time.\n“Almost 110 mm rainfall is predicted in Karachi whereas Thatta and Badin to have 330mm rain forecasted,” she noted.\nShe underlined that population evacuations had to be made whereas seaview areas population needed to be relocated but no mass evacuation was suggested for Karachi.\n“BIPARJOY took curve from Balochistan towards Sindh whereas Winder, Lasbela and other districts have been directed to remain alert. However, we will ensure relocation after offset of BIPARJOY,” she added.\nThe Minister for Climate Change announced that the Sindh and federal governments would ensure compensation to the masses losing their homes due to the cyclone.\nChairman NDMA Lieutenant General Inam Haider Malik briefed that after two coordination meetings the latest developments on tropical cyclone were shared with the media.\nThe current status of BIPARJOY was less than 400 km away from the country’s coastline and it’s direction was bending towards north and northeastward.\n“Keti Bunder and Indian Gujarat to embrace it’s landfall whereas dusty gusts and strong winds in Sunawal and Thatta are causing disruption on mobility,” he said.\nA National Emergency Committee has been created by the Prime Minister comprising of Ministry of Climate Change and Environmental Coordination, NDMA and other partners.“All are working together on one thing to protect the masses as much as possible. Moreover, the Military, Five Corps, PMSA etc., were cooperating under a joint information management system,” he said.\nThe NDMA Chairman informed that relocation to safer places was underway and further preventive measures like rescheduling of flight operations and protection of maritime assets would also be taken keeping in view the cyclone stage.\nSindh and other areas were on high alert whereas stock taking of equipment for early relief and rescue was done, he added.\n“We will ensure no shortage of required equipment. We have briefed INGOs and volunteers on the situation. However, the relocation camps have been equiped with all required necessities,” he informed.\nPakistan Army, Rangers and ditrict administration were working together to ensure evacuations and relocation whereas Keti Bunder was completely vacated and District Sujawal’s 90% relocation was made, he informed.\nHe added that some 50,000 more people would be evacuated to Thatta and Badin whereas there would be the need of medical and ration provisions in the first quarter.\nMoreover, he said Information was being updated after every two hours at all media mediums. International institution’s feedback would also be taken into account on the tropical cyclone situation.\nThe Chairman NDMA added that the cyclone’s intensity would shift with decline in airflows whereas speed and intensity dissipation would take place after the penetration of the cyclone into the system of coastal areas.\n“We are predicting over a 60,000 individuals relocation in Sindh who may stay in relocation camps for two weeks,” he ended.",
  "retrievedAt": "2025-08-11T08:42:06.675Z"
}
