{
  "title": "President directs DC Islamabad to restore possession of elderly woman’s plot",
  "link": "https://www.app.com.pk/national/president-directs-dc-islamabad-to-restore-possession-of-elderly-womans-plot/",
  "date_published": "2023-06-13T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): President Dr Arif Alvi has directed the deputy commissioner (DC) Islamabad to restore the possession of 10-marla property to an elderly lady, whose property had been allegedly occupied by land grabbers in Bara Kahu area.\nThe president upheld the orders of the Federal Ombudsman for Protection Against Harassment of Women at Workplace (FOSPAH) and gave these directions while deciding upon a representation filed by Malik Abdul Majeed and others against the orders of FOSPAH, President Secretariat Press Wing said in a press release on Tuesday.\nAs per details, Munawar Bibi (complainant) had filed a complaint before FOSPAH under the Enforcement of Women’s Property Rights Act, 2020 saying that Malik Abdul Majeed and Jawad Shoukat (petitioners) belonged to a “qabza mafia” and had illegally taken possession of her plot by erecting boundary wall around it. FOSPAH passed the orders in her favour and directed DC Islamabad to restore possession of the complainant.\nThe petitioners preferred a review petition which was rejected on the ground that it had been proved that Munawar Bibi was the owner of the property and it was transferred in her name through the registered sale deed in 1979 and its entry had also been made in the revenue records.\nFOSPAH had directed the SHO of Bara Kahu police station to take steps to restore possession, take assistance from Patwari Halqa on the spot, and use all legal means in connection with the restoration of the plot to the complainant.\nThe petitioners, then, filed a representation before the president claiming that they were the owners of the plot and the land of the complainant was entirely different from theirs, but FOSPAH had failed to appreciate this fact.\nThe president rejected the representation of the petitioners on the ground that representation had been filed after a delay of one month and twenty-five days when it should have been filed within 30 days of the receipt of the order.\nHe observed that since the petitioners had not averred anything about the date of the receipt of the orders, thus, the representation was hit by the bar of the limitation.\n“Needless to observe that in case, any issue of proper identification of property arises, the same may be addressed in the implementation process”, he said.\nHe concluded that the representation was not only time-barred but also devoid of merits and directed to implement the orders of FOSPAH.",
  "retrievedAt": "2025-08-11T08:42:13.469Z"
}
