{
  "title": "Special steps afoot to uplift merged tribal areas of KP: PM",
  "link": "https://www.app.com.pk/national/special-steps-afoot-to-uplift-merged-tribal-areas-of-kp-pm/",
  "date_published": "2023-06-13T11:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that special measures had been included in the fiscal budget 2023-24 for the uplift of merged tribal areas of Khyber Pakhtunkhwa.\nExpressing his resolve to transform Khyber Pakhtunkhwa as cradle of peace, the prime minister regretted that the previous had altogether neglected the development and progress of the province.\nThe prime minister expressed these views during a meeting with a delegation of Pakistan Muslim League -N leadership from the province, PM Office Media Wing said in a press release.\nDuring the meeting, the political situation of the country was discussed. They also deliberated over the upcoming general elections in Khyber Pakhtunkhwa.\nDuring the meeting, Minister for Parliamentary Affairs Murtaza Javaid Abbasi, PM’s Adviser Engineer Amir Muqam, Senator Pir Sabir Shah, members of the National Assembly captain (retd) Muhammad Safdar, Sajjad Ahmed and former MNAs Shahabuddin, Jamshaid Khan and Aurangzaib Nalotha were present.\nThe prime minister assured that the federal government would ensure that the residents of KP should fully avail of its health and educational projects.\nHe further said that talented youth of the province would be provided with laptops and loans on affordable terms, adding the farmers would be given quality seed and timely supply of urea, besides equipping them with the latest technology.\nHe observed that economic issues of the people would be reduced with the provision of trade facility in the border areas.\nThe delegation appreciated the prime minister for inclusion of steps in the fiscal budget for the development and prosperity of province and its erstwhile tribal areas.",
  "retrievedAt": "2025-08-11T08:42:15.744Z"
}
