{
  "title": "WHO mobilizes partners for Tropical Cyclone Biparjoy’s response plan",
  "link": "https://www.app.com.pk/national/who-mobilizes-partners-for-tropical-cyclone-biparjoys-response-plan/",
  "date_published": "2023-06-13T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): World Health Organization (WHO) has mobilized health sector partners for initiating a preparedness and response plan for Tropical Cyclone Biparjoy.\nAccording to WHO, currently, Pakistan is facing the threat of Tropical Cyclone Biparjoy, and due to the threat people living along the coastal areas in Sindh, especially are being evacuated to safer places.\nThe Government of Pakistan, being fully cognizant of the looming threat of the cyclone has taken appropriate safety measures for protecting the precious human lives whose lives and livestocks are under the threat of cyclone.\nIn this regard, WHO Representative in Pakistan, Dr Palitha Mahipala chaired an Incident Management Support Team (IMST) and health sector partners meeting on Tuesday in the wake of severe cyclone Biparjoy and issued immediate directives for preparations for Tropical Cyclone Biparjoy emergency preparedness and response measures.\nWHO along with Health Sector Partners is also coordinating with federal and provincial health ministries for monitoring and developing a preparedness and response plan according to the evolving situation of the cyclone.\nIn view of this, WHO has prepositioned essential emergency medicines in Sindh to provide emergency assistance to vulnerable communities. This emergency stock includes Oral Rehydration Salts (ORS), Aqua Tabs and essential medicines.\n“We are closely monitoring the cyclone situation and remain on alert during the forecast period to extend every possible support to the Government of Pakistan,” remarked WHO Representative in Pakistan, Dr. Palitha Mahipala.\nWHO has convened Health Sector Partner Coordination meeting for joint preparedness and response plan to the cyclone. UNICEF, UNFPA, Save the Children, ICRC participated and reiterated their support for rapid response.\nIt is pertinent to mention here that WHO is coordinating the health response under the Government of Pakistan’s leadership. The Technical working group has been formulated to oversight the cyclone emergency preparedness plan and mechanism for the response.\n“We are focusing and preparing for the health needs of affected communities in the wake of an emergency. Our priority is to ensure their needs are met and there is no disruption in the provision of essential health services including emergency and trauma care,” WHO Representative in Pakistan, Dr Palitha Mahipala said.\nSimultaneously, the WHO has also activated Strategic Health Operation Centre (SHOC Room) in its Country Office to coordinate the health response to the cyclone and extend full support to scale up provincial capacities and mobilize human and financial resources.\nAll the partners ensured to have their representatives at the SHOC room for the timely, well-coordinated, and collective response efforts.\nWHO is leading the coordination for Health Sector Partners and is conducting daily follow-up meetings.",
  "retrievedAt": "2025-08-11T08:42:07.838Z"
}
