{
  "title": "Former PM Gillani calls for unity, economic reforms amidst challenges",
  "link": "https://www.app.com.pk/national/former-pm-gillani-calls-for-unity-economic-reforms-amidst-challenges/",
  "date_published": "2023-06-13T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): Former Prime Minister, Senator, Syed Yousuf Raza Gillani on Tuesday urged both the treasury and opposition benches to unite during difficult times in order to tackle the prevailing economic crisis faced by the country.\nDuring his speech on the budget for the fiscal year 2023-24 in Senate, he emphasized the crucial need for a “Charter of Economy,” underscoring its significance in the current hour of trials and tribulations.\nHe highlighted the adverse financial conditions inherited by the coalition government of the Pakistan Democratic Movement (PDM) due to the poor economic policies of the previous administration.\nSenator Gillani pointed out that, in an attempt to gain public sympathy, the leadership of the Pakistan Tehreek-e-Insaf (PTI) violated the terms and conditions set by the International Monetary Fund before facing a “no trust motion.”\nHowever, despite the declining political popularity of the PDM, they approached the situation with a positive and non-partisan attitude, prioritizing the national interest and striving to steer the country out of the economic crisis.\nSince assuming power, the PDM government had been making comprehensive efforts to restore progress and prosperity to the nation.\nSenator Gillani attributed the rising inflation to the impact of the COVID-19 pandemic and the Ukraine war, which had disrupted business activities not only in Pakistan but across the globe.\nCommending the government for allocating significant funds for the development of regional areas, Senator Gillani proposed that Balochistan, Sindh, and South Punjab be given priority in the allocation process, considering their recent challenges due to flash floods and intermittent rains.\nHe stressed the importance of timely distribution of financial resources from the central government to the provinces, enabling them to address their financial issues and provide relief to the people during critical times.\nSenator Gillani also praised the government for increasing pay and pension of government employees and highlighted the positive impact of the Benazir Income Support Programme, emphasizing that it aimed to assist those in financial need rather than create dependency.\nExpressing concern over the previous government’s handling of the China-Pakistan Economic Corridor (CPEC) projects, he urged the current administration to revive and complete all abandoned projects, including the establishment of an industrial zone and the completion of the cadet college in Multan.\nHe emphasized the need to strengthen fraternal ties with China and enhance economic cooperation with Islamic countries, particularly Saudi Arabia and the United Arab Emirates.\nAdditionally, Senator Gillani commended the Turkmenistan-Afghanistan-Pakistan-India (TAPI) Gas Pipeline project, stating that it would partially alleviate the country’s energy woes.\nHe called upon the government to execute the programme more effectively and efficiently to maximize its benefits.\nAddressing the issue of the rising exchange rate of the dollar, Senator Gillani proposed exploring barter trade as a solution.\nHe also acknowledged the unanimous resolutions passed by both the National Assembly and Senate, paying tribute to national heroes who sacrificed their lives in the line of duty.\nHe reassured the nation that defense of the country’s assets and heritage remained secure and that no one would be allowed to cause harm.\nFormer Prime Minister Gillani’s address emphasized the importance of unity, economic reforms, and international cooperation in overcoming the prevailing economic challenges faced by Pakistan.",
  "retrievedAt": "2025-08-11T08:42:11.043Z"
}
