{
  "title": "NDMA directs provincial authorities to ensure additional measures to manage TC Biparjoy",
  "link": "https://www.app.com.pk/national/ndma-directs-provincial-authorities-to-ensure-additional-measures-to-manage-tc-biparjoy/",
  "date_published": "2023-06-13T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): The National Disaster Management Authority (NDMA) has directed the provincial and district disaster management authorities (PDMAs and DDMAs respectively) along with the law enforcement agencies to ensure additional measures for amicably managing the impacts of Tropical Cyclone (TC) Biparjoy.\nThe NDMA, in its recent advisory, outlined the measures for PDMAs and DDMAs including ensuring vigilant monitoring of the tropical cyclone’s development and proactive coordination through respective emergency operation centres.\nIt also instructed to ensure the functionality of early warning systems and ensure prompt dissemination of timely and accurate information to at-risk communities, utilize multiple communication channels, such as television, radio, social media and SMS alerts, conduct extensive and continuous awareness campaigns to effectively reach coastal communities, educate the public on the potential impacts of the cyclone, emergency evacuation procedures and safety measures.\nThe respective PDMA’s/DDMA’s, Rescue Agencies (Rescue 1122, Civil Defence, Fire Departments, Paramedics), and relevant departments may identify high-risk/low-lying areas prone to storm surges, coastal flooding, urban flooding, high-speed winds and develop/enact evacuation plans accordingly. It should coordinate with relevant district and municipal administrations to ensure preparedness measures for thunderstorms/flash flooding, highspeed winds, and storm surges and secure or remove billboards and hoardings.\nThe provincial authorities were also directed to ensure immediate stocking of basic commodities, including medicines, especially in regions that are likely to get cut off during severe weather events, and collaborate with relevant authorities, including law enforcement agencies and transportation departments, to facilitate the safe evacuation of people from vulnerable coastal areas/low-lying areas.\nThe PDMAs should advise individuals residing in unsecured mud (“kacha”) houses and low-lying areas to seek shelter in sturdier and more secure buildings, on higher ground for personal safety.\nK-Electric should ensure safety measures are in place to prevent electrical hazards during the cyclone and ensure rapid restoration of services in case of disruption and take all necessary measures to address inundation issues in Karachi, Hyderabad, Bhanbore Divisions and surrounding regions, caused by heavy rainfall, coastal floods and storm surges.\nThe relevant district administrations should be advised to take precautionary measures in low-lying areas against the effects of storm surge activity.\nThe National Emergencies Operation Centre (NEOC) at NDMA has been made functional round the clock for TC Biparjoy monitoring and coordination, whereas all concerned should timely and proactively update NDMA and other stakeholders on the cyclone’s progress, potential impacts, and response measures.\nThe Rescue 1122 and law enforcement agencies, Fisheries Department, Port Authorities, Health Department and Hospitals, National Highway Authority (NHA) and Provincial Highway Authority, Electric DISCO (distribution companies) and Pakistan Electronic Media Regulatory Authority (PEMRA), Pakistan Telecommunications Authority (PTA) and Armed Forces (Army, Navy, Air Force, Maritime Security, Coast Guards) were also directed to ensure elaborate measures for better disaster preparedness and management measures.\nThe PDMAs Punjab and Khyber Pakhtunkhwa were also instructed to ensure readiness to provide necessary support and assistance including rescue, relief and medical to disaster-affected areas of Balochistan and Sindh as required.",
  "retrievedAt": "2025-08-11T08:42:03.000Z"
}
