{
  "title": "FDE organises inaugural ceremony of 2-week training for newly appointed teachers",
  "link": "https://www.app.com.pk/national/nations-future-depends-on-teachers-performance-rana-tanveer/",
  "date_published": "2023-06-13T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): A two-week Induction training for the newly appointed teachers has been organized by the Federal Directorate of Education at Federal College of Education H-9 Islamabad under the umbrella of the Ministry of Federal Education and Professional Training.\nThe Federal Minister for Education Mr. Rana Tanveer Hussain graced the inaugural ceremony as Chief Guest.\nThe Director General Federal Directorate of Education Dr. Ikram Malik, Deputy Director General FDE Ali Ahmad Kharal and Faculty of FCE participated in this prestigious occasion.\nDr. Ikram Malik congratulated the newly teachers on their appointment in FDE schools and colleges.\nOn the occasion, D.G FDE said that fair and transparent procedure was implemented\nduring the whole process of their selection.\nHe stressed upon improving their practice, learn their job responsibilities which would ultimately positively affect students learning. Dr Ikram\nMalik also threw light on the rational, objectives and methodology of the training.\nHe said that extensive training has been planned for 1000 teachers would continue upto August 2023. He also emphasized on punctuality, dedication and above all honesty with the job.\nThe Federal Minister for Education M.r Rana Tanveer Hussain also congratulated the new teachers on their\nAddressing the teachers, he said that they were fortunate enough to have the opportunity of attending this Professional Development Training.\nHe assured D.G, FDE of full support to improve the quality of education. He advised the teachers to equip themselves with modern techniques, strategies and methodology in the larger interest of the country.\nThe Federal Minister expressed his keen interest to make the Federal College of Education a state of Art Teacher Training Centre. At the end, the Principal FCE Muhammad Ihsan ul haq thanked the chief guest on behalf of students and faculty members.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:42:35.060Z"
}
