{
  "title": "Int’l community urged to take cognizance of grave situation in IOJK",
  "link": "https://www.app.com.pk/national/intl-community-urged-to-take-cognizance-of-grave-situation-in-iojk/",
  "date_published": "2020-06-26T05:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):Federal Secretary Information and Broadcasting Akbar Hussain Durrani Friday said the international community should realize the gravity of situation in the Indian Occupied Jammu and Kashmir (IOJK) and take immediate steps to pressurize India to stop gross human rights violations in the territory.\nAkbar Durrani, in his opening remarks here at a seminar titled “Humans without Human Rights in Indian Occupied Jammu and Kashmir”, said the objective of this seminar was to highlight the gross human rights violation being committed by the Indian armed forces in the occupied territory.\nThe seminar was organized by the Ministry of Information and Broadcasting to mark the the ‘International Day in Support of Victims of Torture’.\nThe information secretary said the seminar was not only a manifestation of Pakistani nation’s commitment to the Kashmir cause but also a testimony for their unflinching support for the Kashmiri people’s struggle for their right to self-determination.\nPakistan was in fact seeking justice for the hapless Kashmiri victims of Indian aggression, he added.\nAkbar Durrani said during the current month, four international days, which were linked to the Kashmiris, were observed. The days were International Day of Innocent Children Victims of Aggression, International Day for the Elimination of Sexual Violence in Conflict, International Widows’ Day and the United Nations International Day in Support of Victims of Torture.\nHe asked the United Nations and international community to take notice of the genocide of innocent Kashmiris by the Indian occupation forces and take measures to stop it.\nHe said the situation in IOJK had aggravated since August last year when India unilaterally abolished two articles of its constitution depriving the Kashmiris of limited autonomy. Now the Kashmiris were living in an open prison following the lockdown imposed by India much before the spread of coronavirus.\nHe said the history of Jammu and Kashmir was unfortunately “a tale of lies and deceits” on the part of Indian rulers, who had utilized all means to continue their illegal occupation of the state.\nSouth Asian Strategic Stability Institute (SASSI) University Chairperson Dr Maria Sultan, in her speech, highlighted the current Kashmir situation and its implications on the Kashmiri people and the region.\nShe said by abrogating articles 370 and 35-A India had usurped all the rights of Kashmiri people. Even today extrajudicial killing of three innocent Kashmiris was committed by the trigger-happy Indian Army in the IOJK, she added\nShe said after the repeal of Article 35-A, some 25,000 non-Kashmiris had been given permanent residency rights to change the demography of Kashmir and deprive the locals of their identity. Under the guise of the lockdown, Maria Sultan said, the Indian forces had intensified their brutalities in the occupied territory. They continued using pellet guns and other ammunition on the innocent Kashmiris with impunity.\nShe said for the last one year the Modi government had incarcerated thousands of innocent Kashmiri youth to crush their freedom struggle but it could not subjugate them by such inhuman tactics.\nAmbassador Asif Durrani said Pakistan had fought three wars with India on Kashmir as all its outstanding disputes with India except Sir Creek, were related to the held valley. The Kashmiris were suffering from Indian atrocities for over seven decades, which had intensified with the Bharatiya Janata Party coming into power in New Delhi.\nThe fascist Indian government, he said, had used COVID-19 as a weapon to muzzle the Kashmiris’ voice for freedom.\nHe said the OIC Contact Group on Kashmir, which was established in 1994, had been holding its meetings regularly but apparently the Organization Islamic cooperation (OIC) had failed to take a strong stance on the Kashmir due to the economic and other interests of its member countries.\nFormer minister and legal expert Ahmer Bilal Sofi, in his address, said the government should open legal avenues on Kashmir and consult senior legal experts to contest the case of Kashmiris at various international legal forums",
  "retrievedAt": "2025-08-11T19:23:47.685Z"
}
