{
  "title": "World refuses to buy India’s false narrative due to Pak diplomatic offensive: Shibli",
  "link": "https://www.app.com.pk/national/pakistans-diplomatic-offensive-world-community-refuses-to-buy-indias-false-narrative-shibli-faraz/",
  "date_published": "2020-06-26T05:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):Minister for Information and Broadcasting Senator Shibli Faraz said on Friday that due to the diplomatic offensive of Pakistan Tehreek-e-Insaf government and exposure of Indian crimes in the Occupied Kashmir by the international media, the world community had refused to buy Indian narrative on the Kashmir issue.\nShibli was speaking at a seminar marking the “International Day in Support of Victims of Torture” organized by the Ministry of Information and Broadcasting here titled “Humans without Human Rights in Indian Occupied Jammu and Kashmir.”\nHe said that India was using state terrorism to muzzle the voice of the people of Kashmir, who were struggling for their internationally recognized and justified right to self-determination.\nHe said that the International Human Rights Commission had exposed Indian atrocities in its reports and the United Nations Security Council had met over Kashmir thrice after August 5 last year and reiterated that the Kashmir issue would be resolved under the UN Charter in light of its resolutions.\nShibli said that India had taken belligerent posture towards Pakistan and committed countless violations of ceasefire at the Line of Control to divert the world’s attention from the gross human rights abuses being committed by its forces in the Indian Occupied Jammu and Kashmir.\nHe said that on February 26 last year it committed naked and unprovoked aggression against Pakistan in Balakot and the next day its two planes were downed by the Pakistan Air Force and one of the pilots Abhinandan was arrested.\nEven in such a charged atmosphere, Pakistan showed great restraint and once again proved its credentials as a peace loving state but India was still not willing to abandon its aggressive posture.\nHe said that Prime Minister Imran Khan had already warned the world about the repercussions of the coming to power of a hard-line party having RSS (Rashtriya Swayamsevak Sangh) mindset and following the Hindutva ideology.\nThe minister said that the United Nations and the world community should realize that the Kashmir dispute could become a flashpoint and destabilise the entire region. He said that Islamabad was always ready to resolve all its outstanding disputes, including Kashmir, with New Delhi through peaceful means of dialogue in light of the United Nations resolutions.\nHe expressed the resolve that Pakistan would continue moral, diplomatic and political support for the Kashmir cause till realization of the goal of freedom.\nHe said that at a time when the international community was focusing on fighting the coronavirus, the sinister Indian government was taking advantage of the situation to crush the Kashmiris with full might.\nHe said that the Indian occupation Forces enjoying immunity under Kashmir specific Armed Forced Special Powers Act, had been involved in the genocide of Kashmiri people for the past four decades and almost 100,000 innocent Kashmiris had been martyred, out of which over 7,000 were\nkilled during custody.\nShibli said since 1990 over 160,000 civilians had been arrested and over 110,000 buildings, including houses and shops, were either arsoned or destroyed. He said that due to Indian armed forced crimes against humanity almost 10,000 Kashmiri women were widowed and over 107,000 children orphaned.\nSince August last year,the minister said, when hard-line Indian government unilaterally repealed the Article 370 and 35-A, Kashmiris had been facing Indian lockdown without medicines and edibles, and after the outbreak of coronavirus their situation was miserable.\nAppreciating the role of Mishal Malik, the wife of imprisoned Kashmiri leader Yaseen Malik, he said that she was a role model for the Kashmiri youth due to her struggle. He also lauded the role of All Parties Hurriyat Conference leadership, who had suffered great hardships, including arrests and torture but they did not budge from the stance of right to self-determination.\nHe also appreciated the role of Azad Jammu and Kashmir President Sardar Masood Khan in highlighting the Kashmir issue at all forums in his present capacity as well as a former senior diplomat.",
  "retrievedAt": "2025-08-11T19:23:45.579Z"
}
