{
  "title": "Rs. 378 bln to spend to provide low cost homes under NAPHDA: Shahbaz Gill",
  "link": "https://www.app.com.pk/national/rs-378-to-spend-to-provide-low-cost-homes-under-naphda-shahbaz-gill/",
  "date_published": "2021-02-25T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP):Special Assistant to Prime Minister on Political Communication Dr. Shahbaz Gill Thursday said a total of Rs.378 billion is being spent to provide low cost homes to middle class homeless people under Naya Pakistan Housing Development Authority (NAPHDA) during the current financial year.\nAddressing a press conference, he said the government has recently released Rs.4 billion to finance 8,000 low cost houses.\nThe NAPHDA has been constructed and handed over 7,485 houses to low income people in the country, he added.\nHe said the government has approved the mortgage banking laws, besides changing tax regime for the housing sector.\nSince the approval of mortgage law, the bank has started issuing loans for construction of houses and those who are refusing to give housing loans would be made accountable.\nShahbaz Gill said the government has also provided enabling environment to help in the construction of homes as the country has been facing around 15 million shortages of houses.\nWith the construction of five million houses, the 80 percent shortage of houses would be restrained in the country.\nHe said the bank would be providing 80 percent loan with five to seven percent interest rate on the actual price of home and the remaining 20 percent would be borne by the house owner.\nThe incentives offered by the government to housing sector would help to achieve the target of constructing five million houses, he said.\nHe said that on the construction of the first 100,000 houses, the government would pay Rs 300,000 per house subsidy to the low income owners. The banks would give loans to Rs 3.5 million in easy installment of Rs 14,000 per month.\nThe Prime Minister has approved digitalization of land record and to abolish Patwari system in Islamabad Capital Territory (ICT) to bring transparency, he said.\nThe record of housing societies in ICT would be uploaded on the website of Capital Development Authority (CDA) for getting online information and checking their NOCs status, he added.\nGill said Prime Minister has approved some 403 commercial projects in the short span of last 40 days whereas the approval of others 78 was in progress.\nHe added that the federal government would approve some 11 new commercial projects the next week. While sharing the progress of Punjab government, the PM’s aide said that the PTI led provincial government has approved 700 projects in the period of last seven month.\nWhereas the Sindh government has approved only 19 projects in last four months as comparing to 250 applications submitted for approval.\nThe PM has given instructions for establishing of a High Power Commission in Punjab to investigate and point out the irregularities in the housing societies.\nThe commission would submit the recommendation to federal government in one year period.\nCommenting on the Prime Minister austerity drive, he said PM Imran Khan’s visit to Sri Lanka has cost only 34,800 dollars of the government whereas Nawaz Sharif had spent some 276,000 dollars during the visit of same country in 2016.",
  "retrievedAt": "2025-08-11T20:24:30.274Z"
}
