{
  "title": "Pakistan, India agree on strict observance of LoC ceasefire",
  "link": "https://www.app.com.pk/national/pak-india-dgsmo-discuss-mechanism-of-hotline-contact/",
  "date_published": "2021-02-25T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP): Pakistan and India on Wednesday agreed on strict observance of ceasefire along the Line of Control (LoC) and other sectors, with effect from Wednesday midnight.\nThe agreement took place as the Director-General of Military Operations (DGMOs) of Pakistan and India held discussions over the established mechanism of hotline contact, the Inter-Services Public Relations (ISPR) said in a statement.\n“In the interest of achieving mutually beneficial and sustainable peace along the borders, the two Directors General of Military Operations (DGMOs) agreed to address each other’s core issues and concerns which have the propensity to disturb the peace and lead to violence,” the ISPR statement read.\nThe two sides “reviewed the situation along LoC and all other sectors in a free, frank and cordial atmosphere”.\n“Both sides agreed for strict observance of all agreements, understandings and cease firing along the LOC and all other sectors, with effect from midnight 24/25 February 21,” it said.\nThe ISPR said both sides reiterated that existing, mechanisms of hotline contact and border flag meetings would be utilized to resolve any unforeseen situation or misunderstanding.\nForeign Minister Shah Mahmood Qureshi termed the agreement “an important step” in reducing tensions in the region and a way forward towards peace.\nHe said Pakistan desired to maintain peaceful relations with all its neighbours including India.\nOf all the Confidence Building Measures (CBMs) between Pakistan and India, he said, the ceasefire agreement was the most significant.\nQureshi said the government highlighted the Indian violations at LoC on all international platforms and mentioned the letters written to United Nations Secretary-General several times.\nHe said that “India must demonstrate sincerity in implementation of the ceasefire agreement” for sustainable peace in the region.\n-Report by Shumaila Andleeb",
  "retrievedAt": "2025-08-11T20:24:35.898Z"
}
