{
  "title": "AJK President urges youth to complete Pakistan by liberating Kashmir:",
  "link": "https://www.app.com.pk/national/ajk-president-urges-youth-to-complete-pakistan-by-liberating-kashmir/",
  "date_published": "2021-02-25T11:57:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 25 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Thursday described Kashmir and Pakistan as inseparable and urged the youth to strive hard for the liberation of Kashmir to complete the state of Pakistan.\nHe made these remarks while addressing a Kashmir seminar organised by the School of Media Studies of Punjab University in Lahore, AJK President office said Thursday evening.\nThe event was also addressed by Vice-Chancellor Punjab University Prof Dr Niaz Ahmed, Pro Vice-Chancellor Prof Dr Muhammad Saleem Mazhar, journalist Dr Mujahid Ali Mansoori, while other faculty members and a large number of students participated.\n“The state of Pakistan is incomplete without the inclusion of the state of Jammu and Kashmir and without the participation of the people of Jammu and Kashmir. Referring to the situation of Indian Occupied Jammu and Kashmir, Sardar Masood said that India is committing serious war crimes in held Kashmir and was engaged in genocide of the Muslims. He said that the Indians are dishonouring the whole Muslim nation by molesting our sisters and daughters in IIOJK.\n“Every day young men of your age gun down, they are buried in unidentified locations and their parents run from pillar to post to get the locations of the dead bodies of their fallen sons,” Khan said and added that women in Kashmir are molested, objectified and fetish sized to collectively punish Kashmiris for their defiance to illegal Indian rule.\nWe must further mobilize the international community to garner support for the freedom of Kashmir.\nWe must develop a political ecosystem in Pakistan, he said. He maintained that the innocent Kashmiris are facing Indian brutalities with valour and they would never compromise over their right to self-determination.\nHe went on to say “we should not think that only occupied Kashmir is burning and we in Pakistan and Azad Kashmir are safe.\nThe fact of the matter is that as long as Kashmir is burning, no one is safe at all under any circumstances. Because leaders of India’s BJP and RSS have said that Kashmir is beginning and that they would occupy Azad Kashmir and snatch Baluchistan from Pakistan to create an “Akhand Bharat”, he concluded.",
  "retrievedAt": "2025-08-11T20:24:33.040Z"
}
