{
  "title": "Fake university degrees for sale in India",
  "link": "https://www.app.com.pk/global/india-sales-fake-degrees-gets-blow-internationally/",
  "date_published": "2021-02-25T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP): The Manav Bharti University, located in the Indian state of Himachal Pradesh, has sold around 36,000 fake degrees across 17 states over a period of 11 years, alarming the international job recruiters, who earlier believed these to be genuine.\nMany of the graduates of the said university are currently working in Canada, United Kingdom, United States of America and Singapore.\nThe scam is a blow to the Indian reputation worldwide and has further eroded the credibility of the Prime Minister Narendra Modi government. According to The Linkedin, a popular social media site of working professionals, the numbers of graduates of Manav Bharti University are working in several countries like Singapore, Canada, UK and USA”.\nThe university is run by the Manav Bharti Charitale Trust which also raises question about the status of other trust-run universities whether they are also involved in selling fake degrees.\nThe Time of India said in a report that out of a total 41,000 degrees issued by the said university, only 5,000 were found to be genuine so far.”\nThe Tehelka.com said, “The scale of the scam in Himachal Pradesh is shocking beyond words. Only 14 of the 55 hard disks seized from Solan’s Manav Bharti University have been scanned so far by a special investigation team.”\nThis scam raises serious questions about the authenticity of other Indian universities’ degrees too. There are many areas where Indians stood exposed badly i.e fake claims in domains of military, Human Rights, media, diplomacy, news and now education.\nIt was normally perceived that Indian education system is advanced and produces intellectual labor for the world, however, this scam has dented that perception. It also reflects a fault line which exposes weak internal mechanism and triggers element of non-authenticity.",
  "retrievedAt": "2025-08-11T20:24:32.987Z"
}
