{
  "title": "COVID-19 vaccination: Dr Nausheen calls for registration to people above 65",
  "link": "https://www.app.com.pk/national/covid-19-vaccination-dr-nausheen-calls-for-registration-to-people-above-65/",
  "date_published": "2021-02-25T06:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP):Parliamentary Secretary for National Health Services Dr Nausheen Hamid Thursday asked the people above the age of 65 to registered themselves for COVID-19 vaccination as inoculation process was going to start from March 2.\nTalking to a private news channel, she said over 100,00 people had immunized the COVID vaccine and majority of them were the healthcare workers.\nThe health parliamentary secretary said the government had not made it mandatory for the people to get vaccinated.\nThe Pakistan was on track to vaccinate 70 per cent of the population much before the targeted first quarter of 2021, she added.\nShe said once the COVID-19 immunization programme had been executed successfully, the positive impacts would be felt by all.\n“All citizens above the age of 65 can register for COVID-19 vaccine through short messaging service with computerized national identity card number on 1166 or visit nims.nadra.gov.pk,” she said adding, “Around 250 vaccination centers are made functional in the country.”\nShe further said the National Command and Operation Center (NCOC) the other day had completely lifted the coronavirus restrictions and allowed all commercial activities across the country to operate normally.\nShe said cinemas and shrines would also reopen with stringent COVID-19 safety precautions from March 15, adding the condition of 50 percent work from home had also been removed forthwith.\n“Wearing of mask, social distancing, and smart lock downs will further continue,” she added.\nShe said the NCOC had also given green signal to pack to a capacity crowd for the Pakistan Super League (PSL) VI play offs and final to be played at the Gaddafi Stadium Lahore besides allowing fifty percent presence during the ongoing pool matches.\nNow a full crowd for PSL with stringent COVID standard operating procedures could enjoy live action at the Gaddafi Stadium during playoff matches, she added.\nReplying to a query, she said baseless conspiracy theories about coronavirus vaccine had been spreading on social media for months but vaccine was fully safe and effective.\nAs part of the vaccination programme, health authorities were encouraging citizens and giving media awareness to ‘choose to vaccinate’ in order to beat the deadly pandemic, she highlighted.\nShe said with the arrival of further vaccine consignments in the country, overall COVID-19 situation was under control and it was quite encouraging that the cases were declining.",
  "retrievedAt": "2025-08-11T20:24:37.702Z"
}
