{
  "title": "PM Imran defeats Indian propaganda on Kashmir through proactive diplomacy: Firdous",
  "link": "https://www.app.com.pk/national/pm-imran-defeats-indian-propaganda-on-kashmir-through-proactive-diplomacy-firdous/",
  "date_published": "2020-02-05T01:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Wednesday said Prime Minister Imran Khan, being an ambassador of Kashmir cause, had defeated Indian propaganda on Kashmir through proactive diplomacy.\nSpeaking as chief guest at an event organized by literary organization “Qalam Qafla”, at Pakistan National Council of the Arts (PNCA), she said the prime minister had successfully exposed the ugly face of Indian government, led by fascist Narendra Modi, before the world.\nDr Firdous said Pakistan would continue to provide moral, political and diplomatic support to Kashmiris, but unfortunately the previous governments could not counter Indian propaganda effectively so as India succeeded to hoodwink the world in the past.\nIndia gave the impression that Kashmiris struggle was an act of terrorism, sponsored by Pakistan and revoked the article 370 on August 5, last year and stripped the special status of Indian occupied Jammu and Kashmir (IoJK) by manipulating the situation, she added.\nShe said the Kashmiris in IoJK had been rendering unprecedented sacrifices to keep their freedom struggle alive while Indian forces were committing the worst kind of human rights violations in the occupied valley.\nThe special assistant said the hearts of Kashmiris and Pakistan beat in unison and Pakistani nation felt the pain of Kashmiri brethren.\nShe said Kashmiri Muslims were denied all fundamental rights including freedom of speech, freedom of movement and religious freedom.\nMosques had been locked and Kashmiris were refused to perform their religious rites which had proved that India was no more a secular state, but following the Hindutva agenda of the Rashtriya Swayamsevak Sangh (RSS) to convert it into a Hindu Rashtar, she added.\nDr Firdous said Narendra Modi led government in India had turned Kashmir into a jail by deputing 900,000 army personnel in the valley and subjugated Kashmiris by infringing their fundamental rights enshrined in its own constitution.\nPeople in the IoJK were deprived of basic communication facilities like internet, radio and others as India had disrupted the communication network in the valley for the last six months, she added.\nShe said the government, civil societies, writers and journalists were playing their due role to pressurize the international community for fulfillment of their commitments with Kashmiris.\nThe special assistant said Pakistan army was fully capable to defeat its enemy and protect its borders. It was the Pakistan army which made every Pakistani proud of by giving befitting response to India after Pulwama attack, she added.\nShe said Pakistan was a responsible nuclear nation and had repeatedly exerted not to initiate war unless it was imposed. “Pakistan has capability to turn India into a graveyard.”\nDr Firdous said Kashmir was a flashpoint and could kindle a war between the two nuclear rivals – Pakistan and India – if the world did not take cognizant of it.\nThe war would not only destroy peace in the region but also had impact on the entire world, she alarmed.\nTerming Kashmir as Pakistan’s jugular vein, she said Pakistan and Kashmir were part and parcel of each other, adding the country would not left the Kashmiris alone in such bad situation.\n“Kashmir will become Pakistan soon,” she expressed the hope while highlighting Pakistan’s clear-cut stance over Kashmir issue.",
  "retrievedAt": "2025-08-11T18:44:57.859Z"
}
