{
  "title": "Masood asks British parliament to say ‘no” to genocide in IOJ&K",
  "link": "https://www.app.com.pk/national/masood-asks-british-parliament-to-say-no-to-genocide-in-iojk/",
  "date_published": "2020-02-04T23:08:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): eb 05 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Tuesday appealed to the British parliament to say ‘no’ to the BJP-RSS regime’s genocide in the Indian Occupied Jammu and Kashmir (IOJ&K).\n“Say no to genocide, to land grab, to warmongering and Hindutva,” he said while addressing a Kashmir conference in London on the eve of the Kashmir Solidarity Day.\nThe conference was attended by more than 40 members of British Parliament, as well as the representatives of the diaspora community, at the House of Commons. It was chaired by Paul Bristow, Conservative MP from Peterborough, an AJK Presidential Secretariat press release said here Wednesday.\nThe AJK president said the United Kingdom Parliament, which was the mother of all parliaments, should take up its responsibility post-elections and post-Brexit. “You helped us internationalize the Kashmiri issue following India’s illegal steps on August 5 last year. We need your help again.”\nSardar Masood appreciated the constructive role of the diaspora community, especially of the young, dynamic leader Faheem Kiyani, who had organised multiple successful rallies in the UK against Indian occupation and atrocities.\nSharing harrowing and horrendous details of Indian crimes against humanity in the IOJ&K, President Masood informed the audience that India was preparing the ground for “the recreation and re-enactment of Auschwitz on a much larger scale”, while the most powerful nations were busy appeasing a regime that openly preached and practiced fascism.\nAfter invading, besieging and bifurcating the held state, without the consent of the people, India was now preparing for the extermination of the Kashmiris and occupying their land by constructing illegal settlements and importing Hindu population from India, he added.\n“Hundreds have been killed, thousands of young boys have been abducted and put in concentration camps, women have been molested,” he said, adding the Black Cat commandos in their raids on the houses used pellet guns, automatic weapons, mortars, chemical weapons, grenades and rockets.\n“This is a war against unarmed Kashmiris. They (occupation forces) always use live ammunition.”\nThe president quoted former Indian finance minister P Chidambaram while commenting on budgetary allocation for the occupied territory: “Money is not a substitute for freedom.\nWhat the people of Jammu and Kashmir and Ladakh require is freedom. The people of Kashmir need restoration of their human rights. Only a free society, people breathing free air can enjoy the fruit of development and participate in the development process. If they think they can take away freedom and substitute with money, they are completely wrong.”\nGenocide in IOJ&K\nPresident Masood also presented the assessment of the US-based Genocide Watch which had warned that India’s Kashmir policy, after initial stages symbolisation, dehumanisation, deployment of 900,000 troops and polarisation, had moved to the 7th and 8th stages of persecution of Kashmiris on a massive scale and preparation for their extermination.\n“The next stages are extermination and denial. India is talking of a final solution, ‘bringing prosperity’ and ‘normal situation’ – this is denial.\n“It is now up the UN to stop this impending extermination of Kashmiris and warn India not to commit genocide,” he said.\nSardar Masood appealed to the UK Parliament to play its role to mobilise the UN Security Council to stop the genocide in the IOJ&K and stop India’s warmongering that was imperilling the security of the region and the world.\nHe urged the parliamentarians to issue a fresh report on the situation in the IOJ&K, post-August 5, 2019 under the banner of the All-Party Parliamentary Kashmir Group, hold a fresh debate on Kashmir, raise the human rights situation in Prime Minister’s Question Hours, send communications to the UN leadership, and censure India on its flagrant violation of the rights of Kashmiri women and children.\nPresident Masood called upon the ruling Conservative Party led by Prime Minister Boris Johnson to invoke human rights instruments in the context of IOJ&K while negotiating a trade deal with India.\n“In the meantime, the world should seriously think of starting a Boycott, Divestment and Sanctions movement against the BJP-RSS regime in India,” he said.\nHe said many powerful nations were hesitant to take sides because of the apprehension of a war that could lead to a nuclear exchange. “We have the same apprehension as India continues to whip up war hysteria, but in turn think of the cost of not doing anything at all. Will the world be saved by inaction?”\nThe AJK president said while the most compelling priority was stopping the genocide, diplomatic efforts should be set in motion to resolve the Jammu and Kashmir dispute, which was the root cause of the turbulence in the region.\n“Kashmiris, who are the key party to the dispute, must be put at the centre of the diplomatic process so that they can be given their fundamental right to self-determination”, he said adding that if the UN was loath to take action, Kashmiris would be pushed against the wall and they would have to take all measures to protect their lives, dignity, women, homes, neighbourhoods and their state.\nHe commended all the UK political parties – Conservative, Labour, Scottish National Party, and Liberal-Democrats – for supporting the Kashmiris and adopting a cross-party approach towards political and human rights dimensions of the Kashmir issue.\nLater, the AJK president also addressed another Kashmir Conference in the British Parliament convened by Raja Najabat, Chairman Jammu and Kashmir Self-Determination Movement – International, which was attended by a large number of British parliamentarians. The Deputy Speaker of the House of Commons, Rt Hon Dame Winterton, made a special appearance in the conference.",
  "retrievedAt": "2025-08-11T18:44:59.216Z"
}
