{
  "title": "Imran, Mahathir agree to take Pak-Malaysia strategic partnership to new level",
  "link": "https://www.app.com.pk/national/imran-mahathir-agree-to-take-pak-malaysia-strategic-partnership-to-new-level/",
  "date_published": "2020-02-05T02:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP):Prime Minister Imran Khan and his Malaysian counterpart Mahathir Mohamad have agreed that the strategic partnership status is a testament to the new level of bilateral cooperation between the two countries in various fields, and entails further engagement and enhanced cooperation.\nThey also reaffirmed their shared desire to continue to maintain regular high-level contacts, deepen friendly exchanges of visits, and expand cooperation in all fields, said a joint statement issued on the conclusion of Prime Minister Khan’s two-day official visit to Malaysia.\nAccording to the statement issued on Wednesday, Malaysia and Pakistan would further strengthen and expand their bilateral economic, trade and investment ties in the traditional and non-traditional sectors, including by leveraging on the strategic location of both countries to serve as a trade gateway to the vast market in the Southeast Asian, East Asian and the South Pacific regions, and the South Asian, West Asian, Central Asian and Southern Chinese regions, respectively.\nPrime Minister Imran Khan undertook his second visit to Malaysia from February 3 to 4 to strengthen the exemplary Pakistan-Malaysia strategic partnership.\nDuring the visit, Malaysia and Pakistan firmly stressed that the question of Palestine, situation in Jammu and Kashmir, and the Rohingyas issue should be resolved on the basis of the relevant United Nations Security Council (UNSC) and General Assembly (UNGA) resolutions, as well as the UN Charter and the international human rights and humanitarian law.\nPrime Minister Imran Khan briefed his counterpart on the illegal and unilateral actions of the Indian government of August 5, 2019 and the ensuing lockdown, communications blockade, media blackout and illegal detentions in Jammu and Kashmir which have brought immense suffering to the Kashmiri people.\nHe appreciated the efforts of Prime Minister Mahathir for raising awareness regarding the situation and underscoring the imperative of peaceful resolution of the Jammu & Kashmir dispute.\nThe Malaysian prime minister recognised the essential role of Prime Minister Imran Khan in ensuring peace and security in the South Asian and West Asian regions through his goodwill diplomatic efforts towards the maintenance of international peace and security.\nDuring their one-on-one meeting and subsequent bilateral delegation meeting, both leaders, while recalling the historic elevation of Malaysia-Pakistan relations to the level of strategic partnership that they jointly formalised in Islamabad on March 22, 2019, reaffirmed the strong and enduring bonds between the two fraternal countries marked by warmth, cordiality and mutual trust.\n“Both leaders held fruitful, in-depth and wide-ranging discussions on bilateral, regional and international issues of mutual interest,” the statement added.\nMalaysia and Pakistan also collaborated in the heavy industry sector. In this regard, both leaders recalled the symbolic ground breaking of the Proton Assembly Plant jointly officiated in Islamabad on March 22, 2019, and were pleased to note the progress made at the facility in Karachi, scheduled for completion in the first half of 2021.\nThey were further pleased with the joint venture between Malaysia’s Proton Holdings and Pakistan’s Al-Haj Automotive that add value with the commencement of selling Malaysian-made Proton vehicles (CBU) in Pakistan in the second half of 2020, and eventually, assembly and sale of Pakistan-made Proton vehicles (CKD) in Pakistan in the first half of 2021.\nAs two peace-loving brotherly Muslim nations, both leaders agreed on the following:\n– Malaysia and Pakistan will further increase collaborative efforts in international fora in upholding the true values of Islam and in addressing the common challenges facing the Ummah, including Islamophobia and the rights of Muslim minorities.\n– Malaysia and Pakistan together with Turkey will proceed with the initiatives in broad areas of strategic cooperation under the Joint Committee Meeting (JCM) to complement the efforts by the community of the Muslim world aimed at uplifting the socio-political and socio-economic condition of the Ummah and promoting the true values of Islam, while being mindful of the centrality of the Organisation of Islamic Cooperation (OIC) and in this regard.\n– Malaysia and Pakistan will explore institutional collaboration in the area of halal food and services, and consumer products, including by leveraging on their comparative advantages with a view to increase their global market share in this area.\nBoth leaders expressed their resolve to further expand and deepen bilateral relations at all levels and in all possible areas of cooperation, in particular those that have been identified in the joint statement.\nThey agreed to pursue and fulfill the existing commitments, inter alia, to convene the meetings of the existing bilateral mechanisms at the earliest opportunity.\nIt was agreed that Malaysia and Pakistan would continue to promote parliamentary diplomacy through the exchange of visits and regular contacts between the members of their respective bilateral parliamentary friendship groups.\nRecognising the huge tourism potential in both countries, Malaysia and Pakistan looked forward to strengthening bilateral cooperation in the field of tourism, as well as continue to encourage tourism and hospitality investment in both countries.\nIt was further agreed that Malaysia and Pakistan would further enhance educational ties and, in this regard, commended the visits to Pakistan in 2019 by the officials of four Malaysian universities, namely the National University of Malaysia, University Technology PETRONAS, Asia eUniversity and Limkokwing University to explore possible cooperation with the Pakistani universities.\nBoth leaders also agreed to consider new initiatives, including; Malaysia and Pakistan will take stock and review the existing bilateral cooperation instruments, with a view to updating and streamlining the relevant ones in order to meet the current requirements and circumstances.\nMalaysia and Pakistan will explore new possible areas of cooperation in trade and investment, such as renewable energy, natural resources, aerospace and aeronautical, digital technology, artificial intelligence and e-commerce.\nMalaysia and Pakistan encouraged their Chambers of Commerce and Industry, in particular the respective Business Councils, to undertake the necessary initiatives to promote private sector-driven bilateral trade and investment ties and partnership.\nIn addition to its existing direct ISB/KUL/ISB sector, Pakistan International Airlines (PIA) will be adding a new direct flight destination soon from Lahore to Kuala Lumpur in order to cater for the increasing number of Pakistani travellers to Malaysia. Malaysia Airlines will give due consideration to enter into a code-sharing arrangement for the existing ISB/KUL/ISB sector operated by PIA, as proposed by the latter.\nRelevant bodies from Pakistan will engage with Malaysian counterparts for collaboration and experience sharing regarding successful practices and tools and techniques used in revenue collection and taxation.\nBoth leaders also witnessed the signing of the Treaty on Extradition, which will further reinforce and add substance to the strategic partnership between the two countries.\nThey also took note that a number of draft Memoranda of Understanding concerning investment, tourism, agriculture, skills development, and higher education were in the process of being finalized soon.\nThe prime minister of Pakistan commended the Prime Minister of Malaysia on the successful convening of the KL Summit 2019 considering the outcome of the Summit.\nHe further said that the Summit had been a success in bringing about change through economic collaboration.\nThe prime minister of Malaysia acknowledged the extensive counter-terrorism efforts by Pakistan and progress it continue to make in complying with the recommendations of the Financial Action Task Force (FATF).\nThe prime minister of Pakistan appreciated the constructive role that Malaysia has been playing to assist Pakistan in its efforts to improve and continuously taking active steps in further developing its anti-money laundering and terrorism financing ecosystem.\nPrime Minister Mahathir commended the prime minister on the occasion of the opening of the Kartarpur Corridor (connecting the Gurdwara Darbar Sahib in Pakistan to the border with India) on 9 November 2019.\nThe two leaders also welcomed the recent unanimous adoption of the Pakistan’s initiative at the 8th Session of Conference of the States Parties (COSP) to the UN Convention Against Corruption (UNCAC) of the Resolution on “Promoting good practices in relation to the role of national parliaments and other legislative bodies in preventing and combating corruption in all its forms.”\nPrime Minister Imran Khan extended an invitation to Prime Minister Mahathir to visit Pakistan who graciously accepted the invitation. The dates will be determined through diplomatic channels.",
  "retrievedAt": "2025-08-11T18:44:53.456Z"
}
