{
  "title": "Pakistan observes ‘Kashmir Solidarity Day’ countrywide",
  "link": "https://www.app.com.pk/national/nation-observed-one-minute-silence-on-kashmir-solidarity-day/",
  "date_published": "2020-02-05T01:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP):The entire nation come out on Wednesday to express solidarity with Kashmiris, besides awakening the conscience of international community against worst form of subjugation and human rights violations in Indian Occupied Jammu and Kashmir (IoJ&K).\nPeople from different walks of life including politicians, doctors, lawyers, social activists, students and others held rallies and programmes, across the country in support of Kashmiris’ just struggle for the right to self-determination.\nWith a renewed pledge, Pakistan and its nation reaffirmed that it would continue to extend its moral, political and diplomatic support to Kashmiris in their difficult times.\nOne minute silence was observed at 1000 hours to pay homage to the martyrs of Kashmir freedom struggle across the country, including Azad Kashmir to draw attention of the world towards Indian tyrannies against innocent Kashmiris.\nPakistan Post had issued a special commemorative Postage Stamp to mark the Day with strong message “We Stand with Kashmir”.\nPosters highlighting the plight of besieged Kashmiris were displayed across the country including airports, railways stations and national highways.\nThe Pakistan International Airlines (PIA) had broadcast a special message and documentary in its selected flights to highlight the Kashmir cause and plight of the people of IoJ&K.\nThe Day also remained a top trend on social media and thousands of the users of twitter, Facebook and Instagram paid tributes to Kashmiris’ struggle.\nHuman chains were formed at Kohala, Mangla, Barar Kot, Holar and Azad Pattan points linking Pakistan and Azad Kashmir.\nPresident of Pakistan Dr Arif Alvi reiterating the strong resolve to continue raising the issue of Jammu & Kashmir at every available fora, said India’s illegal actions of August 5 had further strengthened the bonds between the people of IoJ&K and Pakistan.\n“The Government and the people of Pakistan will continue to extend their political, moral and diplomatic support to the Kashmiri people until getting their legitimate right to self-determination as per the United Nations Security Council resolutions,” the president said in his message on the Kashmir Solidarity Day.\nPrime Minister Imran Khan while addressing the Azad Jammu and Kashmir Legislative Assembly to mark the Kashmir Solidarity Day said Indian premier Narendra Modi had committed a ‘fatal blunder’ with his illegal and unilateral steps over the internationally recognized Kashmir dispute, which would ultimately pave the way for freedom of IoJ&K.\n“If Modi could not step back his policies of racism and nationalism in the form of Hindutva would wreck havoc upon India,” the premier added.\nSpecial Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan while participating in a rally held here in connection with the day, submitted a memorandum to resident representative of the United Nations High Commissioner for Refugees (UNHCR), seeking international community’s intervention to stop Indian brutalities against Kashmiri women and children.\nShe said the Pakistani women from all walks of organized a rally in Islamabad to express solidarity with their brave sisters and children of the Indian Occupied and Jammu Kashmir (IOJ&K) and renew pledge to continue support for the cause of Kashmir till freedom from the Indian yoke.\nMinister for Kashmir Affairs and Gilgit-Baltistan Ali Amin Gandapur, in a statement, said Pakistan would continue its unconditional support to Kashmiris, adding the persistent lockdown of the occupied Jammu and Kashmir was the blatant violation of the United Nations charter.\nSpeaker National Assembly Asad Qaiser has said that Kashmir issue was not just a territorial dispute but a question of people’s inherent right to self-determination.\nHe said that lockdown and propaganda could not gag the voice of freedom nor it can alter Pakistan’s resolute and principled stance on Kashmir issue.\nChairman Senate Muhammad Sadiq Sanjrani, in his message on Kashmir Solidarity Day, said the people of Indian Occupied Kashmir (IOK) had been subjected to worse human rights abuses and under such circumstances, Pakistan stood shoulder to shoulder with them.\nHe said that the Indian security forces had been granted complete impunity while perpetrating acts of aggression against the innocent Kashmiris.\nAzad Jammu and Kashmir (AJK) President Sardar Masood Khan appealed to the British parliament to say ‘no’ to the BJP-RSS regime’s genocide in the Indian Occupied Jammu and Kashmir (IOJ&K).\n“Say no to genocide, to land grab, to warmongering and Hindutva,” he said while addressing a Kashmir conference in London on the eve of the Kashmir Solidarity Day.\nPrime Minister AJK Raja Farooq Haider urged the international media, Pakistan’s missions abroad, and Kashmiri diaspora to use all available resources for peaceful resolution of Kashmir issue.\nMeanwhile, Governors, Chief Ministers and parliamentarians of all the provinces also issued messages to express solidarity with the people of IoJ&K.\nAddressing a gathering in Lahore, Punjab Chief Minister Sardar Usman Buzdar said India, which claimed to be the biggest democracy in the world, blatantly violated all democratic norms and human rights in Occupied Kashmir.\nPunjab Governor Chaudhry Mohammad Sarwar said Pakistan would take along Kashmiris at every forum and ready to render any sort of sacrifice for freedom of Kashmir.\nSindh Governor Imran Ismail and Chief Minister Syed Murad Ali Shah also expressed solidarity with the people of Kashmir by participating in a Kashmir rally in Karachi.\nAddressing a ceremony in Nishtar Hall in connection with Kashmir Solidarity Day, Chief Minister Khyber Pakhtunkhwa Mahmood Khan said people of KP would not desist from any sacrifice for the freedom of Kashmir and support Kashmiris people in their just struggle to get right of self determination.\nGovernor Balochistan Amanullah Khan Yasinzai, speaking at a ceremony of ‘Kashmir Banega Pakistan’ in Quetta, said measures would be taken to draw attention of international organizations towards the Kashmir cause for achieving self-determination right of Kashmiris according to charter of United Nations (UN).\nMishal Malik, the wife of Hurriyat leader Yasin Malik thanked Pakistan government for its “unconditional and unflinching support” to the political movement of the people of IoJ&K for their right to self-determination.",
  "retrievedAt": "2025-08-11T18:44:56.051Z"
}
