{
  "title": "NA Speaker underlines role of Women’s participation in legislation, economy, politics for country’s development",
  "link": "https://www.app.com.pk/national/na-speaker-underlines-role-of-womens-participation-in-legislation-economy-politics-for-countrys-development/",
  "date_published": "2022-11-24T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):National Assembly Speaker Raja Pervez Ashraf Thursday recognizing role of women in  development of the country said that  without integration of women in legislation, economy, and politics, the development remained a distant dreams.\nHe expressed these views while addressing the participants of the “National Conference of Women’s Parliamentary Caucus” organized by Women Parliamentary Caucus ( ) in Pakistan Institute of Parliament Serves ( PIPS)\nThe speaker congratulated Secretary WPC Shahida Rehmani for arranging the conference as it is for the first time that such an effort has been made to gather Women Legislators from National and Provincial Assemblies under one roof.\nHe said that Women had always worked dedicatedly towards bringing sustainable change in the lives of their fellow women and they had always played an imperative role in strengthening inter-provincial ties.\nWhile, commemorating the determination of Shaheed Benzair Bhutto, the speaker said that she was a symbol of invincible women as a she served as the 11th and 13th Prime Minister of the country.He said that she was the first woman to head a democratic government in a Muslim majority country.\nSecretary WPC Shahida Rehmani during her welcome remarks highlighted the extensive role played by women Parliamentarians in the development of Pakistan.\nGerman Ambassador also said “Germany supports women empowerment as their inclusion and participation in decision making is essential for sustainable development & building peaceful societies”, Equal voice creates opportunities for equality.\nResilient Women Network, President, Asiya Nasir highlighted the significant role of Women Parliamentarians in policy intervention to promote women rights and enhance their participation for socio-economic development of the country.\nShe acknowledged the tireless efforts of Shaheed Mohtarma Benazir Bhutto, Dr. Fehmida Mirza abd all other Women Parliamentarians in strengthening democracy.MNA, Nafisa Shah highlighted WPC works on the principal of issue based affiliations.MNA Kishwer Zehra while talking about gender discrimination and inequality proposed to establish more platforms to ensure significant representation of women in every sphere.\nSenator Sana Jamali appreciated efforts of Speaker National Assembly and Secretary WPC for bridging gap between Federal and Provincial Assemblies to promote substantial role of women Parliamentarians and work together for betterment of women across the country.",
  "retrievedAt": "2025-08-11T15:55:06.444Z"
}
