{
  "title": "India trying to mislead world about IIOJK ground situation: GA Gulzar",
  "link": "https://www.app.com.pk/national/india-trying-to-mislead-world-about-iiojk-ground-situation-ga-gulzar/",
  "date_published": "2022-11-24T08:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):All Parties Hurriyat Conference (APHC) senior leader Ghulam Ahmed Gulzar has said that India was trying to mislead the world and befool ordinary Indian people about the ground situation in the territory.\nGhulam Ahmed Gulzar’s statement came after the Indian Army’s Northern Commander, Lt General Upendra Dwivedi recent remarks claiming that there was a perceptible improvement in the security scenario of Kashmir after the abrogation of Article 370, said a press release.\nGhulam Ahmed Gulzar in a special message from Central Jail, Srinagar, said the statement about normalcy in IIOJK is self-deception and a blatant lie. If normalcy has returned to Kashmir why India has turned it into a military garrison, he added.\nHe said if India’s claims are true then it should allow international human rights organisations to visit Kashmir and assess the ground situation. He said India has also arrested dozens of human rights defenders and journalists to hide its crimes in the territory.\nAPHC senior leader said the repeal of IIOJK’s special status on 5th August 2019 is a painful tragedy as Kashmiris were deprived of all political, social, and religious rights and it was the worst attack on the unique identity and Kashmiri culture.\nHe said over 80 thousand Kashmiris have been under constant seize since 5th August 2029. This action, which is a brazen violation of international law, has paralyzed everything in the besieged valley and people are in a state of shock and mourning.\nGhulam Ahmad Gulzar said August 5th action has devastated the already crippled economy in IIOJK and thousands of Kashmiris have lost their jobs. Education, health and other sectors have become defunct and the future of Kashmiri children has become bleak, he deplored.\nHe further said that India has ruined everything in the territory and it has become a torture center for its inhabitants. The land of Kashmiris is snatched on different pretexts and Hindu fanatics from India are given domiciles to change the demography of the territory, he deplored.\nThe APHC senior leader said local Kashmiris are sacked and outsiders are granted high posts in the occupied territory. He also said India is following the Israeli model to deprive Kashmiris of its land. He said systematic genocide, mass arrests and other atrocities have intensified manifold since 5th August 2019.\nHe urged the world powers to take concrete steps for resolution of the Kashmir dispute and put pressure on India to stop genocidal campaign and other violations of human rights in Kashmir.\nMeanwhile, APHC-AJK chapter leader Haji Muhammad Sultan Butt in a statement in Islamabad termed the Indian army officer’s statement as an attempt to hide its heinous crimes in the occupied territory. He said Indian Army chief is trying to please his Hindutva masters by issuing such statements.\nReacting on hollow threats to capture Azad Jammu and Kashmir Haji Sultan said every Kashmiri and Pakistani is ready to fight Indian aggression and safeguard every inch of its motherland.",
  "retrievedAt": "2025-08-11T15:55:12.079Z"
}
