{
  "title": "Clarity needed for effective narrative building against extremism: Qamar Zaman Kaira",
  "link": "https://www.app.com.pk/national/clarity-needed-for-effective-narrative-building-against-extremism-qamar-zaman-kaira/",
  "date_published": "2022-11-24T17:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Advisor to Prime Minister on Kashmir and Gilgit-Baltistan Qamar Zaman Kaira has said that Pakistan needs clarity and consensus on its narrative against violent extremism and all key stakeholders of the state need to show political resolve to develop a comprehensive response against this menace.\nThe senior PPP leader made these remarks at a roundtable consultation on the ‘Resurgence of Violent Extremism in Pakistan’ organized by Communications Research Strategies (CRS) in collaboration with the United States Institute of Peace (USIP) on Thursday at a local hotel here.\nHe recalled the past experiences of the years 2008-2013, a time when Pakistan successfully countered violent extremism.\nThe meeting also featured senior security experts, journalists, and academics, including former Director General Inter-Services Public Relations Major General (Retd) Athar Abbas, Major General (Retd) Ejaz Awan, senior academic and member of Planning Commission Dr. Ishtiaq Ahmad, and senior journalists Mehmood Jan Babar and Iftikhar Firdous.\nThe participants expressed concern about the resurgence of militancy in the country and offered solutions for reducing the impact of militant narratives among the public.\nParticipants of the consultation also noted that militant groups were increasingly resorting to the use of the latest communication technologies through digital media to further their propaganda.\nMaj Gen (Retd) Athar Abbas was of the view that political stability was imperative to ensure a decline in terrorism and extremism.\nMehmood Jan Babar added that the militants were trying to use political and local grievances to mislead the people but they were failing in doing so as the public had rejected them.\nIftikhar Firdous said that the public had strongly opposed the Tehreek-e-Taliban Pakistan (TTP) and do not wish to provide them any kind of legitimacy, which was very evident by the large public protests in Khyber Pakhtunkhwa against the outlawed group.",
  "retrievedAt": "2025-08-11T15:55:03.423Z"
}
