{
  "title": "President appoints Gen Sahir Shamshad as CJCSC; Gen Syed Asim Munir as COAS",
  "link": "https://www.app.com.pk/national/president-appoints-gen-sahir-shamshad-as-cjcsc-gen-syed-asim-munir-as-coas/",
  "date_published": "2022-11-24T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): President Dr Arif Alvi on Thursday appointed General Sahir Shamshad Mirza as Chairman Joint Chiefs of Staff Committee and General Syed Asim Munir as Chief of the Army Staff.\nPrior to their appointments in their respective positions, the president promoted both officers to the rank of General as earlier they had been serving as Lieutenant Generals.\n“President Dr Arif Alvi has promoted Lieutenant General Sahir Shamshad Mirza HI(M) to the rank of General with immediate effect and appointed him as Chairman Joint Chiefs of Staff Committee with effect from 27th November 2022,” a President House press release said.\n“The President promoted Lieutenant General Syed Asim Munir HI(M) to the rank of General with immediate effect and appointed him as Chief of Army Staff with effect from 29th November 2022,” it said.\nPresident Alvi made the said promotions and appointments under Article 243(4) (a)&(b) and Article 48(1) of the Constitution of the Islamic Republic of Pakistan read with Sections 8-A and 8-D of the Pakistan Army Act 1952.\nIn this regard, he has signed the summary received in his office earlier in the day.\nLater, the newly appointed CJCSC General Sahir Shamshad Mirza and COAS General Syed Asim Munir separately called on President Arif Alvi.\nThe president congratulated Sahir Shamshad Mirza HI(M) on his promotion as General, and appointment as Chairman Joint Chiefs of Staff Committee.\nHe also congratulated Syed Asim Munir HI(M) on his promotion as General, and appointment as Chief of Army Staff.\nThe president expressed his best wishes for their success as CJCSC and COAS.\nEarlier in the day, Information Minister Marriyum Aurangzeb, taking to Twitter, said that Prime Minister Shehbaz Sharif had sent the summary to the president for the appointments of top military brass.\n“Using his constitutional powers, Prime Minister Shahbaz Sharif has decided to appoint Lt Gen Sahir Shamshad Mirza as the Chairman of the Joint Chiefs of Staff and Lt Gen Syed Asim Munir as the Chief of the Army Staff,” she wrote on Twitter.",
  "retrievedAt": "2025-08-11T15:55:08.097Z"
}
