{
  "title": "PTA organizes workshop on GSMA mobile connectivity index",
  "link": "https://www.app.com.pk/national/pta-organizes-workshop-on-gsma-mobile-connectivity-index/",
  "date_published": "2022-11-24T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Pakistan Telecommunication Authority (PTA) on Thursday organized a workshop on GSMA’s Mobile Connectivity Index (MCI), here, at its headquarters.\nThe workshop was conducted in collaboration with Global System for Mobile Communications (GSMA), said a news release.\nIt focused on the GSMA’s MCI with an objective to improve Pakistan’s future MCI scores by understanding how indicators were assessed and how effectively PTA and other stakeholders can collect and share data with GSMA.\nThe workshop was attended by representatives from the Ministry of Information Technology & Telecom (MoITT), the Pakistan Bureau of Statistics (PBS), the Frequency Allocation Board (FAB), the Universal Service Fund (USF), National Electric Power Regulatory Authority (NEPRA), Ministry of Federal Education and Professional Training (MoFEPT) and mobile operators.\nSenior officers from PTA also participated in the workshop.\nDuring his opening remarks, Member Compliance & Enforcement, Dr. Khawar Siddique Khokhar said that PTA had always strived for the provision of affordable and advanced services and technologies across the country.\n“It is closely working with GSMA on MCI in terms of provision and verification of telecom data.”\nDuring the workshop, GSMA speakers presented on the role of connectivity in building an inclusive society and guidelines for using the MCI which was followed by an interactive session and discussion with the participants.\nSpeaking on the occasion, Chairman PTA, Maj. General Amir Azeem Bajwa (R) stated that Pakistan’s overall MCI scores had increased from 39.8 in the year 2019 to 43.9 in 2021. Pakistan had witnessed improvements in all 4 categories: infrastructure, affordability, consumer readiness, and content.\nHe said that the active participation of stakeholders at the workshop meant that concerned problem areas, identified in MCI, would be addressed in an effective way in the future for a true representation of Pakistan’s MCI scores.\nThe chairman also thanked GSMA for conducting the workshop.",
  "retrievedAt": "2025-08-11T15:55:09.166Z"
}
