{
  "title": "Senate Body for expediting transactions completion of privatized entities",
  "link": "https://www.app.com.pk/national/senate-body-for-expediting-transactions-completion-of-privatized-entities/",
  "date_published": "2022-11-24T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Senate Standing Committee on Privatization here on Thursday called upon the Privatization Commission of Pakistan to expedite efforts for completing the transactions of privatized state-owned enterprises to protect and safeguard national interest.\nThe committee, chaired by Senator Shamim Afridi, discussed the status of government entities already privatized but the transactions have not been completed and was briefed on the privatization of the Convention Center, besides current status of the Pak-China Fertilizer Company.\nThe committee was apprised that the Privatization Commission had so far completed 178 privatization transactions and generated privatizations proceeds of Rs 7,649,114 million which included the privatizations of the banking sector, capital markets, telecom and other entities.\nRegarding the privatization of the Jinnah Convention Center, it was informed that Cabinet Committee on Privatization on August 21, 2020, approved the transaction structure and was ratified by the Federal Cabinet on September 1, 2020.\nThe meeting was further informed that the Privatization Commission pre-qualified 12 potential investors in response to the expression of interest, however, CDA Board raised certain observations in contrast to the approval of the Federal Cabinet and no objection was provided earlier by the authority and expressed apprehensions on the transaction.\nThe matter is currently placed before the Cabinet Committee on Privatization for approval to re-initiate the privatization process of Jinnah Convention Center and guidance for the way forward.\nThe committee was also briefed about the privatization status of Pak-China Fertilizer Company and told that Privatization Commission was pursuing the case and making all efforts to secure the interest of the government and in this case, the outstanding amount of Rs 2.8 billion has been conveyed to the Court.\nThe meeting was informed that the Supreme Court of Pakistan had dismissed the case of Schon Group against the sale of 112 Kanal land and the process of disbursement of the amount received against the sale of 112 Kanal land to the employees.\nSpeaking on the occasion, Senator Anwaar ul Haq Kakar expressed concerns over the incomplete transaction of the fertilizer company and called for early completion of the process to protect the national interest. He assured that the committee would extend its support to Privatization Commission.\nApart from Senators, Anwaar ul Haq Kakar, Molvi Faiz Muhammad and Anwar Lal Dean, senior officials of the Privatization Commission and Capital Development Authority also attended the meeting.",
  "retrievedAt": "2025-08-11T15:55:12.089Z"
}
