{
  "title": "Appointment of Hafiz-e-Quran as COAS pride for Pakistan in Islamic World",
  "link": "https://www.app.com.pk/national/appointment-of-hafiz-e-quran-as-coas-pride-for-pakistan-in-islamic-world/",
  "date_published": "2022-11-24T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Ulema, Mashaykh and religious scholars of various schools of thought on Thursday welcomed the appointment of Lt General Syed Hafiz Asim Munir as the Chief of Army Staff (COAS) and Lt General Sahir Shamshad Mirza as Chairman Joint Chiefs of Staff Committee (CJCSC).\nThey said Prime Minister Muhammad Shehbaz Sharif had fulfilled his constitutional and legal responsibility by appointing the COAS and CJCSC.\nIn a joint statement, the clerics said the newly appointed COAS was a Hafiz-e-Quran and his appointment as the army chief was a great honor for Pakistan Army, nation and a matter of pride for Pakistan in the Islamic world.\nThey also announced to fully support and endorse these two important appointments by the prime minister.\nPrime Minister’s special representative for Interfaith Harmony and Middle East and Pakistan Ulema Council Chairman Hafiz Muhammad Tahir Mahmood Ashrafi, Pir Naqibur Rahman, Pir Hasan Haseebur Rahman, Amir Muttahida Jamiat Ahl Hadith Maulana Syed Ziaullah Shah Bukhari, Amir Jamiat Ulema Islam Maulana Hamidul Haq Haqqani, Secretary General Maulana Syed Muhammad Yusuf Shah, Secretary General of Muttahida Ulema Council Maulana Muhammad Khan Laghari, Maulana Muhammad Shafi Qasmi, Maulana Nauman Hasher, Maulana Asad Zakaria, Dr. Raghib Naimi, Professor Abu Bakr Siddique, Vice President of Shia Ulema Council Allama Arif Wahidi thanked the prime minister for appointing a Hafiz-e-Quran as army chief who learned and memorized Quran at the Harmain Al-Sharifain.\nThey reiterated that the Pakistani nation needed unity and stability at this time, and appointing a Hafiz-e-Quran and Syed as the commander-in-chief was a good omen for the country, nation and for the Muslim Ummah.\nThe religious scholars expressed the hope that the appointment of new army chief and CJCSC would further strengthen the defense, security and stability of the country.",
  "retrievedAt": "2025-08-11T15:55:06.037Z"
}
