{
  "title": "Railways to receive 46 new coaches from China by December end",
  "link": "https://www.app.com.pk/national/railways-to-receive-46-new-coaches-from-china-by-december-end/",
  "date_published": "2022-11-24T07:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Pakistan Railways would receive the first batch of 46 new coaches from China by the end of December, next month which would not only upgrade the current rolling stock but also provide modern traveling facilities to the passengers.\n“Out of the total 230 coaches, 46 will be provided as completely built units and the remaining 184 to be manufactured in the county by the department’s engineers and technical staff under the supervision of the Chinese experts,” an official told APP.\nHe said the coaches would have the capacity to run at the train’s speed of 160 kilometers per hour and the teams of Pakistan Railways were in China for the inspection of the prototypes of the coaches as well as the modern high-capacity wagons.\nThe official said the experts of China were also proving training to the technical staff of Pakistan Railways on the manufacturing of such rolling stock.\nHe said Pakistan Railway was planning to upgrade the dilapidated track as the Khanpur-Kotri section was not fit for high-speed train operation while most of the Main Line-I (ML-I) parts were fit for the 120km per hour train operation.\n“After the completion of the ML-I project under the China-Pakistan Economic Corridor (CPEC), the entire ML-1 track would have the capacity to bear the rolling stock operations at the speed of 160km per hour,” he added.\nHe said that under another similar nature contract, a Chinese company would manufacture 800 freight wagons and 20 brake wagons. The manufacturing of 184 coaches in Pakistan would be under the ‘Transfer of Technology’ project.\nFor the coaches planned to be manufactured in Pakistan – Pakistan Railways Carriage Factory, Islamabad – the Chinese firm would provide spare parts and raw materials, he added.\nThe official said the teams of Pakistan Railways had left for China mid of August consisting of 18 officials for design inspections, 20 for other inspections, and the others for participating in the training related to the transfer of technology.",
  "retrievedAt": "2025-08-11T15:55:14.304Z"
}
