{
  "title": "Pakistan Railways need to use its full commercial potential to meet financial issues: Saad Rafique",
  "link": "https://www.app.com.pk/national/pakistan-railways-need-to-use-its-full-commercial-potential-to-meet-financial-issues-saad-rafique/",
  "date_published": "2022-11-24T18:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Minister for Railways Khawaja Saad Rafique on Thursday said Pakistan Railways could not rely on its core business only as it need to use its full commercial potential to meet its financial issues.\nResponding to a calling attention notice in the National Assembly, he was of the view that the said practice was applicable all over the world.\nRegarding Quetta-Zohb section, the minister informed that it was closed in 1985. There was a narrow-gauge railway. The railways disposed of the track in 2008.\nHe went on to say that in April, 2022, the Railways decided to launch an operation but due to a lack of local administration’s support, the operation could not get successful.\nHe said there was a strip of 18 acres of land including the railway station and railway yard which had been encroached by the land mafia.\nHe said the Railways divisional superintendent of Quetta was sent to review the situation and he visited the entire area.\nThe department after taking the local administration and Frontier Constabulary into confidence was going to launch an effective operation to vacate the precious land of the Railways, he added.\nThe minister was of the opinion that operation was not the ultimate solution to the issue.\nThe Railways should be given permission to lease out the land of those sections where there was no chance of revival of Railways operation in the future, he added.\nHe said if Railways got permission to lease its certain land, it could regularize its affairs on some standard terms and conditions and it would help generate business for the Railways.\nHe said for this particular section, the Railways needed ROW clearance because in the future it would be the foundation of Quetta and Peshawar’s railway link.\nHe said Quetta and Peshawar should have directly linked instead of via Punjab. “We will restore ROW for this particular section,” he maintained.",
  "retrievedAt": "2025-08-11T15:55:03.418Z"
}
