{
  "title": "Pakistan, Kazakhstan to launch direct flights, fast-track visas to boost trade ties",
  "author": null,
  "content": "ISLAMABAD, Sep 16 (APP):Pakistan and Kazakhstan have agreed to enhance connectivity and trade cooperation through the launch of direct flights, fast-track business visas, and joint business forums, as Kazakhstan’s Ambassador, Yerzhan Kistafin, called on Federal\nMinister for Communications Abdul Aleem Khan here on Tuesday.\nDuring the meeting, the two sides discussed key matters concerning bilateral relations, trade cooperation, and strengthening institutional ties between the two countries, said a press release.\nThey deliberated on the initiation of direct flights between Pakistan and Kazakhstan, facilitation for the business community and collaboration between the Chambers of Commerce of both brotherly countries.\nFederal Minister Abdul Aleem Khan emphasized that enhancing mutual connectivity is a top priority for both countries in order to significantly increase trade volume. He announced that Kazakhstan’s business community will be granted two-year visas within 24 hours from Pakistan. Moreover, a proposal is under consideration to issue five-year multiple-entry visas to members of the Chamber of Commerce to enable seamless business travel between the two countries.\nAmbassador Yerzhan Kistafin welcomed the idea of organizing a Business Forum in Lahore and agreed to host joint business meetings in major Pakistani cities. He confirmed that, similar to Karachi, a business forum will also be held in Lahore to further boost bilateral trade relations.\nThe meeting also included discussions on the recent visit of Kazakhstan’s Deputy Prime Minister and other Ministers to Pakistan. Federal Minister Abdul Aleem Khan shared that he will represent Pakistan at the upcoming Global Transport Conference in Kazakhstan.\nAmbassador Yerzhan Kistafin expressed Kazakhstan’s desire to develop a trade corridor to Pakistan using its own resources. He noted that various routes including through Afghanistan, China, and Iran are being explored to make this initiative viable.\nAleem Khan stated that both countries possess significant potential and it is now time to take practical steps towards realizing these opportunities.\nDuring the meeting, both dignitaries also exchanged views on the current regional situation and the challenges ahead.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:56:43.895Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-kazakhstan-to-launch-direct-flights-fast-track-visas-to-boost-trade-ties/",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T19:34:00.000Z"
}
