{
  "title": "Pakistan’s strategic deterrence remained effective during May 2025 conflict: Gen Kidwai",
  "author": null,
  "content": "ISLAMABAD, Sep 16 (APP):Pakistan’s strategic deterrence remained unshaken and fully effective during the May 2025 standoff, asserted Lt. Gen. (R) Khalid Ahmed Kidwai, Advisor National Command Authority (NCA) and former Director General SPD, while addressing a high-level session at the Islamabad Policy Research Institute (IPRI) on Tuesday.\nSpeaking on the topic of “Stability of Pakistan’s Strategic Deterrence”, Gen. Kidwai said that strategic deterrence and limiting operational cap on crisis escalation are in-built in Pakistan’s capability of Full Spectrum Deterrence (FSD). “The stability of our strategic deterrence was never compromised during the May 2025 standoff,” he said, adding that Pakistan has triumphed in terms of stability of nuclear deterrence due to its robust conventional response, said a press release.\nHe said that Pakistan’s nuclear weapons, which India refers to as nuclear blackmail, will continue to define the limits of India’s kinetic freedom of action. Gen. Kidwai said that the Army Rocket Force Command (ARFC) provides an additional layer of strategic deterrence between the operations of conventional forces and the potential employment of nuclear forces, thereby in some ways raising the nuclear threshold.\nHe said the ARFC has simply responded to a need of the modern battlefield while nuclear deterrence remains in place as the ultimate shield against India.\nGen. Kidwai said unlike India, Pakistan has time and again demonstrated that restraint and responsibility are the key components of its nuclear policy.\nHe said that the Indian strategic judgement in risking a nuclear Armageddon post-Pahalgam can only be labelled as one of the most bizarre and irresponsible acts in the annals of military history.\nHe recalled the years from 1998 onwards, as Pakistan’s nuclear capability, slowly but surely, embarked on a well-defined and focused force development trajectory under the NCA/SPD, it matured and grew into a robust operationalized force as a comprehensive triad, in the ASFC, in the NSFC and in the AFSC.\n“The large size of the Indian army does not tell the entire story like the large size of Arab States’ armies against Israel does not tell the whole story. Quality, technology and training are the force multipliers that determine the victor in an armed confrontation,” he remarked.\nHe observed that Operation Sindoor has embarrassed India and boomeranged on its planners.\n“India not only failed to attain any of the politico-cum strategic-cum-military objectives; far from it, it suffered major military reverses especially in the IAF,” he pointed out.\nGen Kidwai said Pakistan’s Full Spectrum Deterrence worked in both directions, east and west, and it was no “bluff”.\nHe said India’s desire for seeking the so-called “space for limited war, despite a nuclear overhang”, remained shrunk as it opted to limit its initial escalation as openly admitted.\nHe remarked that the term ‘Strategic Deterrence’ was born out of necessity after the atomic shocks of Hiroshima and Nagasaki, as the world realised that a single weapon could annihilate a complete city.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:57:13.872Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistans-strategic-deterrence-never-affected-during-may-2025-standoff-gen-kidwai/",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T16:16:00.000Z"
}
