{
  "title": "823 students enrolled in Pakistani School Tripoli in 2022-23: Senate told",
  "link": "https://www.app.com.pk/national/823-students-enrolled-in-pakistani-school-tripoli-in-2022-23-senate-told/",
  "date_published": "2023-05-05T07:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP): Minister for State for Law and Justice Shahadat Awan on Friday informed the Senate that there was a total of 823 students, including 227 from Pakistani community enrolled in the Pakistani School Tripoli (Libya) during 2022-23.\nReplying to various questions during Question Hour, the minister said that there were two Pakistani Schools in Libya including Pakistan Embassy International School & College, Tripoli and Pakistan Embassy International School & College, Benghazi.\nAs many as 31 students appeared in Matric while 14 students in Higher Secondary School Certificate (F.Sc) during 2022-23, he added.\nHe said the schools and colleges were not only for Pakistani students but also for students from other communities. The schools bore expenditure from their own resources and no funding was made from the government budget, he said.\nThe minister said the syllabus of the Federal Board of Education at SSC and HSC levels was being taught in the schools and students regularly appear in Federal Board Exams every year. Additionally, IGCSE, Edexcel and AS Level Syllabi were also taught, he said.\nTo another question, the minister said there were 45 regular Lecturers (BS-17) and 18 daily wages staff working in evening shifts in Islamabad Model Colleges.\nIt was a fact that lecturers teaching in the evening shift in Islamabad Model Colleges as Visiting Faculty Members were being paid remuneration @Rs. 180/- per period and @240 per period for degree level with the approval of the Finance Division while lecturers working in evening shift in one ex-FG-College i.e. Islamabad Model Postgraduate College of Commerce, H-8/4, Islamabad were being paid remuneration @ Rs. 350/- Per Period, he said.\nHe said the case regarding enhancement in remuneration of Visiting Faculty Member (VFM) for teaching Secondary/ Intermediate or equivalent classes from Rs.180/-per period to Rs. 400/-per period and; visiting faculty member for teaching to BS/Associate Degree Programme or classes to Rs. 750/-per period was being examined in consultation with Federal Directorate of Education.",
  "retrievedAt": "2025-08-11T08:26:55.587Z"
}
