{
  "title": "Improvement in media freedom index manifestation Pakistan’s moving towards right direction: Marriyum",
  "link": "https://www.app.com.pk/national/improvement-in-media-freedom-index-manifestation-pakistans-moving-towards-right-direction-marriyum/",
  "date_published": "2023-05-05T09:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Friday said that the improvement of Pakistan in global media freedom index was a manifestation of the fact that Pakistan’s direction was correct and the government had intentions to improve it further.\nExpressing her gratitude over Pakistan’s improvement of 7 ranks in the world ranking of press freedom, she said in a statement that the era of media-bashing, kidnapping, shooting, rib-breaking, accusing media persons of selling loyalties and dirty character assassination campaigns was slowly ending, which was also being acknowledged globally.\n“Efforts are being made to remove the stigma of ‘media predator’ on Pakistan’s forehead”, she said while referring to Imran’s era.\nThe minister said that that four-year mess of ‘Imran Media Predator’ was gradually being cleared with the grace of Allah Almighty.\nShe congratulated the Pakistani nation and the media that Pakistan was improving in the media index at global level.“It is gratifying to see progress in media in one year under the leadership of Prime Minister Shehbaz Sharif”, she maintained.She thanked to Allah for bringing positive improvement in media freedom index after getting out of FATF’s gray list.\nMarriyum Aurangzeb saluted the journalists and media organizations who struggled for the freedom of expression and journalism, faced hardships and oppression. She vowed that this journey of improvement would continue in their cooperation.\nThe minister opined that a seven-point improvement in the Media Freedom Index was the manifestation of tolerance of dissent.\nThe RSF report acknowledged that the current government was committed to a democratic attitude towards the media, she said and added, this report distinguishes between a democratic people’s government and an undemocratic imposed regime.\nThe minister said that the constitutional rights of media and expression of opinion would be further strengthened.\nReferring to 2022 report in which Imran Khan was declared a media predator, she said in the past years of this dark regime, Pakistan went down 12 places in the media freedom index.\nShe lamented that during the four-year tenure of ‘Imran Predator’, Pakistan went down 18 ranks in the Press Freedom Index. In just one year under the leadership of Prime Minister Shahbaz Sharif, Pakistan’s index imeroved its rank by 7.",
  "retrievedAt": "2025-08-11T08:26:52.593Z"
}
