{
  "title": "High-level Ethiopian officials, business delegations arriving in Pakistan on May 9: Envoy",
  "link": "https://www.app.com.pk/national/high-level-ethiopian-officials-business-delegations-arriving-in-pakistan-on-may-9-envoy/",
  "date_published": "2023-05-05T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP): Ambassador Extraordinary and Plenipotentiary of the Federal Democratic Republic of Ethiopia Jemal Beker Abdula on Friday said that high-level officials and business delegations were arriving in Pakistan from Ethiopia on May 9 to advance bilateral and multilateral cooperation in diverse fields to further strengthen relations between the two countries.\nAddressing a news conference here, he said a 60-members delegation would comprise on the representatives of three major ministries including the Ministry of Foreign Affairs, Trade and Regional Integration Ministry and Innovation Technology as well as high officials of the Investment Commission of Ethiopia and Industrial Park Development Corporation.\nFrom the business side, he said that it would represent multiple economic sectors of Ethiopia including agriculture and agro processing, pharmaceutical, textile, surgical equipment, sports, tourism, mining and ICT.\nThe Ambassador said the official delegation would sign Memorandums of Understanding (MoUs) with their Pakistani counterparts in technology, tourism and other fields.\nHe said the trade agreements would also be signed between the business communities of both the countries to boost the trade volume which was minimal to this day.\nH.E. Jemal Beker said two business forums were also being organized in Karachi and Islamabad to bolster the bilateral trade by strengthening trade and commerce ties between the two countries.\nHe said that Pakistani business community was keen to increase bilateral trade between the two countries since the ongoing development in Ethiopia’s diverse economic sectors had really impressed them during their recent visit to the capital city Addis Ababa.\nLikewise, the business community of Ethiopia also wanted to develop business and trade ties with their counterparts in Pakistan.On the occasion, the Ambassador also congratulated the people of Ethiopia on Patriots’ Victory Day which was being observed in his country today to honour the veterans of the resistance movement against Italy.",
  "retrievedAt": "2025-08-11T08:26:47.135Z"
}
