{
  "title": "G20 meeting in IIOJK against UN resolutions, int’l law: Ashrafi",
  "link": "https://www.app.com.pk/national/g20-meeting-in-iiojk-against-un-resolutions-intl-law-ashrafi/",
  "date_published": "2023-05-05T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 5 (APP):Pakistan Ulema Council (PUC) Chairman Hafiz Muhammad Tahir Mahmood Ashrafi, Friday urged the G20 countries’ political and religious leaders not to participate in the upcoming meeting to be held in Srinagar.\nTalking to APP, he said the leaders of various schools of thought, political, and religious parties in Pakistan had appealed to the G20 countries not to participate in any activity in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAshrafi, who is also the Special Representative of the Prime Minister on Interfaith Harmony and Middle East, said IIOJK was a disputed territory and that any meeting or activity there would be a violation of United Nations (UN) resolutions and international law.\nHe said Pakistan had always talked about resolving the Kashmir issue in accordance with the UN resolutions adding thatif China and Saudi Arabia wanted to play an effective role in the resolution of Kashmir issue, Pakistan would not have any objection to this positive development.\nHe clarified that the restoration of Pakistan and India relations would be possible through the Kashmir route adding that Pakistan’s desire for peace should not be taken as weakness as it was in the best interest of two billion people of the region.\nAshrafi said if the Kashmir issue was resolved amicably, it would bring peace, progress and prosperity in the region.\nHe also mentioned that minorities, including Muslims, Christians, Sikhs, and other religions, and their worship places, were constantly being targeted in India.\nHe urged the Organization of Islamic Cooperation, the Muslim World League, and the leadership of all religions and sects to express solidarity with the oppressed Kashmiris and minorities in India.\nHe also informed that an All Parties Kashmir Conference would be held on May 19, in Islamabad under the umbrella of Pakistan Ulema Council.\nHe termed the participation of Foreign Affairs Minister Bilawal Bhutto Zardari in the Shanghai Cooperation Organization meeting in India, a good decision.",
  "retrievedAt": "2025-08-11T08:26:40.430Z"
}
