{
  "title": "Govt’s sincerity can avert uncertainty, terrorism resurgence in country: Senators",
  "link": "https://www.app.com.pk/national/govts-sincerity-can-avert-uncertainty-terrorism-resurgence-in-country-senators/",
  "date_published": "2023-05-05T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 5 (APP):The members of the Senate Friday expressed their optimism that the coalition government’s sincerity in dialogue with the opposition could help avert prevailing uncertainty due to political and constitutional crises alongside terrorism resurgence threatening peace and security of the country.\nTalking to APP outside the Parliament House, Senator Moula Bux Chandio of Pakistan People’s Party Parliamentarian (PPPP) said the prevailing crises were not insurmountable rather demanded a prudent approach of the government to tackle it with mutual consensus and cooperation.\nHe added that the sincerity of the coalition government could help improve the situation.\nSenator Syed Ali Zafar of Pakistan Tehreek-e-Insaf (PTI) said there was uncertainty in the country due to no fresh polls alongside terrorism revival causing damage to the country.\nHe opined that if the higher court made a decision and all stakeholders started to move in one direction then these issues could be resolved.\nSenator Zafar said all political parties and partners should sit together to resolve the issues and alleged that the economic crisis had worsened due to lack of planning and strategy of the coalition parties to manage the matters pertaining to economy.\nSenator Hidayatullah Khan of Awami National Party (ANP) said the issue of terrorism revived in Khyber Pakhtunkhwa (KP) due to its close proximity with Afghanistan but this would incur its repercussions to rest of the country and would not remain confined to one region or province.\nHe mentioned that the inflation was spiking up and leaving the poor and downtrodden badly impacted by abnormal rise in the prices of edible items.\nKhan said the country should have peaceful ties with all its neighbouring countries to ensure its sustenance through dialogue and cooperation as economic crunch was aggravating with every passing day.\nParliamentary Secretary for Communications, MNA Shahida Akhtar Ali said the ongoing uncertainty was the cause of inflation in the country.\nShe added that the rise in prices of petroleum products had further added in the crisis that brought increase in the ratio of price hike.\nMs. Shahida claimed that there was a global economic recession post Covid-19 pandemic that impacted the country as well but political instability also contributed in the price hike issue.\nOn the query of any barter trade mechanism in the pipeline with the neighbouring countries, she said the coalition government’s discussion on the matter were underway but it had certain limitations and was bound due to global restrictions imposed on the region.",
  "retrievedAt": "2025-08-11T08:26:49.153Z"
}
