{
  "title": "Court reserves judgment on maintainability of Toshakhana case",
  "link": "https://www.app.com.pk/national/court-reserves-judgment-on-maintainability-of-toshakhana-case/",
  "date_published": "2023-05-05T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP):The District Sessions Court of Islamabad on Friday reserved its judgment on the maintainability of the Toshakhana criminal case against former prime minister Imran Khan.\nAdditional Sessions Judge Hamayun Dilawar heard the case filed by Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan challenging the maintainability of the Toshakhana criminal case.\nAt the outset of the hearing, counsel for the Election Commission of Pakistan (ECP) Amjad Pervaiz prayed to the court to dismiss the petition, saying there were directives to the local courts to conclude the corruption case within three months.\nHe said the ECP had recommended lodging a criminal case against Imran Khan for not disclosing the gifts received from the Toshakhana. Imran Khan had challenged its maintainability just to delay the proceeding. He requested the court to terminate the petition of PTI’s head and frame charges against him.\nHe said there was an allegation against Imran Khan under section 173 of the Election Act. Imran Khan had not submitted the assets details to the ECP deliberately. So far no development had been made in the Toshakhana case proceedings after the cancellation of the arrest warrants of Imran Khan.\nThe court remarked that it had served notices, issued warrants and decided the maintainability of the case previously but it was not challenged by the petitioner.\nImran’s lawyer Khwaja Haris said the case should be heard like other normal cases and prayed to the court to adjourn the hearing till next Friday.\nThe court observed that the arguments would be made on that day.\nKhwaja Haris said the District Election Commissioner was a complainant in the Toshakhana case which was a violation of section 190 of the Election Act as only the ECP was authorized to file the complaint.\nThe trial and admissibility of the case were two different things, he said, adding the sessions court could not hear the case directly praying for termination of the case.\nImran Khan’s lawyer Barrister Gohar contended that the institution could file a complaint only within 120 days after the submission of the affidavit by his client. After the passing of the said time the matter was beyond the jurisdiction of ECP, he said.\nAfter hearing arguments from two sides, the court reserved its judgment on the matter.",
  "retrievedAt": "2025-08-11T08:26:42.854Z"
}
