{
  "title": "Govt brings education to doorsteps of deprived communities",
  "link": "https://www.app.com.pk/national/govt-brings-education-to-doorsteps-of-deprived-communities/",
  "date_published": "2023-05-05T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 5 (APP): The federal government in its first year took two significant initiatives to introduce technology and mobility in the education sector, with the aim to create learning opportunities for all sections of society particularly for children living in deprived communities.\nWith the cost of education rising amid tough economic conditions, early this year Prime Minister Shehbaz Sharif spearheaded two innovative projects “Schools on Wheels” and Pakistan Teleschool App. In February in the first phase, he launched the project of mobile schools consisting of eight buses that are providing primary-level education to children of Islamabad and adjoining areas.\nThe buses which park at different spots in areas of the capital are equipped with computers, desks, whiteboards, and LCDs, giving teachers and students an environment to engage and learn.\nAt the inauguration ceremony, while terming children ‘future builders of the nation’, the prime minister reiterated that the government would make sustained efforts to provide maximum educational facilities to the young generation.\nThe project of mobile schools is part of the government’s strenuous and persistent efforts to boost literacy rate, particularly in rural areas.In the next phase, the plan is to increase the number of buses and expand the project to other parts of the country including Azad Kashmir.The project will help children in neglected communities to become literate and capable of seeking further education and technical skills.\nAccording to UNICEF, an estimated 22.8 million children aged 5-16 are not attending school in Pakistan, comprising 44% of the total population in this age group and there is a dire need to make education accessible to them through new tools of information technology.In a bid to bring education to the homes of children, PM Shehbaz Sharif in March launched a Pakistan Teleschool App developed by the Ministry of Federal Education and the results were encouraging.\nIn just a week, the application was downloaded 10,000 times, 5500 enrollments were made and 17000 videos were viewed in 310 cities. The project is aimed at providing online education to students from grades 1 to 12.\nWhile in another step to educate children, the government is working to bring the remaining 70,000 out-of-school children in the Islamabad Capital territory to schools by June 30.Shehbaz Sharif during his tenure as chief minister of Punjab successfully brought to fruition a scheme to distribute laptops among students pursuing higher education.\nOnce again, the PM has plans to distribute 100,000 laptops among higher achievers in educational institutions as he passionately believes that equipping youth with the latest tools of information technology is the path to future learning and innovation.In the summer of last year, Pakistan was devastated by floods of epic proportions induced by climate change, and 33 million people were affected in the flood-hit areas.\nThe floods destroyed critical infrastructure including schools in Balochistan and keeping in view the urgent need to re-open schools, the prime minister led the way and inaugurated a smart school in Sohbatpur, Balochistan in January. Built in a record period of two months, the school is equipped with the latest IT facilities. He also re-opened a new building of flood-affected Government Boys Secondary school Killi Jaya Khan in the same area.",
  "retrievedAt": "2025-08-11T08:26:52.791Z"
}
