{
  "title": "Punjab’s new monitoring system ‘game-changer’ for stolen gadgets recovery - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The e-Gadget Monitoring System of police, which was developed with the help of the Punjab Information Technology Board (PITB), has proved effective in tracking down and recovering stolen or lost mobile phones of citizens, necessitating equipping the police with more such technology rather than investigating crime on traditional lines.\n\nIt was evident from the recovery of over 100 mobile phones, including iPhones, using the e-Gadget app when the criminals tried to sell them at throwaway prices in the black market.\n\nThese mobile phones were returned to their owners in a ceremony at the office of the Lahore Investigation DIG office.\n\nInvestigations SSP Muhammad Naveed and the investigating officers of various police stations handed over the mobile phones to the complainants.\n\nPolice return to owners 100 mobile phones recovered through e-Gadget app\n\nTalking about the e-Gadget Monitoring System, Mr Naveed told Dawn the system proved a game-changer in bringing down the sale of stolen mobile phones in the market. He said the Punjab Police had developed the system in collaboration with the PITB and then signed a memorandum of understanding (MoU) or agreement with the shopkeepers or traders running business in Lahore.\n\n“Currently, there are 46,000 mobile phone shops where the traders are running business of global and local brands of mobile phones. The irritating part of the development was that, in the past, many of these shops had become a hub of stolen mobile phones for the criminals as they used to sell them there at throwaway prices,” the SSP lamented.\n\nThis illegal practice, he added, had led to the fast increase in mobile phone theft crime before the introduction of the e-Gadget Monitoring System. He explained that the stolen devices were being sold and purchased as the data of stolen mobile phones was not available online.\n\nAccording to the officer, the Lahore police introduced the app, issuing strict instructions to all the traders to use it to stop the illegal sale of the stolen mobile phones. The traders in the mobile phone industry were asked to register themselves using the e-Gadget app to store the IMEI numbers of each mobile phone so that the police might access the database for stolen gadgets. Under the agreement, all the shopkeepers/traders were bound to make entry of the details of each mobile phone for verification of the device before initiating the sale or purchase process. This app would also safeguard the shopkeepers’ business.\n\nThe SSP investigation said the app was having four steps/features, including a portal designed to monitor the re-sale of the stolen mobiles/laptops.\n\nHe added that the system also provided a dynamic dashboard for monitoring and investigating while the shopkeepers were advised to record every device that they wanted to buy, sell or repair.\n\n“They were also instructed to take a picture of the seller, enter his/her CNIC number, and the details of the device. In case a mobile phone is stolen, the police will be notified promptly via the app and an FIR will be instantly uploaded there. The police concerned would immediately rush to the site and take the seller into custody besides seizing the device,” Mr Naveed said.\n\nTalking about another key future of the app, the official said that any user/citizen could put a mobile phone’s International Mobile Equipment Identity (IMEI) number into the app to check if the device had been reported stolen or lost.\n\n“This verification helps buyers and sellers ensure the legitimacy of the mobile phones they are dealing with.”\n\nConsequently, the SSP said, the e-Gadget Monitoring System helped investigation wing police to recover over 100 mobile phones during the last four months or so.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:10:16.144Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912068/punjabs-new-monitoring-system-game-changer-for-stolen-gadgets-recovery",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:31:49.000Z"
}
