{
  "title": "4 suspects involved in allegedly raping mentally-challenged minor in Lahore arrested: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "The police on Tuesday said they had arrested four suspects involved in an alleged gang rape of a mentally-challenged minor in Lahore earlier this month.\n\nAccording to a first information report registered today, a copy of which is available with Dawn.com, the victim, aged 14, was taken to a washroom of a mosque on May 9 where the four suspects allegedly raped her.\n\n“They threatened the mentally challenged girl, telling her that if she told anyone about the incident, they would kill her,” the FIR said, adding that the suspects later dropped the girl outside her house.\n\nAccording to the complainant, the girl was upset and scared since the incident, eventually narrating the events to her parents a day ago.\n\nIn a post on social media, the Punjab Police said that action was taken on the complaint, and all four suspects were taken into police custody.\n\nSeparately, the Prosecutor General of Punjab, Syed Farhad Ali Shah, took notice of the incident and summoned the investigating officer on May 22 along with the record.\n\nThe provincial prosecutor general declared the case a “high-profile one”, stating that strict legal action will be taken against the suspects.\n\n“A special prosecution team will be deployed to follow up the case,” Shah said.\n\nDespite the presence of anti-rape laws — with punishment for rape either resulting in the death penalty or imprisonment of between 10 and 25 years — cases continue to prevail in the country.\n\nEarlier this month, Non-Governmental Organisation (NGO) Sahil’s data revealed that a total of 3,364 cases of child abuse were reported from across the country in the year 2024.\n\nIn the first six months of 2024, 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages were reported.48 cases of pornography after sexual abuse were also recorded.\n\nLast month, Punjab police arrested five suspects for their alleged involvement in the gang rape of a child in Muzaffargarh.\n\nIn March, two suspects were arrested in connection with an alleged gang rape on the Faisalabad motorway. In a separate case that month, Punjab police also arrested three suspects for allegedly gang-raping a woman in Lahore.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:19:44.181Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912194/4-suspects-involved-in-allegedly-raping-mentally-challenged-minor-in-lahore-arrested-police",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T16:21:18.000Z"
}
