{
  "title": "OIC parliamentary union asks India to allow fact-finding mission to visit occupied Kashmir - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Parliamentary Union of OIC Member States, in its recent conference in Jakarta, asked India to allow the organisation to send its mission to the occupied Kashmir to ascertain the human rights situation in the occupied territory.\n\nThe PUOIC conference concluded earlier this week with a resolution that asked India to allow the OIC special representative for Jammu and Kashmir and the OIC fact-finding mission to visit the region to conduct an impartial and non-biased assessment of the human rights situation.\n\nIn the resolution, the conference also took serious note of the issuance of domicile certificates to millions of non-Kashmiris, and amendments to the land ownership law, while asking India to refrain from taking any step aimed at changing the existing demographic structure of the disputed region.\n\nThe PUOIC demanded that India refrain from using live ammunition and shotguns against civilians and asked India to lift the military blockade and reduce the number of security forces as well as take other concrete and serious steps for the full implementation of Security Council resolutions on Kashmir.\n\nThe conference reiterated the urgent need to ensure that those responsible for crimes related to human rights violations and abuses were held accountable through a credible and independent international investigation conducted by the United Nations.\n\nThe resolution also emphasised that the file issued by Pakistan on September 12, 2021, constituted compelling evidence of widespread and systematic violations of human rights in the Indian-occupied Jammu and Kashmir region, and called on the international community to hold India responsible for the heinous crimes committed by the occupying forces.\n\nThe resolution also denounced Israel for its genocide of Palestinians and sought full cessation of the ongoing Israeli military attacks. It also demanded the immediate release of Palestinian prisoners unlawfully and arbitrarily imprisoned by Israel, in particular women and children.\n\nMeanwhile, a declaration issued at the end of the Jakarta moot welcomed the ceasefire between Indian and Pakistan and called on the international community to redouble efforts and encourage both countries to resolve all outstanding issues, including the Jammu and Kashmir dispute in accordance with the aspirations of the people of Jammu and Kashmir through peaceful means, as enshrined in the relevant United Nations Security Council resolutions.\n\nIt also stressed maximum restraint and avoidance of actions that could destabilise the region, and adherence to the principles of the charter of the OIC, charter of the United Nations and international law, particularly the principles relating to respect for the sovereignty and territorial integrity of states, and the need to adhere to the agreement to protect civilians, residential areas, and civilian facilities, including places of worship.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:09:30.800Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912092/oic-parliamentary-union-asks-india-to-allow-fact-finding-mission-to-visit-occupied-kashmir",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:32:17.000Z"
}
