{
  "title": "FO rejects Indian claim of Pakistan targeting Sikh holy site Golden Temple in Amritsar - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Foreign Office (FO) on Tuesday rejected the claim made by India that Pakistan had attempted to attack the Golden Temple in Amritsar — one of the holiest sites in Sikhism — during the recent tensions with the neighbouring country.\n\nNew Delhi had accused Islamabad, without evidence, of orchestrating last month’s deadly attack in occupied Kashmir’s Pahalgam. Pakistan had strongly denied the allegations and called for a neutral probe. As the situation turned into a military confrontation between the nuclear powers, it took American intervention for both sides to agree to a ceasefire.\n\nA day earlier, the Indian army claimed that Pakistan had attempted to target the Golden Temple and the attacks were “successfully thwarted”, The Hindu reported.\n\nThe management of the temple was allowed to deploy guns to “counter potential drone and missile threats from Pakistan”, a senior army official told ANI. He was quoted as saying, “Fortunately, we visualised what they [Pakistan] were capable of doing … They were more interested in creating confusion, chaos internally, and hence, we visualised that they would target our civil population and our religious places of worship.”\n\nIn a statement today, FO spokesperson Shafqat Ali Khan said, “We categorically reject the allegations that Pakistan attempted to target the Golden Temple, the most revered place in the Sikh faith.\n\n“We hold all places of worship in the highest esteem and cannot think of targeting a holy site like the Golden Temple.”\n\nHe said that India had targeted different places of worship in Pakistan on May 6-7, adding that the allegations “cannot shift attention from this unacceptable act”.\n\nThe statement further said, “Pakistan is the proud custodian of many holy sites of the Sikh faith. Every year, it welcomes thousands of Sikh pilgrims from across the world.” He highlighted that the country provides visa-free access to the Gurdwara Sahib Kartarpur through the Kartarpur Corridor.\n\n“In that backdrop, any claim concerning Pakistan’s attempt to target the Golden Temple is absolutely baseless and incorrect,” it added.\n\nOn Monday, the FO spokesperson dismissed reports of the Indian media claiming that Pakistan had used nuclear-capable Shaheen missiles. He said that the Indian army deleted the “misleading video” after realising that the claim was “unsubstantiated”.\n\n“These fabricated stories align with New Delhi’s ongoing efforts to promote a misleading narrative regarding the ceasefire and baseless allegations of so-called ‘nuclear blackmail’ by Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:19:45.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912162/fo-rejects-indian-claim-of-pakistan-targeting-sikh-holy-site-golden-temple-in-amritsar",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T07:42:50.000Z"
}
