{
  "title": "Media and war - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE are many reasons to be grateful that India and Pakistan have agreed to a ceasefire. And while there are many sober considerations for this, on the lighter side, it will allow many of us hacks to step back from pretending we can offer thoughtful and serious takes on war, diplomacy and all matters defence.\n\nAll this and more should be left to the difai tajziakaars (defence analysts) and retired ambassadors during private get-togethers, where everyone understands S400, PL15 and integrated systems. And hopefully, the rest of us can go back to pontificating about who visited Adiala and why and how ripped — or not — the one page is, while the ministers and their PTI counterparts hold forth about May 9.\n\nThis repetitive talk is in a way comforting as proof that we are back to our dysfunctional, insular ways on television and newspapers, where little time and effort is spared for the region or the world. But as we limp our way back into political (ab)normalcy, here is another week’s offering (hopefully, my last) on war and rickety peace.\n\nThere has been much talk on the role of the media in this short conflict, where Pakistan in particular has ‘discovered’ how sane its media is, relatively speaking. So much so that officials cannot stop appreciating the media for its role in the conflict. But this tends to make old-fashioned souls such as myself uncomfortable, for the training of bygone days insists that only the unhappiness or discomfort of a government is proof of a job well done.\n\nConversely, approval might suggest failure. Perhaps this adage does not hold true in times of conflict; for war is (hopefully) an exception, and hence the duration where usual rules need not apply is short.\n\nStill, constant praise of the media by officials is problematic. For they end up suggesting some sort of a link between what the press and media did and what the government expected. This is hardly appropriate.\n\nAnd though parallels and comparisons are odious, it is worth nothing that next door in India, the government has really not commented on the role played by the media there — although there were sections of the Indian media that not just created public opinion for an attack on this country but also broadcast news that later turned out to be fictitious about Indian attacks on Pakistani cities.\n\nThe government’s approach in India maintains a distance between the fourth estate and the government which helps create credibility for the media, an essential attribute, if voices are to be heard and believed by an international audience.\n\nIn the middle of all the noise, there has been some serious and nuanced commentary.\n\nHowever, this is not all. Watching snippets of the Indian media has allowed many of us, who work as journalists on this side of the border, to feel good about what we have at home — a sober and sensible approach. But in doing so we may be missing out on the variety and breadth the Indian media landscape has to offer.\n\nIn the middle of all that madness and noise, there has also been some serious and nuanced commentary, which is missing on our home front. Take the superb interviews done by senior journalist, Karan Thapar, who is well known in the region and beyond. In a universe, where we are told only the godi media survives, Thapar has done a series of interviews which have provided critical and rich details on the conflict as well as modern-day India.\n\nHe has even interviewed Pakistani voices such as Najam Sethi and Moeed Yusuf. Not only do his skills as an interviewer deserve praise, so do his courage and that of those who provided him with The Wire platform during these difficult times for dissenting voices and Pakistani views to be heard. This is why his interviews were avidly watched in Pakistan as well. As most journalists know, dissent is difficult when the vast majority of fellow citizens feel that there is only one corner to stand in when war beckons.\n\nI point this out as it is hard to name a similar platform in Pakistan which can provide similar dissenting and critical views. Or one that could interview voices of ‘the other’, if for nothing else but to understand their views and what is being said or debated. Indeed, while our commentary was far more sober, I am not sure we had the same level of variety or range.\n\nOther than journalists, there have also been experts who have spoken about India’s defence limitations publicly, a discussion we prefer to carry out privately. Is it always better that vulnerabilities are discussed in private? Or would doing so with some level of transparency help people gain a better understanding of the challenges ahead?\n\nWhile this will lead to comebacks about how The Wire and even other platforms have been and continue to be banned in India, it should still leave us with questions about why similar platforms do not exist here.\n\nThese are issues to be discussed in Pakistan once the rhetoric and emotions have calmed down. For conflicts do not mean that those watching us will have forgotten the extraordinary challenges facing the media within in recent years.\n\nAfter all, till this crisis, X had been banned in Pakistan for over a year, despite court queries and questions from the people. And despite criticism, this ban continued. It was external factors that led to a change of heart.\n\nNo wonder then that many users continue to expect the social media app to stop working just as suddenly as it did the last time.\n\nThis is not simply the wish list of an old-fashioned hack; it is important for us all to remember that this war of narratives we are carrying out with India is not just to shape domestic opinion but also to carry a message internationally. The latter cannot happen without credibility; and this will not come about just because the government is happy with the media.\n\nThe writer is a journalist.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682ba4ae000a8.png",
  "retrievedAt": "2025-08-23T14:19:46.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912097",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:33:20.000Z"
}
