{
  "title": "SC upholds Zahir Jaffer’s death sentence in Noor Mukadam murder case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Supreme Court on Tuesday upheld the death sentence of Zahir Jaffer for the gruesome murder of Noor Mukadam nearly four years ago that had shaken the nation.\n\nAfter the ruling by the top court, a presidential pardon under Article 45 of the Constitution could possibly provide Zahir pardon, or reprieve, or remit, suspend or commute his sentence.\n\nNoor, aged 27 years, was found murdered at Zahir’s Islamabad residence in July 2021, with the probe revealing she was tortured before being beheaded. Zahir’s death sentence by the trial court had already been upheld by the Islamabad High Court (IHC).\n\nA three-member bench, led by Justice Hashim Kakar and including Justices Ishtiaq Ibrahim and Ali Baqar Najafi, presided today over the third hearing of Zahir’s appeal against his death sentence.\n\nThe bench upheld Zahir’s death sentence handed by two courts previously over the murder charges under Section 302(b) (premeditated murder) of the Pakistan Penal Code (PPC).\n\nHowever, it converted the IHC’s decision of a second death penalty over rape charges into a life sentence . The high court had turned Zahir’s 25 years of rigorous imprisonment under Section 376 of the PPC into a death sentence.\n\nThe 10-year jail term for kidnapping in order to murder under Section 364 of the PPC was reduced to one year. The trial court had also imposed a fine of Rs100,000 in February 2022.\n\nThe apex court maintained the earlier orders to Zahir to pay Rs0.5 million to Noor’s legal heir.\n\nThe appeals of two co-accused — watchman Mohammad Iftikhar and gardener Jan Mohammad — against their 10-year sentences were also taken up by the SC.\n\nThe watchman and gardener’s sentences were reduced, with the bench deciding their detention so far was sufficient.\n\n“Therefore, by virtue of that, both will be released,” said Advocate Shah Khawar, the lawyer for Noor’s father, retired diplomat Shaukat Mukadam.\n\nZahir’s counsel, Barrister Salman Safdar, concluded his arguments today, while Khawar also presented his.\n\nA short order on today’s hearing is yet to be issued. It is expected to detail the court’s decision on an appeal by Shaukat against the acquittal of Zahir’s father, Zakir Jaffer.\n\nDuring the course of the trial, judges made demeaning comments about Noor for spending time alone with Jaffer, with Justice Kakar on Tuesday adding that it was “against our values”, according to AFP.\n\nFarzana Bari, a women’s rights activist who attended the hearing, said the comments imply “that the man has some legitimate right to detain her, which is a harmful and regressive notion”.\n\n“Such judicial attitudes contribute to a long and exhausting struggle for justice, often leading victims to lose hope and give up along the way,” she told the outlet.\n\nMeanwhile, Shafaq Zaidi, a childhood friend of Noor, told AFP outside the court: “This is a victory for all the women of Pakistan. It shows that our justice system can deliver justice and should give women more confidence in the legal process\n\n“This was our last resort, and it’s hard to put into words what this outcome means to us.”\n\nHuman rights defender, Tahira Abdullah, in a statement, said: “It is a milestone achievement in Pakistani women’s ongoing struggle for justice — and also against entrenched patriarchy, sexism and misogyny, openly expressed in court by the defence legal team today as well.”\n\nDuring the previous hearing, the accused’s lawyer contended that no medical board was formed to assess his client’s mental state. Justice Kakar had observed, “A daughter was mercilessly murdered.”\n\nIn October last year, Noor’s father had urged the SC to take up the murder case pending for more than one and a half years in the top court.\n\nAt the outset of the hearing, Zahir’s counsel contended that any evidence against his client “must be beyond doubt”, arguing that the court could not “go beyond the footage presented in the court”.\n\nHe said the prosecution presented the footage on a USB at the IHC, but it could not be played.\n\nAt this point, a lawyer for the two co-accused presented his arguments briefly. He detailed their sentences, recalling that the watchman and gardener were accused of “stopping the victim from fleeing”.\n\nJustice Najafi observed, “If the suspects had not stopped the victim, then the situation would have been different.”\n\nThe lawyer asserted that the two co-accused had “no crime other than being present in the house” at the time of the murder.\n\n“What was the need to work more than [what] the salary [is paid for]?” Justice Kakar remarked.\n\nWhen the hearing resumed in the afternoon after a break, the counsel of Noor’s father presented his stance.\n\nIn his arguments, Khawar asserted that all evidence against the accused was part of the case record. “Noor Mukadam was kept in abduction for 40 hours.”\n\nTo this, Justice Kakar inquired, “How can you prove it was an abduction? It could be termed unjust confinement.”\n\nUpon Justice Ibrahim asking the counsel to detail the DNA reports, Khawar said the assessments proved the charges. “Blood samples were taken, and the report of the dagger also came positive,” he said.\n\nShaukat’s lawyer then opposed Zahir’s appeal and concluded his arguments.\n\nHere, the state lawyer came to the rostrum and said, “There should be no forgiveness for this heinous crime. This case should be made exemplary.\n\n“The state views this crime very seriously. This is a very sad tragedy and the state wants such criminals to be punished as per law.”\n\nSubsequently, the bench annoucned it decision, dismissing Zahir’s appeal and reducing the sentences of his two household staff to what they have served so far.\n\nNoor was found murdered at a residence in Islamabad’s upscale Sector F-7/4 on July 20, 2021. An FIR was registered later the same day against Zahir Jaffer, who was arrested at the site of the murder.\n\nIn February 2022, a district and sessions judge sentenced Jaffer to death for the murder and handed him 25 years of rigorous imprisonment, finding him guilty of rape. His household staff, Mohammad Iftikhar and Jan Mohammad — co-accused in the case — were each sentenced to 10 years in prison.\n\nZahir’s parents, leading businessman Zakir Jaffer and Asmat Adamji, had been indicted by an Islamabad district and sessions court in October 2021 but were later acquitted by the court.\n\nSix officials of Therapy Works, whose employees had visited the site of the murder before police, were also among those indicted by the lower court but were later freed of the charges along with the parents. According to the challan, the parents and the therapy workers tried to conceal the crime and attempted to destroy the evidence.\n\nIn March 2023, the IHC, dismissing Zahir’s appeal, not only upheld the death sentence but also converted his 25-year jail term into another death penalty. The IHC had also rejected the pleas of the main suspect’s staff challenging their conviction.\n\nThe next month, Zahir approached the SC against the IHC verdict, insisting that his conviction resulted from “erroneous appreciation” of the case evidence and that the high court and trial court could not identify the “fundamental flaws” in the FIR.\n\nAfter an FIR was registered in the case and Zahir was arrested, his parents and household staff were also taken into custody by police on July 24, 2021, over allegations of “hiding evidence and being complicit in the crime”. They were made a part of the investigation based on the statement of Noor’s father but were later acquitted.\n\nIn his complaint, Shaukat had stated that he had gone to Rawalpindi on July 19 to buy a goat for Eidul Azha, while his wife had gone out to pick up clothes from her tailor. When he had returned home in the evening, the couple found their daughter Noor absent from their house in Islamabad.\n\nThey had found her cellphone number switched off and started a search for her. Sometime later, Noor had called her parents to inform them that she was travelling to Lahore with some friends and would return in a day or two, according to the FIR.\n\nThe complainant said he had later received a call from Zahir, whose family were their acquaintances. Zahir had informed Shaukat that Noor was not with him, the FIR said.\n\nAt around 10pm on July 20, the victim’s father had received a call from Kohsar police station, informing him that Noor had been murdered.\n\nPolice had subsequently taken the complainant to Zahir’s house in Sector F-7/4 where he discovered that his “daughter has been brutally murdered with a sharp-edged weapon and beheaded”, according to the FIR.\n\nShaukat, who identified his daughter’s body, had sought the maximum punishment under the law against Zahir for allegedly murdering his daughter.\n\nPolice later said that Zahir had confessed to killing Noor, while his DNA test and fingerprints also showed his involvement in the murder.\n\nMore to follow",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/20191451f37d339.jpg",
  "retrievedAt": "2025-08-23T14:19:45.784Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912155/sc-upholds-zahir-jaffers-death-sentence-in-noor-mukadam-murder-case",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T06:25:50.000Z"
}
