{
  "title": "Indian foreign secretary says no US mediation in ceasefire with Pakistan - World - DAWN.COM",
  "author": null,
  "content": "India’s Foreign Secretary Vikram Misri has said that the United States had no role in mediating the ceasefire between New Delhi and Islamabad, according to Indian media reports on Tuesday.\n\nMisri’s statement comes despite US President Donald Trump taking credit multiple times for his administration’s role in the truce, which Prime Minister Shehbaz Sharif also thanked him for.\n\nNew Delhi had accused Islamabad, without evidence, of orchestrating last month’s deadly attack in occupied Kashmir’s Pahalgam. Pakistan had strongly denied the allegations and called for a neutral probe. As the situation turned into a military confrontation between the nuclear powers, it took American intervention for both sides to agree to a ceasefire.\n\nDuring a meeting yesterday of the parliamentary committee on external affairs, led by Congress lawmaker Shashi Tharoor, Misri claimed that the offer for a ceasefire came from Pakistan and that no other country was involved in the negotiations, Hindustan Times reported, citing a “senior lawmaker”.\n\nAsked by parliamentarians about Trump’s statements that Washington had helped India and Pakistan “settle” the “problem”, the report quoted Misri as saying: “New Delhi had routine talks with the US but there was no mediation.”\n\nAccording to the report, this was Misri’s first appearance before the 31-member parliamentary panel. The meeting went on for more than three hours as members asked the foreign secretary numerous questions.\n\nIndia’s Press of Trust India, citing sources, also stated that Misri “reiterated the government’s stand that the decision to stop military actions was taken at a bilateral level”, indicating no third-party role.\n\nDuring the parliamentary panel’s moot, Misri was questioned about why the Indian government was giving Trump the centre stage and not refuting the US president’s claims on mediating the ceasefire.\n\nHowever, Misri “did not give any answer” to the questions, Hindustan Times reported, quoting the lawmaker, whose name it did not specify.\n\n“Trump publicly claimed at least seven times that he facilitated the ceasefire. Why was India silent?” India Today quoted an unnamed member of the panel as asking.\n\nAnother asked him why India “allowed Trump to repeatedly seize the narrative”, referring to the US president’s statements on the truce.\n\n“The sense the MPs got was that India neither involved the US in the discussions with Pakistan nor was India involved in the US’s decision to announce it,” India Today stated.\n\nTimes of India similarly reported that Misri reportedly said Trump made his remarks on the ceasefire on social media and not through any official channel, where India could have put its point across.\n\nDuring the in-camera session, the foreign secretary also ruled out the “restoration of normalcy with Pakistan in [the] near future”.\n\nMisri also said that the recent military confrontation with Pakistan was “entirely in the conventional domain and involved no ‘nuclear signalling’ from the other side”, the Hindustan Times added.\n\nWhile Defence Minister Khawaja Asif had warned of an “all-out war” prior to the conflict, Deputy Prime Minister Ishaq Dar said last week that a nuclear war was never an option for the government.\n\nDuring the meeting, Misri was also “pressed about the number of Indian aircraft lost during the hostilities”, referring to six fighters downed by the Pakistan Air Force, India Today reported.\n\nHowever, the foreign secretary declined to comment, citing national security concerns, the outlet added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/20101507c7162a1.jpg",
  "retrievedAt": "2025-08-23T14:19:46.030Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912153/indian-foreign-secretary-says-no-us-mediation-in-ceasefire-with-pakistan",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T05:27:44.000Z"
}
