{
  "title": "Policeman among three shot dead by robbers in Karachi as street crimes continue - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: As street crimes continued unabated in the metropolis, robbers went on a rampage in different areas on Monday, killing two citizens, a policeman and wounding many others.\n\nOver 40 citizens, including law enforcement personnel, have been killed by robbers in the city since the start of the year and the tally is still growing.\n\nIn Surjani Town, armed robbers shot dead a policeman and wounded another.\n\nSSP-West Tariq Illahi Mastoi said that private security guards of the Kaneez Fatima Society informed the police about the presence of four robbers there.\n\nHe said when a police team arrived there, the armed robbers resorted to indiscriminate firing, resulting in bullet injuries to two police constables —Mohammed Farooq and Safdar.\n\nMore than 40 people killed by muggers in Karachi in less than five months\n\nHe said that the robbers managed to escape from the spot by resorting to firing.\n\nHe said that both the wounded policemen were shifted to the Aga Khan University Hospital, where Constable Farooq died. He said he suffered a bullet wound in the chest, while Safdar was hit in the abdomen.\n\nShopkeeper shot dead by robbers in Orangi\n\nIn Orangi Town, a shopkeeper was shot dead by robbers, but he managed to kill one of them on Monday morning, police said.\n\nPakistan Bazaar SHO Manzoor Lashari said that two armed robbers arrived at a shop in Sector-13 near Disco Mor. As the shopkeeper put up resistance, the robbers opened fire and the bullet hit one of the employees, identified as Abid Arshad, 20.\n\nThe police said that the other shopkeeper returned fire and a bullet hit one of the fleeing robbers.\n\nThe police said that Abid and the robber died on the spot. The bodies were shifted to the Abbasi Shaheed Hospital for medico-legal formalities.\n\nThe dead suspect was identified as Mohammed Adnan Ali. The police said he had a past criminal record.\n\nMan shot dead in Korangi\n\nA young man was gunned down by robbers in Korangi on Monday afternoon, said a police spokesperson.\n\nIn a statement, the spokesperson identified the victim as Faisal Mehmood and claimed that he was killed when he resisted a robbery bid near a school.\n\nAwami Colony SHO Abdul Sattar Magsi said that the victim came to the school on a motorcycle to pick up his children.\n\nHe said that a witness told the police that she saw two young men sitting on a street near the school. When she inquired as to why they were sitting there, they told her that they are waiting for someone.\n\nThe area SHO said the police were probing as to whether the murder took place during robbery or it was a targeted attack since the killers did not take away anything.\n\nThe body was shifted to the Jinnah Postgraduate Medical Centre for medico-legal formalities.\n\nSuspect shot dead in ‘encounter’\n\nLater in the evening, police claimed to have killed one suspected robber and injured two others in an alleged encounter in Korangi.\n\nThe police said that some suspects were roaming in Zia Colony when a police patrol signalled them to stop. However, they resorted to firing and tried to escape. In an exchange of gunfire, one suspect was killed while his two accomplices were arrested in wounded condition.\n\nThe police identified the deceased as Mumtaz. The wounded suspects were identified as Sajid and Shabbir.\n\nThree pistols and one motorcycle were recovered from their custody. The body and injured were shifted to the JPMC for medico-legal formalities.\n\nWoman shot dead\n\nSeparately, a married woman was shot dead in her Shah Latif Town home on Monday.\n\nArea SHO Sadaruddin Mirani said Parveen Waseem, 25, was shot and killed by her relatives, who came to target another woman who had recently tied the knot on her free will in Shikarpur and came here to live with her.\n\nThe police claimed to have arrested a suspect, identified as Chaman. They said that the second suspect was identified as Rasheed and efforts were underway to arrest him.\n\nThe body was shifted to the Jinnah Postgraduate Medical Centre for a post-mortem examination.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:19:59.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912047/policeman-among-three-shot-dead-by-robbers-in-karachi-as-street-crimes-continue",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:31:21.000Z"
}
