{
  "title": "Navy thwarted Indian aircraft carrier threat, says Shehbaz - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PM praises Navy for ensuring maritime sovereignty\n• Reiterates Pakistan will give strong response to India if truce violated; lauds Trump for taking up Kashmir dispute\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Monday visited Karachi to pay tribute to the Pakistan Navy, which successfully safeguarded the sea lines of communication and ensured absolute maritime sovereignty through a layered seaward defence.\n\nDuring the visit to Pakistan Naval Dockyard, the PM was briefed by officials on the Pakistan Navy’s strategic orientation, operational undertakings, and contributions during the recent conflict.\n\nHe praised the navy for its preparedness and said it would have given a robust response to India if the neighbouring country had tried to attack Pakistan using its fleet.\n\nIn his address, the prime minister said India’s aircraft carrier Vikrant retreated after sensing the preparedness of the Pakistan Navy. “Indian Navy’s (aircraft carrier) Vikrant had reached close to Pakistan by 400 nautical miles, but after suffering immense losses inflicted by Paki­stan Air Force and Pakistan Army (elsewhere), Vikrant retreated, sensing the preparedness of the Pakistan Navy to respond vigorously,” he added.\n\nThe premier also recalled the navy’s proud legacy of decisive operations, saying the naval force remained fully capable of executing high-intensity operations akin to the historic ‘Operation Dwarka’ (1965), whenever and wherever required.\n\n“Strong coordination am­o­ng the armed forces is a golden chapter in the country’s history,” he said, adding that the ground forces targeted the enemy’s positions with precision using Fatah missiles and other weapons.\n\nHe also commended the Pakistan Navy for its resolute posture, operational dexterity, and effe­ctive deterrent response in countering adversarial maritime threats. The PM particularly praised the navy’s role in ensuring the uninterrupted flow of maritime trade.\n\nLauding the role of PN, the prime minister said the navy was ready to give a befitting response to India if the neighbouring country dared to attack Pakistan from the sea.\n\nPM Shehbaz said that over the past 15 years, the Pakistan Navy has gained the latest technology. “I congratulate Pakis­tan Navy for the progress it attained during the last 15 years through indigenous technology,” he said.\n\nThe PM reiterated that Pakis­tan was ready to give a stronger response to India if the neighbouring country violated the ceasefire.\n\n‘Man of peace’\n\nHe also called US President Donald Trump a ‘man of peace’ and expressed confidence that the US president would play an effective role in resolving the Kashmir issue.\n\n“President Trump is a man of peace as he played a major role in averting war between the two nuclear states (Pakistan and India),” the prime minister said. PM Shehbaz said he wanted to express his gratitude to President Trump for his desire to play a “sincere role” for the resolution of the Kashmir dispute.\n\nHe also thanked the leaders of Turkiye, Saudi Arabia, the UAE, Qatar, and China for supporting Pakistan.\n\nThe PM said these countries supported Pakistan’s stance that there should be an independent and transparent inquiry into the Pahalgam terror attack and questioned why India was not entertaining the offer.\n\nChief of Army Staff Syed Asim Munir and air chief Zaheer Ahmed Babar Sidhu also accompanied the PM, who was received and welcomed by the naval chief, Admiral Naveed Ashraf.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682bab5026e95.jpg",
  "retrievedAt": "2025-10-12T03:09:33.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912141/navy-thwarted-indian-aircraft-carrier-threat-says-shehbaz",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:28:10.000Z"
}
