{
  "title": "HBL PSL 2025: All-round Shadab stars as United rout Kings to end league stage on a high - Sport - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Having lost four matches in a row following five wins on the trot to open their HBL Pakistan Super League campaign, Islamabad United arrived here at the Rawalpindi Cricket Stadium on Monday night with the intent to stamp their authority as the defending champions.\n\nTo Karachi Kings’ horror, the holders went on to post a mammoth total before bundling Kings out cheaply as Shadab Khan led from the front, contributing both with the bat and the ball.\n\nThe all-rounder’s batting effort — 42 off 19 with the help of three fours and as many sixes — was a cameo in the bigger scheme of things, which saw Sahibzada Farhan and Alex Hales smash blistering half centuries to help United to 251-5.\n\nBut Shadab’s leg-spin accounted for four wickets at the expense of 45 runs, and that performance eventually defined the match, choking Kings batters through the middle of their chase as United won by 79 runs eventually.\n\nThe result saw United replace Kings in the second spot in the PSL standings as the tournament’s league stage ended, earning a spot in Wednesday’s qualifier against Quetta Gladiators. Kings, meanwhile, dropped down to third and will take on Lahore Qalandars in the eliminator on Thursday.\n\nKings had a decent powerplay as they gathered 62-1 during the field restrictions while also losing opener Tim Seifert (26 off 17, five fours) to a toe-crushing yorker by pacer Salman Irshad.\n\nThey lost incoming James Vince as the Englishman was deceived by Imad Wasim’s left-arm spin before Salman got Saad Baig as the right-hander, slicing one to Shadab.\n\nImad then returned to clean up Kings captain David Warner (43 off 28, four fours and two sixes) and Shadab caught Khushdil Shah off his own bowling and saw Mohammad Nabi hole him out to Haider Ali to deep midwicket to leave Kings reeling at 107-6 by the end of the 12th over.\n\nShadab returned in the 14th over to get Irfan Khan before the spinner castled Hasan Ali. With Karachi in a mess, Abbas Afridi cleared deep extra cover, cow corner and long-on off Shadab for three sixes in the 16th over to give his team hope.\n\nBut the right-hander departed when Salman’s slower one took an edge off his bat for wicket-keeper Ghazi Ghori to take an easy catch as proceedings virtually ended before Salman (3-28) got Aamer Jamal.\n\nEarlier, Farhan and Hales fired as United were put into bat. Farhan smashed 73 off 41 — an innings laced with nine fours and three sixes — while Hales plundered the Kings bowlers for 88 off 35 with the help of six fours and eight sixes.\n\nThe pair had made the most of the flat track to help United cruise to 76-0 in the powerplay. Farhan brought up his half century in 28 balls by the eighth over, until which he had demonstrated class with eight fours and a six.\n\nThe right-hander went deep into his crease to power Hasan’s pace high and long over midwicket to help United cross the 100-run mark before Hales hit three sixes and a four in the 10th over off Aamer as his team posted 130 at halfway stage.\n\nAfter Kings spinner Khushdil was smacked for 20 runs in the 11th over for United to reach 150, Farhan finally faltered, chipping Mir Hamza to Abbas at short fine-leg.\n\nThe dismissal got Kings back into the game with Aamer seeing Rassie van der Dussen hole him out to Warner on the boundary before miscommunication between the incoming Salman Ali Agha and Hales got the former run out.\n\nHowever, captain Shadab’s arrival injected impetus into United’s effort yet again, the right-hander hit sixes off Hasan, Aamer and Khushdil before Hales was castled by the spinner.\n\nBut Shadab kept going on, finding two boundaries through the off-side off Khushdil as United crossed the 200-run mark in the 17th over. The fireworks relented after that but sixes by Haider Ali and Ben Dwarshuis, along with two more boundaries pushed United to a total which proved to be far more than enough.\n\nSCOREBOARD\n\nISLAMABAD UNITED:\n\nSahibzada Farhan c Abbas b Hamza 73\n\nAlex Hales b Khushdil 88\n\nRassie van der Dussen c Warner b Aamer 1\n\nSalman Ali Agha run out (Khushdil) 7\n\nShadab Khan run out (Seifert) 42\n\nHaider Ali not out 19\n\nBen Dwarshuis not out 10\n\nEXTRAS (B-4, W-7) 11\n\nTOTAL (for five wickets, 20 overs) 251\n\nDID NOT BAT: Imad Wasim, Ghazi Ghori, Salman Irshad, Tymal Mills\n\nFALL OF WICKETS: 1-153 (Farhan), 2-163 (van der Dussen), 3-172 (Salman), 4-199 (Hales), 5-237 (Shadab)\n\nBOWLING: Hamza 4-0-41-1 (1w), Khushdil 4-0-58-1 (1w), Hasan 4-0-46-0, Abbas 4-0-51-0 (1w), Aamer 4-0-51-1 (4w),\n\nKARACHI KINGS:\n\nTim Seifert b Salman 26\n\nDavid Warner b Imad 43\n\nJames Vince c Agha b Imad 8\n\nSaad Baig c Shadab b Agha 5\n\nIrfan Khan c Agha b Shadab 14\n\nKhushdil Shah c&b Shadab 1\n\nMohammad Nabi c Haider b Shadab 5\n\nAamer Jamal lbw b Salman 16\n\nHasan Ali b Shadab 0\n\nAbbas Afridi c Ghazi b Salman 34\n\nMir Hamza not out 12\n\nEXTRAS (LB-5, W-3) 8\n\nTOTAL (all out, 18.2 overs) 172\n\nFALL OF WICKETS: 1-56 (Seifert), 2-80 (Vince), 3-85 (Saad), 4-100 (Warner), 5-101 (Khushdil), 6-107 (Nabi), 7-114 (Irfan), 8-114 (Hasan), 9-155 (Abbas)\n\nBOWLING: Dwarshuis 3-0-30-0, Mills 3-0-33-0 (1w), Salman 3.2-0-28-3 (1w), Imad 4-0-22-2 (1w), Shadab 4-0-45-4, Agha 1-0-9-1\n\nRESULT: Islamabad United won by 79 runs.\n\nPLAYER-OF-THE-MATCH: Alex Hales\n\nFinal standings\n\nTabulated under (Teams, matches, wins, losses, NR, points, net run-rate)\n\nGladiators 10 7 2 1 15 1.393\n\nUnited 10 6 4 - 12 0.372\n\nKings 10 6 4 - 12 0.049\n\nQalandars 10 5 4 1 11 1.036\n\nZalmi 10 4 6 - 8 -0.293\n\nSultans 10 1 9 - 2 -2.449\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682ba034398b5.jpg",
  "retrievedAt": "2025-10-12T03:09:34.660Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912054/hbl-psl-2025-all-round-shadab-stars-as-united-rout-kings-to-end-league-stage-on-a-high",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:29:56.000Z"
}
