{
  "title": "Study casts doubt on water flows as cause of streaks on Martian slopes - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Images taken of Mars from orbit dating back as far as the 1970s have captured curious dark streaks running down the sides of cliffs and crater walls that some scientists have construed as possible evidence of flows of liquid water, suggesting that the planet harbors environments suitable for living organisms.\n\nA new study casts doubt on that interpretation. Examining about 500,000 of these sinewy features spotted in satellite images, the researchers concluded they were created probably through dry processes that left the superficial appearance of liquid flows, underscoring the view of Mars as a desert planet currently inhospitable to life — at least on its surface.\n\nThe data indicated that formation of these streaks is driven by the accumulation of fine-grain dust from the Martian atmosphere on sloped terrain that is then knocked down the slopes by triggers such as wind gusts, meteorite impacts and marsquakes.\n\n“The tiny dust particles can create flow-like patterns without liquid. This phenomenon occurs because extremely fine dust can behave similarly to a liquid when disturbed — flowing, branching and creating finger-like patterns as it moves downslope,” said Adomas Valantinas, a postdoctoral researcher in planetary sciences at Brown University and co-leader of the study published on Monday in the journal Nature Communications.\n\n“It’s similar to how dry sand can flow like water when poured. But on Mars, the ultra-fine particles and low gravity enhance these fluid-like properties, creating features that might be mistaken for water flows when they’re actually just dry material in motion,” Valantinas added.\n\nPublished in Dawn, May 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/201016393dc5af2.jpg",
  "retrievedAt": "2025-10-12T03:09:15.386Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912140/study-casts-doubt-on-water-flows-as-cause-of-streaks-on-martian-slopes",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T00:30:29.000Z"
}
