{
  "article_id": "2025-07-30_b38ddc2907552636011ec3de915b3b4e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-launches-tree-plantation-campaign-plant-trees-build-the-nation/",
    "retrieved_at": "2025-08-27T10:23:31.527Z"
  },
  "metadata": {
    "title": "AIOU launches tree plantation campaign âPlant Trees, Build the Nationâ",
    "author": null,
    "date_published": "2025-07-30T08:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP):Allama Iqbal Open University (AIOU) has taken a significant and purposeful step to address environmental pollution and climate change challenges by officially launching the monsoon tree plantation campaign titled aPlant Trees, Build the Nation.a The campaign was inaugurated by the Universityas Vice Chancellor, Professor Dr. Nasir Mahmood who planted a Duchki Ficus tree in the Ladies Park of the universityas residential colony, said a press release on Wednesday. Speaking at the inaugural ceremony, Dr. Nasir Mahmood emphasized that planting trees is not just an environmental activity, it is a commitment to our collective survival, a healthier society and a brighter future. He noted that this is not merely a slogan but a practical movement that will lead us toward a greener and more prosperous Pakistan. The Vice Chancellor reaffirmed the universityas commitment to not only actively participate in the campaign but also to extend it to every student, teacher, and citizen. He appealed to more than 5 million AIOU alumni and 1.2 million currently enrolled students to become environmental ambassadors: to plant a tree and nurture it. Addressing the youth, he urged them to step forward, plant trees, and repay their debt to the motherland. During the event,A Wajeeh-ul-Hassan, Horticulture Officer from the Department of Agricultural Sciences, shared details of the campaign. He informed that in the first phase, 250 trees of 10 different varieties are being planted. These include shade-providing, fruit-bearing, and indigenous species that will not only enhance beauty but also contribute significantly to environmental protection. On this occasion, the universityas Registrar Raja Umar Younis, principal officers and faculty members also planted trees, reaffirming their commitment to a greener Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}