{
  "article_id": "2025-07-30_aae895d1b2c6c65f5be9a681e43377e8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/saying-no-is-her-right-not-a-crime/",
    "retrieved_at": "2025-08-27T10:22:45.381Z"
  },
  "metadata": {
    "title": "Saying “No” is her right, not a crime",
    "author": null,
    "date_published": "2025-07-30T10:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 730,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP):: Islam grants every woman the right to accept or reject a marriage proposal without fear or coercion. The Constitution of Pakistan echoes this freedom under its protections for personal liberty and choice. And yet, across the country, a woman's refusal is too often seen not as autonomy, but defiance, a perceived insult that some men answer with cruelty, violence, or murder. On June 2, 2025, Sana Yousaf was shot twice in the chest by Umar Hayat, a man whose repeated proposals she had declined. In Rawalpindi, 18-year-old Sidra Bibi in a latest incident was allegedly murdered on the orders of a local jirga after marrying a man of her choice. These are not isolated cases. They reflect a dangerous cultural pattern where male ego, unchecked entitlement, and fragile masculinity respond to a woman's \"no\" with rage and revenge. Her right becomes a crime in the eyes of those around her. Maulana Hafiz Muhammad Yasir Attari, a respected Islamic scholar, talking to APP said,\"According to Shariah, a woman has full right to accept or reject a marriage proposal.\" Quoting the Qur'an:\"When you have divorced the wives, and they have reached the end of their waiting periods, then do not prevent them from remarrying their (former) husbands if they agree among themselves in a lawful manner...\" (Surah Al-Baqarah 2:232) The Prophet Muhammad (Peace Be Upon Him) said:\"A widow should not be married until she has been consulted, and a virgin should not be married until her permission has been sought.\" (Sahih Bukhari, 6970) When asked how to seek her permission, he replied: \"That she remains silent.\" This Hadith makes clear: her consent is essential. No guardian (wali), family member, or tribal council has the authority to override her will. \"Rejection is not a sin,\" Maulana Yasir added. \"It is not ingratitude or rebellion. Islam honors personal preferences and emotional compatibility. Saying 'no' is her Islamic right-lawful, protected, and sacred.\" Violence, honour killings, burning, and suffocation are un-Islamic, unjust, and condemned. \"Forgiveness by family does not legitimize murder under Shariah,\" he stated. \"The state must treat such acts as murder and terrorism, and prosecute accordingly.\" The Pakistan Ulema Council, in its July 2025 statement, declared,\"Islam strictly prohibits honour killings. A woman has the full right to marry the man of her choice, and no violence or coercion is allowed.\" Dr. Sobia Khateeb, clinical psychologist and psychosexual therapist, highlighted the other side of the issue and said, \"Rejection-driven violence reflects emotional immaturity and fragile masculinity. Boys are not taught to handle rejection, they equate manhood with control.\" She called for a national shift in emotional education, \"Legal reforms alone won't solve this. We need to raise boys with emotional intelligence and trauma-informed care.\" Rabbiya A. Turkman, journalist and Deputy Editor of Risala Today, pointed to media bias, \"When powerful people are involved, mainstream media goes silent. Gender-based violence is underreported. Thankfully, social media is stepping in to build public pressure and historical records.\" Muhammad Sanaullah Khan, educationist at NUML University Islamabad, believes in the transformative power of classrooms, and suggested,\"Educators must create safe spaces to discuss these issues. Through gender equality, consent education, and empathy, we can challenge deeply rooted stereotypes.\" Bushra Iqbal Hussain, CEO of Mahfooz Bachpan, blamed law enforcement failures \"Police often assume the girl did something wrong. Threats, acid attacks, and character assassination follow. Girls live in fear, not just for themselves, but for their families.\" Hina Mushtaq, a student at COMSATS Islamabad, summed up the generational challenge, \"Whether we speak up depends on our environment. Fear of judgment silences many of us. But campuses that promote equality help students raise their voices.\" This is not just a legal crisis, it is a cultural one. These tragedies reflect a toxic mix of patriarchal entitlement, legal weakness, and silence from those in power. Laws mean little without enforcement. Honour means nothing when it costs lives. From childhood, boys are taught that their desires matter more than a woman's choice. Cultural norms reward male aggression and shame female independence. But Islam says otherwise.\"You are forbidden to inherit women against their will...\" (Surah An-Nisa 4:19) \"Do not kill the soul which Allah has forbidden, except by right...\" (Surah Al-Isra 17:33) Until society upholds a woman's right to say \"no\" as strongly as Islam and the Constitution do, women will continue to pay with their lives for choosing freedom over fear.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}