{
  "article_id": "2025-07-30_d40e3da0fff62a4e6a980574c74d7587",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-cabinet-approves-landmark-green-building-code-of-pakistan/",
    "retrieved_at": "2025-08-27T10:21:46.540Z"
  },
  "metadata": {
    "title": "Federal cabinet approves landmark Green Building Code of Pakistan",
    "author": null,
    "date_published": "2025-07-30T14:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 257,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP): Federal Cabinet has approved the Green Building Code of Pakistan, and the Rainwater Harvesting Provisions for Building Code of Pakistan. These new national standards will ensure green, energy-efficient and water-conserving buildings. Prime Minister Shehbaz Sharif's vision for environmental preservation, cleaner air for citizens and energy efficiency is the main force behind this wonderful development, aligning with the United Nations Sustainable Development Goals (SDGs). Federal Minister for Science and Technology, Khalid Hussain Magsi, and Federal Secretary, Sajid Baloch, spearheaded the development of these codes, under Prime Minister's vision, through extensive consultations with provinces, federal ministries and other relevant stakeholders and developed consensus. The Green Building Code applies to all new buildings, with four plus floors, emphasizing energy conservation, solar design, green roofs, energy efficient lighting, and integration of renewable energy sources etc. It mandates the use of eco-friendly materials and Building Information Modeling (BIM) for efficient building management, significantly reducing energy consumption and enhancing indoor environmental quality. The Rainwater Harvesting Code applies to residential, commercial and industrial buildings, mandating systems to collect, filter, and reuse rainwater. This initiative aims to address Pakistan's escalating water scarcity by promoting groundwater recharge and reducing dependency on municipal water supplies. The codes have been approved as Pakistan Engineering Council (PEC) Bye-Laws and align with the United Nations Sustainable Development Goals (SDGs). These codes mark a pivotal move toward sustainable, climate-resilient infrastructure actions will be greatly beneficial for a greener, energy efficient and more climate-resilient Pakistan, improving better quality of life for Pakistanis citizens as well as the planet.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}