{
  "article_id": "2025-07-30_813e4eb25551bcb17abf726025504de1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/md-ppra-vows-accelerated-regulatory-reforms-innovation-agenda/",
    "retrieved_at": "2025-08-27T10:20:53.982Z"
  },
  "metadata": {
    "title": "MD PPRA vows accelerated regulatory reforms, innovation agenda",
    "author": null,
    "date_published": "2025-07-30T15:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 470,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP): Managing Director, Public Procurement Regulatory Authority (PPRA) Hasnat Ahmed Qureshi vowed to fast-track transformation process, with a focus on regulatory reforms, institutional development, optimization, and the rollout of a digital procurement system.He expressed his commitment while meeting with a World Bank delegation led by Regional Procurement Manager for the Middle East, North Africa, Afghanistan, and Pakistan (MENAAP) Region, Majed El-Bayya. He highlighted that in line with the directives of the Prime Minister and Federal Cabinet, PPRA has implemented major reforms in its regulatory framework by finalizing amendments to the PPRA Ordinance 2002 and drafting a new set of Public Procurement Rules 2025, developed through a series of nationwide consultations with procuring agencies, suppliers, legal experts, and international consultants.He informed that the new set of rules focuses on independent grievance redressal mechanisms, third-party interventions, defined roles for procurement cells and officers of procuring agencies and enforcement measures such as blacklisting and alternate dispute resolution. \"We are building a regulatory and digital ecosystem that ensures transparency without compromising efficiency,\" the Managing Director said, adding that the Authority is adopting international best practices into Pakistan's procurement system. Highlighting digital transformation as a key component of the reform agenda, Qureshi informed that the PPRA e-procurement platform EPADS is now used by over 8,480 procuring agencies across federal and provincial governments, with 34,500 vendors registered and more than 522,000 contracts amounting to Rs. 1308 billion awarded in the last fiscal year. The platform has been expanded with new modules such as e-Submission, e-Disposal, dashboards for NAB and the Competition Commission of Pakistan, NADRA integration for bio-verification, and a dedicated public access interface. PPRA has also launched a new website and operationalized the EPADS helpdesk from 8:30 am to 11:30 pm on working days. He further told that the expansion of EPADS is underway, with its launch planned in Azad Jammu and Kashmir and Gilgit Baltistan by the end of 2025, and the introduction of new features to automate the payment system and integrate AI modules in the monitoring mechanism. Qureshi apprised that PPRA has implemented organizational restructuring by hiring specialists and experts, strengthening technical capacity in line with its expanded mandate. On the capacity-building initiative, PPRA has trained over 1,600 officials and vendors through 46 training sessions on the regulatory framework and EPADS over the last year in collaboration with top academic institutions. The Authority is also engaged with international partners, including the World Bank, Asian Development Bank, and UNDP, to develop standardized training modules, online learning platforms, and accreditation systems for procurement professionals. The World Bank team appreciated PPRA's commitment to procurement reforms and reaffirmed its support in key policy areas, implementation of the digital procurement system, and capacity-building initiatives. The delegation acknowledged the progress made and assured continued technical assistance in line with international standards and procurement governance benchmarks.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}