{
  "article_id": "2025-07-30_8bd83456f47265006fb56bac6a53e6c2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/security-experts-term-modis-speech-a-failed-attempt-to-cover-up-operation-sindoors-humiliation/",
    "retrieved_at": "2025-08-27T10:22:30.686Z"
  },
  "metadata": {
    "title": "Security experts term Modi’s speech a failed attempt to cover up Operation Sindoor’s humiliation",
    "author": null,
    "date_published": "2025-07-30T11:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 377,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP): Security experts have termed Modi's speech in the Lok Sabha a failed attempt to cover up the humiliation of Operation Sindoor. In the Indian Lok Sabha, Prime Minister Narendra Modi refused to accept the real outcome of Operation Sindoor, despite repeated confirmations by U.S. President Donald Trump and the international media, they remarked. The security experts said that in response to Indian aggression, Pakistan's Operation Bunyan al-Marsus shattered Modi's war hysteria. India's declaration of a ceasefire by Colonel Sophia further exposed Modi's false claims in the Lok Sabha, they said. They said even Indian Wing Commander Vyomika Singh also admitted the destruction of Udhampur, Adampur, Bhuj, and Pathankot airbases. Pakistan's effective counteraction in Operation Sindoor forced Modi to back down,\" they said. U.S. leading newspapers The Washington Post and The New York Times also reported that Pakistan effectively responded to Indian aggression and shot down Indian warplanes within Indian airspace. BBC's regional editor Amberson Ather John also acknowledged Pakistan's defense superiority, the security experts said. \"India spent billions of dollars on arms but still faced defeat,\" said Amberson Ather John. According to international media CNN, the U.S. President mediated a ceasefire between the two countries. The U.S. President admitted to intervening over 29 times to de-escalate Indo-Pak tensions and prevent a nuclear war in the region. Despite global humiliation, Modi's war-mongering continues to jeopardize regional peace, they security experts remarked. During the ongoing Lok Sabha session on Operation Sindoor, Narendra Modi claimed, \"No global leader asked India to stop the operation except U.S. Vice President who tried to contact me three to four times on May 9 night\". \"The U.S. Vice President warned that Pakistan can launch a major attack,\" said Modi. \"If Pakistan attacks India, our response will be much greater,\" he claimed to have told the U.S. Vice President. Modi made false claimed that India destroyed Pakistan's power during the nights of May 9 and May 10. \"Pakistan now realizes that every Indian response is far more unpredictable than before,\" he further claimed. \"If needed again, India can go to any extent to respond to Pakistan,\" Modi told Lok Sabha. He threatened, \"Operation Sindoor is still going on and if Pakistan repeats such a mistake, it will get a crushing response.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}