{
  "article_id": "2025-07-30_2c854cc0256652266ef8cdb522896581",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/coas-reaffirms-pak-armys-unwavering-commitment-to-uproot-menace-of-terrorism/",
    "retrieved_at": "2025-08-27T10:23:29.348Z"
  },
  "metadata": {
    "title": "COAS reaffirms Pak Army’s unwavering commitment to uproot menace of terrorism",
    "author": null,
    "date_published": "2025-07-30T05:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 269,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jul 30 (APP): Chief of Army Staff (COAS) Field Marshal Syed Asim Munir, NI (M) has reaffirmed Pakistan Army's unwavering commitment to uproot the menace of terrorism and inevitability of sociology-economic uplift of Balochistan for national cohesion and integration. Interacting with participants of the 16th National Workshop Balochistan and addressing a diverse group of stakeholders including parliamentarians, representatives of civil society, civil servants, academicians, media personnel and youth, the COAS vehemently condemned India's blatant sponsorship of terror proxies, characterizing them as a failed attempt to target the deep rooted patriotism of the people of Balochistan. He elucidated that India, having suffered defeat in Ma'arka e Haq has now escalated its proxy war to advance her nefarious designs, specifically referencing to Fitna-al-Khawarij and Fitna-al-Hindustan as pawns of Indian hybrid war against Pakistan, said a news release issued by Inter Services Public Relations (ISPR) here Wednesday. The COAS said that these proxies will face a similar fate and humiliation as faced in Ma'arka e Haq, InshaAllah. Field Marshal Asim Munir emphasised that terrorists knew no bounds of religion, sect, or ethnicity, necessitating a unified national response, stressing the imperative of collective resolve in confronting this menace. The COAS highlighted the pivotal role of development initiatives in Balochistan, advocating for enhanced inter-agency cooperation and a cohesive national approach to propel provincial progress and national advancement. While reaffirming Pakistan's commitment to regional peace, the COAS underscored the nation's preparedness to respond decisively to any external or internal threats, protecting national prestige and ensuring the wellbeing of its citizens. The session concluded after a candid interactive discourse between the participants and the COAS.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}