{
  "article_id": "2025-07-30_b61cc7a1e9e01ff6dab51828ae0876f5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-approves-major-reforms-in-hajj-operations-national-ai-policy-2025/",
    "retrieved_at": "2025-08-27T10:21:06.163Z"
  },
  "metadata": {
    "title": "PM Shehbaz approves major reforms in Hajj Operations, National AI Policy 2025",
    "author": null,
    "date_published": "2025-07-30T15:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 466,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 30 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday marked major reforms after key decisions in two strategic areas including the approval of the Hajj Policy 2026 and the National Artificial Intelligence (AI) Policy 2025. The prime minister chaired a pivotal meeting of the Federal Cabinet here, and directed complete digitization of the Hajj operation beginning in 2026, ensuring transparency, efficiency, and world-class services for pilgrims. He emphasized that no compromise will be tolerated in providing top-tier facilities to Pakistani pilgrims. \"Ensuring comfort, transparency, and timely support for every pilgrim is our foremost duty,\" said the prime minister. The new Hajj policy allocates 70 per cent quota to the government and 30 per cent to private operators. Notably, private companies that failed to fulfill their responsibilities in the previous year will now be required to accommodate affected individuals in 2026. Moreover, the Federal Cabinet approved third-party validation for all Hajj operations, real-time monitoring of payments and application processes under private operators, mandatory minimum of 2,000 pilgrims per private company, 1,000 seats reserved for hardship cases, enhanced digital tools including Pak Hajj mobile app, digital wristbands, and mobile SIMs for better tracking and service delivery, transparent selection of assistants through competitive testing, emergency compensation mechanisms and upgraded lodging and food arrangements. The Prime Minister also directed the Ministry of Information Technology to collaborate with the Ministry of Religious Affairs to ensure seamless digital transformation of the entire Hajj process. In another major development, the Federal Cabinet unanimously approved the National AI Policy 2025, designed to create a complete AI ecosystem in Pakistan. The policy aims to democratize access to artificial intelligence, enhance public services, and open up new employment and innovation avenues. \"Our youth are Pakistan's greatest asset. Providing them with education, skills, and equal opportunities in AI is a top priority,\" stated PM Shehbaz Sharif. The AI policy outlines training 1 million AI professionals by 2030, establishing an AI Innovation Fund and AI Venture Fund to boost private sector involvement, creation of 50,000 AI-driven civic projects and 1,000 local AI products in the next five years, distribution of 3,000 annual AI scholarships and facilitation of 1,000 research projects, inclusion of women and differently-abled individuals through accessible education and financing, strengthening cybersecurity and national data security protocols, promoting global partnerships and compliance with international AI regulations. However, an AI Council and a comprehensive Master Plan & Action Matrix will oversee the policy's implementation. The prime minister applauded the Ministry of IT and allied institutions for their timely efforts, saying, \"AI will not only modernize our economy but also enhance productivity across agriculture, public services, and governance.\" The Cabinet also ratified decisions made in earlier sessions of the Cabinet Committee on Privatization and the Committee on Legislative Business held on July 8, 17, and 25, respectively.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}