{
  "title": "Hajj 2025 to cost upto Rs 1.2mln: Salik",
  "link": "https://www.app.com.pk/national/hajj-2025-to-cost-upto-rs-1-2mln-salik/",
  "date_published": "2024-11-11T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): Minister for Religious Affairs and Interfaith Harmony, and Overseas Pakistanis and Human Resource Development Chaudhry Salik Hussain on Monday said the next year Hajj would cost upto Rs 1.2 million under the Government’s Hajj Scheme 2025.\nAnnouncing the Hajj Policy 2025, the minister said the Hajj is expected to range between Rs 1,075,000 and Rs1,175,000, with an additional amount of Rs 55,000 for the cost of the sacrificial offering.\nRegarding pilgrim accommodations, the minister stated that applicants selecting double-bed and triple-bed options in Makkah will be required to make additional deposits of Rs 220,000 and Rs 75,000, respectively.\nHe said the pilgrims would get an opportunity to pay for Hajj in installments under the Hajj Scheme 2025.\nThe first installment of Hajj dues, amounting to Rs 200,000, must be deposited along with the Hajj application, he said, adding the second installment of Rs 400,000 must be submitted within ten days of the balloting. The remaining amount must be deposited by February 10 next year.\nChaudhry Salik Hussain stated that no deductions will be made if an application is withdrawn before the final submission date. However, if the first installment is refunded after the balloting, a deduction of Rs 50,000 will apply. A deduction of\nRs 200,000 will be imposed if the third installment is not paid.\nThe minister clarified that no refunds will be issued for the remaining amount after February 10 of next year. However, in the event of the applicant’s death, the aforementioned deductions will not be applied.\nSalik said that a total of 179,210 Pakistanis will perform Hajj in 2025, with 89,605 seats allocated to both the government and private Hajj schemes, maintaining a 50:50 quota distribution.\nHe added that 5,000 seats will be reserved for the sponsorship scheme under the government Hajj Scheme, while 30,000 seats will be allocated to private Hajj Group Organizers for sponsorship. Furthermore, he emphasized that participation in the sponsorship scheme requires sending foreign exchange through official banking channels.\nChaudhry Salik Hussain clarified that the government sponsorship scheme will be conducted on a ‘first come, first served’ basis and will not be subject to balloting. He also stated that the foreign exchange collected through the sponsorship scheme will be exclusively used for Hajj-related expenses in Saudi Arabia.\nThe minister further explained that under the Government Hajj Scheme, the traditional long stay will last between 38 to 42 days, while the short stay will be from 20 to 25 days.\nHe also mentioned that, according to Saudi regulations, each organized private Hajj group must include at least 2,000 pilgrims. One major reason is that, generally, groups used to take only 10, 20, or 100 people, leading to difficulties in securing accommodation upon arrival. He explained that having a group of 2,000 will ensure better allocation of places.\nIn accordance with Saudi regulations, children under the age of 12 will not be allowed to accompany pilgrims due to various reasons, primarily the challenges posed by the extreme heat during Hajj and other associated difficulties.\nThe minister also highlighted some important changes, including an increase in compensation for pilgrims. If a pilgrim passes away during Hajj, the compensation has been raised from Rs 1 million to Rs 2 million. Additionally, compensation for serious injuries has been increased to Rs 1 million.\nIn response to another question, the minister noted that pilgrims from Europe and Canada typically pay around 20,000 dollars for their Hajj journey.\nRegarding Pakistani expatriates, he assured that efforts are being made to ensure that the quota allocated for those departing from Pakistan is not wasted and is instead included in the general quota. Discussions are currently underway with the Saudi government, as this quota had been surrendered last year.\nThe Federal Secretary for Religious Affairs and other officials from the Ministry were also present at the event.",
  "retrievedAt": "2025-08-10T15:12:31.208Z"
}
