{
  "title": "YPF delegation visits AJK, briefed on Kashmir issue",
  "link": "https://www.app.com.pk/national/ypf-delegation-visits-ajk-briefed-on-kashmir-issue/",
  "date_published": "2024-11-11T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):A delegation of the Young Parliamentarians Forum (YPF) arrived in Muzaffarabad on Monday for a one-day visit to the Azad Jammu and Kashmir (AJK) Legislative Assembly, where they were briefed in detail on the Kashmir issue and other important matters.\nThe delegation, chaired by Syeda Nosheen Iftikhar, President of the YPF and Member of the National Assembly (MNA), was accompanied by Parliamentary Secretary Barrister Daniyal Chaudhry, and MNAs Abdul Qadir Gilani, Raja Osama Ashfaq, Kiran Dar, and Dr Shaista Jadoon, according to a press release.\nDuring their visit, they toured the Azad Jammu and Kashmir Legislative Assembly, where they met with Speaker Chaudhry Latif Akbar and young parliamentarians from the region.\nThe delegation visited the Legislative Assembly, where they were received by Speaker Chaudhry Latif Akbar and met with young parliamentarians of Azad Kashmir.\nDuring the meeting, Speaker Akbar emphasized Pakistan’s continued support for the Kashmiris’ right to self-determination and urged young parliamentarians to raise the Kashmir issue on every forum, including the National Assembly.\nSpeaker of the Assembly, Chaudhry Latif Akbar, expressed gratitude, stating that every government of Pakistan has consistently supported the Kashmiris’ right to self-determination in good faith.\nOn this occasion, the delegation was briefed on the history of the AJK Legislative Assembly, its seats, and constitutional amendments.\nThey were also informed about the ongoing human rights violations in Indian-administered Kashmir, the geographical situation of Azad Kashmir, employment opportunities, and other pressing issues facing the region.\nFederal Parliamentary Secretary for Information and Broadcasting, Barrister Daniyal Chaudhry, highlighted the purpose of the visit as a means to promote bilateral cooperation.\nDaniyal Chaudhry emphasized the deep, natural connection between Pakistan and Kashmir, stating that strengthening inter-parliamentary coordination would be crucial for advancing their shared interests.\nHe also underscored the need for mutual collaboration in areas such as legislation,” said Barrister Daniyal Chaudhry.\nDuring the visit, the YPF delegation invited young parliamentarians from Azad Kashmir to visit the National Assembly in Islamabad for future engagements.\nThe visit aimed to foster greater cooperation between Pakistan’s and Azad Kashmir’s legislative bodies, with an emphasis on promoting the Kashmir cause and addressing the region’s challenges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:12:25.581Z"
}
