{
  "title": "Exhibition ‘The Magic of Pastels’ opens at PNCA",
  "link": "https://www.app.com.pk/national/exhibition-the-magic-of-pastels-opens-at-pnca/",
  "date_published": "2024-11-11T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):A solo exhibition titled “The magic of Pastels” by acclaimed contemporary artist, Naveed Khan opened at National Art Gallery, Pakistan National Council of the Arts (PNCA) on Monday.\nOperational Manager, Creative Wing, Pakistan National History Museum, Rahat Saeed  inaugurated the exhibition.\nRahat Saeed is a senior artist, a graphic designer and has been exploring a variety of mediums in his paintings for many years.\nIn his remarks, Rahat Saeed, praised Naveed’s contributions to Pakistan’s art landscape and said, “Mr. Naveed Khan’s dedication to the pastel medium is a testament to his vision and artistic spirit. His work not only showcases technical expertise but also offers a profound connection to the diverse beauty of our world”.\nHe continued, “This exhibition is an inspiration, expanding the potential of pastel art in Pakistan and encouraging future generations to explore this versatile medium.”\nThe Magic of Pastels celebrates Khan’s twenty-year journey with pastels, presenting an impressive array of portraits, figures, birds, and landscapes.\nKnown for his distinctive style, Khan explores a range of genres, from hyper-abstraction to realism, with a focus on light, shadow, and intricate textures. This exhibition aims to challenge traditional perceptions of pastel art, presenting it as a major fine art medium in Pakistan.\nNaveed Khan’s distinguished career spans over 15 years, during which he has excelled as an artist, educator, critic, and curator.\nHe has exhibited in nearly 70 national and international exhibitions, including seven solo shows, and has earned over fifty national and international awards, including the National Award 2009 from the Government of Pakistan.\nTo further celebrate pastels as a fine art form, PNCA will also be organizing a Pastels Workshop on November 12.\nThis workshop, led by Khan himself offers an opportunity for both aspiring and established artists to explore pastel techniques and experiment with the medium under his guidance.\nThe Magic of Pastels will be on display until November 17, 2024. The exhibition is open to the public daily from 10 am to 04 pm except Saturdays.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:13:14.732Z"
}
