{
  "title": "ISSI hosts seminar on “Understanding Complexities of Jammu and Kashmir Dispute”",
  "link": "https://www.app.com.pk/national/issi-hosts-seminar-on-understanding-complexities-of-jammu-and-kashmir-dispute/",
  "date_published": "2024-11-11T14:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):The India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with the National University of Modern Languages (NUML), hosted a seminar titled “Understanding Complexities of Jammu and Kashmir Dispute,” highlighting key perspectives on the legal, historical, and humanitarian aspects of the Jammu and Kashmir dispute.\nThe seminar was attended by academicians, practitioners, researchers and students, said a press release. Ambassador Sohail Mahmood, Director General ISSI, in his keynote address, emphasized Pakistan’s steadfast solidarity with the people of Kashmir and reaffirmed the nation’s commitment to a just and lasting solution.\nIn his remarks, Ambassador Sohail Mahmood reiterated that Kashmir remains an unfinished part of the partition, a legally and morally valid cause recognized by the international community. He outlined three essential factors to guide Pakistan’s approach: a realistic assessment of objective conditions, Pakistan’s firm national resolve, and enhanced outreach to the international community.\nHe further noted that Kashmir is the oldest unresolved dispute on the UN Security Council agenda, underpinned by numerous resolutions that call for self-determination for the people of Jammu and Kashmir through a free and impartial plebiscite.\nAmbassador Sohail Mahmood deplored India’s attempts to alter the demographic structure and internationally recognized disputed status of Jammu and Kashmir, characterising these actions as violations of UN resolutions and the 4th Geneva Convention.\nHe highlighted that Pakistan is within its rights to address the issue both bilaterally and internationally. He further added that the UN’s continued engagement indicates that Kashmir is not an ‘internal matter’ for India. Pakistan’s diplomatic efforts, supported by the OIC, have successfully kept the issue on the global agenda, reinforcing the Kashmiri struggle, refuting India’s false narratives, and countering India’s repressive measures.\nHe proposed a multifaceted strategy for Pakistan that includes internal consolidation, a whole-of-the-nation approach, strategic patience, and proactive diplomacy.\nAmbassador Mahmood underscored that Pakistan’s anticipated role as a non-permanent UN Security Council member will allow it to further advocate for a peaceful resolution of the Jammu and Kashmir dispute. He particularly emphasized the role of civil society, academia, and the youth in promoting this just cause.\nDr. Khurram Abbas, Director of ISC, presented a critical analysis of India’s historical claims to Kashmir.\nHe challenged the legitimacy of India’s accession narrative, citing discrepancies and gaps in records, including the views of historians like Alastair Lamb and British records, which raise doubts about the authenticity of India’s claims. Dr. Khurram stressed upon the significance of Pakistan’s dealing with international partners in resolving the Jammu and Kashmir dispute.\nMs. Naila Kiyani spoke on the severe repression faced by Kashmiris under new laws that strip their rights and special status.\nShe described the widespread human rights abuses, including mass detentions, forced resettlements, and freedom of speech restrictions under laws like UAPA, PSA, and AFSPA. Ms. Kiyani called for stronger resistance through research, advocacy, and an emphasis on youth involvement in advancing the Kashmiri struggle.\nShiraz Hassan, Lecturer at NUML, presented an analysis of the Modi government’s strategy, characterizing it as an attempt to suppress Kashmiris’ voices under the guise of economic development. He urged active engagement with U.S. policymakers and diaspora communities to counteract India’s narrative and garner international support.\nMs. Tabinda Asghar, Lecturer at NUML, focused on the UN’s role in the Kashmir issue, questioning the organization’s effectiveness in addressing human rights violations.\nShe pointed to the precedent set by the International Court of Justice (ICJ) in the Namibia case, where the right to self-determination was upheld.\nMs. Asghar argued that UN resolutions on Kashmir hold legal, political, and moral significance, even as major powers may attempt to leverage the platform for their agendas.\nDr. Sajid Iqbal Khattak, Assistant Professor at NUML, highlighted possible future scenarios for the Kashmir dispute. He noted that India might seek to claim Azad Jammu and Kashmir based on developmental disparities, while also suggesting that Pakistan’s nuclear deterrence and diplomatic initiatives have helped preserve the issue’s relevance.\nDr. Khattak recommended a strategic shift towards action-oriented advocacy, regional partnerships, and prioritizing stability at home.\nDrawing from the Azerbaijan model, he advocated for readiness and strategic initiatives that could support Kashmir’s cause effectively.\nFollowing an extensive Q/A session, the seminar concluded with remarks from Dr. Sarwat Rauf, HoD of the Department of International Relations, and Chairman of the ISSI Board of Governors, Ambassador Khalid Mahmood, who reiterated Pakistan’s unwavering support for the people of Jammu and Kashmir until a just solution is achieved.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:12:49.124Z"
}
