{
  "title": "ICT admin steps up anti-smog measures; bans smok-emitting materials",
  "link": "https://www.app.com.pk/national/ict-admin-steps-up-anti-smog-measures-bans-smok-emitting-materials/",
  "date_published": "2024-11-11T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):To tackle the rising air pollution and smog levels in Federal Capital, the Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon held a meeting with Assistant Commissioners, the Islamabad Transport Authority (ITA), and the Excise Department, outlining strict steps to curb harmful emissions across the city.\nIn the meeting, the district administration has introduced new restrictions to control smog.\nThey decided that the all brick kilns in Islamabad Capital Territory will remain closed until further notice, while, factories that emit smoke will be temporarily shut down to help reduce smog levels. Meanwhile, the smoke-emitting vehicles will be banned from the roads in Islamabad Capital Territory.\nFurthermore, the burning of garbage, leaves, or any other materials outdoors is prohibited and activities that harm the environment will face restrictions. On the other side, the Islamabad Transport Authority (ITA) has been conducting regular inspections to enforce these measures.\nDuring a recent inspection led by the ITA Secretary, several vehicles at the vegetable market were checked for emissions.\nIn this inspection, nine vehicles were penalized for excessive smoke emissions, while warning letters were issued to 27 others. Daily operations are now in place to monitor vehicles across the city, ensuring adherence to emission standards.\nDC, Irfan Memon stated that these measures are being implemented as a preventive step to control the city’s air pollution levels before they escalate into severe smog conditions. The initiative aims to create a cleaner, healthier environment for residents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:13:18.719Z"
}
