{
  "title": "Humayun Khan vows support for Timergara Medical College’s development",
  "link": "https://www.app.com.pk/national/humayun-khan-vows-support-for-timergara-medical-colleges-development/",
  "date_published": "2024-11-11T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):Humayun Khan, Special Assistant to the Chief Minister for Prisons, on Monday visited Timergara Medical College.\nHumayun Khan, accompanied by Provincial Assembly members Azam Khan, Obaid-ur-Rehman, Tehsil Chairman Feroz Shah, Ashfaq-ur-Rehman, and Shakir Shoaib, attended a detailed briefing by Principal Professor Dr. Sami Ullah on the college’s current status and future plans, said a press release here.\nHumayun Khan, along with other elected representatives, conducted a thorough inspection of various departments at the college.\nSpecial Assistant assured the administration of full support to facilitate the commencement of classes later this year, emphasizing that efforts would be made to bring the college and the Timergara Teaching Hospital up to the standards set by the Pakistan Medical and Dental Council (PMDC) and Khyber Medical University (KMU).\nTalking to media, Humayun Khan described Timergara Medical College as a revolutionary project for Lower Dir, Upper Dir, Chitral, and Bajaur.\nHe expressed his commitment to putting all necessary efforts into completing the project and ensuring that classes are launched within the current year.\nKhan added that the launch of classes at the college was a top priority for him and the chief minister, who would work closely with the college administration to make this goal a reality.\nHumayun Khan also highlighted Chief Minister of Khyber Pakhtunkhwa Ali Amin Khan Gandapur’s commitment to providing services to the public at their doorstep.\nThe establishment of the Timergara Medical College, Humayun Khan noted, would not only facilitate students by offering them local opportunities for medical education, but it would also significantly strengthen the healthcare sector in the region.\nThis initiative, Khan stressed, was in line with Ali Amin Khan Gandapur’s broader vision to improve both education and health services in Khyber Pakhtunkhwa, especially in remote areas.\nThe visit underscored the strong collaboration between the provincial government and local representatives to improve infrastructure and services for the people of the region, with a particular focus on healthcare and education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:12:50.051Z"
}
