{
  "title": "PTI leader Salman Akram Raja denies backdoor dealings with ‘establishment’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Salman Akram says Azam Swati issuing statements in his personal capacity\n• Arif Alvi says Imran prefers talks over street protests\n• Court extends pre-arrest bail of ex-PM’s sisters, PTI leaders\n\nLAHORE: Expressing his ignorance of any “deal talks” with the powers that be, PTI Secretary General Salman Akram Raja asserted on Saturday that the party leadership was focused not on political rhetoric, but on upholding principles and due process.\n\nSpeaking to the media outside the anti-terrorism courts in Lahore, Mr Raja said that a meeting of the party’s core committee would be convened soon, during which key matters would be addressed.\n\nDismissing rumours about ongoing ‘negotiations’ with the establishment, he said he had no knowledge of any such “deal” and emphasised that nothing of the sort was taking place.\n\nHe clarified that PTI leader Azam Khan Swati was issuing statements in his personal capacity, and there was no such activity being undertaken by the party. “If anyone thinks they can sneak out of this through a backdoor, they are mistaken.”\n\nMr Raja alleged that meetings with Imran Khan were being deliberately obstructed in order to create ambiguity, stressing that a final decision would only be made after a meeting with the incarcerated PTI founder.\n\nHe reiterated that the situation would become clear once a meeting was held with Imran Khan in jail. “Only after meeting Imran Khan, we will know whether he has authorised anyone to hold negotiations or not.”\n\nIt is worth mentioning that Azam Swati recently claimed that Imran Khan remained open to negotiations, and any such talks with the establishment would take place only with the PTI founder’s approval.\n\n‘Imran prioritises talks’\n\nMeanwhile, former president and PTI leader Dr Arif Alvi, currently in the United States meeting with party supporters, said Imran Khan has always prioritised negotiations over street agitation, which he warned could lead to greater problems for Pakistan.\n\nIn an interview with CNN, Mr Alvi said his party would welcome the initiation of negotiations regarding future elections and the restoration of democracy.\n\nHe highlighted that Imran Khan has been imprisoned for over 600 days and is being deliberately kept out of public view — his face is not allowed on television, nor can his name be mentioned on TV channels. “He’s being tried in prison because if he comes out, the people will rally around him. So no face, no voice, no image can be shown.”\n\nMr Alvi said, “We are saying that peaceful protesters should not be killed. We are saying that social media should be opened up, because there is no other media in Pakistan today. And if that happens, the change will happen very quickly in Pakistan.”\n\nHe claimed that the last general elections were rigged. According to him, the PTI had won the elections in Balochistan, but the party was denied its mandate. “Had they not been deprived of the vote, the government in Balochistan would have been of PTI, and we would have had governments in all the provinces.”\n\nMr Alvi added that if the youth who were elected in Balochistan had been allowed to represent their mandate, it would have amplified a federal voice, thereby preventing extremist elements from exploiting the situation. “When vote has no force, when vote is not reflected in government decisions, when vote is not reflected in parliament, then it gives a message to the youth that your votes and your opinion do not matter,” he noted.\n\nHe warned that such disenfranchisement could push some misguided youth towards militancy. “We still believe there is a possibility of negotiating. But out of that frustration — particularly in Balo­chistan — terrorism is on the rise,” he said.\n\nMr Alvi also pointed out that protests were ongoing in Islamabad and across the country, yet demonstrators were being suppressed through brute force. “So the frustration is increasing,” he concluded.\n\nBail extended\n\nEarlier, an antiterrorism court extended pre-arrest bail of PTI founding chairman’s two sisters and Salman Akram Raja, along with other leaders, till May 17 in cases related to the Oct 5 attacks and vandalism incidents.\n\nMr Raja and other PTI leaders appea­red before the court upon the expiry of their bail period. However, Imran Khan’s sisters — Aleema Khan and Uzma Khan — were absent from the proceedings.\n\nTheir lawyers submitted an application seeking exemption from personal appearance for one hearing, stating that both were scheduled to meet their brother in Adiala Jail, Rawalpindi.\n\nThe court accepted the exemption request for Saturday’s hearing.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:10:57.867Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903877/pti-leader-salman-akram-raja-denies-backdoor-dealings-with-establishment",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:20:40.000Z"
}
