{
  "title": "Bill threatens KP’s control over mines, minerals: Jamaat-i-Islami - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT: Former provincial minister and Jamaat-i-Islami leader Inayatullah Khan on Saturday flayed the Mines and Minerals Bill, saying the proposed legislation is meant to take away the province’s control over its own natural resources and grant “too much powers to the federal government and even countries like the United States.”\n\n“This proposed law [on mines and minerals] is an attack on our province’s autonomy. It is about handing over our resources to the centre and serving foreign interests, so it’s totally unacceptable,” Mr Khan told a function at Al-Markaz Islami in Sangota area here.\n\nHe later attended the “Meet the Press” session and announced his party would resist any legislation that went against the spirit of the 18th Constitutional Amendment.\n\n“We will oppose any move that undermines the rights of our province,” he said.\n\nInayatullah says his party will resist proposed law\n\nMr Khan said that thousands of people from across Malakand Division would take part in a large rally on April 20 to show solidarity with Palestinians.\n\n“People from the Malakand region will raise their voices for the cause of Palestine,” he said, adding that Pakistanis stood with their oppressed Palestinian brothers and sisters.\n\nThe JI leader criticised the provincial government for “institutionalising corruption.”\n\n“It’s not just us saying this, their own party [PTI’s] leaders are also speaking out against massive corruption,” he said.\n\nThe participants also approved several resolutions on the “deteriorating security situation” in the province, including Swat, and urged provincial and federal authorities as well as security agencies to take immediate steps to restore peace.\n\n“The worsening law and order situation cannot be ignored any longer,” said a speaker.\n\nThe participants also complained about the “growing illegaldrug trade,” especially the sale and use of crystal meth, in Mingora and surrounding areas, and alleged that some government functionaries were protecting culprits.\n\n“Narcotics are destroying our youth, and it’s happening with official support,” a participant alleged.\n\nThe participants demanded strict action against those responsible for the illegal drug trade.\n\nLand rights and displacement also came under discussion, with attendees condemning the misuse of legal tools like sections 4 and 17, and moves to evict residents from their lands.\n\nA speaker said that locals had been displaced in the name of development. “This land-grabbing must stop,” he said.\n\nThe participants also rejected the establishment of cantonment boards and said the initiative was meant to seize thousands of kanals of land.\n\nThey declared support for the Swat Motorway project and insisted that the highway should be built along the Swat River instead of through agricultural lands.\n\n“We welcome development, but it should not happen at the cost of our farmlands and homes,” said a speaker.\n\nThe attendees also raised environmental issues and criticised the illegal extraction of sand and gravel from the Swat River and nearby streams.\n\nThey accused certain groups and government officials of exploiting natural resources and collecting illegal tolls.\n\n“Our rivers are being looted in broad daylight,” a speaker said.\n\nThe participants urged the district administration to act to protect the area’s natural beauty. The event ended with a united call for “justice, transparency and protection of Swat’s natural, cultural and economic heritage.”\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/13124612d49e8cf.jpg",
  "retrievedAt": "2025-08-25T14:10:37.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903827/bill-threatens-kps-control-over-mines-minerals-jamaat-i-islami",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:47:18.000Z"
}
