{
  "title": "Ukraine says 32 killed by Russian ballistic missile strike on Sumy - World - DAWN.COM",
  "author": null,
  "content": "Thirty-two people were killed and over 80 others wounded by two Russian ballistic missiles that slammed into the heart of the northern Ukrainian city of Sumy on Sunday morning, Ukrainian officials said.\n\nUkrainian President Volodymyr Zelensky condemned the attack — one of the deadliest strikes on Ukraine this year — and called for a tough international reaction against Moscow.\n\n“Only scoundrels can act like this. Taking the lives of ordinary people,” Zelensky wrote on social media, alongside a chilling video which showed corpses on the ground, a destroyed bus and burnt-out cars in the middle of a city street.\n\n“And this is on a day when people go to church: Palm Sunday, the feast of the Lord’s Entry into Jerusalem,” he said.\n\nInterior minister Ihor Klymenko said the victims were on the street, in vehicles, on public transport and in buildings when the strike hit.\n\n“Deliberate destruction of civilians on an important church feast day,” he wrote. Andriy Yermak, Zelensky’s chief of staff, said the missiles contained cluster munitions. “The Russians are doing this to kill as many civilians as possible,” he said.\n\nReuters was seeking comment from Russian authorities.\n\nAndriy Kovalenko, a security official who runs Ukraine’s Centre for Countering Disinformation, noted that the strike came after a visit to Moscow by US envoy Steve Witkoff.\n\n“Russia is building all this so-called diplomacy … around strikes on civilians,” he wrote on Telegram.\n\nWitkoff, US President Donald Trump’s special envoy for Ukraine, held talks with Russian President Vladimir Putin on Friday in St Petersburg on the search for a Ukraine peace deal, as Trump told Russia to “get moving”.\n\nIn the aftermath of Sunday’s strike, Zelensky called on the US and Europe to get tough on Russia in response to what he described as terrorism.\n\n“Russia wants exactly this kind of terror and is dragging out this war. Without pressure on the aggressor, peace is impossible. Talks have never stopped ballistic missiles and aerial bombs,” he wrote.\n\nRussia launched a full-scale invasion of Ukraine in February 2022 and currently holds about 20 per cent of the country’s territory in the east and south. Russian forces have been slowly advancing in the east of late, though missile and drone strikes now dominate the war.\n\nRussia’s defence ministry said on Saturday that Ukraine had carried out five attacks on Russian energy infrastructure over the previous day in what it called a violation of a US-brokered moratorium on such strikes.\n\nUkraine and Russia agreed to pause strikes on each other’s energy facilities last month, but both sides have repeatedly accused each other of breaking the moratorium.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/131731343b0c231.jpg",
  "retrievedAt": "2025-08-25T14:10:22.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903976/ukraine-says-32-killed-by-russian-ballistic-missile-strike-on-sumy",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T12:35:54.000Z"
}
