{
  "title": "Exports to North America rise 10pc in July-February - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s merchandise exports to North America grew 9.76 per cent to $4.273 billion in the first eight months of the current fiscal year against $3.893bn a year ago, mainly due to a surge in exports to the US.\n\nThe United States accounted for 94pc of Pakistan’s total exports to North America, with the remaining share going to other countries, particularly Canada. According to data compiled by the State Bank of Pakistan, the rise in exports to the region is primarily due to a surge in textile and clothing exports to the US.\n\nA decline in exports was noted in the past two years. In FY24, Pakistan’s exports to the region recorded a negative growth of 8.42pc to $5.432bn from $5.93bn over the same period last year. Pakistan’s exports to the US stood at $5.17bn in FY23, down 23.28pc from $6.74bn in the preceding year.\n\nThe revival of exports to the region was mainly supported by a surge in demand for textiles and clothing following a slowdown in exports from Bangladesh and Vietnam in the current fiscal year.\n\nUS ranks top destination for Pakistani goods\n\nThe Trump administration has imposed a 29pc tariff on products from Pakistan, primarily targeting the textile sector. However, Pakistan’s commerce ministry has not yet assessed the actual effect of these tariff lines on exports.\n\nPakistan’s exports to the US stood at $4.009bn in 8MFY25 from $3.629bn over the corresponding months of last year, indicating a growth of 10.47pc. According to PBS data, Pakistan’s exports to the US stood at $5.442bn in FY24, which fell by 8.26pc from $5.932bn over the previous fiscal year.\n\nPakistan’s exports to Canada recorded a paltry growth of 0.56pc to $262.676m in 8MFY25 from $264.156m over the corresponding months of last year. In FY24, Pakistan exports to Canada stood at $389.164m against $426.575m over the previous year, indicating a decline of 8.77pc.\n\nThe imports from North America stood at $1.663bn in 8MFY25 from $1.285bn over the previous year, an increase of 29.41pc.\n\nMaximum imports were from the US, totalling $1.875bn in FY24, down from $2.216bn over the preceding year.\n\nIn the same region, Pakistan’s exports to Latin America stood at $48.998m in 8MFY25 against $44.627m over the previous year, indicating a marginal increase of 9.97pc. In FY24, the exports value to the region stood at $77.822m against $53.087m over the previous year, showing an increase of 46.59pc.\n\nThe imports from Latin America stood at $4.073m in 8MFY25 against $41.469m over the last year, showing a decline of 90.17pc.\n\nPakistan’s exports to Central America stood at $113.794m in 8MFY25 from $116.881m over the previous year, a decline of 2.64pc. In Central America, Pakistan’s main export destination is Mexico which saw a negative growth of 1.35pc to $87.180m in 8MFY25 from $88.377m over the corresponding months of last year.\n\nThe imports from Central America stood at $48.348m in 8MFY25 against $45.287m over the same months last year, showing a decline of 6.75pc.\n\nAccording to SBP data, Pakistan exports to South America—Argentina, Brazil, Uruguay etc stood at $227.215m in 8MFY25 from $221.212m over the corresponding months of last year, showing a paltry growth of 2.71pc.\n\nIn South America, Pakistan’s exports to Argentina stood at $30.173m in 8MFY25 from $34.775m over the last year, a decline of 13.23pc. However, Pakistan’s exports to Brazil declined by 4.16pc to $87.719m this year from $91.527m over the last year.\n\nPakistan’s exports to Uruguay stood at $5.387m in 8MFY25 against $5.138m over the last year, showing a decline of 4.84pc.\n\nAccording to SBP, the US remained Pakistan’s biggest export destination in the region.The imports from South America stood at $784.743m during 8MFY25 against $297.631m over the previous year, showing an increase of 163.66pc. South America is the second biggest import destination in the continent after North America.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:31:01.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903901/exports-to-north-america-rise-10pc-in-july-february",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:48:11.000Z"
}
