{
  "title": "Over 860,000 Afghans left Pakistan since Sept 2023 - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Over 860,000 Afghans have left Pakistan since September 2023, with more than half a million entering Afgha­nistan through border crossings in Khyber Pakhtunkhwa, according to the government and UN data.\n\nPakistan has been carrying out phase-wise repatriation of Afghans living in the country.\n\nDuring the first phase, which started in 2023, the government sent back Afghan nationals residing illegally in Pakistan.\n\nIn the second phase, which began earlier this year, registered Afghan refugees carrying the Afghan Citizen Cards (ACC) were asked to leave Pakistan by April 1.\n\nAccording to the data released by the International Organisation for Migration (IOM), from Sept 15, 2023, to April 5, 2025, 861,763 Afghans have returned to their country.\n\nOfficial data shows over half a million exited through two crossings in KP\n\nOfficial data showed 4,908 Afg­han refugees left Pakistan on Friday.\n\nAround 2,475 had ACC and were residing legally in Pakistan. Of them, some 2,125 left the country voluntarily, while 350 were deported through the Torkham border in KP.\n\nAs per the official data, apart from ACC holders, some 2,433 Afghan nationals, who had been residing illegally and without any documentation in Pakistan, also left on Friday.\n\nOf them, 1,913 left voluntarily, while 520 were deported through Torkham border crossing.\n\nSince the beginning of the second phase of repatriation of Afghan nationals on April 1, 16,242 ACC holders have left Pakistan. The data showed that 9,439 left voluntarily, while 6803 were deported.\n\nSince September 2023, 500,040 Afghan nationals have left Pakistan through the two border crossings in KP.\n\nThe UNHCR and IOM estimated that from March 1 to April 5, an estimated 19,334 Afghans returned through the Torkham and Ghulam Khan crossings in KP and Chaman, Badini and Bah­ramcha crossings in Balochistan.\n\n“From April onwards, a noticeable increase in returns and deportations was recorded, particularly on 4 and 5 April, where more than 2,000 returns were recorded on each day,” IOM noted.\n\nAccording to officials, Afghan refugees were also transported from Punjab and Islamabad for deportation.\n\nThey were moved to two transit camps in Peshawar and Landi Kotal and went through a registration process before being sent back to Afghanistan.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fb1915b4689.gif",
  "retrievedAt": "2025-08-25T14:10:57.722Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903878/over-860000-afghans-left-pakistan-since-sept-2023",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:20:40.000Z"
}
