{
  "title": "New US tariff policy offers opportunity to boost exports, says PRGMEA Coordinator - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Exports, particularly of textile sector, will benefit from the new US tariff policy, said Pakistan Readymade Garments Manufacturers and Exporters Association Chief Coordinator Shaikh Shafiq Jhok Wala on Saturday.\n\nSpeaking as a chief guest at the inauguration of 29th Textile Asia 2025 at the Expo Centre, he said the imposition of heavy tariffs on China and other countries by the Trump administration would create a demand for textile, garments and various products in the American market that will provide an opportunity for Pakistani companies to grow their exports manifold.\n\nHe said the changing international trade climate is challenging but will likely favour Pakistan and its industries and export growth.\n\nHe said that the Pakistani government is working to facilitate Chinese and Vietnamese companies in establishing their industrial units in special zones and producing made-in-Pakistan goods in collaboration with local investors and industries.\n\nSite proposes committee\n\nMeanwhile, Site Association of Industry (SAI) Chairman Ahmed Azeem Alvi has urged the government to form a high-level committee comprising stakeholders from major industrial hubs to strategise against the recent 29pc tariff imposed by US President Donald Trump on Pakistan.\n\nIn a statement, he proposed that the committee include representatives from Karachi, Lahore, Sialkot, and Faisalabad, particularly large-scale manufacturers and small and medium enterprises with expertise in trade and industrial affairs who would analyse how Pakistan can boost exports to the US and meet the growing demand for imported raw materials needed for local industries.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:10:33.274Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903898/new-us-tariff-policy-offers-opportunity-to-boost-exports-says-prgmea-coordinator",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:48:10.000Z"
}
