{
  "title": "Peshawar High Court orders compensation for deaths in Tirah shelling - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Peshawar High Court has ordered payment of compensation to the tune of Rs1.09 million per deceased to an inhabitant of Tirah valley, Khyber tribal district, whose five family members were killed in shelling by fighter jets in 2013.\n\nA bench consisting of Justice Wiqar Ahmad and Justice Fazal Subhan accepted a petition filed by the aggrieved person, Ghazi Jan, directing that the respondents should pay him compensation for each of the deceased person at the rate of Rs1.09 million minus the amount of compensation, if any, already paid to him.\n\nAccording to the petitioner, the shelling by fighter jets of Pakistan Air Force on Jan 31, 2013, resulted in death of his mother, wife and three children, injuries to him and another relative and also complete destruction of his four-room house.\n\nThe petitioner requested the court to declare the act of the respondents including federal ministry of defence as an intentional murder or accidental murder and also to order payment of compensation/diyat money according to law to him being the legal heir of the deceased persons.\n\nPetitioner claims his mother, wife and three children were killed in bombing by fighter jets\n\nAdvocate Hashim Khan Mengal appeared for the petitioner and stated that after the incident, an application was submitted by a jirga to the then assistant political agent, Khyber, who forwarded the same to the then political agent of Khyber Agency (now tribal district).\n\nHe said that after an inquiry, the political agent ordered compensation of Rs300,000 per deceased persons. He stated that Rs100,000 was paid to each of the injured persons including the petitioner, but he was not paid any compensation for his destroyed house.\n\nBeing not satisfied with the said compensation amount, he stated, the petitioner earlier filed a petition in 2021 which was disposed of by the high court on Apr 19, 2022, directing the chief secretary, Khyber Pakhtunkhwa, to look into the matter keeping in view earlier judgements of the court in two identical petitions wherein compensation was ordered for those killed in bombing by fighter jets in Tirah valley.\n\nHowever, he stated that the matter could not be decided due to which a contempt petition was filed by the petitioner. He added that the respondents then made commitment to comply with the court’s order.\n\nHe said that the government then concluded that the facts of the case of the present petitioner were different from that of the earlier two petitions. Feeling aggrieved with the said order, he said, the instant petition was filed. The bench observed that it had considered the record available before it.\n\nIt was observed that the petitioner had placed a letter of the assistant political agent (APA), Jamrud tehsil, of Mar 20, 2013, addressed by him to the political agent, forwarding application of a jirga for grant of compensation. The bench observed that the letter itself conveyed that eight persons had died/injured in shelling in Tirah on Jan 31, 2013.\n\nThe bench pointed out that another letter was sent by the APA on Apr 4, 2013, wherein the incident was described to be outcome of shelling by fighter planes.\n\nThe court observed that in their comments, the respondents contended that the case of the petitioner was examined by the chief secretary in the light of the earlier judgement and was found to be totally different. However, the bench observed that it was established from the said letter of the APA that in the shelling of fighter planes, the mother, wife, two daughters and a son of the petitioner were martyred whereas he himself got injured in the incident.\n\nThe bench noted that even in the earlier petition titled “Khan Wali Afridi versus federation” the respondents denied that any operation was conducted by PAF on June 24, 2014, however, the additional chief secretary Fata and Khyber APA, in their comments, admitted the mistaken bombardment by the fighter jets.\n\nThe bench ruled that the case of the present petitioner was identical to the earlier cases and he deserved the payment of compensation amount awarded to petitioners of the other two earlier petitions.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:10:44.478Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903832/peshawar-high-court-orders-compensation-for-deaths-in-tirah-shelling",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:47:18.000Z"
}
