{
  "title": "HBL PSL 2025: Vince leads charge as Karachi Kings upstage Multan Sultans - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stands at the National Bank Stadium here gave a deserted look on Saturday night. It hardly looked like the venue was hosting its first match of the HBL Pakistan Super League’s tenth edition.\n\nTo make it worse for the home side Karachi Kings, Multan Sultans had bashed them for a mammoth 234. But the Kings, despite their woes, chose firepower with the bat.\n\nThe onslaught was led by James Vince’s belligerent century and Khushdil Shah’s powerful show as the pair put up a partnership that took Karachi over the line with four wickets and as many balls to spare.\n\nTowards the end of the match, it did look like the PSL had arrived in the metropolis as the sparse crowd that had eventually filled up the stands to an extent, stood electrified by the Kings’ exploits.\n\nNeeding 235, Karachi Kings started aggressively, with Tim Seifert and skipper David Warner racing to 43-0 in three overs.\n\nSeifert’s 32 off 16, including three sixes off David Willey, set the pace, while Warner’s 12 off 6 ended via a Michael Bracewell lbw in the fourth over. Seifert fell to Akif Javed in the fifth, caught by Rizwan, followed by Shan Masood’s golden duck, lbw to Akif, leaving Karachi at 60-3.\n\nVince and Arafat Minhas steadied the ship, but Arafat’s 10 off seven was cut short by Usama Mir’s leg-break in the seventh over.\n\nVince, joined by Khushdil, unleashed a counterattack, forming a match-defining 142-run stand.\n\nVince’s elegant 101 off 43, with 14 fours and four sixes, included a century-sealing square drive off Shahid Aziz in the 18th over. Khushdil’s 60 off 37, packed with five fours and four sixes — three in a single Chris Jordan over — kept the chase alive.\n\nThe tide turned late as Vince was run out in the 18th over, courtesy of Jordan’s sharp throw, and Khushdil chopped on to Akif Javed in the 19th, leaving 14 runs needed off 12 balls.\n\nWith five required off the final over, Abbas Afridi (nine not out off four) sealed the chase with a towering six off Jordan’s second ball, finishing alongside Irfan Khan.\n\nEarlier, Multan Sultans powered their way to an imposing 234-3 in 20 overs, driven by a masterful unbeaten 105 off 63 (nine fours and five sixes) from Rizwan and a blazing cameo from Michael Bracewell.\n\nThe innings, marked by disciplined batting and clinical exploitation of bowling errors, set a daunting target for the hosts.\n\nKarachi Kings chose to bowl first, but their plans faltered as Multan’s batters capitalised on loose deliveries and lack of discipline from the bowlers, who leaked 22 extras.\n\nRizwan opened with Shai Hope, racing to 55-0 in five overs. Rizwan’s crisp drives, including a flicked six off pacer Adam Milne in the third over and a lofted four off Abbas, set the tone.\n\nHope’s cautious eight off seven ended in the sixth over, caught by Seifert off fast bowler Hasan Ali, bringing Usman Khan to the crease.\n\nRizwan and Usman added 28 runs, with the latter striking three fours before falling for 19, stumped after off spinner Khushdil’s cunning variation in the ninth over.\n\nKamran Ghulam joined Rizwan, who reached his fifty off 38 balls in the 11th over. The pair accelerated, with Kamran’s 36 off 19 — featuring five fours and a six off spinner Arafat — providing impetus until he was caught at deep mid-wicket off Abbas in the 15th over.\n\nBracewell’s arrival turned the tide further. Rizwan, shifting gears, smashed sixes off Hasan in the 17th over, while Bracewell’s 44 off 16, including five fours and three sixes, punished wayward bowling.\n\nRizwan sealed his century in the 19th over off Milne with a pulled two, finishing unbeaten. Bracewell’s late flurry, with back-to-back sixes off Hasan in the final over, ensured Multan crossed 230.\n\nKarachi’s bowlers struggled for control. Hasan Ali (1-38) and Abbas (1-53) took wickets but leaked runs, while Milne was hammered for 60 runs. Khushdil’s 1-33 offered some resistance, but 10 wides and fielding lapses, including a misfield off Khushdil, hurt their cause, but their batters more than saved the day at the end.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1312550376df9cd.jpg",
  "retrievedAt": "2025-10-12T02:31:01.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903883/hbl-psl-2025-vince-leads-charge-as-karachi-kings-upstage-multan-sultans",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:23:30.000Z"
}
