{
  "title": "Illegal parking, encroachments choke Lahore’s roads - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Illegal parking and unchecked encroachments have turned Lahore’s major roads into a daily nightmare for motorists and pedestrians.\n\nThe issue has worsened traffic congestion as well as air pollution, compounding the public’s frustration.\n\nThe Lower Mall stretch from MAO College to Batti Chowk remains permanently clogged, as only one lane of the three-lane road is usable due to illegal parking by lawyers, clerks, and their clients.\n\n“The road has become a permanent choke point, and no one dares to act against them,” said a local resident. He blamed the authorities for their inaction.\n\nSimilarly, Multan Road from EME to Thokar Niaz Beg faces frequent gridlock, mostly due to heavy vehicles moving in and out of the Shahpur cattle market.\n\n“This road is always jammed. Visit it any time and you will understand,” said a resident.\n\nOther areas mentioned by citizens include Canal Road, Jail Road, Khayaban-i-Jinnah, Khayaban-i-Firdausi in Johar Town, and the southern bypass from Judicial Colony to Wapda Town Gol Chakkar. U-turns and bottlenecks on signal-free corridors are adding to the chaos.\n\nA salesman who travels city-wide said both illegal parking and encroachments are to blame for the mess, listing Ravi Road, Shahdara, Allama Iqbal Road, GT Road, Kalma Chowk-Gulberg, The Mall and various other stretches as being in perpetual gridlock.\n\nWhen contacted, Lahore Commissioner Zaid Bin Maqsood acknowledged the situation, especially around Aiwan-i-Adl.\n\n“In fact, this is just because of the Aiwan-i-Adl, courts and various government offices on this road, as several people, especially lawyers, visit the place daily,” he said.\n\n“Once we had planned to construct parking plazas around this vicinity, but later a plan was devised to shift half of the courts to other places. Unfortunately, the plan could not be matured,” he said.\n\n“Still, we are working on how to resolve such a major civic issue in a bid to enable motorists to pass through this area smoothly,” he added.\n\n“This issue is even in the knowledge of the CM and the chief secretary.”\n\nAccording to him, the city needs adequate parking spaces at several places, and he, along with the Lahore deputy commissioner and other authorities, is working on the matter.\n\n“We are on it, as we are doing a lot of work on it,” he claimed.\n\nLDA: The second meeting of the Lahore Development Authority’s (LDA) governing body for the current year gave in-principle approval for the construction of six major structural plan roads in Lahore.\n\nThese include: Shaukat Chowk to Doctors Hospital; Shadiwal Chowk to Nazaria-e-Pakistan Road; Expo Centre to Khayaban-e-Jinnah Phase 1; Neelum Road from Pine Avenue to Ferozepur Road; Expo Ring Road Phase 1; and Chenab Road from LDA City to Sui Asal.\n\nThe meeting also discussed the management of mosques in LDA Avenue One, Jubilee Town and Mohlanwal schemes, and the formation of a management committee for LDA’s private housing schemes.\n\nAnother key agenda item was the proposal to impose infrastructure development charges for the integrated development of structural plan roads.\n\nAdditionally, an MoU was presented for signing between the Punjab Land Records Authority and LDA to ensure the transfer of remaining property records, digital transformation, technology sharing, and mutual cooperation.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fb30278ca45.jpg",
  "retrievedAt": "2025-08-25T14:10:29.475Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903933/illegal-parking-encroachments-choke-lahores-roads",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T03:30:34.000Z"
}
