{
  "title": "School principal booked for allegedly trying to rape student in Kot Addu - Pakistan - DAWN.COM",
  "author": null,
  "content": "The principal of a private school was booked in a case for allegedly trying to rape a student in Kot Addu, Punjab on Sunday.\n\nLast year, Non-Governmental Organisation Sahil’s Six Months Cruel Numbers data revealed that a total of 1,630 cases of child abuse were reported from across the country.\n\nIn the first six months of 2024, 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages were reported. 48 cases of pornography after sexual abuse were also recorded.\n\n“A case has been registered against the school principal on the complaint of the mother of the student,” Din Panah Gender Crimes Circle Incharge Sub-Inspector Saeeda Khaliq told Dawn.com.\n\n“The police are conducting raids to arrest the principal. The accused will be arrested soon,” SI Khaliq added.\n\nThe first information report (FIR) has been registered at the Daira Din Panah police station under section 376 (iii) (Rape of a minor or a person with mental or physical disability) and section 511(punishment for attempting an offence) of the Pakistan Penal Code.\n\nAccording to the FIR, an attempt to rape a nine-year-old student of the fourth grade was made by the school principal after calling them to their office.\n\nOn Friday, Punjab police claimed to have arrested three of the four men who allegedly gang raped a 16-year-old girl after abducting her at Chak 437 GB, Samundri in Faisalabad district.\n\nOn Tuesday, Additional District and Sessions Judge Nasir Mahmood Sial handed down a death sentence on three counts, along with a Rs500,000 fine, to a man for kidnap, rape and murder of a minor boy, in Toba Tek Singh.\n\nLast month, Punjab police had also arrested three suspects for allegedly gang-raping a woman in Lahore.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/12152345683f1da.jpg?r=152906",
  "retrievedAt": "2025-08-25T14:10:22.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903969/school-principal-booked-for-allegedly-trying-to-rape-student-in-kot-addu",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T12:54:28.000Z"
}
