{
  "title": "Hard state, Sharifs’ foreign visits - Pakistan - DAWN.COM",
  "author": null,
  "content": "BALOCHISTAN is on the boil with increased militant activity targeting the state and the non-Baloch, coupled with protests across the province pressing for political and economic rights and justice. It is creating a situation where now night travel has been banned on key highways.\n\nAgainst this backdrop, it was a welcome development when National Party leader and former Balochistan chief minister Dr Abdul Malik Baloch visited the opulent Lahore estate of former prime minister Nawaz Sharif. The meeting represented hope.\n\nYes, hope of change in how the issue is perceived at the centre and dealt with — so far with consequences one would be hard-pressed to describe as anything but disastrous, with the state apparatus and militants locked in a spiral of unending violence. Of course, one needs to ask if any hope is misplaced.\n\nIn the past, the elder Sharif demonstrated political accommodation which could give rise to optimism going forward. Off the back of the meeting, a photograph showed Mr Sharif and Dr Baloch sitting in a room so ostentatious that more than 99 per cent of Pakistanis would struggle to relate to it.\n\nA well-informed source said that there was little Nawaz Sharif could do as he has little or no elbow room on Balochistan.\n\nDespite this apparent disconnect between grandeur and the issues of an impoverished, battered province, one couldn’t be blamed for hoping that the great democrat, Nawaz Sharif, would attend to the burning issue quickly as time is of the essence, as this paper so eloquently argued in its Friday leader.\n\nNobody is suggesting that he needed to proceed to Balochistan right away as even if he could help, some groundwork would be needed before moving forward. Still, it needed to be started with immediate effect. So, you can imagine my surprise when I saw images of the Sharif family in Minsk.\n\nWhen Belarus President Aleksandr Lukashenko received the Pakistan delegation, Shehbaz Sharif, Nawaz Sharif, Maryam Nawaz with her daughter, Hussain Nawaz and Ishaq Dar were among the easily recognisable faces and, perhaps, lesser known family members too. I am sure there were others including cabinet members, diplomats, and civil servants; after all, it was an official delegation.\n\nBut the family-heavy delegation was a bit perplexing. Oh yes, MoUs were signed, regardless of when they are realised and when they result in contracts and agreements. I am sure among the range of papers on which signatures were affixed, many could potentially bring benefit to Pakistan.\n\nIt was also clear that with the support of the military leadership assured, the Sharifs don’t seem bothered by optics and public perceptions. With at least six close family members in the delegation, it gave the distinct impression of a family visit and should have been best avoided.\n\nThose who defend such visits say Nawaz Sharif is keen to train his political heir for a bigger role in the country. This is an integral part of her statecraft instruction for high office. Even this defence seems oblivious to how the public perceives such events.\n\nNot just that, it seems that Pakistani VVIPs, from the civil-military hierarchy at the centre to that in the provinces, have now quite openly abandoned any attempt to be seen as frugal. Just look at their motorcades.\n\nSome measures can be justified on account of legitimate security concerns. But how they prefer to travel by executive or bigger (dedicated) jets whether within the country or abroad can hardly be explained away, especially when the salaried class is being asked to shoulder an increasingly crushing tax burden.\n\nHowever, there are also very sympathetic explanations of why Nawaz Sharif left for Belarus en route to London, despite having called for a political solution of the Balochistan imbroglio while talking to Dr Baloch, his erstwhile partner in government.\n\nA well-informed Islamabad source said that there was little Nawaz Sharif could do as he has little or no elbow room on Balochistan: “The ‘hard state’ has decided that it will deal with the insurgency as it is dealing now with raw force. It is the assessment of those directing the policy that the kind of losses being taken now can be sustained for long.”\n\nThose who argue this strategy may work say the price being paid in its pursuit may well be affordable because the prize in terms of the potential earnings from mineral resources could run into hitherto unimaginable amounts — some say hundreds of billions over the long term. “There is no interest in reaching out, negotiating, as that may entail sharing some of the revenue. Nobody here seems to be in a generous mood anymore,” said another Islamabad source.\n\nWhat the Constitution says about the provinces’ rights to their resources and the role that the Council of Common Interests is mandated to play is being ignored. “Many people thought that the 26th Amendment was Imran Khan-specific. They will realise now that the formation of the constitutional bench and controlling superior court appointments were aimed at much broader objectives than one out-of-favour politician.”\n\nNawaz Sharif may have followed his instinct in telling Dr Malik he was prepared to play a role in trying to work towards a political settlement in Balochistan but after his valued guest left, his focus may have shifted back to reality. Recognising it, he may have decided to continue with his travel plans as he knows he can’t do much, constrained as he is.\n\nDespite this, many commentators, whose hearts ache for Pakistan, say that returning to the Baloch their snatched mandate — which was handed over to proxies who remain opposed to any political settlement because they know their true political standing in the province — is the only viable long-term move there is.\n\nMy only concern is that between the hard state and the foreign trips of its soft-façade family, time is running out. If there was a military solution, I may not have approved of it but would have said if it works it works. What do I do when I believe it is self-harm?\n\nThe writer is a former editor of Dawn.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fb2a3a1e448.jpg",
  "retrievedAt": "2025-08-25T14:10:31.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903911/hard-state-sharifs-foreign-visits",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T03:07:28.000Z"
}
