{
  "title": "Frustrated BNP turns to MPC amid govt ‘inaction’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Akhtar Mengal says Monday’s conference will discuss key provincial matters, marchers’ demands\n• PML-N wants BNP-M to resolve issues through dialogue, not protests\n• PPP urges govt, opposition to hold parleys on Balochistan\n\nQUETTA: The Balochistan National Party (BNP-Men­gal) has decided to convene a multi-party conference (MPC) on Monday amid a deadlock in negotiations with the government, which refused to allow the party’s long march — launched from Wadh to demand the release of Dr Mahrang Baloch, chief organiser of the Baloch Yakjehti Committee, and other women activists — to enter Quetta.\n\nSpeaking to reporters at the sit-in, which has now entered its third week, BNP-M President Sardar Akhtar Mengal announced on Saturday evening that the MPC would take place at the sit-in site, and invitations had been sent to leaders of various political parties.\n\nHe said the MPC would discuss the demands of the long marchers and address other serious issues faced by Balochistan, adding that the conference would also determine a future course of action in light of the government’s lack of seriousness regarding the province’s concerns.\n\nMr Mengal reiterated that the BNP-M’s primary demand was the release of arrested women political activists, including Mahrang Baloch. “If the government had accepted our demand, we would have ended the sit-in and returned,” he said. He added that three rounds of talks had been held with the government, but none resulted in any meaningful resolution, reflecting the government’s indifference.\n\nHe accused the state of being disinterested in resolving Balochistan’s issues, clai­ming that the province was facing its fifth militar operation. “The people who went to the mountains were once protesting peacefully on these roads,” Mr Mengal said, adding that when the government responds to grievances with enforced disappearances and the dumping of bodies, it leaves the people with no options.\n\nHe criticised parliament, calling it a “rubber stamp” where women legislators are being coerced into voting for constitutional amendments through the abduction of their sons and husbands. “Earlier, there was kidnapping for ransom; now it’s kidnapping for constitutional amendments,” he remarked.\n\nHe also accused major political parties of having no genuine concern for the people of Balochistan, claiming that they were complicit in looting the province’s resources and stealing the public mandate through collaborations with the establishment.\n\nMr Mengal also denied media reports suggesting he had submitted demands to Chief Minister Sarfraz Bugti through backdoor channels.\n\nPolitical dialogue\n\nMeanwhile, the PML-N Balochistan leadership on Saturday emphasised that all issues should be resolved through political dialogue between the BNP-M and the government, rather than through sit-ins and highway blockades.\n\nPML-N Parliamentary Leader and provincial Minister for Communications and Works Mir Saleem Khosa made these remarks during a press conference, accompanied by fellow ministers from the party, including Raheela Hameed Khan Durrani, Noor Muhammad Dummor, Nasimur Rehman Mulakhail, Mir Barkat Ali Rind, Wali Muhammad Noorzai, Sardar Masood Luni, and Balochistan government spokesperson Shahid Rind.\n\n“The right way to find solutions to issues is through dialogue,” Mr Khosa said, adding that attempts to push illegitimate demands through protests and highway blockades were not the appropriate way to compel the government. He extended an offer to BNP-M chief to initiate political dialogue to address the issues for which the sit-in had been staged.\n\n“If judicial matters are to be resolved on the streets, we might as well shut down the courts,” Mr Khosa remarked. He questioned why Sardar Mengal did not speak up for the victims of terrorist attacks and accused him of misleading the public by portraying his protest as legitimate.\n\n“The state of Pakistan gave him honour and a political platform, yet now he is using his rhetoric against that very state,” Mr Khosa said, adding that the people of Balochistan are politically aware and have moved beyond the politics of hate.\n\nThe PML-N leader said that due to its flawed political approach, the BNP-M had now been reduced to the “politics of a single Union Council”. He recalled that while the BNP-M once held 10 seats, it now retains only one. Despite this, the government has continued to treat them with respect and dignity.\n\nMr Khosa said it was on record that the BNP-M played a key role in the ousting of former chief minister Jam Kamal’s government and benefited significantly from the subsequent administration. He claimed that the government led by Abdul Qudoos Bizenjo was dominated by Akhtar Mengal, who was effectively running its affairs.\n\n“What development projects or policy proposals did he introduce during those one and a half years that brought any meaningful progress?” Khosa asked, adding that the public rejected the BNP-M in the elections due to its poor performance.\n\n“BNP has always engaged in politics for personal gain,” he alleged, noting that while the government sent delegations to negotiate with Mr Mengal, unlawful demands could not be enforced through protests. “If everyone starts protesting over court cases, the entire country will be out on the streets,” he remarked.\n\nMr Khosa said the PML-N leadership had reached out to Akhtar Mengal to encourage him to pursue a political path, but his refusal had created a deadlock.\n\nSpeaking on the occasion, Raheela Durrani said she had approached Mr Mengal personally, not on behalf of anyone, to play a positive role as a woman. “We told him that people are suffering, but he insisted that the sit-in would not end until all their demands were met,” she said.\n\n“Nawaz Sharif and the PML-N have always stood for Pakistan. It pains us when offensive language is used against our leader. The PML-N has always supported nationalist groups,” she added.\n\nNotably, Sardar Abdul Rehman Khetran, Zarak Khan Mandokhail and other members were absent from the occasion.\n\nPeaceful politics\n\nMeanwhile, PPP leaders on Saturday reiterated the party’s commitment to peaceful politics and the values of brotherhood, rejecting politics of hatred and hollow slogans used merely to remain relevant.\n\nPPP Quetta division president Sardar Khair Muhammad Tareen made these remarks at a press conference, accompanied by the party’s Quetta district president Mir Naseeb Ullah Shahwani and information secretary Ehsan Ullah Afghan.\n\n“Both the government and the opposition must come to the negotiation table to resolve Balochistan’s issues,” Mr Tareen said.\n\nHe emphasised that the PPP believes in the power of dialogue and peaceful engagement, and reiterated the party’s stance of relying on the people as the true source of power.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:30:40.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903844/frustrated-bnp-turns-to-mpc-amid-govt-inaction",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:15:45.000Z"
}
