{
  "title": "SBP initiative fails to spur financing for SMEs - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Small and Medium Enterprises (SMEs) receive less than 10 per cent credit from the private sector despite contributing 40 per cent to the GDP.\n\nThe paltry lending was despite the push from the government and the State Bank of Pakistan (SBP) to improve the liquidity of small businesses.\n\nA recent report by the Competition Commission of Pakistan (CCP) said there were over 5.2 million SMEs in Pakistan, contributing 40pc to the GDP and 30pc to total exports.\n\nThe sector also employs an estimated 80pc of the non-agriculture labour force.\n\nSmall businesses receive less than 10pc loans from banks\n\nDespite their significance, SMEs only receive six to seven per cent of private sector financing.\n\nThe banks are not lending to SMEs as they have parked their maximum liquidity in risk-free domestic bonds with high yields .\n\nAround 60pc of assets of banks in Pakistan are domestic bonds, much higher than the benchmark of 20pc lending to the government in developing economies.\n\nA senior banker told Dawn that SMEs are the “backbone” of the economy, but financers are not in favour of lending them money.\n\nIt is due to many reasons, including higher default rate and the availability of the option for risk-free investment, said the banker while hinting towards government bonds.\n\nBanks earned more than 100pc profits in 2024, mostly from government papers since lending to the private sector was just Rs513bn in FY24 and only Rs46bn in FY23.\n\nLenders were also concerned about the higher interest rate — which was at a record high till last year — which increased the possibility of defaults in the private sector.\n\nThe SBP decided to gear up the financing to SMEs by launching a Challenge Fund for Technology Adoption and Digitalisation of SMEs in October 2024.\n\nThe fund would support “innovative solutions for SME banking in the country,” said an SBP circular at the time of launching the initiative.\n\nThe SBP had said the fund would facilitate banks in developing innovative technological solutions to cater to the banking needs of SMEs.\n\nHowever, a senior banker told Dawn that the fund failed to change the course of financing to SMEs.The banks have a safer option to provide credit to large corporations where the likelihood of default is lower, said the banker.\n\nPublished in Dawn, April 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:10:32.420Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903900/sbp-initiative-fails-to-spur-financing-for-smes",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T02:48:11.000Z"
}
