{
  "title": "Pakistan hopes for Iran’s ‘full cooperation’ in probe over killing of its 8 nationals: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan on Sunday sought Iran’s “full cooperation” in investigating the “inhumane and cowardly” killing of eight of its nationals yesterday in the neighbouring country’s Sistan-Baluchestan province, the Foreign Office said.\n\n“Pakistan strongly condemns the inhumane and cowardly killing of its nationals in Iran. We hope for Iranian side’s full cooperation in investigating the matter and in timely repatriation of victims’ remains,” said a press release issued by the FO.\n\nThe Pakistani nationals were “tragically killed” in Mehrestan County, located approximately 230 kilometres away from the Pakistan-Iran border, it stated.\n\nAccording to earlier reports, un­­known armed men barged into a workshop sometime on Saturday night and, after tying the workers’ hands and feet, opened indiscriminate firing and killed them. Later, the attackers fled from the site.\n\nAll eight workers hailed from several areas of Punjab, the Associated Press of Pakistan stated, listing their names.\n\nA spokesman for the banned outfit, the Balochistan National Army (BNA), claimed responsibility for the incident through a statement issued to the media. However, AFP reported that militant group Jaishul Adl also claimed responsibility for the attack.\n\nAccording to the FO, Pakistani officials in Iran were in “constant touch” with the authorities there for a probe into the incident and the repatriation of bodies.\n\n“On the instructions of Deputy Prime Minister/Foreign Minister [Ishaq Dar], our Embassy in Tehran and our Consulate in Zahidan are in constant touch with the Iranian authorities for a comprehensive investigation to ensure that perpetrators are brought to justice as well as for prompt repatriation of the victims’ remains to Pakistan,” the FO said.\n\n“Our Mission has already requested consular access to verify their identities,” it added. The FO noted that the leadership and people of Pakistan were “deeply saddened and perturbed over the tragic incident”.\n\nFurther updates would be provided as soon as additional details regarding the identification of bodies and the “circumstances leading to their tragic deaths become available”, it continued.\n\nFollowing the incident yesterday, Iranian police had rushed to the area and shifted the bodies to a hospital after recovering them.\n\nIranian authorities said the police were investigating the incident.\n\nIt was the second such incident in Sistan-Baluchestan, as nine Pakistani workers hailing from Punjab were gunned down by unidentified attackers on Jan 27, 2024 in the province.\n\nThat incident came the same month Pakistan conducted retaliatory strikes on terrorist hideouts in Sistan-Baluchestan after Iran laun­ched attacks on the border town of Panjgur in Balochistan here.\n\nBalochistan, which borders Sistan-Baluchestan, has witnessed a spate of attacks targeting those hailing from Punjab.\n\nIn late March, five passengers were gunned down in a firing incident in the Kalmat area of Balochistan’s Gwadar district, with officials saying at least four of them belonged to Punjab.\n\nDays before that, four labourers from Punjab were shot dead by unknown assailants in the Kalat district.\n\nIn February, seven Punjab-bound passengers were offloaded from a bus and shot dead in the province’s Barkhan district.\n\nIn August last year, when the province came under a spate of attacks by the banned Balochistan Liberation Army, 23 travellers were offloaded from trucks and buses and shot in the Musakhail district.\n\nIn two separate incidents in April 2024, nine people were killed after being forced off a bus near Noshki, while two labourers from Punjab were shot in Kech. The next month, seven barbers from Punjab were shot dead near Gwadar.\n\nIran’s Ambassador to Pakistan Reza Amiri Moghadam also strongly condemned the “inhumane and cowardly armed incident against eight Pakistani nationals” in a statement.\n\n“Terrorism is a chronic plight and a common threat throughout the region by which the traitorous elements, in collaboration with international terrorism, target security and stability throughout the region,” the statement read.\n\n“Combating this ominous phenomenon requires collective and joint efforts by all countries to eradicate all forms of terrorism and extremism that have claimed the lives of thousands of innocent people in recent decades,” Moghadam stressed.\n\nEarlier today, Prime Minister Shehbaz Sharif expressed deep grief and sorrow over the “brutal killing” of the Pakistani workers, state-run Radio Pakistan reported.\n\n“The menace of terrorism is devastating for all regional countries,” the premier was quoted as saying.\n\nHe urged the Iranian government to arrest the perpetrators immediately, mete out “just punishment to them”, and bring forward the “reasons for this cruel act”.\n\nPM Shehbaz also directed the Ministry of Foreign Affairs to contact the families of the deceased Pakistanis and Pakistan’s embassy in Iran for the safe return of their bodies.\n\nMeanwhile, the heirs of the eight “motor mechanics and labourers” killed in the targeted killings have appealed to the government to ensure the repatriation of the bodies of their loved ones as soon as possible, the APP reported.\n\nAccording to APP, the victims were identified as Dilshad Jind Wada, his son Danish, Naeem Fareed, Jaffar Ramazan and Aamir Liaquat from Samma Satta; Nasir from Musafir Khana; and Khalid and Jamshaid from Ahmadpur East.\n\nTalking to the media, Muhammad Sajjad, the brother of victim Jamshaid, appealed to the government to take immediate steps for the repatriation of his brother’s body.\n\nThe mother and widow of Khalid also requested that the bodies be brought back to Pakistan as soon as possible.\n\nThe APP quoted the bereaved relatives as saying they were in a “state of trauma and deep shock”. “Our beloved one was an innocent person who was murdered brutally. We are very poor people,” both said.\n\nDilshad’s sister said the murder of her brother came as a “big shock” to the family. She said those slain in the killings included her brother and two nephews. The sister appealed to the authorities that measures be taken for the bodies’ repatriation and justice be provided.\n\nAPP reported that Dilshad had taken along his son, nephew and other mechanics from Bahawalpur to work at a motor workshop he had established in the Hizabad rural area of Mehrestan.\n\nThey had been living in the workshop, which was used to dent and repair vehicles, for the last seven years, according to the report.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/13211625de5cf7c.png",
  "retrievedAt": "2025-08-25T14:10:30.323Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903959/pakistan-hopes-for-irans-full-cooperation-in-probe-over-killing-of-its-8-nationals-fo",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T07:36:15.000Z"
}
