{
  "title": "DG FIA Ahmed Ishaq Jahangir to Receive Prestigious award “Hilal-e-Imtiaz” for Outstanding Service",
  "link": "https://www.app.com.pk/national/dg-fia-ahmed-ishaq-jahangir-to-receive-prestigious-award-hilal-e-imtiaz-for-outstanding-service/",
  "date_published": "2024-08-15T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP):In recognition of his exceptional leadership and dedication to combating serious crimes, Director General of the Federal Investigation Agency (FIA) Ahmed Ishaq Jahangir has been approved to receive Pakistan’s second highest civilian award “Hilal-e-Imtiaz” by the President.\nJahangir’s tireless efforts in preventing human trafficking, terrorism, money laundering, and online sexual harassment have earned him this prestigious honor.\nDG FIA Ahmed Ishaq Jahangir will be conferred with the Hilal-e-Imtiaz  award on March 23, 2025, in recognition of his meritorious services to the nation.\nUnder his leadership, the FIA has made significant strides in combating serious crimes, including human trafficking, terrorism, and cybercrime.\nJahangir, a seasoned police officer with over three decades of experience, has played a pivotal role in transforming the FIA into a modern and effective law enforcement agency. His initiatives have led to the establishment of special cells across the country, tackling online sexual exploitation of children and developing strategies to prevent cybercrime.\nThe FIA, under Jahangir’s leadership, has also strengthened international collaborations, fostering cooperation with global organizations to address cyber challenges. His efforts have resulted in notable successes, including arrests of individuals involved in cybercrime and human trafficking.\nJahangir’s contributions extend beyond his tenure as FIA chief. He drafted the Police Rules 2018-2017, modernizing police practices and improving working methods. He was previously awarded the President’s Police Medal in 1995 for his outstanding performance.\nThe Star Imtiaz award is a testament to Jahangir’s unwavering commitment to public service and his dedication to making Pakistan a safer and more secure nation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:40:40.090Z"
}
