{
  "title": "Senate body on IT discusses issue of recent internet disruptions",
  "link": "https://www.app.com.pk/national/senate-body-on-it-discusses-issue-of-recent-internet-disruptions/",
  "date_published": "2024-08-15T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP):The Senate Standing Committee on Information Technology and Telecommunications Thursday discussed the issue of recent internet disruptions across the country causing real-time hindrances for individuals running e-commerce businesses.\nSenator Palwasha Muhammad Zai Khan chaired the meeting.\nSecretary for the Ministry of Information Technology and Telecommunications, Aisha Humera Chaudhry, explained that there is no issue with broadband connections; however, mobile operators using mobile data are facing disruptions.\nThe PTA is assessing the issue, and the ministry will be in a better position to provide an overview once the assessment is completed in two weeks.\nThe committee addressed the complaint of MNA Ali Jaan Mazari regarding poor internet service in Kashmore.\nHe said that internet services have been crawling for the last four months, and despite several requests, no action has been taken so far.\nPTA officials highlighted that there are around 156 sites of three major service providers in the area and that internet services are mostly down due to unannounced load shedding.\nHowever, the PTA is assessing the issue and will submit its report in the next 15 days. The committee also directed the PTA to submit its quarterly survey report at the next meeting.\nShaza Fatima Khawaja, State Minister for IT, while informing the committee said that the proposal was moved forward by the Establishment Division and that the ministry will brief the committee on the matter in the upcoming week.\nThe committee deliberated on the Bill titled “The Personal Data Protection Bill, 2023.” Senator Dr. Afnan Ullah Khan, the bill’s mover, said that the primary purpose of the bill is to protect the data of citizens because, as of now, there is no law in place for this purpose.\nOfficials of the Ministry of Information Technology and Telecommunications informed that the ministry has consulted with over 100 local and international stakeholders and is working on a final draft to address the grievances of stakeholders.\nThe draft will be completed in the next fifteen days, they added.\nThe committee, considering the importance of the bill for the country, recommended that the ministry to complete the draft as soon as possible.\nFurthermore, the committee was briefed by the Virtual University regarding its performance and operations.\nThe Rector of Virtual University, Arshad Saleem Bhatti, informed that Virtual University was the country’s first university to start the flipped classroom model in 2002, aiming to benefit working students.\nVirtual University is the only university that provides quality education at an affordable fee, charging only Rs.150,000 for the entire BS program and offering 400 courses for free.\nThe university generates revenue of Rs. 7.25 billion from fees and services and bears no burden on the exchequer.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:40:54.414Z"
}
