{
  "title": "PMD forecast torrential rains in Balochistan, Sindh from Aug 16-18; rain in upper parts till Aug 20",
  "link": "https://www.app.com.pk/national/pmd-forecast-torrential-rains-in-balochistan-sindh-from-aug-16-18-rain-in-upper-parts-till-aug-20/",
  "date_published": "2024-08-15T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Pakistan Meteorological Department (PMD) has forecast torrential rains in Balochistan and Sindh from August 16-18 with occasional gaps.\nThe rainfall will continue in upper parts till August 20 with occasional gaps, the PMD said through an advisory issued on Thursday.\nA low pressure weather system presently producing rains in upper parts is likely to move southward bringing strong monsoon currents from Arabian sea to southern parts of the country from August 16 (evening/night).\nUnder the influence of this weather system, rain-wind/thundershower with isolated heavy falls is expected in Sibi, Harnai, Ziarat, Kohlu, Barkhan, Dera Bugti, Zhob, Musa Khel, Naseerabad, Usta Muhammad, Jhal Magsi, Sohbatpur, Khuzdar, Kalat, Sikandarabad, Awaran, Kech, Panjgur, Gwadar ,(Jiwani, Pasni, Gwadar, Ormara), Hub and Lasbela. Loralai, Quetta, Sherani, Qila Abdullah, Qila Saifullah, Mastung, Bolan, Harnai and Jaffarabad from August 16-19 with occasional gaps.\nIn Sindh, rain-wind/thundershower with few heavyfalls is expected in Sukkur, Shikarpur, Kashmore, Khairpur, Naushahro Feroze, Larkana, Dadu, Jacobabad, Karachi, Hyderabad, Thatta, Badin, Tando Allahyar, Tando Muhammad Khan, Tharparkar, Mithi, Mirpur Khas, Umarkot and Sanghar from August 16-18 with occasional gaps.\nIn Kashmir, rain-wind/thundershower with few heavyfalls are expected in Neelum valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber and Mirpur from August 16-20 with occasional gaps.\nIn Punjab/Islamabad, rain-wind/thundershower (with scattered heavyfalls) are expected in Islamabad/Rawalpindi, Murree, Galliyat, Attock, Chakwal, Tala Gang, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Wazirabad, Sahiwal, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Lahore, Sheikhupura, Sialkot, Narowal, Okara, Pakpattan, Kasur, Khushab and Sargodha from August 16-20 with occasional gaps. Rain-wind/thundershower with isolated heavyfalls is expected in Bahawalpur, Bahawalnagar, Khanpur, Dera Ghazi Khan, Multan, Bhakkar, Mianwali, Khanewal, Lodhran, Muzaffargarh, Kot Addu, Rajanpur, Rahimyar Khan and Layyah on August 16 and August 17 with occasional gaps.\nIn Khyber-Pakhtunkhwa, rain-wind/thundershower with scattered heavyfalls are expected in Chitral, Dir, Swat, Kohistan, Malakand, Shangla, Battagram, Buner, Kohat, Bajaur, Mohmand, Khyber, Mansehra, Abbottabad, Haripur, Peshawar, Swabi, Nowshera, Mardan, Charsadda, Hangu, Kurram, Orakzai, Waziristan, Bannu, Lakki Marwat and Dera Ismail Khan from August 16-20 with occasional gaps.\nIn Gilgit-Baltistan, rain-wind/thunderstorm is expected in Diamir, Astore, Skardu, Gilgit, Ghanche, Shigar) from August 16-18 with occasional gaps.\nAbout the possible impacts, low lying areas inundation/Pluvial flood is expected in Balochistan and Sindh.\nTorrential rains may generate landslides/flash flooding in local nullahs/streams of Dera Ghazi Khan, Dadu, Kalat, Khuzdar, Barkhan, Awaran, Panjgur, Washuk, Mastung, Lasbela August 16-18.\nTorrential rains may generate landslides/flash flooding in Murree, Galliyat, Mansehra, Kohistan, Chitral, Gilgit-Baltistan, Dir, Swat, Shangla, Nowshera, Swabi, Islamabad, Rawalpindi, Northeast Punjab, Hill torrents of and Kashmir from August 16, 18 and 19.\nHeavy downpour may cause urban flooding in low lying areas of Islamabad/Rawalpindi, Gujranwala, Lahore, Sheikhupura, Kasur, Sialkot, Sargodha, Faisalabad, Nowshera and Peshawar from August 16, 18 and 19.\nThe landslides may cause road closure at the vulnerable hilly areas of Balochistan from August 16-19 while in Khyber Pakhtunkhwa, Murree, Galliyat, Kashmir and Gilgit-Baltistan during the wet period.\nHeavy downpour/windstorm and lightning may affect daily routines, and may damage weak structures like roof/wall of Kacha houses, electric poles, bill boards, vehicles, cause disruptions in the roads and solar panels etc during the period.\nFarmers are advised to manage their activities keeping in view the weather forecast.\nTravelers and tourists are advised to remain extra cautious and manage their traveling according to weather conditions and avoid any untoward situation during the wet spell.\nAll authorities concerned are advised to remain alert and take necessary measures to avoid any untoward situation.",
  "retrievedAt": "2025-08-11T04:40:14.671Z"
}
