{
  "title": "Telenor acquires spectrum in AJK & GB to continue empowering region with high speed connectivity",
  "link": "https://www.app.com.pk/national/telenor-acquires-spectrum-in-ajk-gb-to-continue-empowering-region-with-high-speed-connectivity/",
  "date_published": "2021-09-28T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Telenor Pakistan has acquired additional spectrum in Azad Jammu and  Kashmir (AJK) and Gilgit Baltistan (GB) through the latest spectrum auction, adding 16.2 MHz to its overall spectrum holdings in the region.\nThis will enable Telenor Pakistan to further expand and develop its already strong footprint in the region through its voice and data services. Telenor Pakistan has acquired 15MHz in 2100 MHz band and 1.2MHz in 1800MHz band.\nTelenor Pakistan has been empowering AJK and GB with its state-of-the-art connectivity services since 2006 and over the past fifteen years, the customer’s trust in Telenor Pakistan has made it a market leader in the region.\nThis additional spectrum will help in providing customers with greater access to connectivity services in the region along with enhanced digital connectivity to enable health, education, commerce, agriculture, citizen services, government services communication and financial services.\n“This spectrum auction was much needed to fulfill the growing connectivity needs of AJK & GB. As the market leader in the region, this additional spectrum will allow us to further enhance our network experience in existing areas and bring more people in the folds of digital inclusion,” said Irfan Wahab Khan, CEO Telenor Pakistan.\n“We thoroughly assessed spectrum auction opportunities with respect to its long-term benefits to our customers based on price and related terms and conditions. This latest investment is Telenor Pakistan’s commitment to continue empowering the country and its many communities with even more opportunities for years to come.\nWe are grateful to Pakistan Telecommunication Authority, Ministry of Information Technology and Telecommunication, and the Ministry of Finance for facilitating us during the auction process,” he added.\nTelenor Pakistan strongly believes in leaving no one behind from accessing the benefits of digital connectivity and has been actively working with the authorities to extend best-in-class services to the people of AJK & GB.\nWith the rest of country benefiting from 3G and 4G services since 2014, the people of AJK and GB would now also be able to enjoy quality data services, particularly during Covid-19 which further increased the dependence on connectivity.\nThe organisation is committed to continue empowering the region for accelerated socioeconomic progress by offering one of the best connectivity experiences.",
  "retrievedAt": "2025-08-11T21:20:21.567Z"
}
