{
  "title": "Foreign Money Laundering Case; reports of Shahbaz, Suleman’s acquittal `wrong’: Shahzad Akbar",
  "link": "https://www.app.com.pk/national/foreign-money-laundering-case-reports-of-shahbaz-sulemans-acquittal-wrong-shahzad-akbar/",
  "date_published": "2021-09-28T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Adviser to Prime Minister on Accountability Shahzad Akbar on Tuesday refuted reports of ‘acquittal’ of PML-N President Shahbaz Sharif and his son Suleman Shahbaz in a money laundering case from a London court.\nAddressing a press conference here, he said the impression of Shahbaz Sharif and his son Suleman’s acquittal from the UK court in money laundering case was ‘wrong’ adding that order released by the UK court does not mention the acquittal.\nShahzad Akbar said the reports about the alleged ‘acquittal’ of Shahbaz Sharif or his son Suleman Shahbaz are incorrect and misreporting.\nThe Advisor said the investigation by the National Crime Agency (NCA) against Suleman Shahbaz and some of his family members was not initiated at the request of Asset Recovery Unit (ARU) or NAB, but Pakistan was contacted over the two suspicious transactions by the NCA.\nNCA shared few names with Pakistan in this context. He said Pakistan responded to the NCA questions in this regard, but the case was not filed by Pakistan, he maintained.\nThe Advisor said the two-page verdict of British court was issued on September 10 and Shehbaz Sharif’s name was not even mentioned once in the whole order.\nShahzad Akbar further explained that no case was filed against Shehbaz Sharif outside the country so the impression of PML-N to project this theory was absolutely wrong. However, there are still two money laundering cases against PML-N President in Pakistan, he added.\nThe Advisor to Prime Minister on Accountability said that recently NCA decided to stop investigating these funds and therefore agreed to release these funds through court.\nShahzad Akbar further clarified that such a release order was not an acknowledgment that funds are from a legitimate source. He said that Proceed of Crime Act, 2004 elaborated about the freezing the accounts.\nHe said that the opposition leader was facing money laundering charges in Pakistani courts and the statements of the witnesses are being recorded. The judgment will come from Pakistani courts in this regard, he maintained.\nHe said National Accountability Bureau is inquiring money laundering of seven billion rupees of Shahbaz Sharif while Federal Investigation Agency is also investigating fake transaction of twenty five billion rupees.",
  "retrievedAt": "2025-08-11T21:20:18.468Z"
}
