{
  "title": "PR outsources commercial management of nine trains in fair bidding process",
  "link": "https://www.app.com.pk/national/pr-outsources-commercial-management-of-nine-trains-in-fair-bidding-process/",
  "date_published": "2021-09-28T11:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Pakistan Railways had outsourced the commercial management of nine trains to private parties under public private partnership through fair and transparent bidding process during the tenure of the incumbent government.\nThe basic purpose to outsource the trains were to provide better facilities to the passengers and generate more revenue for the department, an official in the Ministry of Railways told APP.  Pakistan Railways privatized the trains included Mehr Express, Fareed Express, Faiz Ahmad Faiz Express, Jinnah Express, Mehran Express, Badar Express,\nSir Syed Express, Ghauri Express, Mianwali Express, he added.He said the companies which took the commercial management of the trains included S. Jamil and Co. (Pvt) Limited, PRACS, Raas Logistic, As Enterprises, AA Enterprises and SSR Group.\nThe official said the trains had been awarded through transparent procedure of tendering under Public Procurement Regulatory Authority (PPRA) Rules through advertisement in the leading newspapers.\nHe said only those trains were awarded whose bids had been received over and above the Pakistan Railways earning.\nThe official said the trains had been awarded with the objective to increase earning and reduce losses of Pakistan Railways, improve cleanness and provide better food facilities to passengersTo a question, he said Pakistan Railways was planning to outsource its hospitals in the country to upgrade, expand and rehabilitate them under the public-private partnership.\nHe said the department had organized a road-show to attract the private sectorto join the government in its efforts for improving and upgrading health servicesin railway hospitals.",
  "retrievedAt": "2025-08-11T21:20:17.623Z"
}
