{
  "title": "England’s abandoning Pakistan tour caused financial loss, disappointment: Qureshi tells UK",
  "link": "https://www.app.com.pk/national/englands-abandoning-pakistan-tour-caused-financial-loss-disappointed-cricket-fans-qureshi-tells-uk/",
  "date_published": "2021-09-28T17:43:00.000Z",
  "source": "APP",
  "content": "LONDON, Sep 28 (APP): Foreign Minister Shah Mahmood Qureshi Tuesday met British Secretary of State for Foreign Affairs Elizabeth Truss wherein he conveyed Pakistan’s disappointment at the decision of the English Cricket Board to cancel Pakistan tour.\n“This had not only caused financial loss to Pakistan Cricket Board but also deeply disappointed millions of cricket fans,” the foreign minister said who is currently in UK.\nThe foreign minister felicitated Secretary Truss on her appointment, and said that he looked forward to working closely with her to put concrete shape to the mutual desire of the two sides to take the bilateral relations to the next level.\nIt was agreed to work on roadmaps in multiple areas of mutual interest.\nForeign Minister Qureshi apprised his British counterpart of Pakistan’s climate vulnerabilities. Despite contributing minimally to global greenhouse gas emissions, Pakistan had been among the most affected and was deemed one of the most climate vulnerable countries.\nHe apprised Secretary Truss of the steps being taken by Pakistan for climate mitigation and adaptation including Prime Minister Imran Khan’s 10 Billion Tree Tsunami initiative.\nLauding Pakistan’s climate credentials, Secretary Truss stated that the UK looked forward to Prime Minister Imran Khan’s participation in COP-26 being hosted by the UK in Glasgow in November this year.\nIn addition to detailed discussions on the entire gamut of bilateral relations, the two sides also discussed the regional situation.\nWhile lauding the recent debate in the British House of Commons on the human rights situation in Indian Illegally Occupied Jammu & Kashmir (IIOJK), the foreign minister apprised his British counterpart of human rights violations being committed by the Indian occupation forces in IIOJK.\nHe hoped that UK would play its due role in this regard. A dossier documenting evidence of over 3000 war crimes perpetrated by the Indian occupation forces was also shared.\n​Foreign Minister Qureshi apprised his British counterpart of the situation in Afghanistan, and Pakistan’s hopes and expectations from the dispensation in Kabul.\nQureshi said Pakistan’s immediate concern was to avert a humanitarian catastrophe. Pakistan had set up a humanitarian corridor and was extending all possible assistance to support the Afghan people.\nPakistan had also facilitated evacuation of a large number of foreign nationals and Afghans wishing to leave. Pakistan was willing to act as a hub for humanitarian support to Afghanistan., he added.\nQureshi urged the international community not to repeat past mistakes, and to engage constructively with the Taliban.\n​The foreign minister extended Secretary Truss an invitation to visit Pakistan in connection with the 5th review session of the Pakistan-UK Enhanced Strategic Dialogue, which she accepted.\n​The meeting marks the second occasion within a month the two sides have met at the foreign ministers’ level.",
  "retrievedAt": "2025-08-11T21:20:20.316Z"
}
