{
  "title": "China built more than 1 million 5G base stations",
  "link": "https://www.app.com.pk/national/china-built-more-than-1-million-5g-base-stations/",
  "date_published": "2021-09-28T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Cross-industry teamwork is one of the keys to quickening the application of 5G in more sectors, as the rollout of the fast wireless technology accelerates in China, Chinese officials and experts said.\nXin Guobin, vice-minister of the Ministry of Industry and Information Technology, the nation’s top industry regulator, said that as of August, China has built more than 1 million 5G base stations, accounting for more than 70 percent of the world’s total.\nAt the PT Expo China, an important telecom industry exhibition which kicked off in Beijing on Monday, Xin called for more efforts to widen the use of cloud computing, big data, artificial intelligence and other tech.\n“The information and communication technology is now getting increasingly intertwined with the real economy, with digital transformation accelerated in a wide range of sectors,” Xin said.\nCurrently, 5G applications are in full bloom, with companies scrambling to explore its use in consumer sectors such as cultural, sports and entertainment, and in industries such as manufacturing, mining, healthcare, and ports, the senior official said.\nBut more efforts are needed to promote the construction of smart cities and communities, as well as to improve the informatization level in transportation, education, scientific research, healthcare, social security and other areas, Xin said.\nGlobally, there are already 176 5G commercial networks and more than 10,000 projects are exploring how 5G can drive industrial digitalization. On the consumer front, there are more than 490 million 5G users worldwide, Chinese telecom company Huawei Technologies Co said.\nBy the end of August, the number of 5G smartphones connected to the 5G network in China exceeded 419 million, the Ministry of Industry and Information Technology showed.\nFrom January to August this year, the shipments of 5G mobile phones in China reached 168 million units, marking a year-on-year increase of 80 percent.\nIndustry experts said 2021 is the first year one sees large-scale 5G industry applications. Operators need new capabilities in network planning, deployment, maintenance, optimization and operations, to achieve zero to one, and replicate success from one to many.\nLu Yong, senior vice-president of Huawei, said since the beginning of 2021, more than 5,000 of the company’s 5GtoB (5G to business) projects have been launched in China, which is several times the sum of projects launched in 2019 and 2020, Lu said. 5GtoB is a one-stop solution unveiled by Huawei to promote the industrial use of 5G in several sectors.\nYang Jie, chairman of China Mobile, the largest telecom operator in China, said 5G is a catalyst for deeper integration of many technologies, and the company is working hard to boost its capabilities to offer smarter connections, larger computing power and better solutions to empower more sectors.\nXiang Ligang, director-general of the Information Consumption Alliance, a tech industry association, said 5G should inspire industry digitalization, which should not be limited to the vision of individual companies in the industry but be based on collaborative transformation of multiple partners in the industry, all working within a mindset of “team competition”.",
  "retrievedAt": "2025-08-11T21:20:16.650Z"
}
