{
  "title": "India’s baseless propaganda a tactic to cover up heinous acts in IIOJK: FO",
  "link": "https://www.app.com.pk/national/indias-baseless-propaganda-a-tactic-to-cover-up-heinous-acts-in-iiojk-fo/",
  "date_published": "2021-09-28T17:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Pakistan on Tuesday categorically rejected the “baseless propaganda” by India about arresting an alleged ‘militant’ and killing another on the Indian side of the Line of Control (LoC), terming it an attempt to divert focus from the human rights violations in the Occupied Kashmir.\n“Such allegations are the established Indian tactics to mischievously implicate Pakistan and divert world attention from its own heinous activities in Indian Illegally Occupied Jammu and Kashmir (IIOJK),” Foreign Office Spokesperson Asim Iftikhar said in a statement.\nHe was responding to the news reports circulating in the Indian media claiming apprehension of an alleged Pakistani ‘militant’ by the Indian occupation forces in IIOJK.\nThe FO Spokesperson said Pakistan had shared “incontrovertible evidence” with the world about India’s grave human rights violations in the IIOJK, including through a dossier unveiled this month.\nHe mentioned that as a matter of fact, thousands of young Kashmiris were incarcerated in Indian jails on trumped up charges.\nFrom time to time, some of these youth are produced before the world as alleged ‘militants’ whenever India feels the pressure from the international community, he added.\nHe said it was “nothing new” for the Indian occupation forces involved in running false-flag operations, fake encounters and fake arms recovery operations to hide their own atrocities in IIOJK and terrorist activities against Pakistan.\nHe said the details had been uncovered in detail in the dossier with “concrete evidence”.\nThe FO Spokesperson said Pakistan was “seriously concerned” about the recent Indian attempts to vitiate the environment on the LoC.\nHowever, he stressed that Pakistan was maintaining restraint, despite the Indian provocations, in line with the Director Generals of Military Operations’ (DGsMO) understanding of February 2021 regarding the ceasefire along the LoC.",
  "retrievedAt": "2025-08-11T21:20:21.594Z"
}
