{
  "title": "Meeting reviews progress on access roads to tourist destinations",
  "link": "https://www.app.com.pk/national/meeting-reviews-progress-on-access-roads-to-tourist-destinations/",
  "date_published": "2022-04-15T15:34:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 15 (APP): A meeting to review progress on various projects of the roads sector including access roads to tourist destinations was held here on Friday with Chief Minister Khyber Pakhtunkhwa Mahmood Khan in the chair.\nThe meeting reviewed in detail progress so far made on different projects including Khyber Pakhtunkhwa Provincial Roads Improvement Project, Integrated Tourism Development Project, Rural Roads Development Project and some important decisions were made to address the issues impeding physical progress on some of the projects.\nSecretary Tourism Aamir Tareen, Secretary Environment and Forestry Abid Majeed, Secretary Communications and works Ijaz Ansari and other relevant senior officials attended the meeting.\nThe meeting was told that, Under the Provincial Roads Improvement Project, rehabilitation and construction of 214 kilometers 9 different roads is almost complete.\nThese roads include Shah Alam to Sardaryab road, Umerzai to Harichand road, Risalpur to Jehangira road, Khairabad to Nizampur road, Aadina to Yar Hussain road, Sang e Mar Mar eastern and western bypass roads, Maqsooda to Kohala road and Haripur- Hattar Taxila road.\nIt was further told that so far over Rs 14.4 billion had been spent on these projects.\nIt was added that the 34 km long Kalam-Mataltan-Mahodand road had also been included in the provincial roads project.\nBesides, 65 percent civil work had been completed on dualization of Swabi-Mardan road and the project would be completed by December this year, so far Rs 4.4 billion have been spent on the dualization project.\nThe meeting was informed that, under the Khyber Pakhtunkhwa Rural Roads Development Project rehabilitation of 1337 km district roads would be carried out besides the construction of 62 bridges.\nMoreover, under the Khyber Pakhtunkhwa Integrated Tourism Development Project progress was being made on construction and rehabilitation of access roads to six tourism destinations in Hazara division and 11 roads to tourism sites in Malakand Division.\nSimilarly, work on the access road to the historic tourist site Sheikh Badin was also underway. Moreover, financial opening of 24 km Thandiyani road and 22 km Mankiyal road would be completed by the end of April.\nThe chief minister on the occasion termed the timely completion of those projects as one of the priority areas and directed the quarters concerned to take concrete steps for early completion of those projects without compromising the quality of work.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:42:29.063Z"
}
