{
  "title": "Air quality of Capital persistently healthy as air pollutants decline",
  "link": "https://www.app.com.pk/national/air-quality-of-capital-persistently-healthy-as-air-pollutants-decline/",
  "date_published": "2022-04-15T09:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP): The air quality of the federal capital on Friday was reported persistently healthy as the ratio of air pollutants was recorded below the permissible limits in the atmosphere due to reduced vehicular traffic in peak hours.\nThe air quality data has been collected by the Pakistan Environmental Protection Agency (Pak-EPA) that monitors air pollutants ratio for 24 hours based on three intervals of eight hours data collection from different locations.\nThe Pak-EPA data revealed that the air quality throughout the three intervals of data monitoring remained low as the pollutants were little less than the permissible limits of national environmental quality standards (NEQS).\nThe hazardous air pollutant particulate matter of 2.5 microns (PM2.5) which was a lethal atmospheric contaminant remained 18.61 microgrammes per cubic meter on average which is below the NEQS of 35 mic-programmes per cubic meter and denotes the air quality healthy.\nThe PM2.5 is generated through combustion of an engine, industrial emissions, burning garbage or inflammable material, and dust blown up by fasting moving cars plying on non-cemented patches of the roads.\nHowever, a slight jump was mainly due to congestion of automobiles plying on the roads owing to Ramzan timings during the peak working hours, he added.\nThe nitrogen dioxide (NO2) and sulphur dioxide (SO2) were recorded below permissible ratio as it were recorded 9.71 and 21.38 microgrammes per cubic meter in past 24 hours in the atmosphere against the NEQS of 80 and 120 microgrammes per cubic meter respectively.\nThese effluents were mainly produced during the operational activities of industrial plants and factories that were already under control, he said.\nHe urged the masses with respiratory diseases and other critical heart or lungs diseases to avoid prolonged outdoor visits and wear face coverings and goggles when the air quality is unhealthy while venturing outdoors.",
  "retrievedAt": "2025-08-11T14:42:31.733Z"
}
