{
  "title": "Poliovirus detected in sewage samples of Peshawar, Pishin",
  "link": "https://www.app.com.pk/national/poliovirus-detected-in-sewage-samples-of-peshawar-pishin/",
  "date_published": "2023-09-20T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): Two sewage samples collected from Peshawar and Pishin districts have tested positive for wild poliovirus (WPV1).\nThe Pakistan Polio Laboratory at the National Institute of Health notified on Wednesday that WPV1 was isolated from an environmental sample collected from Naray Khuwar in Peshawar on September 5 and from Turwa in Pishin on\nSeptember 4.\nAccording to the lab, which is also the WHO Regional Reference Lab, the Peshawar sample is connected to the virus detected in Nangarhar, while the Pishin sample is connected to a virus in Kandahar.\nFederal Minister for Health Dr. Nadeem Jan said that the presence of poliovirus on any side of the border remains a constant threat to all children everywhere.\n“A nationwide polio campaign is scheduled in October to vaccinate over 44 million under-five against this disability-causing virus. I urge parents and caregivers to ensure that their children are vaccinated in this campaign,” he said.\nDr Jan said that while the persistent detection of the virus in the environment is highly concerning, it also highlights the efficiency of the Pakistan Polio Programme’s surveillance system.\n“As two countries with historic geographic and demographic ties, Pakistan and Afghanistan cannot eradicate polio without each other, and both countries stand united in their fight against polio,” he added.\nThis is the 11th positive sample from Peshawar this year and the first positive environmental sample from Balochistan since April 2021.\nBoth districts were covered in a polio vaccination campaign at the beginning of August, while the next is planned from October 2 onwards, which will be a national drive.\nFederal Health Secretary Iftikhar Shallwani said Pakistan is committed to eradicating polio and has seen a remarkable decline in the number of cases in recent years.\n“We are fighting the virus wherever we find it, through swift and effective vaccination campaigns, and we will not rest until we have made Pakistan polio-free,” he added.\nPakistan has reported two polio cases and 24 positive environmental samples this year, while five cases have been reported in Afghanistan and 33 positive environmental samples.",
  "retrievedAt": "2025-08-11T09:43:05.436Z"
}
