{
  "title": "Rain-wind/thundershower expected in various parts of country: PMD",
  "link": "https://www.app.com.pk/national/rain-wind-thundershower-expected-in-various-parts-of-country-pmd-2/",
  "date_published": "2023-09-20T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): The Pakistan Meteorological Department (PMD) on Wednesday forecast that rain-wind/thundershower was expected in the Pothohar region, Islamabad, upper Punjab, upper Khyber Pakhtunkhwa, Gilgit-Baltistan and Kashmir during the next 24 hours, with mainly hot and dry weather for most parts of the country.\n“In Islamabad, partly cloudy weather with rain-wind/thundershower is expected. Likewise, Khyber Pakhtunkhwa will also experience partly cloudy weather, with chances of rain-wind/ thundershower in Dir, Swat, Mansehra, Shangla, Kohistan, Abbottabad, Peshawar, Mardan, Swabi, Nowshehra, Kohat and Kurram districts,” the PMD said.\nSimilarly, the PMD predicted dry weather in most districts of Punjab, however, rain-wind/ thundershower was expected in Murree, Galliyat, Rawalpindi, Attock, Jhelum, Chakwal, Sialkot, Narowal, Gujrat, Lahore, Gujranwala, Mandi Bahauddin, Hafizabad, Faisalabad, Sargodha, Khushab and Mianwali.\nIt added that hot and dry weather was expected in most districts of In Balochistan, and dry weather in most districts of Sindh with partly cloudy conditions in coastal areas.\nIn Kashmir/Gilgit-Baltistan, partly cloudy weather with rain-wind/ thundershower was expected, the PMD said.\nDuring the last 24 hours,hot and dry weather prevailed in most parts of the country.However, rain-wind/thundershower occurred in lower Sindh, Bahawalpur and Bagrote.\nThe rainfall was recorded: Badin 54mm, Sakrand 24mm, Chhor and Shaheed Benazirabad 12mm, Karachi (Keamari 11mm, Masroor Base 09mm, Surjani 08mm, Nazimabad 06mm, Faisal Base 05mm, North Karachi 04mm, University Road 03mm, Old Area Airport & DHA 02mm, Quaidabad, Saadi Town & Gulshan-e-Hadeed 01mm), and Mirpur Khas 05mm in Sindh, Bahawalpur (Airport) 09mm in Punjab, and Bagrote 03mm in Gilgit-Baltistan.\nThe highest maximum temperatures recorded were Turbat 44 C and Lasbela 41 C.",
  "retrievedAt": "2025-08-11T09:43:09.348Z"
}
