{
  "title": "ISSI joins hands with IDD of Azerbaijan",
  "link": "https://www.app.com.pk/national/issi-joins-hands-with-idd-of-azerbaijan/",
  "date_published": "2023-09-20T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):The Director General of Institute of Strategic Studies Islamabad (ISSI), Ambassador Sohail Mahmood and the Director of the Institute for Development and Diplomacy (IDD) of ADA University, Azerbaijan signed a Memorandum of Understanding in a virtual ceremony.\nWhile speaking on the occasion, Pakistan’s Ambassador to Azerbaijan Bilal Hayee suggested that both Institutes should prepare a future roadmap to strengthen their relationship including mutual exchange of resident fellows.\nHe recommended that both sides could start research collaborations on topics of mutual interest, like regional connectivity, Islamophobia, climate change, regional security issues and disputes.\nWhile admiring the dedication and efforts on both sides, Azerbaijan`s Ambassador to Pakistan Khazar Farhadov said that both Institutes could play a pivotal role in initiating intellectual discourse and public debate to strengthen bilateral relations and regional prosperity.\nThey could join hands to promote their shared history, culture and values. He emphasised organizing joint activities to anti-terrorism and misinformation.\nIn his remarks on the occasion, Ambassador Sohail Mahmood, Director General ISSI hailed the signing of the MoU.\nHe stressed that bilateral relations between Pakistan and Azerbaijan are extremely fraternal and present an example for inter-state relationships.\nBoth sides support each other in their national causes, like Kashmir and Karabakh. He appreciated Azerbaijan`s support at the OIC contact group on Jammu and Kashmir.\nHe added that bilateral relationship has grown appreciably, while there is a huge potential for future collaboration on subjects of vital interest including trade, energy, cultural and people-to-people contacts, anti-terrorism, and combating misinformation. He reiterated ISSI`s commitment to provide its platform for the promotion of the just cause and sacrifice of the Azerbaijani nation in safeguarding their sovereignty and territorial integrity. DG ISSI also thanked the two Ambassadors for their valuable support in the culmination of this initiative.\nVice Rector of ADA University, Dr. Fariz Ismailzade in his remarks, expressed his deep gratitude for ISSI. Pakistan and Azerbaijan are brotherly countries supporting each other politically, economically and diplomatically.\nBoth countries are also trying to deepen and expand their relationship in humanitarian and educational fields, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:43:27.820Z"
}
