{
  "title": "Senate Body for revival of students union after 50 years",
  "link": "https://www.app.com.pk/national/senate-body-for-revival-of-students-union-after-50-years/",
  "date_published": "2023-09-20T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):The Senate Education Committee on Wednesday deliberated at length on the revival of Students Union after half a century and maintained that it’s revival should be improvised according to new trends and mindset of the young generation.\nThe Senate Committee on Federal Education and Professional Training met on Wednesday under the Chairmanship of Senator Irfan ul Haq Siddiqui here at the Parliament House.\nThe committee while taking up the Bill titled The Islamabad Capital  Territory Student Union Bill 2023 introduced by Senator Bahramand Khan Tangi deliberated that since long serious issues related to discrimination and injustice to students obstructing their social and academic life remained un attended leading to dire consequences such as abductions and killings.\nSenator Bharamand Khan Tangi said that these issues can only be resolved through collaboration of the management and the elected bodies and a bridge between the administration and students.\nThe committee was of the view that in order to address these issues prevailing in the student community and ensure democratic and inclusive atmosphere for healthy debate and culture intellect a Student Union should be established in the Islamabad Capital Territory which will play its role as nurseries for training future leadership and will provide forums to students for constructive activities, civic life, understanding or Rights, obligations and their enforcement.\nThe committee chair Senator Irfan Siddiqui emphasised that the revival of a student Union should be drafted in a way that it must not become a hub of politics and must be above party lines.\nHe said the revival must be improvised in a way which is trendy and facilitates the students at its maximum.\nThe Committee discussed various procedures of elections in order to save the concept of Union from being politicised.\nThe committee chair deferred the voting on the bill up till the next meeting. The committee gave time to the members to thoroughly deliberate on the bill and submit appropriate amendments.\nThe committee chair also sought a comprehensive report from the Ministry on the same. The committee also directed the HEC to give its viewpoint on the matter.\nThe matter of regularisation of the services of the daily wage teachers were also discussed in the meeting.\nThe chairman committee extended the time for report and implementation by 2 weeks with the hope that the matter will be resolved with special focus on all the teachers to be regularized as per the decision of the higher courts.\nIt was also directed by the committee chair that the minimum daily wages given to the teachers be rps 35000/-.\nThe committee chair said that the matter is pending since 2018 and non implementation of the courts orders may be characterised as negligence, irresponsible behaviour and non seriousness of the Ministry, and hoped that the matter may be solved at its earliest.\nOn the matter of re-employment of contractual Montessori Teachers (BS-17) the committee was apprised that the ministry will accommodate contractual montessori teachers in upcoming projects under FDE as per feasibility with the posture that the Ministry of Education and FDE stands by them in letter and spirit.\nThe Committee also discussed the procedure, criteria and practice for rechecking of papers of various boards’ examination under the FBISE.\nThe chairman FBISE briefed the committee that once a paper is evaluated it cannot be re-assessed.\nThe chairman committee stressed whether this practice is in favour of students or not and further inquired on the international practice on this point, he said that the right of re assessment should not be taken away from the students.\nThe committee deliberated on circumstances the paper should be re-assessed in the larger interest of students.\nThe committee chairs inquired on the number of complaints reported for re-checking to which the chairman FBISE replied that around 10 to 14 pc of complaints are made for re-total.\nThe chairman FBISE explained the commmittee the entire mechanism of  marking and checking  of the papers and the services they are providing  to students in this regard.\nHe said that the FBISE upgraded the entire system and now it is computerised and the ratio of complaints has been declined he further said that after the upgradation of the system the concession of re-checking should also be removed.\nThe committee discussed at length on the impediments of the engineering technologist service structure in all engineering departments of Pakistan.\nSenator Prof Dr Mehr Taj Roghani said that engineering technologist are the backbone of engineers and deeply lamented the delay in the matter.\nIt was apprised that the summary was submitted to the cabinet however was later withdrawn.\nThe official said that political forces are alingned in the issue and powerful lobbies are at work.\nHe said that there is a tug of war between the engineers and engineering technologist and a high level board be constituted with technologist and engineers as members on equal weight age.\nThe committee chair acknowledged the concerns of the  Prof Dr Mehr Taj Roghani and directed to expedite the summary and resolve the matter amicably.\nHe also directed to hold meetings with the Chairman HEC and PEC to take the matter to its final stage and report within 2 weeks.\nThe committee also discussed the matter of acquiring of 225 kanal land by the Capital Development Authority for the construction of Bhara Kahu ByPass.\nThe committee chair commended the CDA for taking up a promt action and resolving the matter.\nEarlier in the meeting the committee offered Fateha of the late Senator Rana Maqbool Ahmed and held his services in high esteem\nThe meeting was attended by Senators Prof Dr Mehr Taj Roghani, Fawzia Arshad, Jam Mehtab Hussain Dahar and Senator Engr Rukhsana Zuberi. Representatives of attached departments were also in attendance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:43:25.877Z"
}
