{
  "title": "Zong 4G announces Huo Junli as new CEO",
  "link": "https://www.app.com.pk/national/zong-4g-announces-huo-junli-as-new-ceo/",
  "date_published": "2023-09-20T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): Zong 4G, Pakistan’s leading telecommunications company, has announced Huo Junli as the new Chairman & Chief Executive Officer (CEO), marking a significant leadership transition.\n“Huo Junli has officially taken the helm, succeeding Wang Hua, who has served as CMPak’s CEO and Chairman for over five years and will now undertake a new role within the CMCC,” a news release said on Wednesday.\nHuo Junli holds a Master’s degree in Electronics and Communications Engineering from Beijing University of Posts & Telecommunication, and a Master’s degree in Business Administration from Xi’an Jiaotong University.\n“He brings an extensive and diverse background with nearly three decades of experience in the telecommunications industry. His career, which began in 1997, has been marked by a series of notable roles within CMCC, including leadership positions such as heading the NOMC and Information Security Department for China Mobile Shanxi Province Company. In 2017, he further advanced his career as a board member and Chief Technology Officer (CTO).”\nHuo Junli, in his comments upon taking on the leadership role at Zong 4G, stated: “I am thrilled to embark on this new chapter at Zong 4G.\n“The company has a well-earned reputation for its steadfast commitment to pushing boundaries, fearlessly addressing challenges, and consistently delivering exceptional results throughout its 15-year history. I am wholeheartedly committed to guiding our journey towards excellence and playing a pivotal role in advancing and expanding the telecommunications industry in the country, aligning with the vision of a Digital Pakistan.”\n“With this transition, Zong 4G looks forward to Mr. Huo Junli’s visionary leadership, aiming to continue its commitment to delivering exceptional telecommunications services and spearheading innovation in the industry,” the press release added.\n“Mr Huo’s rich experience and expertise are well-positioned to lead the company into a promising era of expansion and digital transformation,” it added.",
  "retrievedAt": "2025-08-11T09:43:07.881Z"
}
