{
  "title": "Gandhara Corridor to connect Pakistan with Buddhist world, bill introduced by MNA Ramesh",
  "link": "https://www.app.com.pk/national/gandhara-corridor-to-connect-pakistan-with-buddhist-world-bill-introduced-by-mna-ramesh/",
  "date_published": "2024-04-03T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP): Prominent MNA Dr Ramesh Kumar Vankwani has introduced a significant bill in the parliament aimed at establishing the Gandhara Corridor to connect Pakistan with the Buddhist world.\n“This act aims to encourage uniformity of approach among all branches of government and stake holders for transforming Pakistan into a most favorite pilgrimage destination and an international hub of Gandhara tourism,” the proposed bill stated, which was submitted to the Secretary, National Assembly Secretariat, under Rule 118 of the Rules of Procedure and Conduct of Business in the National Assembly, 2007,said a press release.\n“It is expedient to establish a high level statuary body to ensure that due facilitation support at Federal level must be provided to provinces and administrative units of Pakistan for pursuing a common national cause of promoting international pilgrimage / faith tourism through a systematic promotion of the Gandhara region, encompassing Pakistan.”\nAccording to the bill, the Corridor shall be headed by the Chairperson to be appointed by the Prime Minister of Pakistan, whereas the head office of the Corridor shall be at Islamabad. However, it may set up sub-offices or representative offices at other places with in Pakistan, as it may deem appropriate.\nDr Ramesh Vankwani, in the statement of objects and reasons, took the stance that under Article 40 of the Constitution of Pakistan, the State shall foster goodwill and friendly relations among all nations as well as to support the common interests of the peoples, including of Asia. He also quoted Quaid-e-Azam as “Our foreign policy is one of friendliness and goodwill towards all the nations of the world.”\n“Establishing the Gandhara Corridor would be a game changer and a highly impressive initiative for connecting Pakistan with the Buddhist world,” he stated, emphasizing that the systematic arrival of international pilgrims will promote national economy as well as to strengthen diplomatic ties with Asian countries in accordance with the Constitution of Pakistan.\nAccording to Dr Vankwani, the 2,500-year ancient Gandhara civilization, belonging to the northern part of present-day Pakistan, reflects Buddhism’s glorious past in our region. “Today, over 7% of the world population (approximately 520 million people) is composed of Buddhists. Several Pakistan-friendly Asian countries including Japan, Koreas, China, Myanmar, Thailand, Cambodia, Vietnam, Sri Lanka, Singapore, Bhutan, Laos, and Mongolia are having large Buddhist populations,” he expressed.\n“The Gandhara Corridor may in the performance of its functions seek assistance or facilitation of any office, authority or agency working under the Federal Government, a Provincial government or a local government or of a representative designated by the provinces and territories. In this regard, provinces and territories may appoint a representative / focal-person to provide liaison and assist the Corridor in performance of its functions under this Act,” the bill stated.\nMoreover, the Gandhara Corridor aims to conduct research and analysis, enhance capacity, develop policy, and strategies, advise various branches of the Government, foreign missions, Academia, and professionals, facilitate the private sector, mobilize media, cultivate awareness, responsibility and help build capacity as individuals, establish partnerships with stakeholders and collaborations with national and international organizations for promoting and marketing Gandhara historical sites to attract international pilgrims, including Buddhists, Hindus and Jains, belonging to various countries in the best interest of Pakistan.",
  "retrievedAt": "2025-08-11T01:42:36.126Z"
}
