{
  "title": "Come out on March 27 for sake of democracy, country’s future: Qureshi urges people",
  "link": "https://www.app.com.pk/national/come-out-on-march-27-for-sake-of-democracy-countrys-future-qureshi-urges-people/",
  "date_published": "2022-03-24T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): Foreign Minister Shah Mahmood Qureshi Thursday urged the people to come out to attend the Pakistan Tehreek-e-Insaf’s public gathering in Islamabad on March 27, for sake of democracy and country’s future and to choose between good and evil.\nThe foreign minister, also the vice-chairman of Pakistan Tehreek-e-Insaf (PTI), talking to media outside the Parliament House, said Prime Minister Imran Khan had given a clear message that the people would have to choose whether to stand with good or evil.\nHe said on one side there was a gang of opportunists who had nothing to do with national interest or economy rather they were together just to pave way for the ouster of Imran Khan.\n“They neither have one manifesto nor the party flag. They have panicked the whole nation,” he remarked.\nHe urged the people to ensure their presence at Parade Ground of Islamabad on March 27.\n“We stand with Imran Khan and democracy. We are in contact with the people including from Punjab, Khyber Pakhtunkhwa and Azad Kashmir. A sea of people would emerge from KP,” he hoped.\nTo a question, the foreign minister said the government was in contact with the coalition parties. They are independent and would make the right decision at the right time, he commented.\n“We have to see as to whom the MQM will support if they part ways with the PTI. Will they support PPP against which they were protesting for discrimination against Karachi and embezzlement of funds? The whole of Sindh is protesting the PPP’s local government legislation. They (MQM) are sensible and mature people and I don’t think they will support them (PPP),” he remarked.\nThe foreign minister said the successful holding of the 48th Session of the Organization of Islamic Cooperation’s Council of Foreign Ministers had enhanced the stature of Pakistan in the whole Muslim world.\nHe said being a chair of the OIC-CFM, Pakistan would convene another ministerial meeting to discuss the ways forward for the implementation of the OIC resolutions.\nMoreover, while expressing concerns over the human rights abuses in Indian Illegally Occupied Jammu and Kashmir, Foreign Minister Qureshi said the CFM had agreed upon an action plan to effectively highlight other disputes too.",
  "retrievedAt": "2025-08-11T14:36:08.633Z"
}
