{
  "title": "IHRA to stop functioning of substandard health establishments in Federal Capital",
  "link": "https://www.app.com.pk/national/ihra-to-stop-functioning-of-substandard-health-establishments-in-federal-capital/",
  "date_published": "2022-03-24T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):The Islamabad Healthcare Regulatory Authority (IHRA) has said that substandard health establishments will not be allowed to continue work in the Federal Capital.\nAccording to an official of the authority, after observing these standards, the license would be issued to the eligible set-ups to operate in the Capital while the Authority would not allow working all such establishments with having poor service delivery system.\nHe said in order to regulate the health establishments, the Authority was working on standards. The health establishments would be examined to know whether the standards were being observed or not.\nThe steps aimed at ensuring that formal or informal and public or private healthcare services to the citizens of the Federal Capital were at par with the international standards to further internationally recognize the services also, he added.\nThe official said, “We are ready to perform our role of policing for legal health establishments also to protect citizens from wrongdoings of the health set-ups as we have been given mandate with the power to ask from these set-ups about any illegality with citizens.\n“We have field teams who conduct visits to personally monitor the standards of health facilities in the Capital, besides completing routine assessments.”\nHe said the main objective of IHRA was to regulate the healthcare services and establishments in the Federal Capital.\nThe official warned the private laboratories of action on not adopting the regulations and appropriate treatment methods for the safe disposal of infectious waste in the Capital.\n“Action will be taken against those laboratories in the Federal Capital, which are not following proper procedures for disposal of waste right from handling, collecting, transporting, discarding, and marking till incineration to avoid minimal exposure to others.\n“Infectious waste produced at the labs and hospitals is a great threat to the public health and the environment, and causes nosocomial infections if waste is not managed well,” he said.\nHe said the Authority had also started a crackdown on private COVID-19 testing laboratories in the Federal Capital on issuing fake results of the infection tests with the support of travel agents.\n“These laboratories are unlawfully giving wrong PCR test reports of coronavirus as per the desire of the people with the involvement of some travel agents.”\nIt was also observed that some labs had issued COVID-19 reports without receiving nasal or oral swab samples or even issued negative reports to the positive patients to make their\ntravelling easier with having wrong dealings with travel agents, he added.\nThe official said, “We will not allow anyone to run any such illegal business in the medical field. They are playing with the health of people while deceiving health authorities.”\nHe said the IHRA inspection teams had started surprise visits to all such labs and their collection points. The Authority had suspended the services of some laboratories while others were under observation.\n“We have started collecting data to take action and seal all such labs with the support of the local administration as we are against this unlawful practice and our policy is zero-tolerance against such illegal activity.”",
  "retrievedAt": "2025-08-11T14:36:05.704Z"
}
