{
  "title": "Govt not going anywhere, says Sh Rashid",
  "link": "https://www.app.com.pk/national/govt-not-going-anywhere-says-sh-rashid/",
  "date_published": "2022-03-24T15:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 24 (APP):Interior Minister Sheikh Rashid Ahmed has said that Punjab Chief Minister Sardar Usman Buzdar would stay in his position, and the federal government is also not going anywhere.\nAddressing a press conference here on Thursday, he said that Usman Buzdar was also standing with Prime Minister Imran Khan like a rock. He said changing parties would bring nothing good to any member of the parliament. “Switching sides can never bring respect to parliamentarians,” he added.\nHe said the nation would soon get good news. Pakistan was moving towards progress and prosperity with each passing day, and it would strengthen democracy in the country ultimately. He said that those who always sided with their party won respect from masses, adding that he respected those opposition members who stuck to their parties, as it was their moral and constitutional responsibility.\nThe interior minister said that some opposition members would also not go to parliament on the day of no-trust vote. He termed such members “responsible”, saying that they believe that it would be better if PM Imran completes his tenure.He advised the opposition to rethink the situation in view of the global scenario, as the country could not afford any unrest and chaos at this moment.\nTo a question, he said that no request had been received from the PML-N so far about their rally. The PML-N had not informed the administration when their rally would leave Lahore, and what would be their route. He said that the interior ministry should be formally requested for security arrangements accordingly.\nAbout parliamentary proceedings, Sh Rashid said it was up to the National Assembly speaker to decide when the voting on the no-trust motion would take place.The minister said that the opposition made a ‘huge mistake’ and made PM Imran Khan a hero by bringing a no-trust motion in the final year of his tenure. “We were fighting inflation and unemployment, but now people have forgotten these issues and they are standing with PM Imran Khan, ” he added.\nThe minister said that if elections are held in the country immediately, the opposition would come to know Prime Minister Imran had returned with a bigger strength and popularity.The interior minister said PM Imran Khan would address a historical public meeting at Parade Ground Islamabad on March 27. “I have never seen such an enthusiasm in the nation for its self-respect which it is exhibiting these days,” Sh Rashid added. The minister said the whole nation was standing with Prime Minister Imran Khan to safeguard its self-respect and an independent foreign policy.\nHe said that the government ally parties make their decisions after taking their time, and this time also they would make a good decision, which would be in favour of Pakistan Tehreek-e-Insaf. “We have good expectations of the allies, and they will come up to our expectations,” added the interior minister. He said there was likelihood of early elections also in the country.\nThe minister said the OIC foreign ministers conference was a historic event, which was successfully organised in Pakistan. He appreciated the Pak armed forces, the civil administration as well the PTI government for making the best arrangements for the international event.\nSh Rashid said Pakistan’s armed forces were professionally competent, and country’s judiciary was far-sighted and insightful. He said those hatching conspiracies and spreading propaganda against the Pak forces and judiciary on the social media could not escape the law, and strict legal action would be taken against such elements.",
  "retrievedAt": "2025-08-11T14:36:05.175Z"
}
