{
  "title": "Pakistan to gain influence in world with strong economy, defence: President",
  "link": "https://www.app.com.pk/national/pakistan-to-gain-influence-in-world-with-strong-economy-defence-president/",
  "date_published": "2022-03-24T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): President Dr Arif Alvi on Thursday expressed confidence that Pakistan would gain an influence in the world by making its economy stable and maintaining a strong defence line.\n“Through its integrity, economic stability, strong defence and national unity, Pakistan will emerge as a country with an impact in the world,” he said in his address to the military officers and soldiers, here at the Parade Ground.\nThe president joined the troops at the Bara Khana – a traditional joint feast for the officers and soldiers of all ranks, held at the culmination of the arrangements for the Pakistan Day parade.\nPresident lauded the finest arrangements made by the administrators of the parade on March 23, which was also witnessed by foreign delegates including the foreign ministers of the Organization of Islamic Countries.\nPresident Alvi stressed a constant vigilance to counter nefarious designs of the enemy and called for effectively addressing the emerging challenges, particularly cyber warfare.\nDr Alvi paid glowing tribute to the country’s armed forces for defending the frontiers and for their immense contribution to the sovereignty of the homeland.\n“Your immortal sacrifices for the country will never be forgotten,” he told the troops.\nHe said Pakistan Army was the only military in the world that fought the war against terrorism and extremism in a “proper and effective manner”.\nHe mentioned that the army always provided relentless services to the nation in times of natural disasters, may it earthquakes or floods.\n“We are proud of our army and believe that a strong army is vital for a strong nation,” he said.\nHe said the Pakistani nation had emerged resilient and steadfast after passing through several difficult times in its history.\nHe urged the Pakistani nation to have pride in its own values, which were imbibed with Islamic culture and ethics, and not to let the criticism of the world distract them from their goals.\nThe president recalled that in response to India’s nuclear test in 1974, Pakistan strengthened its defence line by achieving atomic deterrence in a short span of seven years.\nIn the wake of the global refugee phenomenon, he pointed out the hypocrisy of the ‘champions of the world human rights’ that let the migrants drown in the Mediterranean Sea.\nContrary to this, he said, Pakistan hosted around four million refugees from Afghanistan for over 40 years.\n“This spirit of compassion and humanity makes the Pakistani nation stand tall amongst the comity of nations,” he said.\nEarlier, President Alvi distributed shields to administrators of the Pakistan Day parade on making excellent arrangements.",
  "retrievedAt": "2025-08-11T14:36:12.828Z"
}
