{
  "article_id": "2025-01-11_46a5933cba98673c1070d1bb5d949612",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/advocate-demands-independent-commission/",
    "retrieved_at": "2025-08-27T11:32:58.651Z"
  },
  "metadata": {
    "title": "Advocate demands independent commission",
    "author": null,
    "date_published": "2025-01-11T13:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 188,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 11 (APP):Adovocate Usman Warraich, on Saturday urged to establish an independent inquiry commission to probe the matter in online trapping cases. He expressed the view along with lawyers Rana Abdul Hameed, Imaan Mazari, and parents of the affected children in National Press Club (NPC), the press release said. He emphasized that this commission should also consider the reports of National Commission of Human Right (NCHR) and Special Branch. He demanded that all proceedings in these cases be halted and innocent children be released until the commission completed its findings. He also urged forensic analysis of the mobile phones of both victims and complainants. While quoting the special Branch report, he claimed that more than 450 young Muslims have fallen victim to these fabricated cases, with more than 150 imprisoned in Adiala Jail, over 170 in Lahoreas Camp Office and Kot Lakhpat Jail, and 55 in Karachi Central Jail. These groups also pressurizing the family members of the innocent people, he said. The activities of this group extended beyond Islamabad, said Warraich. He also appealed the government to take immediate actions against those involved in online trapping.",
    "summary": "Advocate Usman Warraich demands the establishment of an independent inquiry commission to probe online trapping cases, citing reports from the National Commission of Human Rights and Special Branch.",
    "keywords": [
      "online trapping",
      "independent commission",
      "Usman Warraich",
      "Rana Abdul Hameed",
      "Imaan Mazari"
    ]
  },
  "entities": [
    {
      "id": null,
      "name": "Usman Warraich",
      "type": "PERSON"
    },
    {
      "id": null,
      "name": "Rana Abdul Hameed",
      "type": "PERSON"
    },
    {
      "id": null,
      "name": "Imaan Mazari",
      "type": "PERSON"
    },
    {
      "id": null,
      "name": "National Commission of Human Rights (NCHR)",
      "type": "ORGANIZATION"
    },
    {
      "id": null,
      "name": "Special Branch",
      "type": "ORGANIZATION"
    }
  ]
}