{
  "title": "Railway Police reunites 37 children with their parents",
  "link": "https://www.app.com.pk/national/railway-police-reunites-37-children-with-their-parents-2/",
  "date_published": "2024-05-26T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP): The Pakistan Railway Police have reported reuniting 37 children, both boys and girls, with their parents after finding them wandering at various railway stations or travelling on trains across the country over the past two weeks.\nThe Rawalpindi division reunited nine children, while the Lahore and Peshawar divisions each reunited six children, official sources in the Railway Police told APP.\nThey said the Multan and Sukkur divisions found three children, while the Karachi and Quetta divisions reunited seven and three children, respectively. Additionally, the police returned lost luggage and goods to 60 passengers.\nTo a question, they said the department collected Rs 74.8 million from ticketless passengers during a four-month crackdown, assisted by railway police and train staff.\nApproximately 58,446 passengers were caught travelling without tickets, and the collected fines were deposited in the department’s official bank account, they added.\nThey emphasised that crackdowns on ticketless travel are a daily occurrence, and violators are charged for the full journey plus a penalty. Those unable to pay are handed over to the railway police.\nOver the past year, they said the Pakistan Railway Police arrested 3,923 individuals for various rule and law violations, registering 3,625 cases across the eight railway divisions.\nThey said the case distribution includes 658 in Peshawar, 577 in Rawalpindi, 1,044 in Lahore, 326 in Mughalpura workshops, 393 in Multan, 208 in Sukkur, 346 in Karachi, and 73 in Quetta.\nThe sources said that help desks have been established at all major railway stations to support passengers. Despite limited resources, the performance of the railway police has been satisfactory, with expectations for further improvement in the coming year.",
  "retrievedAt": "2025-08-11T02:44:39.437Z"
}
