{
  "title": "Oil, Gas Conference Pakistan-2024 set for May 29",
  "link": "https://www.app.com.pk/national/oil-gas-conference-pakistan-2024-set-for-may-29/",
  "date_published": "2024-05-26T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):The Oil and Gas Conference Pakistan (OGCP-2024), aimed at showcasing Pakistan’s potential in the energy sector, focusing on advancements in domestic production, exploration, and sustainable practices, is set to take place here on May 29.\nThe event, organized by Energy Update in collaboration with the Ministry of Energy (Petroleum Division) and the Oil and Gas Regulatory Authority (OGRA), promises to be a landmark gathering for Pakistan’s energy sector, according to M. Naeem Qureshi, Chairman of the Organizing Committee, here on Sunday.\nKeynote speakers, panelists, and distinguished guests at OGCEP-2024 would include Masroor Khan, Chairman of OGRA; Iqbal Z. Ahmed, Chairman; Adil Khattak, MD-ARL; Shahzad Safdar, OGDCL; Shahid Khaqan Abbasi, former Prime Minister; Barrister Sarah Kazmi, Partner at Energy Resource Management; Sarmad Hassan Shareef, PEPL; Razi Uddin Razi; Dr. Saeed Jadoon; Shahbaz Tahir Nadeem, Joint Secretary, Ministry of Energy (Petroleum Division); Bilal Jabbar, CEO of Noor LPG/LPG Marketing Association.\nThe chief guests will be Dr. Musaddiq Malik, Minister of Energy (Petroleum Division), and Mr. Ahsan Iqbal, Federal Minister for Planning, Development, and Special Initiatives.\nQureshi said that the conference would explore strategies for enhancing energy security, reducing import reliance, and promoting local energy resources.\nThe event would feature a diverse range of sessions covering key themes such as exploration and production strategies, renewable energy integration, regulatory frameworks, technological advancements, and investment opportunities, he added.\nHe encouraged industry stakeholders, investors, government officials, and energy enthusiasts to participate actively in OGCEP-2024.\nRegistration details, sponsorship opportunities, and event updates can be found on the official OGCEP-2024 website or by contacting Energy Update at www.energyupdate.com.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:45:01.725Z"
}
