{
  "title": "Sensitising public about heatwave coping measures key, climate change ministry official",
  "link": "https://www.app.com.pk/national/sensitising-public-about-heatwave-coping-measures-key-climate-change-ministry-official/",
  "date_published": "2024-05-26T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP): Pakistan has been experiencing a rise in deadly heatwaves due to global warming in recent years and the increasing heat during the summer months poses a significant risk to people’s health.\nA media spokesperson for the Ministry of Climate Change and Environmental Coordination, Muhammad Saleem Shaikh emphasised the importance of avoiding unnecessary heat exposure to minimize the toll on people’s health. He warned that the situation could be more problematic and serious for children, elderly men and women that weak immune systems.\nHowever, individuals have to constantly protect themselves from annoying health problems by all possible means, particularly by avoiding unnecessary outdoor activities during peak hot hours from 11:00 am to 3:00 pm, the senior official said.\nThe official emphasised that while anyone could be affected by heatwaves, pregnant women seem to be more at risk. He said that it is important that pregnant women avoid going out during high temperatures. According to the US Centers for Disease Control and Prevention study findings, pregnant women are more likely to develop heat exhaustion, heat stroke or other heat-related ailments sooner than non-pregnant women, he explained.\n“This is because the bodies of both the pregnant woman and the developing baby need to work harder to cool down during harsh summer months,” the Saleem explained. He highlighted that pregnant women are also more prone to dehydration, which can lead to symptoms such as increased thirst, dry mouth, increased heart rate, little to no urination, fever, irritability, and diarrhoea.\nHowever, he said keeping the body cool and hydrated is extremely important for pregnant women, and wearing loose-fitting comforting clothes can also regulate body heat and temperature for them.\nQuoting study findings of the World Weather Attribution, the official said that extreme heat during the pre-monsoon season is becoming more frequent and intense in South Asian countries including Pakistan, Bangladesh and India, putting the lives and livelihoods of the people at risk.\nHe recalled that the World Weather Attribution’s two previous research studies conducted in 2022 and 2023 found that more intense and frequent heatwaves are 30 times more likely to happen in coming years, posing grave risks to the people, their health and livelihoods.\nBesides the health sector, agriculture sector is particularly at risk from exacerbating heatwaves, the official pointed out. “The prolonged wave of heat could also lead to a large impact on agriculture, adversely affecting soil moisture, causing crop damage and resulting in a significant drop in crop yields,” the ministry official Saleem Shaikh explained.\nHe suggested that introducing and promoting heat-resilient and water-efficient food crops was direly needed to offset possible adverse fallouts of intensifying heatwaves on agriculture and to stave off resultant rise in hunger and malnutrition, particularly among poverty-stricken and marginalized segments of society.\nThe ministry official said that the climate change and environmental coordination ministry is closely monitoring the ongoing heatwave situation and its impacts on, inter alia, highly vulnerable health, education, agriculture and water sectors.\nThe spokesperson pointed out that the PM’s Coordinator on Climate Change and MNA Romina Khurshid Alam has already directed the federal and provincial disaster management authorities, health and education departments to increase their collaboration and cooperation to effectively cope with the impacts of heatwaves.\nHe said further that these government organisations have also been asked to enhance public awareness at all levels about possible heatwave coping measures and make necessary arrangements at health facilities, schools and public places including setting up cooling places, installing drinking water kiosks, sun shades in markets, bus stops, hospitals and educational institutions. So that, people are protected from possible heatwave-related illnesses and mortalities are avoided, Saleem shaikh added.\nHighlighting importance of the public awareness about coping measures to tackle heatwave impacts, he said that the public’s knowledge, awareness, behaviour and practising heatwave risk management measures are important factors for reducing the health impacts of heatwaves and possible morbidities and mortalities.\nGiven the realisation, a public awareness campaign has already been launched by the national and provincial disaster management authorities and health federal and provincial departments on the directives of the PM’s coordinator Romina Khurshid Alam, the official said.\n“To counter the adverse impacts of the severe ongoing heatwave spell in the country’s various parts measures are being taken to spread mass awareness for the public through adopting preventive measures about heat waves and to reduce its impacts through issuing advisories, public service messages, and awareness campaigns through television, radio and social media platforms,” he explained.",
  "retrievedAt": "2025-08-11T02:44:14.922Z"
}
