{
  "title": "Salik, Ramesh discuss initiatives for protecting minorities rights in country",
  "author": null,
  "content": "ISLAMABAD, Jan 9 (APP): Federal Minister for Overseas Pakistanis and Human Resource Development, Chaudhry Salik Hussain on Thursday met with Minister for Human Rights and Minorities, Ramesh Singh Arora, to discuss initiatives for protecting minority rights in the country.\nIn a statement here, Chaudhry Salik Hussain reiterated the government’s commitment in safeguarding minority rights, emphasizing that the government is dedicated for protecting all rights of minorities in the country.\nHe announced plans to introduce minority quotas in demands from countries seeking Pakistani workers, ensuring fair selection and equal opportunities for minorities.\nThe minister also highlighted the importance of technical training courses in enhancing skills and employment opportunities for minorities.\nHe assured that the government would provide training programs tailored to market demand, enabling minorities to contribute to the national economy.\nRamesh Singh Arora appreciated the government’s efforts to promote tourism, issue minority cards, and protect the heritage of the Sikh community.\nHe noted that there are approximately 2.8 million minorities living in Punjab, who have a deep affection for Pakistan.\nRamesh Singh Arora emphasized the need for a proper secretariat for the Pakistan Gurdwara Committee and the Pakistan Sikh Gurdwara Parbandhak Committee (PSGPC).\nHe also highlighted his efforts to facilitate meetings between the foreign Sikh community and ambassadors in Pakistan, showcasing Pakistan as a safe country for minorities.\nChaudhry Salik Hussain assured his commitment to minority rights initiatives, providing every opportunity for minorities to contribute to Pakistan’s economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:29:37.834Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/salik-ramesh-discuss-initiatives-for-protecting-minorities-rights-in-country/",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T14:03:00.000Z"
}
