{
  "title": "NA body resolves to ensure MDCAT transparency",
  "author": null,
  "content": "ISLAMABAD, Jan 09 (APP):National Assembly Standing Committee on National Health Services, Regulation and Coordination on Thursday resolved to ensure that the future MDCAT exams are transparent, fair and equitable for all students across the country.\nThe meeting which was held under the chairmanship of Dr. Mahesh Kumar Malani, proposed the implementation of a single national curriculum to avoid regional disparities in the education system.\nA final decision on these matters will be taken in future meetings based on legal reviews and additional consultations with relevant stakeholders.\nThe committee underscored the need to strengthen country’s healthcare sector.\nThe discussions revolved around critical concerns aiming at reforming the MDCAT examination system along with future recommendations to conduct fair exams.\nThe Committee deferred “The Pakistan Nursing Council (Amendment) Bill, 2024”, moved by Syed Rafiullah, MNA and “The Pakistan Pharmacy (Amendment) Bill, 2024”, moved by Abdul Qadir Patel due to absence of the movers.\nThe committee discussed the “Pakistan Medical and Dental Council (Amendment) Bill, 2024” and the “Islamabad Healthcare Regulation (Amendment) Bill, 2024”, moved by Ms. Shaista Pervaiz, MNA.\nThe committee pointed out that the regulation of ‘psychologists’, a growing profession that remained largely unregulated despite the increasing demand for mental health services across Pakistan.\nThe committee recommended to regulate the profession of psychology to ensure that mental health professionals were properly certified and practicing in line with legal and international standards.\nThe committee addressed several concerns regarding the MDCAT exam process.\nIssues related to out-of-syllabus questions in the exam papers were raised by students, prompting a review of the exam’s structure.\nIt was highlighted that many such questions were deleted, and a revised answer key was uploaded to address these concerns.\nThe committee members voiced their concern that question papers should be accurate from the outset, to avoid the need for post-exam deletions.\nThe committee proposed making juvenile cards mandatory for biometric verification, similar to the practice in A-levels and O-levels, to prevent impersonation and enhance security during the registration process.\nThe registration process itself also came under scrutiny, as the software used by PMDC had loopholes that led to errors.\nThe committee emphasized that such issues should be rectified for future exams to ensure a smoother registration process.\nIt was further suggested that the MDCAT exam process be decentralized, with provinces given greater autonomy in conducting the exams, while PMDC should focus on overseeing the the licensing exams.\nThis proposal was made to avoid the current centralization that was seen to contribute to inconsistencies in the examination process\nThe issue of supplementary students appearing in the MDCAT, 2024 retest also sparked debate.\nThe committee expressed grave concerns about including these students in the 2024 MDCAT cycle, as it could disadvantage regular students who had completed their education on time.\nThe committee unanimously agreed that supplementary students should be excluded from this year’s exam and allowed to take it in the following year.\nA legal review will be conducted to determine the best course of action on this matter.\nIn terms of future reforms and based on the Committee’s previous recommendations PMDC agreed to form a high-powered subcommittee tasked with revising the MDCAT syllabus, developing a common question bank and ensuring that candidates appear for the exam only in their region of domicile.\nPMDC will also review the current practice of conducting the MDCAT before the declaration of complete intermediate result.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:30:04.292Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-body-resolves-to-ensure-mdcat-transparency/",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T13:03:00.000Z"
}
