{
  "title": "Reduction of iTFAs through policy implementation saves lives: CGPA",
  "author": null,
  "content": "ISLAMABAD, Jan 9 (APP):The Centre for Governance and Public Accountability (CGPA) on Thursday called for food law and standards enforcement agencies to start enforcement of a less than 2% limit of industrially produced trans fats (iTFAs) to protect people from cardiovascular and metabolic ailments such as heart attacks, diabetes, cancers, and obesity.\nCGPA organized the event with support from Nutrition International (NI), in which senior officials from provincial and regional food authorities and the Director General, of Pakistan Standards and Quality Control Authority (PSQCA), Taufeeq Abbasi, participated, said a press release.\nWhile talking at the event DG PSQCA, Taufeeq Abbasi, said that making policy was important, but implementation was more important, adding that “PSQCA has already developed a mandatory Pakistan Standard 221-2023 in June 2023 that focused not more than 2% iTFAs in banaspati ghee.\n“However, now we need to have a strategy to implement the policies across the country with the help of CGPA and NI, who have taken this initiative and added civil society voice and supporting the government in the drive to implement the standard and eliminate iTFAs from the food supply,” Abbasi added.\n“We have more than 60% of deaths due to various diseases in which food-related risk factors played an important role,” said Muhammad Anwar, Executive Director of CGPA, by adding that the iTFA were harmful to the whole body, including the heart, and around 29% of deaths happen because of cardiac problems.\nProject Manager, Edible Oil Fortification, Zameer Haider spoke, “NCDs are rising alarmingly and causing disabilities and deaths, we could prevent them by focusing on both the dietary and lifestyle risk factors and also the reduction of iTFA, which can help save precious lives from premature deaths, diseases, and disabilities.”\nFarha Ather, Deputy Director, Punjab Food Authority (PFA), who also participated in the event, said, “We have to go the perspective and a clearer idea on how to operationalize the reduction strategy for implementation,” adding, “Now this is the time that mere talk about iTFA elimination is not enough, and concrete actions must be taken.”\nDirector, Khyber Pakhtunkhwa Food Safety and Halal Food Authority, Dr. Abdul Sattar said, “In KP, we have a number of complaints about partial hydrogenation processes that add iTFAs in ghee, and it is time to take action by implementation.”\nThe World Health Organization has prepared a detailed plan of action for iTFA reduction in food supply and CGPA was helping government agencies to use the plan of action, incorporate it in their monitoring and evaluation processes, and develop reporting mechanisms, said Zubair Faisal Abbasi, Advisor to CGPA on food and health governance, adding that “With enforcement plans and implementation modalities in place, the country will qualify for validation by WHO, and it will not only ensure food safety and disease prevention but create a sense of national pride in the comity of nations.”\nDr. Tahira Siddique, Deputy Director of the Islamabad Food Authority; Ali BuxSomro, Director of PSQCA; Mahwish Khadim, Kashmir Food Authority; Dr. Ali Ahmad Shaikh, Director of Sindh Food Authority; Naqeeb Ullah, Director of Balochistan Food Authority; and Wahab Ferozdin, Advisor, Ministry of Science and Technology also spoke on the occasion, emphasizing the need for a speedy transition from policy to action.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:30:27.493Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/reduction-of-itfas-through-policy-implementation-saves-lives-cgpa/",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T11:33:00.000Z"
}
