{
  "title": "Govt releases Rs 46.326 bln for various water schemes so far in fiscal year 2022-23",
  "link": "https://www.app.com.pk/national/govt-releases-rs-46-326-bln-for-various-water-schemes-so-far-in-fiscal-year-2022-23/",
  "date_published": "2023-04-05T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 5 (APP): The government had released an amount of Rs 46.326 billion for various water resources schemes under the annual Public Sector Development Programme (PSDP) so far in the current fiscal year 2022-23, said an official data issued by the Planning Commission here on Wednesday.\nAccording to details, the government had specified a sum of Rs 97.559 billion for various projects in PSDP 2022-23.\nOut of the total release amount, the local component stood at Rs 38.172 billion while the foreign aid component was Rs 8.153 billion. A sum of Rs 42.447 billion had been spent on various water-related projects so far.\nThe Ongoing schemes included 13 hydel and 61 water sector projects, whereas the new projects were only 13 in total.The allocation of ongoing hydel projects included Rs 55,383 million for Dasu Hydropower Project (2,160 MW), Rs 12,083 Neelum Jhelum Hydropower Project (696 MW), and Rs 12,000 million for Tarbela fifth Extension Hydro Power Project (1,410 MW).\nAmong the ongoing water sector projects, Rs 20,000 million each was allocated for Diamer Basha Dam Project and K-4 Greater Water Supply Scheme (260 MGD), Rs 12,060 million for Mohmand Multipurpose Dam Project, Rs 7,000 million for Diamer Basha Dam Project (Land Acquisition and Re-settlement), and Rs 5,000 each for Nai Gaj Dam Project Dadu (Sindh) and Karachi Canal Project (Phase-I) Dera Bugti, Naseerabad, Bolan and Jhal Magsi.\nThe major allocation for new schemes included Rs 500 million for the Chashma Right Bank Canal Left Cum Gravity Project and Rs 300 million each for the construction of five small dams Salari-2 Dam, Rai Jo Da Dam, Shalmani Dam, Garwari Dam, and Amari Dam in Kohistan Dadu, and six small dams including Densi, Kcodal, Kambowah, Khiropora and others in District Zhob and Sherani.",
  "retrievedAt": "2025-08-11T08:13:23.330Z"
}
