{
  "title": "Govt wants to hold elections after completing census: Dastagir",
  "link": "https://www.app.com.pk/national/govt-wants-to-hold-elections-after-completing-census-dastagir/",
  "date_published": "2023-04-05T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 5 (APP):Minister for Energy Engineer Khurram Dastagir Khan on Wednesday said that the coalition government wanted to hold general elections after completing the most important task of census and delimitation.\nWithout completion of the task of census and delimitation, the election results could not be made transparent, he expressed his fear while talking to a private television channel. Organizing elections with old data of population or census, would create many issues for political parties and ECP, he added.\nThe minister said that the incumbent government is engaged in collecting data of the population through the census. He said security has been deployed to various parts to finish the process of the census. The Election Commission of Pakistan would have the requirement of security for polling stations and a heavy amount to bear the responsibility of the next elections in the country, he said.\nIn October, he said the government would provide all required security and finance to ECP to arrange\npolling in Pakistan.\nCommenting on the court decision over the elections, he said that all the political partners would discuss the issue of early elections at the forum of parliament. Khurram Dastagir said that coalition partners had expressed reservations over the court verdict regarding elections.\nHe said that a larger bench could help resolve the issue being faced by the political parties about elections. He suggested that next elections could be conducted in October and the people of four provinces could elect their representatives in a befitting manner.\nHe hoped that Pakistan Muslim League-N, would win the next elections with thumping majority.",
  "retrievedAt": "2025-08-11T08:13:12.697Z"
}
