{
  "title": "Constitution of Pakistan being included in syllabus: Rana Tanveer",
  "link": "https://www.app.com.pk/national/constitution-of-pakistan-being-included-in-syllabus-rana-tanveer/",
  "date_published": "2023-04-05T12:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP): Minister for Federal Education and Professional Training Rana Tanveer Hussain on Wednesday said that the Constitution of Pakistan is being included in the syllabus on an urgent basis to promote awareness among students about the importance of the Constitution and how it guarantees their fundamental rights and freedom.\nHe was addressing the concluding ceremony of IBCC National Inter-boards bilingual declamation competitions, held in lieu of the Golden Jubilee of the Constitution of Pakistan, at Allama Iqbal Open University (AIOU) Islamabad in which students from all over Pakistan participated.\nOn the occasion of the 50th anniversary of the Constitution of Pakistan, the Inter Board Committee of Chairmen (IBCC) organized the Inter-Board Bilingual Declamation Competition in three different phases i.e on the board level, province level, and on the national level.\nThe theme for the competition was “My Constitution-Guarantee of My Freedoms,” which was held in both English and Urdu languages, and the participants presented their speeches with great zeal and enthusiasm.\nThe Minister congratulated the students for their outstanding performance and emphasized the significance of the Constitution in safeguarding the rights of the citizens.\nHe encouraged the students to continue their efforts to promote awareness about the Constitution and its role in shaping the country’s future.\nAddressing the closing ceremony, the Minister said that “The Constitution of Pakistan 1973 guarantees fundamental rights to the citizens of Pakistan, including the right to life, liberty, and education. Minister said that Pakistan is among the top five countries with the highest figures for out-of-school children globally.\nHe added, as per NCRC report, Pakistan has 22.8 million children between 5 and 16 years old – the world’s second highest number of out-of-school children”.\nHe further said, “By June 2023, no child in Islamabad will be deprived of the basic right of education”.\nHe advised the students to adopt a positive approach rather than only criticizing everything.\nThe IBCC Secretary, Prof Dr Ghulam Ali Mallah, appreciated the efforts of the students and expressed his gratitude to the Minister for his support in organizing the event.\nHe highlighted the importance of such competitions in promoting the culture of public speaking and instilling a sense of responsibility among the youth towards their country.\nDr Mallah also expressed his gratitude to Prof. Dr. Nasir Mahmood, Vice-Chancellor AIOU, Dr. Ikram Malik, DG FDE and Ms. Zia Batool, Chairperson PEIRA for their kind support in making this competition a memorable one.\nThe closing ceremony was also attended by Ex-Senator Farhat Ullah Babar, Ms. Zeb Jaffar Parliamentary Secetary, Ms. Wajiha Qamar Parliamentarian, Vice Chancellors, Chairmen BISE’s, professors, teachers, and students.\nThe competition concluded with the announcement of the winners. The participants were awarded shields, for their outstanding performance.\nThe event was a huge success and served as a great platform to promote awareness about the Constitution and its significance in guaranteeing the fundamental rights and freedoms of the citizens.",
  "retrievedAt": "2025-08-11T08:13:20.827Z"
}
