{
  "title": "Delay in IMF agreement due to demand for fulfilling external funding requirements: Pasha",
  "link": "https://www.app.com.pk/national/delay-in-imf-agreement-due-to-demand-for-fulfilling-external-funding-requirements-pasha/",
  "date_published": "2023-04-05T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP): Minister of State for Finance and Revenue, Dr Aisha Ghaus Pasha on Wednesday said the International Monetary Fund (IMF) staff level agreement was facing delay due to its demand for fulfilling external funding requirements for debt repayments.\nSpeaking in National Assembly during Question Hour, she explained the current status of IMF loan talks at the government level.\nPasha said the previous regime not only contravened the conditions agreed with the IMF, but took steps in opposite direction that incurred a permanent damage to the country.\nMNA @MaulanaChitrali raised the issue pertaining to the salaries of the Lecturers of Model Colleges of Islamabad.#NASession pic.twitter.com/AK0U2Brk9g\n— National Assembly of  (@NAofPakistan) April 5, 2023\nShe was responding to the queries of MNAs Aliya Kamran of MMAP and Sardar Talib Hassan Nakai pertaining to current status of agreement with IMF.\nThe Minister said the government had to take confidence building measures after resumtion of talks with the IMF that resulted due to compromised credibility of the country due to previous regime’s conduct.\nShe said that the coalition government managed the 7th and 8th reviews of the IMF with great efforts and the Fund made the government to take prior actions till the 9th review that had totally been implemented.\nDr Pasha informed after meeting the requirement of external funding requirements, the staff level agreement would be done which earlier used to be done without any hustle as currently the trust deficit resulted in these nuisances.\nShe further informed that friendly countries like China were cooperating in this regard and extended its full support. However, the Kingdom of Saudi Arabia had also hinted at assistance whereas the country also hoped to get relief from the United Arab Emirates (UAE) as well that would help overcome the issue.",
  "retrievedAt": "2025-08-11T08:13:21.779Z"
}
