{
  "title": "Govt. provided free flour to deserving families despite economic challenges: Abbasi",
  "link": "https://www.app.com.pk/national/govt-provided-free-flour-to-deserving-families-despite-economic-challenges-abbasi/",
  "date_published": "2023-04-05T09:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 5 (APP): Minister for Parliamentary Affairs Murtaza Javed Abbasi on Wednesday informed the National Assembly that despite facing difficult economic challenges, the incumbent government provided free flour to deserving families under the Ramazan Package.\nResponding to a calling attention notice regarding incidents of loss of precious human lives during flour distribution in the country, he said the government, in line with directives of Prime Minister Shehbaz Sharif, was making all-out efforts to execute the initiative of free flour distribution without hurting the self-respect of any citizen.\nAbbasi said that the prime minister himself visited the flour distribution points established across the country to review the arrangements made by the government to alleviate the financial sufferings of the common man.\n“The government is taking all possible measures to reduce the difficulties of poor people during the holy month of Ramazan,” he added.\nAbbasi said the government was well aware of the difficulties being faced by the masses due to high inflation and fully determined to provide maximum relief to them through various initiatives.\nCommenting on the price-checking mechanism in the federal capital, he said the district administration was regularly checking the price across the city. “No one will be allowed to overcharge,” he assured.\nMember of National Assembly Aliya Kamran complained that people of the country were facing high inflation and there was no mechanism to check the overpricing.\nShe asked the government to take steps to overcome the difficulties being faced by the people in Ramazan.\nWhereas, Federal Minister for Economic Affairs Sardar Ayaz Sadiq suggested snap-checking by the district administration to check the price of edible items in the month of Ramazan.\nThe minister noted that it was an international practice to decrease the prices of edible items before any festival, but it was unfortunate in Pakistan some elements remained indulged in making an extra buck.",
  "retrievedAt": "2025-08-11T08:13:25.305Z"
}
