{
  "title": "NA Speaker demands MNAs moving questions to ensure presence during question hour",
  "link": "https://www.app.com.pk/national/na-speaker-demands-mnas-moving-questions-to-ensure-presence-during-question-hour/",
  "date_published": "2023-04-05T08:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP): Speaker National Assembly Raja Pervez Ashraf on Wednesday took serious note of the absence of many members of the lower house (MNAs) during the question hour and demanded the MNAs moving questions to ensure their presence during the QA session.\nThe Speaker while chairing the 51st session of the Assembly took the questions for oral answers and their replies and started calling the movers of different questions where a noticeable number of members were absent.\nThe Speaker resented the absence of the MNAs and said that question hour was a significant part of the proceedings of the house and their presence was equally important as they had the background knowledge on their queries and could raise supplementary questions on the issues of public importance.\n“This should never become a practice as if that I am the question of someone else but is raised by others,” he said.\nExpressing his point of opinion, MNA Munawar Talpur of PPPP said question hour was important and this has been a tradition earlier that if a mover was absent then the present members used to raise that query on his behalf.\nMNA Sheikh Rohale Asghar of PML-N said it was the prerogative of the Speaker to allow other members to raise the questions on absent members’ behalf and was also discontinued from his side.\nParliamentary Secretary for Overseas Pakistanis and Human Resource Development, Syed Agha Rafiullah said it was an important part of the lower house’s business and an opportunity to raise public importance issues that were lingered on by the bureaucracy. It mostly helped a lot in resolving such public issues facing red-tap hiccups.\nTherefore, the Speaker should allow other members to raise questions on the absent mover’s behalf, he added.\nMNA, Maulana Abdul Akbar Chitrali of MMAP said the MNAs were custodians of the oath taken under the name of the Almighty that bound them under an agreement with the nation and the Almighty that should be upheld at all costs.\nFederal Minister for Human Rights, Mian Riaz Hussain Pirzada said it was the practice that present MNAs used to present the questions of the absent movers but it always consumed the time of the rest of the movers who were present and awaited for their turn long debates on the prior questions.",
  "retrievedAt": "2025-08-11T08:13:24.096Z"
}
