{
  "title": "MNAs call govt to check under-invoicing of export commodities damaging economy",
  "link": "https://www.app.com.pk/national/mnas-call-govt-to-check-under-invoicing-of-export-commodities-damaging-economy/",
  "date_published": "2023-04-05T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP): The members of the National Assembly on Wednesday demanded the government to check the under-invoicing of export commodities particularly produce of fisheries, meat, vegetables and others that were damaging the national economy.\nDuring the question hour session of the 51st meeting of the Assembly, MNA Mahmood Baqi Moulvi of PTI in a supplementary question underscored that many export commodities mainly meat, fisheries and vegetables were exported on 40-50 percent less international market prices.\nMoulvi suggested that the government should impose minimum export price as of rice on other export goods that would help improve foreign exchange revenue.\nMNA, James Iqbal of MMAP in his question sought response from the Federal Minister for Commerce on livestock animal and red meat export causing shortage of meat and price hike in the commodity at the local level.\nHe also demanded response on sugar exports despite shortage in the country and also queried the status of the commodity in the country.\nFederal Minister for Commerce, Syed Naveed Qamar replied that there was no meat shortage in the country rather it was working out to manage supplies of different categories of meat to make up both local and international demands to earn precious foreign exchange.\nHe also agreed with MNA Moulvi that many of the proceeds of the exports under-invoiced which were mainly due to uncertain dollar prices that led to speculated invoices by the exporters.\nMNA Tahira Aurangzeb of PML-N raised the query pertaining to smuggling of livestock animals mainly lamb and tail sheep to Afghanistan. She also noted that the livestock and poultry items were not imported rather locally raised but despite that these commodities were very expensive.She sought for government measures to curb this practice.\nMinister for Commerce, Syed Naveed Qamar responded that every item was related to transport which was connected to international market prices of fuel and feed of animals which caused an increase in its prices.He added that unless the prices of these commodities were not regulated then the smugglers would enjoy that incentive as they did for the past many centuries.\nQamar added that the government could only regulate the prices of livestock animals like that of sheep and lamb to a certain level not completely,\nMNA Sardar Talib Hassan Nakai of PTI queried that how many sugar stocks were available in the national reserves and how much of it was exported?\nSyed Naveed Qamar informed that the country after many years started exporting sugar whereas it had exported some 170 million metric tonnes of sugar so far and still had further room for further exports.\nHe added that there had been sugar imports in a certain period of time but this year there was a surplus of sugar.\nQamar said exports were the only way out to address the current economic crisis. Any halt in exports would result in a rise in unemployment and inflation, he added.\nMoreover, the country had surplus wheat production in the previous year but this year the crop yield was less and that’s why the commodity was being exported, he said.",
  "retrievedAt": "2025-08-11T08:13:24.839Z"
}
