{
  "title": "Pakistan, Portugal discuss bilateral, regional, global issues",
  "link": "https://www.app.com.pk/national/pakistan-portugal-discuss-bilateral-regional-global-issues/",
  "date_published": "2024-04-24T13:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP): Speaker of the National Assembly Sardar Ayaz Sadiq Wednesday said that Pakistan and Portugal enjoy a multifaceted and friendly relationship marked by shared interests and a common stance on various regional and international matters.\nIt is high time to enhance political, cultural, economic, and people-to-people connections between the two countries the speaker said during a meeting with the Portuguese Envoy to Pakistan, Manuel Frederico Pinheiro Da Silva, who called on him, said a news release.\nIn the meeting, the two sides discussed various bilateral, regional, and global issues. They expressed contentment with the current state of bilateral relations and reaffirmed their joint resolve to further expand and diversify mutually beneficial cooperation.\nWhile discussing parliamentary relations, the Speaker underscored the importance of parliamentary diplomacy in strengthening bilateral ties, particularly through expanding cooperation between parliamentary friendship groups and the exchange of parliamentary delegations.\nHe also mentioned extending the invitation to his Portuguese counterpart to visit Pakistan along with the parliamentary delegation.\nDiscussing trade and economic cooperation, the Speaker mentioned Pakistan’s proactive efforts in creating a conducive environment for economic and trade activities, providing friendly countries with significant investment opportunities and benefits.\nThe Speaker also highlighted that Pakistan has ample tourism opportunities, especially ancient Buddhist heritage can be a potential driver for closer ties between the two nations.\nThe Ambassador expressed gratitude for the Speaker’s kind remarks and reiterated that Portugal views Pakistan as an important regional stakeholder.\nHe expressed a desire to further strengthen linkages in areas of mutual interest, in addition to fostering parliamentary and cultural exchanges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:05:01.341Z"
}
