{
  "title": "Qaiser, delegation discus investment potential in KPT, other ports",
  "link": "https://www.app.com.pk/national/qaiser-delegation-discus-investment-potential-in-kpt-other-ports-2/",
  "date_published": "2024-04-24T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP): A delegation of Hutchison Group, a globally renowned network in port and logistics operations called on Federal Minister for Maritime Affairs Qaiser Ahmed Sheikh on Wednesday and discussed investment potential expansion projects in Karachi Port Trust (KPT) and possibly other strategic ports across the country.\nThe meeting was attended by Federal Secretary Maritime Affairs Dr Iram, Chairman Karachi Port Trust (KPT), Chairman Port Qasim Authority and other senior officials of the Ministry. The delegation consisted of senior executives of Hutchison Ports, Regional Head of Hutchison Ports Andy Sui, Country Advisor HP, GM SAPT Unit Changsu Key, GM KICT, Alvin Chu, said a press release.\nThe proceedings began with welcome remarks by Federal Minister Qaiser Ahmed Sheikh, who emphasized the importance of the visit and mutual commitment to strengthen Pakistan’s maritime infrastructure.\nThe minister urged the participants to give concrete shape to the potential projects that would facilitate concrete deliberations for actionable results. He stressed the indispensable role of port development in driving overall economic growth.\nAndy Sui presented his strategic vision to expand port facilities and strengthen connectivity in the region. In explaining the proposed infusion of $1 billion, he unveiled a more proactive investment strategy. Specifically, an initial tranche of $ 200 million is to be earmarked for immediate implementation, with the remainder for phased implementation.\nHe added that the focus of the investment strategy is to expand logistics infrastructure, including setting up of modern warehouses, storage facilities and depots. Additionally, the project includes the construction of modern road networks and the integration of technology to improve operational efficiency and bring transhipment handling capabilities to global standards.\nHutchison Ports, which currently operates through KPT’s two terminals Karachi International Container Terminal (KICT) and South Asia Pakistan Terminals Limited (SAPTL), has partnered with the Federal Ministry of Maritime Affairs to develop port facilities.\nThe federal minister said that Hutchison Ports has to make a solid plan for expansion and investment in this sector. In response, the heads of KICT and SAPTL appreciated the proactive stance of the federal minister towards the development of ports and expansion of facilities.\nThe meeting concluded with the Federal Minister’s remarks reiterating the government’s firm commitment to joint efforts to realize the shared vision of positioning the Karachi Port Trust as an outstanding global maritime hub.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:05:19.927Z"
}
