{
  "title": "PM’s Coordinator Romina, Ethiopian Ambassador Jemal launch Green Legacy Initiative in Sialkot",
  "link": "https://www.app.com.pk/national/pms-coordinator-romina-ethiopian-ambassador-jemal-launch-green-legacy-initiative-in-sialkot/",
  "date_published": "2024-04-24T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP): Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam on Wednesday launched the “Ethio-Pakistan Fraternity Under Green Legacy” initiative of Ethiopia’s Prime Minister Dr Abiy Ahmed at the University of Sialkot.\nThe event was attended by various dignitaries including government officials, religious leaders, businessmen, academics, students, civil society representatives and members of the media. Special Envoy and Ambassador of the Federal Democratic Republic of Ethiopia, Jemal Beker Abdula, was also present at the launch.\nThe initiative was launched as part of a collaboration among the Embassy of the Federal Democratic Republic of Ethiopia, the Ministry of Climate Change and the University of Sialkot, a news release said.\nMore than 200 plants of different indigenous species were planted under the “Ethio-Pakistan Fraternity Under Green Legacy” Initiative which was followed by a climate walk participated by a large number of people.\nSpeaking on the occasion, Romina Khurshid lauded Ambassador Jemal Beker Abdula for fostering fraternity between the two nations through the Green Legacy Initiative.\nThe Coordinator to the Prime Minister of Pakistan said she was delighted to make a formal announcement regarding the collaboration between the Embassy of Ethiopia in Islamabad and the Ministry of Climate Change of Pakistan regarding the Ethio-Pakistan Fraternity Under Green Legacy Initiative.\nShe said Prime Minister Shehbaz Sharif had accorded the approval to formalize the collaboration at the bilateral level between the two countries and assured the Government of Pakistan’s strong commitment in this regard.\nAddressing the launching ceremony, Ambassador Jemal Beker expressed gratitude for the Government of Pakistan for joining hands with the Ethiopian Embassy to foster brotherhood and fraternity between the two big nations.\n“Today we gather here not only to save the planet earth but also connect the two big and historic nations the heirs of civilizations and protectors of the rule-based world order while fighting together the global challenges such as terrorism and climate change,” the Ambassador remarked.\nAmbassador Jemal Beker recalled the recent flash flood that brought devastation to Pakistan’s shore which, he had personally witnessed during his visit to tent cities in Sindh.\n“Climate change is an existential threat that will not spare any place or area on this planet earth if we do not come together to combat this challenge which is not a problem for only Pakistan or Ethiopia but the rest of the world,” he said.\nTo this end, he said the Embassy of the Federal Democratic Republic of Ethiopia launched the Green Legacy Initiative to contribute to the efforts of the Government of the Islamic Republic of Pakistan towards a greener and cleaner future for the next generations.\nThe Ambassador said the Embassy along with other stakeholders would do massive plantations throughout the week in other major cities including Lahore, Faisalabad, Gujranwala, Sheikhupura and others.\n“Our efforts in this regard are completely aligned with the vision of Dr Abiy Ahmed who transformed Ethiopia under his Medemer philosophy which strongly advocates for aligning all the resources to provide homegrown solutions to the homegrown problems,” the ambassador stressed.\nHe said the Prime Minister of Ethiopia, Dr Abiy Ahmed mobilized the whole nation under the Green Legacy initiative and so far, more than 32.5 billion seedlings planted across the country in the last five years which included saplings of fruits like avocado, papaya, banana, oranges, olives and many others.\nLikewise, coffee, animal feed and floral plants were also planted taking us closer to our target of 50 billion seedlings until 2025. In addition to that, more than 150,000 nurseries were set up in the country as well as over a million jobs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:05:14.465Z"
}
