{
  "title": "PM meets UN Secretary General, emphasizes Pakistan’s extreme vulnerability to climate change",
  "link": "https://www.app.com.pk/national/pm-un-secretary-general-discuss-diverse-matters/",
  "date_published": "2022-09-22T18:02:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 23 (APP):Prime Minister Muhammad Shehbaz Sharif met with the United Nations Secretary-General (UNSG) António Guterres here on Thursday and emphasized Pakistan’s extreme vulnerability to climatic changes despite its minimal contribution to global carbon emissions.\nThe meeting took place on the sidelines of the 77th Session of the United Nations General Assembly (UNGA).\nThe Prime Minister appreciated the Secretary-General’s timely visit, affirming strong solidarity with Pakistan in the wake of the climate-induced catastrophic floods. He expressed gratitude for the Secretary-General’s strong push to mobilize international support and assistance for the affected people and also emphasize the need for concrete international action to mitigate the impacts of climate change on developing countries.The Prime Minister lauded the Secretary General’s leading role in calling for urgent climate action.\nThe Secretary-General committed to do everything possible to mobilize support for Pakistan. He said that Pakistan deserved the full and massive support from the international community.The Prime Minister added that as the current Chair of the Group of 77 and China, Pakistan would work towards a common position on ways to secure accelerated implementation of the Sustainable Development Goals and environmental agreements and commitments.\nHe expressed gratitude for the support extended by the Secretary-General and the Deputy Secretary-General in this area.\nIn the regional context, the Prime Minister highlighted the dire human rights situation in Indian Illegally Occupied Jammu and Kashmir and expressed the hope that the Secretary-General will use his good offices to facilitate a just and peaceful solution of the Jammu and Kashmir dispute in accordance with the relevant Security Council resolutions.\nThe Prime Minster reaffirmed the importance attached by Pakistan to a peaceful, stable, and prosperous Afghanistan and stressed the need for the international community to work together to promote shared objectives.",
  "retrievedAt": "2025-08-11T15:37:05.473Z"
}
