{
  "title": "No peace between Pakistan, India without resolution of Kashmir issue: Bilawal",
  "link": "https://www.app.com.pk/national/no-peace-between-pakistan-india-without-resolution-of-kashmir-issue-bilawal/",
  "date_published": "2022-09-22T17:18:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 22 (APP): Minister for Foreign Affairs Bilawal Bhutto Zardari Thursday said Pakistan desired peace with India but it was evident that unless the Kashmir dispute was resolved, there would be no durable peace between the two countries.\nHe was delivering an opening statement as chair of the OIC Council of Foreign Ministers at the OIC Annual Coordination Meeting here.\nThe minister said, “We are prepared to resume a sincere dialogue with India for a peaceful resolution of the Jammu and Kashmir dispute.\nHowever, the onus is on India to create a conducive environment for such a dialogue. It must rescind its unilateral and illegal measures instituted since August 5, 2019 and halt its human rights violations in IIOJK.”\nBilawal said, “Kashmir is our common cause. Jammu and Kashmir and Pakistan are bound irrevocably by geography, faith, history and culture. Kashmir is Pakistan and Pakistan is Kashmir.”\n“Jammu and Kashmir was forcibly occupied by India. The Security Council decided that the people of Jammu and Kashmir must be enabled to exercise their recognized right to self-determination through the UN-supervised plebiscite. India has resiled from its commitment to implement the resolutions of the Security Council and respect the wishes of the people of Jammu and Kashmir.”\n“Since 5 August 2019, India has taken unilateral and illegal measures to undermine the internally recognized ‘disputed’ status of Jammu and Kashmir. It has increased its military deployments there to 900,000 troops and resorted to a brutal campaign of repression, including extra-judicial and custodial killing of Kashmiris; abduction of 15,000 young Kashmiri boys, many of whom were tortured; incarceration of the entire Kashmiri leadership, and the burning of villages and neighborhoods as collective punishment. This campaign of oppression is turbo-charged by the ideology of Hindutva and hatred of Muslims. The organization, Genocide Watch, has warned of the possibility of genocide in occupied Kashmir.”\n“After three years, India’s campaign of colonial annexation has not succeeded. It will never succeed. With the will of Almighty Allah, the people of Jammu and Kashmir will win their heroic struggle for freedom and self-determination.”\nThe minister vowed that Pakistan will continue to extend its full political, diplomatic and moral support to their freedom struggle.\nHe said the Islamic world must evolve collective and concerted responses to the political, economic, climate and other challenges facing the world today.In 1945, the Islamic countries were unable to express, advocate or defend the vital interests of their peoples in the creation of the post-war world order, he reminded.Bilawal said, “Most of us did not participate in the formulation of the UN Charter. As a result, no Islamic nation is a permanent member of the Security Council with veto rights.”“As the second largest international organization, our collective effort should seek to preserve the national security, sovereignty and territorial integrity of each of our member states. To this end, we must ensure universal and consistent adherence to the principles of peace and justice reflected in the UN and OIC Charters. We must promote peace with justice in all disputes and conflicts, within and/or outside the Islamic world.”He said, “Palestine is our common cause and we must not forget that the raison d’étre of the OIC was to promote peace and justice for the people of Occupied Palestine and to free Al Quds al Sharif. We must secure self-determination for our brothers and sisters in Palestine. They must have their own State, with pre-1967 borders, with Al-Quds-al-Sharif as the capital of a free Palestinian State.”“After forty years, there is a real opportunity to restore durable peace and security in Afghanistan and the region. Today, there is no civil war. One government controls the entire country,” he noted.Bilawal said, “We must build on this progress and prevent those forces who wish to revive conflict, create more refugees and intensify the threat of terrorism.”He recalled that Pakistan, together with Saudi Arabia, convened the 17th Extraordinary Session of the OIC Council of Foreign Ministers in Islamabad on 19 December 2021. “Together we agreed that the OIC can and must play a leading role in supporting the people of Afghanistan. We agreed to establish an OIC Humanitarian Trust Fund; appoint a Special Envoy of the OIC Secretary General; launch an Afghanistan Food Security Programme; and reinforce the OIC’s Mission in Kabul.”“We must build on these concrete steps to restore peace and revive economic and social development in Afghanistan. Engagement with Kabul authorities is the only way to address Afghanistan’s humanitarian situation. Afghan authorities have more trust in OIC than any other international organization.”He informed that an Ulema delegation of OIC visited Kabul and exchanged views with authorities there.“With our concurrence and Saudi Arabia’s support, we have managed to operationalize the Office of the Special Envoy. He has undertaken consultations with all relevant stakeholders and visited regional and other countries. I look forward to receiving his reports. “He underlined the need to address the several unresolved and festering conflicts within the Islamic world.“From Yemen to Syria to the Sahel, the Muslim world has been beset by conflict and violence, often as a consequence of foreign intervention. More than 70% of today’s global conflicts, disputes and security challenges are within the OIC countries.”\nBilawal urged OIC to evolve its institutional framework and tools to address the challenges of peace and security within the Islamic world.“It is important that we identify how the OIC can equip itself with the tools required to promote conflict prevention, mediation, reconciliation and peace building within and outside the Muslim world.”He expressed pleasure on discussions on fully activating the OIC’s peace and security architecture, as called for in the Islamabad Declaration, had commenced.He emphasized that during the current UN General Assembly session, the OIC countries must work with other developing countries to address the triple challenge of recovery from the Covid-19 pandemic; achievement of the SDGs and the existential threat of climate change.“As the recent catastrophic floods in Pakistan have so tragically illustrated, Climate change poses an existential threat to humanity. We are most grateful to all our brothers and sisters in the Islamic world who have responded with generous assistance to help us recover from the unprecedented floods. Pakistan will bounce back and bounce back stronger and better due to the resilience of our people.”“It is heartening that one of our OIC members – Egypt is host to the annual climate talks and would lead the efforts for the next year. Pakistan supports their efforts. I am confident that the COP27 would renew political will and deploy tools to finally mobilize the much awaited $100 billion plus promised in climate finance; allocate half for adaptation; establish a financing facility to compensate developing countries for “loss and damage”; urge the industrial countries to achieve net minus carbon emissions by 2050 and to fund the extra costs of climate mitigation for developing countries,” the minister concluded.",
  "retrievedAt": "2025-08-11T15:37:05.446Z"
}
