{
  "title": "WWF-Pakistan initiates dialogue on Pakistan Climate Crisis Charter",
  "link": "https://www.app.com.pk/national/wwf-pakistan-initiates-dialogue-on-pakistan-climate-crisis-charter/",
  "date_published": "2022-09-22T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): The World Wide Fund for Nature-Pakistan (WWF-Pakistan) Thursday convened here a session of government and relevant development stakeholders to develop a consensus on the Pakistan Climate Crisis Charter in the wake of new scientific evidence suggesting that climate change has likely worsened the devastating floods leading the country to face its worst humanitarian crisis in a decade.\nThe charter would serve as a living document to facilitate action on dealing with climate induced disasters, focusing specifically on flood risk management, a WWF press release said.\nThe session, organized in association with the Pakistan Academy of Sciences (PAS), involved a thorough discussion and consideration of land use planning, particularly development in flood-prone or vulnerable areas, water resource management, the capacity of local authorities, media coverage, and forecasting and evacuating systems.\nThe stakeholders developed consensus on shared action points to improve preparedness and the collective response to future crises.\nFrom mid-June until the end of August 2022, large parts of Pakistan experienced record-breaking monsoon rainfall. The provinces of Sindh and Balochistan witnessed their wettest August ever recorded, receiving 7 and 8 times more rains than their usual monthly totals. While much of the recent flooding could be attributed to the effects of climate change, the national disaster also highlighted governance challenges, particularly land use planning, ineffective disaster preparedness, and underlying challenges that pertain to the country’s political economy.\nWWF-Pakistan Director General Hammad Naqi Khan said: “After the catastrophic floods of 2010, we had over 10 years to prepare ourselves. Yet, our response was reactive. As we work on providing relief and rehabilitation, we must also begin to prepare our actors, including federal, provincial and local governments, disaster management agencies, non-profit and non-government entities to address gaps in our governance, and develop a holistic and community-centered approach to climate adaptation to limit its impacts.”\nThe draft charter builds on earlier recommendations that were put forward by the government, civil society, academics, and multilateral organizations in the aftermath of earlier disasters such as the floods of 2010. It also recognizes that given that Pakistan’s contributions to the climate crisis are virtually nil, all stakeholders should collectively utilize available avenues, including through the UNFCCC and the Paris Climate Agreement to call upon the global north to address our loss and damage.\nNDRMF CEO Bilal Anwar appreciated the WWF-Pakistan’s effort for taking the lead on developing a charter to address the climate crisis. “This is a timely and needed initiative,” Anwar said, “however, it’s also important to apply a holistic and embracing approach towards disasters. Experience and history dictates that disasters cannot be approached in isolation, rather look at the big picture — from the heatwaves to the floods, and now a potential drought, it is all interconnected, and its important that we address it as such.”\nThe session was attended by individuals representing a wide array of governmental and nongovernmental organizations, including IWMI, NDRMF, SDPI, UNDP, GCIC, PCRWR, IUCN Ministry of Planning, Ministry of Climate Change Population Council, Pakistan Environment Trust, and Global Change Impact Studies Center.",
  "retrievedAt": "2025-08-11T15:37:13.063Z"
}
