{
  "article_id": "2025-01-04_6eb4f80df23d625b7b6109d452032250",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883011/social-sciences-publishing",
    "retrieved_at": "2025-08-26T07:26:19.717Z"
  },
  "metadata": {
    "title": "Social sciences publishing - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-04T01:01:14.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/677887cb2a751.jpg",
    "categories": [],
    "word_count": 978,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "FOR academic works, the year of publication is a key index of their significance. As 2024 has drawn to a close, it is an opportune moment to take stock of social sciences books published on Pakistan, or on the wider region with direct relevance to the country. Studying a longer timespan reveals interesting trends in the number of books published, disciplines covered, choice of publishers, the accessibility and affordability of books in Pakistan, book manuscripts based on PhD theses, and how the life journey of PhD scholars shapes their research topics. Over the past six years, around 70 social sciences books have been published on (or directly bearing on) Pakistan, excluding edited volumes. Notably, the number has surged since 2019: a new generation of academics has emerged, as evidenced by the fact that more than half of the books stemmed from PhD theses. Factors contributing to this trend include HEC PhD scholarships, the solid undergraduate foundation offered by universities like LUMS, and a heightened focus on Pakistan post-9/11, driven largely by its proximity to Afghanistan and position in the Islamic world in general. A number of these books adopt a multidisciplinary approach, with history emerging as the leading discipline, followed by anthropology and politics (or political science) gaining traction. Despite the mantra of Pakistan's geo-strategic significance, international relations remains far less visible, with only two books on relations with India and China, both authored by non-Pakistani scholars. Economists tend to focus on publishing in academic journals, which accounts for the lack of books published on the discipline. The emphasis on history can be attributed to the competing narratives surrounding the country's origin having fostered critical discourse on the Pakistan movement and earlier South Asian history. Anthropology is another growing discipline in Pakistan studies, characterised by employing ethnographic methods. Anthropologists are grappling with social changes in contemporary Pakistan, such as shifting class structures and religiosity. Sociology, by contrast, garners less attention, a discipline which does not attempt to replicate the temporal perspective of social agents themselves, as do anthropologists. Whether this explains its limited appeal to researchers warrants further investigation. In India too, there are those who do not see the boundaries between anthropology and sociology as rigid as in the West. Anthropologists are grappling with social changes in contemporary Pakistan, such as shifting class structures and religiosity. Of the authors, 85 per cent are Pakistani or of Pakistani descent, with the rest primarily from the UK, USA, and a few other countries such as France, Germany, Canada and Australia. Nearly all underwent doctoral training outside Pakistan, reflecting the absence of robust social sciences graduate programmes in Pakistan. While Islam and the civil-military struggle seem to gain prominence in general discourse, these themes do not predominate as much in the books published. Oxford University Press (OUP) Pakistan has been publishing academic and general books since 1952, benefiting from affordable pricing and maintaining an extensive distribution network within the country. OUP Global has also contributed by publishing Pakistan-specific books. Cambridge University Press has increasingly focused on Pakistan since their South Asia office moved to Delhi, publishing 15 books over the past six years. In recent years, there has been a growing preference for American academic publishers, with Stanford publishing five books, followed by Pennsylvania and Harvard (three each), then by Princeton, California, Cornell, Columbia, Duke, North Carolina, Nebraska, Notre Dame, and Indiana with one each. Other non-university publishers, such as I.B. Tauris, Hurst and Routledge, have also contributed to this expanding body of work. Bringing out a book with a globally top-ranking university press carries prestige - a factor often considered during academic promotions. But accessibility then remains a challenge, as the Pakistani market is often priced out after conversion into rupees. Even outside Pakistan, most academic books are prohibitively expensive, as first editions primarily target libraries. American academic publishers, however, tend to keep their prices comparatively low. Local publishers like Folio, Readings, and Liberty have secured rights to certain books for the Pakistani market, offering them at affordable prices. Despite these efforts, most of these books remain inaccessible. While some authors have generously shared e-copies of their books, this practice is confined to close networks of friends and colleagues. Meanwhile, pirated e-copies continue to circulate. Since over half the book manuscripts (commonly referred to as monographs) stem from PhD theses, the life journey of PhD students often shapes their themes. Many of the younger generation of social scientists have been educated in upper-middle class or elite private schools, which may dilute their organic connection to broader societal realities, particularly in a country like Pakistan. Graduates of state schools and universities, by contrast, often possess deeper insights into social dynamics, but may lack academic rigour. A few exceptions, however, transcend these challenges. One remarkable example is the late Arif Naveed, who tragically passed away recently at a young age. Hailing from South Punjab's least developed region, his journey to Cambridge University, and later to a faculty position at Bath University, greatly enriched his seminal work on intergenerational poverty. The consciousness of their limited engagement with society at large often spurs young scholars to explore it for themselves, which eventually shapes their PhD research. Arguably, a greater segment of Indian PhD scholars tends to exhibit academic rigour combined with deeply rooted societal insights, attributable to the relatively egalitarian nature of schooling and higher education opportunities in India. This distinction is also reflected in the contrasting social outlooks of young scholars in the social sciences from both countries. It would be worthwhile to assess which of these books primarily serve the specific domain of Pakistan Studies, and which take a step further to make broader contributions to their respective academic disciplines. The writer teaches economics at SOAS, University of London, and is a member of the editorial team of Bloomsbury Pakistan book reviews. nadir.cheema@economics.oxon.org X: [@NadirCheema][1] Published in Dawn, January 4th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}