{
  "article_id": "2025-01-04_92333af8244ff9fe7815ef384f75e153",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882973/judicial-commission-sitting-to-consider-ihc-bhc-judges-on-17th",
    "retrieved_at": "2025-10-12T00:42:44.164Z"
  },
  "metadata": {
    "title": "Judicial Commission sitting to consider IHC, BHC judges on 17th - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-04T00:48:05.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 708,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "- Commission to examine 30 candidates for seven seats - Names for vacancies in Sindh, Peshawar, Lahore high courts to be approved on Jan 23, Feb 1 and 6 - Supreme Court disposes of 7,482 cases in over two months ISLAMABAD: The Judicial Commission of Pakistan (JCP) on Friday approved its schedule of meetings to consider appointments of additional judges of high courts, with the first session to consider nominations for Islamabad High Court (IHC) and Balochistan High Court (BHC) being slated for Jan 17. The schedule, which has been circulated in advance for the convenience of the members and adjustments of their itineraries, suggests that JCP will meet on Jan 23 to consider the appointment of additional judges for Sindh High Court (SHC), Feb 1 for Peshawar High Court (PHC) and Feb 6 for Lahore High Court (LHC). Earlier on Dec 24, 2024, the JCP had sought nomination for an aggregate of 38 vacancies in different high courts of which 12 recommendations have been asked for SHC, four for the IHC, 10 for LHC, nine for PHC and three for BHC. The nominations were sought by JCP soon after approving its rules for the appointment of judges to the superior judiciary, with Jan 3 as its deadline. For the four vacancies in IHC, 19 names have been floated including Adnan Baharat, Syed Qamar Sabzwari, Umer Aslam Khan, Inaam Ameen Minhas, Usman Ghani Rashid, Ayyaz Shaukat, Humayun Dilawar, Adnan Haider, Nudrat Bayan Majeed, Sultan Mazhar Sher Khan, Raja Jawad Abbas Hassan, Kashif Ali Malik, Danyal Ijaz, Shahid Mehmood Khokhar, Azam Khan, Shahrukh Arjumand, Babar Bilal, Abdul Rafeh and Chaudhry Hafeezullah Yaqub. Likewise, for three vacancies in BHC, 11 nominations are Asif, Zahoor Ahmed Mengal, Muhammad Afzal, Ayub Khan, Jan Muhammad Gohar, Pazir Ahmed Baloch, Allah Dad Roshan, Dawood Khan Nasir, Khalil Ahmed Panezai, Najamuddin Mengal and Iqbal Shah. The JCP had already notified in the official gazette the Judicial Commission of Pakistan (Appointment of Judges) Rules 2024 for regulating mechanism for assessment, evaluation and fitness for the appointment of judges in the superior judiciary. On Dec 21, the JCP had approved with certain amendments the proposed JCP (Appointment of Judges) Rules 2024. Chief Justice of Pakistan (CJP) Yahya Afridi, who is the chairman of the commission, had presided over two consecutive sessions of the commission, which was reconstituted under 26th Amendment. SC case load In a separate development, the Supreme Court disposed of 7,482 cases, against new institution of 2,950 cases during the period Oct 28, 2024, to Jan 3, 2025. The development is being dubbed by the apex court as gaining momentum in fast-tracking case disposal. The achievement is the result of case load management, resources dedication and reconfiguration of appropriate human resources. According to an announcement by the Supreme Court, the CJP and judges have worked relentlessly to ensure that the highest court remains responsive to the needs of the public. CJP Afridi placed a strong emphasis on judicial reforms to enhance the performance, efficiency, and transparency of the judiciary. Advanced information technology systems are being integrated to streamline administrative workflows, optimise case tracking, and facilitate faster decision-making and improvements in case management processes with a focus on litigants' facilitation by introducing e-affidavit and instant certified copies. The public engagement and inclusivity are at the heart of this vision for a citizen focused judiciary, the SC statement said, adding the mechanisms for collecting feedback from stakeholders, including legal practitioners, litigants, and civil society organisations, have been introduced. These initiatives aim to make the judiciary more accountable, accessible, and responsive to the needs of the public. Recognising the critical role of the district judiciary as the first point of contact for litigants, the CJP personally visited remote districts across the country, the statement said. These visits were aimed at assessing the state of justice delivery at the grassroots level, identifying challenges faced by district courts and exploring ways to enhance their efficiency. The district judiciary not only forms the backbone of the justice system, but also plays a pivotal role in shaping public trust and confidence in the judiciary. Efforts are underway to strengthen its capacity, address resource gaps, and ensure equitable access to justice for all citizens, the statement added. Published in Dawn, January 4th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}