{
  "article_id": "2025-01-04_8f2e3c429f0c15902d890f0da80c58b4",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882945/crypto-trader-falls-victim-to-kidnap-ring-ctd-man-among-seven-held",
    "retrieved_at": "2025-08-26T07:26:24.420Z"
  },
  "metadata": {
    "title": "Crypto trader falls victim to kidnap ring; CTD man among seven held - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-04T00:48:33.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 707,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "KARACHI: Seven suspects, including an officer of the Counter-Terrorism Department (CTD), were arrested on Friday for their alleged involvement in the kidnapping of a cryptocurrency trader and releasing him after taking a ransom of \"$340,000\". Confirming the arrest of the policeman, Inspector General of Police Ghulam Nabi Memon told Dawn that efforts were underway to arrest another policeman who was still at large. The Anti-Violence Crime Cell (AVCC) identified the held suspects as Haris, alias Ashar; Mohammed Rizwan Shah; Tariq Hasan Shah, alias Amir; Muzamil Raza; Umer Jilani; Umer Irshad and Noman Riffat. The official statement of the AVCC did not identify the held policeman and his current posting. Freedom secured after paying '$340,000' through Binance account, he claims It said that one person, Mohammed Arsalan, 30, doing a cryptocurrency business, was kidnapped from Manghopir on Dec 25. The kidnappers transferred 340,000 US dollars in different accounts through the kidnapped trader's 'Binance account' and left him in the jurisdiction of the Brigade police. An FIR under Sections 365-A (kidnapping or abduction for the purpose of extortion) and 34 (common intention) of the Pakistan Penal Code was registered whose investigation was handed over to the AVCC/CIA. As per official statement, a team formed by SSP AVCC Aneel Haider Minhas comprising the SHO of AVCC and others carried out 'technical-based' actions in different parts of the metropolis on Friday (January 3) and arrested seven alleged kidnappers. \"The held suspects are habitual criminals who were also arrested and sent to jail in the past.\" According to the contents of the FIR registered at the Manghopir police station on Dec 27, the complainant Mohammed Arsalan said that he lived in Saima Arabian Villas in Manghopir and was doing a crypto currency business. Around 15-20 days ago, one person identified as Hamid approached him for purchasing dollars but he told him that he did not do sale/purchase of the greenback. The said person continuously remained in touch with him for 10-15 days but he was avoiding him. Subsequently, he (Hamid) approached his friend Zohaib and later on at night on Dec 24, three people came to his office in Saima Arabian Villas. Two of them identified themselves as Muzamil and Hammad. The complainant said he told them he would ask his friend to arrange dollars as he did not have the currency. They made a video of a dollar whose picture was in his cell phone and sent it to someone else. As per the FIR, the suspects asked for 30,000 dollars and when he demanded payment for such a quantity of foreign currency, the said suspects did not give him any positive response and stayed there for 45 minutes. They told him that a person namely Ashar would come and make the payment to him. In the meantime, they all went to a restaurant in the area where at around 1am on Dec 25, three people in a Suzuki Alto vehicle also arrived, who identified themselves as Ashar, Muzamil and Zaman. The complainant said when he asked Ashar for the payment, he also avoided and went for a while where he made a phone call to someone. Subsequently, at 1:40am one police mobile, without number plate, arrived in which there were five people in plain clothes. The men covered his mouth with a cloth, took him and brought him near the FIA Saddar office. \"The policemen in plain clothes\" forcibly opened his Binance account and transferred 340,000 dollars to different accounts. They also took away cash from his pocket.\" They reset his cell phone, handed it back to him and dropped him near the mausoleum of Quaid-i-Azam Mohammed Ali Jinnah at 4am. He hired a rickshaw and reached his home. IG defends CTD Speaking to Dawn, Inspector General of Police Ghulam Nabi Memon said that it was an act of individuals not of the CTD. He said police always took action whenever a policeman was found involved in any illegal act. \"We do not spare anyone,\" declared Mr Memon. He said that no leniency was being given to any policeman found involved in the illegal act. Not only FIRs were registered against them, but they would also face departmental action and dismissal from the service. Published in Dawn, January 4th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}