{
  "article_id": "2025-01-04_dbee86d36b38c84480377ebd4c0235ec",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883032/situation-under-control-says-kp-govt-spokesperson-after-kurram-dc-injured-in-firing-near-bagan",
    "retrieved_at": "2025-08-26T07:26:19.883Z"
  },
  "metadata": {
    "title": "Situation under control, says KP govt spokesperson after Kurram DC injured in firing near Bagan - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-04T07:11:01.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/04120123dd7604c.png",
    "categories": [],
    "word_count": 1001,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "The situation in Kurram is \"under control\" after Deputy Commissioner (DC) Javedullah Mehsud was injured when unknown assailants fired at a convoy he was travelling in near Bagan on Saturday, Khyber Pakhtunkhwa government spokesperson Barrister Muhammad Ali Saif confirmed. Just days earlier, the KP government on Wednesday said that both warring sides in Kurram districts had finally signed a peace agreement after more than three weeks of efforts to broker a ceasefire amid violence in the area. Clashes stemming from decades-old land disputes have claimed at least 130 lives since November, with food and medicine shortages reported due to weeks-long road blockades. Today's incident comes as an aid convoy carrying food and other basic necessities was expected to leave for Kurram, ending the over 80-day-long road blockade of the restive region. However, the main sit-in against road closures in the district - being staged outside the Parachinar Press Club - would continue, as its organisers decided to keep their agitation going until roads are open and secure. Another protest, demanding compensation for damage caused to homes and markets, was also underway in the Bagan area of Lower Kurram. Barrister Saif had said in a statement that all travel and security-related arrangements were in place for the protection of the convoy. Following today's incident, Barrister Saif said that arrangements were being made to shift the DC to Peshawar via helicopter after he was brought to Alizai Hospital. However, he said later in the day that DC Mehsud was being shifted to Thall Combined Military Hospital (CMH) where he was being provided with medical facilities. \"The DC is undergoing surgery but his condition is out of danger,\" Barrister Saif said, who was present at the scene along with the Kokat Commissioner and Deputy Inspector General of Police (DIG). \"Security personnel have taken complete control of the situation,\" he said. \"The attack is a sinister conspiracy of unknown miscreants.\" \"I appeal to both Sunni and Shia parties to remain peaceful and not fall prey to the conspiracy,\" Barrister Saif said. He added that although the convoy had been temporarily stopped, a clearance process was underway, and the convoy would resume soon. In a later update, he said the DC and an injured guard were sent to Peshawar via helicopter for further treatment. He said their condition was out of danger as the necessary medical treatment was provided to them. President Asif Ali Zardari stressed the need for strict action against those harming the peace in Kurram as he condemned the incident. \"Miscreants are enemies of the people who want to spread chaos,\" he was quoted as saying in a post on X by PPP. \"The people should not let the miscreants succeed in their nefarious purposes.\" Prime Minister Shehbaz Sharif condemned the incident and prayed for the recovery of the injured. \"An attempt was made to damage the peace agreement,\" Shehbaz said in a statement issued by the PM's Office. \"Those who disrupt law and order, and enemies of humanity will not be allowed to succeed. The government and security forces are actively working against terrorists,\" PM Shehbaz said. KP Chief Minister Ali Amin Gandapur sought a report of the incident from higher authorities, saying it was regrettable and condemnable that the attack came just days after a peace agreement was signed. \"The incident is a deliberate and nefarious but unsuccessful attempt to sabotage the government's efforts for peace in Kurram,\" Gandapur said, according to a statement issued by the CM House. Strict action will be taken against those involved in the firing in accordance with the law, the CM said. \"The incident is the work of those who do not want peace to be restored in Kurram, Gandapur said. \"The provincial government is determined to restore peace in Kurram and solve the problems faced by the people.\" The peace agreement is testimony to the fact that the people of Kurram are peaceful and want peace in the region, the CM said. Gandapur added that the provincial government, together with the people of the area, would thwart the nefarious efforts of those who did not want peace restored in the region. \"The people of the area must help in identifying the miscreants and help in delivering aid to the areas,\" he said. KP Governor Faisal Karim Kundi said \"firing on an aid convoy is clear proof of incompetence and failure of the provincial government,\" Kundi was quoted as saying in a post on X by PPP. The governor added that he would pray for the speedy recovery of DC Mehsud. Interior Minister Mohsin Naqvi strongly condemned the incident, terming it a \"conspiracy to sabotage the peace agreement\", according to a statement on X by the interior ministry. Around 17 truckloads of relief goods were dispatched to Kurram on the instructions of Gandapur, the KP Provincial Disaster Management Authority (PDMA) said in a press release issued earlier today. The aid was handed over to the Kurram administration from the warehouse of PDMA under the supervision of Naik Muhammad Khan, adviser to the Provincial Government for Relief, Rehabilitation and Resettlement. To provide immediate relief to the victims in severe cold, the relief supplies included 500 tents, 500 mats, 500 blankets, 500 beds, 500 medical protective kits, 200 tarpaulins, 500 pillows, 50 solar lamps and 150 sleeping bags. Naik Khan said that the Kurram victims were currently facing severe hardships, and their needs have increased due to extreme cold adding that the KP government was giving \"top priority\" to help the victims and is using all possible resources for their immediate rehabilitation. He added that the PDMA and district administration were in contact working around the clock to meet victims' needs. The official also assured the public of ensuring transparent distribution of relief materials and said the rehabilitation and support of the victims is the top priority of the provincial government. He added that the KP government was working together with all the institutions for the rehabilitation of the victims so that their problems were solved immediately.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}