{
  "title": "Youth dialogue highlights nutrition challenges ahead of global summit",
  "link": "https://www.app.com.pk/national/youth-dialogue-highlights-nutrition-challenges-ahead-of-global-summit/",
  "date_published": "2024-12-27T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Children and youth gathered for the ‘Little Leaders, Big Impact–Children/Youth Nutrition Dialogue,’ aimed at shaping the future of food systems and nutrition.\nThe event was organized by the Global Alliance for Improved Nutrition (GAIN) and the National Alliance for Safe Food (NAFS) as part of preparations for the Nutrition for Growth (N4G) Summit 2025 in Paris, France. The dialogue was held at the Avari Hotel Lahore, said a press release on Friday.\nThe dialogue empowered young participants to share their perspectives on global nutrition challenges and propose solutions to address malnutrition.\nThe summit, scheduled for March 2025, serves as a global platform to mobilize resources, policies, and community actions to improve nutrition outcomes worldwide.\nThe event began with a recitation of the Holy Quran, welcome address by Rana Awais Khan, Chairman of NAFS. Faiz Rasool, Head of Policy & Advocacy at GAIN Pakistan, highlighted the state of malnutrition in Pakistan and the importance of youth-driven initiatives.\nInteractive sessions, moderated by Dr Hafiz Rehan Nadeem, President of NAFS, encouraged participants to engage in creative activities, including group discussions and collages, to develop innovative solutions for community nourishment. The session concluded with presentations and remarks from guest dignitaries.\n“Today’s dialogue is a testament to the power of young voices,” said Faiz Rasool in his closing remarks. “Their ideas will contribute significantly to shaping policies for a healthier, more sustainable future and will resonate at the N4G Summit in Paris.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:05:40.479Z"
}
