{
  "title": "PM directs stringent punitive action within week against human traffickers",
  "link": "https://www.app.com.pk/national/pm-directs-stringent-punitive-action-within-week-against-human-traffickers/",
  "date_published": "2024-12-27T14:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday directed the authorities concerned to take strict punitive action within a week against culprits involved in human trafficking.\nThe prime minister chaired a review meeting regarding the prevention of human trafficking in the country, a PM office press release said.\nDuring the meeting, the report of the committee formed under the chairmanship of Mushtaq Sukhera was presented in view of the migrant’s boat capsizing incident occurred near Greece in December 2024.\nThe PM extended his gratitude to Mushtaq Sukhera for compiling a comprehensive report on the matter.\nHe also directed to make the prosecution process more effective against people involved in human trafficking.\n“Why disciplinary action has not been taken against government officials who facilitate people involved in human trafficking?”, the Prime Minister queried.\nThe PM directed to make visa checks and other regulations effective for all those going abroad. “The Government of Pakistan is committed to the complete elimination of human trafficking from the country,” he added.\nThe Prime Minister also issued instructions to form a committee headed by the Interior Minister to find a sustainable solution to end human trafficking.\nIn the meeting, the Prime Minister was briefed regarding the measures taken against human trafficking in the country, whereas a briefing was also given on the identification of the Pakistanis in the December 2024 migrant boat accident near Greece and the progress of repatriation of their remains.\nFederal Ministers Ahad Khan Cheema, Attaullah Tarar, Special Assistant Tariq Fatemi and senior officers of related institutions participated in the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:05:43.898Z"
}
