{
  "title": "Help Foundation launches a historical project for orphans in Kamaliya at NPC",
  "link": "https://www.app.com.pk/national/help-foundation-launches-a-historical-project-for-orphans-in-kamaliya-at-npc/",
  "date_published": "2024-12-27T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):The Help Foundation, on Friday, launched the Agosh Fatima Project in Kamaliya at the National Press Club (NPC) to accommodate orphan children along with their mothers to enhance their protection and also educate them for their bright future.\nChief Executive Officer (CEO) Help Foundation, Liaquat Ali, said that the Aghosh Fatima project is a commendable initiative aimed to protect the orphan children from exploitation; furthermore, this project will also ensure that these vulnerable children could grow under the affection of their mother and become decent citizens of the country, the press release said.\nHe further added that the Aghosh Fatima project has been launched with the ambition to construct four hundred apartments in the area of 52 kanals of land at Kamalia Bypass, holding all facilities, including a school, madrasa, and mosque.\nHe appealed to the philanthropist to contribute to this cause and become its ambassador so that the curse of evil can be removed from the society.\nProject Director of the project, Irfan Jalal, expressed that this is an ideal project for the deserving people of the country, which will be completed in two and a half years. He further said that the project  small apartments of one-room are being built on 52 kanals of land in Kamalia, where orphans will be able to live with their mothers with all necessities of life, including education, health, and food.\nHe further expressed his optimism to launch these types of projects in other cities also. “After Kamalia, this series will be expanded to other cities,” the project director said.\nPFUJ President Afzal Butt admired the efforts of Help Foundation officials for the success of the project. He also expressed gratitude the team for launching the historical project from the platform of NPC.\nNPC President Azhar Jatoi said that the NPC is the guarantor of the rights of not only journalists but also all the citizens of the country. He also assured his cooperation and said that the NPC will always stand by them. Shahid Mir, General Secretary of the Scotland Press Club, Secretary Nayyar Ali, and RIUJ President Tariq Ali also speak on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:05:40.480Z"
}
