{
  "article_id": "2025-02-07_f19bba2547c8b0d4cf9707c63411642f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gb-residents-exempted-from-nhas-toll-tax-aleem-khan/",
    "retrieved_at": "2025-08-27T12:28:13.410Z"
  },
  "metadata": {
    "title": "GB residents exempted from NHA’s toll tax: Aleem Khan",
    "author": null,
    "date_published": "2025-02-07T14:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 342,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 07 (APP):Federal Minister for Privatization, Board of investment, and Communications, Abdul Aleem Khan, held separate meetings with Chief Minister of Gilgit-Baltistan, Gulbar Khan and Azerbaijan's Ambassador to Pakistan, Khazar Farhadov on Friday. Both meetings focused on economic development, investment opportunities, and infrastructure enhancement in Pakistan, said a press release. During his meeting with Chief Minister Gulbar Khan, Aleem Khan discussed the expansion of the National Highway Authority (NHA) in Gilgit-Baltistan and its crucial role in regional development. He emphasized that Gilgit-Baltistan's progress is vital for Pakistan's overall prosperity and reaffirmed NHA's commitment to improving the road network. Acknowledging the region's growing tourism sector, he highlighted that thousands of tourists visit Gilgit-Baltistan every year, significantly contributing to its economy. To further improve infrastructure, Aleem Khan proposed the introduction of a toll tax for tourists, with collected funds dedicated to enhancing NHA's road infrastructure in the region. However, he assured that local residents would be exempted from this tax. Chief Minister Gulbar Khan appreciated the Federal Minister's dedication to the development of Gilgit-Baltistan and expressed the provincial government's commitment to working closely with NHA for the region's progress. Furthermore, in his meeting with Azerbaijan's Ambassador, Khazar Farhadov, the minister emphasized the importance of strengthening economic relations between Pakistan and Azerbaijan. He appreciated Azerbaijan's interest in investing in Pakistan, particularly in infrastructure development. Minister Aleem Khan highlighted that Pakistan offers attractive investment opportunities and specifically mentioned that investment in major road projects such as M-6 and M-9 motorways could be highly beneficial for both countries. Discussing Prime Minister Shehbaz Sharif's upcoming visit to Azerbaijan, Aleem Khan stressed the need to implement key investment agreements and assured full facilitation for Azerbaijani investors through government institutions. Ambassador Khazar Farhadov welcomed Pakistan's initiatives and reiterated Azerbaijan's commitment to strengthening bilateral ties. He also expressed enthusiasm for the Prime Minister's visit, considering it a significant step toward enhanced economic cooperation. Both meetings underscored Pakistan's focus on regional development and foreign investment, with the government actively working to strengthen infrastructure, tourism, and trade partnerships for long-term economic growth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}