{
  "article_id": "2025-02-07_178f9908c56ea34c88378048c9b6031a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/flexible-grant-based-support-to-developing-countries-vital-for-resilience-sustainable-development-pm/",
    "retrieved_at": "2025-08-27T12:28:42.797Z"
  },
  "metadata": {
    "title": "Flexible, grant-based support to developing countries vital for resilience, sustainable development: PM",
    "author": null,
    "date_published": "2025-02-07T12:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 07 (APP): Prime Minister Shehbaz Sharif on Friday reiterated his call for more predictable, flexible, and grant-based financial support for developing countries to enable them to build resilient infrastructure and invest in sustainable development. \"Without such support, the path to climate adaption and green transformation will remain elusive,\" the prime minister said in a video message at the two-day \"Breathe Pakistan International Climate Change Conference, organized by the Dawn Media Group. He told the international gathering that Pakistan's climate story embodied a \"cruel paradox\" as its emissions were less than one percent and yet it was one of the most climate-affected countries with climate change-induced floods, glacial meltdown, blistering heatwaves and soil-craking droughts. He recalled that two years ago, one-third of Pakistan was submerged in floodwaters, displacing 33 million people and claiming 1,700 innocent lives. This tragedy transformed climate change from a distant threat to an urgent call to action, he added. Lauding the organisers for hosting the conference to contemplate \"one of the most pressing challenges of our times\", the prime minister said that his government had inherited robust frameworks including the \"National Climate Change Policy 2021\" and the \"National Adaptation Plan 2023\" which alone were not enough. He said that after recognising implementation gaps, the government prioritised governance reforms, policy execution, and capacity-building initiatives. \"The initiatives like the 5Es and 5Cs are rooted in our homegrown transformation plan, Uraan Pakistan. We are integrating climate resilience into energy, equity, connectivity, and development,\" he remarked. The prime minister concluded by emphasising to make the event a resounding call to action to ensure a cleaner, greener, and more resilient Pakistan for generations to come.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}