{
  "article_id": "2025-02-07_beded0901c8d9f91963aa553a832f39b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/crackdown-on-illegal-petrol-agencies-lpg-outlets-in-sector-g-12-3-arrested/",
    "retrieved_at": "2025-08-27T12:28:37.246Z"
  },
  "metadata": {
    "title": "Crackdown on illegal petrol agencies, LPG outlets in sector G-12; 3 arrested",
    "author": null,
    "date_published": "2025-02-07T13:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 221,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 07 (APP):In a swift operation led by the Assistant Commissioner (AC) Saddar zone, sealed three illegal petrol agencies and LPG filling point in Sector G-12, arresting three individuals. The crackdown, part of a broader effort to curb hazardous activities, highlights the risks posed by unauthorized fuel operations in residential areas, said the spokesman of ICT administration. Deputy Commissioner Islamabad, Irfan Memon, emphasized the dangers of such illegal setups, stating that unregulated LPG filling points pose significant safety risks to residents. He urged citizens to avoid using these unauthorized facilities and report them immediately to the authorities. The crackdown is part of ongoing efforts by the district administration to eliminate illegal fuel operations in the city. The AC reiterated that such activities not only violate the law but also endanger public safety, especially in densely populated areas. Residents have been advised to boycott illegal petrol and LPG outlets and cooperate with authorities by reporting suspicious activities. The administration has vowed to intensify its campaign against unauthorized fuel operations to ensure public safety and compliance with the law. The operation in Sector G-12 serves as a reminder of the risks associated with illegal fuel businesses and the need for collective vigilance to prevent potential hazards. Authorities have assured that similar actions will continue across the city to address the issue effectively.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}