{
  "title": "PM reaffirms Pakistan’s support to Kashmiris; rejects Indian SC verdict as politically motivated",
  "link": "https://www.app.com.pk/national/pm-reaffirms-pakistans-support-to-kashmiris-rejects-indian-sc-verdict-as-politically-motivated/",
  "date_published": "2023-12-14T13:14:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Dec 14 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday reaffirmed Pakistan’s moral, political and diplomatic support to the people of Kashmir, and rejected the recent verdict of the Indian Supreme Court calling it a politically motivated and a tool to consolidate Indian illegal occupation.\nThe prime minister, in his address at the special session of the Azad Jammu and Kashmir Legislative Assembly (AJK LA), called for India to desist from consolidating its occupation, revoke the illegal unilateral actions of August 5, 2019 and not change the demography of the disputed territory.\nChaired by AJK LA Speaker Chaudhry Latif Akbar, the session was attended by AJK Prime Minister Chaudhry Anwarul Haq and Assembly members.\nPM Kakar also stressed upon India to halt the human rights abuses in the Indian Illegally Occupied Jammu & Kashmir (IIOJK), repeal emergency laws, withdraw heavy military presence and provide unhindered access to the United Nations bodies and the international media.\nThe prime minister, who was the first-ever caretaker PM to address the AJK Legislative Assembly, paid tribute to the martyrs of the Kashmir movement and those living along the Line of Control and suffered losses due to the Indian ceasefire violations.\nHe said Pakistan would continue to stand alongside the people of Kashmir in their struggle and wished them to enjoy their due rights.\n“Kashmir is Pakistan’s jugular vein. The word ‘Pakistan’ is incomplete without Kashmir. The people of Pakistan and Kashmir are bound by unique affinity. We share joys and sorrow. Pakistan cannot remain indifferent to the situation in Kashmir… Kashmir runs in our blood. Jammu and Kashmir remains an important facet of Pakistan’s foreign policy,” he remarked.\nHe said across the political divide, the entire Pakistani leadership stood united to support the Kashmiris for their right to self-determination.\nGiving a historical account, the prime minister said the Kashmiris had suffered enormously from conflicts in history. Even today, the situation had not improved as the majority was still under the subjugation of an oppressor with a different name.\nPrime Minister Kakar told the House that Kashmir was the oldest unsettled agenda of the United Nations as the UN Security Council resolutions remained unimplemented and the Indian government was bent upon consolidating its occupation of disputed territory through a series of legislative and administrative measures.\nReferring to the Indian decision to take the Kashmir issue to the United Nations and repeated Indian leaders recognizing it as a dispute, he said the current Indian government must honour its long-standing commitment to the UN resolutions.\nHe said the Indian SC verdict was politically motivated instead of grounded in law to validate the illegal unilateral measures of August 5, 2019.\nThe prime minister said considering its massive human rights abuses, the title of ‘world’s largest democracy’ for India should be changed to the ‘world’s largest hypocrisy’ where hollow slogans of democracy and diversity were raised to cover up the marginalization of minorities, state-sponsored terrorism and illegal occupation.\nCalling the Indian actions in IIOJK a breach of the UN Charter, the UNSC resolutions and international laws, he said the main objective of the Indian measures was to convert Kashmiris into a disempowered community in their land.\nHowever, he said, the domestic legislation and judicial verdicts could not absolve India of its obligations.\nHe said on the one hand, India wished to become a permanent member of the UN Security Council, while on the other its leadership took pride in trampling upon international laws. Such contradictions reinforced by the Hindutva ideology should be an eye-opener for the international community, he added.\nHe said thousands of Kashmiris had been killed, thousands faced forced disappearances and pellet gun injuries, and thousands of the women suffered molestation, while the human rights abuses were also documented in two of the UN reports.\nQuestioning the conscience of the international community, he said despite killings, illegal detention of Kashmiri leaders and destruction of structures, India could not undermine their resolve for freedom.\nHe said India was afraid of Kashmiri leader Syed Ali Geelani even after his death and sought the death penalty for another leader Yaseen Malik which manifested its failure to suppress the spirit of freedom.\nHe said Pakistan and the Kashmiris rejected the Indian measures of gerrymandering of constituencies and measures to change the demography.\nThe prime minister said the Kashmiris had long been deprived of normalcy in their land also hampering the development owing to the fearful environment.\nHe said Pakistan wanted good neighbourly ties with India but its unilateral actions of August 5, 2019 had vitiated the environment leaving the onus on it to undo the situation.\nPakistan wanted peace with justice, not peace with injustice, he added.\nComing to the belligerent statements by the Indian leaders regarding the AJK, the prime minister reiterated that Pakistan had exercised maximum restraint. Pakistan would never surrender to any form of threat or intimidation as it stood firm to safeguard its sovereignty and interests.\nHe said Pakistan had no issue with the Hindu belief but Hindutva, as a considerable size of minorities in Pakistan enjoyed due rights and exercised freedom.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:01:33.928Z"
}
