{
  "title": "Heavy rainfall and flash flood alert issued for parts of Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jun 29 (APP):The Pakistan Meteorological Department (PMD) has forecast rain-wind/thundershowers for Monday in several regions of the country, along with warnings of flash floods, landslides, and potential damage to infrastructure during the ongoing wet spell.\nAccording to the Met Office, rain-wind/thundershowers are expected at isolated places in Kashmir, northeast Punjab, the Potohar region, Islamabad, and upper Khyber Pakhtunkhwa.\nIsolated heavy falls, occasionally very heavy, are likely during the morning hours. Meanwhile, other parts of the country are likely to experience hot and humid weather conditions.The PMD has warned that heavy to very heavy rainfall tonight and on June 30 may trigger flash floods in local streams and nullahs in Murree, Galliyat, Rawalpindi, Islamabad, Swat, Shangla, Malakand, Dir, Mansehra, Abbottabad, Kohistan, Peshawar, Charsadda, Nowshera, Swabi, and Kashmir. In Balochistan, hill torrents of Musakhel, Barkhan, Khuzdar, Lasbella, and Kalat are also at risk of flash flooding.\nStrong winds and lightning may disrupt daily routines and pose risks to weak structures such as Katcha houses, billboards, electric poles, vehicles, and solar panels. Landslides may also cause road closures in hilly areas of Khyber Pakhtunkhwa, Murree, Galliyat, and Kashmir.\nIn Islamabad, partly cloudy weather with chances of rain-wind/thundershowers is expected, with isolated heavy falls likely during the morning hours. In Khyber Pakhtunkhwa, rain-wind/thundershowers are expected in several districts including Dir, Swat, Kohistan, Malakand, Bajaur, Shangla, Battagram, Mansehra, Abbottabad, Haripur, Peshawar, Charsadda, and Mardan. Isolated heavy falls are likely during morning hours.\nIn Punjab, mainly hot and humid weather is expected in most districts. However, rain-wind/thundershowers may occur at isolated places in Murree, Galliyat, Rawalpindi, Jhelum, Attock, Chakwal, Gujrat, Gujranwala, Sialkot, Narowal, Lahore, and surrounding areas. In Sindh, hot and humid weather will prevail across most districts.\nIn Balochistan, mostly hot and humid conditions will persist, but rain-wind/thunderstorms are expected at isolated places in Zhob, Musakhel, Barkhan, Khuzdar, Lasbella, and nearby areas. In Kashmir, cloudy weather with rain-wind/thundershowers is expected, with isolated heavy falls at times. Gilgit-Baltistan is likely to witness hot and partly cloudy weather, with a chance of rain-thunderstorms at isolated places.\nDuring the past 24 hours, rain-wind/thundershowers with isolated heavy falls occurred in scattered areas of Punjab, Islamabad, Sindh, northeast and southern Balochistan, upper Khyber Pakhtunkhwa, and Kashmir.\nIn Punjab, Sheikhupura received 35 mm of rain, Islamabad Airport 25 mm, Gujranwala 23 mm, Hafizabad 22 mm, and Lahore Airport 20 mm. In Balochistan, Kalat received 21 mm of rain and Ormara 7 mm. Karachi saw heavy downpour in Sarjani Town (36 mm), Gulshan Hadid (33 mm), and Saadi Town (27 mm). In Kashmir, Kotli received 5 mm of rain, while Malam Jabba and Kakul in KP recorded 2 mm each.\nThe highest temperatures were recorded in Sibbi and Jacobabad at 44 C, followed by Chilas, Bhakkar, Noorpur Thal, Dalbandin, and other cities at 43 C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:36:00.521Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/heavy-rainfall-and-flash-flood-alert-issued-for-parts-of-pakistan/",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T16:24:00.000Z"
}
