{
  "title": "Mushahid acclaims China for spearheading  ‘alternative global order’",
  "link": "https://www.app.com.pk/national/mushahid-acclaims-china-for-spearheading-alternative-global-order/",
  "date_published": "2024-06-30T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP):Senator Mushahid Hussain has acclaimed China for laying the basis for an ‘alternative new global order based on equality and justice’.\nHe made these remarks at the International Conference convened in Beijing by the Chinese Ministry of Foreign Affairs to mark 70 years of the Five Principles of Peaceful Coexistence, which was attended by over 200 political leaders, scholars, intellectuals, economists and journalists from over 50 countries, a news release said.\nSenator Mushahid Hussain, who is Chairman of the Pakistan-China Institute & Co-Chairman, International Conference of Asian Political Parties (ICAPP, the largest organisation of political parties in Asia, also thanked President Xi Jinping for bestowing on him the prestigious 5 Principles of Peaceful Coexistence Award, as he is the first and only  Pakistani politician and parliamentarian to be given this honour by China. He was given this Award by President Xi Jinping at a special ceremony during the Chinese President’s State Visit to Pakistan in April 2015.\nMushahid Hussain termed President Xi Jinping’s speech at the function as truly significant, having far-reaching historical significance, as China has taken political ownership of the 5 Principles of Peaceful Coexistence, which today are the foundation of the new emerging global order, as well as a ‘Code of Conduct’ for the Global South, that is now being led from the front by China.\nSenator Mushahid Hussain, in his speech, said, “the Beijing Conference has a three-fold relevance for contemporary international politics. First, China’s initiative for 5 Principles of Peaceful Coexistence as well as its continuity through President Xi Jinping’s vision of a ‘Community for Shared Future for Mankind’ are visions rooted in Asian Wisdom which springs from centuries old civilisations. Second, this is the first non-Western vision of a new global order that rejects hegemony, militarism or diktat of any one power-based military might.\nThird, today the Global South, comprising countries of Asia, Africa & Latin America, are the World’s Majority, and given the international consensus behind China’s initiatives of 5 Principles of Peaceful Coexistence and ‘Community of a Shared Future for Mankind’, these are now the philosophical foundations for Global South, which will drive  economic and political developments in the future”.\nGiving examples from China’s contribution to Asian wisdom, which is based on peace, harmony, equality and inclusivity, he cited the Chinese philosophy of ‘Seek Truth from Facts’ and ‘Socialism with Chinese characteristics’, adding that China is the only country in history to rise peacefully, without conquest, colonisation, invasion, occupation or aggression. Appealing to the West to discard notions of a New Cold War or ‘containment’ of China, Senator\nMushahid Hussain concluded his speech with a famous quotation from the ancient Chinese philosopher Confucius: ‘do not do to others what you do not want others to do to you’.\nEarlier, Senator Mushahid Hussain was leader of a group of 30 prominent ‘Friends of China’ who were specially invited by the Chinese Peoples Association for Friendship with Foreign Countries for a friendly interaction by the Association’s Chairman, Minister Wang Yanming and in this capacity, he addressed the special banquet referring to his 50-year plus relationship with China, when he first visited China as a 17-year old college student leading a youth friendship delegation in the early 1970s.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:35:04.278Z"
}
