{
  "title": "PMDC to conduct NRE exam",
  "link": "https://www.app.com.pk/national/pmdc-to-conduct-nre-exam/",
  "date_published": "2024-06-30T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP):The Pakistan Medical and Dental Council (PMDC) is set to conduct the National Registration Examination (NRE) Step 2 Clinical Skills Examination (CSE) on July 20-21 and July 27-28, 2024.\nThis exam assesses the clinical skills and competencies of medical graduates, ensuring they meet the required standards for practice.\nThe NRE Step 2 CSE involves practical assessments, including patient interactions, clinical procedures, and decision-making processes.\nThis objectively structured clinical examination (OSCE), requiring candidates to pass both the theory and CSE components separately.\nThe CSE, will be three hours and 30 minutes, consisting of 20 stations across various disciplines, including Medicine, Surgery, Obstetrics and Gynecology, Pediatrics, Ophthalmology, and ENT.\nA 60% pass rate is required for both the theory and CSE components.\nPresident Pakistan Medical and Dental Council (PMDC), Prof. Dr. Rizwan Taj emphasized the exam’s importance for foreign graduates with Pakistani nationality to register with PMDC.\nHe highlighted the significant improvements in medical and dental education, professionalism, and patient care due to PMDC’s efforts.\nThe NRE Step 2 exam ensures that only competent professionals enter the medical and dental fields, maintaining high standards of medical education and practice in Pakistan.\nThe transparent and fair design of the exam reduces biases and ensures equal opportunities for all candidates.\nIt encourages continuous learning and professional development, promoting excellence in healthcare services.\nThe rigorous assessment process upholds public trust in the medical and dental professions and maintains the quality of healthcare services.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:34:42.688Z"
}
