{
  "title": "Pakistan advises Indian politicians to cease dragging it into domestic politics",
  "link": "https://www.app.com.pk/global/pakistan-advises-indian-politicians-to-cease-dragging-it-into-domestic-politics/",
  "date_published": "2024-05-14T15:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Pakistan on Tuesday urged the Indian politicians to cease dragging Pakistan into their domestic politics for electoral gains and to handle sensitive strategic matters with the utmost caution.\n“We call upon the international community to take note of Indian leadership’s belligerent rhetoric, which poses a grave threat to regional peace and stability,” Spokesperson Ministry of Foreign Affairs Mumtaz Zahra Baloch, said in a press statement, in response to media queries regarding a series of Pakistan-related remarks made recently by the Indian Prime Minister, External Affairs Minister and other cabinet members.\nThe spokesperson said that they were witnessing an alarming surge in anti-Pakistan rhetoric from various Indian leaders amidst the ongoing Lok Sabha election campaign.\n“We outrightly reject these irresponsible statements, which cover a wide array of topics including the Jammu and Kashmir dispute, counter-terrorism efforts, state of bilateral relations, and nuclear capabilities,” it was added.\nRegrettably, the spokesperson said these statements reflected an unhealthy and entrenched obsession with Pakistan and revealed a deliberate intent to exploit hyper-nationalism for electoral gains.\nThese also signified a desperate attempt to deflect attention from mounting domestic and international criticism, she added.\n“The bravado and jingoism exhibited by Indian leaders expose a reckless and extremist mindset. This mindset calls into question India’s capacity to be a responsible steward of its strategic capability,” the spokesperson maintained.\nOn the other hand, she further said the purpose of Pakistan’s strategic capability was to safeguard its sovereignty and defend its territorial integrity.\n“Pakistan has also clearly demonstrated its resolve to defend itself in the past, and would not hesitate to do so in the future should the Indian side choose to embark on a misadventure,” it was asserted.\nJust a few months ago, Pakistan exposed details of India’s campaign of extrajudicial and transnational assassinations on Pakistani soil and India’s continuous emphasis on its readiness to take aggressive actions within Pakistan constituted a tacit admission of guilt.\nRegarding the inflammatory rhetoric about Azad Jammu and Kashmir, Pakistan reiterated that historical facts, legal principles, moral considerations, and ground realities refuted India’s baseless claims. “Jammu and Kashmir remains an internationally-recognized disputed territory, and the relevant UN Security Council resolutions clearly mandate a plebiscite under UN auspices for its final determination. No amount of inflated Indian statements can change this reality. India should, therefore, focus on implementing these resolutions instead of indulging in fantasies of grandeur,” it was reiterated.\nThe spokesperson emphasized that vision of peace, progress, and prosperity in South Asia could only be realized through the peaceful resolution of all outstanding disputes, including Jammu and Kashmir, and a shift from confrontation to cooperation.",
  "retrievedAt": "2025-08-11T02:29:50.050Z"
}
