{
  "title": "PM’s timely decision on AJK situation averted a tragedy: Tarar",
  "link": "https://www.app.com.pk/national/pms-timely-decision-on-ajk-situation-averted-a-tragedy-tarar/",
  "date_published": "2024-05-14T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Federal Minister of Information and Broadcasting Attaullah Tarar said on Tuesday that Prime Minister Shehbaz Sharif’s decision to resolve the ongoing crisis in Azad Jammu and Kashmir had averted a tragedy.\nAddressing a press conference along with Federal Minister of Kashmir Affairs and Gilgit Balochistan Engineer Amir Muqam  at the Parliament House, he said that the  conspiracy of the inimical forces was foiled who faced humiliation due to the Prime Minister’s timely actions.\nTerming Pakistan Tehreek-e-Insaf as “Tehreek-e-Intishar”, he said its dreams of creation of chaos and anarchy had also been shattered.\n“Along with the enemy, the ‘Tehreek-e-Intishar’ also thought that in some way or the other, chaos would spread and there would be anarchy” as its leadership wanted to benefit from the sad situation.\nTarar said that the Prime Minister took all the coalition parties and stake holders on board  and heard their views.\n“Yesterday’s meeting was attended by all the political leadership including the Prime Minister of Azad Jammu and Kashmir”, he remarked.\nThe minister said the political leadership and federal ministers resolved the issues through mutual understanding.\nThe minister said that the prime minister resolved the issue with excellent decision making as the crisis can be eliminated only by timely decisions.\n“There is a world of difference between the incompetent government of the past and present elected regime”, he added.\nHe said that inflation was being controlled by prudent  government policies and  measures.\nThe minister maintained that foreign investment was increasing, the stock market was breaking records which proved that the economy was on the right track.\nReduction in inflation is not being digested by certain elements. He said that every conspiracy will be thwarted by the grace of Allah, and all conspirators will be exposed.\nLashing out at the founder of PTI,  he said Imran Khan was a convicted prisoner facing trial in several corruption cases. He said that Imran’s letters to the International Monetary Fund or Chief of Army Staff had no significance.  He remarked that in the past PTI’s conspiracies regarding IMF loan agreement and GSP plus status failed and in future too such plots will also fail.\n“Kashmir is our jugular vein , we will not let any enemy look at it with an evil eye,”  he remarked.\nTo a question,  he said that  Kashmir issue was being raised at all relevant  forums and it should be resolved according to UN resolutions.\nExpressing heartfelt condolences to the  families of the martyred policemen, he said they will be supported.\nHe said Pakistan’s reputation was being restored, foreign delegations were visiting and foreign investment was increasing gradually thanks to the policies of the government.\nTo a question he said that the AJK  had a special status and its affairs were run with the grant of the federal government.\nHe said that due to the policies of the government inflation was coming down, which was a positive sign.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:30:34.470Z"
}
