{
  "title": "PM announces to privatise all SOEs sans strategic ones",
  "link": "https://www.app.com.pk/national/pm-orders-privatisation-of-all-soes-sans-strategic-ones/",
  "date_published": "2024-05-14T05:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Prime Minister Shehbaz Sharif on Tuesday announced that the government would privatise all state-owned enterprises (SOEs), excluding the strategic ones, regardless of their profitability or financial losses.\nThe prime minister, chairing a high-level meeting to review the matters related to the Ministry of Privatisation and Privatisation Commission, directed all the federal ministries to carry out the necessary procedures and extend their cooperation with the Privatisation Commission for the purpose.\nIn the meeting, the privatisation ministry and the Privatisation Commission presented a roadmap for the Privatisation Programme 2024-29.\nThe prime minister said the government had nothing to do with running the businesses but was mandated to facilitate the investors. He viewed that the privatisation of SOEs would save the taxpayers’ money to help the government provide quality services to the people.\nReiterating the government’s commitment to a transparent process, the prime minister directed to live telecast the bidding and other procedures of the privatisation of Pakistan International Airlines and other entities.\nDuring the briefing on the progress in the SOEs’ privatisation, the participants were told that the pre-qualification process for PIA privatisation would be completed by the end of this month. The consultation for privatisation of Roosevelt Hotel was underway and the government-to-government transaction of the First Women Bank was in process with the United Arab Emirates.\nIt was told that the power distribution companies had been included in the 2024-29 Privatisation Program and the privatisation of loss-making SOEs would be prioritised.\nThe participants were told that a pre-qualified panel of experts would be appointed at the Planning Commission for a swift and transparent privatisation process.\nFederal ministers Khawaja Asif, Muhammad Aurangzeb, Jam Kamal Khan, Awais Ahmed Leghari, Abdul Aleem Khan, Dr Musaddik Malik and Ahad Khan Cheema, PM’s Coordinator Rana Ehsan Afzal, and relevant senior officers attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:29:46.510Z"
}
