{
  "title": "Lawmakers call of setting aside political differences, taking steps towards welfare",
  "link": "https://www.app.com.pk/national/lawmakers-call-of-setting-aside-political-differences-taking-steps-towards-welfare-2/",
  "date_published": "2024-05-14T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):The lawmakers in the National Assembly on Tuesday called of setting aside political differences and taking steps towards  welfare, development, and progress of the country.\nSpeaking in the National Assembly, Pakistan Peoples Party’s Sharmila Farooqi said that Asif Ali Zardari was the only civilian who had been elected president twice.\nShe urged political parties to bury politics of hate and confrontation, focusing instead on the welfare of the masses and the uplift of the nation.\nShe said that it was the responsibility of elected representatives to demonstrate unity and address the issues affecting the people.\nAli Muhammad Khan, leader of the Sunni Ittehad Council, said his party not against the dialogue.\nHe said, that political parties must prioritize decisions that promote the country’s development.\nHe called for political leadership to set aside differences and focus on resolving the public’s issues promptly.\nFarooq Sattar from the Muttahida Qaumi Movement-Pakistan questioned governance in Sindh province, urging the provincial government to take measures to improve law and order in Karachi.\nHe requested the prime minister’s attention towards development initiatives and the establishment of a modern transport system.\nThe lawmaker advocated for the implementation of universal education programs and the improvement of the healthcare system in the province, urging political parties to unite in their efforts for the country’s welfare.\nPakistan Peoples Party Leader, Abdul Qadir Patel praised President Asif Ali Zardari’s recent address to the joint sitting of parliament, describing it as a beacon of light capable of resolving the country’s challenges.\nHe expressed disappointment at opposition claims that the address was merely “copy and paste,” asserting that it comprehensively covered critical issues such as relations with neighboring countries, the Kashmir and Palestine disputes, continuity of democracy, unemployment, inflation, reconciliation, rule of law, and the supremacy of Parliament.\nQadir Patel highlighted President Zardari’s resilience, noting his 14 years of imprisonment without conviction and his dignified approach toward the opposition without resorting to indecent language.\nHe recalled Asif Ali Zardari’s slogan of “Pakistan Khapay” after the tragic death of Shaheed Benazir Bhutto to counter anti-state elements.\nPakistan Muslim League-Nawaz Legislator Hanif Abbasi held Pakistan Tehreek-e-Insaf (PTI) responsible for the riots that occurred on May 9 last year, calling for strict action against the perpetrators.\nHe criticized PTI leaders for allegedly removing valuable gifts from the Saudi government from Toshakhana.\nAbbasi accused PTI of backing anarchy in Azad Jammu and Kashmir (AJK) and cited instances of misconduct by PTI members in the National Assembly.\nHe alleged that PTI had been planning attacks on military installations for over a year.\nAbbasi urged stringent measures against disruptive elements, warning that failure to act decisively could lead to further instability and attacks on military installations by unruly mobs.\nHe emphasized the need to address such challenges firmly to ensure the country’s progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:30:20.118Z"
}
