{
  "title": "COMSTECH hosts International Hybrid Workshop on ‘Drug Discovery and Development in the Modern Era’",
  "author": null,
  "content": "ISLAMABAD, Apr 10 (APP):COMSTECH, the Ministerial Standing Committee on Scientific and Technological Cooperation of the OIC, in collaboration with the Global Network for Neglected Tropical Diseases (NTD), organized an international hybrid workshop titled “Drug Discovery and Development in the Modern Era” at its Secretariat on Thursday.\nThe workshop brought together leading international experts in drug discovery and structural biology, including Prof. Dr. Paul Denny and Prof. Dr. Ehmke Pohl from Durham University, UK.\nIt served as a vital platform to explore advanced strategies for developing new treatments for neglected tropical diseases, with a specific focus on leishmaniasis.\nProf. Dr. Paul Denny, a Fellow of the Royal Society of Biology and the UK Higher Education Academy, addressed the global burden of leishmaniasis, a disease now endemic in over 90 countries across four continents.\nHe critically analyzed the shortcomings of current therapeutic approaches and stressed the importance of collaborative, interdisciplinary research efforts that cross borders to develop effective, safe, and affordable alternatives for the treatment of these diseases.\nProf. Dr. Ehmke Pohl, Director of the Biophysical Sciences Institute and Co-Director of the EPSRC Centre for Doctoral Training in Molecular Sciences for Medicine (MoSMed CDT) at Durham University, highlighted recent breakthroughs in artificial intelligence (AI)-based protein structure prediction and their profound implications for drug target identification.\nWhile he acknowledged the accelerating power of AI in drug discovery, he emphasized that laboratory-based experimental validation remains crucial. He also presented a collaborative research project involving novel bacterial enzymes derived from hydrothermal vents, which are being investigated in partnership with the International Center for Chemical and Biological Sciences (ICCBS) Karachi for their diagnostic potential in combating leishmaniasis.\nIn his inaugural address, Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General of COMSTECH, highlighted the critical role of international cooperation in addressing neglected diseases that disproportionately affect marginalized populations.\nHe underscored COMSTECH’s growing partnerships with Durham University and the Global Network for NTDs—a multinational consortium operating across six countries—that aim to promote scientific exchange, capacity building, and innovative research solutions.\nThe achievements of this consortium were recently recognized with the UK Medical Research Council’s Outstanding Team Impact Award in 2024.\nThe hybrid event witnessed robust participation, with 50 in-person attendees, including five Palestinian students, from prominent Pakistani institutions such as the National Institute of Health (NIH), Pakistan Council of Scientific and Industrial Research (PCSIR), National University of Sciences and Technology (NUST), COMSATS University, Riphah Medical College, Health Services Academy (HSA), and Rawalpindi Medical College.\nIn addition, more than 120 participants from over 20 member states of the Organization of Islamic Cooperation (OIC) joined the workshop, virtually.\nThis event marked a significant step forward in fostering international dialogue, advancing scientific collaboration, and accelerating research efforts aimed at combating neglected tropical diseases that continue to impact millions globally.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:22:58.191Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/comstech-hosts-international-hybrid-workshop-on-drug-discovery-and-development-in-the-modern-era/",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T11:20:00.000Z"
}
