{
  "title": "Pakistan, UK discuss energy collaboration, sustainable development",
  "author": null,
  "content": "ISLAMABAD, Apr 10 (APP):Minister for Petroleum Ali Pervaiz Malik and Development Director of the British High Commission Joe Moir on Thursday discussed exploring opportunities for enhanced bilateral cooperation in Pakistan’s petroleum and energy sectors.\nAccording to a news release, the discussions focused on strengthening UK-Pakistan collaboration in oil, gas, and broader energy initiatives, with both sides emphasizing sustainable development, technological exchange, and British support for Pakistan’s energy infrastructure.\nAli Pervaiz Malik underscored the government’s commitment to bolstering energy security and efficiency, welcoming British expertise and investment in the field.\n“Pakistan values its longstanding relationship with the UK, and we look forward to deepening cooperation in the energy sector to ensure sustainable growth and mutual economic benefits,” he said, adding the country’s push to reform its liquid fuels sector in alignment with its sustainability goals.\nJoe Moir reaffirmed the UK’s support for Pakistan’s energy transition and capacity building.\n“The UK is keen to collaborate with Pakistan in addressing energy challenges through innovation and investment. We are committed to supporting projects that promote economic resilience and enhance institutional capacity,” he stated.\nThe meeting also covered potential joint ventures, regulatory improvements, and policy frameworks conducive to future investments. Both sides agreed to maintain close engagement and pursue further collaboration under the broader strategic partnership between Pakistan and the United Kingdom.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:22:19.643Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-uk-discuss-energy-collaboration-sustainable-development/",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T14:12:00.000Z"
}
