{
  "title": "Turkish envoy for exploring new cooperation avenues with Pakistan",
  "author": null,
  "content": "ISLAMABAD, Apr 10 (APP):Turkish Ambassador to Pakistan, Irfan Neziroglu on Thursday urged to explore more areas of cooperation and joint ventures between two brother countries.\nDuring a meeting with the Chairman of the Prime Minister’s Youth Programme, Rana Mashhood Ahmed Khan,  the ambassador highlighted the potential of youth exchanges and collaborations.\nHe emphasized to avail opportunities for Turkish students to pursue higher education at Pakistan’s prestigious universities.\nThe meeting underscored the deep fraternal bonds shared by Pakistan and Türkiye, transcending traditional diplomatic ties and youth-centric initiatives between the two nations.\nHe expressed gratitude for Prime Minister Shehbaz Sharif’s visit to Türkiye during the devastating earthquake, lauding it as a testament to the solidarity between the two countries.\nChairman Rana Mashhood revealed that Pakistan would offer fully funded scholarships to Turkish students, paving the way for stronger academic linkages.\nHe also sought collaboration on the National Youth Council of Pakistan, inviting Turkish expertise and participation to empower the youth of both nations.\nThe meeting also explored cooperation in media and sports, with both sides expressing enthusiasm for joint projects that would further cement cultural and people-to-people connections.\nThe Chairman reiterated Pakistan’s commitment to deepening ties with Türkiye, emphasizing that such initiatives would unlock new opportunities for the youth and strengthen the historic brotherhood between the two nations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:22:58.962Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/turkish-envoy-for-exploring-new-cooperation-avenues-with-pakistan/",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T10:50:00.000Z"
}
