{
  "title": "Joint action needed to tackle climate change: Syed Naveed Qamar",
  "link": "https://www.app.com.pk/national/joint-action-needed-to-tackle-climate-change-syed-naveed-qamar/",
  "date_published": "2024-10-28T08:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP):Member of the National Assembly and President of the Parliamentarians for Global Action (PGA), Syed Naveed Qamar Monday called for joint action and collective efforts to address global challenges like climate change.\nSpeaking at the opening session of the 45th PGA Forum, hosted by Pakistan Naveed  Qamar welcomed international delegates and stressed the importance of parliamentarians sharing their experiences to promote justice and the rule of law globally.\nHe said that coordinated action is essential for the welfare of humanity, stressing that progress on a global scale requires unity.\n“This forum is for activists and parliamentarians who are committed to human rights and democracy,” he said. “The leaders gathered here aim to make this world a better, more livable place, which is the ultimate goal of the PGA.”\nHe advocated for the uniqueness of the PGA as an organization that stands out globally and urged delegates to learn from each other’s successes and failures.\nWhile addressing the Consultative Assembly of Parliamentarians on the International Criminal Court (CAP-ICC), he encouraged candid discussions about the forum’s achievements and challenges.\n“We need to achieve a minimum agenda that can contribute to the greater good of humanity,” Naveed Qamar said, citing his success in passing the bill for transgender rights in Pakistan as an example of translating global initiatives into local action.\nHe also emphasized the need to further mobilize the PGA in Asia and Europe, pointing out that climate change is a pressing issue that no single country or region can tackle alone. “Parliamentarians should engage in honest discourse and return to their countries with a clear action plan,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:27:00.451Z"
}
