{
  "title": "CAP-ICC convened to mull over pressing global challenges amid piling up humanitarian, climate crisis: Speaker",
  "link": "https://www.app.com.pk/national/cap-icc-convened-to-mull-over-pressing-global-challenges-amid-piling-up-humanitarian-climate-crisis-speaker/",
  "date_published": "2024-10-28T07:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP): Speaker of National Assembly Sardar Ayaz Sadiq on Monday said the 13th Consultative Assembly of Parliamentarians on International Criminal Court and Rule of Law (CAP-ICC) had been convened under the patronage of Parliamentarians for Global Action (PGA) to mull over pressing global challenges amid piling up humanitarian and climate crisis jeopardizing human security on the planet.\nHe was addressing the 45th Annual Forum of Parliamentarians for Global Action 13th Consultative Assembly of Parliamentarians on International Criminal Court and Rule of Law hosted by the National Assembly of Pakistan.\nNA Speaker, Sardar Ayaz Sadiq said the responsibility of Parliamentarians was not restricted to mere legislation but rather to ensure rights and betterment of their constituents facing myriads of challenges.\nHe informed that every parliamentarian in Pakistan had around one million constituents in their constituencies that were facing huge and tremendous issues of access to clean drinking water, sanitation, stunting and many more.\nThe main goal of the forum was to work out mechanisms to follow up the PGA members commitments at their native parliaments to ensure concerted efforts to bring relief for humanity in distress, he added.\nHumanitarian issues were piling up amid no declining trend, whereas wars and violence were exacerbating human miseries, however all wars were only resolved on table, he added.\n“It’s our collective responsibility and all members delegates to fully utilize this forum as opportunity to devise effective strategies,” he added.\n“It’s our job to improve the lives of our constituents. It’s our responsibility to raise our voices against violence and bloodshed like one taking place in Gaza to stop it. Moreover, the unresolved issue of Kashmir where forced disappearances and mass graves are a serious issues amid blatant violations of UN resolutions,” the NA Speaker said.\nAyaz Sadiq also highlighted the country and region’s increasing vulnerability to climate change that resulted into unprecedented devastation post 2022 floods despite being one of the least contributors to global warming and climate change.\nSecretary-General, Parliamentarians for Global Action (PGA), Mónica Adame in her welcome remarks gave a warm welcome to all delegates and congratulated the National Assembly for their impressive arrangements and warm hospitality.\nShe acknowledged the support of the NA Speaker, President PGA, Syed Naveed Qamar, Chairperson PGA National Chapter Sherry Rehman, parliamentarians and the delegates participating in the forum.\nMónica Adame informed that the PGA was founded 45 years ago and was the largest non-governmental network of crossborder parliamentarians across the world.\nThe PGA mobilized legislators as champions of human rights, rule of law, democracy, human security, climate justice and gender equality, she added.\n“We seek to reveal trust between Parliamentarians and relevant stakeholder. The role of parliamentarians in ensuring rights of their constituents is paramount and it is also important for them to ensuring bilateral dialogue at all levels and stop impunity to the violence and mass human rights violations world over,” she added.\n“The CAP-ICC forum serves as a forum to exchange best practices, challenges, experiences and lessons learnt among the members whereas the international criminal court was the only established global court to listen to the cases pertaining to serious risk to humanity,” she said.\nPresident, PGA Pakistan National Group, Senator, Sherry Rehman in her opening remarks welcomed the elected representatives and delegates participating in the PGA Conference from all over the world on their arrival in Pakistan to attend the CAP-ICC.\nSenator Rehman emphasized on joint efforts that were necessary to promote world peace and rule of law.\n“PGA’s efforts to promote global justice and peace are commendable. The member Parliamentarians have to adopt a common plan of action to end conflicts. Pakistan has always taken the lead in supporting world peace and human rights,” Senator Sherry Rehman said.\nPakistan was committed to promoting justice, human rights and rule of law, whereas the role of parliamentarians was very important for the promotion of global justice, she said.\nPresident, Parliamentarians for Global Action, Member National Assembly (MNA), Syed Naveed Qamar in his special remarks underscored the importance of revitalizing Pakistan’s stature as a vibrant nation advocating global rights, democracy and justice.\nThe PGA forum, he said was for the activists and parliamentarians who care for human rights and democracy.\n“The Parliamentarians are here as the leaders of their nation who have gathered here to make this world a better liveable place which is the goal of PGA,” MNA Syed Naveed Qamar said.\nThe PGA President advocated for the exclusivity of the forum as one of the most different organization in the world.\nHowever , he urged the delegates to initiate the process to learn from each other’s experiences and failures.\nWhile discussing at the CAPICC, he said, “It is necessary for the delegates to review the forum’s achievements, experiences, failures, and express their candid view point.”\n“We need to achieve a minimum agenda that can contribute to the better good of humanity. I, with the help of the PGA, moved the bill for transgender rights and got it passed, which helped me in moving the global agenda with its translation at the local level,” Syed Naveed Qamar said.\nHe underscored the need to mobilize PGA more in Asia and Europe as Climate Change was the next big challenge globally which no country and region alone can resolve.\nThe Parliamentarians should have a candid discourse and return to their countries with a to do list with clear goals, he added.\nOver 46 parliamentarians are participating at the two-day global CAP-ICC in person and 14 delegates were participating online in the forum.",
  "retrievedAt": "2025-08-10T20:26:52.843Z"
}
