{
  "title": "Parliamentarians call for strengthening PGA’s role in global peace, justice",
  "link": "https://www.app.com.pk/national/parliamentarians-call-for-strengthening-pgas-role-in-global-peace-justice/",
  "date_published": "2024-10-28T08:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP):Pakistani members of the Parliamentarians for Global Action (PGA) on Monday underlined the need to enhance the organization’s role in addressing global challenges.\nTalking to APP Barrister Aqeel Malik, Barrister Daniyal Chaudhry, and Dr. Mirza Ikhtiar Baig underscored the importance of parliamentary representatives in promoting global peace and justice, noting that these efforts are now more crucial than ever.\nAt the PGA conference, hosted by Pakistan, participants discussed key global issues, including international law, climate change, and human rights. Both Pakistani and international delegates reaffirmed their commitment to leading efforts to address these pressing challenges.\nBarrister Aqeel Malik, PGA member and Advisor on Law and Justice highlighted Pakistan’s dedication to upholding the principles of global justice and human rights.\nHe called on the international community to eliminate double standards in dealing with conflicts like Palestine and Kashmir, stressing that Pakistan’s struggle reflects its firm stance on promoting global justice while maintaining sovereignty and integrity.\nFederal Parliamentary Secretary for Information and Broadcasting, Barrister Daniyal Chaudhry, emphasized the significant role of Pakistani politicians in establishing global peace.\nHe pointed out that resolving conflicts such as Kashmir and Palestine is essential for achieving fair and lasting peace. He reiterated Pakistan’s unparalleled sacrifices in promoting global peace and reaffirmed the nation’s commitment to justice on the international stage.\nDr. Mirza Ikhtiar Baig, a Pakistan People’s Party leader and PGA member, echoed the need for international cooperation in tackling challenges like climate change.\nHe reaffirmed Pakistan’s readiness to collaborate with the global community to address these issues and emphasized the country’s long-standing commitment to human rights and the rule of law.\nHe reiterated Pakistan’s dedication to advancing global peace, justice, and human rights, urging the international community to adhere to principles of equal justice and fairness.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:27:11.531Z"
}
