{
  "title": "WAPDA to build 5 small dams in GB to generate 13940MW electricity",
  "link": "https://www.app.com.pk/national/wapda-to-build-5-small-dams-in-gb-to-generate-13940mw-electricity/",
  "date_published": "2024-10-28T13:02:00.000Z",
  "source": "APP",
  "content": "GIlGIT, Oct 28 (APP): Project Director Diamer Bhasha Dam Nizakat Hussain said that WAPDA has a plans to build five small dams in Gilgit-Baltistan with a total capacity of 13940 MW. While talking to media person at the site of Dame he said that the dams which include Shevik, Skardu Sho, Thargos, Elbo, and Bunji will be constructed by WAPDA and will provide much-needed electricity to the country. Additionally these dams will accelerate industrial development and bring significant changes to food security.\nAccording to Hussain, work on the five dams will commence in Gilgit-Baltistan as soon as possible with Bunji Dam generating the most electricity at 7100 MW. He informed that the smallest power project will be Shevik which will produce 4600 MW. He added the construction of these dams will not only increase the lifespan of Diamer Bhasha Dam, Dasu, and Tarbela Dams but also enhance their capacity. He revealed that the project aims to increase the height of Diamer Bhasha Dam and deepen the river to extend the life of lower dams.\nThe project director Nizakat Hussain said that the construction of the Diamer-Bhasha Dam will help prevent soil from upper areas from reaching other dams. He also mentioned that 70% of the work on the dam has been completed and is expected to be finished by 2029. “The dam will have a tunnel with enough capacity to store ten days’ worth of water which will help reduce water scarcity in Tarbela Dam during winters” he added. Additionally, the dam will help control flood damage by regulating water flow during high floods, he informed. Hussain also noted that hundreds of Chinese nationals are playing a crucial role in the dam’s construction and the dam’s lifespan is expected to be 80 years which can be extended with the construction of small dams in Gilgit-Baltistan.\nFurthermore Hussain stated that the Diamer-Bhasha Dam is a concrete dam, and its construction is the largest in the world.",
  "retrievedAt": "2025-08-10T20:27:28.293Z"
}
