{
  "title": "Kashmiri folk tunes and heritage enliven Lok Mela 2024",
  "link": "https://www.app.com.pk/national/kashmiri-folk-tunes-and-heritage-enliven-lok-mela-2024/",
  "date_published": "2024-11-14T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP):The Azad Kashmir Department of Culture held a captivating music concert at Lok Virsa’s Open Air Theatre on Thursday, showcasing Kashmiri folk tunes that resonated through the evening.\nThe event, as a part of Lok Mela, featured performances by renowned folk artists from Azad Kashmir, including Badr Khan, Altaf Ahmed Mir, Ashiq Butt, Sohail Abbasi, Dilawar Abbas, Hina Abbasi, Shakeel Ahmed Mir, Nader Ali, Sajjad Shah, Babar Panjkoti, Bano Rahmat, Abdul Basit, Noman Saleem, and Raja Anwar.\nLok Mela 2024 has provided a platform for celebrating the diverse cultural heritage of Pakistan’s provinces. While Kashmir’s vibrant traditions displayed today drew  significant attention.\nAlongside musical performances, the festival highlighted Kashmir’s handicrafts, rituals, and traditional skills.\nOver 25 artisans and artists from Azad Jammu and Kashmir showcased their talents, representing the region’s deep-rooted cultural heritage.\nAmong the standout artisans was Zulfiqar Ghazi, celebrated for his mastery in Kashmiri papier-mâché and miniature art. His creations also span stained glass, fabric design, and traditional furniture painting, often featuring motifs inspired by nature, animals, and Mughal emperors. With his commitment to preserving the Mughal artistic legacy, Ghazi has represented his craft both nationally and internationally, earning recognition and awards.\nGhulam Nabi, a skilled woodcarver originally from Kashmir Valley, has brought his ancestral craft to Pakistan, where he now teaches wood carving to young students.\nHis work, along with that of Irfan Ghulam Nabi, whose intricate wood carvings on walnut, cedar, and shesham were a festival highlight, showcasing the exceptional skill and artistry of Kashmiri artisans.\nLok Mela will continue at Lok Virsa till November 17, offering visitors a chance to experience Kashmir’s rich cultural heritage firsthand.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:17:47.300Z"
}
