{
  "title": "‘Artificial intelligence transforming everything as we live in an age of Meta, Google’: Speakers",
  "link": "https://www.app.com.pk/national/artificial-intelligence-transforming-everything-as-we-live-in-an-age-of-meta-google-speakers/",
  "date_published": "2024-11-14T16:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP): Director, Research & Analysis IPRI Brig (Retd) Dr Raashid Wali Janjua on Thursday said the astounding advances in technologies like Artificial Intelligence and Quantum Computing were transforming warfare wherein the entire grammar and logic of the war was changing.\nAddressing the session on “Age of Technology: Exploring New Horizons,” at Margalla Dialogue 2024, of Islamabad Policy Research Institute (IPRI) here, he said for the first time in human history the human agency was taken out of the loop upending the whole nature of the war, said a press release.\nDr Raashid said the Clausewitz’s trinity of war was no longer the ruling war paradigm as non-state actors and emerging technologies like Lethal Autonomous Weapons, Space Warfare, AI enabled weapons, and Brain-Computer Interface were increasing the tempo of warfare beyond human control. The world therefore needs to bring IHL in sync with AI warfare and to evolve a global consensus for an AI arms control treaty.\nThe session was moderated by Dr. Basit Riaz, CEO Forloops, Pakistan; and Alex Gladstein, Chief Strategy Officer at Human Rights Foundation, USA, was the keynote speaker.\nDr. Gao Xudong, Professor, School of Economics and Management, Tsinghua University, China, spoke on “Developing Emerging Technologies and the Role of East,”. Iva Gumnishka, Founder, Humans in the Loop, Czech Republic, highlighted the dynamics of “AI Regulations/ Autonomous Weapons,” and Daniel Castro, Vice-President, Information Technology and Innovation Fund, USA, outlined the critical strides of “Emerging Technologies and their Impact on National Security and Economy.”\nThe panel was of the view that Artificial Intelligence (AI) is transforming everything as we live in an age of Meta, Google, and where language proficiency of AI is making strides in healthcare too.\nThey said that AI is going to create ripples in human development and impact the very existence of humanity. The panel talked at length on the new financial fiefdom of Bitcoin and believed that it is gradually catching attention and the way to go. Bitcoin is seen as an enabler in creating open societies.\nEarlier, in another session ‘Reforming Governance and Human Security’, Federal Commerce Minister Jam Kamal in a keynote address said that the modern technology and communication has transformed the landscape of Balochistan, and people are well aware and capable of making decisions.\nThe panel was moderated by Sidra Iqbal, Broadcast Journalist, Aaj TV, Pakistan; and the keynote address was delivered by Federal Minister for Commerce Jam Kamal Khan.\nOther speakers were Shakil Durrani, Executive Director, Society for the Promotion of Engineering Sciences and Technology, Pakistan. Prof. Dr. Shahzad Ali Khan, Dean & Vice-Chancellor, Health Services Academy, Pakistan, Sakib Sherani, CEO, Macro Economic Insights, Dr. Claudia Milena Adler, Lecturer, International Humanitarian Affairs, University of York, UK, and Dr. Sabina Imran Durrani, Chief, Population and Social Planning Section, Ministry of Planning, Development and Special Initiatives (Population).\nMargalla Dialogue 2024, is an intellectual discourse of Islamabad Policy Research Institute (IPRI), which opened on Monday at Marriott Hotel, Islamabad. The two-day international conference deliberated on the theme, “Emerging Global Realities: Challenges and Response,” and held Four Forums along with special sessions on International Law and Economics.",
  "retrievedAt": "2025-08-10T15:18:46.730Z"
}
