{
  "title": "Bannu DPO seeks support of religious scholars to ensure peaceful Muharram - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: The police have begun reaching out to religious scholars from different schools of thought in Bannu district to seek their support to ensure peace and religious harmony during Muharram.\n\nDistrict Police Officer Saleem Abbas Kulachi visited the Hussania Imambargah in Bannu city on Saturday and met with Shia ulema to discuss the Muharram security plan.\n\nDSP (headquarters) Rizwan Khan and DSP city Arshad Khan also accompanied him.\n\nShia leaders Nauroz Ali Karbalai and Babar Ali briefed the district police chief about security arrangements of the Imambargah and mourning processions during Muharram.\n\nAsks officials to enhance security measures\n\nMr Saleem also inspected the routes of procession from the Imambargah to Milad Park via Mandan Gate and Mandan Chowk, and issued special instructions to officials to enhance security measures.\n\nHe said that the district police would put in place all resources for peaceful observance of the coming Aushura.\n\nThe DPO said the personnel deployed to protect mourners and processions should strictly follow security advisory.\n\nHe said the effective implementation of the security plan would help ensure peaceful observance of Ashura and avert any untoward incident.\n\nMeanwhile, elders and youth have set up a body to resolve issues of residents of Lakki Marwat city.\n\nThe formation of Lakki City Nangyali came during a meeting here on Saturday.\n\nThe participants said that they felt the need for setting up the body after residents getting electricity from the Old Kutcheri feeder faced prolonged power outages, low voltage and fluctuation problems by the power supply company.\n\nThey vowed to make joint efforts to resolve electricity, gas and water problems.\n\nThe participants elected chairman of the city’s neighbourhood council Engineer Latifullah Khan as the chairman of the organisation.\n\nThe other members included Syed Misbahullah as the senior vice chairman, Arif Khan Meenakhel as vice chairman, Shahab Gul as general secretary, Sohail Khan as deputy general secretary, Ali Khan as joint secretary, Bin Yamin Khan as finance secretary, Jamil Khan Haqdadabadi as information secretary and Shahzeb Khan as social media secretary.\n\nFormer Lakki tehsil naib nazim Hafiz Asif Saleem and Imranullah Begukhel were appointed the legal adviser and chief coordinator, respectively.\n\nLatifullah told reporters that in the first phase, they would take up with local authorities the issues of power and gas outages, lack of civic amenities, poor hygienic conditions and water shortage for resolution.\n\n“If our genuine grievances are not addressed, we will take to the streets,” he warned.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:36:21.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917223/bannu-dpo-seeks-support-of-religious-scholars-to-ensure-peaceful-muharram",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:04:27.000Z"
}
