{
  "title": "47 environmental samples found positive for polio - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As many as 47 environmental samples have tested positive for poliovirus, according to an official of the polio programme.\n\nAs part of ongoing robust poliovirus surveillance across the country, a total of 116 environmental (sewage) samples were collected from 82 districts during the month of May and tested at Regional Reference Laboratory for Polio Eradication at the National Institute of Health in Islamabad.\n\n“Moreover, 11 samples are currently under process in the lab,” the official said.\n\n“Of the total 116 samples, 69 samples tested negative with no poliovirus detected, while 47 samples tested positive,” he added.\n\nThe official said that samples from 15 districts of Punjab, 14 districts of Khyber Pakht­un­khwa, 11 districts of Balochistan, four districts of Sindh, three districts of Azad Jammu and Kashmir, one district of Gilgit-Baltistan, and Islamabad tested negative.\n\nHowever, the lab confirmed detection of wild poliovirus type 1 (WPV1) in sewage samples from 14 districts of Sindh, eight districts of KP, six districts of Balochistan, four districts of Punjab, one district of GB, and Islamabad.\n\nThe presence of poliovirus in 47 environmental samples across the country is a clear reminder that the virus continues to circulate in communities and poses a serious threat to children’s health.\n\n“Parents must remain vigilant and ensure their children receive repeated doses of the polio vaccine and complete their routine immunisation on time to stay protected against polio and other diseases,” the official urged.\n\nThis year Pakistan has reported 11 cases of poliovirus, including the first-ever case from Gilgit-Baltistan. Of the remaining 10 cases, five were reported from KP, four from Sindh and one from Punjab.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:58:23.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917259/47-environmental-samples-found-positive-for-polio",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:03:46.000Z"
}
