{
  "title": "Aurangzeb urged to review FBR’s excessive powers - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pak­istan Business Council (PBC) has expressed concern about the excessive powers granted to the Federal Board of Revenue (FBR), stating that this anti-business decision will further harm the already poor investment climate.\n\nPBC Chief Executive Officer Ehsan Malik, in a letter to Finance Minister Muhammad Aurangzeb, said the powers do not differentiate between major taxpayers and the informal sector.\n\n“We are alarmed at the draconian powers proposed to be granted to the FBR. If past practice is anything to go by, these will most likely be misused to harass the formal taxpaying sector,” he feared.\n\n“We are disappointed that the powers proposed for the FBR will do the exact opposite of encouraging investment,” Ehsan informed the finance minister.\n\nPointing out excessive powers to FBR, he said Section 11E enables tax assessment and recovery based on suspicion without proper investigation, while Section 14AE allows arbitrary seizure of business premises and property without adequate safeguards.\n\nSection 32B empowers private auditors with quasi-legal authority over businesses, while Section 33 introduces 10-year prison terms and Rs10 million fines for broadly defined “tax fraud,” which is likely to encompass business errors.\n\nSection 37AA authorises arrest without a warrant based on mere suspicion of tax fraud—a power that invites abuse and harassment, followed by Section 37B, which permits a 14-day detention of businesspersons, extendable through magistrates. Overriding the principle of client/advisor relationship, Section 58C will grant the FBR access to the offices of tax advisers and firms where discrepancies in returns are suspected.\n\nHe informed the finance minister that from a country on the brink of default less than three years ago, the current economic stability owes much to your determined leadership. The raging fire of inflation has been doused, borrowing costs have declined sharply, the fiscal deficit is in control, the current ac­­c­ount is in surplus, two IMF tranches have been appr­o­ved, and the rupee is stable.\n\nA substantial contribution to securing the IMF programme, and the resultant solvency, is the formal sector’s disproportionate contribution to taxes in the FY25 budget.\n\nThe council, for FY26, sought and has so far been denied a roadmap of gradual reduction in taxes. The critical need to support exports amid significant uncertainty from US tariffs has not been addressed.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:35:49.276Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917240/aurangzeb-urged-to-review-fbrs-excessive-powers",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:03:52.000Z"
}
