{
  "title": "Dashed hopes - Business - DAWN.COM",
  "author": null,
  "content": "WITH the real economy in a deep slump and macroeconomic indicators stable, how should we describe the current state of the economy and the direction in which we are heading?\n\nAccording to the just released Pakistan Economic Survey 2024-25, whatever spin you may want to give it, the economy is in a deep downturn given the collapse of the crop sector and the drastic decline in incomes in rural areas, where almost 60 per cent of the population lives and where extreme poverty is concentrated.\n\nSevere decline in rural incomes and little success in increasing exports have led to poor growth in manufacturing. A combination of the two has slowed down the services sector, which now makes up nearly 60pc of our GDP.\n\nThe resulting overall economic growth is dismal at around 2.5pc, while we need a minimum growth of at least 6.5pc to absorb the increase in the labour force and reduce the prevalent high levels of poverty, which, according to a recent World Bank report, has risen dramatically, post-Covid, to near 50pc.\n\nAt the same time, there is no denying the fact that the economy has stabilised. There is no threat of default given our current reserves, a stable exchange rate (though it has come under pressure), a current account surplus (thanks to a surge in remittances), and inflation at an all-time low (it is expected hover around 5-6pc). For this, the government can take full credit — a fact recognised by the IMF and rating agencies.\n\nRelief was hardly given to those who deserve it most.\n\nSo, is the price that we have had to pay for macroeconomic stability a drastic contraction of the real economy? While the stabilisation measures have indeed helped, I would strongly argue that the poor sequencing of these measures and economic reforms by our policymakers are chiefly to blame.\n\nA prime example is the agricultural sector. The cold-blooded way in which the government removed the wheat support price shows the anti-rural, pro-urban bias of the current regime. Without first ensuring the development of an alternative market, it left the farmers — both small and large — to suffer huge losses at the hands of the middlemen.\n\nNow let’s turn to what the future holds for the economy under IMF tutelage.\n\nIn his budget speech, Finance Minister Muhammad Aurangzeb emphatically stated that we have launched on a mission ‘to change the DNA of the economy from its currents inefficient uncompetitive path to one of high productivity and sustained economic growth’ — or words to that effect.\n\nTo put it more simply, he promised to implement economic reforms that will root out the current incentive structure, which breeds inefficiencies and inequalities and results in recurring stop-go cycles. We waited with bated breath to hear of the far-reaching reforms that are intended to usher in this process of creative destruction and the birth of a new economic order, but have been extremely disappointed.\n\nYes, some worn-out, positive steps were announced, which have been repeatedly tried before, with little success. This includes a tariff reform package — in the works since 1988 — with a maximum upper limit on import duties of 15pc in five years and four slabs. Significantly, there was no mention of a reduction in import duties on products of our most inefficient industries (for example, autos) to improve their competitiveness. This demonstrates a lack of reluctance to take on entrenched business interests.\n\nThe privatisation of the same old state-owned enterprises, such as PIA, the power distribution companies, etc, was promised. Hopefully, this time, the process will be successfully completed. A lot of faith was placed in the digital economy and increasing its export earnings (with ambitious targets), though concrete measures in this direction were difficult to discern.\n\nRelief was given under strong pressure to the real estate sector and traders, despite high hopes to the contrary, and hardly any to those who deserve it most — the working poor. And technology and data were waved around to bring more tax evaders into the tax net as if these have never been available before. Agriculture income tax was left to the provinces.\n\nKey issues related to investment in people (health, education, social protection) were rattled off, highlighting initiatives and projects by the prime minister, but the fact that we are cutting down on their already meagre share in the federal development programme, which itself has fallen to its lowest level in living memory to around 1pc of GDP, was not mentioned. Ultimately, this left us with roads and highways and infrastructure which would transform the economy.\n\nAnd we had envisaged this budget in the shape of a reform package to change our DNA!\n\nThe writer is professor at the Lahore School of Economics and former VC of the Pakistan Institute of Development Economics.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684e1e91a3a27.jpg",
  "retrievedAt": "2025-10-12T03:35:57.194Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917272/dashed-hopes",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:17:50.000Z"
}
