{
  "title": "Trump flexes military might at parade as protests sweep US - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump hosted the largest US military parade in decades on his 79th birthday on Saturday, as protesters rallied across the country to accuse him of acting like a dictator.\n\nTrump hailed the United States as the “hottest country in the world” after watching tanks, aircraft, and troops file past him in Washington to honour the 250th anniversary of the US army.\n\nBut it formed a stark split screen with turmoil at home and abroad, as police used teargas to disperse protesters in Los Angeles and US ally Israel traded missile fire with Iran in a rapidly escalating conflict in the Middle East.\n\nTrump’s parade on an overcast night in Washington came after tens of thousands of “No Kings” demonstrators thronged the streets in cities including New York, Philadelphia, Houston and Atlanta.\n\nTrump largely avoided his usual domestic political diatribes in an unusually brief speech, and instead focused on praising the US army, saying that they “fight, fight, fight, and they win, win, win”.\n\nThe display of military might comes as Trump asserts his power domestically and on the international stage.\n\nIn his address to the parade, Trump sent a warning to Washington’s adversaries of “total and complete” defeat, with the United States increasingly at risk of getting tangled up in Israel’s conflict with Iran.\n\n“Time and again, America’s enemies have learned that if you threaten the American people, our soldiers are coming for you,” Trump said.\n\nTrump had openly dreamed since his first term as president of having a grand military parade, of the type more often seen in Moscow or Pyongyang than Washington.\n\nThe last such parade in the United States was at the end of the 1991 Gulf War.\n\nWhen it came, Trump stood and saluted on a stage outside the White House as tanks rumbled past, aircraft roared overhead, and nearly 7,000 troops marched past.\n\nTroops and military hardware from different eras of US history passed by, with an announcer reeling off victories in battles with Japanese, German, Chinese and Vietnamese forces in past wars.\n\nThe army said it cost up to $45 million.\n\nBut while the crowd sang “Happy Birthday” and there were occasional chants of “USA! USA!”, the atmosphere was less intense than one of the barnstorming rallies that swept Trump to power.\n\nThe White House said that “over 250,000 patriots showed up” for the event, without providing evidence. Communications Director Steven Cheung described the “No Kings” protests as a “complete and utter failure”.\n\n“No Kings” organisers said protesters gathered in hundreds of cities, with AFP journalists seeing large crowds in several cities.\n\nOrganisers said they were protesting against Trump’s dictatorial overreach, and in particular what they described as the strongman symbolism of the parade.\n\n“I think people are mad as hell,” Lindsay Ross, a 28-year-old musician, told AFP in New York, where tens of thousands of people rallied.\n\nThousands turned out in Los Angeles to protest Trump’s deployment of troops in the country’s second-largest city following clashes sparked by immigration raids.\n\nPolice in Los Angeles used tear gas and mounted officers to clear protesters who had gathered in front of the federal building in downtown, the focus of demonstrations for the last week.\n\nAFP reporters at the scene said there was no disorder, but it appeared local officers were moving people away from an area where National Guard troops and Marines are stationed.\n\nSome protesters targeted Trump’s Mar-a-Lago estate in Palm Beach, Florida — while a small group even gathered in Paris.\n\n“I think it’s disgusting,” protester Sarah Hargrave, 42, said in the Washington suburb of Bethesda, describing Trump’s parade as a “display of authoritarianism”.\n\nThe killing of a Democratic lawmaker and her husband Saturday in the northern state of Minnesota — in what the governor called a targeted attack — also cast a pall over the parade.\n\nTrump was quick to condemn the attacks outside Minneapolis in which former state speaker Melissa Hortman was killed along with her husband, while another state lawmaker and his wife were hospitalised with gunshot wounds.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/151341162452382.jpg",
  "retrievedAt": "2025-08-20T03:57:55.723Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917286/trump-flexes-military-might-at-parade-as-protests-sweep-us",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T02:58:14.000Z"
}
