{
  "title": "3 brothers drown as car plunges into river in GB - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least three members of a family died and three others went missing on Sunday after their car plunged into a river stream in the Shinbar area of district Nagar, Gilgit-Baltistan.\n\nRescue 1122 official Nizamuddin told Dawn.com that the family was returning from a marriage ceremony when their car plunged into a stream, resulting in the drowning of six people and injuries to one.\n\nHe said rescue divers had recovered three bodies, while a search operation was ongoing to locate the remaining three missing individuals.\n\nSajid Ali, spokesperson for the Nagar district police officer, also confirmed the incident and said the car was en route to Chalt Bala when it plunged into the river stream.\n\nHe added that the bodies were transported to the District Headquarters Hospital in Nagar, while the injured had been referred to a hospital in Gilgit for further treatment.\n\nThe spokesperson identified the deceased as Ghulam Abbas, Sher Baz Ali, and Zohaib Ahmad. Those reported missing are Sharafat Hussain, Muhammad Hussain, and Aleem, while Kashif Hussain received injuries.\n\nHe said the three victims, who were brothers, were returning from the Bardas area after attending a wedding ceremony when the incident took place.\n\nGilgit Baltistan government spokesperson Faizullah Faraq said the accident was “regrettable”. He said Chief Minister Haji Gulbar Khan expressed sorrow over the incident and instructed all relevant departments, including the Home Secretary, to mobilise all available resources in the search for the missing individuals.\n\nAccording to the spokesperson, the vehicle carrying seven passengers was returning from a wedding ceremony when it plunged into the river late last night.\n\nFollowing the chief minister’s directives, rescue teams were dispatched to the site and efforts are underway to locate the remaining missing persons, he added.\n\nMany accidents occur on Gilgit Baltistan’s roads due to its challenging and treacherous terrain, which becomes particularly dangerous during harsh weather conditions.\n\nThe lack of proper safety barriers, limited visibility, and inadequate maintenance further increase the risk of accidents, making it one of the more hazardous routes in the region.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/15141114071d3b6.jpg",
  "retrievedAt": "2025-08-20T03:57:54.209Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917299/3-brothers-drown-as-car-plunges-into-river-in-gb",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T08:47:25.000Z"
}
