{
  "title": "G7 leaders meet in Canada hoping to avoid Trump clash - World - DAWN.COM",
  "author": null,
  "content": "Group of Seven (G7) leaders will gather in the Canadian Rockies starting on Sunday amid growing splits with the United States over foreign policy and trade, with host Canada striving to avoid clashes with US President Donald Trump.\n\nWhile Canadian Prime Minister Mark Carney says his priorities are strengthening peace and security, building critical mineral supply chains and creating jobs, issues such as US tariffs and the conflicts in the Middle East and Ukraine are expected to feature heavily.\n\nUS ally Israel launched a barrage of strikes across Iran on Thursday, a blow to Trump’s diplomatic efforts to prevent such an attack.\n\nThe summit will take place in the mountain resort of Kananaskis, some 90 kilometres west of Calgary.\n\nThe last time Canada played host, in 2018, Trump left the summit before denouncing then Canadian Prime Minister Justin Trudeau as “very dishonest and weak” and instructing the US delegation to withdraw its approval of the final communique.\n\n“This will be a successful meeting if Donald Trump doesn’t have an eruption that disrupts the entire gathering. Anything above and beyond that is gravy,” said University of Ottawa international affairs professor Roland Paris, who was foreign policy adviser to Trudeau.\n\nTrump has often mused about annexing Canada and arrives at a time when Carney is threatening reprisals if Washington does not lift tariffs on steel and aluminum.\n\n“The best-case scenario … is that there’s no real blow-ups coming out of the back end,” said Josh Lipsky, the chair of international economics at the Atlantic Council think tank and a former White House and State Department official.\n\nCarney’s office declined to comment on how the Israeli strikes would affect the summit.\n\nDiplomats said Canada has ditched the idea of a traditional comprehensive joint communique and would issue chair summaries instead, in hopes of containing a disaster and maintaining engagement with the US.\n\nA senior Canadian official told reporters Ottawa wanted to focus on actions the seven members — Canada, France, Germany, Italy, Japan, the United Kingdom and the United States — could take together.\n\nCanadian Senator Peter Boehm, a veteran former diplomat who acted as Trudeau’s personal representative to the 2018 summit, said he had been told the summit would last longer than usual to give time for bilateral meetings with the US president.\n\nExpected guests for parts of the Sunday to Tuesday event include leaders from Ukraine, Mexico, India, Australia, South Africa, South Korea and Brazil, who all have reasons to want to talk to Trump.\n\n“Many will want to talk to President Trump about their own particular interests and concerns,” Boehm said by phone.\n\nA senior US official said on Friday working discussions would cover trade and the global economy, critical minerals, migrant and drug smuggling, wildfires, international security, artificial intelligence and energy security.\n\n“The president is eager to pursue his goals in all of these areas including making Americas trade relationships fair and reciprocal,” the official said.\n\nThe visit of Ukrainian President Volodymyr Zelensky to the Oval Office in February descended into acrimony and has served as a warning for other world leaders about the delicate dance they face in negotiating with Trump.\n\nBut diplomats say the frustration of dealing with the Trump administration has made some keener to assert themselves.\n\nCanada has long been one of Ukraine’s most vocal supporters. Trump came to power promising to end the war with Russia within 24 hours but diplomatic efforts to end the conflict have stalled.\n\nOne Ukrainian official involved in preparations for the summit said hope had faded for a strong statement in support of Ukraine. Instead, success for Kyiv would merely constitute an amicable meeting between Trump and Zelensky.\n\nA European official said the G7 summit and the Nato summit in The Hague later in June provided an opportunity to underscore to Trump the need to press ahead with a sanctions bill put together by US senators alongside a new European package to pressure Russia into a ceasefire and broader talks.\n\nTrump’s first international summit will offer some early clues on whether Trump is interested in working with allies to solve common problems, said Max Bergmann, a director at the Centre for Strategic and International Studies.\n\n“The big overarching question here is, basically, is the United States still committed to formats like the G7? That is going to be the big test,” Bergmann said.\n\nFrench President Emmanuel Macron has said he has a good, but frank relationship with Trump despite differences on subjects such as Ukraine or climate change.\n\nMacron said on Friday that a United Nations conference co-hosted between France and Saudi Arabia scheduled after the G7 to work towards a two-state solution between Israel and the Palestinians has been postponed.\n\nModi arrived in Cyprus on Sunday in a visit focused on the potential role the island could play in linking India to Europe via a trade corridor, officials said.\n\nThe Indian PM, who was on his way to the G7 summit in Canada, and Cypriot President Nikos Christodoulides were scheduled to address business leaders on Sunday and hold formal talks on Monday.\n\nIndia is pursuing the so-called India-Middle East-Europe Corridor (IMEC) trade link by sea and rail, but the visit is being held in the shadow of a rapidly escalating crisis in the Middle East.\n\n“One of the objectives of our discussions is the connection of India with Europe through the region of the wider Middle East, (and) its entry into Europe through the Republic of Cyprus,” Christodoulides told journalists earlier on Sunday.\n\nThe two-day visit is part of a broader diplomatic outreach to European nations. Cyprus assumes the rotating EU presidency for six months in early 2026. The two countries have close relations through their shared membership of the Commonwealth.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/15181712086e1c8.jpg",
  "retrievedAt": "2025-08-20T03:57:51.029Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917316/g7-leaders-meet-in-canada-hoping-to-avoid-trump-clash",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T13:25:31.000Z"
}
