{
  "title": "PMD says chances of rain, thunderstorm in Karachi tomorrow - Pakistan - DAWN.COM",
  "author": null,
  "content": "Karachi is expected to receive rain on Monday, accompanied by a dust thunderstorm, according to the Pakistan Meteorological Department (PMD).\n\nThe PMD has predicted that a “westerly wave is affecting upper parts of the country & moist currents also penetrating in eastern parts of the province”.\n\nCloudy weather with temperatures ranging from 36–38 degrees Celsius is expected to persist throughout the metropolis tomorrow. Humidity levels are expected to touch 70-80 per cent in the morning.\n\n“Dust-thunderstorm /rain likely in Karachi division on tomorrow & isolated places at outskirts of Karachi division on Tuesday,” the weather advisory read.\n\nUnder the influence of this system, the following parts of Sindh are expected to receive rain accompanied by dust thunderstorm at isolated places today: Ghotki, Sukkur, Jacobabad, Qamber Shahdadkot, Shikarpur, Khairpur, Dadu, Nosheroferoz, Shaheed Benazirabad, Tharparker, Umerkot, Mirpurkhas, Sanghar, T.M.Khan, T.A.Yar, Hyderabad, Mitiari, Thatta, Sujawal, Badin and Jamshoro districts.\n\nThe forecast predicts light to moderate rainfall accompanied by dust thunderstorms on 16th-17th June.\n\nEvery year, Karachi gets flooded by rains, causing widespread disruption to public life and their safety. Last year in August, Mayor Karachi declared a state of emergency ahead of the downpour to tackle management efforts. The five-day rain spell left a trail of destruction in its wake, washing away roads and crippling civic life.\n\nLast month, at least 13 civilians died and 92 others were injured as heavy rains lashed several parts of Punjab.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:53.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917303/pmd-says-chances-of-rain-thunderstorm-in-karachi-tomorrow",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T09:19:12.000Z"
}
