{
  "title": "Police file FIR over rape of disabled 14-year-old girl in Punjab’s Hafizabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "Police have registered a first information report (FIR) in the case of a 14-year-old girl with mental and physical disabilities being allegedly sexually assaulted in Punjab’s Hafizabad district.\n\nSahil’s Six Months Cruel Numbers data reveals that a total of 1,630 cases of child abuse were reported from across the country last year.\n\nIn the first six months of 2024, 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages were reported. 48 cases of pornography after sexual abuse were also recorded.\n\nThe victim was brought to the hospital due to her health condition, where, during a medical check-up, it was discovered that she was six months pregnant.\n\nAn application for action was filed by the victim’s family on Saturday at the City Hafizabad Police Station, on which case number 1152/25 was formally registered on Sunday under Section 376 (3) (Whoever commits rape of a minor or a person with mental or physical disability, shall be punished with death or imprisonment for life and fine) of the Pakistan Penal Code.\n\nRana Sultan Mahmood has been named as the plaintiff in the FIR.\n\nThe victim is a child with congenital disabilities, unable to speak, hear or walk, and is also mentally immature and unconscious. Her parents stated in the FIR that they belonged to a poor and illiterate family and were unable to learn about the incident due to their daughter’s physical condition.\n\nInvestigation into the incident revealed that the suspect allegedly found the girl alone in the Hussainabad neighbourhood six months ago and sexually assaulted her. After the incident, he went into hiding.\n\nHafizabad District Police Officer (DPO) Atif Nazir Kadhar has taken immediate notice of the incident and ordered the DSP City Circle to submit a report. The DPO has also issued instructions for the immediate arrest of the suspect.\n\nAccording to police officials, the accused will be arrested within the next 48 hours, while the victim’s family is being provided with full protection.\n\nIn May, police said they had arrested four suspects involved in an alleged gang rape of a mentally-challenged minor in Lahore earlier this month.\n\nAlso last month, A madrassah teacher in Muzaffargarh district of Punjab was arrested for allegedly raping an 11-year-old student at a seminary.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:52.900Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917301/police-file-fir-over-rape-of-disabled-14-year-old-girl-in-punjabs-hafizabad",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T09:20:42.000Z"
}
