{
  "title": "CDWP clears 10 development projects worth Rs36bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Central Development Working Party (CDWP) has approved nine development projects totalling Rs25.19 billion and recommended another project worth Rs10.671bn to the Executive Committee of the National Economic Council (Ecnec) for approval.\n\nThe CDWP meeting, chair­­ed by Planning Minister Ahsan Iqbal, held on Saturday, reviewed 10 projects with a total cost of Rs35.86bn.\n\nAn official announcement stated that the focus of development projects was on key sectors, including food and agriculture, higher education, information technology, power, and transport and communications.\n\nThe CDWP approved Rs990 million for a project on a speed breeding platform for the development of climate-smart hybrid crops.\n\nThe minister directed that all stakeholders, including the private sector, should be engaged in setting research and seed development agenda. “We need to develop high weather resistant and productivity seeds using hybrid technology”, he said.\n\nThe forum approved a project in the higher education sector worth Rs3.538bn for setting up the Dr A.Q. Khan Institute of Materials and Emerging Sciences. The institute will be established at Quaid-e-Azam University and will provide state-of-the-art education and research facilities in material and emerging sciences. University of Cambridge, UK agreed to give technical assistance to the institute.\n\nThe CDWP approved an amount of Rs3.047bn for the digitalisation of In-House Processes and Automation of the Examination System of the Federal Public Service Commission (FPSC).\n\nThe project will enhance the overall governance paradigm of the federal government through a speedy recruitment process, providing quality human resources to federal ministries, divisions, and departments in the shortest possible time with ease and transparency.\n\nThe forum was further apprised that digital transformation directly supports FPSC’s mission by leveraging technology to modernise and enhance the recruitment process, making it more transparent, efficient, and merit-based.\n\nThe CDWP approved an amount of Rs3.385bn for science and technology projects, namely NILOP-PIEAS Emerging Technologies Centre. The minister said it is vital that we develop strong technological capabilities for meeting the challenges of the new digital and industrial revolutions, 4.0 and 5.0.\n\nThe forum recommended a 16MW Hydropower Project, Nalter-III Gilgit, involving a cost of Rs10.671bn to ECNEC for approval. This project will help in addressing energy shortages in GB. The scope of work includes the construction of a 54-meter-long connecting canal linking the weir to a single-chamber sedimentation basin, which is 84 meters long, 6 meters wide, and 5 meters deep, designed to remove sediment particles larger than 0.2 mm. A gravel trap is provided at the end of the canal.\n\nThe CDWP has approved four transport and communications projects aimed at infrastructure development.\n\nThe sanctioned projects include the widening and carpeting of the 28-kilometre Booni Buzund Torkhow Road in Upper Chitral, costing Rs1.894bn; the construction of a 15.5-kilometre blacktop Northern Bypass Road in Loralai, valued at Rs3.828bn; the extension of Margalla Highway from G.T. Road (N-5) to Motorway (M-1) within Punjab limits, spanning 2.5 kilometres for Rs7.106bn; and a feasibility study for the Trans-Afghan Rail connectivity from Kharlachi (Pakistan) to Mazar-e-Sharif (Afghan­istan) via Logar, covering approximately 677 kilometres, with an estimated cost of Rs1.401bn.\n\nThe forum also cleared the concept paper related to the Ministry of Federal Education and Professional Training titled “Action to Strengthen Performance for Inclusive and Responsive Education”, funded by the World Bank.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/15101700f05e745.jpg",
  "retrievedAt": "2025-10-12T03:35:48.745Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917241/cdwp-clears-10-development-projects-worth-rs36bn",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:03:52.000Z"
}
