{
  "title": "Markram leads South Africa to ‘special’ World Test Championship victory - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Aiden Markram’s magnificent century was the cornerstone of South Africa’s five-wicket victory over Australia in the World Test Championship final at Lord’s on Saturday as the Proteas ended decades of cricket heartbreak by at last winning a major global title.\n\nSouth Africa successfully chased down an imposing 282-run target before lunch on the fourth day, with opening batsman Markram falling for 136 after taking South Africa to within six runs of the title.\n\nIt was an edgy finish, however, as they took 27.4 overs to slowly score the 69 runs needed to secure success on the fourth day with Australia typically fighting all the way to the inevitable end.\n\nIn so doing, South Africa completed a successful pursuit of the joint second-highest winning fourth-innings total in Test history at the London venue, behind the West Indies’ 344-1 against England in 1984.\n\n“It’s special in a lot of ways,” said Proteas captain Temba Bavuma in front of what was effectively a ‘home’ crowd given the large number of South Africa fans who had packed into Lord’s.\n\n“Also, it’s a chance for South Africa to be united,” said Bavuma, who has now joined Springboks Rugby World Cup-winning captain Siya Kolisi in becoming a black African skipper of a South Africa side that has won a major global title.\n\nWe’ve got a cause where we can put aside our differences and enjoy. We just have to embrace it. It’s a special moment for us and people back home, probably it will sink in in a couple of days. We’ve been etched in history, we’re part of something that has never been done.“\n\nThe Proteas resumed on 213-2 with Markram, dismissed for a duck in the first innings, 102 not out and Bavuma unbeaten on 65 despite spending most of his innings limping with a hamstring injury.\n\nBut South Africa have such a long history of folding under pressure they could not take anything for granted against serial winners and defending WTC title-holders Australia.\n\nIn 18 previous attempts in the One-day International and T20 World Cups, South Africa had only reached a solitary final.\n\nThat was in last year’s T20 World Cup in Barbados, when they lost to India despite needing just 30 runs from their last 30 balls, with six wickets standing.\n\nCHOKERS NO MORE\n\nBut South Africa, so often labelled “chokers” for their failure to close out knockout games, held their nerve on Saturday as a largely unheralded side succeeded where star players such as Allan Donald, Shaun Pollock, AB de Villiers and Jacques Kallis had failed.\n\nVictory laid to rest ghosts of heartbreaking losses on big ICC stages that have haunted South Africa for decades. The venues and dates are infamous in South Africa cricket, among them Birmingham 1999, Dhaka 2011, Auckland 2015, Kolkata 2023 and Bridgetown 2024.\n\nBut London 2025 will go down as one of the greatest days in South Africa sports, when its cricket underdogs grabbed the advantage and didn’t let go against a red-hot Australia.\n\nThe stunning result also bodes well for South Africa’s preparations for its home ODI World Cup in 2027. It’s a different format, but the Proteas’ mindsets won’t be burdened by not having won a global trophy since the Champions Trophy’s precursor in 1998.\n\nSouth Africa were criticised by some before the final for its supposedly easier road in the 2023-25 WTC cycle — they didn’t face Australia or England in a series — but they have won eight straight Tests,their second longest streak in history.\n\n“I hope our performance gives credit as to why we were in the final,” said Bavuma. “We prepared hard, we came in with a lot of belief but with a lot of doubters\n\n“Whilst we were batting, we could hear the Aussies using that dreaded word ‘choke’. The energy was there, I think us as a team have been wanting this. We’ve been relentless, getting to the doorstep consistently and experienced heartache, the sun’s been with us. Hopefully, this win is one of many.”\n\nThe celebrations spread across the Lord’s turf as each of the players took their turn with the silver and gold mace.\n\n“Growing up, Lord’s was the one venue I wanted to play at,” said Markram, who was named player-of-the-match. “To do it at a final and win is something really special.\n\n“It is emotional, it’s been a very long time coming, We’ve got close in the past couple of years and not got over the line. The first one is always going to be the toughest.”\n\n‘BRIDGE TOO FAR’\n\nAustralia led by 74 runs on first innings but never got completely away from South Africa, with Proteas fast bowler Kagiso Rabada returning superb match figures of 9-110.\n\n“Unfortunately, it was a bridge too far,” said Australia captain Pat Cummins, who led Australia to the 2023 WTC title after New Zealand won the inaugural 2021 final.\n\n“We didn’t bat out the opposition after a decent first-innings lead. They [South Africa] were fantastic in that fourth innings. There wasn’t a lot in the wicket but they didn’t give us a chance.”\n\nSouth Africa started the fourth day favourites to win but nervy, given a litany of past disasters, and would have been further on edge when Bavuma was out in the third over of the morning.\n\nA rising delivery from Cummins took an edge and saw Bavuma depart, having added only one run to his overnight score.\n\nBut Markram got the target down to 50 by pulling Cummins for four before left-arm quick Mitchell Starc (3-66) bowled Tristan Stubbs for eight with 41 runs still needed.\n\nMarkram and David Bedingham, who scored an unbeaten 21, then diligently put together a 35-run partnership to see them to the brink of success.\n\nAustralia took the new ball with South Africa needing just 14 more runs to win and Markram subsequently drove Josh Hazlewood for four and three to settle any nerves.\n\nHe couldn’t quite finish the job, though. His pull off Hazlewood was brilliantly caught by Travis Head at midwicket to end a 207-ball innings featuring 14 fours.\n\nAs Markram received a standing ovation on his way back to the pavilion, several Australia players shook his hand.\n\nAbout 15 minutes later, Kyle Verreynne hit the winning run, a drive into the covers.\n\nSCOREBOARD\n\nAUSTRALIA (1st Innings) 212 (B Webster 72, S Smith 66; K Rabada 5-51, M Jansen 3-49)\n\nSOUTH AFRICA (1st Innings) 138 (D. Bedingham 45; P. Cummins 6-28)\n\nAUSTRALIA (2nd Innings) 207 (M. Starc 58 no; K. Rabada 4-59, L. Ngidi 3-38)\n\nSOUTH AFRICA (2nd Innings; overnight 213-2):\n\nA. Markram c Head b Hazlewood 136\n\nR. Rickelton c Carey b Starc 6\n\nW. Mulder c Labuschagne b Starc 27\n\nT. Bavuma c Carey b Cummins 66\n\nT. Stubbs b Starc 8\n\nD. Bedingham not out 21\n\nK. Verreynne not out 4\n\nEXTRAS (B-8, LB-4, NB-2) 14\n\nTOTAL (for five wickets, 83.4 overs) 282\n\nDID NOT BAT: M. Jansen, K. Maharaj, K. Rabada, L. Ngidi\n\nFALL OF WICKETS: 1-9 (Rickelton), 2-70 (Mulder), 3-217 (Bavuma), 4-241 (Stubbs), 5-276 (Markram).\n\nBOWLING: Starc 14.4-1-66-3; Hazlewood 19-2-58-1; Cummins 17-0-59-1 (1nb); Lyon 26-4-66-0; Webster 5-0-13-0 (1nb); Head 2-0-8-0.\n\nRESULT: South Africa won by five wickets.\n\nPLAYER-OF-THE-MATCH: Aiden Markram (South Africa).\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684e1595952a8.gif",
  "retrievedAt": "2025-08-20T03:58:09.885Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917225/markram-leads-south-africa-to-special-world-test-championship-victory",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:03:59.000Z"
}
