{
  "title": "US officials survey Air India crash site, families continue to wait for bodies - World - DAWN.COM",
  "author": null,
  "content": "Officials from the US National Transportation Safety Board (NTSB) surveyed the site of Air India plane crash that killed at least 271 people, sources said on Sunday, with families continuing to wait for DNA profiling results to identify charred bodies.\n\nAlong with the NTSB, officials from the US Federal Aviation Administration (FAA) were in Ahmedabad in western India’s Gujarat state surveying the crash site, said one source with direct knowledge.\n\nThe Boeing 787-8 Dreamliner with 242 people on board bound for Gatwick Airport south of London began losing height seconds after take-off in Ahmedabad on Thursday, and erupted in a huge fireball as it hit buildings below.\n\nAll but one on board were declared dead in the world’s worst aviation disaster in a decade. Around 30 people died on the ground.\n\nAir India and the Indian government were looking at several aspects of the crash including issues linked to its engine thrust, flaps, and why the landing gear remained open as the plane took off and then came down.\n\nThe secretary of the US Department of Transport, Sean Duffy, said on Friday he was in the process of deploying a team from the FAA and the NTSB to India. Boeing and GE, whose engines were used in the plane, were also sending teams.\n\n“We’ll take action should any recommendations come forward from the NTSBs investigation,” Duffy said.\n\nThe FAA and NSTB did not immediately respond to Reuters queries outside regular business hours.\n\nThe FAA has said India will lead the investigation, but the NTSB is the official US representative for providing assistance, while the FAA provides technical support.\n\nBoeing officials will also look at various parameters in their inspections, including the angle of landing, as they investigate the matter, said the first source.\n\nIn all, around 10 officials were present at the site on Sunday, including from the NTSB, said the second source.\n\nIndia’s aviation regulator has ordered all Boeing 787s being operated by local carriers to be inspected.\n\nThe crash brings a fresh challenge for both Air India which has for years being trying to revamp its fleet, and Boeing, which is trying to rebuild public trust following a series of safety and production crises.\n\nIn Ahmedabad, doctors were struggling to identify bodies that were charred in the incident, resorting to dental samples and DNA profiling.\n\nDNA samples of 32 victims from the crash have been successfully matched, Rajnish Patel, additional superintendent at the city’s main hospital, said on Sunday.\n\n“The bodies for which DNA samples have been matched are being handed over to the families with due respect,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/1515215788dad71.jpg",
  "retrievedAt": "2025-08-20T03:57:52.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917309/us-officials-survey-air-india-crash-site-families-continue-to-wait-for-bodies",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T10:31:04.000Z"
}
