{
  "title": "Faisalabad couple killed for ‘honour’ in Mardan - Pakistan - DAWN.COM",
  "author": null,
  "content": "A couple from Faisalabad was killed in a suspected “honour” killing in Khyber Pakhtunkhwa’s Maulana Kaly Fatma area of Mardan district on Saturday, police officials said.\n\nAccording to the first information report (FIR) filed by the slain man’s brother, Mazhar Iqbal, 51-year-old Zafar Iqbal had returned from Faisalabad to Mardan after many years. Zafar was accompanied by his wife, Farzana alias Gul Bibi, aged 40.\n\nMazhar stated that the couple was at his house when the suspects forcibly entered and opened indiscriminate fire on his brother and sister-in-law, killing them on the spot. He added that he, along with his wife and children, narrowly escaped the attack.\n\nHe nominated suspects Sarbuland, Munir Khan, Asad Shah, and Imran — all residents of Jehangira — along with Wajid and Muhammad Hussain from Babenai.\n\nThe complainant urged the police to register a case against them for trespassing, attacking his family, causing bodily damage, and murdering his brother and sister-in-law, the FIR said.\n\nMuhammad Faheem, spokesperson for the Mardan district police officer, told Dawn.com that the couple had married of their own free will about 17 years ago. He said the man had returned to his brother’s home in Mardan after several years from Faisalabad.\n\nFaheem claimed that the woman’s family allegedly carried out the attack and fled the scene. However, efforts are underway to arrest the suspects, he added.\n\nHe said the bodies of the deceased were taken to the Type D Hospital in Katlang, Mardan, where Zafar’s brother recorded his statement with a team from the Jabr police station.\n\nThe FIR is lodged under the following sections of the Pakistan Penal Code; 302 (punishment of premeditated murder), 311 (punishment for premeditated murder after the right of qisas (retribution) has been waived), 324 (attempt to commit murder), 148 (rioting, armed with deadly weapon), 149 (every member of unlawful assembly guilty of offence committed), and 449 (house trespass in order to commit offence punishable with death).\n\n‘Honour’ killings refer to the murder of individuals, predominantly women and girls, by family members who believe the victim has brought dishonour upon the family.\n\nIn Pakistan, ‘honour’ killings continued to claim the lives of women throughout 2024, perpetuated by deeply ingrained societal beliefs about family dignity and shame.\n\nData from the Human Rights Commission of Pakistan (HRCP) shows that in 2024, ‘honour’ killings continued to be a serious issue across Pakistan, with particularly high figures in Sindh and Punjab.\n\nFrom January to November, a total of 346 people fell victim to ‘honour’ crimes in the country. The previous two years also saw a consistent rise in murders related to the so-called ‘honour’.\n\nIn 2023, the country saw a total of 490 ‘honour’ killing incidents taking place, while in 2022, as many as 590 people lost their lives to ‘honour’ killings.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:51.218Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917319/faisalabad-couple-killed-for-honour-in-mardan",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T15:09:17.000Z"
}
