{
  "title": "NCSW questions accuracy of Global Gender Gap report on Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Commission on the Status of Women on Saturday expressed strong concerns over Pakistan’s ranking in the Global Gender Gap Report 2025 by the World Economic Forum.\n\nA statement issued here said that NCSW Chairperson Ume Laila Azhar had questioned the report’s methodology, citing issues with data representation and visibility. She said the data was present but not visible, and the report’s findings did not accurately reflect the country’s progress on gender parity.\n\nThe commission has taken serious note of the report’s methodology, which relied on perception surveys with limited sample sizes, predominantly filled out by men rather than women themselves.\n\nNCSW believed that this approach had led to a skewed perspective and undermined the true progress made by Pakistan on gender equality.\n\nNotably, the report’s inaccuracies were evident in the “Women in Ministerial Positions” indicator, where Pakistan was given a 0 score despite having a female minister at the federal level, a female chief minister and female ministers in the provincial cabinets of Punjab, Sindh and Balochistan.\n\nThe statement said that NCSW had decided to collaborate with relevant authorities to collect and disseminate accurate data, ensuring a precise representation of women’s status in Pakistan.\n\nThe commission will enhance activities for updated data on the National Gender Data Portal to provide a true reflection of gender parity in the country. Furthermore, NCSW will conclude a Letter of Intent (LOI) with Mishaal Pakistan, which will facilitate the development of a comprehensive National Gender Gap Report 2026 featuring a standard format and baseline dataset from its already functional National Gender Data Portal as a regular feature.\n\nNCSW demanded that the relevant ministries and authorities take immediate action to address the issues with data collection and dissemination.\n\nThe NCSW chairperson in her meeting with the CEO Mishaal, Amir Jahangir, emphasised the need for accurate and comprehensive data to form policy decisions and track progress on gender equality.\n\nNCSW said it remained committed to promoting gender equality and empowering women in Pakistan and will work tirelessly to ensure that the country’s progress was accurately represented.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:35:54.595Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917179/ncsw-questions-accuracy-of-global-gender-gap-report-on-pakistan",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:04:21.000Z"
}
