{
  "title": "‘Indus River remains colonised’: Activists call out extractive state policies - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Indus River remains colonised, declared activists, lawyers, and civil society members at a climate justice conference in Karachi on Sunday, calling for resistance against extractive policies and the erasure of indigenous knowledge.\n\nArranged by the Climate Action Centre, ‘The Indus Resistance Conference’, held for the first time, is a forum aiming to amplify the voices of “frontline defenders” against the exploitation of natural resources.\n\nThe first of its kind, the conference brought together women, the working class, lawyers, students and journalists committed to the cause of climate justice. Pakistan was ranked as the most vulnerable country to climate change in 2022.\n\n“The Indus River is on its deathbed,” said Yasir Darya, founder of the Climate Action Centre (CAC), as he initiated the one-day conference, addressing resource theft and climate injustice in Sindh.\n\nHe called for granting the river “personhood status” to ensure its preservation against what he termed “colonial policies, water theft, and capitalist interests”.\n\nAdvocate Abira Ashfaq of CAC’s Green Chamber, speaking to Dawn.com, explained what the status of personhood for the Indus River would mean: “If we can have people look at the rights of the river, perhaps that could be a roundabout way to get them to look at other ecological damage that is happening.”\n\nShe added, “If a corporation can have legal standing, then why can’t a body of nature?\n\n“It would also be a way to bring in other ecological conversations into the fold — about poverty, about canals on the Indus, about villages, rural rights, the rights of women farmers,” Ashfaq said.\n\n“We talk about how indigenous people have knowledge, which we often take as wisdom — but it is knowledge that is never taken into account.”\n\nCalling out the state’s “hypocrisy” on water resources in Sindh, former Sindh High Court Bar Association (SHCBA) vice president Zubair Abro criticised the contrast between Pakistan’s domestic policies and its international stance.\n\n“Pakistan justifies water allocation on the basis that it is a lower riparian country, but in the same breath, it denies that right to lower riparian areas within the country,” he said while speaking at a panel discussion at the event.\n\nHe also noted that the existing water distribution treaties — the Indus Water Treaty and the 1991 Water Apportionment Accord — do not include any provisions for climate or environmental preservation. Abro called for a revision of the agreements.\n\nChallenging what she described as “imperialist extractive policies” enacted by the state on the river, Advocate Romisa Jami said that the Indus River has been made into a commodity.\n\n“It was never meant to be a commodity,” she added.\n\nShe urged the audience to view the issue through the lens of “decolonisation”. While the Indus River is an entire ecosystem for the people of Sindh, “to colonial masters, it offers an opportunity for extraction”, said Jami.\n\nShe attributed the loss of sustainable agricultural practices to the “building of irrigation projects by the British Empire”. Jami emphasised that people have come to “inherit our colonial past, which has always been profit-driven and never human-centric”. She recommended an overhaul of the existing system as the only way forward.\n\nSpeakers also raised alarm over recent canal construction and agricultural initiatives introduced under the Green Pakistan Initiative (GPI), which sparked protests across Sindh, particularly in Baberloi, where demonstrations continued for days until the canal project was shelved.\n\nAdvocate Kazim Mahesar, activist Amar Haseeb Panhwar and Advocate Riaz Sabzoi — who were involved in the protests — spoke during a panel discussion on resource theft, warning that such initiatives are “just a guise for land theft”.\n\n“We are told to go to court against these decisions, but with the 26th Amendment in place, the doors of justice have been closed for us,” said Panhwar.\n\nMahesar alleged that “Sindh’s land has been stolen”. He added, “It’s not that we are against development — we only stand against destruction.”\n\nHe further argued that such development projects “are only for the elite”, adding that “there is nothing in it for the common man.”\n\nHistorian Hafeez Baloch, also speaking on the panel, recalled that Malir — where he was born and raised — was among the first victims of land grabbing in Sindh.\n\n“Malir was an agricultural land, but it was stolen and handed over to capitalists,” he said.\n\nHe also referred to the late scholar Gul Hassan Kalmati, who had warned that “what is happening in Malir will eventually happen to the rest of Sindh as well”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:50.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917322/indus-river-remains-colonised-activists-call-out-extractive-state-policies",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T16:46:09.000Z"
}
