{
  "title": "What Israel’s attacks on Iran’s oil, gas facilities could mean for the global industry - World - DAWN.COM",
  "author": null,
  "content": "As Israel set Iran’s oil and gas sites ablaze for the first time on Saturday night, triggering another exchange of strikes between the two countries, experts detailed how it could impact the global petroleum industry.\n\nThe recent military exchange began on Friday when Israel launched an air offensive against Iran, killing commanders and scientists and bombing nuclear sites in a stated bid to stop Tehran building an atomic weapon. Iran has consistently denied that, saying its uranium enrichment programme is for civilian purposes.\n\nAfter an Israeli strike caused a fire at the South Pars gas field, Iran partially suspended production there, Tasnim news agency said. The fire broke out in one of the four units of Phase 14 of South Pars, halting production of 12 million cubic metres of gas.\n\nAccording to Al Jazeera, the South Pars gas field accounts for nearly 20 per cent of known global reserves. It is located offshore in Iran’s southern Bushehr province and is responsible for the lion’s share of gas production in Iran — the world’s third-largest gas producer after the United States and Russia.\n\nIran shares the field with Qatar, which calls it the North Field. Qatar produces 77 million tonnes of liquefied gas from the field with the help of global majors such as Exxon and Shell, supplying the gas to Europe and Asia.\n\nWhile the fire at the field was extinguished, according to the Iranian oil ministry, concerns about its impact on the global oil industry remain.\n\nThe Hindustan Times noted there could be a potential disturbance in the global oil pricing as the attack heightened the risk to the oil infrastructure in Iran — third-biggest producer of the Organisation of the Petroleum Exporting Countries (Opec) — and to shipments from elsewhere in the region.\n\nJorge Leon, an analyst at Rystad Energy who previously worked at the Opec secretariat, termed it a “significant escalation” in a Bloomberg report.\n\n“This is probably the most important attack on oil and gas infrastructure since Abqaiq,” Leon said, referring to the 2019 strike that briefly crippled one of Saudi Arabia’s key oil-processing plants.\n\n“It’s going to be pretty significant,” Richard Bronze, head of geopolitics at consultant Energy Aspects Ltd, said about the attacks.\n\n“We appear to be in an escalatory cycle,” he observed, adding there would be “questions about whether Israel is going to target more Iranian energy infrastructure”.\n\nMeanwhile, Iran has also threatened to close off the Strait of Hormuz, a crucial point for global energy transportation.\n\nAn Iranian general, Esmail Kosari, said yesterday that Tehran was reviewing whether to close the Strait of Hormuz, controlling access to the Gulf for tankers.\n\nThe Strait is the exit route from the Middle East Gulf for around 20pc of the world’s oil supply, including Saudi, UAE, Kuwaiti, Iraqi and Iranian exports.\n\n“If Iran responds by disrupting oil flows through the Strait of Hormuz, targeting regional oil infrastructure, or striking US military assets, the market reaction could be much more severe, potentially pushing prices up by $20 per barrel or more,” said former Opec official Leon.\n\nJamal Abdi, the president of the National Iranian American Council, described the threat as “Iran’s trump card”.\n\n“The view is [that] this would sort of strangle the global economy, have massive economic impacts, and it’s a very small body of water, so the type of sabotage necessary to make that a choke point, Iran likely does have,” he told Al Jazeera.\n\nAfter Israel attacked Iran and Tehran pledged to retaliate on Friday, oil prices jumped as much as 13 per cent to their highest since January, even though Israel spared Iran’s oil and gas on the first day of its attacks.\n\nPart of the reason for the rapid spike was that spare capacity among Opec and allies to pump more oil to offset any disruption is roughly equivalent to Iran’s output, Reuters reported, citing analysts and Opec watchers.\n\nIran produces more than 3 million barrels per day (bpd) of crude oil.\n\nSaudi Arabia and the United Arab Emirates are the only Opec+ members capable of quickly boosting output and could pump around 3.5m bpd more, analysts and industry sources said.\n\n“Following the July hike, most Opec members, excluding Saudi Arabia, appear to be producing at or near maximum capacity,” J.P. Morgan said in a note.\n\nOutside of Saudi Arabia and the UAE, spare capacity was negligible, said a senior industry source who works with Opec+ producers.\n\n“Saudis are the only ones with real barrels, the rest is paper,” the source said. He asked not to be named due to the sensitivity of the matter.\n\nRussia, the second-largest producer inside Opec+, claims it can pump above 12m bpd.\n\nJ.P. Morgan estimates, however, that Moscow can only ramp up output by 250,000 bpd to 9.5m bpd over the next three months and will struggle to raise output further due to sanctions.\n\nIran produces around 275 billion cubic metres (bcm) of gas per year or some 6.5pc of global gas output. However, it consumes the produce domestically because of US sanctions on exports.\n\nYet despite the US-led sanctions, Iran has been able to increase crude exports since the first Trump administration imposed full US sanctions in May 2019.\n\nChina is the largest importer of Iranian oil, raising concerns of a possible impact on it if Israel further attacks Iran’s oil and gas industry.\n\nTeapot refiners are private Chinese refineries that are the primary purchasers of Iranian oil, with one being sanctioned by the US this year and another in 2022.\n\nIsrael also attacked the Shahran depot and the Fajr Jam Gas Refining Company, the Iranian petroleum ministry said, according to Al Jazeera.\n\nMajor fires broke out at two opposing ends of Tehran — the Shahran fuel and gas depot to the northwest, and one of Iran’s biggest oil refineries in Shahr Rey to the south, the report added.\n\nWhile Iran’s Student News Network denied that the Shahr Rey refinery had been struck by Israel, and claimed it was still operating, it said that a fuel tank outside the refinery had caught fire.\n\nWith nearly 260m litres of storage capacity across 11 tanks, the Shahran oil depot is one of Tehran’s largest fuel storage and distribution hubs, Al Jazeera noted.\n\nIt termed it a “vital node” in Tehran’s urban fuel grid, distributing petrol, diesel and aviation fuel to several terminals in the capital.\n\nThe report quoted experts as warning that any disruption to the state-owned Tehran Oil Refinery could strain fuel logistics in Iran’s most populous and economically significant region.\n\nHeader image: A plume of heavy smoke and fire rises over an oil refinery in southern Tehran, after it was hit in an overnight Israeli strike, on June 15. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/15170926368094e.jpg",
  "retrievedAt": "2025-08-20T03:57:50.352Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917315/what-israels-attacks-on-irans-oil-gas-facilities-could-mean-for-the-global-industry",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T12:45:12.000Z"
}
