{
  "title": "Trump administration weighs adding 36 countries to travel ban, memo says - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s administration is considering significantly expanding its travel ban by potentially banning citizens of 36 additional countries from entering the United States, according to an internal State Department cable seen by Reuters.\n\nEarlier this month, the Republican president signed a proclamation that banned the entry of citizens from 12 countries, saying the move was needed to protect the United States against “foreign terrorists” and other national security threats.\n\nThe directive was part of an immigration crackdown Trump launched this year at the start of his second term, which has included the deportation to El Salvador of hundreds of Venezuelans suspected of being gang members, as well as efforts to deny enrollments of some foreign students from US universities and deport others.\n\nIn an internal diplomatic cable signed by US Secretary of State Marco Rubio, the State Department outlined a dozen concerns about the countries in question and sought corrective action.\n\n“The Department has identified 36 countries of concern that might be recommended for full or partial suspension of entry if they do not meet established benchmarks and requirements within 60 days,” the cable sent out over the weekend said.\n\nThe cable was first reported by The Washington Post.\n\nAmong the concerns the State Department raised was the lack of a competent or cooperative government by some of the countries mentioned to produce reliable identity documents, the cable said. Another was “questionable security” of that country’s passport.\n\nSome countries, the cable said, were not cooperative in facilitating the removal of its nationals from the United States who were ordered to be removed. Some countries were overstaying the US visas their citizens were being granted.\n\nOther reasons for concern were the nationals of the country were involved in acts of terrorism in the United States, or anti-Semitic and anti-American activity. The cable noted that not all of these concerns pertained to every country listed.\n\nThe countries that could face a full or a partial ban if they do not address these concerns within the next 60 days are: Angola, Antigua and Barbuda, Benin, Bhutan, Burkina Faso, Cabo Verde, Cambodia, Cameroon, Cote D’Ivoire, Democratic Republic of Congo, Djibouti, Dominica, Ethiopia, Egypt, Gabon, The Gambia, Ghana, Kyrgyzstan, Liberia, Malawi, Mauritania, Niger, Nigeria, Saint Kitts and Nevis, Saint Lucia, Sao Tome and Principe, Senegal, South Sudan, Syria, Tanzania, Tonga, Tuvalu, Uganda, Vanuatu, Zambia, and Zimbabwe.\n\nThat would be a significant expansion of the ban that came into effect earlier this month. The countries affected were Afghanistan, Myanmar, Chad, Congo Republic, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\nThe entry of people from seven other countries — Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela — has also been partially restricted.\n\nDuring his first term in office, Trump announced a ban on travelers from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/15193804644426f.jpg",
  "retrievedAt": "2025-08-20T03:57:51.321Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917320/trump-administration-weighs-adding-36-countries-to-travel-ban-memo-says",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T14:41:23.000Z"
}
