{
  "title": "In a first, Centre okays full disbursement of uplift funds for tribal districts - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Adviser to the Khyber Pakhtunkhwa chief minister on finance Muzammil Aslam on Saturday said that for the first time, the federal government had authorised full release of the merged tribal districts’ development funds for a fiscal year.\n\nAddressing the post-budget briefing at the cabinet room of the Civil Secretariat here, Mr Aslam said that the federal government used to partly release funds for the merged areas annual development programme and Accelerated Implementation Programme.\n\nHe said that the KP government took up the issue during the meeting of the National Economic Council earlier this month, so the federal government committed to releasing the arrears of development funds for the merged districts.\n\n“Now, the federal government has authorised the release of the remaining amount, so the province will receive the full Rs70.4 billion development funds allocated for the merged tribal districts in the current fiscal, so this is happening for the first time,” he said.\n\nCM’s aide complains PSDP has little allocations for KP\n\nMr Aslam thanked the federal government for the move.\n\nRegarding the budget, Mr Aslam said that for the first time, the province had unveiled over Rs2 trillion budget, which included record development outlay of Rs547 billion.\n\nHe said that the federal development budget’s volume was less than Punjab and Sindh’s, and even, there were little allocations for KP in the Public Sector Development Programme.\n\nThe adviser said that KP also received Rs90 less than from the federal government due to a Rs1 trillion shortfall in the centre’s revenue target.\n\nHe said that against Rs42 billion AIP allocations, the federal government released just Rs6 billion, while KP bridged the gap by spending Rs20 billion from its own resources.\n\nMr Aslam said that Fata’s merger with KP won’t be complete without the financial merger with the province, so the region’s share should be made part of the province’s National Finance Commission share of the federal resources.\n\nHe said that making the merged areas part of NFC Award would reduce the federal government’s burden.\n\n“The federal government has allocated Rs66 billion for merged districts, while the province has to contribute an additional Rs47 billion from its own resources,” he said.\n\nThe adviser downplayed the impression regarding KP’s debt and said that the province was the first in the country to set up a debt management fund and had deposited Rs150 in it.\n\nThis move will generate Rs17 billion in interest alone, according to him.\n\nMr Aslam said that the federal PSDP’s volume totaled Rs1 trillion but in contrast, the volume of KP’s Annual Development Programme was Rs547 billion.\n\nHe criticised the federal government for “completely ignoring KP in PSDP,” saying out of a national development allocation of Rs1 trillion, only Rs550 million was earmarked for KP.\n\n“The federal government has two key responsibilities toward the province-PSDP funding and development allocations for the merged districts- but it has ignored both,” he said.\n\nResponding to criticism regarding provincial borrowing, the adviser said KP’s total debt stood at Rs709 billion, which was proportional to the size of its economy.\n\n“No new debt has been taken. What we received are disbursements of previously agreed loans. Future borrowing will be undertaken for mega projects only and will not be diverted elsewhere,” he said.\n\nOn the Sehat Card health insurance programme, Mr Aslam said that while the actual expenditure stood at Rs24 billion, Rs53 billion had been allocated in the new budget to ensure its smooth continuation.\n\nHe said that the total revenue target for the financial year 2025-26 was Rs2,119 billion, almost 21 per cent higher than the previous year’s.\n\n“Federal transfers are expected to be Rs1,506 billion, while the province has set a local revenue target of Rs129 billion,” he said.\n\nThe adviser said that the province had allocated a record Rs547 billion for development, which was 31 per cent more than the previous year’s.\n\n“Of this allocation, Rs39.6 billion is for the merged districts,” he said.\n\nRegarding consultations with detained PTI founder Imran Khan, Mr Aslam said without the former prime minister’s input, KP’s budget would “remain incomplete.”\n\n“It is vital to seek his guidance, as I was part of financial consultations during his [Imran’s] tenure at the Centre and continue to focus solely on the province’s financial well-being,” he noted.\n\nPublished in Dawn, June 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:57.974Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917222/in-a-first-centre-okays-full-disbursement-of-uplift-funds-for-tribal-districts",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T01:04:27.000Z"
}
