{
  "article_id": "2025-08-24_ed76332b3b84ed195efe388178c4bdd4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-more-power-theft-ami-meters-started-auto-power-theft-detecting-iesco-chief/",
    "retrieved_at": "2025-08-25T13:52:00.493Z"
  },
  "metadata": {
    "title": "No more power theft, AMI meters started auto power theft detecting; IESCO chief",
    "author": null,
    "date_published": "2025-08-24T13:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 24 (APP):The Chief Executive Officer (CEO) Islamabad Electric Supply Company (IESCO), Engineer Ch. Khalid Mahmood, has said that the introduction of Advanced Metering Infrastructure (AMI) meters was a revolutionary step in power sector of Pakistan having many advanced features and fight against electricity theft and in ensuring transparency was one of those. While giving a brief, Engineer Ch Khalid Mahmood said AMI meters are equipped with modern features that automatically detect and report theft attempts and meter disturbances to the AMI Operation Centre, said a press release issued here on Sunday. \"Recently, numerous power theft and meter accuracy disturbance cases automatically flagged by AMI system after which timely raids were conducted and power pilferers were apprehended by field formations after getting intimation by the AMI central control room. Power pilfers meters have been removed detection bill charged and for legal proceeding applications have given for FIR registration against culprits\". The IESCO chief said that the deployment of AMI meters was a breakthrough for IESCO. This technology not only curbs theft but also ensures billing transparency, strengthens consumer confidence and improves the efficiency of our distribution system, he said and added that if any one played with AMI meter or would disturb the meter accuracy using any mode now they can't hide this anti state activity and IESCO team would catch them immediately by using AMI advance technology The CEO also appreciated Chief Engineer Development, Ch. Kamran Aftab, Project Director AMI, Mohsin Raza Gillani, and the entire AMI team for their remarkable achievement of installing one million AMI meters in Rawalpindi City and Rawalpindi Cantt Circle. He said this milestone reflects the team's dedication and the organization's commitment to technology-driven reforms in the power sector. Engineer Khalid Mahmood reaffirmed the IESCO's commitment to expanding technology-based initiatives, adding that AMI meters would play a central role in reducing line losses, supporting the government's anti-theft campaign and providing consumers with a more reliable power supply.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}