{
  "article_id": "2025-08-24_f8d12c34461958be30cae8a41ed6a4b9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistani-tigers-roar-in-malaysia-bringing-home-four-medals-from-mbw-taekwondo-championship/",
    "retrieved_at": "2025-08-25T13:52:50.113Z"
  },
  "metadata": {
    "title": "Pakistani tigers roar in Malaysia, bringing home four medals from MBW Taekwondo Championship",
    "author": null,
    "date_published": "2025-08-24T06:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 24 (APP): Pakistan's three young athletes from Swat created history by winning four medals at the MBW International Taekwondo Championship 2025 in Malaysia, an event that drew over 4,200 athletes from 32 countries, raising the national flag high on the global stage. Ayesha Ayaz, celebrated as Pakistan's youngest taekwondo champion, displayed her extraordinary talent once again by clinching both a gold and a bronze medal. Known for her prodigious skill since childhood, Ayesha has long represented Pakistan internationally, inspiring young women across the country to pursue sports at the highest level. Her elder brother, Mohammad Zaryab Khan, added further glory to the family and the nation by winning a gold medal after a series of commanding performances. Meanwhile, their youngest sibling, Gulalai Ayaz, was named Best Fighter of the Tournament and secured a bronze medal, earning admiration for her courage and determination. This marks the first time in Pakistan's history that three siblings have collectively secured four medals at an international taekwondo event. Their victory has sparked celebrations in Swat and across the country, where people see their success as a beacon of pride and motivation for the younger generation. Speaking after her victory, Ayesha Ayaz said: \"I thank Almighty Allah for this success. I am deeply grateful to my father, who has been my greatest source of strength, and to all the supporters who always believed in me. I especially thank Hassan Nisar, CEO of Metrix Pakistan, for continuously encouraging me and supporting my journey.\" Sports analysts stressed that the siblings' achievement underscores the need for greater institutional support for martial arts and other underrepresented sports. With enhanced training facilities and international exposure, they said, Pakistan's athletes could emerge as formidable contenders on the world stage.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}