{
  "article_id": "2025-08-24_89f4f03fb57fa480a2beb025fd1be15c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-says-95-of-gt-road-encroachments-at-26-number-chungi-cleared/",
    "retrieved_at": "2025-08-25T13:51:36.436Z"
  },
  "metadata": {
    "title": "CDA says 95% of GT Road encroachments at 26 Number Chungi cleared",
    "author": null,
    "date_published": "2025-08-24T13:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 272,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 24 (APP): The Capital Development Authority (CDA) said Sunday that it had cleared 95 per cent encroachments at 26 Number Chungi on GT Road, a key entry point to Islamabad. The joint teams of CDA, district administration, and Islamabad Police demolished 578 structures across a 16-kilometer stretch from 26 Number Chungi to Taxila, reclaiming more than 95 percent of the encroached land, its spokesperson told APP. He said the authorities also arrested 113 individuals for resisting or obstructing the operation. The CDA drive, he said, had not been limited to GT Road. In T-Chowk to Rawat, authorities cleared six kilometers of roadway, demolishing 191 small and large structures. In Saidpur Model Village, CDA reclaimed more than 210 kanals of land out of 370 kanals previously under illegal occupation. The spokesperson noted that the CDA chief Randhawa stressed that Saidpur's restoration would both safeguard state property and enhance the village as a premier tourist destination. Similarly, along Lehtrar Road, 24 kilometres of road were cleared on both sides, while Tramri Chowk to Bank Stop and the adjoining Ali Pur stretch saw the removal of 227 illegal structures across three kilometers. To a query, he said all reclaimed areas would be fenced and utilized for tree plantation projects to both prevent re-encroachment and contribute to Islamabad's environment. \"These actions are not temporary. We are committed to keeping Islamabad free from illegal constructions,\" the spokesperson quoted Randhawa as saying. \"Reclaimed land will be protected and re-purposed for the benefit of citizens.\" The CDA spokesperson appealed to residents for cooperation in its anti-encroachment campaign, urging them to report any illegal construction or land occupation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}