{
  "article_id": "2025-08-24_d61ce96fdbc33ecc258e639ff914b271",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/flash-floods-claim-788-lives-injure-1018-damage-6630-homes-perish-5548-livestocks-since-june-26-ndma/",
    "retrieved_at": "2025-08-25T13:51:57.336Z"
  },
  "metadata": {
    "title": "Flash floods claim 788, lives, injure 1,018, damage 6,630 homes, perish 5,548 livestock’s Since June 26: NDMA",
    "author": null,
    "date_published": "2025-08-24T13:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 523,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 24 (APP):Torrential rains and flash floods have claimed 788 lives, injured 1,018 people, damaged 6,630 houses, and killed 5,548 livestock across Pakistan since June 26, according to the National Disaster Management Authority (NDMA). The authority continues to coordinate relief efforts amid ongoing weather threats. At least 788 people, including 200 children, 471 men, and 117 women, have lost their lives across the country in incidents related to torrential rains and flooding. In Punjab, at least 165 people died, including 71 children, 63 men, and 31 women. In Khyber Pakhtunkhwa, 469 fatalities in were reported-81 children, 329 men, and 59 women. Sindh recorded 51 deaths, comprising 16 children, 29 men, and 6 women. Balochistan reported 24 deaths, including 14 children, 6 men, and 4 women. In Gilgit-Baltistan, 45 people died-8 children, 29 men, and 8 women. AJK recorded 23 fatalities due to flash floods, comprising 5 children, 10 men, and 8 women. In Islamabad Capital Territory, 8 individuals lost their lives, including 4 children, 3 men, and 1 woman. A total of 1,018 people were injured in flood-related incidents across the country, including 279 children, 493 males and 246 females. Punjab reported the highest number of injuries at 584, comprising 175 children, 277 males and 182 females. In Khyber Pakhtunkhwa, 285 individuals were injured, among them 58 children, 184 males and 43 females. Sindh recorded 71 injuries, including 35 children, 24 males and 12 females. Balochistan reported five injuries, with two children, two males and one female affected. In Gilgit-Baltistan, 42 people sustained injuries, including three children, 38 males and one female. Azad Jammu and Kashmir reported 28 injuries, comprising four children, 18 males and six females. In Islamabad Capital Territory, three people were injured, including two children and one female, with no male injuries reported. A total of 25,644 individuals have been rescued in 512 operations carried out nationwide as part of a coordinated response, according to the latest figures released by the NDMA. Khyber Pakhtunkhwa recorded the highest number of rescues, with 14,317 people evacuated in 211 operations. Punjab followed with 9,211 rescues conducted across 245 operations. In Azad Jammu & Kashmir, 940 individuals were rescued in 18 operations, while Gilgit-Baltistan saw 1,027 evacuations in 25 operations. Sindh reported 95 rescues in five operations, Balochistan 19 in four, and Islamabad Capital Territory 35 in four operations. NDMA, in collaboration with the Pakistan Army and partners, has distributed over 83,649 relief items to flood-affected communities. Key supplies include tents, blankets, hygiene kits, ration bags, food packs, and drinking water. Additional support-such as solar panels, de-watering pumps, and generators-has been provided to aid recovery efforts. Widespread flooding has caused extensive damage across the country, affecting at least 6,630 homes-1,562 of which were completely destroyed, while 5,068 sustained partial damage. The disaster has also led to the loss of 5,548 livestock, compounding the impact on vulnerable communities. To ensure swift humanitarian response, the National Disaster Management Authority (NDMA) has set up 564 relief and medical camps across the country. Of these, 45 medical camps have provided treatment to 3,227 individuals, while 519 relief camps have extended shelter and essential services to 29,311 people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}