{
  "title": "President for blacklisting bank fraudsters, directs banks to refund Rs 2.74 million to victims",
  "link": "https://www.app.com.pk/national/president-for-blacklisting-bank-fraudsters-directs-banks-to-refund-rs-2-74-million-to-victims/",
  "date_published": "2024-01-21T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): President Dr Arif Alvi has asked the Banking Mohtasib to take up the matter of banking frauds with the State Bank of Pakistan (SBP) to get the essential standard operating procedures (SOPs) issued, so that the proven fraudulent personnel’s CNICs could be blacklisted, placed at the central negative list, besides ensuring that no banking/financial facility could be extended to them by the banking industry.\nThe president issued these directions while rejecting two separate representations filed by the United Bank Ltd (UBL) and Bank Alfalah Ltd (BAL) directing the banks to pay Rs 1.9 million and Rs 0.744 million respectively to their customers who fell victim to online banking fraud at the hands of fraudsters, President Secretariat Press Wing said in a press release.\nAs per details, Qaiser Mehmood who was holding an account with UBL received a call from a number resembling the Bank’s helpline and the caller advised him to activate his disabled digital banking app.\nHe activated his app, after which Rs 2 million were transferred from his account through multiple transactions.\nSimilarly, Brigadier (retd) Muhammad Arif Shaikh received a call from fraudsters asking him for his banking credentials to remove some technical flaws from his account.\nLater, an amount of Rs 994,000 were transferred from his account through 19 transactions.\nThey had asked their respective banks to refund their money, but to no avail.  Feeling aggrieved, they separately approached the Banking Ombudsman to get relief.\nThe Ombudsman directed the banks to refund the lost amounts to the customers. The banks, then, separately filed representations against the Ombudsman’s decisions with the President.\nThe president held personal hearing of the cases, and having listened to the parties and going through the available record, decided the cases in the complainants’ favour.\nHe observed that the banks were found non-compliant with the SBP’s directives regarding the implementation of monitoring systems to detect fraudulent transactions.\nHe said that multiple consecutive transactions were conducted but it did not raise alerts and allowed the money to pass through the system.\nHe noted that the banks also failed to establish the legitimacy of transactions in terms of Section 41 of the Payment System and Electronic Fund Transfers Act, 2007.\nThe president said that the banks failed to submit any proof of compliance with the directions of SBP despite being given ample opportunity and concluded that malpractice and maladministration stood established on part of the banks and they were liable to make good the financial loss of the complainants.\nPresident Alvi, therefore, rejected the representations of UBL and BAL and directed them to pay Rs1,998,500 and Rs744,000 to the complainants.",
  "retrievedAt": "2025-08-10T23:47:13.740Z"
}
