{
  "title": "Thick fog forces motorway closures, disrupts traffic across north, south Zones",
  "link": "https://www.app.com.pk/national/thick-fog-forces-motorway-closures-disrupts-traffic-across-north-south-zones/",
  "date_published": "2024-01-21T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): A blanket of dense fog has wreaked havoc on major motorways in the North, South Zones, leading to road closures and strategic diversions from the Peshawar to Islamabad stretch on M1, M2, M4, M5, M11, M-14, E35 and commuters are grappling with limited visibility, prompting authorities to take decisive measures.\nThe motorway spokesman said on Sunday that adverse weather conditions had thrown several key motorways in North Pakistan into chaos as thick fog engulfed major stretches from the M1 Peshawar to Islamabad Motorway to the Swat Expressway and beyond, commuters faced disruptions and diversions due to reduced visibility. The National Highway and Motorway Police (NHMP) has issued comprehensive update on the affected routes and the latest traffic management measures.\nThe M1 Motorway, connecting Peshawar to Islamabad, witnesses a complete closure from Islamabad Toll Plaza (KM 351) to Peshawar Toll Plaza (KM 498) due to dense fog. The limited visibility of 40-50 meters prompts authorities to divert northbound traffic from Islamabad Toll Plaza.\nThe traffic at southbound on the E35, from Burhan to Thakot is diverted from JhariKas to GT Road (KM 18) due to challenging foggy conditions as navigating through the thick fog becomes a significant challenge for commuters.\nThe dense fog persists on the M2 North Motorway from Islamabad (KM 350) to Kalar Kahar (KM 242), significantly reducing visibility to 200-300 meters. The challenging conditions prompt cautionary measures for drivers on this stretch.\nM14 Hakla to D.I.Khan, northbound traffic at the M14 Motorway is diverted from Kharpa (KM 74) due to thick fog, leading to a complete closure from Hakla (KM 000) to Kharpa (KM 74) for both north and southbound lanes. The foggy conditions persist as of the latest update on January 21, 2024, at 08:41.\nThe motorists traveling on Swat Expressway experience diversion of southbound traffic from KM 19 due to fog at 10:13:31 am. The limited visibility adds to the challenges faced by commuters in this region.\nMotorways authorities said that sections of the M2-South faced closures, including the stretch from Ravi Toll Plaza (KM 12) to Kot Momin (KM 162) due to fog at the roadside of the northbound lanes. Additionally, the closure of lanes from River Chenab Bridge (KM 132) to River Chenab Bridge due to a vehicle breakdown further compounded the traffic situation.\nEncouragingly, the M3 Motorway from Lahore to Abdul Hakeem reports clear roads and weather conditions at 10:23 am, providing a respite for travelers in the region.\nAt M11 Mehmood Booti to Sambrial Toll Plaza Sialkot, partial cloud cover is reported on the M11 Motorway from Mehmood Booti (KM 00) to Sambrial Toll Plaza (KM 91), indicating relatively stable weather conditions for commuters.\nIn the Central-II Zone of the M4 Motorway, the road and weather remain clear as of 08:29 am. However, in the Sub-Sector M4 from Abdul Hakeem (KM 89) to Sher Shah (KM 00), the weather remains cloudy, he added.\nMeanwhile at M5, cloudy weather persists from Sher Shah Multan (KM 772) to Zahir Pir (KM 579), potentially affecting visibility for commuters in the region.\nChallenges arise on the M5 Motorway from Zahir Pir (KM 579) to Rohri Toll Plaza (KM 386), leading to road closures from Ryk (KM 578) to Rohri (KM 386) due to dense fog. Southbound traffic is diverted from Rahim Yar Khan (KM 559) to ensure safety amidst challenging conditions.\nIn the face of these weather-induced challenges, commuters are advised to exercise caution, follow diversions, and stay updated on the latest road conditions. Authorities continue to monitor the situation closely, and further updates will be provided as conditions evolve.",
  "retrievedAt": "2025-08-10T23:47:21.033Z"
}
