{
  "title": "EPA team inspects 383 vehicles, indicates diesel HTV major smoke contributor",
  "link": "https://www.app.com.pk/national/epa-team-inspects-383-vehicles-indicates-diesel-htv-major-smoke-contributor/",
  "date_published": "2024-01-21T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP):The Environmental Monitoring Team of the Pakistan Environmental Protection Agency (Pak-EPA) and the Islamabad Traffic Police conducted a week-long Vehicular Emission Control and Monitoring Campaign from January 9 to 17 across the federal capital.\nDuring the campaign, a total of 383 vehicles were inspected across various categories, including 80 buses, 47 vans, 30 cars, 120 minitrucks, 93 trucks, and 13 tractors.\nHowever, heavy transport vehicles (HTV) using diesel fuel were identified as the primary contributors to smoke emissions, with fines imposed on 27% of the vehicles, a news release said.\nA rigorous test of soot carbon smoke emissions led to the imposition of 105 fines on vehicles exceeding the National Environmental Quality Standard (NEQS) emission levels by over 40% against the Ringelmann scale.\nThe initiative aimed to address the growing concern about air pollution in Islamabad caused by vehicular emissions. The basic objective of the survey was to ascertain the factual position of vehicular emissions during the dry spell of winter and their contribution to the formulation of smog in the current fog episode.\nAir pollution, a significant environmental issue, refers to harmful substances in the air that can adversely affect human health, animals, and the overall ecosystem. One major contributor to air pollution is vehicular emissions, including carbon monoxide, nitrogen oxides, sulfur oxides, particulate matter, and soot carbon. Soot carbon, emitted from diesel vehicles, contributes to air pollution and poses serious health risks.\nAccording to Article 11 of the Pakistan Environmental Protection Act, 1997, “no person shall discharge or is allowed to discharge or emit any effluent, waste, air pollutant, or noise in any amount, concentration, or level that is in excess of the National Environmental Quality Standard.”\nThe campaign was initiated under the direction of Farzana Altaf Shah, Director General, Pakistan Environmental Protection Agency, Ministry of Climate Change and Environmental Coordination, and headed by Dr. Zaigham Abbas, Director (Lab/NEQS), Pakistan Environmental Protection Agency, Ministry of Climate Change and Environmental Coordination.\nThe campaign strategically covered seven locations across Islamabad, each carefully chosen to monitor and control vehicular emissions effectively. These locations are G-14 Srinagar Highway Islamabad (this location serves as a major gateway into the capital city), GT Road near I-14 Islamabad (an essential entry point connecting GT Road to Islamabad), Srinagar Highway G-9, Exit Point Islamabad (monitoring emissions at a key exit point from the city), Islamabad Express Highway, and PWD Exit from Islamabad (a crucial exit point towards Rawat). 9th Avenue Islamabad, I-9 Entry Point (this location regulates vehicles entering from Rawalpindi), Shahpur Bypass Bharakahu Islamabad (monitoring emissions at the Shahpur Bypass entry), D-Chowk, and Abpara Chowk Islamabad (centrally located in the heart of the city, ensuring comprehensive monitoring).\nThis collaborative effort exemplifies the commitment of the Pak-EPA and Islamabad Traffic Police towards sustainable urban living. The success of the campaign underscores the importance of ongoing monitoring and enforcement in addressing air quality concerns in the capital city.\nBy tackling vehicular emissions head-on, this initiative paves the way for a healthier environment and sets a precedent for future endeavours in environmental protection.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:47:35.167Z"
}
