{
  "title": "Hudaibia Paper Mills case, a story of Rs1,242 mln fruad, in volume bigger than Panama scandal: Fawad",
  "link": "https://www.app.com.pk/national/hudaibia-paper-mills-case-a-story-of-rs1242-mln-fruad-in-volume-bigger-than-panama-scandal-fawad/",
  "date_published": "2021-05-11T07:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Tuesday said Hudaibia Paper Mills case was a story of fraud of about Rs1,242 million, in terms of volume bigger than the Panama Papers case.\nIn a tweet he said the case started in the year 2000 when National Accountability Bureau (NAB) filed the reference.\nFawad said Nawaz Sharif’s two sons Hassan and Hussain Nawaz, Shahbaz Sharif and his political heir Hamza Shehbaz were also its main characters.\nThe minister revealed that Ishaq Dar opened fake Benami foreign currency accounts to support the Sharif family in this fraud. When he was caught, Dar became an approver and also recorded his detailed statement to the authorities concerned, he said.\nHe said later Dar deviated from his statement by saying that the statement was taken under coercion.\nSharing details, Fawad said an examination of the records of Hudaibia Paper Mills revealed to the investigators of NAB Islamabad that during the period 1996 to 1997 and 1997 to 1998, Rs30.499 million and Rs612.273 million were shown as share deposit in the company documents.\nThe investigation teams were surprised that a company, which had a pre-investment volume of just Rs95.7 million and a gross loss of Rs809.834 million, received such huge sums of money, he said.\nThe NAB, therefore, issued orders to investigate the matter under the NAB Ordinance 1999, he said adding investigations had revealed that the mills management, which comprised Mian Muhammad Sharif, Shamim Akhtar, Nawaz Sharif, Shehbaz Sharif, Abbas Sharif, Maryam Safdar, Sabiha Abbas, Hussain Nawaz and Hamza Shehbaz, had a huge amount of illicit capital and were unable to disclose sources of wealth.\nHe said they fraudulently opened various fake foreign currency accounts using various provisions of the Protection of Economic Reforms Act of 1992 for money laundering and deposited a lot of money in those accounts.\nHe said when the scandal of fake accounts broke out, they decided to put the money directly into the accounts of Hudaibia Paper Mills.\nTo this end, they arranged telegraphic transfers in dollars equal to the value of the foreign currency for the accounts of the mill, just like the money of Shehbaz Sharif and Maryam Nawaz was sent out of Pakistan recently.\nHe said suddenly Rs1,242.732 million were added into the assets of the Sharif family and this amount was even bigger than the Panama scandal.\nThe NAB, he said, also pointed out that through these actions, the Sharif family had not only committed crimes such as money laundering and concealment of assets, but they also committed the crime of throwing dust in the eyes of many state and government institutions.\nHe said during the Musharraf era, when the matter came before the accountability court, the Sharif family made a deal with the Musharraf government and went to Saudi Arabia.\nThe issue was raised again in 2008 but the Pakistan Peoples Party and Pakistan Muslim League-Nawaz connivance stopped the case claiming that the case could not proceed due to the absence of NAB chairman’s signature, he added.\nHe said when Sharif family challenged the action before the Lahore High Court, a two-member division bench gave a 1.1 divided ruling and the case went to the referee judge who ruled in favour of closing the case, and the case was closed in 2014.\nHe said interestingly, after such a detailed investigation, not a single day proceedings of the case were held in the court.\nThe Panama papers scandal, he said, also revealed that the judge who decided to close the case also had assets abroad, but unfortunately no action was taken against him as well.\nIn this case, Fawad said, some new facts had also come to the light on which a new investigation had been decided.\nHe expressed the hope that the judiciary would also take action against those judges who supported the Sharif family, as justice demands that all institutions should play their part as Pakistan’s future depends on the rule of law.",
  "retrievedAt": "2025-08-11T20:43:18.421Z"
}
