{
  "title": "Sharif family plundered national resources: Dr Firdous",
  "link": "https://www.app.com.pk/national/sharif-family-plundered-national-resources-dr-firdous/",
  "date_published": "2021-05-11T16:50:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 11 (APP): Special Assistant to Chief Minister on Information Dr Firdous Ashiq Awan on Tuesday said that the Sharif family plundered public resources mercilessly in the past, as Shehbaz Sharif embezzled Punjab’s development funds along with his henchmen.\nTalking to the media at DGPR Office here, Dr Firdous said that Prime Minister Imran Khan exposed the corruption and plundering of the Sharif family. However, she regretted that the remnants of the past corrupt legacy were continuing to show loyalty to their past masters in civil service, politics and other walks of life.\nShe said the Ring Road project was launched in Rawalpindi to reduce the traffic load. The project was launched in the public and national interest but efforts were made to use the project for personal benefits, she added.\nThe Special Assistant disclosed that the alignment of 65-km long Rawalpindi Ring Road was illegally altered and the pre-determined route was deviated. The former Rawalpindi Commissioner Muhammad Mehmood and his associates illegally prepared the alignment of the ring road in connivance with the consultant.\nDr Firdous said the former commissioner Mehmood Ahmed, former land acquisition collector Wasim Ali Tabish and former deputy director project management unit Abdullah indulged in irreparable and illegal activities while conducting misconduct and fraud. The national exchequer was misused to benefit a few, she said.\nThe SACM said their case was being forwarded to NAB and disciplinary action including suspension from service etc. had been initiated. All those including someone from the incumbent government, opposition and a few bureaucrats were being brought before the court of law to ensure justice, she added.\nShe said that NAB would inquire about the illegal expenditure of Rs 2.3 billion by former commissioner Mehmood Ahmed to illegally acquire such land which increased in price of real estate owned by the influential people. The inquiries were also being held against some residential schemes for being ‘benami’ frontmen of the powerful people, she asserted.\nThe SACM said that Mehmood Ahmed and his associates had been suspended from service as the former commissioner allegedly broke the rules and regulations and sought financial benefits for himself as well as worked to promote the interest of different residential schemes including Nova City, Capital Smart City, New Airport City/Al-Asif Housing, Top City, SAS Developers, Blue World and Islamabad Capital Housing.\nDr Firdous regretted that Punjab and Federal governments were kept completely in the dark about the facts in this regard and the instructions to present this alignment to the Chief Minister at the highest level were deliberately ignored. With the immoral cooperation of a member, the project was also illegally advertised on March 1, 2021, she maintained.\nShe said that FIA was being directed to conduct a forensic audit of such residential schemes to identify the sale of plots in excess to approve lands and illegal online sales. They were directed to collect information in this regard, she said.\nThe Special Assistant said the former commissioner worked very rapidly on this illegal alignment and performed many illegal activities. The former commissioner discreetly worked to hide illegal activities and financial stakes from the people.\nSome engineering firms that had purchased Request for Proposal (RFP) documents had made huge investments in properties along with illegal portions of Ring Road. The bidding process for the project had now been canceled. Since the alignment of the ring road was made illegally so one could ever regularize it legally because irreparable and illegal work had been done, she said.\nDr Firdous Ashiq Awan said that after the personal notice of Prime Minister Imran Khan, the corruption of this group was exposed as this could have incurred at least 10 billion loss to the national kitty. This group tried to frustrate Prime Minister’s vision of protecting precious land and multi-storey building construction, she said.\nThe Special Assistant said that Prime Minister Imran Khan had come to power to curb corrupt elements inside Pakistan. “The black sheep in our system looted the country for 75 long years and during this time many big fish have been exposed,” she added.\nShe said that Prime Minister Imran Khan had decided to regulate the poultry business to thwart the designs of poultry mafia as like sugar and flour mafias.\nResponding to a question, the SACM said that a statement was issued by a politically infant child from Sindh in which he said that the government had failed to provide any subsidy but this political minor failed to understand the vision of subsidy as flour bag being sold in Punjab at Rs 800 was available in Sindh at the cost of Rs 1200.\nThe Special Assistant said that Saudi Arabia always stood firmly with Pakistan.",
  "retrievedAt": "2025-08-11T20:43:12.921Z"
}
