{
  "title": "1st Asian, Pakistani Waseem Ahmad becomes new IRW CEO",
  "link": "https://www.app.com.pk/national/1st-asian-pakistani-waseem-ahmad-becomes-new-irw-ceo/",
  "date_published": "2021-05-11T06:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):First Asian and Pakistani Waseem Ahmad has been appointed as new chief executive officer (CEO) of the Islamic Relief Worldwide (IRW).\nWaseem is currently the Director of IRW’s International Programmes Division, managing the design and delivery of the organisation’s global humanitarian and development work.\nLast year this work provided vital support to 9.5 million people in more than 40 countries – including life-saving aid for people affected by humanitarian crises; transformative water and education programmes; innovative projects helping communities cope with the devastating effects of climate change; and responding to the global Covid-19 pandemic, said a press release.\nWaseem has been part of the Islamic Relief family for 15 years, having first joined as a Programme Officer in Balochistan, Pakistan.\nHe has also served as Head of Programme Funding and Partnerships, a role that involved strengthening relationships with major institutional partners – including the UK Department for International Development, USAID and UN agencies – to respond to major crises across the globe, including droughts and famine in East Africa, Pakistan earthquake and Indian Ocean tsunami.\nIn addition, he has previously worked for Tearfund, Oxfam and LEPRA Health in Action.\nDr Ihab Saad, Chair of IRW’s Board of Trustees, said, “Waseem brings a wealth of experience to the role, having led our response to some of the biggest emergencies around the world.\nUnder his leadership our aid and development programmes have gone from strength to strength, reaching more people than ever before and empowering communities in innovative and sustainable ways.\n“Waseem is passionate about integrating Islamic humanitarian principles with contemporary humanitarian approaches and has helped us to form and strengthen our partnerships with international organisations and donors around the world.”\nOn being appointed, Waseem Ahmad said, “I am honoured and excited to lead IRW in its mission to transform the lives of the world’s poorest and most vulnerable people.\n“This is a critical time for the world, and our duty to humanity is greater than ever right now. Hundreds of millions of people go to sleep hungry every night.\nMany more face discrimination and disadvantage based on their gender, race or religion. Climate change continues to threaten the lives and livelihoods of the poorest communities and countries.\nWe want to work together with communities and partners around the world to create a just and fairer future for everyone.”\nIt is pertinent to mention here that Waseem was born in Pakistan and has also lived and worked in several other countries including Sudan, Sri Lanka, Malawi and Somalia.\nHe has an MSc in Project Planning and Management from the University of Bradford in the UK, as well as an MSc in Economics from Arid Agriculture University in Rawalpindi, Pakistan.\nIn addition, IRW’s previous CEO, Naser Haghamed, stepped down for health reasons at the end of January 2021. Tufail Hussain, Director of Islamic Relief UK, has been acting as interim CEO since then and will now resume his main role.",
  "retrievedAt": "2025-08-11T20:43:18.398Z"
}
