{
  "article_id": "2025-01-21_c861e59c9377e271b3d9e23a1c7937bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/law-enforcement-faces-450-mln-losses-in-violent-pti-protests/",
    "retrieved_at": "2025-08-27T11:52:39.820Z"
  },
  "metadata": {
    "title": "Law enforcement faces 450 mln losses in violent PTI protests",
    "author": null,
    "date_published": "2025-01-21T11:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 338,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 21 (APP):Violent protests orchestrated by Pakistan Tehreek-e-Insaf (PTI) have caused over Rs 450 million in financial losses to law enforcement agencies, along with significant human casualties, according to data compiled by the Islamabad Police regarding major protests on three different occasions. According to a report compiled by the office of the Inspector General (IG) police, on Tuesday, three major protest events-on May 9, 2023, October 4, 2024, and November 26, 2024-resulted in extensive destruction to police infrastructure, vehicles, and public property, severely impacting their operational capabilities. The report revealed that the May 9, 2023 protests left 82 police officers injured, with serious injuries among them. Damage to police buildings amounted to 30 million rupees, while 12 police vehicles were destroyed, causing a loss of 4.5 million rupees. A major blow came with the destruction of 367 Safe City surveillance cameras, incurring a replacement cost of 251.37 million rupees. Similarly, the protests on October 4, 2024, resulted in the martyrdom of one police officer and injuries to 42 others. Damage to 13 police vehicles added 2.7 million rupees to the losses. Additionally, 221 Safe City cameras were destroyed, costing 63.64 million rupees. The November 26, 2024 protests were the most violent, leading to the martyrdom of four Rangers personnel and injuries to 103 police officers, including 27 with firearm wounds. Destruction of 246 Safe City cameras caused a financial loss of 87.03 million rupees, while damage to 43 police vehicles resulted in an estimated loss of 10.7 million rupees. In total, the violent protests have resulted in the martyrdom of five law enforcement personnel and injuries to 227 police officers. The destruction of 834 Safe City cameras alone has accounted for over 402 million rupees in damages, undermining public safety and surveillance measures in the capital. Officials condemned the targeting of police assets and vowed to take strict action against those responsible for orchestrating the violence. Islamabad Police emphasized that these repeated attacks not only disrupt law enforcement operations but also erode public trust in state institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}