{
  "article_id": "2025-01-21_ac3a4581c94e712e8f2060acfaa31373",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ibcc-hosts-awareness-seminar-on-model-assessment-framework-2/",
    "retrieved_at": "2025-08-27T11:54:24.791Z"
  },
  "metadata": {
    "title": "IBCC hosts awareness seminar on Model Assessment Framework",
    "author": null,
    "date_published": "2025-01-21T14:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 328,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 21 (APP):The Inter Boards Coordination Commission (IBCC) here on Tuesday organized its second awareness seminar on the Model Assessment Framework (MAF) in Peshawar, Khyber Pakhtunkhwa, as part of its ongoing efforts to revolutionize assessment practices in Pakistan. Following the inaugural seminar held in Karachi on January 14, 2025, the IBCC initiated a nationwide series of seminars to raise awareness among stakeholders across the country, ensuring inclusivity and regional representation. The event gathered education leaders, policy makers and practitioners to discuss the importance of standardized, transparent, and equitable assessment systems aligned with global standards. Dr Ghulam Ali Mallah, Executive Director of IBCC, delivered the opening remarks, highlighting the potential of MAF to promote critical thinking, conceptual understanding, and lifelong learning. Prof Dr Muhammad Naeem Khalid, former DG Academics HEC, delivered a keynote address on \"Revolutionizing Education with TPACK+ Model and the Future of Hybrid Learning Aligned with NCP 2023,\" focusing on the integration of technology and pedagogy to advance education. A panel discussion, moderated by Dr Muhammad Idrees, featured experts including Mr Nasir Shah (HEC), Mr Muhammad Shafique Awan (BISE Abbottabad), Prof Dr Shazia Naeem (CANTAB Publisher), and Mr Muhammad Ghulam Shabbir (Ormi Systems Ltd.), exploring the role of MAF in ensuring fairness and inclusivity in assessments. The seminar outlined MAF's focus on higher-order skills, digital tools, psychometric analysis, and nationwide capacity-building initiatives. IBCC announced plans for regional training sessions to ensure effective implementation of MAF and address regional disparities. In his concluding remarks, Dr Ghulam Ali Mallah expressed his gratitude to partnering organizations and applauded the contributions of the IBCC team, including Mr Usman Khan, Director IBCC; Dr Shahzad Ali Gill, Director Capacity Building; Mr Imran Khan, Deputy Director IBCC; Ms Neelofir, Deputy Director IBCC; Ms Sadia Naz, Deputy Director IBCC; Mr Usama Shafique, Assistant Director; and Muhammad Ahmer Hasan, Media Coordinator IBCC. Their collective efforts ensured the success of the seminar and strengthened IBCC's commitment to fostering a unified and transparent assessment system in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}