{
  "article_id": "2025-01-21_250d8a6cf64ef25a953e8caf455886ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-police-arrest-over-20-in-crackdown-on-kite-flying-violations/",
    "retrieved_at": "2025-08-27T11:54:19.227Z"
  },
  "metadata": {
    "title": "ICT Police arrest over 20 in crackdown on kite flying violations",
    "author": null,
    "date_published": "2025-01-21T15:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 308,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 21 (APP):Islamabad Capital Territory (ICT) Police have intensified their crackdown on kite flying violations, with over 20 individuals arrested in the past week. A public relation officer told APP on Tuesday that the ICT Police have urged the citizens not to allow their children to violate the kite flying ban imposed by the relevant authority else strict action in accordance with the law would be taken and the ban violators would be sent behind the bars. In this regard, the Khanna police team arrested two accused involved in kites selling and recovered kites and string rolls from their possession. The arrested accused were identified as Haider and Zahid. Cases have been registered against the nabbed accused. DIG Syed Ali Raza directed all officers for an effective crackdown against the accused involved in criminal activities and to ensure the safety of lives and property of citizens on a priority basis. The parents are requested to stop their children from getting involved in such activities as a crackdown against kite sellers and flyers had already been accelerated in the city. Special squads had been formed to net the violators while SDPO's and SHO's were also taking part in the operation. DIG Raza directed all officers to utilize all available resources to control the kite flying and selling and to net the ban violators and the kite sellers. The kite flying ban violators were being dealt with an iron hand and no one would be allowed to violate the law. The use of metal string for kite flying results in the loss of human lives therefore, all-out efforts are made to stop kite flying. The kite flying not only causes power outages due to hitting electric wires. It becomes a threat to human lives as well, while younger people fall from the rooftops and become victims of life-long paralysis.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}