{
  "article_id": "2025-01-21_0347324f23a14537856ee1ac04690dc9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pbm-zfa-organise-digiskills-workshop-for-women-empowerment/",
    "retrieved_at": "2025-08-27T11:53:57.052Z"
  },
  "metadata": {
    "title": "PBM, ZFA organise DigiSkills workshop for women empowerment",
    "author": null,
    "date_published": "2025-01-21T15:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 398,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 21 (APP):Pakistan Bait-ul-Mal (PBM), in partnership with the Zakat Foundation of America (ZFA), organized a \"Training Programme and Workshop on DigiSkills\" aimed at skill development and capacity building for the teachers and students of PBM's Women Empowerment Centres (WEC). The purpose of the programme was to equip the participants with latest market knowledge and skills boosting their confidence and motivation. In a ceremony held here in Islamabad, Managing Director PBM Senator Capt. Shaheen Khalid Butt awarded the certificates to the participants of Workshop along with Country Head ZFA Dr. Fazal-ur-Rahman. Addressing the ceremony, Managing Director PBM emphasized the significance of investing in women's education and training providing them socio-economic rights. \"Empowered women are vanguard towards the country's progress and economic prosperity; flourished women are beam of light and inspiration for the future generations\", he remarked. Highlighting the organization's poor friendly missions, Shaheen Khalid Butt communicated that Pakistan Bait-ul-Mal, a premier social safety net of the country was introduced by Mian Muhammad Nawaz Sharif in 1991 during his first tenure as Prime Minister Islamic Republic of Pakistan, in order to combat the menace of poverty and other painful issues of downtrodden persons; the organization also reflects the beautiful theme of making the country a social welfare state in true sense. He further expressed that PBM's 165 Women Empowerment Centers across the country are playing a pivotal role in imparting skill development training to destitute women, enabling them to become self-sufficient and honorable part of the society, at present 13,000 deserving women are engaged in skill development training with a cumulative total of 341,000 women having successfully completed the variety of training programs thus far. Appreciating the dedicated worldwide humanitarian services of ZFA for the Muslims, Senator Capt. Shaheen Khalid Butt also expressed his gratitude to Country Head of the organization Dr. Fazal-ur-Rahman for joining PBM's journey towards women empowerment by arranging such an imperative training program. He also underlined the need to explore further avenues of joint efforts to uplift the lives of vulnerable persons. On the occasion, Country Head ZFA, Dr. Fazal-ur-Rahman spotlighted significance of the training workshop for nurturing digital skills and up-to-date knowledge. He also focused the diversified ongoing humanitarian services globally by Zakat Foundation of America. Admiring the PBM's pro-poor initiatives, he also expressed his desire to further strengthen the partnership between the two organizations for extending their support to the needy ones.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}