{
  "title": "OIC secretary general voices concerns over continued rise of hate, intolerance on basis of faith",
  "link": "https://www.app.com.pk/national/oic-secretary-general-voices-concerns-over-continued-rise-of-hate-intolerance-on-basis-of-faith/",
  "date_published": "2022-02-16T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Secretary General of the Organization of Islamic Cooperation (OIC), Hissein Brahim Taha Wednesday expressed OIC’s concerns over the continued rise of hatred, intolerance, discrimination and violence practiced on the basis of faith.\nHe mentioned that the phenomenon was a threat to humanity as it jeopardized peace and security in the world, recalling the terrorist incidents that occurred during 2019 in New Zealand and Sri Lanka.\nThe secretary general was addressing the inaugural high-level segment of 8th Meeting of ‘The Istanbul Process’ held virtually under the theme ‘10th Anniversary of Human Rights Council Resolution 16/18: Looking Back and Moving Forward’, a press release received here said.\nHissein Brahim Taha underlined the crucial importance of the collective efforts at international level to reverse such a tendency and to prevent atrocities from reoccurring, by using all available means and tools.\nThe meeting was hosted by the Islamic Republic of Pakistan, which witnessed broad participation of the States from all regions, relevant UN officials and experts, religious leaders, civil society, business representatives and journalists.\nThe OIC secretary general thanked Pakistan for organizing the meeting.\nHe reiterated the importance of this platform as an important step taken by the international community to resolutely combat hate speech, intolerance, discrimination and incitement to violence based on religion or belief.\nThe Resolution 16/18 and its action plan, he said, remained a solid bedrock upon which the international community could build a collective response to fight hate speech, intolerance, discrimination and incitement to violence based on religion or belief.",
  "retrievedAt": "2025-08-11T14:21:11.095Z"
}
