{
  "title": "44th meeting of Law & Justice Commission of Pakistan held",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP):The 44th Meeting of Law & Justice Commission of Pakistan (LJCP) was held Thursday at Supreme Court of Pakistan while the Chief Justice of Pakistan Justice Yahya Afridi, the Chairman Law & Justice Commission of Pakistan Chief Justice of Pakistan was presiding over.\nThe Chief Justice apprised the participants of a significant shift in the composition of the Law and Justice Commission of Pakistan (LJCP).\nPreviously, non-official members were mostly appointed from amongst retired judges of Superior Courts, but recognizing the vital role of the legal fraternity in law reforms, the Commission now includes the non-official members from the Bar.\nTo rejuvenate the Commission, he emphasized the need for regular meetings, wider publicity of the LJCP’s mandate to solicit law reform proposals, and augmentation of research capabilities by engaging research associate alongside the existing team of researchers. The Chief Justice concluded by advocating for incremental progress on the research agenda to ensure effectiveness of the Commission.\nThe meeting was attended by members from legal fraternity that included senior advocates SCP Khawaja Haris Ahmed, Fazal-i-Haq Abbasi, Kamran Murtaza, Muhammad Munir Paracha, Ahmed Farooq Khattak, Vice Chairman, Khyber Pakhtunkhwa Bar Council, Peshawar.\nThe meeting was convened to develop a mechanism for review of laws including identification of the areas of law for review and stakeholders engagement.\nAn “Advisory Committee” was constituted under the Convenorship of the Secretary, Ministry of Law & Justice, other members of the Committee will include Khawaja Haris Ahmed, Muhammad Munir Paracha, and Kamran Murtaza. The Commission also defined Terms of Reference (ToRs) of the Committee which included identification of the key areas of laws for review within one month through wide stakeholders’ engagement and public feedback.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:02:12.724Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/44th-meeting-of-law-justice-commission-of-pakistan-held/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T13:28:00.000Z"
}
