{
  "title": "Air University hosts national conference on “Marka-e-Haq: Pakistan’s Responsible Statecraft”",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP):Air University’s Faculty of Aerospace and Strategic Studies (FASS) on Thursday hosted a timely and high-level national conference titled “Marka-e-Haq: Pakistan’s Responsible Statecraft”.\nThe conference arrives in the aftermath of the recent regional crisis, during which Pakistan’s diplomatic maturity, legal foresight, and strategic restraint as well as upholding of deterrence emerged as defining features of its response, said a press release.\nAnchored in the evolving security environment of South Asia, the event examined how Pakistan’s conduct has reshaped the regional equilibrium and reinforced its image as a responsible power and stabilizing force.\nThe conference featured a distinguished keynote address by Air Chief Marshal (Retd) Sohail Aman, former Chief of Air Staff of the Pakistan Air Force, reflected on Pakistan’s institutional strength and strategic preparedness. Drawing on his decades of leadership and operational experience, Aman offered insights into how foresight, modernization, and coherence in national institutions underpin effective statecraft in times of tension.\nAmong the high-level speakers, Ambassador (Retd) Masood Khan spoke on the internationalisation of the Kashmir dispute and how global legal forums and advocacy have renewed relevance while Ambassador (Retd) Masood Khalid explored the growing role of external powers in shaping regional trajectories. Legal and strategic issues were explored by Ahmer Bilal Soofi, who presented on the legal and geopolitical future of the Indus Waters Treaty, and Dr. Adil Sultan, evaluated Pakistan’s strategic and deterrence posture and military signaling during the crisis.\nThe conference also featured a unique addition, a Young Voices Panel in which undergraduate students of BS International Relations of FASS presented their remarks on the role of media, AI, Deepfakes, linguistics on deterrence, crisis escalation and diplomacy.\nThis conference is part of a larger academic culture fostered at FASS, where learning transcends the classroom. Through practical simulations, policy engagement, and high-level academic forums, students are exposed to the intersection of theory and practice. Marka-e-Haq exemplifies how FASS integrates analytical rigor with real-world application, cultivating a generation of scholars and practitioners committed in serving Pakistan through informed and strategic national leadership.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:01:49.188Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/air-university-hosts-national-conference-on-marka-e-haq-pakistans-responsible-statecraft/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T14:09:00.000Z"
}
