{
  "title": "PIMA urges stronger anti-tobacco action on World No Tobacco Day",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP): The Pakistan Islamic Medical Association (PIMA) on Thursday called on authorities to strengthen enforcement of existing anti-tobacco laws, introduce stricter regulations for emerging nicotine products, and impose higher taxes on tobacco products to protect public health.\nIn a joint statement issued on World No Tobacco Day, being observed on May 31, PIMA President Prof. Atif Hafeez Siddiqui, alongside health experts Prof. Sohail Akhtar and Dr. Ahmar Hamid, urged authorities to take stronger measures against tobacco use.\nThey highlighted that tobacco use is causing an alarming rise in non-communicable diseases in Pakistan, due to weak enforcement of laws and poor public awareness. They cited World Health Organization (WHO) data, revealing that tobacco use results in approximately 164,000 deaths annually in Pakistan and an economic loss of over PKR 700 billion.\nPIMA noted that global research confirms raising tobacco taxes not only boosts government revenue but also significantly reduces consumption and related health burdens. In Pakistan, following tax increases in 2023, tobacco use declined by 19.2%, while 26.3% of smokers reduced their cigarette intake. Revenue from Federal Excise Duty (FED) on cigarettes rose by 66%, from PKR 142 billion in 2022-23 to PKR 237 billion in 2023-24.\nProf. Siddiqui and medical experts also called for stricter regulation of emerging nicotine products like e-cigarettes, nicotine pouches, and heated tobacco, which are aggressively marketed and equally harmful. “Alarmingly, 68% of student users are involved in e-cigarettes, highlighting the urgent need for targeted awareness,” they added.\nThey urged that tobacco tax revenues be utilized for consistent awareness campaigns in all local languages, and called on provincial governments to invest in youth-focused education programs. Additionally, they demanded the establishment of smoking cessation clinics in all teaching hospitals to support those looking to quit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:02:14.324Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pima-urges-stronger-anti-tobacco-action-on-world-no-tobacco-day/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T13:04:00.000Z"
}
