{
  "title": "Binance Academy,  IT Ministry partner to advance blockchain education in universities",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP):Binance Academy, the educational arm of global cryptocurrency exchange Binance, has partnered with Pakistan’s Ministry of IT and Telecom (MoITT) to promote blockchain education across the country, aiming to empower 300 educators and reach 80,000 students in 20 universities by 2026.\nAnnounced as part of a broader strategy to foster digital transformation, the collaboration builds on the Global University Outreach Program (GUOP)—the world’s largest Web3 educational initiative—jointly launched by Binance Academy and the Blockchain & AI Technology Centre (BAITC) said a news release.\nThe program is designed to integrate blockchain into university curricula through open-access learning resources, industry collaboration, and professional certifications.\n“This partnership represents a major step in building a knowledgeable workforce that can harness the potential of blockchain technology to drive innovation in the digital economy,” said Bader Al Kalooti, Binance’s MEASA Head of Growth and Operations. “By empowering educators and students alike, we are laying the foundation for opportunities across multiple sectors.”\nFederal Minister for IT and Telecom Shaza Fatima Khawaja hailed the partnership as a milestone in Pakistan’s digital evolution, aligned with Prime Minister Shehbaz Sharif’s vision for a digitally skilled nation.\n“This initiative will not only contribute to economic growth but also position Pakistan as a global hub for blockchain talent,” she said. “By joining hands with Binance and BAITC, we are ensuring our students are equipped with the tools to lead in the global digital economy.”\nSince 2022, Binance Academy has already trained over 3,000 students across 13 universities and three provinces in Pakistan, offering practical Web3.0 skills and blockchain literacy.\nThe GUOP, launched in Kazakhstan in 2023, has since expanded to 20 countries with the goal of reaching over 200 universities in more than 50 nations and educating over one million students globally by 2026.\nThis collaboration with the MoITT further reflects Binance’s commitment to supporting regulatory compliance, innovation, and capacity-building in emerging digital markets like Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:02:08.385Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/binance-academy-it-ministry-partner-to-advance-blockchain-education-in-universities/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T13:49:00.000Z"
}
