{
  "title": "IFA cracks down on dirty kitchens, seals 7 food outlets, destroys 127kg of expired items",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP):The Islamabad Food Authority (IFA) on Thursday launched a large-scale operation against unhygienic and unsafe food practices in Islamabad, sealing several outlets and discarding harmful ingredients found during inspections.\nIslamabad’s food safety teams, under the supervision of the Deputy Director Operations of IFA, Dr Tahira Siddique carried out a major crackdown against substandard food providers across the city. The action was focused on areas including F-8 Markaz, Centaurus, Iqbal Town, Golra Road, Murree Road, and Barakahu.\nAs part of the drive, 45 food units were inspected. Ten were fined a total of Rs 124,000 for failing to meet health and safety standards. Seven outlets were sealed after inspectors found serious violations of food safety laws.\nDr. Tahira Siddique said that over 127 kilograms of harmful and expired materials were recovered and immediately destroyed during the operation.\nAccording to her, many food handlers were found operating without valid licenses. She added that several food points were using banned or low-quality ingredients in their products.\nDuring the inspections, unhygienic conditions were observed in many kitchens. Freezers were dirty, there was a strong foul smell, and proper cleaning systems were missing. In some outlets, rusty and unwashed utensils were being used. The use of non-food grade items was also reported.\nOfficials said the premises lacked basic pest control and safety measures required under the food safety regulations. Dr. Tahira stated that authorities had tightened the monitoring process and would continue taking strict action against those involved in selling unsafe food.\nThe Deputy Director stressed that food-related businesses must operate under clear guidelines. Those who violate them would face closure and legal action. She further said that there is zero tolerance for businesses that put public health at risk, while those who follow regulations will be supported through public-friendly policies.\nThis crackdown is part of the government’s efforts to ensure that food being sold in the capital is safe for consumption. The Islamabad Food Authority has announced that such surprise inspections will continue and more strict steps will follow if violations are repeated.\nFood safety teams have also urged the public to report suspicious or unhygienic food outlets. Authorities have set up complaint channels to ensure swift action and to make the food industry more responsible and accountable.\nDr. Tahira also emphasized that business owners must ensure proper training of their staff and acquire valid licenses. She said that maintaining hygiene, avoiding the use of expired or harmful items, and keeping the kitchen environment clean are non-negotiable requirements.\nShe reiterated that the use of banned substances, poor handling practices, and ignoring cleanliness would not be tolerated. The aim of the Islamabad Food Authority, she said, is to protect consumers and encourage fair practices in the food industry.\nIn the meantime, food businesses have been advised to review their practices, ensure compliance with the law, and focus on public health.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:03:01.793Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ifa-cracks-down-on-dirty-kitchens-seals-7-food-outlets-destroys-127kg-of-expired-items/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T10:49:00.000Z"
}
