{
  "title": "AIOU holds 1st session of 73rd BASAR meeting",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP): The 73rd meeting of the Board of Advanced Studies and Research (BASR) at Allama Iqbal Open University was successfully held yesterday.\nThe meeting was efficiently conducted and supported by the Director of BASR, Professor Dr. Irshad Ahmad Arshad.\nThe session began with a review of the implementation report of the previous decisions, followed by the formal presentation of the new agenda. Deans from various university departments, distinguished faculty members, subject experts, and PhD scholars actively participated in this important meeting.\nThe research theses presented were meticulously examined. Commending the researchers’ passion and academic quality, most of the theses were approved. Some were provided with valuable and constructive suggestions for further refinement.\nIn the first session, 15 PhD students from the Faculty of Sciences presented their synopses. The participants not only appreciated their work but also praised their confidence and research approach.\nWhile addressing the meeting, Professor Dr. Irshad Ahmad Arshad remarked that the students’ commitment, curiosity, and innovative approach in presenting new research topics was commendable.\nHe emphasized that novelty and creativity in research are essential in today’s era.\nIt is noteworthy that the Vice Chancellor of Allama Iqbal Open University, Professor Dr. Nasir Mahmood, has repeatedly stressed that the focus of research should be the social and economic development of the country so that knowledge and research can directly contribute to national progress.\nThe second session of the meeting will be held tomorrow, Friday, May 30, during which 11 PhD scholars from the Faculty of Social Sciences and Humanities, the Faculty of Arabic and Islamic Studies, and the Faculty of Education will present their research theses.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:02:35.648Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aiou-holds-1st-session-of-73rd-basar-meeting/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T12:14:00.000Z"
}
