{
  "title": "University of Jhang’s Urdu department students pay visit to NLPD",
  "author": null,
  "content": "ISLAMABAD, May 29 (APP): Students from the Department of Urdu, University of Jhang, undertook a study tour of the National Language Promotion Department (NLPD), where they engaged in academic dialogue and explored the institute’s various initiatives for the promotion of the Urdu language.\nOn this occasion, Dr. Rasheed Hameed, Executive Director of NLPD, delivered a detailed address on the development and dissemination of the Urdu language.\nHe emphasized that the survival of languages lies in their practical usage.\n“It is imperative to adopt Urdu in every sphere of life including literature, education, and modern communication,” he added.\n“Urdu is not only a reflection of our culture but also a symbol of national unity, and its promotion is the responsibility of every Pakistani,” he urged.\nExecutive Director of NLPD, Dr. Rashid Hameed also offered guidance to the visiting students, stressing that understanding the literary and historical background of the language was essential for academic maturity.\nDeputy Director NLPD Mehboob Bugti provided the visiting delegation with an in-depth overview of the institute’s various departments, objectives, achievements, as well as ongoing research and training programs.\nAccompanying the students were respected faculty members including Prof. Dr. Mujahid Abbas, Prof. Dr. Zahida Fazil, Dr. Adnan Ahmad, Qamar Abbas Alvi, Ata-ur-Rehman Ata, and Dr. Sundas Hanif.\nThe faculty and students appreciated the hospitality and academic contributions of the NLPD, acknowledging that under the leadership of Professor Dr. Muhammad Saleem Mazhar, the institute has emerged as a shining example in the promotion of Urdu and was playing an exemplary role in this regard.\nStudents described the visit as a memorable moment in their academic journey.\nThey also visited various sections of the department, including the library, bookshop, and the editorial office of Akhbar-e-Urdu.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:00:57.287Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/university-of-jhangs-urdu-department-students-pay-visit-to-nlpd/",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T18:58:00.000Z"
}
