{
  "title": "Voters rejected PTI’s narrative of hatred,  hypocrisy and lies in bye-elections: Tarar",
  "link": "https://www.app.com.pk/national/voters-rejected-ptis-narrative-of-hatred-hypocrisy-and-lies-in-bye-elections-tarar/",
  "date_published": "2024-04-23T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Tuesday that the voters during the recent bye-elections had rejected the Pakistan Tehreek-e-Insaf’s narrative of hatred, hypocrisy and lies.\nAddressing a press conference along with Minister for Law and Justice Azam Nazeer Tarar here, he said much hue and cry was made about so-called rigging in the by-elections but even a single proof could not be presented by the PTI leadership.\nHe said that the outcome of bye elections also cleared doubts about February 8 general elections created by a certain political party.\nBy the grace of Allah Almighty, Pakistan Muslim League-Nawaz swept the by-elections as the masses voted for love of Muhammad Nawaz Sharif, and Prime Minister Shehbaz Sharif’s economic reforms.\nThe minister remarked that people of Pakistan had buried the PTI’s narrative based on violence, duplicity and lies as not PML-N voters, but other people also voted for PML-N due to its pro- people policies and track record of servicing the masses.\nRegarding Bushra Bibi’s health, he said funny things were being shared on social media, though all her medical tests were clear.\nHe said it appeared that the PTI leaders had sworn that they have to speak against the country’s national and defense institutions.\nHe said that due to the efforts of the government, the country was moving towards progress and development.\nThe Iranian President had vowed to increase trade volume with Pakistan upto 10 billion dollars per year.\nEarlier, he said the high level Saudi Arabian delegation had also discussed prospects of major investment in Pakistan.\nHe said the stock market had broken all previous records due to the favorable environment.\nThe government under the leadership of Shehbaz Sharif wanted to introduce serious economic reforms in the country.\nHe said that IT exports reached 306 million dollars.\nInvestment was coming in the country owing to the good policies of the government of Muhammad Shehbaz Sharif.\nHe recalled that the PTI founder was serving jail sentence due to corruption and now he was feeling that he had become irrelevant.\nTarar said that concocted stories about Bushra Bibi’s health were being spread to get attention. Referring to Imran Khan he said that a person in the prison was a victim of paranoia.\nHe recalled that the PTI even sold gifts given by heads of friendly countries.\nHe said Pakistan’s interest was foremost, politics and political parties came later.\nHe said that due to the pragmatic policies and vision of the present elected representatives, development was the destiny of Pakistan.\n“The government is taking steps for the development of Pakistan and with the grace of Allah, it will out the country on the road to prosperity.\nAttaullah Tarar said that the minister for law and justice had shed light on the missing persons issue in detail.\nThe minister said that the families of martyrs who were victims of terrorist attacks had many reservations in this regard.\nHe recalled that in 2022, Iman Mazari had mentioned the name of one Naeem Rehmat as a missing person who was serving a life sentence in Landhi Jail in connection with a drug case in 2019 in a drug case.\nHe said that in 2011, the Supreme Court formed an inquiry commission about missing persons which sorted out 7900 cases out of 10,023 cases and now 23 percent of the cases were pending.\nHe said a cabinet Committee had been constituted on the issue and it will present proposals for solution of the matter.\nThe government had the intention to solve this problem, he said, adding that the previous government also worked on it, and the present government was also striving to settle the matter.\nReplying to questions of media persons, he said that names in Exit Control List (ECL) were added and removed on the recommendations of the Interior Division as per procedure.\nTo another question, he said that on Eid-ul-Fitr power tariff was cut by Rs 3.82 per unit to provide relief to the consumers.\nMoreover he said the government were cutting its expenditures and selling loss-making public sector entities.\nHe said the Federal Bureau of Revenue was being digitised and tax reforms were being introduced.\nHe said the present leadership which saved the country from default enjoyed the trust of the international community as it knew how to resolve the problems of the people.",
  "retrievedAt": "2025-08-11T02:03:12.378Z"
}
