{
  "title": "Rehmani slams Modi for irresponsible comments targeting Muslims",
  "link": "https://www.app.com.pk/national/rehmani-slams-modi-for-irresponsible-comments-targeting-muslims/",
  "date_published": "2024-04-23T17:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): Muhammad Farooq Rehmani, Chairman of the J&K People’s Freedom League, criticized Indian Prime Minister Narendra Modi’s characterization of Muslims as infiltrators and a financial burden on the Indian nation as extremely irresponsible, false, provocative, and disrespectful.\nQuoting from Modi’s public election gathering in Rajasthan, Rehmani observed that Indian Prime Minister Narendra Modi, known for fueling polarization and animosity along communal lines, has centered his attention on the main opposition parties of India and the Muslim community of the nation.\nReferring to Modi’s recent speech, Rehmani, former Convener of the All Parties Hurriyat Conference AJ&K Chapter, told APP that Modi alleges Hindu earnings support Muslim children, implying Muslims solely drive India’s population growth while hinting at a decline in the Hindu population.\nModi accuses the Congress party of favoring Muslims and warns the Hindu majority that only his reelection can resolve this matter.\nIn light of this dire situation, Rehmani called upon every Muslim or minority member of India, as well as citizens of Jammu and Kashmir, regardless of their current residence, to write letters to world leaders, Indian authorities, the UN, and other organizations, including human rights bodies.\nThe letters should focus on the urgent issue and urge these entities to intervene and pressure India’s leadership to halt the spread of hatred, the enactment of discriminatory laws against Muslims and other minorities in India, and the demographic changes in the Muslim-majority state of Jammu and Kashmir.\nRehmani emphasized that the sole aim of Modi and the BJP is to seize power and diminish the minority population, particularly Muslims, through extrajudicial killings and the implementation of new citizenship laws.\nHe described Jammu and Kashmir as a place of persecution for Kashmiri Muslims, citing its conversion into a union territory, alterations to longstanding residency laws, and the issuance of millions of domicile certificates to non-state Indians.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:02:42.967Z"
}
