{
  "title": "CPEC-II, an opportunity for private sectors to form joint ventures: PM",
  "link": "https://www.app.com.pk/national/cpec-ii-an-opportunity-for-private-sectors-to-form-joint-ventures-pm/",
  "date_published": "2024-04-23T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): Prime Minister Shehbaz Sharif on Tuesday said the 2nd phase of China Pakistan Economic Corridor (CPEC-II) offered an opportunity to the private sectors of both countries to form joint ventures.\nHe underscored that CPEC had contributed to Pakistan’s socio-economic development as well as the progress and prosperity of the peoples of two countries.\nHe hoped that the Phase-II of CPEC would result in more industrial, scientific and green development in the country.\nTalking to a high level delegation of the Chinese International Development Cooperation Agency (CIDCA), led by its Chairman Luo Zhaohui which called on him, the prime minister said China was Pakistan’s most trusted friend and appreciated China’s steadfast support to Pakistan.\nAcknowledging CIDCA’s pivotal role in bolstering Pakistan’s economic development, the prime\nminister specifically commended CIDCA for its vital support during the 2022 floods and for its relief, rehabilitation, and reconstruction efforts in Pakistan.\nEarlier, he also witnessed signing ceremony of four Memorandums of Understanding focusing on flood rehabilitation, information and communication technologies, Juncao Technology, China-Pakistan Development Cooperation Planning (2024-2028) alongside a Letter of Exchange on the establishment of a First Aid Centre in Balochistan, and Protocol on Cooperation in Human Resources Development under the Global Development Initiative.\nThese agreements signify the deepening cooperation between Pakistan and China across various sectors, a statement issued by the PM Office said.\nChinese Ambassador in Pakistan Jiang Zaidong, Federal Ministers for Foreign Affairs, Economic Affairs, Finance, Interior, Planning & Development, SAPM Tariq Fatemi and senior officials of Pakistan attended the meeting.",
  "retrievedAt": "2025-08-11T02:02:22.827Z"
}
