{
  "title": "UNICEF representative calls on Education Minister, discusses education sector challenges",
  "link": "https://www.app.com.pk/national/unicef-representative-calls-on-education-minister-discusses-education-sector-challenges/",
  "date_published": "2024-04-23T11:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): United Nations Children’s Fund (UNICEF) representative in Pakistan Mr. Abdullah A. Fadil called on the Minister of Federal Education and Professional Training Dr. Khalid Maqbool Siddiqui here on Tuesday and discussed the challenges being faced by the education sector of Pakistan.\nThe meeting was attended by Secretary Education Mr. Mohyuddin Ahmed Wani in addition with senior officials of the Ministry of Federal Education and Professional Training.\nFederal Minister Dr. Khalid Maqbool Siddiqui welcomed Mr. Abdullah A. Fadil and acknowledged the services of UNICEF in the education sector of Pakistan.\nHe appreciated the role of UNICEF in helping Pakistan in its bid to create equal access to quality education for the people of Pakistan.\nFederal Minister said that there is a dire need to address the issue of Out of School Children and the broader gap of access and quality of education on an emergency basis.\nDr. Khalid said that the ministry of education is working on a holistic plan to create a National Education Framework under which the federation and the provinces will be equal stakeholders.\nMinister said that this policy will be launched within a month and will bring all the stakeholders on the same page. He said that all the provinces along with donor partners will be taken on board to create a national consensus.\nDr. Khalid said that the primary goal is to drastically reduce the Out of School Children in Pakistan and that can only be done with a national, concerted and focused effort.\nSecretary Education Mr. Mohyuddin Ahmed Wani said that this seemingly insurmountable crisis can only be addressed if we can make the solution of the education crisis a corner stone of the broader narrative of economic progress.\nMr. Wani said that the federal government will pledge support for the underprivileged areas of the provinces such as slums to ensure broader inclusiveness under the National Education Policy.\nMr. Abdullah A. Fadil said that UNICEF has been present in Pakistan since 1948. He said that UNICEF supports efforts to increase access to quality education for all children in Pakistan, with a focus on marginalized and vulnerable populations. This includes initiatives to improve school enrollment, retention, and learning outcomes, as well as promoting inclusive and child-friendly learning environments.\nMr. Abdullah highlighted that UNICEF spent $150 Mn from 2018-2013 on its education program in Pakistan and that this budget has been increased to approximately $250 Mn for the next five years.\nMr. Abdullah said that the forum of Foundational Learning Alliance, which includes all the major donors in Pakistan, would be keen to join the concerted effort under the banner of the National Education Policy.\nDr. Khalid Maqbool said that the feudalisation of education needs to end. He said that it is high time that every Pakistani can attain his/her right to education irrespective of his/her background.\nHe said that access to quality education, teachers training, infrastructural and curriculum limitations are the greatest challenges that need to be prioritised.\nFederal Minister said that challenges of education cannot be addressed until the provinces and the federation work in unison.\nHe highlighted the importance of ensuring that all the stakeholders are on the same page and furthermore, own the direction taken by the federal government in resolving the current challenges of the education sector.\nMr. Mohyuddin Ahmed Wani said that the ministry of education has also launched a National Nutritional Strategy under which meals are being provided to under-privileged students in Islamabad; to ensure their attendance in schools.\nHe said that Early Childhood Development (ECD) is a key priority area whose scope needs to be expanded. UNICEF representative Mr. Abdullah A. Fadil acknowledged its importance and committed to launching a pilot project of ECD in Islamabad.",
  "retrievedAt": "2025-08-11T02:03:10.854Z"
}
