{
  "title": "EPA to hold public hearing of 132KV Grid Station’s EIA report",
  "link": "https://www.app.com.pk/national/epa-to-hold-public-hearing-of-132kv-grid-stations-eia-report/",
  "date_published": "2024-04-23T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): The Pakistan-Environmental Protection Agency (Pak-EPA) is going to hold public hearing of the environmental impact assessment (EIA) report of the construction of 132 KV Grid Station and its feeding transmission lines to be established at the Cabinet Division Housing Society at E-16 Sector of the federal capital on April 25 (1100 hours), Thursday at Margalla View Marquee.\nThe EIA Report public hearing is mandatory for any development project in the federal capital prior to seeking no objection certificate from the public development authority under the Pakistan Environmental Protection Act (PEPA) 1997 and Review of IEE/EIA Regulations, 2000. The general public, experts, civil society and media is encouraged to attend and participate in the consultative process.\nThe Islamabad Electric Supply Company (IESCO) under its 7th STD programme intends to install a grid station in the Cabinet Division Housing Society (CDHS), Islamabad to provide reliable supply of power to Roshan Pakistan, Dhok Doray, Dohk Pind Padian, Gulshan Sihat, Dhok Paracha, Engineers Housing Society, Farming Housing Society, Itifaq Housing Society, Sector D-12, Sangjani and Tarnol Islamabad, an official document available with APP stated these details.\nThe main purpose of the project was to increase the efficiency, reliability, and quality of the electricity supply to Rawalpindi and Islamabad. The CDHS has provided 32 kanals of land free of cost to establish the air insulated station (AIS) 132KV Grid Station that will have two kilometers long transmission line consisting of 14 poles.\nHowever, the estimated cost of the project is Rs 1,300 million that will be completed within a year. In case the project is implemented then it will incur heavy financial losses to IESCO and its consumers due to inconsistent power supply and repeated outages, whereas the implementation of the project will help reduce burden on the Company’s only grid station in the area vicinity.\nAs a crucial part of the environmental assessment, public consultation was held with the local masses that all supported the project and believed that it would usher eco-friendly development in the area and agreed that it would also address the rapid increase in electric load demand, need to increase efficiency, reliability, and quality of the electricity supply in the area, whereas the major concerns were of increased traffic congestions, over extraction of groundwater, sewage treatment plant, shrinking green spaces due to urbanisation projects, and solid waste management during construction and operational phase of the project.\nHowever, the project proponent in the EIA Report has proposed that issues like soil erosion would be mitigated during land clearing, levelling and grading. The excavated slopes would not be left untreated for prolonged durations and proper stabilising measures will be undertaken.\nMoreover, sceptic tanks would be constructed with soaking pits to contain domestic sewage of the contractor’s camp, whereas vertical SBR plants have been proposed for the operational phase, waste oils to be collected in drums and sold for the recycling alongwith other recyclable materials.\nThe EIA Report claimed that the project implementation would cause environmental impacts mainly during its construction phase that could be mitigated through the proposed activities mentioned above completely and effectively.",
  "retrievedAt": "2025-08-11T02:03:14.586Z"
}
