{
  "title": "Meo community’s vibrant heritage celebrated at Lok Virsa: Minister inaugurates new cultural diorama",
  "link": "https://www.app.com.pk/national/meo-communitys-vibrant-heritage-celebrated-at-lok-virsa-minister-inaugurates-new-cultural-diorama/",
  "date_published": "2025-08-03T14:37:12+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP):Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi on Friday inaugurated a new cultural diorama dedicated to the Meo community at the Heritage Museum, Lok Virsa, declaring it a symbolic step towards preserving Pakistan’s diverse cultural identity.\n\nAddressing the inauguration ceremony, the minister said the Meo community is a vibrant and integral part of Pakistan’s cultural landscape, and their rich heritage, resilience, and contributions to local traditions deserve celebration and preservation. He said this initiative reflects the government’s firm resolve to promote cultural inclusion and national unity through heritage platforms.\n\nThe minister announced that a new National Cultural Policy would soon be unveiled, with a clear objective to promote Pakistan’s soft image globally. “The policy aims to rejuvenate cultural and literary departments under the ministry and empower all communities, particularly those underrepresented,” he added.\n\nHe lauded Lok Virsa for consistently highlighting the stories of marginalized communities and congratulated the institute on its commitment to inclusivity. “Such creative platforms not only document living cultures but build national solidarity by honoring every thread in our cultural fabric,” he said.\n\nThe newly established Meo diorama, situated at the Pakistan National Museum of Ethnology, was made possible with the direct support and sponsorship of the Meo community, demonstrating meaningful community participation.\n\nThe event was attended by a large number of Meo community members, alongside Parliamentary Secretary Farah Naz Akbar, Secretary Asad Rehman Gilani, and cultural experts.\n\nThe celebration featured traditional Meo music and cuisine, turning the launch into a lively cultural festivity.\n\nSpeaking earlier, Dr. Muhammad Waqas Saleem, Executive Director of Lok Virsa, said, “This display is part of Lok Virsa’s mission of inclusive cultural representation. Every community in Pakistan has a story, and through such initiatives, we are determined to bring their stories into the national narrative. The Meo display is not just about preservation, rather it is about recognition, dignity, and pride.”\n\nHe added that the initiative aligns with Lok Virsa’s broader vision of “Community Development through Culture”, which focuses on empowering marginalized cultural communities by bringing their identities to public platforms such as museums and festivals.\n\nThe Pakistan National Museum of Ethnology plays a vital role in promoting national integration, intercultural harmony, and safeguarding intangible heritage, showcasing ethnological displays of all major communities and provinces of Pakistan.\n\nThe Meo community, tracing its ancestry to the Kshatriya Rajput clans, originated from the historic Mewat region—covering parts of Delhi, Agra, Alwar, Bharatpur, and Jaipur.\n\nKnown for their vibrant folk culture, distinct language (Mevati), colorful attire, agricultural traditions, and valiant resistance against invaders, the Meos accepted Islam early and remained committed to their indigenous identity.\n\nThey played a crucial role in the Battle of Khanwa (1527), where Raja Hasan Khan Mewati laid down his life alongside 12,000 soldiers, and they also fought in the 1857 War of Independence.\n\nAfter partition, the Meos migrated to Pakistan and are now spread across 43 districts, particularly in southern Punjab, Sindh, Balochistan, and Khyber Pakhtunkhwa, where they continue to contribute to the country’s cultural richness.\n\nThe newly inaugurated diorama now stands as a living tribute to the Meo community’s legacy, resilience, and cultural pride.",
  "retrievedAt": "2025-08-03T10:23:27.404Z"
}
