{
  "title": "Banks join push for electric vehicle expansion in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Aug 01 (APP): Pakistan’s transition to electric vehicles (EVs) may soon accelerate, thanks to a fresh push from the banking sector.\nTop officials from the State Bank of Pakistan and commercial banks have pledged support for new consumer financing options to make EVs more accessible to the public.\nAt a high-level consultative meeting held with the Ministry of Climate Change and Environmental Coordination (MoCC&EC), bank representatives committed to exploring practical financing schemes aimed at promoting EV adoption across the country.\nThe meeting was chaired by MoCC&EC Secretary Aisha Humera Moriani and attended by over 70 participants, including local EV manufacturers, importers, and senior representatives of the Pakistan Banking Association (PBA).\n“The banking sector must play a proactive role in offering attractive consumer financing plans,” said Secretary Moriani. “Without affordable options for households looking to switch to electric vehicles, progress will remain sluggish.”\nA key outcome of the meeting was the decision to form a joint working group consisting of representatives from banks, EV companies, and government stakeholders.\nThe group will develop actionable proposals for green financing schemes and explore mechanisms to encourage EV adoption at scale.\nPBA Chairman Zafar Masud, who is also the President of the Bank of Punjab (BoP), affirmed the banking sector’s commitment to supporting the government’s climate and mobility goals.\nHe cited the BoP’s recent collaboration with the Punjab government to distribute 18,000 motorcycles—including 5,000 electric bikes—to students through interest-free installment plans under the Chief Minister’s Youth Initiative.\n“The initiative has seen strong interest from students and parents and could be replicated in other provinces, including Sindh, Khyber-Pakhtunkhwa, and Balochistan,” Masud said.\nSecretary Moriani called on other provincial governments—particularly Sindh—to replicate Punjab’s approach in partnership with commercial banks. She also urged EV manufacturers to offer direct financing options modeled after banking schemes.\nThe meeting also highlighted broader regulatory steps under consideration.\nAmong them, imposing higher taxes on aging, fossil fuel-powered vehicles to discourage their use and make electric alternatives more competitive.\nOn the policy front, Director General MoCC&EC Muhammad Asif Sahibzada announced that Pakistan’s first Green Taxonomy Framework had been approved by the Economic Coordination Committee on July 25.\nThe framework provides a structured guide for environmentally sustainable investments, enabling financial institutions to channel funding into green projects such as EV expansion.\n“Banks can use the Green Taxonomy to roll out targeted green loan products that encourage EV adoption,” Sahibzada explained.\nUrban Affairs Director Muhammad Azim Khoso emphasized the health and environmental benefits of EVs, particularly in major cities like Lahore, Karachi, and Islamabad, which frequently rank among the world’s most polluted.\nHe pointed out that transportation is a leading source of pollutants such as PM2.5 and nitrogen oxides, which are linked to severe respiratory and cardiovascular conditions.\n“Electric vehicles produce zero tailpipe emissions. Their adoption can significantly improve air quality and reduce public health costs,” Khoso said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T19:35:56.435Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/banks-join-push-for-electric-vehicle-expansion-in-pakistan/",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T12:14:00.000Z"
}
