{
  "title": "Narrative of disintegrated PTI, nothing but pack of lies: Tarar",
  "author": null,
  "content": "ISLAMABAD, Aug 1 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Friday dismissed the narrative of the disintegrated Pakistan Tehreek-e-Insaf (PTI) as a pack of lies.\nIn reaction to the opposition’s Press Conference, the minister said their narrative had nothing to do with reality, absolutely based on lies, deceit and fraud.\nHe said those people who were betting on the country’s default are now stunned by the economic milestones achieved by Pakistan under the leadership of Prime Minister Shehbaz Sharif.\nThe current account surplus, the increase in foreign exchange reserves, and a decrease in inflation and petrol prices are the major cause of their frustration, he said, adding the opposition is wary of the Foreign Direct Investment in the country.\nHe also noted the daily rise in the stock market, which reflects investors’ confidence in the economy.\n“They are doing criticism just for the sake of criticism,” he said highlighting a pattern of the PTI’s actions aimed at undermining the success of country.\nCiting the upcoming visit of the Iranian President to Pakistan-a major milestone in Pakistan’s foreign policy, he said their press conference is aimed at sabotaging the high-level visit.\nThe PTI had the history of always siding with those who are hostile to Pakistan, he stressed.\nTarar said the trials of May 9 riots were conducted on merits and supported by the concrete evidence.\nThe videos showing ransacking and vandalizing of state installations and memorials of martyrs by the PTI goons are on the record.\nThe opposition’s outcry on this matter is baseless, as they have no real answer for their actions on the May 9, he said.\n“They have no policy, just a worn-out narrative,” he said, adding the opposition is trying all-out to deceive the nation.\nHe also directly addressed Mustafa Nawaz Khokhar, urging him to disclose his assets to the nation.\nTarar compared the current government’s foreign policy successes with the PTI’s tenure, which he said had left Pakistan isolated with poor relations with every other country.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T19:34:40.508Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/narrative-of-disintegrated-pti-nothing-but-pack-of-lies-tarar/",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T16:04:00.000Z"
}
