{
  "title": "PNCA, Nomad Gallery unveil 'From Surreal to the Real – A Spiritual Travelogue'",
  "link": "https://www.app.com.pk/national/pnca-nomad-gallery-unveil-from-surreal-to-the-real-a-spiritual-travelogue/",
  "date_published": "2025-08-03T20:01:52+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): Pakistan National Council of the Arts (PNCA), in collaboration with Nomad Gallery, inaugurated a unique art exhibition titled “From Surreal to the Real – A Spiritual Travelogue” at the National Art Gallery.Online art courses\n\nCurated by renowned artist and cultural advocate Nageen Hyat, the exhibition draws deeply from the timeless Sufi epic Saif-ul-Malook, presenting metaphysical themes through the lens of contemporary visual art.\n\nThe showcase transforms the romantic tale into a profound journey of the soul, reflecting themes of divine love, transcendence, and inner awakening.\n\nThe event was formally inaugurated by the Ambassador of Japan to Pakistan, AKAMATSU Shuichi, whose presence underscored the value of intercultural dialogue and artistic diplomacy.\n\n“This exhibition is a testament to the power of art to inspire and uplift us. I really enjoyed the journey through surrealism and the reality that the artists have created,” said Ambassador Shuichi.\n\nThe featured artists—Mehmood ul Hassan, Farrukh Shahab, Syed A. Irfan, Naila Hussain, Dr. Samina Zaheer, and Faisal Kuhzad—presented thought-provoking works in  painting and mixed media, each reflecting a personal interpretation of spiritual transformation, self-discovery, and metaphysical exploration.\n\nSpeaking at the occasion, curator Nageen Hyat remarked, “This exhibition was a reflection on the timeless journey of love—not merely romantic, but deeply spiritual. It captured the transformation of the self, the nation, and our collective inner worlds as we searched for truth beyond the visible.”\n\nDirector Visual Arts Division PNCA, Mariam Ahmed, thanked the chief guest and lauded the artists’ contributions, calling the collaboration with Nomad Gallery another milestone in PNCA’s mission to promote meaningful art.Online art courses\n\nAttended by diplomats, art lovers, students, and cultural figures, the exhibition offered a reflective space that resonated with viewers, connecting the spiritual essence of Saif-ul-Malook to Pakistan’s own societal and cultural evolution.\n\nThe exhibition is open for public viewing from August 03-08 at the National Art Gallery.",
  "retrievedAt": "2025-08-03T15:29:11.867Z"
}
