{
  "title": "Supreme Court’s CB judge points out ‘discrepancy’ in civilians’ court martial - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Naeem Akhtar Afghan, a member of the Supreme Court’s constitutional bench hearing cases related to the military trial of civilians, raised concerns on Thursday over an unusual discrepancy — the possibility of a civilian facing court martial under the Official Secrets Act (OSA) merely for entering a cantonment area to visit a shopping mall, food court, residency or attend a commercial event.\n\n“To say civilians become subject to the Pakistan Army Act (PAA) 1952 and could be tried by the military court if nexus is established for their role that affects the discipline of the armed forces is a very dangerous proposition,” feared Justice Afghan. Every cantonment area has been notified as prohibited area, he stated, but noted that for the welfare of soldiers, shopping malls — even private residency — have been established inside such areas.\n\nIn case a civilian tried to enter a cantonment area forcibly upon declining permission to do so, he may face cases under the OSA and could be tried by a military court, observed Justice Afghan.\n\nHeaded by Justice Amin­uddin Khan, the seven-judge CB has taken up 38 intra-court appeals moved by the governme­nts, Shuhada Forum Balo­chistan, etc, against the Oct 23, 2023 judgement.\n\nThis will be an anomalous situation since civilians trying to enter a cantonment area may not have a proper entry pass and may be denied entry by the security guards, he observed.\n\nAt this, Justice Jamal Khan Mandokhail recalled how he was not permitted to enter some cantonment area for not having a pass. He also recalled how civilians without entry passes face difficulty on a daily basis merely upon entering an area in Quetta where an ordnance facility exists.\n\nTo define nexus between a person and the country’s defence has a very wide connotation, observed Justice Mandokhail, also highlighting that institutions like parliament, Supreme Court, airports or railway stations also fall within the definition of prohibited areas.\n\nKhawaja Haris Ahmed on behalf of the defence ministry, however, argued that prohibited areas are always notified by the government for having work of defence, arsenal facility, wireless or signal station etc and that these were not general areas.\n\nEvery institution has a peculiar definition but the country’s defence is always related to the armed forces, he emphasised, adding that there were certain offences which were more serious. He pointed out that there were many statutes like the NAB law where the onus to prove innocence rests with the accused.\n\nTo an observation about the jail trial or trial by civilian courts through video links, he said many offenders were so dangerous that they cannot be tried in civilian courts.\n\nJustice Syed Hasan Azhar Rizvi reminded that there were many cantonments in Karachi but only Malir Cantt and the Creek area were prohibited for having sensitive installations. Even five or six judges live inside the Karachi cantonments which were not prohibited.\n\nFair trial\n\nJustice Mandokhail observed that the composition of court martial was something that raises concerns, especially after Article 10A which asks for fair trial. Even for the trial of the members of armed forces an independent forum should be established.\n\nThe real question is whether any court could be established which does not come under the ambit of Article 175(3) of the Constitution, Justice Mandokhail observed.\n\nThe counsel said there is no denying the fact that fundamental rights like Article 9, 25 or 203 will not be available to the accused facing military trials but the Constitution has created a clear exception which was also noted by the SC’s previous larger bench.\n\nIt is for the legislature to consider this aspect, especially in view of the warfare that has become complicated and left the armed forces in a state of war even during the peace time.\n\nThe counsel said that any threat to the armed forces’ state of preparedness by any civilian committing any of the offences under the OSA inevitably has the effect of preventing or impeding them in the proper discharge of their duties.\n\nIt is for this reason that the trials of such civilians fall squarely within the ambit of the PAA in the present case relating to members of the armed forces, that has been made to ensure the proper discharge of their duties. As such, where these civilians are accused of any of the offences falling under the provisions of Section 2(1)(d), the trial conducted against them takes place in terms of PAA and therefore, covered by Article 8(3)(a) of the Constitution, the counsel said.\n\nThe case will now be taken up on Tuesday.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:08:18.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903430/supreme-courts-cb-judge-points-out-discrepancy-in-civilians-court-martial",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:12:44.000Z"
}
