{
  "title": "Govt’s efforts have reduced circular debt by Rs9bn in 6 months, energy ministry tells NA - Pakistan - DAWN.COM",
  "author": null,
  "content": "The energy ministry on Friday informed the National Assembly in a written response that circular debt has declined “thanks to the government’s efforts”.\n\nThe ministry, in its response to the House’s request for details on circular debt, wrote that it had fallen by Rs9bn during the first six months of the current fiscal year.\n\n“By June 2024, circular debt stood at Rs2,393bn,” the energy ministry said. “By December, it had reduced to Rs2,384bn. Due to the government’s efforts, there has been a significant reduction in circular debt.”\n\nThe energy ministry added that the recovery of power distribution companies (Discos) has improved.\n\nIn addition to the reduced debt, the ministry presented some aspects of the government’s strategic roadmap for 2025-2029 in its response, which included initiatives like auditing distribution transformers to identify power loss, as well as real-time monitoring to pinpoint unauthorised consumption.\n\n“In order to identify localities with high power loss, a computerised energy audit of distributors and transformers will be carried out,” the response read. “An advanced metering infrastructure system will also be implemented for real-time monitoring and loss assessment to identify unauthorised consumption.”\n\nThe ministry added that this strategy required that all consumers have electricity meters, thus consumers without them would need to have them installed.\n\n“The strategy includes recovery action against defaulters who are permanently disconnected under the Land Revenue Act [and] and area bundle contractors will be installed in areas with high power theft,” the energy ministry wrote.\n\nThe ministry added that under the government’s strategy, tube wells would be solarised to reduce dependence on grid electricity and a recovery scheme would be introduced for local administrations and Discos to collect arrears.\n\nThe National Electric Power Regulatory Authority (Nepra) on Thursday approved a Rs1.71 per unit subsidy on average tariff for consumers of all distribution companies, including K-Electric, for three months (April to June). The government notified the reduction today.\n\nThe Rs58.6 billion subsidy would be funded through a Rs10 per litre petroleum levy on petrol and diesel imposed by the federal government on March 15.\n\nConfirming no reduction in base electricity tariff so far, the government last week conceded that an Rs1.90 per unit negative quarterly adjustment would fluctuate in line with the movement in interest and exchange rates, while Rs1.71 per unit relief against higher petroleum levy may continue into the next fiscal year.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:07:34.446Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903565/govts-efforts-have-reduced-circular-debt-by-rs9bn-in-6-months-energy-ministry-tells-na",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T14:12:13.000Z"
}
