{
  "title": "BHC reserves verdict on Mahrang’s release - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan High Court (BHC) on Thursday reserved its verdict on a petition seeking the release of Baloch Yakjehti Committee (BYC) chief organiser Dr Mahrang Baloch and other BYC activists who had been sent to jail under the Maintenance of Public Order (MPO) Ordinance.\n\nThe petition was filed by Nadia Baloch, the sister of Dr Mahrang, challenging the detention of the BYC leader and other activists. The petition was heard by a division bench comprising Acting Chief Justice Ejaz Ahmed Swati and Justice Muhammad Aamir Rana.\n\nSenior lawyers Kamran Murtaza, Ali Ahmed Kurd, Rehab Buledi, Khalid Kabdani and Sajid Tareen represented the petitioner. They contended that the arrests of Dr Mahrang and other BYC members were illegal and maliciously carried out. They urged the court to declare the arrests illegal and issue orders for their release.\n\nThe court directed the petitioner’s lawyers to submit a sworn affidavit in accordance with Article 5 of the Constitution. After this directive, the court took a 30-minute recess. When the session resumed, the lawyers submitted the required affidavit.\n\nAdvocate General Adnan Basharat raised several objections to the contents of the affidavit and requested the court to reject the petition. After hearing arguments from both sides, the court rese­rved its decision, which is expected to be announced within a day or two.\n\nSpeaking to the media after the hearing, Mr Murtaza expressed the hope for a favourable outcome. “We have completed our arguments and are hopeful for justice. In my opinion, the detention orders were not legally sound,” the JUI-F senator said.\n\nMr Murtaza claimed that the court had been provided with comprehensive legal grounds for the release of those detained.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:08:06.990Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903416/bhc-reserves-verdict-on-mahrangs-release",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:12:58.000Z"
}
