{
  "title": "Islamabad, Punjab IGs summoned in missing Afghan brothers’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Mohammad Asif of the Islamabad High Court on Thursday summoned the police chiefs of Islamabad and Punjab in a case concerning the disappearance of four Afghan brothers, who have been missing since January 2024.\n\nThe order was issued during a hearing on a petition filed by Afghan national Gul Seema, the mother of the missing individuals. The court expressed dissatisfaction with the performance of law enforcement agencies and raised questions about the lack of progress in the investigation.\n\nJustice Asif criticised the Islamabad and Rawalpindi police officials present in the court, stating, “If this had happened to you or me, then we would feel the pain. You people come (to court) and say, ‘we don’t know’. I was in Balochistan as well; there too they used to say the same thing…and then they (missing persons) would be recovered from there. How long will this chain (of events) continue?”\n\nThe judge acknowledged the emotional toll on the victims’ family, remarking, “Only the one who experiences it knows what it’s like.”\n\nPolice clueless about four brothers who went missing in Jan last year\n\nDuring the hearing, the mother of the missing persons became visibly agitated in court as the judge said the mother of the missing brothers had been coming to his court again and again.\n\nThe judge was told that those who were nominated in the First Information Report (FIR) had not even secured the pre-arrest bail from the court of competent jurisdiction. The lawyer of the petitioner informed the court that the family was not told the reason for taking the missing brothers into custody.\n\nHad they been involved in any anti-state activity, they should have been charged accordingly, he said, adding that the police failed to interrogate those whose faces were visible in the CCTV footage of abduction.\n\nThe court indicated its intention to form a joint investigation team (JIT) to probe the case and asked for suggestions on its composition. The petitioner’s counsel argued that despite compelling evidence — including clear video footage and named suspects — no arrests had been made even after ten months.\n\nThe lawyer stressed that the faces of the suspects were clearly visible in the footage and questioned why they had not been included in the investigation or summoned by the police for questioning.\n\nThe police officials responded by stating that all investigative avenues were being explored besides investigation about the SIM card ownership in this case. However, they were unable to provide a satisfactory explanation for the lack of arrests or progress.\n\nThe court expressed concern over the apparent inaction and directed that the police chief of the Islamabad and Punjab police appear before the bench in person. The judge emphasised that the top police officials must be fully aware of the actions of their subordinates and take responsibility for their actions. The court also hinted that it may summon other parties, including the secretaries, if needed for the recovery of the missing persons. The hearing was adjourned until April 16, when the IGs are expected to appear before the court.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:28:45.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903497/islamabad-punjab-igs-summoned-in-missing-afghan-brothers-case",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T04:10:39.000Z"
}
