{
  "title": "Gas utilities seek massive increase for FY26 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The two gas utilities — SNGPL and SSGCL — have sought about 42 and 144 per cent increase in the prescribed gas prices, respectively, to meet their revenue requirements for 2025-26.\n\nThe prescribed gas prices are revised twice a year under the law following determinations by the Oil and Gas Regulatory Authority (Ogra) on the basis of which the government sets the consumer gas prices for various categories. The government has committed to the International Monetary Fund (IMF) for timely biannual notifications of gas rates to avoid the build-up of circular debt.\n\nOgra has announced a public hearing on April 21 to consider Sui Southern Gas Company Ltd’s (SSGC) request for Rs2,543 per unit (million British thermal units or mmBtu) or a 144pc increase in its prescribed price. It demanded that the existing prescribed price notified by the government at Rs1,770 per mmBtu should be increased to Rs4,138 per unit for the next fiscal year.\n\nThe Karachi-based SSGCL estimated a Rs44bn shortfall to its revenue requirement of Rs385bn for the next fiscal year. However, it also claimed another “unrecouped” Rs499bn shortfall since 2022-23 and demanded that it be made part of the revenue requirement for next year, thus taking the total revenue shortfall to Rs543bn for FY26.\n\nSNGPL and SSGC petition Ogra for 42pc and 144pc increase; public hearings fixed for April 18 and 21\n\nIn addition, SSGCL has also demanded Rs32bn additional money on account of re-gasified liquefied natural gas (RLNG) cost of service, which is also separately notified on a monthly basis by Ogra. The regulator has highlighted that the company has already lost its exclusive supply rights in Sindh and Balochistan under its existing licences but demanded Rs1.5bn additional funds for laying 178km of main distribution lines.\n\nSui Northern\n\nThe public hearing for Sui Northern Gas Pipeline Ltd (SNGPL) request for a hike of 41.58pc or Rs736 per mmBtu has been called on April 18. The company demanded the existing prescribed price of Rs1,770 per mmBtu be increased to Rs2,486 next fiscal year.\n\nThe Lahore-based SNGPL claimed a Rs207bn shortfall to its Rs700bn revenue requirement for the next fiscal year. It also demanded a previous unrecouped revenue shortfall of Rs478.5bn, thus putting the total revenue shortfall at Rs686bn for 2025-26. On top of that, the SNGPL has also claimed Rs70bn additional cost on account of RLNG at the rate of Rs318 per mmBtu.\n\nThis is despite the fact that SNGPL has claimed a reduction in sales volumes mainly because of increased gas rates over the past two years, making it unaffordable to consumers, but now wanted a further increase in the prescribed prices.\n\nIt projected a shortfall in revenue requirement for 2024-25 at Rs20.582 billion, including Rs489 million on account of the LPG Air mix Project, seeking an increase in its average prescribed price by Rs64.16 per mmBtu.\n\nThe company said it had included the cost of RLNG diverted volumes to indigenous gas consumers as part of the cost of gas in light of the ECC decision ratified by the Federal Cabinet on Oct 30, 2023. The cost of gas is linked to the international prices of HSFO and Crude Oil/Brent by the agreements signed between the Federal Government and the gas producers/suppliers.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:08:06.938Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903398/gas-utilities-seek-massive-increase-for-fy26",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:13:04.000Z"
}
