{
  "title": "Balochistan politicians chide Mengal over his criticism of PPP - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The provincial leadership of PPP has strongly condemned the remarks of BNP leader Sardar Akhtar Mengal against their party and expressed support for the Balochistan chief minister.\n\nThe PPP leaders said their party’s government in the province was determined to utilise all available resources to eliminate terrorism and maintain peace.\n\nSpeaking at a joint press conference along with the Balochistan government spokesman Shahid Rind on Thursday, provincial ministers Mir Sadiq Umrani, Bakht Muhammad Kakar, Ali Madad Jattak, and Deputy Speaker Ghazala Gola and other PPP leaders expressed their firm support for CM Sarfraz Bugti’s developmental efforts.\n\nThey reaffirmed the PPP’s unwavering commitment to eradicating terrorism and upholding democratic values.\n\nSay provincial govt committed to eradicating terrorism from province\n\nThey claimed CM Bugti was “working tirelessly” for the province’s development and that the PPP has never engaged in cowardly politics.\n\n“We have always made sacrifices for the strengthening of democracy and never ran away.”\n\n“PPP has always fought against terrorism and continues to do so,” Mr Umrani said.\n\nHe also challenged Mr Mengal to contest an election against the PPP, claiming the party could win from Mr Mengal’s constituency.\n\nMr Umrani criticised Sardar Mengal’s statements during the ongoing protest in Luckpass, calling it “baseless and highly inappropriate”.\n\nHe said the legacy of PPP founder Zulfikar Ali Bhutto should not be disrespected.\n\n“Akhtar Mengal should refrain from using such language in future protests,” Mr Umrani warned.\n\nHe also claimed that despite holding multiple government positions in past governments, Mr Mengal failed to deliver any real development, even in his hometown of Wadh.\n\nMr Kakar, the provincial minister for health, accused the BNP of “exploiting the name of a Baloch woman to preserve its political image”.\n\nHe also condemned Mr Mengal’s statement, calling it “unacceptable and unworthy of serious political discourse”.\n\nEx-PM Benazir Bhutto sacrificed her life for Pakis­tan as these matters are above petty politics, Mr Kakar.\n\nHe added that the government “will not be blackmailed by such tactics”.\n\n“We reject these statements and the language used against our leadership.”\n\nHe said Mr Mengal was “rattled” because his political standing is “collapsing”.\n\nThe PPP ministers and provincial leaders reaffirmed their commitment to Balochistan’s peace, progress, and political integrity.\n\nThey vowed to “expose and resist those they accuse of exploiting the province for political gain”.\n\nThe PPP representatives reiterated that backdoor negotiations were ongoing to peacefully resolve BNP’s sit-in at Luckpass.\n\nThe government remained focused on peace, development, and the welfare of the people of Balochistan, the PPP leaders said.\n\nMr Mengal has been holding a sit-in for over 10 days to seek the release of BYC leader Mahrang Baloch and other female activists arrested by the police.\n\nHe rejected government proposals to end the protest and provide an alternative location in Quetta for the demonstration.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f867e38bd95.gif",
  "retrievedAt": "2025-10-12T02:28:36.978Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903421/balochistan-politicians-chide-mengal-over-his-criticism-of-ppp",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:12:58.000Z"
}
