{
  "title": "Fact check: Alleged quote attributed to CM Gandapur disparaging Imran Khan in media interaction is fake - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users on social media platforms X and Facebook since April 4 shared a video of Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur’s interaction with a reporter, claiming that he disparaged PTI founder Imran Khan. However, the chief minister made no such comment and the quote was misattributed to him.\n\nInfighting within the PTI has intensified in recent days, with more leaders calling for an inquiry against CM Gandapur for terming them “conspirators”. He has also been increasingly criticised by party supporters and leaders for lack of progress in securing Imran’s release and for the KP government’s policies.\n\nOn April 4, a pro-PML-N user posted a clip from news outlet Azaad Digital of CM Gandapur from a media interaction.\n\nThe post attributed the following alleged quote to the chief minister in his response to journalists: “Imran Khan has no worth; whatever needs to be done, I will do it. Talking about Imran Khan is pointless.”\n\nIt claimed that the KP CM did not let journalists talk about Imran and kept the focus on himself.\n\nThe post was viewed 92,800 times.\n\nThe same claim, along with the video, was also shared on Facebook here and here, with 10,000 and 2,500 views, respectively.\n\nA fact-check was initiated to determine the veracity of the claim due to its virality and the public’s keen interest in the PTI’s internal affairs, including its recent ongoing internal conflicts.\n\nA reverse image search led to a post on the Facebook page of Azaad Digital, dated April 4, 2025, which featured a clip of CM Gandapur speaking to the media.\n\nThe post’s caption read, “KP Chief Minister Ali Amin Gandapur became upset at a question from Azaad Digital reporter Owais Ali.”\n\nThe same clip was also found on Azaad Digital’s TikTok page, accompanied by the same caption.\n\nIn the clip, the reporter attempts to ask the chief minister about his remarks about some PTI leaders being “conspirators” to which Gandapur said it was not the right time or occasion for the question.\n\n“This issue is not that important that I discuss it. An important talk is being held and I want to remain limited to that. This, in my view, is an unimportant thing … I don’t think this is the time for us to talk on this topic, this is not an important topic.”\n\nIn the 58-second video, CM Gandapur did not say remotely anything similar to the alleged quote attributed to him. Furthermore, a keyword search to check for any news report covering the alleged quote also did not yield any results or other video in which CM Gandapur might have uttered the alleged statement attributed to him.\n\nTherefore, the fact-check determined that the claim that a video shows CM Gandapur disparaging Imran in an interaction with the media is false. The alleged quote attributed to Gandapur about Imran is fake and he said no such thing in the circulating video.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ and UNDP.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:07:34.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903353/fact-check-alleged-quote-attributed-to-cm-gandapur-disparaging-imran-khan-in-media-interaction-is-fake",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T13:38:29.000Z"
}
