{
  "title": "Terror main hurdle to better ties, Kabul told - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan on Thursday reminded Afghanistan that terrorism remains a major impediment to improving bilateral relations, amid ongoing concerns over militant sanctuaries across the border.\n\n“We have been trying to improve relations but the major roadblock, of course, remains the security situation and the sanctuaries enjoyed by terrorists,” Foreign Office spokesman Shafqat Ali Khan told reporters at the weekly media briefing.\n\nMr Khan made the comments while responding to a question about the anticipated meeting of the Pakistan-Afghanistan Joint Coordination Committee (JCC), a forum both countries had agreed to reconvene as part of efforts to strengthen trade and economic cooperation.\n\nHe declined to provide a date for the JCC meeting, saying: “We will share information once more concrete things are available.”\n\nPakistan’s Special Represen­tative for Afghanistan Amb Muhammad Sadiq visited Kabul last month where both sides agreed to sustain engagement on key issues including security, trade, and refugees.\n\nOne of the key understandings reportedly reached during the visit was to hold the JCC meeting before mid-April. Afghan Commerce Minister Nooruddin Azizi was also expected to visit Islamabad after Eid.\n\n“Special Representative’s visit to Kabul was very successful and certain understandings have been reached in terms of the follow-up action,” Mr Khan said, noting progress in bilateral discussions.\n\nHowever, tensions have remained high. Speaking at a recent seminar hosted by a think tank, Amb Sadiq warned that “all deals with Afghanistan are off if the Taliban authorities fail to address Islamabad’s” mounting concerns about terrorism emanating from Afghan territory.\n\nMr Khan avoided commenting directly on Amb Sadiq’s statement, saying he had not seen it.\n\nSince the Taliban returned to power in August 2021, terrorism has emerged as a growing source of strain between the two countries. Pakistan has accused the Taliban of allowing militant groups, “especially the Tehreek-i-Taliban Pakistan (TTP)” to operate from Afghan soil, intensifying cross-border attacks and undermining diplomatic efforts.\n\nIslamabad, once hopeful that a Taliban-led Afghanistan would bring a more cooperative regional partner, has since grown wary as militant activity has surged. The lack of action against these groups has led to repeated diplomatic friction and cast a shadow over economic and security collaborations.\n\nIndia’s Waqf Act\n\nThe FO also rejected India’s recently passed Waqf (Amendment) Bill, 2025, describing it as a discriminatory move that infringes on the religious and economic rights of Indian Muslims and could deepen their marginalisation.\n\n“About Waqf Amendment Act, we strongly believe it is an infringement over the religious and economic rights of Indian Muslims,” the FO spokesman said. “Particularly the act usurps the property rights of Muslim community, and could potentially dispossess them of a number of mosques, shrines and other holy places.”\n\nHe added that the new legislation would “certainly undermine the Muslims’ management and control of their properties endowed for different religious and charitable purposes.”\n\nThe remarks come as India’s parliament earlier this month approved the Waqf (Amendment) Bill, which is now awaiting presidential assent. The law, which governs the management of Waqf properties “Muslim religious endowments” has drawn sharp criticism from Muslim leaders and opposition lawmakers who say it threatens religious autonomy.\n\nThe legislation mandates financial audits for Waqf institutions with annual incomes exceeding 1 lakh Indian rupees, lowers the mandatory contributions to Waqf Boards from 7 per cent to 5pc, and introduces a centralised digital portal for property oversight.\n\nIt also calls for the inclusion of Muslim women and non-Muslims in the Waqf Board management.\n\nCritics argue that the bill amounts to an unconstitutional overreach and could pave the way for state interference in religious affairs.\n\n“The passage of this discriminatory legislation is also reflective of the growing majoritarianism in India,” Mr Khan said. “There are serious apprehensions that it will contribute to further marginalisation of Indian Muslims.”\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:08:19.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903432/terror-main-hurdle-to-better-ties-kabul-told",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:12:43.000Z"
}
