{
  "title": "PTI submits motion against canals after ‘briefest sitting’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Nati­onal Assembly held one of the briefest sittings on Thurs­day, which was adjourned without transacting any business.\n\nPTI’s Iqbal Afridi pointed out a lack of quorum before Question Hour could even start. The deputy speaker, who was presiding over the session at the time, ordered a count and adjourned the proceedings for 15 minutes after finding the House not to be in order.\n\nThe quorum problem persisted even when the sitting resumed after a break and the House was adjourned to meet again today (Friday) at 11 am.\n\nSeparately, the PTI submitted a resolution in the National Assembly against the construction of six canals on the Indus river. The draft of the resolution was submitted to the speaker’s office by Omar Ayub, Zartaj Gul and Ali Muhammad Khan.\n\nThe resolution demanded that the “construction of the Cholistan canal project should be suspended until the approval by the Council of Common Interests (CCI). It demanded within two weeks as well as an audit regarding the water availability within 60 days.\n\nThe PTI also stressed the need to direct the financial benefits from minerals and other resources tow­ard ensu­ring development in Balo­chistan and KP, especially the merged districts.\n\nPTI Central Informa­tion Secretary Sheikh Waqqas Akram emphasised that only an inclusive and equitable Pakistan can progress.\n\nHe stated that the Pakistan Minerals Investment Forum highlighted the discovery of hydrocarbons in KP and gold and copper deposits in Balochistan, yet there was no clear policy to ensure that these resources translated into prosperity for the local population.\n\nRegarding the canal project, he stated that the PML-N and PPP were playing a game of ‘cat and mouse’, as the project was launched allegedly with the tacit approval of President Asif Ali Zardari.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:28:37.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903420/pti-submits-motion-against-canals-after-briefest-sitting",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T01:12:58.000Z"
}
