{
  "title": "KP CM aide rules out possibility of giving mines’ control to Centre - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The adviser to chief minister for finance, Muzammil Aslam, here on Thursday ruled out the possibility of giving control of mines and minerals in Khyber Pakhtunkwa to federal government.\n\nHe said that the law was not against the province’s interests as mines and minerals were provincial subject. He added that bills were always amended and the same was amended last year and royalties were increased by 400 per cent.\n\n“The chief minister is challenging federal government on National Finance Commission award and net hydel profit. Do you believe we will give [mines and minerals] away? Over our dead bodies,” Mr Aslam told a news conference.\n\nHe claimed that there was nothing wrong in the bill but even if there was, it would be addressed as the bill was under discussion in provincial assembly. He said that about 3,500 mines in the province were still non-operational for different reasons.\n\nANP and QWP vow to oppose proposed mines and minerals law\n\nMr Aslam said that memorandums of understanding signed in the mines and minerals conference were not something concrete about investment. He said that KP was hub for mines and minerals, which could boost its economy.\n\nHe said that no foreigner could travel to the province owing to restrictions and the condition of obtaining a ‘no objection certificate’ from federal government. He said that provincial government found an operating partner for Miran oil block and the exploration would begin within a year.\n\n“A huge revenue is coming to the province in mines and minerals and a regulatory force is suggested to stop illegal activities,” he said. He said that there were several differences between federal and provincial governments and despite having no footprint [in Islamabad] due to the difference, KP got Rs27 billion in net hydel profit. “Although, they [federal government] owes us more, we receive Rs3 billion monthly,” he added.\n\nThe adviser said that provincial government created an impact of Rs250 billion and the province crossed the target of surplus budget by increasing tax and non-tax revenue by 49 per cent.\n\nHe also said that royalties [to districts] with natural resources would be cleared before June 30. He said that provincial government contested the case of province and tribal districts in NFC conference.\n\nHe said that the province would increase non-tax revenue through five sectors including mines and minerals, forest, tourism, trade corridor and electricity.\n\nMeanwhile, Awami National Party (ANP) has rejected the proposed Khyber Pakhtunkhwa Mines and Minerals Act, 2025, terming it an infringement on the province’s resources and autonomy.\n\nAccording to a statement, ANP provincial president Mian Iftikhar Hussain presided over meeting of the party’s provincial cabinet at Bacha Khan Markaz and said that the Act would violate the spirit of provincial autonomy. He said that it would also contradict 18th Amendment.\n\nHe said that the proposed law allowed federal government and non-provincial institutions to dominate Khyber Pakhtunkhwa’s mineral resources. He said that 18th Amendment ensured provincial autonomy and any attempt to alter it would be against interests of the country.\n\nHe said that ANP would resist the Act on all fronts. “If the bill is not withdrawn, ANP will consider judicial action after consulting with legal experts,” he added.\n\nMr Hussain said that Khyber Pakhtunkhwa Mines and Minerals Act, 2017, was a comprehensive law regulating mining procedures and practices in the province.\n\nAlso, Qaumi Watan Party (QWP) provincial chairman Sikandar Hayat Khan Sherpao on Thursday opposed the proposed amendment to Khyber Pakhtunkhwa Mines and Minerals Act 2025 and called it an infringement on provincial autonomy and a violation of the spirit of 18th Amendment.\n\nHe was speaking at a meeting of party workers here to review the proposed legislation. He expressed serious concern over federal government’s role in a matter he described as purely a provincial subject.\n\n“There is absolutely no room for federal involvement in this domain,” he said, adding that any attempt to give federal government a role in provincial resources was tantamount to undermining the rights of the province.\n\nDuring the meeting, various aspects of the proposed law were examined. The party rejected the legislation, stating that the notification of minerals also fell under provincial jurisdiction.\n\nSikandar Sherpao termed the bill a conspiracy to erode the province’s authority over its own resources and stated that even in the past, when the federation had no role in such matters, provinces were still not granted full rights.\n\nHe said that if the proposed law was enacted, responsibility of any injustice to Khyber Pakhtunkhwa would rest with provincial government and those parliamentarians, who supported it.\n\nCriticising provincial government, Sikandar Sherpao said that it appeared the PTI rulers were incapable of safeguarding province’s resources and were willing to sacrifice public interests for personal gains.\n\nHe reaffirmed QWP’s stance against involvement of federal government in provincial affairs and pledged to resist any such move. “Only the people of Khyber Pakhtunkhwa have the right to their mineral resources,” he asserted, adding that any form of external dominance or interference would not be tolerated.\n\nPublished in Dawn, April 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:28:55.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903513/kp-cm-aide-rules-out-possibility-of-giving-mines-control-to-centre",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T04:26:09.000Z"
}
