{
  "title": "Asean opts for constructive engagement over US tariffs - World - DAWN.COM",
  "author": null,
  "content": "The 10-member Association of Southeast Asian Nations (Asean) has decided not to retaliate against the United States’ announcement of reciprocal tariffs, choosing instead to engage in constructive and forward-looking discussions to tackle emerging challenges.\n\nThis decision follows a special Asean economic ministers meeting with Timor-Leste and the Asean secretary general on Thursday in Kuala Lumpur.\n\nThe meeting acknowledged the warning from the World Trade Organisation (WTO) director-general regarding the significant risks posed by trade tensions between the US and China, which could potentially reduce global real GDP by nearly 7 per cent in the long term.\n\n“In reaffirming Asean’s commitment to open and inclusive economic cooperation, the ministers underscored the region’s support for a predictable, transparent, non-discriminatory, free, fair, inclusive, sustainable, and rules-based multilateral trading system, with the WTO at its core,” a statement issued by the Malaysian Investment, Trade and Industry Ministry read.\n\nAsean and Timor-Leste unanimously rejected the US’ basis for calculating reciprocal tariffs, which range from 10pc to 49pc, emphasising the profound impact these tariffs could have on Asean’s economic growth and regional integration efforts.\n\n“These tariffs will be regressive to Asean’s regional economic integration efforts built on a rules-based system, since its establishment in 1967,” the ministry added.\n\nThey also agreed that US President Donald Trump’s 90-day pause on reciprocal tariffs, while applying a baseline tariff of 10pc, provides an opportunity to find a pragmatic and mutually beneficial solution for Asean.\n\nThe outcomes of this meeting will be presented at the Special Asean Leaders’ Meeting to address and mitigate potential disruptions to regional trade, supply chain networks, and cross-border investments.\n\nThe Malaysian government will continue to engage with the US to find an amicable and fair solution to the reciprocal tariff issue, the statement added.\n\nAdditionally, the meeting agreed to establish the Asean Geoeconomics Task Force to discuss and formulate a coherent regional policy response to emerging economic and geopolitical challenges by identifying key risks and opportunities.\n\nThis initiative aims to strengthen the region’s strategic positioning, resilience, and relevance in an increasingly complex global landscape, the ministry said.\n\nThis story was originally published in The Star, an ANN partner of Dawn.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/111320033970bf3.jpg",
  "retrievedAt": "2025-08-25T14:07:37.791Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903538/asean-opts-for-constructive-engagement-over-us-tariffs",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T11:22:36.000Z"
}
