{
  "title": "AI platforms such as ChatGPT and DeepSeek can enhance judicial efficiency: SC - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Supreme Court on Friday issued its judgement on the use of artificial intelligence (AI) in the judicial system, saying it can enhance efficiency but “must be welcomed with careful optimism”.\n\nThe judgement was issued on a case heard on March 13 by Justices Aqeel Ahmed Abbasi and Mansoor Ali Shah, with the latter pronouncing his judgement today, a copy of which is available with Dawn.com.\n\n“There is an urgent need to examine the systemic causes of such delays and to devise innovative court and case management systems, particularly at the level of the district judiciary, where the bulk of such disputes originate and where the pressure of case pendency is most acutely felt,” Justice Shah wrote in his judgement.\n\nHe called the use of AI a “promising path to operational reform, provided its adoption remains grounded in principled constitutional limits.\n\n“Within this constitutional framework, the thoughtful adoption of AI can serve as a viable instrument for access to timely justice and alleviating systemic backlogs.”\n\nJustice Shah went on to say that judges around the world have been interested in the use of AI platforms such as ChatGPT, Copilot and DeepSeek, and that “the promise and potential of AI to enhance the efficiency and working of the justice system cannot be ignored any longer”.\n\n“AI, when deployed within principled boundaries, holds significant potential to enhance judicial and institutional productivity and efficiency,” the judgement read.\n\n“Its role is not to replace human adjudication but to supplement and support judicial functions, particularly in areas where judges themselves build expertise.”\n\nThe judgement noted that AI can be used in smart legal research, language precision and drafting, comparative jurisprudence, decision making support, and consistency and coherence.\n\n“The allocation of cases within judicial systems is a foundational element of procedural fairness, and courts worldwide are increasingly adopting AI-driven frameworks to eliminate discretion, reinforce transparency, and prevent manipulation,” it added.\n\nAlthough AI may yield significant advantages its adoption likewise generates pressing ethical considerations that necessitate rigorous examination, the judgement noted.\n\n“Therefore, the responsible use of AI in judicial systems must be grounded in a robust framework of constitutional, ethical, and international legal principles.”\n\nThe judgement acknowledged that the right to a fair trial before a competent, independent, and impartial judge is a fundamental principle of due process, and that AI “must not overshadow the core guarantee of judicial autonomy.”\n\n“While AI has the potential to improve consistency and efficiency in legal processes, it also carries the risk of introducing biases and limiting judicial discretion,” it continued.\n\n“It must be unequivocally affirmed that AI is not, and must never become, a substitute for judicial decision-making.\n\n“While AI may process data and identify legal patterns, it lacks the capacity for compassion, ethical discernment, and the nuanced understanding of human suffering,” it noted.\n\n“The courtroom is not a site for algorithmic governance but a space for reasoned, principled deliberation, attentive to both legal nuance and the lived experiences of litigants,” Justice Shah’s observed in the judgement.\n\nNoting the serious limitations of AI, the judgement said that “for any justice system to remain fair and just in the age of AI, certain core universal values must be preserved as non-negotiable ethical foundations.”\n\nHuman dignity and compassion must remain central, and “fairness and anti-discrimination principles must be hardwired into AI systems to prevent the replication of historical biases, guaranteeing equal treatment under the law.”\n\n“The system must preserve space for restorative justice and rehabilitation, recognizing that punishment should serve societal healing rather than mere efficiency,” the judgement said.\n\n“In sum, AI must be welcomed with careful optimism. It can streamline judicial functions, reduce delays, and expand access to legal knowledge. But it cannot replicate the moral, ethical, and empathic reasoning that lies at the heart of judging.”\n\nCourts must thus pursue a calibrated integration harnessing AI’s efficiencies without surrendering the conscience, independence, and humanity that justice demands, the judgement noted.\n\nThe Supreme Court strongly recommended that the National Judicial (Policy Making) Committee in collaboration with the Law and Justice Commission of Pakistan considers developing comprehensive guidelines on the permissible uses of AI within the judiciary.\n\n“These must delineate clear boundaries, ensuring that AI is used only as a facilitative tool and never in a manner that compromises human judicial autonomy, constitutional fidelity, or public trust in the justice system,” the judgement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/11144102a23981a.jpg",
  "retrievedAt": "2025-08-25T14:07:37.143Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903540/ai-platforms-such-as-chatgpt-and-deepseek-can-enhance-judicial-efficiency-sc",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T09:42:08.000Z"
}
