{
  "title": "Ashrafi vows launching vigorous campaign to respect sacred religious personalities of all religions",
  "link": "https://www.app.com.pk/national/ashrafi-vows-launching-vigorous-campaign-to-respect-sacred-religious-personalities-of-all-religions/",
  "date_published": "2021-06-30T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP): Special Representative to the Prime Minister on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi Wednesday announced to launch a vigorous campaign to promote interfaith harmony and respect for sacred personalities of other religions.\nTalking to media persons, he said the campaign titled ‘Let Live Peacefully and Respect other Religions,’ set to launch on upcoming Friday from a Lahore Church, was aimed to persuade all and sundry to respect the sanctity of sacred personalities of all religions and beliefs of different school of thoughts.\nIn the campaign the notables of all religions including Sikhs, Hindus, others and Ulema, religious scholars belonging to all school of thoughts would persuade respecting the sacred personalities of all religions and faith of followers of all sects and disseminate the message that we must not insult the beliefs and faiths of other religions.\nHe said efforts were underway to expand peace committee to gross root level for maintaining peace and harmony during the sacred months of Muramm-ul-Harram by inducting the new and active people in these peace committees to make them more effective.\nHe stressed the people will be told that no religion allows anyone to insult other religion.\nHe said some people shared objectionable contents on social media without bothering about the sensitivity of the blasphemous contents which hurt the followers of other religions, consequently vitiating the atmosphere and creating unrest in the country.\nHe said Pakistan wanted peace in Afghanistan. Pakistani Ulema, religious scholars jointly appealed all Afghan groups to resolve their issues by holding negotiations.\nA conference hosted by Pakistan Ulema Council (PUC) of Ulema and religious scholars would be convened in Islamabad on Wednesday (July 7) to discuss various issues.",
  "retrievedAt": "2025-08-11T20:54:29.939Z"
}
