{
  "title": "Forces wishing to undermine unbreakable bond between armed forces, nation bound to fail: COAS",
  "link": "https://www.app.com.pk/national/forces-wishing-to-undermine-unbreakable-bond-between-armed-forces-nation-bound-to-fail-coas/",
  "date_published": "2021-06-30T18:31:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 30 (APP): Chief of Army Staff (COAS) General Qamar Javed Bajwa Wednesday said a well-equipped, trained and motivated army having unwavering support of its people could surmount any challenge.\nHe, addressing the National Defence University (NDU)’s participants of National Security and War Course (NSWC) – 21, emphasised that the forces that wished to undermine the unbreakable bond between armed forces and the nation were bound to fail, said an ISPR news release.\nThe army chief visited NDU, Islamabad and addressed participants of the NSWC–21.\nSpeaking on the occasion, he dilated upon the evolving strategic and regional environment.\nPakistan stands for peace within and all around, as it looks forward to acting as a bridge between regions, the COAS said.\nExpounding on Pakistan’s support to Afghan Peace Process, he said spoilers of peace in Afghanistan risk regional instability.\nExpressing resolute support to the people of Indian Illegally Occupied Jammu and Kashmir, the COAS stressed upon a peaceful and durable solution of Kashmir issue in line with relevant United Nations resolutions and aspirations of Kashmiri people.\nSharing his vision of Pakistan Army, he underscored the need for continuous evaluation of existing doctrine and corresponding strategy to effectively deal with the evolving threats in various domains.\nHe termed professionalism, competence and devotion to duty as hall mark of Pakistan Army and emphasised on realistic and futuristic training for maintaining perpetual operational readiness.\n“Force modernization and induction of advanced technologies are imperative for maintaining qualitative edge over adversary,” he remarked .\nCongratulating the participants on successful completion of their course, the COAS advised them to stay focused on attaining professional excellence while remaining abreast with revolutionary advancements in warfare which are redefining national security.\nEarlier on arrival, the COAS was received by NDU President Lieutenant General Muhammad Saeed.",
  "retrievedAt": "2025-08-11T20:54:27.004Z"
}
