{
  "title": "Foreign pilgrims can use Hajj smart card for teller services in Saudi Arabia",
  "link": "https://www.app.com.pk/national/foreign-pilgrims-can-use-hajj-smart-card-for-teller-services-in-saudi-arabia/",
  "date_published": "2021-06-30T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP): The foreign pilgrims would be able to use their Hajj smart cards for teller services in Saudi Arabia during Hajj season in the year 2022 (next year).\nThe card will allow pilgrims coming from abroad to transfer money from their bank accounts in their respective countries, Saudi Gazette reported.\nThe smart card will enable the pilgrims to use it as a payment card to buy things in the Kingdom as it will be operational on Saudi Arabia’s Mada network.\nForeign pilgrims can benefit from these services until next year’s Hajj, as this year’s Hajj is restricted to only domestic pilgrims. The new facilities and services will be available on the smart card in the second phase of its implementation featuring added services.\nThe smart card was used during the Hajj season of 2019 on an experimental basis, with the distribution of 50,000 cards among a section of pilgrims.\nThe Saudi Arabia Ministry of Hajj and Umrah launched the first phase of the smart card in December 2020 and it will be activated for the first time, covering all pilgrims during the upcoming Hajj season.\nThe first phase linked operations and services of all sectors under the ministry. Major features of the first phase included the issuance of smart identification cards for each pilgrim containing his personal, medical and residential information.\nThe smart card would be instrumental in guiding pilgrims to their accommodation at the holy sites and enables them to have access to various facilities and services. It will also be instrumental in preventing illegal Hajj pilgrimage.\nThe card is considered to be one of the outcomes of Vision 2030 initiatives, and the implementation of the initiative proved to be a successful model for the application of technologies in serving pilgrims.\nThe smart card operates by means of Near-field communication (NFC), which is a short-range wireless connectivity technology that lets NFC-enabled devices to communicate with each other.\nIt also enables the card to be read through the Kiosk self-service devices deployed at the holy sites, and the card contains a barcode that is read by workers to know the pilgrim’s data. The card will be administered through a unified center to control all services.",
  "retrievedAt": "2025-08-11T20:54:35.026Z"
}
