{
  "title": "Concept of cooperative Federalism must be practiced to achieve harmony: Dr Fahmida",
  "link": "https://www.app.com.pk/national/concept-of-cooperative-federalism-must-be-practiced-to-achieve-harmony-dr-fahmida/",
  "date_published": "2021-06-30T17:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP): Minister for Inter-Provincial Coordination (IPC) Dr. Fehmida Mirza on Wednesday said, the concept of Cooperative Federalism must be practiced to achieve the desired goal of harmony among the federation and provinces.\nHe made these remarks while participating in the Senate Standing Committee on Inter-provincial coordination which held here under the chairmanship of Senator Mian Raza Rabbani.\nRaza Rabbani in his introductory remarks highlighted the importance of IPC Ministry as envisaged by the framers of the 18th Constitutional Amendment. He was of the view that Articles 153 and 154 of the Constitution provides a comprehensive framework and mechanism of coordination between the federation and the provinces however the need remains for the implementation of the same in letter and spirit.\nHe said that in the future, with the help of the Committee and Ministry, the efforts would be made to establish harmony between federation and provinces.\nDr. Fehmida Mirza congratulated the Chair and members of the Committee and endorsed the importance of Ministry as explained by the Chairman Committee. She stressed the need of strengthening the Inter-Provincial Coordination Committee (IPCC).\nTaking up the agenda items the Committee discussed the following issues:\ni. A comprehensive briefing on the functions of the Ministry of IPC and its allied/attached departments was provided by the Secretary and relevant officials.\nii. On the matter of the role of Ministry for Inter-Provincial Coordination with reference to and pertaining to the water issues between the provinces taken up in the recent meeting of CCI held on 17-06-2021, the Ministry informed that the issue has not been taken up by the CCI.\nThe Committee unanimously decided to take it up in its next meeting and to invite representatives from concerned provinces (Punjab, Sindh), Chairman Indus River System Authority (IRSA) along all concerned, Secretary Ministry of Water Resources and Secretary Ministry of Energy (Power Division).\niii. While discussing the role of Ministry in re-conciliation of the Sales Tax collected by the Federal Government and the Sales Tax on goods collected by the provinces, the Committee directed the M/o IPC to obtain written reply from the Federal Board of Revenue (FBR) and place the same before the Committee in its next meeting.\niv. Taking up the matter of letter written by the Chief Minister Sindh to Prime Minister asking for referring the CCI’s decision, taken by a majority vote, on the census of 2017 under article 154(6) of the Constitution, the Committee was informed that M/o IPC has no role to play in the said subject as the authority to call a Joint sitting of the Parliament lies with the Speaker, National Assembly of Pakistan.\nChairman Committee, however, disagreeing with the statement suggested that a soft reminder may be provided to the custodian of the Lower House by the Minister to expedite the resolution.\nv. Discussing the decisions taken by the CCI Secretariat with respect to provinces along with their implementation status w.e.f. 2008 to date; the Committee demanded that the head-wise / subject-wise lists of pending matters before the CCI be shared with the Committee.\nvi. Ministry of IPC apprised that so far twenty-nine (29) meetings of IPCC have been held headed by the Minister In-charge. The latest one was on 14th January 2021.\nvii. While taking up the matter of current status and number of meetings to date of the Intra-Education Ministers Committee (an internal Committee of M/o IPC); the Committee was informed that no such meeting has been held on account of assuming the role by the Ministry of Federal Education, Professional Training.\nThe Committee was surprised by the fact that there is no such provision in the rules of any federal Ministry to coordinate with the provinces bypassing the M/o IPC. Committee demanded that such provisions, if any, may find out from the Rules of Business, 1973, and placed before the Committee for examination.\nFurthering the debate, Senators Dr. Zarka Suharwardy Taimur, Dr. Sikandar Mandhro, and Mushtaq Ahmed Khan highlighted the manyfold issues arising out of the census of 2017, while Senator Gurdeep Singh raised the issue of misrepresentation of minorities population. The Senators stressed the need of revising the criteria and mechanism of the same.\nSenator Rana Maqbool stressed the need of devising the role of M/o IPC in dispute resolution between the federation and the provinces before utilizing the forum of CCI along with the proposal of granting suo-motu powers to the Council. Senator Mirza Muhammad Afridi highlighted the importance of the development of sports in the country to engage the youth in healthy activities. Senator Jam Mahtab Hussain Dahar and Senator Muhammad Ayub also participated in the debate.\nMinister, Dr. Mirza, requested that an exclusive meeting be held to address the issues faced by the Pakistan Sports Board, Committee endorsed the proposal. Committee decided to hold an internal meeting of the Committee and devise a work plan comprising of issues/agendas to be taken up by the Committee in the future. The meeting ended with a mutual vote of thanks to and from the Chair.\nThe meeting analysed the various aspects of the role and functions of the Ministry. Senator Dr. Zarka Suharwardy Taimur, Senator Gurdeep Singh, Senator Muhammad Ayub, Senator Saeed Ahmed Hashmi, Senator Mirza Muhammad Afridi, Senator Mushtaq Ahmed, Senator Dr. Sikandar Mandhro, Senator Jam Mahtab Hussain Dahar, and Senator Rana Maqbool Ahmed attended the meeting. Minister for Inter-provincial coordination, and officials of Ministry were also present in the meeting.",
  "retrievedAt": "2025-08-11T20:54:27.014Z"
}
