{
  "title": "DEMP organizes calligraphic exhibition in connection with Iqbal Day",
  "link": "https://www.app.com.pk/national/demp-organizes-calligraphic-exhibition-in-connection-with-iqbal-day/",
  "date_published": "2022-11-10T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP):Senator Ifran Siddiqui on Thursday inaugurated a ‘Calligraphy and Digital Exhibition’ in connection with Iqbal Day, organized by the Directorate of Electronic Media and Publications (DEMP).\nThe exhibition showcased the calligraphic work of the school and university-level students mainly having couplets on colourful and abstract backgrounds.\nAddressing on the occasion, Irfan Siddiqui said that educational institutes should organize exhibitions and competitions among students to spread the message of Allama Iqbal. He said that he was consulted on the restoration of the Iqbal Day’s holiday and he had recommended it with the belief that it would be helpful in highlighting the message Iqbal.\nHe said Allama Muhammad Iqbal was a down-to-earth poet but he was aware about the worth and reach of his work. He said that the poetry of Allama Iqbal had given encouragement to the youngsters and the nation.\nHe said that the participants of the calligraphy competition had painted an eagle on their work and they should also be aware of the reason due to which the eagle was beloved to Allama Iqbal.\nHe said Allama Iqbal loved the eagle due to its characteristics including flying without getting tired, a habit of not making the nest and eating the prey that was not dead.\nSpeaking on the occasion, scholar Talib Hussain Sial said that Iqbal Day should be observed every month adding that teachers and educational institutions should arrange literary events frequently.\nHe said that character building and a stable economy were the core messages of Allama Iqbal. He said Allama Iqbal’s poetry and messages had been included in the syllabus and now it was the responsibility of the teachers to sensitize the students.\nEarlier, Irfan Siddiqui visited the exhibition with Secretary Ministry of Information and Broadcasting, Shahera Shahid and Director General DEMP Imrana Wazir. During the visit, he appreciated the participants and the song produced by the DEMP based on the poetry of Allama Iqbal.\nSenator Irfan Siddiqui distributed the certificates of appreciation among the winners of the calligraphic competition and appreciated the song produced by DEMP based on Iqbal’s poetry.",
  "retrievedAt": "2025-08-11T15:52:17.516Z"
}
