{
  "title": "China to help Pakistan’s economic progress, human resource development",
  "link": "https://www.app.com.pk/national/china-to-help-pakistans-economic-progress-human-resource-development/",
  "date_published": "2022-11-10T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): President, Chinese People’s Association for Friendship with Foreign Countries (CPAFFC), Lin Songtian, said China would help Pakistan through infrastructure development, industrialization, and capacity building of youth.\nHe made these remarks while addressing a press conference at the Chinese Embassy in Islamabad on Thursday.President of CPAFFC Lin Songtian, highlighting the China- Pakistan exemplary friendship, said that it is the responsibility of China to pull out Pakistan from poverty by enhancing trade and modernizing its infrastructure and technological development.\nHe added that technical skills are fundamental to achieving these goals besides education. In this regard, China is working with Pakistan to improve youth skills through vocational training institutes and the collaboration of both countries.\nHe further stated that the CPAFFC would enhance people-to-people exchanges to understand each other and strengthen the bonds between the two nations.The media’s role is vital to create awareness and urged the media should play its role to show the development and progress of both countries.\nAnswering a query, he said Belt and Road Initiative (BRI) is a major platform for building a global community of shared futures and is an initiative for the common development of humanity. He added that Pakistan’s energy crises were reduced in the first phase of CPEC, and communication infrastructure improved. Both countries are working together to translate this traditional friendship into a more visible and tangible benefit to our People.\nTalking about the 20th National Congress of the Chinese Communist Party (CCP),  he said that on the successful conclusion of the Congress, the first head of Government come to China was from Pakistan.In reply to a question on his visit, he said in Pakistan, “when I came here, I was very well welcomed. The Chinese people are very touched by Pakistani brothers/sisters. Although we have a lot of international and domestic changes, our countries, governments, and people always stand together.\nThe President CPAFFC also emphasized, ” We will never forget Pakistan’s help to China after the devastating earthquake in winter in 2008.",
  "retrievedAt": "2025-08-11T15:52:17.888Z"
}
