{
  "title": "MNA seeks House to amend constitutional clause allowing elections on multiple seats",
  "link": "https://www.app.com.pk/national/mna-seeks-house-to-amend-constitutional-clause-allowing-elections-on-multiple-seats/",
  "date_published": "2022-11-10T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): The National Assembly of Pakistan on Thursday admitted the bill seeking to amend the clause of article 223 of Pakistan’s constitution, which allows candidates to contest elections on multiple seats.\nMoulana Akbar Chitrali, Member of National Assembly (MNA) presented the bill to the National Assembly which was accepted with a majority vote.\nSeeking permission to present the bill, Moulana Akbar Chitrali said the constitution of Pakistan allowed citizens to contest elections from multiple constituencies, however, the candidate had to retain only one seat and the rest had to be relinquished in case he/she wins\n“Two crores seventy lac rupees were the expenditure incurred on each constituency in General Elections of 2018,” Akbar Chitrali told the assembly, adding, according to the fresh estimate rupees forty-six billion were required for elections on national and provincial seats. He claimed that if the value is divided per seat, including all the provincial and national assembly seats, it would cost Rs.100 million.\n“It is completely illogical that one candidate contests elections on eight different seats and later retains only one, relinquishing the rest,” said Chitrali, adding that it was not just the injustice with the voters but also a “great loss to the national kitty”.\nHe requested to put a bar on such people through an amendment in the constitution which was not opposed by the government and subsequently the speaker referred the bill to the concerned committee for further deliberations.\nMeanwhile, the speaker rejected three bills of Muhammad Jamal-ud-Din, MNA, who was seeking amendment in Pakistan Institute of Development Economics Act, 2010, National University of Science and Technology Act, 1997 and Pakistan Institute of Engineering and Applied Sciences Ordinance, 2000 while one of his bills was pended due to unavailability of the Minster concerned.\nThe speaker also referred three bills to the concerned committees for further deliberations regarding the establishment of Federal Ziauddin University in Islamabad; the bill to regulate registration and facilitation of non-governmental organizations and trusts in the federal capital; and the bill for establishing infectious disease monitoring and control center in Islamabad.",
  "retrievedAt": "2025-08-11T15:52:06.966Z"
}
