{
  "title": "Dr Abdullah Abdullah lauds Pakistan’s role in Afghan peace, hosting millions of refugees",
  "link": "https://www.app.com.pk/national/dr-abdullah-abdullah-lauds-pakistans-role-in-afghan-peace-hosting-millions-of-refugees/",
  "date_published": "2020-09-29T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Chairman High Council for National Reconciliation Dr Abdullah Abdullah on Tuesday lauded Pakistan’s efforts for ensuring peace in Afghanistan, saying the region’s future was linked with working towards a joint vision of prosperity.\nSpeaking at the Institute of Strategic Studies Islamabad (ISSI) here, Dr Abdullah said Afghanistan would focus on capitalizing the opportunity that the recent peace deal inked between the United States and Afghan Taliban.\nThe Afghan reconciliatory leader stressed that ‘there were no winners in war, and no losers in peace’.\nIn the realms of challenges such as terrorism and coronavirus pandemic, he said, Pakistan and Afghanistan needed to work in close collaboration to overcome the related problems.\nHe appreciated Pakistan for hosting millions of Afghan refugees for over four decades and endorsed the proposed dignified their return to homeland.\nDr Abdullah emphasized on strengthening bilateral relations between Pakistan and Afghanistan in the fields of transit trade and people-to-people contacts.\nDr. Abdullah said Pakistan and Afghanistan  were at the threshold of a new era of bilateral relations based on mutual respect and shared prosperity.\nHe termed the talks as an important opportunity and said peace and prosperity in both Pakistan and Afghanistan were interdependent.\n“We need to take into account the current geo-political shifts and draw necessary lessons about our gains, losses, threats and opportunities.”\nHe called for reduction in tension and an increase in regional connectivity, trade, transit, economic integration, business to business and more importantly, people to people interactions.\nForeign Minister Shah Mehmood Qureshi said Pakistan desired sustainable peace in Afghanistan and would continue to extend support in this regard.\nHe said Pakistan’s peace was linked with Afghanistan’s peace and stability, and also of the entire region.\nQureshi said that Afghanistan must realize that Pakistan wanted to be its ‘friend and not master’.\nHe assured that Pakistan would support an Afghan-owned settlement of the situation.\nForeign Minister Qureshi said that Dr. Abdullah, as Chairman of the HCNR has the most challenging job of his career. He said he believed that in his success lies Pakistan’s success.\nHe said that it was important that the leadership of Pakistan and Afghanistan engage and exchange views, frankly, honestly and in a candid manner.\nThere should be particular focus on how to steer the peace process forward. He said the timing of Dr. Abdullah’s visit is significant because it was taking place after a number of historic events.\n“There is now a new international environment, which is supportive of a peace process.”\nQureshi was of the view  that a realisation has evolved over the years that there was no military solution to the Afghan conflict. This voice, though previously often not heard, has finally been heard.\nForeign Minister said there was a recognition that a negotiated political settlement was the only and best way forward.\n“Today, the reduction in violence leading to a ceasefire is a prerequisite for peace.”\nHe said Afghans and only Afghans can determine the future of Afghanistan. He said that though the road ahead was bumpy, however stressed that  all sides will have to work for it, as the name of the game was patience.",
  "retrievedAt": "2025-08-11T19:51:07.912Z"
}
