{
  "title": "AJK President condemns freezing of Amnesty International bank accounts by BJP regime",
  "link": "https://www.app.com.pk/national/ajk-president-condemns-freezing-of-amnesty-international-bank-accounts-by-bjp-regime/",
  "date_published": "2020-09-29T07:04:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Sep 29 (APP):The Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has strongly condemned the freezing of bank accounts of the Amnesty International by the fanatic BJP regime and forcing it to halt its India operations.\nThe watchdog has also accused the Indian government of indulging in a “witch-hunt of human rights organisations”. Amnesty International said its bank accounts have been frozen and it’s been forced to lay off staff in the country, and suspend all its campaign and research work.\nIn a statement issued on Tuesday, AJK President said that India’s Hindu fanatic regime is targeting the Amnesty International, a global human rights watchdog because the organization is always voiced against the worst human rights violations being committed by the Indian Army and the police particularly in occupied Kashmir.\nHe asked what the Indian rulers if they are not guilty conscience, wanted to hide through revengeful actions against the Amnesty.\nWhile commenting on the statement of pro-India National Conference leader Farooq Abdullah in which he has said that the people of occupied Kashmir do not like to be called the Indian citizens, the AJK president asserted that the Kashmiri people have never accepted the Indian slavery nor have they considered themselves to be Indian citizens during the last more than 70 years.\nThis is, however, a separate issue that Farooq Abdullah and his cronies had been so blind in the lust of power that they could not see the worst Indian repression against the Kashmiri people.\nSardar Masood Khan said that despite the occupation of Kashmir for the last 70 years, India failed to win hearts and minds of the Kashmiri people and to integrate them into Indian society because its invasion of the state and the policy to suppress the Kashmiri people were unnatural.\nHe said that India has always declined to grant the right of self-determination to the Kashmiri people because it was very well aware of the outcome of a free and fair plebiscite in the state.\nWhile expressing grave concern over the use of chemical weapons by the Indian Army against the people of occupied territory, the AJK president appealed to the international community to get these reports probed through independent experts.\nReferring to the ongoing freedom struggle in Indian Occupied Jammu and Kashmir, the President said India has been using brutal force against the innocent Kashmiris for the last 70 years to suppress their voices, but its brutal tactics to silence the voices of Kashmiri people will never succeed.\nHe strongly condemned the Indian firing from across the LoC targeting the civilian population and said India continuously violating the ceasefire agreement to dislodge the civil population residing along with the liner of Control LoC. But our valiant people will not be intimidated by such cowardly acts of India, he maintained.\nPresident Masood Khan strongly condemning unprovoked Indian firing in Samahani sector in violation of the ceasefire agreement which left a Pakistani army soldier and a youth martyred and four others injured, the AJK president described it a cowardly act of the Indian Army.\nHe said that India was intentionally attempting to create tension at the Line of Control in order to divert attention from the situation of occupied Kashmir.",
  "retrievedAt": "2025-08-11T19:51:10.750Z"
}
