{
  "title": "672 new Coronavirus cases reported; eight deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/672-new-coronavirus-cases-reported-eight-deaths-in-past-24-hours/",
  "date_published": "2020-09-29T08:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): The total active COVID-19 cases in Pakistan on Monday were recorded 8,702 as 672 more people tested positive for the deadly virus during the last 24 hours.\nEight corona patients, who were under treatment in hospital died on Monday, according to the latest update issued by the National command and Operation Centre (NCOC).\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK) and Balochistan, while 85 ventilators elsewhere in Pakistan, out of 1,912 allocated for COVID-19 patients, were occupied.\nSome 32,665 tests were conducted across the country on Monday, including 12,097 in Sindh, 10,072 in Punjab, 4,225 in Khyber Pakhtunkhwa (KP), 4,004 in Islamabad Capital Territory (ICT), 1,217 in Balochistan, 510 in Gilgit Baltistan (GB), and 540 in Azad Jammu and Kashmir (AJK).\nAround 296,340 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 311,516 cases were detected so far, including AJK 2,663, Balochistan 15,177, GB 3,730, ICT 16,532, KP 37,727, Punjab 99,292 and Sindh 136,395.\nAbout 6,474 deaths were recorded in country since the eruption of the contagion, including 2,495 in Sindh among three of them in hospital on Monday, 2,234 in Punjab three of them in hospital on Monday, 1,259 in KP, 181 in ICT, 145 in Balochistan, 88 in GB one of them in hospital on Monday and 72 in AJK one of them in hospital on Monday.\nA total of 3,482,206 corona tests have been conducted so far, while 735 hospitals are equipped with COVID facilities. Some 684 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T19:51:07.900Z"
}
