{
  "title": "Traders, students to benefit from new visa regime for Afghanistan",
  "link": "https://www.app.com.pk/national/traders-students-to-benefit-from-new-visa-regime-for-afghanistan/",
  "date_published": "2020-09-29T18:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): The federal cabinet in its meeting on Tuesday approved the new visa policy for Afghanistan.\nIt came at a time when Abdullah Abdullah, the Chair of the High Council for National Reconciliation in Afghanistan was on a three day visit to Pakistan.\nThe new visa regime for Afghanistan was liberal in its scope and application. Various aspects of visa like duration of stay, validity of visa and number of entries in Pakistan have all been substantially liberalized. It would especially facilitate visiting Afghan brethren, students, businessmen, investors and medical patients.\nPatients would also be granted visa up to six months on the Torkhum border to save them the hassle of travelling to Pakistan Embassy in Kabul or Pakistani Consulates. Pakistani Missions in Afghanistan will now also be able to grant visit visa for one year with multiple entries and business visa for up to five years, which would be extendable within Pakistan.\nKeeping in view the plight of Afghan students, the cabinet had decided that they could now get visa for the whole duration of their studies instead of just for one year.\nAccording to National Assembly Secretariat, the approval of the visa policy came at the heels of extensive parliamentary deliberations for the last three months, when the Speaker National Assembly, Asad Qaiser took notice of the issue and constituted a Parliamentary Task Force to resolve it.\nThe Task Force was headed by Special Assistant to the PM on Establishment, Arbab Shahzad.\nNumerous meetings were held and visits to border crossing points were undertaken. The speaker chaired a number of meetings himself. The result was an extensive parliamentary input on multiple aspects of the visa policy.\nThe new visa policy had been framed in the perspective of our brotherly ties with Afghanistan and took a people centric approach.\nIt will help in bringing the people closer, facilitating common Afghans.\nThe policy would also greatly benefit bilateral trade and commerce, ushering a new era of mutual prosperity especially for people of Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T19:51:01.663Z"
}
