{
  "title": "KP providing investment-friendly industrial environment: KP CM",
  "link": "https://www.app.com.pk/national/kp-providing-investment-friendly-industrial-environment-kp-cm/",
  "date_published": "2020-09-29T07:05:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 29 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan Tuesday said that provincial government was focusing to provide investment-friendly industrial environment to industrialists so that valuable natural resources could be utilized for benefiting masses.\nHe was chairing a high level meeting regarding three-year industrial roadmap here at Chief Minister Secretariat.\nBeside, Adviser to Chief Minister on Energy and Power Himayat Ullah, Special Assistant on Industries Abdul Kareem, Additional Chief secretary Shakeel Qadir, Principal Secretary to CM Shahab Ali Shah and other concerned administrative secretaries attended the meeting.\nThe meeting was briefed that so far seven industrial facilitation centers had been made functional while all zonal offices of Khyber Pakhtunkhwa Economic Zones Development and Management Company (KPEZDMC) had been converted into industrial facilitation centre in order to facilitate investors.\nThe meeting was informed that all industrial plots of Jalozai economic zone had been sold out in one month adding that through this project around 41000 direct and indirect job opportunities and investment of Rs. 6.3 billion are expected.\nThe meeting was apprised that Nowshera economic zone extension project comprising 76 acres of land was ready for commercial launching adding that through project over 12000 job opportunities and investment of Rs 1.6 billion are expected.\nDevelopment agreement on Rashakai special economic zone had been signed adding that through project creation of around 0.2 million job opportunities and investment of $ 1.9 billion are expected.\nFurthermore, three different industries would be made functional in Mohmand economic zone, feasibility study for establishment of centre of excellence in mining processing technologies had been presented to Pak-China Joint Working group, conversion process of Mohmand Economic Zone into Special Economic Zone had been initiated, It was told.\nThe chief minister stated that completion of ongoing projects in industrial sector would boost the economy and create job opportunities in the province in addition to value addition of natural resources. He added that, government would go all out to make province a hub for commerce and trade activities.\nOn this occasion, the chief minister was requested to formally inaugurate the newly established D.I Khan Economic Zone and told that Rs. 1.5 billion investment and over 30,000 direct and indirect employment opportunities were expected through this project.\nUnder the project, four industrial units were already operational while another industrial unit was under construction whereas construction of four additional industrial units would soon be started.\nAbout the upcoming projects of economic zones, the meeting was informed that business plan had been prepared and consultant hired for master planning of 140 acres Chitral Economic Zone.\nThe project would be available for commercial launching by the end of October this year. Moreover, master plan for 89 acres Ghazi Economic Zone was completed and this project would also be ready for commercial launching by December this year.\nThe meeting was told that international tender had been floated for establishment of 3,125 acres Daraban Economic Zone which would be the largest economic zone of the province. Daraban Economic Zone was situated at the distance of two kilometer from CPEC route which was an ideal location for international investors.\nExpected investment through this project is Rs.56 billion having more than five million direct and indirect employment opportunities.\nThe project would have four hundred industrial units and would be implemented in phased manners, the meeting was informed.\nThe chief minister directed the authorities concerned to propose this project for inclusion into CPEC projects. The meeting was further informed that PC-I for establishment of Buner Economic Zone was submitted to relevant forum for approval whereas land acquisition process for 408 acres Bannu Economic Zone had been initiated.\nThe meeting was further informed that KPEZDMC was also intended to establish Salt and Gypsum City in Karak in order to ensure value addition in natural resources and facilitate the industrialists.",
  "retrievedAt": "2025-08-11T19:51:10.800Z"
}
