{
  "title": "FAO installs Chilgoza Processing Unit at Chilas, Diamer in Gilgit Baltistan",
  "link": "https://www.app.com.pk/national/fao-installs-chilgoza-processing-unit-at-chilas-diamer-in-gilgit-baltistan/",
  "date_published": "2020-09-29T12:34:00.000Z",
  "source": "APP",
  "content": "CHILAS, Sep 29 (APP):The Food and Agriculture Organization of the United Nations (FAO) under the project “Reversing deforestation and forest degradation in high conservation value chilogoza pine forest in Pakistan” inaugurated pine nut (chilgoza) processing unit in Diamer district of Gilgit Baltistan here on Tuesday.\nThe project was funded by the Global Environment Fund and implemented under the oversight of the Ministry of Climate Change, said a press release.\n“The project is additionally contributing 23 million trees to the Ten Billion Trees Programme of MoCC.”\nIn Diamer district, the chilgoza pine forest covers an area of around 18,000 hectares.\nThe project has involved the local community within the conservation and protection of forests while adding value chain development as well.\nSince the key issue faced by the local community was the lack of access to chilgoza processing unit, FAO through the project, installed a chilgoza processing unit at Chilas covering chilgoza cleaning, grading, roasting, packing and labelling.\nSpeaking on the occasion, Country Representative of FAO, Mina Dowlatchahi highlighted the significance of such unit to ensure more benefits arising from natural resources management. She stated that for the first time in Diamer district, the local people will be able to process their harvest in one place from grading to packaging and labelling, with the full process and hence obtain a higher price on the market compared to selling cones or unroasted nuts. It is hoped that these economic benefits would increase the efforts and engagement of the communities in Chilgoza forest conservation, said Mina Dowlatchahi.\nAssistant FAO Representative Programme Dr Aamer Irshad mentioned that the project was bringing the opportunity in these communities to also learn how to leverage information technology to access high end markets to increase their incomes. This is particularly relevant in times of supply chains disruptions due to COVID19.\nThe National Project Coordinator, Dr. Faizul Bari appreciated the cooperation of the forest department and support to the project for the betterment of the Forests conservation to increase sustainability and livelihoods and committed to an acceleration of activities.\nThis initiative was much appreciated by the local communities as the processing unit will allows them to sell a finished product at a higher price and also will increase the shelf life of roasted nuts up to six months.\nFrom the conservation perspective, the specialized tools and the training to the communities, has improved forest regeneration and reduced the damage to trees due to poor ways of branch cutting.\nMoreover, training for women on packing and labelling, kitchen gardening, and literacy are paradigms of the initiatives that have been identified by the communities.\nFAO and the Forest Department representatives jointly inaugurated the unit at Chilas, as one of the primary markets of Chilgoza Pine in Gilgit Baltistan, on a pilot basis.\nOn this occasion, the community members, local traders, forest department officials attended the event. For this first year, a trader will ensure help, train representatives from the communities, Forest Department staff to facilitate the independent running of the processing unit starting from next season in 2021.",
  "retrievedAt": "2025-08-11T19:51:05.127Z"
}
