{
  "title": "CM inaugurates veterinary academy at UVAS",
  "link": "https://www.app.com.pk/national/cm-inaugurates-veterinary-academy-at-uvas/",
  "date_published": "2020-09-29T07:05:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 29 (APP):Punjab Chief Minister Sardar Usman Buzdar inaugurated a state-of-the-art veterinary academy at the University of Veterinary and Animal Sciences (UVAS) Lahore on Tuesday for the training and capacity building of veterinary professionals, faculty members and researchers.\nThe CM expressed his satisfaction that the UVAS was included in top 10 universities of the country. He hoped that veterinary academy would play an important role in the education and professional development of experts through top-notch specialists so that national targets could be achieved. The academy was providing training certificates to faculty in collaboration with Royal Veterinary College London by arranging 16 domestic, five international trainings and eight online courses.\nHe said that the livestock sector was badly ignored in the past but the Pakistan Tehreek-e-Insaf (PTI) government was actively working for its development because this sector can play an important role in poverty alleviation and ensuring food security, adding that the government was committed to promoting the milk and meat production and it was sanguine that the livestock department has introduced different schemes for increasing earning opportunities for rural dwellers.\nThe UVAS efforts for increasing livestock production, in collaboration with the private sector, were praiseworthy and it hoped that veterinary specialists would play their role in national development after getting modern training from the veterinary academy, added CM.\nThe chief minister said that it’s the age of specialization and the veterinary academy would be very effective in the capacity building of in-service veterinary professionals, faculty members and researchers. He said that with the updated knowledge and skills, the veterinary professionals would work actively for the uplift of livestock and allied sectors and contribute to the national economic development. He added the UVAS efforts for enhancing livestock productivity were appreciable.\nProvincial Minister for Livestock & Dairy Development Department (L&DD) Sardar Husnain Bahadur Dareshak said that Livestock Department has been formulating farmers-friendly policies for their betterment of poor farming community.\nHe added UVAS was developing in a fast pace and has made a tremendous progress in academics, research and community services. He said that UVAS was working very closely with the dairy, livestock and poultry industries and the relevant industrialists have a strong liaison with this institution. He maintained that establishment of veterinary academy was one of the unique steps which would benefit in-service veterinary professional.\nLivestock Secretary Saqib Zafar said that L&DD Department was equally focusing on the training of its staff and professionals and has allocated Rs 232 million for capacity building and training of human resource in Punjab. He also said the Livestock Department focusing on enhancement of red meat export. He said Livestock Department was establishing disease free zone at south Punjab.\nUVAS Vice-Chancellor Prof Dr Nasim Ahmad spoke about the academic, research and community services of the university and said that UVAS was on the top among Pakistani universities in The Times Higher Education’s impact ranking. He said that establishment of Biosafety Level 3 Laboratory was one of major achievements made by UVAS during the testing time of coronavirus.\nAbout the Veterinary Academy, the Vice-Chancellor said it is first of its kind of facility for the professional training of faculty members and veterinary officers. “It is open to the industry related to poultry, dairy, meat, and pharmaceutical for trainings,” Prof Nasim said.\nThe CM also distributed appreciation certificates among UVAS team members who have been involved in COVID-19 testing under the leadership of Prof Dr Tahir Yaqub, Director Institute of Microbiology. CM also gave away shields to former UVAS Vice-Chancellor Prof Dr Talat Naseer Pasha, Dr Hasa Zaneb and others who have been involved in the building of the veterinary academy.\nLater, the CM visited the UVAS pet centre and veterinary academy.\nAdviser to Punjab CM on Livestock Faisal Hayat Jabwana, Parliamentary Secretary on Livestock and Dairy Production Rana Shahbaz Ahmad,Secretary Livestock & Dairy Development Department Punjab Capt. (Retd.) Saqib Zafar, Vice-Chancellor University of Education Lahore Prof Dr Talat Naseer Pasha,Vice-Chancellor Cholistan University of Veterinary and Animal Sciences Prof Dr Muhammad Sajjad Khanand UVAS faculty, syndicate members and Livestock Department officials were present.",
  "retrievedAt": "2025-08-11T19:51:10.190Z"
}
