{
  "article_id": "2025-01-23_44fd7c42a1399d930b66734f7dbb7f56",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/peca-amendment-bill-has-no-effect-on-working-journalists-atta-tarar/",
    "retrieved_at": "2025-08-27T11:57:59.068Z"
  },
  "metadata": {
    "title": "PECA amendment bill has no effect on working journalists: Atta Tarar",
    "author": null,
    "date_published": "2025-01-23T15:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 593,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 23 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Thursday brushed aside misleading notion around the Prevention of Electronic Crimes (Amendment) Bill, 2025, which is aimed at regulating the digital media, and would not affect the working journalists at all. \"The PECA amedment is a major step towards protection of the working journalists of the print and electronic media,\" said the minister while addressing the journalist community at the Press Gallery of the Parliament. He said there was no mechanism or law to regulate the digital media which is shrinking the space for print and electronic media. On the other hand, the Council of Complaints of the Pakistan Electronic Media Regulatory Authority and other platforms are there to regulate the print and electronic media. Recently a person announced a bounty over the head of the former chief justice on the social media, but no action was taken against him, he said, adding no authority could take notice of the fake news and malicious campaigns on social media in the existing scenario in Pakistan. He said without any association with the journalism, people have been reporting on social media and there is no authority which could hold them accountable for accusations or fake news. This is the first time that the term digital media is being defined formally, he said, adding any online media through which the information is being transmitted has been defined as the digital media. \"For the first time, online platforms, online systems of information dissemination, mobile application and mobile web are brought under the purview of digital media,\" he remarked. He said the Federal Investigation Agency does not have the capacity to deal with the crimes like child pornography and deep fake. The establishment of the Cyber Crime Investigation Agency is not a one-day initiative, he said, adding the government would consult all the stakeholders including the journalist community in this regard. Under the proposed criteria, he said the Digital Rights Protection Authority will have a one member from the journalist community. \"It will not happen that anybody take action arbitrarily as a speaking order would have to be passed within 24 hours,\" he said, adding if the speaking order is not passed within 24 hours of taking cognizance of an offence then the matter will not proceed any further. \"I would like to clarify once again that there is no provision in PECA which targets working journalist,\" he said assuring the journalists that the proposed law would ensure protection of their rights. He said the journalist community is allowed to comment or criticize, but there is a need to take some realities under consideration. \"I invite all the media organizations to come and consult with us and see whether it is targeting the working journalists or protecting them,\" he remarked. On the other hand, he said the growing digital media had shrunk the space for print and electronic media. Tarar said this bill would enhance space for print and electronic media which are currently facing financial crunch. \"Any person who is associated with journalism will not be affected by this bill,\" he added. \"How is it just, if a person who earns four million a day at the cost of a cameraman or technician do not pay any tax to the government,\" he questioned. It cannot happen that the space for electronic and print media got shrunk just because of so called digital journalists who did not pay any tax to the Government of Pakistan, nor has any editorial control, he noted.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}