{
  "article_id": "2025-01-23_e8117ae602f17b8f446188fb41fea536",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-economic-growth-journey-resumed-from-where-it-was-halted-in-2018-pm-2/",
    "retrieved_at": "2025-08-27T11:58:42.968Z"
  },
  "metadata": {
    "title": "Pakistan’s economic growth journey resumed from where it was halted in 2018: PM",
    "author": null,
    "date_published": "2025-01-23T09:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1346,
    "reading_time_minutes": 7
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 23 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday said that after attaining stability in the country's economy, the government had resumed the journey of economic development and growth from where it was halted in 2018.He said Pakistan witnessed a golden era of economic development under the leadership of former Prime Minister Nawaz Sharif and today, under his leadership too, the development journey was continued.He expressed the gratitude to the friendly and brotherly countries as Pakistan avoided the default like situation and moved towards the path of development due to their cooperation.\"The credit of significant decline in inflation and interest rate goes to the hard work by the government economic team,\" he said while talking to a delegation of Pakistan Broadcasters' Association which called on him here.The prime minister said the relationship between government and the media was based on mutual trust.He emphasized that the the government always welcomed constructive criticism by media as it was very important to improve governance.\"The government believes in media being the fourth pillar of the state,\" the prime minister said adding that there was complete freedom of expression in the country.He expressed the confidence that \"Uraan Pakistan\", a home made development project, will be made successful with cooperation of media and all other relevant stakeholders.Similarly, he underscored that the country's exports had been increased and industrial and agricultural sectors were also showing positive results due to the business friendly policies of the government.As regards performance of the Federal Board of Revenue (FBR), the prime minister said the reforms actions were being implemented in the Board besides work on digitization of FBR was also continued rapidly.He told that the faceless assessment had also been launched to improve the customs' system. \"This system will help increase tax revenues, enhance transparency and stop corruption from the sector.He said after the launch of this system, the national exchequer was benefited due to the prevention of smuggling of petroleum products, sugar, fertilizers, and wheat.The increase in remittances reflects the growing trust of overseas Pakistanis in government policies, he said adding that the expansion of relationship with friendly countries and successes on the diplomatic front were also continued.He said Pakistan's identity on the global stage had been restored.As regards the progress of China Pakistan Economic Corridor (CPEC), the prime minister said the benefits of the mega project were starting to materialize.\"The dream of Muhammad Nawaz Sharif and Chinese President Xi Jinping for the development of Pakistan and the region is very close to being realized,\" he said adding that the government was working tirelessly for the early completion of CPEC projects.Additionally, the prime minister said the entire nation had made unmatched sacrifices in the war against terrorism.\"The Pakistan armed forces, along with the entire nation, will continue the fight against this menace until its complete eradication.\"He noted that the anti-Pakistan elements, who had dreamed of Pakistan's default, continue to make repeated attempts to attack Islamabad.\"These elements are finding it difficult to digest Pakistan's economic stability and development,\" he added.We have sacrificed our politics for Pakistan's economic security and will continue to work day and night for its development, the prime minister added.He said the talented youth workforce was the Pakistan's greatest asset.\"Providing youth with international-standard education, training, and equal development opportunities is one of our top priorities,\" he added.On the occasion, the delegation members pointed out that the improvement in economic indicators was a positive sign, and that the media will continue to play a constructive role in national development and governance improvement.The delegation praised the Prime Minister's efforts in negotiating with Independent Power Producers (IPPs) to reduce electricity prices and resolve matters smoothly within the power sector.The country needs political stability, and the government should play a positive role in this regard, they said.The meeting was attended by Minister for Information Attaullah Tarar, top officials of the information ministry, Chairman Pakistan Broadcasters Association Mian Amir Mehmood, Mir Ibrahim, Naz Afreen Sehgal, Shakeel Masood, Nadeem Malik and Kazim Khan. ISLAMABAD, Jan 23 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday said that after attaining stability in the country's economy, the government had resumed the journey of economic development and growth from where it was halted in 2018. He said Pakistan witnessed a golden era of economic development under the leadership of former Prime Minister Nawaz Sharif and today, under his leadership too, the development journey was continued. He expressed the gratitude to the friendly and brotherly countries as Pakistan avoided the default like situation and moved towards the path of development due to their cooperation. \"The credit of significant decline in inflation and interest rate goes to the hard work by the government economic team,\" he said while talking to a delegation of Pakistan Broadcasters' Association which called on him here. The prime minister said the relationship between government and the media was based on mutual trust. He emphasized that the the government always welcomed constructive criticism by media as it was very important to improve governance. \"The government believes in media being the fourth pillar of the state,\" the prime minister said adding that there was complete freedom of expression in the country. He expressed the confidence that \"Uraan Pakistan\", a home made development project, will be made successful with cooperation of media and all other relevant stakeholders. Similarly, he underscored that the country's exports had been increased and industrial and agricultural sectors were also showing positive results due to the business friendly policies of the government. As regards performance of the Federal Board of Revenue (FBR), the prime minister said the reforms actions were being implemented in the Board besides work on digitization of FBR was also continued rapidly. He told that the faceless assessment had also been launched to improve the customs' system. \"This system will help increase tax revenues, enhance transparency and stop corruption from the sector. He said after the launch of this system, the national exchequer was benefited due to the prevention of smuggling of petroleum products, sugar, fertilizers, and wheat. The increase in remittances reflects the growing trust of overseas Pakistanis in government policies, he said adding that the expansion of relationship with friendly countries and successes on the diplomatic front were also continued. He said Pakistan's identity on the global stage had been restored. As regards the progress of China Pakistan Economic Corridor (CPEC), the prime minister said the benefits of the mega project were starting to materialize. \"The dream of Muhammad Nawaz Sharif and Chinese President Xi Jinping for the development of Pakistan and the region is very close to being realized,\" he said adding that the government was working tirelessly for the early completion of CPEC projects. Additionally, the prime minister said the entire nation had made unmatched sacrifices in the war against terrorism. \"The Pakistan armed forces, along with the entire nation, will continue the fight against this menace until its complete eradication.\" He noted that the anti-Pakistan elements, who had dreamed of Pakistan's default, continue to make repeated attempts to attack Islamabad. \"These elements are finding it difficult to digest Pakistan's economic stability and development,\" he added. We have sacrificed our politics for Pakistan's economic security and will continue to work day and night for its development, the prime minister added. He said the talented youth workforce was the Pakistan's greatest asset. \"Providing youth with international-standard education, training, and equal development opportunities is one of our top priorities,\" he added. On the occasion, the delegation members pointed out that the improvement in economic indicators was a positive sign, and that the media will continue to play a constructive role in national development and governance improvement. The delegation praised the Prime Minister's efforts in negotiating with Independent Power Producers (IPPs) to reduce electricity prices and resolve matters smoothly within the power sector. The country needs political stability, and the government should play a positive role in this regard, they said. The meeting was attended by Minister for Information Attaullah Tarar, top officials of the information ministry, Chairman Pakistan Broadcasters Association Mian Amir Mehmood, Mir Ibrahim, Naz Afreen Sehgal, Shakeel Masood, Nadeem Malik and Kazim Khan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}