{
  "article_id": "2025-01-23_21e8df2ffc396e3a176f81edbecba6c4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/romina-alam-highlights-iles-projects-impact-on-cutting-pollution-saving-resources-within-smes/",
    "retrieved_at": "2025-08-27T11:58:18.267Z"
  },
  "metadata": {
    "title": "Romina Alam highlights ILES project’s impact on cutting pollution, saving resources within SMEs",
    "author": null,
    "date_published": "2025-01-23T10:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 504,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 23 (APP): Coordinator to the Prime Minister on Climate Change and Environmental Coordination, Romina Khurshid Alam lauded the International Labour and Environmental Standards (ILES) in Pakistan's Small and Medium Enterprises (SMEs) project for its transformative impact in promoting sustainable practices among industries in Pakistan. Speaking at the closing ceremony of the ILES project on Thursday, Romina highlighted the project's significant role in equipping enterprises with smart environmental management practices, which have enabled them to reduce resource use and minimize pollution. The ILES project, launched in 2016 through a collaboration between the International Labour Organization (ILO), World Wide Fund for Nature (WWF), and the European Union, aimed at fostering sustainable growth in Pakistan. It focused primarily on key export sectors, including textiles, ready-made garments, and leather, enhancing their competitiveness and ensuring continued access to the European Union's Generalized Scheme of Preferences Plus (GSP+). Ms. Romina stated that this project not only supported labour but also enhanced the industry's effectiveness in addressing climate change, global environmental sustainability, and the need for the labour force to be better equipped in line with international standards. Ms. Romina emphasized that the ILES project has been pivotal in strengthening compliance with international labour and environmental standards, contributing significantly to Pakistan's national progress. She noted that the project improved occupational safety and health, particularly in small factories, while boosting productivity in larger ones. Furthermore, the initiative played a crucial role in supporting policy reforms that align Pakistan's frameworks with global standards, ensuring the nation's industries remain competitive on the international stage. \"The government of Pakistan remains steadfast in its commitment to fostering partnerships like ILES, which bring together public and private stakeholders as well as our international partners. These collaborations are essential in achieving our shared goals of sustainable development,\" she said. She also stressed that the end of the ILES project should not be seen as a conclusion but rather as a foundation upon which to build. \"The insights, resources and networks generated through this initiative must now inform our broader national strategies,\" she added. \"Together, we can ensure that Pakistan not only meets its international obligations but also thrives as a leader in sustainable industrial practices.\" Ms. Romina assured the audience that the government would continue to support initiatives like ILES, reaffirming Pakistan's commitment to environmental sustainability, global competitiveness, and inclusive economic growth. Secretary of Ministry of Overseas Pakistanis, Dr. Arshad Mahmood highlighted the achievements of the ILES project. Reflecting on its impact, he noted that the project fostered a new culture of safeguarding labour rights at both the federal and provincial government levels. Speaking at the event, Director General of WWF-Pakistan, Hammad Naqi Khan said WWF-Pakistan is actively promoting organic cotton cultivation to enhance sustainability and reduce environmental impacts. The organization has engaged over 13,000 farmers across approximately 80,000 acres, with 21,833 acres certified organic. He provided an overview of the ILES project and emphasized that while the SMEs sector had been overlooked in the past, this initiative helped establish valuable partnerships with the private sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}