{
  "article_id": "2025-01-23_bc60236cd58e00e4a1b817ba2128581c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-marathon-2025-to-kick-off-on-january-26/",
    "retrieved_at": "2025-08-27T11:58:20.954Z"
  },
  "metadata": {
    "title": "Islamabad Marathon 2025 to kick off on January 26",
    "author": null,
    "date_published": "2025-01-23T10:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 323,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 23 (APP): The scenic capital of Pakistan is all set to host the Islamabad Marathon 2025, the largest running event in the country, on January 26. Organized by Islamabad Run with Us (IRU), a community-led initiative founded by Qasim and Hashim Naz in 2016, the event promises to be a milestone in Pakistan's sporting history. This year's marathon marks the fifth full marathon in the IRU series and has already garnered attention from runners across the globe. Over 3,000 participants from Pakistan and abroad are expected to hit the streets of Islamabad, with international runners from Europe and the United States joining the event. A strong contingent from the diplomatic community in Islamabad will also be participating, adding a global flair to the occasion. The marathon features a variety of race categories, including a 5km fun run, a 10km race, a half marathon, and the full 42.2km marathon, making it accessible to runners of all skill levels. A special kids' race has also been planned to promote active lifestyles among children under 12. \"The Islamabad Marathon has grown into more than just a running event-it's a celebration of health, community, and culture,\" Qasim Naz, co-founder of IRU told APP. \"We are thrilled to bring together people from all walks of life, uniting them in their shared love for fitness and sport, \" he said. The event promises to be more than just a race. Families and spectators can look forward to an array of food stalls, interactive games, and engaging activities to ensure a lively atmosphere. Friends and families of participants will cheer on runners as they take on the challenge, adding an extra layer of encouragement and excitement. This meticulously organized event reflects the dedication of IRU to fostering a thriving running culture in Pakistan. With its scenic routes through Islamabad's lush landscapes and vibrant atmosphere, the marathon is set to leave a lasting impact on all participants and spectators.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}