{
  "title": "MWL Secy-Gen delivers Eid sermon, advocates for Palestinians; announces initiatives for social welfare, religious education",
  "link": "https://www.app.com.pk/national/mwl-secy-gen-delivers-eid-sermon-advocates-for-palestinians-announces-initiatives-for-social-welfare-religious-education/",
  "date_published": "2024-04-12T15:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):The Secretary-General of Muslim World League (MWL), Dr. Mohammad bin Abdulkarim Al-Issa, delivered a powerful Eid-ul-Fitr sermon at Faisal Mosque in the federal capital on Wednesday, urging Muslims to remember and support their Palestinian brethren amidst ongoing challenges in Gaza.\nIn his address to the faithful, Dr. Al-Issa emphasized the importance of solidarity and prayers for the Palestinian people, calling for divine intervention to alleviate their suffering and hold perpetrators of aggression accountable for their actions.\nHighlighting the significance of exemplifying Islamic values through actions, Dr. Al-Issa underscored the positive impact of individuals who embody the true essence of Islam in their daily lives. His message resonated with the congregation, encouraging them to uphold compassion, justice, and righteousness in their interactions with others.\nMeanwhile, Ministry of Religious Affairs and Interfaith Harmony Spokesperson Muhammad Umar Butt revealed Dr. Al-Issa’s plans to sign a memorandum of understanding for the establishment of a groundbreaking Seerat-un-Nabi Museum in the federal capital. “This museum, the first of its kind in Pakistan, will showcase relics and artifacts related to the life of Prophet Muhammad (Peace Be Upon Him), enriching religious education and cultural heritage,” he added.\nFurther enhancing religious education, Dr. Al-Issa will serve as the chief guest at a prize distribution ceremony for young ‘Huffaz’ at the Jinnah Convention Center on April 13, as disclosed by MWL Regional Director Saad Masoud M. Al Harthi. “This initiative aims to recognize and celebrate the dedication and achievements of young memorizers of the Quran, fostering a deeper appreciation for Islamic knowledge and scholarship,” he added.\nDr. Al-Issa’s multifaceted engagements during the Eid festivities underscore the MWL’s commitment to promoting social welfare, religious education, and interfaith harmony, aligning with its mission to uphold the principles of compassion, justice, and solidarity within the global Muslim community.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:49:27.544Z"
}
