{
  "title": "Basmati crop remains resilient - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: Initial reports predicting a catastrophic loss to Pakistan’s Basmati crop due to severe flooding in the Indus delta region have been largely overstated.\n\nWhile global media outlets speculated in late August that the damage could be as high as 60 per cent, more recent official assessments suggest the impact is far less significant. The Rice Exporters Association of Pakistan (REAP) has dismissed these early reports, assuring international buyers that the country’s Basmati export capacity remains intact.\n\nAccording to the Agriculture Department of Punjab, which accounts for more than 90pc of Pakistan’s Basmati production, floodwaters have affected an estimated 250,000-270,000 hectares of rice fields in Punjab. This represents only about 10.1pc of the total rice-growing area in the region, which covers 2.7 million hectares in the 2025 Kharif season. The damage estimate is consistent with reports from the Food and Agriculture Organization (FAO) and satellite data from the Space and Upper Atmosphere Research Commission (SUPARCO), which also indicate that less than 10pc of the rice crop has been affected.\n\nResilient crop yields\n\nOne of the key factors mitigating the overall impact is the significant increase in Pakistan’s Basmati-planted area this year, which rose from 2.02 million hectares to 2.38 million hectares. This expansion, coupled with the localized nature of the flooding, suggests that overall production could exceed earlier forecasts. While the Ravi river delta experienced flood surges up to 220,000 cusecs, causing some damage, the broader impact on the country’s rice-growing areas was limited due to timely warnings and Pakistan’s geographical position in the lower Indus basin.\n\nOfficial estimates put damage in floods to 10pc of sowing area\n\nA notable observation comes from the Sutlej river belt near Arifwala, where paddy harvested from areas submerged for a week still yielded around 50pc of the average crop. Though grain quality in these affected pockets was compromised, this demonstrates the resilience of the Basmati crop.\n\nIndia faces greater setback\n\nOn the other hand, India is facing a more challenging situation. In Indian Punjab, around 200,000 hectares, or 28pc of the planted area, has been impacted by floods, according to rice market expert Hamid Malik. This damage has been compounded by the timing of the floods, which hit early-maturing Basmati varieties just before harvest. Moreover, a shortage of nitrogen-based fertiliser at a critical stage of the crop’s growth has added further strain to the Indian Basmati crop.\n\nIndian Punjab’s Basmati planted area has already dropped by 24pc compared to last year, as many farmers opted for the government-guaranteed Common Paddy. To meet export targets, Indian exporters are now turning to less-affected regions like Haryana, Western UP, and even non-GI-tagged Madhya Pradesh.\n\nExport outlook\n\nDespite the initial panic caused by media reports, Pakistan’s Basmati crop is now at a critical pollination stage, with favourable weather conditions helping to stabilise production. The dual rainfall systems in Pakistan, with both Monsoon and Mediterranean Westerly rains, have provided crucial moisture in September, when the Monsoon rains began to retreat.\n\nAlthough global Basmati importers had initially responded to media reports with higher prices, the emerging, less severe damage estimates from Pakistan should help stabilise the international market. With Pakistan’s crop showing greater resilience, REAP expects to meet its export commitments and may be able to capitalise on the relative setbacks in India’s Basmati production this season.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:23:16.574Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944897/basmati-crop-remains-resilient",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:30:58.000Z"
}
