{
  "title": "Isolated Netanyahu makes failed bid to justify ‘genocide’ - World - DAWN.COM",
  "author": null,
  "content": "UNITED NATIONS: As President Donald Trump claimed being close to a deal to end the war in Gaza and bring prisoners home, an increasingly isolated Israeli Prime Minister Benjamin Netanyahu on Friday tried to rebut what he called “the false charge of genocide”.\n\nHe also denounced several Western countries for embracing Palestinian statehood, accusing them of pushing his country into “national suicide”.\n\nThe Israeli leader, who has an International Criminal Court’s arrest warrant against him for alleged war crimes, addressed mostly empty chairs in the UN General Assembly, as scores of delegates — including the Pakistan contingent — walked out when he took the stage.\n\nAt the same time, thousands of pro-Palestinian protesters blocked traffic near Times Square in New York to protest the killing of more than 65,000 people in Gaza by Israeli strikes in less than two years.\n\nIsraeli leader speaks to empty chairs as scores of delegates exit UNGA hall to boycott his address\n\n“War criminals don’t deserve any peace of mind. They don’t deserve any sleep,” said Andrea Mirez, a young woman who kept up an overnight noisy protest outside Netanyahu’s hotel.\n\nIn his speech, days after France, Britain and other Western powers amid worldwide protests against the ongoing war on Gaza recognised the state of Palestine, he showed a map of the Middle East, taking out a pen to cross out adversaries Israel has killed. He also vowed to “finish the job” against Hamas, even as President Donald Trump said he thought he had sealed a deal on a ceasefire.\n\nA senior White House official told Reuters that Trump will meet Netanyahu on Monday in Washington with the aim of reaching a framework for a deal.\n\nIn his speech, Netanyahu claimed that over time, many world leaders buckled. “They buckled under the pressure of a biased media, radical Islamist constituencies and antisemitic mobs… Behind closed doors, many of the leaders who publicly condemn us privately thank us. They tell me how much they value Israel’s superb intelligence services that have prevented, time and again, terrorist attacks in their capitals,” he claimed.\n\nHowever, he did not touch on the issue of annexing the occupied West Bank.\n\nResponse to speech\n\nGaza authorities described Netanyahu’s speech as one “filled with lies and blatant contradictions” and condemned it as a “desperate attempt to justify the war crimes and acts of genocide.”\n\n“Boycotting Netanyahu’s speech is one manifestation of Israel’s isolation and the consequences of the war of extermination,” Taher al-Nunu, the media adviser to the head of Hamas’s political bureau, said in a statement.\n\nAlso, Palestinian President Mahmoud Abbas, earlier speaking by video after the US denied him a visa, condemned Israel’s actions in Gaza as “a war of genocide”. He thanked the countries that recognised Palestinian statehood, pledged that Palestinian Authority would be ready to govern post-war Gaza.\n\nNew coalition to back Palestine\n\nOn the other hand, 12 countries — Britain, France, Japan, Saudi Arabia, Spain, Belgium, Denmark, Iceland, Ireland, Norway, Slovenia and Switzerland — announced a new coalition to financially support the cash-strapped Palestinian Authority as Israel withheld tax revenues of Palestinian Authority for past two years.\n\nThe Emergency Coalition for the Financial Sustainability of the Palestinian Authority “was established in response to the urgent and unprecedented financial crisis” confronting the PA, the Spanish foreign ministry said.\n\nIt aims to stabilise the Ramallah-based body’s finances, preserve its ability to govern, provide essential services and maintain security, “all of which are indispensable to regional stability and to preserving the two-state solution”, the statement added.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d70c5384625.jpg",
  "retrievedAt": "2025-10-12T04:22:56.005Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944861/isolated-netanyahu-makes-failed-bid-to-justify-genocide",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:30:47.000Z"
}
