{
  "title": "Two men confess to boy’s rape, murder in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Two men confessed before magistrates on Friday to raping a seven-year-old boy and murdering him by strangling him with a shoelace and striking him in the head with a brick.\n\nThe investigating officer (IO) produced both suspects before the judicial magistrate (East) and moved an application seeking to record their confessional statements.\n\nAs per Police Rules, Section 25.29, “When more than one person confesses or turns approver in a case, their confessions shall, if possible, be recorded by different magistrates and they shall not be allowed to meet one another till their evidence has been recorded in court.”\n\nBefore recording their statements, both magistrates gave the suspects sufficient time and asked them questions regarding their willingness to confess. The suspects made it clear to the court that they were giving their statements voluntarily.\n\nAfter recording their confessional statements, the court concerned sent them to prison on judicial remand and directed the IO to submit the challan within the stipulated period.\n\nThe counsel for the complainant, Jahangir Kalhoro, told Dawn that both the suspects had confessed to their guilt, stating that on the day of the incident — Sept 18 — at around 7pm, they saw the boy returning from a relative’s house and then they invited him to visit their cattle farm, where both suspects used to work together.\n\nAfter spending 15 to 20 minutes in the farm, both suspects sexually assaulted the boy in a room at the farm. They then attempted to strangle him with shoelaces before hitting him on the head with a brick and later attacking him with a heavy object, which led to his death, the counsel said.\n\nThey arranged a gunny bag and put the minor boy’s body into it, which was later recovered from an empty plot.\n\nResponding to a question about the motive, Advocate Kalhoro said the suspects murdered the boy “brutally” after committing the offence “out of lust” as they wanted to conceal their crime.\n\nHe added that the suspects also had “personal enmity” with the complainant’s family, as they had earlier sought a marriage proposal from a relative of the deceased. After the complainant’s family refused, they developed grudges against them.\n\nHe further stated that the discovery of the body was communicated through a relative of one of the suspects, who personally contacted the ambulance driver on his phone, claiming that the ambulance service (Chippa) had no official record of such a call.\n\nResponding to a query about whether more people could be implicated in the case, the counsel said that the investigation was ongoing, while the victim’s family believed others were also involved, including the wife of one suspect and his son-in-law, who had allegedly called the ambulance driver on his personal number.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:23:34.005Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944882/two-men-confess-to-boys-rape-murder-in-karachi",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:31:20.000Z"
}
