{
  "title": "South Korea scrambles to restore services after major state data centre fire - World - DAWN.COM",
  "author": null,
  "content": "A major fire at South Korea’s national data centre has crippled some government online services and internal networks, prompting a race on Saturday to bring the systems back online and a probe of what sparked a lithium-ion battery to start the blaze.\n\nThe fire is suspected to have started with an explosion on Friday night of the battery produced by South Korea’s LG Energy Solution during maintenance, damaging some servers and forcing the shutdown of hundreds of others, officials said.\n\nThe fire led to a “thermal runaway”, producing extreme heat in the server room at the National Information Resources Services in the city of Daejeon, preventing firefighters from taking aggressive actions to contain the blaze, fire and government officials said in press briefings.\n\nThe national data service acts as a cloud server for many government services and databases for the heavily wired Asian country. It operates data centres in other locations.\n\nThe fire, which began around 8:20pm (4:20pm PKT), was brought under control early on Saturday, but more than 600 servers remained in forced shutdown to protect data while firefighters worked to extract nearly 400 battery packs from the building as safety measures, officials said.\n\nThe cause of the initial spark was not known and was under investigation, they said.\n\nLG Energy Solution declined to comment as the case is under investigation. Some government ministries, the mobile identification system, the postal service, and the government legal database were among websites that remained down on Saturday after the fire in Daejeon, about 140 km (90 miles) from the capital Seoul.\n\nSome ministries are unable to use email, according to notices to reporters.\n\nPrime Minister Kim Min-seok apologised on Saturday for the inconvenience to the public from disrupted services and said the government would work swiftly to restore services. In the meantime, tax payment deadlines coming soon would be delayed, he said.\n\n“There were difficulties in containing the fire because of the nature of critical government systems being concentrated at one site,” Kim told a televised emergency meeting.\n\nThe internal networks of some government agencies in Daejeon and nearby Sejong were “paralysed”, Kim said. There was no estimate for when services would restart, the head of the data centre, Lee Jae-yong, told a briefing.\n\nOne person has been treated for a minor injury, a fire official told another press briefing. There was considerable fire damage at the location of the initial blaze on the fifth floor of the building, fire official Kim Ki-seon said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/271202137325e98.webp",
  "retrievedAt": "2025-10-12T00:15:13.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944960/south-korea-scrambles-to-restore-services-after-major-state-data-centre-fire",
  "dateList": "2025-09-27",
  "date_published": "2025-09-27T06:51:20.000Z"
}
