{
  "title": "Quadripartite moot urges Kabul to counter terrorism - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: The foreign ministers of China, Iran, Pakistan, and Russia, in a joint statement, have urged Afghan­istan to take “effective, concrete, and verifiable actions” to dismantle terrorist groups operating from its territory.\n\nThe foreign ministers in a meeting on the sidelines of the 80th UN General Assembly session reaffirmed support for Afghanistan as an “independent, united, and peaceful state, free from terrorism, war, and narcotics”, but underlined the need to prevent terrorists from using Afghan soil.\n\nThe four Asian states have been holding quadripartite consultations on Afghanistan since 2017, aimed at promoting reg­ional stability and coordinating efforts to counter terrorism, narcotics, and extremism emanating from Afghan territory. This informal grouping, which meets at ministerial and special representative levels, also seeks to facilitate political dialogue and regional economic integration in Afghanistan.\n\nThey expressed deep concern over the presence of groups such as ISIL, Al-Qaida, Tehreek-i-Tali­ban Pakistan (TTP), the East Turkestan Islamic Movement (ETIM), Jaish ul-Adl, the Balochistan Liberation Army (BLA), the Majeed Brigade, and others, calling them a “serious threat to regional and global security.”\n\nThe joint statement emphasised that strengthening peace and stability in Afghanistan and countering terrorism, radicalism, and narcotics are “common interests in the region”.\n\nThe four sides also called for adjustments to the 1988 UN sanctions regime in line with ground realities, including travel exemptions for some Taliban officials; stressed the need for continued humanitarian assistance to Afghans, urging that aid be delinked from political considerations; supported regional economic initiatives to ease Afghan­is­tan’s dire situation and integrate it into regional trade and connectivity; and appealed to the international community to intensify emergency huma­nitarian aid while reaffirming their willingness to exp­and economic cooperation with Afghanistan.\n\nThe ministers affirmed their support for diplomatic efforts aimed at achieving a political settlement of the Afghan issue and backed the role of the international community, particularly the United Nat­ions.\n\nThey noted the importance of regi­o­nal mechanisms such as the Moscow For­mat, the Foreign Ministers’ Meeting of Afghanistan’s Neighb­ouring Countries, and the Shanghai Co­operation Organisa­tion (SCO) in advancing a political solution.\n\nThey welcomed the joint meeting of the Special Representatives of China, Iran, Pak­is­­tan, and Russia on Afghan­istan, held on Sept 12 in Dushanbe and encouraged the con­­tinuation of these quadrilateral consultations.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/271146074142095.webp",
  "retrievedAt": "2025-10-12T04:23:16.687Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944873/quadripartite-moot-urges-kabul-to-counter-terrorism",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:30:41.000Z"
}
