{
  "title": "Defence minister skirts ‘nukes’ question, says defence pact has formalised relationship between KSA, Pakistan - World - DAWN.COM",
  "author": null,
  "content": "Defence Minister Khawaja Asif has said that the recently signed Pak-Saudi defence pact had “formalised” a relationship between the two countries that was previously “a bit transactional” while skirting a question regarding whether or not this agreement involved nuclear weapons.\n\nAsif made the remarks during an interview with journalist Mehdi Hasan for Zeteo. The full interview is behind a paywall but the media company has shared a five-minute preview as well as clips on social media.\n\nOn September 17, Prime Minister Shehbaz Sharif and Saudi Crown Prince Mohammed bin Salman had signed a “Strategic Mutual Defence Agreement” in Riyadh, pledging that any attack on either nation would be treated as an act of aggression against both.\n\nThe timing of the accord, coming on the heels of an Arab summit that signalled a shift towards collective security — in the wake of Israel’s attack on Qatar — hints that it is rooted in current world affairs and reflects the defence concerns of both countries. It also comes just months after a deadly India-Pakistan conflict in May, as well as the 12-day war between Iran and Israel in June.\n\nPreviously, Asif had suggested that Pakistan’s nuclear capabilities could be made available to Riyadh under the new framework. However, in a subsequent interview the minister denied that nuclear weapons were part of the accord, saying they were “not on the radar”.\n\nIn the preview posted on Zeteo’s website on Friday night, Hasan asked Asif about the defence pact.\n\n“How much of it is a reaction to the Israeli bombing of Qatar?” he asked.\n\n“It is not a reaction to what happened in Qatar because this was being negotiated for quite some time. So it’s not a reaction; perhaps it must have sped it up a bit but that is all. It was already in the offing,“ Asif replied.\n\nHasan then pointed out that Pakistan was the only nuclear power in the Muslim world, noting that Saudi Arabia had expressed interest in being the second. He also pointed out that Asif had previously stated that nuclear weapons “were not on the radar” for this pact.\n\n“Is Saudi Arabia protected by Pakistan’s nuclear umbrella per this agreement or not?” he asked.\n\n“We have had a very long defence relationship with Saudi Arabia, spanning five or six decades. We had a military presence over there, perhaps more than four or five thousand at the peak and we still have military presence over there. I think we have just formalised that relationship which was previously a bit transactional,” Asif responded.\n\n“Formalised with or without the nukes?” Hasan probed.\n\nHowever, the minister refrained from going into the details.\n\n“I will refrain from going into the details but it’s a defence pact and defence pacts are normally not discussed publicly,” he said.\n\nHasan then pointed out that journalist Bob Woodward, in his 2024 book War, had quoted Saudi Crown Prince Mohammed bin Salman telling a US senator that he could “just buy” a bomb from Pakistan.\n\n“I think that is just sensationalised […] No, I don’t believe that quote,” the minister replied.\n\n“So you are not in the business of selling nuclear weapons to Saudi Arabia?”\n\n“No. We are very responsible people,” Asif responded.\n\nIn a separate video shared on Instagram, Hasan asked the minister whether Pakistan’s now close relationship with the United States could jeapardise its vital relationship with China.\n\n“Obviously, America and China are at loggerheads,” he said.\n\n“No, we are not worried about that because it’s a time-tested relationship with China since the late 50s,” Asif replied.\n\nWhen probed further about Pakistan “flirting” with the US, the minister said that China was not worried in this regard.\n\n“Is your strategic future with China or with the US? It can’t be both,” Hasan pointed out.\n\nThe minister responded by saying that China had been a “very reliable ally” for Pakistan.\n\n“A major portion of our arms are from China. And our defence cooperation is increasing. It is much more robust than before,” he said, adding that this was due to the “unreliability of other sources, like the US”.\n\n“So are you basically saying that your strategic future is with China, not the US?” Hasan asked.\n\n“Yeah […] they are reliable and they are our neighbours. We share borders and we share geography,” the minister said.\n\nIn another clip posted on Instagram, Hasan asked about incarcerated PTI founder Imran Khan and asked why he had been arrested.\n\n“That’s the problem with Pakistan: you all imprison each other every time you come into power […] If it was unjust to you, isn’t it unjust to Imran?” he asked.\n\nThe minister asserted that it was not a tit-for-tat measure.\n\nHowever, Hasan then pointed out Amnesty International had released a report on Imran’s arrest while a United Nations group had said that there was no legal basis for Imran’s imprisonment and termed it arbitrary.\n\n“Well, I think they have an opinion with which I disagree,” Asif responded.\n\n“Their opinion is that you are breaking the law,” Hasan said.\n\n“No, we aren’t breaking the law,” Asif asserted.\n\n“Pakistan has a situation whereby we are trying to recover from a very, very — misrule or bad rule or whatever you can call it — for three-and-a-half years,” the minister said.\n\nHe also further said that whole families were arrested during Imran’s tenure.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:15:13.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944953/defence-minister-skirts-nukes-question-says-defence-pact-has-formalised-relationship-between-ksa-pakistan",
  "dateList": "2025-09-27",
  "date_published": "2025-09-27T06:45:23.000Z"
}
