{
  "title": "Explainer: What is driving the fighting between Israel and Yemen’s Houthis? - World - DAWN.COM",
  "author": null,
  "content": "The Houthi rebels, who control swathes of Yemen, have used an array of sophisticated weapons — including ballistic missiles and “kamikaze” drones — in attacks on international shipping in the Red Sea in protest against Israel’s ongoing military onslaught in the Gaza Strip.\n\nAttacks on cargo ships and fuel tankers began in November 2023, when Houthi hijacked the Galaxy Leader cargo vessel as it was passing through the southern Red Sea. They redirected it toward Hodeidah port in Yemen and seized the crew. Since then, at least 43 more ships have been attacked in the area, with four seafarers killed and two vessels sunk.\n\nThe Houthi attacks have disrupted international commerce, forcing international shipping to take the long route around South Africa to avoid being struck. Around 12 per cent of shipping passes through the Red Sea and the increase in delivery costs is stoking fears it could trigger a fresh bout of global inflation.\n\nRecent developments between Tel Aviv and Sanaa include the killing of the Houthi government’s prime minister and several other ministers in an Israeli strike on the Yemeni capital, while the Houthis have launched missiles and drones at Israel, targeting Tel Aviv and other cities like Eilat, where a Houthi drone wounded 22 people earlier this week.\n\nThe Houthis have also hit American vessels during this almost two-year-long period, prompting the United States to launch a series of strikes, the most recent ones being in March.\n\nIn the late 1990s, the Houthi family in Yemen’s far north set up a religious revival movement for the Zaydi sect of Shia Islam, which had once ruled the country but whose northern heartland had become impoverished and marginalised. As friction with the government grew, they fought a series of guerrilla wars with the national army and a brief border conflict with Saudi Arabia.\n\nA civil war broke out in late 2014, when Sanaa was seized by the Houthis. Worried by the growing influence of Iran along its border, Saudi Arabia intervened at the head of a Western-backed coalition in March 2015 in support of the Saudi-backed government.\n\nThe Houthis established control over much of the north and other big population centres, while the internationally recognised government based itself in Aden.\n\nYemen enjoyed a period of relative calm amid a UN-led peace push, but the Houthi attacks on Israel have increased the risks of conflict in the country.\n\nThe Houthis say their attacks on shipping routes in the Red Sea are a show of solidarity for the Palestinians and Hamas amid the latter’s fighting with Israel.\n\nSince November 2023, the Houthis have launched more than 100 attacks on ships off Yemen’s coast, causing traffic passing through the Suez Canal to fall by 75pc in 2024 and increasing transit times by an average of seven to 14 days, according to US-based supply chain management technology company project44.\n\nWhile the militia has said it attacked only vessels with links to Israel, the US and Britain, shipping industry sources have said all ships were at risk.\n\nA period of relative calm started in January this year alongside the Gaza ceasefire, but the group then warned in March it would resume its naval strikes if Israel did not lift a blockage of aid into Gaza. They then announced a resumption of attacks with immediate effect on March 12.\n\nSince November 2023, Israel has intercepted multiple drones and missiles launched from Yemen and also struck Houthi facilities in response.\n\nAddressing the United Nations General Assembly on Friday, Israeli Prime Minister Benjamin Netanyahu detailed Tel Aviv’s military activity over the past year, stating, “We’ve hammered the Houthis.\n\n“So here’s where things stand today: half the Houthi leadership in Yemen [is] gone,“ he said.\n\nOver the past six months alone, Israel has launched devastating strikes on Yemen, targeting Sanaa, Houthi leadership, Houthi-controlled areas, ports and energy facilities. The port of Hodeida — a key entry point for Yemeni aid — has been struck several times over the past year, in April, May, June and July.\n\nIsraeli Defence Minister Israel Katz vowed earlier this month to inflict the biblical 10 plagues of Egypt on the Houthis after they stepped up missile attacks against Israel.\n\nThe Houthis are firing missiles at Israel again. A plague of darkness, a plague of the firstborn — we will complete all 10 plagues,” Katz posted on X. He was referring to the 10 disasters that the Book of Exodus says were inflicted on Egypt by the Hebrew God to convince the pharaoh to free the enslaved Israelites.\n\nBased on this pattern of tit-for-tat strikes, it is likely that these attacks and interceptions will continue until Israel ceases military operations in Gaza — that have only intensified.\n\nToday, Interior Minister Mohsin Naqvi said that a liquefied petroleum gas tanker with 27 crew members, including 24 Pakistanis, was attacked by an Israeli drone while it was docked at a port in Yemen earlier this month.\n\nNaqvi added that an LPG tank had exploded following the attack, but the crew managed to extinguish the fire.\n\n“The vessel was subsequently stopped by Houthi boats and the crew were held hostage aboard the ship,” he said, adding that the tanker and its crew “have now been released by the Houthis and are out of Yemeni waters”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/271957582dfad3e.webp",
  "retrievedAt": "2025-10-12T00:15:08.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944999/explainer-what-is-driving-the-fighting-between-israel-and-yemens-houthis",
  "dateList": "2025-09-27",
  "date_published": "2025-09-27T15:11:32.000Z"
}
