{
  "title": "Former envoys hail ‘strategic moment’ in US-Pakistan ties - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Following PM Sheh­baz Sharif’s White House visit, former ambassadors have hailed the remarkable turnaround in Pakistan-US ties following the ebb during the Biden administration.\n\nBut diplomatic observers are quick to add a warning: the roller coaster nature of relations in the past, which saw several highs and many lows, warrants caution.\n\nMaleeha Lodhi, who previously served as Pakistan’s Permanent Representative to the United Nations and is a former ambassador to the US, termed the continuing warming of relations between the US and Pakistan a “remarkable turnaround” after ties had plunged to a low in the wake of the US withdrawal from Afghanistan.\n\n“The meeting has injected greater momentum to the reset of Pakistan-US ties,” she said, adding that inviting a Pakistani premier to the White House after six years reflected “renewed US recognition of Pakistan’s geopolitical importance in the region and the Middle East at a time of changing international dynamics”.\n\nLodhi terms post-Biden thaw ‘remarkable turnaround’; Masood Khan welcomes revival of intelligence cooperation\n\n“But an assessment of the significance of the White House meeting has to wait for details of what was discussed and which areas the two countries have agreed to cooperate in,” Ms Lodhi added.\n\n“Caution is warranted by the roller coaster nature of relations in the past, which saw several highs and many lows,” she said.\n\nSardar Masood Khan, a former ambassador to the US, UN and China, described the White House me­­eting as a “new strategic mom­ent” in Islamabad-Washington relations.\n\nIn a statement, he said that while the optics of the meeting were encouraging, the real substance lay in new frameworks of cooperation on peace, security and economic transformation.\n\n“Pakistan and Saudi Arabia’s unity has been pivotal in persuading President Trump and his team to avoid escalation in Gaza and to work instead toward a sustainable solution for Palestine. The roadmap presented by US Special Envoy Steven Witkoff is evidence that our diplomacy is being recognised,” he added.\n\nOn bilateral matters, he said the meeting produced significant economic openings, including reduced tariffs on Pakistani exports and agreements on critical minerals, renewable energy, cryptocurrency and oil exploration.\n\nMr Khan also welcomed the rev­ival of intelligence cooperation be­­tween the two countries, recalling Pakistan’s past collaboration with US agencies in counterterrorism.\n\n“The renewed focus will address threats emanating from Afgha­nis­tan, Daesh and the Tehreek-i-Tali­b­­an Pakistan (TTP), while also spotlighting India’s extensive terror networks in the region,” he said.\n\nHe claimed that India had established operational and financial infrastructures targeting Pakistan and said both Islamabad and Washington had now agreed to dismantle these threats together.\n\nTariq Naqash in Muzaffarabad also contributed to this report\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:15:37.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944924/former-envoys-hail-strategic-moment-in-us-pakistan-ties",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:30:52.000Z"
}
