{
  "title": "Four teenagers killed by explosive device in KP’s Bajaur: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least four teenagers were killed and two other people were injured when a mortar shell exploded in a field in Khyber Pakhtunkhwa’s Bajaur area on Saturday, according to police officials.\n\nBajaur District Police Officer (DPO) Waqas Rafiq told Dawn.com about the incident and said that the dead and injured were transported to Khar Bajaur District Headquarters Hospital.\n\n“Initial reports suggest that a mortar shell exploded in the field, killing the young men,” he said, adding that the deceased ranged in age between 13 and 18.\n\nMeanwhile, Nisar Baaz Khan, a member of the provincial assembly (MPA) from Bajaur, condemned the incident in a statement on social media and claimed that according to local residents, a quadcopter hit the village and killed innocent civilians.\n\n“What crime had these innocent flower-like children committed? What purpose is being served by staining the earth with their innocent blood?” he was quoted as asking.\n\n“The state institutions and provincial government have repeatedly claimed that various areas of Mamond (tehsil) have been cleared. If that is true, then on what grounds are drone strikes being conducted in these villages and settlements?”\n\nThe MPA questioned why operations are being carried out in the area when the authorities claim there are no terrorists there.\n\n“Are the lives of our children so cheap that they can be taken so easily?”\n\nHe continued: “For decades, our people have been killed in the name of counter terrorism; their homes were destroyed and now innocent lives are being targeted once again.”\n\nLast week, security forces carried out an airstrike in KP’s Tirah area, which resulted in four homes being destroyed and killed civilians, including children.\n\nA statement issued by the Chief Minister’s Secretariat said CM Ali Amin Gandapur met a delegation from the district following the incident with PTI MNA Iqbal Afridi, the KP chief secretary, additional chief secretary (home), Peshawar commissioner and other officials also present in the meeting that reviewed the law and order situation in the “context of the unfortunate incident” that occurred in Tirah.\n\n“Martyrdom of civilians in the incident is regrettable and condemnable. Martyrdom of civilians as a result of operations against terrorists is unacceptable,” the statement quoted CM Gandapur as saying.\n\nThe Human Rights Commission of Pakistan said it was “deeply shocked” to hear about reports of the killing of several civilians caused by alleged “aerial bombing” in Tirah, and demanded a probe into the matter.\n\nIt demanded that “the authorities carry out an immediate and impartial inquiry into the incident and hold to account those responsible”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/27205557a8289c2.webp",
  "retrievedAt": "2025-10-12T00:15:08.143Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945003/four-teenagers-killed-by-explosive-device-in-kps-bajaur-police",
  "dateList": "2025-09-27",
  "date_published": "2025-09-27T16:22:00.000Z"
}
