{
  "title": "Sutlej flood continues wreaking havoc in Multan, Bahawalpur, Lodhran - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A medium to low-level flood in the Sutlej River continues to wreak havoc across districts of Multan, Bahawalpur, and Lodhran, forcing thousands of their residents to remain displaced, many of them living in relief camps established along embankments for the past 16 days.\n\nThe floodwater has submerged over 200 villages in Jalalpur Pirwala, Lodhran, and Uch Sharif, leading to evacuations and severing critical transport links, including the M-5, which has been closed for 15 days.\n\nThe National Highway Authority (NHA) is reinforcing the motorway with stone barriers to prevent further damage. Local connectivity has also been severely disrupted, with Jalalpur Pirwala cut off from Lodhran and Uch Sharif as key roads, including Gilani Road where the controlled breach was not plugged.\n\nJalalpur Pirwala, Lodhran and Bahawalpur are particularly affected, with villages such as Noraja Bhutta, Basti Lang, Kotla Chakar, Bahadurpur, and Dunyapur surrounded by stagnant water reaching the height of eight to 10 feet.\n\nFloodwater stuck between the M-5 and Noraja Bhutta embankment affecting 200 villages\n\nNasir Khan Baloch, a resident of Kotla Chakar, says the water is continuously rising along the eastern side of the M-5 and their houses are collapsing.\n\n“The Noraja Bhutta embankment is not plugged yet and it would take 10 more days to close the breaches, which meant that their homes would completely collapse due to standing water.”\n\nHe said they were living along the Gilani Road and their entire village would be destroyed completely.\n\n“The water is not passing through culverts of M-5 motorway and stones are also placed to close these culverts. How will the water recede from our areas in coming days when it does not find a way to reach the Chenab River?” he posed a question to the authorities concerned.\n\nMuhammad Bakhsh, a resident of Basti Lang, says the water would not recede until the government does not breach the motorway.\n\n“Already all of our belongings have been destroyed and it is becoming challenging to live in camps.” He says they would not forget this situation created by different state departments.\n\nWhen contacted, the NHA, irrigation department and district administration officials for replies about the water creating a reservoir-like situation between the M-5 and Noraja Bhutta embankment, which was continuously diverting around 60pc of the Sutlej River water towards the motorway and rising the water level in around 200 villages, they were of the view that they were supporting each other to address the issue.\n\nThe irrigation chief says they are plugging the breaches at Noraja Bhutta embankment while district administration officials say that they are supporting the NHA and irrigation department to fill the breaches. The NHA chief is of the view that the authority has a mandate to protect the motorway and it would do it at any cost.\n\nRescue 1122 is providing transportation services in Jalalpur Pirwala, Basti Lang, Dua Chowk, and other affected areas. While no new evacuations reported in Jalalpur Pirwala over the past 24 hours, 150 transportation cases were assisted.\n\nA Rescue 1122 spokesperson confirms that the evacuation phase is complete, and efforts are focused on transportation, with priority given to children, women, and the elderly.\n\nMultan Deputy Commissioner Waseem Hamid Sindhu says emergency measures for the restoration of flood-damaged infrastructure in Jalalpur Pirwala are ongoing.\n\nIn this regard, the district administration has continuously stationed heavy machinery in Jalalpur Pirwala for restoration operations.\n\nMr Sindhu says that during a visit to the Jalalpur motorway section, he received a briefing from the authorities and inspected the repair work on the Sui gas pipeline service.\n\n“The flood relief camps would remain established in Jalalpur Pirwala for public convenience until normalcy returns. All departments, including the NHA and Irrigation, are engaged in a joint operation to restore the infrastructure.”\n\nThe Provincial Disaster Management Authority reports that the Sutlej River’s water flow has normalised at all key monitoring points, including 40,000 cusecs at Ganda Singhwala and 55,000 cusecs at Suleimanki.\n\nThe PDMA says that the river’s flow has stabilised after two months of elevated levels and floodwaters are receding in affected areas.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:15:25.119Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944843/sutlej-flood-continues-wreaking-havoc-in-multan-bahawalpur-lodhran",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:31:25.000Z"
}
