{
  "title": "Europe grab 3-1 lead as US seek Trump boost at Ryder Cup - Sport - DAWN.COM",
  "author": null,
  "content": "FARMINGDALE: Europe delivered a stunning early domination of the United States to quiet a raucous New York crowd and seize a 3-1 lead as US President Donald Trump arrived for Friday’s opening matches of the 45th Ryder Cup.\n\nTrump was faced with American carnage at Bethpage Black as Europe started 3-0 for the first time on US soil.\n\n“Very proud. They have come out very strong,” Europe captain Luke Donald said. “They have really thrived in this tough environment.” In morning foursomes (alternate shot) matches, US stars won only four holes from the first three matches.\n\nTrump told reporters as he boarded a plane for New York that the US team wasn’t doing well and, “I said let’s get on the plane. We have to fly and help them.”\n\n“We just had the President fly over in Air Force One so I’ve got a feeling things are going to turn here,” US captain Keegan Bradley said. “It’s not exactly what we wanted… but I’ve got a lot of faith in our boys.”\n\nWorld number two Rory McIlroy and Tommy Fleetwood won four of the first six holes to cruise past Americans Collin Morikawa and Harris English 5&4. The “Fleetwood Mc” Cup pairing improved to 3-0.\n\n“It has been amazing,” McIlroy said.\n\nMcIlroy, who won the Masters in April to complete a career Grand Slam, won four holes on birdie putts from eight feet or less and blasted from the rough to inches from the sixth hole to set up a Fleetwood birdie.\n\n“One step at a time,” Fleetwood said. “We’ll go all together and see where we get.” Europe’s Matt Fitzpatrick and Ludvig Aberg also won four of the first six holes and never trailed in shocking top-ranked Scottie Scheffler and third-ranked Russell Henley 5&3.\n\n“We hit a lot of nice shots and made it hard for them,” Aberg said. Taking down the two highest-ranked US players was big for Europe.\n\n“Russ and I did some good things. We just didn’t hole enough putts early,” Scheffler said. “We had some chances. The putts just didn’t fall.” Spain’s Jon Rahm and England’s Tyrrell Hatton outfought Bryson DeChambeau and Justin Thomas 4&3, the Americans winning only the first hole as the European duo improved to 5-0 in Cup foursomes.\n\n“We were aware it was going to be a tough day,” Rahm said. “We battled. We stayed in it. We started hitting putts and found our rhythm and were able to get it done again.” “We dug in,” Hatton said. “The atmosph­ere was pretty intense but good fun.”\n\nAmericans Xander Schauffele and Patrick Cantlay never trailed in beating Europe’s Robert MacIntyre and Viktor Hovland 2-up, taking the last two holes after a Europe rally.\n\n“It was a tough match,” Cantlay said. “Nice to get the point on the board and the fans going.” Trophy holders Europe seek the first road triumph by either side since their 2012 “Miracle at Medinah” while the Americans try to win back the Cup after losing two years ago in Rome.\n\nThe Americans need 14.5 points to win the Cup. Europe, winners in 10 of the past 14 meetings, need only 14 of 28 points to retain the trophy.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d7132876738.gif",
  "retrievedAt": "2025-10-12T00:15:26.072Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944889/europe-grab-3-1-lead-as-us-seek-trump-boost-at-ryder-cup",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:31:08.000Z"
}
