{
  "title": "Security forces kill 17 ‘India-sponsored’ terrorists in KP’s Lakki Marwat: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces have killed 17 “India-sponsored” terrorists during an intelligence-based operation (IBO) in the Lakki Marwat district of Khyber Pakhtunkhwa, the military’s media affairs wing said on Saturday.\n\nAccording to a statement issued by the Inter-Services Public Relations (ISPR), security forces conducted the IBO on the night between Friday and Saturday, on the “reported presence of khwarij belonging to Indian proxy, Fitna al Khwarij.”\n\nThe state uses the term Fitna al Khwarij to refer to terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP).\n\nDuring the operation, “own troops effectively engaged the khwarij location and resultantly, seventeen Indian sponsored khwarij were sent to hell,” the ISPR statement said.\n\nIt added that weapons and ammunition were recovered from the slain terrorists, “who remained actively involved in numerous terrorist activities against the security forces and law enforcement agencies, as well as [in the] killing of innocent civilians”.\n\nThe statement said a sanitisation operation was being conducted to “eliminate any other Indian-sponsored khwarji found in the area”.\n\nThe ISPR also reaffirmed the security forces’ determination to wipe out the menace of “Indian-sponsored terrorism” from the country.\n\nPresident Asif Ali Zardari has congratulated the security forces on their successful operation in Lakki Marwat, according to a statement issued by his secretariat.\n\nHe paid tribute to the courage and sacrifices of the forces, saying “their efforts reflect the nation’s firm resolve to eradicate Indian proxy terrorism from Pakistan”.\n\n“The complete elimination of Fitna al Khwarij and its networks is vital for lasting peace and stability in the country,” he added\n\nPresident Zardari reaffirmed that the entire nation stands united with its valiant armed forces in the fight against terrorism.\n\nPakistan has lately been witnessing an uptick in terrorist activities, mainly in KP and Balochistan. In November 2022, the TTP, after breaking a ceasefire deal with the government, had vowed to escalate attacks against the security forces, the police, and other law enforcement agencies’ personnel.\n\nIn August, terrorists in Lakki Marwat had carried out a series of militant attacks, killing three soldiers and a woman while injuring three others, including two soldiers.\n\nAdditional reporting by Nadir Guramani.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:15:11.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944979/security-forces-kill-17-india-sponsored-terrorists-in-kps-lakki-marwat-ispr",
  "dateList": "2025-09-27",
  "date_published": "2025-09-27T11:55:09.000Z"
}
