{
  "title": "Gunship helicopters pound terrorist hideouts in Lower Dir’s Maidan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LOWER DIR/LAKKI MARWAT: Security forces on Friday pounded terrorist hideouts with the help of gunship helicopters in different parts of Maidan area in Lower Dir district.\n\nAlso, two terrorists were killed in a fierce clash with police in Bannu district.\n\nResidents of Maidan told Dawn that three gunship helicopters resorted to heavy shelling on terrorist hideouts in Sar Banda, Mulayano Banda and Abdullah Banda areas.\n\nThey said the shelling lasted around one and a half hours before copters left the area.\n\nOfficials said the operation was launched over reports of increased terrorist presence and movement in the area.\n\nBannu police kill two terrorists in clash\n\nDetails of damage caused to terrorists could not be ascertained.\n\nResidents insisted that a child, who had gone to a nearby hill, was slightly injured in the shelling. He was shifted to the THQ hospital in Lal Qila.\n\nThey said security forces had taken positions in government schools in Atto and Mulayano Banda areas. The schools were vacated a few days ago.\n\nThe residents said terrorists were recently spotted in Mond Ghar, Kas Ghurgi, Mishwano and Sar Banda areas.\n\nOn Sept 11, seven Frontier Corps personnel were martyred and 13 injured in a clash with terrorists in Sar Banda area of Maidan.\n\nMaidan was once a stronghold of the proscribed Tehreek Nifaz-i-Shariat Mohammadi led by Maulana Sufi Mohammad.\n\nIn 2008, terrorists took control of most Maidan parts and set up parallel courts. However, a military operation in April 2009 forced most TTP fighters to flee to Afghanistan and take shelter in Kunar province. The operation displaced around 300,000 residents, who lived either in camps or with relatives in other parts of the province.\n\nAlso, two terrorists were killed in a fierce clash with police in Dil Mamashkhel area of Bannu district late on Thursday.\n\nA police official told Dawn that the clash took place within the limits of the cantonment police station when a police team assisted by commandos of the counterterrorism department reached the rural area on the information about the presence of terrorists.\n\nHe said the terrorists, who were planting an improvised explosive device on the roadside, opened fire on the policemen.\n\n“In retaliatory fire, law enforcers killed two terrorists. However, the others fled, taking advantage of thick and dense bushes and populated areas,” he said.\n\nMeanwhile, elders from rural areas in Lakki Marwat district on Friday vowed to check crimes and anti-peace activities.\n\nDuring a jirga in the Masha Mansdoor area on Friday, they said the people involved in robberies and anti-peace activities won’t be spared.\n\nThe participants included elders and villagers from Titterkhel, Omar Titterkhel, Tabi Murad, Ghazikhel, Zer Mallahkhel, Samandar Titterkhel, Sharbikhel, Qutabkhel, Badnikhel, Jhangkhel, Zangikhel, Mandrakhel and Mash Mansoor.\n\nAn elder complained that robberies were reported in rural areas of the district after the start of winter.\n\nHe said highways and roads in urban and rural areas had become unsafe due to the presence of “anti-state elements.”\n\nThe other participants said they would soon start pruning trees on both sides of the link road from Umar Adda to Mandrakhel via Masha Mansoor to check criminal and terrorist activities.\n\n“In case a robbery occurs on a village road, the Chagha Party (armed villagers) will chase outlaws until they’re captured,” an elder said.\n\nHe said if any member of the Chagha Party was killed or injured by terrorists or criminals, elders of all rural areas would jointly compensate the victim’s family.\n\nThe elders asked youths to guard their villages and hamlets during the nighttime.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:23:33.891Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944821/gunship-helicopters-pound-terrorist-hideouts-in-lower-dirs-maidan",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:31:38.000Z"
}
