{
  "title": "Public debt servicing to cost Rs6.4tr - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As a visiting mission of the International Monetary Fund (IMF) reviews Pakistan’s fiscal and monetary performance and outlook, the government has announced a borrowing plan worth about Rs6.4 trillion during the current fiscal year to service total public debt that stood at Rs81.5tr as of June 30.\n\nThe Ministry of Finance released the Annual Borrowing Plan FY26 as required under section 13 of the Fiscal Responsibility and Debt Limitation Act (FDRLA) to meet financing needs.\n\n“The net domestic borrowing is projected at Rs6.395tr during FY26, said the plan that is aligned with the Medium-Term Debt Management Strategy 2026-28 (MTDS) which incorporates macroeconomic and fiscal frameworks from the FY26 budget.\n\nMaximum reliance will be on the domestic borrowing to finance the federal fiscal deficit estimated at Rs6.5tr during the current fiscal year as annual interest expenditure has been budgeted at Rs8.207tr. With a planned primary surplus of Rs1.706tr, the deficit is estimated at Rs6.5tr. The external debt servicing cost has been estimated at Rs1.009tr and domestic interest expense of Rs7.2tr.\n\n“Borrowing strategies will be further operationalized through quarterly auction calendars, which are issued on monthly rolling basis, with the major reliance on domestic borrowing to finance of the fiscal deficit.\n\nThe plan seeks increasing the share of long-term fixed-rate instruments and diversifying the debt portfolio with instruments like Shariah compliant instruments and Zero-Coupon Bonds. The domestic financing plan will focus on limited net issuance of T-Bills so that existing maturities of quarterly, biannual and annual T-bill are refinanced.\n\nThis will be done through emphasis on long-term securities: primary reliance on Pakistan Investment Bonds worth Rs4.336tr and sukuks worth Rs1.895tr.\n\nIn addition, zero coupon bonds would be expanded to attract long term institutional investors and diversify investor base. Also, the government would increase Sharia-compliant instruments with special focus to attract institutional investors in fixed-rate sukuk participation. For this, the debt management office is exploring structures such as Ijarah, Wakalah and Murabaha to further increase the composition of shariah compliant instruments in overall debt.\n\nFurthermore, proposals for efficient utilisation of assets, including the development of Asset Light Sukuk (ALS) structures are being evaluated and implementation is expected to begin this year in consultation with Islamic Joint Financial Advisor banks. Government also plans to engage all stakeholders to develop the Shariah Compliant Yield Curve.\n\nIt said the government was also projecting net external financing of $364m, equivalent to Rs106bn. The External Financing Plan will focus on multilateral loans worth $1.9bn and bilateral deposit rollovers worth $4bn from China and $5bn from Saudi Arabia. In addition, the plan also includes raising $400m through Panda and Sustainable Bonds. Eurobond maturities worth $1.8bn would be repaid.\n\nOverall, Gross Financing Needs (GFN) as a percentage of GDP are projected at 21pc to FY2026.\n\nThis reduction will primarily be supported by fiscal consolidation transpiring into lower fiscal deficit, primary surplus, and lower debt principal and interest payments projected for FY2026.\n\nThe ministry said the total public debt was recorded at Rs80.5tr at end June 2025, comprising Rs54.5tr in domestic and Rs26tr in external debt.\n\nPublished in Dawn, September 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:15:26.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944899/public-debt-servicing-to-cost-rs64tr",
  "dateList": "2025-09-27",
  "date_published": "2025-09-26T23:30:58.000Z"
}
