{
  "title": "IMF lowers Pakistan’s GDP growth estimate to 3pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Almost a month before scheduled negotiations on its $7bn Extended Fund Facility (EFF) with Pakistan, the Inter­national Monetary Fund (IMF) on Friday lowered the country’s growth estimate to 3pc for current fiscal year, down from 3.2pc it had projected about three months ago.\n\nIn its World Economic Outlook Update released on Friday, the IMF kept the economic growth forecast for next fiscal year (FY2026) unchanged at 4pc but lowered by 0.2 percentage points for current year.\n\nThe IMF did not specifically explain factors leading to its downward revision in GDP growth rate while keeping the global growth rate unchanged at 3.3pc for both current and next years. Lower than estimated cotton output and struggling industrial output appeared to be key reason that is also creating substantial revenue shortfalls.\n\nThough the fund kept the global growth outlook broadly unchanged from October, it said divergences across countries were widening. Among advanced economies, the US is stronger than previously projected on continued strength in domestic demand, thus raising growth projection for the US this year by 0.5 percentage point to 2.7pc.\n\nLatest World Economic Outlook keeps economic growth forecast for next fiscal year unchanged at 4pc\n\nGrowth in the euro area, by contrast, is likely to increase only modestly, to 1pc from 0.8pc in 2024, mainly because of geopolitical tensions.\n\nHeadwinds include weak momentum, especially in manufacturing, low consumer confidence, and the persistence of a negative energy price shock. Euro­pean gas prices remain about five times as high as in the US, versus twice as high before the pandemic.\n\nIn other advanced economies, two offsetting forces keep growth forecasts relatively stable. On the one hand, recovering real incomes are expected to support the cyclical recovery in consumption. On the other hand, trade headwinds including the sharp uptick in trade policy uncertainty are expected to keep investment subdued.\n\nIn emerging market and developing economies, growth performance in 2025-26 is expected to broadly match that in 2024. With respect to the projection in Octo­ber, growth in 2025 for China is marginally revised upward by 0.1 percentage point to 4.6pc.\n\nThis revision reflects carryover from 2024 and the fiscal package anno­unced in November largely offsetting the negative effect on investment from heightened trade policy uncertainty and property market drag.\n\nIn India, growth is projected to be solid at 6.5pc in 2025-26, as projected in October and in line with potential. The growth in the Middle East and Central Asia has been projected to pick up, but less than expected in October. This mainly reflects a 1.3 percentage point downward revision to 2025 growth in Saudi Arabia, mostly driven by the extension of OPEC+ production cuts.\n\nWorld trade volume estimates have been revised downward slightly for 2025 and 2026 owing to sharp increase in trade policy uncertainty, which is likely to hurt investment disproportionately among trade-intensive firms.\n\nThe fund also highlighted risks to the global economic outlook. In the medium term, the balance of risks to the outlook is tilted to the downside, with global growth poised to be lower than its 2025-26 average and five-year-ahead forecasts at about 3pc.\n\nNear-term risks, in contrast, could reinforce divergences across countries: they are tilted to the upside in the US, whereas downside risks prevail in most other economies amid elevated policy uncertainty and headwinds from ongoing adjustments, particularly energy in Europe and real estate in China.\n\nAn intensification of protectionist policies in the form of a new wave of tariffs, could exacerbate trade tensions, lower investment, reduce market efficiency, distort trade flows, and again disrupt supply chains.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:54:21.284Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885972/imf-lowers-pakistans-gdp-growth-estimate-to-3pc",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:29:10.000Z"
}
