{
  "title": "Sports gala begins in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: Khyber Pakhtunkhwa Chief Minister Awami Sports Gala began with a colourful ceremony here on Friday.\n\nDeputy commissioner Zeeshan Abdullah along with district police officer Mohammad Jawad Ishaq inaugurated the festival at the sports stadium popularly known as Kabir Park.\n\nBannu regional sports officer Shafqatullah Khan, Lakki and Bannu district sports officers, office-bearers of sports organisations and elders were in attendance.\n\nThe festival featured eight games, including cricket, football, volleyball, tug-of-war, kabaddi, archery and martial arts.\n\nAt the opening ceremony, PT platoon of Government High School, Mela Shahabkhel, exhibited physical training skills.\n\nA traditional dance on drumbeats by elderly archers also amused the guests and visitors.\n\nThe participants appreciated a dazzling PT show, karate performance and horse-riding.\n\nLakki DC Abdullah said his administration was organising the festival under the chief minister’s public service agenda to promote peace in the region.\n\n“Along with providing players with opportunities of exhibiting their sporting skills the main objective of the show is to bring lasting peace to the region,” he said.\n\nPROTEST THREATENED: Traders have threatened to observe a shutter down strike if the government fails to ensure safe release of their kidnapped colleague within 24 hours.\n\nThe warning was issued at a meeting held in Bannu city on Friday.\n\nAnjuman-i-Tajiran president Pir Gul Manzoor Shah presided over the meeting.\n\nThe participants showed concern over the abduction of trader, Asmatullah from a congested locality. They said kidnapping incidents were taking place every other day raising a question mark on the performance of police and other law enforcement agencies.\n\nThey said the police had failed to find any clue to the missing trader, who was kidnapped by unknown armed men at gunpoint near Allah Chowk three days ago.\n\nThey said the surge in crime had worried the business community, and the police should focus on improving law and order situation.\n\nThey said cops did not come out of police stations, leaving citizens at mercy of criminals.\n\nThe traders threatened to block the Bannu-DI Khan Road if their kidnapped colleague was not recovered by Saturday (today).\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678ac19e04f6e.jpg",
  "retrievedAt": "2025-08-26T07:46:16.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885934/sports-gala-begins-in-lakki-marwat",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:31:09.000Z"
}
