{
  "title": "On death row - Pakistan - DAWN.COM",
  "author": null,
  "content": "THE judiciary in Pakistan does not have established sentencing guidelines for the application of the death penalty. Unfortunately, Pakistan has one of the world’s highest numbers of prisoners sentenced to death. By the end of 2024, the total number on death row reached 6,161 — a significant increase from 2022, when death row prisoners numbered 3,226, according to a 2024 report by Justice Project Pakistan.\n\nThis suggests heightened sentencing activity by judges at the trial court level. Even though, Pakistan amended the Control of Narcotics Substances Act in 2023 and the Sabotage of the Railways (Amendment) Act in 2022, to reduce the provision for capital punishment to a life sentence, the judicial view of the application of capital punishment has not changed. In 2024, some courts continued to impose death sentences for narcotics-related offences.\n\nThis underscores the need for continuing judicial training and awareness programmes so that legislative changes are properly implemented. Currently, 31 offences in Pakistan can lead to the death penalty. These include, among others, murder, perjury and kidnapping for ransom. This is not in line with Article 6(2) of the International Covenant on Civil and Political Rights, which states that the death penalty can only be imposed for the most serious crimes.\n\nThe outcome is irreversible injustice.\n\nThe test applicable in criminal trials, including in cases involving the death penalty, is ‘proof beyond reasonable doubt’. However, trial courts continue to apply the death penalty even where this test is not met; the outcome is irreversible injustice.\n\nPakistan was ranked 129th out of 142 countries on the application of the rule of law and 98th on the effectiveness of its criminal justice system by the World Justice Project in 2024. This highlights a crisis within Pakistan’s criminal justice system, marked by police reliance on torture to extract confessions, the fabrication of evidence, and inadequate legal aid services. The gap in Pakistan’s justice system underscores the prevalence of both wrongful convictions and wrongful prosecutions across the country.\n\nThe legal process for death row prisoners in Pakistan starts with sentencing in the trial courts and may advance through the high courts and the Supreme Court. At the final stage, submitting mercy petitions to the president of Pakistan serves as the last option for prisoners after their appeals are denied by the Supreme Court.\n\nThe president has the authority to pardon death row prisoners under Article 45 of the Constitution. However, there is neither an established procedure nor a mechanism in place for submitting and resolving mercy petitions, leading to prolonged delays that often span years before a decision is made.\n\nIn 2018, the Supreme Court upheld the death penalty in only three per cent of the reported capital cases, overturning the sentence or ordering a review. Generally, an accused spends an average of 10 years under the death sentence before his or her case is heard by the apex court. In 65pc of the acquittals, the Supreme Court had serious doubts about the reliability of police investigation. The most common issues with such investigations were evidence that appeared to be planted, manipulated, or doubtful, according to a report by Reprieve.\n\nThere have been no executions in Pakistan since December 2019 as per the report of the Working Group on the Universal Periodic Review in March 2023. However, the courts continue to apply the penalty. Once sentenced by the trial court, individuals are confined to death row, where they endure deplorable conditio­­ns while awaiting an execution that may never occur.\n\nRecently, in the case of Ghulam Shabbir, the Supreme Court described the living conditions in death cells as “miserable”. It highlighted that the “space of a cell provided for each condemned prisoner is about 9 x 12 feet, with a single toilet to be used jointly by all the prisoners… . The death row prisoner is not permitted to participate in any extracurricular activities… . The convict is forced to live in such an inhuman condition. The date and time of execution of his sentence is uncertain, which in the given circumstance results in horrible feelings and creates anxiety. It is not just the prisoner who suffers, it’s the family too… .”\n\nNow imagine that the Supreme Court only upheld the death penalty in 3pc of its reported capital cases, but by the time the case had been decided, a prisoner had spent years inside the death cell of the prison, resulting in irreversible injustice.\n\nThe Supreme Court must adopt sentencing guidelines in capital cases along with stipulating the mitigating factors that can result in a reduction in the quantum of sentences in cases involving capital punishment.\n\nThe writer is a barrister of Lincoln’s Inn and an advocate of the high courts of Pakistan.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678b05f8a01b6.jpg",
  "retrievedAt": "2025-08-26T07:46:16.776Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886036/on-death-row",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:42:48.000Z"
}
