{
  "title": "Current account posts $1.2bn surplus in July-Dec - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The current account posted another surplus of $582 million in December 2024, bringing the total surplus for the first half of the current fiscal year (FY25) to $1.2 billion.\n\nThe State Bank reported on Friday that the current account surplus in December followed a larger surplus of $684m in November. This surplus provides crucial support to the government, which is struggling to meet external debt servicing requirements while facing a trade deficit.\n\nFor the first half of FY25, the current account posted a surplus of $1.210 billion, compared to a deficit of $1.397bn in the same period of FY24.\n\nBoth the Ministry of Finance and the State Bank have stated that there are no restrictions on imports, but poor growth rates and the contraction of large-scale manufacturing suggest otherwise. Import-led economic growth has failed to pick up in the last two years. The government believes that higher economic growth, like four per cent, leads to a current account deficit, which means slower growth results in lower imports.\n\nData shows that inflows were higher in the second quarter of FY25, with the current account posting a surplus of $1.612bn for the October-December period. This compares to a net deficit of $402m in the first quarter (July-September FY25), indicating that the second quarter was much better for the economy. Exports increased, and inflows from remittances during the first half of FY25 were up by 33 per cent compared to the same period last fiscal year.\n\nThe government managed to reduce the current account deficit to $1.695bn in FY24, down from $3.275bn in FY23. Financial experts believe that if the government can maintain the current account surplus through the end of FY25, exchange rate stability will improve, which could serve as a catalyst for building confidence among foreign investors.\n\nDuring the first half of FY25, goods exports increased to $16.229bn, compared to $15.146bn in the same period last year, a rise of $1.083bn or 7pc. Meanwhile, goods imports increased to $27.743bn, compared to $25.375bn, a rise of $2.368bn or 9.3pc.\n\nThe export and import of services showed similar trends. The State Bank reported that the trade balance in goods and services for the first half of FY25 was a net deficit of $13.103bn, compared to a net deficit of $11.590bn in the same period of the previous fiscal year.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:53:51.060Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886021/current-account-posts-12bn-surplus-in-july-dec",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:29:30.000Z"
}
