{
  "title": "JI stages thanksgiving rallies across KP after Gaza ceasefire deal - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: Jamaat-i-Islami organised thanksgiving rallies across Khyber Pakhtunkhwa on Friday to celebrate the ceasefire agreement between Israel and Hamas.\n\nJamaat’s South KP chief Mohammad Ibrahim led a rally in Bannu, which appeared from Havaid Gate and converged in front of the press club.\n\nParty district emir Mufti Arifullah, secretary general Ejazul Haq Soorani and a good number of activists participated.\n\nSpeaking on the occasion, Mr Ibrahim said Israel continued a genocidal campaign against Palestinians for the last one and half years, but the brave people of Gaza refused to surrender.\n\nActivists laud Palestinians’ bravery in face of Israeli aggression\n\n“Despite the agreement, Israel continued bombarding people,” he said. He said over 40,000 people were killed in the Israeli aggression but Muslim countries ‘kept mum’ over the brutalities.\n\n“The blood of martyrs will herald the freedom of Palestine,” he maintained.\n\nA rally was also taken out in Karak to express solidarity with Palestinians.\n\nJI South KP secretary general Mohammad Zahoor Khattak, deputy emir Maulana Taslim Iqbal, district emir Sadiqullah Shaheen and Maulana Mehboob Janan led the rally.\n\nThe participants carried placards and banners inscribed with slogans in favour of Palestinians.\n\nSpeakers said the agreement had brought happiness on the faces of Gaza people. They said after implementation of the agreement, the United States would try to force Pakistan, Saudi Arabia and other Muslim countries to recognise Israel. They warned the government of stiff resistance if it thought about recognising the Jewish state.\n\nIn Lakki Marwat, JI’s district chief Mufti Irfanullah and secretary general Ismail at a presser in Naurang town said that the illegitimate state of Israel could not be recognised under any circumstances.\n\nIn Bajaur, Jamaat workers also staged a rally to celebrate the Israel-Hamas agreement as a ‘victory’ of the latter.\n\nBesides the party activists, people from different walks of life attended the rally held in Khar Bazaar.\n\nThe participants of the rally, which turned into a gathering after passing from different places, were holding a big banner, praising the agreement.\n\nThe participants chanted slogans against Israel, the US and in favour of Palestinians.\n\nJI local chapter emir Sahibzada Haroon Rasheed, leaders Haji Sardar Khan, Farman Khan, Maulana Ihsanul Haq and others highlighted the significance of the Israel-Hamas ceasefire deal.\n\nThe speakers described the peace agreement a great victory of Hamas.\n\nIn Battagram, Jamaat staged a rally after the Friday prayers with the participants carrying banners and placards inscribed with slogans condemning the Israeli aggression against Palestinians.\n\nThe rally commenced at Police Lines Chowk and culminated at Khatam-i-Nabuwat Chowk on the Karakoram Highway. JI district emir Haji Imdadullah, general secretary Anwar Baig, trade union president Abdul Ghaffar Deshani and others addressed the gathering.\n\nThey praised resilience of the Palestinian people, who, despite being unarmed, safeguarded their land through immense sacrifices. They attributed the ceasefire in Gaza to the unwavering determination of the Palestinians.\n\nRallies were also staged in South Waziristan, Charsadda and other districts of Khyber Pakhtunkhwa.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678ac1b5d1b6e.jpg",
  "retrievedAt": "2025-08-26T07:46:16.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885941/ji-stages-thanksgiving-rallies-across-kp-after-gaza-ceasefire-deal",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:31:09.000Z"
}
