{
  "title": "No investment in telecom infrastructure over three years, admits IT minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Internet, VPNs, WhatsApp fully functional in country, Shaza Khawaja tells NA after PPP lawmaker voices concerns\n• PTI continues noisy protest; house adjourned due to lack of quorum\n\nISLAMABAD: Minister of State for Information Technology and Telecommunication Shaza Fatima Khawaja on Friday acknowledged on the floor of the National Assembly that internet users were facing challenges in Pakistan, but at the same time claimed that presently the internet, VPNs and WhatsApp were fully functional in the country.\n\nThe minister was responding to the criticism from PPP legislator Shazia Marri during the Question Hour over the suspension of VPNs and difficulties in the use of WhatsApp and other mobile apps due to slow internet speed in the country.\n\nWhile responding to Ms Marri’s supplementary question amid noisy opposition’s protest, the minister also admitted that they had failed to make any investment in the telecom infrastructure over the past three years, and blamed the previous PTI government for it.\n\n“Unfortunately, our friends [the op­­position members] are protesting to­­day. In 2022, when they had left this country at the verge of default, no one was ready to open LCs (letters of credit) and nothing was being im­­p­orted. All the telecom infrastructure is import-based.\n\n“It was because of the fear of default and because of the IMF fear, we have not been able to make any investment in the telecom infrastructure over the past three years and there has been no FDI (Foreign Direct Investment),” she stated.\n\nThe minister, however, expressed the hope that since the macro economy had started improving, the interest rate and inflation had come down and there had been consistency in the currency rate for last two years, the FDI would come to the country to be used in improving the telecom infrastructure which would ultimately lead to the improvement in the internet availability.\n\nMs Khawaja said Pakistan’s IT services export remittances had recor­ded a 28 per cent increase, reaching approximately $1.86 billion during the first six months of the current financial year which was evidence of the improvement in internet usage and speed in the country.\n\nAt present, she claimed, WhatsApp and all the VPNs were fully operational. She asked Ms Marri to specifically mention as to which VPN was not working and which industry was facing problem as a result. She said the industries mostly worked on fixed lines, therefore, they had been facing no issues.\n\nMoreover, she said, the Pakistan Telecommunication Authority (PTA) was operating a 24/7 service centre to register complaints, assuring that technicians are dispatched promptly to resolve issues, adding that they had been in contact with the freelancers’ association and P@SHA on the issue.\n\nThe minister informed the house that Pakistan presently had seven submarine cables, out of which one had completed its lifespan. She said that another cable Africa2 had landed in Pakistan and it would be operational in the next few months after which the live internet channel of the country would improve.\n\nShe further mentioned that the Pakistan-China optic-fibre cable had been operationalised and soon data would start flowing from Pakistan to China. She said they were connecting submarine cables to Central Asian states through Wakhan.\n\nMs Khawaja said they had been working to improve the internet facility overall, adding: “but definitely there is internet congestion which is because of lack of investment, lack of spectrum and slightly because of less capability in terms of submarine cable.”\n\nOpposition protest\n\nMeanwhile, PTI members continued their noisy protest for a fifth consecutive day and once again disrupted the proceedings by pointing out a lack of quorum.\n\nThe opposition members entered the house in the middle of the Question Hour and started raising slogans and desk-thumping, prompting Speaker Ayaz Sadiq and the treasury members to use headphones. Some opposition members also tore apart the copies of the agenda and answer books and tossed the shreds up in the air.\n\nPTI’s Iqbal Afridi pointed out lack of quorum which was visibly not complete and the speaker adjourned the sitting till Monday evening without even ordering the headcount. The house could not even complete the Question Hour.\n\nBefore announcing the adjournment, the speaker once again expressed his displeasure over the opposition’s behaviour and said it had been mutually agreed in a meeting that the quorum would not be pointed out during the Question Hour and on private member’s day, but PTI members were constantly violating it.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:53:52.150Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885965/no-investment-in-telecom-infrastructure-over-three-years-admits-it-minister",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:29:17.000Z"
}
