{
  "title": "Ahmadi worship place in Sialkot built by ex-FM Zafarullah Khan razed - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The local administration in Daska has demolished a historical place of worship, built by the country’s first foreign minister Zafarullah Khan, terming it an encroachment.\n\nThe demolition, carried out on Jan 16, followed a notice issued two days earlier under the Punjab Local Government Act, claiming that an extension of the structure was illegal as it encroached 13 feet onto a public road.\n\nZafarullah Khan, an Ahmadi by faith, served as Pakistan’s first foreign minister from 1947 to 1954. A prominent lawyer in colonial India, he was a key advocate for the Ahmadi cause in landmark judgements.\n\nThe worship place in question, constructed by Mr Khan in his native town of Daska, Sialkot, predated Pakistan’s independence in 1947.\n\nAccording to members of the Ahmadiyya community, efforts were made to comply with the notice by removing the marked 13 feet on Jan 15.\n\nDaska admin demolished structure for encroaching on public road; community says demolished structure pre-dated Partition\n\nDespite this, Daska Assistant Commis­sioner Maham Mushtaq, accompanied by police, proceeded with the demolition later that evening, they said. The operation lasted from 7pm to 11pm, during which electricity to the worship place and surrounding areas was also cut off.\n\nThe demolition is the latest in a series of actions targeting the Ahmadi community. Data shows that at least 22 of their worship places were demolished across Punjab in 2024.\n\nMembers of the community expressed frustration and disappointment, alleging that state institutions were complicit in vandalising their places of worship instead of protecting vulnerable groups from extremist elements.\n\nAamir Mahmood, spokesperson for Jamaat Ahmadiyya Pakistan, accused the local administration of continuously targeting the community’s properties and ignoring their grievances.\n\nHe claimed that the demolished structure, built by Zafarullah Khan’s family before Pakistan’s creation, had not been altered or extended since its original construction.\n\nHe urged the government to take immediate action to protect their places of worship and prevent such acts in the future, highlighting that these acts constituted criminal offences and should be dealt with according to the law.\n\nCivil society groups, human rights organisations and various religious leaders have expressed solidarity with the Ahmadiyya community and called for the protection of their rights.\n\nThe Lahore High Court, in a 2023 ruling, clarified that Sections 298-B and 298-C of the Pakistan Penal Code, which criminalise specific acts of the Ahmadiyya community, do not authorise the demolition of structures built before these provisions were introduced through a 1984 ordinance.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:46:43.797Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886020/ahmadi-worship-place-in-sialkot-built-by-ex-fm-zafarullah-khan-razed",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:29:23.000Z"
}
