{
  "title": "Islamabad Development Working Party okays construction of buildings for eight police stations - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad Development Working Party (IDWP) on Friday gave the go-ahead to relevant authorities to acquire land and hire consultants for the feasibility study and designing of a Special Protection Unit (SPU) building in the federal capital.\n\nA meeting of the body that reviews projects to align them with Islamabad’s master plan also approved a PC-II to upgrade the Counter-Terrorism Department (CTD) and set up canine centres in Islamabad.\n\nThe IDWP approved the construction of buildings for eight police stations.\n\nOfficials from the capital police, district administration and the Capital Development Authority (CDA) told Dawn that the SPU was being revamped following the directives of Prime Minister Shehbaz Sharif for the security of the Chinese nationals in Islamabad.\n\nApproves designing of SPU building, CTD upgradation\n\nThey said a piece of land had been allotted to the police for the construction of the state-of-the-art building for said unit, at H-11 behind the Police Lines Headquarters.\n\nThe building will house an armoury, barracks, offices and other facilities like training centres.\n\nA manpower of 3,200 personnel was demanded for the SPU and so far 2,600 personnel have been provided, the officials said.\n\nThe IDWP meeting held under the chairmanship of Islamabad Chief Commissioner Mohammad Ali Randhawa also saw the attendance of member engineering and member planning from CDA.\n\nThe CDA members aimed to align all projects with Islamabad’s master plan.\n\nThe meeting was told that land was also allotted in H-16 for the Counter-Terrorism Department Complex.\n\nThe complex will house barracks, offices, a CTD police station, a training centre and an investigation facility.\n\nThe approved project aimed to revamp Islamabad CTD on the pattern of the Punjab CTD.\n\nPolice stations for which buildings were approved include Khanna, Kirpa, Shams Colony, Loi Bher, Humak, Nilore, Phulgran and Sangjani.\n\nThese police stations have either been set up on greenbelts or in rented buildings, the meeting was informed.\n\nMoreover, it was said land was allocated in Tarlai for canine units.\n\nThe building will have kennels, an exercise and training ground and rooms to house staff including vets.\n\nDuring the meeting, approval was also granted for improving road infrastructure in Islamabad’s rural areas.\n\nThe chief commissioner directed that a third-party validation be conducted for all ongoing and future projects. He instructed that no payments should be made without third-party validation.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:46:17.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885957/islamabad-development-working-party-okays-construction-of-buildings-for-eight-police-stations",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:31:02.000Z"
}
