{
  "title": "65 FIA officials barred from posting at immigration checkposts - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Sixty-five officials of the Federal Investigation Agency (FIA) have been blacklisted for posting at any immigration checkpost and anti-human trafficking circles in the country in the light of the inquiry into the Greece boat tragedy in which several Pakistanis had lost their lives.\n\nThe blacklisted individuals include three deputy directors, two assistant directors, four inspectors, 15 sub-inspectors, 13 assistant sub-inspectors, 20 head constables, eight constables and one clerk.\n\nMost of them belong to the Karachi and Gujranwala zones of the FIA.\n\nAccording to a notification, “In consequence of the recommendations in the report of the Inquiry Committee constituted by the prime minister on the Greece boat tragedy 2023, and in continuation to the FIA’s other notification, the following officers and officials of the FIA have been barred/blacklisted for posting at any FIA immigration check-post and anti-human trafficking circles on administrative grounds with immediate effect”.\n\nMove comes after a probe into Greece boat tragedy of 2023\n\nThe deputy directors are Imran Ranjha (Hyderabad zone), Zahid Mahmood and Mubashir Ahmed Tirmizi (Islamabad) and assistant directors are Abu Bakar Usman (Faisalabad) and Irfan Babar (Islamabad).\n\nSome key decisions in the anti-human trafficking meeting recently chaired by Prime Minister Shehbaz Sharif have also been taken to check the rise in human smuggling.\n\n“It has been decided the head of Intelligence Bureau (IB) will present a progress report to the prime minister on the crackdown against human traffickers and the FIA employees involved. Strict criminal proceedings have been ordered against the FIA employees involved in human trafficking, with a report to be submitted within a week,” a senior official told Dawn on Friday.\n\nA decision has been made to post FIA officials in Pakistani embassies abroad to combat human trafficking. It was decided that BPS-20 and BPS-21 officers in the FIA would be appointed to strengthen anti-human trafficking efforts.\n\n“The secretaries of Foreign Affairs and Interior, in consultation with the DG FIA, will develop a new legal framework. The interior secretary has been instructed to propose advanced screening systems, e-gates and modern technology to prevent human trafficking at airports,” the official said.\n\nThe FIA head will brief on stricter legal actions and punishments for human traffickers and complicit FIA officials in consultation with prosecutors.\n\n“Identification and recommendations for action against human trafficking hubs abroad will be ensured. Proposals to amend the Passport Act 2021 to revoke passports of asylum seekers abroad and a report on the matter have been requested,” the official said.\n\nThe meeting also decided that the secretary foreign affairs would provide a plan to repatriate stranded Pakistanis in transit countries like Libya.\n\nEarly this month, more than 30 officers of the FIA were booked and dismissed from service over their alleged collusion with human smugglers in sending Pakistanis abroad illegally.\n\nThe FIA had begun the purge following the capsising of a boat carrying illegal immigrants near Greece in December last year. As per the estimate, more than 80 Pakistanis drowned in the accident, 36 were rescued. The remaining were presumed dead.\n\nIn response to the tragedy, Prime Minister Shehbaz Sharif had ordered the authorities to take action against the human smugglers and officials aiding them. Since then, a countrywide crackdown has been launched against human smugglers, leading to the arrests of dozens of suspects.\n\nSome of the sacked FIA officials claim that they have been made ‘scapegoat’ urging the authorities concerned to thoroughly and fairly conduct a probe into the matter so that only those facilitating human trafficking in the FIA were punished.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:54:09.112Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885931/65-fia-officials-barred-from-posting-at-immigration-checkposts",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:30:56.000Z"
}
