{
  "title": "Jam Kamal slams CM Bugti’s words on Hub development - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Federal Minister for Commerce Jam Kamal Khan Alyani on Friday strongly criticised the statement of Balochistan Chief Minister Sarfraz Bugti about Hub town and the contribution of Jam family to the area development and asked Mr Bugti not to ignore facts and history.\n\nSpeaking at a public gathering in Hub on Thursday, Mr Bugti expressed his disappointment over failure of different governments to develop the industrial town of Hub into a modern city with all basic amenities, despite its proximity to Karachi.\n\nThe chief minister had further said that despite several chief ministers hailing from Lasbela district, no serious efforts was made to develop and transform Hub into a modern and well-planned city.\n\nStrongly reacting to Mr Bugti’s statement, Mr Alyani said that Hub dam, Hub Industrial Zone, Hub Marble City and Hub Shipbreaking Industry are all projects initiated by the Jam family and all these projects were meant to promote economic development of Balochistan.\n\nHe said the contribution of the Jam family to the development of Hub and Lasbela are unforgettable.\n\nThe federal minister also said that Hub Industrial Zone was established on the personal land of Jam family and it was designed to stimulate economic growth of Balochistan. He said ignoring historical facts is wrong as public services provided by Jam family are evident to all.\n\nThe Hub power project and BOSICOR oil refinery are also the result of the Jam family’s efforts.\n\nMr Alyani noted that each government should take additional steps to improve these development projects. If subsequent governments fail to protect and further develop the projects initiated by the Jam family the blame should not be put on the Jam family.\n\nHe also said that the integration of Lasbela into Pakistan occurred under the leadership of Jam Ghulam Qadir, adding that serving the people of Hub and Lasbela has always been the top priority of the Jam family.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:54:07.802Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886015/jam-kamal-slams-cm-bugtis-words-on-hub-development",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:29:23.000Z"
}
