{
  "title": "Rain, snowfall expected from today in country - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Rain-windstorm with snowfall over the hills is expected to occur in northwest Balochistan and northern parts of the country from January 18 to 21st.\n\nThe Met Office has predicted that a westerly wave is likely to approach the western parts of the country on January 18.\n\nUnder the influence of this weather system, moderate rain-windstorm and snowfall over the hills is expected in Quetta, Ziarat, Chaman, Pishin, Qilla Abdullah, Qilla Saifullah, Chaghi, Noushki, Kalat, Barkhan, Khuzdar, Harnai, Zhob, Musakhel, Kharan, Kech, Panjgur and Gwadar from January 18 to 20 with occasional gaps.\n\nModerate rain-windstorm as well as snow is expected in Chitral, Dir, Swat, Shangla, Kohistan, Mansehra, Abbottabad, Haripur, Buner, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Waziristan, Peshawar, Charsadda, Nowshera, Swabi, Karak and Kohat, Murree, Galliyat, Diamer, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche and Shigar, Kashmir (Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur) from January 18 to 21 with occasional gaps.\n\nLight rain-windstorm is expected in Islamabad, Rawalpindi, Attock, Jhelum and Chakwal on January 18 (evening/night) and January 19. It stated that moderate rain may cause flash flooding in Chaghi, Noushki, Kharan, Pishin, Qilla Abdullah and Quetta on January 18 (night) and January 19 (morning).\n\nThe Met Office also stated that moderate to heavy snowfall might cause road closure/slippery conditions in Naran, Kaghan, Chitral, Dir, Swat, Kohistan, Mansehra, Abbottabad, Shangla, Astore, Hunza, Skardu, Neelum valley, Bagh, Poonch, Haveli, Quetta, Ziarat, Chaman, Pishin, Qilla Abdullah and Qilla Saifullah during the forecast period.\n\nThere is also a possibility of landslides/avalanche in hilly areas of Khyber Pakhtunkhwa, Gilgit-Baltistan and Kashmir during the period.\n\nTourists and travelers visiting mountainous areas are advised to remain cautious during the period. Farmers have been asked to manage their activities keeping in view the weather forecast period.\n\nThe Met Office advised all concerned authorities to remain alert and take necessary measures to avoid any untoward situation particularly in hilly areas of the country.\n\nPublished in Dawn, January 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:53:53.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885959/rain-snowfall-expected-from-today-in-country",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T01:31:02.000Z"
}
