{
  "title": "PM for sustainable agro-industry policy to promote forestry, counter climate change",
  "author": null,
  "content": "ISLAMABAD, May 15 (APP): Prime Minister Shehbaz Sharif on Thursday directed the authorities concerned to formulate a sustainable and long-term policy for agro-industrial development to promote agriculture and forestry, as well as help counter climate change.\nThe prime minister, chairing a meeting on agricultural sector reforms, also instructed the formulation of a coordinated strategy to develop the agriculture sector in consultation with provinces and all relevant stakeholders.\nHe said that the government was developing the agriculture sector on modern lines to achieve self-sufficiency.\nEmphasizing to utilize the vast potential of agriculture sector for rapid economic development, he said that Pakistan was rich with fertile land, capable agricultural experts, and hardworking farmers.\nThe prime minister directed the provision of agricultural loans to farmers on easy terms and focus on agricultural research to enhance production.\nHe also instructed the relevant department to present a National Agri-Innovation Plan for the agricultural sector.\nPrime Minister Shehbaz also called for accelerating ongoing reforms in the certification system for agricultural seeds and developing an effective action plan to promote high-quality seeds.\nCalling the promotion of modern technology in the agricultural sector the government’s priority, he directed the development of a comprehensive regulatory framework for the agriculture sector.\nIn the meeting, the proposals were presented by the working group formed for agricultural reforms.\nThe meeting was attended by federal ministers Rana Tanveer Hussain, Ahad Khan Cheema, Muhammad Aurangzeb, and Musadik Malik, besides senior government officials.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:29:05.185Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-for-sustainable-agro-industry-policy-to-promote-forestry-counter-climate-change/",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T06:44:00.000Z"
}
