{
  "title": "IHC Judges transfer case: SC adjourns hearing for May 19",
  "author": null,
  "content": "ISLAMABAD, May 15 (APP):The Supreme Court on Thursday adjourned further proceedings in the Islamabad High Court (IHC) judges’ transfer and seniority case until May 19, after senior counsel Munir A. Malik concluded his arguments before a five-member constitutional bench headed by Justice Muhammad Ali Mazhar.\nDuring the hearing, Munir A. Malik, representing five judges of the IHC, argued that the principle of judicial seniority is intrinsically linked to the independence of the judiciary. Citing Article 175(3) of the Constitution, he maintained that the judiciary must remain separate from the executive.\nJustice Mazhar questioned who determines a judge’s seniority. Malik responded that this responsibility lies with the Chief Justice. However, Justice Mazhar remarked that this power is administrative in nature, raising concerns about where an aggrieved party could appeal such decisions. Malik replied that an affected party could seek redress from a competent court.\nJustice Shahid Bilal Hassan noted that in the past, three judges from the Lahore High Court were appointed Chief Justices of the Islamabad High Court. Justice Naeem Akhtar Afghan mentioned the appointment of Justice Sardar Aslam from the Lahore High Court as IHC Chief Justice. Malik clarified that Justice Aslam’s appointment was under Article 193 and was not a transfer but a fresh appointment by the President, who exercised appointing—not transferring—authority.\nJustice Salahuddin Panhwar remarked that at that time, the 18th Constitutional Amendment and the Judicial Commission were not in effect, and the President had full powers of appointment.\nMalik further emphasized that each High Court has its own oath and the authority administering it is also different. He argued that when a judge is transferred to another court, a new oath is constitutionally required due to the change in office.\nJustice Mazhar countered that the Constitution is silent on the requirement for a new oath upon transfer and observed that combining Articles 200 and 175-A would suggest that a transfer constitutes a new appointment—which, in his view, is incorrect. He explained that judges typically first take an oath as additional judges and only become permanent upon Judicial Commission recommendation; the same judge may take a new oath only when appointed as Chief Justice. Thus, a transfer should not be considered a new appointment.\nMalik concluded his arguments by urging the court to view judicial transfers through the lens of judicial independence.\nSubsequently, Hamid Khan, representing the Lahore High Court Bar Association, began his submissions. He noted that the Association is 133 years old and has 25,000 lawyer members. Justice Mazhar advised him to avoid repeating arguments already made by Malik and instead focus on presenting new constitutional questions.\nReferring to letters written by IHC judges in May 2023 and again in 2024, Justice Mazhar pointed out that Justice Mohsin Akhtar Kiyani had not signed the 2024 letter. Khan responded by stressing that case allocation decisions are made by the court’s administrative committee—a practice also followed in the Peshawar High Court, according to Justice Shakeel Ahmed.\nJustice Shahid Bilal questioned the extent of authority vested in the IHC administrative committee and asked Additional Attorney General Aamir Rehman to clarify this in court.\nContinuing his arguments, Hamid Khan asserted that taking an oath is not merely a formality but a constitutional obligation. Justice Mazhar, however, pressed him to move beyond reading letters and present relevant constitutional questions, noting that those letters are already part of the record and currently under review by a larger bench.\nWhen Khan insisted on presenting factual background, Justice Mazhar reminded him that the constitutional bench is tasked with deciding legal questions, not factual matters. Justice Shahid Bilal also questioned why the Islamabad High Court Bar had withdrawn its petition in the case.\nThe court then adjourned the hearing until May 19.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:29:28.219Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-judges-transfer-case-sc-adjourns-hearing-for-may-19/",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T17:20:00.000Z"
}
