{
  "title": "Summary sent for appointment of NCSW Chairperson, gender parity report published, NA informed",
  "author": null,
  "content": "ISLAMABAD, May 15 (APP):The National Assembly was informed on Thursday that a summary for the appointment of the Chairperson of the National Commission on the Status of Women (NCSW) has been sent, while a Gender Parity Report has already been published under the commission’s supervision.\nResponding to a question from MNA Dr. Shazia Sobia during the Question Hour, Parliamentary Secretary for Human Rights, Saba Sadiq, told the House that women constitute half of the country’s population and are entitled to their rights as guaranteed by the Constitution and Islamic teachings.\nShe stated that currently an interim chairperson is serving and the process for permanent appointment will be completed soon. “The commission’s board is functional and meetings are being held regularly,” she added.\nSaba Sadiq highlighted that the NCSW plays a critical role in addressing women’s issues, preventing all forms of violence against women, and coordinating with provincial departments. “All provinces are regularly sharing data with the commission,” she noted.\nShe emphasized the need for increased awareness about the commission’s work, saying women must be informed that an institution exists to safeguard their rights. A dedicated helpline has also been established by the NCSW.\nResponding to a supplementary question from MNA Nafisa Shah, she assured that statistics regarding women’s quota in federal institutions would be provided to the House, reiterating that women deserve their rightful representation.\nOn a question from Zartaj Gul, the Parliamentary Secretary stated that legal action would be taken against any Pakistani citizen—regardless of gender—who violates the law.\nAnswering a query from Senator Nuzhat Sadiq, she said that commission members also visit prisons and meet with incarcerated women to assess their needs and ensure the provision of legal aid and basic facilities.\nThe Parliamentary Secretary announced that the Gender Parity Report compiled by the NCSW contains comprehensive data and will soon be presented before the Parliament.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:30:43.138Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/summary-sent-for-appointment-of-ncsw-chairperson-gender-parity-report-published-na-informed/",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T11:40:00.000Z"
}
