{
  "title": "New Triage system’ to be introduced in govt hospitals at federal level : Dr Zafar Mirza",
  "link": "https://www.app.com.pk/national/new-triage-system-to-be-introduced-in-govt-hospitals-at-federal-level-dr-zafar-mirza/",
  "date_published": "2020-01-21T23:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):Special Assistant to Prime Minister on Health Dr Zafar Mirza Wednesday announced that Federal Government has decided to introduce ‘A Triage System’ soon in capital government hospitals to improve service delivery to patients in the casualty wing.\nTalking to private news channel , he said under this new Triage system, the patients will be categorized into different categories in emergency OPDs with urgent, and non-urgent patients.\nCritically ill patients and those who need immediate life-saving interventions for survival fall in the emergency category, he explained.\nNew Triage system will be made functional soon to ensure transparency and timely availability of specialist doctors in public hospitals in any emergency situation, he added.\nTalking about senior doctors complaint in capital hospitals , Dr Zafar Mirza said we have received number of reports that senior doctors mostly were not present in OPDs in PIMS and Polyclinic hospitals and they were not performing their duties well and causing great difficulties for the poor patients in emergency time.\nIn view of these complaints, we took serious notice on reports that heads of departments, senior doctors, specialists are often not present in their place of duty and leave their offices before the closing hours.\nOn my directions Executive Director PIMS has issued a strongly worded circular warning that disciplinary action will be taken against doctors found unauthorized absent from duty.\nHe explained that thousands of patients visiting PIMS on a daily basis and they cannot under any circumstances be deprived of the services of senior doctors and specialists.\nThere shall be zero tolerance for such causal attitude, he warned.\nUnder directions of the Prime Minister ministry is making all out effort to uplift services in capital hospitals, he mentioned, adds, this will require utmost devotion and commitment by the doctors and staff.\n“Strict action will be taken against all non-performing doctor”, he made it clear.\nHe said health is a basic right of citizen where present government would never compromise with it at any cost as the government was answerable to the poor people and responsible to providing best services.\nHe said poor patients also have equal right to get senior doctors services in government hospitals so any negligence would not be tolerated.\nTalking about health reforms, he said present government had initiated a reforms agenda for revamping of entire health infrastructure of the country where every patients will get equal access to health facilities.\nHe added the government under the leadership of Imran Khan was striving hard to improve the health facilities for the masses.",
  "retrievedAt": "2025-08-11T18:40:20.190Z"
}
