{
  "title": "Chinese embassy rejects US negative rhetoric against CPEC",
  "link": "https://www.app.com.pk/national/chinese-embassy-rejects-us-negative-rhetoric-against-cpec/",
  "date_published": "2020-01-21T23:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):The embassy of China in Pakistan Wednesday rejected the senior US diplomat Alice Wells’ negative rhetoric against China Pakistan Economic Corridor (CPEC) terming it pack of lies.\nIt said during her recent visit to Pakistan, Acting Assistant Secretary for South and Central Asian Affairs of the US State Department Alice Wells made negative comments on the China-Pakistan Economic Corridor again which held nothing new but the same cliche in her speech in November, 2019 and had been repeatedly rejected by China and Pakistan.\nHowever despite repeated rejection, the US side still ignores the facts and is obsessed with the story it made for the CPEC, according to a press release issued by the Chinese embassy here.\n“Although you can never wake up a person who is pretending to be asleep, we have to make our position clear and reject the negative propaganda by the US. We must not let the truth be distorted and the lies run wild.”\nAlice Wells alleged that there was no transparency in CPEC projects, claiming Pakistan’s debt burden was growing due to the Chinese financing. She also touched on the cost escalation in railways ML-1 upgrade project, and said the Chinese companies joining CPEC were in World Bank’s blacklist.\nWe would be more than glad to see the US develop its relationship with Pakistan, but we strongly oppose the US interferes into China-Pakistan relations and the CPEC, the press release added.\nIt said the US held a stick of sanction all over the world blacklists this and that country,but it was not for global economy, just ways to serve its own political purpose.\n“We also want to advise the US that when you accuse China-Pakistan relations, you should first look back what have you done to Pakistan, and think about how much contribution have you make for Pakistan. Did Ms. Wales bring any aid, investment or trade for Pakistan during her visit?”\nIf the US truly cares about the development and prosperity of Pakistan and this region, it should bring cash and funds, promote win-win cooperation on the basis of mutual respect, fairness,and justice, rather than act as a world policeman, spreading rumors and provoking China-Pakistan relations,the Chinese embassy added.\nIt added China-Pakistan ties were rock-solid and unbreakable and China would continue to work with the Pakistani government and people to steadily advance the BRI and CPEC to promote regional peace and development.\nWith respect to progress on CPEC projects, the embassy said that major progress had been achieved in the past 5 years, with 32 projects achieving early harvests.\nThis has significantly improved local transportation infrastructure and power supply, created over 75,000 jobs directly and contributed one to two percent of the GDP growth in Pakistan.\nIt shows that the CPEC is playing an important role in boosting Pakistan’s socioeconomic development and improving people’s livelihood. Whether the CPEC works, the answer should be given by the Pakistani people rather than the US.\nUnder the CPEC, during its planning or implementation, every project is equally discussed, carefully studied and jointly implemented by both China and Pakistan.\nThe Chinese government always requests the Chinese companies to operate according to local laws and regulations. All Chinese companies joining the CPEC enjoy international reputation.\nAll projects strictly follow the market-oriented and internationally accepted business model, adopt state of art technology and strict environmental protection standards.\n“The entire process is open and transparent and is in line with international norm. We keep in touch with the relative accountability agencies of Pakistan and it is agreed that the CPEC is clean.”\nRegarding the so-called debt issue, according to statistics from the State Bank of Pakistan, the total foreign debt of Pakistan is 110 billion US dollars.\nIn fact, international financial institutions including the Paris Club and International Monetary Fund (IMF) are the largest creditors of Pakistan.\nLoan for the CPEC is about US$5.8 billion, accounting for 5.3% of Pakistan’s total foreign debt, with a repayment period of 20-25 years and an interest rate of approximately 2%.\nIts repayments will start in 2021, with annual repayments of about 300 million US dollars.\nIt will never be a burden to Pakistan. Moreover, China has never forced other countries to pay debts, and will not make unreasonable demands on Pakistan. The US keeps fabricating the so-called debt story, their mathematics is bad, and their intention is worse.\nAs to the cost of the ML-1 project, we have said many times. The initial design of the project was jointly accomplished by the China Railway No 2 Bureau, National Engineering Services Pakistan Limited (NESPAK), and Pakistan Railway Advisory & Consultancy Services Ltd (PRACS).\nThe project was launched in 2016, and the initial design were submitted in May 2017. In April, 2019, it has successfully passed the initial design review, organized by Pakistan Railways (PR), of the complex including Mott McDonald Pakistan (MMP), Canarail and the Crimson.\n“As the project has not yet been approved, the amounts of the project will be adjusted according to the actual condition and the needs of Pakistan. After finalizing the design of the project, we would initiate a bidding in accordance with international practice. This is a completely normal business practice,” the embassy added.",
  "retrievedAt": "2025-08-11T18:40:20.235Z"
}
