{
  "title": "Balochistan to be provided $10 m machinery to cope with emergencies: Dr Firdous",
  "link": "https://www.app.com.pk/national/balochistan-to-be-provided-10-m-machinery-to-cope-with-emergencies-dr-firdous/",
  "date_published": "2020-01-22T02:36:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jan 22 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Wednesday called on Governor Balochistan Amanullah Khan Yasinzai and discussed the government efforts to mitigate sufferings of heavy rains and snowfalls affected people and relief and rehabilitation activities in the province.\nThey also exchanged views on the overall law and order and ongoing development projects in the province.\nThe meeting also discussed the positive impact of China Pakistan Economic Corridor (CPEC) on economic and trade activities in the country, especially progress and development taking place in Balochistan.\nGovernor Amanullah underlined the need for ensuring availability of necessary machinery at different locations on permanent basis to tackle emergencies efficiently.\nDr Firdous said the federal government was fully aware of the losses occurred in the province due to heavy rains and snowfalls, adding all-out efforts were being made for early rehabilitation of the affected people.\nShe said compensation would soon be given to heirs of those killed and injured in the rain and snow related incidents.\nShe said $10 million machinery would also be provided to Balochistan aimed at coping with emergencies and calamities in a more effective way.\nAppreciating the service of Suleman Khan Kakar, a local hero who rescued more than 100 people from the snow-packed roads, she said he (Suleman) set an example of bravery to save human lives putting his life in danger.\nMeanwhile, renowned political and social figure Ibrarul Haq phoned the governor and assured to actively participate in the rehabilitation activities.",
  "retrievedAt": "2025-08-11T18:40:15.735Z"
}
