{
  "title": "Afghans possessing Pakistani identity cards quietly leave for homeland - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: An unspecified number of Afghan nationals, who had unlawfully obtained Computerised National Identity Cards of Pakistan in Khyber, quietly left for Afghanistan via Torkham border during the last six weeks after authorities issued notices to them when deportation of undocumented Afghans started on April 1.\n\nKnowledgeable sources told Dawn that though National Database and Registration Authority (Nadra) did not release the exact number of such Afghan nationals, as many as 200 Afghan nationals were put on notice in Jamrud, Landi Kotal and Bara each after the deportation of illegal Afghans started.\n\nThey said that relevant authorities had delivered the message to all such Afghans residing in Khyber to either surrender their CNICs or leave the country on their own or they would be arrested and subsequently deported under Foreign Act.\n\nThey said that since then an unspecified number of Afghans, who had adhered to official warnings, had left their decades-long abodes in different parts of Khyber and quietly crossed over to Afghanistan.\n\nThey were issued notices by relevant authorities\n\nSources said that neither Nadra nor Federal Investigation Agency was willing to share details about those Afghans as it was established beyond any doubt that Nadra employees in different centres in Khyber were involved in issuing fake CNICs to those Afghan nationals since mid-80s.\n\nThey said that FIA had over the period of time ‘picked up’ fingerprints of suspected Afghans on various border crossings, including Torkham and had then shared those fingerprints with Nadra to detect if any of them had fraudulently acquired CNIC. They said that a number of those suspected Afghan nationals also possessed Tazkira, the Afghanistan national identity card, and their national passports.\n\nSources said that an option was also given to those Afghans prior to issuing notices to them to prove the actual identity and then choose which country they wanted to live in.\n\n“Nadra head office in Islamabad and regional head offices (RHOs) in all the provinces then issued notice to all suspected Afghan nationals to prove their actual nationality prior to their gradual but quiet return journey to Afghanistan,” they said.\n\nSources said that a number of Afghan nationals, who had settled in Khyber since long, had also acquired local domiciles on the basis of their fake CNICs with active connivance of Nadra employees, previous political administration and local tribal elders, who had attested their documents after receipt of a hefty amount for every single CNIC, albeit fake.\n\nThey said that the Nadra record of a number of genuine locals was also fraudulently altered to pave the way for including an illegal Afghan national, or his entire family into their family tree.\n\n“So much so that these illegal Afghan nationals were able to acquire death certificates for their dead family members from relevant authorities while a number of them are still running lucrative businesses in Landi Kotal while the district administration conveniently looks the other way,” sources told this scribe on condition of anonymity.\n\nThey said that the ‘quiet return’ policy was also adopted on the advice of those people, who had secretly orchestrated the issuance of fake CNICs in return for receipt of a hefty amount as they were now trying to protect themselves from any legal proceedings against them and also to scuttle any departmental inquiry against Nadra staff in its various centres in Khyber, especially in Landi Kotal.\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:13:34.726Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912656/afghans-possessing-pakistani-identity-cards-quietly-leave-for-homeland",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:44:28.000Z"
}
