{
  "title": "Self-defence under the law - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN has never wanted to use nuclear weapons, and that is the stated position of the country at all levels — whether it is the Ministry of Foreign Affairs’ stance before the UN General Assembly (UNGA) or Pakistan’s stance in the Conference on Disarmament or before the International Court of Justice (ICJ) in the Republic of the Marshall Islands case, 2016.\n\nHowever, certain circumstances might challenge one’s restraint. The recent round of hostilities with India after the Pahalgam incident included the threat of the use of force, holding in abeyance the Indus Waters Treaty (IWT), missile launches and air strikes with 70-plus aircraft on Pakistan.\n\nUnfortunately, each action was a classic match to a long list of actions that constitute acts of aggression under UNGA Resolution 3314 of 1974. Pakistan responded by exercising its right of self-defence under Article 51 of the UN Charter, inflicting sufficient damage necessary for self-defence. The US president intervened and announced a ceasefire on May 10. Had it not been for this intervention, both states would have been drawn dangerously close to the unthinkable.\n\nCould Pakistan in future rationalise the threat of use of its nuclear arsenal? Clearly, such decisions are not controlled by law — even though the use of such weapons is an abhorrent prospect.\n\nHowever, questions related to the retention and use of nuclear weapons were raised before the ICJ by the UNGA and the World Health Organisation in 1996. Whether the acquisition, retention, or use of nuclear weapons would be in violation of international humanitarian law remains a critical concern. After hearing experts, the court’s opinion led to the conclusion that the use of nuclear arms would violate IHL and the Geneva Conventions.\n\nHowever, the court abstained from giving a clear answer to the question of whether retaining nuclear weapons would violate international law, thereby implying legitimacy for retention even by states that were not party to the Nuclear Weapons Treaty, ie, Pakistan, India and Israel.\n\nIt made a unique formulation: “However, in view of the current state of international law … the court cannot conclude definitively whether the threat or use of nuclear weapons would be lawful or unlawful in an extreme circumstance of self-defence in which the very survival of a state would be at stake.”\n\nThe ICJ abstained from giving a clear answer to the question of whether retaining nuclear weapons violates international law.\n\nIn other words, a window was left open that, in extreme circumstances of self-defence, the threat of use of nuclear weapons could possibly be justified. In 1996, this particular formulation was criticised by scholars like John Burroughs.\n\nThe military has correctly described a war between nuclear rivals as “sheer stupidity”. But had a ceasefire not been declared, one might speculate that the escalation might have reached a point tantamount to an extreme circumstance.\n\nMeanwhile, much scholarship surrounds what constitutes and triggers self-defence under Article 51 of the UN Charter. Consensus is now common among international lawyers that one need not wait for an actual attack to occur but may, in anticipation of an imminent attack resort to the use of force. Pakistan did precisely that. However, there is a time limit for the use of force in self-defence, and that is “till such time the UN Security Council takes measures”.\n\nDuring the current scenario, the UN Security Council held a session and heard the Pakistan delegation. However, it did not direct any measures, thus conferring further legitimacy on Pakistan’s resort to military action to curtail or neutralise all threats against its territorial sovereignty, such as shooting down airborne aircraft in attack mode, striking S-400 batteries and neutralising the drones sent by the Indian side.\n\nIt is also important to remember that the starting point of signalling war was not Pakistan’s doing. It was India that first held in abeyance the IWT on April 23, 2025. The IWT had survived several wars. There is no provision for abrogation, no provision for extension, no provision for withdrawal or termination by either party. It was a very well-thought-through omission, even though numerous contemporary treaties have withdrawal provisions.\n\nSo, holding in abeyance the IWT could be seen as an extreme measure because it signals a violation of the right to life and food of the people of Pakistan. It unnerved the lower riparian state, and in water law, lower riparian anxiety is a given, although experts say it will take India quite a few years before it develops the infrastructure to start diverting the waters.\n\nSo, when India declared the IWT non-operational, it sent out strong signals of hostility. It was an act that historically preceded the setting up of a relation of war, irrespective of whether force is used or not. In this regard, one may refer to a lesser-known arbitration award given by International Chamber of Commerce in the Dalmia Cement Company case of 1965.\n\nThe cement company argued that its international contract relating to guarantee stood frustrated on account of the India-Pakistan war of 1965. The arbitrator had to determine whether the 1965 hostilities amounted to the relation of war under international law. He concluded that since, inter alia, international treaties between both countries were intact, it would not be a situation of a traditional ‘war’ but merely an armed conflict.\n\nGiven such legal precedents, Pakistan was right to see the holding in abeyance of the IWT as a hostile act tantamount to a declaration of war. Immediately thereafter, India made it known that it wanted to cross the international border and carry out strikes inside Pakistan that was left with no choice but to take preparatory measures. Yet Pakistan reached out to the UN Security Council, informing them that the situation was likely to endanger international peace and security.\n\nThe US president intervened and announced a ceasefire. Yet, the real indication of ending hostilities from the Indian side would be the revival of the IWT — like when the Indian fighter pilot Abhinandan was returned to India in 2019. Pakistan was not merely returning a POW but signalling under Article 118 of the Third Geneva Convention an end to hostilities from Pakistan’s side.\n\nThe writer is ex-federal law minister & advocate Supreme Court.\n\nahmersoofi@absco.pk\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682fd0bfaf682.jpg",
  "retrievedAt": "2025-08-23T14:24:02.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912772/self-defence-under-the-law",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:44:34.000Z"
}
