{
  "title": "Karachi mayor approaches CM for probe into water theft in city - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Confirms suspension of two KWSC officials for ‘neglect of duty’\n• MQM-P alleges Sindh govt backing ‘water mafias’ to punish Karachi\n\nKARACHI: In a significant development, Mayor Murtaza Wahab has officially acknowledged the scale of illegal water extraction taking place in the city and sought a formal order by the Chief Minister Syed Murad Ali Shah for an inquiry into the widespread illegal activity that was uncovered during a recent inspection.\n\n“During the course of this inspection, it was observed with great concern that widespread illegal water extraction was taking place in both the federal trunk main (FTM) and Customer and Technical Maintenance (CTM) Divisions. The scale and persistence of these activities point to a serious lapse in vigilance and operational oversight within the respective divisions,” wrote the Karachi mayor in a letter to the CM.\n\nThe letter by the mayor, who’s also the chairman of the Karachi Water & Sewerage Corporation (KWSC), is seen as an acknowledgment of the deep-rooted issues within the water utility details alarming lapses in oversight and calls for immediate accountability.\n\nIt referred to the surprise inspection conducted on May 10, 2025, by the mayor, who was accompanied by the Chief Executive Officer and Chief Operating Officer of the KW&SC. The inspection revealed widespread and unauthorised tapping of water resources in both the FTM and CTM divisions.\n\nThe move, while seen by some as a long-overdue crackdown on internal corruption and negligence, has simultaneously raised serious questions about the role and oversight of the KW&SC and the Sindh government itself. The mayor’s letter also outlined the grave findings of the inspection and confirms the immediate suspension of two KW&SC officials — Executive Engineer (Civil) CTM Division, Ahsanullah Shaikh and Assistant Executive Engineer, FTM Division, S.M. Ahsan — for gross dereliction of duty.\n\nMayor Wahab further urged that the matter be referred to the Chief Minister’s Inspection Team (CMIT) for an impartial and thorough inquiry, underscoring that accountability is essential to restoring public confidence in the city’s water management system.\n\n“Their [KWSC officials’] failure to prevent and respond to such unlawful activities constitutes a serious dereliction of duty,” he said. “Given the gravity of the matter and its implications for the integrity and credibility of KW&SC’s operations, it is most humbly requested that the issue be referred to the Chief Minister’s Inspection Team (CMIT) for a thorough and impartial inquiry. This will not only ensure that appropriate accountability is enforced but also serve as a strong deterrent against future transgressions.”\n\nWith a population exceeding 20 million, the city has faced a chronic water shortage for decades — a crisis that has only worsened in recent years. The situation turned from bad to worse last month and intensifies with each passing day. The city requires an estimated 1,200 million gallons per day (MGD) of water, yet only about 550 to 600 MGD is actually supplied — less than half of what is needed. The shortfall has allowed a massive black market in water to flourish, with so-called “water tanker mafias” siphoning off and selling water at exorbitant rates, often with the alleged complicity of officials within KW&SC.\n\nThe fallout from the mayor’s letter was swift. Senior MQM-Pakistan leader Senator Nasreen Jalil issued a scathing statement condemning what she described as the “collusion between the Sindh government and KW&SC.” She said the city’s water scarcity was not merely an administrative failure but a “deliberate deprivation” aimed at punishing Karachi and rewarding certain mafias.\n\n“The people of Karachi are dying of thirst while government-backed water mafias make billions,” said Ms Jalil. “From Lyari to Landhi, and from Gulshan to Gulistan-i-Jauhar, the entire economic engine of Pakistan is being kept thirsty through a planned conspiracy.”\n\nShe also accused the Sindh government of “weaponising water scarcity” to reward political loyalties and punish dissenting neighborhoods, calling on the federal government to intervene and treat Karachi as a city in humanitarian distress.\n\nHer remarks were echoed in recent protests by Jamaat-e-Islami (JI), which disrupted the last City Council session when its councillors marched outside the KMC building, demanding the resignation of key KW&SC officials and immediate federal oversight of the city’s water management.\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:13:27.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912705/karachi-mayor-approaches-cm-for-probe-into-water-theft-in-city",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:44:06.000Z"
}
