{
  "title": "ABAD proposes 15-year tax policy to boost investor confidence - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Association of Builders and Developers (ABAD) has called for a long-term 15-year tax policy to restore investor confidence, arguing that frequent changes in tax laws create uncertainty in the market, which is detrimental to both the economy and investment.\n\nIn its pre-budget proposal, ABAD Chairman Mohammad Hassan Bakhshi also demanded the abolition of advance tax under Section 236C and proposed capping the tax under Section 236K at a maximum of 0.5 per cent. He said that eliminating the advance tax would facilitate easier and quicker property transfers.\n\nThe current tax rate on property purchases under Section 236K is too high, he argued. The association proposed limiting this rate to 0.5pc to reduce the financial burden on buyers and investors and to enhance transparency in property transactions.\n\nMr Bakhshi further called for the repeal of Sections 7-E and 7-F. Under Section 7-E, a one per cent tax is imposed on property ownership even when no income is generated from the property, which he termed unfair. For Se­­c­tion 7-F, he recommended replacing the existing complex system with a simpler per-area tax mo­­del, similar to Sections 7C and 7D, to promote ease and transparency.\n\nRegarding capital gains tax, he noted that the current rules for taxing gains on property sales are unclear. ABAD proposed linking the tax to the holding period of the property to bring more balance and predictability to the market.\n\nMr Bakhshi also criticised the Federal Board of Revenue’s (FBR) refund approval process, calling it slow and non-transparent. Eliminating this requirement, he said, would provide immediate relief to the business community.\n\nHe highlighted contradictions in the valuation tables used to determine property prices, stating that these discrepancies create complications in property transactions.\n\nHe called for a reduction in the rate of withholding tax to encourage more property transactions and increase government revenue.\n\nTo encourage remittances, he also suggested easing tax burdens on overseas Pakistanis. When overseas Pakistanis purchase property in Pakistan using foreign currency, they are still subject to transfer tax, which ABAD considers unjust. Abolish­ing this tax would not only enhance remittances but also restore investor confidence among overseas Pakistanis.\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:24:15.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912734/abad-proposes-15-year-tax-policy-to-boost-investor-confidence",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:43:49.000Z"
}
