{
  "title": "3 terrorists killed, six escape in Mianwali operation: CTD - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three terrorists were killed while six others escaped after the Counter Terrorism Department (CTD) conducted an intelligence-based operation (IBO) near Rehmanikhel in Mianwali, according to the specialised police force on Friday.\n\nA statement issued by the CTD read that it conducted an IBO to arrest the terrorists.\n\nHowever, the terrorists opened fire on the police.\n\nIn an exchange of fire, the terrorist killed three of their own while the remaining six escaped.\n\nThe police found rifles, three hand grenades, bullets and explosives on the slain terrorists.\n\nA search operation was underway to arrest the terrorists who had escaped, the statement said, adding that the teams had set up a blockade near Rehmanikhel.\n\nThe process of identifying the slain terrorists was underway, the statement continued.\n\nIt added that the terrorists who were targeted had completed their planning for carrying out major attacks on police posts.\n\nSeparately, Khyber Pakhtunkhwa police, in a statement, said that unidentified miscreants carried out “unsuccessful attacks” on Fatehkhel chowki in Bannu district and Takia post in Bara tehsil of Khyber district, adding that both attacks were repelled by the police’s immediate response.\n\nA young man was injured in an exchange of fire in Bannu, the statement said.\n\nKP Inspector General of Police Zulfiqar Hameed said police foiled the attacks with professionalism and courage, adding that the evil elements in society will be brought to their end.\n\n“The soldiers showed great devotion to duty by remaining alert,” IG Hameed said, adding that the morale of the youth was high and they were determined to continue the struggle until terrorism was eradicated.\n\nThe IG paid tribute to the bravery of KP police and announced cash rewards and certificates of appreciation.\n\nIn a statement, Interior Minister Mohsin Naqvi paid tribute to the forces for foiling the attack on a police post in Bannu and the killing of three terrorists in Mianwali.\n\nHe said that the Bannu police personnel bravely confronted the terrorists and foiled the attack.\n\nHe congratulated KP Police personnel for foiling the nefarious intentions of the terrorists, emphasising that the KP police were fighting the war against terrorism with courage.\n\nThe country “is proud of the brave sons of the KP police”, Naqvi said.\n\nSpeaking about the Mianwali incident, Naqvi said that CTD personnel bravely fought the terrorists.\n\nNaqvi said he was proud of the CTD’s professional skills, adding that the team deserved praise for bringing down the terrorists.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022, vowing to target security forces, police, and law enforcement agencies personnel.\n\nEarlier this month, a policeman was shot dead by unidentified assailants in the limits of the Mandan police station in Bannu.\n\nAt least six people, including three students, were slain while over 40 others — mostly students — sustained injuries after a bomb targeted a bus near Zero Point in Khuzdar on Friday on the Quetta-Karachi highway when it was on its way to drop the students at the Army Public School in Khuzdar Cantonment.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:24:01.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912820/3-terrorists-killed-six-escape-in-mianwali-operation-ctd",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T08:57:55.000Z"
}
