{
  "title": "Major milestones achieved during China visit: Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says Beijing, Kabul agreed no terrorist to be allowed to use any country’s soil\n• Confirms China may fund Pakistan-Afghanistan-Uzbekistan railway project\n• Says several Indian aircraft, UAV downed during clash\n\nISLAMABAD: Deputy Prime Min­ister and Foreign Minister Senator Moh­a­­mmad Ishaq Dar, while describing his recent three-day China visit as highly successful, said on Thursday that Pakis­tan had achieved significant progress on diplomatic, strategic and economic fro­nts during the engagements held in Beijing.\n\nGiving details of the meetings also attended by Afghanistan here at a news conference, Mr Dar said a clear agreement was reached with both Beijing and Kabul that no terrorist organisation whether the banned TTP, BLA or any other would be allowed to use any country’s soil against another.\n\nThe deputy premier announced that discussions on CPEC 2.0 were promising. “We have successfully laid the groundwork for expanded cooperation under the Belt and Road Initiative.”\n\nHe confirmed that China had expressed its intent to finance the Pakistan-Afghanistan-Uzbekistan railway project, calling it a transformative step for regional connectivity.\n\n“We have already sent a draft framework to Uzbekistan and Afghanistan. While the meeting is proposed for May 29-30, I am committed to finalising this by early June,” he added.\n\nHe said the project, along with the Peshawar-Kabul Highway and ML-1 upgrades, would massively boost Pakistan’s connectivity to Central Asian Republics and enhance the commercial potential of underutilised ports.\n\nHe said his visit also marked substantive decisions with China and Afghanistan, especially on issues of refugees and counterterrorism.\n\nReflecting on security cooperation, the foreign minister stated that China had deep concerns over attacks on its personnel in Pakistan. “I assured them that we are addressing these threats seriously. We discussed a permanent mechanism to prevent cross-border terrorism, and I commend both China and Afghanistan for aligning with our zero-tolerance stance.”\n\nHe emphasised that the Chinese leadership stood by Pakistan on all core issues, adding that they reiterated their support for “our sovereignty and territorial integrity and firmly backed Pakistan’s stance on Kashmir, calling for its resolution in line with UN Security Council resolutions. We reaffirmed our support for the One-China policy, including Tibet”.\n\nHe invited Chinese officials to Islamabad for the second round of Pakistan-China Strategic Dialogue.\n\nRegional security\n\nAddressing the regional security environment, the deputy PM stated, “We have successfully countered the Indian narrative, especially regarding the events of 2019. We offered an international investigation into the Pahalgam incident, which India declined. Our transparency strengthened Pakistan’s credibility, and several international actors endorsed our position after verifying the facts.”\n\nHe condemned the Indian attacks and shared that during the recent conflict, 75 Indian aircraft were launched, 24 payloads dropped, and multiple aircraft, including Rafales and a UAV, were downed by Pakistan. “We have never built our nukes and missiles to attack others, but to safeguard peace.”\n\nMr Dar highlighted the government’s commitment to improving ties with Afghanistan. “We have religious, cultural, historical, and geographical ties with Afghanistan. Our outreach was welcomed across Afghan society. We need to progress beyond the chargé d’affaires level and engage substantively.”\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:13:28.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912751/major-milestones-achieved-during-china-visit-dar",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:43:36.000Z"
}
