{
  "title": "Khuzdar attack driven by Indian provocation, had nothing to do with Baloch identity: DG ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry has reiterated that “Indian state-sponsored terrorism against Pakistan” — which he said had been ongoing since the inception of the country — was also responsible for the recent attack in Balochistan’s Khuzdar.\n\nOn May 21, at least six people, including three students, were slain while over 40 others — mostly students — were injured after a bomb targeted a school bus near Zero Point in Khuzdar on the Quetta-Karachi highway when it was on its way to drop the students at the Army Public School in Khuzdar Cantonment.\n\nOn Thursday, the army’s top brass, during the 270th Corps Commander Conference (CCC), had also pointed out India’s involvement in the incident, vowing that the armed forces will prevent the country’s peace from being compromised by “externally-sponsored terrorism.”\n\nKey points\n\nLt Gen Chaudhry was addressing a press conference in Islamabad today alongside the Interior Secretary, Captain (retd) Khurram Muhammad Agha.\n\n“India was planning and instructing terrorist activities taking place in Pakistan, the funding for which is also provided by India,” Lt Gen Chaudhry said. “The attack in Balochistan had nothing to do with the Baloch identity, rather it was just India’s provocation.”\n\nThe DG ISPR highlighted that the attack on the Chinese envoy in Karachi in Oct 2024 also had Indian backing. “The Indian social media accounts affiliated with the Indian intelligence agency RAW (Research and Analysis Wing) posted about the attack beforehand.”\n\nHe added that the same thing happened during the hijacking of the Jaffar Express train in March when more than 400 passengers were taken hostage by the banned Balochistan Liberation Army terrorists.\n\n“Before the Jaffer Express incident occurred, they [the social media accounts] were asking followers to ‘keep an eye on Pakistan today and tomorrow’.”\n\nLt Gen Chaudhry pointed out that the Indian media was “celebrating” the attack in Khuzdar.\n\n“These are all Indian accounts, affiliated with RAW [and] posting for BLA and Fitna al Hindustan, he said, referring to the government-designated term for all terror outfits in Balochistan. “What kind of a country celebrates acts of terrorism?”\n\nThe DG ISPR also maintained that New Delhi had been involved in perpetrating terrorism across the country “since the inception of Pakistan.”\n\n“In 2009, the Pakistani government handed a dossier containing irrefutable evidence [of India’s involvement in terror attacks across Pakistan] to the Indian prime minister,” he said. “The publicly disclosed documents released in 2010 are part of history. In 2016, the world saw another ugly face of India-sponsored terrorism in Balochistan in the form of [Indian spy] Kulbushan Jadhav, a serving Indian naval officer,” he said.\n\nJadhav was arrested on March 3, 2016, in a counter-intelligence operation in Balochistan’s Mashkel area for his involvement in espionage and sabotage activities against Pakistan.\n\n“Then in [2020], a dossier full of evidence was presented to the United Nations. Very recently, the international media has seen confessions and acknowledgement of multiple surrendered terrorists of this Fitna al Hindustan,” he said.\n\nInterior Secretary Agha also said that India was behind the terrorist incident in Khuzdar on May 21.\n\n“In the aftermath of the despicable terrorist attack on a school bus in Khuzdar in the early morning of May 21, this cowardly attack targeted innocent children, our future, resulting in the tragic loss of six children and injuries to 31 others.\n\n“Let me be unequivocal that this was not an attack on a bus alone, it was an attack on our values, our education, and the very fabric of our society,” Capt (retd) Agha said.\n\n“On behalf of the government of Pakistan, I extend my deepest condolences to the families of the victims, we share their grief and we stand by them in this hour of immense suffering. The Ministry of Interior, in close cooperation with the provincial authorities and the law enforcement agencies, is looking into all [aspects] of this dastardly attack.”\n\nCapt (retd) Agha said initial findings confirmed that this attack was a continuation of a broader pattern of violence sponsored by India through Fitna al Hindustan, operating under the tutelage and intelligence of the Indian intelligence agency, RAW [Research and Analysis Wing].\n\n“Having miserably failed in the so-called Operation Sindoor, the terror proxies of Hindustan have been tasked to accentuate their heinous attacks of terrorism in Balochistan and elsewhere. Let me be absolutely clear here, the people of Pakistan will not let them succeed.\n\n“Pakistan and its people, particularly in Balochistan, reject this nefarious design. The state has the capacity and the will to dismantle these networks and bring the perpetrators and their handlers to justice. Such actions will have consequences.”\n\nHe said in the past couple of years, having suffered immense casualties in their attempts against hard targets, Fitna al Hindustan has resorted to hitting soft targets, wayfarers, labourers working on development projects, infrastructure and machinery to paint a picture of loosening control of the State.\n\n“Much against the tradition and culture of the Baloch, these terrorists have stooped so low that innocent school children have now been targeted. I assure you that the State, in collaboration with the provincial governments and the state apparatus, will defeat them.\n\n“These Indian-sponsored terrorists have no place in Pakistan and our national discourse. We have … commitment to bring an end to this violence. Our resolve is firm and our response will be decisive. They will not succeed.”\n\nLt Gen Chaudhry then spoke about the Indian attacks on Pakistan on May 6 and 7, which were carried out by New Delhi after blaming Islamabad for April’s Pahalgam attack in occupied Kashmir and led to civilian deaths.\n\n“Never in modern history have you seen any nation, any media celebrating the killing of children and women the way [India] is celebrating.\n\n“This is the low moral fibre and level that the current Indian political elite has brought the society to.”\n\nHe said that one of the proxies of the Fitna al Hindustan on May 11 issued a press release displaying a post from BLA.\n\nIn the post, he said that the BLA had assured India that if it received “political, diplomatic and defence support” from New Delhi, “We, along with the entire nation, is ready to attack from the western border and we will become its [India’s] practical and military arm”.\n\nHe said that RAW made BLA issue this press release “because they are unable to deter the state of Pakistan … They attack but the resolve of Pakistani people has not diminished.”\n\n“Will we be deterred by the Fitna al Hindustan with such press releases and cowardly actions? Absolutely not. Never,” he said.\n\nHe further said, “Instead of refraining from their oppression of minorities or finding a solution, India is carrying out terrorist activities in Pakistan and the region.”\n\n“They are externalising internal issues and when anyone asks for evidence, they do not have evidence. Who is the state sponsor of terrorism and the epicentre of destabilisation in this region?” he questioned.\n\nThe DG ISPR also called out the Indian media for spreading propaganda and said: “The Indian media is not free but controlled by the state,” he said, adding that those who were questioning media freedom in Pakistan were now aware of how free it was, compared to the “conditions of media in a so-called democracy [India].”\n\nSpeaking about terrorists who had surrendered before the State, the DG ISPR said: “There were some brave ones who stood up and surrendered because they realised that they were not there to fight India’s war. They [surrendered terrorists] come and tell us how India was involved.”\n\nHe highlighted the case of Adeela Baloch, a former militant who had surrendered herself to the authorities.\n\n“She was exploited and blackmailed by the Fitna al Hindustan to become a suicide bomber,” Lt Gen Chaudhry said, adding that India was “exploiting young women from Balochistan.”\n\nIn response to a question about a policy to counter Fitna al Hindustan, the DG ISPR replied: “I would say that our one-liner policy is that the nation, this iron wall, we fought in a gallant and exemplary manner against the Indian military aggression on the night of [May] 6 and 7, and you saw it again on May 10.\n\n“This steel wall needs to be in unison and turned against the forces of terrorism.”\n\nThe DGR ISPR further said: “We need to understand certain facts. Why did the Indians feel the need to resort to this military escalation? One of the very important reasons was that all elements of national power over the last two years have gelled together.”\n\nHe went on to say that Pakistan had begun “squeezing the space for terrorists to operate” and that in the first five months of this year, 203 terrorists had been killed in Balochistan alone.\n\n“Illegal Afghans are being pushed out and actions are being taken against the crime-terror nexus. In Balochistan, illegal trade routes are being shut down to stop funding for these terrorists,” DG ISPR added.\n\nAnswering another question, the DG ISPR vehemently criticised the Baloch Yakjehti Committee and its leader Dr Mahrang Baloch, saying that the media needed to “unmask” the group and its membership.\n\n“The state has taken action against the BYC [and] their space has been squeezed,” he said.\n\nHe said that India’s military escalation was a necessity to create space for their proxy groups in the region, but stated that Pakistan did not disengage a single soldier from its counterterrorism force.\n\n“Did we take even one soldier out? No. Because we knew they would operate in unison.”\n\nHe added that India was growing frustrated and desperate, stating that the country’s media was “howling” about Balochistan.\n\n“It is clear that this is not a war of the Baloch, it is a war against Indian terror proxies who are killing children for money. Once they know it, then they get worried,” DG ISPR said.\n\nDG ISPR reiterated that Pakistan was the “rational player” in the scenario with India and stated that the Pahalgam attack took place due to “India’s own oppression in Kashmir”.\n\n“Their response was totally irrational, illogical and unilateral,” Lt Gen Chaudhry said. “Pakistan is approaching the issue of terrorism in Balochistan rationally because we are resolving it in unison and with the synergetic application of all elements of national power.\n\n“[The] military is one part, where we have carried out more than 93,000 operations across Pakistan in one and a half years,” he added. Another part is socioeconomic, another is diplomacy, while the other part is us sitting here telling the people and the international community that this has nothing to do with Balochistan.\n\n“This is state-sponsored terrorism by India.”\n\nDG ISPR added that Pakistan “striking Indian cities and temples” would not resolve the problem, adding that “that is not how a rational state acts.\n\n“We are going to tell the world … that this is the epicentre of destabilisation in this region, India,” he added. “[They have] a history that starts from 1971 with the Mukti Bahini, and even before. And in multiple countries of this region. I will not name it now but there is proof, the world knows it.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/23150002e7ab7a5.jpg",
  "retrievedAt": "2025-08-23T14:23:59.318Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912830/khuzdar-attack-driven-by-indian-provocation-had-nothing-to-do-with-baloch-identity-dg-ispr",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T09:59:23.000Z"
}
