{
  "title": "Army chief’s elevation to field marshal splits PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: There appears to be a split in the PTI over Chief of Army Staff Asim Munir’s promotion to the rank of field marshal, as its interim chairman Gohar Ali Khan felicitated the newly appointed field marshal as opposed to the incarcerated party founder, Imran Khan, who criticised the government’s move.\n\nIf a message posted on his X handle is to be believed, Imran Khan criticised the promotion in his interaction with lawyers, family members, and journalists during a hearing in the Adiala Jail courtroom on Wednesday. The tweet was posted on Thursday morning, however. It may be noted that the PTI leader had also met his sisters and lawyers, including Salman Safdar and Usman Gill, on the jail premises on Wednesday.\n\nThe former premier doesn’t have access to his X account and someone else posts on his behalf, but the PTI has never revealed the identity of Mr Khan’s social media handler.\n\nThe PTI founder said it would have been more app­ropriate if Gen Asim Munir had been declared ‘king’ as Pakistan was being run according to the ‘law of the jungle’. He quipped that in the law of the jungle, “there is only one king”.\n\nThe harsh stance taken by the former prime minister comes in contrast to his party leaders, particularly Gohar Ali Khan, who also met him in jail on Thursday. Barrister Gohar told a local news channel that Allah has given the honour to COAS Asim Munir and also entailed responsibility. “I request all to improve/normalise the situation of the country,” he said.\n\nDawn.com quoted him as saying that there would be a formal statement by the PTI on the development. “This is why I am saying that the [army chief] has gotten this new honour of field marshal. [We] have congratulated, but after this new honour, there is an increased responsibility on him to play his role even more and make the situation better,” he told reporters outside the jail as per Dawn.com.\n\n“We have no strife with the military. Khan sahib also said yesterday that we stand with our armed forces and whoever is related to the armed forces will be uncontroversial,” he added.\n\nPTI leader’s sister Aleema Khan criticised the interim chairman, Barrister Gohar, in her interaction with media persons, saying that he gave the statement felicitating the army chief in his personal capacity. The opinion of the party is not the opinion of Barrister Gohar, she added.\n\n“We have given the statement of the founder of PTI yesterday,” she said, adding that Barrister Gohar could speak for the PTI in the presence of the party founder. The founder clearly said yesterday (Wednesday) that there was “a law of the jungle here, it would be better if the army chief gave himself the title of the king”, she added.\n\nEarlier this week, the federal cabinet approved the promotion of COAS Asim Munir to the rank of field marshal for his leadership in the recent conflict with India known as ‘Marka-i-Haq’.\n\n‘No deal’\n\nA post on Mr Khan’s X account said the rumours regarding a deal were not correct, but he still invited the establishment for talks for the sake of the country.\n\nThe post added Mr Khan did not want any deal or relief.\n\nIt was “unfortunate that the law only applied to the weak in Pakistan and it was against the principles of democracy and the rule of law”.\n\nThe post also criticised the drone attack in Khyber Pakhtunkhwa and directed the provincial government to register a protest with the federal government and make sure that it was not repeated. He said that the killing of people with drones cannot reduce terrorism.\n\nIt added that Pakistan made a lot of efforts to stop drone attacks by the United States, adding that bombs should not be dropped on own people.\n\nAs per the post, Mr Khan praised the role of armed forces, especially the air force, which thwarted Narendra Modi’s attempts to attack Pakistan and suggested they be ready for such actions in future.\n\nGandapur’s IMF warning\n\nMeanwhile, Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur warned the federal government that it could reconsider its cooperation with the federal government over the IMF conditions if party leaders were not allowed to meet the incarcerated leader.\n\nSpeaking to media persons outside Adiala Jail after meeting Imran Khan, the CM said the PTI founding leader was willing to initiate dialogue “in the best interest of Pakistan”.\n\nHe said that if party leaders were denied access to Imran Khan, the PTI would reconsider its cooperation with the government, including on key issues like compliance with IMF conditions.\n\nMeanwhile, the PTI spokesperson issued a statement, condemning the delays in scheduling bail hearings in the cases of the party’s founding chairman.\n\nPTI Central Information Secretary Sheikh Waqqas Akram, in a statement on Thursday, flayed the regime for allegedly subjecting Imran Khan to harsh conditions.\n\n“Such oppressive and sinister tactics are destined to fail, as (Imran) Khan’s spirit remains unbroken and resolute as the entire nation stands firmly behind its leader. PTI will not hold talks…because they (government) did not have legal, constitutional and moral authorities in this regard,” he claimed.\n\nHe emphasised that the government should not trust India and refrain from resuming dialogue until it renounces terrorism, restores the Indus Waters Treaty, and reinstates the constitutional status of occupied Kashmir.\n\nMohammad Asghar in Rawalpindi and Malik Asad in Islamabad also contributed to this report\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:24:36.884Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912760/army-chiefs-elevation-to-field-marshal-splits-pti",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:43:30.000Z"
}
