{
  "title": "Golden Dome plan could launch new era of weapons in space - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Donald Trump’s Golden Dome missile defence concept revives a controversial, decades-old initiative whose ambitious construction could upend norms in outer space and reshape relations between the world’s top space powers.\n\nThe announcement of Golden Dome, a vast network of satellites and weapons in Earth’s orbit set to cost $175 billion, could sharply escalate the militarisation of space, a trend that has intensified over the last decade, space analysts say.\n\nWhile the world’s biggest space powers — the US, Russia and China — have put military and intelligence assets in orbit since the 1960s, they have done so mostly in secrecy.\n\nUnder former President Joe Biden, US Space Force officials had grown vocal about a need for greater offensive space capabilities due to space-based threats from Russia and China.\n\nWhen Trump announced his Golden Dome plan in January, it was a clear shift in strategy, one that emphasises a bold move into space with expensive, untested technology that could be a financial boon to US defence contractors.\n\nThe concept includes space-based missiles that would launch from satellites in orbit to intercept conventional and nuclear missiles launched from Earth. “I think it’s opening a Pandora’s box,” said Victoria Samson, director of space security and stability at the Secure World Foundation think tank in Washington, referring to deploying missiles in space. “We haven’t truly thought about the long-term consequences for doing so,” she added.\n\nSamson and other experts said Golden Dome could provoke other states to place similar systems in space or to develop more advanced weapons to evade the missile shield, escalating an arms race in space.\n\nRussia and China reaction\n\nA Chinese foreign ministry spokesperson said it was “seriously concerned” about the project and urged Washington to abandon its development, adding that it carried “strong offensive implications” and heightened the risks of the militarisation of outer space and an arms race.\n\nA Kremlin spokesperson said Golden Dome could force talks between Moscow and Washington about nuclear arms control in the foreseeable future.\n\nPrimarily seeking to defend against a growing arsenal of conventional and nuclear missiles from US adversaries Russia, China and smaller states such as North Korea and Iran, the Golden Dome plan is a revival of a Cold War-era effort by former US President Ronald Reagan’s Strategic Defense Initiative (SDI), better known as the “Star Wars” program.\n\nSDI envisioned stationing a constellation of missiles and powerful laser weapons in low-Earth orbit that could intercept a ballistic nuclear missile launched anywhere on Earth below, either in its boost phase moments after launch or in its blazing-fast cruise phase in space. But the idea never came to fruition mainly because of technological hurdles, as well as the high cost and concerns it would violate an anti-ballistic missile treaty that has since been abandoned.\n\nWe’re ready\n\nGolden Dome has strong and powerful allies in the defense contracting community and the growing defense technology arena, many of whom have been preparing for Trump’s big move into space weaponry.\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/231009150bbf7d8.jpg",
  "retrievedAt": "2025-08-23T14:24:13.933Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912729/golden-dome-plan-could-launch-new-era-of-weapons-in-space",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:44:00.000Z"
}
