{
  "title": "IHC judge softens stance on division bench’s stay order - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Sardar Ejaz Ishaq Khan of the Islamabad High Court on Thursday softened his stance in a written order issued in a contempt of court case against senior IHC officials for transferring Imran Khan’s visit-related petition from his court to a larger bench.\n\nThe order followed a strongly-worded courtroom observation on May 16 regarding a stay order passed by a division bench.\n\nDuring the May 16 hearing, Justice Ejaz expressed displeasure upon discovering that a division bench had issued a stay order on April 9, effectively suspending the proceedings he had initiated. The judge reportedly described the interim order as “disturbing” and “extraordinary”, going so far as to question its legal propriety and its implications for judicial discipline and internal coherence within the High Court.\n\nThe judge sharply criticised the division bench for what he perceived as interference with a matter that had been proceeding appropriately under his jurisdiction. He also observed that the stay order had cast a shadow over the integrity and image of the Islamabad High Court, a point he emphasised with visible concern.\n\nHe further observed that the stay order was not applicable in the case he was seized with as the interim order of his court in a contempt case could not be challenged before the division bench.\n\nSurprising shift\n\nHowever, in a surprising shift, the written order issued by Justice Ejaz on the same day reveals a far more tempered and composed approach.\n\n“Though a longish order was dictated in court in the rather distressing circumstances that unfolded this morning… on calmer reflection, I consider it appropriate for the dignity of the Court that that interim order should prevail for the time being,” wrote the judge.\n\nHe noted that despite apparent discrepancies in the division bench’s order — such as incorrect references to his earlier decisions — he would refrain from exploiting such procedural flaws, signalling restraint and a desire to preserve institutional harmony.\n\n“I also note that I refrain from taking advantage of the fact that the said order noted the wrong particulars… Let a copy of this order be placed on the file of the appeal before the division bench,” the order concluded.\n\nPublished in Dawn, May 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:13:25.575Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912755/ihc-judge-softens-stance-on-division-benchs-stay-order",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T01:43:35.000Z"
}
