{
  "article_id": "2025-03-05_ecf203902326bfefc6693db6a515e398",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/all-16-bannu-attack-khwarij-eliminated-ispr-2/",
    "retrieved_at": "2025-08-27T13:22:44.175Z"
  },
  "metadata": {
    "title": "All 16 Bannu attack Khwarij eliminated: ISPR",
    "author": null,
    "date_published": "2025-03-05T10:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Mar 05 (APP): Security forces have eliminated all 16 terrorists, including four suicide bombers, who attempted to breach the security of Bannu Cantonment. \"On 4 March 2025, a cowardly terrorist attack was attempted on Bannu Cantonment by Khwarij elements. The assailants sought to breach the cantonment's security; however, their nefarious designs were swiftly and decisively foiled by the vigilant and resolute response of Pakistan's security forces. In their desperation, the attackers rammed two explosive-laden vehicles into the perimeter wall,\" said an ISPR news release. It further said, \"Displaying unwavering courage and professional excellence, our valiant troops engaged the intruders with precision, eliminating all sixteen terrorists, including four suicide bombers. In this intense exchange of fire, five brave soldiers, after putting up a heroic resistance, embraced martyrdom in the line of duty.\" The multiple suicide blasts resulted in the partial collapse of the perimeter wall, causing damage to the adjacent infrastructure. Tragically, a mosque and a civilian residential building in close proximity also suffered severe destruction, leading to the martyrdom of thirteen innocent civilians and injuries to thirty-two others. Intelligence reports have unequivocally confirmed the physical involvement of Afghan nationals in this heinous act, with evidence also pointing to the fact that the attack was orchestrated and directed by Khwarij ring leaders operating from Afghanistan. Pakistan expects the Interim Afghan Government to uphold its responsibilities and deny its soil for terrorist activities against Pakistan. Pakistan reserves the right to take necessary measures in response to these threats emanating from across the border. The security forces of Pakistan remain steadfast in their resolve to eradicate terrorism in all its forms. The sacrifices of our brave soldiers and innocent civilians further reinforce our unwavering commitment to safeguarding our nation at all costs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}