{
  "title": "NSA asks India to reverse unilateral actions in IIOJK for talks",
  "link": "https://www.app.com.pk/national/nsa-asks-india-to-reverse-unilateral-actions-in-iiojk-for-talks/",
  "date_published": "2021-07-24T12:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):National Security Adviser, Dr Moeed Yusuf on Saturday said there could be no forward movement unless India takes concrete steps to reverse the situation on the ground in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and stops sponsorship of terrorism against Pakistan.\nThe National Security Adviser (NSA) in his interview to prominent Indian journalist Karan Thapar responded to the Indian offer to revive dialogues between India and Pakistan, highlighted Indian state sponsored terrorism against Pakistan and its terror financing proofs.\nWhile laying out Pakistan’s position on Kashmir, Dr. Yusuf said that the government and the people of Pakistan would remain committed to the Kashmir cause till such time that the Kashmiris were granted their right to self-determination under UNSC resolutions.\nElaborating the offer from India to hold talks, Dr. Yusuf said that Pakistan had clearly communicated to India that it must halt demographic change in IIOJK, ensure the protection of Kashmiri identity and give Kashmiris their rights before any dialogue or talks could take place.\nThe National Security Adviser also provided details of Indian sponsorship of terrorism against Pakistan.\nHe said Pakistan had provided a detailed dossier with evidences on Indian involvement in terrorism inside Pakistan.\nHe provided information on Indian intelligence agency (RAW) involvement in the Johar Town blast in Lahore last month, saying that evidence of banking transactions, telephone records and cyber attacks revealed direct involvement of India in the attacks.\nDr. Yusuf also said that Indian intelligence agencies were deliberately targeting CPEC and Chinese interests in Pakistan through their terrorist proxies.\nDr. Yusuf said that Pakistan had always stood for peace and Prime Minister Imran Khan had clearly said in Tashkent that Pakistan wanted to have a civilized relationship with India as a neighbour, but the Indian government’s RSS inspired Hindutva ideology was a stumbling block.\nHe asked why people inside India were comparing Modi to Hitler?\nHe told the Indian journalist that Pakistan was deeply concerned about India’s rogue behavior including reports of Indian state-sponsored spying on Pakistani individuals revealed under the recent Pegasus scandal and the revelation made by Indian Foreign Minister that the Modi government had politicized the FATF technical process to ensure Pakistan remains in the grey list despite meeting almost all technical criteria.\nIn response to a question on whether a window of opportunity remained for Pakistan and India to move forward, Dr. Yusuf said that Pakistan hoped that the possibility of moving forward remained if the Indian government realized its mistakes in IIOJK and took the right steps to reverse the situation on the ground to before 5th August 2019.\n“If India takes such actions and ends terrorism inside Pakistan, then both countries can work towards resolving their core issues which will benefit the common citizens of both countries,” he added.\nHe said Pakistan is pursuing a policy of geo-economics and that is why Pakistan wanted peace and stability in Afghanistan.\nHe said Pakistani leadership has spent over 15,000 hours in trying to convince all parties in the Afghan conflict to sit together and find a negotiated inclusive political settlement in Afghanistan for peace and stability because Pakistan did not want a protracted war in Afghanistan.\nThe National Security Adviser said that Pakistan was committed to working with all regional countries that wanted peace and stability in Afghanistan. However, alluding to India, he said countries that were spoilers in Afghanistan and did not want peace in the country should desist from their negative actions.\nDr. Yusuf also categorically said that India has turned Afghanistan into a terrorism hub by sponsoring anti-Pakistan terrorist groups and this was unacceptable for Pakistan.",
  "retrievedAt": "2025-08-11T21:00:01.991Z"
}
