{
  "title": "3.2 million voters to elect 45 legislators of AJK Assembly on July 25",
  "link": "https://www.app.com.pk/national/3-2-million-voters-to-elect-45-legislators-of-ajk-assembly-on-july-25/",
  "date_published": "2021-07-24T18:55:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Jul 24 (APP):Azad Jammu and Kashmir election commission has finalized all arrangements of polling on July 25 for 45 general seats of legislative assembly including deployment of polling staff with polling material and security personnel of police, frontier corps and rangers while the army will remain standby as a quick response force.\nAccording to the Election Commission, 5129 polling stations have been established for 3.2 million registered voters out of which 826 have been declared most sensitive and 1209 as sensitive deploying additional forces. polling will continue from 08:00am to 05:00pm while results at the polling stations will be announced after one hour of the conclusion of the polling.\nThe election commission said, 32200 additional security personnel have been deployed on polling stations including Punjab Police 12000, KPK Police 10,000, FC 4000, Rangers 3200 and Islamabad police 1000 besides 5300 police officials of AJK police to maintain law and order during and after the polling at polling stations while Pakistan army will also be available for patrolling and as quick response force.\nAccording to data 701 candidates are contesting for 45 general seats including 12 refugee seats in Pakistan. Tough contest has been expected between three main political  parties Pakistan Tehreek-e- Insaaf (PTI), Pakistan Muslim league Nawaz (PMLN) and Pakistan Peoples party (PPP) while on 7 seats regional parties Muslim Conference (MC) and Jammu Kashmir peoples party (JK-PP)’s candidates are in tough contest against candidates of major political parties, on 6 MC and on one JKPP.\nIn Muzaffarabad division, Prime Minister Raja Farooq Haider Khan is striving hard to survive for the upcoming Assembly in two constituencies LA 32 Muzaffarabad 6 and LA 33 Muzaffarabad 7. In LA 32, Mr. Haider is facing toughest contest by PPP’s candidate Sahibzada Ashfaq Zaffar and in LA-33, PTI’s candidate Dewan Ali Khan chughtai is being considered stronger and favorite against him.\nSpeaker Shah Ghulam qadir is contesting election from LA 25 Neelum 1 against PTI’s candidate Sardar Gulekhandan Khan and PPP’s candidate Mian Abdul Waheed but here contest has expected between Mr. Qadir and GuleKhandan and former is being considered favorite while in LA 26 Neelum 11 PPP’s Mian Abdul Waheed is facing PTI’s Raja Muhammad Illiyas and Raja Bashir of PMLN but waheed is expected to win comfortably.\nIn LA 27 Muzaffarabad 1, Sitting Minister Naureen Arif is contesting elections against PPP’s Sardar Javed Ayoob and PTI’s Mir Attique ur Rehman but a tough contest is expected between the latter two candidates.\nIn LA 28 Muzaffarabad 11, toughest contest is expected between PTI’s Chaudhary shehzad Mehmood and PPP’s Syed Bazil Naqvi but PMLN candidate Syed Murtaza Gilani is also in the run. In La 29 Muzaffarabad 111 (City) PTI’s candidate Khawaja Farooq is facing a tough contest from one Independent candidate Sardar Mukhtiar Abbasi and PMLN candidate Barrister Ifftikhar Gilani but apparently Khawaja is ahead of others.\nIn LA. 30 Muzaffarabad 4 Chaudhary Rasheed of PTI is expected to win against PMLN’s Mustafa Bashir Abbasi and PPP’s Mubashir Munir Awan. PPP’s AJK chapter President Chaudhary Latif is facing a tough contest against MC’s Raja Saqib Majeeb in LA 31 Muzaffarabad 5 but PMLN candidate Raja Abrar and PTI’s candidate Raja Mansoor are also in the contest in this constituency.",
  "retrievedAt": "2025-08-11T20:59:56.248Z"
}
