{
  "title": "Religious beliefs of each other to be respected in Muharram: Ashrafi",
  "link": "https://www.app.com.pk/national/religious-beliefs-of-each-other-to-be-respected-in-muharram-ashrafi/",
  "date_published": "2021-07-24T14:33:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 24 (APP):Special Representative to Prime Minister on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi has said that in Muharram, the followers of different religions and religious sects will respect religious beliefs, opinions and ideologies of each other.\nAddressing a press conference here on Saturday, he said that the sanctity of any religion or sect would not be disgraced, adding that no one had the right to call others infidels.\nHe said that all citizens living in Pakistan had the right to live according to their religion and religious beliefs. He said that Islamic Sharia has given women their right to inherited properties.\nTo a question, he said that the armed struggle against the government, the army and the security agencies was a coup and unacceptable in any circumstances. He made it clear that only the government had the authority to wage jihad and armed struggle against any entity.\nHe said the message of peace and order in Pakistan would be conveyed to the people during the holy month of Muharram.\nAshrafi announced that delegations of Muttahida Ulema Board would visit different districts from July 27.\nTo a question, he said that Kashmir was the lifeline for Pakistan and no one could betray it. “Prime Minister Imran Khan raised the issue before the whole world,” he said.\nAshrafi stressed that the Kashmir issue must be resolved in accordance with the UN resolutions, adding that\nresolving the Kashmir issue was the responsibility of the world. “I would urge politicians not to talk about Kashmir in a way that makes the enemy happy,” he said.\nHe said that some politicians were unnecessarily trying to make the Kashmir issue controversial. He said PM Imran Khan had rightly said that nobody was going to make Kashmir a province of Pakistan.\n“We must formulate a unified policy on Afghanistan,” Ashrafi said in reply to a question. Kashmir and Afghanistan were common issues, he said, adding that those issues should not be made controversial at all.",
  "retrievedAt": "2025-08-11T20:59:59.339Z"
}
