{
  "article_id": "2025-01-03_b455ba18b56eac9742f737511e030fa8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rawalpindi-women-university-delegation-visits-parliament-house/",
    "retrieved_at": "2025-08-27T11:18:57.898Z"
  },
  "metadata": {
    "title": "Rawalpindi Women University delegation visits Parliament House",
    "author": null,
    "date_published": "2025-01-03T11:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 157,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 03 (APP):A 52-member delegation comprising students and faculty from Rawalpindi Womenas University Friday visited the Parliament House as part of an educational tour. Senior officials of the Senate warmly welcomed the delegation upon their arrival, according to a news release. During the visit, the delegation toured the Senate Museum, where they were shown a documentary on the history of the Upper House. The students expressed keen interest in the statues of prominent politicians and historical photographs displayed in the museum. The delegation also visited the Banquet Hall, where they received a detailed briefing on the working procedures of the Senate and the legislative process. Later, the students were taken to the Senate Hall, where officials explained the significance of the Senateas functions and its role in lawmaking. The visitors expressed gratitude to the Senate officials for their hospitality and the insightful information shared during the tour, describing the visit as a memorable and enriching experience.",
    "summary": "A delegation from Rawalpindi Women's University visited the Parliament House as part of an educational tour. The delegation toured the Senate Museum and received briefings on the Senate's procedures and lawmaking process. The students expressed gratitude for the informative visit.",
    "keywords": [
      "Rawalpindi Women's University",
      "Parliament House",
      "Senate",
      "delegation",
      "educational tour",
      "museum",
      "lawmaking"
    ]
  },
  "entities": [
    {
      "text": "Rawalpindi Womenas University",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Parliament House",
      "label": "LOCATION",
      "wikidata_id": "Q713998"
    },
    {
      "text": "Senate",
      "label": "ORGANIZATION",
      "wikidata_id": "Q134107"
    },
    {
      "text": "ISLAMABAD",
      "label": "LOCATION",
      "wikidata_id": "Q1035"
    }
  ]
}