{
  "article_id": "2025-01-03_2bb07700fcb04810023ed876778bf5ce",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-holds-roundtable-about-us-sanctions-on-pakistans-missile-program/",
    "retrieved_at": "2025-08-27T11:17:53.907Z"
  },
  "metadata": {
    "title": "ISSI holds roundtable about US sanctions on Pakistanâs missile program",
    "author": null,
    "date_published": "2025-01-03T16:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 702,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 3 (APP):The Arms Control and Disarmament Centre (ACDC) at the Institute of Strategic Studies Islamabad (ISSI) on Friday hosted a Roundtable Discussion on aLatest Discriminatory U.S. Sanctions and Assertions about Pakistanas Missile Program a Implications and Challenges.a Eminent speakers included Advisor to the SPD Zamir Akram, Dean of Social Sciences and Professor at the School of Politics and International Relations, QAU Dr. Zafar Nawaz Jaspal, DG ACDIS, MOFA Tahir Hussain Andrabi, said a press release. The event brought together senior diplomats, renowned scholars, and practitioners to reflect on the nature of the U.S. sanctions and their implications. In his welcome remarks, DG ISSI Sohail Mahmood highlighted the recent U.S. sanctions against Pakistani entities and the surprising statement by a senior U.S. official, Jon Finer about Pakistanas long-range ballistic missiles. Highlighting the Foreign Officeas response to these developments, he noted that the alleged threat perception from Pakistan was characterized as aunfortunatea and U.S. allegations as aunfounded, devoid of rationality and sense of history.a The Foreign Office had also underlined that U.S.as discriminatory policies accentuated military assymetries in South Asia and undermined strategic stability in the region. The Foreign Office had also affirmed that Pakistanas strategic program and capabilities were a asacred trusta of the people, it enjoyed complete consensus in the country, and was not subject to any outside intrusion or compromise. Sohail Mahmood stressed the importance of constructively engaging the U.S. in order to ensure that the U.S. recognized Pakistanas legitimate security concerns and legitimate defence needs and stress the imperative of fair, equal and non-discriminatory treatment and effectively address the unfounded claim made by Jon Finer. He concluded that, in the end, strategic clarity and national resolve would carry the day for Pakistan. Earlier, in his introductory remarks, Malik Qasim Mustafa Director ACDC ISSI, highlighted the continuing challenges posed by the U.S.as inconsistent approach towards Pakistan. He stated that by imposing these discriminatory sanctions the U.S. has ignored the fragile dynamics of strategic stability in South Asia. Pakistan has faced misperceptions about its strategic program in the past and it has always sought to address international concerns, while countering baseless allegations. Pakistan would remain committed in promoting peace and stability in South Asia. Tahir Hussain Andrabi argued that the parameters of the U.S. sanctions need to be understood. He stated that sanctions were not new but there has been a visible spike in the last two years. He noted that the sanctions are a manifestation of geopolitical contestations. Further, it also showed the gaps in export control regimes where the legitimate needs of states to access technology for peaceful purposes are being blocked. He underscored the challenges to engage constructively with the U.S. on the issue. He reaffirmed that Pakistan cannot accept caps on its missile capabilities. He also said that arms control negotiations would be meaningful only in the bilateral context and the U.S. should facilitate such a dialogue in our region. Dr. Zafar Nawaz Jaspal discussing the implications of the sanctions, stated that these are part of a political chessboard and represent a practical measure to discredit Pakistan. He stated that essentially the U.S. was advocating that Pakistan must accept India as a major power in the region, which is not acceptable to Pakistan. The U.S. intent with the sanctions is to cap Pakistanas nuclear program, and, if possible, to roll it back.A Dr. Jaspal stated that the U.S.-China strategic competition, which was likely to intensify in the coming year also plays a part in the political chessboard. Participants engaged in a wide-ranging exchange of ideas during the interactive session, emphasizing the importance of engaging with the U.S. with prudence. They underscored the importance of making Pakistanas legitimate security and defence needs clear and work on highlighting the discriminatory approach of the U.S.A It was discussed that the U.S. was perhaps looking at Pakistan from Indian lense. There was a unanimous resolve that Indian hegemony could not be accepted. At the same time, participants opined that prospects of normalization of Pakistanas relations with India seemed bleak. Chairman Board of Governors ISSI Khalid Mahmood concluded that this is not the first-time sanctions were imposed and will not be the last. However, sanctions will not affect Pakistanas strategic program.",
    "summary": "The Institute of Strategic Studies Islamabad (ISSI) held a roundtable discussion addressing recent U.S. sanctions and assertions regarding Pakistan's missile program. The discussion involved senior diplomats, scholars, and practitioners who analyzed the implications of the sanctions and the need for constructive engagement with the U.S. Participants emphasized Pakistan's legitimate security concerns and the importance of strategic clarity.",
    "keywords": [
      "Pakistan",
      "U.S. sanctions",
      "missile program",
      "ISSI",
      "strategic stability",
      "South Asia",
      "Jon Finer"
    ]
  },
  "entities": [
    {
      "text": "ISSI",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "U.S.",
      "label": "ORGANIZATION",
      "wikidata_id": "Q30"
    },
    {
      "text": "Pakistan",
      "label": "LOCATION",
      "wikidata_id": "Q1000"
    },
    {
      "text": "Zamir Akram",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "QAU",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7262279"
    },
    {
      "text": "Dr. Zafar Nawaz Jaspal",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Tahir Hussain Andrabi",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Sohail Mahmood",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Jon Finer",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Malik Qasim Mustafa",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "India",
      "label": "LOCATION",
      "wikidata_id": "Q668"
    },
    {
      "text": "China",
      "label": "LOCATION",
      "wikidata_id": "Q148"
    },
    {
      "text": "Khalid Mahmood",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Islamabad",
      "label": "LOCATION",
      "wikidata_id": "Q1166"
    },
    {
      "text": "MOFA",
      "label": "ORGANIZATION",
      "wikidata_id": "Q6868128"
    }
  ]
}