{
  "article_id": "2025-01-03_049d324341de0e15687715acb8240df0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ministry-of-it-huawei-launch-pakistan-ict-training-portal/",
    "retrieved_at": "2025-08-27T11:18:34.140Z"
  },
  "metadata": {
    "title": "Ministry of IT, Huawei launch Pakistan ICT Training Portal",
    "author": null,
    "date_published": "2025-01-03T11:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 154,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "aBy investing in the future of our youth, we are paving the way for a skilled workforce that will drive Pakistanas economic growth and technological advancement,a said Ahmed Bilal Masud Deputy CEO Huawei Technologies Pakistan. Huaweias extensive training resources and global expertise will be leveraged to provide comprehensive training to educators and students, fostering skill development and innovation. This strategic partnership underscores the commitment to advancing Pakistanas technical education landscape and supporting the nationas digital transformation He said,aThis program is a testament to our commitment to fostering digital literacy and preparing our youth for the challenges of the modern digital landscape. By equipping trainers with the latest knowledge and skills, we are creating a multiplier effect that will significantly enhance the quality of ICT education nationwide. This initiative not only aligns with our vision of improving ICT education but also plays a crucial role in bridging the gap between academic knowledge and industry requirements.a",
    "summary": "Huawei Technologies Pakistan and the Ministry of IT have launched an ICT training portal in Pakistan. The initiative aims to equip educators and students with the skills needed for technological advancement and digital transformation. This program focuses on bridging the gap between academic knowledge and industry requirements.",
    "keywords": [
      "Huawei",
      "ICT training",
      "Pakistan",
      "digital transformation",
      "education",
      "innovation",
      "skill development"
    ]
  },
  "entities": [
    {
      "text": "Ahmed Bilal Masud",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Huawei Technologies Pakistan",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Pakistan",
      "label": "LOCATION",
      "wikidata_id": "Q1042"
    },
    {
      "text": "Ministry of IT",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    }
  ]
}