{
  "title": "Imran ‘failed to deliver’ in KP: Amir Muqam",
  "link": "https://www.app.com.pk/national/imran-failed-to-deliver-in-kp-amir-muqam/",
  "date_published": "2022-12-30T11:16:00.000Z",
  "source": "APP",
  "content": "DIR UPPER, Dec 30 (APP): Adviser to the Prime Minister for Political and Public Affairs and Culture Division Engr Amir Muqam, here, on Friday, said that “Imran Niazi has failed to deliver for masses’ despite his party’s nine-year-long rule in Khyber Pakthunkhwa”.\nAddressing to the party workers and people of Dir Upper, after inaugurating electricity projects, including an electrical feeder at Akhgram, Engr Amir Muqam said that “Imran Niazi has ruined the country’s economy, and social values and was found guilty of taking foreign funding even though from rival countries in a bid to destabilize and bankrupt Pakistan”.\nHe said the people of KPK were now looking towards PML (N) for the resolution of their problems and would “reject the looter of Toshakhana” in the upcoming general election.\n“Imran Khan has brought disgrace to the country after [allegedly] selling the Haram Sharif’s model watch for monetary gains in the market,” he said, adding that such expensive gifts were given to the prime minister by foreign dignitaries as a mark of respect and strengthening of friendship rather than selling it in the open market.\nEngr Amir Muqam said that even close friends of Imran Khan were now talking about how he (Imran) was selected in the 2018 general election and imposed on the country.\nTerming Imran Khan as a “certified liar and king of U-turn”, Engr Amir Muqam said the announcement of Imran Khan to dissolve KP and Punjab assemblies during his Rawalpindi’s “flopped long march” was also proven false.\nHe said that Imran Khan had neither fulfilled the promise of construction of five million houses nor provided jobs to 10 million youth, and wasted precious four years of the nation by leveling baseless allegations against political opponents.\nAmir Muqam said had Imran’s government continued for two more months, the country would have gone bankrupt and defaulted.\n“PMLN has joined the coalition government not for power but to save the country,” he said, adding the present government succeeded in taking the country out of the FATF’s grey list. He said Prime Minister Shehbaz Sharif and his team was working day and night to take Pakistan out of all existing challenges.\nHe said Prime Minister Shehbaz Sharif had made frequent visits to all flood-hit districts of the country, including KP, and personally monitored rescue, relief, and rehabilitation operations there.\nOn the other hand, he said Imran Niazi had overlooked flood victims even in KP and Punjab provinces where his party was in power and used his energies in agitation politics and aimless long march.\nHe said the mega project of Chakdara-Dir-Chitral and Gilgit has been put into cold storage by the incompetent rulers of the province, despite its inclusion by former prime minister Nawaz Sharif in Public Sector Development Program (PSDP) in 2017, thus depriving people of the entire Malakand division from development.\nHe said that it was a mega communication project which after completion would link Malakand division through Chitral with Afghanistan and Central Asian Republics, thus ushering in a new era of economic prosperity and promoting trade and investment in the region.\nMuam said people of KP were fed up with agitation politics and “poor performance” of PTI and had pinned high hopes from the PMLN, adding, after the PML(N) won elections, a new era of progress and development in all districts of KP would be started.\nEarlier, on arrival at Dir Upper, Amir Muqam was welcomed by a large number of party workers, supporters, and residents of the area who raised the slogan of Prime Minister Shehbaz Sharif, Nawaz Sharif and Amir Muqam’s Zindabad.\nPML (N)local leader Malik Jehanzaib and Malik Ameer Nawab presented a traditional woolen cap to Amir Muqam.\nEarlier, Muqam visited the Mandaish area, where he offered fateha for the departed soul of the mother of Subagdageen and wife of Iqbal Khan Akunkhail.",
  "retrievedAt": "2025-08-11T16:04:46.724Z"
}
