{
  "title": "President for enhanced Pakistan, Norway engagement on trade, green energy",
  "link": "https://www.app.com.pk/national/president-for-enhanced-pakistan-norway-engagement-on-trade-green-energy/",
  "date_published": "2022-12-30T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): President Dr. Arif Alvi on Friday emphasized the need for accelerated engagements and cooperation with Norway in diverse sectors including trade, business, investment and green energy.\nThe president, talking to Pakistan’s Ambassador-designate to Norway Sadia Altaf Qazi, who called him here, also called for bilateral cooperation in the fields of education, skill development, defence and exports of Pakistan’s cost-effective but highly prized fruit and vegetables.\nHe said that there was a need to substantially enhance bilateral trade from its existing volume of US$ 128.404 million which did not represent the true potential by promoting Exports of traditional and non-traditions products and services to the rich and affluent market of Norway.\nHe advised the ambassador-designate to proactively engage and interact with Pakistani expatriates, provide them proactive counsellor services and through their platforms not only promote bilateral trade and investment but also take meaningful steps for increasing people-to-people contacts and promotion of Pakistan’s rich, diverse, social and cultural values and tourism opportunities.\nThe president advised the ambassador to explore meaningful and doable opportunities and venues for bilateral cooperation in the field of academia, scientific, industrial research & development and collaboration between the counterpart Universities and Institutes of the two countries.\nPresident Alvi said the efforts should also be made for including Pakistan in Norway’s list of prioritized countries for enhancing education cooperation under its Panorama strategy 2021-2027, he added.\nHe said that the ambassador should work to secure Norway’s support in expediting the conclusion of Pakistan’s Free Trade Agreement with the European Free Trade Association (EFTA).\nHe also emphasized creating linkages between with the Chambers of Commerce and Industries of the two countries for possible joint ventures, technology transfer, holding social, cultural and business events, exchange of trade delegations and reciprocal ease and facilitation of trade and investment.\nThe president said that there was a need to highlight the atrocities being committed perpetually by India in the Indian Illegally Occupied Jammu & Kashmir (IIOJK), and the increasing incidences of discrimination, intimidation, harassment, and marginalization of minorities and increasing trend of Islamophobia in India, which was putting the life and property of the entire Indian minorities especially Muslims in great danger.",
  "retrievedAt": "2025-08-11T16:04:44.294Z"
}
