{
  "title": "Action ‘similar to May 9’ will be taken againt TLP: Talal - Pakistan - DAWN.COM",
  "author": null,
  "content": "Minister of State for Interior Talal Chaudhry said on Tuesday that the government has decided to take a firm stand against the Tehreek-i-Labbaik Pakistan (TLP), and that action against the protesters will be taken in a manner similar to that of May 9.\n\nSpeaking to Geo News show ‘Aaj Shahzeb Khanzada Kay Sath’, the state minister said that since the formation of the current administration under Prime Minister Shehbaz Sharif and Interior Minister Mohsin Naqvi, TLP has attempted to march on Islamabad twice.\n\n“In every march, the government signed agreements with them; many of the terms of were not favourable for the state,” he said.\n\nHowever, he added, the state has taken a decisive stance.\n\n“We have to move forward and learn from past mistakes. We will not be blackmailed anymore. Those who bring extremism and violence into politics, whether it’s May 9, November 26, or the TLP dharnas, will not be tolerated. Action against them will be similar to what was taken after May 9,” he said, referring to the 2023 protests following Imran Khan’s arrest.\n\nThe minister maintained that the state had exhausted all peaceful options before acting against the group.\n\n“They say no dialogue was held, but backdoor channels were open. One of Pakistan’s major political and religious leaders was involved in those talks; they embarrassed him, too. Even when they stayed for two days, they were given a way to withdraw peacefully, and women and children who had been arrested were released.”\n\nRejecting claims that the protests were about Gaza or Palestine, he termed the TLP’s actual demands as “shocking”.\n\n“They wanted money, demanded government positions for their clerics, and called for the release of their members convicted in criminal cases,” he said.\n\nHe accused the group of emotionally exploiting religious sentiments and trying to weaken the state at a time when Pakistan was “fighting on both its eastern and western borders”.\n\n“Even when Afghanistan attacked, they did not call off their sit-in,” he said.\n\nResponding to reports that he had received over 1,700 threats online, Chaudhry said state institutions were taking legal action.\n\n“Cybercrime, FIA, and police are all active. Around 2,800 people have been barred from travelling,” he said, warning that fake news was again being spread in a manner similar to the November 26 events.\n\nTalal also mentioned that a large number of TLP members had been deported from Saudi Arabia for misconduct. “They are ruining the name of both the country and religion abroad,” he said.\n\nLaw enforcement agencies launched a sweeping pre-dawn operation on Monday to dismantle the religious party’s protest camp in Muridke, triggering violent clashes, widespread chaos and dozens of arrests.\n\nThe operation, which began around 3:30am, quickly spiralled into one of the most serious confrontations between police and TLP in recent months, continuing for nearly six hours.\n\nAccording to officials, some 1,500 police personnel in full anti-riot gear, supported by four armoured personnel carriers and water cannons, surrounded the protest camp along the GT Road.\n\nBy morning, authorities said they had detained hundreds of demonstrators, though exact figures remained unclear.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:46:01.540Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948914/action-similar-to-may-9-will-be-taken-againt-tlp-talal",
  "dateList": "2025-10-15",
  "date_published": "2025-10-14T19:05:43.000Z"
}
