{
  "title": "Pep talks with Djokovic as Sabalenka vows to improve ‘in everything’ - Sport - DAWN.COM",
  "author": null,
  "content": "World number one Aryna Sabalenka told AFP that she needs to improve her tennis “in literally everything” and how Novak Djokovic is helping her do it on and off the court.\n\nIn a wide-ranging interview, the four-time Grand Slam champion talked about ignoring hate on social media, nearly quitting and her hopes and fears for life after tennis.\n\nThe 27-year-old from Belarus is now the undoubted women’s number one but it was hard work and suffering which got her there, and some of it played out very publicly.\n\nSabalenka, then two in the world, was reduced to tears as her serve spectacularly deserted her at a tournament in the lead-up to the 2022 Australian Open.\n\n“I couldn’t put one serve in. I was double-faulting 40 times. And I was like, maybe that’s a sign that I have to quit,” she said in Hong Kong.\n\n“Because I was pushing, trying. We’ve done everything to fix my serve and nothing would work.”\n\nShe added: “But, you know, I really believe — because I faced in different parts of life similar things — that when you’re getting close to that moment where you’re about to give up, I really believe that this is the moment when you can turn around things.\n\n“You just have to push. You just have to keep trying. And this is the moment when it’s a turning moment.”\n\nBack in Australia a year later, Sabalenka won her first major crown and successfully defended her Melbourne title in 2024.\n\nSabalenka is renowned for her hard hitting, powerful serve, aggressive style of play and mental steel, but warned her rivals that she sees “so many things” that she can do better.\n\n“There’s always something, you cannot stop,” said Sabalenka, visiting Hong Kong for the Prudential NextGen Aces event with American great Andre Agassi.\n\n“Like Andre said, the moment you stop, you’re going down. And I only want to go up.”\n\nTalking specifics, she said: “I would love to approach the net much more. And I need to spend time working on that and understanding the game on the net in singles.\n\n“So, so many things I can get better at — shots, strokes, like literally everything.”\n\nWith success comes scrutiny and commentary, especially on social media, where Sabalenka frequently posts about life inside and outside tennis.\n\nShe identified social media as one of the prime challenges to youngsters coming through the sport, warning that even for a seasoned campaigner like herself it is not easy to ignore criticism and hate — “sometimes it can destroy you”.\n\n“Sometimes when it really gets to me, I like to go on their profile (the person criticising) and see that. Like guys, I’m trying to do something big here,” she said.\n\n“To inspire, to be a good example. I’m working hard. I’m chasing my dreams. I’m dedicating my life to something that I think is big.”\n\nSabalenka’s friendship with 24-time Grand Slam champion Djokovic recently came to the fore after she practised with him and they spent time together socially along with their partners.\n\n“He’s a great guy and he’s very open. You can ask anything and he can give you advice,” she said of the 38-year-old Serb.\n\n“And he’s such an open guy and I love practising with him because for me it’s such high-intensity training.\n\n“It just helps me physically and even mentally to get better.\n\n“And then when I play against girls, I’m not getting tired physically because I practise with Novak.” She revealed that after losing two finals this year she sought his counsel.\n\n“At Wimbledon I spoke to Novak. I just wanted to know how he was preparing himself for those big matches — what was the focus and what was his mindset going into the match.\n\n“So we talked for an hour probably, but with Novak you always can spend more than that talking and asking for advice.\n\n“And then later on, going to the US Open final, I remembered what he said, what he told me, and I think it helped me to get the title.”\n\nSabalenka still has years left at the top, but already has ideas of what comes after tennis.\n\nShe is thinking about something related to fashion or health, but admits it is a touch daunting.\n\n“For now I’m too busy on getting better as a player, but we’re definitely going to try to come up with something cool,” she said.\n\n“But that scares me as well because I feel like as an athlete, we’re so focused on our sport and we’re just living in a bubble.\n\n“And then when we finish our career and we go outside of the bubble, it feels like for me I know nothing and I have a lot of things to learn.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/151527331c3035d.webp",
  "retrievedAt": "2025-10-16T23:37:28.053Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949093/pep-talks-with-djokovic-as-sabalenka-vows-to-improve-in-everything",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T10:29:43.000Z"
}
