{
  "title": "All you need to know about the deadliest Pakistan-Afghanistan flare-up in years - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and Afghanistan have often engaged in minor border skirmishes, particularly since the withdrawal of US forces and the Taliban’s takeover in 2021. However, tensions have recently escalated to an unprecedented level, with clashes over the past few days prompting intervention from mediators.\n\nThe latest flare-up coincided with a historic visit by Taliban Foreign Minister Amir Khan Muttaqi to India, raising alarm in Islamabad after he referred to Kashmir as part of India and said terrorism was Pakistan’s “internal problem” that the country should solve itself.\n\nThe recent clashes began late on Saturday night, when 23 Pakistani troops were martyred and 200 Taliban and affiliated terrorists killed at the border following an attack from the Afghan side at around 9pm, according to the military’s media wing, the Inter-Services Public Relations (ISPR).\n\nThe ISPR said skirmishes between the two sides began “on the night of Oct 11/12, 2025, [after] Afghan Taliban and India-sponsored Fitna-al-Khawarij launched an unprovoked attack on Pakistan, along the Pak-Afghan border”.\n\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP), while Fitna-al-Hindustan is a term designated by the state for terrorist organisations in Balo­chistan.\n\nAfghanistan claimed it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory earlier this week. For its part, Islamabad has not confirmed whether it was behind the air strikes but maintained that Kabul must “stop harbouring the Tehreek-i-Taliban Pakistan on its soil”.\n\nBy midnight, both sides were targeting each other, as Afghan forces struck several Pak­istani posts and the Pakistan Air Force (PAF) and artillery pounded Afghanistan’s posts, targeting hostile positions in the Afghan provinces of Helmand, Kandahar, Khost, Paktia, and Paktika.\n\nOn Sunday, the Foreign Office (FO) warned that further acts of aggression from Afghanistan would receive an “unwavering and befitting response”. It expressed concern about the “unwarranted aggression by the Afghan Taliban, Fitna al Khawarij and Fitna al Hindustan”, which it said would destabilise neighbourly relations between the two nations.\n\nThe same day, Afghan Taliban Spokesman Zabihullah Mujahid had said that Pakistani strikes on Kabul “will have consequences” and that the country had “weapons to respond”.\n\nDefence Minister Khawaja Asif on Monday described the situation as a “stalemate”, noting that there were “no ties, direct or indirect” between Islamabad and Kabul in the fallout of the unprovoked attack.\n\n“You can say there are no active hostilities, but the environment is hostile,” he said on Geo News programme ‘Aaj Shahzeb Khanzada ke Saath’ while reporting a lull in attacks.\n\nHe also stressed that Pakistan had the “right to react” to being attacked, and warned that the fighting could resume again at any time.\n\nAs Asif predicted, the exchange of blows resumed again last night between Pakistani forces and the Afghan Taliban in the Kurram district of Khyber Pakhtunkhwa, according to state media reports.\n\nState-run PTV, citing security sources, described the attack from the Afghan side as unprovoked once again, adding that the Pakistani army “responded with full force and intensity”.\n\nToday, the ISPR said that security forces repulsed another attack by the Afghan Taliban along the Balochistan border, killing around 15 to 20 Afghan Taliban.\n\nIt said that the Afghan Taliban “resorted to cowardly attack[s] at four locations in [the] Spin Boldak area” in the early hours of Wednesday. “The attack was effectively repulsed by Pakistani forces,” the statement said.\n\nIt added that as Pakistani troops repelled the attack, 15 to 20 Afghan Taliban were killed and several others were injured.\n\nChina, which shares a border with the two countries, sought to play a mediating role in calming the hostilities. Beijing’s foreign ministry said on Monday that it had asked the two countries to protect their nationals and investments in the region, according to AFP.\n\nUnited States President Donald Trump, while on his way to Israel to oversee the exchange of hostages between Israel and Gaza’s Hamas, also expressed an interest in resolving the conflict, saying, “I’m good at making peace.”\n\nAdditionally, the Jamiat Ulema-i-Islam (JUI-F) chief, Maulana Fazlur Rehman, offered yesterday to mediate between Pakistan and Afghanistan in an effort to ease the tensions, citing his past experience with peacemaking between the two sides.\n\nAs the only Pakistani political leader who has met the Taliban supreme leader, Shaikh Hibatullah, the chief said, “I have been in contact with the Afghan leadership, and they want to resolve the issues through understanding.”\n\nHe added that both sides should refrain from blaming each other for the hostilities.\n\nIslamabad and Kabul had witnessed an improvement in bilateral ties this year, after steps such as the revival of the Joint Coordination Committee and upgrading diplomatic ranks.\n\nHowever, Pakistan has long been pressing the Taliban rulers to take action against the TTP and other Pakistani militant groups in view of the increase in attacks across Pakistan.\n\nLast week, during the Moscow Format Consultations held in the Russian capital, Pakistan’s Special Representative to Afghanistan, Mohammad Sadiq, sought regional countries’ cooperation to “effectively counter terrorism and dismantle all terrorist groups operating from Afghan soil”.\n\nThe Taliban government insists it does not allow anyone to use Afghan soil against Pakistan.\n\nThe meeting in Moscow was also attended by Muttaqi, who, the next day, left for New Delhi for the first visit to India by a Taliban leader since they came to power. Although New Delhi does not formally recognise the Taliban government, it has taken steps to thaw relations.\n\nWhile in India, Muttaqi issued controversial remarks on terrorism in Pakistan with reference to Pahalgam, the site of a deadly attack in India-occupied Kashmir in which 26 tourists were killed. India, without evidence, blamed Pakistan for the attack, while Islamabad denied the allegations. The incident led to a four-day military escalation between Pakistan and India before being halted with US intervention.\n\nMuttaqi’s statement referred to Pahalgam as a part of India, drawing severe backlash from Pakistan’s FO.\n\nIn a response to the India-Afghanistan joint statement, the FO expressed “strong reservations” on the remarks and described the reference to Jammu and Kashmir as part of India to be “in clear violation of the relevant UN Security Council resolutions” and “highly insensitive”.\n\nHeader image: Afghan Taliban fighters patrol near the Afghanistan-Pakistan border in Spin Boldak, Kandahar Province, following exchanges of fire between Pakistani and Afghan forces in Afghanistan on October 15, 2025. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15145052cc57572.webp",
  "retrievedAt": "2025-10-16T23:37:26.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949092/all-you-need-to-know-about-the-deadliest-pakistan-afghanistan-flare-up-in-years",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T12:16:37.000Z"
}
