{
  "title": "Google to invest $15 bn in India, build largest AI hub outside US - World - DAWN.COM",
  "author": null,
  "content": "Google on Tuesday said it would invest $15 billion in India over the next five years as it announced a giant data centre and artificial intelligence base in the country’s south.\n\n“It is the largest AI hub that we are investing in anywhere outside of the US,” said Thomas Kurian, CEO of Google Cloud, at a ceremony in New Delhi.\n\nHe announced “capital investment of $15bn” over the five years and a “gigawatt-scale AI hub in Visakhapatnam”, a city in the southern state of Andhra Pradesh.\n\nGoogle has plans for the centre to eventually “scale to multiple gigawatts”, Kurian added.\n\nDemand for AI tools and solutions has surged in India — projected to have more than 900 million internet users by year’s end — driven by growing adoption by businesses and individuals.\n\nIndia’s Information Technology Minister, Ashwini Vaishnaw, thanked Google for the investment.\n\n“This digital infrastructure will go a long way in meeting the goals of our India AI vision,” he said.\n\nAndhra Pradesh Chief Minister Chandrababu Naidu called it a “very happy day”.\n\nAndhra Pradesh state Technology Minister Nara Lokesh said the deal was a “game-changing investment” that came after “a year of intense discussions and relentless effort”.\n\n“It is a massive leap for our state’s digital future, innovation, and global standing,” Lokesh wrote on X. “This is just the beginning.”\n\nThis month, US startup Anthropic said it plans to open an office in India next year, with its chief executive, Dario Amodei, meeting Prime Minister Narendra Modi.\n\nModi, in a post on X, told Amodei that “India’s vibrant tech ecosystem and talented youth are driving AI innovation”, adding that he wanted to “harness AI for growth”.\n\nAnthropic’s move follows a flurry of announcements by other top AI firms looking to court Indian users.\n\nOpenAI has said it will open an India office later this year, with its chief, Sam Altman, noting that ChatGPT usage in the country had grown fourfold over the past year.\n\nAI firm Perplexity also announced a major partnership in July with Indian telecom giant Airtel, offering the company’s 360m customers a free one-year Perplexity Pro subscription.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/141224353b99a56.webp",
  "retrievedAt": "2025-10-16T23:38:21.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948852/google-to-invest-15-bn-in-india-build-largest-ai-hub-outside-us",
  "dateList": "2025-10-15",
  "date_published": "2025-10-14T07:31:50.000Z"
}
