{
  "title": "IMF warns of rising inflation, current account deficit - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Fund projects growth at 3.6pc, higher than World Bank’s 2.6pc forecast\n• Global growth forecast to slow to 3.2pc in 2025, 3.1pc in 2026\n\nISLAMABAD: Without accounting for the yet-to-be-finalised losses from the recent floods, the International Monetary Fund (IMF) on Tuesday estimated Pakistan’s economic growth rate at 3.6 per cent for the current fiscal year, along with higher inflation and widening current account deficit.\n\nThe Fund’s growth projection — following its recent two-week review of Pakistan’s economy — is notably higher than the 2.6pc GDP growth and 7.2pc inflation projected by the World Bank earlier this month, which were based on its own estimates of flood-related damages.\n\nIn its flagship World Economic Outlook (October 2025) report, released at the outset of the annual meetings of the IMF and World Bank, the international lender projected global economic growth to slow from 3.3pc in 2024 to 3.2pc in 2025 and 3.1pc in 2026. While this represents an improvement over the IMF’s July estimates, it remains 0.2 percentage point below the forecast made in October last year — before the recent shifts in global trade policies. “On an end-of-year basis, global growth is projected to slow down from 3.6pc in 2024 to 2.6pc in 2025,” the report stated.\n\nThe IMF projected Pakistan’s CPI-based average inflation rate to rise to 6pc this year from 4.5pc last year, and the current account balance to shift from a 0.5pc surplus last year to a 0.4pc deficit next year. However, the Fund clarified that its projections “do not yet reflect the impact of flooding in summer 2025, whose impact is still being assessed”, making the estimates tentative.\n\nWorld trade volume\n\nThe WEO forecast growth of about 1.5pc for advanced economies in 2025-26, with the United States slowing to 2pc, while emerging market and developing economies are expected to moderate to just above 4pc. Global inflation is projected to decline to 4.2pc in 2025 and further to 3.7pc in 2026.\n\nThe world trade volume is forecast to grow at an average rate of 2.9pc in 2025-26, boosted by front-loading in 2025 but still slower than the 3.5pc growth rate in 2024, as persistent trade fragmentation continues to limit gains.\n\n“Risks to the outlook remain tilted to the downside,” the IMF said, warning that prolonged policy uncertainty could dampen consumption and investment. It said further escalation of protectionist measures, including non-tariff barriers, could suppress investment, disrupt supply chains, and stifle productivity growth.\n\nThe report also highlighted that larger-than-expected shocks to labour supply — particularly from restrictive immigration policies — could reduce growth, especially in economies facing ageing populations and skill shortages. Fiscal vulnerabilities and financial market fragilities could interact with rising borrowing costs, increasing rollover risks for sovereigns.\n\nThe IMF also noted that an abrupt repricing of tech stocks could be triggered by disappointing results in earnings and productivity gains related to artificial intelligence, potentially marking an end to the AI-driven investment boom.\n\nThe Fund advised member countries to address strains on public finances.\n\n“With lower growth prospects, higher real interest rates, elevated debt levels, and new spending needs — such as defence and national security — the fiscal equation is becoming more challenging to solve and leaves countries vulnerable should a large external shock occur,” the IMF warned.\n\nReduced aid flows\n\nIt added that low-income countries were even more vulnerable due to reduced official aid flows. For a growing number of nations, the lack of job opportunities could quickly lead to rising social unrest, particularly among unemployed and disenfranchised youth. The WEO also noted mounting pressure on policy institutions such as central banks — including in Pakistan.\n\n“Should these pressures succeed, many of the hard-won credibility gains achieved in policymaking over many decades could be lost,” it cautioned. “Trust in central banks and in their ability to deliver price stability allows inflation expectations to remain well anchored, even when the economy is hit by large shocks such as during the recent cost-of-living crisis.”\n\nThe IMF advised that policies should aim to restore confidence and predictability, stabilise trade relations, reduce uncertainty, and rebuild fiscal space credibly. Monetary policy, it said, should remain independent yet transparent, with a key objective of maintaining price stability.\n\nOver the longer term, the Fund emphasised that economies should invest in innovation, productivity, and multilateral cooperation, empowering private enterprise and favouring broad-based policies such as education, infrastructure, and smart regulation over costly sectoral subsidies.\n\nPublished in Dawn, October 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15075510710596e.webp",
  "retrievedAt": "2025-10-16T23:37:31.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948980/imf-warns-of-rising-inflation-current-account-deficit",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T01:49:47.000Z"
}
