{
  "title": "Noman, Shaheen spur Pakistan to 93-run victory over South Africa in first Test - Sport - DAWN.COM",
  "author": null,
  "content": "Left-arm spinner Noman Ali was South Africa’s chief tormentor as Pakistan won a gripping first Test by 93 runs in Lahore on Wednesday.\n\nSet a daunting 277-run target for victory, the visitors and World Test champions were bowled out for 183 on day four.\n\nMan of the match Noman finished with 4-79 and 10-191 in the match for his third haul of ten wickets or more in Tests.\n\nWith the weary Gaddafi Stadium pitch taking sharp turn and low bounce, the 39-year-old Noman exploited the conditions well despite a stubborn 73-run stand between Dewald Brevis and Ryan Rickelton in the morning.\n\nIn all, spinners from both sides took 34 wickets, with just six going to fast bowlers.\n\nSouth African left-armer Senuran Muthusamy took 11-174 in the match. Pakistan made 378 in their first innings, with South Africa scoring 269 in reply.\n\nOn a deteriorating surface, the hosts collapsed in their second-innings 167 but it proved enough.\n\nOn Wednesday, with the tourists 137-6 at lunch the writing was very much on the wall, then Sajid Khan dismissed Muthusamy for six soon after the break.\n\nPacer Shaheen Shah Afridi dismissed Kyle Verreynne (19), Prenelan Subrayen (eight) and Kagiso Rabada (nought) to finish with 4-33.\n\nThe victory gives Pakistan an ideal start to the World Test Championship, having come last in the previous edition.\n\nThe second and final Test starts in Rawalpindi from Monday.\n\nIn the morning, Brevis took the fight to the Pakistan spinners and had reached an aggressive career-best 54, with six fours and two sixes, when Noman bowled him with a sharply turning delivery.\n\nOpener Rickleton’s dogged resistance was broken by Sajid just before lunch for a gritty 45.\n\nPakistan struck in the first over of the day through fast bowler Shaheen, who trapped Tony de Zorzi for 16 without any addition to the overnight total of 51-2.\n\nTristan Stubbs struggled to cope with the sharp turn and was on two when a premeditated reverse sweep off Noman safely landed in Salman Agha’s hands.\n\nBrevis reached his second Test half-century with a six off Noman before becoming the spinner’s fourth victim.\n\nPakistan Cricket Board Chairman Mohsin Naqvi congratulated the team on their win — which he said was a result of teamwork — and hoped for the team’s continued success in the second Test.\n\n“Pakistan played excellently against South Africa in every department,” Naqvi said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15131237df6fe34.webp",
  "retrievedAt": "2025-10-16T23:45:45.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949080/noman-shaheen-spur-pakistan-to-93-run-victory-over-south-africa-in-first-test",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T07:58:41.000Z"
}
