{
  "title": "TLP chief, workers booked for clashes with police in Pindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Police have booked Tehreek-i-Labbaik Pakistan (TLP) chief Hafiz Hussain Rizvi, 21 local leaders, activists and 35 unidentified individuals under various sections of the law.\n\nIn addition to the Anti-Terrorism Act, the Rawat police have charged them with robbery, attempted murder, criminal conspiracy, incitement to public disorder, violation of Section 144, aerial firing, road blockage, resisting the police, snatching ammunition and endangering public life.\n\nThe FIR against TLP leaders and activists was registered with the Rawat police on the complaint of Sub-Inspector Najibullah, who stated that he was on duty when he received an emergency call about protesters blocking Chak Beli Khan Road with heavy stones and setting old tyres on fire.\n\nAccording to the FIR, TLP chief Saad Hussain Rizvi had called for road blockades from Lahore to Islamabad, in response to which the Punjab government imposed Section 144, banning gatherings and processions.\n\nWhen police reached the scene, Qari Bilal, along with 21 TLP office bearers and workers armed with Kalashnikovs, petrol bombs and nail-studded sticks, and 35 unidentified persons, were delivering provocative speeches, shouting slogans and inciting people against the government.\n\nOn seeing the police, the protesters resisted and opened straight fire.\n\nThe FIR stated that Qari Ibrar fired a Kalashnikov shot that hit Constable Adnan, who remained unharmed due to his bulletproof vest.\n\nIt further stated that Qari Danish and others caught Constable Nazir, tortured him, snatched more than a hundred tear gas shells and tore his uniform.\n\nThe armed men continued firing, hitting a police vehicle. The police took cover behind the van to save themselves.\n\nDespite repeated warnings through a megaphone to disperse, the protesters refused to comply.\n\nReinforcements were later called, which helped disperse the crowd.\n\nThe complainant added that ten nailed sticks, four petrol bombs, TLP flags, stones wrapped in a sheet and shell casings were recovered from the spot.\n\nHe said those named in the FIR had committed criminal conspiracy, violence, firing, and resistance at the behest of TLP chief Saad Rizvi and other leaders.\n\nA case has been registered accordingly. Police said five protesters have been arrested, while raids are ongoing to apprehend the remaining suspects.\n\nMeanwhile, the Faizabad intersection remained closed for the fifth consecutive day on Tuesday, with traffic heading towards Islamabad being diverted to Double Road.\n\nThe diversion caused inconvenience to commuters and long queues of vehicles were seen on both sides of the road. However, the Rawalpindi City Traffic Police said in a statement that traffic flow on all other roads remained smooth, though traffic bound for Islamabad was diverted due to the Faizabad closure.\n\nTraffic flow on Murree Road, Mall Road and Peshawar Road also remained normal.\n\nInbound and outbound routes of Rawalpindi, as well as traffic in all tehsils of the district, were open, according to the traffic police spokesman.\n\nTaxila\n\nAs many as 11 activists of Tehreek-i-Labbaik Pakistan (TLP) were arrested after violent clashes erupted with police in the jurisdiction of Taxila Police Station. The incident occurred when a TLP rally turned violent, leading to the destruction of official vehicle, attacks on police personnel, and snatching of anti-riot gear from the policemen on duty.\n\nAccording to the FIR registered at Taxila Police Station under 16 multiple sections of the Pakistan Penal Code — including 395, 324, 353, 186, 188, 148, 149, 341, 440, 290, 291, 109, 120B — and sections 7 and 21-L of the Anti-Terrorism Act, 1997, dozens of charged workers armed with sticks, iron rods, and stones attacked law enforcement officials deployed to maintain order.\n\nThe report stated that during the confrontation, protesters damaged several police vehicles, including the official van and snatched protective shields and batons from officers. Police said the mob also blocked roads, pelted stones at the force, and set fire to barricades, spreading panic in the area.\n\nASI Mohammad Zafar Shah of Taxila Police, who was leading the operation, lodged the complaint after a large group of TLP members allegedly resisted dispersal orders and resorted to violence.\n\nReinforcements were called in from nearby police stations, and after hours of struggle, the situation was brought under control.\n\nIn view of the prevailing law and order situation, the district administration on Tuesday has imposed Section 144 across Attock district, banning all forms of political gatherings, sit-ins, rallies, demonstrations, and protests.\n\nPublished in Dawn, October 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68eec1907ec38.jpg",
  "retrievedAt": "2025-10-16T23:37:41.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948961/tlp-chief-workers-booked-for-clashes-with-police-in-pindi",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T01:51:02.000Z"
}
