{
  "title": "Bail plea of man who ‘shared images of ex-wife on social media’ dismissed - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate has dismissed the bail application of a man in a case pertaining to allegedly sharing his ex-wife’s personal photos and videos on WhatsApp after the woman filed a suit for dissolution of marriage through Khula.\n\nThe National Cyber Crime Investigation Agency (NCCIA) had booked the suspect under Sections 20 (offences against dignity of a natural person), 21 (offences against modesty of a natural person and minor) and 24 (cyber stalking) of the Prevention of Electronic Crimes Act (Peca), 2016.\n\nAccording to the complainant, after she filed a suit for Khula (separation) from her husband, he allegedly began harassing, stalking and intimidating her.\n\nShe further alleged that the suspect shared her personal pictures and videos with her brother on WhatsApp to threaten her.\n\nDuring interrogation, the suspect claimed that his mobile phone had been stolen on a public bus. However, the FIR stated that the NCCIA’s initial technical analysis report found that the WhatsApp number and account used to share the material belonged to the suspect, and that the offence had been committed from his account.\n\nAfter hearing both sides, Judicial Magistrate (Central) Muhammad Jameel dismissed the post-arrest bail application, observing that the suspect had failed to make out a case for the grant of bail.\n\n“The nature of allegations against the accused is grave and pertains to cyber harassment, transmission of objectionable material, and blackmailing of the complainant and her brother. The recovery of obscene content from the complainant’s brother’s mobile phone raises serious concerns regarding the misuse of digital platforms and the malicious intent behind such actions,” the court observed.\n\nState Prosecutor Shiraz Rajper opposed the bail plea, arguing that the WhatsApp number from which the content was sent was registered in the suspect’s name. He submitted that the allegations against the suspect were of a serious nature.\n\nOn the other hand, the defence counsel contended that his client had been falsely implicated. He claimed that before the filing of the Khula suit, the complainant was living with the suspect and had herself shared her photos and videos from his number to her brother to falsely implicate him in the case.\n\nHowever, the court noted that the defence claim that the videos were sent by the complainant herself to frame the suspect was without merit.\n\n“No illegality or irregularity can be inferred from the forensic process and submission of devices,” the order stated.\n\nPublished in Dawn, October 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1509003924e8917.webp",
  "retrievedAt": "2025-10-16T23:37:30.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948928/bail-plea-of-man-who-shared-images-of-ex-wife-on-social-media-dismissed",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T01:50:47.000Z"
}
