{
  "title": "Fact check: Viral video does not show Pakistani tank captured by Afghan Taliban amid recent conflict - World - DAWN.COM",
  "author": null,
  "content": "Posts from Afghan media outlets and users on social media platform X on Wednesday shared a video allegedly showing a Pakistani tank captured by the Afghan Taliban. However, the tank in the clip is not Pakistani.\n\nOn Sunday, fierce border clashes between Pakistan and the Afghan Taliban resulted in the martyrdom of 23 troops and left over 200 Taliban fighters dead, including a number of Tehreek-i-Taliban Pakistan terrorists. Both nations claimed to have destroyed the border posts of the other side.\n\nOn Tuesday, fighting flared up again between the neighbours in the Kurram district of Khyber Pakhtunkhwa. The next day, the third major skirmish also took place, with the Pakistani security forces saying an attack by the Afghan Taliban was repulsed in Spin Boldak, killing about 15-20 Taliban fighters.\n\nMeanwhile, Afghan Taliban spokesperson Zabiullah Mujahid said in a social media post that the Afghan forces were “forced to retaliate” after attacks by Pakistani forces in Afghanistan’s Kandahar province. Mujahid claimed that more than 12 civilians were killed and over 100 were injured in the attacks carried out by Pakistani forces with the use of “light and heavy weapons”.\n\nToday, Indian journalist Sidhant Sibal, assistant editor of foreign affairs at Indian media outlet WION, shared a video on X of a tank being driven.\n\nThe post’s caption read: “Islamic Emirate government releases videos of Afghan forces capturing Pakistani weapons and tanks. Pakistan launched an attack in the border areas of Afghanistan in the last 24 hrs, Afghan side has said.”\n\nThe post gained 15,100 views, but was deleted after a few hours.\n\nThe same video with a similar claim was shared by Mujahid as well, with the following caption: “In retaliatory operations, multiple Pakistani aggressor soldiers were killed, their posts and centres were captured, weapons and tanks fell into the hands of Afghan forces, and most of their military installations were destroyed. However, the mujahideen, with high spirits, are ready to defend their homeland, sanctuaries, and people.”\n\nThe post gained 247,800 views.\n\nThe video and claim were also shared by state-owned Afghan television channel RTA Pashto with the caption: “In Spin Boldak, the enemy’s captured tank!”.\n\nIt also shared a picture of the very same tank in the video.\n\n“Be victorious,“ said the caption of the post, which gained 12,000 views. The same video and claim were also shared by the media outlet’s English account on X.\n\nAfghan digital media outlet Zawia News also shared the same video with the caption: “The Taliban claims that in the morning battle in Spin Boldak, in addition to inflicting casualties on the Pakistani side, they have also captured posts, weapons, and a tank from them. Due to the firing from the Pakistani side, civilian people and traders have also suffered casualties as well as financial losses.”\n\nThe post gained 7,000 views.\n\nThe video with a similar claim was further shared by an Indian propaganda account on X with the caption: “Big! The Islamic Emirate govt releases videos showing Afghan forces capturing Pakistani weapons and tanks”.\n\nThe video gained 77,000 views.\n\nThe video was widely shared by different Afghan and Indian users on X as can be seen here, here, here, here and here, collectively gaining more than 85,000 views.\n\nA fact-check was initiated to determine the veracity of the claim due to its high virality and keen public interest in the matter.\n\nIt was observed that some users in the comments of the posts contested the claims and said the video showed an Afghan T-62 tank.\n\nAs per the Tank Encyclopedia, a voluntary online database of armoured vehicles, the T-62 is a Soviet main battle tank introduced in 1961 as a successor to the T-55. It features a distinctive 115 millimetre smoothbore gun, a low-profile turret, recognisable by the fume extractor positioned midway on its barrel.\n\nIt was also used by the Soviet army in Afghanistan and later by the Afghan forces.\n\nComparing the tank seen in the video with reference images of the T-62 on the website shows that both feature a similar gap between the fourth and fifth road wheels.\n\nThe placement of the fume extractor in the middle of the barrel can also be seen in both images, distinguishing it from similar tanks such as the T-55, which features the extractor closer to the muzzle.\n\nA keyword search to confirm whether or not the Afghan Taliban used the T-62 tank showed that according to The International Institute for Strategic Studies, the Afghan Taliban possess several T-62 tanks, which they inherited from the Soviet era and the former Afghan National Army. Many of these were left behind after decades of conflict and later refurbished for limited operational use or display.\n\nA June 23, 2021, article on Dutch open-source intelligence defence analysis website Oryx titled: “Disaster at hand: documenting Afghan military equipment losses since June 2021 until August 14, 2021,” also reported that five T-62 tanks were captured from the former Afghan forces by the Taliban.\n\nA February 10, 2025, article by Militarnyi, a Ukrainian media website focused on military and defence issue, titled: “Afghanistan begins restoring M114 Howitzers,” also reported that the Afghan Taliban had restored T-62 tanks.\n\nAn image search for pictures of Afghan Taliban using the tank yielded a June 30, 2022, X post, from an account describing itself as being “focused on military history of Afghanistan”, with the following caption: “The Taliban reactivated several T-62 and T-55 tanks in Kunduz. They’re in service of the 217 Omari Corps.”\n\nThe post shared images of Afghan Taliban members riding the tank.\n\nFurthermore, an Oct 13, 2025, YouTube video was also found by Indonesian news outlet Tribun Jateng that showed the Afghan Taliban transporting their T-62 amid the current tension with Pakistan.\n\nMeanwhile, neither a keyword search yielded any mainstream media reports on Pakistan having or using T-62 tanks nor did an image search led to any pictures of the tank being used by the Pakistani military.\n\nContacted for comment, Dawn.com news editor Ali Osman not only confirmed that the tank in the viral video was a T-62 tank, he also said that it was never inducted into the Pakistan Army.\n\nTherefore, the fact-check determined that the claim that a viral video shows a Pakistani tank captured by the Afghan Taliban amid their recent conflict is false. The tank shown is the T-62, which does not belong to Pakistan and continues to be used by Afghanistan.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15174326b9e06aa.webp",
  "retrievedAt": "2025-10-16T23:37:28.318Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949108/fact-check-viral-video-does-not-show-pakistani-tank-captured-by-afghan-taliban-amid-recent-conflict",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T16:59:21.000Z"
}
