{
  "title": "LPG stations sealed for illegal decanting in Sambrial - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: In the Sambrial tehsil, four LPG stations were sealed for illegal decanting along with an illegal petrol agency and cases were registered against the violators.\n\nThe operation was carried out under the supervision of Sambrial Assistant Commissioner Ghulam Fatima Bandial, along with teams from Civil Defense and Pera.\n\nDuring raids at various stations, a pumping machine of an illegal petrol agency was confiscated by the administration. The AC said that, on the directions of Deputy Commissioner Saba Asghar Ali, action was being taken across the district against illegal LPG decanting and petrol agencies.\n\nShe further said that the government’s crackdown on individuals involved in such dangerous businesses within urban areas would continue to ensure the safety of the lives and property of citizens. She also appealed to the public to identify those involved in such hazardous activities, so that legal action could be taken against them.\n\nBREAST CANCER: Every year out of the 90,000 women who die of breast cancer in Pakistan, almost half are diagnosed in the last stage.\n\nThese views were expressed by Gujranwala Population Welfare Officer District Officer Adnan Ashraf while addressing an awareness seminar on breast cancer.\n\nMr Ashraf said that 40 to 45 per cent of breast cancer patients, out of the 90,000 who died annually, in Pakistan were diagnosed when they were in the last and incurable stage of the disease.\n\nHe said that the survival rate of breast cancer in the developed world was 90 to 95 per cent and the main reason was that women over 40 years of age undergo regular mammography tests every year.\n\nHe urged the audience to create awareness in the society to protect the sisters, daughters and mothers from breast cancer. He said that special care should be taken of patients suffering from breast cancer and they should be treated with compassion. He said that breast cancer was a non-communicable disease.\n\nHe further said that the District Population Welfare Office had been organising seminars on breast cancer, mental illnesses, the benefits of breast milk and the elimination of gender discrimination through its scholars and community officers.\n\nGujranwala Public Relations Deputy Director Munawar Hussain, Dr Narjis Batool, Dr Amara Nasir and Sajjad Hussain Nayyar also addressed the seminar.\n\nThe speakers informed the participants about the spread and prevention of breast cancer in women.\n\nMDCAT: As many as 2,087 students will appear for the Medical College Admission Test (MDCAT) at the Government College Women University, Sialkot on Sunday, Oct 26.\n\nIn this connection, district-level officers from various departments participated in a meeting chaired by Deputy Commissioner Saba Asghar Ali for holding the exam peacefully and transparently.\n\nDuring the meeting, a detailed review was taken of the arrangements made for the examination, including security, traffic control, uninterrupted supply of electricity, medical facilities and other matters.\n\nThe DC said that the only examination center in Sialkot would be Government College Women University, Kachhari Road. A total of 2,087 candidates would appear for the examination at the center, including 375 men and 1,712 women.\n\nShe said that Section 144 would be imposed on the day of the examination to prohibit the entry of unauthorised persons. She said that foolproof security would be ensured by deploying additional police personnel inside and outside the examination centre.\n\nShe directed the traffic police to prepare a comprehensive traffic plan to maintain traffic flow on the day and directed to deploy two ambulances, one with a male and one a female doctor, along with paramedical staff at the center. She said that Nadra mobile vans would also be deployed to facilitate candidates for biometric verification.\n\nMs Saba Asghar Ali said that all the relevant departments should perform their responsibilities efficiently, so that the examination was completed in a peaceful, transparent and orderly manner.\n\nPublished in Dawn, October 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/150936352718058.webp",
  "retrievedAt": "2025-10-16T23:46:00.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949012/lpg-stations-sealed-for-illegal-decanting-in-sambrial",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T01:38:40.000Z"
}
