{
  "title": "Punjab minister rejects HRCP’s claims of ‘hiding information’ following operation against TLP - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab Information Minister Azma Bukhari on Wednesday rejected the claims made by the Human Rights Commission of Pakistan (HRCP) regarding the government “concealing information” about the Muridke operation carried out to disperse Tehreek-i-Labbaik Pakistan’s (TLP) march they claimed was in solidarity for Palestinians.\n\nThe TLP began protests in Lahore on Oct 9, announcing a march to the US embassy in Islamabad to oppose the US-brokered ceasefire between Israel and Hamas after two years of conflict in Gaza. The demonstrations quickly turned violent, with police using baton charges and tear gas against stone-pelting protesters.\n\nThe following day, clashes in Lahore’s Shahdara area left at least 40 officers injured, while the TLP claimed over 10 workers were killed. As the group attempted to move towards Islamabad, Punjab Rangers and police from five districts were deployed to Muridke, where trenches were dug and an operation launched to disperse them.\n\nRegarding the Mudrike Operation and the violence that broke out between police and TLP protestors, the HRCP voiced “deep concern” not only over the violence but also over what it described as a “lack of transparency and credible, independent information surrounding the operation.”\n\nIn response to the statement, Bukhari pointed out that the government had made sincere efforts to dissuade the TLP from marching towards the US Embassy in Islamabad, but the group refused to cooperate.\n\n“We carried out the operation to maintain a law and order situation, as the march had blocked all main routes, including the GT Road, to traffic,” she told Dawn.com.\n\nThe minister said the HRCP itself had acknowledged in the statement regarding the TLP’s involvement in hate speech and other human rights violations.\n\n“We tried not to reach the point of carrying out an operation and avoid this situation, but the extremists did not believe in human rights,“ she said.\n\nBukhari alleged that TLP leaders and activists had issued threats of “dire consequences in their speeches” and opened fire on law enforcement agencies (LEAs), resulting in the deaths of some policemen.\n\n“The Palestinians, including Hamas, have accepted the peace agreement, but the TLP chose to march towards the American Embassy with ulterior motives.”\n\nShe said that the operation was still underway.\n\n“The government would provide all the information after completion of the operation,” Bukhari added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15170744051d67c.webp",
  "retrievedAt": "2025-10-16T23:37:25.031Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949109/punjab-minister-rejects-hrcps-claims-of-hiding-information-following-operation-against-tlp",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T13:38:46.000Z"
}
