{
  "title": "Coach Lopetegui heralds history makers Qatar after sealing FIFA World Cup qualification - Sport - DAWN.COM",
  "author": null,
  "content": "Qatar coach Julen Lopetegui called his side’s qualification for next summer’s World Cup finals “truly special” after a 2-1 win over the United Arab Emirates on Tuesday secured the country’s first ever successful passage through the preliminaries.\n\nSecond half goals in Doha from Boualem Khoukhi and Pedro Miguel ensured Qatar finished top of Group A in the fourth phase of Asia’s qualifiers ahead of the UAE and Oman.\n\n“We made history and entered through the grand gate,” said the former goalkeeper, who led Sevilla to the Europa League title in 2020.\n\n“The dream has come true.”\n\n“I’ve won many titles, but this experience with Qatar is truly special. We must enjoy what we’ve achieved. Now we’ll celebrate and recover physically. We went through some tough days leading up to this match.”\n\nQatar will be playing at a second consecutive World Cup having made their debut at the 2022 finals as tournament hosts after failing to progress through the preliminaries in 11 previous attempts.\n\nThe win over the UAE came after an earlier 0-0 draw with Oman to earn Lopetegui’s side first place in Group A of the fourth round of qualifiers.\n\nSaudi Arabia took the other remaining berth for Asian qualifiers ahead of Iraq in Group B in Jeddah.\n\nThe pair join Japan, South Korea, Australia, Iran, Uzbekistan and Jordan, who had booked their places in December’s draw for the finals during the previous phase of preliminaries.\n\n“This means a lot to us,” said Qatar midfielder Abdulaziz Hatem. “It’s the first time Qatar qualifies for the World Cup through the qualifiers. It’s a reward for all of us.”\n\nIraq coach Graham Arnold questioned the fairness of the format used in the latest phase of Asia’s preliminaries for the World Cup after seeing his side beaten to a place in next summer’s finals by Saudi Arabia on Tuesday.\n\nThe former Australia coach joined Oman boss Carlos Queiroz in criticising the just-concluded round of qualifiers, which also saw Qatar claim a berth at the tournament in the United States, Canada and Mexico.\n\n“I’m extremely proud of the boys, especially after the way the format of the competition has been,” Arnold said after his side’s 0-0 draw with Saudi Arabia in Jeddah left Iraq second in Group B behind Herve Renard’s team.\n\n“It’s no coincidence that the team in each group that had the six days break qualified.\n\n“I’ve never seen anything in my coaching career with this type of format. When I was with Australia, we were all told these playoffs would be at a neutral venue.\n\n“It’s the same as in the other group with Qatar getting through after six days off and both with hometown support.”\n\nSaudi Arabia and Qatar were awarded the hosting rights for the two three-team groups played during the current international window by the Asian Football Confederation, with both nations’ teams granted favourable schedules as a result.\n\nIraq and Indonesia, who finished third in Group B, had only three days recovery between their two matches in Jeddah while the United Arab Emirates and Oman had similar schedules in Doha. Saudi Arabia and Qatar, meanwhile, had six days rest.\n\nFormer Real Madrid and Portugal coach Queiroz had previously raised the issue prior to his Oman team’s 0-0 draw with the Qataris in Doha last Wednesday.\n\nQatar’s 2-1 win over the UAE on Tuesday meant the Omanis were eliminated from the qualifiers, finishing bottom of Group A.\n\nWhile Saudi Arabia and Qatar claimed the automatic places at the finals, runners-up Iraq and the UAE will meet next month in a two-legged clash to determine who advances to the intercontinental playoffs in March for another World Cup spot.\n\n“The players have given me everything that they had,” said Arnold.\n\n“They ended up with four points, we didn’t concede a goal in this tournament, but we are still in it.\n\n“All the Iraqi media and fans need to stay positive because we are through to the next phase with games in November, so World Cup qualification goes on. “I’m sorry to the Iraqi fans but they’ve got to understand we’re still in it. We have to stay positive.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15163330fad77cb.webp",
  "retrievedAt": "2025-10-16T23:37:26.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949101/coach-lopetegui-heralds-history-makers-qatar-after-sealing-fifa-world-cup-qualification",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T11:35:33.000Z"
}
