{
  "title": "Rain rescues teetering England as Pakistan get first point in Women’s World Cup - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s hopes of of a first victory at the Women’s World Cup were hit by rain on Wednesday with their crucial fixture against England being abandoned after a second downpour at the R. Pramedasa Stadium in Colombo.\n\nChasing a revised target of 113 to win after earlier rains had reduced the match to 31 overs per side, Pakistan were 34-0 in 6.4 overs when rains returned to end any chance of the match being completed.\n\nFatima Sana shone with the ball earlier as England could only make 133-9 after being put into bat. The Pakistan skipper ended with figures of 4-27 that included three of the English top-order batters including their captain Nat Sciver-Brunt.\n\nEngland’s innings was interupted in the 25th over when rains first arrived in the Sri Lankan capital before the game resumed several hours later.\n\nHaving lost their first three matches at the tournament, Pakistan needed a win to boost their chances of reaching the semi-finals and they looked a team on a mission.\n\nJust in the second over of the first innings, Diana Baig struck after Tammy Bemaunt left one that jagged back in and took her off stump — a picture-perfect wicket for Pakistan’s front-line pacer after a no-ball earlier in the over.\n\nFatima followed it up with an even better delivery — pegging back Amy Jones’ middle stump with one that seamed back in after pitching in the corridor of uncertainty.\n\nThe Pakistani skipper followed it up with another booming inswinger to get her opposite number Nat Sciver-Brunt by making a mess of her stumps.\n\nHeather Knight was the next to follow in the same over as England slumped to 39-4 in just the seventh over.\n\nThe English side were in all sorts of trouble at the end of the powerplay — losing half their side for just 54 led by Fatima’s three scalps.\n\nAlice Capsey got a chance in the 18th over when Muneeba Ali dropped a regulation catch inside the circle at square-leg off the bowling of Rameen Shamim.\n\nHowever, Rameen eventually got her scalp five overs later when Capsey missed a sweep and was adjudged lbw on a ball that — according to ball-tracking — would have hit the leg-stump.\n\nRain came to the rescue of the English batters as their innings was teetering along at 79-7 at the halfway mark of the innings.\n\nPakistan were by far the happier side going into the rain-induced break, but memories of Beth Mooney’s hundred that rescued Australia back from the brink of disaster after being 76-7 must have been on the minds of Fatima’s charges.\n\nAfter play resumed with the innings curtailed to 31 overs per side, England’s Charlie Dean hit a few boundaries to help her side cross the 100-run mark before falling to Fatima.\n\nPakistan’s openers got the innings going with a boundary in the very first over as Muneeba Ali sent the ball to the fence through point.\n\nOmaima Sohail returning to the side hit a couple of boundaries through the covers before rain stopped play in just the seventh over of the innings.\n\nThe players also observed a minute of silence in remembrance of squad member Shawaal Zulfiqar’s father, who passed away on Monday.\n\nLast week‘s defeat against Australia left their knockout hopes hanging by a thread as Pakistan registered three losses on the trot and needed a win today to keep their campaign alive.\n\nPakistan had made two changes in their side, with Aliya Riaz and Omaima Sohail back in the team.\n\nSpeaking at the toss, Fatima said: “Pitch looks like it will spin, and we will want to take advantage. The spinners will want to take advantage … we want to bat longer, build partnerships. We need to finish off games.”\n\nPakistan women’s all-rounder Syed Aroob Shah said on Tuesday that the team was looking to “perform better with the bat” ahead of the England encounter.\n\nSquad member Shawaal would be continuing with the squad after her father passed away in Sialkot, the Pakistan Cricket Board said on the same day.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/15220641a29d714.webp",
  "retrievedAt": "2025-10-16T23:45:27.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949088/rain-rescues-teetering-england-as-pakistan-get-first-point-in-womens-world-cup",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T09:20:18.000Z"
}
