{
  "title": "Diploma to be introduced to upgrade general practitioners as family physicians: Health Advisor",
  "link": "https://www.app.com.pk/national/diploma-to-be-introduced-to-upgrade-general-practitioners-as-family-physicians-health-advisor/",
  "date_published": "2020-01-18T23:24:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 19 (APP):Advisor to Prime Minister on Health, Dr. Zafar Mirza on Sunday said that a one-year diploma would be started soon to upgrade our general medical practitioners (GPs) as family physicians because our GPs provide around 70 percent of healthcare coverage.\nHe was speaking at the three-day 5th Biennial Conference `ICON 2020’organised with the theme of “Building Bridges for Better Healthcare” at a hotel here.\nHe said they are working along with College of Physicians and Surgeons of Pakistan (CPSP) to introduce a one-year diploma for upgradation of sitting general practitioners as qualified family physicians.\nHe said about 70 percent of healthcare coverage has been provided by the general practitioners in the private sector but our general practitioners have no proper training as family practitioners.\nIt is easy to criticize the private practitioners but their capacity building is also our responsibility, he added.\nHe said the international standard is three family physicians per 10,000 persons in any country and if they produce the family physicians with our current speed, it will take more than 100 years to achieve this goal of three physicians per population of 10,000 people.\nHe said about a year ago first time in the history of Pakistan, Federal Ministry of Health envisaged a National Health Workforce Strategy keeping in view our requirement and global healthcare thresholds.\nThis was developed along with the provinces now the question is about its operationalization, he added.\nHe said now the numbers are available to us with regard to the requirement of doctors, pharmacists, dentists, nurses and other facilities to cater need of the population.\nHe said according to the World Health Organization, basic health care is to be provided to every person in the country while health care is becoming increasingly expensive in the private sector practice.\nDr. Zafar Mirza said they have health system in five stages includes first lady health worker, second primary health center, third primary level hospital, fourth level secondary hospitals while last and fifth is tertiary level hospitals.\nHe said universal health coverage is unavoidable but the question arises where to start the universal health coverage. 70 per cent of universal health coverage can be provided at community and primary health centers, he added.\nHe said now need-based budging is required in Pakistan and they should not prepare our budget on the basis allocations made in the previous budget.\nDr. Zafar Mirza said if they do not design our policy as per our need and they do not spend on it then they should not complain.\nHe told a questioner that our strategy and policy in the health sector is based on two major points including the health sector should not be politicized and second it do not indulge in useless blame game.\nHe said they have also established Islamabad Health Regulatory Authority for the capital territory.\nHe said he has called a meeting of National Bioethics Committee which he said he wants to revive.\nThe Health Advisor said there was a need to teach bioethics to the medical practitioners in the country and they have complete ignorance about bioethics in Pakistan and it would guide us in implementation.\nDr. Zafar Mirza said our problems have been turned into national emergency which needs national response while national coordination is required to generate a national response and they are working on it.",
  "retrievedAt": "2025-08-11T18:39:10.916Z"
}
