{
  "title": "Govt to complete its constitutional tenure: Governor Punjab",
  "link": "https://www.app.com.pk/national/govt-to-complete-its-constitutional-tenure-governor-punjab/",
  "date_published": "2020-01-18T23:27:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 19 (APP):Governor Punjab Chaudhry Mohammad Sarwar Sunday said mid-term elections and toppling the government would remain a dream of the opposition, as it would complete its constitutional tenure.\nTalking to media after inaugurating One Life Foundation Hospital here, he said every day, the opposition comes up with new gambits for political gains and there is no unity in its ranks.\nThe opposition parties are doing politics of their own interests although, their politics of personal interests has already been exposed to the nation, he added.\nChaudhry Sarwar said the opposition has been talking about toppling the Pakistan Tehreek-e-Insaf (PTI) government since its formation, but every time it faced disappointment.\nHe said this time too, the opposition’s dream of mid-term elections or in-house change would remain mere a dream which has nothing to do with reality because the whole nation standing by Prime Minister Imran Khan and the PTI government.\nThe Punjab governor said it is the result of well-conceived and successful policies of the government that Pakistan has been saved from bankruptcy.\n“We have also initiated dozens of public welfare projects including Naya Pakistan Housing Project for the homeless, Kamyaab Naujawan Programme, Ehsas Programme and Insaf Sehat Card, while local and foreign investors’ confidence has also been restored. There is no doubt, the year 2020 will prove to be a year of development, prosperity, stability and jobs creation for Pakistan,” he added.\nHe said the PTI has strengthen the parliament, democracy and institutions and for the first time in country’s history, the institutions have been purged of political interference and all their decisions are being made on merit.\nHe proposed the opposition to play positive role instead of playing tricks and refrain from such activities endangering country’s progress and prosperity.\nHe said federal and provincial governments are taking solid measures on emergent basis to do away with the issue of price-hike assuring that hoarders would be taken to task and relief would be provided to the masses at all costs.",
  "retrievedAt": "2025-08-11T18:39:10.804Z"
}
