{
  "title": "Mafia creating artificial shortage of wheat, flour: Dr Firdous",
  "link": "https://www.app.com.pk/national/mafia-creating-artificial-shortage-of-wheat-flour-dr-firdous/",
  "date_published": "2020-01-19T07:37:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Jan 19 (APP)::Special Assistant to Prime Minister (SAPM) on Information and Broadcasting Dr Firdous Ashiq Awan on Sunday said a mafia is creating artificial shortage of wheat and flour by purchasing the commodities from local markets in a bid to whiten their black money.\nAddressing a news conference here on Sunday, she said 368 sale points and 181 truck points had been set up to ensure smooth supply of wheat flour to people.\nShe said indiscriminate action was being taken against elements involved in hoarding of flour. She said more than 25,000 tonnes of wheat was being provided to some 814 flour mills in Punjab on daily basis.\nDr Firdous said the government was successfully breaking the nexus of the mafia to get rid of people creating artificial flour crisis.\nShe said the government was taking stern legal action against stockists, hoarders and profiteers. She said now the war against price-hike had entered in its final stages.\nShe said Prime Minister Imran Khan had directed the government to ensure early provision of 4,00,000 tonnes of wheat to Sindh province, out of which Sindh had yet lifted 100,000-ton wheat.\nShe said the federal government had full responsibility to fulfil basic food needs of people of the country. She said the Sindh government showed negligence in purchase of wheat on time and miserably failed to manage demand and supply gap in the province.\nReplying to a question, Dr Firdous Ashiq Awan said Pakistan Tehreek-e-Insaf (PTI) government would complete its constitutional five-year tenure with the active cooperation of its political allies.\nShe said there was a major development between the negotiating teams of the government and Muttahida Qaumi Movement-Pakistan (MQM-P). She said the government would give good news to people soon.\nShe said political orphans were doing negative propaganda that the PTI government would not complete its tenure. She said the PTI government and its allies were on the same page and were united on all the national and international issues. She said everyone had the right to criticise the government as positive criticism was beauty of democracy.\nDr Firdous said the government was taking national economy towards the goal of economic stability.\nThe special assistant to PM said Prime Minister Imran Khan had successfully started implementation of Rs 162 billion mega development package for Karachi. She said Karachi had ever been the City of Lights, and now these lights would start brightening the city again.\nShe said Sardar Usman Buzdar would stay as chief minister of Punjab and the PTI government would complete is tenure.",
  "retrievedAt": "2025-08-11T18:39:07.277Z"
}
