{
  "title": "CM visits Jaranwala, takes punitive action against AC, SHO",
  "link": "https://www.app.com.pk/national/cm-visits-jaranwala-takes-punitive-action-against-ac-sho/",
  "date_published": "2020-01-18T23:35:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jan 19 (APP)::Punjab Chief Minister (CM) Sardar Usman Buzdar conducted a surprise visit of Jaranwala on Sunday and inspected a flour sale point, Tehsil Headquarters (THQ) Hospital and City police station.\nDuring his visit to the flour sales point, the CM interacted with people who were gathered to purchase flour bags on subsidised rate.\nFew customers complained that flour bags were not available at the sale point in a sufficient quantity. He issued orders for immediate removal of assistant commissioner Jaranwala from his post over his inefficiency and made him an OSD (Officer on Special Duty).\nHe also suspended Assistant Food Controller (AFC) Jameel Gujjar on public complaints over low supply of flour. He said the Punjab government had an ample stock of wheat and the entire machinery had been directed to overcome shortage of flour and ensure sale of flour on fixed rate.\nHe said, “I am personally checking sales points so that availability of flour could be ensured at subsidised rate.” He also issued directives for increasing the number of sale points in Jaranwala.\nAlso, the Punjab chief minister visited City Police Station Jaranwala and checked its various sections. He inquired about availability of facilities to the accused in the lock-up and ordered for solving their genuine problems.\nSome prisoners complained about attitude of the SHO City Jaranwala, and the CM suspended him with an immediate effect.\nLater, the CM also visited THQ hospital and inquired about the health facilities there. He also reviewed treatment and other facilities in the hospital and directed the administration to accelerate their efforts for provision of quality services. He said THQ Hospital would be upgraded soon.",
  "retrievedAt": "2025-08-11T18:39:09.655Z"
}
