{
  "title": "Revolutionary steps being taken to promote Pakistan’s image, narrative globally through screen tourism: Marriyum",
  "link": "https://www.app.com.pk/national/revolutionary-steps-being-taken-to-promote-pakistans-image-narrative-globally-through-screen-tourism-marriyum/",
  "date_published": "2023-07-09T11:44:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 09 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that revolutionary steps were being taken to implement the vision and directive of Prime Minister Shehbaz Sharif to promote the country’s culture and heritage and its narrative through screen tourism.\nShe said this while addressing a ceremony after performing ground breaking of the site for cinema and inauguration of Classical Musical Reserach Cell, Digital Broadcast Training Lab and Podcast Studio here at the Radio Pakiatan.\nShe said that through using platforms like Pakistan Television, Radio Pakistan, Lok Virsa and Pakistan National Council of Arts, the people especially, the youth could be connected with the country’s heritage.\nShe said that infotainment and entertainment were highly required for people especially the younger generation because during the last four years, hatred and intolerance had been promoted in the country.\nMarriyum said that it was a high time when people and especially youngsters should be provided an alternative through which they could engage themselves in positive activities.\nShe said that in 2017 and 2018, a foundation of the country’s first culture policy and film policy was laid, adding that implementation of the policy was started in the 2018 budget which was given by PML-N government.\nShe said that unfortunately during the last four years, all institutions were ruined, PTV sports was handed over to A-Sports just to deteriorate the department and auction it later.\nThe minister said that for the first time, slogan was raised in the Parliament to auction PTV and Radio Pakistan buildings and these organizations.\nShe said that those behind such slogans did not know the significance of national brodcasters and the country’s heritage. The governments in the past had not patronized the filmmakers, artists, writers, producers, distributors and cinema owners, she added.\nShe said “Film policy is part of our legislation to promote the country’s narrative through screen tourism.”Marriyum Aurangzeb said that tax incentives were available for filmmakers, producers, actors, distributors, cinemas and this would help in producing more films and promoting the country’s soft image.\nShe further said that culture and film policies were introduced when the country was fighting the war on terror adding that as it was the only tool through which the country’s image could be improved globally.\nShe said that setting up of cinemas in Radio Pakistan and PTV premises was aimed at providing affordable entertainment access to the people, especially the classes with meager income. Cinema screens facility will be started at 26 spots not only in main cities but in interior Sindh, interior Punjab and south Punjab, she said.\nThe FBR tax would be incentivized to a corporate sector if it would make a film, film lab, music lab, broadcasting lab and post-film lab, she added.\nShe said that Film Finance Fund Council was being set up for which the Prime Minister had given Rs 2 billion so that filmmaking should not remain limited to a specific groups.\nMarriyum Aurangzeb said that this fund would help youngsters to make films and showcase their skills in this field.She said that the country’s first music film policy was coming for cataloguing of the country’s historic music and a national digital archive would be launched next week in this regard.\nMarriyum Aurangzeb said that Classical Musical Reserach Cell had been reopened after ten years adding that those who wanted to close Radio Pakistan and PTV never paid attention towards improving things as their motive was to tarnish the country’s image.\nRadio Pakistan is going to start the talent hunt programme from July 15 to transform regional talent into a national talent.\nSteps are being taken to digitalize the Classical Musical Reserach Centre so that youngsters can come here and see the country’s culture and heritage, the minister expressed.\nThe information minister further said that a platform would be provided to youth and university students so that they could go there for research.\nShe said that Broadcasting Training Lab would be set up to provide proper broadcasting training for students.\nAbout Podcast Studio, the minister said that Radio Pakistan was the only organization which had set up world-class podcast centres as per international SOPs. The podcast has been set up at provincial headquarters and in the second phase, digital labs and podcasts will be established at regional headquarters, she maintained.\nShe said that when university students would engage in positive activities, no element would be able to misguide them.\nMarriyum Aurangzeb said that PML-N launched the youth programme to provide opportunities and empower the young generation of the country. Unfortunately, a campaign on social media is going on to malign the Pak Army and the government, she added.\nShe said that if youngsters would be provided opportunities then with the grace of Allah Almighty, the country would grow and become prosperous.\nShe appreciated all those who played their role in launching of PTVFLIX.\nShe further said that corporate and private sectors should play their role in nourishing the talent in youngsters.\nMarriyum said that the government’s job was to provide an enabling environment and the corporate sector should provide them technical expertise for achieving the desired results.\nReferring to the May 9 unfortunate incidents, the minister said miscreants burnt Radio Pakistan Peshawar building, setting on fire even the precious archive.\nEarlier, Director General Pakistan Broadcasting Corporation, Muhammad Tahir Hassan in his welcome address, thanked the information minister and said that Radio Pakistan was following the digital broadcasting trends and under a collective mechanism, its all transmission was being digitized including rich audio archive for future generation.\nFederal Secretary Information and Broadcasting, Sohail Ali Khan was also present on the occasion.",
  "retrievedAt": "2025-08-11T08:52:23.928Z"
}
