{
  "title": "UK’s Pakistan Network celebrates coronation of King Charles in style",
  "link": "https://www.app.com.pk/national/uks-pakistan-network-celebrates-coronation-of-king-charles-in-style-2/",
  "date_published": "2023-05-07T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP): The UK’s Pakistan Network, supported by the British Council and the GREAT campaign, has marked the coronation of their Majesties King Charles III and Queen Camilla in style with a series of events.The British High Commission in Islamabad hosted a black-tie ball, whilst the Deputy High Commission in Karachi held a traditional garden party, said a news release received here Sunday.\nTo reflect King Charles’s passion for youth development, both events were themed around the Commonwealth’s ‘Year of Youth’ campaign and aimed to shine a spotlight on the many opportunities on offer to young Pakistanis via the ‘Commonwealth Youth Programme’.\nActing British High Commissioner, Andrew Dalgleish, on the occasion said, “Over 60 percent of the Commonwealth’s population are under 30, some 1.5bn people. In Pakistan around 63 percent of the population is between 15 and 33 years old. For future stability and sustainable growth, we need to ensure that these young people are properly engaged with decision-making processes that will affect their futures, and are equipped with the skills and the opportunities to make a difference”.\nWith a focus on young people and Commonwealth initiatives, guests at both events included: Commonwealth Athletes, Commonwealth Correspondents, Commonwealth Youth Council Members, individuals from the Queen’s Commonwealth Trust Pakistan Chapter and young entrepreneurs from the Prince’s Trust, amongst others.\nThe weekend also saw members of staff from the British High Commission and British Council in Islamabad as well as the Deputy High Commission in Karachi, take part in the ‘Big Help Out’. A UK initiative designed to mark the Coronation by encouraging people to get together and volunteer to bring benefit to their local communities.\nIn Islamabad, UK staff, supported by Chevening Alumni and members of the City Development Authority, volunteered to beautify a section of the Rose and Jasmin Garden, now named ‘Commonwealth Corner’, by installing two new park benches and planting 56 trees, one for each Commonwealth Nation. Whilst in Karachi, Deputy High Commissioner, Sarah Mooney and Deputy Head of Mission, Martin Dawson, took part in the creation of another ‘Commonwealth Corner’, planting 56 trees in Salman Farsi Park in an event organised by Karachi Commissioner, Muhammed Iqbal Memon.",
  "retrievedAt": "2025-08-11T08:27:20.582Z"
}
