{
  "title": "PML-N formally launches its elections campaign: Interior Minister",
  "link": "https://www.app.com.pk/national/pml-n-formally-launches-its-elections-campaign-interior-minister/",
  "date_published": "2023-05-07T18:05:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, May 07 (APP): Federal Interior Minister Rana Sana Ullah Khan said that Pakistan Muslim League-Nawaz (PML-N) has formally launched its election campaign and it would eliminate its opponents with the power of people’s mandate.\nAddressing a public gathering while inaugurating his public secretariat in NA-106 (PP-17-108) near Chak No.65-JB on Sadhar-Narwala Bypass Road here on Sunday night, he said that this event clearly indicated that PML-N was popular among the masses so it would emerge as a winning party in the upcoming elections.\nThe minister said that PML-N had track record of serving the masses and it would restart the journey of progress and prosperity which was disrupted in 2018.\nHe regretted that an incompetent person was brought to power but he bitterly failed to deliver and undertake any development project during his tenure.\nRana Sana Ullah said that PML-N era was marked with motorways.\n“We launched massive uplift projects in the country. We also launched motorways in Lahore, Islamabad, Multan and Peshawar but Imran Khan failed to even complete one section of this mega project from Sukkur to Karachi”, he said and added that this portion would also be completed during the tenure of PML-N.\nHe said that PML-N had established hospitals, airports and motorways but Pakistan Tehreek-e-Insaf (PTI) failed to even auction the rest area of petrol pumps on the motorways.\nHe said that PML-N also launched China Pakistan Economic Corridor (CPEC) which was scheduled to be completed in 2020 but it could be completed due to removal of PML-N government.\n“If this project was completed, we had no need for foreign aid or enhance the prices of oil, gas and dollar.\nHowever, we would restart this journey of progress and prosperity if the people voted and supported PML-N in the upcoming elections”, he added.\nThe minister mentioned that the PML-N established cardiology institute, children hospital, new campuses of universities in Faisalabad in addition to refurbishing main roads of this city but PTI did nothing for uplift of people during its tenure.\nHe said that PML-N had the credit to make Pakistan atomic power in 1998 and it was the reason that India failed to achieve its nefarious design against Pakistan as no one could wage a war with an atomic power.\nAt that time the country was progressing at leaps and bounds but martial law was imposed which remained intact for 11 years. When PML-N came again into power in 2013, the country was facing load shedding and threats of terrorism but the government under leadership of Nawaz Sharif and Shahbaz Sharif efficiently controlled this situation.\nNew power houses were installed with an amazing speed, he said and added that the projects scheduled to complete within 6 to 8 years were completed in 3 years and again the country was put on the road to progress.\nHe said that Pakistan was making progress at fast track when Imran Khan was imposed on the nation.\nThis experience reversed the development process and now the responsible elements were openly confessing their fault, he added.\nHe said that former CJP Saqib Nisar played a key role in dislodging the elected government and now he was openly selling PTI tickets at Rs.12 million.\nHe added, “We respect our judiciary but our demand is very justified that justice should be done to all without any discrimination”. Saqib Nisar confessed that in audio tape, his son is talking, however judiciary should have taken notice of the audio leak, he asserted.\nHe said that Imran Khan was in habit of hurling threats. In his recent threat, he had announced that PTI would be on roads if elections were not held on May 14, 2023. In his earlier threats, he had also announced to lead a million march towards Islamabad on May 25 until the election date was announced.\nHe said that PML-N supremo was in favor of elections but the country was facing serious threats and if the caretaker government was established to handle the situation, the country may be default.\nHe said that Imran Khan would have to behave like a politician. He should contribute his role in conducting fair and free elections acceptable to all instead of hurling threats.\nHe said, “We cannot be harassed with such threats. In his public address, Imran Khan had threatened me that I will have no site to skip but he himself failed to reach at D-Chowk.\nHe said, “Imran is popular only on social media as the people have rejected him. When the people rejected him, he dissolved the assemblies. Now, we will minus him with the support of the masses”.\nHe further said that the elections would be held during this year but on the completion of constitutional tenure of the assemblies.\nHe said that the PML-N was fully prepared for elections as he toured the country along with PML-N chief coordinator Maryam Nawaz to review the arrangements for the elections, adding that his party would minus Imran Khan from the politics with public support otherwise he may lead the country towards a major crash.\nRana Sana Ullah said that a state-of-the-art office was established in NA-106 and he would remain available in it on Sunday from 10 a.m. to Maghrib. After Maghrib, he would sit in his office in Samanabad to hear public complaints and resolve their genuine issues.\nFormer parliamentarians Hajji Akram Ansari, Mian Abdul Mannan, Mian Ajmal Asif, Chaudhary Zafar Iqbal Nagra, Rana Ali Abbas Khan, Rao Kashif Rahim, Malik Nawaz, Sheikh Ejaz, Khalil Tahir Sindhu, Madiha Rana, Shoaib Idrees, Chaudhary Faqeer Hussain Dogar, Tahir Gujjar and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T08:27:16.659Z"
}
