{
  "title": "Solution of Pakistan’s problems lies in Imran’s arrest, punishment: Marriyum",
  "link": "https://www.app.com.pk/national/solution-of-pakistans-problems-lies-in-imrans-arrest-punishment-marriyum/",
  "date_published": "2023-05-07T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that the solution of the problems being faced by Pakistan lied in Imran Khan’s arrest and punishment for conspiracy against the country and for his corruption.\nIn her reaction to Imran Khan’s statement, she said it appeared that “the foreign agent has seen the video of Prime Minister Shehbaz Sharif with the British King Charles lll.”\nThe minister opined that Imran Khan’s “dirty mentality” was creating intolerance and violence in society.\n“The country needs food, employment and business, not fraud, mischief, disorder and distraction being promoted Imran.”\nThe minister held Imran responsible for the extremist attitudes in the country, due to which people were being killed by mobs.\nShe said Imran has been doing dirty politics on India and Kashmir and even using Islam for his ulterior motives.\nMarriyum recalled that it was Imran Khan who prayed for the victory of Modi in 2019 Indian elections.\nTerming him as a foreign agent, she said Imran has called for agitation and creation of chaos the time the foreign minister of China was on a Pakistan visit.\nThe minister said that Imran had called for riots and anarchy after watching the video of Prime Minister Shehbaz Sharif with King Charles lll.\nShe said when work on CPEC accelerated, the PTI chairman suffered “a bout of insanity”.\nAfter Foreign Minister Bilawal Bhutto’s successful visit to India in connection with the SCO meeting and his response to the Indian Foreign Minister, Imran Khan has completely lost his cool, she maintained.\nShe said Prime Minister Shehbaz Sharif has held meetings with world leaders including the King of Great Britain.\nTaking a jibe, she said Imran could not see what Shehbaz Sharif was doing because he was wearing a “black bucket” on his head.\nShe said mobs in Pakistan have become violent because Imran had spread intolerance in the country.\nShe said since 2013, Imran had been protesting and would continue to cry and weep on the streets in the future too.\nThe election will definitely be held on time but Imran could not get selected as there neither Faiz nor Khosa, Saqib Nisar or Bajwa were available to facilitate him.\nShe advised Imran to go to the courts and face cases instead of doing agitation on the streets.",
  "retrievedAt": "2025-08-11T08:27:25.697Z"
}
