{
  "title": "Pakistan faces global 1.5°C anticipated temperature rise prior to 2040: GCISC Study",
  "link": "https://www.app.com.pk/national/pakistan-faces-global-1-5c-anticipated-temperature-rise-prior-to-2040-gcisc-study/",
  "date_published": "2021-10-20T06:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP):A research study on Paris Agreement targets published by the Global Change Impact Studies Centre (GCISC) researchers revealed that Pakistan has started observing global warming, the famous 1.5 degree Celsius temperature increase ahead of the globally predicted threshold of 2040, with consistently increasing vulnerability due to climate change.\nAnother research study by GCISC scientists on monsoon changes titled “21st Century Precipitation and Monsoonal Shift over Pakistan and Upper Indus Basin (UIB) using High-Resolution Projections” that recently got published in the internationally reputed journal Science of the Total Environment revealed the latest facts on changing monsoon patterns in the country that would have deep effects on the agrarian economy.\nThe study was conducted under a research project funded by Asia Pacific Network on Global Change Research (APN).One of the team members Dr. Shaukat Ali Senior Scientific Officer of GCISC, who contributed to the study, told APP that the research was conducted with great effort and spoke volumes about the intellectual prowess of the Centre as Science of the Total Environment is a well-reputed international journal.\nHe said, “The Monsoon Rainfall change prediction has been made as per the international standards and techniques using the inter-and intra-annual variability of the monsoonal rainfall over Pakistan and its possible drivers using high-resolution regional climate models.”\nAli added that the annual temperature rises in the region particularly; Pakistan was faster than the rest of the world. “Our Monsoon pattern due to rapidly changing temperature of the region and protracted hot season is shifting towards North side of the country,” he said.\nTo a question, he replied that the divisions of Faisalabad, Sialkot, and Lahore bearing the maximum burden of the country’s agriculture produce were going to face adverse effects amid low rainfall and water availability for the sowing season.He further informed that the shift of Monsoon towards the North would incur disastrous outcomes.\nThe Glacial Lake Outburst Flood (GLOF) phenomenon was already creating flooding in the mountainous areas of Gilgit Baltistan and Khyber Pakhtunkhwa destroying infrastructure and precious lives lost.\n“In such circumstances, any increased rainfall on the glaciated mountains will draw the massive masses of snow down to the human populations inhabited in the regions,” he warned.\nHead Agriculture and Coordination section, GCISC Arif Goheer added about the vulnerability of agriculture and said that “Given the agro-economic dominance of central and southern Punjab and parts of Sindh, the spatial northward shift of monsoon could have a devastating effect on agriculture and food security since the key economic crops are grown in these areas. This alarming situation demands concerted long-term planning and action in ensuring the country’s food security.”\nWhen contacted, Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam told that the Climate Smart Agriculture project was launched in eight districts of the Punjab and Sindh provinces to equip the farmers with climate-resilient best practices for sustainable agriculture.\n“The project is being launched on a pilot basis with the assistance of UN’s Food and Agriculture Organization (FAO),” he added.",
  "retrievedAt": "2025-08-11T21:29:40.041Z"
}
