{
  "title": "Chinese workers celebrate construction of Friendship Highway between China and Pakistan",
  "link": "https://www.app.com.pk/national/chinese-workers-celebrate-construction-of-friendship-highway-etween-china-and-pakistan/",
  "date_published": "2021-10-20T11:22:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct 20 (APP): More than 300 of the Chinese workers who took part in construction of the  “Friendship highway between China and Pakistan” also known as the Karakoram Highway (KKH) commemorated its 53rd anniversary at a grand charity event held in Shanghai, China.\nJiang Zhenxiao who also took part in the construction from year 1974-1979 said that for the workers who spent their youth working on the secret Project 1601, as the road was then known, not only casted a long shadow — a unique, towering achievement, but also a graveyard for dozens of their comrades and friends.\nJiang who worked as an Urdu translator in KKH headquarters, said, “The Chinese workers who are now more than 70 years old shared their memories of years of struggle, moments of happiness and sorrow. They were excited and enthusiastic at the same time to meet their old fellow workers.”\n“It was hard for them to travel and attend the event but their passion could still sustain them. The pioneers of China-Pakistan highway construction, once full of youth and enthusiasm, have also grown old now. Many people have even faded away from this world, but history will never forget them.” Jiang added.\nHe said, “The road builders who attended Chongyang charity event, came from all over Shanghai. They were neatly dressed, and many people hung up medals specially tailored for this event, just like attending a solemn ceremony for themselves. This glorious and unforgettable history also represents all comrades who are alive or dead, who can come and who couldn’t.”\nAccording to China Economic Net (CEN), the Chongyang Charity Event was sponsored by the Shanghai Charity Foundation Aiqing and Eternal Special Fund. It was commenced by Shanghai Tahe Cultural Enterprise Development Co., Ltd. Chairman Shi Nanchang of Shanghai Charity Foundation attended the event and delivered the speech.\nNi Haomei, the former vice chairman of the All-China Federation of Trade Unions and former deputy political commissar of Xinjiang Corps sent a congratulatory letter while Alar city of Xinjiang Corps first division sent their five representatives.\nThe Karakoram Highway, also known as the Friendship Highway in China, was built by the governments of Pakistan and China. About 810 Pakistanis and about 200 Chinese workers lost their lives, mostly in landslides and falls, while building the highway.\nThe highway is a popular tourist attraction and is one of the highest paved roads in the world, passing through the Karakoram mountain range, near Khunjerrab Pass.\nThe highway’s construction was a major joint venture between Pakistan and China that began in 1966-67 and was completed in 1977-78.\nThe total length is approximately 1,300 kilometers, of which 887 kilometers is in Pakistan and 413 km in China. It’s considered a symbol of Pakistan-China eternal friendship.\nIt was not an easy road to make. In fact, many were surprised when it was finally completed, as, at one time, even the world’s largest companies had refused to take on the project.\nA European construction company reportedly declared the construction next to impossible after an aerial survey. Given the harsh weather, heavy snowfall, and landslides, this road construction was a miracle made possible by Pakistan and China.",
  "retrievedAt": "2025-08-11T21:29:45.668Z"
}
