{
  "title": "Forests protection essential to provide conducive environment to future generations: AJK PM",
  "link": "https://www.app.com.pk/national/forests-protection-essential-to-provide-conducive-environment-to-future-generations-ajk-pm/",
  "date_published": "2021-10-20T15:14:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK):Oct 20 (APP): Azad Jammu and Kashmir (AJK) Prime Minister Sardar Abdul Qayyum Niazi Wednesday emphasized for the need to protect the state asset of huge forests and  to maintain the natural beauty to provide a conducive environment to the future generations.\nHe expressed these views at a departmental briefing, given by additional chief secretary of the state forest department. Forest Minister Muhammad Akmal Hussain Sargala was also present on the occasion.\nThe AJK prime minister said the development of forests could play a vital role in global warming.\nHe said steps should be intensified against the timber mafia and added the deforestation would not be tolerated under any circumstances. It was an important to plant trees as many as possible to avoid climate change.\nHe said the best measures taken by the prime minister of Pakistan Imran Khan to prevent climate change were appreciated all over the world.\nHe said under the Billion Tree Tsunami Project, the Azad Kashmir would be turned into a green area according to the vision of the Prime Minister Imran Khan.\nNiazi pointed out as saying that in the last ten years the forest department had been neglected, however, funds for the forest department would be increased in the annual development programme and the government would provide all resources for the betterment of the institutions.\nThe prime minister said the only way to avoid the rapid rise in the temperature of the planet was to plant trees as many as possible and added it was the collective responsibility of all of us to protect it by planting trees.\nHe said the deforestation was affecting not only the natural environment but also human beings and wildlife as well and called for taking urgent steps to stop deforestation.\nHe also urged the people to fulfill their responsibility in stopping deforestation and to cooperate with the forest staff by identifying the timber mafia.\nThe prime minister directed for plantation of maximum trees under the Billion Tree Tsunami Project as per the vision of Prime Minister Imran Khan and urged for effective monitoring of the Billion Tree Tsunami Project.",
  "retrievedAt": "2025-08-11T21:29:43.068Z"
}
