{
  "title": "Civilian killings in IIOJK refer to Modi’s playbook of repression, violence: JKNF",
  "link": "https://www.app.com.pk/national/civilian-killings-in-iiojk-refer-to-modis-playbook-of-repression-violence-jknf/",
  "date_published": "2021-10-20T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Voicing his serious concern over the fresh arrest and killing spree of innocent civilians in Indian Illegally Occupied Jammu and (IIOJK), Senior APHC leader and Vice chairman Jammu Kashmir National Front (JKNF), Altaf Hussain Wani said Wednesday that the bloodbath of innocent civilians in the restive region bears the imprints of Narendar Modi’s playbook of repression and violence.\nIn a statement, Wani while citing the fresh incidents of violence in Kashmir valley said that the ruthless killings of 12 civilians including non-local labourers speak volumes about the fast-deteriorating human rights situation in the region.\nTerming these incidents as a ploy to destroy existing age-old communal harmony, he said that the gruesome murder of local and non-local labourers carried out by the Indian secret agencies under the guise of ‘unknown and unidentified’ refer to Narendar Modi’s old playbook of repression and violence aimed at spreading hatred and sowing the seeds of discord amongst the communities.\nReferring to the horrendous incidents of mass killings that shook the Kashmir valley in the recent past, the JKNF Vice chairman said that Chattisinghpora, Pathribal, Barakpora and other massacres carried out by the Indian army and its secret agencies were the live examples of the Indian state sponsored terrorism.\n“The mass murder of 35 members of Sikh community at Chattisingpora was orchestrated by the Indian secret agencies and then carried out by Indian army during the dark of night”, he said adding that India put blame on Pakistan and freedom fighters but the investigation report later proved that India was directly involved in the gruesome murder of innocent Sikhs”.\nIndian occupation forces, he said, have a worst track record of killing, maiming and murdering hapless people in Kashmir.\nCiting India’s present day mass radicalization, intolerance and extremism as a grave threat to peace in the region he said, the BJP that thrives on communal politics was remorselessly using its divisive policies to push forward its Hindutva agenda in Kashmir region.\nThe killing of non-local labourars in IIOK, he said, was part of the Indian racist regime’s grand conspiracy to communalize a purely political dispute that needs to be resolved in accordance with the UN established principle of right to self-determination and the UN resolutions that guarantee Kashmiris’ the right to self determination.",
  "retrievedAt": "2025-08-11T21:29:39.840Z"
}
