{
  "title": "PM chairs meeting on development of Balakot City as tourist hub",
  "link": "https://www.app.com.pk/national/pm-chairs-meeting-on-development-of-balakot-city-as-tourist-hub/",
  "date_published": "2021-10-20T15:06:00.000Z",
  "source": "APP",
  "content": "The Prime Minister said,” the government wants to develop new tourist resorts in hilly areas for the promotion of tourism in the country.”\n“For this purpose, reputed private investors in the field of tourism and hospitality are being attracted on Public Private Partnership (PPP) mode,” he added.\nThe Prime Minister directed the federal and provincial authorities concerned to take all necessary measures to fully facilitate private investors in this regard.\nHe further directed KPK government to take over the entire project from ERRA and accomplish it as a tourist resort. The Prime\nMinister further directed to exclude irrigated land from the project in order to ensure food security in the region.\nEarlier the Prime Minister was briefed that feasibility study on a Rs. 19.5 billion project for the development of New Balakot City as a tourist hub on Design-Build-Finance-Operate and Transfer (DBFOT) mode had been completed by NESPAK and KPMG. 63% residential plots out of the total 6753 under the proposed project were reserved for allotment to the local affectees, whereas remaining 2480 residential and 575 commercial plots besides 800 apartments would be auctioned to generate finances for the execution of the project.\nThe Prime Minister was informed that primarily it was the responsibility of provincial government of Khyber Pakhtunkhwa instead of the federal government to develop New Balakot City. Khyber Pakhtunkhwa government had already acquired land for the purpose.\nTo be executed under Public Private Partnership (PPP), the tourist resort will include youth hostel, theme park, camping ground and a 3-Star hotel.\nThe project, when completed will not only ease pressure on existing overloaded tourist destinations but would also earn more than Rs seven billion as a result of expected revenue sharing with the government.\nThe meeting was attended by Railways Minister Azam Khan Swati, Chief Minister KPK Mahmood Khan, MNA Saleh Swati, KPK Population Minister Syed Ahmed Hussain Shah, Chairman National Disaster Management Authority Lt Gen Akhtar Nawaz Satti and senior officers concerned.",
  "retrievedAt": "2025-08-11T21:29:42.788Z"
}
