{
  "title": "DIG emphasizes zero tolerance for corruption & bribery",
  "link": "https://www.app.com.pk/national/dig-emphasizes-zero-tolerance-for-corruption-bribery/",
  "date_published": "2024-09-20T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):Deputy Inspector General (DIG) of Police Syed Ali Raza on Friday emphasized upon zero-tolerance policy towards corruption and bribery, stressing that the protection of life, property, and citizens’ dignity was of a paramount importance.\nAccording to police spokesperson, under the special directives of the Inspector General (IG) Police Syed Ali Nasir Ali Rizvi, the DIG Syed Ali Raza said that the Islamabad Police is committed to resolve public issues on priority.\nDIG said this while listening to the complaints and issues of the public as well as police officials during the Khuli Kachehri held at his office, he said.\nSenior police officers were also present on this occasion, he added.\nHe said during the Khuli Kachehri, Syed Ali Raza listened to the complaints of the citizens and marked their applications to the concerned officers for timely action on merit.\nHe also directed them to send reports to his offices in the given time frame, he added.\nAli Raza further said that strict action will be taken against officials involved in bribery or corruption and a zero-tolerance policy will be adopted in this regard, he said.\nRaza emphasized that Islamabad Police would not leave any stone unturned to secure the lives and property of the citizens.\n“Such interaction would be continued in future to provide maximum relief to the citizens.” DIG added.\nSyed Ali Raza said that interaction during “Khuli Kachehris” would help to promote friendly policing and will also ensure self-accountability, immediate resolution of citizens’ problems.\nHe said the protection of life, property and self-respect of citizens comes first, DIG maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:15:46.558Z"
}
