{
  "title": "China shifts from solar manufacturing giant to solar IP innovator",
  "link": "https://www.app.com.pk/global/china-shifts-from-solar-manufacturing-giant-to-solar-ip-innovator-2/",
  "date_published": "2024-09-20T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):China is transitioning from a solar manufacturing powerhouse to a leading innovator in intellectual property (IP) as in 2022, China has accounted for over 80 per cent of capacity and production in all stages of the solar PV supply chain including polysilicon, wafers, cells, and modules.\nExecutive Deputy Director of China’s Photovoltaics Industry IP Operation Centre, Chen Wei informed the participants at the China IP annual meeting, citing the Photovoltaics IP Development Report for 2023 in Beijing, China Economic Net reported on Friday.\nBeyond PV manufacturing, Chen also noted a significant increase in research and development (R&D) investment among Chinese firms. “Several Chinese PV giants have been allocating about 5 per cent of their business revenue to R&D in PV technology over the past years,” he said adding, “This is a significant investment given the specialised nature of PV technology.”\nThe manufacturing prowess and R&D investments have encouraged more Chinese enterprises and research institutes to innovate in the industry. In solar cell efficiency research, more and more Chinese solar enterprises and research institutes have become contributors to the best research-cell efficiency chart.\nThe chart, updated by the Colorado-based National Renewable Energy Laboratory (NREL), a national laboratory under the US Department of Energy, documents the highest confirmed conversion efficiencies for research cells for a range of solar technologies.\n“Solar cell efficiency is a critical metric in the industry,” Chen explained adding, “It measures how effectively a solar cell converts sunlight into electricity. Higher efficiency means more power from the same surface area.”\nThe R&D push has driven a surge in intellectual property initiatives. As per data from the photovoltaics IP development report, China’s annual solar patent applications skyrocketed from 40.8 per cent of the global total in 2014 to 82.6 per cent in 2021, totaling more than 175,000 cumulative applications by 2022, taking up 48 per cent of the world’s total.\nThe country now holds 33,970 valid patents in key PV technologies including raw materials, wafers, cells and modules, representing 48% of the global total and equivalent to the combined number of patents from the U.S., South Korea, Japan and Europe, according to the photovoltaics IP development report.\nTo better harness the power of IP, Chen highlighted that efforts should be made to increase international patent protection through the Patent Cooperation Treaty (PCT) mechanism and to increase patents in more critical technology branches. “We need to focus on cultivating high-quality patents through improved writing and strategic portfolio management,” he said.\nIndustry forecasts suggest renewable energy could account for 76% of global power generation by 2050, with solar playing a significant role. “The peak of China’s solar IP operation is yet to come, but I believe it is on the horizon,” Chen concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:15:29.875Z"
}
