{
  "title": "Chinese firm to set up textile parks in Pakistan aiming $5b exports, 0.5m jobs; MoU signed",
  "link": "https://www.app.com.pk/national/chinese-firm-to-set-up-textile-parks-in-pakistan-aiming-5b-exports-0-5m-jobs-mou-signed/",
  "date_published": "2024-09-20T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): The Board of Investment and Chinese textile firm RUYI Shangdong on Friday signed a Memorandum of Understanding under which the latter would establish textile parks of international standards in Pakistan to boost country’s exports to $5 billion and create around 0.5 million jobs.\nThe document was signed as a nine-member delegation of RUYI group led by Chairman QiuYafu called on Prime Minister Shehbaz Sharif here as a significant development regarding Chinese investment in Pakistan following the prime minister’s recent China visit.\nAccording to the MoU signed at a ceremony witnessed by Prime Minister Shehbaz Sharif, the Chinese company would establish textile parks in Sindh and Punjab provinces where around 100 Chinese textile firms would be invited to invest.\nThe prime minister lauded the time-tested Pakistan-China friendship and observed that the bilateral economic ties were strengthening with each passing day.\nHe welcomed the Chinese RUYI group to Pakistan and lauded its investment in Pakistan’s textile sector, recalling that the firm had been the first investor of Sahiwal Coal Power Plant established under the China-Pakistan Economic Corridor.\nBriefing the prime minister, the company head said that the textile parks aimed at boosting textile exports and making the country a hub of textiles and garments.\nTo be powered by solar energy, the textile parks would be developed as zero-carbon and and automated facility to enhance the exports to $2 billion in its first phase and $5 billion in the second one besides creating from 0.3 million to 0.5 million jobs.\nThe meeting was told that work on the textile parks to start by this yearend and would take another three years to complete. The Chinese company would also establish a whole sale commodity center in Karachi and Lahore.\nThe meeting decided to form working groups in Islamabad and Beijing to further pursue the understanding.\nPrime Minister Shehbaz also formed a special committee under Deputy Prime Minister and Foreign Minister Ishaq Dar comprising federal ministers for commerce, investment and privatisation, industries and production, foreign secretary, a representative of Special Investment Facilitation Council and Zafaruddin Mehmood.\nThe RUYI group chairman told the meeting that they had come to Pakistan, not as an investor but a friend. He also mentioned the Shehbaz Speed referring to the fast-paced execution of development projects during Shehbaz Sharif’s stint as Punjab chief minister and also hoped for same pace in the textile parks project.\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Commerce Minister Jam Kamal Khan, Industries and Production Minister Rana Tanveer Hussain, Privatisation Minister Abdul Aleem Khan, Power Minister Awais Ahmed Khan Leghari and relevant senior officials attended the meeting.",
  "retrievedAt": "2025-08-10T21:15:06.317Z"
}
