{
  "title": "CCAR, IRC partner to strengthen humanitarian support in Pakistan",
  "link": "https://www.app.com.pk/national/ccar-irc-partner-to-strengthen-humanitarian-support-in-pakistan/",
  "date_published": "2024-09-20T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):The Chief Commissioner Afghan Refugees (CCAR) and the International Rescue Committee (IRC) Pakistan have formally signed a Memorandum of Understanding (MoU) to solidify their collaboration to strengthen humanitarian support in Pakistan.\nThis strategic partnership addresses the pressing needs of vulnerable populations, particularly Afghan refugees, through a holistic approach that entails institutional strengthening, humanitarian programming and coordinated actions, a news release said.\nUnder this collaboration, CCAR and IRC intend to pursue actions aimed at developing and backstopping multi-sectoral humanitarian support through a consultative process, with an emphasis on capacity building and technical support. Both organizations are committed to sustaining and replicating the Urban Support Units supported by IRC.\nMoreover, the partnership aims to engage and bring together donors and organizations for livelihood & skill development initiatives along with Community-Based Disaster Risk Management/Reduction models tailored for vulnerable Afghan refugees and host communities.\nShabnam Baloch, Country Director, International Rescue Committee in Pakistan, stated, “This partnership marks a significant milestone in our collective ongoing efforts to support Afghan refugees and other vulnerable populations in Pakistan. The collaboration with CCAR will enable us to develop and implement more effective and sustainable programs that address both the immediate needs and long-term resilience of these communities. We are excited to combine our expertise and resources to create a meaningful impact.”\nMuhammad Abbas Khan, Chief Commissioner, CCAR, also highlighted the importance of this partnership, saying, “The challenges faced by Afghan refugees are multifaceted, particularly in the context of climate change. Our partnership with IRC is a crucial step towards developing robust and resilient systems that can support these communities. Together, we are committed to making a lasting difference in the lives of those most affected.”\nPakistan’s vulnerability ranking (37 out of 191) is driven by its high rates of multidimensional poverty and Climate Change.  There is a dire need for mainstreaming knowledge of climate impacts on vulnerable populations including Afghan refugees and host communities CCAR and IRC hope to foster a more coordinated and united approach to addressing these critical issues.\nThe signing of this MoU sets the stage for a strong and collaborative partnership between CCAR and IRC, with both organizations dedicated to implementing sustainable, evidence-based interventions that will have a profound impact on the ground.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:14:58.948Z"
}
