{
  "title": "Awais Leghari chairs introductory meeting of BoDs, CEOs, WB, ADB, IDB experts",
  "link": "https://www.app.com.pk/national/awais-leghari-chairs-introductory-meeting-of-bods-ceos-wb-adb-idb-experts/",
  "date_published": "2024-09-20T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): The introductory meeting of Chairpersons Board of Directors (BoDs), Chief Executive Officers (CEOs) of power companies, experts from World Bank, Asian Development Bank, Islamic Development Bank and other development partners was held here on Friday.\nFederal Minister for Power Division Sardar Awais Ahmed Khan Laghari presided over the meeting, said a press release issued here.\nFor the first time in history, chairmen of distribution companies, NTDC and development partners were brought together on one platform under the leadership of the federal minister to formulate a comprehensive strategy for the future.\nSpeaking on the occasion, the minister said that NTDC would be restructured to make the grid strengthen and sustainable.\nVideo Playerhttps://vid.app.com.pk/vid/wp-content/uploads/2024/09/video.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nHe said that that there were some hurdles in the system due to lack of infrastructure and technology. “We need more transparency in the system and Power Division is working on it to achieve the goal,” he added.\nAwais Leghari sought effective proposals from development partners in order to create a more efficient, effective and transparent environment in the power sector. In current scenario, each matter required to be referred to the board of NTDC, which needed to be changed.\nHe said due to slow decision making, targets were not achieved on time which created more uncertainty and added that\nthe Power Division would restructure NTDC to introduce a robust and sustainable system.\nThe minister stressed that we need more transparency in data and investment plans, to reduce electricity costs for consumers. “Transparency is part of our vision and we need to make prompt, data-driven decisions for the benefit of consumers,” he said.\nAwais Leghari appreciated the support of development partners and the vision of the newly appointed chairmen BoDs and NTDC, and directed them to focus on transparency and effective decision-making.\nHe emphasized that the BoDs and NTDC should work independently, and should focus on improving efficiency, resolving pending issues and taking quick decisions.\nHe suggested that development partners should collaborate with distribution companies to upgrade technology. He said\nthe installation of smart meters should be accelerated and the distribution of electricity should be made more effective.\nThe minister said there was a need to reduce the delay in the projects and warned that delay or cost increase in the projects would not be tolerated in the future.\nHe directed the BoDs to ensure timely completion of the ongoing projects.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:15:21.521Z"
}
