{
  "title": "Punjab govt committed to maintain peace: Azma Bukhari",
  "link": "https://www.app.com.pk/national/punjab-govt-committed-to-maintain-peace-azma-bukhari/",
  "date_published": "2024-09-20T07:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):Punjab Information Minister Azma Bukhari on Friday reiterated the provincial government’s commitment to maintaining peace and stability, warning that no one will be allowed to disrupt law and order or exploit youth for political purposes.\nTalking to a private news channel, Azma said under Chief Minister Maryam Nawaz Sharif’s leadership, the Punjab government is determined to deliver on its promises.\nShe said the government is launching multiple projects for youth welfare, including free IT courses, the Punjab Rozgar Scheme, the CM Punjab Skill Development Program, the Punjab Youth Helpline, sports development initiatives, and women empowerment programs.\n“These initiatives aim to provide young people with skills, resources and opportunities to thrive, aligning with Chief Minister Maryam Nawaz Sharif’s vision for a progressive and prosperous Punjab”, she added.\nPunjab Information Minister Azma Bukhari has thrown down the gauntlet, challenging critics to compare the performance of previous Chief Minister Buzdar with the current CM, Maryam Nawaz Sharif. And it is easy to see why Maryam Nawaz Sharif has been on a mission to transform Punjab since taking office.\nShe emphasized that the provincial government will not tolerate any disruptions to law and order amidst speculation surrounding PTI’s plans to hold a Jalsa (public gathering) in Lahore.\nShe expressed confidence that Punjab citizens prioritize their Chief Minister’s performance and will not be swayed by opposition rallies.\nThe information Minister has expressed serious concerns about granting a No Objection Certificate (NOC) to the Chief Minister of Khyber Pakhtunkhwa (KPK) for holding a Jalsa (public gathering) in Lahore.\nAccording to her, the KPK government has a history of creating anarchic situations, as seen in Islamabad where only KPK citizens were allegedly forced to participate.\nShe has also criticized the PTI’s use of official resources for public gatherings, likening their rallies to concerts.\nAzma Bokhari stated there is no comparison to be made, as the Punjab CM is working tirelessly to revamp and transform the province, unlike Gandapur who allegedly uses official vehicles and infrastructure for public gatherings.\nBokhari emphasized that the Chief Minister is focused on serving the people, whereas Gandapur is more interested in self-serving political activities.\nThe Information Minister also took a swipe at Gandapur’ s politics, labelling it as baseless allegations and levelling accusations, much like his PTI leader.\nPunjab Information Minister Azma Bukhari has thrown down the gauntlet, challenging critics to compare the performance of previous Chief Minister Buzdar with the current CM, Maryam Nawaz Sharif. And it is easy to see why Maryam Nawaz Sharif has been on a mission to transform Punjab since taking office.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:15:47.874Z"
}
