{
  "title": "Afghans have pivotal role to decide about future of Afghanistan : Sh Rashid",
  "link": "https://www.app.com.pk/national/afghans-have-pivotal-role-to-decide-about-future-of-afghanistan-sh-rashid/",
  "date_published": "2021-08-11T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Minister for Interior, Sheikh Rasheed Ahmad on Wednesday said that Afghans would take initiatives for the future of their country and reiterated that Pakistan had no favourites in Afghanistan.\nAddressing a press conference, he said Pakistan was itself a victim as the nation had paid a huge price with 70,000 casualties, in addition to huge economic losses.\nHe said India’s Research and Analysis Wing (RAW), National Directorate of Security (NDS) and Israeli spy agency were trying to hamper peace in Pakistan, besides also carrying out media campaign against it.\nHe said that it was high time to jointly counter the conspiracies of hostile forces against the motherland and added opposition parties were not cognizant of regional changes during the upcoming six months.\nHe said that special instructions had been issued to chief secretaries and police officials to ensure foolproof security for the processions of Muharram-ul-Haram across the country.\nThe minister said that effective measures would be adopted to maintain law and order, security and harmony during Muharram-ul-Haram.\nHe appealed for following National Command and Operation Center’s (NCOC) COVID-19 Standard Operating Procedures (SOPs) to curb the disease in the wake of sudden increase in the number of cases.\nHe said that it was the responsibility of countryman to promote the culture of peace and brotherhood during holy month of Muharram.\nTo a question, he said that the Ministry of Interior had completed its investigation on Afghan’s ambassador’s daughter’s case and had shared the factual situation with the Afghan investigation team through the Foreign Office.\nHe said that a vaccination portal would be prepared within a few days to serve the citizens regarding vaccination certificates for Muslim countries.\nHe said that the government had decided to dedicate 1122 Service in the federal capital to ensure immediate help during the flood-like situations as no such quick service was available here.\nHe said that the NADRA had initiated action against corrupt elements and employees for their role in the reported wrongdoings. He added a process had been launched for re-verification of seven million national identity cards, which were issued before the biometric system.\nHe said that multiple measures had been taken to avoid issuing CNIC to any illegal or unauthorized person.\nHe said that efforts were afoot to make the authority at par with international organizations’ standards.",
  "retrievedAt": "2025-08-11T21:04:11.825Z"
}
