{
  "title": "Govt pursuing vision to double farmers’ income to check poverty: PM",
  "link": "https://www.app.com.pk/national/govt-pursuing-vision-to-double-farmers-income-to-check-poverty-pm/",
  "date_published": "2021-08-11T13:24:00.000Z",
  "source": "APP",
  "content": "BAHAWAPUR, Aug 11 (APP): Prime Minister Imran Khan on Wednesday describing farmers as an “asset” for the country said the present government was following a vision to double their income to achieve higher economic growth, ensure food security and check poverty and inflation.\n“We have a vision to double the income of farmers. They will invest their income in agriculture, which will benefit Pakistan and help reduce poverty, decrease prices of food items and check price-hike,” Imran Khan said while addressing Kissan Convention here.\nThe Prime Minister mentioned with pride that owing to the government’s policy enhancing support prices of various agricultural crops including wheat, sugarcame and maize, the growers secured Rs 1100 billions of additional income during the previous fiscal years.\nHe further said that with the initial two years spent on economic stabilization due to various inherited challenges on the economic front, his government had finally put the country on the path of economy recovery and achieved around 4% GDP (Gross Domestic Product) growth during the fiscal year 2020-21.\nThe Prime Minister also launched the provincial government’s Kissan Card scheme during the Convention, which was also addressed by Chief Minister Punjab Sardar Usman Buzdar and Special Assistant to PM for National Food Security Jamshed Iqbal Cheema.\nImran Khan said that as farmers were the country’s precious asset, today’s Kissan Convention will send a clear message that the country will move forward by helping the farmers.\nHe said that with a mere 26000 growers having the agricultural lands of over 125 acres each, the country had around 8.4 million of hardworking small farmers, who were the core of this country as well as the agriculture sector.\nThe Prime Minister noted with pleasure that contrary to the past, when sugarcane growers had to sell their produce at lower rates due to exploitation by the powerful sugar millers, the growers this year got higher prices and earned extra profits due to the passage of a law which bounded the sugar millers to start crushing of the produce at particular dates.\nHe said that due to the record production of wheat, sugar rice and maize this year, the growers earned Rs. 1100 billions of extra income.\nThe Prime Minister said that the unprecedented higher sales of motorcycle in the rural areas also depicted increase in the income of farmers.\nHe, however, added that growth in the country’s agricultural produce did not match with population growth which went up from 40 million (West Pakistan) in 1947 to 225 million at present.\nHe said that despite a bumper wheat crop, the country had to import 4 million tons of wheat to cater to the needs of people.\nThe Prime Minister stressed on the need of enhanced research and development in agriculture to achieve higher production of various crops.\nHe said that Pakistan which had been bestowed by Allah Almighty with 12 climatic zones had a lot of potential in agriculture sector and could grow all agricultural commodities by using advanced technology and adopting modern techniques not only for local consumption but for exports as well.\nThe Prime Minister referred to the principles of the State of Madina, introduced by Holy Prophet Muhammad (Peace Be Upon Him) for the uplift of poor and said that China by adopting the similar principles lifted its people out of poverty during the last 35 years.\nHe said that the provision of Kissan Cards by the provincial government to the farmers in Punjab will help them getting direct subsidy on various agricultural inputs.\nThe PTI governments in Khyber Pakhtunkhwa, AJK and Gilgit Baltistan will also be asked the follow the Kissan Card scheme, he added.\nThe Prime Minister also mentioned the introduction of health card scheme in Khyber Pakhtunkhwa and Punjab as his government’s major achievement for the provision health insurance coverage to masses under which a family had Rs. one million free of cost health facility from any public or private hospital for one year.\nImran Khan said that even before coming into politics he used to think if he got a chance the serve the country he would introduce the health insurance scheme, adding, the universal health insurance scheme introduced by his government was not available even in the rich countries.\nHe also mentioned the construction of Shaukat Khanum Memorial Cancer Hospitals in Lahore and Peshawar and said 70% of cancer patients were treated free of cost at the hospitals.\nThe Prime Minister said he got the ideal constructing free cancer hospital after his mother suffered from the disease and he felt that how the poor could afford the expensive treatment of such a disease.\nHe assured that the federal as well as the provincial government will extend every possible to the farmers to bring about prosperity in the country and for the well-being of people in rural areas.\nThe Prime Minister also presented shields to Vice Chancellor Islamia University Bahawalpur (IUB) Dr. Prof. Athar Mehmoob, Dr. Prof Iqbal and Dr. Ali for their services in the field of agricultural research and development.",
  "retrievedAt": "2025-08-11T21:04:11.831Z"
}
