{
  "title": "Nawaz to return home on next flight if given NRO: Farrukh",
  "link": "https://www.app.com.pk/national/nawaz-to-return-home-on-next-flight-if-given-nro-farrukh/",
  "date_published": "2021-08-11T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Minister of State for Information and Broadcasting Farrukh Habib Wednesday said that PML-N leader Nawaz Sharif would return home on next flight if given an NRO like concession.\nAddressing a match concluding ceremony of the Inter-media Independence Cup, he said it was being told that Nawaz Sharif could not return to the country from London due to the coronavirus related restrictions, but, in reality, the PML-N sought an NRO (National Reconciliation Ordinance) for him.\nHe also recalled Maryam Nawaz’s statement in which she covertly demanded an NRO like concession to let his father escape jail terms here.\nThe minister was astonished over the PML-N’s excuse of COVID restrictions and said it was the same Nawaz Sharif who had no regard for the anti-COVID-19 SOPs in London where he was watching polo matches, strolling hide park and eating pizzas.\nHe said there were reports that Nawaz Sharif submitted another medical report to the authorities in London for extension of his visa.\nBut, it seemed that Dr Adnan, personal physician of Nawaz Sharf, had once again started producing fake medical reports for the Sharif family, he added.\nFarrukh claimed that the PML-N leader did not take a single dose of injection during his stay.\nThe minister said Nawaz Sharif, who was a declared fugitive and absconder, had been living in the United Kingdom with an expired Pakistani passport. His sentence had been upheld by the court in Pakistan by turning down his appeals in the corruption cases.\nHe advises Nawaz to better relinquish his obstinacy and come back to the country for serving the jail term, given by the court to him in the corruption cases.\nTo a query, he described absence of Maryam Nawaz from the Pakistan Democratic Movement (PDM) recent meeting as a ‘new change’.\nReferring to internal rifts of the PML-N, he said there were two narratives in the multi-party opposition alliance. On the one hand, Shehbaz Sharif called for politics of reconciliation, while on the other, Maryam insisted on politics of ‘resistance.\n“Let’s see which one of the narratives will prevail in the PDM in future,” he responded to another query.\nHe said the PDM had failed to cause any harm to the government after falling short on its towering claims of en-mass resignations, no-confidence move against Prime Minister Imran Khan in the Parliament, sit-in and long march.\nThe minister said only option left for the opposition was to cooperate with government in the Parliament to legislate on electoral reforms including use of Electronic Voting Machines (EVMs) in the elections and provision of right to vote to the overseas Pakistanis.\nThe PDM was nothing more than an assembly of unemployed people, he remarked.\nFarrukh ruled out possibility of holding talks with the opposition parties on the matters pertaining to their personal agendas.\n“We will only talk with those [politicians] who are part of the Parliament,” he maintained.\nCommenting on the Kashmir Premier League (KPL), he said there was a mega cricketing event underway on the one side of Line of Control (LOC), while on the other side, eight million people were put in captivity by Indian Prime Minister Narendra Modi.\nThe minister said some international players had publicly expressed that the Board of Control for Cricket in India (BCCI) had been forcibly stopping them to participate in the event.\nSuch an abhorrent act on the part of Indian prime minister was a true reflection of his extremist and fascist mindset, he said, adding Modi got befitting response after international players took part in the KPL.\nHe said the mega cricketing event would help spread a message across the globe that ‘the people of Kashmir are peaceful, sports-loving and amicable.’\nFarrukh also appreciated Rawalpindi Islamabad Sports Journalist Association for promoting sports in the country by organizing such activities.",
  "retrievedAt": "2025-08-11T21:04:11.827Z"
}
