{
  "title": "Pakistan seeks Afghan cooperation on incident of Ambassador’s daughter",
  "link": "https://www.app.com.pk/national/pakistan-seeks-afghan-cooperation-on-incident-of-ambassadors-daughter/",
  "date_published": "2021-08-11T17:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP0: Pakistan on Wednesday hoped that the government of Afghanistan will cooperate in expeditious provision of the requested information regarding the July 16 incident involving the daughter of Afghanistan’s Ambassador in Islamabad.\n“We have seen the Afghanistan Ministry of Foreign Affairs’ statement and the complainant’s video. It is once again highlighted that the visiting delegation was given a comprehensive briefing on each aspect of the complaint,” said Foreign Office Spokesperson Zahid Hafeez Chuahdri.\nHe was responding to media queries regarding the Afghanistan Ministry of Foreign Affairs’ statement on the complaint of the daughter of Afghan Ambassador to Pakistan.\nThe Foreign Office Spokesperson said that “The Pakistan side facilitated the delegation’s visit to all areas which the complainant had independently visited on 16 July, including F-7, G-7, Rawalpindi, Daman-e-Koh, F-6 and F-9 Park.”\n“The delegation was informed that the technical data (geo-fencing) matched with the actual movement of complainant on the day contrary to statement of the complainant, which was further confirmed by the statements of the taxi drivers,” he added.\nHe further said that “On the basis of the complete investigation, the delegation was informed that the complaint did not corroborate the findings on the ground.”\n“The delegation was further requested to facilitate access to the complainant and the official of the Embassy and phone data, as already requested on 18 July 2021,” he added.\n“It is hoped that the Government of Afghanistan would cooperate in expeditious provision of the earlier requested information,” the Foreign Office Spokesperson stressed.",
  "retrievedAt": "2025-08-11T21:04:15.549Z"
}
