{
  "title": "Sherry Rehman welcomes UN resolution on two-state solution for Palestine",
  "author": null,
  "content": "ISLAMABAD, Sep 13 (APP): Pakistan People’s Party (PPP) Vice President and Senator Sherry Rehman has welcomed the adoption of the United Nations resolution supporting a two-state solution for Palestine, terming it a historic development and a defeat of Israel’s aggressive narrative.\nAccording to statement issued here on Saturday, Senator Rehman said that the history written with the blood of Palestinians was now being recognized at the global level. She noted that the overwhelming approval of the resolution with 142 votes underscored the international community’s rejection of Israel’s unilateral policies.\nRehman stressed that the Palestinian cause was fundamentally a human rights issue, and the UN resolution represented an important milestone in history. She warned that Israel’s obstinacy mounted to a blatant violation of international law, adding that Palestinians have made unforgettable sacrifices and now the world must stand with them.\n“The two-state solution is the only guarantee of lasting peace in the Middle East. Without it, sustainable peace will remain impossible,” she emphasized, urging Israel to respect global consensus. She further stated that Israel’s rejection of the resolution is an affront to the unanimous will of the international community.\nThe PPP senator maintained that the establishment of an independent Palestinian state is essential for regional peace and development, while accusing Israel of deliberately fueling instability in the Middle East. She reaffirmed Pakistan’s unwavering support for Palestine, describing solidarity with the oppressed as a cornerstone of the country’s foreign policy.\nCondemning Israel’s recent attack on Qatar, Rehman said it was a direct assault on Qatar’s mediation and peace efforts for a ceasefire in Gaza. “Israel cannot be allowed to overstep its limits. The international community must take decisive action,” she urged.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:52:22.249Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sherry-rehman-welcomes-un-resolution-on-two-state-solution-for-palestine/",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T14:51:00.000Z"
}
