{
  "article_id": "2025-05-25_d49bc70f67f31f82cdb31c4473fce7d1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-chairs-key-meeting-on-islamabads-administration/",
    "retrieved_at": "2025-08-27T15:52:49.868Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi chairs key meeting on Islamabad’s Administration",
    "author": null,
    "date_published": "2025-05-25T09:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 25 (APP): Federal Interior Minister Mohsin Naqvi chaired an important meeting in the capital, focusing on urban management, law enforcement, and administrative reforms. The meeting was attended by Islamabad's Chief Commissioner, Inspector General of Police, Deputy Commissioner, DIGs, SPs, ACs, Minister of State for Interior Talal Chaudhry, and the Federal Interior Secretary. A major decision was taken to launch an immediate crackdown against illegal constructions in Islamabad. Naqvi ordered strict action against unapproved housing structures and unauthorized housing societies, emphasizing a zero-tolerance policy. \"All relevant officers must ensure strict implementation of this policy,\" Naqvi said, directing the use of the Land Information and Management System (LIMS) and satellite mapping to prevent any illegal development. Naqvi stressed that providing world-class services to the residents of Islamabad must be the top priority. He urged the police and administration to improve their image through public trust and proactive service delivery. \"The safety of citizens' lives and property must not be compromised,\" he said, instructing SPs and ACs to perform their duties actively. He also called for new initiatives from officers to improve public convenience, promising full support for their implementation. \"This mission must be pursued with full commitment and national spirit,\" Naqvi added. The Interior Minister also directed effective price control of essential commodities and special cleanliness measures during Eid-ul-Azha.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}