{
  "title": "Payment process under Ehsaas Emergency Cash Program to start from Wednesday: Dr. Nishtar",
  "link": "https://www.app.com.pk/national/payment-process-under-ehsaas-emergency-cash-program-to-start-from-wednesday-dr-nishtar/",
  "date_published": "2020-04-05T06:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Sunday said that the payment process under Ehsaas Emergency Cash Programme would start from Wednesday to support the vulnerable segments of society, affected due to lockdown amid Coronavirus threat.\nAddressing a press conference here, Dr. Sania Nishtar said, the Ehsaas Emergency Cash Programme was launched to support the daily wagers and piece-rate workers after lockdown in the country due to the ongoing coronavirus crisis.\nThe programme will benefit the deserving people from all the four provinces, Azad Jammu and Kashmir and Gilgit Baltistan, through allocating quota as per census.\nPunjab will contribute Rs 700,000 and Sindh Rs 250,000 from their own budget in this programme, she said.\nUnder an aggressive communication campaign launched recently to benefit four million people, the deserving ones can send SMS to 8171 to check their eligibility status. They will be informed on how to collect money, if they are found eligible.\nIf they are not identified in the database, they will be directed to contact their respective district administration, she said.\nShe said there will be three types of responses to people’s SMS seeking cash assistance, which include eligible, ineligible, and contact to your respective district administration.\nShe said employees of provincial and federal governments were not eligible for the assistance. “Presently we have database of employees of provincial and federal governments, Railways, Pakistan Post, and BISP, while data of autonomous bodies will hopefully be available in next 24 hours,” she added.\nShe said an SMS response would have to go through the wealth profiling test before becoming eligible for the assistance.\nShe said existing Kafalat beneficiaries, who were getting regular cash transfer of 2000 rupees per month, would be given additional one thousand rupees; hence, they too would get a tranche of 12,000 rupees covering four months.\nShe said under this category 4.5 million people would be benefited.\nShe said higher eligibility or poverty threshold would be used to identify four million beneficiaries through the national socioeconomic databases, while another 3.5 million people would come from districts.\nRegarding mode of payments, Dr. Sania Nishtar said that deserving families would get cash assistance of 12,000 rupees after biometric verification through over 18,065 sale points or retail shops of Habib Bank Limited and Bank Al-Falah across Pakistan.\nShe said the provincial governments would be requested to provide open public spaces for setting up cash disbursement arrangements, security for these spaces, permission to keep retail POS agents open, management of crowds at cash disbursement points and ensuring preventive measures like facility of hand washing etc.\nThe assistance under Ehsaas Emergency Cash Programme would be provided on name of male member of the family, she said\nDr. Sania Nishtar expressed her gratitude to the department’s including National Database Registration Authority, Federal Board of Revenue, State Bank of Pakistan and others for providing their support to make this initiative a success.\nThe beneficiaries of this programme will be finalized through involving proper scrutinizing mechanisms like data analytics, wealth profiling, average monthly bills, travelling history etc.\nShe said the Ehsaas Emergency Cash Program will help 12 million families by providing them financial assistance of Rs. 12,000 per family and the total budget approved for this initiative is Rs. 144 billion.\nThe budget could be increased in the coming days depending on the rise in demand, she said.\nThis programme is one of the largest social safety net initiatives in the history of the country for disbursement of cash assistance among the needy at this critical time when social distancing measures are unavoidable.",
  "retrievedAt": "2025-08-11T19:03:12.908Z"
}
