{
  "title": "Corona protection: Citizens advised to prefer wearing homemade cloth mask",
  "link": "https://www.app.com.pk/national/corona-protection-citizens-advised-to-prefer-wearing-homemade-cloth-mask/",
  "date_published": "2020-04-05T01:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP):Citizens have been asked to prefer wearing homemade cloth face mask for protection from Coronavirus (COVID-19) in public to avoid the spread of the disease particularly in areas with high community transmission.\nAccording to senior Pharmaceutical Quality Sciences expert Dr Obaid Ali, surgical mask does not protect against airborne infectious agents so it will not prevent the wearer from being potentially contaminated by a virus such as the coronavirus.\nHe said that the wearing of surgical masks will only offer limited protection and should not be considered sufficient protection. He suggested additional preventative measures need to be adopted.\nHe said that surgical masks are disposable medical devices that must be disposed of in the appropriate manner after use. He added effective life of a surgical mask depends on the nature of contamination and series of external factors like air humidity, temperature, volume of air breathed in, etc.. He advised to avoid its usage for long time.\nHe said as N-95 masks are not easily available and much expensive also therefore citizens should use cloth mask rather simple surgical mask.\n“Making personally cloth mask at home is not only very simple but also necessary when there are issues in supplies of surgical masks and N-95 respirators.”\nHe added citizens should consider the importance of N-95 mask for health care workers and it should be reserved for them.\nDr Obaid, who has vast experience in manufacturing of biological drugs and vaccine, said that “If cloth masks are the only option available doctors should also use them. When doctors are facing not having personal protection equipment (PPE) kits, they should use whatever they can, and if it is homemade, it’s better than nothing.”\nHe said that every citizen should have six cloth masks and use each one just for one day and then place it on sunlight or any other safe place. He added after six days this mask should be washed to eliminate any residual flu particles, which may be contaminating the outside of the mask.\nHe added contaminated cloth mask needs six days to be disinfected so during this period washing the mask is useless effort. He asked the citizens to remove mask from face by taking the straps and avoid touching the material part of the mask.\nHe added in case of touching the mask front side, citizens should wash their hands with soap and water and it will be better to wash hands before and after touching the mask.\nHe said that the best way to protect from corona is to stay at home. “If moving outside home is necessary then citizens must have access to a cloth mask as it has the potential to help prevent from spreading and carrying the virus.”\nSenior pharmacist and President Pakistan Pharmacists Association, Islamabad, Ghulam Farid Khan said that during this unprecedented time, patients may seek other sources of care and information from pharmacists if local hospitals are closed or under quarantine.\nHe said that citizens should avoid close contact with people who appear unwell and who have fever and cough. He added they should cover their nose and mouth when coughing or sneezing, using a tissue when possible and disposing of it promptly.\nHe said that it is also important to wash hands frequently with soap and water to reduce the spread of the virus from hands to face or to other people and cleaning hard surfaces like door handles frequently using a normal cleaning product.\nHe said that if caring for someone with a flu-like illness, a mask may be worn to cover the nose and mouth to reduce the risk of transmission.",
  "retrievedAt": "2025-08-11T19:03:19.921Z"
}
