{
  "article_id": "2025-01-19_7953dc12d5e34f75181b9575c3380cf9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rawalpindis-auto-markets-from-sultan-ka-khoo-to-mithu-ka-ahata/",
    "retrieved_at": "2025-08-27T11:48:07.117Z"
  },
  "metadata": {
    "title": "Rawalpindi’s auto markets: from Sultan Ka Khoo to Mithu Ka Ahata",
    "author": null,
    "date_published": "2025-01-19T14:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 549,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 19 (APP):Rawalpindi is not only recognized as the twin city of Islamabad and home to the General Headquarters (GHQ) of the Pakistan Army but also as a hub for two of the region's most significant auto markets-Sultan Ka Khoo and Mithu Ka Ahata. Together, these markets cater to the diverse automotive needs of customers from across Pakistan. Sultan Ka Khoo, sprawling across Chaklala, Glass Factory, and Rawal Roads, boasts over 900 shops dealing in spare parts, body components, sound systems, decorative items, and tyres. The market is renowned for its extensive inventory of vehicle components, covering models from 1980 to 2014, and is a lifeline for customers from Rawalpindi, Islamabad, AJK, and beyond. Historically, Sultan Ka Khoo gained prominence in the 1980s during the Cold War era. Afghan nationals fleeing the Soviet invasion began smuggling used spare parts from Japan to Pakistan through Afghanistan. Traders like Gull Khan recall how containers from Afghanistan's Lahori Darwaza supplied smuggled goods, allowing the market to thrive. \"Back then, diesel was cheaper than petrol, and people often replaced petrol engines with diesel ones, creating a boom in our business,\" said Mohammad Bilal, also known as Ostad Billa. \"But now, times have changed with the rise of electric vehicles. The era of electric cars has arrived, and we are witnessing a shift in the automotive industry. Today, however, smuggling has largely ceased, with traders importing used parts directly from international markets such as Japan, China, and Malaysia. Amin Khan, a dealer, emphasized that Sultan Ka Khoo now contributes billions of rupees in taxes annually. \"The market offers everything from rearview mirrors to entire car bodies for models as recent as 2024,\" he said. Despite its legitimate operations, the market's reputation is marred by allegations of trading stolen or snatched vehicles, a claim that dealers vehemently deny. \"This is a wrong perception,\" said Raisat Ali. \"We only deal with vehicles destroyed in accidents from genuine owners.\" Located in the heart of Rawalpindi, Mithu Ka Ahata has carved a niche as the go-to destination for vehicle engines and mechanical components. Unlike Sultan Ka Khoo, which focuses on body parts, Mithu Ka Ahata specializes in high-quality, imported engines. Salman Khan, a seasoned trader, described Mithu Ka Ahata as the backbone of the city's automotive repair industry. \"Japanese engines are our best sellers due to their reliability, followed by those from Dubai and Australia,\" he said, adding that wholesalers like Abdullah Ji Traders and 'Aman Ullah and brothers' at Chungi No. 26 supply most of the inventory. The demand for popular engine models such as the Toyota 2 NZ1500cc 1NZ, Honda L15, and Honda L13 is particularly high in the market. According to Inayat, another dealer, Honda and Toyota engines, especially the 1300cc models and 18 Fc61800, are the most sought after by customers. \"We source engines from top markets like Japan and Dubai. Engines from Singapore, Malaysia, and South Korea are also commonly sold, but Japanese engines remain the top choice for durability,\" he said. Japanese engines are particularly prized for their durability, with prices ranging from PKR 200,000 to PKR 300,000 for second-hand units. Customers like Daud, who recently purchased a Japanese engine, appreciate the value for money. \"New parts are either unavailable or too expensive. Imported engines are the best option,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}