{
  "article_id": "2025-01-19_c95779f0c015f5b04f634b9b075f4315",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-announces-schedule-of-entry-test-for-admission-in-ms-mphil-phd-programs/",
    "retrieved_at": "2025-08-27T11:49:18.561Z"
  },
  "metadata": {
    "title": "AIOU announces schedule of entry test for admission in MS, MPhil, PhD programs",
    "author": null,
    "date_published": "2025-01-19T10:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 202,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 19 (APP):Allama Iqbal Open University (AIOU) has announced the schedule of entry tests for admissions into MS/MPhil and PhD programs. According to the schedule, the entry test for Faculty of Education will be held on February 24, the Faculty of Social Sciences on February 25, Faculty of Arabic and Islamic Studies on February 26, and Faculty of Sciences on February 27, 2025, said a press release. The entry tests will take place simultaneously at 9:00am at the university's main campus in Islamabad and regional centers in Gilgit-Baltistan, Multan, Karachi, and Quetta. Students can choose to appear at any center according to their convenience and preference. It is noteworthy that the deadline for submission of admission forms for these programs is February 17. Admission forms and prospectuses are available on the university's website, and applications can only be submitted online. Passing the entry test and succeeding in the interview are mandatory for securing admission to these programs. The University has also advertised admission to various BS programmes, which will be granted purely on merit basis, with no entry test or interview. Vice-Chancellor Professor Dr. Nasir Mahmood has issued special directives to ensure transparency and adherence to merit during the admission process.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}