{
  "article_id": "2025-01-19_359c396d16f151624cb4342d9078fabf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tangible-actions-imperative-to-curb-human-trafficking-governor-punjab/",
    "retrieved_at": "2025-08-27T11:48:06.452Z"
  },
  "metadata": {
    "title": "Tangible actions imperative to curb human trafficking, Governor Punjab",
    "author": null,
    "date_published": "2025-01-19T16:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 320,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 19 (APP):Governor Punjab, Sardar Saleem Haider Khan, on Sunday, called for strict action against the elements involved in human trafficking for its elimination and to promote a positive image of the country across the globe. The Governor made these remarks during a book launching ceremony at the National Press Club (NPC) \"Japan Kahani,\" written by renowned writer and journalist Amjad Siddiqui. Several notable dignitaries from different walks of life attended the ceremony. Governor said that the book written by Amjad Siddiqui highlighted the burning issue prevailing in the country which needed to be addressed through tangible actions. Sardar Saleem Haider Khan expressed deep concern over the alarming number of deaths of Pakistani citizens in the migrant boat accidents, which denounced the image of the country. He emphasised that the human trafficking issue should not be viewed solely through the lens of poverty, adding that an individual who can afford to pay 5 to 6 million rupees for illegal travel could invest that amount in establishing a legitimate business within the country, thus securing a stable and prosperous future. However, he lamented that the country's youth had lost confidence in the national system and stressed the importance of restoring that trust. The Governor emphasized that the country was blessed with abundant of natural resources, which, if utilized effectively, have the potential to transform the country's destiny. Pointing out the person within the institutions assisting human trafficking, he said, the connections of these human traffickers within the institutes needed to be identified and all those involved in the heinous crime should be brought before the law. To combat the root causes of human trafficking, Governor Khan suggested the inclusion of anti-trafficking content in school curriculums, alongside organizing seminars and discussions to raise awareness about the dangers and consequences of illegal migration. This, he argued, could help restore trust among the youth and guide them towards legitimate opportunities within the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}