{
  "article_id": "2025-01-19_90ae07b73875c55d1248975dd23ffa07",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nadras-clarifies-entry-of-resident-of-ajk-state-on-cnic/",
    "retrieved_at": "2025-08-27T11:48:06.566Z"
  },
  "metadata": {
    "title": "NADRA’s clarifies entry of “Resident of AJK State” on CNIC",
    "author": null,
    "date_published": "2025-01-19T17:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 263,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 19 (APP):As per the regulations and policies in force, NADRA imprints the phrase \"Resident of AJK State\" in black on Smart Computerized National Identity Cards (CNICs) and in red on regular CNICs. To include this designation on a CNIC, applicants are required to submit a valid State Subject Certificate (Class 1, 2, or 3) issued by the Government of Azad Jammu and Kashmir (AJK). Without this certificate, the residency status cannot be imprinted. Recently, rumors of changes in this policy have surfaced on social media. These rumors are baseless and are being spread with ulterior motives. Between December 2024 and January 2025 alone, NADRA has issued over 50,000 CNICs with the \"Resident of AJK State\" imprint. In a few specific cases, the absence of this imprint may be attributed to either: The applicant's failure to submit the required State Subject Certificate at the time of application, or Errors by the data entry operator during the CNIC processing. For applicants who submitted the required certificate but whose CNICs were affected by errors made by the data entry operator, NADRA has proactively contacted them and arranged for the free reissuance of their CNICs with the correct imprint. Applicants who did not initially submit the State Subject Certificate are requested to reapply, pay the relevant fees, and provide the necessary documentation to obtain a corrected CNIC. NADRA remains fully committed to fulfilling its legal responsibilities and ensures that identity documents are issued in compliance with prescribed regulations and policies. We are dedicated to serving citizens with efficiency, transparency, and the highest standards of professionalism.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}