{
  "title": "CORPORATE WINDOW: Homes on hold as steel prices rise - Newspaper - DAWN.COM",
  "author": null,
  "content": "Amid rosy economic indicators, like a three-decade low consumer price index (CPI) for March 2025 at 0.7 per cent, a drop in the interest rate to 12pc from 22pc, stability in rupee-dollar parity, a manageable current account deficit and rising remittances, consumers are still facing an uphill battle in purchasing a new or old house/apartment owing to unbearable prices as a result of high construction costs.\n\nThe government has taken no serious measures to control the cost of construction, while speculation in property prices has further tarnished buyers’ hopes.\n\nThe cost of construction has shown a mixed trend in the last two years due to the rise in cement prices and labour charges against low steel bar rates, but it could not fully encourage consumers to build their dream homes.\n\nA drop in cement sales by 6.6pc during 9MFY25 to 27.46 million tonnes justifies the stance of steel bar makers and market traders about dwindling construction activities.\n\n‘Becoming an owner of even a small house or an apartment is still highly difficult for many people due to high construction costs and shrinking consumer savings’\n\nDespite a lull in the real estate sector in the last two years, the national average price of a 50kg cement bag rose to Rs1,393 per bag from Rs1,126 two years back.\n\nIn February 2023, the price of good-quality steel bars allegedly witnessed a huge rise up to Rs350,000 per tonne, as per an Association of Builders and Developers of Pakistan (Abad) representative, forcing the builders to stop construction activities at 300 projects in Karachi, Sukkur and Hyderabad to protest against the steel bar price hike. However, the Pakistan Association of Large Steel Producers (PALSP) outrightly rejected the “irresponsible and misleading” statement by the Abad representative soon after, clarifying that steel bar prices were in fact Rs 280,000-305,000 per tonne.\n\nIn the current market situation, General Secretary of PALSP Syed Wajid Bukhari said the steel bar rate is now Rs240,000 per tonne as compared to Rs260,000 in March 2024. However, iron and steel dealer Shamoon Baqar Ali says the average quality steel bar is priced between Rs220,000- 230,000 per tonne, with branded bars costing Rs260,000 per tonne.\n\nMr Bukhari further said demand for steel bars remained depressed as price increases due to devaluation a year back had made it difficult for an average Pakistani to even think of constructing a house.\n\nOther reasons for slow steel bar demand were massive cuts in public sector development projects by the government and widespread closure of construction activities in the country. In this situation, the documented and compliant sector is closing. Those who evade taxes, mostly in the informal sector, and produce substandard steel are able to survive or even thrive.\n\n“Now the IMF [International Monetary Fund] is dictating the government to cut tariffs/regulatory duty on intermediate goods, which will prove the last nail if it bows out before the international lender,” Mr Bukhari fears. Steel bars hold a 40-45pc share of the total cost in high-rise projects and a 20-25pc share in housing projects.\n\nSome market analysts believe that 50-60pc of the total money sent by Pakistani expats lands in property alone, as people living abroad safeguard their foreign savings\n\nFormer Abad southern region chairman Suffiyan Adhia said steel bars should have dropped to Rs200,000 per tonne by now in view of rupee stability against the greenback for over a year. One dollar in the interbank market had swelled to Rs307 in September 2023, and it currently trades at Rs280.78, bringing down the landed cost of imported iron and steel scrap.\n\nSluggish demand for steel bars can be gauged from the decline in the import of iron and steel scrap, which slid to 1.7m tonnes ($762m) in 8MFY25 from 1.81m tonnes ($820m) in the same period last fiscal.\n\nAs per the Sensitive Price Indicator (SPI), the average daily wage rates of workers, such as painters, have increased to 1,683 from Rs1,432 two years ago. Another example is electricians, who now charge Rs268 per point compared to Rs227 two years back. Mr Adhia said that locally made tiles and sanitary fittings’ are in high demand after increased import duties.\n\nThat said, Mr Aadhia urged the government to call upon the stakeholders and formulate a policy for affordable housing for low- and middle-income group people. “Becoming an owner of even a small house or an apartment is still highly difficult for many people due to high construction costs and consumers’ shrinking savings.”\n\nPakistan requires over 12m houses amid soaring demand. The arrival of remittances plays a crucial role in propelling domestic activities like purchasing apartments, cars, and sacrificial animals on the eve of Eidul Azha and zakat distribution during Eidul Fitr. Some market analysts believe that 50-60pc of the total money sent by Pakistani expats lands in property alone, as people living abroad safeguard their foreign savings.\n\nPublished in Dawn, The Business and Finance Weekly, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc6ec4b22a9.gif",
  "retrievedAt": "2025-08-25T14:11:38.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904145",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T02:11:20.000Z"
}
