{
  "title": "Nationwide protests held against corporate farming, new canals - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Nationwide protests were held against corporate farming, construction of six canals, lack of wheat support price, and privatisation of Pakistan Agricultural Storage and Services Corporation on Sunday.\n\nThe protests were organised by the Pakistan Kissan Rabita Committee (PKRC) in 30 towns and cities, including Islamabad, Lahore, Bahawalpur, Rajanpur, Jhang, Kacha Khu (Khanewal), Bhakkar, Jatoi, Shikarpur, Larkana, Sukkur, Badin, Mardan, Dir, Malakand and Lakki Marwat.\n\nThe PKRC had launched a campaign against corporate far­ming, construction of controversial canals, and government’s refusal to fix a minimum support price for wheat.\n\nAddressing farmers in Kacha Khu, PKRC Secretary General Farooq Tariq said the government had leased out at least 1.7 million acres of agricultural land to corporate entities. The move was a blatant attempt to displace small farmers, dismantle local food systems, and prioritise profits over sustainability and social justice, he said.\n\nDemos were organised by Pakistan Kissan Rabita Committee in 30 towns\n\nMr Tariq demanded comprehensive agrarian reforms and legislation for land ownership rights, land regulation and redistribution within the framework of the UN Declaration on the Rights of Peasants and Other People Working in Rural Areas.\n\nPKRC women’s leader Riffat Maqsood called for ensuring a minimum support price (MSP) of Rs4,000 per 40kg for wheat, public stock holdings and procurement of grain. She said MSP protects farmers from unpredictable external forces, ensuring fair prices and competition.\n\nAnother protesting leader, Mahar Ghulam Abbas, said the farmers had protected their lands through peaceful resistance in Kot Addu, Arifwala, and Hasilpur, and this struggle would continue. He urged Maryam Nawaz to reinstate the committee formed by the PM on farmers’ issues.\n\nPresident of Pakistan Kissan Ittehad Zulfikar Awan said farmers should not be displaced, and notices issued to them be withdrawn. Any contractor or new allottees attempting to take over their land would face strong resistance, he cautioned.\n\nIn Bahawalpur, Razia Khan and Farooq Ahmad addressed a gathering, rejecting the government’s plan to dig six canals over the Indus River for corporate farming in Cholistan.\n\nSaiema Zia addressed a gathering at Shimla Hill in Lahore and Ali Khoso, leader of PKRC, Sindh chapter, addressed a protest in Shikarpur. Haidar Butt also spoke.\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/140948065f7da8d.jpg",
  "retrievedAt": "2025-08-25T14:11:50.019Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904129/nationwide-protests-held-against-corporate-farming-new-canals",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T01:47:45.000Z"
}
