{
  "title": "LHC says viral video of Kasur party raid ‘unacceptable in any society’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Lahore High Court’s (LHC) Justice Ali Zia Bajwa on Monday castigated the Kasur police over the circulation of a video showing people arrested at a dance party, noting that such an act was “unacceptable in any society”.\n\nKasur’s Mustafabad police raided a farmhouse near Pakki Havali village on April 4, arresting 30 men and 25 women over allegations of obscene dancing and the use of loudspeakers and drugs.\n\nHowever, the next day, a local court discharged the suspects from the case and ordered their release. Subsequently, Kasur District Police Officer (DPO) Essa Khan Sukhera suspended a total of five police officials involved in sharing a video of the suspects in custody.\n\nToday, Justice Bajwa resumed hearing a contempt petition filed by Vishal Shakir, a lawyer, against the Kasur DPO for violating earlier court orders prohibiting the filming of detainees.\n\nDuring the hearing, DPO Khan appeared before the court as per its April 11 order.\n\nThe judge then issued notices to three of the suspended cops — Station House Officer (SHO) Saqlain Bukhari, Sub-inspector Muhammad Sadiq and Constable Nadeem Nagi.\n\nIn December 2023, Justice Bajwa had restrained public functionaries from exposing under-trial/custody suspects to media coverage.\n\nA press release issued by the police had denied recording any video of the suspects or releasing it in an “official capacity”.\n\n“The video went viral; DPO sir, what did you do about this?” Justice Bajwa asked. “You asked how the police officer had the courage to pull the girl’s hair and make a video.”\n\nThe Kasur DPO responded: “This is a very unfortunate incident; the concerned police officers have been dismissed from their job.”\n\nHe went on to say that this was not a private event and had been advertised on social media.\n\n“What these police officers did is unacceptable in any society,” Justice Bajwa replied.\n\nHe further asked the DPO whether he can ensure that an incident like this will not occur again.\n\n“I took action within 48 hours of the incident and dismissed the officer; I assure you this will not happen again in my district,” the DPO said.\n\nHe said the concerned SHO was in touch with those who organised the dance party. “Before the raid, the SHO informed the party organisers.”\n\nJustice Bajwa asked the SHO not to appear before the court on the next date of hearing and send his superintendent of police instead.\n\n“Police spoil the prosecution of the case when they make TikTok videos of the suspects,” the Punjab prosecutor general told the court.\n\nJustice Bajwa directed that the Punjab advocate general should also appear before the court.\n\n“The advocate general should assist the court in finding out whether any country has a law about exposing the accused this way,” Justice Bajwa said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:11:36.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904174/lhc-says-viral-video-of-kasur-party-raid-unacceptable-in-any-society",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T09:51:57.000Z"
}
