{
  "title": "Bangladesh govt says process of model Meghna’s arrest was not proper - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Asif Nazrul, adviser to the Ministry of Law, Justice and Parliamentary Affairs, said on Sunday that the arrest of model Meghna Alam was not conducted in accordance with proper procedures.\n\n“There are some allegations against her; however, the arrest under the Special Powers Act was not carried out properly,” he said during a press briefing at the Secretariat.\n\nMeghna, winner of Miss Earth Bangladesh 2020, was arrested by police from her residence in Dhaka recently. Two days after her detention, she was sent to jail following the court proceedings. The court ordered a 30-day detention under the Special Powers Act.\n\nThe 30-year-old’s father, Badrul Alam, said her arrest followed a relationship with the then Saudi ambassador to Dhaka. “The ambassador and Meghna were in a relationship, and my daughter refused his marriage proposal because he already has a wife and children,” he said.\n\n“Her detention was approved by the Ministry of Home Affairs. A high-level meeting involving senior government officials has been held in this regard. We are aware of the comments made by various human rights activists concerning the incident. The police are currently investigating the matter,” Asif Nazrul said.\n\nAsked whether the Special Powers Act should be abolished, the adviser said, “There should be no repressive laws. We can easily repeal any law if we wish. However, there are political considerations. We don’t want to take such a hasty decision where a law is repealed today and political parties don’t support it tomorrow.”\n\nIn response to another question, Asif Nazrul said, “Speaking as an activist and taking responsibility as part of the government are not the same. As activists, we see things from one perspective, but in government, one must consider all aspects of an issue.”\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc67ae59d50.gif",
  "retrievedAt": "2025-10-12T02:31:55.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904123/bangladesh-govt-says-process-of-model-meghnas-arrest-was-not-proper",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T01:40:34.000Z"
}
