{
  "title": "UAE wants to support Syria reconstruction, says Al Nahyan - World - DAWN.COM",
  "author": null,
  "content": "DUBAI/DAMASCUS: The president of the United Arab Emirates said his country wants to support Syria’s reconstruction as he met on Sunday with interim President Ahmed al-Sharaa in Abu Dhabi.\n\nSheikh Mohamed bin Zayed Al Nahyan “affirmed the UAE’s keenness to support... Syria to confront the challenges of the transitional phase and rebuild Syria” during the meeting, the official Emirati news agency WAM reported.\n\nSharaa has sought Gulf financial support for war-devastated Syria since he led a lightning offensive that toppled longtime ruler Bashar al-Assad in December. But nearly a week after rebels toppled Assad, UAE presidential adviser Anwar Gargash said his government found the Islamist affiliation of Syria’s new rulers “quite worrying”.\n\nIn mid-January Sharaa spoke by phone with the UAE president about ways to reinforce ties and “ensure the stability and development of the region”, Syria’s state news agency SANA said at the time.\n\nPowerful armed faction integrates into govt forces\n\n“Syria’s stability and enhanced security are in the interest of the entire region,” the UAE president was quoted as saying on Sunday.\n\nHe added that the Gulf country would “spare no effort in providing all possible support to Syria and its brotherly people in the coming period”.\n\nOn its Telegram channel, SANA said Sharaa was travelling with Foreign Minister Asaad al-Shaibani to the UAE to hold talks on “numerous common issues”.\n\nAnalysts have said the UAE is deeply suspicious of Syria’s new leaders, reflec­ting its distrust of political Islam and fear of outsised Turkish influence in the war-scarred country.\n\nShaibani visited Abu Dhabi in January.\n\nAfter more than 13 years of conflict, Syria’s new rulers are seeking international support for reconstruction and reviving the sanctions-hit economy.\n\nEighth Brigade dissolved\n\nA powerful armed faction in southern Syria led by defected military officer Ahmed al-Awdeh on Sunday announced that it was dissolving itself and integrating into the government’s armed forces.\n\nThe Eighth Brigade, the most prominent armed faction in southern Syria, announced its dissolution and placed its weapons and personnel at the disposal of the Syrian defence ministry, according to a statement read by the official spokesman on Sunday in a video recording.\n\n“We, members, soldiers and officers of what was previously known as the Eighth Brigade, officially announce the dissolution of this formation and handing over all its military and human capacities to the defence ministry,” said Colonel Mohamed al-Hourani.\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc667a1e856.gif",
  "retrievedAt": "2025-10-12T02:31:48.998Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904118/uae-wants-to-support-syria-reconstruction-says-al-nahyan",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T01:34:25.000Z"
}
