{
  "title": "Nepra under fire over rigid appeal policy - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Nati­onal Electric Power Regu­latory Authority (Nepra) has come under criticism from within and outside for charging hefty fees to consumers for appeals and reviews of regulatory decisions.\n\nThis emerged after a strong dissenting note from Nepra Member (Tariff) representing Baloc­histan Mathar Niaz Rana for disallowing on technical grounds a review application from Karachi-based industrial consumers Muhammad Arif Bilwani against weaknesses in the matter of K-Electric’s power generation tariff.\n\nThe regulatory order issued on April 10 noted that Mr Bilwani was not a party in the matter of KE’s power generation tariff and did not pay about Rs1 million fee but paid only Rs1,000 as a common consumer and hence did not qualify to be entertained by the regulator.\n\nHowever, Mr Rana, in his dissenting note, reminded the regulator that Nepra had allowed similar requests and almost on similar grounds in the past, including to the federal government.\n\nHe said the Nepra Act, to safeguard consumer interests through transparency and impartiality, required the Nepra to provide an accessible and affordable mechanism for the public to challenge its decisions. “This promotes public participation and access to justice while maintaining fairness, privacy and the integrity of proceedings”. The member said Nepra’s legal team opposed the rev­iew motion on the grounds that Mr Arif was not a direct party to the proceedings under the regulations, but section 7(6) of the Nepra Act provided sufficient flexibility to allow broader public involvement. He strongly advocated allowing review motions from the general public through a minimal or no-cost process.\n\n“Procedural technicalities should not exclude public participation in matters affecting their rights. Instead, submissions should be evaluated on their merits and dismissed only on substantive grounds, if necessary,” he argued.\n\nAccording to the member, active public engagement through interventions and comments meant strengthening regulatory transparency and accountability.\n\nThe regulator was remi­nded that Energy and Power Solutions (Pvt) Limited’s intervention in the 600MW solar plant case in Muzaff­argarh was also entertained despite not being party to the original proceedings.\n\nMoreover, there were numerous precedents in Nepra where delays in filing reviews were condoned. He demanded that the previously prescribed fee of Rs1,000 for public review motions should be reinstated as it was unreasonable to charge half of the fee paid by a utility.\n\nAn energy sector analyst and a regular participant of the Nepra hearings, Rehan Javed, also supported Nepra member Mathar Rana and said it highlighted how regulatory procedures, originally meant to ensure fairness, could evolve to restrict public participation and burden consumers.\n\nHe said a review motion against Nepra’s decision was rejected on procedural grounds — specifically, not qualifying as a “party” and failing to pay a newly imposed 50pc fee of the original tariff petition instead of Rs1,000 only.\n\n“The change in fee structure, without sufficient flexibility, effectively excludes public oversight,” he said, adding that consumers lose the ability to challenge tariff hikes that directly impact their bills.\n\nMeanwhile, regulatory amendments favouring procedural rigidity benefit powerful stakeholders by shielding tariff decisions from broader scrutiny, he said.\n\nMr Javed said the Member (Tariff) Mathar Niaz Rana’s dissent underscored the risk of turning regulatory laws into tools that protect monopolies while transferring inefficiencies and losses onto the public. “This erodes accountability, increases electricity costs, and misuses public money through unjustified tariff approvals,” he said.\n\nThe regulator, in its majority decision, returned the review motion submitted by a consumer, Muhammad Arif, as non-maintainable, saying he did not qualify as a party to the proceedings of the determination in the matter of the KE tariff petition for its power generation plant. It said the petitioner also did not pay Rs934,722 fee along with Rs10,000 per day of delay in filing the application.\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:31:47.985Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904019/nepra-under-fire-over-rigid-appeal-policy",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:19:01.000Z"
}
