{
  "title": "SC hears pleas against judges transfer, serves notice to acting IHC CJ - Pakistan - DAWN.COM",
  "author": null,
  "content": "A five-member constitutional bench of the Supreme Court on Monday issued notices to the Islamabad High Court (IHC) acting chief justice and its two other judges as it took up pleas against their recent transfer to the court and the subsequent changes in the seniority list.\n\nThe bench — headed by Justice Muhammad Ali Mazhar and comprising Justices Naeem Akhtar Afghan, Shahid Bilal Hassan, Salahuddin Panhwar, and Shakeel Ahmed — took up petitions filed by five IHC judges, the Karachi Bar Association (KBA) and the IHC Bar Association, among others.\n\nIn February, Justice Sardar Mohammad Sarfraz Dogar from the Lahore High Court (LHC), Justice Khadim Hussain Soomro from the Sindh High Court (SHC) and Justice Muham­mad Asif from the Balochistan High Court (BHC) were transferred to the IHC.\n\nThe controversy centres around the alteration of the judges’ seniority list after these transfers as Justice Dogar was made the senior puisne judge, which paved the way for his appointment as the acting IHC CJ after Justice Aamer Farooq’s elevation to the SC.\n\nToday, the five-member bench took up a set of petitions over the matter.\n\nAttorney General for Pakistan (AGP) Mansoor Usman Awan appeared before the court to represent the government, while Idrees Ashraf was present as the lawyer for ex-premier Imran Khan and Raja Muqsit.\n\nEx-AGP Munir A. Malik and former SHC Bar Association president Barrister Salahuddin Ahmed appeared to plead the case on behalf of the IHC judges. Faisal Siddiqui attended the hearing as the KBA counsel, while Hamid Khan was present as the Lahore Bar Association’s (LBA) lawyer.\n\nThe bench served notices to the three transferred judges — namely IHC acting CJ Dogar, as well as justices Soomro and Asif. It also issued notices to the registrars of the IHC and the other three high courts from where judges were transferred.\n\nHowever, the bench rejected the petitioners’ request to restrain the transferred judges from performing their duties.\n\nA notice was also issued to AGP Awan. Subsequently, the hearing was adjourned till April 17 (Thursday).\n\nPresident Asif Ali Zardari on February 1 had approved the transfer of one judge each from the high courts of Lahore, Balochistan and Sindh to the IHC, despite opposition from five of its judges. They had warned in a letter to top judges that any such move would “violate constitutional procedures and judicial norms”.\n\nThe five IHC judges — Justices Mohsin Akhtar Kayani, Tariq Mehmood Jahangiri, Babar Sattar, Sardar Ejaz Ishaq Khan, and Saman Rafat Imtiaz — sought a court declaration that judges transferred to their court cannot be considered its permanent members until they take oath under Article 194 of the Constitution.\n\nThey also challenged the seniority list considered by the Judicial Commission of Pakistan (JCP) on Feb 10, arguing that it “wrongfully” included the transferred judges, leading to improper recommendations for elevation to the SC.\n\nThe petitioners demanded that the Feb 12 notification issued for the appointment of Justice Dogar as the IHC acting chief justice be set aside, asserting that he was “ineligible under constitutional provisions”.\n\nThe transfers were also opposed by various lawyers’ bodies in the federal capital and Karachi. In Punjab, there was a clear split in the stances of two lawyers’ groups, with some of their members seen as having certain political alignments.\n\nAt the outset of the hearing, Justice Mazhar stated that the bench was hearing seven petitions pertaining to the matter.\n\nNoting that judges were among the petitioners, Justice Mazhar suggested their arguments first: “Why not hear the judge’s petition first?”\n\nHere, Ashraf came to the rostrum and said he was representing Imran and Muqsit, at which Justice Mazhar observed that it would be more appropriate to hear the judges’ petition first.\n\n“Even according to the rules, senior lawyers should be heard first,” the judge said, following which lawyers Malik and Ahmed came to the rostrum.\n\nJustice Mazhar then observed that two important points were being considered in the case — “judges were transferred and what their seniority would be”.\n\nHe stated that the seniority rules for Civil Service employees would not be applicable in this matter. “It is to be determined whether or not the previous seniority at the high court will be followed. The second question is whether the seniority will begin from the new high court following the transfer.\n\n“Is your objection on the transfers or the change in seniority?” the judge asked, to which Malik replied that his client’s objection was to both developments.\n\nJustice Mazhar then noted that the transfers were made under Article 200 (transfer of high court judges) of the Constitution, adding that the consent of the transferred judge, the chief justices of the two high courts and the CJP were needed.\n\nMalik contended that the judges’ transfer can only be “temporarily”, at which the judge pointed out that the Constitution would have stated so if that was the case.\n\n“The Constitution only says that the president of Pakistan can make the transfer,” Justice Mazhar said, to which Malik replied that the president did not have “unrestricted authority” to move judges between courts.\n\nHe argued that Article 200 of the Constitution would have to be read with Article 175A (appointment of judges) and that “all judges should be treated equally according to the Constitution”.\n\nJustice Mazhar remarked that the president had the power to transfer judges and while questions could be raised if the transfers came with additional privileges, such a move made on the request of the CJP was as per the Constitution.\n\nDuring the hearing, Justice Afghan raised several questions over the matter of transfers.\n\nNoting that the IHC was established under an Act, the Islamabad High Court Act 2010, he wondered if the legisation had the “scope for bringing judges by transferring them”. Malik responded that the Act did not have the scope for bringing judges from other courts but rather only mentioned appointing new ones.\n\nJustice Afghan then asked: “If there were vacant slots [at the IHC], then why were new judges from those provinces not appointed instead of transfers? Is it mentioned in the oath that which high court it is being sworn for?”\n\nMalik replied that the province is mentioned in the “oath’s draft”, adding that Islamabad Capital Territory is stated in the oath for IHC.\n\nAt this, Justice Mazhar pointed out that judges take oath the first time when becoming an acting judge and then again when appointed for the term.\n\n“Our seniority is counted from the oath we take as an acting judge. What is to be determined is that won’t the seniority be considered from the previous oath even when it is taken again?” the judge said.\n\nHe observed that if seniority was to be counted from the second oath, a judge’s service would be reduced to zero.\n\nAt one point during the hearing, Justice Mazhar noted that the petition did not request that the transferred judges be barred from continuing their duties. KBA lawyer Siddiqui then came to the rostrum and said that his client’s petition had made that request. However, the bench rejected that plea.\n\nAGP Awan raised an objection to the petition being maintainable, saying that it was not admissible under Article 184(3) (SC’s original jurisdiction) of the Constitution.\n\nAt this, the bench observed that it was yet to be determined whether the plea was admissible or not.\n\nWhile dictating the order for today’s hearing, Justice Mazhar noted that Malik had called for regulating powers given under Article 200. He added that the bench was told there should be “logical reasons” stated in the notification for a judge’s transfer.\n\nIt was further argued before the bench that if a judge accepts their transfer to another court, they should also take an oath for that high court and the transfer should be for a limited period, Justice Mazhar stated.\n\nDictating the order, Justice Mazhar quoted Siddiqui as calling for a provisional seniority list of the high court where a judge was transferred to.\n\nMeanwhile, Imran’s lawyer Ashraf asked for the full record of transfers. At this, Justice Mazhar remarked, “Have you assumed the Supreme Court’s constitutional bench as a civil court? Is the record of transfers attached in the petitions incorrect?”\n\nAt one point, LBA counsel Hamid requested the court that his arguments also be included in today’s court order.\n\nReferring to a March 2024 letter by six IHC judges wherein they accused the country’s intelligence apparatus of interference in judicial affairs, Hamid said: “Five of those six judges are those who have approached you (the court).”\n\nJustice Mazhar responded: “We are unable to understand your arguments. Do you want us to hear the matter of the six judges’ letter along with this case? What connection does this case have with that letter?”\n\nHamid then replied that he had the right to answer this question at an “appropriate time”.\n\nMalik, noting that a JCP meeting was scheduled for April 18 (Friday), requested the court to fix the next hearing before that. Subsequently, the hearing was adjourned till April 17 (Thursday).\n\nAs Justice Dogar was made the IHC senior puisne judge following his transfer there from the LHC, his name had been sent to the JCP for consideration for elevation to the SC.\n\nDays before Justice Dogar’s name was added, five judges of the IHC approached Chief Justice of Pakistan Yahya Afridi and then-IHC chief justice Aamer Farooq to reclaim their seniority.\n\nAccording to the representation submitted by the judges, a judge takes an oath for the high court in which they are appointed. It further emphasised that according to the constitutional intent, a judge must take a fresh oath when transferred to another high court.\n\nBased on this principle, the seniority of a judge transferred to another high court should be determined from the date of their new oath.\n\nFour SC judges — senior puisne judge Justice Syed Mansoor Ali Shah, Justice Munib Akhtar, Justice Ayesha A Malik and Justice Athar Minallah — had also raised similar concerns, saying the induction of judges who were beneficiaries of the 26th Amendment would weigh heavily on faltering public trust enjoyed by the institution.\n\nThe opposition PTI had also opposed the JCP meeting, contending that if such transfers resulted in a change of seniority, they may have a serious impact on the comity of judges.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/14150103d593b70.png",
  "retrievedAt": "2025-08-25T14:11:35.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904178/sc-hears-pleas-against-judges-transfer-serves-notice-to-acting-ihc-cj",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T09:32:59.000Z"
}
