{
  "title": "Sean ‘Diddy’ Combs arrives in court to face expanded sex trafficking charges - World - DAWN.COM",
  "author": null,
  "content": "Sean ‘Diddy’ Combs arrived in court on Monday to be arraigned on an expanded federal indictment charging the hip-hop mogul with five criminal counts, including racketeering and sex trafficking.\n\nCombs, 55, was due to enter his plea to the new charges at a hearing before US District Judge Arun Subramanian in Manhattan. He had previously pleaded not guilty to an earlier three-count indictment.\n\nCombs, sporting grey hair and wearing a tan prison suit, smiled and took a sip from a water bottle as he sat down at the defence table before the hearing began.\n\nIn a statement earlier this month provided by Combs’ media representatives, his lawyers said, “These are not new allegations or new accusers. These are the same individuals, former long-term girlfriends, who were involved in consensual relationships.”\n\nJury selection for Combs’ trial remains scheduled for May 5, with opening statements due to begin on May 12.\n\nProsecutors with the Manhattan US Attorney’s office say Combs used his business empire to sexually abuse women between 2004 and 2024.\n\nThe alleged abuse included having women take part in recorded sexual performances called ‘freak offs’ with male sex workers, who were sometimes transported across state lines.\n\nCombs has been jailed in Brooklyn since September. He also faces dozens of civil lawsuits by women and men who accused him of sexual abuse.\n\nCombs’ legal team has forcefully denied that he did anything wrong.\n\nMarc Agnifilo, one of Combs’ lawyers, has said Combs never forced anyone to engage in sexual acts against their will, and that the freak-offs were consensual sexual activity.\n\nAlso known during his career as Puff Daddy and P Diddy, Combs founded Bad Boy Records and is credited with helping turn rappers and R&B singers such as Mary J Blige, Faith Evans, Notorious BIG and Usher into stars in the 1990s and 2000s.\n\nBut prosecutors have said his success concealed a dark side, citing incidents, including in March 2016 when Combs was captured on a surveillance video kicking, dragging and throwing a vase at a woman trying to leave a Los Angeles hotel.\n\nCNN last year broadcast a surveillance video showing Combs striking and dragging his former girlfriend Casandra Ventura, an R&B singer known as Cassie.\n\nCombs apologised following the broadcast. Agnifilo has said the video was not evidence of sex trafficking, and that Combs and Ventura had “a toxic, loving 11-year relationship”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/142336274c1d2f6.jpg",
  "retrievedAt": "2025-08-25T14:11:31.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904234/sean-diddy-combs-arrives-in-court-to-face-expanded-sex-trafficking-charges",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T18:52:04.000Z"
}
