{
  "title": "PM Shehbaz regrets persistent use of Afghan soil by terrorists - Pakistan - DAWN.COM",
  "author": null,
  "content": "LONDON: Prime Minister Shehbaz Sharif has expressed regret over the continued use of Afghan soil by terrorist groups to carry out attacks inside Pakistan, calling it a “painful reality”.\n\nSpeaking to reporters outside Avenfield apartments, where he met PML-N President Nawaz Sharif, the PM stressed the need for peaceful relations between Pakistan and Afghanistan. Deputy PM Ishaq Dar was also present during the visit.\n\nSharing concerns over attacks, PM Shehbaz said, “We have repeatedly urged the Afghan interim government to ensure its territory is not used, in line with the Doha agreement, against Pakistan or its interests. Unfortunately, terrorist outfits such as TTP and other groups continue to operate from Afghan soil, taking innocent lives in Pakistan.”\n\nAsking Kabul to take action and restrain these elements, the PM said Afghanistan was “our brotherly nation” and as neighbours, it is essential for both nations to “coexist peacefully and harmoniously”.\n\nThe premier also reflected on his visit to Belarus, describing his talks with the Belarusian leadership as fruitful.\n\n“We explored several avenues for cooperation, especially in agriculture, where Belarus possesses significant expertise. Pakis­tan, blessed with vast mineral wealth, can also benefit from Belarusian machinery,” he said.\n\n“During the visit, we toured a factory, and an understanding was reached which could see around 150,000 skilled Pakistani workers secure employment opportunities in Belarus,” the PM said.\n\nHe said, “We’ve steered Pakistan away from the brink of economic default, and the prayers of the people have played a key role in this journey.”\n\nPM Shehbaz, along with Deputy PM Ishaq Dar, is scheduled to return to Pakistan from London on Monday.\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/141102048c077c6.png",
  "retrievedAt": "2025-10-12T02:31:38.360Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904015/pm-shehbaz-regrets-persistent-use-of-afghan-soil-by-terrorists",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:19:18.000Z"
}
