{
  "title": "Agriculture: Wheat woes and policy failure - Newspaper - DAWN.COM",
  "author": null,
  "content": "This wheat season has turned out even more punishing for farmers than the last. Buyers are scarce, and market prices have plunged to around Rs2,200-2,300 per maund — far below production costs and nearly half the support price announced for the two crops of 2023 and 2024. Even more concerning, Punjab’s harvest — accounting for nearly 75 per cent of national production — has yet to peak. It’s a bitter reversal of the optimism generated by the Punjab Chief Minister’s grand promises during the sowing season.\n\nLast year, despite Punjab’s exit from procurement, the federal government — along with Sindh, Khyber Pakhtunkhwa, and Balochistan — collectively procured around three million tonnes of wheat. This intervention provided some cushion to prices. This year, the situation has deteriorated right at the beginning of crop harvesting. In a rush to comply with International Monetary Fund (IMF) conditions, both federal and provincial governments abruptly withdrew from procurement — without a clear strategy or transition plan. This has resulted in a policy failure at multiple levels.\n\nFirst, in previous years, the government used to procure around 5-7m tonnes — nearly half of the marketable surplus left after meeting the consumption needs of farming households and rural communities. The government’s sudden withdrawal has developed a vacuum in the market.\n\nIt neither introduced any alternative market-based procurement mechanism nor facilitated large private players — millers and stockists — who could absorb the marketable surplus amounting to a staggering Rs400 billion. A phased exit could have provided time to strengthen private sector storage capacity and improve farmers’ ability to hold stocks longer.\n\nA sustainable approach to protect wheat farmers would be to empower them by expanding their access to agricultural input financing and improving their grain storage capacity\n\nSecond, previously, in addition to the government, buyers included flour mills, chakkis, urban households, small-scale stockists, and feed mills (who buy only when prices fall below their preferred threshold). Larger stockists largely stayed away, as government policy equated wheat storage with hoarding. In the evolving scenario, with the government out of the market, flour mills and private stockists would emerge as two primary buyers.\n\nSince government buffer stocks would no longer be available to flour mills, millers now face a strategic choice: either build year-long inventories upfront or stagger their procurement throughout the year. This decision hinges on factors like interest rates of inventory financing, storage availability and cost, and expected storage losses — estimated between 2pc and 4pc.\n\nLikewise, private stockists also factor in storage costs, losses, labour and transportation charges, and most critically, the opportunity cost of money. Considering all these cost elements, stockists and millers typically expect at least a 25-30pc price spread between the harvest window and the off-season months to justify holding stocks.\n\nOn the other hand, if the government tries to control wheat prices through administrative measures, as Punjab did last year, it will eliminate the margins (price spread) needed to incentivise private players to store wheat — resulting in a vacuum of buyers, especially during the critical harvest months.\n\nThat’s precisely what we are witnessing today. Due to the government’s ambiguous and inconsistent approach to regulating the wheat market, flour mills are purchasing wheat only for daily grinding and not for building inventories, while stockists have yet to step in. As a result, buying volumes remain far too low to absorb the market surplus.\n\nThird, before exiting wheat procurement, the government overlooked the fate of its carryover stocks — originally procured at Rs3,900 per maund — which now cost over Rs5,000 per maund. The depressed market prices caused the government to incur heavy losses on its old stocks. Moreover, just days before the arrival of the new crop, the Punjab cabinet approved the release of 1.2m tonnes of wheat (in late March 2025), which further dampened the demand for the new crop.\n\nThe cumulative effect of these policy missteps has brought the wheat market to the brink of collapse. In the absence of a well-thought-out strategy, relying on millers and large stockists who have deep pockets and are capable of manipulating the market is risky.\n\nInstead of fostering rent-seeking behaviour, a far more sustainable approach would be to empower farmers by expanding their access to agricultural input financing and improving their grain storage capacity. This would enable them to hold their crop a few months longer, avoiding distress sales at harvest.\n\nIronically, the Kissan Card — introduced to strengthen agricultural credit — has inadvertently become a financial trap. Farmers, who used the card to purchase inputs for the Rabi crop, are required to repay their loan by 30th April — precisely when wheat is harvested. With no breathing room, farmers are compelled to sell their produce at throwaway prices.\n\nA more effective approach would be to extend the loan tenor of the Kissan card from six to twelve months, pushing repayment to October — after farmers have realised revenue from both the wheat and Kharif crops.\n\nAdditionally, raising the credit ceiling from Rs150,000 to Rs300,000 — split evenly between Rabi and Kharif — would also enhance farmers’ financial flexibility. These modest adjustments could reduce distress sales, ease post-harvest supply pressure, and support price stability — particularly in the absence of any government price or market intervention.\n\nKhalid Wattoo is a farmer and a development professional, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad.\n\nPublished in Dawn, The Business and Finance Weekly, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fbd51433b85.jpg",
  "retrievedAt": "2025-10-12T02:32:05.497Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903989",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:27:11.000Z"
}
