{
  "title": "Pakistan seeks justice for labourers slain in Iran - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Foreign Office says it expects ‘full cooperation’ in investigation; Tehran vows assistance, calls for collective international efforts to curb terrorism\n• Four members of the same family, father-son duo among the deceased; victims’ families call for swift repatriation of bodies, compensation after loss of their breadwinners\n\nISLAMABAD: After Prime Minister Shehbaz Sharif called on Tehran to ensure justice for the deaths of eight of its nationals in Iran’s province of Sistan-Baluchestan, Islamabad on Sunday sought Iran’s full cooperation to investigate the “inhumane and cowardly” killings.\n\nThe eight men, who worked as motor mechanics in Mehrestan county (approx. 230km from the Pakistan-Iran border) were tied up and killed execution-style by unidentified attackers a day earlier.\n\nAmong the slain were a father and son duo, as well as four members of the same family. Most of them hailed from small towns in the Bahawalpur district of south Punjab.\n\nIn a statement, the Iranian embassy in Islamabad expressed deep sorrow over the tragic incident and pledged full cooperation in the investigation.\n\nAs news of their death spread in their native towns, mourners thron­ged the homes of the slain men to comfort their grieving families.\n\nAccording to the Associated Press of Pakistan, Khanqah Sharif-residents Dilshad and his son Danish operated the motor workshop and had recruited a number of other mechanics from his area to work there.\n\nThe men included Jaffer, Nasir, Naeem and Aamir from Khanqah Sharif, as well as Muhammad Khalid of Dera Nawab Sahib and Muhammad Jamshed of Chakki More in Ahmedpur East.\n\nThe families of the victims called on the government to ensure the swift repatriation of the mortal remains of their loved ones, so they could be laid to rest in their native areas.\n\nThey also sought compensation from the Pakistan government, saying that they were already living below the poverty line and the loss of their primary breadwinners — who had gone to Iran to earn their livelihoods — would leave them hand-to-mouth.\n\nShared commitment against terrorism\n\nStatements issued from Tehran and Islamabad in the wake of the incident reflected a shared resolve to fight against terrorism.\n\nThe scourge of terrorism could prove destructive for all countries in the region, PM Shehbaz noted in his condolence message, adding that all nations should come together to develop a fool-proof strategy to deal with this menace.\n\nHe called on the Iranian government to immediately arrest those responsible and award them exemplary punishment, as well as bringing to light the motives behind this heinous act.\n\nThe prime minister also instructed the Foreign Office to contact the victims’ families and arrange for the swift return of their bodies.\n\nIn its statement on Sunday, the Foreign Office noted that Pakistan’s embassy in Tehran and the consulate in Zahedan were in constant touch with Iranian authorities for a comprehensive investigation “to ensure that perpetrators are brought to justice as well as for prompt repatriation of the victims’ remains to Pakistan”.\n\n“Further updates will be provided as soon as additional details regarding the identification of dead bodies and the circumstances leading to their tragic deaths become available,” the statement said.\n\nSeparately, in a post on X, Pakistan’s Ambassador to Iran Muhammad Mudassir Tipu they were in touch with authorities in Iran to carry out a swift investigation and bring the perpetrators to justice.\n\n“Iran has assured of its utmost cooperation,” Mr Tipu said.\n\nWhile assuring Pakistan of full cooperation, Tehran also called for collective international efforts to curb terrorism.\n\n“Terrorism is a chronic plight and a common threat throughout the region by which the traitorous elements, in collaboration with international terrorism, target security and stability throughout the region,” Iran’s ambassador to Pakistan Reza Moghadam wrote on X (formerly Twitter).\n\nThe statement underscored the need for collective action, calling on all regional countries to intensify joint efforts to eradicate terrorism and extremism\n\n“Combating this ominous phenomenon requires collective and joint efforts by all countries to eradicate all forms of terrorism and extremism that have claimed the lives of thousands of innocent people in recent decades,” Mr Moghadam stressed.\n\nMultiple claims\n\nWhile a spokesperson for the banned Balochistan National (or Nationalist) Army had claimed responsibility for the killing, the AFP news agency reported that the Jaish al Adl — formerly known as Jundullah — had also owned the attack.\n\nThis was the second such incident in Sistan-Baluchestan in recent years, as nine Pakistani workers hailing from Punjab were gunned down by unidentified attackers on Jan 27, 2024 in the province.\n\nThe same month, Pakistan conducted retaliatory strikes on terrorist hideouts in Sistan-Baluchestan after Iran launched attacks on the border town of Panjgur.\n\nBalochistan, which borders Sistan-Baluchestan, has witnessed a spate of attacks targeting those hailing from Punjab in recent months.\n\nIn late March, five passengers were gunned down in a firing incident in the Kalmat area of Balochistan’s Gwadar district, with officials saying at least four of them belonged to Punjab.\n\nDays earlier, four labourers from Punjab were shot dead by unknown assailants in the Kalat district.\n\nIn February, seven Punjab-bound passengers were offloaded from a bus and shot dead in the province’s Barkhan district.\n\nMajeed Gill in Bahawalpur also contributed to this report\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc43762c45b.jpg",
  "retrievedAt": "2025-10-12T02:32:21.237Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904022/pakistan-seeks-justice-for-labourers-slain-in-iran",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:18:40.000Z"
}
