{
  "title": "White House’s doctor finds Trump in ‘excellent health’ - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Dona­ld Trump is in “excellent health,” a White House doctor’s assessment said on Sunday, after he underwent his first annual medical checkup since returning to the US presidency.\n\nRepublican Trump, 78, has repeatedly boasted about his own vigor since starting a second term, while mocking his 82-year-old Democratic predecessor Joe Biden as decrepit and mentally unfit for office.\n\n“President Trump exhibits excellent cognitive and physical health and is fully fit to execute the duties of the Commander-in-Chief and Head of State,” read a physician’s letter shared by the White House.\n\nIt noted a few abnormalities that included minor sun damage to Trump’s skin, as well as scarring on his right ear from a gunshot wound suffered in an assassination attempt last July.\n\nThe US president is taking four medications: two for cholesterol control, aspirin for cardiac prevention and a steroid skin cream\n\nA colonoscopy revealed last year that Trump had diverticulosis — small pouches in the colon — and a benign polyp, the report said, adding that a follow-up exam was recommended in three years.\n\nIt said Trump is taking four medications: two for cholesterol control, aspirin for cardiac prevention, and a steroid skin cream.\n\nThe report overall was complimentary of Trump’s health, praising his “active lifestyle” and citing his “frequent victories in golf events” — a common boast of the billionaire who also abstains from alcohol and cigarettes.\n\nHe is known, however, to indulge in fast food and famously enjoys well-done steaks — although he appears noticeably thinner than during his first term.\n\nThe latest report put his current weight at 224 pounds (101.6 kilograms), down from 243 in 2019. Trump had said he felt “in very good shape” after his exam earlier that day at the Walter Reed military hospital in the Washington suburbs.\n\n“I took a cognitive test. I don’t know what to tell you other than I got every answer right,” he told reporters aboard Air Force One.\n\nOutlandish health claims\n\nTrump has been accused of a lack of openness about his health despite huge interest in the well-being of Ameri­ca’s commander-in-chief. The White House said previously that presidential physician Sean Barbabella would give a readout of the physical and that “of course” it would provide the full report.\n\nBut Trump’s personal and White House doctors have at times made outlandish claims about his health. In 2015, during Trump’s first presidential run, his doctor Harold Bornstein released a letter saying the tycoon “unequivocally, will be the healthiest individual ever elected to the presidency.” Bornstein later told CNN that Trump himself “dictated that whole letter.\n\nI didn’t write that letter.”\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc6671618eb.gif",
  "retrievedAt": "2025-08-25T14:11:51.955Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904119/white-houses-doctor-finds-trump-in-excellent-health",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T01:35:48.000Z"
}
