{
  "title": "Ritu leads Bangladesh to second win in Women’s World Cup Qualifier - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Ritu Moni sealed a stunning two-wicket victory for Bangladesh over Ireland in the ICC Women’s Cricket World Cup Qualifier match here on Sunday. This means Bangladesh now have two wins from two, while Ireland have been on the wrong end of three narrow defeats.\n\nOrla Prendergast’s all-round performance looked set to hand Ireland a first win of the tournament, but an unbroken 54-run stand for the ninth wicket saw Bangladesh chase down a target of 236.\n\nPrendergast scored a valuable 41 as Ireland made 235 for eight batting first, before taking two wickets in her first three overs to derail the Bangladesh chase.\n\nHowever, Bangladesh never panicked in their chase, and after skipper Nigar Sultana Joty made a half-century, they were seen home by a brilliant 67 off 61 from Ritu, who clinched the win with a six in the penultimate over.\n\nHaving lost their first two matches, Ireland needed to triumph in this one, and chose to bat first after winning the toss.\n\nSarah Forbes was run out for four in the fourth over, but Gaby Lewis (24) and the in-form Amy Hunter (33) responded with a 50-run stand.\n\nThe skipper succumbed, caught and bowled by Jannatul Ferdus before Hunter was the second run-out victim of the innings, leaving Ireland on 77 for three.\n\nThat brought Prendergast and Laura Delany together, with the duo adding 72 in 16 overs to set the platform.\n\nPrendergast was trapped in front by Rabeya Khan before Delany fell for 63, stumped by Nigar Sultana Joty off the bowling of Fahima Khatun.\n\nRabeya bowled Leah Paul for 19 before having Christina Coulter Reilly caught behind for 10 to finish with impressive figures of three for 39.\n\nA handy, unbeaten 24 from Arlene Kelly helped Ireland to 235 for eight from their 50 overs.\n\nBangladesh’s reply got off to the worst possible start, Fargana Hoque falling to Prendergast (2-14) off the third ball of the innings, with opening partner Ishma Tanjim joining her soon after to leave them two for two.\n\nSharmin Akhter and Nigar started to rebuild, putting on a half-century before Sharmin was dismissed leg before for 24. Nigar brought up her own fifty, but she and Sobhana Mostary fell in quick succession to leave Bangladesh 94-5.\n\nFahima (28) helped keep Bangladesh in the hunt alongside Ritu Moni, but when she departed, followed by Jannatul (19) and Rabeya (five), they looked to be out of it.\n\nFrom 186 for eight however, Ritu and Nahida Akter (18 not out) paced their partnership perfectly, with Ritu sealing the win with a six leaving eight balls still remaining.\n\nSCOTLAND DOWN THAILAND\n\nIn the first game of the day, Kathryn Bryce produced a captain’s knock before Rachel Slater’s miserly bowling helped Scotland to a 58-run win over Thailand.\n\nBryce made an important 60 for Scotland before Megan McColl’s 57 helped them to 206 all out from 41 overs. Slater then made important breakthroughs at the top of the innings in reply, finishing with figures of three for nine from her six overs.\n\nDespite an opening stand of 41, Thailand could not maintain the pressure on the Scots, despite 63 from Natthakan Chantham. As well as Slater, Abtaha Maqsood (3-26) and Katherine Fraser (3-28) also picked up three wickets to wrap up a second win from three games.\n\nScores in brief:\n\nScotland beat Thailand by 58 runs\n\nSCOTLAND 206 in 41 overs (K. Bryce 60, M. McColl; T. Putthawong 3-28, O. Kamchomphu 3-34); THAILAND 148 in 31.3 overs (N. Chantham 63, N. Boochatham 20; R. Slater 3-9, A. Maqsood 3-26)\n\nBangladesh beat Ireland by two wickets\n\nIRELAND 235-8 in 50 overs (L. Delany 63, O. Prendergast 41; Rabeya Khan 3-39, Fahima Khatun 2-50); BANGLADESH 240-8 in 48.4 overs (Ritu Moni 67 not out, Nigar Sultana 51; O. Prendergast 2-14, A. Kelly 2-53).\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc620019dd3.gif",
  "retrievedAt": "2025-10-12T02:31:51.024Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904105/ritu-leads-bangladesh-to-second-win-in-womens-world-cup-qualifier",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T01:16:47.000Z"
}
