{
  "title": "Bolan Mail stopped in Jacobabad over security concerns - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Quetta-bound Bolan Mail (3UP) train was stopped at Jacobabad railway station on Sunday due to security reasons, officials told Dawn.\n\nPakistan Railways officials said the train reached Jacobabad from Karachi just after midnight, where the relevant authorities informed the station master to keep the train at the station and not allow it to proceed towards Quetta until security clearance was given.\n\nTalking to Dawn, Pakistan Railways Chief Executive Officer (CEO) Amir Ali Baloch confirmed the hours-long stoppage of the Quetta-bound Bolan Mail, saying that it was due to security reasons as train operations were not allowed in Balochistan during night-time.\n\nA senior Railways official from the Quetta division told Dawn the train was carrying about 150 passengers.\n\nHe claimed that after security clearance was not received, the train’s onward journey was suspended, and passengers were sent to Quetta and other destinations via buses under strict security measures.\n\nPR officials say ‘night-time travel’ not permitted in Balochistan; passengers from Quetta to be brought to Sibi for journey to Karachi\n\n“This train reached Jacobabad in the night hours, and if it had continued its journey, it would have reached Sibi late at night. Therefore, we stopped the train at Jacobabad, telling the passengers to wait until morning,” the CEO told Dawn.\n\nHe said that some passengers were given a refund, whereas around 100 asked railway authorities to arrange alternative transport, adding that they were sent to their destinations via bus.\n\nHowever, there were conflicting reports about the transportation arrangements, and eye-witnesses said passengers protested in Jacobabad after railway authorities asked them to disembark.\n\nThe enraged passengers said that the railway administration had charged them the fare from Karachi to Quetta, but had left them to their own devices in the middle of the journey.\n\nThe passengers called it an injustice, saying the fare from Jacobabad to Quetta was more than a thousand rupees, but the railway administration had returned only Rs200 to some passengers, while others were not reimbursed at all.\n\nMeanwhile, the timings of the Bolan Mail are set to be revised from tomorrow (Tuesday). According to an announcement by Pakistan Railways, the 3UP train —which usually departs Karachi City Station at 7pm, will now leave four hours earlier at 3pm.\n\nPassengers, especially those holding advance bookings, have been asked to plan their travel accordingly.\n\nOur correspondent in Sukkur also contributed to this report\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc43509f0f9.jpg",
  "retrievedAt": "2025-10-12T02:31:46.109Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904018/bolan-mail-stopped-in-jacobabad-over-security-concerns",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:18:48.000Z"
}
