{
  "title": "Israel bombs Gaza’s Baptist hospital - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: An Israeli strike on Sunday heavily damaged one of a few functioning hospitals in Gaza, leaving behind scenes of devastation and fear and putting nearly one million people without access to emergency or ambulance care.\n\nThe strike on Al-Ahli Hospital in northern Gaza — also known as the Baptist or Ahli Arab Hospital — came a day after Israeli forces seized a key corridor in the territory and signalled plans to expand their bombing campaign.\n\nMarwan al-Hams, director of field hospitals in the Gaza Strip, warned that putting the Baptist Hospital out of service has left nearly one million people without access to emergency or ambulance care.\n\nHe stressed that no medicine, medical supplies, or fuel had entered the Gaza Strip in over 40 days. He also revealed that most hospital oxygen stations are now out of service, placing the lives of dozens of patients in immediate danger.\n\nAttack has left one million people without access to emergency treatment, says director of field hospitals\n\n“The remaining hospitals in Gaza are severely under-equipped and unable to provide essential medical and surgical care,” al-Hams stressed, sounding the alarm over a looming collapse of the healthcare system.\n\nHe urged the international community to act urgently, warning that “without intervention from the free world, Gaza’s entire medical infrastructure could collapse.”\n\nSince the outbreak of war, tens of thousands of Gazans have sought refuge in hospitals, many of which have suffered severe damage in the ongoing hostilities.\n\nIt also came as aid agencies and the United Nations warned that medicines and related supplies were rapidly running out in Gaza as casualties surged.\n\n“The bombing led to the destruction of the surgery building and the oxygen generation station for the intensive care units,” Gaza’s civil defence rescue agency said.\n\nThe blast left a gaping hole in one of the hospital’s buildings, with iron doors torn from their hinges. An Iraqi broadcaster said one of its TV vans was also damaged.\n\nSix brothers among seven killed\n\nA separate air strike on Sunday on a vehicle in the central city of Deir el-Balah killed seven people including six brothers, the civil defence agency said.\n\nMahmud Abu Amsha, who witnessed the strike, said those killed were distributing aid among Palestinians.\n\n“They do not care about children or people being killed… This aid was being provided to the displaced people,” he said.\n\nPatients, relatives and medical personnel evacuated the Al-Ahli hospital in haste following the military’s warning. Many found themselves stranded in the surrounding streets.\n\nNaela Imad, 42, had been sheltering at the hospital but had to rush out of the complex.\n\n“Just as we reached the hospital gate, they bombed it. It was a massive explosion,” she said.\n\n“Now, me and my children are out on the street. We’ve been displaced more than 20 times. The hospital was our last refuge.”\n\nThe Israeli military asserted that Hamas was operating “a command and control centre” inside the hospital compound.\n\nHamas condemned what it described as a “savage crime” committed by Israel “with blatant US cover and complicity”, dismissing the claim that the facility was a being used for military purpose.\n\nViolation of international law\n\nHospitals, protected under international humanitarian law, have repeatedly been attacked by Israel in the Gaza Strip since the start of the war.\n\nAid agencies and the UN say that only a few of Gaza’s 36 hospitals remain partially functional.\n\nBritish Foreign Secretary David Lammy urged Israel on Sunday to halt the “deplorable attacks” on hospitals, calling for diplomacy to “achieve a lasting peace”.\n\nLast month, Israeli forces opened fire on ambulances in Gaza, killing 15 medics and rescuers in an incident that sparked international condemnation.\n\nThe Palestine Red Crescent Society said on Sunday that a medic who had been missing since the attack, Asaad al-Nsasrah, was being held by Israeli troops.\n\n“His fate had remained unknown since he was targeted along with other PRCS medics in Rafah,” the group said in a statement.\n\nGaza’s health ministry said on Sunday that at least 1,574 Palestinians had been killed since March 18 when the ceasefire collapsed, taking the overall death toll since the war began to 50,944.\n\nThe ceasefire had largely put a halt to the fighting in Gaza for two months, but Israel restarted intense bombing in mid-March, with Palestinian fighters resuming rocket fire from the territory days later.\n\nPublished in Dawn, April 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fc409618e0d.jpg",
  "retrievedAt": "2025-10-12T02:31:52.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904016/israel-bombs-gazas-baptist-hospital",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T00:19:14.000Z"
}
