{
  "title": "Sindh govt to consult US experts as blaze in Karachi’s Korangi rages unabated for 18 days - Pakistan - DAWN.COM",
  "author": null,
  "content": "American experts will be consulted to help extinguish the massive fire that erupted during drilling near an oil refinery in Korangi Creek on March 28, according to a statement by the Sindh chief secretary’s spokesperson.\n\nLast Sunday, it emerged that the fire that had erupted during the digging of a housing project late last month was likely triggered due to a concentration of a larger quantity of chemicals than permissible limits.\n\nLast week, the federal government also constituted a committee of experts to conduct a detailed technical investigation to assess the cause and extent of the blaze.\n\n“The Ministry of Petroleum has hired the services of the American company Cudd Well Control,” the Sindh chief secretary’s spokesperson Farhat Imtiaz Janwari said.\n\nThe spokesperson added that the technical teams of Pakistan Petroleum Limited (PPL) and United Energy Pakistan Limited (UEPL) jointly visited the affected area.\n\nA team comprising drilling, completion and safety experts inspected the site.\n\n“During the inspection, it was observed that the intensity of the fire has not decreased, the borehole has further expanded due to the volume of gas, and hot water continues to leak,” Janwari added.\n\nHe said that consultations with experts are ongoing to implement the strategy of filling the the borehole with cement, and if necessary, the decision to dig a new well and reach the source of gas will be based on the experts’ report.\n\nThe spokesperson continued that modern equipment is being ordered to determine the quantity and temperature of the gas.\n\n“The Sindh government is in constant touch with the relevant agencies to deal with this emergency situation,” he concluded.\n\nLast week, a huge fire broke out in a factory inside the Export Processing Zone located in Karachi’s Landhi Industrial Area Extension, police and rescue services officials had said.\n\nSpeaking to Dawn.com, Rescue 1122 spokesperson Hassaan Khan had said that the fire erupted at the Sungraver factory and spread rapidly, prompting firefighters’ best efforts to put out the blaze.\n\nExposing severe emergency management flaws in the metropolis, an audit survey in November 2023 had revealed that some 260 out of 266 commercial buildings having offices and workplaces on three main thoroughfares — Sharea Faisal, II Chundrigar Road and Shahrah-i-Quaideen — do not have any fire safety system and 60 per cent of these multi-storey structures don’t even have an emergency exit for quick evacuation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1412241789b7b05.jpg",
  "retrievedAt": "2025-08-25T14:11:37.478Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904176/sindh-govt-to-consult-us-experts-as-blaze-in-karachis-korangi-rages-unabated-for-18-days",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T08:12:12.000Z"
}
