{
  "title": "Japan’s ‘Rebuilding Together’ project revitalizes healthcare infrastructure in Pakistan’s flood-hit areas",
  "link": "https://www.app.com.pk/national/japans-rebuilding-together-project-revitalizes-healthcare-infrastructure-in-pakistans-flood-hit-areas/",
  "date_published": "2024-05-31T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP): The World Health Organisation (WHO) on Friday held a ceremony to thank Japan for supporting Pakistan through its successful project “Rebuilding Together” that revitalized healthcare infrastructure in the flood-hit areas.\nJapan’s Ambassador to Pakistan Ambassador Wada Mitsuhiro and other dignitaries joined to celebrate the successful completion of the project, a news release said.\nThe devastating monsoon rains that struck Pakistan between mid-July and mid-August 2022, resulted in unprecedented flooding, impacting millions of lives across Balochistan, Khyber Pakhtunkhwa, Punjab, and Sindh provinces. Over 600,000 people were displaced, 1.9 million houses damaged, and extensive agricultural losses incurred.\nThe healthcare infrastructure was severely affected, with over 2,000 health facilities damaged. The financial assistance from the government and the people of Japan enabled WHO to timely respond to communicable disease outbreaks and enhance access to essential healthcare through revitalization of damaged healthcare facilities.\nIn a collaborative effort to strengthen healthcare delivery in Pakistan, WHO renovated 462 healthcare facilities and provided them with essential equipment and supplies of which 240 were rehabilitated through Japan’s assistance.\nThese facilities are now managed by the government health authorities, ensuring continued service provision.\nTo empower local healthcare professionals for long-term sustainability, WHO also invested in capacity building of service providers in various aspects of healthcare delivery including disease surveillance and outbreak response.\nWHO Representative Dr Luo Dapeng and Head of Mission in Pakistan, in his welcome remarks at the ceremony, acknowledged the remarkable Japanese support, stating,“We are extremely grateful for the invaluable support from the Government and people of Japan. Their generous contribution has been instrumental in restoring access to essential healthcare for vulnerable communities affected by the floods. This collaborative effort exemplifies the importance of international partnerships in building resilient healthcare systems.”\nJapan Ambassador Wada Mitsuhiro appreciated WHO Pakistan’s work and support to the Government of Pakistan. “The Government of Japan is committed to “Leave No One’s Health Behind” towards achieving the Universal health Coverage. Global Health is central to Japan’s Development Cooperation, and we consider it to be the fundamental pillar of sustainable development.”\nWHO Pakistan remains committed to working alongside the Pakistani Government and other stakeholders to further strengthen the country’s healthcare infrastructure.",
  "retrievedAt": "2025-08-11T02:51:00.959Z"
}
