{
  "title": "Pakistan’s nuclear capability guarantor for peace, power balance in region: Kh Asif",
  "link": "https://www.app.com.pk/national/pakistans-nuclear-capability-guarantor-for-peace-power-balance-in-region-kh-asif/",
  "date_published": "2024-05-30T19:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): Minister for Defence, Khawaja Muhammad Asif on Thursday said that Pakistan’s nuclear capability is a guarantor for peace in the region establishing full-spectrum deterrence and maintaining regional power balance, particularly against India.\nHe was addressing the South Asian Strategic Stability Institute (SASSI) University event to commemorate the 26th anniversary of Youm-e-Takbeer.\nThe event was held to mark the nation’s historic nuclear tests on May 28 and 30, 1998. The event, titled “Youm-e-Takbeer: 26 Years of Responsible Nuclear State,” was hosted by SASSI University here, a news release said.\nKhawaja Asif asserted that Pakistan’s nuclear capability remains a robust defensive measure, deterring aggression and safeguarding national sovereignty. In light of past aggressive actions such as those in Balakot, he reaffirmed Pakistan’s readiness to respond to any threats was a deterrence choice, underscoring that any act of war would have severe consequences for the aggressor.\nHe also paid tribute to the scientists, engineers and all those who have developed Pakistan’s nuclear program. While commenting on the pressures faced by Pakistan in the May 28th decision in 1998 he paid tribute to the then PM Nawaz Sharif for his momentous decision to go nuclear.\nChief of Army Staff, General Syed Asim Munir Ahmed Shah in written statement extended congratulations to the nation and Armed Forces on the anniversary of Youm-e-Takbeer.\nHe lauded the 1998 nuclear tests for establishing credible minimum deterrence and restoring regional power equilibrium.\nThe Chief of Army Staff paid tribute to the scientists, engineers, and officials whose dedication and sacrifices were instrumental in achieving this milestone. He reaffirmed the Armed Forces’ unwavering commitment to defending Pakistan’s sovereignty and territorial integrity at all costs.\nDr. Zafar Nawaz Jaspal, Dean of Social Sciences at Quaid-e-Azam University, highlighted the strategic importance of nuclear capabilities for nuclear-armed states and key regional actors.\nHe called for a comprehensive review of global nuclear dynamics and regional challenges, advocating for the modernization of Pakistan’s nuclear arsenal and doctrine, and the acceleration of the civilian nuclear energy program.\nDr. Maria Sultan, Chairperson and Director General of SASSI University, discussed the impact of nuclear posture and doctrine on regional military order and future nuclear program expansions in South Asia.\nShe highlighted the ongoing debate between compellence and deterrence and the future of the nuclear order in the third nuclear age.\nSpeaking at the event Ambassador Khalid Mehmood Chairman Board of Governor of the Institute of Strategic Studies Islamabad also echoed the support and facilitations to the nation on the historic event and while recalling the historic events of May 1998 stated that the pressures on Pakistan though were huge on one side by the international community on the other had was also supported by the friends who understood that Pakistan had developed the capability only as a last measure of defense.\nHe further added that the key element in nuclear deterrence is national resolve and let there be no mistake Pakistan has plenty of it when it comes to its defense.\nHis intervention was followed by the comments made by Ambassador Ali Sarwar Naqvi Executive Director Centre for International Strategic Studies CISS, who added that Pakistan was a reluctant nuclear weapon state but the way the international community had responded to the Indian nuclear tests of 11th May 1998 left Pakistan with no choice but to go nuclear on 28th may1998, this he said was particularly true as we faced the very real possibility of an attack on nuclear capability had we not tested.\nThe event emphasized Pakistan’s commitment to being a responsible nuclear state, ensuring regional stability, and pursuing peaceful nuclear technology advancements for the credibility of deterrence as we faced an ever changing environment.\nThe event concluded with a documentary on the May 28th 1998 and a vote of thanks to the heroes of the Pakistan’s nuclear program. The event was attended by a large number of people from different walks of life including from the Media, Academia, Armed Forces, National Security and Diplomatic Corp.",
  "retrievedAt": "2025-08-11T02:52:16.212Z"
}
