{
  "title": "Settlement of J&K dispute imperative for lasting peace: DPM",
  "author": null,
  "content": "ISLAMABAD, Jun 22 (APP): Deputy Prime Minister/Foreign Minister (DPM/FM) Muhammad Ishaq Dar said a peaceful settlement of the Jammu and Kashmir (JK) dispute was imperative for a lasting peace in South Asia.\nIn a statement made at the meeting of OIC Contact Group on Jammu and Kashmir in Istanbul, he said, South Asian region was home to over one-fifth of the world population and it could ill-afford the consequences of irresponsible Indian actions.\nHe said, “Today’s meeting is taking place at an important juncture as our brothers and sisters in Palestine and Iran are facing Israel’s relentless onslaught. Only last month, Pakistan and Azad Jammu and Kashmir were also attacked by India.\nThe attacks by Israel and India set a dangerous precedent for unilateral aggression. In future, the arguments being extended by these aggressors could be exploited to launch attacks on other countries as well. In these challenging times, the Islamic unity and joint Islamic action are required more than ever.”\n“The current Indian designs in Jammu and Kashmir are, in fact, a replication of the Israeli designs in Palestine. The script being enacted by Israel and India – in Palestine and Kashmir respectively – is essentially the same with particular reference to egregious human rights violations and blatantly illegal attempts to changing the demographics,” he explained.\nHe was of the view that the situations were worsening and called for the urgent attention of the international community for a peaceful resolution, in accordance with the relevant UN Resolutions and aspirations of the local people.\n“This attention, however, must not be aimed at legitimizing the status quo. Illegal and lopsided solutions cannot be unilaterally imposed. Only those solutions could bring the lasting peace, which are in conformity with the international law. The true peace is characterized by prevalence of justice, not absence of violence,” he remarked.\nHe recalled that India attacked Pakistan and Azad Jammu and Kashmir, without any verifiable evidence or a credible investigation into the Pahalgam attack of 22 April 2025.\n“It chose the path of belligerence and aggression despite an offer by the Prime Minister of Pakistan for a transparent and independent probe into this tragic incident. Most deplorably, India did not pay heed to the calls for restraint, made by the international community, including the United Nations and the Organization of Islamic Cooperation,” he added.\n“During the intervening night of 6 and 7 May 2025, India deliberately targeted the civilian areas on the false pretext of presence of terrorist infrastructure, resulting in the martyrdom of innocent men, women, and children. India’s unprovoked firing and shelling at the Line of Control also resulted in the loss of precious lives, houses and other assets.\nIn view of India’s unabated aggression, Pakistan was constrained to respond in line with Article 51 of the UN Charter to defend its sovereignty and territorial integrity. Our response, in the early hours of 10 May 2025, was mature, calibrated, restrained, and targeted only against military installations. The purpose of our action was to demonstrate our right, will and capability to defend our territory and people.”\nThe Deputy Prime Minister said, “Today, Pakistan remains firmly committed to upholding the ceasefire and promoting an environment of regional stability. However, at a time when international efforts are being made for regional peace and stability, the statements emerging from India reflect an aggressive and belligerent approach. India is fabricating misleading narratives to justify aggression. These rhetorical statements must stop.”\nHe informed that the Indian authorities exploited the Pahalgam attack to launch a massive crackdown in Indian Illegally Occupied Jammu and Kashmir.\n“There are reports that over 2800 Kashmiris were arrested or questioned in the immediate aftermath of the attack. The draconian Public Safety Act was slapped on at least 75 of them. The police carried out extensive searches at multiple residences of the locals. Around three dozen houses were razed to ground through the use of explosives.”\nIshaq Dar said, “In the last 78 years, India has tried different methods to consolidate its occupation of the large parts of Jammu and Kashmir. However, an intensified campaign to “Indianize” Kashmir, and transform its people into a disempowered community, has been in full swing since 5 August 2019.\n“In last six years, the Indian authorities have taken a series of legislative, judicial and administrative steps, aimed at altering the demographic structure and political landscape of the IIOJK,” he added.\n“To crush dissent, the Indian authorities have created an environment of fear and intimidation in IIOJK. Draconian laws such as Public Safety Act (PSA), Armed Forces Special Powers Act (AFSPA) and Unlawful Activities (Prevention) Act (UAPA) offer impunity to the Indian forces to arrest or kill any person, and destroy any property. Since 5 August 2019, 990 Kashmiris have been killed. Another 2465 were injured or tortured.\nThe number of political prisoners remains in thousands. Properties of Kashmiri activists are being confiscated as a punishment,” he continued.\nHe told that the Indian authorities had outlawed 16 political parties under a counterterrorism law, the Unlawful Activities (Prevention) Act. The office of All Parties Hurriyat Conference in Srinagar had also been seized.\n“Eid prayers at Srinagar’s historic Jamia Masjid have not been allowed for last seven consecutive years. Friday prayers at the Mosque are also prohibited at times. The chief cleric at the Mosque and a renowned Kashmiri leader, Mirwaiz Umar Farooq, is intermittently placed under house arrest, denying him the opportunity to address important religious congregations.”\nHe said, “The international human rights organizations and civil society have extensively documented human rights violations in IIOJK. Amongst others, these human rights abuses have been documented by the UN Office of the High Commissioner for Human Rights and the Independent Permanent Human Rights Commission of the Organization of Islamic Cooperation in separate reports. A number of UN Special Procedures have also expressed concerns about different facets of this dismal situation.”\nHe said, “Last year, the Human Rights Committee in Geneva made several important observations about the situation in IIOJK during the review of India’s fourth periodic report on implementation of the provisions of the International Covenant on Civil and Political Rights (ICCPR).”\nThe Committee recommended that India should review its counter-terrorism laws for being non-compliant with the ICCPR. The Human Rights Committee also urged India to ensure that the counterterrorism legislation is not applied to crackdown on human rights defenders, journalists, peaceful protesters and political opponents.\nHe said in the eyes of international law, any process, subservient to the Indian Constitution, cannot be invoked to determine the final status of Jammu and Kashmir, which is an internationally recognized disputed territory.\nHe said, “While Pakistan is acting in a responsible manner and upholding the ceasefire on the Line of Control (LoC), the Indian leaders’ irresponsible statements constitute a threat to regional peace. The international community, especially the members of this Contact Group, should take cognizance of such statements, which are also contrary to the UN Charter.”\n“It could hardly be overemphasized that, for a lasting peace in South Asia, the Jammu and Kashmir dispute needs to be resolved in accordance with the UN Security Council Resolutions and aspirations of the Kashmiri people,” he stressed.\nHe said the OIC’s pronouncements on Jammu and Kashmir were a major source of support to the Kashmir Cause.\n“The resolution, adopted by the 50th Session of the Council of Foreign Ministers in Yaoundé, is the latest testimony of the Organization’s unwavering support for the Kashmiri people’s right to self-determination. However, in view of the mounting challenges to the Kashmiri struggle, the OIC should transform its pronouncements into tangible actions. The Organization should scale up its efforts for mitigation of the Kashmiri people’s sufferings and finding a just settlement of the Jammu and Kashmir dispute.”\n“The OIC and its Member States should use their influence to urge India to improve the human rights situation in IIOJK; release the political prisoners; repeal draconian emergency laws; remove military presence from populated areas; and implement the relevant UN Security Council resolutions,” he said while concluding his statement.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:19:44.400Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/settlement-of-jk-dispute-imperative-for-lasting-peace-dpm/",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T16:35:00.000Z"
}
