{
  "title": "Iran to continue its nuclear program despite US attack: Iranian Ambassador",
  "author": null,
  "content": "ISLAMABAD, Jun 22 (APP): Iran’s Ambassador to Pakistan, Dr Reza Amiri Moghadam, on Sunday asserted that Iran would continue its nuclear program despite the United States (US) attacked its three nuclear sites including Fordow, Natanz, and Esfahan.\nWhile speaking at the emergency press conference here at the National Press Club, Islamabad, he called the Iranian nuclear program was for peaceful purposes, including generating electricity and others, emphasizing that the International Atomic Energy Agency (IAEA) has declared our nuclear program peaceful fifteen times, said a press release.\nHe further said that negotiations on Iran’s nuclear program were ongoing when Israel attacked Iran’s peaceful nuclear program and martyred its prominent nuclear scientists, military commanders, to which Iran responded with missiles it had developed.\nHe also declared Israeli and American attacks on Iran are a clear violation of international law, calling that Israel could not face Iranian missiles for ten days.\n“Iran will respond to the US in accordance with the United Nations Charter.” He said.\nHe thanked the Pakistani government for condemning the attacks on Iranian soil.\nThe Iranian nuclear commission was investigating the situation after the US attacks so that the Iranian people can be protected from any emergency situation, he noted.\n“We are ready to fight this war for a long time with the guidance of our leadership and the help of our forces,” he said.\n“We have not yet requested the supply of weapons from any country,” he added.\nIn response to a question, the Iranian ambassador said that drones and other weapons had been recovered from people spying in Iran, adding that some Iranian people were also among those arrested.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:20:06.277Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iran-to-continue-its-nuclear-program-despite-us-attack-iranian-ambassador/",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T18:56:00.000Z"
}
