{
  "title": "Will leave behind environmentally protected, pollution free Pakistan: PM",
  "link": "https://www.app.com.pk/national/will-leave-behind-environmentally-protected-pollution-free-pakistan-pm/",
  "date_published": "2021-05-27T09:01:00.000Z",
  "source": "APP",
  "content": "HARIPUR, May 27 (APP): Prime Minister Imran Khan Thursday said that the force behind the government’s 10 Billion Tree Tsunami Project and other such endeavors was its objective to leave behind a Pakistan with a protected environment and free from pollution.\n“One objective (of our environment-friendly initiatives) is to mitigate the impacts of climate change. Secondly, we want to leave behind a Pakistan as we have seen when there used to be huge forest cover, wildlife, clean water and no pollution. But the situation deteriorated as no one pursued long-term approach,” the prime minister said.\nHe was addressing a tree plantation ceremony here to mark the plantation of One Billionth Tree under 10 Billion Tree Tsunami Project.\nThe prime minister planted a Deodar sapling at Makhniyal Forest– the site where he had also launched KP government’s One Billion Tree Tsunami and the federal government’s 10 Billion Tree Tsunami Project.\nMinister for Economic Affairs Omar Ayub, State Minister for Climate Change Zartaj Gul, State Minister for Information Farrukh Habib, SAPMs Malik Amin Aslam and Dr Shahbaz Gill, and Senator Faisla Javed attended the event.\nThe prime minister appreciated the efforts of Malik Amin Aslam for the success of One Billion Tree Tsunami and ongoing efforts for 10 Billion Tree Tsunami Project which were being recognized globally.\nHe said Pakistan would host World Environment Day on June 5 which was an acknowledgment of Pakistan being among few countries making efforts to address the challenge of climate change. This also shows that we really want to leave behind a better Pakistan for future generation,” he added.\nHe said just like India, Pakistan’s rivers were fed by glaciers which were melting fast and could beget issues in the future.\nImran Khan said the previous governments did not pursue long-term approach and called for learning lessons from the Chinese model of reversing the damages done to environment.\nHe said through Billion Tree Tsunami projects, the government was striving to protect the wetlands and revive the wildlife which had reduced to a great extent.\nHe exemplified that after massive plantation in waterlogged area along river in Dera Ismail Khan, wildlife as well as birds had returned to the area.\nHe said on World Environment Day on June 5, Pakistan would highlight before the world as it was reversing its natural capital from negative to positive growth.\nEarlier, Director UNEP presented to the prime minister a UN Report Titled “Inclusive Wealth of Pakistan: The Case for Investing in Natural Capita and Restoration.”\nAccording to the report, Pakistan’s inclusive wealth increased at an average of 2.3% annually in absolute terms during the period 1992-2019. Analysis of the individual capital categories show that human capital and produced capital grew at a rate of 2.9 per cent and 3.2 per cent respectively, while natural capital declined negligibly, around 0.1 per cent.\n“There have been exciting recent developments in Pakistan’s management of natural capital. Afforestation across the country as part of the Ten Billion Tree Tsunami Programme (TBTTP) is expected to boost the nation’s renewable natural capital resources, particularly in the decades to come,” the report said.\nIt said the10 Billion Tree Tsunami Project has helped to make Pakistan a global pioneer in forest restoration by combining community participation, green job creation and strong political commitment.\nOverall objectives of the initiative were to improve the quality and extent of protected areas, encourage eco-tourism and promote community engagement and job creation.\nEarlier, SAPM Malik Amin Aslam said the 10 Billion Tree Tsunami Project had created 85,000 jobs during COVID-19 and thousands more would be added during the year.\nHe said the project had become an identity of Pakistan that was why it had been selected to host World Environment Day.\nApprising the gathering of the finding of third party assessment of planted trees across the country under the federal government’s projects, he said 90% survival rate has been recorded at 72% sites, 85% at 24% sites and 75% at 4% sites.\nHighlighting the salient features of the UN report on environment protection, to be launched on World Environment Day, Malik Amin Aslam said the world body had acknowledged the positive growth of natural capital from 2015 to 2019 which had been negative earlier.\nHe said the positive growth had turned positive mainly due to massive mangroves plantation and Billion Tree Tsunami Projects.",
  "retrievedAt": "2025-08-11T20:46:27.193Z"
}
