{
  "title": "Govt focusing on uplift of less privileged strata of society: Dr Firdous",
  "link": "https://www.app.com.pk/national/govt-focusing-on-uplift-of-less-privileged-strata-of-society-dr-firdous/",
  "date_published": "2021-05-27T17:46:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 27 (APP): Special Assistant to Punjab Chief Minister on Information Dr Firdous Ashiq Awan on Tuesday said that Punjab Social Protection Authority (PSPA) was working as per the vision of Prime Minister Imran Khan and under the able leadership of Punjab Chief Minister for the welfare of poor and deserving strata of society.\nShe said this while talking to media along with Punjab Social Protection Authority Vice Chairperson Jamal Nasir Cheema.\nShe said that ‘Bahimat Bazurg Programme’ was an important initiative of Pakistan Tehreek-e-Insaf (PTI) government under which financial assistance of Rs 2000 per month was being given to old and deserving people above age of 65 years.\nShe said that hefty amount of Rs 2 billion had been set aside for this programme.\nDr Firdous said that ‘Ehsaas Punjab Masawaat Programme’ was unique programme in it’s on way and under this programme transgenders were being facilitated.\nThe SACM said under this programme disabled transgenders between age of 18 to 40 were being given Rs 2000 per month while transgenders of above 40 years were being given Rs 3000 per month.\nShe further said that Punjab Social Protection Authority under “Zaiwar Taleem” programme was making efforts to increase literacy rate.\nPrime Minister Imran Khan launched ‘Sehat Insaf Card’ in Layyah and gave due right to the people of the area, she added.\nShe said that incumbent government was giving priority to less privileged segment of society in all its projects.\nShe said that CM Usman Buzdar announced package of Rs 9 billion in Bhakkar and brought the people of Bhakkar in the mainstream of development.\nTo a question, she said that Prime Minister Imran Khan was facing political plunderers with firm resolve.\nShe said that Maryam Nawaz had lost her importance after Shehbaz Sharif’s bail.\nTo another query, she said that entire PTI was standing behind Prime Minister Imran Khan.",
  "retrievedAt": "2025-08-11T20:46:16.662Z"
}
