{
  "title": "Govt spending Rs 3tr on debt clearance annually: Farrukh",
  "link": "https://www.app.com.pk/national/govt-spending-rs-3tr-on-debt-clearance-annually-farrukh/",
  "date_published": "2021-05-27T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Minister of State for Information and Broadcasting Farrukh Habib Thursday said the government was spending around Rs three trillion annually to pay off the debts borrowed by the previous regimes of the Pakistan Muslim League-Nawaz (PML-N) and Pakistan People’s Party (PPP).\nIn a statement, he said the present government’s borrowing till March 2021 constituted 21 per cent of the total loans.\nThe minister said the external debt stood at $46 billion in 2008, and then reached $60.09 billion in 2013. The foreign loans surged by 32 per cent during the PPP’s tenure .\nLikewise, the foreign loans witnessed a 56 per cent increase during the PML-N’s stint (2013-2018) as the external debt reached to 95.24 billion dollars in 2018.\nHe said the primary balance of present government would be surplus, if the interest being paid on the loans subtracted.\n“It means, according to the budget, the government’s revenue is higher than its expenditures,” he added.\nFarrukh said the Pakistan Stock Exchange (PSX) had set a new record of trading volume of one and a half billion shares the other day, adding the strong confidence of investors in the government’s policies would pave the way for achieving more economic dividends.\nHe said all such achievements were made due to Prime Minister Imran Khan’s prudent policies and decisions.\nThe minister chided PPP Co-chairman Bilawal Bhutto over alleged off-shore assets of his father, and asked him to show some courage and bring back billion of dollars plundered wealth of Asif Ali Zardari to the country from Switzerland and other countries.\nHe asked Bilawal as to why he could not digest the Gross Domestic Product’s (GDP) projected growth of four per cent.\nOn closure of the last fiscal year, the minister said, India’s economic growth stood at 8 per cent due to the COVID-19 pandemic and the United Kingdom’s at – 9.9. At the same time, Bangladesh stood at 1.6 per cent while Turkey at 1.8 percent.\nHad the government not grappled with the prevailing challenges, the country’s GDP growth would have been higher than four per cent, he added.",
  "retrievedAt": "2025-08-11T20:46:25.611Z"
}
