{
  "title": "Up-coming budget to be growth oriented: Omar Ayub",
  "link": "https://www.app.com.pk/national/up-coming-budget-to-be-growth-oriented-omar-ayub/",
  "date_published": "2021-05-27T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Federal Minister for Economic Affairs Omar Ayub Khan on Thursday, giving updates on Budget, said that the up-coming budget would be growth oriented, people friendly and create more jobs.\nTalking to a private news channel, he said the government was well aware about inflation in the country. “Govt. was making sincere efforts to reduce inflation.” he said.\nHe said coronavirus pandemic had badly fluctuated the big world economic powers that’s why the inflation had become a worldwide phenomenon.\nHe said the Pakistan Muslim League-Nawaz was responsible for provision of expensive electricity and gas in the country because it had made wrong agreements during its previous government.\nOmar Ayub Khan said the PML-N had ignored renewable energy and left huge burden of current account deficit for the newly elected government, adding that the Pakistan Tehreek-e-Insaf led government had payed proper attention and promoted the renewable energy in the country as it had converted current account deficit in to surplus by adopting prudent policies.\nDollar price had artificially controlled during the last government of PML-N but the incumbent government had strengthened the price of Pakistani rupee, he added.\nReplying to a question, he said the present government had improved the electricity supply system and saving billion of rupee per year through the system.\nHe said the government was facilitating to the farmers and they were getting bumper crops of wheat,sugarcane, cotton and rice, adding improving agriculture sector was the top most priority of the incumbent government.\nHe expressed his hope that the PTI would again win the general elections of 2023 on the basis of its five years performance.\nReplying to another query about PDM, he said the Pakistan Democratic Movement (PDM) had made the part of history and all the opposition political parties were exposing and leveling allegations against each other in these days.\nThe people had rejected the opposition parties and very much disappointed from their way of politics, he added.",
  "retrievedAt": "2025-08-11T20:46:16.661Z"
}
