{
  "title": "PM for enhanced international cooperation under UN auspices",
  "link": "https://www.app.com.pk/national/pm-for-enhanced-international-cooperation-under-un-auspices/",
  "date_published": "2021-05-27T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Prime Minister Imran Khan on Thursday highlighted the need for enhanced international cooperation, under the UN auspices, to address climate change and environmental degradation, as well as debt relief to support the developing countries’ economic recovery efforts and attainment of Sustainable Development Goals by the target date of 2030.\nThe Prime Minister was talking to President of the United Nations General Assembly (PGA), Volkan Bozkir, who called on him here.\nA wide range of issues were discussed during the meeting pertaining to regional and international peace and security, sustainable development and economic recovery efforts in the wake of COVID-19 pandemic.\nViews were exchanged on key items on the UN agenda such as Palestine, the Jammu and Kashmir dispute, Afghan peace process, and illicit financial flows from proceeds of crime, corruption and bribery.\nThe Prime Minister lauded the role of PGA in convening the special meeting of the General Assembly on Palestine, stressing that following the announcement of ceasefire steps should be taken to revive the peace process and ensure a just and lasting solution in line with relevant UN resolutions and two-state vision.\nHe underscored Pakistan’s strong commitment to multilateralism with the UN playing a central role.\nVolkan Bozkir briefed the Prime Minister on the various initiatives undertaken during his Presidency of the UN General Assembly to address key international political and socio-economic issues.\nBozkir is on an official visit to Pakistan from 26 to 28 May 2021, on the invitation of Foreign Minister Makhdoom Shah Mahmood Qureshi.\nVolkan Bozkir – the first Turkish national to preside over the UN General Assembly – is a former diplomat and a senior politician. He earlier visited Pakistan in August 2020 and also met the Prime Minister on that occasion.",
  "retrievedAt": "2025-08-11T20:46:18.989Z"
}
