{
  "title": "Azerbaijan Embassy in Pakistan celebrates “Victory Day”",
  "link": "https://www.app.com.pk/national/azerbaijan-embassy-in-pakistan-celebrates-victory-day/",
  "date_published": "2023-11-08T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): The Azerbaijan Embassy in Pakistan held a special event to commemorate “Victory Day,” marking the successful liberation of Azerbaijani territories from unlawful Armenian occupation. The event, held on November 8th, symbolized the triumphant return of Azerbaijan’s territorial integrity after a long struggle against illegal occupation.\nAddressing the participants, the Ambassador of Azerbaijan to Pakistan, Khazar Farhadov, paid tribute to the martyrs who sacrificed their lives for the independence, sovereignty, and territorial integrity of Azerbaijan.\nWhile sharing the background, the Ambassdor said, Armenia kept 20% of Azerbaijani territories under occupation for almost 30 years. Almost Armenia committed war crimes in the occupied territories of Azerbaijan.\nHe said, Armenia committed the Khojaly Genocide in 1992, killing 613 innocent civilians, including 106 women and 63 children. They carried out ethnic cleansing against the Azerbaijani population in the occupied territories. All Azerbaijanis were forcibly expelled from occupied territories.\nIn 1993, he said, the United Nations Security Council adopted 4 resolutions demanding immediate and unconditional withdrawal of Armenian troops from the territory of Azerbaijan.\n“Other international organizations, such as the Organization of Islamic Cooperation, Non-Alignment Movement, OSCE, Parliamentary Assembly of the Council of Europe, and the European Parliament adopted similar decisions and resolutions. Armenia did not implement the resolutions of the UNSC and other international organizations” he added.\nThe ambassador said, Azerbaijan tried to resolve the Karabakh conflict through negotiations but Armenia always ignored it and tried to keep the status quo and Armenia even regularly committed military provocations during the occupation times.\nIn 2020, he said, Azerbaijan launched a counter-offensive in response to Armenia’s yet another large-scale military attack on Azerbaijani Army positions and civilian settlements.\nThe envy said, “At the end of the 44-day, under the leadership of President Ilham Aliyev, the Armed Forces of Azerbaijan liberated its territories from Armenian occupation. Azerbaijan implemented UN Security Council resolutions itself by liberating its occupied territories.”\n“During the Armenian occupation, Azerbaijani cities and villages were razed to the ground and all cultural and religious monuments were destroyed, mosques were desecrated and looted. Armenians turned mosques into pigsties during the occupation, hundreds of thousands of mines and booby traps have been planted across Azerbaijan’s territory” he said.\nHe said, in response to aggression, Azerbaijan has never targeted any civilian people and civilian infrastructures during the Patriotic War and local antiterrorism measures.\nThe ambassador further said, even after the war, Armenia did not stop its heinous military provocations that caused the loss of civilians and military personnel in the liberated territories of Azerbaijan.\n“The Azerbaijan Army launched local anti-terrorist measures to ensure the provisions of the Joint Trilateral Statement signed on November 10, 2020, to prevent large-scale provocations committed in the Karabakh economic region of Azerbaijan, to disarm and withdraw the Armenian armed forces formations from Azerbaijani territories, to neutralize their military infrastructure, to ensure safety of the civilian population returning to the territories liberated from occupation, safety of the civilian workers involved in the reconstruction work, the servicemen and to restore the constitutional order of the Republic of Azerbaijan” he said.\nHe said, immediately after the war, the Azerbaijani side whose 20 % of the territory had been occupied by Armenia for almost 30 years, proposed a peace agreement to Armenia.\nRaising the right of 300.000 Azerbaijanis to return to their historical homeland in nowadays Armenia, Azerbaijan also set up a special reintegration portal for Armenian residents living in the Karabakh economic region of the Republic of Azerbaijan, he added.\nThe envoy said, right after the liberation, Azerbaijan started massive reconstruction and restoration works in the liberated areas by allocating more than 7 billion US dollars so far.\n“The allocation of at least 2.4 billion US dollars is envisaged for the year 2024. Great Return has already been started by the Azerbaijani Government. Many former Azerbaijani IDPs have returned to the Fuzuli, Zangilan, and Lachin. Over 140 thousand people are due to return to Karabakh and East Zangezur by the end of 2026. International Airports namely Fuzuli and Zangilan were built, and Lachin International Airport is underway” he added.\nThe ambassador while acknowledging Pakistan contribution said, “During the occupation and 44 days of the Patriotic War, brotherly Pakistan has always supported Azerbaijan morally and diplomatically.”\n“I would like once again to extend my gratitude to the Government and people of Pakistan for their continuous support. It is no coincidence that the Pakistani flag is waved along with the Azerbaijani and Turkish flags in Azerbaijan by the common people in this country as a sign of respect and gratitude to the Pakistani brothers and sisters” the ambassador said.",
  "retrievedAt": "2025-08-11T10:25:32.853Z"
}
