{
  "title": "PM warns of transregional spillover of Gaza war; urges engagement with West",
  "link": "https://www.app.com.pk/national/pm-warns-of-transregional-spillover-of-gaza-war-urges-engagement-with-west/",
  "date_published": "2023-11-08T15:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar has called for an enhanced engagement with the Western capitals to make Israel realise that the Gaza war could have a spillover effect beyond the region.\n“We need to engage with different Western capitals, particularly Washington and London, and they need to make realize the Israeli side that they are contributing to destabilize not just the region, but probably it would have a spillover effect beyond the region,” the prime minister said in an interview with Arab News published on Wednesday.\nWhen asked if the Pakistan government had received any requests from the US to soften its stance against Israel as it continued attacks on Gaza, Kakar said, “I’m not aware of any such request and I don’t think so any government would listen to any such request which is in my opinion surreal, it’s absurd to even think of requesting someone to be silent on such an account.”\nHe called for an immediate “cessation of violence” and labeled Israel’s assault on Gaza “genocide, clearly.”\nHe told the interviewer that he would be traveling to Riyadh this weekend for an extraordinary session of the Organization of Islamic Cooperation (OIC) to discuss Israel’s attacks on Palestine.\n“You can’t just kill children and say that you have got the right to defend yourself. It’s the license to barbaric retaliation.”\nAsked if Muslim nations were doing enough for Gaza, Prime Minister Kakar also raised questions about the role of the world’s estimated 1.8 billion Muslims, who make up 24 percent of the global population, in “facing the kind of situation which we are in.”\n“We need to ask more deep questions from this entire [Muslim] population, that what kind of contribution globally we are having … toward science and technology, what kind of defense capabilities these different or 50 or 57 countries are developing for themselves.”",
  "retrievedAt": "2025-08-11T10:25:10.121Z"
}
