{
  "title": "Iqbal’s doctrine of self-reliance, self determination for progress: Speaker NA",
  "link": "https://www.app.com.pk/national/iqbals-doctrine-of-self-reliance-self-determination-for-progress-speaker-na/",
  "date_published": "2023-11-08T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP): Speaker National Assembly, Raja Pervez Ashraf Wednesday said that Pakistan can achieve sustainable progress by embracing Dr. Allama Muhammad Iqbal’s doctrine of self-reliance and self-determination.\nHe said this while paying deep respect to Dr. Allama Muhammad Iqbal on the eve of his 146th birth anniversary through a message.\nThe Speaker noted that Iqbal not only envisioned a separate homeland for the Muslims of the subcontinent but also provided a blueprint for the nation’s enduring growth and development through his philosophy of “Self” (khudi).\nHe was a visionary leader with the ability to see beyond surface-level phenomena and discern underlying events as they unfolded.\nRaja Pervez also recalled Iqbal’s staunch support for the Palestinian cause. He vigorously rejected Zionist claims to Palestinian territory and emphatically opposed the establishment of a Jewish homeland at the expense of the Palestinians.\nIqbal also posed the question, “If Jews have a right to the land of Palestine, why do Arabs not have a claim to Spain”?. He urged the Muslim Ummah to unite and exert every effort to safeguard Islam and Muslims worldwide.\nThe Speaker emphasized that the eminent philosopher and thinker, through his poetry and speeches, stirred the conscience of Muslims.\nHe motivated them to reclaim their lost glory through dedication, commitment and unity.\nIqbal placed special emphasis on the youth and placed his hopes in them to instigate positive change within society.\n“Iqbal’s message of love, hope, and unity was universal. Let us adhere to his principles both in words and deeds to tackle the challenges confronting our nation”, he said.",
  "retrievedAt": "2025-08-11T10:25:25.951Z"
}
