{
  "title": "Martyrs’ families plead for speedy justice thru military courts",
  "link": "https://www.app.com.pk/national/martyrs-families-plead-for-speedy-justice-thru-military-courts/",
  "date_published": "2023-11-08T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): The families of Shuhda-e-Pakistan (Martyrs of Pakistan) on Wednesday urged the quarters concerned to restore the military courts to ensure speedy justice to the victims of terrorism as their abolition had further added to their pain.\nAddressing a presser-cum-protest at the National Press Club, the martyrs’ families appealed to the Supreme Court to review its decision against the military courts.\nNawabzada Jamal Raisani, Haji Sanaullah Khan, Rahimullah, Wazir Farman Elahi, Anwar Zeib, Fawzia, Muhammad Jamshed and others were among the heirs of martyrs, who addressed the presser.\nThey said that the military courts were all the more important to provide justice to the victims of terrorism and rioting as, otherwise, it might lead to higher terror incidents. It might also embolden enemy secret agency to go for any misadventure like Kulbhushan Yadav.\nThe families said: “The martyrs are the nation’s pride and the apex court is requested to have a thorough review of underlying factors in order to effectively curb anti-state activities and terror acts while delivering verdicts through military courts.”\nThey indicated that they would formally file a petition in that regard in the apex court on Monday (November 13).\nThe martyrs heirs said that they had gathered at this point to demonstrate their unity to carry forward a movement for the restoration of military courts.\nThey said that they were just trying to uphold the sanctity of the martyrs’ blood and added that the military courts would surely take the elements involved in terrorist activities to task and give solace to their heirs.\nThe families stressed for quick disposal of Kulbhushan’s case at the the International Court of Justice so that spy networks should be discouraged.\nThe families pointed out that the real issue was the lengthy and slow judicial process so they were demanding the military court trials of the culprits without further delay.\n“It is our responsibility to stand against the anti-state elements. Those affected by terrorism deserve due respect and care. The children and families of martyrs stand united on the issue as their loved ones sacrificed their lives for the motherland,” they added.\nThe families said it seemed that the menace of terrorism had one again surfaced in the country, as evident from the recent terror acts in the province of Balochistan and elsewhere.",
  "retrievedAt": "2025-08-11T10:25:13.509Z"
}
