{
  "title": "MoCC&EC to unveil Pakistan’s first policy draft for trading in carbon markets",
  "link": "https://www.app.com.pk/national/moccec-to-unveil-pakistans-first-policy-draft-for-trading-in-carbon-markets/",
  "date_published": "2023-11-08T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP): The Ministry of Climate Change and Environmental Coordination (MoCC&EC) is all set to roll out the first ever policy draft of the country’s carbon credits trading in the international market at the highest forum of Climate Change Council headed by the Prime Minister.\nThis was said by Secretary Ministry of Climate Change and Environmental Coordination, Asif Hyder Shah during the meeting of the Senate Standing Committee on Climate Change chaired by Senator Seemee Ezdi.\nThe secretary briefed the committee on Climate Change’s two agenda items mainly the Carbon Market Policy guidelines and Pakistan’s strategy for COP-28 meeting with special focus on operationalization of the Loss and Damage fund.\nEarlier, the chairperson Senate Standing Committee expressed resentment over repeated delays on convening the body meeting due to the letters of postponement sent by the ministry.\nShe added that the meeting was held after three months and was the first since the culmination of the previous regime.\nShe reprimanded the ministry officials for sending her the letters to postpone the meeting.\nThe secretary mentioned that trading in carbon markets was a tricky subject evolving every year, whereas the country had no such framework in place to deal with it.\nHowever, the World Bank was requested to prepare the document which demanded a two-year duration for its consultants to prepare the policy document.\nThe Special Investment Facilitation Council (SIFC) also took up the matter and asked to expedite the procedure and therefore, the next year deadline was set to finalize the document, he added.\n“We will be open for public and private investments in carbon market. Moreover, the Ministry will seek the committee’s nod and then will send it to SIFC,” he added.\nShah informed the committee that the carbon market comprised of compliance based carbon market and voluntary market.\nHe added that many countries did not have this framework on carbon markets whereas only 40 European Union countries have it.\nThe better the legislative and regulatory framework of Pakistan, the more valuable carbon credits would be sold internationally, he said.\n“We are about to embark upon stage one of the process to establish policy guidelines that focuses on capitalizing on carbon potential, opening market for public and private sectors, opens market to the extent of 50% of Pakistan’s conditional NDC target (280.5 MTCO2e),” he said.\nCommenting on the country’s carbon sequestration potential, he said the Sindh mangroves generated some $45 million in terms of carbon credits (3 million credits per annum).\nBreifing on the COP-28 preparations, the secretary informed that the first two days would have high level meetings.\nThe best part of COP forum, he said was that it made consensus-based decisions and every country had a veto power.\nLast year, Pakistan was G77 plus China group chair that provided it access to many key forums and platforms at the COP-27 but this time the situation will be different.\nIn COP-28, the focus would be on L&D operationalisation, mitigation work program, global goal on adaptation, climate finance, and first global stock-take, he added.\nHe mentioned that the developed countries demanded to keep Loss and Damage Fund under the World Bank but developing countries like Pakistan want it under UNFCCC as a standalone fund. However, Pakistan is evenly poised but will go alongwith G77 plus China group countries.\nHe noted that Pakistan had limited resources for pavilion but it added more value to its efforts through quality panel discussions.\n“We convene panelists of high caliber and hold quality panel discussions focused on practical solutions to the pressing environmental problems,” he added.\nMoreover, this time the ministry has incorporated youth, children and minorities in its panel discussions at COP-28 whereas it was also holding separate sessions for educating and briefing youth and children going privately to attend COP meeting for better understanding of the forum.\nThe ministry will take a 15-member delegation to Dubai to attend the COP meeting to be held from November 30 to December 12, 2023.",
  "retrievedAt": "2025-08-11T10:25:33.417Z"
}
