{
  "title": "IHC reserves verdict on bail petition of Qureshi",
  "link": "https://www.app.com.pk/national/ihc-reserves-verdict-on-bail-petition-of-qureshi/",
  "date_published": "2023-11-08T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): The Islamabad High Court (IHC) on Wednesday reserved its verdict petitions of PTI’s vice chairman Shah Mehmood Qureshi against his indictment and seeking his post-arrest bail in cipher case.\nChief Justice Aamer Farooq heard the cases filed by Shah Mehmood Qureshi against the judgments of trial court. Petitioner’s lawyer Ali Bokhari Advocate and FIA Prosecutor Raja Rizwan Abbasi heard the case.\nAt the outset of hearing, the FIA’s prosecutor objected over the post-arrest bail petition of Mr. Qureshi. He said that it was essential for the petitioner to submit the certificate as per the judgment of the top court.\nThe chief justice rejected the objection of prosecution and asked the FIA to give arguments in the case.\nThe defence lawyer said that his client was accused of keeping the cipher in his custody and misusing it. But his client had not committed any offense like this, he said. Ali Bokhari Advocate said that the trial court had dismissed the post-arrest bail petition of his client while it had approved the bail of Asad Umar.\nHe said that the trial court has not provided the copies of case record and defence was only provided the copies of statements of 161 and 164 so far. He said that the court had recorded the statements of three witnesses out of 28. The role of chairman PTI and Shah Mehmooq Qureshi in this case was different, he added.\nSpecial Prosecutor Raja Rizwan Abbasi argued that the trial court had indicted the accused on October 23, after completing legal requirements. The copies of the case record had also been shared with the defence, he said.\nHe said that Shah Mehmood Qureshi was accused of assisting the main accused in the crime. Only the foreign secretary was authorized to grant approval for sharing of the document with certain personalities. The prosecutor also gave reference of Shah Mehmood Qureshi’s speeches in the Assembly and to the public gathering. He said that the accused had tried to instigate the public through his words.\nHe prayed the court to dismiss the bail petition of the accused.\nSpecial Prosecutor Zulifqar Abbas Naqvi said the trial of the accused would likely to conclude within one month. The defence was using delaying tactics in the case proceeding, he said.\nAfter hearing arguments from two sides, the court subsequently reserved its verdict.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:25:15.578Z"
}
