{
  "title": "MD highlights potential of Buddhist tourism in 2nd Int’l Conference on Buddhist Heritage",
  "link": "https://www.app.com.pk/national/md-highlights-potential-of-buddhist-tourism-in-2nd-intl-conference-on-buddhist-heritage/",
  "date_published": "2024-03-05T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP):The 2nd International Conference and Art Exhibition on Buddhist Heritage, was held at Taxila Institute of Asian Civilizations, Quaid-i-Azam University here from March 2 to 3.\nManaging Director of Pakistan Tourism Development Corporation (PTDC) Aftab-ur-Rehman Rana and President of STFP, participated as a guest speaker at the closing session of conference, said a news release on Tuesday.\nRana emphasized Pakistan’s significance as the birthplace of Mahayana Buddhism and the home to many renowned Buddhist philosophers and gurus.\nHe highlighted Pakistan’s vast Buddhist heritage, urging stakeholders to collaborate in promoting Buddhist religious heritage tourism.\nHe said that Pakistan was a land of great Buddhist heritage and there were millions of Buddhists who could be attracted to visit Pakistan and engage all the stakeholders to provide an ideal environment for  promoting  Buddhist religious heritage tourism in Pakistan.\nThe MD stressed on the need to especially involve local communities living in the vicinities of heritage sites through the sustainable heritage tourism in the protection and providing custodianship of the heritage sites as well as improving the economic well-being of locals through tourism.\nHe also highlighted the need to promote regional tourism with the neighboring countries that share Buddhist heritage.\nThe event jointly organized by Taxila Institute of Asian Civilizations, Quaid e Azam University Islamabad, Silk Road Centre, KP Archaeology & Museum Department , Pakistan Tourism Development Corporation and other national and international partners featured over 50 research papers covering topics such as Buddhist heritage conservation, education, peace, interfaith harmony and collaborative research partners.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:09:25.554Z"
}
