{
  "title": "PM announces relief package for Balochistan’s rain-hit areas",
  "link": "https://www.app.com.pk/national/pm-announces-relief-package-for-balochistans-rain-hit-areas/",
  "date_published": "2024-03-05T10:39:00.000Z",
  "source": "APP",
  "content": "GWADAR, Mar 5 (APP): Prime Minister Shehbaz Sharif on Tuesday unveiled a relief package for people of the rain-hit areas of Balochistan, announcing Rs 2 million each for the families of the deceased, Rs 0.5 million for the injured, and Rs 750,000 for those whose houses were completely damaged.\nThe prime minister who arrived here the very next day of his oath, told the media after visiting the rain-affected areas that the government would also give Rs350,000 compensation to the families whose houses were partially damaged in the stormy rains of February 26.\nAccompanied by Chief Minister of Balochistan Sarfaraz Bugti, and parliamentarians including Atta Tarar and Jam Kamal Khan, he assured that the government would not leave the suffering people alone unless they were resettled in their homes.\nIn the briefing, he was told that five people were killed in the rain-related incidents across Balochistan, though no casualty was reported in Gwadar.\nThe prime minister sympathized with the bereaved families and assured that the compensation package would be implemented within four days.\nThe prime minister lauded Sarfaraz Bugti for his efforts as he rushed to the affected areas soon after his oath and supervised the relief and rescue operations.\n“This is not a favour. This is the duty of the newly-elected government and me as the prime minister. This is neither any favor nor any show-off,” he remarked.\nPrime Minister Shehbaz also appreciated the personnel of the Pakistan Army, Pakistan Navy, Coastal Guards, PDMA and NDMA for their efforts and recommended the Chief Minister to award them medals and commendation certificates.\nHe recalled that following the 2022 floods, that time coalition government had distributed Rs 100 billion among the affected people across the country.\nEarlier, the prime minister also distributed cheques and relief goods including food items, blankets, water coolers and others among the affected people.\nInteracting with the victims, he said, “You are our brothers and sisters. I am here to assure you that the government will not leave you alone. We are with you. How could I sit in Islamabad when you are homeless.”\nThe prime minister was told that water was receding and the situation in the cities was improving.\nIt was told that water filtration plants had been set up and medicines have been available for the homeless people.",
  "retrievedAt": "2025-08-11T01:09:21.452Z"
}
