{
  "title": "Dialogue mulls over co-creating solutions for promoting youth-led waste recycling in cities",
  "link": "https://www.app.com.pk/national/dialogue-mulls-over-co-creating-solutions-for-promoting-youth-led-waste-recycling-in-cities/",
  "date_published": "2024-03-05T08:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP): In a groundbreaking effort to address the pressing issue of waste management in Pakistan’s urban areas, a two-day Hackathon was organized under the program Green Urban Development (GUD) that mulled over co-creating solutions for youth-led waste recycling in the urban centers of the country.\nThe event was jointly initiated by the Institute of Urbanism and the School of Leadership Foundation with the generous support of the U.S. Embassy Islamabad, a news release said.\nThe Hackathon brought together a diverse array of stakeholders including academia, youth, researchers, media, government officials, and representatives from the private sector. The primary objective of the event was to find innovative solutions to introduce at-source waste segregation at the household level in cities, while integrating informal waste management stakeholders in a socially and economically just manner.\nNumerous critical issues were highlighted during the discussions, emphasizing the urgency of addressing the waste management crisis in Pakistani cities. Islamabad alone generates approximately ,1575 tons of municipal waste daily, with a low recycling rate. Plastic waste constitutes a significant portion, estimated to be 14.26 percent of the total waste. Additionally, the lack of updated waste-related data, absence of comprehensive national-level policies, and the fragmented efforts of informal and private sectors were identified as major obstacles.\nSamia Afridi, Senior Program Manager at the School of Leadership Foundation, stated, “This Hackathon is a testament to the power of collaboration and innovation in tackling complex societal issues. By bringing together diverse stakeholders, we can harness the creativity and energy of youth to drive meaningful change in waste management practices.”\nAyesha Majid, Senior Program Coordinator at the Institute of Urbanism, stressed the importance of formalizing segregation at the source and recycling at the community level. She emphasized the need for culturally-rooted messaging, capacity building, and collaborative platforms to promote partnerships among stakeholders.\nWaleed Hameed of Five Star (PVT) Ltd highlighted the necessity of providing platforms for youth to connect and learn from existing recycling businesses. He advocated for providing seed funding and small grants to encourage innovative approaches to waste management.\nShayan Yar applauded the Institute of Urbanism’s efforts in promoting waste-based solutions, noting the diverse audience it has been able to attract. He emphasized the importance of continued collaborative efforts to address local waste management challenges.\nDr. Abida Sharif, Assistant Professor at Fatima Jinnah University, emphasized the importance of integrating waste-wise practices into early education curricula and called on the government to create pathways to support waste-related initiatives and businesses.\nThe 2-day Hackathon served as a catalyst for fostering collaboration and innovation in addressing Pakistan’s waste management challenges. It underscored the critical role of youth-led initiatives in promoting sustainable solutions and highlighted the urgent need for comprehensive policies and coordinated efforts across sectors",
  "retrievedAt": "2025-08-11T01:08:31.288Z"
}
