{
  "title": "Pak-Saudi collaboration in IT, Telecom to further strengthen ties",
  "link": "https://www.app.com.pk/national/pak-saudi-collaboration-in-it-telecom-to-further-strengthen-ties/",
  "date_published": "2024-03-05T00:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP):In the realm of Information Technology and Telecom, the collaboration between the Kingdom of Saudi Arabia and Pakistan, and strong presence of Pakistan at LEAP 2024, would further strengthen bilateral ties between the two nations.\nThis premier technology event brings together some of the brightest minds globally, offering a dynamic platform for tech innovators, industry leaders, and experts to collaborate, explore innovations, establish partnerships, and engage with influential mentors and investors, said a news release received here on Tuesday.\nIn the previous year, LEAP generated over $9 billion in business, attracting over 172,000 individuals, including global tech leaders, IT professionals, speakers, tech gurus, and investors, establishing itself as the fastest-growing technology event worldwide.\nPakistan contingent is one of the largest at this year’s LEAP with 162 sqm pavilion 74 companies and over 800 delegates demonstrating a robust Pakistani business presence with promising prospects in the KSA market.\nThese companies are showcasing solutions in AI, IoT, blockchain, cyber security, cloud solutions, health tech, fintech, web and mobile app development, open source, e-commerce, data services and more.\nPSEB and P@SHA in collaboration with Pakistan Embassy in Riyadh and other stakeholders arranged “Saudi-Pak Tech Forum” on March 3, 2024 to set the tone for LEAP.\nSecretary General DCO Ms. Deemah Alyahya was the chief guest at the event.\nA considerable number of prominent Saudi Government and private institutions attended the forum which provided a remarkable platform for Pakistani companies to network with Saudi counterparts, IT industry, government institutions, and IT associations ahead of LEAP to create an additional pool of prospects & valuable business leads.\nSpeaking on the occasion, CEO PSEB Ms. Aisha Moriani reiterated the need for both the nations to collaborate and build upon the success of Pakistani companies at LEAP 2023.\nPakistan views this as a timely opportunity to showcase its IT/ITeS companies on the international trade platform and expand business in the Middle East market, particularly in Saudi Arabia, which is undergoing transformation with its Vision 2030.\nSaudi Arabia, boasting the largest economy in the Middle East and ranking among the top twenty globally, holds a significant share in the technology industry.\nPakistan’s IT industry has experienced remarkable growth, ranking among the country’s top five export sectors.\nThe industry benefits from a robust infrastructure, including 40+ Software Technology Parks and Special Technology Zones, while exporting IT services to over 170 countries across various domains.\nThe government through the Pakistan Software Export Board (PSEB), actively supports the IT industry, offering 100% equity ownership, 100% repatriation of capital and dividends, and income tax credits for IT exports to foreign investors.\nPakistan’s status as the fourth largest English-speaking nation and the second largest provider of online labor in software development positions it as an attractive Techdestination\nPakistan’s strategic location positions it as a gateway to Central Asia, making it an optimal choice for establishing a digital corridor providing access to Middle Eastern, African, and Asian states. With an impressive network of 6-8 marine cables ensuring advanced connectivity, coupled with a favorable time zone advantage, Pakistan enhances operational efficiency with nearly equal time differences to both London and Sydney. The abundant opportunities in Pakistan are undeniable, with approximately 75,000 IT graduates each year and a skilled workforce ready to contribute to the digital industry. Professionals in accounting, law, design, and marketing further augment the workforce, offering offshore services.\nAdditionally, Pakistan’s ability to deliver high-quality services at competitive costs, with a remarkable 70% reduction in operational expenses compared to North America, has earned it the title of the most financially attractive country for outsourcing, as per Kearney’s global 2023 report.\nConsidering these factors, Pakistan emerges as an ideal destination for various IT products, solutions, and services. The country’s favorable geographic location, robust connectivity, and talented workforce make it a prime location for leveraging these opportunities.\nThe government’s renewed approach to branding Pakistan as a lucrative TechdestiNation and enhancing its international presence has significantly broadened the horizons for Pakistani IT companies to expand their business globally. With a substantial presence at Leap 2024, Pakistan reiterates its readiness to take on the world and is open for business.\nThe collaboration between KSA and Pakistan at this event not only strengthens bilateral ties but also propels both nations into a future characterized by technological advancements and mutual prosperity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:08:54.903Z"
}
