{
  "title": "SSDO applauds inclusion of trafficking charge in Rizwana child abuse case",
  "link": "https://www.app.com.pk/national/ssdo-applauds-inclusion-of-trafficking-charge-in-rizwana-child-abuse-case/",
  "date_published": "2024-03-05T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP): The Sustainable Social Development Organization (SSDO) has applauded the recent decision by the Judicial Magistrate of Islamabad to include Section 3 of the Prevention of Trafficking in Persons Act (TIP Act) in the First Information Report (FIR) related to the Rizwana child domestic labor and torture case.\nThe case gained notoriety in July 2023 when Rizwana, a child domestic worker, accused the wife of a judge, Somia Asim, of torture and abuse, said a news release here on Tuesday.\nRizwana reported being deprived of food and confined to a room for days. Subsequent medical examination revealed she suffered from sepsis, lung infection, and possible poisoning, highlighting the severity of the abuse.\nThe court’s denial of bail to Ms. Asim underscores the seriousness of the case, which has sparked outrage and renewed calls for protecting vulnerable individuals, particularly child domestic workers, in Pakistan.\nSSDO stands in solidarity with Rizwana and all victims of trafficking and abuse, advocating for justice and safeguarding their rights.\nOn February 16, a significant step towards justice was achieved when the judicial magistrate ordered the inclusion of Section 3 of the TIP Act in the FIR.\nThis decision came despite initial resistance from law enforcement and prosecution to pursue charges under the act.\nSSDO and other human rights organizations persisted in their advocacy efforts, leading to this successful outcome. This highlights the importance of collaboration in combating trafficking and protecting vulnerable individuals.\nSyed Kausar Abbas, Executive Director of SSDO, said, “We believe this landmark decision not only delivers justice to Rizwana but also sets a crucial precedent for handling similar cases in the future.”\nSSDO remains committed to advocating for the rights of all individuals, especially marginalized and vulnerable ones. They call for continued efforts to eliminate trafficking and abuse in all forms.\nAbbas expressed his appreciation for the support of various institutions, including the Federal Investigation Agency (FIA), National Police Bureau, National Commission on the Rights of Children, and Punjab Child Protection & Welfare Bureau, in addressing this issue and raising their voice for Rizwana’s justice.\nSSDO pledged to continue striving for justice for Rizwana and to help her reintegrate into society as a survivor and advocate for other children.\nChairperson of the Punjab Child Protection and Welfare Bureau Sarah Ahmed confirmed that Rizwana is under their care and they will ensure her full support for rehabilitation.\nChairperson of the National Commission on the Rights of Children Ayesha Raza Farooq said that the commission is working towards significant policy changes to address child trafficking issues in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:09:20.567Z"
}
