{
  "title": "Russia-Ukraine war causes increase in fuel cost, power tariff: Senate Body told",
  "link": "https://www.app.com.pk/national/russia-ukraine-war-causes-increase-in-fuel-cost-power-tariff-senate-body-told/",
  "date_published": "2022-07-18T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 18 (APP):The Senate Standing Committee on Power on Monday apprised that fuel cost has been increased due to recent Russia-Ukraine war which eventually led to increase in tariff.\nThe Committee which met with Saifullah Abro in the Chair was told that the power tariff was linked with fuel prices at international level as electricity was being generated through imported furnace oil, coal and RLNG.\nMember Tariff, National Electric Power Regulatory Authority (NEPRA) Engr. Maqsood Anwar Khan briefed the committee about month-wise decrease and increase in electricity bills made by the Authority in the name of fuel adjustment.\nSaifullah Abro said that despite payment to Independent Power Producers (IPPs) electricity was not available to consumers. He demanded complete report of the factors involved in the unexpected increase in tariff.\nSenator Walid Iqbal raised the issue of deceased complainant named Maqsood Ahmed resident of Muridke (Punjab) who had received an electricity bill of Rs 41000 for consumption of 82 units.\nThe family of the complainant claimed that Maqsood died of heart attack few days later after receiving the bill, he added. However, in Lahore Electric Supply Company (LESCO) reply the complainant name was mentioned as Bashir Ahmed, he further added.\nThe CEO LESCO informed the committee that Bashir Ahmed was the father of complainant and the latter was involved in electricity theft and was fined according to NEPRA rules.\nSenator Walid Iqbal also inquired about the inflated rise in May bills which was due in June.\nThe CEO told that the increase in bills was related to consumption and in May electricity consumption increased owing to hot weather.\nSenator Saifullah Abro suggested that fine should be imposed on everyone involved in theft regardless of their social status.\nHe directed the CEO of LESCO to conduct inquiry of the matter and present its report in the next committee meeting.\nThe Chairman Committee also took up the matter of blast at Guddu thermal plant, inquired about the reasons of incident and the time needed to make the power plant efficient again.\nOfficials of Central Power Generation Company Ltd (GENCO ) told that the inquiry committee comprising four members had been formed, which would conclude its report in the next few days. The maintenance was underway which has to be completed in 90 days and the incident would further cause 20 or 30 days delay.\nThe committee also discussed the matter of fuel price adjustment charges in electricity bills raised by Senator Mushtaq Ahmed in the House.\nSenator Mushtaq Ahmed told the committee that the matter was filed in Peshawar High Court in October 2021 and NEPRA was directed to solve the matter in 30 days. But despite lapse of one and half years the matter was still pending.\nMushtaq Ahmed also raised the matter of unavailability of electricity in KPK. He said that KPK produced 7000 MW electricity and its demand was around 2800 to 3000 MW but despite producing huge electricity, the people of KPK were deprived of electricity.\nThe Chairman Committee directed the Chairman NEPRA to provide the due share of electricity to the province.\nSaifullah Abro also heard the grievances of Quetta Electric Supply Company and Peshawar Electric Supply Company regarding the shortage of manpower.\nFurthermore, the committee discussed the issue of pending recommendations made by the committee in its meetings held from 23rd February, 2022 onwards.\nWhile discussing the Jamshoro Coal Power Project (Lot-I & Lot-II), Syed Jafri CEO Jamshoro Power Company Limited told the committee that the plant would produce1320 MW of electricity and the total cost on both the Lot-I & II would be $ 1270 Million which was less than Sahiwal and Port Qasim power plants.\nHe further informed that Islamic Development Bank has canceled the loan of 100 million USD for Lot-II as effectiveness conditions were not fulfilled.\nThe meeting was attended by Senators Fida Muhammad, Saifullah Sarwar Khan Nyazee, Zeeshan Khanzada, Prince Ahmed Umer Ahmedzai, Sana Jamali, Haji Hidayatullah Khan, Bahramand Khan Tangi, Kamran Murtaza, Walid Iqbal, Mushtaq Ahmed Khan and officials of Power Division and all concern departments.",
  "retrievedAt": "2025-08-11T15:15:38.762Z"
}
