{
  "title": "PDM caravan bound to fail as it lacked destination: FM Qureshi",
  "link": "https://www.app.com.pk/national/pdm-caravan-bound-to-fail-as-it-lacked-destination-fm-qureshi/",
  "date_published": "2021-01-23T15:21:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jan 23 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi said that Pakistan Democratic Movement (PDM) was a caravan without any destination, as earlier it was talking about resigning from assemblies, then holding long march and now no-confidence movement.\nWhile talking to people at Union Councils 20, 37,39 and 43 of his constituency NA-156, the foreign minister remarked that PDM coalition was based on personal interests so it was bound to fail.\nThe leadership of PML-N could not mislead the masses as they had been exposed before the people.\nQureshi maintained that PML-N could not dislodge the incumbent government. The opposition would face disappointment, Qureshi said adding the PTI government would complete its constitutional term.\nHe reiterated the incumbent government would not give any NRO and the looters would have to face strict accountability.\nThe foreign minister also observed that Pakistan was facing different challenges at international level. He, however, added that the country would achieve successes at all diplomatic fronts.\nIn past regime, no foreign minister was deputed in the country which caused weakening Pakistan on diplomatic fronts. The incumbent government was fighting Pakistan’s case effectively at every international forum. After a long time, the country’s foreign policy was evolved as per wishes of masses, the foreign minister and added Pakistan was now heading in right direction.\nAbout masses problems at local level, Qureshi remarked that the government was paying immense focus on safe drinking water, modern sewerage system, roads infrastructure, healthcare and quality education system. The government believed in durable and sustainable development so masses-friendly policies were being framed. The policies have started yielding positive results.\nThe foreign minister also observed that Pakistan was hopeful of further improving its ties with the newly elected Joe Biden Administration in US. Pakistan performed amicable role amid difficult circumstances for peace process in Afghanistan. Qureshi also wished that the new US administration should continue developments on Afghan peace process.\nQureshi hinted that China would gift five lac doses of anti-coronavirus vaccines to Pakistan by January 31. Pakistan also sought another 1.1 million doses from China, informed Qureshi. The foreign minister added that China promised to provide 1.1 million doses of the vaccines by end of the February. The foreign minister also remarked that vaccines trial were in progress successfully.\nHe also maintained that PTI government was honouring its pledges made with the public and record development projects were being completed. Earlier, the foreign minister inaugurated different uplift schemes in the constituency. On this occasion, local leadership of PTI was also present.",
  "retrievedAt": "2025-08-11T20:16:10.247Z"
}
