{
  "title": "Chairman Senate, Speaker NA can summon Chairman NAB: Swati",
  "link": "https://www.app.com.pk/national/chairman-senate-speaker-na-can-summon-chairman-nab-swati/",
  "date_published": "2021-01-23T11:36:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 23 (APP): Railways Minister Azam Khan Swati said on Saturday that only Chairman Senate and Speaker National Assembly had the authority to summon Chairman NAB for inquiry on any allegation according to the rules.\nHe was answering the questions of journalists at a press conference here at Pakistan Railways Headquarters.\nTo a question about the summon orders for the Chairman National Accountability Bureau (NAB) by the National Assembly Standing Committee, he said the committee had no right to call any officer, adding that the Standing Committee could only request the chairman senate or speaker national assembly to summon any officer in the committee.\nTo a question, the minister said that he had taken over the charge of Railways on the orders of Prime Minister Imran Khan and he (Swati) would serve the department till the completion of PTI government’s tenure on the basis of performance.\nHe said that freight would be focused and it would be increased from Rs 19 million to Rs 36 million per annum within the short span of time.\nHe said the PR was now on track and in the period of 9 months to one year, the results of the work and policies would be visible.\nThe minister said the railways would progress with the efforts of the present honest officers and workers, however experts would be hired to run the department on the business model basis.\nHe said that running of schools and hospitals was not business of the railways, adding that all those departments in railways which were not giving profit would be outsourced.\nHe said that he would not spend a penny of the railways on himself, even he would pay fare from his own pocket.\nThe minister said that railways and postal services were the institutions which were made for business in 1947 but, unfortunately these institutions had been converted into charity organizations by the previous governments. “Since 1947, the total deficit of the railways is Rs 1.2 trillion,” he added.\nHe thanked Chairman NAB Justice (Retd) Javed Iqbal for his special interest in the corruption cases of railways, and informed that the outcome of pending cases would be from seven to ten days.",
  "retrievedAt": "2025-08-11T20:16:14.154Z"
}
