{
  "title": "Law minister calls on CM",
  "link": "https://www.app.com.pk/national/law-minister-calls-on-cm/",
  "date_published": "2021-01-23T09:16:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 23 (APP): Provincial Minister for Law Raja Basharat called on Punjab Chief Minister Sardar Usman Buzdar at CM office on Saturday.\nMatters regarding law and order situation, overall political situation in the province and the measures taken for safeguarding the lives and property of the people came under discussion during the meeting. The Law minister also informed the Chief Minister about the preparations of local bodies elections.\nUsman Buzdar directed to take all necessary steps for maintaining law and order situation in the province and said that no stone should be left unturned in this regard.\nHe said that rule of law will be ensured at any cost and violation in this regard will not be tolerated.\nHe said that new local bodies system will empower the people at grassroots level in real manner and people’s problems will be solved at their doorstep. The new era of development will be started in every urban and rural areas of Punjab.\nUsman Buzdar said that opposition was busy in politics of agitation whereas PTI government was serving the people. PDM has no agenda, people have totally rejected opposition’s politics of chaos and anarchy, CM said.\nThese elements have lost their reputation in the public, said CM and added that Prime Minister Imran Khan was the only hope for the nation.\nCM said that the incumbent government under the leadership of Prime Minister Imran Khan will continue its journey towards progress and development.\nProvincial Minister for Law Raja Basharat said that all out measures had been taken for securing the lives and property of the people of the province. Consultation for the local bodies elections was being carried out.\nThe government was introducing such local bodies system which will solve the people’s problems at grassroots level.\nHe said the PDM was trying to make political point scoring at every important issue. Opposition had totally forgotten the national interest, however, the people by remaining indifferent from their public meetings have shown the opposition true face.\nRaja Basharat also apprised the Chief Minister about the measures taken for maintaining law and order in the province.",
  "retrievedAt": "2025-08-11T20:16:16.554Z"
}
