{
  "title": "Pakistan focuses economic security paradigm, India pursues expansionist agendas: Moeed",
  "link": "https://www.app.com.pk/national/pakistan-focuses-economic-security-paradigm-india-pursues-expansionist-agendas-moeed/",
  "date_published": "2021-01-23T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): Special Assistant to the Prime Minister (SAPM) on National Security Division and Strategic Policy Planning Dr Moeed Yusuf said Pakistan was a country squarely focused on the economic security paradigm, in contrast, India was pursuing Hindutva ideology with an expansionist agenda.\nIndia had a conflict with every single neighbor, and had broken all international law obligations that was the classic example of a rogue state, the SAPM was addressing a webinar organised by the Centre for Aerospace and Security Studies (CASS) titled “Indian Chronicles: India’s Disinformation Campaign against Pakistan”, here a press release said.\nIn his Keynote address, Dr Moeed Yusuf stressed that the malicious campaign against Pakistan had been going on even before the latest revelations of “Indian Chronicles” which was just the tip of the iceberg. Talking about Islamabad’s response, he informed that Pakistan had written to the EU Parliament and investigations were already underway.\nHe said that this was a failure of the UN system that allowed such fake NGOs to function, and questioned whether country, like India should even be sitting on the UN Security Council.\n“This has been a full-fledged attack on Pakistan short of war,” he remarked. Dr Yusuf further added that India must stop its subversive activities against Pakistan and resolve the Kashmir issue under the international law to bring peace in the region as there was no scope for peace under the current circumstances.\nIn his welcome remarks, President CASS Air Chief Marshal (R) Kaleem Saadat noted that despite the fact that even after the disclosure of this network by the EU Disinfo lab report, the world still remained unmoved. He cautioned that the consequences of these tactics would be an “unstable, insecure and underdeveloped neighborhood.”\nOther speakers in the webinar included Executive Editor Indus TV Ejaz Haider, Ramsha Jahangir, a journalist and research scholar and Mr Oves Anwar, Director at the Research Society of International Law.\nAccording to Ejaz Haider, the nature of warfare had not changed, as it had now become a sum-total of kinetic and non-kinetic actions that could be taken to target an adversary’s socio-political, cultural, economic and military spheres.\nOves Anwar urged that Pakistan needed to be at the forefront of developing and shaping the narrative against fake news and disinformation campaigns, while Ramsha Jahangir recommended that it was also important to conduct evidence-based research to take this forward, especially from Pakistan in terms of how disinformation was defined and its long-term and deep repercussions. The webinar was moderated by Sitara Noor, Senior Researcher at CASS.",
  "retrievedAt": "2025-08-11T20:16:11.515Z"
}
