{
  "title": "Christian community in AJK begins Christmas preparations",
  "link": "https://www.app.com.pk/national/christian-community-in-ajk-begins-christmas-preparations/",
  "date_published": "2022-12-13T17:31:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Dec 13 (APP):Amidst an exceptionally conducive environment of traditional communal harmony and cohesion between the majority Muslims and the largest minority Christian community in AJK, Christmas celebrations formally commenced by the Christian community across the state to celebrate sacred festival of Christmas on 25th of December in various parts of AJK, wherever the Christians live.\nUnveiling the ongoing programs to celebrate Christmas in AJK, where a large number of Christians were inhibiting in the adjoining town of Mangla, Head of Christian Welfare Trust and Women Wing AJK Younis Bhatti said that all preparations to celebrate Christmas have yet been given final touches.\nBhatti said in a detailed interview to APP here on Tuesday that the religious festival will be celebrated by the Christian community with full traditional religious enthusiasm in AJK.\nIn Mirpur the advent of Christmas celebrations will be followed by a formal inaugural ceremony to be held at adjoining town of Mangla a day before Christian. Community leader Reverend will formally inaugurate the ceremonies by cutting a cake and special prayer service. These ceremonies, he said would continue till December 25, the Christmas day.\nApplauding the traditional communal harmony between majority Muslim and the minority Christian communities he pointed out that with the blessings of Allah (Almighty) there had never been any tension between the majority Muslims and the minority Christian community – since they pass their lives without intervening into each other affairs by fully respecting the religious and moral parameters of each other.\nBhatti said that the festivities of Christmas comprise special prayer services to be held at the local District Council Hall on December 25 besides at their major abode – Mangla with the renewal of the pledge to continue spreading the teachings of Jesus Christ (AS).\n”The Christian community in the area will offer special prayers for the progress and prosperity of Pakistan”, the Christian community leader said.",
  "retrievedAt": "2025-08-11T16:00:26.776Z"
}
