{
  "title": "Pakistan has ‘irrefutable evidence’ of India’s involvement in Johar Town blast: Sana",
  "link": "https://www.app.com.pk/national/pakistan-has-irrefutable-evidence-of-indias-involvement-in-johar-town-blast-sana/",
  "date_published": "2022-12-13T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Minister for Interior Rana Sanaullah on Tuesday said Pakistan had “irrefutable evidence” of the involvement of Indian agency RAW in the blast at Johar Town, Lahore last year.\n“India was not only behind the Johar Town blast, but also found involved in fanning terrorism in Pakistan,” he said while addressing a news conference here along with Counter Terrorism Department (CTD) Additional Inspector General (IG) Punjab Imran Mehmud.\n“This is a matter of internal security and we are initiating the process to take it up at the international level. The Secretary Foreign Affairs will highlight the issue at different world forums while Minister for Foreign Affairs Bilawal Bhutto Zardari will raise the matter of Indian involvement in terror financing and subversive activities in Pakistan at the United Nations,” the minister added.\nRana Sanaullah said Pakistanis had given innumerable sacrifices in wiping out terrorism from the country. “Pakistan has been facing terrorism for several decades, and Pakistanis including citizens, personnel of armed forces, police, Rangers and agencies, journalists, and politicians have either lost their lives in this war or became its victims.”\nHe said gatherings at mosques, Imambargahs, important buildings and else where were targeted. India had remained involved in every form of terrorism in Pakistan.\nIndia was acting just like an enemy and at the same time trying to conceal its brutalities in the occupied Kashmir, he added.\nThe minister said the arrest of spy Kulbhushan Yadev and his statement was sufficient to prove that India was involved in every act of terrorism in Pakistan and was adopting different ways for the purpose.\nHe said they had “undeniable evidence” that could establish India and its premier spy agency (Research and Analysis Wing) were involved in different terror incidents.\nHe said the Foreign Ministry would raise the issue of Indian involvement in terrorism in Pakistan and also expose it before the world. “After investigation it transpires that India is involved in the Johar Town terror act and its own narrative also tells about its involvement,” he added.\nHe said India had transferred more than $0.8 million to the terrorists to carry out the task.\nThe CTD official briefed the media on the progress in the investigation of the blast that struck Johar Town on June 23, 2021 at 11:09 a.m., claiming three lives, including two policemen, and injuring 22 others. No one had accepted the responsibility of the high intensity explosion due to which seven houses and 12 vehicles were also damaged.\nHe said the accused, who was later identified as Peter Paul David, parked a vehicle with a time bomb containing over 200 kilogram explosive material a few meters away from the targeted location, which exploded after an hour.\nHe said the CTD registered the first information report of the blast. Though no terrorist organisation had accepted the responsibility, yet the department succeeded in tracing the perpetrators within 24 hours, and arresting three of them, including Peter Paul David, Sajjad Hussain and Zia Ullah.\nHe said the first one was Peter Paul David who was traced through the vehicle. He had direct links with two RAW agents namely Ali Budaish and Bablu Srivastava, who had financed the terror act.\nSajjad Hussain, who assisted David in the terror act, was also arrested, he added. The accused had smashed the phone sets, which he used for communication.\nThe CTD official said on the information extracted from David, Zia Ullah, who was the brother of main accused Sami ul Haq, was nabbed. It was the main development that helped the investigation move forward.\nAbout four to five days later, he said, the CTD officials tracked down two more accused Eid Gul and his wife,Ayesha Gul. David had got installed the explosive material in his car by Eid Gul, while latter’s wife made videos of the bomb fixation process.\nHe said on Gul’s pointation, the CTD was finally able to arrest the prime suspect Sami ul Haq, the main handler of RAW-sponsored terror activities in Pakistan. Following a tip-off, he was arrested from Balochistan on April 24, 2022 along with his brother-in-law Uzair Akbar, whose red warrants were also issued.\nDuring the investigation, it transpired that he had been working as a RAW agent since 2012, the CTD chief said.\nThe arrest of Sami ul Haq, he said, led to the capture of another suspect Naveed Akhtar on May 10, 2022. Besides doing recee, Naveed selected the blast target.\nHe revealed that Naveed Akhtar – a labourer, was serving jail term in a Middle East country as he was not able to pay fine. A RAW agent approached him to pay his fine and in return he got involved in terror activities in Pakistan.\nThe official said with the arrest of Naveed, many terror acts were averted. “We have also tracked down three other RAW agents and got issued their red warrants through Interpol,” he added.\nRana Sanaullah said all the law enforcement agencies, including police, CTD and intelligence agencies deserved appreciation for tracing and arresting the perpetrators of the Johar Town blast.\nHe suggested that a coordination mechanism should be in place among the counter-terrorism departments in all the provinces to foil terror activities.",
  "retrievedAt": "2025-08-11T16:00:31.762Z"
}
