{
  "title": "Global focus needs calibration, greater financial stimulus for synergy on climate emergencies: Gen Inam",
  "link": "https://www.app.com.pk/national/global-focus-needs-calibration-greater-financial-stimulus-for-synergy-on-climate-emergencies-gen-inam/",
  "date_published": "2022-12-13T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik on Tuesday said the global focus needed calibration and greater financial stimulus for technology-based global and regional synergy on climate emergencies.\nThe NDMA chair while leading a three-member delegation briefed the UN officials on the country’s disaster management transformation vision. The NDMA Chairman who is in Thailand in an official capacity held meetings with various officials at the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP) in Bangkok, a news release here received said.\nChairman NDMA briefed important UN officials about the context of Pakistan’s resilience-oriented transformation and remodeled the plan to be adaptive.\nThe UNESCAP officials displayed their commitment to work on Early Warning capacity building exchange of intellects for Disaster Risk Reduction in Pakistan at the NDMA level.\nThe meetings were held with Director Information & Communication Technology and Disaster Risk Reduction Division (DRR), Taziana Bonapace, Chief DRR Division Dr. Sanjay K Sarivasta, and Deputy Chief, of Regional Office for Asia and Pacific UNDRR, Diana Patricia Mosquera where prospects for enhanced future co-operation mechanisms to strengthen disaster risk management in Pakistan were discussed.\nDuring the meeting, it was discussed that investment can be mobilized for risk analysis for transformative adaptation. Whereas recently agreed upon loss and damage fund for climate change in COP-27 would be followed up subsequently.\nIt was also informed by the officials of the ESCAP that the upgraded Risk and Resilience portal would be customized for Pakistan on Climate Change, and shall be made accessible for Pakistan to support its forecasting and digitizing the response.\nIt is pertinent to mention that Senior Officials of the Pakistan Embassy in Thailand and Defence Attaché in Thailand also attended the session.",
  "retrievedAt": "2025-08-11T16:00:38.868Z"
}
