{
  "title": "Ashrafi terms OIC GEN Secy’s visit to Pakistan ‘big achievement’ on diplomatic front",
  "link": "https://www.app.com.pk/national/ashrafi-terms-oic-gen-secys-visit-to-pakistan-big-achievement-on-diplomatic-front/",
  "date_published": "2022-12-13T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Tahir Mehmood Ashrafi on Tuesday said the Organization of Islamic Cooperation (OIC) Secretary General Hissein Brahim Taha’s visit to Pakistan was a big achievement on the diplomatic front.\nAddressing a press conference here, Ashrafi, who is also the chairman of Pakistan Ulema Council, said the OIC secretary generals’ visit to Azad Jammu and Kashmir had also given a strong message to the world about its unwavering stance on the Kashmir issue.\nOn this occasion, Hissein had reiterated the Islamic body’s pledge to provide all out support to Pakistan on the Kashmir issue in a more vibrate and effective way, he added.\nHe said Kashmir and Palestine were bleeding for many decades and the world should play its due role to resolve these longstanding issues peacefully.\nThanking to Hissein for his meetings with Pakistani and Kashmiri leadership, he said the OIC had never changed its stance on Kashmir throughout history but some propagators tried their hardest to spread false notions among the people from time to time.\nTo improve the ailing economy and political instability in the country, Ashrafi emphasized the need that Finance Minister Mohammad Ishaq Dar, Presidet Dr. Arif Alvi and Punjab Chief Minister Chaudhry Pervaiz Elahi should play their role to bridge the gap between all the rival political parties.\nHe said Pakistan could be strong from all aspects including social, political and economic when all political forces would unite on one platform and devise a unified policy in the shape of ‘Charter of Pakistan’ on the long-term basis.\n“No doubt, there was dire need of social, electoral and judicial reforms”, he said adding that all political parties should make collective efforts to counter increasing polarization in the society.\nRegarding the Christmas celebrations in the country, Ashrafi said the government, Pakistan Ulema Council and other religious leaders were providing all possible cooperation to the minority community.\nHe said the Ministry of Religious Affairs and Interfaith Harmony would also arrange programmes to share these joyous moments with the Christian community which had been playing a significant role in the development and prosperity of the country.\nHe condemned the foreign defamation campaign against the national security institutions of the country in the strongest terms and proposed the nation to counter it with all possible means.\nHe said in Shaheed Arshad Sharif’s case, the non-state actors tried to create disintegration between the Pakistan Army and nation.\nHe expressed the hope that the killers of senior journalist would be brought to justice but the Arshad Sharif’s case had exposed the facilitators of Indian agenda to the nation.\nAshrafi said the people had badly rejected the propaganda of the Indian spy agency, Research and Analysis Wing (R&AW), against the national defense institutions.",
  "retrievedAt": "2025-08-11T16:00:29.216Z"
}
