{
  "title": "IWMB releases two rescued Pangolin into MHNP",
  "link": "https://www.app.com.pk/national/iwmb-releases-two-rescued-pangolin-into-mhnp/",
  "date_published": "2022-12-13T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): After successful raid conducted on a secret information provided by the informers, the Islamabad Wildlife Management Board (IWMB) staff on Tuesday released two endangered pangolin rescued from the federal capital into the Margalla Hills National Park (MHNP).\nChairperson IWMB, Rina Saeed Khan took to Twitter for celebrating the successful operation and release of endangered species of the most trafficked anteater in the world.\nThe IWMB chair shared videos in a series of tweets projecting a pair of a female and a baby pangolin rescued by the board staff.\n“Here’s some remarkable footage of baby pangolin feeding on mother after being released and feeling safe in the wilderness of Margallah Hills National Park, a rich habitat for pangolins & other endangered species!”\nShe added that the two pangolins would be monitored for next six months so it’s range, movements etc. could be studied. The mother pangolin was installed with a radio transmitter as it would be the first time that a pangolin in Pakistan could be studied so closely in the wild.\nMs Khan also shared that the mother pangolin was radio collared by World Wide Fund for Nature (WWF-Pakistan) and Pir Mehr Ali Shah Arid Agriculture University so it could be tracked.\nShe expressed her felicitations to the IWMB raid team for rescuing the two critically endangered Indian Pangolins (mother & child) in the federal capital whereas the raid conducted by Assistant Director Abbas and team led by Zaheer Khan.\nShe mentioned that both the pangolin appeared to be healthy. “Pangolin are anteaters who feed on termites, ants, etc. They’ve been in captivity for 5 days now so need to go back to wild as soon as possible.”\nThe IWMB chair was of the view that pangolins were heavily trafficked in Pakistan for their body parts especially their scales (sold for hundreds of dollars). “They are disappearing from the wild. Pangolins are harmless species & need to be protected! Zero tolerance for wildlife trade in Pakistan.”",
  "retrievedAt": "2025-08-11T16:00:29.181Z"
}
