{
  "title": "Education minister purposes students, faculty exchange programme with Oxford Pakistan",
  "link": "https://www.app.com.pk/national/education-minister-purposes-students-faculty-exchange-programme-with-oxford-pakistan/",
  "date_published": "2022-12-13T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Minister for Federal Education and Professional Training Rana Tanveer Hussain has purposed a faculty and student exchange programme and scholarships for students with Oxford Pakistan Programme (OPP).\nHe was talking to a delegation of the Oxford Pakistan Programme who visited his office here on Tuesday. Chairman HEC Dr. Mukhtar Ahmed, AS Waseem Chaudhry also attended the meeting, a press release said.\nMinister said that the Government of Pakistan is putting great emphasis on the promotion of quality education including higher education in the country. There is great potential in Pakistani students, for exceptional Pakistani students to study at Oxford there is a need to establish a number of scholarships, especially for women at Lady Margret Hall which is traditionally a women’s college.\nMinister said that there should be faculty and student exchange, scholarships for students, sharing of information and experiences about each other’s academic’s policies and initiatives, organization of seminars and conferences, short-term training, capacity building of staff, and reciprocal visits of officials.\nRana Tanveer was briefed that OPP has three core objectives: to address the under-representation of Pakistani and British Pakistani students at the University of Oxford; to promote academic exchange between Oxford University and Pakistan’s institutions of higher learning and to broaden academic conversations on Pakistan beyond the narrow remits of security and geopolitics.\nRana Tanveer said that Pakistan has around 64% youth with substantial potential to support all key sectors of the economy by developing human capital. The government of Pakistan realizes that it is imperative to provide quality education and opportunities to youth for the socioeconomic development of Pakistan.",
  "retrievedAt": "2025-08-11T16:00:36.522Z"
}
