{
  "title": "National consultative workshop on elimination of child labour held",
  "link": "https://www.app.com.pk/national/national-consultative-workshop-on-elimination-of-child-labour-held/",
  "date_published": "2022-12-13T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): The food and Agriculture Organization of the United Nations (FAO) held a workshop in collaboration with the International Labour Organization (ILO) for the elimination of child labour as termed the present and future of the country.\nA strong common collaboration among all the stakeholders is required to define and achieve the common goal of preventing child labour.\nThus concluded ‘National Consultative Workshop on Elimination of Child Labour in Agriculture/Cotton, Textile and Garment Value Chains in Pakistan’ held here on Tuesday.\nThe workshop was held under the “CLEAR Cotton Project: Eliminating child labour and forced labour in the cotton, textile and garment value chains” (2018-2023). The project was mainly funded by the European Union. Pakistan is among the four countries including Burkina Faso, Mali, and Peru where the CLEAR Cotton Project is being implemented. In Pakistan, the project is being co-implemented by FAO and ILO.\nSpeaking on the occasion, Khemphone Phaokhamkeo, ILO Country Director (Officer in Charge) in Pakistan said that fighting child labour is important for ILO and has been a priority since its establishment in 1919. Pakistan has also ratified 36 international conventions including the ones on the elimination of child and forced labour. As a member state of ILO, Pakistan should take steps to respect compliance of these conventions. The issue of child and forced labour in Pakistan requires our attention amongst other on three areas; Firstly, we need to ensure that all children have access to the quality education; not only up to the primary level but till the time they attain the legal age of being eligible to work. Secondly, a healthy, safe and protective work environment must be provided for the youth. Thirdly, poor should be protected under social safety nets and social protection. All adults must be provided decent work so that they don’t have to pull their children into work.\nFlorence Rolle, FAO representative in Pakistan while addressing the inaugural session said that; “Looking at the statistics of the out-of-school children and stunting rate in Pakistan, we realize that these are the key issues that we need to address. Nonetheless, the question is how? It is often said that children are the future. In my opinion, they are the present. We need to address the present so that they become the future of Pakistan. Almost 70 percent of the child labour in Pakistan is involved in agriculture, therefore, for FAO this is a major concern.”\nAzhar Iqbal Malik, Deputy Secretary Ministry of Overseas Pakistanis, and Human Resource Development and Syed Khalid Gardezi, Additional Secretary Ministry of National Food Security and Research, also represented the government and their respective ministries. They appreciated the project for being inclusive by involving all stakeholders to end the threat of child labour.\nDr. Ulrich Thiessen, First Secretary, EU Delegation, Pakistan while sharing his thoughts said that child and forced labour fall under the eight ILO core conventions and Pakistan ratified the forced labour convention already since 1957 and child labour conventions in 2001 and 2006. These conventions are also part of the list of 27 international conventions and agreements in the EU GSP+ regulations, which offers tariff and quota-free access of the Pakistani exports to the EU market constituting 66% of all exports from Pakistan to EU. Pakistan’s compliance with these 27 international conventions and agreements is also being under EU funded project “International Labour and Environmental Standards Application in Pakistan’s Small and Medium Enterprises”” implemented also by ILO together with WWF since 2016. These actions fall under the EU delegation of Pakistan’s priority areas ‘Poverty reduction’ and ‘Green economic growth.\nProject partners and beneficiaries’ representatives concerned government collaborators, donors and development partners, civil society organizations (CSOs) and other stakeholders relevant to agriculture/cotton, textile, and garment value chains participated in this workshop and presented their achievement as part of clear cotton project across Pakistan.",
  "retrievedAt": "2025-08-11T16:00:26.781Z"
}
