{
  "title": "Rs 138.882 billion disbursed among deserving persons under Ehsaas Cash Program",
  "link": "https://www.app.com.pk/national/rs-138-882-billion-disbursed-among-deserving-persons-under-ehsaas-cash-program/",
  "date_published": "2020-06-24T23:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):An amount of over Rs 138.882 billion has been disbursed among over 11,469,943 beneficiaries under different categories of Ehsaas Emergency Cash Program.\nThe programme was initiated to disburse cash amount of Rs 12,000 among each of those affected from the coronavirus lockdown.\nThe payment process under different categories of the programme was continued across the country.\nAccording to the cash update received by official source on Thursday, a total of over Rs 60.150 billion had been disbursed among over 4,964,415 deserving families in Punjab so far while around Rs 40.209 billion had been disbursed among 3,499,014 families in Sindh.\nOver Rs 25.311 billion had been disbursed among more than 2,085,339 beneficiaries in Khyber Pakhtunkhwa while over Rs 7.080 billion had been disbursed among 582,349 persons in Balochistan. In Azad Jammu and Kashmir, over Rs 2.366 billion had been distributed among 193,576 persons while Rs 1.032 billion had been distributed among more than 84,338 people in Gilgit Baltistan.\nAn amount of Rs 0.736 has been disbursed among more than 60,912 beneficiaries in Islamabad.\nIt is pertinent to mention here that the Khyber Pakhtunkhwa Chief Minister along with Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation Dr. Sania Nishtar inaugurated Ehsaas Langar at Haji Camp Adda, Peshawar the other day.\nDr. Nishtar along with the Khyber Pakhtunkhwa chief minister and secretary visited a payment center for Ehsaas Emergency Cash in Peshawar and reviewed the arrangements made for payments.\nDr. Nishtar also interacted with those eligible beneficiaries at a payment center in Swabi who faced difficulties in receiving payments. The messages were sent to such beneficiaries through 8171 by Ehsaas during the last week again.\nNow deserving persons are smoothly receiving their payments.",
  "retrievedAt": "2025-08-11T19:23:29.729Z"
}
