{
  "title": "Solutions based on reliable data, shared responsibility key to solving drug abuse, illicit trafficking: UN Secretary-General",
  "link": "https://www.app.com.pk/national/solutions-based-on-reliable-data-shared-responsibility-key-to-solving-drug-abuse-illicit-trafficking-un-secretary-general/",
  "date_published": "2020-06-25T02:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):The United Nations Secretary-General Antonio Guterres has said that cooperation, reliable data and evidence-based action are just as vital to addressing the many challenges posed by the world drug problem, protecting people’s security and realizing the Sustainable Development Goals.\nIn a message on the occasion of International Day against Drug Abuse and Illicit Trafficking which is being observed on Friday, June 26, he said this year’s theme “Better Knowledge for Better Care” speaks to the need to build solutions based on facts and shared responsibility.\nHe said the international community has a solid foundation for action, with an agreed legal framework and commitments outlined in the 2019 Ministerial Declaration of the Commission on Narcotic Drugs.\nThe United Nations, in line with its common position on drug policy, is also enriching the evidence base, including through the annual United Nations Office on Drugs and Crime (UNODC) World Drug Report, he added.\nHe said We must also strive to build on what works.  As Prime Minister of Portugal more than two decades ago, my government launched a drug policy rooted in taking strong action in two areas.\nFirst, by cracking down on drug trafficking and those who profit from human misery. And, second, on making sure that those who need treatment get it.  Those who develop an addiction to drugs are first and foremost patients and victims.  That approach succeeded and drug consumption went down significantly, particularly among young people.  Today, Portugal has one of Europe’s lowest death rates from drug use.\nHe said together, we can develop sustainable alternatives to illicit drug crop cultivation; tackle drug trafficking and related organized crime; and advance justice responses as well as prevention, treatment and rehabilitation services for drug use and related HIV interventions.\nAnd we can do so in ways that are sensitive to the needs of women, young people and marginalized groups and that respect human rights.",
  "retrievedAt": "2025-08-11T19:23:29.727Z"
}
