{
  "title": "$2.4 bn tripartite agreement signed for Kohala Hydel Power Project; “Biggest ever” investment on single project: PM",
  "link": "https://www.app.com.pk/national/2-4-bn-tripartite-agreement-signed-for-kohala-hydel-power-project-biggest-ever-investment-on-single-project-pm/",
  "date_published": "2020-06-25T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):A tripartite agreement was signed here Thursday between a Chinese company and the governments of Pakistan and China for construction of 1,124 megawatt Kohala Hydropower Project costing $2.4 billion.\nThe signing ceremony, held at PM Office, was witnessed by Prime Minister Imran Khan, Azad Jammu and Kashmir Prime Minister Raja Farooq Haider, federal cabinet members, Chinese Ambassador in Pakistan Yao Jing, China Pakistan Economic Corridor (CPEC) authority, Chairman Lt. Gen. (R) Asim Saleem Bajwa and representatives of Chinese company.\nIt is the largest power sector investment of $2.4 billion in a single Independent Power Producer (IPP).\nKohala Hydropower Project, being built on Jhelum River in Azad Kashmir under CPEC, has been awarded to Kohala Hydropower Company Ltd (KHCL), which is a subsidiary of China Three Gorges Corporation (CTGC).\nAddressing the signing ceremony, the prime minister while terming the agreement a “great step” towards foreign investment, said Pakistan should have invested in hydro power sector far earlier.\nHe said the country was progressing well when it had been producing hydro power until it started banking on imported fuel which not only made the local industry non-competitive but also put additional burden on foreign reserves.\nThe prime minister said the power generation through imported fuel generation also adversely impacted the environment as Pakistan was among nine countries to get worst hit by climate change which necessitated the promotion of clean energy.\nThe prime minister said Kohala Hydropower Power Project drew the biggest ever investment in Pakistan on a single project.\nPakistan welcomed the investment as it could also set a trend for the country Pakistan to further move towards clean energy for reducing dependence on imported fuel.\nThe prime minister told the AJK prime minister that the project would also create much-needed jobs for youth both during the construction as well as the operations.",
  "retrievedAt": "2025-08-11T19:23:24.805Z"
}
