{
  "title": "AIOU celebrates 2nd anniversary of its facilitation-cum-call center",
  "author": null,
  "content": "ISLAMABAD, Jan 14 (APP):Allama Iqbal Open University (AIOU) celebrated the second anniversary of its Facilitation Center, established on campus to address student issues under one roof, and its Call Center, set up to provide information online to students residing in remote areas.\nThe event was presided over by Vice Chancellor Professor Dr. Nasir Mahmood and was attended by the university’s principal officers and staff.\nThe ceremony began with a cake-cutting, followed by the Vice Chancellor’s address.\nProfessor Dr. Nasir Mahmood reiterated the university’s commitment to enhancing educational standards, increasing enrollment, and maximizing student support facilities using all available resources.\nHe emphasized that students are the university’s most valuable asset, and providing them with necessary support remains a top priority.\nThe Vice Chancellor instructed the Facilitation and Call Center staff to interact with students with kindness and respect, addressing their concerns promptly to ensure they leave satisfied that their issues were heard and resolved efficiently. On the suggestion of the Director of Student Advisory, the Vice Chancellor also directed the establishment of a mechanism for issuing reference letters to students.\nEarlier, the Vice Chancellor, along with principal officers, visited the Facilitation and Call Centers, personally reviewing the services provided at each counter and issuing directives for further improvement.\nThe event was organized by the Directorate of Student Advisory and Counseling Services. Director Student Affairs, Syed Ghulam Kazim Ali gave a detailed presentation on the services of these centers.\nHe shared that the both centers was established in October 2022, facilitation center has resolved issues for 466,872 students, while the Call Center has received 614,574 calls and provided them the required information.\nThe Vice Chancellor praised the efforts of the Directorate of Student Advisory and pledged to address their genuine needs on a priority basis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:38:21.803Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aiou-celebrates-2nd-anniversary-of-its-facilitation-cum-call-center/",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T11:52:00.000Z"
}
