{
  "title": "Wafaqi Mohtasib addressed record number of complaints in 2024",
  "author": null,
  "content": "ISLAMABAD, Jan 14 (APP):The Wafaqi Mohtasib, Ejaz Ahmad Qureshi has said that the office received and redressed a record number of complaints during the outgoing year 2024, which stood at 226,371 and 223,1 71 respectively, indicating an increase of 17% and 16% in the receipt and disposal.\nHe expressed these views while informally interacting with a group of journalists, who called on him at the Wafaqi Mohtasib Secretariat here Tuesday.\nWarmly felicitating the journalists and media persons on the advent of the New Year, the Wafaqi Mohtasib termed members of the media his partner and stakeholders in his efforts to raise awareness about the Wafagi Mohtasib and its services in support of the citizen’s rights.\nHe further added that the outreach of his office was continuously being increased and the new regional offices have been established at Muzaffarabad (AJ&K) and Gilgit which brings the number to 24. He added that the institution is planning to establish more regional offices in remote areas during this year.\nHe further informed that 92.9 percent decisions made by his organization have been implemented during the year 2024, while expressing the resolve to achieve 100% implementation rate. He said that nearly 2.3 million households have benefited from the services of offered by the Wafaqi Mohtasib’s Office since its establishment in 1983.\nThe Wafaqi Mohtasib further added that during 2024, our investigation officers held 126 “Khuli Katcheries” (Open Courts) across the length and breadth of the country, thereby sparing the complainants of the hassle to visit the Mohtasib’s Offices and received administrative justice at the door steps. He went on to add that the Heads of federal government agencies and department have been instructed to ensure implementation of the decisions made by his office within the shortest possible time. He said that the Wafaqi Mohtasib’s office is the poor man’s court established with a view to serving the marginalized and down trodden segments of the society.\nHe said that by virtue of the untiring efforts made by his officers and staff members in theand due to new initiative like “Khuli Katcheries”, Inspection Visits, Informal Resolution of Disputes (IRD), growing number of people are approaching this institution for speedy and free of cost redressal of their complaints.\nTouching on the Mohtasib’s international role, he stated that being President of the Asian Ombudsman Association (AOA) he presided over the 25h meeting of its Board of Directors InIstanbul in June 2024 besides addressing the International Ombuds Summit (10S) in Hong Kong the key note speaker.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:38:25.907Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-addressed-record-number-of-complaints-in-2024/",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T11:18:00.000Z"
}
