{
  "title": "3-day PSARCHE conference 2025 kicks off in Islamabad",
  "author": null,
  "content": "ISLAMABAD, Jan 14 (APP):The three-day international conference titled “Promoting South Asia Regional Cooperation in Higher Education (PSARCHE)”,  kicked off at local hotel here on Tuesday.\nRepresentatives from South Asian countries including Nepal, Maldives, Bhutan, Sri Lanka, Bangladesh and Pakistan are participating in the conference, which is being organized by HEC under its World Bank funded project Higher Education Development in Pakistan (HEDP).\nThe conference has brought together higher education leaders, subject matter experts, and policy makers to deliberate on ways to equip South Asian youth with 21st century skills, particularly keeping in view the labor market trends; changes being brought about by digital world, ODL and Artificial Intelligence; and the significance of research, innovation and commercialization.\nThe conference is expected to create a collaborative environment to foster cross-border collaboration, strengthen regional networks, and lay the groundwork for sustainable improvements in higher education across South Asia.\nWhile addressing the opening ceremony as chief guest, Minister for Federal Education and Professional Training, Dr. Khalid Maqbool Siddiqui appreciated HEC for organising the conference and hoped that it will be an occasion for the participants to share knowledge, exchange best practices, and build partnerships aimed at advancing the collective goals of higher education development in the region.\nThe Minister said that this is a landmark conference and it will pave path for many more to come. He said that cooperation between South Asian countries is not just an opportunity but a necessity. “Your presence and contribution to this dialogue will be instrumental in driving forward these shared goals, and we anticipate collaborating with you on this transformative journey.”\nEarlier in his welcome note, Chairman HEC Dr. Mukhtar Ahmed welcomed the international delegates to the conference. He said that over two billion people live in the South Asian region and they face a lot of challenges. It is heartening to see thought leaders, policymakers and educators coming together to share their knowledge and experiences.\n“We at HEC Pakistan are committed to fostering regional collaboration, particularly within South Asia, to establish a holistic and inclusive higher education ecosystem. This conference will help pave the way to unlock the full potential of higher education in our region.”\nWorld Bank’s Practice Manager for Education South Asia, Dr. Keiko Inoue said that promoting cooperation in higher education among South Asian countries is extremely important for the future development of all the countries in the region.\n“Strengthening research and commercialization processes can create innovations across several industries and services and promote positive development\nin South Asian countries. As the Chairman HEC highlighted the borderless nature of the challenges, solving the issue in one country will not get the job done anymore. We will have to start from our countries but also increase the scope over the region if we really want to get rid of our problems.”\nExecutive Director HEC, Dr. Zia Ul-Qayyum said that higher education is not a localized concern but a global imperative. “We are not talking about education in classrooms but education across the region that technology has made possible. But we must think about equipping ourselves with the tools to make this cooperation possible.”\nThe opening ceremony also featured an overview of South Asian Region Higher Education Regional Cooperation activities to-date by World Bank’s Lead Education Specialist Ms. Nina Arnhold, and a session on Quality Assurance and Accreditation in East Asia and Europe by Senior Advisor, European University Association, Dr. Andree Sursock.\nPSARCHE also held two plenary sessions. The first plenary session, entitled “Higher Education for Economic Development,” was chaired by Senior Education Specialist of World Bank, Dr. Mohan Aryal, with speakers from Bhutan, Pakistan, Maldives Nepal, and Bangladesh. The second plenary session, entitled “Promoting Regional Cooperation to Orient Higher Education to the 21st Century Labour Market” was chaired by Dr. Zia Ul-Qayyum.\nThe first day of the conference concluded with a visit of the foreign delegates to different universities in Islamabad.\nScheduled to continue for another two days, the conference will bring together diverse perspectives and expertise and offer value-rich discussion, keynotes, presentations and visits to high-performing universities of Pakistan that are pioneering the latest Ed-Tech solutions currently available in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:38:22.435Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/3-day-psarche-conference-2025-kicks-off-in-islamabad/",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T11:34:00.000Z"
}
