{
  "title": "CM Bugti directs officers to timely ensure completion of PSDP projects for public welfare",
  "author": null,
  "content": "QUETTA, Jan 14 (APP):Balochistan Chief Minister Mir Sarfraz Bugti on Tuesday directed the officers to ensure full implementation of the projects of PSDP made for public welfare and to remain in constant touch with the people.\nHe expressed these views while chairing a review meeting on the progress of the Public Sector Development Program (PSDP) on Tuesday.\nThe pace and quality of ongoing development projects in the province were discussed in detail during the meeting.\nThe meeting was attended by provincial ministers Mir Muhammad Sadiq Umrani, Mir Shoaib Noshirwani, and Sardar Kohiyar Khan Domki, as well as Chief Secretary Balochistan Shakeel Qadir Khan, Principal Secretary Babar Khan, Additional Chief Secretary Development and Planning Hafiz Abdul Basit and secretaries of all other departments.\nThe Department of Development and Planning briefed the meeting on the physical and financial progress of new and ongoing development projects of the current financial year.\nExpressing strong anger over the slowness and irresponsibility of some departments in development projects, Mir Sarfaraz Bugti said that delays in development projects undermine public trust and such an approach is unacceptable in any case.\n“We have resolved to gradually reduce the problems of the common man, slowness in public interest projects would not be tolerated saying that it is surprising that some departments have not been able to spend even a penny in 9 months”, he remarked.\nThe chief minister clarified that timely completion of public interest projects is the top priority of his government.\nHe directed that all officers should ensure the implementation of the government vision and carry out the instructions related to public welfare with full responsibility.\nHe said that he himself would write the ACR of all officers keeping in mind the practical performance adding that there is no doubt that the officers are talented but the issue is about determination and commitment.\nMir Sarfraz Bugti said that no compromise would be made on public interests, all projects would be completed within the stipulated period, no excuse would be accepted in this regard.\nThe chief minister emphasized that for the first time in the history of Balochistan, 80 percent of the approved schemes have been made part of the budget and the government has resolved that the resources of Balochistan be used for the welfare of the common man.\nHe said that the public should be informed about the government projects and the opinion of the beneficiaries of these projects should be taken so that every individual is aware of the government measures.\nThe chief minister said that the promotion and awareness of development projects would end the negative propaganda impression of unbalanced development in Balochistan.\n“We have made a firm determination that we would spend the resources of Balochistan on the welfare of the people, a clear policy has been given for the quality and time of development projects and we would not back down even an inch on this”, Chief Minister Mir Sarfraz Bugti said.\nAt the end of the meeting, the chief minister said that commitment and determination are needed for public service and this is the time for the officers to demonstrate their capabilities in practice.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:37:57.004Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cm-bugti-directs-officers-to-timely-ensure-completion-of-psdp-projects-for-public-welfare/",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T14:18:00.000Z"
}
