{
  "title": "Pakistan, Turkey agree to further solidify trade, cultural cooperation",
  "link": "https://www.app.com.pk/national/pakistan-turkey-agree-to-further-solidify-trade-cultural-cooperation/",
  "date_published": "2021-01-13T09:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): Pakistan and Turkey Wednesday agreed to further solidify and expand bilateral cooperation in the fields of trade and culture.\nIt was agreed at a meeting between President Dr Arif Alvi and the visiting Turkish delegation, led by Turkish Foreign Minister Mevlut Cavusoglu, which called on him at Aiwan-e-Sadr.\nWelcoming the delegation, the president said that Pakistan and Turkey enjoyed excellent relations and both countries needed to further enhance economic and cultural relations for mutual benefit of the two countries.\nHe informed that Pakistan’s ranking in ease of doing business had tremendously improved and Turkish investors needed to capitalize on investment opportunities in Pakistan. He also expressed satisfaction over the volume of Turkish investment in Pakistan which had grown over $1 billion.\nThe president thanked the Turkish leadership for its principled stance on Indian Illegally Occupied Jammu and Kashmir.\nHe asked the Turkish foreign minister to convey his gratitude to President Recep Tayyip Erdogan for raising the voice of Kashmiris during his recent speech at UN General Assembly.\nHe also appreciated Turkey’s leading role in the global efforts to fight COVID-19 pandemic by providing assistance and support to Pakistan and other countries.\nConveyed greetings and best wishes of President @RTErdogan to President Alvi.\n Pakistan is our second home.\n We are in Islamabad to further our excellent relations.\n Will proudly carry the “Hilal-e Pakistan Award”.\n #Turkey-Pakistan Dosti Zindabad!  pic.twitter.com/O5QBNmK1S3\n— Mevlüt Çavuşoğlu (@MevlutCavusoglu) January 13, 2021\nThe Turkish Foreign Minister said that Turkey was keen to improve trade relations with Pakistan.\nHe added that Turkey would continue encouraging its companies to invest in Pakistan. Mevlut Cavusoglu assured that his country would continue to support Pakistan at international fora.\nHe appreciated Pakistan’s support to Azerbaijan on Nagorno Karabakh.\nBoth sides underlined the need to work closely on joint initiatives to combat Islamophobia, hate speech and other manifestations of intolerance towards Islam.\nEarlier in a tweet, the Turkish foreign minister said during the meeting, he had conveyed President Erdogan’s greetings and best wishes to President Alvi.\nCalling Pakistan as “our second home,” the Turkish foreign minister said they were in Islamabad to further strengthen the excellent bilateral relations.\nThe foreign minister who was conferred Pakistan’s second highest civil awars by the president at a special investiture ceremony, said he would “proudly” carry the “Hilal-e-Pakistan Award”.",
  "retrievedAt": "2025-08-11T20:14:19.326Z"
}
