{
  "title": "COVID-19 claims 55 more lives, over 2,123 new cases reported",
  "link": "https://www.app.com.pk/national/covid-19-claims-55-more-lives-over-2123-new-cases-reported/",
  "date_published": "2021-01-13T07:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): The national tally of total active COVID-19 cases in Pakistan on Wednesday reached 33,102 as 2,123 more people tested positive for the deadly virus and 2,973 people recovered from it during the last 24 hours.\nFifty-five corona patients had lost their lives out of which 50 were under treatment in hospitals and five three others in their respective homes or quarantines, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths occurred in the Punjab followed by Sindh. It added that out of the total 55 deaths during last 24 hours 36 patients died on ventilators.\nNo COVID-19 affected person was on ventilator in Azad Jammu and Kashmir (AJK) and Balochistan while 322 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 56 percent, Lahore 35 percent, Bahawalpur 55 percent and Peshawar 32 percent.\nThe maximum oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID-19 patient) was also occupied in four major areas of Peshawar 51 percent, Multan 33 percent, Karachi 38 percent and Rawalpindi 29 percent.\nSome 39,450 tests were conducted across the country on Tuesday, including 12,566 in Sindh, 14,005 in Punjab, 5,917 in Khyber Pakhtunkhwa (KP), 5,710 in Islamabad Capital Territory (ICT), 514 in Balochistan, 370 in GB, and 368 in AJK.\nAround 464,950 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 508,824 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,521, Balochistan 18,467, GB 4,882, ICT 39,462, KP 62,018, Punjab 146,525 and Sindh 228,949.\nAbout 10,772 deaths were recorded in country since the eruption of the contagion.\nAround 3,730 perished in Sindh among 22 of them died on Tuesday, 20 of them died in hospital and Two out of the hospital.\n4,323 in Punjab had died with 24 deaths in past 24 hours, 21 of them perished in the hospital and three out of the hospital on Tuesday.\n1,748 in KP where five of them died in hospital on Tuesday, 447 in ICT where four of them died in the hospital on Tuesday, 188 in Balochistan, 101 in GB and 235 in AJK succumbed to the deadly virus.\nA total of 7,202,076 corona tests have been conducted so far, while 629 hospitals are equipped with COVID facilities. Some 2,850 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:14:21.062Z"
}
