{
  "title": "I salute Lahorites for rejecting PDM’s public meeting: Usman Buzdar",
  "link": "https://www.app.com.pk/national/i-salute-lahorites-for-rejecting-pdms-public-meeting-usman-buzdar/",
  "date_published": "2020-12-14T11:16:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 14 (APP): Punjab Chief Minister Sardar Usman Buzdar on Monday hailed the people of Lahore for staying away  from unlawful public meeting of Pakistan Democratic Movement (PDM) at Minar-e-Pakistan when the  country was facing novel coronavirus pandemic.\n“I extend my special thanks to the Lahorites for their sagacity and wisdom in listening to the advice  of government as such uncalled for public gatherings could make people a fodder of the deadly virus”,  Buzdar said at the foundation stone laying ceremony of F-Block of the Lahore Press Club Housing Scheme here at Harbanspura.\nChief Minister Sardar Usman Buzdar said it was not possible to allow such a public meeting when their had been a surge in the coronavirus cases during the second wave of COVID-19 in the country, adding that PDM’s action was illegal and without any justifiable reason.\nBuzdar said that Lahore Press Club Housing Scheme was his second home and he would play his due role in the completion of all development work in the journalist colony.\nHe asked SACM Dr Firdous Ashiq Awan to hold meeting with LPC president Arshad Ansari and apprise him of the issues faced by the residents of Lahore Press Club Housing Scheme.\nThe CM said the PTI government would soon announce Lahore Press Club Housing Scheme Phase-II in order to provide a home to journalists as per the vision of Prime Minister Imran Khan.\nHe said that Universal Health Card would be provided to 50 percent population in the province by the end of this year while the rest of people would receive health cards by the end of 2021, adding that Prime Minister had instructed to provide health cards and this health facility was being provided in very few countries of the world.\nThe Chief Minister said the PTI government did not believe in empty slogans, adding that his government had taken practical steps and the people could see the impact of various development projects started by his government.\n“I recently announced a multi-billion rupee mega development projects for the city of Lahore and the government has planned similar development projects for the other 35 districts of the province”, Buzdar said, all problems faced by the provincial metropolis would be addressed in the shortest possible time.\nEarlier, Chief Minister Punjab Sardar Usman Buzdar inaugurated development work at the F-Block of the Lahore Press Club Housing Scheme.\nThe Punjab government, on the direction of the Chief Minister Usman Buzdar, got the land of F-Block vacated from the land mafia and announced development work including laying of roads and other facilities.\nSpecial Assistant to the Chief Minister (SACM) on Information Dr. Firdous Ashiq Awan, President Lahore .\nPress Club (LPC) Arshad Ansari, members of LPC governing body, government officials and a large number of journalists were present during the foundation stone laying ceremony.",
  "retrievedAt": "2025-08-11T20:08:33.876Z"
}
