{
  "title": "Media’s role vital in disseminating true information on COVID-19: Dr Faisal",
  "link": "https://www.app.com.pk/national/medias-role-vital-in-disseminating-true-information-on-covid-19-dr-faisal/",
  "date_published": "2020-12-14T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Special Assistant to the Prime Minster (SAPM) on National Health Services, Regulations and Coordination Dr Faisal Sultan on Monday said the role of media was important in creating public awareness about adopting preventive measures and sharing relevant accurate information about COVID-19.\nAddressing the participants of a day-long online workshop for health journalists on ‘COVID-19: understanding and reporting the pandemic’, he lauded the role of civil society and media for keeping the public informed about the coronavirus.\nThe workshop was organized here by The Trust for Democratic Education and Accountability (TDEA) in collaboration with Ministry of National Health Services.\nThe SAPM said the risk of COVID-19 related misinformation and stigmatization posed a critical challenge that would require a concerted effort on the part of all stakeholders, especially the media.\nHe particularly reinforced the need for careful timely reporting with the additional challenge of fact checking for the media to pursue.\nHe apprised the workshop participants of the challenges posed by COVID-19 and the measures taken by the government to curb the second wave of the pandemic. He identified trends in the rise of COVID-19 wherein new cases were increasing and had almost reach 3,000 daily mark.\nHe pointed out additional challenges that might hamper sharing of authentic information among the citizens as well as the decision-makers.\nDr Faisal said many countries were facing tthe second and third wave of the disease with more complications.\nPakistan was also facing same situation as in the second wave the disease was spreading in the country in short time, he added.\nHe advised the citizens to continue following the social distancing, use of masks and other precautionary measures to stop increasing local transmission of COVID-19 in the country.\nImportant decisions had been taken keeping in view the prevailing corona situation of all provinces with an objective to ensure containing the disease, he stressed.\nThe SAPM said there were threats of further increase in number of corona cases throughout the country, which could increase load on the already overburdened health system. He asked the citizens to ensure adopting safety measures to protect themselves.\nHe said the government had adopted an effective strategy to combat COVOD-19 for reduction in the corona cases in the country.\nThe present facts and figures of the disease showed increasing trend of the coronavirus and the government had taken measures for prompt response, he added.\nDr Faisal appreciated the collaborative effort for organizing the workshop and expressed the hope that it would help the media report on the pandemic better.\nFormer SAPM on National Health Services, Regulations and Coordination Dr Zafar Mirza said strategies were made to control the disease keeping in view the global information, focusing on data with integration of local data in a scientific way.\nThe input from the stakeholders concerned was also considered to avoid any missing aspect.\nHe added the violation of standard operation procedures related with the COVID-19 was the main reason behind the increasing trend as the people had started ignoring all preventive measures.\nHe asked the citizens to support the government’s efforts in effectively dealing with the second wave of COVID-19 by adopting all preventive measures against the disease.\nThe workshop was arranged for leading health journalists with a view to appraise and enhance the participants’ understanding of critical aspects of the COVID-19 pandemic response.\nThe subject matters covered included understanding and access to COVID-19 data, the types of COVID-19 testing and information about vaccines.",
  "retrievedAt": "2025-08-11T20:08:28.513Z"
}
