{
  "title": "Railways retrieved 180.754 acre land during last year",
  "link": "https://www.app.com.pk/national/railways-retrieved-180-754-acre-land-during-last-year/",
  "date_published": "2020-12-14T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Ministry of Railways has retrieved as many as 180.754 acres of its precious land in eight divisions of the country in its anti-encroachment drive conducted during last year.\n“Regular anti-encroachment operations are being carried out at all railway divisions with assistance of Railways Police and District Administration,” an official in the Ministry of Railways told APP.\nGiving division wise details, he said, Pakistan Railways had recovered 36.642 acres in Peshawar Division, 5.257 in Rawalpindi Division, 19.827 in Lahore Division, 0.512 in Mughalpura, 64.565 in Multan Division, 8.357 in Sukkur Division, 39.650 in Karachi Division and 5.367 acres in Quetta Division.\n“Pakistan Railways has owned 167,690 acres land across the country out of which Punjab has 90,326 acres, Sindh 39,428 acres, Balochistan 28,228 acres and Khyber Pakhtunkhwa has 9,708 acres,” he added.\nHe said the Geographic Information System (GIS) survey had also been conducted under the project of computerization of railway land records in which all the encroachments and leases had been recorded in the Pakistan Railways Land Management Information System (PRLMS) software.\nThe official said the database was under verification and being compiled. For the last two years, he said, Pakistan Railways has been doing its utmost to get the problem of land encroachment resolved where thousands of acres of land had been occupied for commercial, residential and agriculture purposes.\nTo a question, he said Pakistan Railways has finalized inquiries of 44 passenger train accidents while 22 accidents related to goods trains were being dealt with by the respective divisions in accordance with rules of the department.",
  "retrievedAt": "2025-08-11T20:08:35.132Z"
}
