{
  "title": "Zulfi Bukhari vows to protect ‘Khatam-e-Nubuwwat’",
  "link": "https://www.app.com.pk/national/zulfi-bukhari-vows-to-protect-khatam-e-nubuwwat/",
  "date_published": "2020-12-14T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari Monday said the Pakistan Tahreek-e-Insaf government had always played a key role in protection of ‘Khatam-e-Nubuwwat’ and it would continue to discharge the obligation under the leadership of Prime Minister Imran Khan.\n“The Muslim Ummah and Pakistani nation are proud of the prime minister for raising voice for the sanctity of the finality of Prophethood and advocating the concept of the welfare state of Madina,” he said while addressing the Annual International ‘Khatam-e-Nubuwwat’ conference here.\nThe SAPM said Imran Khan also suggested to the international community to devise a legal framework to protect the faith of Khatam-e-Nubuwwat (Finality of Prophethood of the Holy Prophet) as the belief in finality of the Prophethood of the Holy Prophet was our entire faith.\nIslam spread in the sub-continent not through sword, rather teaching and preaching of Muslim scholars, Sufis and saints, he added.\nBukhari said the life of the Holy Prophet (PBUH) was a complete code of life for all social cohorts of humanity whereas overwhelming youth of the Muslim Ummah could play a key role in disseminating the true message of Islam.\n“We are ready to sacrifice our lives, properties and even our sons for this sacred cause and no body will be allowed to play the sentiments of Muslims,”he remarked.\nCustodian of Golra Sharif, Pir Syed Ghulam Nizam ud Din Jami Gilani Qadri in his keynote address said ” there should be no conflict and violence in the ranks of Muslim Ummah and all his devotees and followers should take the message of peace and harmony to every Muslim in the society.”",
  "retrievedAt": "2025-08-11T20:08:31.325Z"
}
