{
  "title": "Talks with India not possible until revocation of J&K’s status: PM Office",
  "link": "https://www.app.com.pk/national/talks-with-india-not-possible-until-revocation-of-jks-status-pm-office/",
  "date_published": "2023-01-17T08:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): A spokesperson of the Prime Minister’s Office on Tuesday said that Prime Minister Shehbaz Sharif has consistently maintained that Pakistan and India must resolve their bilateral issues, especially the core issue of Jammu and Kashmir, through dialogue and peaceful means.\nThe statement came in reference to PM Shehbaz Sharif’s interview with Al Arabiya channel, where he spoke in length about India’s violation of the Article 370 of its Constitution that granted autonomy to Jammu and Kashmir.\nThe spokesperson mentioned that PM Shehbaz Sharif has repeatedly stated on record that talks can only take place after India reversed its illegal action of August 5, 2019.\n“Without India’s revocation of this step, negotiations are not possible,” the statement read. “The settlement of the Kashmir dispute must be in accordance with the UN resolutions & the aspirations of the people of Jammu & Kashmir.”\nThe spokesman said that the prime minister made this position very clear in his interview with Al Arabiya news channel during his recent visit to the United Arab Emirates.\nThe prime minister during the interview also highlighted the flagrant human rights violations in J&K, saying that India had usurped a semblance of autonomy given to the Kashmiris according to Article 370 of the Indian Constitution. The autonomy was revoked on August 5, 2019.\nHe pointed out that minorities in India were being persecuted, adding “This must stop so that message can go around the globe that India is ready to have talks.”\nShehbaz said India and Pakistan were neighbours and they had to live with each other.\n“It is up to us to live peacefully and make progress or quarrel with each other, and waste time and resources. We have three wars with India and it only brought more misery, poverty, and unemployment to the people,” he said. “We have learnt our lesson and we want to live in peace provided we are able to resolve our genuine problems.\nEmphasizing the importance of peace, he said, “We want to alleviate poverty, achieve prosperity, and provide education and health facilities and employment to our people and not waste our resources on bombs and ammunition, that is the message I want to give to Prime Minister Modi,” he added.",
  "retrievedAt": "2025-08-11T05:45:29.216Z"
}
