{
  "title": "National anti-polio drive continues",
  "link": "https://www.app.com.pk/national/national-anti-polio-drive-continues/",
  "date_published": "2023-01-17T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): The first nationwide anti-polio campaign of the year continued on Tuesday to vaccinate over 44.2 million children under the age of five against the crippling disease of polio.\nAccording to official sources, to provide maximum protection and boost a child’s immunity, polio teams are also giving a dose of Vitamin-A to children aged six to 59 months in addition to polio drops during the drive.\nThe campaign will continue till January 20 across the country, involving districts of Punjab, Sindh, Khyber Pakhtunkhwa, Balochistan, and Islamabad.\nThe government had fixed the target to vaccinate over 10 million children in Sindh, over 421,000 children in Islamabad, 2,599,000 children in Balochistan, over 7,458,000 children in Balochistan, and over 278,000 children in Gilgit Baltistan, they added.\nThe sources said that over 350,000 trained and dedicated ‘Sehat muhafiz’ members had been engaged in the vaccination drive to inoculate the targeted children at their doorstep.\nOn this occasion, Federal Minister for National Health Services, Regulations, and Coordination, Abdul Qadir Patel said, “If we can eliminate the poliovirus from southern KP, we will succeed in eliminating polio from Pakistan altogether.”\nHe added, “We are quite close to the finish line, and we are determined to get there as soon as possible.”\n“Pakistan has made great strides in the fight against polio, with virus circulation reduced to only one small part of the country,” Patel highlighted.\nDr Shahzad Baig, Coordinator of the National Emergency Operation Centre emphasised that the anti-polio campaign required collective action at all levels to eradicate the poliovirus from the country completely.\nHe said that the aim was to ensure timely and repeated vaccination of eligible children.\n“High-risk districts are our top priority, and we are keen to eliminate the poliovirus from the challenging areas while protecting the rest of the region as well,” he added.\n“I particularly urge all parents and caregivers to get their children vaccinated instead of hiding them or refusing to take the necessary drops during all vaccination drives.\nIt is important to realise that the polio virus still exists in our surroundings, and no child is safe until all children are truly vaccinated,” Dr Shahzad said.\nIt is worth mentioning here that the National Emergency Operation Centre issued the “Sehat Tahhafuz” Helpline 1166 and 24/7 WhatsApp Helpline 0346-777-65-46 to assist the parents and caregivers in reporting the missed children.\nSources added that repeated polio vaccination campaigns were imperative for building immunity among children and preventing possible death or lifelong paralysis.",
  "retrievedAt": "2025-08-11T05:45:13.425Z"
}
