{
  "title": "President for realizing full potential of Sino-Pak bilateral trade",
  "link": "https://www.app.com.pk/national/president-for-realizing-full-potential-of-sino-pak-bilateral-trade/",
  "date_published": "2023-01-17T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): President Dr. Arif Alvi on Tuesday stressed enhancing bilateral trade with China, which currently stands at US$ 27.8 billion, and said the strengthening of business could prove mutually rewarding.\nTalking to the outgoing Chinese ambassador Nong Rong here at the Aiwan-e-Sadr, the president noted that under China Pakistan Economic Corridor (CPEC), 19 projects were completed, 28 were under construction while 41 were in the pipeline.\nPresident Alvi said the CPEC was a transformational flagship project of the Belt and Road Initiative, which had the potential to act as the pivot of regional peace and connectivity.\nThe expeditious completion of four broad clusters of cooperation  — Gwadar Port and its auxiliary features, energy projects, transport infrastructure and industrial cooperation including the development of Special Economic Zones (SEZs) — will change trade, business and investment outlook of the country, he said.\nThe president observed that with shifts underway on the world stage, there was a need to further expedite the progress on CPEC so that the goods should start moving from South China to Gwadar port and upward in a regular manner.\nThe second phase of CPEC should be pursued expeditiously to promote agriculture; innovation and IT sector; industrial cooperation; livelihood generation and poverty alleviation; automobiles, textiles and leather manufacturing; and shifting of Chinese industries to Pakistan wherever possible, he added.\nThe president noted that the signing of China-Pakistan Free Trade Agreement in January 2020 had further liberalized the trade resulting in a significant expansion in trade volumes adding that as per data for the first 11 months of 2021, bilateral trade reached a record high at US$ 27.8 billion registering an increase of 60 percent with the corresponding period of 2020.\nPakistan’s exports amounting to 3.6 billion US $ also registered an increase of 68% year over year.\nThe president expressed his satisfaction over the encompassing cooperation between the two countries in the fields of defence to socio-economic development.\nHe conveyed his deepest gratitude to the people of China and President Xi Jinping for extending generous financial support to Pakistan which helped the country to deal effectively with the financial situation faced by it and during global warming-induced super floods last year which proved helpful in alleviating the suffering of the flood affected persons.\nHe said the Chinese grant to the Presidency would be used to build a digital outreach platform to provide help to people under stress or facing mental health issues.\nHe said that the First Lady during her upcoming visit to United Kingdom would engage the psychologists and psychiatrists of the Pakistani diaspora in United Kingdom to seek their active involvement to provide online counselling and advice to people facing mental health situations.\nThe president expressed the hope that the approaching year of the Rabbit would be monumental for Pakistan-China relations.\nHe appreciated the outgoing ambassador for representing China with dignity and grace in the best traditions of Chinese diplomacy and wished him success in his future professional assignments.",
  "retrievedAt": "2025-08-11T05:45:30.033Z"
}
