{
  "title": "Failure of PTI in Sindh LG polls just a trailer: Kundi",
  "link": "https://www.app.com.pk/national/failure-of-pti-in-sindh-lg-polls-just-a-trailer-kundi/",
  "date_published": "2023-01-17T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi Tuesday said that failure of Pakistan Tehreek-i-Insaf (PTI) in the second phase of the local government elections in Sindh was just a trailer; the movie is still there.\n“The way people of Karachi and Hyderabad took revenge from PTI in this election, the people of Punjab and Khyber Pakhtunkhwa are going to do the same in future”, he said in a presser along with the Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri.\nCriticizing PTI for their allegations of rigging in the election, the SAPM said that PTI should highlight this issue at a proper forum if they think the rigging took place in real.\nHe said that Khyber Pakhtunkhwa was handed over to PTI as a peaceful province but it, through ineffective policies and incompetence, has brought the province to the verge of default.\nThe Khyber Pakhtunkhwa government has no funds to pay salaries of the government employees, he said.\nKundi added that PTI did not fulfill its promises to turn South Punjab into a province and develop the area.\nThe way Chairman PPP, Bilawal Bhutto pursued a prudent foreign policy to rectify the strained relation with different countries reflect his political and diplomatic wisdom.\nFaisal Kundi informed that a dynamic survey will start this month under the Benazir Income Support Programme (BISP) to register more poor households.\nThe preparations for the launching of the dynamic survey have been entered into the final stages and the survey would be launched this month.\nHe also conveyed that the first quarterly installment of Benazir Kafalat programme has been released and the payment process was being carried out smoothly across the country.\nAround 7.7 million families would receive over Rs. 55 billion in the first tranche. Women beneficiaries should report to the BISP offices in case of any deductions by the retailers.\nFederal Minister for Poverty Alleviation and Social Safety Shazia Marri also addressed the news conference and said that politically sensible masses of Sindh have announced their decision by voting for PPP and PTI can only mourn if this decision is not acceptable to it.\nThe masses have announced their decision in the local government election which should be accepted by all the political parties.\nShe criticized PTI for levelling baseless allegations of rigging in elections and said that PTI members are U-turn masters. They are misguiding people as they did during their four-year tenure.\nShazia Marri said that PPP after becoming the single largest party in Karachi city has now more responsibilities towards the masses which it would fulfill under the able leadership of Chairman PPP, Bilawal Bhutto.\nResponding to a question, Shazia Marri said that all the political entities should have participated in the election and those who faced defeat should learn from mistakes instead of crying.\nShe said that PPP is a part of the coalition government for achieving economic stability in the country which is in the larger interest of the country.\nDespite Imran efforts to create chaos in the country, “We will work to bring economic stability”, she said.",
  "retrievedAt": "2025-08-11T05:45:19.943Z"
}
