{
  "title": "Four-day Capital Book Fair concludes",
  "link": "https://www.app.com.pk/national/four-day-capital-book-fair-concludes/",
  "date_published": "2023-01-17T15:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): The Four-day Capital Book Fair arranged by the Department of Libraries in collaboration with other partners concluded on Tuesday in the federal capital after receiving overwhelming response from the visitors.\nThe book fair, held here at the Art and Craft village, was arranged in collaboration with Metropolitan Corporation Islamabad (MCI) and Islamabad Capital Territory (ICT), on the special directives of Chief Commissioner Islamabad and CDA Chairman Captain (Retd) Muhammad Usman Younis.\nThe chief commissioner also visited the book fair and stressed the need to further promote book culture in the society, saying, “books are the best companions for us and every intellectual acknowledges the fact that there is no friend better than books.”\nMore than 60 book stalls were set up at the book fair with the books of famous publishers, writers, poets, and eminent personalities of the country, including two books written by Inspector General of Police, Islamabad, Akbar Nasir Khan.\nThe book fair offered a huge number of books on discounted price and was visited and appreciated by the people from different walks of life, including writers, researchers and students.\nThe objectives behind arranging this book fair were to revive the book reading habit among general public, especially youth, and preserve our literary and cultural heritage.\nBook lovers, especially students and researchers, belonging to the twin cities Rawalpindi and Islamabad visited the book fair to quench their thrust for knowledge.\nThe visitors also appreciated the efforts of the organizers for arranging such event and said such activities helped promote positive and healthy activities among people.\nSidra Khan, a visitor at a book stall while talking to APP said, “This book fair is the much-needed activity to instill book reading culture among the youth, who are instead more focused on the electronic gadgets.”\nShe appreciated the step taken by the Department of Libraries for promoting book culture in the society and urged the educational and literary departments to keep arranging such activities on regular basis to attract the youngsters towards a productive activity and strengthen their bond with books.\nAnother visitor, Alia Abbasi who is a school teacher said that unfortunately the culture of reading books was almost becoming non-existent “in our society due to many reasons, including high prices of books and easy access to books on internet.”\nShe said that advancements in the field of technology and price reduction of internet packages had increased “our screen time and we have almost forgotten the feel of book, which is not a healthy trend for the society.”\n“The use of technology is not bad but youth had almost given up book reading which is unhealthy trend, and the activities like this book fair are an important step towards revival of book culture in the society”, she added.\nA delegation of the Islamabad Chamber of Commerce and Industry (ICCI), led by its President Ahsan Bakhtiawari, visited the book fair on the third day and appreciated the efforts of the ICT and the Department of Libraries for organizing the event for book lovers of the twin cities.",
  "retrievedAt": "2025-08-11T05:45:15.240Z"
}
