{
  "title": "Nation should guard its sovereignty against regime change conspiracy: PM",
  "link": "https://www.app.com.pk/national/nation-should-guard-its-sovereignty-against-regime-change-conspiracy-pm/",
  "date_published": "2022-04-08T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP):Prime Minister Imran Khan Friday said that the nation would have to safeguard its sovereignty at a time when the country was faced with a regime change conspiracy.\n“At a time when the conspiracy of regime change was being hatched, the nation will have to protect its sovereignty. Who else will do it,” the prime minister said in an exclusive interview with PTV’s Ramzan transmission program Bunyad Ramzan hosted by Najam Sheraz.\nThe prime minister said being rich with immense potential, Pakistan was on the course to become a nation.\nHe said Pakistan, a 220 million nation, was unfortunate to have the leaders with a mindset of “beggars can’t be choosers” – a reference to opposition leader Shahbaz Sharif’s statement he gave in support of the United States after the government disclosed its foreign regime conspiracy against Pakistan.\nHe said such leaders always usurped the people’s potential.\nThe prime minister said in our society, the corrupt leaders, in connivance with the corrupt set up and media, ended the discrimination between good and bad.\n“The nations always emerge through self-esteem… Pakistan has a great potential. This nation will rise anytime… We are yet on the course to become a nation,” he remarked.\nTo a question, the prime minister said Madina State could not be replicated in Pakistan all of a sudden as the whole nation would have to play its role, though initially, a very few people led every struggle.\nHe said Pakistan could not become a great nation unless we don’t revert to the basic objective of Pakistan’s creation like an Islamic welfare state replicating the Madina State.\n“Unfortunately, we deviated from those objectives and never tried to follow those principles which consequently led to the ethnic and provincial biases. In East Pakistan, 99pc of the people had voted for Pakistan. But we had lost the ideology and failed to ensure justice among the provinces,” he recalled.\nExplaining his vision of Madina State model, the prime minister said every welfare state took full responsibility of its citizens.\nHe said unfortunately, the country’s education system never taught the youngsters Seerat un Nabi (PBUH) which needed to be rectified.\nAs the interviewer recalled his decades old struggle against Islamophobia after 9/11, the prime minister said he saw Islamophobia growing which triggered reaction from the Muslim.\n“No Muslim scholar ever spoke to explain the west as how Muslims revered their Holy Prophet (PBUH). After becoming the prime minister, I talked to the Muslim world leaders against the injustice being meted out to the Muslims,” he added.\n“Thanks to Allah Almighty, this is distinction of Pakistan. We are a country which spearheaded a resolution which led to the designation of March 15 as International Day to Combat Islamophobia by the United Nations,” he remarked.\nHe said every modern state like Switzerland and China followed the the principles of the Madina State, but the Muslim world failed to do so.\nHe said the Rahmatullil Alamin Authority would help to acquaint the youth with Seerat un Nabi (PBUH) as well as Islamic culture through lectures, films as well as cartoons for the children. It will also provide scholarly answers to the contemporary issues and suggest ways to protect the children from the negative impacts of modern technology and onslaught of western content through mobile phone and films.",
  "retrievedAt": "2025-08-11T14:40:20.326Z"
}
