{
  "title": "Security measures, road closures cause massive traffic jams in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Commuters in the federal capital witnessed massive traffic congestion on main roads on the eve of Independence Day on Wednesday.\n\nThe congestion was caused by the security arrangements put in place for the Marka-i-Haq victory celebrations.\n\nMiles-long queues of vehicles were seen on main roads and adjacent arteries. Bumper-to-bumper traffic moved slowly or with frequent stops for hours.\n\nSealing of sectors and roads, including G-7 and G-6, portions of Srinagar Highway, Khayaban-i-Suharwardy, Murree Road and Seventh Avenue, also worsened the situation and caused further traffic jams.\n\nDozens of traffic staff were deployed to ensure the smooth flow of vehicles, but the scale of congestion was beyond their management capacity. The traffic staff failed to manage the flow and prevent gridlock.\n\nMiles-long queues of vehicles were seen on main roads and adjacent arteries\n\nThe Marka-i-Haq victory celebrations were held at the Sports Complex, leading to the closure of several roads for the public. Traffic congestion began in the early evening and within minutes, hundreds of vehicles were stuck in mile-long queues.\n\nA motorist, Azam Abbasi, told Dawn he took one hour to travel from Sector G-6 to Zero Point. “I faced the first traffic blockage on the G-7 bridge on Seventh Avenue, from where I turned towards Blue Area, where I again faced congestion due to the closure of the service road. Then I moved towards Jinnah Avenue to reach Zero Point.\n\n“But at Faisal Avenue, both entrances to Kashmir Highway and Khayaban-i-Suharwardy were blocked. I then tried to reach the G-8 side to cross the G-7 overhead bridge on Faisal Avenue before using Sitara Market road to get to Zero Point. This was a terrible one-hour journey,” he said.\n\nAnother commuter, Mohammad Abbas, said that due to roadblocks at all major intersections, it took him over an hour to travel from Banigala to Zero Point.\n\nHe added that due to a network outage in the vicinity of Aabpara, it was almost impossible to book a ride.\n\nAbdullah, another motorist, said, “I was going home from Blue Area but got stuck at Zero Point for hours.” Khan Mubarak, also caught in the traffic, said he had to travel from G-7 to F-11 but returned as it was a “challenging and painful experience, a real test of patience” in such a traffic mess.\n\nOn Tuesday, the capital administration declared a local holiday in Islamabad on Wednesday and closed trails in Margalla Hills and a few parks for the public as part of security measures for the celebrations.\n\nThe holiday applied to the capital except for essential services. Trail 3, Trail 4, Trail 5, the trail behind Saidpur Village, LakeView Park, Daman-i-Koh, Pakistan Monument and Shakarparian were closed.\n\nA notification issued by the office of District Magistrate Irfan Nawaz Memon stated, “It is notified that August 13, 2025 (Wednesday), is hereby declared as a local holiday within the revenue limits of Islamabad Capital Territory except the offices of essential services in Islamabad including MCI, CDA, ICT Administration, ICT Police, IESCO, SNGPL and hospitals.”\n\nHowever, several business centres, including banks and educational institutions, remained open in the capital.\n\nThe administration said the holiday was declared to avoid traffic congestion as well, but since many business centres, federal government offices and educational institutions remained open, heavy traffic began building up in the early evening as people started returning home.\n\nPolice said that a few thousand police officials were deployed in the city for security and traffic management on Wednesday. A contingent of the forces also remained present on the roads and around the venue.\n\nPersonnel of the police and other forces were also deployed on routes and at traffic signals.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/14114704c39763f.jpg",
  "retrievedAt": "2025-08-16T07:38:44.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930794/security-measures-road-closures-cause-massive-traffic-jams-in-islamabad",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T02:53:11.000Z"
}
