{
  "title": "Asif fails in medal quest despite stunning break at World Games - Sport - DAWN.COM",
  "author": null,
  "content": "CHENGDU: Pakistan’s snooker hopes were dashed at the World Games as Mohammad Asif suffered consecutive defeats in the semi-final and bronze medal match, despite producing a breathtaking 141 clearance here at the Civil Aviation Flight Univer­sity’s Tianfu Cam­pus Gymnasium on Wednesday.\n\nAsif, aiming for a podium finish as an independence day gift for Pakistan, first fell to China’s Xiao Guodong in the semi-finals. Guodong — who won the Wuhan Open title last year — dominated the encounter, securing a commanding 2-0 victory.\n\nThe 36-year-old home player sealed the first frame emphatically 80-0, featuring a 58-break, and clinched the second frame 65-47 to advance to the gold medal match.\n\nForced into the third-place playoff against Germany’s Alexander Widau — an opponent Asif had defeated earlier in the group stage — the Pakistani cueist fought valiantly but ultimately succumbed 2-1 in a tense contest.\n\nWidau took the opening frame 70-40, aided by a 59-break. Asif responded magnificently in the second frame, delivering a flawless 141 clearance to level the match at 1-1 with a resounding 149-0 scoreline. However, Widau regained composure in the decider, edging out Asif 78-53 to claim the bronze medal.\n\n“I had my chances,” a disappointed Asif, the country’s most decorated cueist, told APP after the loss to Widau. “That 149 showed what I am capable of, but unluckily I just couldn’t get over the line. This will hurt for a long time.”\n\nGUZMAN BREAKS WORLD RECORD\n\nElsewhere on Wednesday, Spanish athlete Jhoan Sebastian Bitar Guzman claimed gold in the men’s 100m sprint in roller sports, setting a new world record of 9.53 seconds.\n\nIt was Guzman’s second gold at the multi-nation showpiece. He also won the men’s one lap event in 34.372 seconds.\n\nThe roller sports competitions, featuring inline hockey, inline speed skating road and inline speed skating track, will conclude on Aug 17.\n\nMeanwhile, China’s Shang Chunsong clinched the women’s freestyle parkour gold after a dramatic scoring reversal that turned her initial second-place finish into a victory.\n\nCompeting alongside the Xinglong Lake, the former captain of China’s national women’s gymnastics team delivered a series of high-difficulty tricks, including 360-degree aerial flips.\n\nA small flaw in her second rotation cost her points, but the crowd erupted in applause at the end of her routine.\n\nShang’s difficulty score came in at 13.5 points, with an initial execution score of 9.2. That gave her a provisional total of 22.7, 0.2 points behind Japan’s Nene Nagai, placing her second.\n\nTears flowed when Shang saw the scoreboard. But the turnaround came just before the medal ceremony. Officials informed her there had been an error in judging, and she was in fact the champion, with an adjusted total of 24.7 points. Nagai took silver, while Sara Banchoff Tzancoff of Argentina got bronze.\n\nChina also claimed three gold medals in the wushu sanda on Tuesday.\n\nIn the women’s 52-kilogram bout, Chen Mengyue scored repeatedly with effective kicks, cruising past India’s Namrata Batra 2-0 while team-mate Li Zhiqin continued the strong momentum by winning in straight sets against Vietnam’s Nguyen Thi Thu Thuy to claim the 60kg gold medal.\n\nTang Sishuo reigned supreme in the men’s 56kg final, claiming China’s third gold in the night after overpowering Vietnam’s Do Huy Hoang, winning 12 points in just one round.\n\nSeyedah Yasaman Bag­he­r­zadehvaskas deni­ed the home side their fourth gold medal as the Iranian won the women’s 70kg sanda final.\n\nEgypt’s Alhussein Wahdan edged Iran’s Mohammadreza Rigi 2-1 for the men’s 85kg title, while South Korea’s Song Gicheol beat Hong Kong’s Cheung Yat-lam 2-1 in the men’s 70kg final.\n\nSanda is a full-contact combat sport similar to kickboxing, featuring three women’s and three men’s weight classes at the World Games, with bouts refereed as in boxing.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689cfddabe1e8.jpg",
  "retrievedAt": "2025-08-16T07:39:27.515Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930728/asif-fails-in-medal-quest-despite-stunning-break-at-world-games",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T01:48:45.000Z"
}
