{
  "title": "Minor girl among 3 killed, over 100 injured in Karachi Independence Day eve aerial firing - Pakistan - DAWN.COM",
  "author": null,
  "content": "A minor girl was among three people killed while more than 100 people were injured by aerial firing in Karachi on the eve of Independence Day, according to hospital officials.\n\nIncidents of aerial firing are a routine occurrence on occasions such as Independence Day and New Year’s Eve despite bans imposed in the past, often leaving dozens injured.\n\nAccording to a statement issued by police surgeon Dr Summaiya Syed, a total of 109 people with bullet injuries from aerial firing were brought in from different areas across the metropolis to three major hospitals. Three people were said to be in critical condition.\n\nHowever, police put the injury toll as 67, according to a statement from the office of the Karachi Additional Inspector General (AIG) Javed Alam Odho.\n\nAzizabad Station House Officer (SHO) Waqar Kaiser told Dawn.com, “A seven-year-old girl was watching Independence Day fireworks from the second floor gallery of her house in Azizabad Block-8 when a bullet struck her in the head.\n\n“A while later, her mother saw her bleeding out, and her uncle took her to a nearby private hospital where doctors pronounced her dead. The body was later shifted to Abbasi Shaheed Hospital where the bullet from her head was retrieved.”\n\nSHO Kaiser said the bullet was fired from a 9mm pistol.\n\nPolice have taken four suspects into custody involved in aerial firing and recovered two 9mm pistols from them to ascertain whether they were used in the killings, he added.\n\nMeanwhile, Awami Colony police said in a statement that a 35-year-old man was killed by a stray bullet in Model Family Park Korangi No 3. The body was shifted to the Jinnah Postgraduate Medical Centre (JPMC) for legal proceedings. He added that further investigation was underway.\n\nThe third victim was 70-year-old man, struck by a stray bullet while sitting outside his home in Agra Taj Colony near Ibrahim Masjid in Kalri, South Deputy Inspector General (DIG) Syed Asad Raza told Dawn.com.\n\n“He was taken to Civil Hospital Karachi where he died during treatment,” DIG Raza said.\n\nThe police statement on the incident said that on the instructions of AIG Odho, police took immediate action and arrested 86 miscreants and recovered 68 illegal weapons from their possession and registered cases.\n\n“A total of 111 cases have been registered, while more cases of murder and attempt to murder are also being registered after innocent citizens were killed and injured,” the statement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/14112333fae3f63.jpg",
  "retrievedAt": "2025-08-16T07:38:14.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930828/minor-girl-among-3-killed-over-100-injured-in-karachi-independence-day-eve-aerial-firing",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T06:39:31.000Z"
}
