{
  "title": "Pakistan, India & South Asia’s unending rivalry - Pakistan - DAWN.COM",
  "author": null,
  "content": "THE arc of the India-Pakistan relationship has long oscillated between hope and hostilities. Both countries inherited the bitterness of partition and some unresolved issues from the British Raj. Ideally, the two countries could have resolved those issues and converted the bitterness of partition into cooperative sweetness.\n\nHowever, rather than cultivating a cordial relationship and resolving issues, today, the two countries have institutionalised rivalry, which is evident in media and military doctrines, and national narratives. Today, balanced views and peace advocacy are considered a ‘cultural crime’ in both countries. Hence, voices of peace constituencies have either been muted or sidelined.\n\nFrom better past to bleak future\n\nIt seems that the first-generation leaders as well as public of India and Pakistan had greater appetite for peace and bilateral engagement. For instance, from December 1947 to January 1957 — prior to the first military coup in Pakistan — the two countries signed 12 landmark agreements related to economic cooperation and promotion of socio-cultural activities. These agreements largely helped to enhance connectivity and ease cross-border communication for both sides.\n\nFor example, an agreement in 1948 established air services for the people of both sides. Similarly, the landmark agreement on banking between India and Pakistan in 1949 helped Muslims to transfer their accounts from Indian to Pakistani banks.\n\nThe two sides need to work on resumption of backchannel diplomacy, which could help in mitigating mistrust.\n\nThe most significant agreement in the early years was the Nehru-Liaquat Agreement, which was signed in 1950, which not only ensured greater rights for minorities in both countries but also eased tensions between both states. From 1951 to 1957, four trade agreements and two agreements related to connectivity not only boosted trade activities between the two countries, but also eased cross-border travel.\n\nFrom 1958 to 1978, the two countries signed 20 additional agreements, pacts and protocols. While some of those agreements were cooperative in nature such as the landmark Indus Waters Treaty (IWT) of 1960, the majority of the agreements were meant to repair the bilateral relationship, damaged due to the 1965 and 1971 wars.\n\nIslamabad and New Delhi signed 35 out of 47 agreements, protocols, or pacts, during democratic tenures in Pakistan. In fact, Delhi signed several agreements with Pakistani democratic regimes to repair the already damaged relationship during military rule.\n\nThese include resumption of rail and air connectivity, ease of visa issuance of 1974, normalisation of trade activities of 1974, resumption of shipping activities of 1975, etc. Similarly, during the 1990s — a troubled but democratic decade in Pakistan — Islamabad and Delhi signed six significant agreements, including the Lahore Declaration of 1999.\n\nHowever, the 25 years of the 21st century turned the already fragile and complicated relationship into one of perpetual hostility, with no light at the end of the tunnel. During this period, the two sides only reduced bilateral engagements. During this period, the frequency of armed clashes and cross-border firing has substantially increased.\n\nToday, the consistent refusal of Delhi to engage in dialogue with Pakistan and limited armed conflicts in 2019 and 2025 have not only minimised space for dialogue, but also redefined priorities of the two states. The two sides, apparently, are preparing for an eventual ‘South Asian Armageddon’.\n\nThe latest ‘Modi Doctrine’ might bring this ‘South Asian Armageddon’ more quickly than expected. The ‘Modi Doctrine’ outlines three broader parameters, ie, a) if there is a terrorist attack in India, a befitting reply will be given; b) India will not tolerate any ‘nuclear blackmail’; c) India will not differentiate between the government of Pakistan and the ‘masterminds’ of terrorism. This doctrine has brought the threshold of conflict to the lowest point in history between the two countries.\n\nSimilarly, Pakistan has a rare consensus at the civil and military leadership level that any attempt to divert the water flow will be considered an act of war. Moreover, the ‘surgical strikes strategy’ of 2019 and ‘Modi Doctrine’ of 2025 have forced Islamabad to shift its strategic posture from ‘defensive defence’ to ‘offensive defence’, where pre-emptive strikes could be one of the options to minimise the Indian threat at times of conflict. This is why both states are eagerly buying arms, improving defence capabilities and trying to technologically maintain a strategic edge.\n\nMissed opportunities\n\nWhile there is a long list of attempts by the international community, as well as the Pakistani and Indian leadership to ease tensions between 1948 to 1998, two opportunities might have changed the fate of the people of the subcontinent: in 1999 and 2015 — both opportunities coming when the BJP and former PM Nawaz Sharif were in power.\n\nThere are two important factors that made these two peace gestures significant. First, A.B. Vajpayee and Narendra Modi were both leaders of BJP — a political party with a reputation for hard-line politics. Endorsement of any peace plan by these two leaders would have gained legitimacy in India.\n\nSecond, in 1999 Nawaz Sharif had two-thirds majority and in 2015 he was enjoying simple majority. Therefore, there were less chances of obstructions by other political forces in Pakistan.\n\nThe first historic opportunity emerged in 1999 when Vajpayee, an ideologue and seasoned politician, travelled by bus to Lahore and signed the Lahore Declaration. As per several accounts, Islamabad and Delhi could have changed the course of history from hostility to cooperation, but the Kargil crisis disrupted the process.\n\nThe second historic opportunity, which is often either ignored or overlooked in Pakistan, was Modi’s surprise visit to Lahore in 2015. Today Islamabad views Mr Modi’s entire tenure from 2014 to 2025 negatively.\n\nHowever, the fact is that during Modi’s first two years in office, from 2014 to 2016, the Indian PM had a conciliatory approach towards Pakistan. He not only invited then-PM Nawaz Sharif to his oath-taking ceremony but also extended frequent pleasantries during that period. Pakistan could have built on the surprise visit of Modi but the Pathankot attack disrupted the entire process. While Pakistan denied any linkages to the attack, the pressure of Indian media, public sentiment and Modi’s altered perceptions changed Delhi’s posture towards Pakistan.\n\nEnd of bilateralism\n\nThe India-Pakistan relationship is primarily heading towards the end of bilateralism. New Delhi has initiated a process to undo what was achieved through difficult negotiations in the 1950s, ’60s and ’70s. In 2019, Delhi not only ended cross-LoC trade but also revoked Most Favoured Nation (MFN) status of Pakistan. A few months later, in August 2019, it abrogated the special status of held Jammu and Kashmir, which Islamabad believed might lead to change in demographics in the disputed territory. Lately, Delhi has not only put the IWT in ‘abeyance’, but also expelled Pakistani citizens.\n\nIn response to India’s unilateral actions of August 2019, Pakistan suspended bilateral trade and downgraded diplomatic relations without a clear strategy on the objectives it sought to achieve.\n\nIslamabad has repeatedly indicated revoking the Simla Agreement of 1972. Resultantly, the bilateral trade agreements, socio-cultural pacts, political and security arrangements are practically either suspended or ineffective.\n\nWay forward\n\nSoon after the fragile ceasefire in 2025 and in the presence of aggressive competing military doctrines, there should be no expectation of a major breakthrough between the two hostile neighbours.\n\nAt best, the two countries need to prioritise stability over peace, which could be achieved through a few baby steps. Steps such as resumption of visa services for patients and family reunions could lower hostilities, while easing the miseries of those whose families were divided by the border. The civil society of India and Pakistan needs to play an active role in developing peace constituencies on both sides.\n\nIn presence of fiery rhetoric, peace overtures by both governments will not be an easy task. Therefore, the two sides also need to work on resumption of backchannel diplomacy, which could help in mitigating mistrust.\n\nThe most recent successful example of backchannel diplomacy was in 2021, when India and Pakistan agreed to strictly implement the ceasefire understanding of 2003 on the LoC.\n\nPerhaps Islamabad can appoint former PM Nawaz Sharif as an ‘ambassador of peace’. His goodwill and past experiences could create positive impact on India-Pakistan relationship.\n\nRevival of Saarc could also open a channel of communication between the two countries. In 2004, the famous handshake between then-president Musharraf and Indian PM Vajpayee on the sidelines of the Saarc meeting resumed the process of composite dialogue. There is an utmost need for a joint counterterrorism framework between India and Pakistan to address concerns related to militancy.\n\nFrom 1800 to 1945, European countries fought eight major wars and countless battles, yet eventually learned to coexist. Will India and Pakistan draw lessons from Europe’s model of coexistence without enduring eight major wars of their own, or are they destined to repeat that history?\n\nToday, the challenge for Islamabad and Delhi is not improving ties but preventing further decline. Small steps toward normalisation could help the region achieve stability, if not peace. Are the leaders of both countries ready to take those steps?\n\nThe writer is an analyst of South Asian affairs. The views expressed are his own.\n\nX: @itskhurramabbas",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/141004022e6c28f.jpg",
  "retrievedAt": "2025-08-16T07:38:30.642Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930810/pakistan-india-south-asias-unending-rivalry",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T03:19:25.000Z"
}
