{
  "title": "India and China eye border trade resumption after 5-year hiatus - World - DAWN.COM",
  "author": null,
  "content": "India and China are discussing resuming border trade five years after it was halted, foreign ministry officials on both sides have said, as US tariffs disrupt the global trade order.\n\nPast trade across the icy and high-altitude Himalayan border passes between the neighbours was usually small in volume, but any resumption is significant for its symbolism.\n\nThe two major economic powers have long competed for strategic influence across South Asia.\n\nBut caught in global trade and geopolitical turbulence triggered by US President Donald Trump’s tariff regime, the countries have moved to mend ties.\n\nChinese Foreign Minister Wang Yi is expected to hold talks in New Delhi on Monday, according to Indian media, after his counterpart Subrahmanyam Jaishankar visited Beijing in July.\n\nThat, as well as agreements to resume direct flights and issue tourist visas, has been seen as an effort to rebuild a relationship damaged after a deadly border clash in 2020 between their nations’ troops.\n\n“For a long time, China-India border trade cooperation has played an important role in improving the lives of people living along the border,” China’s foreign ministry said in a statement to AFP on Thursday.\n\nIt added that the two sides have “reached a consensus on cross-border exchanges and cooperation, including resumption of border trade”.\n\nNew Delhi’s junior foreign minister, Kirti Vardhan Singh, told parliament last week that “India has engaged with the Chinese side to facilitate the resumption of border trade”.\n\nNo restart date was given by either side.\n\nSuccessive US administrations have seen India as a longstanding ally with like-minded interests when it comes to China.\n\nIndia is part of the Quad security alliance with the United States, as well as Australia and Japan.\n\nBut ties between New Delhi and Washington have been strained by Trump’s ultimatum for India to end its purchases of Russian oil, a key source of revenue for Moscow as it wages its military offensive in Ukraine.\n\nThe United States will double new import tariffs on India from 25 per cent to 50pc by August 27 if New Delhi does not switch crude suppliers.\n\nPrime Minister Narendra Modi, according to Indian media, might also visit China in late August. It would be Modi’s first visit since 2018, although it has not been confirmed officially.\n\nBeijing has said that “China welcomes Prime Minister Modi” for the Shanghai Cooperation Organisation summit opening on August 31.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:38:00.698Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930850/india-and-china-eye-border-trade-resumption-after-5-year-hiatus",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T09:11:36.000Z"
}
