{
  "title": "SC defers Bahria Town plea against NAB auctions - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court on Wednesday postponed further proceedings on an appeal by Bahria Town (Pvt) Ltd, allowing the property developer to furnish additional arguments following the issuance of a detailed Islamabad High Court (IHC) judgement permitting the National Accou­n­tability Bureau (NAB) to proceed with the auction of attached properties linked to a plea bargain agreement.\n\nA three-judge bench, headed by Chief Justice of Pakistan (CJP) Yahya Afridi and comprising Justice Muhammad Shafi Siddiqui and Justice Miangul Hassan Aurangzeb, was hearing the appeal against the IHC’s Aug 4 short order.\n\nAt the outset, when senior counsel Farooq H. Naek, representing Bahria Town, came to the rostrum for arguments, the CJP suggested that he refer to the original bench, which earlier heard the matter.\n\nOn Aug 8, a different three-judge bench consisting of Justice Aminuddin Khan, Justice Naeem Akhtar Afghan and Justice Siddiqui heard the matter during which Justice Afghan wondered why auction of the property developer was being rushed in haste when culmination of trials in the pending references against Zain Malik will determine confiscation of attached properties.\n\nOn Wednesday, Mr Naek stated that since the detailed judgement of the high court had come, he would prefer to furnish additional submissions in the light of that verdict.\n\nAt this, the CJP decided to adjourn further proceedings for an indefinite period to provide the counsel ample opportunity for submitting additional arguments before the apex court.\n\nIn its 14-page detailed judgement, the IHC held that the orders passed by the Islamabad’s Accountability Court No. 1 was quite in accordance with law and warrants no interference by the high court.\n\nAs a result, the petitions moved by the Bahria Town were dismissed.\n\nAuthored by IHC Chief Justice Sardar Muhammad Sarfraz Dogar, the verdict recalled that the Bahria Town had claimed that it was an independent entity and was not responsible for any act or deed of any of its shareholders and that it was never declared a proclaimed offender.\n\nBut the judgement recalled that Sections 87 and 89 of the Criminal Procedure Code (CrPC) allow attachment of the properties of an absconding accused as a coercive measure to compel his appearance.\n\nIf the absconder fails to comply with the proclamation as per Section 88 of CrPC, the court can order the attachment of his movable and immovable property, including sealing bank accounts, seizing assets and restricting transactions, the IHC said.\n\nThe attachment under Section 88 of CrPC was not punitive but coercive, with the sole aim of securing the attendance of the accused before the court, the high court order said, highlighting that in the case at hand, the accused Malik Riaz Hussain and Ahmad Ali Riaz were declared proclaimed offenders on Jan 6, 2024.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/091106035018a35.jpg",
  "retrievedAt": "2025-08-16T07:38:59.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930762/sc-defers-bahria-town-plea-against-nab-auctions",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T02:09:48.000Z"
}
