{
  "title": "New Delhi seeks private firms’ help for nuclear expansion - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India aims to allow private firms to mine, import and process uranium as part of plans to end a decades-old state monopoly over the nuclear sector and bring in billions of dollars to boost the industry, two government sources said.\n\nPrime Minister Narendra Modi’s government plans to expand nuclear power production capacity by 12 times by 2047 and it is also relaxing requirements to allow foreign players to take a minority stake in power plants. If it meets its expansion goal, nuclear will provide 5 per cent of India’s total power needs, according to government estimates.\n\nUntil now, the state has maintained control over the mining, import and processing of uranium fuel because of concerns over the possible misuse of nuclear material, radiation safety and strategic security.\n\nIt will retain its grip on reprocessing spent uranium fuel and managing plutonium waste, in line with global practice. But to help meet a surge in demand for nuclear fuel as it expands nuclear power production, the government plans to draw up a regulatory framework that would allow private Indian firms to mine, import and process uranium, the two government sources said. They asked not to be named because the plans are not yet public.\n\nThe proposed policy, which the sources said was likely to be made public in the current fiscal year, will also permit private players to supply critical control system equipment for nuclear power plants, they said. India has an estimated 76,000 tonnes of uranium enough to fuel 10,000 megawatts of nuclear power for 30 years, according to government data.\n\nIndian, US regulators meet to boost cooperation\n\nBut the sources said domestic resources would only be able to meet about 25pc of the projected increase. The rest would have to be imported and India would need to increase its processing capacity.\n\nIn announcing its budget on Feb 1, the government made public its plans to open up the sector without giving details. Some of India’s big conglomerates subsequently began drawing up investment plans. But analysts said amending the legislation could be complex.\n\n“It’s a major and bold initiative by the Indian Government which is critical for achieving the target,” said Charudatta Palekar, independent power sector consultant.\n\n“The challenge will be to define quickly the rules of engagement with private sector.” New Delhi will have to change five laws, including the ones regulating mining and electricity sectors and India’s foreign direct investment policy to enable private participation in many identified activities, the sources said.\n\nIndia, US nuclear regulators meet to boost cooperation\n\nIndia’s Atomic Energy Regulatory Board (AERB) said it held a bilateral technical meeting with the US Nuclear Regulatory Commission to strengthen cooperation on nuclear safety and regulation as India looks to expand its nuclear power capacity.\n\nAn Indian delegation participated in the meeting held from Aug 6 to 8 at the NRC headquarters in Rockville, Maryland, the AERB said in a statement dated Aug 12.\n\nThe meeting comes as India seeks to expand its nuclear power generation capacity to at least 100 gigawatts by 2047, up from just over 8 gigawatts currently. The countries discussed regulation of new and advanced reactors, codes and standards for advanced reactor technologies among others, the AERB said. Both sides identified potential areas for future collaboration, it said.\n\nIndia and the United States also discussed long-term operation strategies for nuclear power plants, safety assessments, and emergency preparedness for advanced and small modular reactors, the statement said.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/14115559a9e3391.jpg",
  "retrievedAt": "2025-08-16T07:39:21.587Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930740/new-delhi-seeks-private-firms-help-for-nuclear-expansion",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T01:48:53.000Z"
}
