{
  "title": "New US trade deal to help exporters expand footprint - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s exporters are poised to gain a significant competitive advantage in the US market after the government successfully negotiated a reduction in reciprocal tariffs — from 29pc to 19pc — the lowest rate in the region.\n\nAn official statement issued by the Ministry of Commerce on Tuesday noted that the reduced tariff will create new opportunities for Pakistani exporters to expand their footprint in the US. The development was discussed during a high-level meeting on US reciprocal tariffs, chaired by Commerce Minister Jam Kamal Khan.\n\nThe meeting was attended by Special Assistant to the Prime Minister on Industries and Production Haroon Akhtar Khan, Coordinator to the Prime Minister on Commerce Rana Ihsaan Afzal, Secretary Commerce Jawad Paul, senior officials from the Commerce and Industries Divisions, and more than 30 leading exporters and SMEs from key sectors including apparel, textiles, rice, salt, surgical instruments, sports goods, electronics, food and agriculture, and leather.\n\nCommerce Minister Jam Kamal said the revised tariff structure presents a timely opportunity to boost exports and appreciated the coordinated efforts of the government’s economic team, along with private sector support, in achieving this milestone.\n\nIslamabad secures the lowest tariffs among regional competitors\n\nSpecial Assistant Haroon Akhtar highlighted Pakistan’s comparative advantage in the region and reaffirmed the government’s commitment to supporting industry stakeholders in unlocking business potential under evolving global conditions.\n\nIndustry representatives called for consistent and industry-friendly policies to optimise manufacturing costs and secure access to critical inputs. They urged the government to adopt a predictable policy environment that facilitates long-term planning and growth.\n\nCommerce Minister Jam reiterated the government’s focus on export-led growth, stressing both immediate and long-term strategic measures. He assured exporters that their recommendations would be compiled and presented to the Prime Minister for further action.\n\nIt was decided to actively pursue the expansion of Pakistan’s export footprint in the US, turning the current tariff reduction into a sustained national advantage for broader socio-economic development.\n\nSeparately, Coordinator to the Prime Minister on Commerce Rana Ihsaan Afzal held a meeting with representatives of Octans Digital Pvt Ltd, a subsidiary of Interloop Holdings, to discuss sustainability and waste management in Pakistan’s textile industry.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/689a8a6475934.jpg",
  "retrievedAt": "2025-08-16T07:40:37.799Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930567/new-us-trade-deal-to-help-exporters-expand-footprint",
  "dateList": "2025-08-14",
  "date_published": "2025-08-13T00:05:36.000Z"
}
