{
  "title": "Daesh network dismantled in Peshawar, claims CTD - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Counter Terrorism Department (CTD) of police on Wednesday claimed to have successfully dismantled Daesh Khorasan network in Peshawar and has achieved major operational successes in several cases, including the killing of religious scholar Mufti Munir Shakir.\n\nMufti Munir Shakir, founder of the banned Lashkar-i-Islam, was killed in a blast outside his seminary in Urmar area on the outskirts of the provincial capital on March 15 this year.\n\nThey said the department identified the gang involved in this heinous act while efforts were under way to apprehend the culprits in the near future.\n\nThe CTD officials, while briefing media-persons said that it busted a group of militants responsible for no fewer than 18 terrorist incidents in the settled areas of the provincial capital, adding that those attacks include the martyrdom of deputy superintendent of police Sardar Hussain Khan and 14 other police officials of various ranks.\n\nOfficials reveal terrorists using digital currency for extortion; propose seminary registration should be subject to CTD’s consent\n\nThey said that following interrogation from arrested terrorists involved in several terrorist activities, CTD recovered a substantial cache of arms, ammunition, and explosive material, including IEDs, adding that the timely action also led to securing of at least six sensitive installations that had already been subjected to reconnaissance by militants and were in the final stages of planning an attack.\n\n“CTD has identified the gang responsible for the targeted killing of religious scholars, enabling focused follow-up operations to apprehend the culprits,” they said.\n\nAlso, the CTD officials, who didn’t want to be named, claimed to have busted the Daesh Khorasan network directly responsible for the suicide attack in Peshawar city on 11 May, 2025, some four kilometres from a JUI-F gathering being addressed by Maulana Fazlur Rehman at Mufti Mehmood Markaz on Ring Road, on outskirts of the provincial capital.\n\nWhile briefing journalists, CTD revealed that apart from currency notes and bank transactions, terrorist organisations received extortion money through digital currency as well.\n\nThe CTD officials told reporters here that apart from Afghanistan, people also received extortion calls from Saudi mobile numbers.\n\n“They [militants] now seek extortion money in digital currency — Bitcoin,” a senior CTD official said, adding that the terrorist organisations generated finances not only from extortion but from drug smuggling as well.\n\nAlso, the CTD officials said that the terrorists were involved in online propaganda on several social media platforms and the department had established contact directly with the organisations owning the Apps, adding that the department had proposed to the government to establish counter cyber terrorism police stations.\n\n“CTD also wants empowerment under Prevention of Electronic Crime Act,” they said, adding that the counter violent extremism policy was in the final stage. The CTD officials said that the religious seminaries and their registration should be subject to the approval of the CTD, adding that they had proposed empowering the deputy commissioners to registrar the religious seminaries under Societies Registration Act 1860.\n\nThey also said that they had been facing issues while arresting the accused persons in the merged districts, as it took years to arrest one person, adding that the department wanted powers under a mix of Frontier Crimes Regulations 1901 and Police Act 2017.\n\n“We have 44 special weapon and tactics (SWAT) teams for each district. All these teams are equipped with modern gadgets,” they said, adding that capacity building of the department was under way with an explosives handling and analysis laboratory.\n\nThey said the prosecution department had developed enough expertise and the bail refusal ratio, which was 6 per cent in 2022, had gone up to 34pc in 2025, adding that 25pc was the conviction rate in 2025 as compared to 23pc in 2022.\n\nThey informed reporters that ratio of logically concluding cases was 13pc in 2022, which had gone up to 34pc in 2025, adding that 11 scientists were recruited for forensic laboratory with latest technology to be adopted in the near future.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2023/09/1320402702f53e2.jpg?r=205106",
  "retrievedAt": "2025-08-16T07:38:39.185Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930807/daesh-network-dismantled-in-peshawar-claims-ctd",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T03:05:30.000Z"
}
