{
  "title": "In northern Pakistan, indigenous ice stupas offer a nature-based water solution - World - DAWN.COM",
  "author": null,
  "content": "Pakistan’s far north region of Gilgit-Baltistan, where towering peaks cradle remote valleys, has survived for centuries on a fragile lifeline — glacial melt. But that lifeline is fraying.\n\nAs global temperatures rise, snowfall — critical for feeding the region’s water supply — has become increasingly unpredictable. Meanwhile, population and tourism growth has driven the expansion of farmland in an attempt to address food security issues. This has put pressure on the region’s increasingly limited water resources.\n\nIn response, locals have turned to a relatively recent regional innovation: ice stupas, towering structures that combine indigenous engineering and innovation.\n\nThe technique to create them, invented by engineer Sonam Wangchuk in the neighbouring Indian state of Ladakh in 2013, involves piping water from streams which is then sprayed into the cold winter air, freezing thousands of litres of water as artificial glaciers.\n\nThese glaciers store water for release in the spring, when it is needed mainly for agriculture due to dry conditions causing a lack of precipitation. As temperatures rise in April and May, the structure melts gradually, releasing water for irrigation.\n\nAmidst insufficient support on water management and conservation, this idea has taken off in Gilgit-Baltistan. But experts warn that it’s not a permanent solution.\n\nThe first ice tower in the region was built in 2019 in the village of Paari in southeastern Gilgit-Baltistan through an initiative by Pakistan’s Ministry of Climate Change and the United Nations Development Programme (UNDP). “I had heard about it but had not seen it myself,” recalls Mohammad Raza, deputy director of agriculture in the city of Skardu, located 60km away. In 2022, he built an ice stupa in Hussainabad village on the outskirts of Skardu with a team of fellow villagers after coming across videos of them being built in Ladakh.\n\nSkardu, at nearly 2,500 meters (8,200 feet) above sea level, serves as the main gateway for expeditions to K2 and Nanga Parbat, among the world’s highest mountains. Tourism is a big source of income, though this brings issues of increasing water demand.\n\nIn the spring, villagers seeking water usually hike for an hour through a precarious, winding dirt track to reach the site of Hussainabad’s ice stupa and collect it from the melting structure. By the end of May, the spot turns back to its original rocky and arid state, with a sprinkling of tall wild bushes and little trace of the stupa.\n\nThe Gilgit-Baltistan structure has been created on a natural slope, unlike Ladakh’s tall sculpture in which water is sprayed vertically above flat terrain, explains Zakir Hussain Zakir, an assistant professor at Karakoram International University in Gilgit, the region’s capital.\n\n“The water in the pipes doesn’t freeze here due to gravity pressure,” says Zakir, who has been studying indigenous solid water storage methods since 2018. For Gilgit-Baltistan’s ice stupas, a pipe is installed at a higher elevation to tap into an upstream water source, usually in the mountains. As the water flows downhill through the pipe, it builds up pressure. This pressure creates potential energy inside the pipe, and when the water is released through a nozzle, it sprays upward like a fountain. In the freezing outdoor temperatures, the water loses its latent heat to the air and freezes, gradually forming a solid structure of ice.\n\n“The slopy elevation and low night temperatures provide the perfect gravity and the right temperature to solidify the stream water,” says Zakir.\n\nRaza notes that the required infrastructure is minimal and readily available. “All we need are rubber pipes, a nozzle, connectors, and a sturdy base — like tall bushes, and a poplar tree or a bamboo pole” to support the nozzle, he says. The main cost has been the 366 metres of piping to bring water from the stream to the tree’s base and to run it vertically along the tree for support, he notes.\n\nHis first attempt at creating the ice stupa was experimental, using secondhand pipes. “I realised we needed different sizes,” Raza recalls. Posting about his findings on social media, word spread and a UNDP team, already supporting Paari village with building its ice stupa, saw the post and aided the Hussainabad team with obtaining the right-sized pipes, he notes.\n\nGilgit-Baltistan experiences a serious dry spell from April-May, notes Amjad Masood, assistant professor at the Centre of Excellence in Water Resources Engineering at Lahore’s University of Engineering and Technology. During this period, precipitation is minimal, while winter snowmelt has not entered full swing. “This leaves communities with very limited water for drinking, farming, and livestock, just as agricultural activity picks up,” he notes.\n\n“In recent years, climate change has intensified this problem — with warmer winters, delayed or reduced snowfall, and earlier, faster glacier melt, disrupting traditional water supply cycles,” he adds. “This seasonal ‘dry gap’ has become more unpredictable and severe.”\n\n“In my childhood, I walked through waist-deep snow,” says Qurban Ali, 62, a retired teacher. Nowadays, snowfall is scarce or late and melts quickly, leading to dry fields when crops need water most, he says. With Himalayan glaciers retreating, the growing season is under strain.\n\nThe arrival of the ice stupas has come as a relief to 35-year-old farmer Zahra Bano, who owns a 1.5-acre farm in Hussainabad.\n\nBefore 2022, “we struggled with water shortages just when we needed it most — during sowing season,” she says. “But the ice stupa changed that. Now, we have water when it matters.”\n\nThese days, with water from the ice stupas, her family can grow a wide mix of crops, including wheat, barley and maize, alongside pears, apricots, almonds, apples and mulberries. On her farm lies a vegetable patch containing onions, potatoes, chilies and tomatoes, amongst other vegetables. Around the homestead, two cows, several goats and a few hens complete the picture of a self-sustaining rural life. “We only buy groceries four months in a year, otherwise we are quite self-sufficient,” she says.\n\nA farmer told UNDP that without the availability of water, crops dry up and lose their value. Another said that prior to the introduction of ice stupas to his community, “we were only able to harvest one crop per season as [a] second crop was not possible due to climate and lack of water”.\n\nThough families have seen relief from spring drought conditions with the ice stupas, this adaptative measure is not seen by experts as a long-term solution.\n\nHamid Mir, coordinator for WWF-Pakistan’s Water Resource Accountability in Pakistan project, notes they “are like freezer ice — seasonal, not a substitute for real glaciers”.\n\nMasood agrees, explaining: “Natural glaciers are massive, long-term reservoirs that regulate water flow year-round and sustain rivers across large regions. Ice stupas, while helpful, are seasonal, small-scale and climate-sensitive, so they can’t replace that function.”\n\nPakistan is home to over 7,000 glaciers in its Hindu Kush, Karakoram and Himalayan region, with 41pc of its river flows coming from glacier melt. However, rising temperatures mean they are in danger of melting: over 3,000 glacial lakes have developed in Gilgit-Baltistan, the UNDP states, bringing with them the potential for triggering dangerous glacial lake outburst floods (Glofs).\n\nInstead of ice stupas, Mir supports glacier grafting, an indigenous practice in Himalayan regions in which ice blocks from two glaciers are fused with water and placed in a shaded, high-altitude crevice to grow into a new glacier.\n\nMasood points out that long-term water management strategies are the way to go. Beyond natural glaciers, this includes improved irrigation methods to increase water efficiency and reduce water waste, watershed conservation, small-scale water storage infrastructure for snow harvesting, and engineered mountain reservoirs. “Ice stupas should complement — not replace — these broader, long-term solutions.”\n\nAs communities wait for such measures to reach them, they have taken matters into their own hands to survive, and their neighbours have been following suit. Since the first ice stupa was built in 2019 in Paari, word spread, and now several villages have adopted them. Zakir notes that 20 villages in Gilgit-Baltistan have already built ice stupas this year.\n\nEach ice stupa takes three days to complete, but upkeep goes on after construction. Around mid-May as it begins to melt, villagers hike up weekly for inspections. A local committee manages maintenance, rotating duties among volunteers such as clearing stones from landslides and conducting repairs where necessary, creating a sense of shared ownership, notes Zakir.\n\nFor many, this may be a simple community-led fix for water scarcity — but it’s also a striking example of ingenuity in the face of a changing climate.\n\nThis article was originally published by Dialogue Earth and has been republished with permission.\n\nHeader image: Ice stupas, or artificial glaciers, are increasingly being used by communities in Gilgit-Baltistan to tackle strains on its water supply. But experts say that, while a smart seasonal solution for water scarcity, they are not a substitute for long-term water management strategies (Image: UNDP)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/141122003c707a7.jpg",
  "retrievedAt": "2025-08-16T07:37:47.541Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930837/in-northern-pakistan-indigenous-ice-stupas-offer-a-nature-based-water-solution",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T13:00:05.000Z"
}
