{
  "title": "Lebanon at odds with Iran over plan to disarm Hezbollah - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: No group in Lebanon is permitted to bear arms or rely on foreign backing, its president told a visiting senior Iranian official on Wednesday after the cabinet approved the goals of a US-backed roadmap to disarm the Iran-aligned Hezbollah group.\n\nDuring a meeting in Beirut with Ali Larijani, secretary of Iran’s top security body, Joseph Aoun warned against foreign interference in Lebanon’s internal affairs, saying the country was open to cooperation with Iran but only within the bounds of national sovereignty and mutual respect.\n\nLarijani said the Islamic Republic supports Lebanon’s sovereignty and does not interfere in its decision-making.\n\n“Any decision taken by the Lebanese government in consultation with the resistance is respected by us,” he said after separate talks with Parliament Speaker Nabih Berri, whose Amal movement is an ally of Hezbollah.\n\nBy “resistance”, Larijani was alluding to Hezbollah, which was founded in 1982, grew into a “state-within-a-state” force better armed than the Lebanese army and has repeatedly fought Israel over the decades.\n\n“Iran didn’t bring any plan to Lebanon, the US did. Those intervening in Lebanese affairs are those dictating plans and deadlines”, said Larijani. He said Lebanon should not “mix its enemies with its friends — your enemy is Israel, your friend is the resistance”. “I recommend to Lebanon to always appreciate the value of resistance.”\n\nThe US submitted a plan through President Donald Trump’s envoy to the region, Tom Barrack, setting out the most detailed steps yet for disarming Hezbollah, which has rejected mounting calls to disarm since its devastating war with Israel last year.\n\nHezbollah has rejected repeated calls to relinquish its weaponry although it was seriously weakened in the war, with Israel killing most of its leadership in airstrikes and bombings.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/20132916181720d.jpg?r=133013",
  "retrievedAt": "2025-08-16T07:39:20.630Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930741/lebanon-at-odds-with-iran-over-plan-to-disarm-hezbollah",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T01:48:53.000Z"
}
