{
  "title": "Karachi traders press for broader power market launch - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Karachi’s business community has urged the government to immediately launch the Competitive Trading Bilateral Contracts Market (CTBCM) with an open bidding process for at least 3,000 megawatts (MW) in its first year, instead of the 800MW limit planned by the Power Division and the regulator.\n\nIn a letter to Power Minister Sardar Awais Leghari, Korangi Association of Trade and Industry (KATI) President Junaid Naqi said repeated delays and a flawed initial design were denying Pakistan’s industries the competitive, efficient and transparent power market they were promised.\n\n“Every passing month without CTBCM is another month the economy bears high costs, inefficiency and policy uncertainty,” he said, adding that the proposed 800MW cap was one such flaw.\n\nMr Naqi argued that an arbitrary cap of 800MW — barely 5pc of national capacity — would not create a meaningful market. He warned it could be monopolised by a few influential players, leaving no space for broader industrial participation and paving the way for speculation, preferential allocation and market capture from the outset.\n\nHe proposed an open-ended first phase starting with a 3,000MW threshold for one year, followed by transparent auctions for additional capacity. This, he said, would ensure wider participation, market liquidity from day one, and prevent elitist allocation.\n\nUrge CTBCM start with 3,000MW, reject cap\n\nThe KATI chief also called for removing the Debt Servicing Surcharge (DSS) and cross-subsidy charges from wheeling tariffs, saying these were policy-imposed fiscal burdens — not network costs — and were already recovered elsewhere. He proposed reclassifying them as “non-network charges” and phasing them out over five years to protect fiscal stability while enabling competitive pricing.\n\nCalling for deeper structural reform, Mr Naqi said competitive supplier licences should be granted to distribution companies (Discos) and K-Electric (KE), as excluding them had no logical or legal basis. Pakistan’s circumstances, he argued, made their inclusion essential to ending the uniform tariff — one of the biggest distortions in the power sector.\n\nIf Discos and KE could compete for customers, he said, tariff differences would emerge naturally based on efficiency, service quality and procurement strategy, gradually phasing out the need for government-imposed uniform pricing. Without a competitive supply status, even full privatisation of Discos would not end the government’s annual subsidies worth hundreds of billions of rupees to maintain uniform tariffs.\n\nMr Naqi said competition would compel Discos and KE to improve efficiency, expand market liquidity, and introduce service innovations such as renewable energy packages and flexible supply terms. Allowing them into the market would also create the conditions to dismantle the uniform tariff without destabilising vulnerable consumers.\n\nHe further proposed allowing Indep­endent Power Producers (IPPs) to sell partial capacity into the market to diversify supply and improve buyer choice. Mr Naqi stressed that CTBCM’s launch must be accompanied by regular stakeholder engagement, transparent rule-making, and targeted industry outreach.\n\n“Pakistan has invested heavily in systems, training and regulatory frameworks for this market. Now it must deliver,” he said, urging the minister to immediately launch CTBCM on a broad basis with these reforms embedded to cut costs, improve efficiency and build a sustainable competitive electricity market.\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:39:50.648Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930748/karachi-traders-press-for-broader-power-market-launch",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T01:48:39.000Z"
}
