{
  "title": "More than 360 hit by food poisoning after eating free school meal in Indonesian town - World - DAWN.COM",
  "author": null,
  "content": "More than 360 people fell ill in Indonesia’s town of Sragen in Central Java after consuming school lunches, an official said on Thursday, in the largest food poisoning case to hit President Prabowo Subianto’s flagship free meals programme.\n\nSince its launch in January, the free school meals programme has been marred by mass food poisoning cases across the archipelago, affecting over 1,000 people.\n\nSragen government chief Sigit Pamungkas told Reuters that 365 people fell ill and a food sample was being tested in a lab. The government would pay for any medical treatment if needed.\n\nWizdan Ridho Abimanyu, a ninth grader at Gemolong 1 middle school, told Reuters he was woken at night by sharp pain in his stomach.\n\nHe had a headache and diarrhoea, which he deduced had been caused by food poisoning after seeing schoolmates’ social media posts complaining of the same.\n\nThe likely contaminated lunch was turmeric rice, omelette ribbons, fried tempeh, cucumber and lettuce salad, sliced apple and a box of milk, cooked in a central kitchen and distributed to several schools.\n\n“We have asked to temporarily stop the food distribution from that kitchen until the lab results are back,” Sigit said.\n\nThe government’s National Nutrition Agency, which oversees the programme, has raised the standards of kitchen operations and delivery in the aftermath of previous food poisoning cases, its chief Dadan Hindayana told Reuters.\n\nThe free meals programme has been rapidly expanded to over 15 million recipients so far. Authorities plan to reach 83 million by year-end, budgeting a total cost of 171 trillion rupiah ($10.62 billion) this year.\n\nIn a food poisoning case in a city in West Java in May, more than 200 students fell ill, and a lab found the food was contaminated with Salmonella and E. coli bacteria, according to media reports.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/14171200d53d65a.jpg",
  "retrievedAt": "2025-08-16T07:37:54.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930865/more-than-360-hit-by-food-poisoning-after-eating-free-school-meal-in-indonesian-town",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T12:18:39.000Z"
}
