{
  "title": "Global leaders extend wishes on Pakistan’s 79th Independence Day - Pakistan - DAWN.COM",
  "author": null,
  "content": "Leaders and lawmakers from around the world, including the United States, Russia, and China, congratulated Pakistan on its 79th Independence Day on Thursday with public messages, highlighting diplomatic ties.\n\nThe day, marking Pakistan’s freedom from British rule and the declaration of independence in 1947, dawned with a 31-gun salute in Islamabad and 21-gun salutes at the provincial headquarters. Special prayers were also offered in mosques for peace, solidarity and prosperity of the country.\n\nUS Secretary of State Marco Rubio, in a statement, felicitated the people of Pakistan on behalf of the United States.\n\n“The United States deeply appreciates Pakistan’s engagement on counterterrorism and trade. We look forward to exploring new areas of economic cooperation, including critical minerals and hydrocarbons, and fostering dynamic business partnerships which will promote a prosperous future for Americans and Pakistanis,” the statement said.\n\nThe US State Department’s Bureau of South and Central Asian Affairs said it extended its “warm wishes to the people of Pakistan as they celebrate 78 years of independence on August 14”.\n\n“We look forward to deepening the people-to-people and economic ties as our two countries work together to promote a prosperous future for Americans and Pakistanis,” the agency said.\n\nIn a video shared by state-run Radio Pakistan on X, US Congressman Pete Sessions said, “To my friends that are in the Pakistani community, congratulations. A day in which you can remember once again your contribution to the United States of America on behalf of your heritage.\n\nAppreciating the contributions, Sessions detailed: “Not just science and mathematics and not just hard work, but people of good faith who have come to the United States to pledge themselves to the future of not just America, but your country also, to forge that continued relationship and reliance upon each other. Thank you so much for your celebration. Thank you so much for your contribution.”\n\nIn a similar vein, US Congresswoman and representative of Brooklyn, New York’s 9th Congressional District, Yvette Clarke congratulated the people of Pakistan, as well as the diaspore in her district.\n\n“Not only am I deeply honoured for this opportunity to celebrate with you 79 years of independence for the proud nation of Pakistan, I’m also eternally grateful for the millions of Pakistani-Americans who have used their ingenuity, talent, skill, and expertise in doing their part to build our communities, for your charitable contributions to the less fortunate, and your relentless pursuit of the American dream,” Clarke said.\n\nShe added that the US is blessed to call Pakistan-Americans its neighbours, friends, and loved ones.\n\nSenator Chris Van Hollen affirmed his commitment to further strengthening ties of friendship between the people of the US and Pakistan.\n\n“I’m proud to join you in celebrating Pakistan’s 79th Independence Day. I’m fortunate to have a special connection with Pakistan, having been born in Karachi as the son of an American Foreign Service officer,” the Senator said in a video posted by Radio Pakistan.\n\n“Throughout my life, I’ve experienced firsthand the generosity, the goodness, and the determination of the Pakistani people,” he added. “I’m proud to celebrate the strong people-to-people ties between our two countries, including the diaspora of over 600,000 Pakistani-Americans who contribute to our communities and to our country in every field of endeavour.”\n\nUS Congresswoman and representative for California’s 28th congressional district, Judy Chu, said she wants to extend her “heartfelt congratulations to the people of Pakistan and to the vibrant Pakistani American community here in Southern California”.\n\nChu added: “One of the things I love most about our region is its incredible diversity, and I’m proud that we are home to one of the largest Pakistani American communities in the United States.”\n\nUS Congresswoman and representative from California Zoe Lofgren also congratulated Pakistan.\n\n“I know about the contributions of Pakistani Americans firsthand, as Silicon Valley, which includes part of my district, is home to a large and vibrant community of Pakistani Americans who contribute so much to the well-being of our country,” Lofgren said.\n\n“It’s important to highlight the positive contributions of immigrant communities like Pakistani Americans. Congratulations again. Happy Independence Day.”\n\nShama Haider, the first Muslim and the first Pakistani American to be elected to the New Jersey State Assembly, said it was her honour to send her heartfelt greetings to Pakistanis everywhere.\n\n“Today, we celebrate the courage, the vision and the sacrifice that gave us our beloved motherland. No matter where we live, Pakistan lives in our hearts. Let’s honour our heritage, strengthen our unity and work for progress together. Pakistan Zindabad.”\n\nThe Embassy of China in Pakistan posted on X, extending congratulations to Pakistan on its Independence Day.\n\n“Warmest congratulations to the government and people of Pakistan on celebrating its 79th Independence Day,” read the embassy’s statement. “May Pakistan continue to prosper, and may the ironclad friendship between China and Pakistan grow ever stronger. Chin–Pak Dosti Zindabad!”\n\nIran’s foreign ministry extended its “sincere congratulations to the friendly and brotherly government and people of the Islamic Republic of Pakistan on their Independence Day”.\n\nIt wished “our Pakistani nation everlasting peace, prosperity and wellbeing”.\n\nThe Embassy of Afghanistan in Islamabad, in a Facebook post, conveyed its “sincere congratulation to the Government and the people of Pakistan on the occasion”.\n\n“We reaffirm our steadfast commitment to further strengthening the bonds of friendship and cooperation between our two nations, and to working together towards our shared aspirations for peace, stability, and prosperity in the region,” the embassy’s statement added.\n\nThe Russian Embassy in Pakistan also shared a message on X, conveying its greetings.\n\n“In its 78 years of independence, Pakistan has made significant progress in many areas, strengthened its position in the international community, and contributed to space exploration,” said the embassy’s statement.\n\n“Despite numerous challenges, Pakistan remains faithful to the traditional values and principles established by its founding fathers, Allama Iqbal and Muhammad Ali Jinnah. The people of Pakistan can rightly be proud of their country. From the bottom of our hearts, we wish our Pakistani friends success, prosperity, and well-being! Youm-e-Azadi Mubarak,” the statement added.\n\nTurkiye’s Ministry of Foreign Affairs (Mofa) posted on X: “Congratulations to friendly and brotherly Pakistan on its Day of Independence! Pakistan Zindabad!”\n\nSimilarly, Azerbaijan’s Mofa posted: “Our most sincere and heartfelt congratulations to brotherly People and the Government of Pakistan on the occasion of the 78th anniversary of the Independence Day of the Islamic Republic of Pakistan! Long Live Pakistan! Happy Independence Day!”\n\nThe Delegation of the European Union (EU) to Pakistan in a post on X said the EU Ambassador to the country, Riina Kionka, extended heartfelt wishes to Pakistan.\n\n“Together, we celebrate friendship and unity — because we are stronger together,” the post added.\n\nThe Embassy of France in Pakistan extended its “warmest congratulations to the people and Government of Pakistan on the occasion of Independence Day”.\n\n“Happy Independence Day to all Pakistanis!” the embassy’s post on X added.\n\nGermany’s consul general in Karachi, Andreas Wegner, shared a message for Pakistan, noting: “On this Independence Day, I salute the vision of unity, faith and discipline that inspired the nation’s book.\n\n“Eighty-five years ago, the Lahore Resolution had in motion a movement that, over 75 years, overcame the burden of colonialism and led to the creation of Pakistan. It was a bold call for justice, equality, and representation.\n\n“Ideals worth protecting now as much as then,” the German diplomat stressed.\n\nRomanian Ambassador to Pakistan Dan Stoenescu congratulated the country’s people in a video message shared by Radio Pakistan.\n\nHe said on behalf of the Romanian government and its people, he prays for the constant success, unity, and betterment of Pakistan. “Romania proudly stands with Pakistan in its happiness and reiterates its friendship with the country,” Stoenescu said.\n\nIn a separate tweet, the country’s foreign ministry said it was committed to strengthening “bilateral relations through closer trade, educational and cultural ties, as well as by fostering EU–South Asia dialogue”.\n\nUkraine’s Mofa highlighted on X that the two countries enjoy friendly and mutually beneficial relations.\n\n“Happy Independence Day to the Government and People of Pakistan!” said the ministry’s statement.\n\n“Ukraine and Pakistan enjoy friendly, mutually beneficial relations based on shared trust and respect. Looking forward to further intensify our diplomatic dialogue and practical interaction.”\n\nAmbassador of Sweden to Pakistan Alex Berg von Linde conveyed his country’s heartfelt congratulations and warm wishes to the people of Pakistan.\n\nThe Embassy of Switzerland in Pakistan sent “warm wishes to all Pakistanis celebrating August 14th”.\n\nThe Indonesian Embassy in Islamabad also wished Pakistan its 78th birthday in an X post.\n\nHeader image: Pakistanis celebrate the 79th Independence Day on Aug 14, 2025. — X/RadioPakistan",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/141420424c6c1f6.png",
  "retrievedAt": "2025-08-16T07:38:09.191Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930834/global-leaders-extend-wishes-on-pakistans-79th-independence-day",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T08:43:27.000Z"
}
