{
  "title": "At least 37 killed in India-occupied Kashmir floods: official - World - DAWN.COM",
  "author": null,
  "content": "Powerful torrents driven by intense rain that smashed into a Himalayan mountain village in India-occupied Kashmir killed at least 37 people on Thursday, a top disaster management official told AFP.\n\nIt is the second major deadly flooding disaster in India this month.\n\n“Dead bodies of 37 people have been recovered,” said Mohammad Irshad, a top disaster management official, adding there was no count of any missing people available.\n\nIrshad told AFP 150 wounded people were also rescued from the disaster site, “50 of whom are severely injured”, all sent to nearby hospitals.\n\nSushil Kumar, a resident of nearby Atholi village, told AFP: “I saw at least 15 dead bodies brought to the local hospital.”\n\nThe disaster occurred in Chasoti town of Kishtwar district, a pit stop on a popular pilgrimage route. It comes a little over a week after a heavy flood and mudslide engulfed an entire village in the Himalayan state of Uttarakhand.\n\nEarlier, Kishtwar Deputy Commissioner Pankaj Kumar Sharma said, “We have found 34 dead bodies and rescued 35 injured people. There are chances of more dead bodies being found.”\n\nVisuals on television showed pilgrims crying in fear as water flooded the village. Local TV channels said the floodwater had washed away community kitchens set up for pilgrims.\n\nThe disaster occurred at 11:30am (11am PKT), Ramesh Kumar, the divisional commissioner of Kishtwar district, told news agency ANI, adding that local police and disaster response officials had reached the scene.\n\n“Army, air force teams have also been activated. Search and rescue operations are underway,” Kumar said.\n\n“The news is grim and accurate, verified information from the area hit by the cloudburst is slow in arriving,” Omar Abdullah, the chief minister of India-occupied Jammu and Kashmir, said in a post on X.\n\nA cloudburst, according to the Indian Meteorological Department, is a sudden, intense downpour of over 100 millimetres of rain in just one hour that can trigger sudden floods, landslides, and devastation, especially in mountainous regions during the monsoon.\n\nThe local weather office in Srinagar predicted intense showers for several regions in occupied Kashmir on Thursday, including Kishtwar, asking residents to stay away from loose structures, electric poles and old trees as there was a possibility of mudslides and flash floods.\n\nCrowds gathered at a Kishtwar hospital while people carried some of the injured on stretchers.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0417074259d9dae.jpg?r=171919",
  "retrievedAt": "2025-08-16T07:38:01.754Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930859/at-least-37-killed-in-india-occupied-kashmir-floods-official",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T10:36:50.000Z"
}
