{
  "title": "UNHCR donates 5,000 disposable coveralls to PDMA",
  "link": "https://www.app.com.pk/national/unhcr-donates-5000-disposable-coveralls-to-pdma/",
  "date_published": "2020-08-21T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP):UNHCR donate 5,000 non-woven 60 GSM disposable coveralls produced by Afghan refugees to the Provincial Disaster Management Authority (PDMA) in Khyber Pakhtunkhwa on Friday.\nThis livelihoods initiative was led by UNHCR and its partner, Sarhad Rural Support Programme (SRSP).\nIn the wake of the corona virus outbreak, the government initiated various preventive measures to contain the spread of the corona virus.\nThis included closing educational institutions and markets, as well as placing restrictions on mobility and implementing lock downs.\nThis left those who rely on the informal market jobless.\nKeeping these socioeconomic effects in mind, UNHCR and its partner, SRSP, responded to the call to sustain the livelihoods of refugees and designed a project that involved Afghan refugees with tailoring skills.\nThese Afghan tailors stitched disposable coveralls and non-medical face masks and were able to earn from each item stitched.\nThis project not only helped produce personal protective equipment for health workers but also established a link to the job market and supported the most vulnerable Afghan refugees in meeting their immediate needs during the pandemic.\nDuring a handing-over ceremony, Mr. Bernard Inkoom, the Head of the UNHCR Sub-Office in Peshawar, said that he was “aiming to promote self-reliance and sustainable livelihoods for Afghan refugees through capacity-building initiatives and income-generating activities.”\nHe added that this was successfully achieved by employing 23 Afghan refugees to stitch the 5,000 coveralls.\nMs. Tammana, a young Afghan refugee, said, “The wave of COVID-19 was a huge threat to our livelihood.\n“I am very gratified that UNHCR and SRSP enabled me to support my family in this grave situation. The amount helped me out in paying the house rent and other grocery bills that were piled up during COVID-19.” she said.\nSimilarly, Ms. Memona expressed her gratitude, adding that UNHCR and SRSP enabled her to support her family after her husband was paralyzed during the pandemic.\nShe added that she will use her earnings to pay the house rent, as well as cover the cost of her husband’s treatment and her children school admission fee.\nThe relief items were handed over to Mr. Amer Latif, Secretary, Relief, Rehabilitation, and Settlement Department at Relief, Rehabilitation and Settlement Department and Director General PDMA Pervez Khan.\nPDMA KPK immediately dispatched 4,000 disposable coveralls to Health Department while 1000 to rescue 1122.\nPreviously, UNHCR, the UN Refugee Agency donated five fully equipped ambulances to the Government of Khyber Pakhtunkhwa as part of its response plan to pandemic COVID-19.",
  "retrievedAt": "2025-08-11T19:41:45.146Z"
}
