{
  "title": "Sh Rasheed inaugurates Postgraduate College of Women, Railway Station",
  "link": "https://www.app.com.pk/national/sheikh-rasheed-college/",
  "date_published": "2020-08-21T10:07:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 21 (APP): Federal Minister for Railways Sheikh Rasheed here on Friday inaugurated Government Postgraduate College for Women, Railway Station Road, completed at a cost of Rs100 million.\nAddressing the inaugural ceremony, the minister said, third floor of the college building would also be constructed to start postgraduate classes within shortest possible time frame.\nHe said that he had started the public service journey by establishing schools, colleges and universities particularly in middle class areas in Rawalpindi. “When we started to focus education field, the city was at 27th position in Punjab, but, now we are at first position in women education,” he added.\nHe announced that efforts would be made for up-gradation of the government Viqar un-Nisa Postgraduate College to the status of university.\nThe Government College for Girls, 6th Road had already been upgraded to university, he mentioned.\nRawalpindi City would be a unique city where three women universities will exist. Setting up of another women university in Rawalpindi was a difficult task but hectic efforts were made for sixth road university.\nHe said nobody could defeat daughters of Rawalpindi because they are getting higher education from the colleges and universities provided by the government.\nSh Rasheed said Prime Minister of Pakistan Imran Khan and CM Sardar Usman Buzdar were showing keen interest in bringing change in education sector. He hoped that Rawalpindi city would get two more women colleges soon.\nSheikh Rasheed Ahmed, Rawalpindi city would have a state of the art Railway University which would be biggest Rail University in the subcontinent. The Railway University would be established in cooperation with China, he said.\nHe said the land for the University would be provided by the Pakistan Railways which would be constructed with the investment of China.\nThe Railways Minister said, “We will also make efforts for establishment of an IT University in the city which, he added, had been atop in the education field particularly women education since last 10 years.”\nHe said, the Railways infrastructure would be upgraded under the Main Line-1 (ML-1) project which would significantly reduce the travel time between Rawalpindi and Karachi. The project would provide job opportunities to over 150,000 persons. It would change fate of the country, he added.\nThe minister said the Leh Expressway project would also be executed and it was his utmost effort that a rail track was also made part of the project in order to fully facilitate the commuters of Rawalpindi and Islamabad.\nResponding to a question, he said the Pakistan Tehreek-e-Insaf (PTI) government would complete its full five-year term. He said the government was striving to check inflation and unemployment. The government has imported wheat, he said adding, sugar would also be imported to bring the prices of the commodity down. The step would help control prices of essential commodities, he added.\nThe Minister informed that a ‘Mother and Child’ hospital project was being completed in Rawalpindi, adding, the hospital would have 14 state of the art operation theaters.\nHe said the present government was taking special interest in laying a network of schools, colleges and institutions, adding that more educational institutions were being built in the city.\nHe said that solid steps being taken to resolve basic issues regarding supply of clean drinking water, provision of standard education and improved healthcare facilities for which maximum resources were being utilized.",
  "retrievedAt": "2025-08-11T19:41:50.521Z"
}
