{
  "title": "Reduction in current account deficit, increase in remittances reflect govt’s achievements: Dr Shahzad",
  "link": "https://www.app.com.pk/national/govt-achievements-shahzad/",
  "date_published": "2020-08-21T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Leader of the House in the Senate Dr Shahzad Waseem Friday said that controlling COVID-19 pandemic, reduction in current account deficit and increasing foreign remittances were some of the achievements, which reflect the success of the government policies.\nIn an informal interaction with media persons, he said international community was acknowledging the government policies against coronavirus.\nHe said world financial institutions were praising the prudent economic policies of the country and all economic indicators were giving positive signals for strengthen national economy, adding that the government made hectic efforts in this regard.\nThe Leader of the House said the government would not get blackmailed from anyone and was fully committed to fulfill all promises which were made with the people during the general elections.\nHe said although the government had handled coronavirus effectively but there was need to do lot of in health sector. Replying to a question, he said the President’s joint session address was not an ordinary address but had a great importance.\nHe said Indian Prime Minister Narindra Modi policies had unveiled the face of its secularism and destroyed the image of the larger democracy. He said India was isolating in the world now due to fascist policies of Modi’s government, adding that Indian government was openly violating human rights and committing atrocities not only against unarmed Kashmiris but all the minorities which were living in India.\nHe said Kashmiri people had raised their flag of independence despite of facing barbarism of Indian forces against them in Indian Illegally Occupied Jammu and Kashmir (IIOJK).",
  "retrievedAt": "2025-08-11T19:41:48.164Z"
}
