{
  "article_id": "2025-04-25_cc170e71e34b01d376ef87ddbbe57ec6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/two-day-intl-law-summer-school-held-by-ipri-2/",
    "retrieved_at": "2025-08-27T14:54:06.004Z"
  },
  "metadata": {
    "title": "Two-day Int’l Law Summer School held by IPRI",
    "author": null,
    "date_published": "2025-04-25T10:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 445,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 25 (APP):The Islamabad Policy Research Institute (IPRI) held a two-day International Law Summer School from April 22 to 23, 2025. The sessions were focused on technology & international law: challenges and opportunities. The programme brought together speakers with experience in legal scholarship and research practice. The Summer School opened with remarks by Lt. Gen. Majid Ehsan, HI(M) (Retd), President of IPRI. He addressed the scope of the event and stated that the aim was to support dialogue on international legal questions shaped by technological and environmental change, said a press release issued on Friday. Roberto Ruppo, Assistant Professor at the Marche Polytechnic University of Ancona, Italy, delivered a presentation titled AI and International Law. Speaking online, he examined the legal structures that govern the use of artificial intelligence in international contexts. His discussion included references to legal responsibility, automation in military applications, and the role of international agreements. Maham Naweed, Chair of International Law at IPRI, followed with a session titled International Organizations, Law and Technology. She provided an overview of the role that international legal bodies play in the regulation and oversight of technology. Her remarks focused on institutional practices, policy coordination, and the influence of technological tools on legal procedures. In the afternoon, Dr. Saadia Zahoor, an international law expert, delivered a session titled Technology and the Future of International Dispute Resolution. She discussed how technology is used in arbitration and legal mediation across borders. Her talk included examples of current platforms, case management tools, and mechanisms for online hearings. The second day opened with a session titled War, International Law and Emerging Technologies by Oves Anwar, Director of Research at the Research Society of International Law (RSIL). He presented on the application of international humanitarian law in the context of new technologies used in armed conflict. His session covered the use of remote systems, digital surveillance, and the legal classification of new weapons. Asghar Leghari, Founding Partner of PrimeLegalCo., presented a session titled Role of Emerging Technologies in Climate Change Mitigation and Adaptation. He spoke on legal mechanisms that enable the use of technology in addressing environmental challenges. Topics included regulation of energy systems, land management tools, and frameworks that link environmental law and development planning. The final session was delivered by Dr. Aneel Salman, OGDCL-IPRI Chair for Economic Security. His session, titled Beyond the AI Hype: Balancing Innovation with Responsibility, focused on governance approaches for technological innovation. He discussed oversight, institutional mandates, and the application of public interest standards in the development of new technologies. The International Law Summer School served as a platform for research-based discussions and supported IPRI's efforts to promote legal scholarship on current policy concerns.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}