{
  "title": "Pakistan reports second polio case of year 2022",
  "link": "https://www.app.com.pk/national/pakistan-reports-second-polio-case-of-year-2022/",
  "date_published": "2022-04-29T16:00:00.000Z",
  "source": "APP",
  "content": "According to the spokesman of the Ministry of National Health Services, the child had an onset of paralysis on April 14.\nThe new type-1 wild polio-virus (WPV1) was confirmed from North Waziristan on 29 April 2022 by the Pakistan National Polio Laboratory at the National Institute of Health in Islamabad, he added.\nHe said that, on 22 April, a 15-month boy had been confirmed with wild polio with an onset of paralysis on April 9. Both children are from North Waziristan, Southern Khyber-Pakhtunkhwa (KP) and belong to adjacent Union Councils of Mir Ali.\nThe WPV1 cases are genetically linked and belong to the same virus cluster, further validating the Pakistan Polio Programme’s concerns for Southern KP, where continuous virus circulation has been detected.\n“It is heartbreaking to learn that a two-year-old girl will be paralyzed for the rest of her life by a virus that has been eliminated in most parts of the world,” Minister for Health Qadir Patel said. “This is tragic for her family, for the community and all of us in Pakistan, but mostly for this child, who will live with an incurable disease that was entirely preventable.”\n“I am directly in contact with the Emergency Operations Centre for polio. They remain highly vigilant and are urgently working to ensure that the virus does not spread outside this particular area. I am personally looking into the case and detailed investigations pertaining to it,” the health minister said, adding, “After Eid, I will be visiting the province myself to monitor the situation on the ground.”\nThe polio programme’s health workers on the frontline continue to reach children in North Waziristan despite challenging circumstances in hard-to-reach areas.\nSouthern KP had been identified by the polio programme as the area most at risk after wild poliovirus was detected in environmental samples in the last quarter of 2021. Following this, an emergency action plan was initiated in January this year that is allowing the programme to reach more children than ever before and protect them from the paralytic virus before it affects more lives.\n“The National and Provincial Polio Emergency Operations Centres are already conducting an emergency vaccination campaign following the confirmation of the case last week. I strongly urge everyone traveling for Eid to vaccinate their children if they are traveling from one area to another,” Health Secretary Aamir Ashraf Khawaja said.\n“This is deeply sad for all of us in the polio programme. But we are resilient and unwilling to fail. While we will do whatever it takes to ensure that this little girl is the last child with wild polio, we fear that more children from the same area may be affected as the virus circulates,” National Emergency Operations Centre (NEOC) Coordinator Dr Shahzad Baig said.\nAs a response to the last case detection, an emergency vaccination campaign was launched on April 28 in South KP.\nIn 2020, the province of Khyber-Pakhtunkhwa reported 22 cases, while no wild polio virus cases were recorded in the province last year. In 2021, Pakistan reported one case on January 27, 2021, in Killa Abdullah, Balochistan.\nWild polio-virus types 2 and 3 have been eradicated globally, while WPV1 cases are at a historic low.Pakistan remains one of only two polio-endemic countries along with Afghanistan. Poliovirus is highly infectious and until this last remaining epidemiological bloc is wiped out, children all over the world will remain at risk.",
  "retrievedAt": "2025-08-11T14:47:23.306Z"
}
