{
  "title": "Pakistan wants to transform historic relations with Saudi Arabia: PM",
  "link": "https://www.app.com.pk/national/pakistan-wants-to-transform-historic-relations-with-saudi-arabia-pm/",
  "date_published": "2022-04-29T18:58:00.000Z",
  "source": "APP",
  "content": "The prime minister arrived in Saudi Arabia on Thursday for a three-day visit — his first official foreign trip since assuming office on April 11.\n“Our two countries have had this special bond for seven decades now. It is now our earnest desire to transform this relationship into a deep, diverse and mutually beneficial strategic partnership,” Sharif told Arab News Pakistan Edition in a written interview.\n“The very fact that I went to the Kingdom of Saudi Arabia on my first visit abroad, reflects the high importance that Pakistan attaches to its special relationship with Saudi Arabia.”\nThe prime minister said both countries were now working on exploring new and non-conventional areas of bilateral cooperation, with a particular focus on promoting economic, trade and investment ties.\nAs most of the world remains concerned by the situation in Europe, following Russia’s invasion of Ukraine, Sharif said that Pakistan enjoys good relations with both countries and hoped that peace talks between Moscow and Kyiv would resume soon.\n“The conflict reflects failure of diplomacy. There is a need for immediate cessation of hostilities, sustained dialogue, and continuous diplomacy,” he added. “A diplomatic solution in accordance with relevant multilateral agreements, international law, and the provisions of the UN Charter is indispensable.”\nWhile Pakistan has abstained from various UN resolutions condemning the invasion that started in late February, Sharif said it “supports all efforts to provide humanitarian relief to civilians in the affected areas.”\nIslamabad had dispatched two C-130 aircraft to deliver relief assistance to the people of Ukraine and was considering sending more supplies as a “gesture of solidarity,” he added.\n“The conflict was not in the interest of anyone, especially the developing world.”",
  "retrievedAt": "2025-08-11T14:47:22.455Z"
}
