{
  "title": "Security beefed up in AJK to avert any untoward incident",
  "link": "https://www.app.com.pk/national/security-beefed-up-in-ajk-to-avert-any-untoward-incident/",
  "date_published": "2022-04-28T19:24:00.000Z",
  "source": "APP",
  "content": "MIRPUR  (AJK ) Apr 28 (APP): In Azad Jammu and Kashmir (AJK) security had been put on high alert after the recent terrorist attack at the University of Karachi, to avert any untoward incident in the State.\nDecision to this effect was taken during a high-level meeting, chaired by Prime Minister Sardar Tanveer Ilays Khan and attended by the heads of various security agencies in the State metropolis on Thursday.\nOn the occasion, the prime minister issued special directives to the law enforcement agencies urging them to ensure the safety of life and property of all foreigners, in particular the Chinese engineers working in different areas of the state.\nHe also asked the security agencies to keep a close eye on enemy’s activities in the areas adjacent to the Line of Control.\nThe security agencies had also been directed to ensure foolproof security arrangements at all exit and entrance points of Azad Kashmir. Moreover, security had been beefed up in the state in wake of Eid-ul-Fitr to avoid any untoward incident on the auspicious occasion.\nIn a separate introductory session with government secretaries the PM AJK Sardar Tanveer Ilyas emphasised on evolving a sustainable policy for the establishment of good governance in the region. Outlining his government’s future course of action.\nThe PM while apprising the secretaries of his government’s priorities said that merit-based appointments would be first and foremost priority of the government.\n“The government is supposed to create facilities for the people, improve life and provide relief to the masses”, he said, adding that the government would take concrete steps that would be instrumental in improving the lives of the common people.\nHe said that the government was well aware of the problems faced by the secretaries. “Government was aware of these issues and would try to resolve them”, he added.\nThe PM said the system of government cannot be run without administrative machinery.\nMeanwhile, the Chief Secretary, Additional Chief Secretary Development and Secretary Finance also called on Prime Minister Sardar Tanveer Ilyas and discussed  issues regarding the preparation of the forthcoming budget.\nThe PM told the secretaries that in the budget ample funds should be allocated for development.\nHe said that along with the ongoing projects, new projects should be made a part of the budget, which he said would lead to new employment opportunities in the region.\n“A comprehensive policy should be devised to prevent wastage of development funds”, the PM said, adding that ongoing projects under the Local Government Department should be completed at all costs and the system of physical checking and monitoring should be made effective before releasing new projects.\nHe said, “Investigations will be carried out on projects that have not been completed within the stipulated time frame”, he said adding that the concerns of public representatives regarding the disposal of development budget should also be addressed.\nHe said that Good Governance Committee (GGC) had also been established under the chairmanship of AJK Legislative Assembly, Speaker  Chaudhry Anwar-ul-Haq.\nThe GGC, he said, would provide guidance to the government regarding the improvement of governance in the region.",
  "retrievedAt": "2025-08-11T14:47:33.947Z"
}
