{
  "title": "President asks HEC to take steps against Baloch students’ harassment, racial profiling",
  "link": "https://www.app.com.pk/national/president-asks-hec-to-take-steps-against-baloch-students-harassment-racial-profiling/",
  "date_published": "2022-04-29T08:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 29 (APP): President Dr Arif Alvi on Friday directed the Higher Education Commission (HEC) and the Vice-Chancellor of Quaid-i-Azam University (QAU), Islamabad to take necessary measures to avoid incidents of harassment and racial profiling of Baloch students at the university campuses.\nThe president passed these directions after hearing the grievances of Baloch students in compliance with the Islamabad High Court’s Order dated 8 April 2022, passed in Writ Petition No. 794 of 2022 asking the President/Chancellor, QAU to ensure that the issues of Baloch students regarding ethnic profiling were probed and a report was submitted before the Court.\nThe hearings were held at Aiwan-e-Sadr and were attended by Vice-Chancellor (VC) QAU Prof Dr Muhammad Ali, Additional Secretary Ministry of Interior Muhammad Ayub Chaudhary, and Advocate Imaan Zainab Hazir.\nThe president said the country faced a unique situation and the resurgence of terrorist activities was a cause of concern.\nHe added that counter-terrorism efforts were essential to peace and stability, however stressed that these needed to be carried out with utmost care and balance so as to not isolate or profile any segment of the population, particularly the students of Balochistan.\nHe also directed the VC QAU that in the case of students of Balochistan there was a general sense of deprivation or isolation, therefore, it was incumbent on all educational institutions to take more care to address such sentiments.\nHe said a proactive programme of activities and debates within the student community should be developed to address feelings of deprivation among Baloch students.\nHe further asked the VC QAU to diligently monitor any activity which may be a cause of concern to the Baloch students at QAU and to verify the credentials of visitors in order to check the impersonification and maligning of law enforcement agencies.\nEarlier, the President had held hearings on the 20th and 21st of April 2022 with Baloch students where it was informed that a Baloch student had disappeared from his home town in Balochistan after receiving a phone call from an unknown person who asked him to meet another unknown person, at QAU Campus.",
  "retrievedAt": "2025-08-11T14:47:33.564Z"
}
