{
  "title": "Swedish ambassador calls on Federal Minister Sherry Rehman",
  "link": "https://www.app.com.pk/national/swedish-ambassador-calls-on-federal-minister-sherry-rehman/",
  "date_published": "2022-04-29T15:48:00.000Z",
  "source": "APP",
  "content": "During the meeting held here at the minister’s office on Friday, the Sweden ambassador said that his government is aware of Pakistan’s climate-vulnerability and scale of the risk exposure from climate risks to the lives and livelihoods of the people in general and agriculture, which is backbone of the country’s economy, in particular.\nThe ambassador informed the minister Sherry Rehman that his government has initiated joint programmes with governments in developing countries, where people, their livelihoods and various socio-economic sectors are increasingly exposed to climate shocks, particularly floods, depleting groundwater resources, crop failures, potable water shortages, energy supplies.\nThe Swedish envoy expressed his government’s intents to jointly work with Pakistan in dealing with the latter’s environmental challenges, water shortages by recycling domestic wastewater for its re-use for various purposes including agriculture.\nThe federal minister Sherry Rehman welcomed the generous offer by the Swedish ambassador for collaboration in renewable energy, wastewater treatment, e-vehicles, disaster risk management, climate resilience.\nShe told the ambassador that the incumbent government is very much committed to achieving environmental development and enhanced climate resilience.\nHowever, any opportunity of collaboration with the Swedish government to achieve to mitigate Pakistan’s environmental challenges and climate risks is encouraging.“We would, surely, jointly work with the Swedish government and welcome its any support in transferring technical know-how and building technical capacity of relevant stakeholders that support the implementation of the country’s green policies,” the federal Minister Sherry Rehman told the ambassador.\nEarlier, the Swedish ambassador informed the minister that this year his country is hosting the World Environment Day, marked every year on June 5 globally.\nHe said that various activities have been planned by his embassy that will happen in Islamabad.\nThe ambassador also invited the minister to join the World Environment Day celebrations.",
  "retrievedAt": "2025-08-11T14:47:27.633Z"
}
