{
  "title": "Pakistan welcomes US-Taliban peace agreement: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-welcomes-us-taliban-peace-agreement-qureshi/",
  "date_published": "2020-02-29T10:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP):Foreign Minister Shah Mahmood Qureshi Saturday welcomed the signing of landmark peace agreement between the United States and Taliban in Doha, Qatar saying it carried immense importance — both in symbolism and substance — for Afghanistan, the region and beyond.\nDuring media interaction in Doha where he was specially invited by the Qatari deputy prime minister and foreign minister to the signing of the peace agreement, Qureshi said the peace agreement reflected a significant step forward by the US and the Taliban in advancing the ultimate aim of peace and reconciliation in Afghanistan.\nForeign Minister Qureshi reiterated that Pakistan would continue its policy of supporting the Afghan people in their efforts to achieve lasting peace, stability and development in Afghanistan.\n“Today’s ceremony has, once again, vindicated Pakistan’s long-held stance that there is no military solution of the Afghan conflict. Prime Minister Imran Khan has consistently underlined that a political settlement was the only way forward,” a press release quoted the foreign minister as saying.\nShah Mahmood Qureshi underlined that Pakistan had fulfilled its part of the responsibility in terms of facilitating this peace agreement. Pakistan would continue to support a peaceful, stable, united, democratic and prosperous Afghanistan, at peace with itself and with its neighbours, he added.\nHe also appreciated personal contribution of Amir of Qatar to the whole process.\nThe foreign minister noted that Intra-Afghan negotiations would be the next logical step after today’s event.\nHe expressed the hope that the Afghan parties would now seize this historic opportunity and workout a comprehensive and inclusive political settlement for durable peace and stability in Afghanistan and the region.\nHe also underlined the need for the international community to recognize that Afghanistan would require support to commence reconstruction and rehabilitation phase.\nRedrawing the international community’s attention to Afghan refugees in Pakistan, Qureshi underscored the need to assist the Afghan government in creating an enabling environment for the return of the refugees to their homeland with dignity and honour.",
  "retrievedAt": "2025-08-11T18:52:42.656Z"
}
