{
  "title": "Pakistan’s leading role facilitates US-Taliban peace deal",
  "link": "https://www.app.com.pk/national/pakistans-leading-role-facilitates-us-taliban-peace-deal/",
  "date_published": "2020-02-28T21:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP):Top official from the United States and Taliban representative Saturday signed the much awaited final peace agreement in Doha viewed as ending US longest war since 2001 and paving way for the complete US troops withdrawal from Afghanistan through gradual phases within 14 months.\nThe peace agreement was signed by US envoy Zalmay Khalilzad and Taliban deputy leader Mullah Abdul Ghani Baradar in the presence of officials and representatives from over fifty countries including Foreign Minister Shah Mahmood Qureshi in the Qatari’s capital.\nPakistan’s key role in encouraging and enabling the parties involved to the negotiation table was repeatedly acknowledged and appreciated by the Trump administration.\nIn line with the stance of Pakistan Tehreek-e-Insaf government as vehemently articulated by Prime Minister Imran Khan as well as the ‘Bajwa Doctrine’ the US and its allies finally came to realization that use of military force was no solution to woes of warn torn country and a viable well politically negotiated settlement was key to ending decades old Afghan conflict.\nPakistan, leading all efforts for Afghan peace and reconciliation under an ‘Afghan owned and Afghan led process’, also ensured and fulfilled its due responsibility that these endeavours reach to a conclusion, ending decades of fighting which left the country in utter turmoil, crippled and fragile economy , years of deaths and destruction further compounding miseries of the Afghan people.\nIndia again playing a spoiler’s game could not succeed in disrupting the peace deal.\nForeign minister Shah Mahmood Qureshi, who attended the ceremony on the special invitation of Qatari leadership, tweeted “Today is historic in the advancement of the ultimate aim for peace & reconciliation in Afghanistan.”\nPakistan, he says, has played a committed and decisive role in the realization of the Afghan peace deal. “PM Imran Khan’s vision has consistently championed diplomacy over military solution.”\nPrime Minister Imran Khan also welcomed the peace agreement. “This is the start of a peace & reconciliation process to end decades of war & suffering of the Afghan people. I have always maintained that a pol (political) solution, no matter how complex, is the only meaningful path to peace,” he posts on his twitter account.\nHe also reaffirmed that Pakistan was committed to playing its role in ensuring the agreement to hold and succeed in bringing peace to Afghanistan.\nDuring the signing ceremony, Taliban deputy leader Mullah Abdul Ghani Baradar in his remarks appreciated Pakistan’s role in Afghan peace and reconciliation efforts.\nThe roadmap to agreement saw many ups and downs, when last September, US president Donald Trump in his tweets abruptly announced cancelation of the talks after an American soldier was killed in Taliban attack.\nBut due to Pakistan’s consistent point of view over the Afghan imbroglio, both sides agreed to re-negotiate the deal.\nThe major points of the peace agreement includes a timeline of 14 months for the withdrawal of all US troops from Afghanistan, a Taliban guarantee that Afghan soil will not be used as a launch pad against US, swapping of thousand of prisoners, commencement of intra-Afghan negotiations by March 10 besides, a permanent and comprehensive ceasefire.\nAbout 14,000 US troops and approximately 17,000 troops from 39 NATO allies and partner countries are currently stationed in Afghanistan.\nUnder the agreement, the US would reduce the number of US military forces in Afghanistan to 8,600 and implement other commitments in the US-Taliban agreement within 135 days of the announcement of this agreement.\nUS secretary of state Mike Pompeo also termed the agreement as historic one and expressed the optimism that Taliban would honour their commitment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:52:51.238Z"
}
