{
  "title": "President extends greetings to nation on Quaid-e-Azam’s birth anniversary",
  "link": "https://www.app.com.pk/national/president-extends-greetings-to-nation-on-quaid-e-azams-birth-anniversary/",
  "date_published": "2023-12-25T06:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP): President Dr Arif Alvi on Monday extended his heartfelt greetings to the nation on the occasion of 147th birth anniversary of the father of the nation Quaid-e-Azam Muhammad Ali Jinnah.\nQuaid-e-Azam was the great benefactor of the nation whose tireless efforts led to the creation of a separate homeland for the Muslims of the Sub-continent, President Alvi said in a message issued by the President House Press Wing.\nThe president said as a leader of the All-India Muslim League, Muhammad Ali Jinnah advocated for the rights and interests of the Muslim community in British India and firmly believed in the idea of a separate homeland for Muslims, where they could freely practice their religion and have just political representation.\nThrough his eloquent speech and tireless effort, Jinnah successfully mobilized support for the demand of a separate nation.\n“This day reminds us to adopt the ideals and vision of Quaid-i-Azam and continue our efforts to make Pakistan a prosperous and stronger country. Today, we pay homage to the resilience, wisdom, vision, and foresightedness of Father of the Nation who laid the groundwork for a nation where diversity is celebrated and faith is a unifying force,” he said.\nHe added, “I feel proud to say that the people of Pakistan have shown great resilience in the face of multiple challenges during the last several decades”.\nIt is a matter of greater satisfaction that Pakistan has achieved remarkable success in various fields despite the challenges.\n“Today, as we stand on the cusp of commemorating this momentous occasion, it is imperative to reflect on the remarkable journey we have undertaken since the birth of our nation, the president remarked.\nHe said decades have passed, each chapter marked by trials, triumphs, and the unyielding spirit of our people as we journey toward the vision of our Founding Father.\nHis leadership and statesmanship laid the foundation for a democratic and inclusive Pakistan, where people of all religions and backgrounds could coexist, he said.\nAs regards the achievements and personality of Jinnah, President Alvi quoted the words of Stanley Wolpert from his famous book “Jinnah of Pakistan,” as “Few individuals significantly alter the course of history. Fewer still modify the map of the world. Hardly anyone can be credited with creating a nation-state. Muhammad Ali Jinnah did all three.”\n“Together, we envision a Pakistan that stands tall as a beacon of hope, resilience, and justice—a nation that stands firm on the promise of a democratic, just, and free society,” he added.\nThe president also resolved to work for the promotion of Islamic ideals, moral values, unity and brotherhood.\nHe said the current situation demanded following the vision of the Father of the Nation and his guiding principles in letter and spirit to promote unity and democratic values as well as overcome the challenges being faced by the country.",
  "retrievedAt": "2025-08-11T11:12:35.501Z"
}
