{
  "title": "Govt’s effort for tax reforms, documentation of economy aimed at addressing problems of businessmen: President",
  "link": "https://www.app.com.pk/national/govts-effort-for-tax-reforms-documentation-of-economy-aimed-at-addressing-problems-of-businessmen-president/",
  "date_published": "2021-09-29T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): President Dr. Arif Alvi on Wednesday said that the government’s effort for reforms in the country’s tax system and documentation of economy was not only aimed at broadening the revenue base but also to address the problems of businessmen.\n“You have genuine concerns. You have to face problems in the payment of taxes, as some taxmen create hurdles. But the government’s effort to reform the tax system and document the economy is to address such issues and broaden the revenue base,” he remarked.\nThe President was addressing the 44th Federation of Pakistan Chambers of Commerce and Industry (FPPCI) Exports Award ceremony held here at the Aiwan-e-Sadr.\nHe said enhanced revenue collection through broadening of tax base was essential for the government to provide maximum facilities to masses in diverse areas including health and education.\nThe President said that increased revenue collection and financial resources were also important for the government to benefit the masses especially to provide targeted subsidies to the poor.\nHe congratulated the recipients of the FPCCI Exports Award and said the exporters were playing major role in the country’s socio-economic development.\nThe President said that the present government was creating business-friendly environment for traders and industrialists and making policies in consultation with all the stakeholders, which was essential for success of policies.\nHe called upon the traders, exporters and industrialists to also focus on and benefit from Information Technology (IT) sector, which was among the top ten businesses in today’s modern world.\nThe President mentioned the recent establishment of an IT-based industry in Lahore and it had realized around US $ 80 million exports in eight months alone.\nHe also urged the exporters to take the country’s women along in trade and industrial sectors and benefit from their skills in diverse areas.\nThe President mentioned that hardly 5% of the loans allocated by various banks for women have been utilized.\nHe said that women can play important role in the development of Small and Medium Enterprises (SMEs) sector, which had around 70% of contribution in China’s economic progress.\nThe President also called upon the traders and industrialist to give employment to the country’s differently-abled people by enhancing their skills.\nSince every country had around 10 to 12 percent disabled persons, it was the moral obligation of traders and industries to give them the opportunity of earning through respectable means.\n“It is my request to do it not due to any compassion but through skill development of such people,” he maintained.\nThe President further urged the industrialist to also take care of the country’s climate and environment and play their role for a rising and shining Pakistan.",
  "retrievedAt": "2025-08-11T21:20:50.917Z"
}
