{
  "title": "Innovation of agri sector, uplift of farmers a priority: PM",
  "link": "https://www.app.com.pk/national/innovation-of-agri-sector-uplift-of-farmers-a-priority-pm/",
  "date_published": "2021-09-29T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Prime Minister Imran Khan on Wednesday said bringing innovation in the agricultural sector and ensuring prosperity of the farmers was among the top priorities of the government.\nChairing a high-level meeting on the development of the agricultural sector, the prime minister said for the first time in the country, a comprehensive strategy had been formulated for the betterment of the agricultural sector.\nThe prime minister said the Agricultural Transformation Plan was the first step towards food autonomy and mentioned that the Agri Dashboard would prove helpful in timely decision-making.\nThe meeting was attended by Finance Minister Shaukat Tareen, National Security Adviser Moeed Yousuf, Special Assistants Dr Shahbaz Gill, Jamshed Iqbal Cheema and the concerned officials. The chief secretaries of the four provinces joined through video-link.\nIt was highlighted that the Food Security Dashboard had been fully activated for wheat. The dashboard contains the demand and supply indicators of wheat at tehsil, district, division, province and national level.\nThe Dashboard will guide about the effective monitoring of prices, procurement and the timely decision-making. It will also help in taking timely action against profiteers and those involved in illegal hoarding of agricultural commodities.\nThe Dashboard will be updated on daily statistics to prepare the real-time data on availability of wheat in the country.\nThe meeting was informed that after wheat, the categories of sugar and other food commodities will be added to the Dashboard.\nThe steps are aimed at saving the country from the future food crisis.\nLater, the meeting was given a detailed briefing on the Agricultural Transformation Plan. The plan includes ensuring supply of high-quality seeds to increase crop yields.\nIn this regard, after amendments in rules and regulations, only those companies in the country will be registered which provide high-quality seeds after research.\nUnder Asian Development Bank, a PC-1 for distribution of quality seeds among Punjab, Balochistan and Khyber Pakhtunkhwa has also been approved.\nTo ensure access of farmers to seeds, the data from the Consumer Sourcing Authenticity System will be completed by this December.\nThe meeting was also briefed on the progress on cooperation with the Chinese Academy of Agricultural Sciences to increase innovation and productivity in the agricultural sector.\nThe step will significantly reduce the cost per acre with use of modern technology.\nAlso, four Centers of Excellence in Punjab, research institutes in Sindh, Balochistan and Khyber Pakhtunkhwa and agricultural sector innovations are part of the project.\nThe project focuses on genetic improvement of cattle to increase meat and milk production and a comprehensive import strategy is being formulated at the government level.\nThe strategy will not only focus on increasing production by conducting research on breeds of cattle.\nA helpline 9211 is being introduced for cattle farmers and in Punjab, the facility has been reactivated.\nThe meeting was updated on the progress on projects related to olive cultivation and the Kisan Card, aimed at the uplift of farmers.",
  "retrievedAt": "2025-08-11T21:20:55.436Z"
}
