{
  "title": "Speakers highlight huge potential for burgeoning Pak-Russia relations",
  "link": "https://www.app.com.pk/national/speakers-highlight-huge-potential-for-burgeoning-pak-russia-relations/",
  "date_published": "2021-09-29T11:21:00.000Z",
  "source": "APP",
  "content": "The webinar, moderated by Brig (Retd) Amir Yaqub, Director NIPS, was arranged as part of the NIPS Lecture Series that invites notable national and international experts to speak in detail on topics of high contemporary relevance.\nDiverse audience of statesmen, serving and former senior defence officials, business leaders, veteran diplomats, experts, scholars and students attended the webinar.\nDr Vladimir Kozin, Leading Expert, Center for Military-Political Studies, Moscow State Institute of International Relations (MGIMO) of the Ministry of Foreign Affairs of the Russian Federation speaking on the occasion highlighted that current Russia-Pakistan relations were largely positive, free of disputes, dynamic, multi-domain, and had a huge potentialfor future expansion in cooperation, especially in economic and security domains.\nKeeping in view the dynamic Eurasian geopolitical context, he remarked that there was a need for greater consultations between Russia and Pakistan on major regional developments.\nDr Kozin proposed that Pakistan could consider participating in the Zapad-2023 military exercises -a step that, he considered, would be welcomed by Russia.\nRenowned veteran diplomat and author, Ambassador (Retd) Shahid M Amin, considered that lack of sustained economic, technological and cultural linkages with Russia was a challenge that needed to be overcome, but the deepening of relations with Russia could not come at the expense of Pakistan’s relations with the West.\nHe said significant Russian defence sales to India could prove to be a point of concern in bilateral relations between Russia and Pakistan.\nMajor General (Retd) Inam ul Haque stated that Pakistani policymakers needed to develop a deep understanding of Russian foreign policy establishment, including different kinds of interests groups such as the so-called Atlantic, Imperial, and the Slavophile camps.\nHe opined that China and Afghanistan were two major points of convergence between Russia and Pakistan, and that Russia’s demographic challenge could, in future, lead to novel forms of cooperation between the two countries.\nDr Atiaa Ali Kazmi, Senior Policy Analyst, NIPS, pointed out that Pakistan-Russia relations were not transactional in nature and focused on geopolitics andgeoeconomics issues which were moving in the right direction at a sustainable pace.\nAli Shah, Head of Research, NIPS, argued for the urgent need for an early-harvest demonstration of Russian-Pakistan project, such as a joint Pak-Russian science and technology park located in Pakistan, bringing together bilateral strengths in science, technology and innovation.\nIn his closing remarks, Dr Ashfaque Hasan Khan, Principal NUST School of Social Sciences and Humanities and Director General NIPS, stated that overcoming the need for zero-sum pursuit of power in the emerging multipolar era would enable major powers like China, Russia, and the US to find greater avenues for issue-based cooperation.",
  "retrievedAt": "2025-08-11T21:21:00.656Z"
}
