{
  "title": "Fawad for daily hearing of Shehbaz Sharif’s corruption cases",
  "link": "https://www.app.com.pk/national/fawad-for-daily-hearing-of-shehbaz-sharifs-corruption-cases/",
  "date_published": "2021-09-29T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday made a call on behalf of his party and entire nation for daily hearing of the corruption and money laundering cases filed against Shehbaz Sharif by the National Accountability Bureau.\nShahbaz Sharif held a press conference for over an hour today (Wednesday) but he did not utter a single word on the two important cases being heard against him [in the court], he said while talking to media outside Parliament House soon after the Pakistan Muslim League-Nawaz (PML-N) President’s presser.\nFlanked by Minister of State for Information and Broadcasting Farrukh Habib, he said it was being expected that the PML-N leader would respond to the allegations leveled against him, but keeping the tradition of Sharif family alive, he resorted to lies for misleading the media and nation on his case in the United Kingdom.\nHe regretted the fake news run by a section of media claiming that Shahbaz Sharif had been cleared by UK agency, though the investigations were held against his son Suleman Shehbaz and there was no mention of the PML-N president in case.\nFawad clarified that the case was not filed by the government of Pakistan, rather it was the agency in London which held the probe against Suleman on its own.\nHe said Shahbaz Sharif was facing strong cases in Pakistan and he should defend himself in the court of law. He was facing a NAB reference worth Rs 7.32 billion for which no hearing was held for the past six months.\nThe minister said that the second case was regarding money laundering worth Rs 25 billion.\nHe said that during sugar shortage in 2020, the Federal Cabinet ordered for checking the bank accounts of all sugar mills in the country. During this investigation a money laundering network by Ramzam and Al-Arabia Sugar mills owned by Shahbaz Sharif family was unearthed.\nHe said that the Federal Investigation Agency (FIA) disclosed that from 2008 to 2018 over Rs 25 billion money laundering was done by these two mills through 57 fictitious bank accounts in the name of various ordinary people including the employees of the mills.\nThe minister said that Malik Maqsood who was a peon in Al-Arabia mills sent Rs 3.7 billion whereas Haji Naeem sent 2.8 billion. He said that other fictitious accounts sued for money laundering included Muhammad Waris Rs 2.5 billion, Muhammad Aslam Rs 1.75 billion, Azhar Abbas Rs 1. 67 billion, Ghulam Shabbir Rs 1.57 billion, Khizar Hayat Rs 1.42 billion, Qaiser Abbas Rs 1.37 billion, late Gulzar Rs 1.28 billion, Syed Muhammad Akbar Rs 1.28 billion and Iqrar Hussain Rs 1.18 billion.\nGiving details of NAB case, he said that besides Shahbaz, his wife Nusrat Shahbaz, his sons Hamza and Salman Shahbaz were among the accused in 7.32 billion fictitious TTs.\nHe said that 26 fictitious TTS were sent to Shahbaz Sharif worth 1.9 million US dollar, 23 to Hamza Shahbaz amounting to Rs 181 million, 127 TTS to Salman Shahbaz worth $18 million .\nHe said that that the senders of TTS included Manzoor Ahmed Paper seller in Pind Dadan Khan, Rameez Shahid, a salesman, Zeeshan from Pattoki, Azhar Mughal, a scrape dealer from Gujranwala, Adnan Anwar.\nHe said that Shahbaz claimed that NAB officer Saleem Shahzad had visited the UK in connection with the ongoing investigation which was incorrect. He said that Saleem Shahzad had gone to UK along with 7 other officers from the various departments as part of the training programme on the invitation of British government.\nFawad pointed out that Shahbaz in his press conference said that Salman’s acquittal should be considered his acquittal, but in cases, in Pakistan the Sharifs had the opposite stance. Here, he claimed, that he has nothing to do with his children’s money as they were independent.\nFawad said that PTI had the stance that the TTS of his sons were related to him as he was chief minister of Pakistan’s biggest province.\nFawad said that the amount looted and plundered by Sharif family did not belong to Imran Khan or PTI leaders, it belonged to the people of Pakistan and when the PTI raised the slogan of accountability, its aimed at to bring looted money back in national exchequer.\nHe said that day to day hearing of the cases against Shahbaz Sharif should be done so that justice should be done at the earliest. He said that the biggest hurdle in the provision of justice in these cases was not holding day-to-day hearings of the cases. He said by unnecessary delay in cases the people lose faith in the justice system and it was necessary to restore people’s trust in the national institutions.\nHe said that the return of Nawaz Sharif was vital as Shahbaz has given assurance in the court that he would return after medical treatment.\nSimilarly, he said that Salman Shahbaz should also return especially after his clearance from England and he should get his name cleared from here as well.\nFawad said that it was strange that Sharif family has no trust in Pakistani courts but they want to rule here. He said that whenever the PML-N faced a difficult situation Nawaz Sharif left the country and returned only to rule.\nHe said presently all major PML-N leaders including Shahbaz Sharif and Mariam Nawaz would book their seats for departure if the government removed their names from ECL even for a short span of time.\nHe said that if they are allowed to leave Pakistan, the country wealth worth billions of dollars could not be returned which the present government would not allow to happen.\nTo a question, he said that JUI-F, PPP and PML-N were regional parties and only PTI was a national party having strong support in all parts of the country.\nHe said that Pakistan was not a monarchy and all national institutions would have to perform their duties for its progress.\nHe said that talks were being held with opposition parties over the introduction of electronic voting machines in the next elections but the government did not these talks to be prolonged, that is why it has decided to summon a joint session of the Parliament. .\nAbout the PTI parliamentary party meeting decisions he said that Adviser on Parliamentary Affairs Dr Babar Awan would give a detailed briefing on elections reforms issue.\nHe said that consolations were being held with Opposition of electoral reforms but the government was going to summon joint session of the parliament to save times.\nHe said that the government has decided to get Minister for Finance Shaukat Tareen as required under the constitution and Law and Parliamentary Affairs Divisions were working on its modalities.\nMinister of State for Information and Broadcasting Faurrkh Habib said it would be injustice if Shehbaz Sharif was consulted on the appointment of the National Accountability Bureau (NAB) Chairman.\n“Can a thief be asked that whom he would like to choose as his investigation officer or in which court he would like to face his trial,” he questioned while responding a query about the government’s intent for consulting opposition on appointment of the NAB chairman.\nHe said Shehbaz Sharif had no right to remain opposition leader in the National Assembly as he was accused of committing massive corruption while being into the power in the past.\nFarrukh termed Shehbaz a stumbling block in the way of government and opposition which would have to consult on the appointment of NAB chairman in future.\nAbout the proposed use of EVMs in the polls, he said, the government was extending help to the Election Commission of Pakistan in fulfilling its constitutional duty.\nAccording to Article 218 of the Constitution, the ECP was bound to hold free, fair and transparent elections in the country, he said, adding the Supreme Court had already asked to the national election watchdog about use of technology in the polls.\n“We have to move forward as the whole world is doing,” he said while describing use of EVMS as key to end rigging in the elections.",
  "retrievedAt": "2025-08-11T21:20:53.326Z"
}
