{
  "title": "China Pakistan media pledge to counter false propaganda",
  "link": "https://www.app.com.pk/national/china-pakistan-media-pledge-to-counter-false-propaganda/",
  "date_published": "2021-09-29T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): The Chinese and Pakistani Media has pledged together to counter propaganda through enhanced communications and building stronger linkages by creating the “China-Pakistan Media Corridor”.\nThis was discussed during the First China-Pakistan Media Forum held with the thematic objective of “strengthening China Pakistan relations through informed dialogue”.\nThe forum was organized by the Institute of Peace and Diplomatic Studies here the other day.\nIt was urged that the China-Pakistan Media should work together for a lasting and unified response to false information.\nIt was decided that the Media Forum should be organized regularly to deal with the challenges and build opportunities for working together. Distinguished speakers from both countries aimed at strengthening the ties between China and Pakistan and to boost relations through enhanced channels of communications.\nFounder, China-Pakistan Media Forum and Institute of Peace and Development Studies Farhat Asif in her opening remarks, said that this platform has been established to build stronger ties amongst the media groups from both sides.\nShe further added the China Pakistan Media Forum strengthens the bond not only in the news but other important ways of communications, including films, drama, TV, travel guides, translations, and other services.\nSpeaking on the occasion Chairman, Senate Standing Committee on Information and Broadcasting Faisal Javed Khan said that there are continuous attempts to jeopardize the Pak-China relationship and damaging the CPEC through fake news and propaganda.\nBut media from both side will counter these negative narratives that are artificially generated to damage the Pak-China relationship and reframe them with more efficiency for better building of relations.\nHe was of the view that such a forum was necessary, timely, and should continue the process to build lasting partnerships with the media outlets of both sides.\nAmbassador of the People’s Republic of China, Nong Rong said that China and Pakistan are facing strong media propaganda and disinformation.\nSome external forces are hostile and are trying to undermine the development of China and Pakistan systematically.\nBoth sides of the media should work to promote truth, justice, and fairness and become a positive force for regional peace and stability.\nIn order to promote the understanding of Chinese and Urdu languages, China has launched an Urdu media service to counter the negative public opinions and strengthen mutual collaboration. Ambassador Nong also proposed ways to further strengthen collaboration in the media.\nAmbassador of Pakistan to the People’s Republic of China Moin-ul-Haque said that in this digital age, media is not just the source of information but it influences public opinions and inter-state relations.\nChina Pakistan Media collaboration can deepen the relations and help understand each other’s points of view. As well as the technological evolution and developments in the geopolitical arena have rendered the role of media very important in shaping narratives.\nSultana Siddiqui, President of Hum Network Limited said that collaboration between media helps to promote cultural ties and build people-to-people ties to the next level. She has also urged the need to work on the challenges that may hamper the collaboration from both sides.\nWang Qianting, Senior journalist, Urdu Service of China Media Group, gave a speech in Urdu and said that friendship between China and Pakistan has a special place that will remain evergreen.\nProf. Zhou Rong, Senior Fellow of Chongyang Institute for Financial Study of Renmin University said that Chinese media needs to showcase what Pakistan has been doing against terrorism and for peace and stability in Afghanistan and also China Pakistan Economic Corridor (CPEC) project should be advertised by media groups of both countries.\nMakhdom Babar, Editor in Chief The Daily Mail and Chairman, Pakistan-China Media Friendship Association said that the QUAD alliance will remain a failed attempt against China. The naysayers of Pakistan and China will not remain successful and will always fail.\nThe media linkages are important to promote togetherness on a global scale. Pakistan and China media are collaborating for peace and prosperity in the world. Scarlet Xiang, Chairperson, St.Fulin Group, presented a road map for building media cooperation between Pakistan and China.\nShe said that both sides collectively need to build, know and believe more through exclusive exposure. Ke Ye – Editor-in-Chief of In Zhejiang Media Group said that bilateral ties between China-Pakistan can be built through information sharing and extensive communications.\nA large number of Chinese and Pakistan media representatives, Journalists, students, faculty members, and civil society leaders have joined this hybrid event.",
  "retrievedAt": "2025-08-11T21:21:02.209Z"
}
