{
  "title": "Capital to get 23 Miyawaki urban forests: Zartaj",
  "link": "https://www.app.com.pk/national/capital-to-get-23-miyawaki-urban-forests-zartaj/",
  "date_published": "2021-03-03T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP): Minister of State for Climate Change Zartaj Gul on Wednesday said the Ministry of Climate Change would establish 23 Miyawaki urban forests across the federal capital which would help enhance the green cover of the metropolis.\nMinister of State extended her gratitude to the Australian High Commissioner Dr. Geoffrey Shaw for donating a Miyawaki forest of 1,200 trees being established at the F-9 Park here while jointly inaugurating the plantation with the Ambassador.\nSpeaking on the occasion, Zartaj said Australian government had helped Pakistan in formulating its first Water Policy and was also helping in mitigating adverse drought impacts in Balochistan.\nShe said Miyawaki Forest in F-9 Park was a gift from the Australian High Commission that grew in 10 years with a faster pace as compared to conventional forest growing in 30 years.\n“Breathing in a good and clean ambience is our basic need and high green cover in urban areas ensures this fundamental requirement,” the Minister of State remarked.\nZartaj said over 750 million trees were being planted in the 10 Billion Tree Tsunami Plantation programme whereas by the end of the season, we would be able to achieve first billion trees’ target.\nHighlighting the recent enforcement drive of Plastic Bags Ban in the Capital, she said citizens would be fined Rs 5,000 on violating the Ban as the government had restricted the use of single-use plastic or polythene bags to end plastic pollution.\nCommenting on the ongoing Senate Polls, she said, “Now I will go to the parliament to cast my vote and victory will be the destiny of Hafeez Sheikh.”\nAddressing the inauguration ceremony Australian High Commissioner Dr. Geoffrey Shaw said, “The Miyawaki Forest is a gift from the Australian Government to Pakistan. Planting trees and plants will make the environment of Islamabad more clean and pleasant.”\nHe added that the government of Australia was helping Pakistan to tackle climate change whereas apart from this region, the entire world was facing environmental degradation.\n“We welcome Prime Minister Imran Khan’s campaign to plant 10 billion trees to combat climate change whereas Australian government is working on clean drinking water and flood protection projects in Pakistan,” the Ambassador said.\nTalking to APP, the Ambassador expressed that Australia and Pakistan were facing equal challenges of water management and therefore, had a memorandum of understanding between the two governments for collaboration in this regard.\nAustralian government was also assisting Pakistan in climate resilient agriculture initiatives and water resource management to overcome water crisis in the country.",
  "retrievedAt": "2025-08-11T20:26:26.017Z"
}
