{
  "title": "PM to take vote of confidence from National Assembly: FM Qureshi",
  "link": "https://www.app.com.pk/national/pm-decides-to-seek-vote-of-confidence-from-national-assembly-fm-qureshi/",
  "date_published": "2021-03-03T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP): Prime Minister Imran Khan will take a vote of confidence from the National Assembly, said Foreign Minister and Vice Chairman Pakistan Tehrik-e-Insaf (PTI) Makhdoom Shah Mahmood Qureshi on Wednesday.\nThe decision came in the backdrop of an upset in Senate elections in which Syed Yusuf Raza Gilani of Pakistan Peoples’ Party Parliamentarians (PPPP) won the general seat from Federal Capital by securing 169 votes against 164 secured by Dr. Abdul Hafeez Sheikh of Pakistan Tehrik Insaf (PTI).\n“PTI has unanimously decided that Prime Minister Imran Khan will take a vote of confidence from the National Assembly,” Qureshi said while addressing a press conference here along with Federal Ministers Shafqat Mehmood, Asad Umar, Shireen Mazari, Fawad Chaudhry, Syed Ali Haider Zaidi, Hammad Azhar and others.\nHe described the victory of Syed Yusuf Raza Gilani as “negation of democracy” as well as the endorsement of Prime Minister Imran Khan’s apprehensions of corrupt practices in the Senate elections.\nThe foreign minister said the way voting was done on the Capital’s general seat , strengthened the PTI’s narrative about use of money in the Senate elections.\n“We were apprehensive that the elections will be bought and the buyers of conscience will buy the votes using the name of democracy.”\nQureshi said the PTI’s female candidate elected on the seat of Islamabad taking 174 votes. “However, on the general seat in Islamabad, we were getting signals that Gilani was asked to stand in the election with the assurance that the election will be won for him.”\nHe said every tactic was used to win the election of Gilani, which put a stamp on the narrative of Imran Khan about votes buying.\nHe said in the last Senate election, when votes were bought in the Khyber Pakhtunkhwa Assembly, the Pakistan Tehreek I Insaf (PTI) stripped its 20 members of their assembly membership.\nThe PTI government invited the opposition to sit together and undertake a constitutional amendment to stop the buying of votes, he recalled.\nQureshi said the opposition did not let the debate happen on the floor of the National Assembly and then voting on the amendment for open voting in the Senate election.\n“We filed a reference in the Supreme Court to seek interpretation of law. The apex court in its decision asked the Election Commission to act according to the Constitution and hold free, fair and transparent elections of Senate.”\nThe Election Commission, however, failed to ensure transparency in the elections and their apprehensions were proved right as the video showing the son of Gilani indulging in buying of votes had surfaced, he continued.\nThe minister said the activities of Ali Haider Gilani, the son of Yousaf Raza Gilani, were before the nation and the Election Commission should have fulfilled its responsibility.\nThe Election Commission could have provided the ballot papers for transparent election, he noted.\nThe FM said Imran Khan started a fight to change the political culture and in every field he initiated the process of accountability and took the high moral ground.\n“I want to say to the voter of PTI that the fight for right will continue and finally the right will win.”\nHe said today was an unfortunate day for democracy as the flag-bearers of democracy negated its values.\nTo a question, he said when Imran Khan would take a vote of confidence from the National Assembly, it would become clear who stood with him and who with the opposition.\nHe said the PTI workers should be confident that the fight against immorality of the opposition would continue.\nTo another question, Qureshi said Imran Khan gave space to the legislators to express their views, and the legislators, who had voted for Gilani, should have stood up and clearly stated that they were voting for him.\nIf MNAs were not happy then they should not have voted to the PTI on the women seat for Islamabad, he added. “The reason for voting was not their unhappiness but the money.”\nHe stated the Election Commission had failed to fulfill its constitutional obligation to hold free, fair and transparent elections of the Senate.\nThe minister said in the Punjab Assembly, the Senators were elected with an understanding among the parties but that principle was not adopted in the National Assembly.\nThose parties, which bought votes, and those members, who sold their votes, should be held accountable, he stressed.\nMinister for Planning and Development Asad Umar said Imran Khan wanted to make Pakistan a great nation according to the vision of Quaid-e-Azam.\nThe nation was divided as on one side were those, who were standing against corruption, and on the other side were those, who were using money in politics, he remarked.\nMinister for Science and Technology Chaudhry Fawad Hussain said the PTI was struggling against the system which was bringing those in power who made money in politics and then used it to gain more power.",
  "retrievedAt": "2025-08-11T20:26:16.369Z"
}
