{
  "title": "AJK president seeks ulema’s help in strengthening Pakistan",
  "link": "https://www.app.com.pk/national/ajk-president-seeks-ulemas-help-in-strengthening-pakistan/",
  "date_published": "2021-03-03T15:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Mar 03 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Wednesday sought ulema, mushaikh and religious parties assistance for strengthening Pakistan as they did during the independence movement.\nHe expressed these views during separate meetings with the chief of Jamiat Ahl-e-Hadith Azad Kashmir Danial Shahab Madni and Chairman of Azad Jammu and Kashmir Ulema-e-Mushaikh Council Maulana Obaidullah Farooqui in the State metropolis, said a AJK President Office statement.\nThe state president said we should seek guidance from the teachings and life of the last Prophet Mohammad Peace Be Upon Him in every sphere of life including politics, economy and sociology.\n“The Great Prophet Mohammad Peace Be Upon Him through His unprecedented wisdom and unchallenged farsightedness had turned the worst society of his age into the most civilized society in the world and his era is still quoted as a precedence in the world even today,” he added.\nHe regretted that our reluctance to seek guidance from the teachings of Prophet Mohammad Peace Be Upon Him and deviation from the divine principles had left us nowhere and our politics, economy and social values had polluted and decayed.\nEven today, if we wanted to rise in the world and achieve success in the hereafter, we had to turn to the teachings of the Qur’an and Sunnah.\nThe AJK president paid tributes to Jamiat Ahl-e-Hadith Pakistan Chief Prof Sajid Mir for his services for the country and nation.\nDuring meeting with Maulana Obaidullah Farooqui, Sardar Masood Khan stressed the need for interfaith harmony in the liberated territory, and asked Ulema-o-Mushaikh Council to continue its efforts to maintain unity, harmony and mutual respect among the different schools of thought.\nOn this occasion, Maulana Obaidullah Farooqui assured the fullest cooperation from ulema and apprised the state president of the public problems of different areas of Mang and Poonch district.",
  "retrievedAt": "2025-08-11T20:26:17.528Z"
}
