{
  "title": "Govt. notifies grant of 25% Disparity Reduction Allowance",
  "link": "https://www.app.com.pk/national/govt-notifies-grant-of-25-disparity-reduction-allowance/",
  "date_published": "2021-03-03T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):The federal government on Wednesday notified the grant of Disparity Reduction Allowance (DRA) at the rate of 25 percent of the basic pay scales 2017, which would be effective from March 1, 2021.\n“This allowance shall be admissible to civil employees in BPS 1-19 of the Federal Government, (including employees of the Federal Secretariat and attached departments), who have never been allowed additional allowance/allowances equal to or more than 100% of the basic pay (whether frozen or not) or performance allowance,” a Finance Division notification said.\nHowever, it clarified that the allowance would not be admissible to the employees of 58 organizations, who are drawing additional allowance(s) equal to or more than 100% of the basic pay.\nThese organizations include President/PM Secretariat, Federal Board of Revenue, Health personnel/ Health establishments, National Accountability Bureau (NAB), all Superior Courts, Law & Justice Commission of Pakistan, Islamabad Capital Territory Police, National Highways & Motorways Police, Islamabad Model Traffic Police, Airport Security Force, Civil Armed Forces, Intelligence Bureau, Inter Services Intelligence, Federal Investigation Agency, National Highways & Motorways Police, National Assembly, Senate Secretariat, Parliamentary Affairs Division, District Population Welfare Office, Clinical Regional Training Institute, Directorate General of Special Education, National Institute of Rehabilitative Medicines, National Institute of Special Education, Rehabilitation Centre for Children with Development Disorders Islamabad, National Council for Rehabilitation, National Braille Press Islamabad, Rehabilitation Unit Vocational Rehabilitation & Employment of Disabled persons lbd, National Mobility & Independence Training Centre, National Training Centre for Special Persons G-9/2 Islamabad, Vocational Rehabilitation & Employment of Disabled persons SC-1 Ibd, Provision of Hostel facilities at NSEC VHC Islamabad, National Special Education Centre for PHC Islamabad, National Special Education Centre, National Library & Resource Centre Islamabad, National Trust for the Disabled, Central Health Establishment and its Field Offices, Appellate Tribunal Inland Revenue, Environmental Protection Tribunal, Special Judge (Customs Taxation & Anti Smuggling), Special Judge (Central), Banking Courts, Special Courts (Control Of Narcotics Substance), Special Court (Anti Terrorism), Competition Appellate Tribunal, Intellectual Property Tribunal, Drug Courts, Anti Dumping Appellate Tribunal, Senior Civil Judge West Islamabad, Senior Civil Judge East Islamabad, District & Session Judge West Islamabad, District & Session Judge East Islamabad and the civilian employees of PAF who are drawing additional allowance as allowed vide Finance Division’s U.O. note bearing No.F.1(7)lmpl2009-705.\nBesides, the Disparity Reduction Allowance would be frozen at the level drawn on March 1, 2021; subject to Income Tax, and admissible during leave and entire period of L.P.R. except during extra ordinary leave.\nThe DRA would not be treated as part of emoluments for the purpose of calculation of Pension/Gratuity and recovery of House Rent and would not be admissible to the employees during the tenure of their posting/deputation abroad;\nIt would be admissible to the employees on their repatriation from posting/deputation abroad at the rate and amount which would have been admissible to them, had they not been posted abroad and would be admissible during the period of suspension.\nThe term “Basic Pay” will also include the amount of Personal Pay granted on account of annual increment (s) beyond the maximum of the existing pay scales, the notification added.",
  "retrievedAt": "2025-08-11T20:26:19.722Z"
}
