{
  "title": "Amin Aslam inaugurates Trail-2 celebrating World Wildlife Day",
  "link": "https://www.app.com.pk/national/amin-aslam-inaugurates-trail-2-celebrating-world-wildlife-day/",
  "date_published": "2021-03-03T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 03 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam on Wednesday inaugurated Trail-2 of the Margalla Hills National Park celebrating the World Wildlife Day highlighting this years theme of the day ‘forests and livelihood’.\nThe Margalla Hills National Park was a living habitat of common leopards lying close to a federal capital which was very rare in the world, the SAPM said addressing the World Wildlife Day celebration organized by Islamabad Wildlife Management Board (IWMB) here along with the inauguration of a new hiking trail.\nAmin said it was very clear from this year’s theme that the livelihood opportunities were closely linked to forest conservation and protected areas initiatives whereas if local community was provided with livelihood from forest conservation then it could lead to the ownership of the forests with inclusive conservation.\nThe SAPM said, “Shezadi, the female leopard has been identified in the National Park which is a great achievement and the IWMB staff has identified a total five of them and their number is rising.”\nHe added that the Prime Minister announced two major national park of Himalaya and Nanga Parbat in Gilgit Baltistan whereas seven national parks in a row were inaugurated in the Salt Range of Punjab province.\nThe SAPM announced that Pakistan was looking to launch its first nature bond linked to sovereign debt retirement whereas the country was selected as a pilot state to implement it.\n“The debt relaxation will be linked to its efforts in nature conservation. We have presented our quantifiable estimates for the bond,” he added.\nThe SAPM added that the economic framework prevailing earlier was badly damaging ecology and biodiversity which should be associated with nature restoration.\nThe Ministry of Climate Change had also engaged with the UK government on its recent Urban evaluation report to replicate it in Pakistan, he added.\nThe SAPM in connection to the Wildlife Day gave his message that nature imbalance created due to violation of nature and biodiversity thresholds had resulted in Covid-19 pandemic outbreak which should be mitigated through biodiversity and wildlife conservation.\nChairperson IWMB Rina Saeed Khan said the Wildlife Conservation Sanctuary to be set up at the place of Islamabad Zoo would also have an information center with trained staff and veterinary services.\nThe total area was now scaled up to 82 acres land which was earlier 25 acres and the facility would be a properly managed with indigenous wildlife species to be handled in an amicable manner, she added.\nShe mentioned that local community people were given employment in the IWMB which was providing livelihood to them whereas licenses were issued to local people for collecting Kachnar plant or Bauhinia Variegata also known as Orchard tree to sale it in the market as a source of income.\nSenator Mushahid Hussain Sayed, environmentalists, diplomats of various countries and general public participated the ceremony.\nDocumentaries on female leopard Shezadi (Princess) and her male companion Shezada (Prince), biodiversity of Margalla Hills National Park were also presented on the occasion. Manager Operations IWMB Sakhawat Ali also briefed the participants on discovering the leopard presence at Trail 4&6.",
  "retrievedAt": "2025-08-11T20:26:16.317Z"
}
