{
  "title": "Pakistan consistent with ‘Vision East Asia’ policy for strong ties with ASEAN",
  "link": "https://www.app.com.pk/national/pakistan-consistent-with-vision-east-asia-policy-for-strong-ties-with-asean/",
  "date_published": "2021-07-02T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 2 (APP): Foreign Secretary Sohail Mahmood on Friday said Pakistan was pursuing a consistent ‘Vision East Asia’ policy to strengthen its partnership with Association of Southeast Asian Nations (ASEAN) in all spheres.\nThe Foreign Secretary expressed these views in a keynote address at the Experts Dialogue on ‘Pakistan-ASEAN: Shared Future and the Way Forward, co-organized by the Embassy of Indonesia and the Institute of Strategic Studies, Islamabad (ISSI).\nNoting the steady trajectory of Pakistan-ASEAN relations, the Foreign Secretary underlined the high priority accorded by Pakistan to its relations with South East Asian nations and its recognition of ASEAN’s vast economic potential and its centrality in the regional architecture.\nHe specifically stressed the importance of forging closer cooperation in political, economic, security, tourism, education and socio-cultural domains.\nThe Foreign Secretary highlighted the range of steps taken by Pakistan to foster multifaceted engagement with ASEAN and the commitment to deepen trade and economic linkages with ASEAN member states.\nReport on Pakistan-@ASEAN Experts Dialogue on \"Pakistan-ASEAN: Shared Future & the Way Forward\" organised by CSP at @ISSIslamabad @aizaz1101  @for_issi @ForeignOfficePk pic.twitter.com/U8ieYB3yAH\n— Institute of Strategic Studies Islamabad (@ISSIslamabad) July 2, 2021\nHe added that this was in line with Pakistan’s economic diplomacy outreach and consistent with the leadership’s emphasis on geo-economics.\nHe encouraged ASEAN member countries to consider investment in Special Economic Zones of CPEC. He also underlined the importance for Pakistani business community to see how mutually-beneficial collaboration could be achieved by engaging with the Regional Comprehensive Economic Partnership (RCEP), recently concluded by ASEAN and its key trading partners.\nThe Foreign Secretary reiterated Pakistan’s commitment to continue working towards up-gradation of its relationship with ASEAN to the level of Full Dialogue Partner (FDP). The Foreign Secretary further emphasized the importance of hard and soft connectivity between Pakistan and ASEAN — including in transportation, communication and cyber domains, between the ports, and among the peoples.\nPakistan is a Sectoral Dialogue Partner of ASEAN since 1993 and is also a member of ASEAN Regional Forum (ARF) since 2004.",
  "retrievedAt": "2025-08-11T20:55:28.269Z"
}
