{
  "title": "President for further strengthening Pak-Saudi cooperation in diverse areas",
  "link": "https://www.app.com.pk/global/president-for-further-strengthening-pak-saudi-cooperation-in-diverse-areas/",
  "date_published": "2021-07-02T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 1 (APP)P: President Dr Arif Alvi on Friday underscored the need to further strengthen bilateral economic and investment cooperation between Pakistan and the Kingdom of Saudi Arabia (KSA).\nHe said that Pakistan and Saudi Arabia enjoyed strong fraternal ties, based on shared faith, culture, tradition and mutual good-will that needed to be further expanded for the mutual benefit of the two countries.\nThe President expressed these views while talking to Ambassador of Saudi Arabia to Pakistan, Nawaf bin Saeed Ahmad Al-Maliky, who called on him here at the Aiwan-e-Sadr.\nHe reiterated Pakistan’s desire to further intensify cooperation in all areas of mutual interest including energy, science, technology, agriculture and culture.\nThe President highlighted that the people and government of Pakistan had deep respect for the Custodian of the Two Holy Mosques and the leadership of Saudi Arabia.\nHe remarked that Pakistan wanted to broaden bilateral relationship in the field of media and culture by building institutional linkages.\nThe President said that Pakistani Diaspora was contributing to KSA’s socio-economic development and expressed the hope that the Saudi government would ease travel restrictions on Pakistani nationals as the situation of COVID-19 had improved considerably in the Kingdom.\nHe deeply appreciated KSA for supporting Pakistan at difficult times and also lauded its role in promoting unity in the Islamic world as well as its efforts for regional and international peace and security.\nAmbassador Nawaf bin Saeed Al-Maliky underlined the need to further broaden bilateral cooperation in the fields of economy, trade and culture for the mutual advantages of the two brotherly countries.",
  "retrievedAt": "2025-08-11T20:55:23.845Z"
}
