{
  "title": "Pakistan, Uzbekistan agree to keep up high-level exchanges, expand ties",
  "link": "https://www.app.com.pk/national/pakistan-uzbekistan-agree-to-keep-up-high-level-exchanges-expand-ties/",
  "date_published": "2021-07-02T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 2 (APP): The inaugural round of Pakistan-Uzbekistan Bilateral Political Consultations was virtually held Friday wherein two sides agreed to keep up momentum of high-level exchanges and further expand bilateral cooperation and understanding in myriad fields.\nThe Pakistan side was led by Additional Secretary (Afghanistan and West Asia) Aamar Aftab Qureshi while Ambassador Furkat Sidikov, Deputy Foreign Minister led the Uzbek side.\nThe two sides exchanged views on whole gamut of bilateral relations including political, economic and trade, culture, people-to-people exchanges, regional connectivity, defence and security and regional as well as global issues.\nThey expressed satisfaction on the positive momentum in high-level visits and interactions including the visit of the Uzbek foreign minister to Pakistan and virtual summit between Prime Minister Imran Khan and President Shavkat Mirziyoyev.\nThe two sides discussed progress on Trans-Afghan railway project between Pakistan, Uzbekistan and Afghanistan.\nAdditional Secretary Qureshi emphasized the importance of direct air connectivity for promoting trade, tourism and people-to-people contacts. He welcomed the resumption of Uzbek Air flights from Lahore to Tashkent.\nAdditional Secretary Qureshi highlighted Pakistan’s positive efforts in facilitating Afghan peace process with the aim of promoting inclusive and broad-based political settlement.\nThe two sides underlined the convergence of views in ensuring security, stability and lasting peace in Afghanistan through an Afghan-led and Afghan-owned peace process.\nAdditional Secretary Qureshi highlighted the dire human rights and humanitarian situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK) since 5 August 2019, as well as the ongoing human rights violations of the Kashmiri people and attempts to change the demographic structure of the occupied territory.\nAamar Aftab Qureshi underscored the importance of resolution of Jammu and Kashmir dispute, in accordance with the relevant UNSC resolutions and the wishes of the Kashmiri people.\nPakistan and Uzbekistan enjoy cordial and brotherly relations based on common faith, shared history and cultural affinities. The two countries have been closely collaborating at regional and international fora, especially the UN, OIC, ECO and SCO.",
  "retrievedAt": "2025-08-11T20:55:20.798Z"
}
