{
  "title": "Koh-e-Sulaiman to emerge as country’s first Trans-Boundary National Park",
  "link": "https://www.app.com.pk/national/koh-e-sulaiman-to-emerge-as-countrys-first-trans-boundary-national-park/",
  "date_published": "2021-07-02T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 2 (APP): Koh-e-Sulaiman, (Takht-e-Sulaiman) mountain range is one of the highest national parks lying at an altitude of 3,487 meters (11,440 feet) with a unique ecosystem that would be preserved and developed as country’s first Trans-Boundary National Park.\nProvincial Minister Khyber Pakhtunkhwa Faisal Amin Khan Gandapur told APP in an exclusive interview that Koh-e-Sulaiman range was located between Khyber Pakhtunkhwa (KP) and Balochistan and was home to the endangered species of Sulaiman Markhor, Urial, Striped Hyena and the world’s largest pure stand forest of Chilghoza (pine nut).\nThe minister said, “This unique ecosystem should be protected and will be an excellent National Park lying at the juncture of two provinces as per the vision of Prime Minister Imran Khan.”\nPakistan, he said was home to 12 ecological zones with one of the exotic and rarest species of mammals, reptiles, flora and birds species.\nIn order to benefit the widespread forest cover, a large-scale olive trees cultivation would be initiated in the mountain range as it had a suitable environment for the less water intensive and lucrative fruit specie, he added.\nGandapur informed that the initiative was carried out under the protected areas initiative (PAI) in collaboration with the Ministry of Climate Change, Forest Department Khyber Pakhtunkhwa and Forest Department Balochistan province.\nHe said its development would be a great boost for this zone spread over KP and Balochistan’s Zhob district.\nHe pointed out that this mountain range had huge potential of wild olive grafting.\nThe minister also quoted the World Wildlife Fund for Nature (WWF-Pakistan) that the world’s one of the best Pure Stand Forest of Chilghoza was also in this range and had potential for increasing the Chilghoza trees in this forest through massive plantation.\nGandapur while highlighting the historical and cultural significance of the Mountain Range told that as per the local legend the grave of ancestral father of all Pashtun tribes “Abdur Rashid” also called “Qais Baba” was on the top of Takht-e-Sulaiman (Throne of Solomon) altitude 3,487m, the highest point of Sulaiman Range (erstwhile Frontier Region Dera Ismail Khan) locally known as Qissay Ghar or “Qais’s Mountain”.\nThe minister said that Fabled Throne and Qais’s grave were still a highly visited place, also mentioned in Travels of Ibn e Batuta book pages 98 and 99.\nElaborating the development and conservation measures being implemented with the consideration of local communities, he said walking tracks would be developed in the mountain range to make easy access to this beautiful destination.\nThe Mountain Range had huge presence of medicinal herbs among other biodiversity species that would be a great asset to create green jobs for local communities.\nHe said KP government would start a community based conservation project, to create green jobs for the locals in both the provinces.\nIn an interesting move, Gandapur told that the local people were very happy with this project, adding that negotiations were also conducted with local elders in this regard.\nHe concluded that the KP government was also negotiating with Punjab government to develop this beautiful destination as a Tri-Boundary National Park.",
  "retrievedAt": "2025-08-11T20:55:25.894Z"
}
