{
  "title": "100 % RLNG supply to be restored by Monday: Hammad",
  "link": "https://www.app.com.pk/national/100-rlng-supply-to-be-restored-by-monday-hammad/",
  "date_published": "2021-07-02T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 02 (APP): Minister for Energy Hammad Azhar on Friday said that 100 per cent supply of RLNG would be restored to power and gas sectors by Monday.\nAddressing a press conference here, the minister said gas and electricity supply situation would become normal across the country by Monday.\nHe said 40 per cent RLNG has already been restored to the system while its share would reach 70 per cent on Saturday.\nHe said that process of Dry Docking of RLNG terminal was started on Wednesday resulting suspension of gas supply to power sector for two days. However, 40 per cent regasification of RLNG from the replacement ship has been achieved 2 days ahead of schedule.\nThe gas plant of SSGC was on routine maintenance while Tarbela was also on 20-25 per cent capacity due to decrease water inflow in the dams.\nHe expressed the hope that the inflow would also improve in few days resulting further improvement in the power generation system.\nThe minister said that some elements were politicizing the temporary power disturbance. He regretted the claim of a former prime minister that the government wanted to clear a way for running furnace oil based plants.\nHe said furnace based power plants were used to operate during summer every year. More furnace power plants were operated during PML-N tenure, he said. The share of electricity generated through furnace oil during PML-N regime was 14 per cent, he added.\nThe minister said shortage of RLNG was overcome by diverting local gas to the power plants. Domestic and commercial consumption of electricity witnessed 6.7 per cent and 15 per cent increase respectively, he added.\nHammad said that in past the distribution system could only transmit 16000 MW. Now distribution and transmission system has been upgraded during last 2 years and successfully transmitted around 25000 MW, he said.\nThe minister said its capacity would further be enhanced to 10,000 MW in next few years.\nHe said in next eight years, more 26,000 MW generation would add to the system resulting payment of Rs 400 billion under head of capacity payment.\nHe said priority was only given to power generation and no investment was made in power transmission system in the past.\nThe minister said that the government has successfully overcome circular debt crisis as only Rs 177 billion increase in circular debt was expected this year owing to the effective steps taken by the government. Rs 360 billion decrease was expected in the circular debt this fiscal year 2020-21 as compared to previous financial year, he said.",
  "retrievedAt": "2025-08-11T20:55:21.951Z"
}
