{
  "title": "Pakistan, UAE set to explore diverse avenues of trade cooperation",
  "link": "https://www.app.com.pk/national/pakistan-uae-set-to-explore-diverse-avenues-of-cooperation/",
  "date_published": "2021-07-02T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 2 (APP): On shifting its focus from geo-politics to geo-economics, Pakistan is on way to become an economic hub through development partnerships and connectivity with countries in the region, including the United Arab Emirates (UAE).\nWith their bilateral trade volume amounting to around $8.19 billion, Pakistan and the UAE are set to explore new avenues in agriculture, healthcare, manufacturing, logistics, information technology and tourism.\nRecently, the two countries have agreed to further promote cooperation in the fields of customs and other inland taxes, besides learning from each other’s best practices to increase trade volume between the two countries.\nThe UAE, which is a major source of investment and remittances for Pakistan, has expressed its readiness to extend full assistance to Pakistani business to help them explore the opportunities offered by its markets.\n“For us, Pakistan is among the top 25 important strategic global trade partners,” UAE’s Minister of State for Foreign Trade Dr Thani bin Ahmed Al Zeyoudi said at the second trade session organized by Pakistan Business Council in Dubai.\nThe trade session was held to discuss new business opportunities, boost trade volume between the UAE and Pakistan and capitalize the opportunities relating to Dubai Expo 2020, being held in October 2021 after delayed due to pandemic.\nThe emirati minister mentioned that in terms of imports, the UAE was Pakistan’s second-biggest partner, besides the two countries also having significant investments in various sectors including real estate.\nThe UAE recently announced the 100 percent foreign ownership law, which has spurred economic activity and been hailed by the business community around the world, including Pakistan.\nAt present, Pakistan is improving its legal framework for more business-friendly policies to attract Foreign Direct Investment from the UAE.\nThe experts of economy believe that visits of businessmen from UAE to Pakistan and vice versa can prove helpful in increasing bilateral trade between the two countries.\nThe ongoing ban from the government of UAE on flights and visitors from Pakistan due to coronavirus situation poses a potential negative impact on the business activity as the two countries aspire to double the quantum of bilateral trade during the next five years.\nThe Foreign Office said it was in touch with the UAE officials to remove the ban as Pakistan witnessed sharp decline in COVID-19 cases.\nThe resumption of flights between Pakistan and the UAE will not only boost economic activity for the mutual benefit of two countries, but also strengthen the people-to-people ties.",
  "retrievedAt": "2025-08-11T20:55:25.827Z"
}
