{
  "title": "PM launches first-ever National Security Policy; says security linked with inclusive development",
  "link": "https://www.app.com.pk/national/pm-launches-first-ever-national-security-policy-says-security-linked-with-inclusive-development/",
  "date_published": "2022-01-14T07:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): Prime Minister Imran Khan Friday launched the country’s first-ever citizen-centric National Security Policy 2022-2026, saying that an inclusive development was inevitable for national security.\n“Inclusive growth means not only to uplift the poor people but also the neglected areas… (In such case) every common man becomes a stakeholder to protect the state… The biggest security is when people stand behind state for its protection,” the prime minister said addressing the launching ceremony of the public version of the otherwise secret document.\nThe prime minister, who earlier signed the historic document, appreciated the National Security Division for formulating a policy based on the consensus of the whole state and defining the national security in a “right manner”.\nFirst of its kind in Pakistan’s history, the National Security policy articulates a citizen-centric framework, placing economic security at its core and seeking a secure and economically resilient Pakistan. The formulation process of the policy includes multiple consultations with official stakeholders including federal ministers, 120 experts, 300 students, and 600 people from all walks of life.\nThe prime minister said the NSP would also help correct the dimension and help the whole government machinery to move in one direction for achieving national security and stability.\nSpeaker National Assembly, federal ministers, Chairman Joint Chiefs of Staff Committee, all services chiefs, diplomats, senior civil and military officers attended the launching ceremony.\nThe prime minister emphasized that our armed forces were our pride and glued the nation together. Given the threats we face in the region, and the growing threat of hybrid warfare, they would continue to receive even greater support and importance.\nThe prime minister explained the significance of his government’s successful initiative of producing the National Security Policy calling it a major priority of his government.\nHe also highlighted the importance of the policy’s successful implementation and announced that the National Security Committee (NSC) will regularly review progress.\nHe said the NSP centered on the government’s vision, which believes that the security of Pakistan rested in the security of its citizens.\nAny national security approach must prioritize national cohesion and the prosperity of people, while guaranteeing fundamental rights and social justice without discrimination, he added.\nThe prime minister said in order to achieve the vast potential of the citizens, it was necessary to promote delivery-based good governance.\nPrime Minister explained that the foremost aim of the foreign policy and military capability would remain peace and stability in the region and beyond.\nOur foreign policy will also focus much more on economic diplomacy going forward, he remarked.\nThe prime minister said the national security is also compromised when the country had to approach IMF to support its economy by accepting their conditions. In such a case, the common man has to face the burden, he added.\nReiterating his vision of replicating Madina State, the prime minister said by March every family in the PTI-led provinces would have health insurance of Rs 1 million a year which was even not available in developed countries.\nHe also highlighted the government’s initiatives like interest-free loans for business, ration subsidy scheme, and housing construction loans to the low-income group.\nHe said for the first time, the government introduced a core national curriculum as in the past, the country had three parallel education systems of seminaries, English and Urdu medium schools.\nCalling rule of law a big challenge for the country, he said Madina State was the first to end discriminatory laws for the rich and poor. He said due to lack of rule of law, the country could not tap its immense tourism potential in Northern Areas which were far bigger and more beautiful than Switzerland.\nNational Security Adviser Dr Moeed Yusuf, in his remarks, briefly explained the National Security Policy vision and thanked the Prime Minister and all officials for their constant support.\nCalling it an umbrella document linking all issues of national security, Moeed Yusuf said Pakistan was among a few countries that codified and publicized its security policy.\nHe said that the National Security Policy has taken a broad view of national security as both traditional and non-traditional issues impacted the country’s security.\nWhile the National Security Policy is centered around economic security, the geo-strategic and geo-political imperatives also feature prominently to strengthen Pakistan security and standing in the world, he remarked.\nHe highlighted that this was a document finalized after full civil-military consensus.\nHe said the policy also seeks to bring about good governance which was vital to protect the common man.\nMoreover, through quality education, it will also bring cohesion in society. He said geoeconomics was not different from geostrategic as Pakistan’s location could be used a corridor making other countries benefit from Pakistan’s economy.\nHe said the NSD would provide monthly report to National Security Committee on the implementation of the policy.",
  "retrievedAt": "2025-08-11T14:06:50.158Z"
}
