{
  "title": "PAEC’s 19th Cancer Hospital inaugurated in GB",
  "link": "https://www.app.com.pk/national/paecs-19th-cancer-hospital-inaugurated-in-gb/",
  "date_published": "2022-01-14T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): Pakistan Atomic Energy Commission (PAEC) formally inaugurated its 19th Atomic Energy Cancer Hospital (AECH) named Gilgit Institute of Nuclear Medicine, Oncology and Radiotherapy (GINOR) here on Friday.\nAddressing the inaugural ceremony as chief guest via video link, Federal Minister for Planning, Development and Special Initiatives, Asad Umar said, “Pakistan Atomic Energy Commission has been assigned the vital role of flag-bearer in Atoms for Peace program envisioned by International Atomic Energy Agency (IAEA).\nHe said that the Commission has been rendering commendable national service for decades through application of nuclear technology in the fields of nuclear power, agriculture and biotechnology, and industrial usage. However, the most appreciable role played by PAEC has been witnessed in health sector especially for diagnosis and treatment of Cancer through its AECHs.”\n“I am glad to inaugurate the 19th PAEC-managed cancer hospital named GINOR which will surely provide great relief to nearly 1.5 million population of Gilgit Baltistan. Our government has launched the country-wide flagship initiative named ‘Sehat Sahulat Programme’ which is aimed at providing quality healthcare and insurance to the underprivileged segments of the society and by implementing the same at GINOR the government will ensure that cancer patients may also avail its benefits,” Asad Umar remarked.\nThe federal minister further said, “PAEC also deserves appreciation for planning the next cancer hospital in AJK”.\nEarlier, Member Science PAEC, Dr. Masood Iqbal thanked the federal minister and the government especially Planning Commission for continued patronage of the health sector projects launched by the Commission and hoped that the addition of GINOR to the existing fleet of PAEC-run cancer hospitals will prove a great blessing for the cancer patients hailing from Gilgit Baltistan (GB). He gave detailed briefing about the GINOR and facilities being offered here. He said construction of 20th Cancer hospital of PAEC will be started in Kashmir soon.\nAddressing the inaugural ceremony, Chief Minister Gilgit-Baltistan, Khalid Khursheed Khan thanked the federal government and PAEC for establishing state of the art cancer hospital, GINOR, in Gilgit.\nHe hoped that the hospital would provide great relief for the people of GB and surrounding areas because cancer incidence was on the rise in GB. The provision of diagnostic and treatment facilities by GINOR at the doorstep of people will be a blessing for them.\nBesides the Chief Guest and Chairman PAEC, the ceremony was virtually attended by Director General, Strategic Plans Division (SPD) Lt. General Nadeem Zaki Manj, HI (M). The inaugural ceremony at GINOR was attended by dignitaries and high officials from GB. Member Science also gave away shield to CM GB at the end.",
  "retrievedAt": "2025-08-11T14:06:38.896Z"
}
