{
  "title": "MoS Hina Khar holds wide ranging talks during Denmark, Finland visit",
  "link": "https://www.app.com.pk/national/mos-hina-khar-holds-wide-ranging-talks-during-denmark-finland-visit/",
  "date_published": "2023-06-10T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 10 (APP):  Minister of State for Foreign Affairs (MoS) Hina Rabbani Khar paid a two-day visit to Denmark and Finland on June 8-10 in which she held government level interactions and engaged with think tank and local media.\nIn Denmark, the MoS met the Minister for Development Cooperation and Global Climate Policy, Dan Jorgensen.\nThe two ministers agreed on building collaboration in renewable energy sector, under the recently signed Green Framework Engagement Agreement.\nShe hoped that the Danish Minister’s upcoming visit to Pakistan next week (16-18 June 2023) would be instrumental in this regard and assured Minister Jorgensen warm welcome and full cooperation on government’s behalf, Foreign Office Spokesperson said in a press release on Saturday.\nIn a meeting with Prehn Rasmus, Member of the Danish Parliament, the MoS underscored the importance of parliamentary engagement in further cementing mutual ties. Discussions were also held on areas where quick progress could be made bilaterally.\nThe MoS engaged with the Danish chapter of the Schiller Institute on Pakistan’s approach to key regional and international issues. The talk was joined in via zoom by the international president of the Schiller Institute, Helga Zepp-LaRouche. She also gave an interview to the leading Danish newspaper, Berlingske.\nOn 9 June, the MoS called on Johanna Sumuvuori, the State Secretary to Minister for Foreign Affairs of Finland in Helsinki.\nThe two ministers noted the growing bilateral cooperation, especially in the fields of education and vocational training.\nThe MoS identified Green Energy as a key sector, in which significant bilateral collaboration could be developed in near future.\nMinister Khar also exchanged views with her counterpart on regional and global issues of interest.\n“The visit of the Minister of State to Denmark and Finland provided excellent opportunity for high-level political engagement with the two countries. These engagements are expected to build mutual confidence and trust, resulting in mutually beneficial partnerships across various sectors,” it was further added.",
  "retrievedAt": "2025-08-11T08:40:58.179Z"
}
