{
  "title": "FM Bilawal sees better, democratic and progressive future for Pakistan",
  "link": "https://www.app.com.pk/national/fm-bilawal-sees-better-democratic-and-progressive-future-for-pakistan/",
  "date_published": "2023-06-10T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 10 (APP): Foreign Minister Bilawal Bhutto Zardari on Saturday said that despite many economic and political challenges faced by Pakistan, ranging from climate change to Russian-Ukraine conflicts and domestic issues, he was confident that the people of the country would come together to overcome these ordeals and build a better future.\nIn an interview with Al-Jazeera English Tv channel during his recent visit to Iraq, the foreign minister said that the floods last year that devastated large parts of Pakistan was not only significant for Pakistan but for the entire world.\nIt had affected 33 million people, besides causing huge financial losses which had far reaching effects upon Pakistan’s economy.\nTo build back climate resilient Pakistan, he said, they had arranged a conference in Geneva in collaboration with the UN, adding they were making efforts to materialize about $9 to $10 billion pledges made during the conference.\nWhereas, a large chunks of finances had been arranged through bilateral engagement with the world financial institutions, he informed.\nThe foreign minister said besides, they were trying to revive International Monetary Fund (IMF) programme.\nThe foreign minister also rubbished allegations of misuse of funds donated for the areas hit by natural catastrophe in the past by saying that there were misconception about funds which were based upon frivolous accusation as none had been ever proved. They did not hold any weight, he maintained.\nAbout PTI chief Imran Khan’s allegations, he said that he was responsible for his downfall and the history would prove it.\nThe foreign minister said that the country had faced dictatorships in the past and Imran Khan always supported the dictatorships. It was documented and established fact that he was brought to power through rigged elections.\nHe said the announcement by the military top brass that the army would not involve in politics and would remain apolitical, had definitely upset the PTI’s supporters.\nThe citizens were offended on the incidents of May 9 when the PTI supporters attacked GHQ and Corps commander house, he added.\nHe said the elements involved in those incidents would face the legal consequences.\nTo a question, Bilawal Bhutto Zardari, said “We don’t believe the change could come by overnight”, adding the only way was through the change brought about by the democratic forces in the society.\nHe said change should take place through civilian and political process involving the parliament. Imran Khan had paid less attention to parliament.\n“The fate of the country can’t be decided on streets but by the parliament,” he stressed while underling the need for the civilian and political leadership to strengthen the democratic role, squeezing space for others.\nHe said the PPP was the party that always challenged dictatorship including the last one of late Musharraf and regretted that not an attack had ever been mounted by any political party in Pakistan as done by the PTI on May 9.\nThe foreign minister said that he did not regret returning to Pakistan to realize the vision of his mother. “Pakistan is transitioning towards democracy. We are at the fork towards road to democracy,” he added.\nTo a query, he said after the fall of Kabul, the international community had many expectations from the new rulers.\n“Pakistan’s position is in line with the position of the international community”, he said, adding the international community wanted Taliban rulers to to do with the women’s rights and education and that the Afghan soil should not be used for terrorist activities.\nForeign Minister Bilawal further stressed that engagement of the global community with the new rulers of Afghanistan was the only solution as it was in the interest of all to have a secure and prosperous Afghanistan that was at peace with itself and with its neighbours.\nThe world wanted the incumbent rulers to fulfil their commitment with the international community, he said.\nThe foreign minister, replying to a question, said that Pakistan faced security threats from terrorist outfit TTP as different terrorist incidents occurred in Pakistan after the fall of Kabul.\nHe reiterated that Pakistan wanted Taliban to act against these terrorists and cited hosting of a recent meeting of Pakistan, China and Afghanistan which focused on threats of terrorism.\nAbout ties with Iran, the foreign minister said that recently a border market was established at Iran-Balochistan border to encourage bilateral trade whereas, they were also working on electricity transmission from Iran to Balochistan.\nBilawal termed the restoration of diplomatic ties between Saudi Arabia and Iran as a ‘positive development’.\n“It is a positive news not only for the two countries, but for the whole region and for us,” he said, stressing that through engagement all the issues could be resolved paving way for peace dividends.\nThe foreign minister strongly rebuffed the allegations against China’s investment in Pakistan and said that it was unfortunately a reflection of “biased attitude”.\nHe said all weather strategic cooperation between Pakistan and China was based upon economic prosperity.\nPakistan was engaged with China, through China Pakistan Economic Corridor (CPEC) a flagship of “One belt one road’ initiative under which China was completing different energy and road infrastructure projects, he added.\nHe reiterated that they were optimistic to live up to their commitment, adding “Development is the right of all countries.”\nAs result of CPEC, they were optimistic to further increase their economic activity between the two countries. The economy of the two countries supplemented each other.\nTo another query, he said Pakistan was committed to maintaining relations with all the countries and was seeking enhanced engagement with the Russian government through deep meaningful ties.\nHe said that they wanted to maintain neutrality over the Ukraine conflict.\nAbout his visit to Iraq, he said that it would further enhance the bilateral and economic cooperation between the two brotherly countries.\nThey also wanted to strengthen the security and defence cooperation and share their experiences learnt from terrorism. For the promotion of cultural and religious ties, both the countries agreed to ease visas for tourism, he added.",
  "retrievedAt": "2025-08-11T08:40:58.036Z"
}
