{
  "title": "Experts discuss role of new, emerging technologies in comprehensive national security",
  "link": "https://www.app.com.pk/national/experts-discuss-role-of-new-emerging-technologies-in-comprehensive-national-security/",
  "date_published": "2023-06-10T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):The experts at a seminar explored the role of emerging technologies in comprehensive national security, highlighting the need for collaboration and a human-centric approach.\nThe Centre for Aerospace & Security Studies (CASS), Islamabad, successfully concluded a seminar on the ‘Role of New & Emerging Technologies in Comprehensive National Security.’ The event brought together renowned experts and policymakers to explore the profound impact of technological advancements on national security strategies, a news release said.\nIn his Keynote Address, Advisor National Command Authority & Former Director General, Strategic Plans Division, Lieutenant General (R) Khalid A. Kidwai emphasised the crucial link between changing technologies and comprehensive national security.\nHe highlighted the need to consider the reliability, shelf life, and strategic effects of new technologies, as they could cause tactical and strategic imbalances.\nGeneral Kidwai underscored the importance of embedding political stability, a sound economy, and social cohesion within the nation’s fabric to ensure comprehensive security. He appreciated CASS for initiating a timely debate on a subject that was vitally important and relevant to comprehensive national security.\nProfessor Dr Rabia Akhtar, Director of the Centre for Security, Strategy and Policy Research at the University of Lahore, shed light on the impact of new technologies on traditional security.\nShe emphasised the need for synergy and collaborations between state institutions, academics, and industry experts.\nDr Akhtar stressed the significance of investing in emerging technologies like AI-powered weapons, bioengineering, and cyber warfare to maintain an edge in national security. Furthermore, she highlighted the need for a regulatory framework and massive investment in research to address privacy concerns and civil liberties.\nAamna Rafiq, Research Associate at the Arms Control and Disarmament Centre, Institute of Strategic Studies Islamabad, explored the potential of emerging technologies in enhancing non-traditional security and national development. She discussed how innovative technologies were directly supporting the implementation of the United Nations 2030 Sustainable Development Goals (SDGs).\nRafiq highlighted the role of emerging technologies in poverty reduction, market access, agriculture practices, healthcare, education, and gender equality. She emphasised the need to bridge the gender divide in technology and ensure equal access for all.\nDr Syed Arif Ahmad, Former Advisor at the Pakistan Atomic Energy Commission, focused on the prudent harnessing of technological development to support comprehensive security.\nHe raised concerns about the rapid development of Artificial Intelligence and the potential challenges in controlling its application.\nDr Ahmad stressed the importance of adapting AI technologies to stay prepared for future conflicts and avoid isolationist policies. He also highlighted the implications of hypersonic weapons and the need for Pakistan to invest in supercomputers for testing new technologies.\nIn his remarks, Air Commodore Khalid Banuri (Retd), Former Director General Arms Control & Disarmament Affairs Branch, Strategic Plans Division, and the seminar’s discussant, emphasised the importance of social cohesion and acknowledged the challenges associated with achieving it.\nHe highlighted that social cohesion was a complex objective and not easily attainable, as it required learning to co-exist with diverse perspectives and backgrounds.\nRegarding big data, Air Commodore Banuri identified three key aspects: access, analysis, and application. He noted that there were existing challenges in each of these areas for Pakistan.\nFurthermore, he stressed that the integration of algorithms and AI could assist in facilitating swift and efficient decision-making at both individual and societal levels.\nAir Marshal M. Ashfaque Arain (Retd), Advisor Chief of the Air Staff on CASS Affairs & Director Emerging Technologies, Centre for Aerospace & Security Studies, Islamabad, highlighted the transformation of national security during the seminar.\nHe shared that the concept of national security had transitioned from solely focusing on military security against external threats (traditional security) to encompassing ‘Comprehensive National Security.’\nThis comprehensive approach entailed safeguarding not only the state’s security but also protecting various dimensions of human security or non-traditional security.\nIn his Concluding Remarks, Air Marshal Farhat Hussain Khan (Retd), President of the Centre for Aerospace & Security Studies, Islamabad, highlighted that AI had significantly reduced decision-making time, leaving no room for delay or hesitation.\nHe acknowledged that the rapid advancements in AI and cyber capabilities were set to play a vital role in the future of warfare.\nAir Marshal Khan emphasised the criticality of political stability as a prerequisite for progress, emphasising that true security could not be achieved without ensuring the safety and well-being of the people. Therefore, he stressed the importance of adopting a human-centric approach to security as the primary focus.\nThe well-attended seminar concluded with a call for greater collaboration, research investment, national and international regulatory frameworks, and the integration of emerging technologies into Pakistan’s comprehensive national security strategies.",
  "retrievedAt": "2025-08-11T08:41:01.051Z"
}
