{
  "title": "Pak-EPA leads clean-up drive at Margalla Hills to mark World Environment Day",
  "author": null,
  "content": "ISLAMABAD, Jun 02 (APP):The Pakistan Environmental Protection Agency (Pak-EPA) organized a two-day clean-up campaign at Margalla Hills Trail 5, collecting over 500 kg of plastic and solid waste to mark World Environment Day 2025.\nHeld on June 1-2, the drive mobilized 40 volunteers from universities, NGOs, and local communities to remove plastic bottles, wrappers, and other non-biodegradable waste from the popular hiking trail. This year’s global theme, “Eliminate Plastic Pollution,” highlighted the urgent need to tackle plastic waste harming ecosystems.\nAisha Humera, Secretary of the Ministry of Climate Change, praised volunteers and stressed collective responsibility.\n“Plastic waste is invading our oceans, food, and even our bodies. Laws alone aren’t enough—public awareness and sustainable habits are key,” she said.\nPak-EPA Director General Nazia Zeb Ali emphasized behavioral change: “This drive isn’t just about cleaning trails; it’s about protecting biodiversity and changing mindsets. Plastic pollution is a severe threat, and everyone must act.”\nParticipants noted plastic bags as a major pollutant, endangering wildlife and soil. The event also spotlighted broader issues like deforestation and encroachments in Margalla Hills.\nWith World Environment Day on June 5, Pak-EPA aims to boost public engagement in conservation. “We’re committed to safeguarding Islamabad’s environment through partnerships and awareness,” Ali added.\nThe clean-up sets the tone for Environment Week, urging citizens to adopt eco-friendly practices for a greener future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:43:22.485Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-epa-leads-clean-up-drive-at-margalla-hills-to-mark-world-environment-day/",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T15:49:00.000Z"
}
