{
  "title": "High-level delegations to visit world capitals from Jun 2 to project Pakistan’s stance on Indian aggression",
  "author": null,
  "content": "ISLAMABAD, Jun 02 (APP): The high-level delegations are scheduled to start their visit to world capitals from Monday to project Pakistan’s perspective on the recent Indian aggression.\nFormed purusant to the directives of Prime Minister Shehbaz Sharif, the delegations would visit New York, Washington DC, London, Brussels and Moscow from 2 June 2025, according to a Foreign Office press release.\nA nine-member multiparty delegation is led by Chairman Pakistan People’s Party, and former Foreign Minister, Bilawal Bhutto Zardari. The other members of the delegation include Minister for Climate Change and Environmental Coordination Dr. Musadik Masood Malik; Chairperson of Senate Standing Committee on Climate Change and Environmental Coordination and former Minister for Information and Climate Change Senator Sherry Rehman; Chairperson of National Assembly Standing Committee on Foreign Affairs and former Foreign Minister Hina Rabbani Khar; former Minister for Commerce, Defence and Foreign Affairs, Engineer Khurram Dastgir Khan; former Minister for Maritime Affairs, Senator Syed Faisal Ali Subzwari; and Senator Bushra Anjum Butt.\nThe delegation also includes two former Foreign Secretaries, Ambassador (R) Jalil Abbas Jilani, who also served as Caretaker Foreign Minister, and Ambassador (R) Tehmina Janjua.\nAnother delegation, led by Special Assistant to the Prime Minister, Syed Tariq Fatemi, will visit Moscow from June 2, 2025.\nThe delegations will highlight Pakistan’s responsible and restrained conduct – seeking peace with responsibility – in the face of India’s reckless and belligerent actions in violation of international law.\nThey will also highlight that dialogue and diplomacy should take precedence over conflict and confrontation.\nThe delegations will underscore the imperative for the international community to play its due role in promoting a lasting peace in South Asia.\nThe need for immediate resumption of the normal functioning of the Indus Waters Treaty will also be a key theme of the delegations’ outreach.\nThe delegations will engage in a series of meetings with the leadership of international bodies, public office holders, senior officials, parliamentarians, think tanks, media and diaspora.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:43:46.978Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/high-level-delegations-to-visit-world-capitals-from-jun-2-to-project-pakistans-stance-on-indian-aggression/",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T07:43:00.000Z"
}
