{
  "title": "High-level seminar on ‘Water Crisis and  Indus Waters Treaty’ to be held at COMSTECH on June 04",
  "author": null,
  "content": "ISLAMABAD, Jun 02 (APP):A high-level international seminar titled “Water Crisis and the Indus Waters Treaty” will be held on June 04 at the COMSTECH Secretariat Auditorium, Islamabad.\nThe event is being jointly organized by OIC-COMSTECH, the Karachi Council on Foreign Relations (KCFR), the Hisaar Foundation, and the Panjwani-Hisaar Water Institute, NED University, Karachi.\nThis timely seminar comes in the wake of India’s unilateral suspension of the Indus Waters Treaty (IWT) in May 2025 a move that has significantly heightened tensions in the region and brought nuclear-armed neighbors perilously close to conflict.\nThe seminar will bring together a distinguished panel of national and international experts in the fields of hydrology, environmental law, international diplomacy, climate resilience and strategic security to critically assess the implications of the treaty’s suspension and explore Pakistan’s strategic options going forward.\nMs. Nadira Panjwani, Chairperson, Karachi Council on Foreign Relations;\nProf. Dr. M. Iqbal Choudhary, Coordinator General OIC- COMSTECH; Senator Mushahid Hussain Syed, Senior Parliamentarian and Security Analyst; Mr. Ikram Sehgal, Renowned Defense and Strategic Affairs Expert; Ms. Simi Kamal  Founder and Chairperson, Hisaar Foundation, Co-founder, Panjwani-Hisaar Water Institute; Mr. Ali Tauqeer Sheikh , International Expert on Climate Finance, Mr. Rafay Alam, Environmental Legal Expert; Mr. Zohair Ashir,  Member, Board of Governors, Hisaar Foundation,  Executive Board Member, Panjwani-Hisaar Water Institute.\nThe seminar seeks not only to address the immediate diplomatic and environmental implications of the IWT crisis, but also to advance regional and multilateral cooperation on shared water resources. It aims to explore adaptive, resilience-building strategies and help define a long-term strategic roadmap for Pakistan’s water governance in an era of climate insecurity and geopolitical fragility.\nRather than a reactive measure, this seminar is part of a broader vision by COMSTECH to leverage science, diplomacy, and policy innovation to ensure sustainable and secure transboundary water management for Pakistan and the broader OIC region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:43:46.866Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/high-level-seminar-on-water-crisis-and-indus-waters-treaty-to-be-held-at-comstech-on-june-04/",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T09:33:00.000Z"
}
