{
  "title": "PMLN leader Abdul Qadir Baloch along with supporters resigns from party over narrative against army",
  "link": "https://www.app.com.pk/national/pmln-leader-abdul-qadir-baloch-along-with-supporters-resigns-from-party-over-narrative-against-army/",
  "date_published": "2020-11-07T12:20:00.000Z",
  "source": "APP",
  "content": "QUETTA, Nov 11 (APP): PML-N leader Lt General (Retd) Abdul Qadir Baloch Saturday formally announced his resignation from the party over the narrative built by its leaders Nawaz Sharif and daughter Maryam Nawaz against the country’s armed forces and for inciting a mutiny.\nAddressing a large gathering here the provincial president of PML-N Abdul Qadir Baloch said he has earned all the respect and honour because of his services to the country while serving with the armed forces of Pakistan.\n“I am what I am, because of army. We at the academy (PMA) are taught to Do or Die, and never ask Why …  How can I be part of a group who blurts out venom against its own armed forces. If I have to stand with someone, I will stand with my Chief,” he said as the large crowd cheered.\nFormer Chief Minister Balochistan, Nawab Sanaullah Zehri, and a larger number of PML-N workers attended the workers’ convention held here at the Metropolitan Hall of Quetta.\nMedia error: Format(s) not supported or source(s) not found\nLt Gen (Retd) Qadir Baloch’s said another reason for his resignation came in the wake of PML-N’s controversial decision not to invite former Balochistan chief minister Sanaullah Zehri to the recently held Pakistan Democratic Movement (PDM) rally in Quetta.\nHe mentioned several instants wherein he was not consulted by the PML-N senior leadership over the issues related to Balochistan. He recalled how Maryam Nawaz, “who now dreams to be the Prime Minister or acts like Benazir Bhutto,” once asked him to arrange meeting with female workers.\nHe said after addressing the gathering she refused to even meet or shake hands with the workers who had travelled from far off places. He said he was very embarrassed as he had personally requested the female workers to attend the event, being members of a conservative society.\nHe said it was the same arrogant attitude of the PML N leader Nawaz Sharif which he exhibited throughout his entire political career. He said the people of Balochistan were used only to build his vote bank, but were never given their due share while the PMLN was in power. He regretted that despite his efforts the PML N leadership never delivered to what they promised for the people of Balochistan.\nQadir Baloch said Nawab Sanaullah Zehri were the pioneers in building the grassroots of the PML N across Balochistan, and gave sacrifice of several of their close family members. He said due to their effort the PMl-N won 22 seats, but their efforts were never acknowledged and they were summoned to Murree, from where they were handed over the decisons.\nQadir Baloch said today representatives from all 33 districts of Balochistan were here and they were not ready to continue to work with the PML-N anymore.\nLt General (R) Qadir Baloch said that Pashtoonkhwa Milli Awami Party (PKMAP) and National Party (NP) had nominated Nawab Sanaullah Zehri as the chief minister with consensus. However, at the eleventh hour, Nawaz Sharif rejected the decision and nominated Dr. Malik Baloch as the chief minister of Balochistan. “We stood by the party despite this all”, he said.\nSanaullah Zehri said he joined the PML-N on the request of Abdul Qadir Baloch and merged his Pakistan Parliamentarians Party with the PML-N on the only condition that the people of Balochistan demand only respect, but regretted that Nawaz Sharif failed in delivering it.\nHe regretted joining the PML-N and said Nawaz Sharif was the most untrustworthy person he had ever met.\nBalochistan PML-N vice-president Nawab Shambazai, women wing president Amna Baloch, Makran Division president Agha Shah Hussain and other leaders also left the party.\nHis address, aired live by several news channels was widely hailed by people from all walks of life, particularly the ex servicemen.\nSoldier speaks. Gen Abdul Qadir Baloch blasts Nawaz Sharif & Maryam Nawaz for their anti Pakistan and anti Army narrative. Quits PMLN. A bold and rational decision by this proud Baloch. Ends his speech with “Pakistan Zindabad. Balochistan Zindabad.”#Balochistan #Pakistan #PMLN\n— Lt Gen M Haroon Aslam, (Retd) (@AVeteran1956) November 7, 2020\nEarlier Chief Minister Balochistan in his tweet on Oct 31, soon after the announcement of resignation by Qadir Baloch in a tweet termed it to be a good decision.\nI think General Qadir Baloch sahib has taken the right decision.\n— Jam Kamal Khan (@jam_kamal) October 31, 2020",
  "retrievedAt": "2025-08-11T19:59:18.517Z"
}
