{
  "title": "Price hike, unemployment only challenges for government: Ghulam Sarwar",
  "link": "https://www.app.com.pk/national/pti-govt-to-continue-serve-masses-sarwar-khan/",
  "date_published": "2020-11-07T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):Minister for Aviation, Ghulam Sarwar Khan on Saturday said price hike and unemployment were the real challenges to the incumbent government of Pakistan Tehreek-e-Insaf (PTI) and not the Pakistan Democratic Movement (PDM).\nAddressing a rally at Dhoke Imam Din’s Union Council Kalyal, Rawalpindi after inaugurating multi millions development projects, he said, opposition’s grand alliance (PDM) Pakistan Democratic Movement posing no threat to the government as the member parties were like a bunch of used and obsolete cartridges.\nThey should be ashamed of themselves. PDM leadership should answer the last 35 years loot and plunder of country.\nThe minister inaugurated Rs 30.20 million sui gas supply projects in Dhoke Mera, Bilal Colony, Kashmir Colony and Satti Town areas, saying serving peoples was his topmost priority.\nHe has no personal agenda and only believes in serving the people selflessly and continue to do so without any discrimination.\nHe said a Community Centre would also be constructed in the area for serving the people. While a water supply scheme with the allocation of Rs 440 million would also be initiated for the benefit of the areas people, he added.\nCriticising past elected leadership of the area, he said they even did not know the exact location and number of union councils. He would continue serving his supporters and opponents without any discrimination, he said. Sarwar urged the people to support PTI for prosperous and powerful Pakistan.\nCriticising former Prime Minister Muhammad Nawaz Sharif, he said Nawaz remained prime minister thrice but was ousted from power corridors due to his deeds.\nThe whole Sharif family was thief. They left the country each time after inking agreement. According to Pakistan People’s Party (PPP) Chairman, Bilawal Bhutto Zardari, the speech of Nawaz Sharif in Gujranwala rally was his personal views.\nHe said he was astonished to listen that opposition was not sincere with each other.\nNawaz had left the country in December 2000 after tendering apology and inking 10 years self exile agreement with former President Pervez Musharraf.\nMember Provincial Assembly from PP-12 Chaudhry Wasiq Qayyum also attended the meeting.",
  "retrievedAt": "2025-08-11T19:59:15.950Z"
}
