{
  "title": "Rs.6 bln to be paid to all pensioners from Grade1 to Grade16: Federal Minister for Railways",
  "link": "https://www.app.com.pk/national/rs-6-bln-to-be-paid-to-all-pensioners-from-grade1-to-grade16-federal-minister-for-railways/",
  "date_published": "2020-11-07T11:13:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 07 (APP): Federal Minister for Railways, Sheikh Rasheed Ahmed said that an amount of Rs.6 billion would be paid to all pensioners from Grade1 to Grade16 within half and a month as they were not paid since last four years.\nHe expressed such views while addressing the press conference here on Saturday.\nAs many as 14 kilometers track of Karachi Circular Railways (KCR) had been cleared up to Orangi, the federal minister uttered, maintaining “we are ready as we have done our part work and it is work on the part of Sindh government to build underpass and bridges.”\nHe further informed that 15 KCR coaches of 40 were manufactured, believing that we would achieve the target of manufacturing the rest 25 coaches till bridges and underpass were built by provincial government.\nPointing out the issue of Tijori Height, the federal minister told that the poor should be careful from land-grabbers who had occupied the land of railways illegally because the Pakistan Railways owned this land because it had paid. They could not complain to us, if anyone lost his or her money, Sheikh cleared.\nWe held the meeting different people, the federal minister told, suggesting that they should come for the lease of land or property under the rules.\nWe have increased 25% on the overwork of 33000 technical employees, he stated, adding “we wish to extend the CPEC from Karachi to Peshawar and then to Jalalabad as the trade volume could be increased.\n“You will get new thing from Gilgit-Baltistan after 16 November as all parties are there for elections campaigns”, he said, telling that they were participating in the elections but we would see whether losers would accept the results not.\nAppreciating the statement of Chairman Pakistan People Party (PPP), Bilawal Bhutto Zardari said that his statement was appreciable in which the chairman cleared that in the meeting of PDM before Jalsa, no decision was taken to talk against any institution.\nPML-N and its leadership were taking the politics to closed street, he said, adding “during my career as politician, I did not see any political leader who did not prefer dialogue over any other option. Prime Minister clearly said that they were ready to hold dialogues on all issues except NAB cases and NRO, he informed.\nReplying to a question, the federal minister said that there was neither chance of presidential system, nor martial law in the country,maintaining that the government would complete its constitutional tenure.\nReplying to another question, Sheikh Rasheed Ahmed stated that five freight trains had been privatized and 12 passenger trains would be privatized soon because it had increased the revenue by 25 percent.\nThe government would privatize all freight trains because they were generating more revenues, he reaffirmed, articulating that the privatization did not mean to handover all things to private sector but the government would have power to oversee the matters",
  "retrievedAt": "2025-08-11T19:59:19.044Z"
}
