{
  "title": "Pakistan Embassy in Hague organizes AI&Big Data Expo Europe",
  "link": "https://www.app.com.pk/national/pakistan-embassy-in-hague-organizes-aibig-data-expo-europe/",
  "date_published": "2023-10-21T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP):Embassy of Pakistan, the Hague in collaboration with Pakistan Software Export Board (PSEB) and Trade Development Authority of Pakistan (TDAP) set up a ‘Tech Destination Pakistan’ pavilion in ‘AI & Big Data Expo Europe’, at RAI, Amsterdam on 26-27 September 2023.\nThe IT companies from Pakistan namely Abacus Consulting, Royal Cyber, Brickclays, Xynotech, Coeus Solutions, Digifloat, Grayphite, NN Software, and Reach the Globe showcased their services / products in the Expo, a press release issued by the Pakistan embassy, the Hague, Netherlands said on Saturday.\nOn first day of the Expo, Ambassador Suljuk Mustansar Tarar visited the Expo and met with Pakistani exhibitors. Chief Executive Officer Abacus Consulting Fatima Asad gave presentation on opportunities in IT Sector of Pakistan. She presented Pakistan as an emerging market, offering huge potential not only for sourcing services but also as a very conducive market for investment. Ambassador Suljuk appreciated efforts of Pakistani exhibitors to promote professionalism and talent from Pakistan in IT sector.\nEmbassy of Pakistan, the Hague organised a networking event attended by Pakistani exhibitors and IT professionals, academia and professionals working in Netherlands-based MNCs. Ambassador Suljuk Mustansar Tarar gave an overview of the initiatives taken by the Embassy to promote IT services exports. He said that webinars and in-person events have been held in collaboration with PSEB, TDAP and the Pakistani IT professionals in the Netherlands. Participation of Pakistan in this Expo was part of business plan of the Embassy to showcase Pakistan’s IT services sector.\nThe Embassy has also launched a series of webinars for awareness of Pakistani professionals about job opportunities in the Netherlands. He further informed that the efforts have come to fruition in the form of increase in export of IT services to the Netherlands from US$ 9.8 Million to US$ 23 Million and increase in number of IT professionals joining the Dutch companies.\nThe Embassy had arranged visit of a delegation of IT companies in May 2023. The visiting delegates expressed their satisfaction about Pakistan’s investment eco system. Shurjeel Tousif, CEO SeQuenX , who was part of the delegation said that subsequent to his trip to Pakistan arranged by the Embassy, SeQuenX has opened up a software business development centre in Islamabad.\nThis is line with the vision to set up a software technology corridor between the Netherlands and Pakistan. To cement this, SeQuenX has also signed an MoU with COMSATS Global.\nPakistani exhibitors were highly satisfied with arrangements made by the Embassy and also expressed optimism to increase export of IT services. Fatima Asad-Saeed commended decision of the Government of Pakistan to participate in this Expo as well as efforts of the Embassy for facilitating participants and promoting networking with the Dutch companies. Mustafa of Royal Cyber said that there lies a huge potential in tech sectors of the Netherlands and Pakistani companies can complement their requirements befittingly.\nAmbassador Suljuk said that Government of Pakistan has recently constituted Special Investment Facilitation Council (SIFC) who have included IT among the priority sectors for investment.\nHe appreciated efforts of PSEB and TDAP and thanked the participants. He encouraged Dutch businesses to explore opportunities in Pakistan.",
  "retrievedAt": "2025-08-11T10:10:11.941Z"
}
