{
  "title": "Islamabad police launch awareness campaign against Coronavirus",
  "link": "https://www.app.com.pk/national/islamabad-police-launch-awareness-campaign-against-coronavirus/",
  "date_published": "2020-03-27T01:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP):Islamabad Police have launched a campaign to aware citizens about precautionary measures in fight against Coronavirus and initially constituted 25 teams which would give safety tips to people in this regard.\nThe campaign has been launched following the directions of DIG (Operations) Waqar Uddin Syed initially in the areas sealed by police and security agencies due to the threat of Coronavirus. Police and volunteers are jointly running the campaign while masks and gloves are being distributed by the police.\nDIG (Operations)) Waqar Uddin Syed is himself monitoring this campaign and community policing is being resorted for awareness in the sealed areas. The volunteers are also being trained and 25 teams comprising police officials and volunteers have been constituted for awareness against Coronavirus.\nEach team consists of three volunteers and a policeman which would be part of the awareness campaign in the area of Ramana police station. These teams were briefed by SP (Saddar) Omar Khan ASP Rana Abdul Wahab on Friday as how to make effective interaction with people.\nMeanwhile, ASP Zohaib Ranjha and SHO Mian Khurram are leading the campaign in Industrial area and briefing people as how to combat against Coronavirus.\nThe DIG (Operations) Waqar Uddin Syed hoped that this fight against Coronavirus would be won with the cooperation of people.\nHe said all the SPs, DSPs and other police officials were fully coordinating with teams of district administration in their respective areas.\nEvery police officials of Islamabad police was performing duty with dedication and considering it as national responsibility, he added.\nOn the other hand, police arrested 196 persons during last 24 hours over violation of section 144. Pillion riding is completely banned in the city and it is prohibited to open shops excluding medical stores and of edible items.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:00:36.652Z"
}
