{
  "title": "Command & Control Center set up for inter-provincial coordination on COVID-19",
  "link": "https://www.app.com.pk/national/command-control-center-set-up-for-inter-provincial-coordination-on-covid-19/",
  "date_published": "2020-03-27T03:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP):The government has established a Command and Control Center to ensure effective coordination among the federal and provincial governments on control of COVID-19, Foreign Minister Shah Mehmood Qureshi said Friday.\nQureshi, who attended the high-level meeting of National Coordination Committee chaired by Prime Minister Imran Khan a day earlier, said the facility would work under National Disaster Management Authority (NDMA).\n“The provinces have been asked to nominate their representatives so that they can work in tandem through a standardized mechanism,” the foreign minister said in a briefing regarding the meeting.\nThe National Coordination Committee also decided to put in place protective measures for health worker who remained a front-line defence during the challenge of Coronavirus, he said.\nThe decisions in this regard include improvement in testing facility and purchase of new PCR machines – also known as thermal cycler most commonly used to amplify segments of DNA via the polymerase chain reaction.\nHe said keeping a balance between lockdown and provision of basic necessities of life to public was stressed in the meeting.\nQureshi said issuing mere notifications barring congregational Friday prayers at mosques was not enough, rather convincing public to maintain social distancing was more important.\nHe pointed out that when the Sindh government last Friday put a ban on gathering at mosques, the people instead assembled at roads to offer prayers.\nHe said the Saudi government had sent a letter to Pakistan’s Minister for Religious Affairs urging halt of arrangements for Hajj in view of spike in Coronavirus, though a final decision on Hajj was yet to be taken.",
  "retrievedAt": "2025-08-11T19:00:34.873Z"
}
