{
  "title": "Sindh Governor receives consignment of medical supplies from China to fight against Coronavirus",
  "link": "https://www.app.com.pk/national/sindh-governor-receives-consignment-of-medical-supplies-from-china-to-fight-against-coronavirus/",
  "date_published": "2020-03-26T23:14:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 27 (APP):Sindh Governor Imran Ismail on Friday received the consignment of medical supplies donated by Chinese billionaire Jack Ma’s Foundation and Alibaba Foundation to help Pakistan fight against COVID-19, which will be transported by the National Disaster Management Authority (NDMA), for onward distribution throughout the country.\nThe supplies include 56,000 COVID19 testing kits and other items like face masks and personal protective equipment, reached the port city, through a cargo plane at the Old Airport here.\nTalking to media persons on the occasion, Sindh Governor Imran Ismail said that the way Chinese government has helped Pakistan in the difficult time; no other government has did it.\nHe expressed gratitude to the Chinese government for helping and said this was a proof of Pak-China time-tested friendship.\nHe also lauded Jack Ma’s Foundation and Alibaba Foundation and NDMA for their joint efforts for these much-needed medical supplies for Pakistan.\nImran Ismail said that around 56,000 COVID-19 testing kits are part of the supplies, which, he termed as extremely important and a key factor in testing coronavirus. The testing is very significant to determine the present situation and further taking steps for containing the coronavirus, he added.\nHe said that they have also set up an 1100-bed field hospital for coronavirus and these testing kits will also be very helpful in the field hospital.\nThe Governor Sindh said that all segments of the society are united in the present situation to help the nation fight against the coronavirus.\nHe said that he will give credit to the Prime Minister Imran Khan for taking best decisions and said the centre is taking most appropriate steps through a necessary consultation and thorough deliberations.\nThe Pakistan Army is also making all out efforts and very actively coordinating with the government in every way to contain the coronavirus, which is a very good sign.\nHe told a questioner that though the country was passing through a difficult economic situation but the Prime Minister Imran Khan has announced economic package for industrialists and to provide relief to common man.",
  "retrievedAt": "2025-08-11T19:00:40.085Z"
}
