{
  "title": "AJK celebrates World Mothers Day with exceptional love and affection with this Supreme Relation:",
  "link": "https://www.app.com.pk/national/updated-story-ajk-celebrates-world-mothers-day-with-exceptional-love-and-affection-with-this-supreme-relation/",
  "date_published": "2022-05-08T11:10:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 08 (APP) :To pay great respect and honour for the supreme relation of mother, a brief and simple ceremony held here on Sunday was the hallmark of the World Mothers Day.\nThe World Day of expression of love with mothers was also observed across Azad Jammu Kashmir with renewal of the pledge to love mothers as much as possible to keep the sole satisfied in view of the most dignified and supreme status of this relation as also enshrined by the teachings of Islam.\nSons and daughters conveyed good wishes to their mothers coupled with the pray for long lives of the mothers to keep the children intact with the blessing of this supreme relation. Whereas those unfortunate, who have lost this relation, prayed for the rest of the souls of their mothers in eternal peace.\nTalking to APP on the occasion, former AJK minister for women development and Chairperson Khdeeja Tul Kubra Al Binaat of Awaz Foundation AJK Mrs. Naheed Tariq highlighted the superiority and importance of this relation as also confided and determined in the teachings of Islam.\nShe emphasized the need for maintaining the high decorum of the relation of mother through showing maximum respect and honor of this supreme relation all the time especially at the old age.\nShe said that although mother is a small word but the reality hidden in this word was ascertained only to those who, by now, have deprived of this most superior relation.\nShe advised for fully obeying the advises of mother all the time especially at each step of their old age to keep the soul satisfied besides fully acting upon the Islamic teachings which enshrined the superior status of this supreme relation.",
  "retrievedAt": "2025-08-11T14:50:14.697Z"
}
