{
  "title": "Health experts advise against heat exhaustion, dehydration during summer",
  "link": "https://www.app.com.pk/national/health-experts-advise-against-heat-exhaustion-dehydration-during-summer/",
  "date_published": "2022-05-08T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP): Health experts on Sunday advised the citizens to avoid unnecessary outdoor activities during the summer especially if they are diabetic as direct exposure to sun not only causes dehydration and heat exhaustion but also damages the skin.\n“Water and salt intake should be increased during summer. Be sure to drink water frequently even if you are not feeling thirsty. Going outside during 11 am to 6 pm must be avoided if possible”, Prof Dr Zafar Haider said while speaking to a private news channel.\nDrinking plenty of water remains the best way to stay hydrated in the summer, he said, adding, be sure to drink more water than usual and schedule regular “water breaks” during the whole day.\nThe elderly and those who have diabetes or heart disease may need more water to remain hydrated than others, he mentioned.\nWhile explaining the symptoms of heat exhaustion, he said that patient can feel faint or dizzy, tired and weak, decrease the blood pressure, cause muscle cramps, sweating, an intense third, a fast pulse and urinating less than usual.\nWe should be mindful of the symptoms of heat stroke and take early precautions to avoid a situation that makes us vulnerable to one, he added.\nParents should make sure children get plenty of opportunities to be cooled and are drinking liquids. In any heat exhaustion situation, public should go with water or keep themselves hydrated, he urged.\nAnother physician Dr Seemi Jamali said that there was need to create awareness among public on key signs and symptoms of heat related disorders including heatstroke that might be life threatening in case of ignorance. Heat exhaustion is milder illness than heatstroke which is generally caused by imbalance or inadequate replacement of water and salts lost in perspiration due to thermal stress. Dehydration in Summer can be a serious heat-related disease and it is also a dangerous side effect of diarrhea, vomiting, and fever. Children and people over the age of 60 are particularly susceptible to dehydration, she mentioned.\nDr Seemi said, take precautionary measures to avoid the harmful effects of dehydration, she said, adding, it is important for the person to be treated immediately as heat stroke can cause permanent damage or death.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:50:12.070Z"
}
