{
  "title": "JKNF terms Jammu massacre by hindu fanatics as a Muslim holocaust",
  "link": "https://www.app.com.pk/national/jknf-terms-jammu-massacre-by-hindu-fanatics-as-a-muslim-holocaust/",
  "date_published": "2021-11-05T12:11:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Nov 05 (APP): Jammu &  Kashmir National Front (JKNF) while paying eulogizing tributes to martyrs of Jammu has said that the massacre in the first week of this month in 1947 and lateron  goes down in Kashmir history as a Muslim holocaust in which hundreds and thousands of men, women and even children were ruthlessly killed and murdered in cold blood.\nIn a statement issued on Friday on the eve of Jammu Martyrs’ Day, the JKNF spokesman while recalling the dreadful memories of the tragic events that shook the entire state said, “The massacre marks the beginning of systematic genocide and ethnic cleansing of Muslims”. The entire Muslim population he said was wiped out with a mala-fide intent to alter the region’s demography.\n“Tens of thousands of hapless Muslim families were driven out of their homes, forced to flee and take refuge in newly formed state of Pakistan”, he said adding that it was the time when Muslim majority region was virtually reduced to a minority after a stage-managed and dreadful massacre carried out by Hindu goons under the supervision of Dogra troops.\nReferring to India’s 5th August 2019 unilateral move, the Front spokesman said that after the abrogation of article 370 and 35 A the India’s racist regime was hell bent on to change the demographic complexion of the entire state of Jammu and Kashmir.\n“Since 1947 there has been no change in India’s Kashmir policy. Though many faces have changed but the script written decades ago is pursued in letter and spirit by all and it does not matter whosoever is ruling the country, be it the so-called secular party-the Congress, Bhartiya Janata Party (BJP) or any other”, he said\n“They all are chips of the same block. The spokesman further said that it was high time that the global community must take effective notice of India’s brutal suppression of Kashmiris and it’s belligerent policies that pose existential threat to Kashmiris,he added.",
  "retrievedAt": "2025-08-11T21:33:34.832Z"
}
