{
  "title": "IBCC recommends exams, assessment reforms in all BISE,s",
  "link": "https://www.app.com.pk/national/ibcc-recommends-exams-assessment-reforms-in-all-bises/",
  "date_published": "2021-11-05T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): Inter Board Committee of Chairmen (IBCC) Forum in its meeting recommended to shift examination & assessment system from rote learning to conceptual learning.\nThe initiative has been taken on the directives of Federal Minister for Education & Professional Training Shafqat Mahmood.\nAccording to the IBCC on Friday, an agenda item for the improvement of examination system was placed in 170th meeting of the Forum at Islamabad which was attended by 49 members including 30 examination boards.\nAll the boards agreed that the examination & assessment pattern may be shifted from rote learning to conceptual learning. It was resolved that all the examination boards will prepare SLO (Students Learning Outcome) based question papers in future.\nThe boards agreed to gradually move towards higher cognitive level questions with the weightage Knowledge 30 percent, Understanding 50 percent and Application 20 percent.\nThe Forum recommended various examination reforms and advised boards to discuss the implementation strategy at their concerned forums.\nThe major recommendations include introducing automation of examination for improving efficiency and transparency, conducting curriculum-based examination, capacity building of examination staff & teachers to make assessment more valid & reliable, developing central items bank & rubrics to make assessment authentic, enhancing security system at the examination centers to curb cheating and other malpractices in examination, e-marking to make work smarter & faster, establishing research section in boards for analysis & future improvements.\nThe forum appreciated the initiatives taken by Federal Board and Kohat Board for introducing various reforms & technology in the examination system to ensure transparency & reliability.\nSecretary IBCC Prof Dr Ghulam Ali Mallah told media that it was the vision of Federal Minister to change the examination pattern that must be based on the concepts & understanding.\nHe further said that these recommendations will play pivotal role to dent the old conventional system that is based on rote memorization. The reforms will help students to be problem-solvers.",
  "retrievedAt": "2025-08-11T21:33:35.371Z"
}
