{
  "title": "Services of legal fraternity for upholding Constitution, law commendable: Fawad",
  "link": "https://www.app.com.pk/national/services-of-legal-fraternity-for-upholding-constitution-law-commendable-fawad/",
  "date_published": "2021-11-05T06:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Friday that the valuable services of lawyers for upholding the Constitution and the law were commendable.\nLawyers were defenders of the democracy, human rights and the Constitution and their role for the rule of law and supremacy of the Constitution was part of history, Chaudhry Fawad said while addressing a function in honour of the newly elected office-bearers  of the Supreme Court Bar Association (SCBA) here.\n” The Government is committed to the welfare of bar associations. We stand with lawyers at all levels” he remarked.\nHe said the government was aware of the problems of the legal fraternity and their solution was its first priority.\nThe minister opined that the politics of bar associations should be independent, the government and political parties should not interfere in it.\nFawad said that the coming era was digital, reforms were needed to strengthen the legal system. The national interests come first for all, including bar associations, he added.\nHe said that SCBA should play its role in swift disposal of the pending cases and it should have a body to compare the decisions of Supreme Court and High Courts’ judges.\nThe minister congratulated the newly elected office bearers of the Supreme Court Bar Association.\nThe newly elected President of SCBA Chaudhry Muhammad Ahsan Bhoon, Vice President (Punjab) Khawar Ikram Bhatti, Secretary Wasim Mumtaz Malik, Chaudhry Riasat Ali Gondal, Additional Secretary, Senator Ali Zafar, Pakistan Bar Council officials Tahir Nasrullah Warraich, Hafeez Rehman Chaudhry, Former Secretary Supreme Court Bar Association, Rana Shehzad Safdar Hussain Tarar, Additional Attorney General Amir Rehman Warraich, Vice President (Sindh) Aziz Ahmad Khan, Members of Executive Committee (Sindh) Jan Ali Junejo, Zulfiqar Haider Shah, Members of Executive Committee (Punjab) Rana Akhtar Ali, Chaudhry Tariq Javed and Chairman Overseas Pakistanis Forum Muhammad Sajid Tarar attended the meeting.",
  "retrievedAt": "2025-08-11T21:33:38.041Z"
}
