{
  "title": "A Pakistani in Japan strives to support needy, promote multiculturalism",
  "link": "https://www.app.com.pk/national/a-pakistani-in-japan-strives-to-support-needy-promote-multiculturalism/",
  "date_published": "2021-11-05T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 5 (APP): Having moved to Japan from Pakistan some 30 years ago, Haroon Qureshi is setting an example for others in the country by supporting the needy people including refugees through food, accommodation and employment.\nQureshi, 55, who also serves as Executive Director of the Islamic Cultural Center of Japan, housing Masjid Otsuka, in Toshima-ku, Tokyo, supports refugees and provides food to the needy along with his friends who gather at the mosque.\nDuring the COVID-19 pandemic, he launched a food drive going, collecting surplus food from families and distributing it among the needy people, according to a report published in The Asahi Shimbun, one of the largest newspapers in Japan.\n“I was hired out and kicked out of the dorm due to COVID-19.” “My family doesn’t understand that I can’t work because of my mental illness.” Qureshi receives a variety of consultations like the aforementioned from including Japanese, foreigners, and non-Muslims.\nQureshi helps them without any discrimination, believing that “It is the teaching of Islam to reach out to those in need, regardless of religion, color, or language.”\n“In Japan, even things that cannot be solved by the person’s own efforts are made the responsibility of the individual,” said Qureshi, who helps people who have nowhere to sleep to stay in mosques, find work, connect them to welfare offices, and accompany them to hospitals.\nQureshi, who came to Japan in 1991 from Pakistan to study at a university, later started his own business in Japan and worked hard to establish a mosque while running a trading business. He then married and all four of his sons were born in Tokyo.\nAlthough Masjid Otsuka has now become an integral part of the community, it was also exposed to misunderstanding and prejudice against Islam following 9/11.\nWhen he moved his own company office, he had a hard time finding a place to rent, as the building owner suspected how many weapons he had hidden.\n“It was the earthquake that brought us closer to the community,” Qureshi said.\nHe said after the Great East Japan Earthquake, Muslims went to Tohoku to help the people hit by the distress. Lacking the manpower to collect supplies and make rice balls, they began to call on local residents for help, and their activities gradually became known.\n“For some time now, we have been providing support to disaster-stricken areas and conflict zones overseas. Our actions in accordance with the teachings of Islam have not changed, but since the earthquake happened in Japan, I think our activities have been widely known,” Qureshi remarked.\nAccording to the Immigration Service Agency of Japan, there are 2,823,565 foreigners living in Japan. More and more commercial establishments are setting up Muslim places of worship, and we are seeing more and more seals of halal certification.\nHowever, Qureshi’s concern is the issue of funerals in Japan as there are only a few Muslim burial cemeteries in the country.\nThough the local law does not prohibit burial in the ground, some municipalities have banned burial by ordinance. Even in other places, it is difficult for Muslims to find new burial grounds, as opposition from nearby residents has prevented plans to build cemeteries.\n“We want the government to take the initiative,” said Qureshi. He added, “With a declining birthrate and an aging population, Japanese people need a foreign workforce, but if they don’t promote understanding of different cultures and ideas, Muslims will go to other countries.”",
  "retrievedAt": "2025-08-11T21:33:31.796Z"
}
