{
  "title": "Faisal terms digitizing health systems as key in achieving UHC",
  "link": "https://www.app.com.pk/national/faisal-terms-digitizing-health-systems-as-key-in-achieving-uhc/",
  "date_published": "2021-11-05T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):Special Assistant to Prime Minister on National Health Services, Regulations and Coordination Dr. Faisal Sultan on Friday said that digitizing health systems can contribute as a key component in achieving universal health coverage (UHC) in the country.\nAddressing the dissemination meeting of National Digital Health Framework of Pakistan, Dr Faisal said digitizing health systems play a pivotal role in improving the reach, impact and efficiency of modern health care and in delivering patient-centred services.\nHe said that ensuring access to quality health services is one of the main functions of a health system and digital health is increasingly self-evident as a means of making country’s health systems even more patient-centred.\nHe added, the twin pressures of Pakistan’s growing population and limited infrastructure require that we should embrace and scale-up innovative approaches to healthcare delivery, including digital health, for cost-effective healthcare solutions On the occasion,\nrepresentatives of WHO, UNDP, USAID, UNICEF and other health development partners enlightened the importance of digitalization in health sector and hope that the digital health framework would become an invaluable tool to assist with joint planning and support for strengthening Pakistan’s health system.\nThe outcome of the dissemination meeting is to strengthen coordination with provinces and federating areas for implementation of framework. The workshop was attended by representatives from federal and provincial health departments (focal points, IT specialists),\nfederal and provincial line departments (IT, P&D, finance, food and agriculture, education, interior, fisheries and livestock), UN agencies, health development partners, academicians, researchers and other stakeholders.",
  "retrievedAt": "2025-08-11T21:33:34.162Z"
}
