{
  "title": "98 new dengue cases reported in federal capital",
  "link": "https://www.app.com.pk/national/98-new-dengue-cases-reported-in-federal-capital/",
  "date_published": "2022-10-21T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Dengue cases are on the rise in the federal capital, as 98 new dengue cases were reported in the federal capital during the last 24 hours.\nAccording to District Health Officer Islamabad Zaeem Zia, the figure of confirmed dengue patients had reached 4,185 so far in this season.\nHe said that during last 24 hours, 53 cases were reported in rural areas of the federal capital with total of 2,422 cases while 45 cases were reported in urban areas with total of 1,773 cases.\n“31 cases have been reported from PIMS and several measures have been taken to contain the disease,” said the Director, Pakistan Institute of Medical Sciences (PIMS), Dr Khalid Masood.\nCommenting on the current dengue situation at PIMS, he said several dengue patients were still receiving treatment at the hospitals. He added around 10 patients were discharged daily on improving their condition.\n“On a daily basis, dengue cases are being admitted to PIMS from far-flung areas that resulted in increasing the burden on the PIMS administration,” he said adding, “We are providing all possible medical care to all patients.”\nHe said that as the number of cases was continuously increasing, the PIMS hospital had decided to allocate three more wards for the dengue patients, and for this purpose 120 beds were being arranged to handle the burden of dengue patients on the hospital, he added.\nHe asked the people to take extra care during this high-risk dengue season, particularly at the time of sunrise and sunset as the mosquitoes were more active during these hours.\nMoreover, people should wear full sleeve clothes and they should be careful while walking in the morning and evening, he added.\nMeanwhile, keeping in view of dengue cases increasing constantly, Minister for National Health Services, Regulations and Coordination, Abdul Qadir Patel directed the health officials to look up the matter of the increasing number of dengue patients and prepare a comprehensive plan in that regard.\nHe also directed the Drug Regular Authority of Pakistan (DRAP) Islamabad team to take action against those laboratories which were charging high rates of dengue tests in the federal capital and take action against those pharmacies which were involved in the storage of Paracetamol.\nHe also asked the civic bodies to undertake frequent fogging in vulnerable areas.\nHe appealed to the citizens to adhere to the directions to check stagnant water and directed the health staff to ensure observe the SOPs to avoid from the disease.\nHe said that information, education and communication activities had been planned in which health workers would visit vulnerable areas to create awareness about checking stagnant water, which became a breeding ground for mosquitoes.",
  "retrievedAt": "2025-08-11T15:46:26.264Z"
}
