{
  "title": "KS-relief extends relief assistance for flood victims",
  "link": "https://www.app.com.pk/national/ks-relief-extends-relief-assistance-for-flood-victims/",
  "date_published": "2022-10-21T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): The King Salman Humanitarian Aid and Relief Center (KSrelief) continued its relief activities in Pakistan and distributed relief goods in flood-hit areas.\nTo help the affected people cope with the devastation, Saudi Arabia’s KSrelief has been busy providing emergency relief assistance in the flood-hit areas of Pakistan.\nKSrelief extends different land operations, including the provision and distribution of (50,000 Food Packages), (50,000 Mosquito Nets) and (5,000 Tents). These items were procured from Pakistan for humanitarian distribution in flood-affected areas across Pakistan to meet the basic needs of the affected people in those areas, said a press release issued by Saudi Arabia Embassy on Friday.\nThese 50,000-food packages comprise all necessary essential food items, each package weighing 62 kg, 40 kg of flour, 5 Liters of cooking oil, 5 kg of Sugar, 5 kg of Rice, 5 kg of yellow split pea (Daal Chana), 2 kg of dates and a packet of energy biscuits for children]. These food packages are sufficient for the family for a whole month. The distribution process of these packages is in full swing and will complete soon, it added.\nDue to the critical situation and dire need for tents, KSrelief also provides 5000 tents for temporary accommodation. The 50,000 Mosquito Nets will help protect them from mosquitos in flooding. Apart from this, 25,000 more NFI kits and 25,000 winter relief kits weighing approximately 3965 tons; 610 trucks will be distributed in all the affected areas across Pakistan. 732,500 Individuals will benefit from this emergency ground relief assistance.\nA total of (4385) tons of relief goods have been distributed so far by KSrelief, and more than 785,636 people will benefit from this emergency relief assistance.\nIt is important to mention that in September, Saudi Arabia established an air bridge to deliver relief goods to Pakistan. At least (10) ten planes carrying Saudi humanitarian aid (2952 Food Boxes, 972 NFI kits, 660 Tents, 1682 boxes of date, 3192 small blankets, and 5040 large blankets) weighted 420 tons have arrived in Pakistan and handed over to National Disaster Management Authority (NDMA) in Karachi for onward distribution among the needy people living in different affected regions across Pakistan. 53,136 Individuals will benefit from this emergency relief assistance.",
  "retrievedAt": "2025-08-11T15:46:17.082Z"
}
