{
  "title": "FATF puts Pakistan on white list: Hina Khar",
  "link": "https://www.app.com.pk/national/fatf-puts-pakistan-in-white-list-hina-khar/",
  "date_published": "2022-10-21T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar Friday said Financial Action Task Force (FATF) has removed Pakistan from the grey list, acknowledging the country’s significant progress in improving anti-money laundering and countering the financing of terrorism regime.\nIn a press briefing here, she said “I am pleased to announce that as a result of our sustained efforts during the last four years, acknowledgment of our unwavering political commitment and the successful on-site visit, FATF has fully recognized completion of all substantive, technical as well as procedural requirements of Pakistan’s 2018 and 2021 Action Plans.”\n“Consequently, FATF has unanimously decided to remove Pakistan from the ‘list of jurisdictions under increased monitoring. In simpler terms, Pakistan has been whitelisted by FATF. FATF has already issued a formal public statement announcing this decision.”\n“It has been recognized that Pakistan has strengthened the effectiveness of its AML/CFT regime and addressed technical deficiencies and commitments of its Action Plans comprising total 34 action items. Pakistan has addressed all strategic deficiencies that FATF identified in June 2018 and June 2021,” she noted.\nHina Khar said Pakistan completed the 2021 action plan in advance of the deadlines.“Pakistan is no longer subject to the FATF’s increased monitoring process, which means, Pakistan has been whitelisted by FATF.”“To advance and promote international cooperation, Pakistan will continue to work with APG to further improve its AML/CFT system,” she added.\n“This truly is a result of whole-of-country efforts and demonstration of our resolve to improve our domestic systems to counter money laundering and financing of terrorism and bring them at par with the international standards. This would not have been possible without complete national consensus across the political spectrum.”\nThe minister said during the last four years, Pakistan had undertaken broad-based and comprehensive legal, administrative and procedural reforms to improve all aspects of our domestic AML/CFT regime.\n“This includes amending laws related to anti-money laundering and countering the financing of terrorism. We also increased synergy in the system, streamlined the processes, improved inter-agency coordination, enhanced international cooperation with other jurisdictions and organizations, instituted supervisory structures, created necessary administrative protocols, and allocated sufficient financial and human resources to improve our compliance with the FATF recommendations.”\nShe appreciated the tireless and dedicated efforts of the national FATF team which had done a tremendous job during the last four years to meet all FATF targets.\nMultiple departments and agencies, both at the federal and the provincial levels, had contributed to this national cause, she continued.\n“We must now become a role model for the world. I have already directed my team to start exploring ways in which we can enhance our cooperation and partnership with FATF and the wider international community, especially on the issue of Anti Money Laundering and Countering Financing of Terrorism (AML/CFT).”\n“This is also a part of our wider focus on economic diplomacy. As you are all aware, economic diplomacy features very high on our agenda,” she stressed.\nTogether with other initiatives taken by the government to attract foreign investment and promote ease of doing business, Pakistan’s whitelisting will usher in a new era of economic growth and activity, she added.",
  "retrievedAt": "2025-08-11T15:46:08.061Z"
}
