{
  "title": "President for accelerating efforts to improve Pak-Japan relations",
  "link": "https://www.app.com.pk/national/president-for-accelerating-efforts-to-improve-pak-japan-relations/",
  "date_published": "2022-10-21T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): President Dr Arif Alvi on Friday stressed the need to accelerate efforts to further improve the existing bilateral relations between Pakistan and Japan, particularly focusing on economic, business ties and human resource development initiatives.\nThe president said these remarks while talking to Pakistan’s Ambassador-designate to Japan, Raza Bashir Tarar, who called on him, at Aiwan-e-Sadr.\nThe president appreciated Japan’s continuous support to Pakistan on the Financial Action Task Force (FATF) platform and ask the envoy to convey his gratitude to the Government of Japan for its decision to suspend debt repayments due from Pakistan under the Debt Service Suspension Initiative.\nHe said that bilateral trade between the two countries stood at around US$ 2.56 billion, which needed to be improved with a greater focus on exports of Pakistani goods and products to Japan.\nWhile appreciating the development cooperation of the Japan International Cooperation Agency (JICA) with Pakistan, he directed the Ambassador-designate to make efforts to take the bilateral relationship to a new and higher level of cooperation.\nHe said that the avenues should be explored for creating cooperation between Japanese educational institutions and industry for the provision of services of Pakistani IT human resources online to Japan and seeking Japanese assistance for online training to our human resources in the fields of IT, digital technologies, artificial intelligence and other skills, which are needed by the industrial sector of Japan.\nThe president also highlighted that Japan was very important for Pakistan as it had made valuable contributions in supporting development efforts over the years and had become the second largest partner of Pakistan by extending accumulated support of around US$13 billion for the social and economic uplift of Pakistan throughout the year.\nHe stressed the need to work on reducing the Japanese tariff to bring Pakistani products at par with its competitors enjoying duty-free access to Japanese markets, especially in the textile sector.\nThe president asked the ambassador-designate to sensitize the leadership of their host country on the urgency to resolve the Kashmir dispute as per various Resolutions of the UN Security Council and also on the increasing trend of marginalizing the minorities in India and Islamophobia, which had put the lives and livelihoods of the minorities, especially the Muslims under great stress.",
  "retrievedAt": "2025-08-11T15:46:19.987Z"
}
