{
  "title": "ECP verdict exposes Imran’s real face, corrupt practices: Rana Sana",
  "link": "https://www.app.com.pk/national/ecp-verdict-exposes-imrans-real-face-corrupt-practices-rana-sana/",
  "date_published": "2022-10-21T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Minister for Interior Rana Sanaullah on Friday said PTI Chairman Imran Khan had sold the state gifts as proved by the verdict of Election Commission of Pakistan (ECP), which also exposed his real face as well as corrupt practices.\nAddressing a press conference here, the minister welcomed the ECP’s verdict disqualifying the PTI leader in the Toshakhana reference, and asked all the parliamentarians and organizations of the Pakistan Muslim League-Nawaz to hold peaceful gatherings in their respective areas for expressing solidarity with the Election Commission.\nRana Sanaullah said the ECP members had made a commendable decision by throwing Imran Khan out of the national politics due to his “corrupt practices”. The PTI leader, who used to call all his political opponents ‘thieves’, was declared a “certified and verified thief”.\nHe was such a petty little thief who even did not spare the state gifts, he added.\nThe minister said only a few number of people came out to protest Imran Khan’s disqualification, fully exposing his self-proclaimed popularity among the public. “I have reports from the Intelligence Bureau (IB) and other intelligence agencies that hardly 40-50 people have gathered at any spot anywhere in the country.”\nHe asked the Punjab Chief Secretary, Inspector General of Police and the provincial police to obey the state orders  instead of paying heed to those of the supporters of a “guilty person”. All the law enforcement agencies, especially Punjab and Khyber Pakhtunkhwa police, should stand by the state and not to become minions of Imran Khan and his cronies, he added.\nRana Sana said Imran Khan was pursuing a “foreign anti-state agenda”. The nation should now recognize “this fraud”, and every individual and all institution should play their due role in “nipping this evil”.\nThe foreign funding case, audio leaks and now the Toshakhana reference had all exposed the PTI chairman, he added.\nThe minister warned the “gang of agitators” not to create a law and order situation in the country. “The ECP has given its  decision on merit and it will stay as you have been caught red-handed.”\nHe said Imran Khan’s ‘fake narratives’ would smash down in the general election, which would be held after completion of the constitutional tenure by the current government.\nThe minister said Imran Khan even misguided students in his addresses at educational institutions, but the verdict had revealed his real face to the nation.\nResponding to a question, the minister said a criminal case would be registered against Imran Khan, who might also file appeal in the court as per the law and the constitution.\nHe said Muhammad Nawaz Sharif had never called any one `thief’ in his political career, but Imran Khan had been using derogatory language against all his opponents.\nThe minister said the Ehsaas Programme was used for election related activities and the money was distributed among 20,000 families in Faisalabad.\nTo another question, the minister said Prime Minister Shehbaz Sharif was a committed and honest person, who believed in merit. As per the oath taken as prime minister, he was bound to make any appointment as per law, rules and the set procedure. Any decision regarding the important appointments would be made as per oath, he added.\nThe minister said PML-N leader Muhammad Nawaz Sharif would lead the campaign for the next general election if he had no health issue, as the party had requested him for the same.",
  "retrievedAt": "2025-08-11T15:46:08.080Z"
}
