{
  "title": "IHC seeks details of FIRs against PTI lawmakers",
  "link": "https://www.app.com.pk/national/ihc-seeks-details-of-firs-against-pti-lawmakers/",
  "date_published": "2022-10-21T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): The Islamabad High Court (IHC) on Friday sought details of all FIRs registered across the country against PTI’s MNAs including Chaudhry Fawad Hussain with regard to Saudi Arabia incident.\nChief Justice Athar Minallah heard the case regarding the above matter. PTI’s lawyer Faisal Chaudhry Advocate adopted the stance that any arrested member of Parliament would have permission to attend the assembly session.\nSher Afzal Murawat Advocate said that no Parliamentarian could be arrested without the permission of the Speaker National Assembly.\nThe Chief Justice remarked that these are very appropriate rules. After the amendments in the rules now no constituency would be left without the representation in the House, he said.\nThe court said that it was expecting that the rules would be implemented in letter and spirit. The Chief Justice inquired that how the federal government could stop the practice of registration of cases on political grounds.\nJustice Athar Minallah observed that allegations of disrespecting religion were leveled against Mir Shakil ur Rehman and cases were also registered against him. Similarly, how many cases were registered against MNA Ali Wazir, he asked and remarked that the Parliamentarians should raise voice against this practice.\nThe Chief Justice inquired from the Secretary Interior that why the details of FIRs against lawmakers couldn’t be produced yet. He remarked that the petitioners were MNAs until acceptance of their resignations.\nAdditional Attorney General Munwar Dogal said that KPK and Punjab provinces wouldn’t ask from the federation if they registered an FIR. It would be appropriate if the matter was discussed in the Parliament, he said.\nSecretary Interior assured the court that the details of the FIR would be produced on next hearing. After this, further hearing of the case was adjourned for two weeks.",
  "retrievedAt": "2025-08-11T15:46:13.864Z"
}
