{
  "title": "Pakistan to participate in upcoming film festival of Turkiye: Marriyum",
  "link": "https://www.app.com.pk/national/pakistani-movies-to-be-screened-at-turkiyes-film-festival-marriyum/",
  "date_published": "2022-10-21T10:50:00.000Z",
  "source": "APP",
  "content": "ISTANBUL, Oct 21 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb announced on Friday that Pakistan would participate in the upcoming film festival of Turkiye to showcase its best talent in the film industry.\nShe made the announcement in a meeting with a delegation of the Turkish film industry.\nThe minister was informed that the date of the film festival would be decided in a meeting being held next week in Turkiye in that regard.\nMarriyum said three new Pakistani movies could be screened at the film festival.\nDuring the meeting, both sides agreed to promote bilateral cooperation in the drama and film industry, and setting up a film processing lab in Pakistan on modern lines.\nThe Turkish film industry representatives said the best companies of the Netherlands and France based in their country could provide technical support in establishing the film processing lab in Pakistan.\nThe delegation showed interest in launching joint projects with Pakistan in the film and drama industry.\nThe information minister said a feasibility report would be prepared for joint ventures between the two countries in the film industry.\nShe said cooperation of the Turkish universities would be sought for inclusion of film making subjects in the academic curriculum.\nShe informed the delegation that Pakistan was the world’s third largest film producer in 1970.\nMarriyum said her government had formulated the country’s first-ever film and culture policy, which included tax exemptions and incentives for the industry.\nUp to 70 per cent tax concession had been given for facilitating the production of new films, she added.\nShe said the use of modern technology was made part of the national film policy to improve production quality and stories.\nThe minister said steps were taken to give incentives to the artists and revive cinema culture in Pakistan by setting up new cinemas and rehabilitating the old ones. It was the best time to involve 70 per cent of the youth in the film and tourism industries.\nShe said the government would invite renowned producers in the international film workshops being arranged in the country for the youth.\nThe film and drama, she said, played an important role in improving the image of a country at international level.\nMarriyum said the Turkish filmmakers could produce their movies in northern areas of Pakistan, which were rich in natural beauty.",
  "retrievedAt": "2025-08-11T15:46:21.655Z"
}
