{
  "title": "National Transportation Policy needs revision amid post Covid-19, floods scenarios: Farzana",
  "link": "https://www.app.com.pk/national/national-transportation-policy-needs-revision-amid-post-covid-19-floods-scenarios-farzana/",
  "date_published": "2022-10-21T18:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP):Director General Pakistan Environmental Protection Agency (Pak-EPA) Farzana Altaf Shah on Friday said the National Transportation Policy 2018 needed to be revised as the situation post-Covid-19 pandemic and recent massive floods had incurred many drastic impacts on mobility infrastructure.\nAddressing a stakeholder dialogue as chief guest on National Transportation Policy 2018 and it’s implementation held under the auspices of the Institute of Urbanism (IoU) and Heinrich Boll Stiftung, the environmental watchdog chief said the policy had become four years old document that lacked identification of key indicators emerged after recurrent natural calamities and pandemic in mega urban centres through out the country.\nShah said the revision of the national policy document would help address the neglected issues as thousand of kilometers roads network and raily routes alongwith other transportation infrastructure got damaged due to massive torrential rain flood.\nCommenting on the urban mobility and transportation in the perspective of the Federal Capital, she said the metropolis was the uniquest city in the world that was established under proper planning keeping in view its strange topography.\nThe Capital was a strategically and geographically well planned city that was linked to three provinces namelyKhyber Pakhtunkhwa (KP), Punjab and Azad Jammu and Kashmir (AJK), adding, “It is the only capital with a leopard preserve zone next to it which is no where in the world. You can enjoy river sides, mountains and uniqueness of the city at every corner of Islamabad.”\nThe EPA DG added that she was made custodian of environment of this city and was trying her best to serve the purpose. “We need every stakeholder to support government endeavours to protect the environment as it is a subject that equally impacts everyone due to a minor change or damage to its natural existence.”\nHowever, while counting on the positive aspects of Islamabad, she said the proper master plan and phased development of the city was a blessing for the regulators. “Capital has the best road network enabling access to ambulance at citizens doorsteps in its each sector.”\nShah added that the Federal Capital still could not get proper transport management system. There were huge development projects underway in the city which was all futile without proper transportation system, the EPA DG said.She underlined that the highest increase in vehicular traffic was 4.79% per year in the Federal Capital whereas the road network, rising increase in traffic and environment management was becoming challenging for the agency.\nShe ended that a dedicated Islamabad Transport Authority was the only solution to control increasing flow of traffic in the Capital as the load of traffic on Capital’s roads was augmenting manifold per day.\nSenior Programme Fellow, IoU Dr Ejaz Ahmed in his welcome remarks briefed the participants on the Institute. He informed that it was a think tank working on urban mobility and environmental issues with core focus on transportation as a major sector. The IoU held various dialogues with stakeholders including journalists, policy makers and quarters concerned that discussed mobility patterns with growing population where the focus was general public and media.\nProgramme Coordinator, IoU Ayesha Majid delivered a detailed presentation on the National Transportation Policy 2018 and a general overview of the sector. “Transportation sector accounts for 22.3 % of the services sector GDP. The transport sector currently contributes a quarter of Pakistan’s greenhouse gas emissions.”\nShe also mentioned the outcomes of a survey conducted at three sites of PWD, G-12 and Bhara Kahu where 97% of the respondents believed transportation as cause of air pollution and 83% were willing to shift over safe transportation.\nProf Dr Kamran Ahmad of the National University of Science and Technology (NUST) briefed the participants on barriers for integrated transportation system and sustainable urban transport system.\nHe noted that non-data driven approach, lack of planning, importance realization, resources and priorities were key potential indicators to be focussed for a successful sustainable transportation system.\nCapital Development Authority (CDA) Transportation and Planning Specialist, Muhammad Qasim presented his quick views on the present mass transit services operating in the Capital and their role in catering public demands of safe mobility.\nAssistant Professor, NUST Malik Saqib Mahmood in concluding remarks said that there were thousand of people were killed every year in road accidents that demanded the city administrators and regulators to focus road safety. “An individual getting injured and treated after road accident costs Rs one million to the government and it can be mitigated through efficient road and traffic management system. The National Transportation Policy should have a separate component on road and safety and implementation mechanism to make the transport safer.”\nFounding Executive Director, IoU Mome Saleem in her vote of thanks extended her gratitude to the participants including the online attendees for participating in the dialogue and vowed to continue the efforts of the Institute to educate the masses and policy makers for sustainable transport and mobility.",
  "retrievedAt": "2025-08-11T15:46:29.034Z"
}
