{
  "title": "Seerah of Prophet (PBUH) presents solution to all challenges of Muslim Ummah: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/seerah-of-prophet-pbuh-presents-solution-to-all-challenges-of-muslim-ummah-ahsan-iqbal/",
  "date_published": "2022-10-21T18:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP):The way of life of Holy Prophet (PBUH) is as relevant to resolving the contemporary challenges of the Muslim world as it was over 1400 years ago.\nThis was stated by Federal Minister for Planning Development & Special Initiatives Ahsan Iqbal while addressing Seerat Conference: Contemporary Challenges and the Role of Seerat Chairs held at Higher Education Commission (HEC) here on Friday.\nExecutive Director HEC Dr. Shaista Sohail, Chairman Council of Islamic Ideology (CII) Dr. Qibla Ayaz, Director General Dawah Academy Dr. Muhammad Ilyas, and Associate Professor Dr. Ayesha Rafique graced the occasion with their presence.\nThe conference was also attended by a large number of Vice Chancellors, faculty members, and students from the higher education institutions located in Islamabad/Rawalpindi.\nAhsan Iqbal shed light on the concept of establishing nine Seerat Chairs on themes, including interfaith and communal harmony, education and knowledge, social justice and welfare, human rights and social justice, leadership and governance, sustainable development, business commerce and property rights, global peace and gender studies, and rights of women.\nHe underlined the important role of Seerat Chairs in finding solutions in the Seerah of Holy Prophet Muhammad (PBUH) to the challenges facing the Islamic world. He said that remembrance of Holy Prophet ? and his teachings is the best utilisation of time, adding that the Prophet (PBUH) is a role model for the Muslims in all spheres of national and individual lives.\nThe minister said that no development can ever be made without peace and peace is not possible without interfaith harmony. He said that the Holy Prophet (PBUH) demonstrated the qualities of great leadership, adding the attractiveness of his message of social justice paved the way for a wide acceptance of Islam in the world.\nHe emphasized the need for a renaissance of the legacy of knowledge across the Muslim world, as education and knowledge are pivotal for real development and prosperity of the entire Ummah. He also highlighted the importance of good governance, protection of human rights, business, commerce and property rights, women rights, and sustainable development.\nChairman Council of Islamic Ideology (CII) Dr. Qibla Ayaz delivered a detailed address on the role of ulema and religious scholars in promoting religious harmony. He said the teachings of Holy Prophet (PBUH) are the beacon of guidance to address religious and sectarian challenges. He hoped that the Seerat Chairs will fulfill the expectations associated with them in letter and spirit. He said that Islam discourages any discrimination based on religion and religious freedom is an Islamic value that needs to be protected.\nIn her welcome address earlier, Executive Director HEC Dr. Shaista Sohail said that the objective of the conference is to shed light on various aspects of the life of the Holy Prophet (PBUH) and sort out solutions to the emerging issues. She also shared her viewpoint on the role of Seerat Chairs in promoting the true Prophetic teachings and action upon them.",
  "retrievedAt": "2025-08-11T15:46:29.689Z"
}
