{
  "title": "PM started journey to build new Pakistan 25 years ago: Ministers",
  "link": "https://www.app.com.pk/national/pm-started-journey-to-build-new-pakistan-25-years-ago-ministers/",
  "date_published": "2021-04-25T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP):Federal Minister forEducation and Professional Training Shafqat Mehmood on Sunday said 25 years ago Prime Minister Imran Khan started the long journey to make the country free from corruption and build a new Pakistan.\nTalking to PTV on the occasion of foundation day of PTI, he said PM Imran Khan is a visionary brave sincere and honest leader of the country as he had full capabilities to bring out the country from different challenges with amicably.\nThe minister said his (PM) vision and determination is beginning to bear fruit, adding he had moved the country on the path of development and progress.\nShafqat Mehmood said He had broken two party system in the country and defeated two major political party including the Pakistan Muslim League Nawaz and Pakistan peoples party in the general elections of 2018.\nThe prime minister laid foundation of the Pakistan Tehreek-e-Insaf (PTI) 25 years ago and it had become in to power with slogan of change, he added.\nHe said PM Imran Khan is fully committed to eradicate corruption from all over the country as he is working for the purpose, adding he is the only political leader of Pakistan who wants to make the country according to dream of Allama Iqbal and vision of Quaid-e-Azam.\nMinister for Planing, Development and special initiatives Asad Umar said that Prime Minister Imran Khan is the most popular leader among the people who is making struggle to bring change in the country for a long time.\nHe said PM had made the Pakistan Tehreek-e-Insaf federation level political party and other political parties had shrunk regional level.\nAsad Umar said all national challenges would be addressed under the dynamic, visionary, honest and sincere leadership of PM Imran Khan.\nSpeaker national Assembly Asad Qaiser said PM Imran Khan is honest leader who is making efforts to resolve all national issues with amicably and he is trying to fulfill public desires.\nHe said he (PM) is not a traditional politician as he had changed traditional politics in the country, adding difficult time has ended and visible improvement would be witnessed in days to come.\nHe said coronavirus is big challenge for the government but it would be controlled with comprehensive policy and help of people, adding people must be fallowed standard operating procedures to control the pandemic form spreading at large scale in the country.\nHe said PM Imran Khan is the name of determination when he make commitment to do something than he must complete that task and objective.",
  "retrievedAt": "2025-08-11T20:39:29.108Z"
}
