{
  "title": "Pak-Saudi collaboration for replicating 10BTTP in KSA to open opportunities: Amin",
  "link": "https://www.app.com.pk/national/pak-saudi-collaboration-for-replicating-10bttp-in-ksa-to-open-opportunities-amin/",
  "date_published": "2021-04-25T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam has said Kingdom of Saudi Arabia and Pakistan’s collaboration for replicating 10 Billion Tree Tsunami Plantation (BTTP) project in the desert country would bring huge economic opportunities for local masses.\nThe SAPM made these remarks in an exclusive interview with APP here after his meeting with Saudi Ambassador Nawaf Bin Saeed Al-Maliki.\nAmin said the Saudi envoy conveyed Crown Prince of KSA Mohammed Bin Salman’s warm greetings for Prime Minister Imran Khan and extended his gratitude for the latter’s green initiatives outreach to Kingdom of Saudi Arabia (KSA).\nHe said the Saudi government had given a positive response to Prime Minister Imran Khan’s green initiatives outreach and sent its draft framework within a week for developing five years collaboration to replicate 10 Billion Tree Tsunami Plantation project in KSA.\nThe SAPM informed that the draft framework would be presented before the federal cabinet for the final go-ahead to kick start the initiative.\nAmin Aslam hoped that the collaboration would not only strengthen brotherly ties between the two countries rather generate huge economic opportunities for Pakistanis.\nHe said 10 Billion Tree Tsunami Plantation was globally recognised and praised project that became Pakistan’s identity which would now be adopted by KSA.\n“We are very much honoured to receive the offer for signing agreement with the Saudi government for extending bilateral brotherly ties in the forestry, environment, ecosystem restoration, renewable energy, water conservation and rainwater harvesting,” said Malik Amin Aslam.\nExplaining about the Saudi government’s offer, the PM’s aide said that the the Saudi envoy conveyed that the Saudi government was also interested to work with the climate change ministry particularly in areas of Pakistan’s recently launched Olive Tree Tsunami Initiative and National Agriculture Programme under 10 Billion Tree Tsunami Plantation project and intended to replicate the initiatives in Saudi Arabia’s various areas.",
  "retrievedAt": "2025-08-11T20:39:32.940Z"
}
