{
  "title": "Azerbaijan to start direct flight operation with Pakistan once pandemic slows down: Ambassador Alizada",
  "link": "https://www.app.com.pk/national/azerbaijan-to-start-direct-flight-operation-with-pakistan-once-pandemic-slows-down-ambassador-alizada/",
  "date_published": "2021-04-25T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Ambassador of the Republic of Azerbaijan Ali Alizada has said that his country will start direct flights operation with Pakistan soon after the slowdown of Covid-19 which will yield positive impacts on economic and trade activities of both the countries.\nHis country was always interested in developing regional connectivity, transportation linkages, he said in an exclusive interview with APP.\nAt present the two countries have no direct air link. Their air link is established through Turkish Airlines, which was allowed to operate flights from Istanbul to Lahore/Islamabad through Baku.\nThey had signed the Draft Air Services Agreement (ASA) in 1993, and a memorandum of understanding on September 30, 2009, while a codeshare was agreement inked by their national air carriers in January 2020. According to reports, more than 40,000 Pakistani citizens visited Azerbaijan in 2019 and this number is likely to continue to grow once the ongoing COVID-19 pandemic subsided and international travel restrictions are lifted.\nAmbassador Alizada said defence and military cooperation was one of the main and leading components of the bilateral relations of two brotherly countries.\nHe said keeping in view the regional political and geographical situation, Azerbaijan gave topmost priority to its security, and considered the military and defence cooperation (with the brotherly states) vital to ensure and protect its sovereignty.\nPakistan and Azerbaijan, he said, had developed their strong defence cooperation in different spheres such as military training , military-technical and military-educational and others. The two countries still needed to intensify more efforts in the area, he stressed.\n“Our armed forces are working closely on mutually sharing experience on annual basis. The servicemen and officers from both sides take part in different courses and trainings organized in our respective countries. Every year we organize several high level exchanges of military leadership and officials mutually.”\nAs regards the trilateral military format, Ambassador Alizada said ,”We have a very good understanding in the trilateral format, when it comes to the armed forces of Azerbaijan, Pakistan and Turkey.”\nBesides conducting joint bilateral military exercises with Pakistan, the trilateral military exercises with the involvement of various types of troops of Azerbaijan, Pakistan and Turkey were under consideration, which would hopefully take place during the current year, he added.\nThe defence and military cooperation among three countries, he said, was because of their high level strategic partnership. ” I am sure it will be further strengthened in the years ahead.”\nAbout the coronavirus situation, Ambassador Alizada viewed that the the COVID-19 pandemic had bad badly impacted the global economy and business activities. It had also caused some slowdown in trade activities between Pakistan and Azerbaijan. Once the coronavirus issue settled down, he said, “I am sure our bilateral trade will also get boosted.”\nAbout the visit of Azeri Foreign Minister Jeyhun Bayramov visit to Pakistan eralier in the year, the ambassador said the visit had strengthened the relationships between the two countries.\nThe foreign ministers of both countries, he said, agreed to further boost the cooperation in diverse fields, including political, strategic, trade, economic, energy, defence, peace and security, humanitarian, science and technology, cultural and people-to-people contacts, as well as continue to support each other on all issues involving their national interests.\nHe said a trilateral meeting of the foreign ministers of Azerbaijan, Pakistan and Turkey was held on the occasion, which concluded by the signing of Islamabad Declaration that “the three countries desired of further deepening cooperation in all areas of mutual interest.”\n“Both, the bilateral meetings and the trilateral meeting already lasted a positive impacts to our relations and will continue to further boost cooperation,” he remarked.\nAs regards Pakistan’s role on the Nagorno-Karabakh issue, Ambassador Alizada said the people of both countries enjoyed excellent relations based on bonds of brotherhood, shared history, culture, mutual respect and trust, but after Pakistan’s clear stance in the favour of Azerbaijan regarding the Armenian occupation made more respect in the hearts of the Azerbaijanis.\nBoth the countries, he said, now had reached a strategic partnership at political level that would help reduce the trade and economic gap of two nations.\nHe said, “We are now focused on promoting trade relations that will yield highly beneficial results for the economies of both the countries.”\nTo a query, the ambassador said the situation in liberated territories of Azerbaijan was stable and under control because of Azerbaijani Armed Forces and Azeri authorities.\n“As we are aware during the three decades of Armenian occupation, the Armenian invaders have committed genocide, massacres and war-crimes not only against the Azerbaijani nation but they also subjected the occupied territories to environmental, cultural terrorism.\nOver the decades, Azerbaijani cultural monuments, artifacts in the occupied territories have been systematically vandalized, misappropriated and destroyed. They occupiers cut and burned the trees and forests. The cities and villages were razed to the ground. The cemeteries, sacred sites, mosques were demolished.”\nHe said Azeri President Ilham Heydar oglu Aliyev had already approved a proposal and signed a document regarding the restoration and renovation of infrastructure and development of the liberated regions. “The liberated territories are now entering a new era marked by reconstruction and infrastructure works; that will reshape the outlook of the region and will bring back the peace and stability.”\nPakistan’s Frontier Works Organization, he said, was considering to extend its support in the de-mining process of liberated territories.\nThe envoy said attractive environment and business policies had been introduced by the Azerbaijani government for investors (both domestic and foreign). The Azeri government and nation had always appreciated and valued Pakistan’s stance on the position of Azerbaijan. ” We will be pleased to see Pakistani companies stepping in to the reconstruction and rehabilitation process. the priority will be given to the companies of friendly and brotherly countries.”\nAs regards the Indian Illegal Occupied Jammu & Kashmir (IIOJK), he said, ” We understand the consequences of the conflicts well” as his country had enormously suffered from the Armenian aggression and occupation for almost three decades.\nAs a member of the several international organizations and Organisation Islamic Cooperation Contact Group on Jammu and Kashmir, Azerbaijan constantly made all efforts for the resolution of Kashmir dispute, he added.\nHe said the principal position of Azerbaijan on Kashmir issue was clear. His country had always supported the principle and legitimate position of Pakistan on the Kashmir issue in accordance with the relevant United Nations Security Council resolutions and supported its peaceful resolution.\nHe said unfortunately, the Kashmir issue had been lingering for more than seven decades. “We believe that with the support and efforts by international community this conflict will be resolved amicably soon, through mutual dialogue and understanding.”",
  "retrievedAt": "2025-08-11T20:39:34.863Z"
}
