{
  "title": "High commissioner urges Canadian government to reconsider suspension of flights from Pakistan",
  "link": "https://www.app.com.pk/national/high-commissioner-urges-canadian-government-to-reconsider-suspension-of-flights-from-pakistan/",
  "date_published": "2021-04-25T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP):Pakistan High Commissioner to Canada Raza Bashir Tarar has written to the Canadian government to reconsider its decision of suspending all passenger flights from Pakistan for 30 days in view of it being disproportionate to the actual Covid-related problem in the country.\nIn a letter addressed to Omar Alghabra, Minister of Transport, Government of Canada, Tarar drew the attention of the minister to the fact that Pakistan, like all other countries, had been facing the epidemic but it had managed it well due to its strategy of smart lockdowns, keeping with this, Pakistan’s Covid related positive cases were 5,870 yesterday but in the Canadian announcement for Pakistan was bracketed with a country that had recorded 332,503 cases on the same day, a news release issued on Sunday said.\nThe High Commissioner noted that there had been no new variant of COVID-19 developed in Pakistan and yet the Canadian media had quoted Health Minister Patty Hajdu as having said “1.8 per cent cases detected so far are in travellers, but that eliminating direct travels from both India and Pakistan is intended to give health officials time to sequence and better understand the variant first detected in India”.\nTarar said the decision of suspending passenger flights from Pakistan betrayed a lack of understanding of the dynamics in South Asia as, “it ignores the fact that both trains and flights are not operational between the two countries … so the ban on flights from Pakistan because a new variant has developed in another country whose population has no possibility of contact with Pakistan, defies logic”.\nHe also called for seeing the positive test results of passengers after arriving in Canada in the context of their interaction in the society during the 72 hours before taking the flight. He assured the minister that Pakistan’s testing mechanism was very robust and Pakistan International Airlines only accepted results from the best and well-reputed laboratories and matches them with the barcode on every result sheet.\nIn view of all this, the Canadian government should reconsider its decision and restart the passenger flights from Pakistan at the earliest, the letter concluded.",
  "retrievedAt": "2025-08-11T20:39:31.659Z"
}
