{
  "title": "Mohmand dam: a way forward to enhance country’s water storage capacity, mitigate floods",
  "link": "https://www.app.com.pk/national/mohmand-dam-a-way-forward-to-enhance-countrys-water-storage-capacity-mitigate-floods/",
  "date_published": "2021-04-25T07:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): As the phenomenon of climate change gradually sprawls its pinching effects upon Pakistan, the race for construction of new water reservoirs gets tough one with each tick of the clock.\nThe only way forward to thwart flash floods in monsoon season in entire Peshawar valley can be carved out by having a new reservoir with ample storage for power generation, irrigation and other purposes.\nAccording to former WAPDA chairman Shams ul Mulk, around 29 million acre feet (MAF) water is being wasted every year in the country due to poor storage facilities and accumulation of silt in the main water reservoirs of Tarbela and Mangla.\nHe said the wastage of 1MAF water was tantamount to losing of US $ 1 billion.\nAccording to Pakistan Water Gateway, a non-governmental water-research portal “Planning for water resource development and management should be at the heart of the policy and be done in co-ordination with the cross-sector policies and projects such as agriculture, irrigation and industry sectors,” it further suggested.\nCognizant of this issue, the incumbent government led by Prime Minister Imran Khan decided to build much awaited big water reservoirs including Mohmand and Diamer Basha dams from its own resources in order to increase water storage in the country besides ensuring water security.\nMaterializing the decade’s long dream, the incumbent government physically launched work on Mohmad Dam after lapse of 51 years by removing all impediments in way of the project.\nThe decades-delayed Mohmand Dam Hydropower Project has seen light of the day, as Prime Minister Imran Khan performed groundbreaking of the project on May 2, 2019.\nAfter Tarbela Dam, Mohmand Dam is the first mega dam which is started after over five decades. Mohmand Dam is being constructed on River Swat about 5 kilometer upstream of Munda Head Works in tribal Mohmand district of Khyber Pakhtunkhwa (KP).\nThe approved PC-I of the project stands at Rs309.56 billion. An innovative financial plan has been devised for Mohmand Dam Project. Under the plan, WAPAD equity will be Rs79 billion and share of local and foreign commercial loans will be Rs44 billion and Rs72 billion. As many as Rs114 billion (Rs17 Billion annually) will be provided through annual Public Sector Development Programme (PSDP).\nCurrently, construction work on multipurpose Mohmand Dam Hydropower Project has been carrying out day and night. Resultantly, the project is moving ahead with a good pace and WAPDA is confident to complete the project during high flow season in 2025 as per the timelines.\nMohmand Dam is the 5th highest concrete-face-rock-fill Dam (CFRD) in the world.\nThe total priority land has already been acquired with the unprecedented support of the locals, District Administration of Tribal Mohmand district and the provincial KP government and with concerted efforts by WAPDA Land Acquisition and Resettlement officers.\nA sum of over Rs 4.53 billion is being spent on Confidence Building Measures (CBM) in the project area for socioeconomic development of the locals.\nAccording to former Minister for Water Resources, Faisal Vawda physical work has already been started on most awaited decade old mega projects including Mohmand and Diamer Basha dam and Dasu hydropower projects.\nAfter Ayub Khan, the incumbent government launched the mega projects after 54 years, he said.\nHe said Ministry of Water Resources was executing projects worth Rs1.1 trillion and its credit went to the Prime Minister and entire team water resources ministry.\nThe government has earmarked a total of Rs182,963 million for ongoing hydel, other water sector projects and new schemes under Annual Public Sector Development Programme (PSDP) 2020-21.\nOut of total, Rs114,311 million has been specified for various ongoing hydel projects, Rs66,122 million for other ongoing water sector projects and Rs 2,530 million for three new schemes.\nAccording to Chairman WAPDA Gen (Retired) Muzammil Hussain “Mohmand Dam is project of immense importance and it will store 1.2 million acre feet (MAF) of water for irrigation, help mitigate floods in Peshawar, Charsadda and Nowshera and generate 800 mega watt (MW) of green and clean energy.\nHe said access tunnel of Mohmand Dam for swift excavation of Diversion Tunnels has been completed, while construction work is in progress simultaneously on 9 different sites of the project.\nThe project is historic and unique in nature being constructed after the delay of over five decades.\nThe project is scheduled to be completed in five years and eight months. Besides supplementing 160,000 acres of existing land, about 16,700 acres of new land will also be irrigated through Mohmand Dam.\nIn addition, 300 million gallons water per day will also be provided to Peshawar for drinking purpose.\nAnnual benefits of the project have been estimated at Rs51.6 billion.\nThe multipurpose Mohmand Dam Hydropower Project will also phenomenally contribute towards water, food and energy security of Pakistan.\nThe project will also provide as many as 6,100 job opportunities (400 engineers and 5,700 staff/semi-skilled labourers).",
  "retrievedAt": "2025-08-11T20:39:38.077Z"
}
