{
  "title": "COVID-19 claims 83 lives, infects 5,234 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-83-lives-infects-5234-more-people/",
  "date_published": "2021-04-02T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):The national tally on Friday of total active COVID-19 cases recorded 56,347 with 5,234 more people tested positive for the deadly virus and 1,931 people recovered from the disease during the last 24 hours.\nEighty-three corona patients have died during past 24 hours, 76 of whom were under treatment in hospital and seven out of the hospital in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 83 deaths occured during last 24 hours, 26 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 70 percent, Islamabad Capital Territory (ICT) 50 percent, Gujranwala 60 percent and Lahore 67 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Swat 100 percent, Gujranwala 85 percent, Peshawar 87 percent and Gujrat 73 percent.\nAround 421 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 50,170 tests were conducted across the country on Thursday, including 8,913 in Sindh, 23,039 in Punjab, 8,574 in Khyber Pakhtunkhwa (KP), 7,872 in Islamabad Capital Territory (ICT), 590 in Balochistan, 272 in GB, and 910 in AJK.\nAround 607,205 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 678,165 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 12,984, Balochistan 19,610, GB 5,045, ICT 59,401, KP 89,255, Punjab 225,953 and Sindh 265,917.\nAbout 14,613 deaths were recorded in country since the eruption of the contagion. Around 4,504 have perished in Sindh among two of them died in hospital in past 24 hours.\n6,485 in Punjab had died with 58 deaths occured in past 24 hours. 51 of them in the hospital and seven out of hospital. 2,382 in KP where 19 of them died in hospital on Thursday, 572 in ICT, 209 in Balochistan among one of them died in the hospital on Thursday, 103 in GB and 358 in AJK among three of them succumbed to the deadly virus in hospital on Thursday.\nA total of 10,297,544 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 3,993 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:34:50.780Z"
}
