{
  "title": "India’s protesting farmers announce march towards parliament",
  "link": "https://www.app.com.pk/national/indias-protesting-farmers-announce-march-towards-parliament/",
  "date_published": "2021-04-02T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP): The protesting Indian farmers have announced to hold march towards Indian parliament seeking repeal of three new agricultural laws what they believe would devastate their earnings.\nHundreds of thousands of Indian farmers had already held several peaceful strikes and marches across India since last year against Farmers’ Produce Trade and Commerce (Promotion and Facilitation) Act, 2020; the Farmers Empowerment and Protection) Agreement on Price Assurance and Farm Services Act 2020 and the Essential Commodities (Amendment) Act, 2020 passes by the parliament in September last year.\nThe farmers, mainly from Punjab, Haryana and western Uttar Pradesh have been protesting on three borders of Delhi – Tikri, Singhu and Ghazipur – since November last.\nThe leadership of the protesting farmers announced that their movement would pick up speed after May 10 as till then the farmers would remain engaged in harvesting the wheat crop.\nAll India Kisan Sabha (AIKS) general secretary Hannan Mollah said that hundreds of thousands of protesters would march to Parliament in May, Indian news agency ANI reported.\n“Modi Government and Parliament are not listening to the farmers then it is our right to go in front of Parliament and raise our demand and we will decide sometime between the middle in the month of May,” he said.\nPointing out that the march would be peaceful, he said they (farmers) will go to Parliament to express their pain and grief before the citizens.\n“We have decided to organise the program because the movement of farmers has become longer than four months. When the movement has become longer, the protests have to be organised continuously and therefore we have announced that we will encircle Food Corporation of India’s offices on April 5 because the government is planning to abolish the public distribution system,” said Mollah.\nHe said his organisation will “siege Kundli-Manesar-Palwal (KMP) outer ring road for 24 hours” on April 10, and will organise nationwide protests on Baisakhi and May day to raise their demands.\nBharatiya Kisan Union (BKU) spokesperson Rakesh Tikait said the farmers’ movement would pick up speed after May 10, as till then farmers will remain engaged in harvesting wheat crops.\nTikait said the agitation against the Centre’s three new farm laws would have to go on for eight more months as it is a question of their rights and lands.\n“Farmers can harvest their wheat crops till May 10 post which the agitation will pick up speed,” Tikait said.\nDespite several rounds of negotiation and repeated requests by the government, the farmers have remained determined that they would not stop protesting until the Indian government completely rolled back laws. They are also firm on their demand for a legal guarantee for the Minimum Support Price (MSP), Hindustan Times reported.\nSeveral strikes and marches have been staged by farmers across India since last year and the majority of them were peaceful.\nHowever, during their tractor rally on Indian Republic day on January 26, the farmers entered Delhi’s red fort breaking the barriers after the police fired tear gas shells to disperse the protesters.\nIn January, the Supreme Court suspended the implementation of the farm laws and appointed a committee on January 12 to examine these laws and further recommend changes. The committee on Wednesday submitted its report and the apex court will hear the matter on April 5.\nSpeaking to Hindustan Times, one of the expert members in the committee Anil Ghanwat said that it was entirely up to the apex court whether to act on their recommendations or not.\nAPP Digital report by Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T20:34:34.749Z"
}
