{
  "title": "Senate body urges DRAP to enhance drugs’ quality",
  "link": "https://www.app.com.pk/national/senate-body-urges-drap-to-enhance-drugs-quality/",
  "date_published": "2024-08-30T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):Senate Standing Committee on National Health Services, Regulations and Coordination on Friday urged Drug Regulatory Authority of Pakistan (DRAP) to enhance quality of drugs and regulation of formula milk.\nThe committee meeting which was chaired by Senator Amir Waliuddin Chisti was briefed by the DRAP on its working and performance over the last five years.\nCEO DRAP, Asim Rauf, informed that it focuses on licensing and manufacturing of drugs for import and export.\nAdditionally, DRAP regulates quality assurance and quality control of drugs countrywide. However, sales, storage, and distribution of drugs fall under the ambit of the provinces.\nRecently, DRAP has been integrated with Pakistan Single Window for import and export licenses, and DRAP has also implemented its E-Office.\nIt was apprised that DRAP is a self-sufficient organization and the budget of DRAP for the financial year 2024-25 is 2.33 billion rupees.\nHe said that DRAP is also working on the establishment of an Export Directorate to facilitate the exports of ‘Therapeutic Goods’.\nThe committee recommended that the quality of drugs produced countrywide is not up to international standards and DRAP should focus on enhancing the quality of drugs.\nDRAP officials stated that recently the authority has filed a suit against ‘GSK’ for manufacturing ill-quality drugs.\nThe committee inquired about the number of multinational pharmaceutical companies that are currently working in the country and also inquired about the authenticity of claims with regard to the exit of these companies from Pakistan.\nDRAP officials informed that 30 multinational companies are working in the country and that no company has left, however, there has been a merger of several companies.\nChairman Committee, Senator Amir Waliuddin Chisti, highlighted the matter of ‘formula milk’.\nCEO DRAP stated that formula milk companies have filed a suit in the High Court against the inclusion of formula milk in DRAP. However, the suit has been decided in favor of DRAP.\nHe recommended that DRAP initiate work on the regulation of formula milk if the companies have not filed a suit in the Supreme Court.\nHe also opined that an awareness campaign should be initiated among mothers highlighting the detrimental effects of formula milk.\nThe committee deliberated on the new policy for the National Registration Examination (NRE).\nPresident, Pakistan Medical and Dentil Council (PMDC), Dr. Rizwan Taj, stated that, under the new policy, PMDC has lowered the passing criteria for foreign medical students from 70% to 60%. As a result, the passing ratio for NRE exams has increased from 4% to 40%.\nThe committee was briefed on the total strength of doctors working in federal government hospitals.\nSecretary Ministry of National Health Services, Nadeem Mahbub, informed that a total of 500 doctors were appointed in federal government hospitals during the period of 2018-23.\nHe added that eight doctors were appointed in federal government hospitals, three in NIRM, 143 in Federal Government Polyclinic Hospital, and 346 in PIMS.\nProvincial quotas were also followed in the appointment of these doctors. Only six were allotted residences while the remaining are on hiring and allowances.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:09:48.005Z"
}
