{
  "title": "OIC Contact Group reaffirms support for Kashmiris’ right to self-determination",
  "link": "https://www.app.com.pk/national/oic-contact-group-reaffirms-support-for-kashmiris-right-to-self-determination/",
  "date_published": "2024-08-30T04:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): The OIC Contact Group on Jammu and Kashmir reaffirmed its support for the Kashmiri people’s struggle for the realization of their right to self-determination, calling for an early and peaceful resolution of the Jammu and Kashmir dispute as per the UN Security Council resolutions and aspirations of Kashmiri people.\nThe Contact Group which met on the sidelines of the 50th Session of the OIC Council of Foreign Ministers in Yaounde, Cameroon, also adopted a joint communique unanimously, a Foreign Office press release said on Friday.\nChaired by OIC Secretary General Hissein Brahim Taha, the meeting was attended by representatives from Saudi Arabia, Turkiye, Niger, Azerbaijan, OIC’s Independent Permanent Human Rights Commission (IPHRC) and True Representatives of the Kashmiri People. The Pakistan delegation to the meeting was led by Foreign Secretary Muhammad Syrus Sajjad Qazi.\nThe Contact Group underlined that a durable peace and stability in South Asia remained contingent upon the final settlement of the Jammu and Kashmir dispute in accordance with UNSC resolutions and aspirations of the Kashmiri people.\nForeign Secretary Qazi briefed the Contact Group on the evolving situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK). He outlined India’s attempt to consolidate its occupation of IIOJK in violation of the relevant Security Council resolutions including by creating an environment of intimidation and fear.\nHe urged India to release all political prisoners in IIOJK; lift the curbs on the outlawed political parties; revoke the illegal and unilateral actions of 5 August 2019; and implement the relevant UN Security Council resolutions.\nIn his remarks, the OIC secretary general stressed that holding the meeting comes as a firm commitment by the OIC to the cause of the Kashmiri people.\nHe noted that in all its endeavours for Jammu and Kashmir, the Organization remained steadfast in its mission to intensify advocacy, awareness-raising and outreach activities on the multifaceted dimensions of the Jammu and Kashmir dispute, according to a separately issued OIC press release.",
  "retrievedAt": "2025-08-11T05:09:24.034Z"
}
