{
  "title": "OGRA directs OMCs including PSO, GO to maintain HSD stocks as per established practice",
  "link": "https://www.app.com.pk/national/ogra-directs-omcs-including-pso-go-to-maintain-hsd-stocks-as-per-established-practice/",
  "date_published": "2024-08-30T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Taking strong note of media reports regarding a slowdown in diesel upliftment due to imports allowed to Oil Marketing Companies, the Oil and Gas Regulatory Authority (OGRA) on Friday directed OMCs, including PSO and GO, to maintain High-Speed Diesel (HSD) stocks in accordance with established practice.\n“The Oil and Gas Regulatory Authority (OGRA) has taken note of reports circulating in various newspapers regarding a slowdown in diesel upliftment due to imports allowed to Oil Marketing Companies (OMCs)” said a news release.\nPakistan’s reliance on imported petroleum products requires meticulous planning, often conducted two months ahead of time. Given the complexities of this process, some variation in supply and demand is inevitable. The demand of diesel is influenced by several factors, like fluctuating pricing trends, changes in the upliftment behaviour of OMCs, and varying demand patterns.\nAdditionally, challenges such as the porous borders also play a role in the overall planning and availability of fuel in the country.\nIt is important to note that the demand for HSD traditionally increases during the agricultural season, which coincides with the months of October and November.\nThis seasonal spike in demand necessitates the import of additional HSD volumes well in advance to ensure that the market remains adequately supplied.\nPak-Arab Refinery Company Limited (PARCO) will be undergoing scheduled maintenance during the months of October and November for a minimum of 45 days. PARCO contributes 50% diesel (200,000 MT) and 47 % Petrol (100,000 MT) to local production in the country. To address the shortfall, two major importing OMCs PSO and GO were instructed to import the necessary HSD volumes to maintain supply, following the established routine practice.\nAvailable healthy stocks, gathered strategically, shall start depletion at the start of agri season i.e. mid of September helping to cater the demand in absence of PARCO production.\nOGRA remains committed to ensuring the uninterrupted supply of petroleum products in Pakistan.\nThe authority is closely monitoring the situation and is in constant coordination with all stakeholders, including Refineries, OMCs and Petroleum Division to address any potential challenges accordingly.",
  "retrievedAt": "2025-08-11T05:09:51.677Z"
}
