{
  "title": "93 Pakistanis heading to UK on Chevening, Commonwealth scholarships",
  "link": "https://www.app.com.pk/national/93-pakistanis-heading-to-uk-on-chevening-commonwealth-scholarships/",
  "date_published": "2024-08-30T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):Pakistani students from every corner of the country have been given British High Commissioner Jane Marriott’s top tips for living in the UK, ahead of a year studying at British universities.\nThis year marks the 65th anniversary of the Commonwealth Scholarship programme and 46 Chevening and 47 Commonwealth scholarships have been awarded to Pakistanis, says the press not issued from British High Commission in Islamabad on Friday.\nThese long-standing programmes have developed a network of over 1,500 Commonwealth and nearly 2,000 Chevening alumni in Pakistan, who regularly meet to discuss live issues.\nScholars come from diverse backgrounds, representing the rich cultural tapestry of Pakistan. This year’s cohort come from Punjab, Sindh, Baluchistan, Pakistan Administered Kashmir, Khyber-Pakhtunkhwa, and the Federal Capital Territory.\nOver 60 percent of this year’s Chevening scholars are women. The British High Commission strongly encourages people from all backgrounds and across Pakistan to apply.\nBritish High Commissioner, Jane Marriott CMG OBE, said:\n“The Chevening programme helps develop a new generation of Pakistani leaders and changemakers. Many of our alumni have gone one to achieve extraordinary things back home. Not only do they get the benefit of studying at some of the best universities in the world, they also get to experience the best of living in the UK. From climate studies to football coaching, I am looking forward to seeing what they achieve, and encourage all those interested to apply early.”\nFareeha Gull Hashmi, Assistant Manager of Oral History Project Citizens Archive of Pakistan and upcoming Chevening scholar, said, “I am thrilled to be joining the University of Essex for my MA in Heritage and Museum Studies. This programme is exactly what I was looking for to help me on my journey to improve heritage and cultural preservation in Pakistan. I can’t wait for my journey to begin.”\nThe cohort includes those on a scholarship in Football Science, with the support of Swindon Town Football Club. For the first time, this year’s cohort also saw an additional scholarship for Heritage and Museum Studies with the support of Essex University. This scholarship will cover tuition fees, living expenses, and travel costs. This, and a University of Essex Scholarship for Climate Studies, are again available in this year’s application cycle, as are additional scholarships from the University of Birmingham.\nThis month, the British High Commission launched Chevening Connect in Karachi, a new debate series bringing together industry experts and Chevening alumni. The first debate, on tackling climate, looked at the technical, economic and political leadership needed to support Pakistan with adaptation and resilience.\nApplications for Chevening Scholarships to study in the UK from 2025-26 will close on 5 November. Applications for the South Asia Journalism Programme, a two-month journalism fellowship with the University of Westminster, are open and will close on 10 October. Applications for the Oxford Centre of Islamic Studies fellowship, a five-month fellowship, are open and will close on 5 November 2024. To find out more about eligibility and to apply, visit chevening.org.\nApplications for the Commonwealth Scholarships for 2025-26 will open later this year. For more information, visit the CSC website at cscuk.fcdo.gov.uk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:08:58.756Z"
}
