{
  "title": "S. Korea donates additional cash of Rs 8.9 million for flood victims",
  "link": "https://www.app.com.pk/national/s-korea-donates-additional-cash-of-rs-9-2-million-for-flood-victims/",
  "date_published": "2022-10-05T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): The South Korean Embassy and companies in Pakistan here on Wednesday handed over a cash donation of 8.9 million rupees for flood victims.\nThe handing over ceremony to this effect was held at the South Korean Embassy which was attended by the Ambassador of Korea, Suh Sangpyo, Additional Secretary of the Asia Pacific of the Ministry of Foreign Affairs, Ms. Mumtaz Zahra Baloch, Director Implementation of the National Disaster Management Authority (NDMA), Raza Iqbal and representatives of Mira Power, Mr. Han Seung Nam and Korea Hydro and Nuclear Power Lotte E&C, Mr. Ahn Ho Young.\nOn this occasion, Korea Hydro and Nuclear Power donated 4.6 million rupees, Mira Power 2 million rupees and the Embassy contributed 2.3 million rupees.\nTalking to the participants, the Ambassador said that this donation was in addition to the donations which had already been made by the Government of Korea and Korean private sector companies and associations working in Pakistan, amounting to USD 300,000 and over USD 500,000, respectively.\nThe Ambassador recalled that the first shipment of in-kind relief goods consisting of approximately three hundred thousand water purification tablets, thirty thousand emergency blankets and various other essential relief items had already been handed over to the NDMA on 25th September at Jinnah International Airport, Karachi.\nThe second in-kind shipment of relied items consisting of family-sized tents, collapsible water bags, and thermal blankets is also on route via a cargo ship and will hopefully be docked at Karachi Sea Port by 16th October.\nThe Ambassador appreciated the NDMA and the Government of Pakistan for their efforts to alleviate the human suffering caused by the floods and hoped for early recovery.",
  "retrievedAt": "2025-08-11T15:41:04.514Z"
}
