{
  "title": "Musadik blasts Imran Khan over ‘Hitler salute’ from PTI workers",
  "link": "https://www.app.com.pk/national/musadik-blasts-imran-khan-over-hitler-salute-from-pti-workers/",
  "date_published": "2022-10-05T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP):Minister of State for Petroleum Dr Musadik Malik Wednesday lambasted Imran Khan for taking oath, in Nazi style, from his workers for the Hqaeeqi Azad movement.“Imran Khan opted for Hitler style in taking oath from his workers yesterday at a gathering. How can such a person be called Sadiq and Amin (Honest and truthful),” the minister said while addressing a news conference.He said ironically, the person (Imran Khan), who was involved in mega corruption scandals like that of Malam Jabba, was declared “Sadiq and “Amin”. “I asked the people today how can a person, who grabbed 450 acres of land from a business tycoon to facilitate him in saving billions of rupees, be called “Sadiq” and “Amin”.Musadik said the leaked audio of Imran Khan had affirmed that he could not be trusted with the state secrets. He severely damaged the country’s foreign policy by dampening the relations with friendly countries.He said Imran Khan blamed a foreign country for hatching a conspiracy to oust him from the power, and conversely, he went out for hiring services of the lobbyist — with strong leanings for denuclearisation — eventually for image building in that country .The minister said Imran Khan was bent upon weakening the country economically and politically and his leaked audios were the living proof that he even manipulated the cipher to achieve his political motives and that too at the cost of national interests.To a query, he said the action against Imran Khan would be initiated in accordance with the law and ruled out political victimization of opponents under the leadership of Prime Minster Shehbaz Sharif.Musadik also defended the acquittal of Maryam Nawaz in the Avenfield apartment case and said the National Accountability Bureau failed to produce a single piece of evidence in the court of law.He said the Almighty Allah was the best planner and the truth eventually came to fore, regardless whatever one conspired.To another query, he said a comprehensive plan would be unveiled soon to make the country self-sufficient in energy in next three to four years. Innovative steps would also be taken to reduce the prices of gas and electricity, he added.He said the previous government of Pakistan Muslim League-Nawaz promised to end load shedding and by 2018, it literally installed enough power plants which fulfilled the electricity demand in the country.The minister said all-out efforts would be made to ensure gas supply to all the households during winter.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:40:54.442Z"
}
