{
  "title": "Ministry holds two-day ‘Int’l Seerat-un-Nabi Conference’",
  "link": "https://www.app.com.pk/national/ministry-holds-two-day-intl-seerat-un-nabi-conference/",
  "date_published": "2022-10-05T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): The ministry of Religious Affairs and Interfaith Harmony is organizing a two-day International Seerat-un-Nabi Conference in connection with Eid Milad-un-Nabi celebrations in the federal capital.\nAccording to the plan chalked out by the ministry, an event titled ‘Mehfil Rehmatul-lil-Alameen and Prize Distribution’ would be held on Saturday (11th Rabi-ul-Awwal) here at the auditorium of Pakistan National Council of Arts.\nThe event would start with recitation of the verses from the Holy Quran and Naat Rasool-e-Maqbool Peace Be Upon Him. Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor would deliver the welcome address on this occasion.\nLater on, the renowned Naat Khawans would recite the Naat and Ulema and Mashaykh would shed the light on the Uswa-e-Husna of the Holy Prophet Muhammad Peace Be Upon Him in their speeches.\nIn the end, prizes would be distributed among the position holders who topped in the book writing competition on Seerat-un-Nabi and Naat.\nOn Sunday, the main function in connection with 12th Rabi-ul-Awwal would be held here at a local hotel with the title of ‘Social Ethics, Reform and Training in the light of Seerat-un-Nabi Peace Be Upon Him’.\nThe event would start with the national anthem, recitation of verses from the Holy Quran and Naat Sharif. Secretary for Religious Affairs and Interfaith Harmony Aftab Akbar Durrani would made introductory speech while the welcome address would be given by the Minister Abdul Shakoor on this occasion.\nThe religious scholars and honorary guest and chief guest would put forward their precious ideas to bring revolutionary reforms in accordance with Seerat-un-Nabi Peace Be Upon Him in all segments of the society and the conference would come an end with Dua for peace, progress and prosperity of the country.",
  "retrievedAt": "2025-08-11T15:41:01.268Z"
}
