{
  "title": "93 new dengue cases reported in Federal Capital",
  "link": "https://www.app.com.pk/national/93-new-dengue-cases-reported-in-federal-capital/",
  "date_published": "2022-10-05T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): Dengue cases are on the rise in the Federal Capital, with 93 new ones reported during the last 24 hours raising the number of confirmed dengue patients to 2,679 in the current season along with six deaths.\n“Dengue strikes the Federal Capital seasonally and several measures have been taken to contain the disease,” Director, Pakistan Institute of Medical Sciences (PIMS), Dr Khalid Masood said.\nHe confirmed to APP that a total of 73 dengue patients had been admitted to PIMS and 13 of them still receiving treatment.\nHe said around 10 patients were discharged daily on improving their condition. “On a daily basis, new dengue patients are being admitted to PIMS from Rawalpindi that resulted in increasing the burden on the PIMS administration. However, we are providing all possible medical care to all patients.”\nDr Khalid said as the number of cases was continuously increasing, the PIMS hospital had decided to allocate three more wards for the dengue patients. Some 120 beds were being arranged to handle the burden of dengue patients on PIMS, he added.\nHe asked the people to take extra care during the high-risk dengue season, particularly at the time of sunrise and sunset as the dengue mosquitoes were more active during the very hours. They should wear full sleeve clothes and they should be careful while walking in the morning and evening, he added.\nMeanwhile, keeping in view of constantly increasing dengue cases, Minister for National Health Services, Regulations and Coordination Abdul Qadir Patel directed the health officials to look into the increasing number of dengue patients and prepare a comprehensive plan to contain the disease.\nHe also directed the Drug Regulatory Authority of Pakistan (DRAP) Islamabad team to take action against those laboratories which were charging high rates of dengue tests in the capital, and those pharmacies which were involved in the storage of Paracetamol. He also asked the civic bodies to undertake frequent fogging in vulnerable areas.\nHe appealed to the citizens to adhere to the directions to check stagnant water and directed the health staff to ensure observance of the standard operating procedures to avoid further spread of the disease. He said information, education and communication activities had been planned in which health workers would visit vulnerable areas to create awareness about checking stagnant water, which became breeding grounds for mosquitoes.",
  "retrievedAt": "2025-08-11T15:40:49.374Z"
}
