{
  "title": "PAC appreciates PM’s resolve for accountability",
  "link": "https://www.app.com.pk/national/pac-appreciates-pms-resolve-for-accountability/",
  "date_published": "2022-10-05T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): Chairman Public Accounts Committee (PAC) Noor Alam on Wednesday appreciated Prime Minister Shehbaz Sharif for his unflinching support to the committee for its smooth functioning and accountability across the board.\n“I must appreciate prime minister. I met him twice and he assured full support for the committee as he never interfered in the business of PAC because he himself had been heading the committee in the past, therefore, he is well aware with the scope and mandate of PAC,” said Chairman Noor Alam.\nThe committee while examining the Audit Report expressed displeasure over the bad governance of the former chairman of the Karachi Port Trust (KPT) Board and requested the prime minister not to post him anywhere because he, allegedly, interalia, committed several irregularities while awarding contracts to disqualified bidders and giving government’s land on lease on unimaginable lowest rates.\nHowever, the committee appreciated the performance of the incumbent Chairman of KPT.\nPublic Accounts Committee also decided to hold next meetings in Gwadar and on the same day would travel by air to Port Qasim Authority and Karachi Port Trust (KPT) with the purpose to discuss their audit reports’ objections on the anomalies in these departments.\nOn the indication of one of the committee’s member, the committee sought details as to how many officers had been placed on deputation in the government departments during last six months.\nThe Chairman PAC also constituted four sub-committees of PAC consisting of four members. The sub-committees would be headed each by MNA Ms. Wajiha Qamar, MNA Ch. Muhammad Barjees Tahir, Senator Saleem Mandviwalla and Senator Mushahid Hussain Sayed.\nThe committee directed the Secretary Ministry of Maritimes Affairs to provide the PAC with a list showing how many trucks were stacked up in KPT shipyard.\nThe committee directed the secretary to strive hard to make recoveries and directed to pursue court cases vigorously.\nTwo paras were also referred to NAB for inquiries and directions were also issued to the Secretary to fix responsibility on the officer(s) for violating law.",
  "retrievedAt": "2025-08-11T15:40:50.890Z"
}
