{
  "title": "100 housing units under Flood Relief Village constructed in district Tank; PM’s promise fulfilled",
  "link": "https://www.app.com.pk/national/100-housing-units-under-flood-relief-village-constructed-in-district-tank-pms-promise-fulfilled/",
  "date_published": "2022-10-05T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): Prime Minister Muhammad Shehbaz Sharif’s promise to construct 100 homes under Flood Relief Village in district Tank, Khyber Pakhtunkhwa, was fulfilled after the construction task was completed in a record period of time.\nThe prime minister during his visit to the flood affected district on September 2 had promised construction of 100 homes for the displaced families. On September 3, construction site was selected and on September 11, construction work started after completion of survey on September 7.\nThe construction process was completed on October 5 in record 24 days. The prominent architect of the country, Ali Naqvi had designed these housing units.\nThe prime minister thanked Chief Executive Officer (CEO) of Menzies Global Aviation Philipp Joeinig for the construction of flood relief village. The CEO Menzies called on the prime minister.\nThe prime minister lauded his passion of work and termed the construction of 100 housing units for the flood affected people as vital step in the rehabilitation of the affected families.\nThe housing units are equipped with facilities of solar system, school, clinic and tube well. The units were made of the latest construction material and technology which could resist extreme weather conditions.\nThe school has the facility of computer and other latest facilities whereas the clinic would provide health and treatment facilities to the local population.\nMoreover, about 9,000 saplings of the local indigenous varieties were planted around the construction site.\nThe Menzies had constructed 270 housing units in Mithan Kot and Rajanpur during 2005 earthquake and 2010 floods.\nThe group is interested in making investment in aviation sector of Pakistan besides, construction of skiing resort.",
  "retrievedAt": "2025-08-11T15:40:58.845Z"
}
