{
  "title": "Senate body directs to probe irregularities in different projects of Pak PWD",
  "link": "https://www.app.com.pk/national/senate-body-directs-to-probe-irregularities-in-different-projects-of-pak-pwd/",
  "date_published": "2022-10-05T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): The Senate Standing Committee on Housing and Works on Wednesday took notice of massive irregularities in different projects of Pak PWD in Malakand Division and directed the Housing Ministry to probe the matter thoroughly.\nThe Committee which met here with Haji Hidayatullah in the Chair was briefed that massive irregularities were reported since contractors were awarded multiple projects as a result of which these tenders were canceled by the then Assistant Commissioner.\nLater, it was told that the Assistant Commissioner was placed with another one. The same contractors were tendered again with multiple projects and the very next day, all related CDRS were cashed. The Ministry assured the Committee to probe the matter thoroughly.\nWhile discussing massive irregularities conducted by Pakistan Housing Authority and Federal Government Employees Housing Authority and their respective Human Resource Departments, the Committee was told that the Ministry had already constituted an inquiry body to investigate the issue in detail and would submit a report within two weeks.\nThe Committee took up the case of Sher Afzal Khan and asserted the need for transparency of the recruitment process and questioned his direct appointment in grade 20.\nThe Committee had also formulated a sub-committee to investigate the matter of land encroachment in G-14/ 1 to G-14/4.\nThe meeting was attended by Sanetors included Khalida Ateeb, Saifullah Abro, Fida Muhammad, Bahramand Khan Tangi,  Molana Abdul Ghafoor Haideri and senior officers of the Ministry of Housing and Works along with its attached departments and agencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:40:55.848Z"
}
