{
  "title": "Marriyum asks Imran to answer pertinent questions prior to his call for long march",
  "link": "https://www.app.com.pk/national/marriyum-asks-imran-to-answer-pertinent-questions-prior-to-his-call-for-long-march/",
  "date_published": "2022-10-05T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb Wednesday said Pakistan Tehreek-e-Insaf Chairman Imran Khan should fully explain the real motives, prior to a long march to federal capital.\nShe put up a formal challenge to the PTI leader to first answer her pertinent questions, and then give a date for the long march.  In a statement, the minister asked why ‘the foreign agent’, playing with national security, was bent upon destabilizing the democratic system in the country.\nShe said it was unfortunate that the PTI chairman was busy in making preparations for the long march, but alas he had no time to help the flood victims.\nThe minister said that Imran Khan, who ruined national economy with record loans worth over Rs 20 thousand billion, was threatening to march towards the federal capital.\nShe questioned why “the foreign agent conspiring to bankrupt Pakistan’s economy” was coming to Islamabad.\nMarriyum Aurangzeb said that the foreign agent had rendered 9.5 million people unemployed and pushed over 20 million people into abject poverty. “What he would do after coming to Islamabad,” she questioned.\nShe asked why the person, who threatened the judiciary and judges and ridiculed national institutions and dragged them into politics, was planning for a long march to federal capital.\nShe claimed that Imran Khan had a compromise on Kashmir in his tenure and now he was trying to destabilize the system in the country.\nTerming Imran Khan “thief of Tosha Khana and partner in corruption of Farah Gogi and Peerni”, she asked why he was planning for a long march.\nThe minister advised Imran to answer these questions first and then announce long march to the federal capital.",
  "retrievedAt": "2025-08-11T15:41:02.334Z"
}
