{
  "title": "IHC reserves verdict on appeals in Major Laraib murder case",
  "link": "https://www.app.com.pk/national/ihc-reserves-verdict-on-appeals-in-major-laraib-murder-case/",
  "date_published": "2022-10-05T13:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): The Islamabad High Court (IHC) on Wednesday reserved its judgment on appeals of accused against death penalty in murder case of Major Muhammad Laraib.\nA two-judge bench comprising Chief Justice Athar Minallah and Justice Sardar Ijaz Ishaq Khan reserved the verdict after listening arguments at length.\nAt the outset of hearing, the chief justice expressed annoyance with the police and noted that no investigation was done in this murder case. He remarked that the police order was imposed whether it was being implemented or not.\nThe chief justice asked why not the court should fix responsibility on the then SSP and investigation officer for not observing their duties. The court asked that how the police came to know that accused Baitullah was the real murderer. How the body of the slain major reached PIMS hospital and firstly it was linked to an accident, he asked.\nSSP Investigation Farhat Abbasi Kazmi requested the court to grant the police some time to interrogate the case. The court said that responsibility of the poor investigation should be fixed to set a precedent. The then relevant magistrate should also have been held accountable, it added.\nThe SSP said that the departmental action would be taken against the responsible. It had to be viewed that which investigation team was working that time.\nThe chief justice said that a criminal action should be taken against them instead of departmental action. It was also our responsibility to view that why these two people were arrested as they were also human being.\nThe court couldn’t grant permission to keep someone behind the bars without any evidence, Justice Minallah said. After this, the bench reserved its judgment in the case.\nIt may be mentioned here that a lower court had announced death sentence to two men including Baitullah and Gul Siddiqui last year in the murder case. Major Laraib was shot to death on November 21, 2019 in sector G-9 Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:40:57.787Z"
}
