{
  "title": "Regional countries want peace, stability in Afghanistan: PM",
  "link": "https://www.app.com.pk/national/regional-countries-want-peace-stability-in-afghanistan-pm/",
  "date_published": "2024-02-09T03:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar om Friday said that all countries of the region, including Russia and China, wanted peace, security and stability in Afghanistan.\nIn an exclusive interview with TOLO news, he said that the recognition of the Islamic Emirate of Afghanistan needed regional consensus.\nUntil the countries of the region and the world recognized the current government of Afghanistan, Pakistan would not take a step forward in that regard, he added.\n“I personally believe that all the countries in the region want the Afghan government to get recognized, although I cannot talk about the exact time, regional countries have understood this. I believe that the issue of recognition will be resolved as time passes.”\nThe prime minister said the Durand Line was an internationally recognized border between Afghanistan and Pakistan.\n“The UN and 206 countries have approved this as an international border and what the Afghan people say about this is their internal discussion, in which I am not interested.”\nHe said the Tehreek-e-Taliban Pakistan (TTP) had shelter in some provinces of Afghanistan and that issue had caused insecurity in Pakistan.\n“When my people come to your soil, use it, train on it, and then come and harm my people, then I will definitely be telling you that my unpleasant brother is on your soil, no matter if by your permission or not, he must be expelled from your soil,” he added.\n“This is Pakistan’s stance and we have not accused the Afghan government of intentionally sheltering these people,” the prime minister said.\nHe said that no nation would be permitted to utilize Pakistan’s airspace against Afghanistan.",
  "retrievedAt": "2025-08-11T00:27:56.766Z"
}
