{
  "title": "Independent candidates outclass parties’ heavyweights in KP",
  "link": "https://www.app.com.pk/national/independent-candidates-outclass-parties-heavyweights-in-kp/",
  "date_published": "2024-02-09T14:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 09 (APP): Independent candidates in General Election 2024 outclassed the heavyweights of religio-political parties including Awami National Party, Pakistan People Party, Pakistan Muslim League (N) and Jamiat Ulema Islam (F) in Khyber Pakthunkhwa.\nSwat, Mardan, Swabi, Charsadda, Peshawar, Buner and other high literacy districts were swept away by the independent candidates and has won maximum number of national and provincial assemblies seats in Khyber Pakhtunkhwa.\nIn Peshawar, independent candidates have won four seats out of five of the National Assembly and six out of 13 Provincial Assembly seats.\nAccording to election results issued by Retuning Officers, except former MNA Noor Alam Khan of the Jamiat ulema-e-Islam (JUIF) who won NA 28 Peshawar-1, the independent candidates including Aamir Ayub secured victory in NA 29 Peshawar-II, Shandana Gulzar in NA 30 Peshawar-III, Arbab Sher Ali in NA 31 Peshawar IV and Asif Khan on NA 32 Peshawar V.\nMs Shandana who is the daughter of former Commissioner Peshawar, Gulzar Khan (late) was voted to power after his father great employment and social services.\nIndependent candidate, Asif Khan has outclassed veteran politician and former Federal Minister for Railways Haji Ghulam Ahmed Bilour while former MNA Arbab Amir Ayub has also retained his seat.\nHowever, former MNA Noor Alam Khan who resigned from PTI and joined JUIF was able to comfortably defeated his politcal rival and former MNA Sajid Nawaz Khan.\nSimilarly, another independent candidate and former MNA Arbab Sher Ali retained his seat defeating former Minister for Communications Dr Arbab Alamgir Khan on NA 31 Peshawar IV.\nThe independent candidates, who won six among thirteen provincial assembly constituencies include Arbab Wasim on PK 73, Sameeullah Khan on PK 76, Sher Ali Afridi on PK 77, Syed Qasim Ali Shah on PK 81, Mina Khan on PK 83 and Fazal Elahi on PK 84.\nKaramat Ullah Chagarmati and Arbab Zarak Khan of Pakistan People Party also won PK 72 and PK 80 respectively.\nThe candidate of Awami National Party, Arbab Usman won provincial assembly seat on PK 75. Arbab Usman was the elder son of former Agriculture Minister Arbab Ayub Jan (late) who cashed his father’s development projects.\nEjaz Khan of JUI won PK 47 and Arbab Wasim of PTI Parliamentarian was declared winner on PK 73. Jalal Khan of Pakistan Muslim League won PK 79 and Zahir Khan of same party declared victorious in PK 78.\nChairman, Qumi Watan Party, Aftab Ahmed Khan Sherpao, Provincial President of Awami National Party, Aimal Wali Khan, Pakistan Tahrik e Insaf Parliamentarians Chairman, Pervez Khattak and former Chief Minister Ameer Haider Hoti had lost election in their respective national assembly constituencies.\nIndependent candidate and former senior minister Muhammad Atif Khan has won NA 22 Mardan-II after securing 114,748 votes, defeating former CM KP Ameer Haider Hoti who bagged 66,159 votes while former MNA Anwar Taj regained NA 23 Charsadda-I after defeating Aftab Sherpao who secured only 34,415 votes.\nFollowing defeat, Haider Hoti resigned from senior vice president of ANP and decided to serve party as a worker.\nOn NA 24 Charsadda-II, Aimal Wali who bagged 67,876 votes was defeated by independent candidate Fazal Muhammad Khan who secured 100,713 votes.\nSimilarly, former speaker National Assembly Asad Qaiser who contested election as independent candidate with 115,635 votes retained his native NA 19 Swabi-I defeating JUIF Fazal Haqqani who bagged only 45,567 votes respectively.\nPolitical stalwarts that lost election 2024 including PTI Parliamentarians Chairman Pervez Khattak on NA-23 Nowshera-I, KP PMLN Information Secretary Ikhtair Wali Khan, former Environment Minister Wajid Ali Khan in Swat, JIP Central Ameer Sirajul Haq.\nIndpendent candidate and former MNA Ali Muhammad Khan declared victorious on NA 23 Mardan after securing 102,175 votes and independent Shandana Gulzar secured victory at NA 30 Peshawar defeating former MNA Nasir Musazai of JUIF.\nProfessor Dr A.H. Hilali, Chairman Political Science Department, University of Peshawar told APP that participation of large numbers of voters in 2024 election has reflected the people unshakable trust in electoral process.\nTalking to APP, he said that decision of voters needs to be respected and the majority party may be given chance to form govt and implement its manfestio.\nProf Hilali said that young voters have played a significant role in deciding fate of the contesting candidates during 2024 election.\nHe said that constitution and election laws were very clear that the independent candidates must join a political party within the specified period to enjoy perks and privileges besides reserved seats for benefits of people and democracy.",
  "retrievedAt": "2025-08-11T00:24:34.923Z"
}
