{
  "title": "56 terrorist incidents take place across country on election day: Gohar Ejaz",
  "link": "https://www.app.com.pk/national/56-terrorist-incidents-take-place-across-country-on-election-day-gohar-ejaz/",
  "date_published": "2024-02-09T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): Caretaker Minister for Interior Dr. Gohar Ejaz said on Friday that a total  of 56 terrorist incident were taken place on February 8 Election Day to sabotage the electoral process.\nBriefing media persons about the overall security situation and challenges specifically regarding election day, he said that the biggest challenge of the caretaker government was to provide security to the people of the country on election day.\nSharing details of the casualties, the minister informed that 3 military jawans, 2 levies jawans, 7 police officials, 4 civilians including 2 minors lost their lives in the incidents.\nThe government had made a difficult decision to shut down the mobile service across the country in a high-level meeting on February 7 after the two deadliest terrorist incidents in which 28 innocent lives were lost,  he added.\nThe minister said that the government had received intelligence reports that the terrorist would carry out activities in different places through detonated devices.\nHe congratulated the deployment of hundreds of thousands of regular and civil armed forces, other law enforcement agencies and civilian officials across the country for successful conduct of the general elections.\nDr. Gohar said that 61 incidents of violence were also reported across the country during elections adding, all the incidents were being investigated in details and the action would be taken against culprits.\nHe said that deaths of 28 people and serious injuries to 64 others in terrorist incidents just one day prior to the elections forced the state to take several measures for ensuring safety of the citizens.\nThis also included the difficult decision of suspending the mobile phone services across the country to disallow terrorists the means to communicate, coordinate and conduct terrorist operations, he added.\nThe minister said mobile devices were also instrumental in initiating the trigger mechanisms for modern explosive devices for mass casualties.\nThe government was fully aware that suspension of mobile services would impact the transmission of election results across the country and delay the process, however, the choice between this delay and safety of the citizens was quite straightforward and the decision was taken, he said.\nPhysical transportation of election results from widely spread polling stations and especially in distant places in Balochistan, KP and even in rural areas of Punjab and Sindh, with such elaborate security measures was also a laborious and time consuming exercise, he maintained.\nThe minister said even with such stringent security measures in place, the election day saw 61 incidents of violence including terrorist attacks employing sophisticated weapons and explosive devices which consumed the lives of 16 citizens and caused injuries to 54 others.\nHe said that all institutions involved in this historic exercise, especially the Election Commision of Pakistan which had little control of the security situation, deserved acknowledgement and gratitude rather than criticism and denigration.",
  "retrievedAt": "2025-08-11T00:25:54.119Z"
}
