{
  "title": "Caretaker govt fully abides by Constitution: Solangi",
  "link": "https://www.app.com.pk/national/caretaker-govt-fully-abides-by-constitution-solangi/",
  "date_published": "2023-09-05T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Tuesday reaffirmed the caretaker government’s commitment to uphold the Constitution and abide by the country’s laws.\nTalking to a private new channel, Solangi emphasized that the caretaker government had been working within the defined constitutional role and would not resort to anything which was against the Constitution.\n“We need to demonstrate through our actions that we have no favourites,” he said, highlighting the importance of ensuring a level playing field for all political parties.\nThe minister said it was the Election Commission of Pakistan’s (ECP) responsibility to provide equal opportunities to all the political parties.\n“If any political party feels that it is being treated unjustly, it can approach the Election Commission and the courts,” he asserted.\nAs regards the arrest of Pervez Elahi, he said he was taken into custody under a First Information Report (FIR) registered against him. The police had the authority to arrest him. A person should not be called a political prisoner if he or she was arrested in a case.\nTo a query, Solangi said everybody had the right of the freedom of expression and holding a peaceful protest.\nTo another question, the minister reiterated the government’s commitment to assist the ECP in fulfilling its constitutional duties related to holding polls.\nHe said that the government would fully assist the ECP in conducting the election in accordance with its schedule.\nAll registered political parties would be treated equally, he said while responding to another query.\nThe minister termed Karachi an economic hub and said it was the prime minister who took the initiative to hold a meeting with the business community.",
  "retrievedAt": "2025-08-11T09:27:18.821Z"
}
