{
  "title": "Defence Day – Manifesting an indomitable resolve against aggression",
  "link": "https://www.app.com.pk/features/defence-day-manifesting-an-indomitable-resolve-against-aggression/",
  "date_published": "2023-09-05T08:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): The valiant nations always rise to the call of duty by emerging stronger and resolutely to demonstrate unwavering resolve and determination to defend their homeland and honor.\nWhether it is internal strife or foreign aggression, these nations exhibit unyielding courage with their valiant fighters even laying down their lives for the independence, sovereignty and well-being of their people.\nSuch a day was experienced by the Pakistani nation on September 6, 1965, when its neighbouring enemy India imposed unwanted aggression ambushing in the darkness of night with an ambition to knee down its people.\nBut our valiant armed forces, backed by the nation’s courage and determination, defended the motherland’s sovereignty and integrity with unparalleled valor.\nFrom the initial clashes along the Eastern Border to the full-fledged war, Pakistan embarked on a path of glory that showcased its mettle on the ground. It sent a clear message to the world, “When this nation unites with its armed forces, no enemy can shake its resolve.”\nSince then, the Pakistani nation has observed Defense Day every year on September 06, with great zeal and enthusiasm to reaffirm its commitment to defending our country against all threats.\nOn this day, the nation pays tribute to brave sons and daughters of Pakistan who sacrificed their lives in the line of duty and passed on the legacy of valor and loyalty to future generations.\nFifty-eight years ago, Pakistan found itself engaged in a full-fledged war with India. The initial Indian incursion into Pakistani territory occurred in April 1965 in the Rann of Kutch. Pakistan forcefully ejected them, with both sides fully mobilized, standing face-to-face. Pakistan proposed a ceasefire, which India accepted, leading to an agreement and the disengagement of forces.\nHowever, the situation escalated on the night of September 5-6 when the Indian army, without a formal declaration of war, crossed the international border, launching attacks on the Lahore and Kasur fronts. Pakistan’s Army and Air Force halted the offensive, inflicting significant casualties on the aggressor.\nOn September 7, Squadron Leader Muhammad Mahmood Alam, a PAF pilot, achieved an unmatched feat by shooting down five Indian Air Force Hunter aircraft in a single sortie. Pakistan’s Special Services Groups executed para-drops on Indian Air Force bases at Pathankot, Adampur and Halwara on the same night to neutralize them.\nTo relieve pressure on the Lahore front, Pakistan’s armoured and mechanized units, backed by artillery and the PAF, swiftly overran the Khem Karn area, penetrating six to eight miles into Indian territory. Key Indian positions in Sulemanki and across Rajasthan and Sindh were captured in bold and rapid offensives.\nSimultaneously, an Indian Army Corps launched a major thrust east of Sialkot with armoured and infantry divisions, supported by gallant 3 Frontier Force and B Company 13 Frontier Force (Reconnaissance & Support). This prompted a swift response from Pakistan, with a 30-mile front established to halt the enemy’s advance. The Chawinda front witnessed the largest tank battle since World War II, led by 6 Armored Division, valiantly supported by 24 Infantry Brigade Groups and 4 Corps Artillery.\nThe Pakistan Air Force played a crucial role in turning the tide of battle. Before a counteroffensive by the 6 Armored Division on September 22, India requested a ceasefire through the United Nations.\nIndia’s aggression, without a formal declaration of war, came at a significant cost, resulting in heavy personnel, material and economic losses, along with the loss of 1617 square miles of territory compared to 446 square miles of Pakistan’s open and undefended land.\nMany of Pakistan’s martyrs received awards for their gallantry and bravery, including Major Raja Aziz Bhatti, who was posthumously awarded the highest military honor, Nishan-i-Haider, for his exceptional role in defending Lahore at Bedian.\nWhile the armed forces showcased their mettle, the entire nation stood shoulder-to-shoulder, united against the enemy’s aggression. Pakistani artists, including Mehdi Hassan, Alam Lohar, Noor Jehan, Saleem Raza and others, played a vital role in boosting morale with patriotic songs, fostering a sense of unity and resilience.\nThe enemy had suffered a resounding defeat with our forces silencing India’s reckless territorial ambitions and ill-will towards Pakistan.\n“The victory in the 1965 war was made possible by the national spirit and unity that must always be remembered and upheld,” stated Lieutenant General (Retd) Amjad Shoaib.\n“On this day the whole nation especially people from Lahore, Sialkot and other border areas demonstrated unique unity,” he added.\nOther defense analysts also underline the importance of this day and call on the nation to always emulate the spirit and determination of that historic day.\n“India had been relentlessly seeking to destroy Pakistan since its inception, but it is our unity as a nation that foiled all bids of our enemy,” remarked Lieutenant General (Retd) Ghulam Mustafa.\nBrigadier (Retd) Mahmood Shah has also reiterated that Pakistan’s victory in the 1965 war was due to national unity and the heroic performance of its armed forces.\n“This unity and determination must continue to be the pillars of Pakistan’s defense and progress in the years to come.”\nThis Sunday, once again the nation will stand united to renew its vigor and enthusiasm, sending a clear message to hostile neighbours that Pakistan remains prepared and determined to thwart any threats to its sovereignty and integrity.\nAPP/ajb/maz (APP Feature Service)",
  "retrievedAt": "2025-08-11T09:28:15.629Z"
}
