{
  "title": "All about power - Newspaper - DAWN.COM",
  "author": null,
  "content": "“SEXUAL harassment is not about sex. It is about power.” This opening statement in the recent Supreme Court decision in the ‘Muhammad Din vs Dr Sidra Zafar’ case, authored by Justice Mansoor Ali Shah, sets the tone for a significant legal precedent on workplace harassment.\n\nThe case involved a woman doctor who had registered a harassment complaint with the ombudsperson against a driver under the Protection Against Harassment of Women at the Workplace Act, 2010, leading to consequences for the driver. The petitioner had engaged in persistent misconduct, including verbal abuse, spreading false allegations, and unlawfully recording a medical procedure.\n\nDespite several warnings and a transfer order, he refused to comply with the latter. Following an inquiry, which substantiated the allegations against him, the ombudsperson imposed compulsory retirement as a punishment. His appeals before the Punjab governor and the Lahore High Court were dismissed, leading to the Supreme Court petition. The apex court, too, dismissed the appeal.\n\nThe judgement does not simply set a legal precedent; it also highlights the structural challenges that women in Pakistan face routinely in professional environments. Despite the hierarchical reversal in this case, power still operates along gendered lines, reinforcing societal norms that police, subjugate, and erase women’s authority. The judgement underscores that harassment is rarely about desire; in fact, it is a mechanism of control, which has been designed to delegitimise the presence of women in traditionally male-dominated spaces, as Dr Zafar’s ordeal exemplifies.\n\nThis was not an isolated case of transgression but part of a broader cultural pattern that sanctions the surveillance and moral policing of women in authority in the country.\n\nThe petitioner’s defiance of a formal transfer order and obstruction of essential resources illustrate how even those with seemingly lower institutional power can weaponise gendered structures to resist women’s professional autonomy. The case shows how women’s authority is often perceived as negotiable, precarious, and undeserving of respect.\n\nWomen’s safety in professional spaces should not hinge on sporadic judicial interventions.\n\nThe judgement also references amendments to the Protection Against Harassment of Women at the Workplace Act in 2022. These amendments, championed by the then human rights minister Shireen Mazari in response to demands from the #MeToo movement, extended legal protections to informal sector workers, freelancers, and domestic employees. The definition of ‘workplace’ was also broadened to include educational institutions, spaces of concerts, performance venues, courts, highways, sports facilities, and gyms.\n\nA notable case from the movement involved a victim (a celebrity in fact) whose complaint was rejected by the ombudsperson on ‘technical grounds’, stating that there was no employer-employee relationship between the complainant and the respondent. The 2022 amendments directly addressed this loophole, ensuring broader legal coverage for victims of workplace harassment.\n\nFurthermore, the amendments recognise what feminists have argued for long — that harassment goes beyond overt sexual advances and includes acts that exert power and control, as well as gender-based discrimination that creates hostile workplaces for women. The introduction of legal clarity on hostile work environments acknowledges that character defamation, reputational sabotage, and professional isolation are insidious forms of gendered violence.\n\nSadly, while legal frameworks have expanded, the enforcement of laws remains weak. The judgement in question acknowledges that women who report harassment face institutional indifference, retaliatory backlash, and social ostracisation. True, the ruling in favour of Dr Zafar is a step forward, but systemic change will require a cultural shift in workplace environments that continue to tolerate, excuse, or downplay harassment.\n\nOur justice system must also confront its past role in perpetuating gendered hierarchies. Legal procedures do not always act as avenues for redress; often they function as instruments of attrition against survivors. The fact that this case had to navigate multiple legal layers over several years underlines the scepticism towards women’s testimonies.\n\nMany harassment cases never even see the light of day. Pakistan’s first #MeToo case, filed in 2018, remains entangled in the court system. Dr Zafar, too, had to defend her position in front of multiple judicial bodies since 2019.\n\nFor decades, women’s rights activists have called for shifting the burden of scrutiny from victims to perpetrators and the institutions that enable them. Legal redress should not be reactive; is should be proactive. It should not have to take years of litigation and perseverance for a woman to establish that she will not compromise on her professional dignity.\n\nThe ruling should not be seen as a transformative shift; if anything, it is an exception in a landscape where workplace harassment remains rampant and without consequences for the perpetrators. If we have to transition from isolated legal victories to systemic accountability, the government and its institutions will have to enforce the law — rigorously. Amendments alone cannot change workplace cultures unless independent and robust inquiry committees — free from the power dynamics that shield perpetrators — are created.\n\nMoreover, a societal reframing of women’s leadership is needed — one that does not treat women’s authority as contingent upon male validation. Institutions must move beyond performative compliance and integrate gender-sensitive training across workplaces.\n\nThe ruling in ‘Muhammad Din vs Dr Sidra Zafar’ is both a legal milestone and a sobering reminder of the struggle against workplace harassment. It underscores the urgency of dismantling the structures that normalise, indeed facilitate, gender-based harassment in the workplace. Legal frameworks, no matter how well-intentioned, will not be effective without cultural transformation that affirms women’s right to work with dignity and without fear.\n\nWomen’s safety in professional spaces should not hinge on sporadic judicial interventions. It must be a fundamental, non-negotiable standard. Entrenched patriarchal structures that sustain workplace harassment will have to be dismantled to allow women to navigate professional spaces without the threat of personal and professional annihilation constantly dangling over them.\n\nThe question is: how many more cases like the one under discussion must emerge before society acknowledges that workplace harassment is not an anomaly but an institutionalised mechanism of control?\n\nThe writer is a lawyer and the executive director of the Digital Rights Foundation.\n\nX: @NighatDad\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c260631e94d.jpg",
  "retrievedAt": "2025-08-25T14:53:06.530Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895063",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:22:29.000Z"
}
