{
  "title": "Market opinion divided on interest rate cut - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Interest rates may see another reduction in the upcoming monetary policy, with market sources suggesting a potential cut ranging from 50 to 100 basis points, according to surveys.\n\nResearch houses conducted the surveys to gauge market expectations in light of the 2-3 per cent main inflation expected in February this year. However, the surveys revealed a divided opinion, with the majority anticipating a rate cut to be announced in the next monetary policy meeting, scheduled for March 10.\n\nIn a poll conducted by Topline Securities, market participants held varying views: 38pc believe the rates will remain unchanged, while 62pc expect a rate cut of at least 50bps.\n\nAccording to its analysis, the State Bank has room for an additional 100bps cut, as its expects the FY26 inflation to average between 8-9pc, resulting in a real rate of 300-400bps with the current policy rate of 12pc. Of the 62pc expecting a rate cut, 37pc anticipate a 100bps reduction, 20pc expect a 50bps reduction and 5pc foresee a 150bps cut.\n\nMajority anticipates up to 100bps reduction at next SBP monetary meeting\n\n“However, we believe the central bank’s Monetary Policy Committee will likely maintain the status quo in the upcoming meeting,” the report stated.\n\nRegarding the interest rate target for June 2025, 95pc of participants believe the rate will remain within the range of 10-12pc, suggesting a further reduction of up to 200bps over the next four months.\n\nOn inflation, 65pc of respondents expect the FY25 average to be between 6pc and 8pc, while 22pc anticipate it will fall below 6pc. “We maintain our inflation target of 6-7pc for FY25. During FY26, we expect inflation to average around 8-9pc,” the report noted.\n\nThe survey conducted by Arif Habib Limited expects a reduction of up to 100 basis points in the key policy rate due to lower inflation and improved external sector stability.\n\nA clear majority of respondents (74pc) are in favour of a rate cut, while 26pc believe the policy rate will remain unchanged at 12pc.\n\nThe survey found that 36.8pc of respondents expect a 100bps reduction, 21.1pc predict a 150bps cut, and 10.5pc anticipate a 50bps reduction in the policy rate.\n\n“The easing cycle is not over yet, but the runway for further rate reductions is getting shorter,” AHL said. Given the sharp decline in inflation and stable reserves, a 50bps rate cut seems like a logical step in the upcoming policy meeting, according to the survey.\n\nThe respondents included participants from financial services such as banks, asset management companies, insurance firms, and development finance institutions, as well as non-financial sectors like exploration and production, cement, fertilisers, steel, textiles, and pharmaceuticals, AHL added.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:15.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895048/market-opinion-divided-on-interest-rate-cut",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:07.000Z"
}
