{
  "title": "PM Shehbaz launches Rs20bn Ramazan package for 4m families - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Muhammad Shehbaz Sharif on Saturday launched a Rs20 billion Ramazan package for four million deserving families — about 20m people — across the country.\n\nThe premier last month said that the government would unveil the Ramazan relief package without the Utility Stores Corporation’s (USC) role to prevent corruption and the distribution of low-quality commodities to the people.\n\nIn January, the federal cabinet formed a high-level committee to develop a comprehensive strategy for the prompt shutdown of the USC operations nationwide.\n\nTraditionally, the prime minister’s Ramazan package is offered to the general public through Utility Stores.\n\nIn the recent past, there have been different proposals to restructure the corporation to improve its finances or shut down around 1,000 of its loss-making outlets nationwide.\n\nAddressing the launching ceremony of the package today in Islamabad, the premier said that a total of 4m deserving families, about 20m people, would receive relief from this package, which would be distributed in the first 10 days of the holy month.\n\nEach family, through digital wallets, would receive Rs5,000, he said, expressing his satisfaction that the prices of essential items were less this year when compared with the previous figures during the month of Ramazan.\n\n“This year, an amount of Rs20bn has been allocated for the purpose. The relief amount last year was Rs7bn,” he added.\n\nThe prime minister also lauded all the relevant authorities and institutions, including ministries, the State Bank of Pakistan, the National Database and Registration Authority, Benazir Income Support Programme and tech companies, which worked “day and night to devise a digital mechanism”.\n\nThe federal government’s initiative would benefit all parts of the country through a well-devised digital system, PM Shehbaz said, expressing gratitude to foreign partners for their partnership and support in this noble cause and appreciating their commitment and valuable contributions.\n\nSeparately, the Punjab government deviated from its traditional practice of establishing Ramazan Bazaars, limiting access to the relief measures during the holy month and placing an additional economic burden on millions of people across the province.\n\nThe provincial government has also withdrawn subsidies on food items and instead provided 17 essential items at wholesale rates at Sahulat Stalls set up in Model Bazaars.\n\nThe holy month has led to a significant surge in demand for dates, a crucial item for iftar renowned for its taste and numerous health benefits.\n\nAccording to local vendors, dates have become the top-selling fruit in Ramazan, with many fruit sellers dedicating their stalls and carts exclusively to dates.\n\n“Dates are our best-selling item during Ramazan, and we offer a variety of types to cater to different tastes,” said a seller in the local market.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/011618214fe6094.jpg",
  "retrievedAt": "2025-08-25T14:53:01.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895104/pm-shehbaz-launches-rs20bn-ramazan-package-for-4m-families",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T11:58:09.000Z"
}
