{
  "title": "Pope spends ‘peaceful night’ after breathing crisis - World - DAWN.COM",
  "author": null,
  "content": "Pope Francis, hospitalised for two weeks with pneumonia in both lungs, spent a peaceful night after suffering a breathing crisis, the Vatican said on Saturday, as Catholics prayed for his speedy recovery.\n\nThe 88-year-old pontiff was put on a ventilator because of an “isolated” breathing crisis on Friday, sparking concern.\n\n“The pope spent a peaceful night and is resting,” the Holy See said in a statement on Saturday.\n\nA Vatican source said: “There have been no crises like yesterday. The pope woke up, had breakfast, and read the papers as usual.”\n\nHis doctors have said it would take the next 24 to 48 hours to see if this breathing trouble has worsened his condition or not.\n\nThe Vatican source said the pope’s prognosis of “reserved” had not been modified.\n\nOn Saturday, people continued to flock to Rome’s Gemelli hospital, braving rain to light candles and pray at the foot of a statue of John Paul II.\n\nAn old man stood for about five minutes under an umbrella with a lit candle that he then carefully placed at the foot of the statue.\n\nAbout a dozen nuns also prayed for the pontiff, while there were handwritten messages for Papa Francesco, including posters illustrated by children and balloons bearing Francis’s image.\n\nMedical experts have warned that Francis’s age and the chronic respiratory disease from which he suffers mean a sustained recovery will take time.\n\nThe pope, head of the world’s nearly 1.4 billion Catholics, had part of one of his lungs removed as a young man and has suffered increasing health problems in recent years.\n\nHe is prone to bronchitis and suffers from hip and knee pain, which has made him reliant on a wheelchair.\n\nNonetheless, Francis has continued to work from the special hospital suite on the Gemelli’s 10th floor.\n\nHe also has been doing breathing exercises in between resting and praying, according to the Vatican.\n\nThis latest hospital stay is the fourth of the Argentine’s nearly 12-year papacy and the longest.\n\nIn recent years, he has had surgery on his colon and a hernia operation, as well as a previous stay in the hospital with bronchitis.\n\nThere has been speculation as to whether Francis might now resign, especially as his schedule has been packed with papal duties amid celebrations for the holy Jubilee year.\n\n“If the pope survives, many imagine that he will want to finish the Jubilee year but that afterwards, when he is 89, he will face the question of whether or not to resign,” Italian Vatican expert Marco Politi told AFP.\n\nFrancis has always been open to following his predecessor, Benedict XVI, who in 2013 stepped down because of his physical and mental health.\n\nBut before his hospitalisation, Francis had repeatedly said it was not yet the time — and may never be.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/011646135d311ab.jpg",
  "retrievedAt": "2025-08-25T14:53:01.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895110/pope-spends-peaceful-night-after-breathing-crisis",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T11:49:01.000Z"
}
