{
  "title": "CK Hutchison plans $1bn port investment in Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Hong Kong conglomerate CK Hutchison Holdings Limited’s ports subsidiary plans to invest $1 billion to upgrade its operations in Pakistan, its finance ministry said on Friday.\n\n“Hutchison Ports presented their upcoming investment plan of $1 billion, aimed at upgrading their existing terminals to enhance operational efficiency, logistics connectivity, and automation,” the ministry said in a statement.\n\nNo timeframe was provided for the proposed investment. The investment is expected to generate at least $4bn in revenue over the next 25 years through royalty, rent, and tax contributions, the statement said, citing a Hutchison Ports delegation.\n\nThe announcement followed a meeting between Finance Minister Muhammad Aurangzeb and senior executives from Hutchison Ports.\n\nThe company has been operating two major terminals in Pakistan over a 25-year period, and has contributed more than Rs225bn ($805.01 million) in government revenue, the statement said.\n\nThe planned investment would automate Hutchison’s services in the southern city of Karachi, where it operates a deep-water container terminal, and improve roads and parking facilities to ease cargo movement.\n\nPakistan has been trying to attract foreign investment to shore up its low reserves and kick-start its flagging economy.\n\nPorts were identified as one of the infrastructure developments considered vital to draw investment into Pakistan by the head of the World Bank’s investment arm earlier this month in an interview.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/04/2409390754e3f5d.jpg?r=093932",
  "retrievedAt": "2025-08-25T14:53:15.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895051/ck-hutchison-plans-1bn-port-investment-in-pakistan",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:06.000Z"
}
