{
  "title": "Amendments approved to reinforce insurance regulations - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Securities and Exchange Commission Policy Board on Friday approved amendments to the Insurance Rules 2017, Insurance Accounting Regulations 2017 and General Takaful Accounting Regulations 2019 to improve regulatory framework in the insurance sector.\n\nThe board chairman, Mehmood Mandviwalla, noted that the amendments would strengthen the insurance regulatory framework by enhancing industry resilience, addressing challenges faced by the sector, diversifying capital sources and streamlining reporting requirements.\n\nA key amendment approved relates to increase in the minimum capital requirements for life and non-life insurance companies. Under the revised framework, non-life insurers must maintain a minimum paid-up capital of Rs2 billion, while life insurers are required to meet a threshold of Rs3bn, with a phased implementation timeline extending until 2030.\n\nThis enhanced capital requirement aims to strengthen the industry’s risk absorption capacity, bolster financial stability, and provide greater protection for insurance policyholders. The amendment introduces an enabling framework for insurance companies to issue subordinated debt instruments and defines its treatment for solvency purposes.\n\nThis reform is expected to enhance insurers’ financial flexibility by allowing them to explore alternative capital-raising avenues, strengthen their creditworthiness and maintain additional regulatory capital.\n\nBy expanding access to additional capital, this amendment reinforces the long-term sustainability and resilience of the insurance sector, whilst aligning with SECP’s planned implementation of the risk-based solvency regime.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:42:30.759Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895050/amendments-approved-to-reinforce-insurance-regulations",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:06.000Z"
}
