{
  "title": "CDA fetches over Rs23bn as auction of plots, shops concludes - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Capital Development Authority (CDA) received an overwhelming response from investors in its four-day auction of commercial plots and shops, which concluded on Friday, and fetched over Rs23 billion.\n\nAs many as 15 shops in Blue Area parking plaza were auctioned against a whopping over Rs1.5 billion as a re-planning of the shops by the CDA paid off.\n\n“Overall our action remained very successful, but shops is Blue Area got very good rate. As we received bid of around 110 million against a shop of 494 square feet,” said an official of CDA.\n\n“During the four-day auction, 17 commercial plots of different categories and 15 shops of Blue Area Parking Plaza were sold for Rs23.404 billion. On the final day of the auction, the 15 constructed shops in the parking plaza were sold for over Rs1.555 billion,” said a press release issued by CDA.\n\n15 shops in Blue Area parking plaza sold against Rs1.5bn, says official\n\nCDA Chairman Mohammad Ali Randhawa said the participation of investors in a large number reflected their confidence in CDA. He said the revenue generated from the auction would be utilised for providing facilities to the residents of Islamabad, including the investors.\n\nMr Randhawa emphasised that the participating investors were partners in the development and progress of the city. He added that improvements in the authority were being made in the light of suggestions from the business community and investors.\n\nIn the auction, various categories of commercial plots in developed sectors and Marakiz were offered for investments. These included Blue Area, commercial Marakiz, industrial, apartment and commercial plots in Park Enclave.\n\nAdditionally, Class-III shopping centres and ready-to-use shops in the Blue Area parking plaza were also available for investments.\n\nAccording to CDA, the received bids will undergo a review before being presented to the CDA board, which holds the authority to approve or reject them.\n\nThe civic agency, which is carrying out various development projects, will get financial relief as it will soon get handsome amounts. The successful bidders would pay the entire amount within two years. Those who got shops in Blue Area will have to pay the amounts within six months.\n\n“Since shops were ready for possession, we decided to auction them on payment in six months instead of the two-year payment plan for plots. So the investors bought 15 of the 26 shops,” said an official of CDA, adding the remaining shops would attract more rates in future as by that time the parking plaza would also be made functional.\n\nSince its inception, CDA has been relying on auction of plots for running its development and non-development expenditures as it has no regular source of income. Though it has revenue sources of taxes and various fees, these are not adequate to run such a big organisation, which has around 15,000 employees.\n\n“How long will we bank on our land bank? Time has come to take steps for getting regular income,” said an official, adding the CDA management had recently formed a committee to determine all properties of CDA/DMA and rent details being collected for them.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:08.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894978/cda-fetches-over-rs23bn-as-auction-of-plots-shops-concludes",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:42.000Z"
}
