{
  "title": "Stocks extend overnight losses - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stock market remained under selling pressure on Friday, closing the weekend session on a depressed note amid a dearth of positive triggers.\n\nTopline Securities Ltd said the benchmark KSE-100 index opened on a positive note and made an intraday gain of 482 points, supported by AGP Ltd result announcement in the pre-open session, which set the positive tone in the market.\n\nThe top positive contribution to the index came from Bank Al Habib, National Bank, AGP Ltd, Meezan Bank, Nishat Mills Ltd and Maple Leaf Cement Factory Ltd, adding 293 points. On the\n\nother hand, Engro Holdings, Fauji Fertiliser, Systems Ltd, Mari Energies, Engro Fertiliser and The Searle Company wiped out 521 points.\n\nAhsan Mehanti from Arif Habib Corporation said the market stayed bearish amid consolidation near the earnings season close and the government projections for a spike in the consumer price index-based inflation next month.\n\nHe added that the dismal earnings of Pakistan Petroleum and Oil and Gas Development Company, concerns over corporate and provincial tax reforms, and uncertainty over IMF approvals for the power tax relief and federal budget FY26 proposals depressed investor sentiments.\n\nAli Najib, the head of sales at Insight Securities, said the PSX observed mixed behaviour as the KSE-100 index continued its consolidation phase.\n\n“The benchmark index continued to face tough resistance at 114,000, making it a hard nut to crack. Therefore, it could not withstand the profit-taking and closed below this level,” he added.\n\nMarket participation, however, remained strong as the trading volume rose 18.79pc to 472.07 million shares while the traded value increased 17.85pc to Rs22.77bn day-on-day.\n\nStocks contributing significantly to the traded volume included Pakistan International Bulk Ter­minal (52.24m shares), World­Call Telecom (43.45m shares), National Bank (28.27m shares), Ghani Global Glass (21.75m shares) and Maple Leaf Cement (16.56m shares).\n\nThe shares registering the most significant increases in their share prices in absolute terms were Rafhan Maize (Rs72.99), Khyber Tobacco (Rs27.46), Lucky Core Industries (Rs27.00), AGP Ltd (Rs17.25) and Dawood Lawrencepur (Rs14.77).\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c25d07136fa.gif",
  "retrievedAt": "2025-08-25T14:53:16.661Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895052/stocks-extend-overnight-losses",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:06.000Z"
}
