{
  "title": "Climate change key driver of frequent, less predictable floods: study - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Climate change is the key driver of more frequent and less predictable floods in the mountains of the Hindu Kush Himalayan region, an analysis of 73 years of flooding events has found.\n\nThe analysis of 1,015 floods, published this month in the Science Bulletin — a peer-reviewed international journal — confirms a significant rise in the frequency of floods since 2000 driven by rising temperatures.\n\nThe journal is sponsored by the Chin­ese Academy of Sciences and National Natural Science Foundation of China.\n\nFlood frequency has gone up, the study confirms, but a key additional finding is a rise in the unpredictability in the timing of floods. While most events continue to occur during monsoon, the study says, there is a marked rise in the number of floods happening outside these times.\n\nThe study, ‘Flood Complexity and Rising Exposure Risk in High Mountain Asia under Climate Change’, authored by Peking University’s Dongfeng Yi, ICIMOD Cryosphere Specialist Sonam Wangchuk, Peking University’s Yuanyuan Bai and University of Colorado’s Albert J. Kettner, is grounded in a new inventory of the types, patterns and causes of floods in the region stretching back to 1950.\n\nAnalysis of 1,015 floods, published in Science Bulletin, confirms significant rise in flood frequency since 2000\n\nThe two most common causes for flo­ods are rain and snowmelt, but less common and more sudden and highly dest­ructive are those that caused by glacial lake outbursts (GLOFs) and landslide-dammed lake outburst floods (LLOFs).\n\n“We should prioritise real-time monitoring of floods in vulnerable valleys, restrict infrastructure projects in high-risk zones, and strengthen data-sharing agreements between High Mountain Asia nations to address transboundary threats.\n\nAuthors emphasise that while climate change is aggravating the risks of all types of floods, there are complex dynamics at play in each type.\n\nThe analysis says snowmelt floods are driven by rising temperatures and increased soil moisture. In contrast GLOFs and LLOFs are shaped by complex interactions between climate, glaciers, and topography.\n\nHuman activities are hugely aggravating the risks from floods, especially urbanisation and land use changes, such as human settlements in flood plains, deforestation, and dams, can all increase vulnerability and reduce natural buffers.\n\nThe analysis identified four key types of floods. The rain/pluvial-induced floods are triggered by heavy rainfall which results in surface runoff and flash floods. Most common in the Himalayas, snowmelt-induced floods occur when rising temperatures accelerate snowmelt and increasing river discharge.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:42:39.428Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895042/climate-change-key-driver-of-frequent-less-predictable-floods-study",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:00.000Z"
}
