{
  "title": "Exodus from Pakistan: Why are thousands risking everything to escape? - Pakistan - DAWN.COM",
  "author": null,
  "content": "The sea, vast and unforgiving, became a graveyard on January 2, 2025, as a small boat carrying migrants capsized near Spain’s Canary Islands. Among the 50 who perished, 44 were Pakistanis — dreamers who sought refuge from despair but found only death in the cold, unrelenting waters.\n\nLike so many others, their journey was a desperate gamble for a better life, a final act of defiance against the hopelessness that had engulfed their homeland. This is more than a tragedy; this is a brutal indictment of a nation failing its people, where thousands are willing to risk everything.\n\nFor those who survive these perilous journeys, their ordeal is far from over. Deportations of Pakistani nationals are escalating at an alarming rate, with hundreds, even thousands, being forcibly sent back each month. In January 2025 alone, 220 Pakistanis were deported from countries like the US, China, Turkiye, Zimbabwe, and Senegal.\n\nTwelve of these individuals were arrested upon landing at Karachi’s Jinnah International Airport, facing humiliation and uncertainty upon their return. In the span of just two days recently, the Kingdom of Saudi Arabia deported 47 Pakistanis for visa violations, overstaying and working without sponsors, inevitably leading to strict visa regulations for Pakistanis across the board.\n\nIn the East, Thailand has announced strict measures against Pakistanis travelling on forged documents, warning that any applicants or travel agents caught submitting fake paperwork will be permanently blacklisted. These deportees are part of a larger exodus of Pakistanis, who leave their country not out of choice, but out of sheer desperation, only to find themselves rejected, detained, or worse.\n\nBecause they see no other way.\n\nBecause the country they once called home has become a prison of poverty, inflation, and instability. Migration is closely linked to rising unemployment, with 4.5 million Pakistanis out of work and youth aged 15-24 facing the highest unemployment rate at 11.1 per cent. As job opportunities shrink, many see migration as their only escape, despite the growing risks and uncertainties abroad.\n\nWith Gulf Cooperation Council (GCC) countries tightening restrictions on Pakistani workers, many labourers are now forced to take greater risks and seek opportunities in other regions. According to Overseas Employment data, 58pc of the 727,381 migrant workers who legally left Pakistan for jobs in 2024 fell into low-skilled or unskilled categories. However, with global demand for low-skilled labour declining, these workers face an increasing risk of unemployment and exploitation, leaving them even more vulnerable in an already shrinking job market.\n\nThe system has failed them at every turn — failed to create jobs, failed to provide security, and failed to inspire hope. Pakistan’s brain drain wave is escalating at a staggering pace, with emigration surging from 225,000 in 2021 to a massive 13.53 million by 2024. Research by the Pakistan Institute of Development Economics (PIDE) reveals that 37pc of Pakistanis aspire to leave, with a striking trend — highly educated individuals are more eager to emigrate than those with lower education levels.\n\nWhile Pakistan grapples with a worsening brain drain and rising illegal migration, the government’s focus remains elsewhere — on expelling Afghan refugees instead of addressing the country’s deepening crisis. Under the controversial ‘Illegal Foreigners Repatriation Plan’, more than 527,000 Afghans have been forcibly deported since September 2023, a move widely condemned by Amnesty International as a violation of refugee and human rights laws. Families who built their lives in Pakistan are being uprooted and forced to leave behind their homes, businesses, and communities.\n\nThe irony is striking: while countless Pakistanis seek opportunities abroad, desperate to escape economic hardship, the government is ruthlessly driving out those who once sought safety within its borders. In a country where hope is fading, opportunities are scarce, and citizens are fleeing in record numbers, the state’s priorities seem both misguided and cruel — turning its back not only on refugees but also on the urgent crises within its own borders.\n\nRecently, Law Minister Azam Nazeer Tarar informed the National Assembly that, over the past year, 1,638 arrests were made and 458 traffickers were convicted in human trafficking cases. The Pakistani government is stepping up efforts to combat illegal migration, taking decisive actions within the Federal Investigation Agency (FIA). In a major shake-up, FIA Director General Ahmed Ishaq Jahangir was removed from his position, while 13 officials were dismissed, and promotions for three constables were halted.\n\nAdditionally, 65 FIA officials were blacklisted from serving at immigration checkpoints and anti-human trafficking units following an inquiry into the Greece boat tragedy in 2024. But why does the illegal trafficking of Pakistani nationals continue to rise?\n\nThis persistent issue has led to tragedies like those witnessed in the Spanish Canary Islands. Clearly, the root causes of this crisis remain unaddressed, and more needs to be done to combat this devastating problem.\n\nMigration, legal or illegal, is expected to spiral out of control regardless, driven by the worsening impacts of climate change, with an alarming rise in individuals seeking to cross borders, not for economic opportunities but for sheer survival.\n\nAs climate disasters intensify, displacement will increase on an unprecedented scale, creating a full-blown humanitarian emergency. By 2050, climate modelling predicts nearly 2 million climate migrants within Pakistan alone, signalling the urgent need for action to address this looming challenge.\n\nThe tragic deaths of 44 Pakistanis near the Canary Islands should have been a moment of reckoning. Instead, the government continues to pour its energy into cosmetic measures such as a shake up in immigration authorities, while ignoring the real issues unchecked.\n\nPakistan must stop ignoring the crisis at home. It must tackle the economic collapse, create opportunities for its youth, and address the growing impact of climate displacement.\n\nThis is not just a migration crisis; it is a national emergency. And until Pakistan takes responsibility for the despair that has been sown, the tide of tragedy will only rise.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/01103151e0d2c5e.jpg",
  "retrievedAt": "2025-08-25T14:53:04.744Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894907/exodus-from-pakistan-why-are-thousands-risking-everything-to-escape",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T05:53:28.000Z"
}
