{
  "title": "IHC tells FIA to promote its officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Tariq Mehmood Jahangiri of Islamabad High Court (IHC) has directed the Federal Investigation Agency (FIA) to upgrade and promote its officials, following complaints of prolonged career stagnation and discrimination in promotions.\n\nThe judge ordered the government to upgrade/redesignate the posts of constable, head constable and ASI from BS-5 to BS-7, BS-7 to BS-9 and BS-9 to 11, respectively.\n\nJustice Jahangiri was hearing the petitions of FIA’s constables, head constables and assistant sub-inspectors.\n\nThe ruling was delivered by the judge, who acknowledged that FIA officials had been unfairly denied promotions despite meeting the necessary qualifications and service criteria. The case was brought before the court by a group of FIA officials who argued that their career progression had been systematically hindered, while officers in other government departments continued to receive timely upgrades.\n\nThe petitioners, a group of mid-level and FIA officials, filed a case against the agency’s administration, claiming that their promotions had been delayed for years without justification. They contended that officers in equivalent ranks in other departments, including the police and intelligence agencies, were regularly upgraded, whereas FIA officials were being unfairly overlooked.\n\nThe petitioners argued that the FIA’s promotion policies lacked transparency and violated fundamental rights as enshrined in the Constitution. They pointed to cases where junior officers in other government agencies had surpassed them in rank and pay grade, leading to dissatisfaction and demotivation within the department.\n\nJustice Jahangiri ruled in favour of the petitioners, stating that the FIA’s failure to promote deserving officers was a violation of merit-based principles and fairness. The judge emphasised that the FIA had failed to justify the delays in promotion.\n\nThe affected officers had met all eligibility criteria but were not upgraded due to bureaucratic inefficiencies and discriminatory practices, the court noted. Other government departments with similar hierarchies had already implemented regular promotions, highlighting inconsistencies in FIA’s policies, the court observed.\n\nThe court ordered the FIA to immediately implement a structured promotion policy and ensure that all eligible officers are upgraded without further delay. It also directed the federal government to review the FIA’s service structure and align it with other departments to prevent future discrepancies.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:42:13.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895037/ihc-tells-fia-to-promote-its-officials",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:00.000Z"
}
