{
  "title": "Zelensky says still ready to sign minerals deal despite US White House row - World - DAWN.COM",
  "author": null,
  "content": "In the aftermath of a heated argument in the White House, Ukrainian President Volodymyr Zelensky on Saturday said that he is still ready to sign a minerals-sharing deal with the US, adding that Trump’s support is “crucial”.\n\nThe row saw European leaders scramble to voice support for Ukraine after Zelensky was made to leave the White House early and without signing the deal, which is seen as vital to an eventual US-brokered truce.\n\nZelensky thanked dozens of allies on social media on Saturday, a day after the US president shouted at him in an angry White House meltdown and accused him of not being sufficiently grateful.\n\nThe Ukrainian president said he was still “ready” to sign the minerals deal with the United States, despite the televised clash with Trump. “We are ready to sign the minerals agreement, and it will be the first step toward security guarantees,” Zelensky said in a post on X.\n\nIn another post on X, he said that Ukraine still needed Donald Trump’s support. “It’s crucial for us to have President Trump’s support. He wants to end the war, but no one wants peace more than we do,” Zelensky said.\n\nEarlier on Saturday, Zelensky on X wrote the words “Thank you for your support” in individual replies to around 30 messages of support from European leaders after his heated clash with the new US administration in the White House.\n\nDespite the confrontation, Zelensky earlier thanked Trump, the US Congress and the American people for their support and for his visit.\n\n“Ukraine needs just and lasting peace, and we are working exactly for that,” he wrote.\n\nUkrainian Foreign Minister Andrii Sybiha also sent multiple thank yous to European counterparts in a social media flurry on Saturday.\n\nEarlier today, Zelensky said his relations with the United States can still be repaired, after Trump accused the Ukrainian leader of refusing to make peace with Russia.\n\n“Of course,” Zelensky said when asked in a Fox News interview if the relationship with Trump could be salvaged.\n\nUS-Ukrainian ties are about “more than two presidents”, he said, adding that Ukraine badly needs Washington’s help in the fight against Russia’s far bigger and better-armed military.\n\n“It will be difficult without your support,” Zelensky said on Fox — Trump’s favorite news channel.\n\nZelensky’s olive branch came hours after the extraordinary Oval Office scene where the years-long US policy of massive support for Ukraine’s fight against Russian invasion collapsed in a shouting match.\n\nDuring the clash, played out in front of US and international media, Trump and Vice President JD Vance shouted at Zelensky, accusing him of not being “thankful” and refusing to accept their proposed truce terms.\n\n“You don’t have the cards right now,” Trump said. “You’re either going to make a deal or we’re out, and if we’re out, you’ll fight it out and I don’t think it’s going to be pretty.”\n\nZelensky departed shortly after, with Trump posting on social media that “he can come back when he is ready for peace”.\n\nUS media reported that Zelensky had been told to leave by senior Trump officials.\n\nThe US president told journalists later on Friday that Zelensky was “overplaying his hand” and should agree to end fighting “immediately.”\n\nZelensky, however, refused to apologise, telling Fox News, “I’m not sure that we did something bad.” He did, however, say he wished the exchange had not taken place in front of reporters.\n\nUS Secretary of State Marco Rubio later on CNN called for Zelensky to “apologise for wasting our time for a meeting that was going to end the way it did.”\n\nUS allies in Europe — already worried that Trump will force Ukraine to effectively hand victory to Russian President Vladimir Putin — rushed to back Zelensky.\n\n“You are not alone,” Polish Prime Minister Donald Tusk said.\n\nBritish Prime Minister Keir Starmer, fresh off his own visit to the White House, said he had spoken to both Trump and Zelensky by phone following the clash and vowed “unwavering support” for Kyiv.\n\nFar-right Italian Prime Minister Giorgia Meloni called for a summit “without delay” between the United States, Europe and their allies on Ukraine.\n\nCanada’s Foreign Minister Melanie Joly said she spoke with her Ukrainian counterpart and reaffirmed Canada’s commitment to “providing the necessary assistance to ensure Ukraine’s security, sovereignty, and resilience”.\n\nTrump and Vance are “doing Putin’s dirty work”, top US Senate Democrat Chuck Schumer posted.\n\nBut Russia was delighted.\n\nFormer Russian president Dmitry Medvedev called Zelensky an “insolent pig” who had received “a proper slap down in the Oval Office.”\n\nTrump’s Republican Party echoed the Russians in blaming Zelensky.\n\nUkraine appeared united behind Zelensky, with its army chief vowing to stand with him while the foreign minister praised his “bravery.”\n\nThe meltdown came after Trump said Ukraine will have to make “compromises” in a truce with Russia, which has occupied swaths of the country.\n\nZelensky said there should be “no compromises with a killer on our territory.”\n\nAfter he pointed out that previous Western-backed peace efforts had failed to deter Russian aggression, Vance interrupted and called him “disrespectful.”\n\nThe session then boiled over into Trump and Vance loudly berating the Ukrainian leader. He sat in evident discomfort as his hosts talked over him.\n\nTrump has alarmed Kyiv and European allies with his abrupt U-turn in US policy, casting himself as a mediator between Putin and Zelensky and refusing to condemn the Russian invasion.\n\nHe said in the Oval Office that he had “spoken on numerous occasions” to Putin – more than has been publicly reported.\n\nTrump called Zelensky a “dictator” last week and has said he trusts Putin to “keep his word” over a ceasefire.\n\nTrump told Zelensky that as a mediator he could not criticise one of the main sides.\n\nHowever, speaking to Fox News, Zelensky said he wished Trump was “really more on our side.”\n\nMeanwhile, Russia’s assault on Ukraine continued.\n\nRussian infantry were on Friday storming the Ukrainian border from the Russian region of Kursk, near areas of the region that were seized last summer by Ukrainian forces, Kyiv said Friday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/011106321697551.jpg",
  "retrievedAt": "2025-08-25T14:53:10.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895072/zelensky-says-still-ready-to-sign-minerals-deal-despite-us-white-house-row",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T03:37:49.000Z"
}
