{
  "title": "Fuel prices cut by up to Rs5.3 per litre - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Friday reduced the prices of all petroleum products by up to Rs5.31 per litre with immediate effect for the next fortnight ending March 15.\n\nOn the other hand, the Oil and Gas Regulatory Authority (Ogra) notified a decrease in the price of liquefied petroleum gas (LPG) by Rs6.15 per kg for March.\n\nIn a late-night an­­nouncement, the Ministry of Finance said Ogra had reviewed and adjusted prices for petroleum products in view of the fluctuations in the international market.\n\nThe ex-depot price of high-speed diesel (HSD) was decreased by Rs5.31 (2 per cent) to Rs258.64 per litre for the next fortnight from Rs263.95.\n\nMost of the transport sector runs on HSD. Its price is considered inflationary as it is mostly used in heavy transport vehicles like trains, trucks, buses, tractors, tube wells and threshers and particularly adds to the prices of vegetables and other eatables.\n\nTransport fares seldom come down despite lower diesel rates.\n\nThe ex-depot petrol price was set at Rs255.63 per litre against Rs256.13, down by 50 paise (around 0.2pc). Petrol is mostly used in private transport, small vehicles, rickshaws, and two-wheelers, and it directly impacts the budget of the middle and lower middle classes.\n\nThe kerosene rate was also cut by Rs3.53 (2pc) to Rs168.12 per litre while light diesel oil price was set at Rs153.35 per litre compared to Rs155.81 previously, down by Rs2.47.\n\nThe government currently charges about Rs76 per litre tax on both petrol and HSD.\n\nAlthough the GST is zero on all petroleum products, the government charges Rs60 per litre petroleum development levy on both products that normally impact the masses.-\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:42:12.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894989/fuel-prices-cut-by-up-to-rs53-per-litre",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:07:49.000Z"
}
