{
  "title": "Surge in Karachi fatal accidents attributed to corruption, lax enforcement of laws - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Many accidents can be avoided by diverting heavy traffic to Northern Bypass, moot told\n• SSP claims media ‘sensationalises’ issues in Karachi\n\nKARACHI: Rights activists and members of civil society have said that the increasing number of fatal road accidents in the city and the poor state of traffic laws’ enforcement are a violation of human rights which the state has failed to safeguard.\n\nThey expressed these views at a dialogue titled “Traffic and Transport Issues in Karachi — Proposed Solutions,” organised by the Concerned Citizens Alliance (CCA) at the Pakistan Medical Association (PMA) House here on Friday. Dr Mirza Ali Azhar moderated the event.\n\nSpeaking on the occasion, Vice Chairman Human Rights Commission of Pakistan Qazi Khizer said the state of Pakistan is responsible for the safety and security of every citizen’s life as per the Constitution but it has always backed away from this responsibility, adding that traffic and transport issues in Karachi are a prime example of its failure.\n\nHe attributed the sudden surge in accidents involving heavy vehicles, in which hundreds of people have been killed, largely to corruption by traffic police.\n\nIf one only talked about the heavy vehicles that come from the port, one observes that the trucks and trailers are coming from the Karachi Port round the clock, he said.\n\n“But instead of going from the Northern Bypass, the vehicles travel through the city from Liaquatabad and go to Sohrab Goth, all in the presence of traffic police officials who take bribe for allowing them. Every truck pays its share of bribe to traffic policemen,” he alleged and questioned why the Northern Bypass was built by spending millions of rupees if it wasn’t supposed to be used for such traffic.\n\nIf the law is strictly implemented and the heavy traffic diverted, many accidents can be prevented, he believed.\n\nSimilarly, he said that there was corruption in licence and fitness departments of the traffic police because of which anyone who pays a bribe gets a licence and the vehicle, despite being totally unfit, is declared fit.\n\nMr Khizer also said that the government had not provided decent and affordable public transport in the metropolis.\n\nTherefore, the vast majority of citizens have to use motorcycles, the number of which makes 65 per cent of the total number of vehicles in Karachi. “This too is the responsibility of the state,” he stressed.\n\nPMA President Shoaib Sobani in a presentation pointed out several factors that led to rising traffic accidents, with the most important being lax enforcement of traffic laws, poor road infrastructure, unprofessional behaviour of traffic officials and carless attitude of road users who violate traffic rules.\n\nArchitect and urban planner Arif Hasan said all these issues were part of a lager cultural attitude “sab chalta hai [everything works]” which affects laws and their enforcement as well as the proper execution of projects.\n\nHe said there was no management and maintenance plans in place for Karachi and stressed that a special management system was needed to resolve traffic and transport issues in the metropolis.\n\nHowever, South SSP (Traffic) Suhai Aziz put the blame of accidents and traffic laws’ violations largely on citizens.\n\nShe said police is a reflection of society and, therefore, the officials take bribe because such is the culture of the society.\n\nShe also claimed that traffic accidents and rate of other crimes was higher in Lahore, but the media “sensationalises” the issues in Karachi.\n\nShe said there had been constant efforts to improve police behaviour and believed that the situation would improve after completion of the Safe City Project.\n\nDr Abdul Ghafoor Shoro of the PMA also spoke on the occasion.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:13.115Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895007/surge-in-karachi-fatal-accidents-attributed-to-corruption-lax-enforcement-of-laws",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:26.000Z"
}
