{
  "title": "LHC stays ‘action’ on NCHR report on blasphemy cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court has stayed any possible adverse action on the basis of a report of the National Commission for Human Rights (NCHR) carrying recommendations to deal with the blasphemy cases in Pakistan.\n\nJustice Chaudhry Abdul Aziz passed the order on a petition filed by Sajid Iqbal Lashari, the information secretary of Tahafuz-i-Khatam-i-Nabuwat Forum, who was aggrieved by some observations given by the NCHR in its report.\n\nAdvocate Nawaz Sheikh, the counsel for the petitioner, contended that the commission’s report discussed complainants of various cases registered under Section 295-C PPC. He further said that a report of the Special Branch submitted before the court was also explicit in sense and left no room for discussion that it was entirely based upon the source report.\n\nHe said the NCHR misconstrued the report of the Special Branch while treating it as an investigative report having some substance in it.\n\nHe stated that the Federal Investigation Agency (FIA) also submitted a detailed report before the court whereby the report of the Special Branch was described as having no substance whatsoever in it.\n\nHe said the FIA report termed the accusations placed before the NCHR as nothing but against facts.\n\nThe petitioner’s counsel argued that the NCHR was required to afford an opportunity of hearing to a person against whom some opinion is formed. However, he alleged, the mandatory provision of the law was grossly violated as no opportunity of hearing was either given to the petitioner or to any other person.\n\nHe said the report of the NCHR caused serious prejudice, therefore, should be set aside.\n\nThe judge issued a notice to the NCHR to provide an opportunity for placing on record an appropriate report along with some supporting documents, if any.\n\n“Meanwhile, no adverse action be taken on the report of NCHR,” the judge said in his order of Feb 24 hearing.\n\nThe petition was again heard by the judge on Feb 26, when Advocate Asad Jamal filed his power of attorney on behalf of the NCHR and the hearing was adjourned for two weeks.\n\nThe NCHR in its report 2023-24 found notable disregard to due process in blasphemy cases with significant procedural violations at multiple stages.\n\nIt recommended the constitution of a Joint Investigation Team (JIT) through the Ministry of Human Rights, comprising officials from Special Branch, Intelligence Bureau, Ministries of Law, Interior, FIA, and other relevant departments to deal with the blasphemy cases.\n\nThe report said the authority of the FIA to invoke sections of the PPC in arresting individuals requires careful scrutiny.\n\nIt noted that the reasons behind the apparent leniency of the FIA towards the private entities and individual complainants involved should be thoroughly examined.\n\nThe commission called for strict disciplinary proceedings against the FIA officials involved in illegal arrests or soliciting bribes.\n\nIt said the issue of multiple FIRs throughout the country being registered by same individuals also needs to be looked at, especially as an organised activity where fake IDs are being used to trap individuals using sexual content.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:09.944Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894965/lhc-stays-action-on-nchr-report-on-blasphemy-cases",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:34.000Z"
}
