{
  "title": "Economic woes persist as optimism surges: Ipsos - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Economic concerns continue to haunt Pakistanis, while optimism has surged to its highest levels ever, according to an Ipsos consumer confidence survey launched on the occasion of the one-year anniversary of the current government.\n\nSeven in 10 Pakistanis believe the country is on the ‘wrong’ track, with the global average for wrong-track sentiments standing at 63 per cent, slightly below Pakistan’s figure.\n\nHowever, optimism about the country’s direction has significantly increased in Q1 2025 (31pc) compared to Q4 2024 (19pc), reaching its highest level in six years.\n\nEconomic concerns continue to overshadow all others, but they have significantly declined in 2025, with inflation dropping by 18pc over the past year, marking its lowest level in four years.\n\nSurvey shows 88pc Pakistanis not comfortable buying household goods\n\nThe report noted that two in three Pakistanis describe the country’s current economic state as weak, while the number of people who consider it strong has increased fivefold since Q1 2024.\n\nHousehold purchases\n\nEighty-eight per cent of Pakistanis are not comfortable making daily household purchases. However, over the past year, comfort with making these purchases has tripled.\n\nWhile 69pc remain concerned, optimism about local economic conditions has shifted notably, from 12pc in August 2024 to 31pc in February 2025, reaching the highest level since consumer confidence tracking began in Pakistan, the survey report said.\n\nThree in five Pakistanis expect their personal financial conditions to weaken in the next six months, while one in five remain optimistic. This optimism has been steadily rising since August 2024.\n\nAround 88pc of Pakistanis do not feel confident about investing in the future. However, confidence in future savings has increased by 30pc since last year.\n\nThe report also indicated that while confidence in making major purchases has slightly increased, it still remains low at 6pc.\n\nEight in 10 Pakistanis do not feel secure about their jobs, while 19pc feel secure, with males and middle-income groups being the most confident, reaching the highest level of confidence since the Consumer Confidence Index (CCI) began tracking.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:15.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895047/economic-woes-persist-as-optimism-surges-ipsos",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:07.000Z"
}
