{
  "title": "KP Cabinet okays 12 anti-smuggling checkposts in eight districts - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa cabinet on Friday approved the establishment of 12 permanent intra- and inter-provincial joint checkposts in eight districts of the province to check smuggling.\n\nThe development came during a meeting, chaired by Chief Minister Ali Amin Khan Gandapur here.\n\nThe other participants included ministers, aides to the chief minister, chief secretary, inspector general of police, additional chief secretaries, the senior member of the Board of Revenue, advocate general, and administrative secretaries, according to an official statement.\n\nIt added that anti-smugglingcheckposts would be established in Khyber, Malakand, South Waziristan, Nowshera, Kohat, Lakki Marwat, Dera Ismail Khan and Peshawar districts.\n\nCM lauds his govt’s ‘exemplary’ performance in last one year despite challenges\n\n“Anti-smuggling, being the federal subject as per Article 97 of the Constitution and Federal Board of Revenue and Customs, is the leading agency/department dealing with anti-smuggling measures, whereas the provincial government is providing assistance to the federal government, and therefore, the cabinet approved forwarding a request to the federal government for arrangement of funds of Rs3.116 billion for the purpose,” read the statement.\n\nAlso, the cabinet reiterated to work for the economic transformation and prosperity of the province by implementing mega projects in every sphere of life.\n\nIt reviewed the one-year government performance and achievements in 25 key sectors that have been compiled in a booklet.\n\nMr Gandapur appreciated the “exemplary” performance of the cabinet and departments and said all that was accomplished despite facing enormous challenges.\n\n“It is our good performance that speaks louder than the words, “ he said, emphasising teamwork to further improve the performance and achieve development targets.\n\nThe cabinet was informed that during the last 25 cabinet meetings in the last one year, 661 decisions were made and 610 out of them had already been implemented with 92 per cent success rate.\n\nThe participants also took stock of achievements and public finance management, service delivery and infrastructure, public access to services and information, engagement of citizens and transparency, social protection and inclusion, economic growth and job creation, education and human capital development, tourism, and cultural heritage promotion, especially health facilities to every citizens of the province without discrimination.\n\nThe cabinet condemned the suicide attack on Darul Uloom Haqania in Akora Khattak, offered Fateha for the deceased and prayed for the speedy recovery of the injured.\n\nIt also approved special compensation of Rs1 million per person for the legal heirs of 16 deceased individuals from Khyber Pakhtunkhwa who lost their lives in a boat tragedy in Libya. The cabinet accorded approval in principle to arrange Iftar meals in shelter homes in the province.\n\nIt approved the release of Rs10 million as the annual grant-in-aid for Hamza Foundation during the current financial year and directed authorities to check if such services could be included in the Sehat Card Scheme so that such entities get rid of making such requests every year.\n\nThe cabinet also okayed enhancement of the cost of the ADP project for six type-D public hospitals in the merged tribal districts through Health Foundation and operationalising such two other hospitals by the health department itself.\n\nIt approved financial assistance in favour of patient Hasnain Ahmad, who is undergoing treatment abroad for a lung transplant, and the appointment of members for the Medical Teaching Institutions Policy Board.\n\nThe cabinet granted approval to the fourth revised PC-I and 19 per cent enhanced cost of the project, “Strengthening of the Rehabilitation Services for Physically Disabled at the Health Department.”\n\nThe forum also approved renovation of a building for the Senior Citizen Club in Peshawar at a cost of Rs80 million and the transfer of a building from the local government and rural development department to the social welfare, special education and women empowerment department.\n\nThe cabinet approved amendments to Section 4 of the Khyber Pakhtunkhwa Road Transport Ordinance, 1961, declaring the public service vehicle and trucks having a route of more than 365km will have two drivers.\n\nOfficers of the Provincial Transport Authority, Regional Transport Authority Traffic Police or Highway and Motorway Police, as the case may be, on violation of the provision of this sub section, will impose a fine which may extend to Rs5,000 but not less than Rs2,000 and on subsequent violation a fine up to Rs10,000 but not less than Rs5,000.\n\nThe cabinet approved forwarding of the provincial assembly’s resolution about the Kashmir cause to the federal government.\n\nThe resolution demanded rights for the people of the Indian-occupied Jammu and Kashmir in line with the United Nations’ resolutions.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:09.583Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894951/kp-cabinet-okays-12-anti-smuggling-checkposts-in-eight-districts",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:49.000Z"
}
