{
  "title": "China tells its AI leaders to avoid US travel over security concerns: report - World - DAWN.COM",
  "author": null,
  "content": "Chinese authorities are instructing the country’s top artificial intelligence entrepreneurs and researchers to avoid travel to the United States, the Wall Street Journal reported on Friday, citing people familiar with the matter.\n\nThe authorities are concerned that Chinese AI experts traveling abroad could divulge confidential information about the nation’s progress, the newspaper said.\n\nAuthorities also fear that executives could be detained and used as a bargaining chip in US-China negotiations, the Journal said, drawing parallels to the detention of a Huawei executive in Canada at Washington’s request during the first Trump administration.\n\nThe US and China are locked in a global AI race, with Chinese startup DeepSeek recently launching AI models that it claims rival or surpass US industry leaders such as OpenAI and Alphabet Inc’s Google, at significantly lower cost.\n\nThe White House and China’s State Council Information Office, which handles media enquiries on behalf of the government, did not immediately respond to requests from Reuters for comment.\n\nChinese President Xi Jinping told a meeting of top Communist Party officials on Friday to improve China’s overall security, including in the realms of cybersecurity and artificial intelligence, China’s state broadcaster reported on Saturday.\n\n“We should give top priority to defending the country’s political security,” Xi was quoted as having told other members of the governing Politburo.\n\nLast month, the Chinese leader held a rare meeting with some of the biggest names in the world’s second-largest economy’s technology sector, urging them to “show their talent” and be confident in the power of China’s model and market.\n\nChinese executives who choose to travel are instructed to report their plans before leaving and, upon returning, to brief authorities on what they did and whom they met, the Journal report said.\n\nDeepSeek founder Liang Wenfeng declined an invitation to attend an AI summit in Paris in February, according to the report. Another founder of a major Chinese AI startup cancelled a planned US trip last year following instructions from Beijing, the Journal added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:04.914Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895091/china-tells-its-ai-leaders-to-avoid-us-travel-over-security-concerns-report",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T07:39:54.000Z"
}
