{
  "title": "OGDCL profit slumps 33pc in six months - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The profitability of Oil and Gas Development Company Limited (OGDCL) — the country’s largest producer — plunged 33pc in the first half of the current fiscal year (FY25) owing mainly to forced closure of its wells, exchange rate appreciation and falling global crude prices.\n\nOverall, profit after tax (PAT) amounted to Rs82.5 billion in the first half (July-December) of the current fiscal year compared to Rs123.3bn during the same period last year, showing a 33pc reduction, according to financial results for half-year ending Dec 31, 2024, approved on Friday by the board of directors of one of the few blue chip state-owned enterprises.\n\nThe profit before tax (PBT) of OGDCL stood at Rs155.8bn this year against Rs158.3bn last year. The company registered total sales revenue of Rs206.4bn in the first half of FY25 compared to Rs235.4bn in the same period last year, down by 12.3pc.\n\nThe company attributed the lower sales revenue primarily to “forced production curtailment accompanied with reduction in average based price of crude oil owing to confluence of weakened demand, strategic geopolitical maneuvers and sluggish economic activity in major economies”.\n\nDecline blamed on forced closure of wells, exchange rate appreciation and falling global crude prices\n\nOn top of this, its sales were also affected by appreciation of the rupee against the dollar. The profitability was affected by higher taxation this year which amounted to Rs73bn in the first half when compared to Rs35bn during the same period last fiscal year.\n\n“In addition, OGDCL’s financials were also impacted by higher exploration and prospecting expenditure due to two wells declared as dry and abandoned against nil in the comparative period, coupled with an increase in the cost of seismic parties,” the report noted.\n\nThe company’s earnings per share (EPS) thus fell by 33pc to Rs19.17 in the first half of the current fiscal year from Rs28.67 last year. Yet, the board approved second interim cash dividend of Rs4.05 per share (40.5pc) for the year ending June 2025 on top of Rs3 per share (30pc) already declared and paid during the fiscal year, thus taking the total EPS so far to Rs7.05 when compared to Rs4.1 of the same period last year.\n\nIn a statement, the company said it had declared the highest-ever quarterly interim cash dividend of Rs4.05 per share in its history, adding that it “maintained a gross profit margin of 62pc and a net profit margin of 40pc, reaffirming its operational efficiency and cost management”.\n\nAlthough output of its all three products — crude oil, natural gas and LPG — dropped from last year, the statement claimed that OGDCL maintained its position as the leading exploration and production (E&P) company, contributing approximately 48pc to the country’s total crude oil production, 28pc of natural gas production and 34pc of LPG production.\n\nDuring the period, the company’s average daily net saleable production remained strong, it said. Crude oil production stood at 31,477 barrels per day against 32,984 barrels last year and natural gas output dropped to 672 million cubic feet per day (mmcfd) against 716mmcfd last year. Furthermore, LPG production averaged 629 tonnes per day as of December 31, 2024 when compared to 724 tonnes during the same period last year.\n\nPublished in Dawn, March 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:53:14.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895049/ogdcl-profit-slumps-33pc-in-six-months",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T01:08:07.000Z"
}
