{
  "title": "President for improving Pakistan-Kazakhstan trade, economic relations",
  "link": "https://www.app.com.pk/national/president-for-improving-pakistan-kazakhstan-trade-economic-relations/",
  "date_published": "2023-02-24T11:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP): President Dr Arif Alvi on Friday called for improving Pakistan-Kazakhstan trade and economic relations as both countries had great scope to expand cooperation in both the sectors.\nThe president, talking to Pakistan’s Ambassador-designate to Kazakhstan, Nauman Bashir Bhatti, who called on him, at Aiwan-e-Sadr, pointed out that the potential of trade between the two brotherly countries was much greater than the current level of bilateral trade.\nHe said there was a clear need to explore new avenues to boost bilateral trade for the mutual benefit of the two countries.\nThe president said that the potential for enhancing trade in the fields of agriculture and agro-products needed to be materialized. The maximum facilitation to investors from Kazakhstan should be provided to establish their businesses, in the already established Special Economic Zones across Pakistan.\nHe said that Pakistan attached great importance to its ties with Kazakhstan as both the brotherly countries shared historical and cultural bonds.\nHe said that Pakistan was committed to build sustainable and result-oriented relations with the Central Asian Republic (CARs) under its “Vision Central Asia” policy, and enhancing regional connectivity with CARs constituted a pivotal part of Pakistan’s policy towards the region.\nThe president stressed the need to keep up the momentum in taking forward regional connectivity initiatives with Kazakhstan, such as Kazakhstan-Turkmenistan-Iran (KTI) railway link.\nWhile emphasising the need to enhance people-to-people contacts with Kazakhstan, the president called for increasing cooperation in the field of higher education through joint degrees, and student and faculty exchange programmes.\nHe said that the Virtual University of Pakistan (VU) was offering online education, which was cost-effective and students from Kazakhstan could benefit from it.\nHe said that 8,000 foreign students were already enrolled in VU’s various virtual education programmes.\nThe president asked the ambassador-designate to convey his gratitude to the government and the people of Kazakhstan for their generous assistance to the flood-affected people of Pakistan.\nPresident Alvi asked the ambassador-designate to highlight the anti-Muslim and anti-minority policies of India, particularly the atrocities and human rights violations being committed by the Indian Occupation Forces against the Muslim population of Indian Illegally Occupied Jammu and Kashmir.\nHe also asked him to work for improving the country’s image.\nThe president congratulated Nauman Bashir Bhatti over his appointment as Pakistan’s ambassador-designate to Kazakhstan and urged him to take effective steps for further improving bilateral relations between the two countries.",
  "retrievedAt": "2025-08-11T06:11:19.913Z"
}
