{
  "title": "PML-N Senator calls for global action on Gaza, welcomes growing recognition of Palestine",
  "author": null,
  "content": "ISLAMABAD, Sep 22 (APP):Parliamentary leader of the Pakistan Muslim League-Nawaz (PML-N) in the Senate, Irfan-ul-Haq Siddiqui, on Monday called on the international community to take decisive and result-oriented action to end Israel’s brutal assault and state-sponsored violence in Gaza.\nIn a post on X, Siddiqui, also chairman of Senate Standing Committee on Foreign Affairs, urged global powers to intervene immediately to stop the ongoing massacre and ensure the strict enforcement of measures to prevent further atrocities.\n“There is an urgent need for the international community to move beyond formal statements, impassioned speeches, and emotional appeals,” Siddiqui said. “It must take concrete, effective, and results-driven steps to halt Israel’s brutal aggression, its role in global terrorism, and the savage massacre unfolding in Gaza. These measures must be implemented without delay and enforced with unwavering resolve.”\nHighlighting recent diplomatic shifts, Senator Irfan-ul-Haq Siddiqui noted that the recognition of Palestine by the United Kingdom, Canada, and Australia has raised the number of UN member states supporting Palestinian statehood to 143 out of 193. He expressed hope that this figure could surpass 150 during the upcoming UN General Assembly session.\nSiddiqui remarked that Britain’s recognition of an independent Palestinian state—given its historical role in the creation of Israel—is a modest repayment of a long-standing debt owed to history.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:22:19.310Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pml-n-senator-calls-for-global-action-on-gaza-welcomes-growing-recognition-of-palestine/",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T17:18:00.000Z"
}
