{
  "title": "PM for developing roadmap, reform agenda to promote investment, trade",
  "author": null,
  "content": "LONDON, Sep 22 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the relevant authorities to develop a comprehensive roadmap and a reform agenda with practical projects to promote investment and trade in all key sectors.\nChairing a high-level meeting on enhancing investment volume, economic and trade activities in Pakistan, the prime minister emphasized that agriculture, IT, minerals, tourism, and renewable energy were important sectors that could attract foreign investment.\nAlong with investment, he said promoting trade was also part of the government’s policy to significantly increase exports of the country.\nThe prime minister said that targets had been given to the ministries to utilize all available resources to ensure timely completion of all ongoing projects.\nHe also instructed all ministers to identify feasible projects and take immediate steps to put them into practice.\nFor this purpose, he said a roadmap and a reform agenda should be devised with the future in mind, so that progress toward our goals can be made in an organized manner.\nThe prime minister emphasized that the private sector will play a pivotal role in the economic roadmap and their participation will be ensured.\n“Our ongoing economic and financial reform policies have given a new direction to the economy, and due to the innovation and transparency, the country is now on the path of development,” he added.\nThe meeting, held via Zoom from London, was attended by Federal Minister for Environment Musadik Malik, Federal Minister for Petroleum Ali Pervez Malik, Federal Minister for Finance Muhammad Jehanzeb, Federal Minister for Commerce Jam Kamal, Federal Minister for Information Attaullah Tarar, and Federal Minister for Economic Affairs Ahad Khan Cheema.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:22:49.568Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-for-developing-roadmap-reform-agenda-to-promote-investment-trade/",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T12:13:00.000Z"
}
