{
  "title": "23rd relief flight to Gaza departs from Lahore with 100 tons of aid",
  "author": null,
  "content": "ISLAMABAD, Sep 22 (APP):The 23rd relief consignment, comprising 100 tons of humanitarian aid, was dispatched to Gaza via a special flight from Allama Iqbal International Airport, with support from the Alkhidmat Foundation and the National Disaster Management Authority (NDMA).\nThe relief consignment comprised ration bags filled with essential food items such as flour, rice, sweet corn, ready-to-eat meals, cooking oil and fruit cocktails.\nWith this latest dispatch, the total volume of aid sent to Gaza has reached 2,227 tons across 23 consignments.\nA send-off ceremony was held at the airport, attended by Punjab Governor Sardar Saleem Haider Khan, senior government officials, representatives of the National Disaster Management Authority (NDMA), and members of the Alkhidmat Foundation.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/09/Qatar-Cargo.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nSpeaking on occasion, Governor commended the NDMA and its partner welfare organizations for their swift and coordinated efforts in delivering essential relief goods to Gaza. He expressed heartfelt appreciation for their dedication to humanitarian service.\nGovernor reaffirmed Pakistan’s commitment to stand with the people of Palestine in this difficult time and to make every possible effort to meet their needs.\nHe said the oppressed Muslims of Gaza and Palestine are our brothers, adding that Israel has become a threat to peace in the world.\nThe Governor emphasized the urgent need for unity among Islamic nations in support of Palestine. He strongly condemned Israel’s actions, stating that the ongoing bombardment of civilian areas in Gaza and across Palestine constitutes a grave violation of humanitarian principles.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:23:11.395Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/23rd-relief-flight-to-gaza-departs-from-lahore-with-100-tons-of-aid/",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T14:07:00.000Z"
}
