{
  "title": "IWMB launches Hari Kahani week at Margalla Hills National Park",
  "author": null,
  "content": "ISLAMABAD, Sep 22 (APP):The Islamabad Wildlife Management Board (IWMB), under the Ministry of Climate Change and Environmental Coordination, inaugurated Hari Kahani Week with a vibrant awareness and plantation event at the Trail 5, Visitor Information Centre (VIC), Margalla Hills National Park.\nThe activity brought together civil society volunteers and students from local schools in a joint effort to promote environmental conservation and sustainability.\nStudents were educated about the rich biodiversity of Margalla Hills National Park and the importance of the prime minister’s initiative Ek Beti Ek Shajar, which aligns with the objectives of Hari Kahani Week.\nParticipating institutions included Federal Government Girls Model School, Saidpur, with 45 students and staff members, and Behbud English Medium Primary & Secondary School, Saidpur, with 50 students and staff members.\nHighlights of the event included a Seed Ball Dispersal activity, during which approximately 500 seed balls were scattered across various areas of the park to support natural regeneration. Additionally, 200 plants were distributed among participants to foster greenery and contribute to increased tree cover.\nThe event featured an engaging awareness session where students were briefed on climate change, biodiversity, and ongoing conservation efforts in the Margalla Hills. Hands-on activities such as seed ball making, tree identification, and plantation drives encouraged children to take an active role in environmental stewardship.\nDistinguished officials from the Ministry of Climate Change & Environmental Coordination (MoCC&EC), including Ms. Parveen Ejaz and Ms. Afra Sayab, AIG (Forest) from the Forestry Wing, graced the occasion.\nThey underscored the importance of tree plantation as a crucial measure in combating climate change and restoring ecological balance. Commending the students’ participation, they emphasized that fostering environmental awareness among youth is essential for long-term sustainability.\nThe event drew approximately 150 participants, including students, civil society volunteers, and IWMB staff, marking it as a successful community-driven initiative.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:24:01.460Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iwmb-launches-hari-kahani-week-at-margalla-hills-national-park/",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T19:02:00.000Z"
}
