{
  "title": "Officials’ training on international human rights obligations concludes",
  "link": "https://www.app.com.pk/national/officials-training-on-international-human-rights-obligations-concludes/",
  "date_published": "2020-10-01T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): Over 40 government officials received a two-day training on “Pakistan’s International Human Rights Reporting Obligations” organised by Ministry of Human Rights (MoHR) in collboration with the European Union funded ‘Promotion of Human Rights in Pakistan (Huqooq-e-Pakistan)’ Project.\nThe training was aimed at enhancing the technical and operational capacities of the officials of MoHR, National Commission on the\n(NCSW), National Commission on Human Rights (NCHR), Commission on the Rights of the Child in reporting and implementation of international human rights commitments of Pakistan.\nThe well-designed technical sessions included “Understanding the International Human Rights Treaty Body Reporting System and Pakistan’s Treaty Body Reporting Obligations,” “ Introduction to EU GSP+ Scheme,” “Introduction to UNHRC and the Universal Periodic Review (UPR),” “State Reporting to UPR and its National Implementation,” and “Pakistan and the Special Procedures of the UNHCR”.\nThe training modules and manual were designed by Huqooq-e-Pakistan but delivered by a range of local and international experts from the United Nations Development Programme, the Group Development Pakistan, Research Society of International Law led by Master trainers from the Huqooq-e-Pakistan Project ,said a Press Release issued here Thursday.\nSpeaking on this occasion, Head of Cooperation, EU Delegation Pakistan, Ovidiu Mic said that EU is delighted to support this very important joint initiative.\nHe expressed hope that the training program would prove to be a significant contribution in capacity building and institutional strengthening of human rights related departments.\nHe also talked about the EU interventions in Pakistan and said that respect of human rights and rule of law are at the core of all EU activities, including trade agreements.\nMuhammad Hassan Mangi, Director General, International Cooperation Wing, Ministry of Human Rights thanked EU for this much needed initiative.\nHe termed the lack of data a big hurdle in the reporting of Pakistan’s international human rights commitments.\nHe stated that through these trainings, the Ministry aims to facilitate the stakeholders in understanding the reporting process, providing effective reporting tools, and mechanisms as per the responsibility of the various institutions towards fulfilling treaty body obligations under the UN system.\nFurther, training facilitator, Emma Bell-Scollan, Rights-based Development Expert, UNDP added that “Being engaged for this training showcases a collaborative commitment between UNDP, the European Union and the Huqooq-e-Pakistan Project towards strengthening the human rights ecosystem in Pakistan.\nAs such, these initiatives are integral for providing concrete knowledge and guidance to functionaries on their role in fulfilling Pakistan’s international human rights treaty body reporting obligations”.\nSenior Key Expert, Huqooq-e-Pakistan program, Ali Dayan Hasan gave an overview of the Huqooq-e-Pakistan program and training objectives.\nHe said that the training program is designed in consultation with the Ministry and other state human rights stakeholders to ensure that the trainings reflected Pakistan’s realities and perspectives.\n“Huqooq-e-Pakistan is an unprecedented technical assistance project- the only human rights capacity-building project on this scale undertaken by the EU anywhere in the world.\nIt seeks to strengthen bilateral relations between the EU and Pakistan by aiding Pakistan in meeting its human rights reporting obligations at the UN and under GSP Plus.\nIn that sense, it represents positive and constructive human rights diplomacy rather than generating negativity as can often be the case,” added Ali Dayan Hasan.\nIngeborg Zorn, First Secretary, Rule of Law & Human Rights, Delegation of the European Union to Pakistan, said that the EU was delighted to support the HeP project and appreciated the content-rich and context-specific trainings designed and delivered by the Project, in collaboration with the finest local and international trainers.\n“We are hopeful that these trainings mark the beginning of a process that will continue with follow-up trainings and capacity-building endeavours by the project at both federal and provincial level,” said Zorn.\nThe EU Promotion of Human Rights in Pakistan (Huqooq-e-Pakistan) is a European Union (EU) funded programme with the objective of supporting the continued efforts of the Government of Pakistan for the promotion of human rights.\nThe purpose of the program is to strengthen the institutional and policy framework at the federal and the provincial level for the promotion and protection of human rights.\nAt the end of the training, Hasan Ali Mangi, Director General MoHR said that the International Cooperation Wing MoHR and Ingeborg Zorn, First Secretary at the European Union Delegation awarded certificates to qualifying participants.\nIn his concluding remarks, DG Hasan Ali Mangi thanked Huqooq-e-Pakistan, the EU and participating institutions.\nHe stated that the training will help in equipping the relevant ministries and departments with the pre-requisite information required in fulfilling their mandates with respect to international human rights reporting.",
  "retrievedAt": "2025-08-11T19:51:30.096Z"
}
