{
  "title": "Parliamentary panel for early execution of 220 KV grid station of Dhabeji SEZ",
  "link": "https://www.app.com.pk/national/parliamentary-panel-for-early-execution-of-220-kv-grid-station-of-dhabeji-sez/",
  "date_published": "2020-10-01T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 1 (APP): The Parliamentary Committee on China Pakistan Economic Corridor (CPEC) Thursday directed the authorities concerned to fast track the execution of 220 KV grid station of Special Economic Zone (SEZ) Dhabeji, Sindh.\nIn pursuance of the meeting of the committee held on September 24, a special meeting of the committee on the long outstanding issue of supply of electricity to SEZ Dhabeji, Sindh was held under the chairmanship of MNA Sher Ali Arbab.\nThe committee discussed the issue in detail in the presence of Secretary Power, Chairman National Electric Power Regulatory Authority (NEPRA), Secretary Board of Investment (BOI), Deputy MD National Transmission and Dispatch Company (NTDC) and Secretary Investment Sindh in person and K-Electric CEO through video-link.\nAfter detailed deliberation, the committee unanimously agreed upon that NTDC itself will execute the 220 KV grid station of the SEZ and Sindh government will provide the land, right of way and other ancillary facilities to NTDC for construction of this project.\nAfter the completion of grid station, the distribution of electricity will be handed over to the distributing agency as per law of the land at that time in consonance with the Special Economic Zones Act.\nSindh government would start its work simultaneously without waiting for the construction of grid station by NTDC.\nSecretary Power assured the committee that PC-I of this project would be revised and be submitted to the Planning Commission at fast track.\nThe committee directed NEPRA to analyze the issues of the three prioritized SEZs under CPEC regarding supply of electricity and suggest resolution of these issues to the committee.\nThe committee further directed all the stakeholders to submit their progress reports with timelines regularly.\nThe meeting was attended by MNAs Noor Alam Khan, Raza Rabani Khar in person and Sardar Ayaz Sadiq (through video-link).",
  "retrievedAt": "2025-08-11T19:51:28.381Z"
}
