{
  "title": "Boosting exports, promoting wealth-creation govt’s foremost priority: PM",
  "link": "https://www.app.com.pk/national/delegation-of-manufacturers-from-various-sectors-meet-pm/",
  "date_published": "2020-10-01T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 1 (APP):Prime Minister Imran Khan on Thursday said boosting the country’s exports and promoting wealth creation was the government’s foremost priority so as to achieve economic stabilization.\nThe government was committed to the facilitation of industrial sector and providing them all possible incentives, he added.\nThe prime minister expressed these views during a meeting with the delegation of manufactures from various sectors and representatives of various business associations.\nHe said the promotion of construction and industrial sectors would help boost economic activities, and create better and more job opportunities.\nImran Khan said the government welcomed every proposal regarding the promotion of industrial sector.\nThe delegation comprised Mian Zaka ur Rehman, Azam Farooqui, Anis Khawaja, Mian Idrees, Umar Ahsan, Shahid Abdullah, Karim Aziz Malik, Abbas Akbar Khan, Atif Akram Sheikh, Saadat Ejaz and Almas Haider.\nMinister for Industries Muhammad Hammad Azhar, Advisor on Commerce Abdul Razzak Dawood, Advisor on Institutional Reforms Dr. Ishrat Hussain, Advisor on Finance Dr. Abdul Hafeez Sheikh, State Bank Governor Reza Baqir and other senior officials were also present in the meeting.\nThe delegation members were representing various sectors, including pharmaceutical, cement, textile, home appliances, packaging and others.\nThe meeting discussed the issues relating various sectors and the government’s efforts to address those issues.\nThe delegation appreciated the government’s measures for the promotion of industrial sector as well as the Small and Medium Enterprises (SMEs).\nProposals for the further promotion of industrial sector and their facilitation were presented to the prime minister.",
  "retrievedAt": "2025-08-11T19:51:28.230Z"
}
