{
  "title": "Pakistan, China agree to continue working closely for upgraded CPEC-II",
  "author": null,
  "content": "BEIJING, Sep 4 (APP): Pakistan and China on Thursday, expressing satisfaction over the positive trajectory of their relations, agreed to continue working closely on the next phase of upgraded China-Pakistan Economic Corridor (CPEC 2.0), with its five new corridors.\nThe bilateral ties and cooperation were discussed in a meeting between Prime Minister Muhammad Shehbaz Sharif and Chinese Premier Li Qiang here.\nDuring their “warm and friendly” meeting, the prime minister expressed his deepest gratitude to the Chinese leadership and nation for their unflinching support to Pakistan’s territorial integrity, sovereignty, and socio-economic development.\nBuilding on the important consensus reached between President Xi Jinping and the Prime Minister in their meeting on Tuesday (September 02, 2025), both leaders reaffirmed their shared resolve to further strengthen the iron-clad, all-weather strategic cooperative partnership between Pakistan and China. The signing of the Joint Action Plan 2024-2029 was deemed as an important step in this regard.\nPrime Minister Shehbaz congratulated the Chinese leadership on the successful hosting of the SCO Council of Heads of State Summit in Tianjin and extended his felicitations to China on the 80th anniversary of the success of the Chinese people in the War of Resistance and World’s Anti-Fascist War.\nPaying rich tribute to China’s impressive transformation under President Xi Jinping’s visionary leadership, the prime minister stated that Pakistan wanted to emulate China’s successes and build a stronger and closer Pakistan-China community with a shared future.\nHe noted that his government’s tireless reform efforts were yielding promising results, made possible through China’s strong support.\nHe also shared Pakistan’s intent to float Panda Bonds in the Chinese capital market soon.\nOn the economic front, the prime minister highlighted the significant contribution of the CPEC – a flagship project of President Xi’s Belt and Road Initiative (BRI), in Pakistan’s socio-economic development in the past decade, and stressed upon the need for early implementation of ML-I, KKH realignment and operationalization of the Gwadar Port.\nEmphasizing on the vast potential for B2B cooperation and investment, the prime minister briefed the Chinese Premier on the B2B Investment Conference held earlier in the day, where more than 300 Pakistani and 500 Chinese companies were in attendance.\nHe identified agriculture, mines and minerals, textile, industrial sector and IT as priority areas for mutually beneficial economic collaboration.\nThe prime minister reiterated Pakistan’s support for President Xi Jinping’s landmark initiatives to strengthen multilateralism, including the Global Governance Initiative, Global Development Initiative, Global Security Initiative as well as Global Civilization Initiative.\nBoth countries would celebrate the 75th anniversary of the establishment of Pakistan-China diplomatic ties next year.\nThe two leaders also attended the ceremony of exchanging of Memorandums of Understanding and agreements signed and announced between the two countries with regard to cooperation in the development of CPEC 2.0, science and technology, IT, media, agriculture, etc.\nThe delegation-level talks were followed by a sumptuous luncheon, hosted by the Chinese Premier in honor of the prime minister and his delegation.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:54:28.770Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-china-agree-to-continue-working-closely-for-upgraded-cpec-ii/",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T08:51:00.000Z"
}
