{
  "title": "Pakistan delivers 105 tons of humanitarian aid to earthquake-stricken Afghanistan",
  "author": null,
  "content": "Media error: Format(s) not supported or source(s) not found\nISLAMABAD, Sep 04 (APP):Pakistan officially handed over 105 tons of critical humanitarian assistance to Afghan authorities on Thursday in response to the devastating earthquake that struck eastern Afghanistan on August 31, claiming more than 1,400 lives.\nThe relief consignment, dispatched by the National Disaster Management Authority (NDMA) under the directives of Prime Minister Shehbaz Sharif, includes essential supplies such as food items, tents, sleeping mats, blankets, and medicines. The aid was dispatched via the Torkham border in five trucks carrying 40-foot containers.\nThe consignment departed from NDMA’s Islamabad warehouse on September 3 and was formally handed over to Afghan authorities on September 4.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/09/WhatsApp-Video-2025-09-04-at-17.23.33.mp4Media error: Format(s) not supported or source(s) not foundDownload File: https://www.app.com.pk/wp-content/uploads/2025/09/WhatsApp-Video-2025-09-04-at-17.23.33.mp4?_=100:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nA handover ceremony was held to mark the occasion, attended by Federal Minister for Kashmir Affairs, Gilgit-Baltistan and Safron Engineer Aamir Muqam, Pakistan’s Consul General in Jalalabad Shafqatullah, Afghanistan’s Consul General in Peshawar Hafiz Muhibullah Shakir, senior NDMA officials, representatives of the Afghan government, and officials from the Afghan Embassy in Pakistan.\nDuring the ceremony, the Afghan Embassy expressed deep gratitude to Pakistan for the timely delivery of emergency aid, acknowledging the critical support extended to earthquake-affected communities during a time of immense need.\nThis humanitarian initiative underscores Pakistan’s commitment to supporting its neighbors in times of crisis and reflects the ongoing cooperation between the two countries in disaster response and relief efforts.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:54:12.315Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-delivers-105-tons-of-humanitarian-aid-to-earthquake-stricken-afghanistan/",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T13:15:00.000Z"
}
