{
  "title": "Mirza calls for global efforts to fight COVID-19",
  "link": "https://www.app.com.pk/national/mirza-calls-for-global-efforts-to-fight-covid-19/",
  "date_published": "2020-05-19T05:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP):Special Assistant to the Prime Minister on Health Dr. Zafar Mirza on Tuesday called for coordinated, collective and sustained actions among countries and institutions to suppress and mitigate COVID-19 pandemic.\nThis was stated by Dr. Zafar Mirza while addressing the 73rd Session of World Health Assembly held in Geneva-Switzerland via video conference here Tuesday.\nWorld Health Assembly was the supreme decision-making forum where 194 nations of the world deliberate and devise strategies for promoting health and reducing disease burden, he added.\nDr. Zafar Mirza said it was clear that no country alone can protect itself from this contagion. Solidarity and unity was therefore vital to tackle morbidity and mortality to ease burden on the health systems, and support national and global economies, he added.\nHe said this session of the World Health Assembly was significant in many ways. As the premier global health parliament, it must lend its full support to the on-going preparedness and response plans and strategies.\nThe Assembly must support growing calls for development and production of COVID-related diagnostics, therapeutics, and vaccines that were affordable, equitable and accessible to all. Prime Minister Imran Khan had already given this call, he added.\nPakistan has reported significantly lower numbers than the initial international projections, especially considering that Pakistan is the 5th most populous developing country in the world.\nMirza said, “Despite these numbers, we are not complacent and are taking every possible step to combat this pandemic.”\nHe informed that we as a nation were implementing a National Action Plan for COVID-19 at the highest level, multi-sectoral coordination at federal, provincial and local levels. Through this plan, the overarching strategy of Trace, Test and Quarantine was being pursued and operationalized.\n“We are training the frontline health care workers through our We Care Campaign, sustaining the momentum of public awareness messages, making available critical medical supplies to healthcare professionals and workers.”\n“Pakistan endorses the statement delivered by the Chinese delegation on the issue of Taiwan. Pakistan fully supports China’s efforts to safeguard its sovereignty and territorial integrity.”\nMirza said, “In line with iterations of General Committee, year after year , Pakistan’s position is that there is only One-China and Taiwan being its integral part has no right whatsoever to claim the membership of WHO”.\nHe said some of the lessons learned from the outbreak of this pandemic include the need for enhanced investments in national and global pandemic preparedness, detection and response mechanisms; strengthening of core capacities under IHR and improved pandemic response financing mechanisms.\nHe said WHO and Member States must take this opportunity to start imagining the future of healthcare. Current political global attention must translate into strengthened essential public health functions.\nThe world was bearing the fallout of this pandemic in so many different ways including the spread of other diseases as those had remained relatively unattended, he said.\nHe emphasized the need for collective action for voiceless poor suffering through these tough times.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:02.182Z"
}
