{
  "title": "Kashmiris not to accept new domicile laws in IOJK: Masood Khan",
  "link": "https://www.app.com.pk/national/kashmiris-not-to-accept-new-domicile-laws-in-iojk-masood-khan/",
  "date_published": "2020-05-19T04:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP):Azad Jammu and Kashmir (AJK) President, Sardar Masood Khan on Tuesday expressed his grave concern over Indian government’s move to implement the amended domicile law and said that new laws are aimed at changing the demography of the occupied state.\nHe made these remarks while addressing as chief guest at a webinar organized by the Center for Global Strategic Studies (CGSS) through a video link.\n“Today formally India has introduced a notification, which enables non-natives to settle in Jammu and Kashmir and have permanent residence there”, the president said and added that these rules were announced on April 2 this year but they become operative today.\nUnder these amended rules, the president said, a person who has resided in Jammu and Kashmir for 15 years will now be able to call the occupied territory his or her place of domicile.\n“The government announced new domicile rules about eight months after the abrogation of Article 370, 35-A and bifurcation of the Indian Occupied Jammu and Kashmir state into two union territories.\nThe Indian government, Masood Khan said, wants to settle those civil servants, army officers who had served there for the past 15 years. The heads of institutions, statutory bodies, officials of banks and educational institution who had served there, students and immigrant workers can also qualify for the domicile certificate\n“Today the Indian government has put that process on a fast track with orders that the process has to be completed in 15 days. India, the President cautioned, planned around 2 million Hindus to be settled in the first go and then floodgates for migration from India would be opened and Kashmir would be turned into a Hindu State.”\nIndia, he said is scientifically paving the way for settler colonialism in IOJK by forced demographic change, institutionalizing a system of domination over indigenous populations, and preventing the people’s exercise of their right to self-determination.\nThese changes are clear violations of international human rights and humanitarian law, as well as India’s international obligations, Masood Khan emphasized.\nSardar Masood Khan went on to say that India initiated this process under the cover of Coronavirus pandemic because Kashmir now is under triple lockdown. One lockdown days back to 1989, the second started on August 5 last year and the third was imposed in the form of CoVID-19 lockdown.\nUnder the cover of COVID-19 lockdown, they (Indian) have introduced these measures on fast-tracking and have also started killing young boys in fake encounters. The Indian occupation army soldiers during the so-called cordon and search operations go to the villages, enter the houses and terrorize the people and vandalize their property. They kill people, blind them and then they blast their houses. And when they kill the young men they say that they are terrorists.\nThe president urged the participants of the conference to intensify their efforts to communicate with multilateral forums including the members of UN Security Council, Secretary-General, President of the General Assembly, the High Commissioner for Human Rights to expose Indian nefarious designs.\nHe warned that by intent or by miscalculations, a war between India and Pakistan cannot be ruled out under the present circumstances and the war can turn nuclear because there are tactical nuclear weapons on both sides.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:04.705Z"
}
