{
  "title": "SOPs for opening tourist spots in post corona times being prepared: Zulfikar Bukhari",
  "link": "https://www.app.com.pk/national/sops-for-opening-tourist-spots-in-post-corona-times-being-prepared-zulfikar-bukhari/",
  "date_published": "2020-05-19T02:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP):The National Tourism Coordination Board (NTCB) Chairman Sayed Zulfikar Abbas Bukhari Tuesday said the government was working on the standard operating procedures (SOPs) for opening the countrywide tourist spots in the post-coronavirus times.\n“Our ‘Crisis Management Task Force’ is working on the SOPs for opening the tourism industry so that we don’t have to wait when the COVID-19 is over,” Zulfikar Bukhari said while addressing a town hall meeting arranged by the World Tourism Forum Institute (WTFI) through video link.\nSince the coronavirus (COVID-19) broke out across the world, the WTFI has been holding recovery town hall sessions to communicate its plans to boost the world tourism which has been hit hard by the global pandemic.\nZulfikar Bukhari, who is also Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development, said the first draft of the SOPs was ready and being shared with the relevant stakeholders to get their input.\nHe said the government realized the fact that the tourism industry of Pakistan in general and hospitality sector in particular were most affected by the contagion. However, the authorities had worked out incentives for the people affiliated with tourism industry, he added.\n“We are trying to put a proposal in the next budget that all sort of equipment that used in hotels kitchen and all hotels should be duty free.”\nHe said the government was striving to incentivize the people as it had deferred the registration fee for tour operators for a year.\nThe construction sector had been opened so that the people could develop attractions, he added.\nThe NTCB chairman said the government had initiated the process for leasing out the government owned hotels to the private sector for 25 to 30 years time which was earlier limited to three to five years.\nAt the same time, he said the government had put in place a revival strategy to mitigate the impact of coronavirus on the downtrodden segments of society.\nHe mentioned the Ehsaas Programme as one of the largest social welfare programmes of the subcontinent under which Rs 12,000 eash was being given to the people who had no work amid the coronavirus crisis.\nApart from deferring the utility bills for three months, the chairman said the government had been offering soft loans and extending support to the Small and Medium Enterprises.\nHighlighting the government’s pre-COVID-19 initiatives for the tourism promotion, he said Prime Minister Imran Khan played a leading role in reshaping the tourism sector which remained neglected in the past.\nHe said the tourism was taking off in the country due to prudent policies of the present government which was endorsed by the international media. Several global media outlets had mentioned Pakistan as the best tourist destination of 2020, he added.\nZulfikar mentioned a lot of initiatives that included construction of Kartarpur Corridor, Buddhist trail, renovation of Hindu temples and opening of the ski resorts.\nHe said the NTCB would soon launch the biggest branding project for promoting the tourism sector of Pakistan across the globe.\n“Pakistan will emerge as the perfect tourist attraction for the international travelers in the post-corona times for having scenic and exotic spots in the isolated areas,” he hoped.\nZulfikar believed that the domestic tourism would start reviving soon as the people were cooped up in their homes and they had not been able to travel in the last several months.\n“Disposable income has decreased to do foreign travel so they will stick more to do domestic travel,” he added.\nTo a query, he said the government, in the post-covid scenario, focused on family oriented, adventure, religious and mountain tourism.\nHe said one of the best economic drivers in the world today was tourism and it consisted of 10 per cent of the world Gross Domestic Product (GDP).\n“Under the leadership of Prime Minister Imran Khan, our goal is to take the GDP contribution of tourism to the country from 2.9 per cent to 7-8 per cent,” he maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:05.388Z"
}
