{
  "title": "U.S.-based entrepreneur diaspora explores partnership potential with innovators in Pakistan",
  "link": "https://www.app.com.pk/national/u-s-based-entrepreneur-diaspora-explores-partnership-potential-with-innovators-in-pakistan/",
  "date_published": "2021-04-10T06:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 9 (APP): The U.S.-based Pakistani entrepreneurs and the innovators in Pakistan at the Virtual Start-up Summit on Friday explored the prospects for connectivity to promote their mutual entrepreneurial partnerships.\nThe Virtual Start-up Summit brought together 120 start-up industry stakeholders from the Pakistani diaspora in the U.S. and in Pakistan.\nThe Ministry of Foreign Affairs and the Embassy of Pakistan in Washington, in collaboration with the Ministry of Information Technology and Telecommunication (MOITT), Securities and Exchange Commission of Pakistan (SECP), State Bank of Pakistan (SBP), the Higher Education Commission (HEC), National Science & Technology Park (NSTP) and Special Technology Zones Authority (STZA) convened a Virtual Start-up Summit entitled “Science & Technology as a Catalyst for Entrepreneurship.”\nIn his keynote address, Foreign Minister Makhdoom Shah Mahmood Qureshi highlighted the role of the Foreign Office as a facilitator in bringing together diverse innovation-related stakeholders.\nHe stated that the start-up Summit provided the platform for building connectivity between the relevant players in the entrepreneurial ecosystem in Pakistan and promoting their partnerships with U.S.-based Pakistani entrepreneurs and investors.\nQureshi appreciated the contribution of the diaspora towards the knowledge economy in the U.S.\nIn their comments, Foreign Secretary Sohail Mahmood and Federal Secretary Ministry of Information Technology and Telecommunication Shoaib Ahmad Siddiqui emphasized the role that diaspora could play in supporting and scaling the local hi-technology industry.\nDuring the open discussion session, Pakistani-origin innovators and business leaders in the U.S. made concrete recommendations for further strengthening of institutionalized mechanisms for collaboration and commercialization linkages between Pakistan S&T start-ups and relevant sectors, investors, and U.S.-based entrepreneurs.\nPakistan’s Ambassador to the U.S., Dr. Asad Majeed Khan appreciated the interest of the diaspora and thanked the local stakeholders in providing a holistic picture.\nFollow-up events will be organized in the near future including sector-specific start-up meetings as well as mentorship events involving Pakistani Universities and U.S.-based entrepreneurs.",
  "retrievedAt": "2025-08-11T20:36:52.622Z"
}
