{
  "article_id": "2025-02-10_75bac7f6fb704350b7c4b00572c94dcd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/leap-2025-pakistan-saudi-arabia-agree-to-boost-digital-investment-cooperation/",
    "retrieved_at": "2025-08-27T12:33:10.831Z"
  },
  "metadata": {
    "title": "LEAP 2025: Pakistan, Saudi Arabia agree to boost Digital investment cooperation",
    "author": null,
    "date_published": "2025-02-10T15:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 195,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 10 (APP):Pakistan and Saudi Arabia have agreed to strengthen digital investment and technology partnerships, aiming to facilitate Pakistani startups and small and medium enterprises (SMEs) in accessing the Saudi market. The understanding was reached during a meeting between Pakistan's Minister of State for Information Technology, Shaza Fatima Khawaja, and Saudi Deputy Investment Minister, Ibrahim Almubarak, on the sidelines of LEAP 2025, said a news release. Discussions focused on fostering business-to-business (B2B) collaborations, particularly in artificial intelligence (AI), cloud computing, and fintech sectors. Shaza Fatima reaffirmed Pakistan's commitment to developing an investor-friendly digital ecosystem to attract global stakeholders. Saudi Arabia, in turn, expressed confidence in Pakistan's skilled workforce and technological advancements, highlighting the potential for cross-border venture capital investments to create global opportunities for Pakistani startups. The two sides also explored ways to simplify licensing and registration processes for Pakistani companies entering the Saudi market. Both leaders agreed to enhance joint research and development (R&D) initiatives and digitize the degree attestation process for Pakistani professionals seeking opportunities in Saudi Arabia. Shaza Fatima said that strong digital economic cooperation between Pakistan and Saudi Arabia would play a crucial role in driving regional growth and innovation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}