{
  "article_id": "2025-02-10_8822834f40845f86aed9cf38f98d7d06",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-iqbal-highlights-governance-reforms-policy-continuity-soe-restructuring-as-key-to-sustainable-growth/",
    "retrieved_at": "2025-08-27T12:34:46.865Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal highlights governance reforms, policy continuity, SOE restructuring as key to sustainable growth",
    "author": null,
    "date_published": "2025-02-10T12:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 902,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "LAHORE, Feb 10 (APP):Federal Minister for Planning Development, and Special Initiatives, Professor Ahsan Iqbal, Chaudhry has said that Pakistan is prepared for a major economic transformation, emphasising that good governance and policy continuity are essential for progress. Speaking at a three-day training session for directors of State-Owned Enterprises (SOEs) at the Executive Development Institute (EDI) of the National School of Public Policy (NSPP), he highlighted the government's commitment to reforms, transparency and modern technology adoption. Under the leadership of Prime Minister Shehbaz Sharif, he expressed confidence that Pakistan would soon emerge as a global economic force. The federal minister said that organising a Directors' Training Programme to professionalise the leadership of SOEs and enhance their performance is a significant step. He congratulated the administration of NSPP and the EDI for the initiative, which will improve governance in the public sector and help align SOEs with international standards. He highlighted that SOEs are crucial economic assets to the country, providing services in energy, transportation, finance and public utilities. Currently, there are 212 active SOEs in Pakistan, but their financial performance lags behind global standards. He mentioned that the government introduced the SEOs (Governance and Operations), Act 2023 to strengthen transparency, accountability frameworks and reduce financial irregularities, which often lead to financial burdens. The goal is to cut financial losses related to SOEs by 30% within five years and enhance their contribution to economic development. He expressed optimism that the performance of SOEs would improve by 20-25% in the next three years. He also indicated that, if necessary, poorly performing SOEs would be privatised or restructured. Additionally, public-private partnerships (PPPs) would be established to improve their operational efficiency. Ahsan shared his personal experience working with SOEs, emphasising that proper governance training can lead to cost savings and service improvements. Citing an example, he recalled that in 1986, when the Ghee Corporation of Pakistan faced intense competition from the private sector, it was successfully reorganised within just six months under the leadership of then-chairman Dr. Hassan. The strategy is now studied as a case at Lahore University of Management Sciences (LUMS). He emphasised that the success of any institution-public or private-depends on how it is managed and a well-managed public sector can even outperform the private sector in gaining public trust. The minister stressed that continuity of policies is vital for national development, and every citizen must play their role in nation-building. He warned that history would not forgive if necessary steps were not taken. He reiterated that Pakistan has no shortage of talent or resources, with a vast pool of skilled young individuals capable of transforming the country's destiny. He urged reflection on how nations that once lagged behind Pakistan have now surpassed it, despite Pakistan being a nuclear power. Without serious introspection and corrective measures, the country will continue to fall behind in global competition. Recognising weaknesses and leveraging strengths is essential. The world sees Pakistanis as hardworking and intelligent and their ancestors' vision and principles should be upheld to move the nation forward. He outlined four critical factors necessary for progress: Development is impossible without peace, political stability is essential for sustainable progress, continuity of policies is the most crucial factor for national development and government changes should not disrupt policy continuity. Prof Ahsan Iqbal emphasised that developed nations have maintained their status through consistent policies, regardless of government transitions. He urged Pakistan to follow the same approach. He highlighted that the world is witnessing a digital and technological revolution, and adopting modern technology in agriculture, water resources, and various other sectors is imperative. The minister pointed out that Pakistan's rapidly growing population is another major challenge. According to the latest census, the population growth rate has increased from 2.0% to 2.55%, making Pakistan the fifth most populous country in the world. If this trend continues, the population will reach approximately 400 million in the next 25 years. This will put immense pressure on national resources, agriculture, food security and infrastructure. Therefore, controlling population growth and accelerating economic progress is essential to compensate for 77 years of setbacks. The federal minister said that when electricity loadshedding lasted for 18 hours in the country, no one came to help, but China supported Pakistan and helped it overcome the crisis by investing billions of dollars in an 8MW electricity project. He added that in the past, our ministers made unnecessary statements about China, which caused embarrassment to China at the international level. He stressed that good governance is fundamental to achieving the goals. Despite all challenges, the government remains committed to working tirelessly for national progress, and the day is not far when Pakistan will be on the path of sustainable development. He urged officials to actively participate in the training programme and implement strong governance frameworks in their organisations. By improving corporate governance and financial discipline, SOEs can be transformed from financial burdens into national assets. The government is fully committed to supporting and implementing these reforms to ensure that SOEs play a significant role in economic development. Representatives from various departments including OGRA, OGDCL, AGPR, Pakistan Mint, AGPR, NHA, RAILCOP, Armed Services, government of Punjab, government of KP, government of Sindh, The Urban Unit, The Bank of Punjab, First Women Bank Ltd, Port Qasim Authority, Trading Corporation of Pakistan, NSPP and private sector, participated. The Dean of the Executive Development Institute (EDI), NSPP, Ahmad Nazir Warraich, presented a souvenir to the minister.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}