{
  "article_id": "2025-02-10_377bec64ab70ce4bba4ba6d494a2cd92",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pnca-sadequain-foundation-commemorate-death-anniversary-of-artist-sadequain/",
    "retrieved_at": "2025-08-27T12:33:00.941Z"
  },
  "metadata": {
    "title": "PNCA, Sadequain Foundation commemorate death anniversary of artist, Sadequain",
    "author": null,
    "date_published": "2025-02-10T17:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 267,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 10 (APP):Pakistan National Council of the Arts (PNCA) and Sadequain Foundation USA were proud to present an exclusive exhibition, film screening and talk to commemorate the 38th death anniversary of the legendary artist, Sadequain. The exhibition was inaugurated by First Secretary Embassy of Ukraine Oksana PETRIAIEVA, Ambassador Indonesia Rehmat Hindiarta Kusuma, Ambassador of Kyrgyz Republic in Turkmen Embassy Avazbek Atakhanov along with Director General PNCA M. Ayoub Jamali, said a press release here on Monday. The exhibition will feature a curated selection of Sadequain's artworks, including murals, paintings and marble pieces from the National Art Gallery's permanent collection. This showcase will be a testament to Sadequain's enduring legacy and his significant contribution to Pakistani art. The event will also feature the screening of \"Raaz-e-Fun,\" a documentary on Sadequain's life and work. Written, narrated, and directed by acclaimed award-winning writer and director Waseem Amrohavi, this film takes the viewer on a journey through Sadequain's early life, his artistic evolution, and his rise to international recognition. Renowned speakers, including Founder Sadequain Foundation Dr Salman Ahmed sent a video message to the tribute for Sadequain. Dr. Farrukh Seir, Abbas Shah, and Zarar Haider Babry shared their insights and perspectives on Sadequain's life, art, and legacy. This event is a result of the ongoing collaboration between PNCA and Sadequain Foundation USA. Established in 2007, the Foundation has been dedicated for preserving and promoting Sadequain's art globally, publishing 25 books, and curating over 100 seminars and exhibitions worldwide. This exhibition will be on permanent display in the PNCA Gallery No. 4 of the National Art Gallery in the federal capital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}