{
  "article_id": "2025-02-10_0fe589c4a4a1c8d64e5f4819fa1dd70c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sharmila-faruqui-demands-cci-meeting/",
    "retrieved_at": "2025-08-27T12:32:43.310Z"
  },
  "metadata": {
    "title": "Sharmila Faruqui demands CCI meeting",
    "author": null,
    "date_published": "2025-02-10T18:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 222,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 10 (APP):Pakistan People's Party (PPP),Member of the National Assembly (MNA) Sharmila Faruqui Monday called for an urgent meeting of the Council of Common Interests (CCI) to address Sindh's persistent water shortage, which is affecting agricultural production. Speaking on a point of order in the National Assembly she highlighted that Sindh plays a crucial role in national agricultural output, particularly in wheat and rice production, but faces a recurring water crisis during non-flood seasons. She raised concerns about Punjab's proposed provision of water, questioning how Punjab could supply water when there is already a shortage due to reduced rainfall. She said that Sindh has already submitted a written request regarding this issue and urged Prime Minister Shehbaz Sharif to play his role in convening a CCI meeting, especially since Balochistan has also expressed concerns over water distribution. MNA Mian Khan Bugti appreciated the role of security forces, police, and the Deputy Commissioner in recovering a kidnapped woman in Khuzdar, stating that the Baloch community acknowledges their efforts. MNA Asiya Ishaq criticized the 18th Amendment for negatively impacting Karachi's education system. She claimed that Karachi residents had already lost job opportunities, and now students are being deprived of quality education. She urged the federal government to hold provinces accountable for how they utilize education funds under the National Finance Commission (NFC) award.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}