{
  "article_id": "2025-02-10_2be5097a0ed7d764891e5a6810c0e817",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/15-day-training-workshop-for-authors-begins-at-aiou/",
    "retrieved_at": "2025-08-27T12:32:35.618Z"
  },
  "metadata": {
    "title": "15-Day training workshop for authors begins at AIOU",
    "author": null,
    "date_published": "2025-02-10T10:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 299,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 10 (APP):A 15-day training workshop for authors commenced on Monday at Allama Iqbal Open University(AIOU). Writers of religious books from various regions of the country are participating in this workshop to enhance their writing skills. The inaugural session was presided over by the Dean of the Faculty of Arabic and Islamic Studies, Prof Dr Shah Mohyuddin Hashmi, while the Director of Al-Mustafa International University, Dr. Kazim Saleem, was the chief guest. Speaking at the occasion, Dr. Shah Mohyuddin Hashmi emphasized that the world is undergoing significant changes, and it is crucial for authors to understand this paradigm shift. He stated that this shift has provided numerous facilities, and it is essential to comprehend how to handle and benefit from them effectively. Dr. Shah Mohyuddin Hashmi further elaborated that the workshop will cover various topics, including selecting a research topic, research framework, research paper formatting, analysis of research material, thesis binding, citations, footnotes, references, bibliography, and the ethics of academic discourse. In his address, Dr. Kazim Saleem highlighted that, unfortunately, research and academic projects are scarce in Pakistan. However, due to the dedication of intellectuals, some institutions continue to organize academic events consistently, with Allama Iqbal Open University leading the way. He mentioned that Al-Mustafa International University and Allama Iqbal Open University have jointly initiated these academic activities, yielding significant results. The training workshop has been organized collaboratively by the Department of Islamic Thought, History & Culture at Allama Iqbal Open University and Al-Mustafa International University. During an open forum, the participating authors introduced themselves and shared their academic, religious, and literary contributions. It is worth noting that, under the directives of Vice-Chancellor Prof. Dr. Nasir Mehmood, professional development training workshops are being regularly conducted at the university. This workshop was also a part of that ongoing series.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}