{
  "article_id": "2025-02-10_7f6e1f7b041dc26a5c791d59cc61d8ba",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/commercial-lobbies-attempt-to-revive-monal-restaurant-chairperson-of-iwmb-expresses-concern/",
    "retrieved_at": "2025-08-27T12:33:37.739Z"
  },
  "metadata": {
    "title": "Commercial lobbies attempt to revive Monal restaurant, Chairperson of IWMB expresses concern",
    "author": null,
    "date_published": "2025-02-10T15:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 382,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 10 (APP):The Chairperson of the Wildlife Board, Rina Saeed Khan, expressed concerns on Monday over attempts by certain individuals to revive the Monal restaurant for business purposes, despite the fact that it was demolished following a Supreme Court order aimed at protecting the biodiversity of Margalla Hills National Park. Khan made these remarks during a press conference at the National Press Club in Islamabad, where she was joined by civil society member Nilofar Qazi, lawyer Umar Ijaz Gilani, and Mansoor Shehwani Khan, according to a press release. She criticized the owner of Monal for employing various tactics to gain favor, stating that the owner has been paying local villagers to protest about aunemploymenta and is also pressuring the Capital Development Authority (CDA) to grant him a new lease after the current board is removed. Khan expressed sympathy for the former employees of the restaurant but reiterated that protecting future generations and wildlife was the primary concern of the Wildlife Board. She emphasized that reviving the restaurant would be in direct violation of the Supreme Courtas orders, which clearly state: aConstructing a restaurant in a designated national park is a clear violation of the (Wildlife) Ordinance. Unrestricted construction and commercial activities within a national park also undermine its protected status.a Khan also criticized the CDA for its lack of action in determining the boundaries of the national park, as instructed by the court. She explained that the boundary demarcation, which has been pending for 45 years, was supposed to be completed within 60 days following a previous Islamabad High Court order. However, three years later, the CDA has still not finalized the process. The Wildlife Board Chairperson warned that continued commercial activities in Margalla Hills, particularly in the form of the Monal restaurant, posed a significant threat to the environment and wildlife. The Supreme Court had previously ordered the cancellation of all restaurant licenses operating within the national park, allowing only small kiosks to function. In response, the Wildlife Board recently launched a master plan to re-green 80 kanals of land recovered from illegal eateries. However, Khan pointed out that the CDA had been placing hurdles in the way of this re-greening effort, deliberately slowing down the plantation campaign initiated by the Islamabad Wildlife Management Board (IWMB) on the Margallah Ridge.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}