{
  "title": "Algeria, Pakistan reaffirms historic friendship, economic cooperation",
  "author": null,
  "content": "ISLAMABAD, Nov 01 (APP):The Embassy of Algeria in Pakistan on Friday hosted a grand reception here to celebrate the 71st anniversary of the National Day of the People’s Democratic Republic of Algeria commemorating the historic Glorious Revolution of November 1, 1954.\n\nThe event was graced by the Chief Guest, Haroon Akhtar Khan, Special Assistant to the Prime Minister on Industries and Production, along with ambassadors, senior officials, diplomats, parliamentarians, and members of the business community. A ceremonial cake was cut to mark the occasion.\n\nIn his address, Ambassador of Algeria Dr Brahim Romani paid tribute to the enduring friendship between Algeria and Pakistan, recalling that Pakistan was among the first nations to support Algeria’s liberation struggle during the 1955 Bandung Conference and later at the United Nations. “We recall with pride and gratitude Pakistan’s unwavering support during our revolution and after independence in 1962,” he said.\n\nHe highlighted the deep-rooted solidarity between the two countries, which continues through close coordination in regional and international forums, including their cooperation as non-permanent members of the UN Security Council. Both countries, he said, share firm commitments to multilateralism and the just causes of oppressed nations, especially Palestine and Western Sahara.\n\nAmbassador Romani described Algeria as a strategically significant country — the largest in Africa and the Arab world — positioned as a bridge between Africa, Europe, and Asia. He noted that under President Abdelmadjid Tebboune’s leadership, Algeria is witnessing rapid economic growth and modernization, with a GDP of around $270 billion in 2024 and projections to reach $400 billion by 2027.\n\nHe pointed out that Algeria has become a major energy and industrial hub, producing 50 billion cubic meters of gas annually and hosting over 17,000 new investment projects under a reformed investment law that equally benefits local and foreign investors. He also mentioned Algeria’s leadership in Africa’s start-up ecosystem, with more than 10,000 active companies.\n\nReferring to the success of the Intra-African Trade Fair hosted by Algeria in September—with participation from 132 countries and trade contracts worth $48.3 billion—Ambassador Romani said it reflected Algeria’s growing role as a leading center for business and regional integration.\n\nInviting Pakistani investors and entrepreneurs to explore Algeria’s vast opportunities in energy, mining, agriculture, and manufacturing, Dr. Romani emphasized that the two brotherly nations could build new economic bridges under Pakistan’s “Engage Africa” policy. “Algeria stands ready to strengthen partnerships with Pakistan and to open new avenues of cooperation across the public and private sectors,” he said.\n\nOn the occasion, Special Assistant to the Prime Minister on Industries and Production, Haroon Akhtar Khan, said that Pakistan is an open, reliable, and rewarding destination for global investors. He said the government is committed to creating a strong regulatory and industrial framework that encourages growth, safeguards partnerships, and empowers investors to play an active role in the country’s economic progress.\n\nHe expressed confidence that through mutual cooperation, Pakistan and Algeria can move forward together in industry, innovation, and prosperity. Extending heartfelt congratulations to the government and people of Algeria on their National Day, he wished continued progress for the North African nation and reaffirmed Pakistan’s desire to strengthen bilateral friendship.\n\n“May the bonds between Pakistan and Algeria grow even stronger, guided by shared values and a common vision for a better future,” he said.\n\nThe reception concluded in a festive atmosphere, celebrating the shared values of friendship, mutual respect, and partnership between Algeria and Pakistan.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/Embassy-of-Algeria-in-Pakistan-e1761971541168.jpg",
  "retrievedAt": "2025-11-01T14:08:57.520Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/algeria-pakistan-reaffirms-historic-friendship-economic-cooperation/",
  "dateList": "2025-10-28",
  "date_published": "2025-11-01T14:04:21.000Z"
}
