{
  "title": "Sadequain’s ‘The Stranger’ launched at PNCA",
  "author": null,
  "content": "ISLAMABAD, Oct 28 (APP):The Pakistan National Council of the Arts (PNCA), in collaboration with the Sadequain Foundation USA, unveiled the historic exhibition and book launch Albert Camus’ The Stranger by Sadequain, marking the first-ever public display in Pakistan of the artist’s rare lithographs inspired by the French Nobel Laureate’s masterpiece.\n\nThe event, held at the National Art Gallery, Islamabad, was inaugurated by Nicolas Galey, Ambassador of France to Pakistan, who attended as the chief guest.\n\nMs. Iram Rehman, President of Alliance Francaise d’Islamabad, graced the occasion as guest of honor.\n\nOrganized by Gallery 21 and Imarat Group in collaboration with PNCA and the Sadequain Foundation USA, the exhibition features Sadequain’s extraordinary 1964 series of lithographs interpreting Albert Camus’ existential novel The Stranger (L’Etranger) — a profound encounter between French literature and Pakistani art.\n\nSpeaking at the inauguration, Ambassador Nicolas Galey praised the exhibition as “a remarkable artistic bridge between France and Pakistan that celebrates shared intellectual and creative traditions.”\n\nHe added, “Camus and Sadequain both examined humanity’s eternal search for meaning-this exhibition revives that dialogue through art and philosophy.”\n\nPNCA Director General Ayub Jamali welcomed the collaboration, noting, “It is an honor to host Sadequain’s interpretation of Camus’ work at PNCA. His art continues to inspire new generations, and this exhibition reaffirms Pakistan’s commitment to preserving and promoting its cultural heritage at a global level.”\n\nMs. Iram Rehman commended the event as a “meaningful fusion of literature and visual art, connecting the philosophical depths of Camus with Sadequain’s symbolic expression.”\n\nArt enthusiasts, writers, diplomats, and students attended the launch, admiring how Sadequain visually reimagined the moral and existential questions central to The Stranger. The audience described the exhibition as a rare cultural dialogue-linking Paris and Karachi, literature and art, thought and expression.\n\nThe Sadequain Foundation USA, represented at the event, emphasized its ongoing efforts to archive, publish, and exhibit Sadequain’s works globally.\n\nThe exhibition, open to the public at PNCA Gallery, offers visitors a unique opportunity to witness Sadequain’s interpretation of one of the most influential novels of the 20th century — a timeless conversation between East and West through the universal language of art.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/0139300a-e29d-43c8-8184-379e710cedc6.jpeg",
  "retrievedAt": "2025-10-28T18:21:47.515Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sadequains-the-stranger-launched-at-pnca/",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T17:39:58.000Z"
}
