{
  "title": "Solar energy revolution is Pakistan’s wake-up call: Danyal Chaudhry",
  "author": null,
  "content": "ISLAMABAD, Oct 28 (APP):Parliamentary Secretary for Information & Broadcasting Barrister Danyal Chaudhry has described Pakistan’s emerging solar transformation as a “wake-up call” for the nation’s energy future, following the release of a groundbreaking national study by the Policy Research Institute for Equitable Development (PRIED).\n\nSpeaking at the Islamabad launch of the report “Shouting from the Rooftops: Mapping Pakistan’s Distributed Solar Power Revolution,”Barrister Danyal Chaudhry who is also Secretary of the Parliamentary Forum on Energy & Economy  said ‘the findings reveal a massive gap between official data and on-ground reality.\n\n“The official story was 175,000 net-metered systems. The reality, revealed today, is over 33 gigawatts of solar capacity, exceeding our national peak grid demand,” he stated. “This is not a state-led program; it’s a silent, grassroots revolution led by the people of Pakistan.”\n\nHe emphasized that while the citizen driven shift towards renewable energy is commendable, it also exposes urgent equity challenges. “We must ensure this solar revolution is not just for the privileged. Our policy focus must pivot towards enabling farmers, small businesses, and low-income families through accessible financing and fair regulations,” he urged. “This is our path to tackling both energy poverty and the circular debt crisis.”\n\nThe event, hosted by PRIED, featured key insights from CEO Muhammad Badar Alam, along with researchers Manzoor Ahmed, Muqaddas Ashiq, and Rimsha Rehan. Technical analysis on satellite based mapping was presented by Max Santos, Data Scientist at Transition Zero.\n\nA high level panel discussion brought together experts from across the sector, including Syed Faizan Ali Shah (Independent Consultant), Ather Rehman (NEPRA), Arqam Ilyas (LESCO), Umer Iftikhar (PESCO), Hasnat Khan (Pakistan Solar Association), Shaheera Tahir (PRIED), Salman Gul and Saeed Ahmed (ISMO), Aqeel Jafeeri and Uner Khan (PPIB), and Asad Ullah Chaudhary (NTDC).\n\nThe session concluded with remarks by Sher Ali Arbab, Co-convener of the Parliamentary Forum on Energy & Economy, and MPA Asif Khan, while the Chief Guest, Minister of State for Climate Change Dr. Shezza Mansab Ali Khan Kharal, lauded the study as a “milestone for evidence based climate policy and Pakistan’s clean energy transition.”\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/d2b30127-c824-4e45-aa7b-a63a1cfe89e3.jpeg",
  "retrievedAt": "2025-11-01T14:07:34.569Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/solar-energy-revolution-is-pakistans-wake-up-call-danyal-chaudhry/",
  "dateList": "2025-10-28",
  "date_published": "2025-11-01T14:04:21.000Z"
}
