{
  "title": "22 security men martyred in terror attacks - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Troops kill 11 terrorists in Harnai, 12 in Kalat; multiple hideouts dismantled\n• 18 soldiers embrace shahadat as they foil terrorist attempt to set up roadblocks; four Levies personnel targeted in D.I. Khan\n• President, PM condemn attack, praise forces\n\nQUETTA: In major counterterrorism operations, 23 terrorists were killed while 22 security personnel embraced martyrdom in Balochistan and Khyber Pakhtunkhwa over the past 24 hours, the military and district administration officials said on Saturday.\n\nAccording to the Inter-Services Public Relations, a security operation was launched following a terrorist attack in Kalat as part of ongoing efforts to eliminate terror threats in Balochistan.\n\nSecurity forces conducted another operation in the Harnai district, where 11 terrorists were killed and multiple hideouts dismantled, the ISPR said.\n\nEarlier, on the night between Friday and Saturday, security forces thwarted an attempt by terrorists to establish roadblocks in the Mangochar area of Kalat district. The military said that 18 paramilitaries lost their lives as they responded to terrorists, while 12 attackers were killed.\n\nA police official told AFP on condition of anonymity that a vehicle carrying unarmed border troops “came under gunfire from 70 to 80 armed assailants who had blocked the road”.\n\nIn a statement, the ISPR attributed the attack to hostile forces aiming to destabilise Balochistan and disrupt its peaceful environment. It emphasised that ensuing sanitisation operations are underway, and the perpetrators, facilitators and abettors of this heinous act will be brought to justice.\n\nThe military reaffirmed its commitment to thwarting all attempts to sabotage peace, stability and progress in Balochistan.\n\nThe banned Baloch Liberation Army claimed responsibility for the Mangochar attack, according to a statement issued by a spokesman of the outlawed organisation.\n\nD.I Khan bomb blast\n\nIn a late-night incident, four personnel of the Balochistan Levies and a civilian were martyred in a bomb att­ack in Dera Ismail Khan, near Baloch­istan’s border district of Dherani.\n\nPishin Assistant Commissioner Karezat confirmed the incident, adding that a Levies officer was among the deceased. He said the Levies personnel were on their way to recover a stolen truck when their vehicle was targeted by a bomb before reaching the D.I. Khan police station.\n\nThe vehicle caught fire after the blast, and all five people, including the four Levies personnel, were burned to death.\n\nThe D.I. Khan police are investigating the incident.\n\nAssault condemned\n\nPresident Asif Ali Zardari strongly condemned the terror attack in Kalat and expressed deep sorrow over the martyrdom of security personnel.\n\nIn a statement from the President’s Secretariat, he paid tribute to the fallen soldiers, prayed for their ranks in the hereafter and offered condolences to their families.\n\nPresident Zardari observed that terrorist elements wanted to disrupt peace in Balochistan and reiterated that security forces would continue their operations to eliminate enemies of the country.\n\n“The people of Pakistan had rejected those elements who wanted to disturb law and order in the country,” he said, adding that the entire nation supported its security forces in the fight against terrorism.\n\nHe paid tribute to security forces for eliminating 23 terrorists in various operations in Balochistan.\n\nHe commended the bravery of security forces for successfully neutralising the attackers during operations in different areas of the province, including Kalat and Harnai, according to the press release.\n\nPrime Minister Shehbaz Sharif also condemned the attack in Kalat and expressed deep sorrow over the martyrdom of 18 security personnel. He also commended the security forces for eliminating 12 terrorists during the operation. “Terrorists are enemies of Balochistan’s peace and development,” he stated, reaffirming that the fight against terrorism would continue until it is eradicated from the country.\n\nBalochistan Chief Min­ister Sarfraz Bugti praised the security operations. In a statement, he said security forces, through a timely and effective response, thwarted the malicious intentions of anti-state elements.\n\n“In the past 24 hours, 23 terrorists were killed, which is a testament to the bravery and professionalism of the security forces,” he added.\n\nThe chief minister paid tribute to martyrs, stating that brave soldiers defended the motherland by sacrificing their lives, and their sacrifices would always be remembered.\n\nWith input from APP\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:05:41.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889220/22-security-men-martyred-in-terror-attacks",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T02:36:22.000Z"
}
