{
  "title": "Scores expected in Berlin to protest against far-right - World - DAWN.COM",
  "author": null,
  "content": "Berlin on Sunday braced for scores of demonstrators to converge on the German capital to protest against the country’s conservatives’ norm-shattering overtures toward the far-right.\n\nOrganisers expect tens of thousands of people to turn up at 3:30pm (14:30 GMT) outside the Bundestag, Germany’s parliament building, and march towards the headquarters of the conservative CDU party.\n\nOn Saturday, more than 220,000 people already marched in cities across the country, including Hamburg, Leipzig, Cologne or Stuttgart, according to figures compiled by public broadcaster ARD.\n\nCalls for protests began after conservatives of the Christian Democratic Union (CDU) sought the support of the far-right Alternative for Germany (AfD) for a bill in parliament last week, less than a month ahead of a snap federal election.\n\nSince the end of World War II, German parties have had an unwritten agreement not to work with the far-right at the national level.\n\nBut CDU chief Friedrich Merz, frontrunner ahead of the February 23 election, sought the parliamentary support of the far-right AfD this week.\n\nThe two parties successfully passed a non-binding resolution on Wednesday in an attempt to block undocumented foreigners at the border, including asylum seekers. On Friday, they failed to pass another contentious bill to further restrict immigration.\n\nMerz launched his all-out immigration crackdown after police arrested an Afghan man following a deadly knife attack a week ago against a group of kindergarten children.\n\nHe “wants to cut through” the norm of not working with “right-wing extremists in one fell swoop”, said left-wing NGO Campact, one of the organisers of protests in Berlin. Many trade unions, civil society and human rights groups, churches and environmental activists have answered the call.\n\nCentre-left Chancellor Olaf Scholz has warned that the conservatives and the far-right could soon join forces to govern the country, as has been the case in other countries.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/02205447635ae60.jpg",
  "retrievedAt": "2025-08-25T19:17:38.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889327/scores-expected-in-berlin-to-protest-against-far-right",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T15:58:12.000Z"
}
