{
  "title": "Gold loses shine for buyers as prices continue to rise - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Gold continued to record on Saturday with prices of 10 grams and one tola, reaching another historic high.\n\nThe rising price has also made the precious commodity out of people’s reach.\n\nThe price of 10g and one tola reached Rs250,514 and Rs292,200, respectively, up by Rs343 and Rs400 from Friday.\n\nAs per the All Pakistan Sarafa, Gems and Jewellers Association, the price in the global market increased by $5 to $2,797 per ounce.\n\nThis rate of the precious commodity has been continuously rising for the past 10 days.\n\nRates for 10 grams and one tola hit another high in local market\n\nThe hike came on the back of a rally in global bullion rates amid high tariff threats by the US government and geopolitical tensions, the impact of which is being felt in the domestic rates despite rupee-dollar stability.\n\nWhile the increasing price was taking gold out of the purchasing power of buyers, local investors are focusing on buying the commodity as they divest from the US dollar.\n\nBesides, a drop in interest rates is also forcing investors to park their investments in the metal as returns on certificates and bank deposits continue to dip.\n\nThe stock investors are also moving towards gold after benefitting from rising share prices last year.\n\nSamiullah Tariq, the head of research and development at the Pak Kuwait Investment Company, said gold is considered an investment “safe haven” in Pakistan.\n\nHe explained that gold prices are mainly driven by international demand and supply, and Pakistan was a “small player” in the commodity’s global market.\n\nAs per the Pakistan Bureau of Statistics data, gold import rose to $277kg ($19.7 million) in the first half of the FY25 from 210kg ($13.5m) in the same period last year.\n\nUncertain gold market\n\nMeanwhile, gold traders across Karachi are experiencing a significant dip in sales as the commodity has gone out of people’s purchasing power due to rising prices.\n\nThe shops give a deserted look, especially during the evenings, owing to the lack of buyers’ footfall.\n\nAbdullah Abdul Razzak Chand, a local trader, recalled the time when people used to bring old jewellery to make new ones. Now, the lower middle class “can only dream of gold,” and even the middle class is “shifting towards silver jewellery” as gold is getting out of their reach, said Mr Chand, who is also the vice president of Society Welfare Association at Tariq Road.\n\n“It is a difficult time for many people to make a full jewellery set of one tola,” Mr Chand said.\n\nHe claimed that families who used to buy four to six tolas were now purchasing a mere 1.5 or two tola jewellery sets.\n\nSimilarly, families who used to order four gold bangles of one tola each can now only afford half of that.\n\nWhile people are not only unable to buy new jewellery, they have also been compelled to sell what they have as the cost of living continues to rise.\n\n“For the past three years, people have been selling their old jewellery sets or low-weight gold bars to pay hefty power and gas bills and children’s educational expenses besides managing daily expenses,” he added.\n\nHe said many people who became jobless during the Covid-19 pandemic were also forced to sell their jewellery to pay utility bills.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:17:47.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889269/gold-loses-shine-for-buyers-as-prices-continue-to-rise",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T03:35:24.000Z"
}
