{
  "title": "PM launches first anti-polio drive for 2025; vows to eradicate disease from country - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Sunday launched the year’s first nationwide anti-polio campaign, running from February 3 to 9, by administering polio drops to children under five and vowing to eradicate the disease from the country.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nLast year, the country reported more than 70 polio cases, with the virus detected in around 90 districts. This year, the first case was reported in Khyber Pakhtunkhwa’s Dera Ismail Khan district.\n\nAddressing the launching ceremony of the anti-polio drive today, the prime minister reaffirmed his determination to eliminate the disease from Pakistan.\n\nAccording to The Associated Press of Pakistan, he said, “The national polio vaccination drive would target millions of children to save their future and health.”\n\nThe premier hoped that the dedicated teams would work “day and night to eradicate the disease, and would reach the far-flung areas and villages,” adding these teams would successfully meet the huge responsibility by “utilising their complete energies”.\n\nThe prime minister said that unfortunately, during the last year, a total of 77 polio cases were reported in the country which emerged as a huge challenge, besides posing a setback.\n\nOn the first case for the year reported last month, the premier expressed resolve to eradicate polio at all costs; with dedicated teamwork and support from the international partners.\n\nThe prime minister also expressed the hope that with international coordination and support, the crippling disease in the neighbouring brotherly country Afghanistan would end.\n\nHe appreciated all the international partners including the World Health Organisation, Unicef, Bill Gates Foundation and the Kingdom of Saudi Arabia for their commitment and efforts to the government in its efforts to eliminate polio.\n\nPolio is a paralysing disease that has no cure. Multiple doses of the oral polio vaccine and completion of the routine vaccination schedule for all children under the age of five are essential to provide children with high immunity against this terrible disease.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0218351149c1ad8.png",
  "retrievedAt": "2025-08-25T19:17:38.217Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889317/pm-launches-first-anti-polio-drive-for-2025-vows-to-eradicate-disease-from-country",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T13:28:13.000Z"
}
