{
  "title": "Repatriation of Morocco boat tragedy survivors completes - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: The repatriation of at least 22 Pakistani survivors of last month’s boat tragedy has been completed with the arrival of the last batch of eight survivors at Islamabad airport on Saturday.\n\nA senior official of the Federal Investigation Agency (FIA), Gujranwala, told Dawn that some 15 survivors of the Mauritania-Morocco boat tragedy had been brought back during the last couple of days.\n\nThe official said that out of the eight survivors who arrived on Saturday, four each hailed from Gujranwala and Gujrat regions.\n\nThey were taken to Gujranwala anti-human trafficking cell straight from Islamabad airport for questioning.\n\nEight Pakistanis arrive in last batch\n\nFIA Gujranwala Zone Director Abdul Qadir Qamar said all the previous 15 survivors had been allowed to return home after being questioned by the relevant investigation teams. He said survivors of the last repatriation batch might also be allowed to go home after completion of legal formalities and questioning.\n\nOn the other hand, the FIA Gujrat circle started registering more cases of human trafficking in the light of questioning and statements by the repatriated survivors. A fresh case was registered against a suspected human trafficker of Mandi Bahauddin.\n\nOfficial sources said Muhammad Nawaz of Phalia tehsil was arrested in a case under Section 17/22 of Emigration Ordinance-1979 and Section 3/6 of Prevention of Smuggling of Migrants Act-2018. The suspect allegedly extorted Rs4.9 million from complainant Sohail Abbas of Phalia, district Mandi Bahauddin, promising him to send his brother-in-law Zaigham Abbas to Spain for overseas employment through legal channels.\n\nBut later the suspect, with the connivance of other agents, sent him through an illegal channel by sea. However, the ship sank on its way to Spain and the immigrant went missing or died.\n\nTwo caught with forged documents\n\nAt the Sialkot international airport, two suspicious passengers were caught during routine checking of documents and sent to FIA anti-human trafficking cell of Gujrat for legal action.\n\nOne of the passengers was offloaded from an Emirates flight (EK-619) at Sialkot airport on Saturday.\n\nThe FIA immigration authorities examined the passport of Imran Ali of Gujrat, who was travelling to South Africa, but during the scrutiny of his documents it was found that the expiry date of South African visa was tampered with. On interrogation, he disclosed that he approached an agent, Mohsin Tanveer, in Sialkot but the agent tampered with the visa expiry date before returning the passport.\n\nAfter initial questioning, the passenger was shifted to the anti-human trafficking cell of the FIA.\n\nAnother passenger was detained at Sialkot airport upon his return from the UAE during immigration clearance of an Air Arabia flight (G9552).\n\nThe passenger, Faisal Ilyas of Wazirabad, arrived from Sharjah and during the scrutiny, a fake Hungarian visa was found pasted on the passport.\n\nOn being interrogated, he disclosed that he has been employed in Sharjah since 2015, where he met an Indian agent, namely Ms Banita, through his uncle Nadeem Sahi who resides in France.\n\nHe wanted to go to Hungary for a job and approached the agent who resides in the UAE, paying 15,000 dirhams to her for an employment visa.\n\nAfter the deal, she provided the fake Hungarian visa, he told the FIA immigration authorities. Later, he was taken to the anti-human trafficking cell of Gujrat for legal action.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:05:43.337Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889196/repatriation-of-morocco-boat-tragedy-survivors-completes",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T02:52:09.000Z"
}
