{
  "title": "Journalists protest Peca amendments in Peshawar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Journalists on Saturday protested the amendments to the Prevention of Electronic Crimes Act (Peca), 2025, and asked the government to withdraw the tweaks.\n\nThe protesting media personnel shouted slogans against the amendments and said that any legislation, without consultation with the stakeholders, was not acceptable and restrictions on freedom of expression would never be tolerated.\n\nApart from journalists who gathered outside the Peshawar Press Club, representatives of political parties, including Awami National Party and Pakistan Tehreek-i-Insaf and business community, also joined the media personnel and chanted slogans against the amendments.\n\nThey said the government wanted to silence voices under the guise of ‘fake news’.\n\nSpeaking on the occasion, Khyber Union of Journalists president Kashifuddin said the amendments were an attempt to suppress the voices of journalists. “The amendments would never be accepted under any circumstances.”\n\nHe said that journalists would continue to protest the amendments, and warned that the journalists’ community would continue to agitate until the controversial tweaks were withdrawn.\n\nThe union’s general secretary Irshad Maidani, president Peshawar Press Club M Riaz and senior journalist Shamim Shahid also spoke on the occasion.\n\nThe protesters also commended the provincial government for filing a privilege motion against the press club vice-president Irfan Khan and demanded its withdrawal.\n\nThey said the provincial government should not adopt the same approach the federal government had adopted.\n\nAlso, protests were held in Lower and Upper Dir, Dera Ismail Khan, South Waziristan, Khyber and other districts.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:17:50.924Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889175/journalists-protest-peca-amendments-in-peshawar",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T02:52:43.000Z"
}
