{
  "title": "Plan in motion to carve out pedestrian street in Rawalpindi’s Raja Bazaar - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The district administration on Saturday commenced its plan to turn Raja Bazaar into a model bazaar in the garrison city and establish a pedestrian street from Fawara Chowk to Dingi Khoi on Hamilton Road.\n\nA senior official told Dawn that the district administration, the Parks and Horticulture Authority (PHA), the Rawalpindi Municipal Corporation (RMC), and the traffic police have started working on the execution of the Raja Bazaar beautification project.\n\n“This plan will be executed in three phases. In the first phase, all the Suzuki vans and rickshaws will not be allowed to stop at Fawara Chowk. In the second phase, traffic police will control the traffic congestion, and in the third phase, all electricity and telephone and cable lines will be moved underground. After this step, a pedestrian street will be declared from Fawara Chowk to Hamilton Road (Dingi Khoi),” he said.\n\nAccording to the official, public transport vehicles will not be able to park at Fawara Chowk and on Iqbal Road; such vehicles will stop at Bank Square near Bara Market. “On City Saddar Road, the parking for public vehicles will be allowed at the RMC old office’s vacant plot. Namaak Mandi’s unoccupied location will be allocated to the traffic coming from Hamilton Road, as no vehicle will be allowed to enter Raja Bazaar,” he said.\n\nDistrict admin aims to turn commercial centre into model bazaar, arrange parking spots\n\nThe official said the bazaar would get uniform signboards, which would be done by the traders themselves while underground wires and revamping of the roads would be handled by the Rawalpindi Municipal Corporation.\n\nHe said that the Parks and Horticulture Authority had been assigned the task of improving the condition of Fawara Chowk and coming up with a beautification plan for the roads. He said that PHA had started working on this project.\n\nAssistant Commissioner City Hakim Khan told Dawn the beautification plan had started and the anti-encroachment drive was also ratcheted up to retrieve state land from the shopkeepers. He said public transport, including rickshaws and Suzuki vans, was the main hurdle in the traffic flow so the administration would not allow them to enter Fawara Chowk.\n\nThe official said Namak Mandi land would be used as a parking space for rickshaws and vans while the vehicles coming from Bagh Sardaran and Jamia Masjid Road will turn toward Gunjmandi via Hamilton Road.\n\n“We will make Raja Bazaar from Fawara Chowk to Hamilton Road a pedestrian street, but we will do all the development work before it, including making arrangements for the parking of vehicles and public transport,” he said.\n\nHe claimed beautification work would increase trade in the commercial hub of the district. In reply to a question about funding, he said that Commissioner Aamir Khattak and Deputy Commissioner Dr Hassan Waqar Cheema initiated the project and they had asked the Rawalpindi Municipal Corporation to make PC-I for work as it had development funds available.\n\nOn the other hand, the Rawalpindi Traders Association appreciated the district administration for the anti-encroachment drive and the beautification plan, but expressed resentment over the plan to turn Raja Bazaar into a pedestrian street. “It is a wholesale market for which the movement of loading vehicles is essential…otherwise, transport charges will increase for the shopkeepers,” said Sharjeel Mir.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:06:11.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889160/plan-in-motion-to-carve-out-pedestrian-street-in-rawalpindis-raja-bazaar",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T02:52:35.000Z"
}
