{
  "title": "Jailed far-right activist sparks rival rallies in London - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Thousands of supporters of jailed far-right agitator Tommy Robinson marched in London on Saturday demanding his release, with police deployed to keep them apart from a large counter-protest.\n\nRobinson, 42, is serving an 18-month jail term in London’s Belmarsh prison, imposed in October after he admitted breaching a 2021 High Court injunction. Protestors organised under the name “Stop the Isolation” and “Unite the Kingdom” gathered outside Waterloo railway station before heading towards parliament.\n\nMany waved England flags, with one reading “stop the boats”, while others wore red hats carrying the initials MEGA (Make England Great Again), a variation on US President Donald Trump’s campaign slogan.\n\n“Tommy Robinson shouldn’t be in prison, he is a political prisoner,” protester Liz, 55, from Birmingham in central England, said. “This country needs someone like Trump. He is strong, he is getting rid of illegals,” she added.\n\nMany waved England flags, with one reading ‘stop the boats’, while others wore red hats carrying the initials MEGA\n\nSome protesters held placards reading “end state-sanctioned persecution”, “Free Tommy” and “UK, stop the rape of white children”, in reference to a “grooming gangs” scandal in which thousands of girls around the country were sexually abused.\n\nThe issue recently resurfaced when X owner Elon Musk made incendiary comments after the Labour government resisted calls to hold a national inquiry into the decade-old scandal. Musk, a top Trump ally, also reposted several comments on the social media platform calling for Robinson’s release.\n\nCounter-march\n\nDemonstrator Craig, 50, who held up a T-shirt reading “thank you Elon Musk”, said that “the UK justice system is corrupt”. “Elon Musk has been speaking for us, he is a great help,” added Craig.\n\nThe crowds sang Robinson’s name, along with “Rule Britannia”, as they started the march towards the prime minister’s residence in Downing Street. A large counter-protest organised by Stand Up to Racism was to march to Trafalgar Square, close to the final gathering point of the main demonstration.\n\nWeyman Bennett, Stand Up to Racism co-convenor, said: “We saw the power of mobilising against the far right in response to last summer’s racist riots. “We must bring that anti-racist spirit onto the streets of London and reject the politics of hate,” he added.\n\nOfficers were on hand to keep the groups apart. “We have officers deployed in significant numbers to provide reassurance to the wider community and to give us the capability to intervene swiftly and decisively if incidents of crime or disorder occur,” said the police chief in charge of the security operation, Louise Puddefoot.\n\nRobinson, whose real name is Stephen Yaxley-Lennon, is a leading figure in Britain’s increasingly visible far-right scene, with around a million followers on X. He was prominent online throughout the anti-immigrant unrest that rocked the country last year.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/679ea78e0307a.jpg",
  "retrievedAt": "2025-08-25T19:18:00.807Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889206/jailed-far-right-activist-sparks-rival-rallies-in-london",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T02:52:24.000Z"
}
