{
  "title": "Canada and Mexico retaliate, China offers toned-down response as Trump launches trade war - World - DAWN.COM",
  "author": null,
  "content": "As US President Donald Trump on Saturday ordered sweeping tariffs on goods from Mexico, Canada and China, the United States’ neighbours announced retaliatory tariffs, while China pledged “countermeasures” in a toned-down response.\n\nThe tariffs demand the countries stanch the flow of fentanyl — and illegal immigrants in the case of Canada and Mexico — into the United States, kicking off a trade war that could dent global growth and reignite inflation.\n\nIn three executive orders, Trump imposed 25 per cent tariffs on Mexican and most Canadian imports and 10pc on goods from China, starting on Tuesday.\n\nMexico and Canada, the US’s top two trading partners, immediately vowed retaliatory tariffs. While China said it would challenge Trump’s move at the World Trade Organisation (WTO) and take other “countermeasures”, it also urged the US to “engage in frank dialogue”.\n\nTrump vowed to keep the duties in place until what he described as a national emergency over fentanyl, a deadly opioid, and illegal immigration to the US ends. The White House provided no other parameters for determining what might satisfy Trump’s demands.\n\nResponding to concerns raised by oil refiners and Midwestern states, Trump imposed only a 10pc duty on energy products from Canada, with Mexican energy imports facing the full 25pc tariff.\n\nA White House fact sheet said the tariffs would stay in place “until the crisis alleviated”, but gave no details on what the three countries would need to do to win a reprieve.\n\nAt nearly $100bn in 2023, imports of crude oil accounted for roughly a quarter of all US imports from Canada, according to US Census Bureau data.\n\nAutomakers would be particularly hard hit, with new steep tariffs on vehicles built in Canada and Mexico burdening a vast regional supply chain where parts can cross borders several times before final assembly.\n\nThe tariff announcement makes good Trump’s repeated threat during the 2024 presidential campaign and since taking office, defying warnings from top economists that a new trade war with the top US trade partners would erode US and global growth, while raising prices for consumers and companies.\n\nRepublicans welcomed the news, while industry groups and Democrats issued stark warnings about the impact on prices.\n\nNational Foreign Trade Council President Jake Colvin said Trump’s move threatened to raise the costs of “everything from avocados to automobiles” and urged the US, Canada and Mexico to find a quick solution to avoid escalation.\n\nThe three countries should work together to “gain a competitive advantage and facilitate American companies’ ability to export to global markets”, Colvin said in a statement.\n\nProvincial officials and business executives in Canada also reacted with outrage, calling for forceful tariffs on imports from the US.\n\nRoughly 90 minutes after Trump’s announcement, the American national anthem was booed in the nation’s capital Ottawa ahead of the opening face-off at the Ottawa Senators and Minnesota Wild National Hockey League game. The Senators won 6-0.\n\nUS tariff collections are set to begin at 12:01am EST (10:01am PKT) on Tuesday, according to Trump’s written order. But imports that were loaded onto a vessel or onto their final mode of transit before entering the US before 12:01am on Saturday would be exempt from the duties.\n\nTrump declared the national emergency under the International Emergency Economic Powers Act and the National Emergencies Act to back the tariffs, which allow the president sweeping powers to impose sanctions to address crises.\n\nTrade lawyers said Trump was once again testing the limits of US legislation and the tariffs could face legal challenges, while Democratic lawmakers Suzan DelBene and Don Beyer decried what they called “a blatant abuse of executive power”.\n\nWhite House officials said there would be no exclusions from the tariffs and if Canada, Mexico or China retaliated against American exports, Trump would likely increase the US duties.\n\nNova Scotia’s Premier Tim Houston said he directed that all alcohol imported from the US be removed from the province’s store shelves.\n\nThe White House officials said that Canada specifically would no longer be allowed the “de minimis” US duty exemption for shipments under $800. The officials said Canada, along with Mexico, has become a conduit for shipments of fentanyl and its precursor chemicals into the US via small packages that are not often inspected by customs agents.\n\nCanadian Prime Minister Justin Trudeau said Canada would respond with 25pc tariffs against $155 billion of US goods, beginning with $30bn taking effect on Tuesday and $125bn 21 days later.\n\nThe Canadian leader said tariffs would include American beer, wine and bourbon, as well as fruits and fruit juices, including orange juice from Trump’s home state of Florida. Canada would also target goods including clothing, sports equipment and household appliances.\n\nHe urged his own citizens to forego travel to the US and to boycott US products. Canada is considering non-tariff measures, potentially relating to critical minerals, energy procurement and other partnerships, Trudeau said.\n\nTrudeau warned US citizens that Trump’s tariffs would raise their grocery and gasoline costs, potentially shutting down auto assembly plants and limiting supplies of goods such as nickel, potash, uranium, steel and aluminium.\n\n“Tariffs against Canada will put your jobs at risk, potentially shutting down American auto assembly plants and other manufacturing facilities,” Trudeau said, addressing US citizens during a press conference in Ottawa.\n\n“They will raise costs for you, including food at the grocery store and gas at the pump.”\n\nThe tariffs hit Canada as it deals with a political crisis and a leadership race within Trudeau’s Liberal Party. Facing low approval ratings, Trudeau has said he will resign after nine years in office once a new party leader is chosen. The opposition Conservatives could win the next election by a thumping majority, according to recent opinion polls.\n\nFlanked by his foreign affairs and finance ministers a somber Trudeau recalled the years of bilateral relations between the two countries.\n\n“From the beaches of Normandy to the mountains of the Korean Peninsula, from the fields of Flanders to the streets of Kandahar, we have fought and died alongside you during your darkest hours,” he said. “We’ve built the most successful economic, military and security partnership the world has ever seen.”\n\nMexican President Claudia Sheinbaum, in a post on X, said she was instructing her economy minister to implement retaliatory tariffs but gave no details.\n\nCanada and Mexico said they were working together to face Trump’s tariffs.\n\nThe European Union on Sunday blasted US President Donald Trump’s sweeping tariffs on Canada, Mexico and China, and said the 27-nation bloc would hit back “firmly” if targeted.\n\n“The European Union regrets the US decision to impose tariffs on Canada, Mexico, and China,” said a spokesman for the European Commission. “Tariffs create unnecessary economic disruption and drive inflation. They are hurtful to all sides.”\n\nThe spokesman said: “The EU would respond firmly to any trading partner that unfairly or arbitrarily imposes tariffs on EU goods”.\n\n“At this time, we are not aware of any additional tariffs being imposed on EU products,” he added.\n\nHe said the 27-nation EU remained committed to low tariffs as a way to “drive growth and economic stability within a strong, rules-based trading system”.\n\nAnd he reiterated the EU’s commitment to its trade and investment relationship with the United States — “the biggest in the world”.\n\n“There is a lot at stake,” said the spokesman. “We should both be looking at strengthening this relationship. “\n\nMeanwhile, China’s government denounced the Trump administration’s imposition of a long-threatened 10pc tariff on Chinese imports while leaving the door open for talks with the US that could avoid a deepening conflict.\n\nBeijing will challenge Trump’s tariff at the WTO — a symbolic gesture — and take unspecified “countermeasures” in response to the levy, which takes effect on Tuesday, China’s finance and commerce ministries said.\n\nThat response stopped short of the immediate escalation that had marked China’s trade showdown with Trump in his first term as president and repeated the more measured language Beijing has used in recent weeks.\n\nChina’s toned-down response marked a contrast with the direct retaliation and heated language from Canada, a long-time US ally, and Mexico, the top destination for US exports.\n\nChina’s commerce ministry said in a statement that Trump’s move “seriously violates” international trade rules, urging the US to “engage in frank dialogue and strengthen cooperation”.\n\nChina’s sharpest pushback today was over fentanyl, an area where the Biden administration had also been urging Beijing to crack down on shipments of the China-made precursor chemicals needed to manufacture the drug.\n\n“Fentanyl is America’s problem,” China’s foreign ministry said. “The Chinese side has carried out extensive anti-narcotics cooperation with the United States and achieved remarkable results.”\n\nFiling a lawsuit with the WTO could allow Beijing a win in messaging by standing up for the rules-based trading system long advocated by US administrations of both parties. Beijing has taken the same step in a challenge to tariffs of up to 45pc on Chinese-made electric vehicles by the European Union.\n\nAt the same time, a WTO appeal poses no immediate cost or threat to Washington.\n\nThe WTO’s dispute settlement system has been effectively shut down since 2019 when Trump blocked appointments of judges to handle appeals. Since former US president Barrack Obama, the US has charged that the WTO appeals body had overstepped its authority.\n\nFor weeks Chinese foreign ministry spokesperson Mao Ning has said Beijing believes there is no winner in a trade war.\n\nChinese officials have also been encouraged by signs Trump could be seeking a more nuanced relationship with China since a conversation he had with Chinese leader Xi Jinping last month. Both Republicans and Democrats have come to view China as the biggest foreign policy and economic challenge to the US.\n\nChina’s massive trade surplus — almost $1 trillion last year — is a vulnerability for Beijing. China’s exports in key industries, including autos, have been growing faster in volume than value, suggesting manufacturers are discounting to try to win overseas sales when demand at home has been sputtering.\n\nFor that reason, analysts have expected China to try to strike a deal early with Trump to soften the blow from trade action by the US.\n\nChina has also been preparing for the long-expected Trump move on tariffs for months by deepening ties with allies, pushing for some self-reliance in key areas of technology and setting aside funds to prop up a vulnerable economy.\n\nTrump spoke extensively about the tariffs on Friday, acknowledging they could lead to disruptions and hardships for Americans. He said additional tariffs were planned against steel, aluminium, semiconductor chips and pharmaceuticals.\n\nThe Republican president was not scheduled to speak to reporters about the tariffs after the announcement.\n\nTrump’s tariff move was led by Deputy Chief of Staff Stephen Miller, a forceful hawk on illegal immigration, and Trump’s nominee to head the Commerce Department, Howard Lutnick, who flew to Florida with Trump on Friday, a White House official said.\n\nLess than two weeks into his second term, Trump is upending the norms of how the United States is governed and interacts with its neighbours and the wider world.\n\nA model gauging the economic impact of Trump’s tariff plan from EY Chief Economist Greg Daco suggests it would reduce US growth by 1.5 percentage points this year, throw Canada and Mexico into recession and usher in “stagflation” at home.\n\n“Steep tariff increases against US trading partners could create a stagflationary shock — a negative economic hit combined with an inflationary impulse — while also triggering financial market volatility,” Daco wrote on Saturday.\n\nThat volatility was evident on Friday, when the Mexican peso and Canadian dollar both slumped after Trump vowed to fulfil his threats. US stock prices also fell and Treasury bond yields rose.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/021530456d6569d.jpg",
  "retrievedAt": "2025-08-25T19:17:46.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889288/canada-and-mexico-retaliate-china-offers-toned-down-response-as-trump-launches-trade-war",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T05:25:11.000Z"
}
