{
  "title": "Islamabad lawyers announce strike tomorrow over ‘unconstitutional’ judicial appointments - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad Bar Council, Islamabad High Court Bar Association, and Islamabad District Bar Association, in a joint meeting on Sunday, announced a strike in the district courts and the Islamabad High Court tomorrow to protest what they call “unconstitutional measures” undermining the judiciary and legal profession.\n\nThe move comes a day after President Asif Ali Zardari approved the transfer of a Lahore High Court (LHC) judge, Justice Sardar Muhammad Sarfraz Dogar, along with two others, to the IHC despite opposition from five IHC judges. They warned in a letter to top judges that his elevation as IHC chief justice would “violate constitutional procedures and judicial norms”.\n\nAccording to a resolution passed in a joint session of the capital’s legal fraternity today, a strike will be observed tomorrow to protest the “unconstitutional measure affecting the judiciary and the legal profession”.\n\n“The legal fraternity of Islamabad ensures its commitment to resist the unjustified transfers and appointments of judges from other provinces to the IHC,” said the resolution, a copy of which is available with Dawn.com.\n\nLawyers said that they would pursue “all legal and constitutional avenues to challenge this decision and safeguard the judicial independence of Islamabad”.\n\nThe legal fraternity further demanded that the Bar Association’s application — seeking the nullification of the 26th Constitutional Amendment — be heard by all 16 judges of the Supreme Court.\n\nIt condemned the Judicial Commission of Pakistan’s (JCP’s) decision to call a meeting to appoint additional judges to the SC in February and called the action a “blatant attempt to manipulate the court’s composition, filling it with individuals favoured by the ruling parties and establishment”.\n\nThe resolution said that the move blatantly disregarded the fundamental principle of an independent judiciary, undermining the public’s trust in the legal system.\n\n“Lawyers across the nation firmly believe that no appointments to the SC should proceed until a final decision is reached on the petitions challenging the validity of the 26th Amendment,” it claimed, calling for the postponement of the JCP meeting on February 10.\n\nSpeaking about the letter by the IHC judges, the resolution supported the stance of the senior judges, demanding that the IHC chief justice must be appointed from the senior-most judges present in the court to “ensure fairness and merit-based selections”.\n\nThe legal community strongly opposed the controversial amendments to the Prevention of Electronic Crimes Act (Peca), calling it a “tool for suppressing freedom of expression and curbing press freedom”.\n\n“An All Pakistan Lawyers’ Convention will be held under the Islamabad Bar Council tomorrow, February 3 at 11am at the District Judicial Complex, G-11/4, Islamabad, to formulate future strategy,” the resolution said.\n\nLater today, PML-N Senator Irfan Siddiqui questioned the apex court judges whether they have taken an oath to uphold and protect the Constitution.\n\n“If yes, then isn’t Article 200 part of the constitution?” Senator Siddiqui said in a post on X.\n\nArticle 200 of the Constitution states: “The president may transfer a judge of a high court from one high court to another high court, but no judge shall be so transferred except with his consent and after consultation by the president with the chief justice of Pakistan and the chief justices of both high courts.”\n\nShould we prioritise the clear constitutional provision or a “letter,” the Senator said.\n\nTraditionally, the senior puisne judge of a high court is appointed as the chief justice. Still, the JCP last year introduced new rules to bypass the seniority criterion in light of the 26th Amendment. The commission proposed that the chief justice of a high court could be appointed from among the panel of five senior-most judges.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:17:38.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889305/islamabad-lawyers-announce-strike-tomorrow-over-unconstitutional-judicial-appointments",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T12:02:45.000Z"
}
