{
  "title": "NAB’s open session on Ponzi schemes in Lahore - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: The National Accountability Bureau on Saturday launched WhatsApp groups for the convenience of complainants.\n\nNAB’s Lahore Director General (DG) Ihtiram Dar held his first public hearing since assuming office. The open session drew 350 victims of Ponzi schemes and illegal housing societies.\n\nAmong the complainants were investors entangled in financial scandals, including Prime Zone Scandal, Unique Solar Panels Scandal, ForUReal Traders and various other fraudulent investment companies.\n\nAdditionally, victims of the housing sector linked to Omega Housing Society, Al-Rehman Garden Phase-IV, Grand Avenue Housing, Pak-Arab Housing and Formanites Housing Society were also in attendance. Talking to the victims, the DG said instructions had been issued to prioritise mega fraud cases and ensure swift relief to the affectees.\n\nLaunches WhatsApp groups for convenience of complainants\n\nHe said an open-door policy was being operated to assist citizens and WhatsApp groups had been opened to keep victims informed on their cases to enhance communication and maintain transparency.\n\nDuring the session, victims of an investment company scandal disclosed that fraudsters had exploited the names of renowned medical stores on social media, enticing the public with promises of high returns.\n\nIn response, the DG ordered immediate publication of newspaper advertisements against the company’s management.\n\nProviding an update on the Prime Zone Scandal, the NAB Lahore chief announced that the investigation had concluded in a limited time frame, however, formal approval has also been sought for reference to be filed in the accountability court during the upcoming week.\n\nHe further revealed that NAB had also coordinated with the Federal Investigation Agency (FIA) to issue red warrants for the prime suspect, Imran. His arrest through Interpol would represent a significant breakthrough in the case.\n\nFor the victims of the ForU Real Traders case, DG NAB Lahore highlighted that since October 2024 to date, statements of over 1,000 affectees had been recorded.\n\nHe further told the victims that all suspects had been placed on the Exit Control List (ECL), effectively preventing them from fleeing the country, however, investigations are progressing at an accelerated pace, with a firm commitment to ensuring the case reaches its logical conclusion without delay, said NAB Lahore DG.\n\nPublished in Dawn, February 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:17:40.324Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889253",
  "dateList": "2025-02-02",
  "date_published": "2025-02-02T03:19:45.000Z"
}
