{
  "title": "Saira Peter mesmerises audience with her magical voice at PNCA",
  "link": "https://www.app.com.pk/national/saira-peter-mesmerises-audience-with-her-magical-voice-at-pnca/",
  "date_published": "2023-12-02T18:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP):Sufi opera singer Saira Peter, a British-Pakistani soprano recognised as Pakistan’s first Sufi Opera singer on Saturday mesmerised the audience with her magical voice at a musical evening in Pakistan National Council of the Arts (PNCA).\nFederal Minister for National Heritage and Culture Syed Jamal Shah graced the wonderful event as the chief guest which was held at PNCA.\nProminent government officials, Diplomats and a large number of people also attended the event.\nIn his opening remarks, Director General PNCA Muhammad Ayuob Jamali welcomed the guests at the PNCA Auditorium.\nOn the occasion, Federal Minister for National Heritage and Culture Jamal Shah appreciated the performance of Saira Peter and said that the people here love music.\nHe termed Saira Peter as a highly accomplished singer.\nSaira Peter and her husband music director Stephen Smith started the performance with classical opera receiving high applause from the audience and from there, Saira went on to perform Sufi Kalam.\nSaira Peter has also the distinction of being the world’s first Sufi opera singer.\nSaira Peter has received an overwhelming response to his live performance in the jam-packed PNCA Auditorium.\nSaira presented opera and classical songs, Urdu, Pashtu, ‘thumri’, ‘ghazals’, film, Sindhi, Balochi and Punjabi songs.\nShe also sung a special Arabic song during her performance. Saira Peter and her enthusiastic audience shared lively interaction throughout the concert.\nShe conveyed her love for the music of her homeland and thanked PNCA for showing so much honour.\nPassionate about bringing together people of all backgrounds, Saira Peter identified music as a historical means of promoting a positive message.\nSimultaneously while studying Western Classical voice, she envisioned using her music to take Sufi peace poetry to the world stage.\nShe is currently working with a team of British artists to develop the world’s first full-scale “Sufi Opera”, a musical stage drama based on the story of Umar Marvi, one of Latif’s “seven heroines” of Sindh.\nSaira Peter has also pioneered a fusion style of the qawwali genre in which she incorporates both Western operatic and South Asian classical styles of singing.",
  "retrievedAt": "2025-08-11T10:48:21.422Z"
}
