{
  "title": "President underlines need for special efforts to include PWDs in all walks of life",
  "link": "https://www.app.com.pk/national/president-underlines-need-for-special-efforts-to-include-pwds-in-all-walks-of-life/",
  "date_published": "2023-12-02T18:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP): President Dr Arif Alvi has urged the government organizations and civil society to make special efforts for the inclusion of persons with disabilities (PWDs) in all spheres of life.\n“We need to create an enabling and friendly environment for PWDs by providing them inclusive education, healthcare facilities, employment based on their skills and abilities, and implementing job quotas,” the president said in a message on the occasion of ‘International Day of Persons with Disabilities’, being observed on December 3.\nThe president said that they commemorated a day dedicated to honouring the inherent dignity and impactful contributions of Persons with Disabilities (PWDs).\nThe United Nations’ theme for this year’s International Day of Persons with Disabilities, “United in Action to Rescue and Achieve the SDGs For, With, and By Persons with Disabilities,” advocated for dedicating ourselves to building an inclusive society,” he added.\nOn the day, they acknowledged the exceptional strength and unwavering resilience of persons with disabilities who had progressed in life despite their disability, he added.\nThe president opined that almost 15% of the world’s population suffered from some form of disability.\n“Unfortunately, 80% of this population lives in developing countries, including Pakistan, where the population of PWDs is estimated to be almost 12%, an alarming figure. Pakistan remains committed to its mission to eliminate societal barriers that obstruct their journey to success. Our goal is to facilitate them to achieve their utmost potential through equitable access to opportunities in life,” a press release of President Secretariat Press Wing quoted the president as saying.\nTogether, they aimed for progress, empowerment, and holistic support for persons with disabilities, he said adding “This entails providing education, training, rehabilitation, and access to information and communication technologies, meeting the demands of the contemporary world.”\nThrough these initiatives, the president said they strived to protect the sanctity of life for PWDs, cultivating a culture that values the inherent worth and capabilities of each individual.\nNo one should be deprived of the opportunities to live a fulfilling life, receive proper care, and pursue economic prosperity irrespective of any disability, he stressed.\nThe president also called upon media to play its role in raising awareness about the rights and issues faced by PWDs and discouraging negative attitudes towards them.",
  "retrievedAt": "2025-08-11T10:48:19.651Z"
}
