{
  "title": "Worst violations of Covid SOPs come from politicians: Asad Umar",
  "link": "https://www.app.com.pk/national/worst-violations-of-covid-sops-come-from-politicians-asad-umar/",
  "date_published": "2021-08-12T08:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Minister for Planning, Development and Special Initiatives Asad Umar on Thursday said during last one year, the worst violation of the Covid Standard Operating Procedures (SOPs) came from the politicians.\n“Two weeks back Bilawal Bhutto Zardari was threatening to hold prime minister and ministers accountable if COVID spreads further in Karachi and now Pakistan Democratic Movement (PDM) announces holding a ‘Jalsa’ this month in Karachi! Sadly the worst violations of Covid-19 SOPs in the last one year have come from politicians,” he tweeted.\nTwo weeks back bilawal zardari was threatening to hold PM and ministers accountable if covid spreads further in karachi and now PDM announces holding a jalsa this month in karachi!! Sadly the worst violations of covid sop's in the last one year have come from politicians.\n— Asad Umar (@Asad_Umar) August 12, 2021\nThe minister who is also chairman of National Command and Operation Center (NCOC) said he had recommended that Azad Jammu and Kashmir (AJK) elections should be postponed for a couple of months and before the elections a special vaccination campaign should run, but it was not agreed.\n“Since the elections, the positivity of AJK is running between 25 and 30%. Elections have acted as a super spreader event,” he added.\nHad recommended that AJK elections get postponed for a couple of months and a special vaccination campaign run before the elections. It was not agreed. Since the elections the positivity of AJK is running between 25 and 30%. Elections have acted as a super spreader event.\nIn another tweet, Asad Umar said that some 40 million vaccination doses had been administered so far.\n“The last 10 million took only nine working days to administer. Let’s vaccinate and make Pakistan safe from this disease”, he added.\n4 crore vaccination doses administered. The last crore took only 9 working days to administer. Keep it Pakistan. Let's vaccinate and make Pakistan safe from this disease",
  "retrievedAt": "2025-08-11T21:04:33.604Z"
}
