{
  "title": "‘Indian machinations to be foiled on all forums’; tells Sarwar to Shah Zain Bugti",
  "link": "https://www.app.com.pk/national/indian-machinations-to-be-foiled-on-all-forums-tells-sarwar-to-shah-zain-bugti/",
  "date_published": "2021-08-12T15:21:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 12 (APP): Governor Punjab Chaudhry Mohammad Sarwar has said that all Indian machinations to destabilize and malign Pakistan will be foiled at all forums.\nTalking to Special Assistant to Prime Minister (SAPM) on Reconciliation, Harmony Balochistan Shah Zain Bugti during a meeting at the Governor’s House on Thursday, he said all institutions are on the same page for progress and prosperity of Balochistan and no conspiracy will be tolerated to destabilize the province, adding that a strong and peaceful Balochistan is vital to a prosperous Pakistan.\nGovernor Punjab Chaudhry Mohammad Sarwar said everyone knows that India is conspiring to harm peace in Balochistan and Pakistan has put all the facts before the United Nations (UN) and other international bodies. He said Pakistan has successfully foiled Indian conspiracies in the past and India will meet the same fate in future.\n“The China Pakistan Economic Corridor (CPEC) will benefit Balochistan the most. Gwadar will be completely transformed under the project,” he said during the meeting in which issues including government initiatives to promote reconciliation and harmony in Balochistan were discussed.\nSarwar said the previous governments had ignored people of Balochistan but Prime Minister Imran Khan has been taking practical steps for the development, peace and stability of Balochistan. “Balochistan is close to Prime Minister Imran Khan’s heart and Baloch people will be given their due rights”, he added.\nHe said the provincial government will complete 131 projects worth 731 million rupees during the current fiscal year, adding that people of Balochistan are being given their due rights in other public welfare projects including “Kaamyab Jawan Program”.\nThe Governor said reconciliation and harmony in Balochistan is the top priority of the present government, adding that feelings of deprivation among the Baloch people will be eradicated.\nSAPM on Reconciliation, Harmony Balochistan Shah Zain Bugti said the people of Balochistan are patriotic and ready to make any sacrifice for the development and peace of the country.\nHe said Baloch people have sacrificed a lot for exterminate terrorism, adding that the government would employ all resources for provision of all facilities including health and education to the people of Balochistan.",
  "retrievedAt": "2025-08-11T21:04:27.653Z"
}
