{
  "title": "3049 persons recruited against 6% Balochistan quota in last three years, NA informed",
  "link": "https://www.app.com.pk/national/3049-persons-recruited-against-6-balochistan-quota-in-last-three-years-na-informed/",
  "date_published": "2021-08-12T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Advisor to Prime Minister on Parliamentary Affairs Dr. Babar Awan on Thursday informed National Assembly that a total 3049 recruitments were made against 6% Baluchistan Quota during last three years in the federal government departments.\nReplying to a question raised by MNA Agha Hasan Baloch regarding number of jobs provided to unemployed youth of Baluchistan in federal government departments during last three years, the minister informed that number of recruitment made on quarterly and yearly basis was as under in first quarter January –March 2018, a total 717 recruitments, in 2019, a total 28 recruitments and 2020, 455 recruitments were made.\nHe said that in second quarter from April to June in 2018, a total 74 recruitment, in 2019, total 22 and 16 recruitment were made during 2020.\nIn third quarter from July to September 2018, a total 204 recruitment, in 2019, a total 984 recruitment and 2020, 49 recruitment were made on Baluchistan quota.\nSimilarly in fourth quarter from October to December, 2018, a total 266 recruitment, in 2019, 93 recruitment and 2020, 661 recruitment were made.\nDr. Babar Awan said that a total 6,400 vacant posts were identified of Baluchistan province and recruitment process was underway.\nReplying another question regarding fake domiciles, he that this was provincial subject and Baluchistan district administrations should identify fake domiciles owners.\nHe said that federal government was ready to take action against the fake domiciles employees. He said that number of times, the government has written to district administrations to identify the fake domiciles. He said that he also recommended that recruitment policy should be changed for the Baluchistan jobs.\nHe said that fake domiciles only can be identified by provinces, adding that it was only can be identified by the local administrations.\nDeputy Speaker National Assembly Qasim Khan Suri has referred the issue to the relevant committee. He said that all the issues related to jobs should be discussed in the committee.",
  "retrievedAt": "2025-08-11T21:04:33.541Z"
}
