{
  "title": "PM to inaugurate 66 new NADRA offices, mobile phone apps Friday",
  "link": "https://www.app.com.pk/national/pm-to-inaugurate-66-new-nadra-offices-mobile-phone-apps-friday/",
  "date_published": "2021-08-12T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):Prime Minister Imran Khan would on Friday inaugurate 66 new offices of National Database and Registration Authority (NADRA) and new mobile applications for issuance of identity cards and work permits to foreigners and for verification of COVID-19 vaccination certificate.\nThe prime minister, during a visit to NADRA headquarters, would also inaugurate 90 new mobile registration vans as outreach of NADRA offices was being expanded to Tehsil level, as per prime minister’s directives, according to an official source\non Thursday.\nThe prime minister would launch alien identity card and work permit for foreigners to bring them into social and financial mainstream who had been staying here for decades.\nThe card would enable the foreigners and their families run their businesses, get admission in private educational institutions, private employment, mobile SIMs, utility connections, open bank accounts, register vehicle and other sale purchases. The holders of the card would also be protected from legal action under Foreign Act.\nThe prime minister would also launch a mobile application COVID-19 Pass for verification of coronavirus vaccination certificate to allow immediate verification of the document by organizations or Pakistanis traveling within Pakistan and abroad.\nBy scanning the QR code on vaccination certificate, one can easily know the validity of document which would show the owner name, passport number and other details.\nThe prime minister would also inaugurate a latest NADRA system based on artificial intelligence to curb fake identity cards. The system has been designed within a short span of time by newly appointed Chairman Tariq Malik that would also help detect foreigners from the database.\nUnder the new system, the head of the family would be able to know or verify the details of his family members by simply sending an SMS and inform NADRA in case of any addition or deletion.",
  "retrievedAt": "2025-08-11T21:04:25.398Z"
}
