{
  "title": "First issue of Science Diplomacy Journal launched",
  "link": "https://www.app.com.pk/national/first-issue-of-science-diplomacy-journal-launched/",
  "date_published": "2022-03-15T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The Ministry of Foreign Affairs, in collaboration with the OIC Standing Committee on Scientific and Technological Collaboration (COMSTECH), on Tuesday held the launch of the first issue of its Science Diplomacy Journal, ‘Science Diplomacy Perspectives’.\nForeign Secretary Sohail Mahmood, in his keynote address on the occasion, highlighted the significance of science diplomacy in helping to address global challenges and bridging the gap between innovation and policy community.\nHe announced that the Journal was an effort to provide inter-disciplinary stakeholders such as scientists and diplomats a platform to write on themes related to science diplomacy.\nIn his comments, Director General (Science Diplomacy) Muhammad Kamran Akhtar thanked the authors for their contributions and taking the challenge of looking beyond conventional boundaries to offer innovative and multi-sectoral inputs.\nThe Journal will provide thought leadership to the country’s science diplomacy efforts and also be a source of rendering science advice on technology-related issues.\nIn his remarks, Coordinator General COMSTECH Prof. Dr. Iqbal Choudhary welcomed the pioneering effort to initiate a publication platform on the subject of science diplomacy.\nHe informed that COMSTECH was playing a significant role as a science diplomacy platform to improve the status of science in the Muslim World.\nThe inaugural issue of Science Diplomacy Perspectives features 17 articles from researchers, diplomats and policy practitioners on different cutting-edge themes including scope and regulatory perspectives of new and emerging technologies, science popularization, and multilateral governance of science. COMSTECH and the Particle Team at LUMS facilitated the Ministry with the editorial and peer review process.\nScience Diplomacy Perspectives will be regularly published and provide a permanent platform for scholars and practitioners to submit articles on science diplomacy related themes.\nThe Issue can be accessed at the following weblink: https://mofa.gov.pk/first-issue-of-science-diplomacy-perspectives/.",
  "retrievedAt": "2025-08-11T14:32:24.668Z"
}
