{
  "title": "MNAs express full confidence in PM Imran Khan’s leadership",
  "link": "https://www.app.com.pk/national/mnas-express-full-confidence-in-pm-imran-khans-leadership/",
  "date_published": "2022-03-15T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): Several Members of National Assembly (MNAs) called on Prime Minister Imran Khan here on Tuesday and expressed full confidence in his leadership.\nThose who met the prime minister include MNAs Lal Chand, Shanila Ruth, J. Prakash, Jamshed Thomas, Chaudhry Muhammad Adnan, Ejaz Khan Jazi, Sahibzada Sibghatullah, Mehboob Shah, Muhammad Bashir Khan, Junaid Akbar, Saleh Muhammad, Mujahid Ali, Malik Anwar Taj, Nasir Khan Musa Zai, Shehryar Afridi, Malik Fakhr Zaman Khan, Khurram Shehzad, Rubina Jamil, Rahat Amanullah Bhatti, Malik Karamat Ali, Rai Muhammad Murtaza Iqbal, Zahoor Hussain Qureshi and Minister SAFRON Sahibzada Mehboob Sultan called on the Prime Minister.\nDuring various meetings, the progress on development projects and political matters in the respective constituencies came under discussion.\nThe prime minister said the popularity of Pakistan Tehreek-e-Insaf (PTI) could be measured from the large turnout at the recent public gatherings.\nPM Imran Khan urged the MNAs to intensify public meetings in their constituencies.\nHe said the PTI government always worked for the rule of law and the welfare of poor.\nHe mentioned that the government had taken tough decisions to keep the economy stable, adding that it also bear the burden of heavy subsidies to provide relief to the poor.\nImran Khan said during his tenure, record tax was collected and was spent on the projects of public welfare.\nHe said his government cut its expenditures so as to allocate money for development projects.\nThe prime minister said the government’s investor-friendly policies resulted in historic growth in agriculture, construction, major industries, exports and remittances.\nIn this regard, he termed the National Health Card, Kamyab Pakistan Programme, Ehsaas Programme, Kamyab Youth Programme, Naya Pakistan Housing Programme, Kisaan Card as revolutionary initiatives of the government for poverty alleviation and economic development.",
  "retrievedAt": "2025-08-11T14:32:32.272Z"
}
