{
  "title": "Farrukh urges ECP to start early hearing of PML-N, PPP foreign funding case",
  "link": "https://www.app.com.pk/national/farrukh-urges-ecp-to-start-early-hearing-of-pml-n-ppp-foreign-funding-case/",
  "date_published": "2022-03-15T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Tuesday urged the Election Commission of Pakistan ( ECP) to start early hearing of the foreign funding case of Pakistan Muslim League-Nawaz and Pakistan Peoples Party.\n“We have once again requested the Election Commission in writing that the PML-N and PPP foreign funding case should be heard as soon as possible ,” said the Minister of State while talking to the media here outside the ECP.\nThe ECP should activate its scrutiny committee immediately so that it could complete its report regarding the two parties’ foreign funding , Farrukh Habib said.\nHe said the Pakistan Tehreek-e-Insaf was the first political party, which had launched political fund raising in Pakistan.\nTerming the overseas Pakistanis assets of the nation, he said they were now sending $30 billion remittances annually, which stood at $18 billion per annum during the PML-N government. Some 9 million overseas Pakistanis, he added, had full confidence in Imran Khan and PTI’s members paid membership fee on annual basis.\nThere was propaganda against the PTI that it had received illegal foreign funding which was totally baseless, he added.  Pointing towards the persons standing around him, he said they were the people, who gave foreign funds to  the party.\n“Anyone including Maryam Safdar, Bilawal Zardari or Shebhaz Sharif want to meet these persons, they should come here,” he added. The minister said now the cat had come out of the bag as it was proved that  Akbar S Babar was receiving funds from the PML-N. Today, Maryam Safdar herself had come to the Election Commission in connection with the case of Akbar S Babar, he added, and claimed that she (Maryam Safdar) did not even have the record of her party’s foreign funding.\nHe asked Maryam to inform the source of  Rs 650 million received by the PML-N and also disclose who had been running the accounts of dead people till 2017. He said the ECP’s scrutiny committee did not hold any meeting for last three months to audit the accounts of PPP and PML-N accounts. Everyone should be treated equally, he remarked.\nThe PTI, he added, had fully cooperated with the scrutiny committee and given its all record to it. He said ironically Fazlur Rehman, who had been trying to dictate the institutions, had himself taken funds from Libya. Farrukh asked the PPP to tell about its 12 secret accounts.\n“Why did the PPP make  payments to US lobbyist Marc Siegel, and why are the PML-N and the PPP  registered as limited companies in the United Kingdom and the United States?” he questioned. Maryam Safdar, Fazlur Rehman and Asif Zardari should submit details of  their party accounts to the panel, he added.\nPTI leader from Germany Tariq Javed said the allegation of foreign funding against the party was baseless. Every member of PTI living in Europe paid 36 euros as annual fee, he added.",
  "retrievedAt": "2025-08-11T14:32:28.122Z"
}
