{
  "title": "Rs47,587.63 million disbursed  for Power Division’s projects",
  "link": "https://www.app.com.pk/national/rs47587-63-million-disburses-for-power-divisions-projects/",
  "date_published": "2022-03-15T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):The government has disbursed a sum of Rs47,587.63 million for various power division schemes under Annual Public Sector Development Programme (PSDP) for Year 2021-22 so far.\nAccording to the data, the government has specified Rs69,485.05 million under PSDP-2021-22 for various power projects with Rs40,174 million foreign aid component.\nAn amount of Rs33,192.75 million has been spent on various projects out of total authorized/disbursed Rs33,192.75 million so far. A sum of Rs30,001 million as a foreign component has also been disbursed during the said period.\nA sum of Rs22,000 million was earmarked for installation of 2,600MW Coal Fire Power Plant, Rs5,500 million for evacuation of Power from Suki Kinari Hydro power Project, Rs8,500 million for evacuation of power from 2160MW Dasu Hydro power Project, Rs5,933 million for 500KV Islamabad West (NTDC), Rs2,282 million for evacuation of power from Tarbela 5th Extension, Rs1,700 million evacuation of power fro from 1224 MW wind Power Plants (Jhimpir), Rs1,400 million from enhancement in Transmission Capacity of NTDC system, Rs1200 million for construction of new 220 KV Guddu-Sibbi Single Circuit, Rs2,600 million for 500 kV HVDC Transmission System (CASA-1000), Rs2,350 million for 500 KV Faisalabad New (NTDC), Rs1,500 million for 500 kV Lahore North (NTDC and Rs1,500 million for up-gradation of NTDC’s Telecommunication.\nAn amount of Rs5,000 million was allocated for Interconnection of Isolated Makran Network (QESCO), Rs1,000 million for 20 Kv Swabi sub division, Rs2,000 million 220 KV Dera Ismail Khan-Zhob Transmission line, Rs2,500 million for 220-KV Mastung, Rs1,300 million for 220 KV Mirpur Khas Grid Station and Rs 640 million for 500/220 KV Sialkot Substation.\nSimilarly, under new scheme, a sum of Rs3,000 million was allocated for 500KV Allama Iqbal Industrial City, Rs 6,600 million for secondary transmission lines (SPECO), Rs5,200 million for secondary transmission lines and grid station (HESCO) and Rs1,010 million for power distribution enhancement (Advance Metering Infrastructure Project (IESCO).",
  "retrievedAt": "2025-08-11T14:32:34.309Z"
}
