{
  "title": "PM felicitates Muslim world as UN designates Mar 15 as anti-Islamophobia Day",
  "link": "https://www.app.com.pk/national/pm-felicitates-muslim-world-as-un-designates-mar-15-as-anti-islamophobia-day/",
  "date_published": "2022-03-15T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): Prime Minister Imran Khan Tuesday congratulated the Muslim world as the United Nations adopted a “landmark resolution” introduced by Pakistan, designating March 15 as International Day to Combat Islamophobia.\nFollowing the adoption of the “landmark” resolution by the United Nations General Assembly introduced by Pakistan on behalf of the OIC countries, the prime minister said “our voice against the rising tide of Islamophobia has been heard.”\nThe resolution was sponsored by 57 members of OIC, and eight other countries, including China and Russia.\nUnder its terms, the resolution strongly deplores all acts of violence against persons on the basis of their religion or belief and such acts directed against their places of worship, as well as all attacks on and in religious places, sites and shrines that are in violation of international law.\nThe prime minister has been regularly speaking up against  the rising Islamophobia in his address at different forums or through letters to the Muslim world.\n“The UN has finally recognised the grave challenge confronting the world: of Islamophobia, respect for religious symbols & practices & of curtailing systematic hate speech & discrimination against Muslims,” the prime minister remarked on Twitter.\n“Next challenge is to ensure implementation of this landmark resolution,” he resolved.\nAt the world platforms, including the United Nations General Assembly, Prime Minister Imran Khan has been calling the world to act against Islamophobia and asking the world leaders “to act collectively to counter the growing phenomenon in non-Muslim states”.\nIn the recent past, the prime minister welcomed Trudeau’s plan to appoint a special representative to combat Islamophobia, which he termed a “contemporary scourge”.\nImran Khan also recently appreciated Russian President Vladimir Putin’s “emphatic statement” that the freedom of speech could not be a pretext to abuse the Prophet Muhammad (Peace Be Upon Him).",
  "retrievedAt": "2025-08-11T14:32:24.457Z"
}
