{
  "title": "OIC CFM moot to discuss Kashmir, Islamophobia, Muslim world issues",
  "link": "https://www.app.com.pk/national/oic-cfm-moot-to-discuss-kashmir-islamophobia-muslim-world-issues/",
  "date_published": "2022-03-15T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The 48th session of the OIC’s Council of Foreign Ministers, scheduled on March 22-23 would discuss many economic, cultural, social, humanitarian, and scientific issues, including Islamophobia, besides the problems faced by the Muslim world.\nBeing held under the theme “Building Partnerships for Unity, Justice, and Development” in Islamabad, the moot is expected to be the delegates from across the Muslim world as the government had received 48 confirmations.\nEarlier in the day, Foreign Minister Shah Mahmood Qureshi told the media that 100 resolutions were expected to be tabled and agreed upon during the OIC-CFM meeting.\nThe resolutions would encompass the issues including Palestine and Al-Quds Ash-Sharif and the dangerous developments since the last CFM in Niamey 2020.\n“The session will cover many economic, cultural, social, humanitarian, and scientific issues, including Islamophobia. It is expected that the periodic report of the Islamophobia Observatory will be submitted to the meeting for consideration,” according to a statement issued by the OIC Secretariat in Jeddah.\nOIC’s Secretary-General Hissein Brahim Taha is expected to attend the meeting to review the essential inter-sessional activities, projects, and programs of the General Secretariat, in addition to the OIC’s post-CFM plans.\nThe representatives of the Muslim would discuss several political files, most notably the developments in Afghanistan and its humanitarian consequences for the Afghan people and the situation in Jammu and Kashmir, which will also be discussed on the sideline meeting of the OIC’s Contact Group on Jammu and Kashmir.\nThe CFM moot will address several African issues, including the situation in the Republic of Mali, the Sahel region, and Lake Chad, the fragility of that region, and the situation in Central Africa and the Republic of Guinea.\nAt the Arab level, the foreign ministers will discuss the developments in Yemen, Libya, the Republic of Sudan and Somalia, Syria, and other regions.\nThe annual meeting will also discuss cooperation issues with international partners, the United Nations, the Russian Federation, and the European Union.\nOn the sidelines of the Session, the OIC will hold a meeting of the Open-ended Contact Group on Muslims in Europe.\nIssues of international terrorism and conflict resolution will top the CFM’s agenda, in addition to the affairs of Muslim groups and communities in non-Member States.\nThe OIC will hold the meeting of the Ad Hoc Ministerial Committee on Accountability for Human Rights Violations of the Rohingya.\nIt is expected that the periodic report of the Islamophobia Observatory will be submitted to the meeting for consideration. A brainstorming session will be held on the sidelines under the title “The Role of the Islamic World in Promoting Peace, Justice, and Harmony” including many emerging issues and topics on the international scene.",
  "retrievedAt": "2025-08-11T14:32:25.091Z"
}
