{
  "title": "Iran must give up dream of nuclear weapon, says Trump - World - DAWN.COM",
  "author": null,
  "content": "• Next round of US-Iran talks to be held in Rome\n• Iranian foreign minister to visit Russia before April 19 meeting\n\nWASHINGTON/LUXEM­BOURG: President Donald Trump said on Monday he believes Iran is intentionally delaying a nuclear deal with the United States and that it must abandon any drive for a nuclear weapon or face a possible military strike on Tehran’s atomic facilities.\n\n“I think they’re tapping us along,” Trump told reporters after US special envoy Steve Witkoff met in Oman on Saturday with a senior Iranian official.\n\nBoth Iran and the United States said on Saturday that they held “positive” and “constructive” talks in Oman.\n\n“Iran has to get rid of the concept of a nuclear weapon. They cannot have a nuclear weapon,” Trump said. Asked if US options for a response include a military strike on Tehran’s nuclear facilities, Trump said: “Of course it does.”\n\nTrump said the Iranians need to move fast to avoid a harsh response because “they’re fairly close” to developing a nuclear weapon. The US and Iran held indirect talks during former President Joe Biden’s term but they made little, if any progress.\n\nThe last known direct negotiations between the two governments were under then-President Barack Obama, who spearheaded the 2015 international nuclear deal that Trump later abandoned.\n\nDonald Trump pulled out of the 2015 nuclear deal between Iran and world powers in 2018, during his first term as US president.\n\nNext round of talks\n\nThe next round of indirect talks between the United States and Iran over Tehran’s nuclear programme will be held in Rome, the Dutch foreign minister and a second diplomatic source said on Monday.\n\nThe talks will take place in the Italian capital, Dutch Foreign Minister Caspar Veldkamp said at an EU meeting. Two diplomats based in Rome confirmed the location and said the talks would take place on Saturday, April 19.\n\nIran’s foreign ministry said on Sunday the talks slated for next weekend would remain “indirect” with Omani mediation, and be focused solely on the nuclear issue and lifting of sanction.\n\nSaturday’s negotiations came weeks after Trump sent a letter to Iran’s supreme leader Ayatollah Ali Khamenei urging nuclear talks while warning of possible military action if Iran refuses.\n\nIranian FM to visit Kremlin\n\nIran’s Foreign Minister Abbas Araqchi will visit ally Russia this week for talks prior to a second round of Iran-US negotiations, a spokesperson said, amid a diplomatic build up to resolve Tehran’s nuclear dispute with the West.\n\nRussia, where Araqchi will travel on a pre-planned visit, has supported Tehran in nuclear negotiations with the West and was a signatory to a 2015 pact that Trump quit. Two Iranian officials said they thought Trump’s latest approach would follow a pattern of threats followed by retreat, akin to his handling of Greenland, Gaza and tariffs.\n\nIranian Foreign Ministry spokesperson Esmaeil Baghaei said Araqchi would be in Russia before the next Oman-mediated talk.\n\nSome Iranian officials believe Trumps business background could make him more receptive to a deal if it includes economic incentives such as a potential purchase of US-made planes or unlocking of Iran’s economy for US investors. Iran’s currency has gained 16 per cent since Iran-US talks were announced.\n\nIn further diplomatic movement around the issue, UN nuclear watchdog chief Rafael Grossi will visit Tehran on Wednesday.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:13:03.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904314/iran-must-give-up-dream-of-nuclear-weapon-says-trump",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:35:32.000Z"
}
