{
  "title": "Karachi’s Abbasi Shaheed doctors protest against pay disparity - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Abbasi Shaheed Hospital (ASH), the third major public sector tertiary care hospital in the city, saw on Monday a major demonstration by house officers who demanded “equal pay for equal work.”\n\nThe protest continued for over three hours in front of the administration building and ended after the officials assured them of a meeting with the city mayor within two days.\n\n“We are not demanding a raise. We just want that our salaries should be at par with what our colleagues are getting at other government-run hospitals in the province for the same job. But, we are told that the ASH is under the Karachi Metropolitan Corporation (KMC) and not the provincial government,” shared a protester.\n\nHe explained that 250 doctors had been offered jobs at the ASH following completion of their MBBS degree at the Karachi Medical and Dental College (KMDC).\n\n“We are offered Rs45,000 per month while our colleagues at other government hospitals are getting Rs70,000. Even the KMDC dental graduates, who work at the outpatient department within the college, have been offered Rs70,000. This is highly unfair,” said another protester.\n\nThey said that they would share their grievances with the mayor, warning that the protests would be resumed immediately if they couldn’t meet the mayor.\n\nThey also vowed to hold a protest outside the KMC office if their demand wasn’t accepted in the City Council’s session scheduled for April 21.\n\nLater, ASH MS Javed Iqbal stated in a media talk that only nine doctors had accepted the job letters sent to 230 house officers. “We have welcomed the new house officers and promoted the old ones. The doctors should know that the mayor has already promised a salary raise in June,” he said.\n\nIn response to a question, he said if the doctors didn’t accept the ASH offer, the hospital would call new interviews.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fd9c0e2e05f.gif",
  "retrievedAt": "2025-08-25T14:12:59.521Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904285/karachis-abbasi-shaheed-doctors-protest-against-pay-disparity",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:35:39.000Z"
}
