{
  "title": "Iran’s Khamenei neither ‘overly optimistic nor pessimistic’ about US nuclear talks - World - DAWN.COM",
  "author": null,
  "content": "Supreme Leader Ayatollah Ali Khamenei said on Tuesday he was neither “overly optimistic nor pessimistic” about talks with the US on Iran’s nuclear programme, in an apparent move by Tehran to play down growing public expectations of a deal.\n\nFailure to reach a deal with President Donald Trump to end Iran’s decades-long dispute with the West could profoundly hurt the Islamic Republic, Iranian politicians and insiders have said, even if Washington is subsequently portrayed by Tehran as the guilty party.\n\nAfter last weekend’s talks between Tehran and Washington in Oman, which both sides described as positive, Iranian expectations of economic relief have soared, according to Iranians reached by telephone and by messages posted by Iranians on social media.\n\nThe two sides have agreed to hold more talks on April 19 in Oman.\n\nIran’s battered rial currency has gained some 20 per cent against the dollar in the past few days, with many Iranians hoping a deal to end Iran’s economic isolation may be within reach.\n\n“We are neither overly optimistic nor pessimistic regarding them. After all, it is a process which was decided and its first steps have been well implemented,” Khamenei said in a meeting with lawmakers, according to state media.\n\nTehran has approached the talks warily, doubting the likelihood of an agreement and suspicious of Trump, who abandoned Tehran’s 2015 nuclear pact with six powers during his first term in 2018 and has repeatedly threatened to bomb Iran if there is no deal.\n\n“From here on, it (the talks) must be followed through carefully, with red lines clearly defined for both the other side and for us. The negotiations may lead to results, or they may not,” said Khamenei.\n\n“Avoid linking the country’s fate to these talks.”\n\nSince relations with Washington collapsed after Iran’s 1979 Islamic revolution that ousted the US-backed Shah, enmity toward the United States has always been a rallying point for Iran’s clerical rulers.\n\nBut inflation, unemployment and lack of investment as a result of crippling sanctions, reimposed after Trump ditched the 2015 nuclear pact, persuaded Khamenei to support talks with the Trump administration.\n\nSeparately, Iran’s Islamic Revolutionary Guard Corps said the country’s military capabilities were off limits, ahead of a second round of talks with the United States on its nuclear programme.\n\n“National security and defence and military power are among the red lines of the Islamic Republic of Iran, which cannot be discussed or negotiated under any circumstances,” Guards spokesman Ali Mohammad Naini said, quoted by state broadcaster IRIB.\n\nTrump addressed reporters on Monday regarding Iran, saying, “I’ll solve that problem” and “that’s almost an easy one”.\n\nThe US leader also threatened to attack Iran’s nuclear facilities and called Iranian authorities “radicals” who should not possess nuclear weapons.\n\nIran has repeatedly denied seeking an atomic bomb, insisting its nuclear programme is for peaceful purposes, especially the provision of energy.\n\nLate on Sunday, Iran’s official IRNA news agency said the country’s regional influence and its missile capabilities were among its “red lines” in the talks.\n\nOn April 12, Iran’s Foreign Minister Abbas Araghchi met with US Middle East envoy Steve Witkoff in Oman for “indirect” talks, according to Iranian officials and media.\n\nAraghchi’s office has said he will travel to Moscow at the end of this week for talks with Russia, a close ally of Iran and party to the 2015 nuclear deal.\n\nMoscow welcomed the Iran-US talks as it pushed for a diplomatic solution and warned any military confrontation would be a “global catastrophe”.\n\nThe talks were the highest-level Iran-US nuclear negotiations since the collapse of the 2015 accord, formally known as the Joint Comprehensive Plan of Action.\n\nThe accord offered Iran relief from international sanctions in return for curbs on its nuclear programme.\n\nBoth Tehran and Washington, enemies who have had no diplomatic relations since shortly after Iran’s 1979 Islamic Revolution, have called the latest round of negotiations “constructive”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/151754384a51ce7.jpg",
  "retrievedAt": "2025-08-25T14:12:45.910Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904405/irans-khamenei-neither-overly-optimistic-nor-pessimistic-about-us-nuclear-talks",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T09:28:07.000Z"
}
