{
  "title": "Standing committee annoyed over delay in completion of NHA projects - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Standing Committee on Economic Affairs sought details from the National Highway Authority (NHA) regarding the national highways, motorways, and road infrastructure ongoing and completed projects executed in collaboration with international donor agencies.\n\nThe committee, chaired by Senator Saifullah Abro, was apprised that 33 projects were completed with various development partners, with a commitment of $9.9 billion. Of these, 15 were funded by the Asian Development Bank, five by the World Bank, seven by China, three by Japan, and one each by the Saudi Fund for Development, Kuwaiti Fund, and USAID.\n\nAn official press release stated that 10 projects are ongoing with a commitment of $1,547.03 million, of which four projects were funded by the Asian Development Bank, four projects by Korea, and one project each funded by the World Bank and the Saudi Fund for Development.\n\nSenator Saifullah Abro expressed serious reservations over the non-provision of required details for repeated times. “In these difficult times, when the country is striving for foreign investment, there is a dire need to enhance the efficiency of the NHA,” the committee chairman said.\n\nLaw and order cited as major reason behind delays; lawmakers note donor agencies may not extend funding deadlines\n\nThe committee asked Economic Affairs Department and its relevant department, NHA, to submit details of the ongoing projects as per agenda within two days.\n\nThe committee was informed that the progress on Shikarpur-Kandhkot and Kashmore-Rojhan slowed down due to deteriorating law and order in the area; however, the NHA is working to mitigate these issues to ensure timely completion of the projects.\n\nThe committee, while reviewing the Khyber Pass Economic Corridor project, whose loan was approved by the World Bank in 2019, noted that it has been delayed for four years. It was informed that the delay in preparation of design by the NHA was behind the overall delay. Security concerns, specially shown by Chinese firms, was also one of the reasons. However, despite all these challenges, local firms completed 36 per cent of the KPEC project.\n\nThe EAD also informed the committee that financial bids have been opened, and the bids received are double the loan amount. The World Bank will not extend the loan’s deadline. The project is at risk, and the NHA must find a solution to complete it on time.\n\nAn NHA official also informed the committee that by May 15, the NHA will have greater clarity about the bids received for the project.\n\nThe committee asked the government to initiate an inquiry and sack the individuals responsible for the delay.\n\nIt also reviewed progress on recommendations regarding the 765KV Dasu-Islam­abad Transmission Line Grid Station at Islam­abad West (Lot-IV), financed by the World Bank.\n\nThe committee also reviewed Flood Emergency Rehabilitation Assistance projects. Of the 30 related projects, 17 were completed while work on 37 others with an estimated cost of $1.3 billion was underway, officials said.\n\nAlso, the committee while reviewing the Sindh Solar Energy Project (SSEP) asked its project director to submit hiring process and finalised initial proposal within two days.\n\nRegarding updates on the committee’s previous recommendations concerning the NTDC project, including ADB 401B-2022 Lot II-A (ACSR Bunting Conductor), and related inquiries by relevant departments, the Senate committee recommended that EAD and the power division invite the managing director of Nespak to attend the committee meeting for briefing.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1510051501d10dc.jpg",
  "retrievedAt": "2025-08-25T14:13:24.570Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904335/standing-committee-annoyed-over-delay-in-completion-of-nha-projects",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:35:02.000Z"
}
