{
  "title": "Kasur party raid case: Contempt notices to three police officials by LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Monday issued contempt of court notices to three police officials over the issue of filming and uploading on social media the videos of detainees in a raid on a party at a farmhouse in Kasur a couple of days back.\n\nJustice Ali Zia Bajwa was hearing a contempt petition filed by Vishal Shakir, a lawyer.\n\nIn compliance with the court order, Kasur District Police Officer (DPO) Essa Khan Sukhera appeared before the court.\n\nThe judge regretted that people were being forcibly shaved and their videos were being posted on social media.\n\n“Under which law have the police been doing this?” the judge asked the DPO.\n\nJustice Bajwa further noted that clips from Indian songs were added to the videos uploaded on the official social media accounts of the police.\n\nThe DPO informed the court that the investigating officer and another police official, who filmed the video, had been dismissed from service and suspended, respectively.\n\nHe said a recommendation had also been made to dismiss the SHO concerned from service for his collusion with the farmhouse owner.\n\nHe stated that cases had been registered under the electronic crime law against dozens of people who saved the video and circulated it.\n\nUpon the court’s inquiry, the DPO said that Muhammad Shahzad, the owner of the farmhouse, had fled the scene.\n\nAt this, the judge observed that the one who shouldn’t have escaped had escaped.\n\nThe judge directed that the advocate general of Punjab must also appear on the next hearing and explain whether any law exists in the world that allows exposing a person in custody.\n\nJustice Bajwa issued contempt of court notices to the investigating officer, SHO and a constable of Mustafabad police station of Kasur.\n\nThe judge observed, “Why shouldn’t the police officials be jailed for six months for violating court orders?”\n\nThe judge also summoned the DIG operations Lahore for Tuesday (today).\n\nTalking to the media persons, DPO Sukhera said it will not be tolerated under any circumstances if someone’s dignity is compromised.\n\nHe said no one can undo the damage caused to those whose videos went viral on social media. He said action had been taken against those who recorded the videos.\n\nThe DPO said such incidents can be prevented through timely action.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:12:50.253Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904366/kasur-party-raid-case-contempt-notices-to-three-police-officials-by-lhc",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T03:38:03.000Z"
}
