{
  "title": "Highway to nowhere: How the BNP-govt standoff is choking Balochistan’s economic lifeline - Pakistan - DAWN.COM",
  "author": null,
  "content": "At a cave-side along the hazardous mountainous region of Chiltan, situated on the outskirts of Quetta near the Lakpass tunnel, dozens of policemen stand guard. A significant trade route, the tunnel connects Afghanistan with Karachi and Pakistan with Iran — but the highway has been blocked for weeks.\n\nA protest organised by former chief minister Akhtar Mengal’s Balochistan National Party (BNP) has brought business and trade to a standstill in the province. The demonstrators are demanding the release of Baloch Yakjehti Committee (BYC) chief organiser Dr Mahrang Baloch and other female activists arrested last month.\n\nThe ongoing protests and road blockade have significantly disrupted local and international trade, particularly with Iran and Afghanistan. According to traders, more than 800 containers and bowser trucks carrying liquefied petroleum gas (LPG), along with multiple containers of perishable goods such as vegetables and fruits, are stranded at the crossing. The prolonged delays are resulting in substantial financial losses, especially from accrued duty taxes, and are undermining the Federal Board of Revenue’s (FBR) targets for Balochistan.\n\nMeanwhile, the government and BNP have been laying the blame for this at each other’s door. Shahid Rind, the Balochistan government’s spokesman, earlier told Dawn that despite being offered an alternative venue — Shahwani Stadium in the Sariab Road area of Quetta — the BNP-M leadership has refused to end the blockade and continues their sit-in at Lakpass.\n\nOn the other hand, the party’s chief held the provincial government responsible for the highway blockades, saying the administration deliberately blocked the roads to prevent the long marchers from entering Quetta, which has forced them to continue their sit-in at Lakpass.\n\n“This is the first government that has blocked highways for its people, denying them the right to travel,” he claimed.\n\nAs of today, the BNP’s protest has entered its third week. It was initially supposed to be a long march, starting from Wadh and culminating in Quetta. However, the government refused to allow the demonstrators to enter the provincial capital, imposing Section 144 in the city and resorting to tear gas. Ultimately, the BNP convoy camped at the Lakpass area of Mastung.\n\nThe long march was announced on March 25, days after the police crackdown on members of the BYC during a Quetta protest. The action drew widespread condemnation, with Amnesty International describing it as a systematic attack on Baloch rights activists.\n\nWhat it also appears to have triggered is a comeback of Balochistan’s nationalist politicians onto the scene, the most prominent of them being Akhtar Mengal, who also recently distanced himself from Parliament. Announcing the long march, he said it was aimed at demanding the release of Baloch women and protesting “an attack on Baloch dignity”.\n\nMengal lamented that the government had arrested hundreds of his party members who participated in the protest, including minors. Due to the ongoing situation in the province, the BNP remained uncertain about participating in parliamentary politics in the near future, he added.\n\n“It depends on the attitude of the state and the election process,” he told Dawn.com from the sit-in, adding that the state had pushed them towards the edge. “Yet, we remain committed to continuing our peaceful struggle.”\n\nDuring the interview, the former chief minister expressed his desire for politics to evolve in a progressive direction. He acknowledged, however, that Baloch society remains deeply rooted in cultural norms, and women were not allowed to vote due to cultural rigidity.\n\nAddressing a question regarding the “honour of Baloch women”, Mengal recalled how even Punjab Chief Minister Maryam Nawaz’s room being raided was widely condemned as a violation of a woman’s dignity. He pointed out the double standards: “When it happened to Maryam Nawaz, it was labeled as a violation of womanly honour.”\n\nMengal also condemned the arrest and alleged mistreatment of Dr Mahrang, stating, “The government is scared of her peaceful struggle for missing persons, and this fear led to her arrest and manhandling.”\n\nWhen asked about the criticism surrounding the BNP’s long march, Mengal brushed off allegations about the move simply being a case of political opportunism. “If it were about opportunism, we could have gained political ground in many other ways,” he said.\n\nThe Lakpass Tunnel, where the BNP is holding a sit-in, is a major entry point connecting three key divisions of Balochistan: Makran, Kalat and Rakhshan.\n\nThe closure of the tunnel has therefore caused a major trade and road blockade. In a joint press conference with the district administration, the Quetta Chamber of Commerce said that the unrest was creating a mounting economic fallout.\n\nIt highlighted that the disruption was creating a ripple effect across the province, leading to supply chain breakdowns and a growing shortage of essential items, including food, poultry products and critical medicines. This has, in turn, led to price surges that are increasing hardships for local communities.\n\n“The roadblocks aren’t just a local inconvenience, but are causing millions in losses and seriously damaging the reputation of businesses that rely on timely deliveries to meet international commitments,” said Agha Gul Khaliji, the chamber’s vice-president.\n\n“For them (international clients), it doesn’t matter who blocked the roads or why; all they see is unreliability,” he added.\n\nAmong those bearing the brunt is Haji Shojat Ali Eassazi, a Chagai-based supplier of LPG, tiles, scrap and fresh goods imported from China, Dubai and Iran via Bandar Abbas. Speaking to Dawn.com, he said that doing business in Balochistan had become increasingly difficult.\n\nDaily protests and roadblocks were causing heavy losses for the business community, particularly in border areas, he pointed out.\n\nMoreover, the continuing political instability and security concerns were also affecting Afghan transit trade. According to Jalat Khan Achakzai, former president of the Chaman Chamber of Commerce and Industry, the business environment in the province was no longer conducive, despite its strategic importance owing to border connectivity.\n\nAchakzai noted that Afghan business communities were diverting their trade routes through Iranian ports, bypassing traditional corridors in Pakistan. This shift, he warned, posed long-term risks to regional trade and the economic vitality of border areas such as Chaman and Balochistan. Similarly, it was causing losses of hundreds of thousands dollars for traders involved in the import and export business.\n\nNot just trade, but the sit-in has also brought transport in Balochistan to a halt.\n\nNasir Shahwani, spokesperson for the provincial transportation union, told Dawn.com that at least 400 passenger buses and vans in Balochistan were stuck since the beginning of the protest. “This isn’t just about traffic delays — this is a serious economic blow. Hundreds of drivers, conductors, and support staff are unable to work, losing their daily income,” he said.\n\nHe added that the halted services were affecting the movement of goods, disrupting supply chains, and increasing fuel and maintenance costs.\n\nOn the other hand, roadblocks set up by government authorities — particularly at the Lakpass Tunnel — were raising serious concerns for residents of the Rakhshan division, which relies heavily on Quetta for both goods supply and medical treatment.\n\nAbdul Nabi, a resident of Kharan district, told Dawn.com that his father was a heart patient and had to make frequent visits to the provincial capital for treatment. “But I am unable to find affordable transport to shift him to the hospital.”\n\nImad Baloch, 22, a law student at the Balochistan University of Information Technology and Management Sciences, also had his own ordeal to narrate. He said he had to pay Rs4,000 just to reach Quetta in time as his final term exams were approaching.\n\nHe highlighted that underprivileged students could not afford such additional expenses. “Due to the sit-in, the government has also blocked internet access, which has created serious problems for students in my hometown, Kharan.\n\n“Many of my colleagues are preparing for competitive exams scheduled in April, and the disruption has made it very difficult for them to study,” he said.\n\nIn response to a query regarding measures to resume traffic on the highway, Rind, the Balochistan government’s spokesperson, told Dawn.com that diversions had been provided to ensure the smooth flow of traffic in the Lakpass area. He added that they were considering reopening the Lakpass Tunnel in the coming days. The spokesperson, however, refused to respond to any queries regarding the detention of BNP workers and any negotiations with the protesters.\n\nThe deadlock between the government and the BNP over the release of the BYC leadership continues with no end in sight. In a multi-party conference held at Lakpass on Monday, Mengal issued a joint declaration calling for the implementation of constitutional safeguards related to the 1948 Instrument of Accession of Balochistan to Pakistan and urging a national-level dialogue to resolve longstanding issues.\n\nThe leaders of political parties, during their speeches, said that adopting a “hard state policy” for resolving the issue of Balochistan would cause further unrest and worsen the situation. They said that the government should avoid adopting such a hard policy and resolve the issue of Balochistan by implementing the Constitution.\n\nThe conference was attended by leaders of Jamiat Ulema-i-Islam, both factions of National Party, Awami National Party, Jamaat-i-Islami, Pashtoon Tahaf­fuz Mov­e­ment, National Demo­cratic Movement, Majlis Wahdat-i-Muslimeen, JUI (Sherani faction), Balochistan Traders’ Association, Balochistan National Party (Awami), Jamhoori Watan Party, and various other political and tribal figures.\n\nSpeaking to Dawn.com, senior BNP leader Sana Ullah Baloch stated, “Our next course of action depends on how the government responds — and so far, its behaviour has been anti-people.” He further demanded the immediate release of activists arrested under the colonial-era Maintenance of Public Order (3MPO) law.\n\nHeader image: BNP-M chief Sardar Akhtar Mengal addresses demonstrators during a sit-in in Lakpass on April 2. — Photo via X (@sakhtarmengal)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1511434031b1aba.jpg",
  "retrievedAt": "2025-10-12T02:33:01.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903742/highway-to-nowhere-how-the-bnp-govt-standoff-is-choking-balochistans-economic-lifeline",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T08:09:23.000Z"
}
