{
  "title": "Trump now says smartphones ‘not exempt’ from tariffs - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON / BEIJING: Days after his administration ‘exem­pted’ electronics items — such as smartphones — from its new tariff regime, US President Donald Trump has claimed that they are simply being moved into a different levy ‘bucket’, BBC News reported.\n\nEuropean markets rebounded on Monday morning, following last week’s announcement that some of these products would escape levies of up to 145 per cent.\n\nHowever, BBC News quoted US officials as saying that these products would be subject to a “semiconductor tariff” instead, with Trump expected to reveal more details later.\n\nUS Commerce Secretary Howard Lutnick said the new levy would be in addition to a host of global tariffs the US imposed earlier this month, then paused for 90 days.\n\nIn Hanoi, Xi Jinping calls for resolve to jointly oppose ‘US bullying’\n\n“We need our medicines and we need semiconductors and our electronics to be built in America,” he added.\n\nEveryday devices such as smartphones and laptops rely on semiconductors, which are small and powerful pieces of tech that form the basic building blocks of modern computation.\n\nOn Saturday, a US customs notice revealed smartphones, computers and some other electronic devices would be excluded from the 125pc tariff on goods entering the country from China.\n\nThe Chinese commerce ministry had called the exemptions a “small step” by the US, and said that Beijing was “evaluating the impact” of the move.\n\nBut Trump later chimed in on social media, saying there was no exemption for these products and called such reports about this notice false. Instead, he said that they are just moving to a different Tariff ‘bucket’.\n\nTrump added: “We are taking a look at Semic­onductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Secu­rity Tariff Investigations.”\n\nHe said he would provide an update on Monday about semiconductor duties.\n\n‘Oppose bullying’\n\nMeanwhile in Hanoi, President Xi Jinping sought to rally Vietnam’s support to “jointly oppose unilateral bullying” by the Trump administration in the US.\n\n“We must strengthen strategic resolve, jointly oppose unilateral bullying, and uphold the stability of the global free trade system as well as industrial and supply chains,” Xi told Vietnam’s leader To Lam, the Xinhua news agency reported.\n\nPresident Xi, who has embarked on a tour of Southeast Asia in a bid to market his regime as a stable alternative to the erratic Trump presidency, warned that protectionism “leads nowhere” and that a trade war would have “no winners”, in an article published on Monday in Vietnam’s major state-run Nhan Dan newspaper.\n\nHe earlier urged the two countries to “resolutely safeguard the multilateral trading system, stable global industrial and supply chains, and open and cooperative i4nternational environment”.\n\nVietnam’s Lam said in an article posted on the government’s news portal on Monday that his country “is always ready to join hands with China to make cooperation between the two countries more substantive, profound, balanced and sustainable”.\n\nHanoi is currently negotiating a reduction of threatened US tariffs of 46pc that would otherwise apply in July after a global moratorium expires.\n\nIn the first three months of this year, Hanoi imported goods worth about $30 billion from Beijing while its exports to Washington amounted to $31.4 billion, Vietnam’s customs data show, confirming a long-term trend in which imports from China closely match the value and swings of exports to the US.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fd85bab54f5.jpg",
  "retrievedAt": "2025-10-12T02:32:39.024Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904271/trump-now-says-smartphones-not-exempt-from-tariffs",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:34:56.000Z"
}
