{
  "title": "US officials assail Meta in court for ‘buying out the competition’ - World - DAWN.COM",
  "author": null,
  "content": "• FTC lawyer argues company bought nascent rivals Instagram, WhatsApp after it couldn’t compete\n• Zuckerberg likely to take the stand\n\nWASHINGTON: Facebook parent Meta Platforms bought up nascent rivals Instagram and WhatsApp after its attempts to compete had failed, an attorney for the US Federal Trade Commission (FTC) said at the beginning of a high-stakes trial in Washington on Monday, where US antitrust enforcers seek to unwind the deals.\n\nFTC attorney Daniel Matheson said that the unlawful strategy “established entry barriers that for more than a decade protected Meta’s dominance”. “Consumers do not have reasonable alternatives they can turn to,” he said.\n\nThe case, filed during President Donald Trump’s first term, claims Meta bought the companies a decade ago to eliminate competition among social media platforms where users connect with friends and family.\n\nThe FTC seeks to force Meta to restructure or sell parts of its business including Instagram and WhatsApp.\n\nThe case poses an existential threat to Meta, which by some estimates earns about half of its US advertising revenue from Instagram, while testing the new Trump administration’s promises to take on Big Tech.\n\nMeta has been making regular overtures to Trump since his election, nixing content moderation policies Republicans said amounted to censorship and donating $1 million to Trump’s inauguration.\n\nMeta CEO Mark Zuckerberg has also visited the White House multiple times in recent weeks.\n\nFTC spokesperson Joe Simonson said “the Trump-Vance FTC could not be more ready for this trial” and that its lawyers had been working around the clock to prepare.\n\nMeta’s chief legal officer Jennifer Newstead called the case weak and a deterrent to tech investment. “It’s absurd that the FTC is trying to break up a great American company at the same time the administration is trying to save Chinese-owned TikTok,” she wrote in a blog post on Sunday.\n\nZuckerberg expected to testify\n\nZuckerberg is expected to take the stand and face questioning about emails in which he proposed acquiring photo-sharing app Instagram as a way to neutralise a potential Facebook competitor and expressed worry that encrypted messaging service WhatsApp could grow into a social network.\n\nMeta has argued in court papers that its purchases of Instagram in 2012 and WhatsApp in 2014 have benefited users, and that Zuckerberg’s past statements are no longer relevant amid competition from ByteDance’s TikTok, Google’s YouTube and Apple’s messaging app.\n\nHow users spend time on social media, and which services they consider interchangeable, will be core to the case. Meta will argue that an increase in traffic to Instagram and Facebook during TikTok’s brief shutdown in the United States in January shows direct competition.\n\nThe FTC claims Meta holds a monopoly on platforms used to share content with friends and family, where its main competitors in the United States are Snap’s Snapchat and MeWe, a tiny privacy-focused social media app launched in 2016. Platforms where users broadcast content to strangers based on shared interests, such as X, TikTok, YouTube and Reddit, are not interchangeable, the FTC has argued.\n\nIn a November ruling, US District Judge James Boasberg said that the FTC “faces hard questions about whether its claims can hold up in the crucible of trial.” The trial could stretch into July. If the FTC wins, it would have to prove at a second trial that measures such as forcing Meta to sell Instagram or WhatsApp would restore competition.\n\nLosing Instagram in particular could prove catastrophic to Meta’s bottom line.\n\nWhile Meta does not release app-specific revenue figures, advertising research firm Emarketer forecast in December that Instagram would generate $37.13 billion this year, a little over half of Meta’s US ad revenue.\n\nInstagram also generates more revenue per user than any other social platform, including Facebook, according to Emarketer.\n\nWhatsApp to date has contributed only a sliver to Meta’s total revenue, but it is the company’s biggest app in terms of daily users and ramping up efforts to earn money off tools like chatbots. Zuckerberg has said such “business messaging” services are likely to drive the company’s next wave of growth.\n\nThe case is one of five where the FTC and US Department of Justice accuse Big Tech companies of maintaining illegal monopolies. Amazon, Apple and Alphabet’s Google also face antitrust lawsuits.\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fd85b00cf8e.jpg",
  "retrievedAt": "2025-10-12T02:32:54.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904266/us-officials-assail-meta-in-court-for-buying-out-the-competition",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:34:56.000Z"
}
