{
  "title": "London hosts talks to find ‘pathway’ to end Sudan war - World - DAWN.COM",
  "author": null,
  "content": "Senior international officials gather in London on Tuesday aiming to chart a pathway to peace for Sudan on the second anniversary of its brutal civil conflict, but without the presence of the warring parties.\n\nDubbed the “forgotten war”, the conflict which erupted on April 15, 2023 between Sudan’s regular army and the paramilitary Rapid Support Forces (RSF) in a bitter power struggle between rival generals has created what the United Nations describes as the world’s worst hunger and displacement crises.\n\nThere are also increasing fears that the tensions will spill over Sudan’s borders and stir further instability in the impoverished Horn of Africa region.\n\n“This conference will bring together the international community to agree a pathway to end the suffering,” said the UK’s foreign minister David Lammy, who is expected to host counterparts and high-level representatives.\n\n“Instability must not spread — it drives migration from Sudan and the wider region, and a safe and stable Sudan is vital for our national security.”\n\nMore than 13 million people have been uprooted and tens of thousands killed, with both sides accused by the United States of committing atrocities.\n\nThe war has “shattered the lives of millions of children across Sudan,” said Catherine Russell, executive director of Unicef, which estimated that 2,776 children had been killed or maimed in 2023 and 2024 — up from 150 verified cases in 2022 and still likely an underestimate.\n\nA UN-backed assessment has declared famine is now blighting parts of the country.\n\nBritain’s foreign ministry said more than 30m people were in desperate need, and 12m women and girls were in danger of gender-based violence.\n\n“The UK will not let Sudan be forgotten,” Lammy vowed, as he unveiled £120m ($158m) in new aid for the country.\n\n“The brutal war in Sudan has devastated the lives of millions and yet much of the world continues to look away.”\n\nGermany and France, as well as the European Union and the 55-member African Union, are co-hosting the conference with the British government in London.\n\nMinisters from some 14 other countries including Saudi Arabia and the United States are also due to attend, the UK Foreign Office said, along with high-level representatives from the United Nations.\n\nBut Sudan’s government has protested that it was not invited to participate.\n\nIts Foreign Minister Ali Youssef sent a letter earlier this month to Lammy “in which he protested the organisation by his country of a conference on Sudan without inviting the Sudanese government”.\n\nYoussef accused Britain of putting the paramilitary RSF on an equal footing with the Sudanese state.\n\nBut the German foreign ministry said both the Sudanese army and the RSF militia were unwilling to come to the table.\n\nGerman Foreign Minister Annalena Baerbock called the ongoing conflict “the greatest humanitarian catastrophe of our time”, adding that Berlin would provide €125m ($142m) in humanitarian aid.\n\nFrench Foreign Minister Jean-Noel Barrot pledged €50m in aid, underlining the aims of the conference to mobilise the international community and urge warring parties to agree to a ceasefire.\n\nThe head of the International Committee of the Red Cross said two years of “ruinous war” in Sudan had left civilians “trapped in a relentless nightmare of death and destruction”.\n\nMirjana Spoljaric urged all parties to uphold commitments already made in previous talks and “take concrete steps” to protect civilians.\n\nThe conflict pits the regular army of Sudan’s de facto leader Abdel Fattah al-Burhan against the RSF led by his former deputy Mohamed Hamdan Daglo.\n\nIt was triggered when relations between Burhan and Daglo soured following a 2021 coup that ousted the transitional government put in place after the 2019 overthrow of longtime leader Omar al-Bashir.\n\nThe RSF are rooted in Darfur and control much of its territory, as well as parts of Sudan’s south.\n\nThe army reclaimed the capital Khartoum last month, and holds sway in the east and north, leaving Africa’s third-largest country essentially divided in two.\n\n“Achieving peace in Sudan depends on valuing every voice and everyone playing a role in building a prosperous Sudan,” said the African Union’s commissioner for political affairs, Bankole Adeoye.\n\nUN Secretary-General Antonio Guterres said Monday he was worried that weapons and fighters keep flowing into Sudan.\n\n“The external support and flow of weapons must end,” Guterres said, without blaming any specific country in a statement issued a day before the third anniversary of the start of the war.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/15143800edfb4e7.jpg",
  "retrievedAt": "2025-08-25T14:12:46.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904406/london-hosts-talks-to-find-pathway-to-end-sudan-war",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T10:02:05.000Z"
}
