{
  "title": "Punjab grumbles as Sindh stands firm on new canals - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CM Murad says province’s case on new canals ‘ironclad’; PPP Punjab leader reiterates threat of quitting coalition over water issue\n• In letter to Irsa, Punjab accuses lower riparian of ‘fudging data’, eating into its share\n\nHYDERABAD / LAHORE: The PPP has once again urged the federal government to resolve the issue of new canals on the Indus river; otherwise, the party may quit the ruling coalition in the Centre.\n\nThe threat came as Punjab accused Sindh of fudging the discharged water data and “eating into its share of water”.\n\nSindh Chief Minister Murad Ali Shah on Monday said the province’s case on new canals on the Indus River was “very strong” and no one can disregard it.\n\n“We have that strong evidence and viewpoint that anyone listening this case would drop this plan. And I do not think that anyone can reject our viewpoint,” CM Shah told journalists.\n\nSindh has opposed the new can­als and which it claims would red­uce the province’s share of water.\n\nThe provincial government has also submitted a summary before the Council of Common Interests (CCI) on the Cholistan, Greater Thal Canal phase-II and other can­als being built on the Indus River.\n\nThe PPP leadership has made it clear that the proposed canals would not be built over the Indus river, Mr Shah added while talking to journalists in Sehwan on the 18th death anniversary of his father, Syed Abdullah Shah.\n\nCM Shah added that PPP Chairman Bilawal Bhutto-Zardari will soon address a public meeting in Hyderabad on Friday.\n\nThe PPP chief is expected to speak on the issue of canals at the public rally.\n\nCM Shah added that Mr Bhutto-Zardari made it clear in his in Garhi Khuda Bux on April 4 that his party would “side with the masses and not the prime minister” if a decision was made to build the canal.\n\nQuitting the coalition\n\nA PPP leader in Punjab have asked the federal government to call a CCI meeting to resolve the canals’ controversy.\n\nPPP Central Punjab General Secretary Syed Hassan Murtaza said his party would take any “extreme step”, including quitting the ruling coalition, if its concerns weren’t addressed.\n\n“Everyone should work according to the agreed distribution of water,” Mr Murtaza said, while referring to each province’s share of water outlined in the Water Apportionment Accord, 1991,\n\n“We are already suffering from a water shortage. No one is answering the question as to from where the water will flow into the six canals.”\n\nHe claimed the country was already facing a 20 per cent water shortfall and asked how this shortage would be met.\n\nMr Murtaza also dismissed the claim that President Asif Ali Zardari gave the approval to build the canals. The president “has never done anything against natio­nal interest”, Mr Murtaza said, challenging those who claim that the president gave his consent for the project to come up with documentary proof.\n\nPunjab’s claims\n\nThe water issue has pitted the provincial governments of Punjab and Sindh against each other, with the former claiming water from its share was being given to the southern province.\n\nThe lower riparian province was also “underreporting discharge data” at its barrages, the Punjab irrigation department claimed in a letter to the chief engineer of the Indus River System Authority (Irsa).\n\nThe letter stated that the Irsa data showed Punjab was being given less water than its share.\n\nMeanwhile, Sindh is being given “additional water” by jeopardising the storage of the Tarbela Dam and putting pressure on the Mangla reservoir.\n\nThe letter also claimed “significant underreporting” of discharge data at Sindh barrages.\n\nIt added the province showed the Rice Canal — to the west of Sukkur Barrage — as closed, but it was flowing at 936 cubic feet per second (CFS).\n\n“These inaccuracies threaten fair water distribution,” the Punjab irrigation department said and demanded Irsa to ensure “correct and transparent reporting from all Sindh barrages, especially Guddu and Sukkur”\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:33:00.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904273/punjab-grumbles-as-sindh-stands-firm-on-new-canals",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:34:48.000Z"
}
