{
  "title": "HBL PSL 2025: Sahibzada stars with century as Islamabad United sink Peshawar Zalmi - Sport - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Months ago, Sahibzada Farhan was not considered good enough for the HBL Pakistan Super League. On Mon­day night here at the Rawalpindi Cricket Stadium, it was all about the opener, whose blistering century saw Islamabad United rout Peshawar Zalmi by 102 runs.\n\nThe 29-year-old had gone unpicked in the league’s player draft earlier this year before United rewarded him with a contract for responding to his snub by hitting three centuries in the recently concluded National T20 Cup.\n\nWhen he took the crease against Zalmi on Monday, Farhan ensured he made the most of the opportunity, smashing 106 off 52 balls to help Islamabad post a mammoth 243-5 before a hapless Peshawar were bundled out for 141 despite a fighting knock from Mohammad Haris.\n\nFarhan set the tone for Islamabad, launching the onslaught from the word go. The right-hander showed no mercy to the Peshawar bowlers, taking each and every one of them to the cleaners, smashing 13 fours and five sixes.\n\nWhile the Peshawar-born batter put on display his fireworks, United veteran Colin Munro supported him from the other end with his 40 off 27.\n\nAfter putting up 144 off 72 for the second wicket, both Farhan and Munro lost their wickets to Alzarri Joseph in the 14th over, with the double breakthrough by the West Indies pacer slowing things down slightly for Islamabad.\n\nHowever, Salman Ali Agha’s 30 off 15 and an 11-ball 20 by Holder saw the home side in touching distance to a PSL record total.\n\nFarhan had got going despite losing opening partner Andries Gous to a run out in the second over, hitting pacers Mohammad Ali and Joseph for three boundaries in the space of five balls.\n\nThe 29-year-old got on one knee to launch the first six of his knock at the expense of Zalmi spinner George Linde and charged on emerging fast bowler Ali Raza for three boundaries and a six in the fifth over.\n\nAfter Munro’s two boundaries off Ali saw United post 73-1 in the powerplay, Farhan brought up his half-century in 26 balls and targeted Sufyan Moqeem’s chinaman spin for an audacious six and two fours in the ninth over.\n\nHe bludgeoned Raza and Sufyan in two more big overs before Munro miscued a Joseph delivery and Farhan finally made a mistake three balls later, slashing again but finding the fielder at deep third man.\n\nThe wickets did affect Islamabad’s run-rate, but boundaries after every few balls kept their momentum alive, with Salman and Azam Khan hitting sixes off Ali in the 16th over.\n\nAlthough Azam lost his wicket in the next over, Holder and Salman got going as United gave Zalmi what proved to be an impossible target to chase.\n\nPeshawar’s response was characterised by Haris’ 87 off 47, but how wickets kept falling at the other end never really helped his cause, with veteran spinner Imad Wasim (3-26) keeping Zalmi suffocated with his accurate bowling.\n\nThe first casualty came as early as in the second over and in the form of none other than Zalmi skipper Babar Azam, who found Holder at first slip off Australian pacer Ben Dwarshuis.\n\nImad then struck Mitch Owen’s pads to send the Australian back to the dugout, while Saim Ayub was deceived by a slower bouncer by fast bowler Naseem Shah as Peshawar reeled at 3-26.\n\nHaving managed only 43-3 in the powerplay, Haris’ two sixes off Holder in the seventh over gave Zalmi some hope, only to see Imad return to dismiss Tom Kohler-Cadmore fall soon after.\n\nWhile Haris kept going for big hits every now and then, Holder got Hussain Talat before emerging spinner Saad Masood ousted Linde for a duck with Zalmi 107-6 in the 13th over.\n\nHaris hit three boundaries off Saad in the 15th, but that proved to be the last stages of his resistance before he became Imad’s third victim, marking Zalmi’s second loss in a row.\n\nSCOREBOARD\n\nISLAMABAD UNITED:\n\nSahibzada Farhan c Hussain b Joseph 106\n\nAndries Gous run out 0\n\nColin Munro c Haris b Joseph 40\n\nAzam Khan c Saim b Hussain 16\n\nSalman Ali Agha c Kohler-Cadmore b Hussain 30\n\nJason Holder not out 20\n\nBen Dwarshuis not out 18\n\nEXTRAS (LB-1, NB-2, W-10) 13\n\nTOTAL (for five wickets, 20 overs) 243\n\nDID NOT BAT: Shadab Khan, Imad Wasim, Naseem Shah, Saad Masood\n\nFALL OF WICKETS: 1-9 (Gous), 2-153 (Munro), 3-160 (Farhan), 4-188 (Azam), 5-215 (Salman)\n\nBOWLING: Joseph 4-0-39-2 (1w), M. Ali 4-0-51-0 (1w), Linde 2-0-20-0, Ali 3-0-45-0 (1w, 1nb), Sufiyan 3-0-35-0, Hussain 3-0-39-2 (2w, 1nb), Saim 1-0-13-0\n\nPESHAWAR ZALMI:\n\nSaim Ayub c Saad b Naseem 6\n\nBabar Azam c Holder b Dwarshuis 1\n\nMitchell Owen lbw b Imad 10\n\nMohammad Haris c sub (Nawaz) b Imad 81\n\nTom Kohler-Cadmore c Farhan b Imad 8\n\nHussain Talat c sub (Nawaz) b Holder 13\n\nGeorge Linde c sub (Nawaz) b Saad 0\n\nAlzarri Joseph c sub (Nawaz) b Shadab 2\n\nSufiyan Muqeem b Shadab 1\n\nMohammad Ali b Dwarshuis 3\n\nAli Raza not out 1\n\nEXTRAS (B-1, LB-3, NB-1, W-4) 9\n\nTOTAL (all out, 18.2 overs) 141\n\nFALL OF WICKETS: 1-4 (Babar), 2-16 (Owen), 3-26 (Saim), 4-67 (Kohler-Cadmore), 5-91 (Hussain), 6-106 (Linde), 7-109 (Joseph), 8-130 (Sufiyan), 9-136 (Haris)\n\nBOWLING: Naseem 3-0-14-1 (2w), Dwarshuis 2.2-0-23-2 (1w), Imad 4-0-26-3, Holder 2-0-20-1, Shadab 4-0-29-2, Saad 3-0-25-1 (1w, 1nb)\n\nRESULT: Islamabad United won by 102 runs.\n\nPLAYER-OF-THE-MATCH: Sahibzada Farhan\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/15113300e6dd857.jpg",
  "retrievedAt": "2025-10-12T02:33:58.070Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904293/hbl-psl-2025-sahibzada-stars-with-century-as-islamabad-united-sink-peshawar-zalmi",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:36:24.000Z"
}
