{
  "title": "Seven injured in KP as explosion rocks Rescue 1122 site - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A police official was martyred in Bannu, while an under-construction Rescue 1122 building in Tank came under attack on Monday, causing injuries to seven labourers.\n\nThe policeman was shot in the Narmikhel Bakkakhel area on Monday. A police official confirmed the incident and said that Constable Kiramat Khan was on leave at the time of the incident.\n\n“The constable lost his life when armed men opened fire at him,” he said, adding that the deceased police official was deployed at the IDP camp.\n\nThe official said that the body of the martyred policeman was taken to the police lines for funeral prayer after medico-legal formalities. RPO Imran Shahid, DPO Saleem Abbas Kulachi, elders and his relatives attended the final rites.\n\nPoliceman martyred in Bannu; bodies of constables recovered two days after abduction\n\nSeparately, in Lower South Waziristan, the bodies of two constables who had been abducted by militants from their houses on Saturday, were recovered in Toi Khulla tehsil of the tribal district.\n\nThe constables whose bodies were recovered after a two-day hunt were identified as Constable Hamid Shah and Constable Ashraf Dottani.\n\nAccording to DSP Wana Imranullah, armed men had launched attacks targeting the residences of the police officials in three different areas of the district, including Toor Deb, Spin Tangi and Bero Kach, during the night between Friday and Saturday. The assailants kidnapped the two policemen and took them to an undisclosed location.\n\nFollowing the abduction, the Dottani tribe formed a traditional tribal force known as a “Chegha Party” to track down the kidnappers.\n\nThe party launched an armed offensive in search of the kidnappers, leading to a fierce exchange of gunfire, in which three militants were also killed. In the same clash, another police official, Abdul Kareem Dottani, and a minor girl sustained injuries. Both were shifted to a local hospital. Their condition is reported to be out of danger.\n\nThe attack on the houses of the police officials was condemned by residents and tribal elders of the Dottani clan besides political and social leaders. They urged the government to take effective steps to restore peace in Toi Khullah and across the entire Lower South Waziristan district.\n\nLocal sources had said that militants were regrouping and attempting to instill fear among people by challenging the writ of the state in the district. “The attacks are seen as an attempt to shake the confidence of both people and state institutions,” they had added.\n\nIt is worth noting that over the past year, the security situation in both Lower South Waziristan and Upper South Waziristan has been steadily deteriorating, causing concern among local tribes and citizens.\n\nLabourers injured\n\nThe seven labourers were injured when a powerful explosion rocked the under-construction rescue office in Wazirabad in the jurisdiction of the city police station.\n\nInitial reports indicated that the blast was caused by explosive material planted at the construction site. Rescue 1122 teams responded promptly and shifted the injured workers to the District Headquarters Hospital (DHQ), Tank, for treatment. Following the incident, police and the security forces cordoned the area and launched a search operation.\n\nAuthorities have yet to ascertain the indentity of attackers, while no group has claimed responsibility so far. Further investigations are underway.\n\nA.K. Wazir in South Waziristan, Muhammad Irfan Mughal in D.I. Khan, and Ghulam Mursalin Marwat in Lakki Marwat contributed to this report\n\nPublished in Dawn, April 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:13:24.429Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904334/seven-injured-in-kp-as-explosion-rocks-rescue-1122-site",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T00:35:02.000Z"
}
