{
  "title": "Pakistan, China firm to ‘act collectively’ on mutual strategic interests: FM",
  "link": "https://www.app.com.pk/national/pakistan-china-firm-to-act-collectively-on-mutual-strategic-interests-fm/",
  "date_published": "2020-08-24T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): Foreign Minister, Shah Mehmood Qureshi on Monday said Pakistan and China would “act collectively to protect mutual strategic interests” and vowed to continue the CPEC project (China Pakistan Economic Corridor) despite criticism.\n“Our strategic compass is set in right direction and joint efforts would be made to promote peace, development and prosperity in the region,” the Foreign Minister said at a press conference, held here at the Ministry of Foreign Affairs.\nThe Foreign Minister, who recently returned from Beijing where he held talks with his Chinese counterpart, said “no matter what, CPEC would continue towards the goal of its complete implementation.”\n“The CPEC is a well-considered project of regional connectivity, which will not only benefit Pakistan and China but entire region, offering immense employment opportunities,” he said.\nQureshi said his visit to China was also significant in the backdrop of recent India-China military skirmishes in Ladakh, saying, “it was important to have a face-to-face discussion in emerging scenario”.\n“China’s stance is loud and clear that besides pursuing development, it is equally important to be vigilant about the regional situation,” he said, adding that the impression of lenience over Sino-India trade and Wuhan Spirit was dissolved following his meeting with the Chinese foreign minister.\nOn issue of Jammu and Kashmir (J&K), the Foreign Minister said China categorically rejected India’s unilateral action of August 5, 2019 of revoking the special status of Valley.\nQureshi backed the recent joint declaration by six political parties in J&K expressing commitment for the restoration of Article 370 and 350A of the Indian Constitution.\n“This statement by Kashmiri leaders shows that India’s efforts to crush Kashmiris has met a big defeat,” he said, stressing the need for monitoring by international watchdogs to expose India’s false claims of normalcy in last one year.\n“We reject India’s claim of J&K as its internal matter. The truth is that India has no historical, legal and moral claim over it,” he said.\nHe mentioned that International Crisis Group, an independent body, termed the struggle of Kashmiris as “indigenous mass resistance” and demanded to revert the move of August 5.\n“All Pakistanis, Kashmiris in Azad Kashmir and J&K, and Kashmiri diaspora across the world are openly negating the ideology of India,” he said.\nHe warned the world that India could carry out a false flag operation to cover up its defeat after misadventure in Kashmir.\nTo a question, he said there was no change in stance of Saudi Arabia on the issue of Jammu and Kashmir.\nHe dismissed the campaign launched in social media claiming drifting of the Kingdom’s policy on J&K and also rubbished the “assumptions” that Saudi Arabia had demanded Pakistan to payback loans or stopped the oil supply.\n“No such decision taken,” he stated, adding that Pakistan and Saudi Arabia had a ‘heart-to-heart relationship’ with a shared goal of peace,” he said.\nQureshi announced to hold a meeting with a delegation of Afghan Taliban tomorrow (Tuesday), saying “resumption of peace in Afghanistan is the main goal”.\nThe seven-member delegation arrives here from Qatar’s capital Doha on the invitation of the government of Pakistan.\nHe recalled that Pakistan had a “long and beneficial discussions” before the Doha peace agreement was inked between the United States and Taliban on February 29.\nChina is also supporting the peace process in Afghanistan, he said adding that a request was made to the Chinese FM to send their envoy on Afghanistan to Islamabad for a “coordinated approach”.\nAsked to comment over the recognition of Israel by Untied Arab Emirates, Qureshi said UAE, like any other country had the right to take bilateral decisions.\nHowever, he stressed that clear stance on the issue remained the same as endorsed by Saudi Arabia and Pakistan.\n“Pakistan cannot be pressured on the issue of Israel,” he categorically stated.",
  "retrievedAt": "2025-08-11T19:42:28.614Z"
}
