{
  "title": "NHA to start work on 25 new road infrastructure schemes during current fiscal year",
  "link": "https://www.app.com.pk/national/nha-to-start-work-on-25-new-road-infrastructure-schemes-during-current-fiscal-year/",
  "date_published": "2020-08-24T08:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):National Highway Authority (NHA) would start physical work on 25 new road infrastructure projects during ongoing fiscal year.\nThe new projects would focus on providing connectivity to less developed areas of the country as per vision of the present democratic government, an official of NHA told APP on Monday.\nThe government under the Public Sector Development Programme (PSDP) 2020-2021 has allocated Rs 29720 million for new schemes of NHA out of which Rs 3350 million are in the shape of foreign aid and Rs 26370 million in local component.\nFor Zhob-Kuchlak Road, which forms part of   Western alignment of China Pakistan Economic Corridor, Rs 10,000 million have been allocated in the PSDP-2020-2021. Total estimated cost of the project is Rs 63081 million.\nRs 4000 million have been earmarked for the construction of 146 km Hoshab-Awaran Section of Tattodero-Gawadar Motorway. Estimated cost of the project is Rs25835.893 million.\nFor the construction of 23 km Quetta Western Bypass, Rs 1500 million have been specified. Total estimated cost of the project is Rs 6890.569 million. Rs 1500 million have been allocated for widening and improvement of Lodhran-Multan Section of Grand Trunk Road. Estimated cost of the project is 12434.924 million.\nEstimated cost of Khyber Pass Economic Corridor Project is Rs  77912 million and an allocation of Rs 1500 million has been made in the PSDP for this project out of which Rs 500 million  is foriegn aid.\nFor construction of Additional Carriageway of Shikarpur-Rajanpur Section of Indus Highway, part of CAREC Corridor having estimated cost of Rs 47593.190 million an allocation of  Rs 1000 million has been made  out of which Rs 500 million is foreign aid.\nConstruction of a bridge over River Indus at Ghazi Ghat on N-70 would cost  Rs 1878.278 million. Rs 1000 million have been allocated for the project in the  PSDP.\nFor the construction of Dera Murad Jamali Bypass Rs 1000 million have been allocated. Its estimated cost is  Rs 2105.954 million. As far as dualization and improvement of 210 km existing N-50 from Yarik – Sagu – Zhob including Zhob Bypass, is concerned, it would cost Rs 76486.231 million and it has an allocation of  Rs 1000 million in the next PSDP which also included Rs 500 million foreign aid.\nEstimated cost of the deposit work of 82 km  Jhal Jaho-Bela Section, is  Rs 12343.400 million, whereas  allocation in the PSDP 2020-2021 is Rs 1000 million. Deposit work of Nokundi- Mashkhel Road, also part of CPEC would cost Rs 7708.911 million and in the PSDP,  Rs 1000 million have been earmarked.",
  "retrievedAt": "2025-08-11T19:42:35.081Z"
}
