{
  "title": "Govt taking significant steps for combating climate change, says Zartaj Gul",
  "link": "https://www.app.com.pk/national/govt-taking-significant-steps-for-combating-climate-change-says-zartaj-gul/",
  "date_published": "2020-08-24T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): Minister of State for Climate Change Zartaj Gul Monday said the present government was taking all-out measures for the overall environmental protection through forests regeneration and biodiversity conservation programmes for boosting the country’s climate-resilience.\nTalking to a private news channel, she said government has taken several steps for preservation of biodiversity and natural resources by increasing the number of trees under clean & green Pakistan project, adding, every person would have to contribute for the preservation of environment.\n“The government will not only oppose construction but will also demolish the existing infrastructure to restore their biodiversity,” says minister of environment.\nShe said clean and green Pakistan Programme, envisioned by the prime minister, reflects his understanding about unquestionable importance of forests in tackling climate change and seriousness towards reinvigorating ailing forestry sector as a part of boosting country’s climate resilience.\nShe further lamented that businesses in national parks are earning in millions but aren’t directing enough funds under Corporate Social Responsibility (CSR) agreement for the preservation and restoration.\nReplying to a question, she said business operating in the national parks try to expand illegally whenever they find an opportunity to do so, adding, for instance, earlier in May, Islamabad’s District Administration sealed the Monal restaurant after its management started chopping down trees surrounding in an attempt to expand secretly.\nZartaj said that “the Federal government has focused on preserving the 15 national parks across Pakistan along with completing the 10 Billion Tree Tsunami project to increase the forest cover in Pakistan.”\nShe added that Pakistan Tehreek e Insaf (PTI) government’s 10 Billion Tree Tsunami project has received global recognition.\nShe also warned that a stern action would be taken against the elements involved in the illegal forests cutting and illegal construction of buildings on tourist sites leading to deforestation in the province.\nReplying to another question, she mentioned that according to rankings released by PMDU, Ministry of Climate Change tops the ranking list as 57 percent people expressed satisfaction over the performance of ministry in resolving public complaints.\nShe said now the responsibilities of ministry have been increased where citizens complained related to climate change would be addressed on priority basis.\nShe said Prime Minister Imran Khan inaugurated the Pakistan Citizens’ Portal set up at the Prime Minister Office with an aim to “timely address the problems of the people and get their feedback”.\nThe portal is now available to citizens in the form of a cellphone app, but they are also able to approach the government via telephone, email or written letters.\n“The system that we’ve developed is a means to change the prevailing mindset. For the first time, government offices and ministries are accountable,” she said, adding that it would give ordinary Pakistanis, both home and abroad, a voice.\nWhile listing steps taken by her ministry to tackle climate change issue, she mentioned the government has initiated remarkable programs including go green Pakistan, plantation of trees, ban on plastic bags, renewable energy resources and e-cars to combat with the environmental issue and reduce carbon emission.",
  "retrievedAt": "2025-08-11T19:42:32.272Z"
}
