{
  "title": "Renowned Gastroenterology recommends hygeinic food, clean water, sterlized medical instruments to prevent causes of Hepatitis spread",
  "author": null,
  "content": "ISLAMABAD, Jul 28 (APP):A medical specialist on Monday advised a healthy lifestyle, hygienic food, clean water and proper sterilisation of all medical instruments, including blades and syringes, to prevent the spread of Hepatitis in humans.\nTalking to a private news channel on the occasion of World Hepatitis Awareness Day, renowned Gastroenterology  Prof Dr Zahid Azam shed light on the causes of Hepatitis B, C, D and E pandemic –a silent killer and its cure and preventive measures from its spread.\nHe said that most patients in Pakistan are suffering from the Hepatitis B virus and that is directly related to the liver’s malfunctioning and in Children, it is present in the form of jaundice and Hepatitis A, adding he said Hepatitis B, C, and D can even cause patients’ death.\nHe said the most common causes of hepatitis are found in cases of negligence in daily diet, use of already unsterilized syringes and instruments,  blood transfusion without prior screening, adding that he said infected tools can transmit hepatitis in other patients easily.\nHe recommended that the patients should demand from the Chemists to use the new blades whenever they visit them in the medical shops.\nReplying to a question relating to external factors of Hepatitis spread and its slow cure, he said medical doctors, nurses, and surgeons should take extra care while using medical instruments such as blades and syringes to give medical help to the patients.\nSo far as the internal factors of Hepatitis virus spread are concerned, he said the major cause of Hepatitis  E is due to unhygienic food, polluted water, while Hepatitis  B, C, and D are due to blood issues.\nHe informed about Autoimmune Hepatitis, which is another kind, and it is caused by a patient’s cell that works against their own body, and thus they get infected, but its spread is mostly in European and Western countries and not in Pakistan.\nHe said that luckily there is available the cure, medicines, and vaccination for Hepatitis B while there are now available medicines for hepatitis C, and we are expecting that the spread of Hepatitis C or D would be eliminated.\nTalking about Pakistan’s EPI programme, he said the govt of Pakistan is equipped with sufficient Hepatitis vaccine for the cure of the diseases adding that he said Pakistan is on the third position in diseases like Diabetes and and blood pressure which are the valcanos for the fatty liver issues and the person lands in the liver damage and even liver function failure that may need the transplant in patients.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:16:26.120Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/renowned-gastroenterology-recommends-hygeinic-food-clean-water-sterlized-medical-instruments-to-prevent-causes-of-hepatitis-spread/",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T10:13:00.000Z"
}
