{
  "title": "Pakistan-Kyrgyzstan sign multiple protocols, MoUs to deepen economic cooperation",
  "author": null,
  "content": "ISLAMABAD, Jul 28 (APP):The 5th session of the Pakistan-Kyrgyzstan Inter-Governmental Commission (IGC) on Trade, Economic, Scientific and Technical Cooperation was held on Monday, reflecting a shared commitment to expand cooperation in diverse sectors of mutual interest.\nThe meeting marked a significant advancement in the bilateral relationship between the Islamic Republic of Pakistan and the Kyrgyz Republic, said a press release.\nThe session was co-chaired by Minister for Energy (Power Division) Sardar Awais Ahmad Khan Leghari, and Deputy Chairman of the Cabinet of Ministers of the Kyrgyz Republic  Edil Baisalov.\nBoth sides held in-depth discussions and reviewed progress made since the last session, with renewed focus on strengthening economic and technical collaboration.\nDuring the meeting, the two sides reaffirmed their resolve to boost bilateral trade, setting a target to raise trade volume to $100 million. They agreed to work on diversification of exports and imports, revive the Pakistan-Kyrgyz Joint Business Council, and organize business forums, trade fairs, and B2B exchanges. A number of Memoranda of Understanding (MoUs) were signed to deepen cooperation in key sectors.\nAn MoU was signed between the Center for Standardization and Metrology under the Ministry of Economy and Commerce of the Kyrgyz Republic and the Pakistan Standards and Quality Control Authority (PSQCA) under the Ministry of Science and Technology of Pakistan. The agreement focuses on standardization, metrology, conformity assessment, and management systems.\nA second MoU was signed between the National Investments Agency under the President of the Kyrgyz Republic and the Board of Investment of Pakistan to foster investment cooperation.\nThe third MoU focused on Halal trade cooperation, signed between the Pakistan Halal Authority (PHA) under the Ministry of Science and Technology of Pakistan and the State Institution “Center for Development of Halal Industry” under the Ministry of Economy and Commerce of Kyrgyzstan.\nIn the energy and environment domain, the Kyrgyz side proposed joint participation in a power transmission line project connecting Kyrgyzstan, China, and northern Pakistan. Both countries agreed to explore electricity imports, collaboration in renewable energy, mining, hydrocarbons, and technical partnerships between institutions like the Hydrocarbon Development Institute of Pakistan and the Kyrgyz State Technical University.\nDiscussions also focused on enhancing regional connectivity through logistics and transportation. Both sides agreed to deepen cooperation in postal services, cargo and rail transport, and civil aviation. Pakistan proposed that Kyrgyz airlines shift from charter to regular passenger flights for improved service.\nPakistan also took note of Kyrgyzstan’s proposed new air route linking with China and expressed interest in further dialogue on regional air connectivity. The Kyrgyz side also proposed Pakistani participation in a high-speed fiber-optic communication line project along the Pakistan-Kyrgyzstan route.\nBoth countries underscored the importance of strengthening financial cooperation. The central banks of both countries agreed to collaborate on the development of Islamic banking and financial instruments, including training programs through Pakistan’s National Institute of Banking and Finance.\nIn the health and pharmaceutical sectors, both parties agreed to accelerate discussions on cooperation in medical education, pharmaceuticals, and surgical instruments. Pakistan welcomed Kyrgyz proposals to facilitate the participation of Pakistani companies in public procurement and to support the registration of Pakistani medicines in Kyrgyzstan. Both sides expressed interest in establishing joint ventures in vaccine and biological product manufacturing.\nCultural cooperation was identified as a key area for people-to-people exchange. The two sides agreed to promote regular cultural exchanges, organize events, and support participation in international sports events. They also discussed enhancing cooperation in cinematography and information broadcasting, with Pakistan proposing content sharing and training programs between media institutions of both countries.\nEducation and scientific collaboration featured prominently in the discussions. The parties agreed to promote joint training programs, academic exchanges, and institutional linkages. Pakistan reiterated its support to Kyrgyz students under the Pakistan Technical Assistance Program (PTAP). Both sides also agreed to explore labor cooperation and establish a Joint Working Group to discuss its modalities.\nThe session concluded with the decision to hold the 6th meeting of the Inter-Governmental Commission in the Kyrgyz Republic. Dates will be finalized through diplomatic channels.\nThe Ministry of Economic Affairs views this session as a key milestone in strengthening Pakistan’s engagement with Central Asia and particularly with the Kyrgyz Republic, and advancing regional economic integration. The agreed initiatives will contribute to sustainable development, shared prosperity, and closer ties between the peoples of Pakistan and Kyrgyzstan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:14:47.507Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-kyrgyzstan-sign-multiple-protocols-mous-to-deepen-economic-cooperation/",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T16:40:00.000Z"
}
