{
  "title": "Govt continues to provide diplomatic, legal support in Aafia Siddiqui case: Tarar",
  "author": null,
  "content": "ISLAMABAD, Jul 28 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar, reaffirming diplomatic and legal support to Aafia Siddiqui, on Monday said the remarks of Deputy Prime Minister and Foreign Minister Ishaq Dar about her was taken out of context.\nThe government has been continuously providing diplomatic and legal support in Aafia Siddiqui case, said the minister while talking to the media after attending a book launching ceremony at the National Language Promotion Department in Islamabad.\nA committee, headed by the Law Minister, has also been formed to facilitate progress on the matter, the minister added.\nHe said the incumbent government is making unprecedented efforts for Dr. Aafia Siddiqui’s release compared to previous regimes, dismissing the misrepresentation of Ishaq Dar’s statement as a conspiracy by the opposition.\nDPM and FM Ishaq Dar is not a member of the Sugar Advisory Board, he said, urging the media to verify before airing any news.\nRegarding cryptocurrency regulation, the minister said a system has been established that includes formation of a Crypto Council and the drafting of relevant laws.\nHe underscored the growth of cryptocurrency in Pakistan and criticized former finance minister Miftah Ismail’s narrative on the issue, suggesting it aligns with India’s stance and is contrary to ground realities.\nTarar emphasized that cryptocurrency is a regulated industry with established laws and that making unsubstantiated claims against it serves an agenda hostile to Pakistan’s progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:14:57.332Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-continues-to-provide-diplomatic-legal-support-in-aafia-siddiqui-case-tarar/",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T13:59:00.000Z"
}
