{
  "title": "ANF recovers over 245 kg drugs; arrests 12 drug traffickers",
  "author": null,
  "content": "ISLAMABAD, Jul 28 (APP):Anti-Narcotics Force (ANF) while carrying out nine operations across the country managed to recover over 245 kg drugs worth over Rs 25 million and arrested 12 accused.\nAccording to ANF Headquarters spokesperson, in an operation near a college on Mansehra, Karakoram Highway Road, 700 grams hashish was recovered and an accused was arrested.\nIn another operation near a university in Jamshoro, Sindh, two kgs ice was recovered from a passenger traveling in a public transport.\nThe arrested suspects confessed selling drugs to the students of educational institutions.\nIn the third operation near Ring Road, Peshawar, 12 kgs hashish was seized from the possession of two women.\nAt Jamshoro bus stop, three kgs ice was recovered from the possession of a woman traveling in a public transport.\nIn an operation on RCD Road, Hub, 21.6 kgs hashish was confiscated from a trailer and two suspects were arrested during the operation.\nNear Othian in Sialkot, 5 kgs ice, 3.6 kgs opium, & 3.6 kgs hashish were recovered from a vehicle and two drug traffickers were arrested during the operation.\nIn an operation near pholon wala Chowk, Sheikhupura, 1000 grams hashish & 500 grams opium were recovered from the possession of a motorcyclist.\nNear M-2 Motorway near Chakri Interchange, 142.740 kgs hashish & 37.820 kgs opium were seized from a vehicle and an accused was apprehended during the operation.\nIn another operation on Karakoram Highway Road, 12 kgs hashish was recovered from a vehicle and a drug trafficker was netted.\nThe spokesperson informed that cases have been registered against the arrested accused under the CNS Act.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:16:38.554Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/anf-recovers-over-245-kg-drugs-arrests-12-drug-traffickers/",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T08:03:00.000Z"
}
