{
  "title": "600 mln saplings to be planted during spring plantation campaign this year: Amin Aslam",
  "link": "https://www.app.com.pk/national/600-mln-saplings-to-be-planted-during-spring-plantation-campaign-this-year-amin-aslam/",
  "date_published": "2022-01-16T08:27:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 16 (APP): Special Assistant to the Prime Minister (SAPM) on Climate Change, Malik Amin Aslam said over 600 million saplings would be planted during spring plantation campaign this year.\nHe said the government had set a plantation target of one billion trees for all the provinces this year.  The SAPM said directives had been issued by the government that no agricultural land could be converted into housing societies.\nEarlier, the approval for establishing a housing society was given at commissioner level but now, the provincial cabinet would approve new housing projects.\nThe step had been taken to make the approval to convert agricultural land for housing project, a difficult task so that the agricultural land could be protected, he added.\nHe said there was no master plan for any city. After 1960, no master plan was formulated for any city. On the directives of the Prime Minister, the master plans of 80 cities were being devised which would be finalized within five to six months, he added.\nThe master plans would help contain the limits of the cities and there would be no expansion of the cities beyond their limits.\nThe government was encouraging the construction vertically to save agricultural land, he said.   About installation of sewerage plants and plantation by the housing societies he said, “The government is going to issue an order for environmental audit of all the housing societies and strict action would be taken against those violating the rules.”\nHe informed that urban Miyawaki Forests were being set up in congested city areas in accordance with ten billion tree tsunami vision of the Prime Minister Imran Khan.   He said, “We have established nearly 100 urban Miyawaki Forests in Lahore and more than 100 Miyawaki Forests were also set up in Khyber Pakhtunkhwa.”\nMalik Amin Aslam said, “The plantation under ten billion tree tsunami project was being carried out over 9500 sites which will be uploaded on the website so that the citizens could be able to check the plantation activities.\nThe step is being taken to ensure complete transparency for the project.”   He said more urban Miyawaki Forest projects would also be set up in Rawalpindi to provide the citizens clean and green environment.\nHe informed that an operation was launched earlier in Kotli Sattian and strict action was taken against those involved in illegal cutting of trees from the forest areas.\nAmin Aslam said a comprehensive strategy was being evolved to protect the forests.\nLocal residents of the forest areas would be hired and made forest guards to prevent fire incidents in the forest areas. Such project was implemented in Khyber Pakhtunkhwa which remained successful, he informed.  A plan in this regard had been formulated and the project would be implemented soon, he added.",
  "retrievedAt": "2025-08-11T14:07:28.520Z"
}
