{
  "title": "PNCA’s 2-day special puppet shows start",
  "link": "https://www.app.com.pk/national/pncas-2-day-special-puppet-shows-start/",
  "date_published": "2023-12-08T18:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP): The two-day special puppet show to create awareness on child protection, mental health and climate change, under the auspices of Pakistan National Council of the Arts (PNCA), got underway here at the PNCA Auditorium on Friday.\n“The National Puppet Theatre has been presenting message oriented puppet shows for last four decades to promote traditional puppetry on one side and create awareness on various social issues and their solutions on the other side,” a PNCA press release said.\n“Three new puppet stories with beautiful music, artistic set and props, animated colourful back projection on rod puppets have been presented by the National Puppet Theatre & Children Art Workshop of Pakistan National Council of the Arts in collaboration with Secour Islamique France (SIF),” the press release said.\nSecour Islamique France (SIF) has been working in Pakistan since 2010 in field of hygiene, sanitation, provision of clean water, food security and children’ s rights. SIF is working in less developed areas for orphan children and their mothers. Altaf Abro, Head of Mission of SIF took initiative in 2021 to create awareness on social issues through puppetry in collaboration with PNCA.\nSince then PNCA and SIF has presented theme based puppet shows for children and elders to enlighten them over collective responsibility of financially sound families to help those who are deprived of financial and basic necessities of life, importance of education for girls and boys equally, ways to earn livelihood through small level business, skilled works and entrepreneurship.\nThis year, PNCA and SIF decided to present special stories on the current era’s challenging issues which include alarming increase in child abduction, rape and killing cases, rise in mental diseases and climate change.\nBefore the puppet show, a panel discussion on child protection was held. PNCA Director General Muhammad Ayoub Jamali deliberated on the role of PNCA in bringing awareness on social issues through various art forms including puppetry. He suggested to work in close liaison with various government organizations, NGOs and INGOs established for child protection.\nHe expressed his great concern over the rising ratio of child abuses and non reporting such cases by the parents and victims.\nImtiaz Khalid Soomro from SAHIL discussed the relevant law provisions for child protection and criminal clauses and sentences in laws for redressing the grievances of the victims. He said even the law provided remedy for bad touch.\nHaroon Ur Rehman, representative of Child Protection Institute (CPI), discussed the ways to create awareness on the issue, role of parents in encouraging their children to discuss with their parents and seek guidance from them in case if they are facing any kind of harassment.\nDr. Roomi Hayyat, CEO of Institute of Rural Management, enlightened the ways to create opportunities for all to learn and divert their ill intentions to some positive activities.\nMs. Feroza Zahar, Country Programme Manager and Dr. Fouzia Farooq, writer of the puppet story, “Bachpan Nagar ka Qissa” discussed the elements of hesitation and resistance among parents, guardians and elders to report the matter in case if their child is abused physically, sexually or mentally.\nDr. Fouzia Farooq also shared her hesitation to write a script on the matter which was considered as a taboo in the society.\nAfter panel discussion, the PNCA presented special puppet show wherein the main story, “Bachpan Nagar ka Qissa” on rod puppets with animated, visual graphics, artistic set designs was presented. The story revolves around the children, their parents and three evil characters lalchi, jhansa and drawa.\nIn various situational scenes attempts of “drawa, lalchi and jhansa” were made to trap children but they failed because the parents had guided them to say “NO” to any offer given by strangers, refuse to go away with stranger, avoid physical touch with elders, resist black mailing.\nThe other special story, Mujhay Ooncha Urna Hai” was based on puppet character of Shani who was facing some mental stress and depression due to non sharing of his feelings with others, lack of communication and excessive use of mobile phone, internet and social media apps. However, his teacher arranged a counseling with a psychologist who guided him to explore his hidden talent. Shani won the song competition held in his school after overcoming his mental stress.\nThird story was presented on climate change whereby Babu, Pappu (glove puppets) and fairy enlightened the audience regarding the causes of climate change which include deforestation, increasing population, smoke and chemicals emitted from factories, vehicles, crops leftover burning, usage of polythene and plastic bags are causing raise in temperature on earth which are major cause of climate change.\nThe climate change has become a challenging issue which is causing melting of glaciers, flash floods, strong windstorms on one side, and low level due to low rains which is tuning the green lands into barren lands.\nFairy told the audience to install filter plants in factories, use petrol instead of diesel and do plantation, increase forest area upto 25% to combat climate change.\nAround 400 people attended the show, who along with the guest speakers applauded the contribution of PNCA and SIF in presenting the special puppet show to create awareness on child protection, mental health and gravity of the climate change which will engulf our lives in coming years if no corrective measures are initiated in time.",
  "retrievedAt": "2025-08-11T10:54:47.926Z"
}
