{
  "title": "Govt’s economic reformative steps reignited investors’ confidence: PM",
  "link": "https://www.app.com.pk/national/govts-economic-reformative-steps-reignited-investors-confidence-pm/",
  "date_published": "2023-12-08T05:10:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 08 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday said that the investors had regained confidence after the successful signing of a standby agreement with the International Monetary Fund (IMF), the execution of the annual budget 2023-24 and improvement in the fiscal and external accounts.\nThe prime minister, addressing the ceremony marking the first auction of the Government Ijarah Sukook bonds issued by the Pakistan Stock Exchange, said it was the collective responsibility of the stock brokers, SECP, and other participants to promote upcoming primary market auctions to market it a remarkable achievement for the entire market ecosystem.\nHe congratulated all the stakeholders on the auction of the Government Ijarah Sukook through PSX, instead of the State Bank of Pakistan, which was aimed at simplifying the participation in government securities auction, diversifying the investors’ base, and enhancing transparency.\nHe lauded the market participant for their interest in the auction through PSX particularly the participation of the retail market.\nHe told the gathering that the stock exchange was a dynamic force and a heartbeat that resonated with the aspirations of business and progress.\nThe prime minister, who later rang the gong of the stock exchange said it did not only herald the market transactions but also a symphony of progress and prosperity.\n“The gong’s echoes reverberate not only within these walls but across the financial corridors of the nation, symbolizing our commitment to fostering an inclusive and robust financial ecosystem that welcomes diverse voices and promotes economic prosperity shared by all,” he remarked.\nHe said initially, Pakistan’s economy faced multiple challenges at the start of 2023-2024, but the government addressed structural and macroeconomic issues to rectify the situation.\nHe said the collective efforts of all stakeholders had successfully brought the economy back on track, leading to a lower dollar rate from 307 on September 5 in the interbank to 284 today which also resulted in a decline in inflation.\nPrime Minister Kakar said the bullish sentiment in the stock exchange was made possible by an improved economy, the participation of foreign investors, a high yield, and a stable exchange rate.\nHe said the capital market provided fuel for businesses to expand, create jobs, and contribute to the overall development of society.\nHe reiterated the government’s commitment to fostering an environment that nurtured the resilience of the capital market, recognizing its critical role as a stabilizing force that absorbed shocks and steered the economy toward stability.\nThe prime minister called for efforts to build a capital market that not only mirrored economic strength but also embodied values of fairness and integrity.\nIn her address, Caretaker Finance Minister Shamshad Akhtar welcomed the prime minister to launch Government Sukook Auction through PSX.\nShe said the Iajarah Sukook was a monumental and innovative product being launched for the first time beyond the State bank which had total control over government securities.",
  "retrievedAt": "2025-08-11T10:55:39.416Z"
}
