{
  "title": "Tehsil chairmen, tribal elders discuss development process with Dr. Aamer Abdullah",
  "link": "https://www.app.com.pk/national/tehsil-chairmen-tribal-elders-discuss-development-process-with-dr-aamer-abdullah/",
  "date_published": "2023-12-08T10:48:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 08 (APP): A representative delegation of tehsil chairmen and tribal leaders hailing from the newly merged districts, called on Khyber Pakhtunkhwa Caretaker Minister for Newly Merged Districts Affairs, Industries, Commerce and Technical Education, Dr. Aamer Abdullah here Friday and discussed with him matters related to development process, public problems and possible cooperation for their solution.\nThe delegation was comprised on tribal leader and Tehsil Chairman from Bajaur Said Badshah, Tehsil Chairman South Waziristan Lower Taj Maluk, Tehsil Chairman North Waziristan Ahmad Said, Tehsil Chairman Upper Kuram Ehsanullah, Tehsil Chairman South Waziristan Upper Maulana Saleh and Tehsil Chairmain Orkazai Maulana Tahir Orkazai.\nDuring the meeting, the caretaker minister said that the relevant authorities would be contacted for the purpose of including the consultation of local public representatives in the identification of new schemes under the Risk Project of the World Bank in the merged districts.\nHe said that the controversial committee formed in the previous federal government for the use of funds in the merged districts has been canceled by the federal government on the demand of the provincial government and now the funds which receive for utilization in these districts can be used through the province wherein,views of local chairmen will be included.\nThe caretaker minister said that due to financial constraints and ban imposed by the Election Commission, new projects had not been started, but we were trying to ensure funds provision to the ongoing projects in the merged districts.\nHe said that due to their consecutive efforts, TMAs of the merged districts had received funds to pay back salaries while assured that concerned ministers and administrative secretaries of the development sector departments would be asked to include the opinion of local body chairmen in the PC-I of the new proposed projects in the merged districts.\nOn a question of solarization of mosques in the merged districts, the caretaker minister said that at present, two solar energy projects were running in the merged districts, one of which was near to completion and the other was in preliminary stage. He added that they were trying to provide reasonable funding to these projects for their early completion so that people could start benefiting from their fruits soon.\nThe caretaker minister further said that fund had been released for the Ghalanai road and the stopped construction work in same road had started again. He said that in this way, efforts were underway to release funds to start work on important communication projects in Orakzai and Waziristan also.",
  "retrievedAt": "2025-08-11T10:55:02.656Z"
}
