{
  "title": "PM Kakar advocates equal rights for minorities; calls for meritocracy, social opportunities",
  "link": "https://www.app.com.pk/national/pm-kakar-advocates-equal-rights-for-minorities-calls-for-meritocracy-social-opportunities/",
  "date_published": "2023-12-08T07:47:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 08 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday reaffirming the equal rights for minority communities called for enforcing meritocracy and social opportunities for their uplift and mainstreaming.\nThe prime minister, in an interactive session with the students of Aga Khan University, said the minorities were equal Pakistanis as Madina State had also guaranteed equal responsibilities and rights for the citizens.\nCalling for infusing a sense of confidence in the people, he said the meritocracy should be enforced, and social opportunities for minorities should be created.\nTo a question, he said that the people of Pakistan enjoyed freedom of expression and considering the country’s political history, any particular incident could not be associated with the government of that particular term.\nHe said that the incidents involving the violations of freedom of speech were not limited to a particular government.\nThe prime minister, responding to a query by a university student about the arrest of journalists, said that during the tenure, he was referring to, the journalists were shot at and faced many such acts which were against the freedom of expression.\n“You have a freedom of expression and speech. You spoke your heart before the prime minister. After this, your allegation of no freedom of speech would carry lesser weight,” he remarked.\nAbout the rights and status of Gilgit Baltistan, he said GB was and would remain part of Pakistan. He said the matter of rights should be tackled peacefully without any resentment.\n“The political procedure should move forward. The GB should be our Singapore. Our identities are associated with each other,” he remarked.\nTo a question, the prime minister said after 18th amendment, health was a devolved subject with the provinces having all the funding to spend on the sector. The visionary leadership is essential to address the challenges, especially the management of funds, he added.\nAbout the lack of education research, the prime minister said allocating billions of rupees for the parliamentarians amidst the higher education and research crisis was unjustified.\nHe said some individuals might have this realization, but it should be at the policymaker’s level. He urged the students to keep raising their voices for the promotion of education to jolt the people at the helm of affairs.\nTo another query, he said he was not worried about the educated people moving abroad as they were not divorced from the society rather they would continue to contribute to the country;’s development through their remirttances.\n“If a nurse or doctor is joining the global supply chain and contributing to the GDP, this is not a curse. This is quite natural. The gaps should be filled. Of our huge population, if some useful individuals go abroad, they are not divorced from our society,” he commented.\nEarlier, in his opening remarks, he said that the educational institutions had always been very close to his heart.\nHe also gave a historical account of the education and research from Greek period to the modern era experiencing unprecedented modern tools.",
  "retrievedAt": "2025-08-11T10:55:30.711Z"
}
