{
  "title": "Dr. Amjad urges unique thinking to address economic challenges",
  "link": "https://www.app.com.pk/national/dr-amjad-urges-unique-thinking-to-address-economic-challenges/",
  "date_published": "2023-12-08T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP):Chairperson Benazir Income Support Programme (BISP), Dr. Muhammad Amjad Saqib Friday emphasized the need for unique and innovative thinking to address the current economic challenges facing the country.\nHe urged the affluent citizens of Pakistan to stand in solidarity with the less privileged, emphasizing the role of increased charity to eradicate the societal menace of interest.\nWhile delivering a compelling speech at an event organized by the Pakistan Telecommunication Authority (PTA) in Islamabad, he underscored the importance of social training for those in need, highlighting the significance of empowering them with the necessary skills for self-sufficiency.\nThe event was attended by Chairman PTA Major General (retd) Hafeez Ur Rahman HI (M), Member Finance PTA Muhammad Naveed and other higher officials of PTA.\nDr. Amjad Saqib also addressed the issue of resource distribution, asserting that the problem lies in the unfair allocation rather than scarcity. “Western economic theory is not the solution to our problems”, he said.\nHe called for an understanding of sustainable development goals in the context of Islamic teachings.\nDr. Amjad Saqib urged the implementation of ‘Mawakat’ to aid impoverished families, showcasing his commitment to supporting the underprivileged.\nHe stressed the pivotal role of technical training and small businesses in uplifting children from impoverished backgrounds.\nChairman PTA Major General (retd) Hafeez Ur Rahman affirmed unwavering support from the Pakistan Telecommunication Authority (PTA). During a motivating interaction, he extended encouragement not only to the PTA staff individually but also at the organizational level, urging them to wholeheartedly contribute with sincerity towards the welfare of the less fortunate and the overall betterment of society.\nIn the end, Dr. Amjad Saqib presented his book to Chairman PTA, further highlighting the partnership between the two organizations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:55:15.825Z"
}
