{
  "title": "Sherry Rehman calls for measures, accountability at COP 28; blames inaction for climate crisis",
  "link": "https://www.app.com.pk/national/sherry-rehman-calls-for-measures-accountability-at-cop-28-blames-inaction-for-climate-crisis/",
  "date_published": "2023-12-08T14:44:00.000Z",
  "source": "APP",
  "content": "DUBAI, Dec 08 (APP): Senator Sherry Rehman has urged for immediate action and accountability from developed nations while highlighting the two main drivers of the climate crisis; inaction and injustice.\nWhile delivering an address at the COP 28 Pakistan Pavilion here Friday, she said, “I really feel strongly that there are two toxins at the heart of the climate crisis; one is inaction, and the other is injustice.”\nTitled “Climate Justice: New Narrative of Hope, Resilience, and Security”, the session was also attended by Justice Syed Mansoor Ali Shah, Justice Jawad Hassan and UNEP Executive Director Inger Andersen. It highlighted the devastating impact of climate change on vulnerable communities, particularly in Pakistan.\nThe inaction of major polluters, Senator Rehman explained, has a clear impact on the lives of people around the world, particularly those in vulnerable communities. The Senator cited the example of a woman who has to carry water for miles from a field to her home, a task made harder and more dangerous by climate change.\nRehman said that the Paris Agreement was meant to address both inaction and injustice. However, she questioned whether enough progress had been made since then.\n“Where are we today at COP 28? The bumper sticker is ‘leave no one behind.’ Well, right now, according to the synthesis report of the IPCC, we are leaving half the world behind already,” she said.\nShe characterized COP 28 as a “historic opportunity,” stressing the need to seize this moment to save “not just the planet, but half the world right now.”\nHer address was a reminder of the urgency of addressing climate change and the need for global collaboration to ensure a just and sustainable future for all.",
  "retrievedAt": "2025-08-11T10:54:52.950Z"
}
