{
  "article_id": "2025-07-14_39c5a65269c1ae7ad00b8e00902acc4e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-it-committee-expresses-concern-over-connectivity-gaps-delayed-spectrum-auction/",
    "retrieved_at": "2025-08-27T09:33:59.379Z"
  },
  "metadata": {
    "title": "NA IT committee expresses concern over connectivity gaps, delayed spectrum auction",
    "author": null,
    "date_published": "2025-07-14T15:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 466,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 14 (APP):The National Assembly's Standing Committee on Information Technology and Telecommunication on Monday raised serious concerns over internet connectivity issues and the prolonged delay in the auction of telecom spectrum. The meeting, chaired by Minister Syed Amin ul Haque, was briefed by officials from the Universal Service Fund (USF), who informed that certain areas in Tharparkar and Sargodha Division still lack proper access to internet and voice call services. These findings were based on surveys conducted by the Pakistan Telecommunication Authority (PTA). The USF said that dedicated projects for these underserved regions have already been approved and are in the final stages before implementation. The Committee directed the USF to submit a complete list of all such approved projects scheduled for execution over the next three to five years. The Committee also noted that telecom services were not being provided in certain areas, despite the presence of fibre optic infrastructure. The PTA was instructed to ensure that telecom operators deliver reliable services to affected areas. During the meeting, the PTA Chairman shared that nine Long Distance and International (LDI) operators have defaulted on payments totalling around Rs. 19 billion. Over 100 related cases are currently pending in courts. He noted that while six operators have agreed to clear their dues, a clear recovery framework is still needed. One of the options being considered is an instalment-based payment plan. A proposal on this matter has already been presented in the Cabinet for legal and procedural guidance. To further address the issue, the committee formed a sub-committee under MNA Sher Ali Arbab to engage with LDI operators, the Ministry of IT, and other stakeholders to formulate concrete recommendations. Federal Minister for IT and Telecom, Shaza Fatima Khawaja, also briefed the committee on fund utilization and key projects, including the Islamabad IT Park and the \"One Patient, One ID\" health initiative. USF CEO Chaudhry Mudassar Naveed gave an overview of broadband expansion efforts in remote areas, while IGNITE CEO Adeel Sheikh highlighted progress on the Cyber Security Hackathon and DG Skills training programs. Dr. Mahesh Kumar Malani pointed out that internet connectivity remains a nationwide issue, with Karachi also facing He noted that over 30% of Pakistan's territory lacks adequate internet coverage across all four provinces. The PTA Chairman acknowledged the challenges, stating that running 4G and 5G networks without fiber-optic infrastructure is not feasible. Currently, 275 MHz of spectrum is in use, which contributes to the connectivity shortfalls. Although 500 MHz of spectrum is available for auction, the process is delayed due to Telenor's merger with Ufone and related legal disputes. The committee also expressed displeasure at the absence of the Secretary of Law from the meeting. Chairman Amin ul Haque warned that disciplinary action would be taken if he fails to attend the next session.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}