{
  "article_id": "2025-07-14_687aa829c07c01ff2b191a629bbf9b5e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/piyass-international-seeks-nationwide-ban-on-shopping-bags-silent-killer-of-environment-health/",
    "retrieved_at": "2025-08-27T09:35:40.529Z"
  },
  "metadata": {
    "title": "Piyass International seeks nationwide ban on shopping bags, silent killer of environment, health",
    "author": null,
    "date_published": "2025-07-14T06:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 183,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 14 (APP):In Pakistan, plastic shopping bags have rapidly become a silent killer for human health, soil fertility, marine life, and the atmosphere. Environmental experts and human rights organizations have repeatedly warned that the toxic chemicals in these bags were directly linked to cancer, infertility, respiratory disorders, and hormonal imbalances, said a press release issued here Monday. Moreover, these plastics were causing irreversible damage to our air, land, and water ecosystems. Welcoming the Sindh government's recent decision to impose a complete ban on plastic shopping bags, Chairman of Piyaas International Human Rights, Rana Imran Latif, urged the federal government to replicate this action at the national level without delay. \"Shopping bags are a silent killer, steadily destroying both our future generations' health and our environment. It is high time the government enacts strict national-level legislation against plastic bags and ensures its effective enforcement,\" he stated. Piyaas International warned that without immediate intervention, plastic pollution will soon push major cities in Pakistan towards an environmental catastrophe. The organization called for swift policy measures, institutional accountability, and awareness campaigns to combat this looming threat.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}