{
  "title": "Pakistan fared relatively better amidst int’l commodity price hike: PM",
  "link": "https://www.app.com.pk/national/pakistan-fared-relatively-better-despite-worldwide-commodity-price-hike-pm/",
  "date_published": "2021-11-07T07:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP): Prime Minister Imran Khan Sunday said that Pakistan had comparatively managed “much better” than other countries amidst unprecedented price hike of commodities caused by the COVID lockdown.\nOn Twitter, the prime minister said that an unprecedented rise in commodity prices internationally had adversely affected most countries in the world as a result of the COVID lockdowns.\nHowever, he said, “Pakistan MashaAllah has fared relatively much better.”\nThe prime minister also shared a video clip of Finance Ministry Spokesperson Muzammil Aslam who rubbished the notions of Pakistan’s dwindling economy.\nQuoting the data of Food and Agriculture Organization, he said from September to October this year, food prices increased by 1.9%, World Cereal Index by 3.2%, edible oil prices by 9.6%, and dairy products by 2.6%.\nHowever, he said despite the worldwide inflation trend, Pakistan’s exports recorded an increase of 17% in October and are likely to touch $30 billion mark this year. Textile exports are expected to reach $22 billion this year.\nHe said consequent to the government’s timely measures, the non-oil imports of the country reduced by 12.5% last month making a difference of $750 million.\nHe said due to increasing income, tax collection also surged with 32% increase in four months making the government to receive additional Rs 151 billion compared to last year.\nHe said according to the latest data, country’s cotton crop increased by 81% during the last four months. In August, the industry recorded a growth of over 12% and companies’ profits by 21%.\n“All this shows that the country’s economy is heading fast and employment would be required in the coming days,” the spokesperson commented.\nAddressing a question about any relief for the middle class in PM’s recently announced Rs 120 billion relief package, he said the government had already announced a concession of Rs5-7 on every electricity unit to be consumed more than the previous year’s consumption during November to February.\nMoreover, he said the sugar prices would fall in the near future owing to record sugarcane crop.\n“All these things will appear on the ground in coming days,” he remarked.\nHe said the prices of oil, gas and edible oil were not in the government’s control; however the owing to the record crops this year, Pakistan would emerge from a food deficit to a food surplus country.",
  "retrievedAt": "2025-08-11T21:34:22.927Z"
}
