{
  "title": "Parliamentary Committee on national security to meet on Monday",
  "link": "https://www.app.com.pk/national/parliamentary-committee-on-national-security-to-meet-on-monday/",
  "date_published": "2021-11-07T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):A meeting of the parliamentary committee on national security comprising members of the National Assembly (NA) and Senate will be held on Monday (November 8) at 11 am.\nThe meeting will be chaired by Speaker National Assembly Asad Qaisar to be held at National Assembly Hall. Moved by Minister for Law and Justice Muhammad Farogh Naseem, the National Assembly  passed a motion in its sitting on November 5, to allow the use of chamber of the National Assembly on November 8, for a briefing to the Parliamentary Committee on National Security.\nThe meeting will be briefed by military officials on current national security issues. During the meeting, the top military brass will brief about the overall affairs of national security.\nFederal Ministers Pervez Khattak, Ejaz Ahmad Shah, Ali Amin Gandapur, Shafqat Mahmood, Asad Umar, Shibli Faraz and other ministers will also attend the meeting.   Advisor to Prime Minister Babar Awan and Moeed Yusuf will also attend the meeting.\nThe four provincial chief ministers, the Azad Jammy and Kashmir (AJK) president, AJK prime minister and the chief minister of Gilgit-Baltistan have also been invited to attend the meeting.\nEspecially, all members of the National Assembly standing committee on defence will also attend the meeting. President Pakistan Muslim League (PML) (Nawaz) and Opposition Leader in National Assembly Shehbaz Sharif and Deputy Parliamentary Leader,\nPakistan Tehreek-e-Insaf, Shah Mahmood Qureshi were also invited to attend the meeting.   Head Muttahida Majlis-e-Amal, Maulana Asad Mehmood, Chaudhry Tariq Bashir Cheema from PML-Quaid, Akhtar Mengal from  Balochistan National Party, Dr Khalid Maqbool Siddiqui Mutahida Qomi Movement-P and Khalid Hussain Magsi from Balochistan National Party have also been invited to attend the meeting.\nwhile Ghous Bux Khan from Grand Democratic Alliance, Chief Awami National Party, Sheikh Rashid Ahmed and Amir Haider Azam Khan from Awami National Party have also been invited.",
  "retrievedAt": "2025-08-11T21:34:20.343Z"
}
