{
  "title": "Govt undertaking massive development programme to make Pakistan self-reliant: Farrukh Habib",
  "link": "https://www.app.com.pk/national/govt-undertaking-massive-development-programme-to-make-pakistan-self-reliant-farrukh-habib/",
  "date_published": "2021-11-07T16:05:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Nov 07 (APP):State Minister for Information & Broadcasting Farrukh Habib said that despite financial crunch, the government is undertaking a massive development programme to make Pakistan self-reliant particularly in agriculture sector.\nAddressing a function after laying foundation stone of a Civil Dispensary and Water Filtration Plant in Nasir Town, he quoted the global inflation and said that the petrol which was available at US $ 40 per barrel has jumped to US $ 85 per barrel.\nSimilarly, other commodities have also recorded more than 100 percent increase in their prices which has created problems for economies like Pakistan. However, despite of this ground reality, Prime Minister Imran Khan is striving hard to transform Pakistan in true Islamic state on the pattern of Riyasat-e-Madina, he added.\nHe said that Pakistan Tehreek-e-Insaf (PTI) government has already provided health card to every citizen in KPK while in Punjab, health cards would be delivered by March 2022 which would ensure free health facilities to each family up to Rs.1 million per annum. Similarly, the government has introduced Kamyab Jawan programme. Akhuwat has so far disbursed small loans worth Rs.50 billion to 1.5 million individuals so that they could start their own businesses.\nState Minister for Information & Broadcasting Farrukh Habib said that government is also going to launch 200,000 scholarships. Under this programme students could get computer training and earn from Rs.50,000 to Rs.100,000 per month.\nIt will also help young talented students who have unique ideas but are starved of cash, to get long term loans at only 3 to 5 percent markup. Under this programme the government has already disbursed Rs.30 billion.\nHe said that loan of Rs.1 million is available without any guarantee. Similarly, loans were also offered for construction of houses. The government has approved loans worth Rs.80 billion and out of it Rs.19 billion has so far been disbursed. He said that the government has plugged all loopholes to plunder state exchequer and build spatial palaces abroad.\nFarrukh Habib said that mafias are out to foil our productive efforts for uplift of the country. He said that Faisalabad had become a graveyard of power looms but we have revived its dynamism and now textile sector is working with full capacity.The construction sector has also become a most profitable job.\nThe government has performed well despite of ill impacts of coronavirus. We have to face a multidimensional war against looters, plunders, mafias and corrupt elements. We will flush out ill-doings of the last 40 years. He said that the previous rulers had pushed Pakistan at the verge of economic collapse and now they are projecting themselves as champions of democracy.\nThe previous rulers established costly power houses which have become a liability on the nation but we are building Mohmand, Dasu, Diamer Bhasha and other dams which will generate cheapest electricity of 10,000 megawatt, he added.\nAbout coronavirus pandemic, he said that during this phase, government distributed Rs.150 billion cash among the people. Similarly, the government also provided relief to small traders and shopkeepers on their electricity bills for three months. He said that looters are now instigating the masses to come out on roads but they themselves are sitting aboard to enjoy a luxurious life.\nState Minister said that now government has focused on agriculture which will not only weed out rural poverty but also add substantial increase in our domestic production.\nAbout NA-108, he said that government has decided to resolve all civic problems. A network of dispensaries was laid while each union council will have at least one filtration plant. One filtration plant is already working in Nasir Town while we have laid foundation stone for the second one.\nState Minister for Information & Broadcasting Farrukh Habib said that approximately Rs. 40 million has been earmarked for development projects, electricity, road construction, sewer and provision of other amenities in CC-87.\nSimilarly, Rs.50 million is being spent on sewerage and roads in CC-88. Some projects have already been operational while the remaining would be completed during this financial year.\nHe told that 900 feet portion of a road from Malkhanwala to Halal Road is near to its completion while remaining road will be completed with an estimated cost of Rs.30 million during second phase.\nHe said that Chief Minister Punjab Sardar Usman Buzdar has allocated Rs.300 million for minority fund. Under this programme the Christian localities including Dawood Nagar, Barkat Pura, Ibn-e-Maryam Colony, Khushhal Town, Penta Ground, etc. would be transformed into model colonies where all amenities including potable water and modern sewerage system will be available.",
  "retrievedAt": "2025-08-11T21:34:18.609Z"
}
