{
  "title": "World Science Day for Peace and Development marked on Sunday",
  "link": "https://www.app.com.pk/national/world-science-day-for-peace-and-development-marked-on-sunday/",
  "date_published": "2024-11-10T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP):World Science Day for Peace and Development was marked on Sunday in Pakistan, like across the globe, to emphasize the role of science in advancing peaceful and sustainable societies.\nThe day was marked through arranging various events including awareness sessions, seminars and discussion programmes under this year’s theme  “Why Science Matters – Engaging Minds and Empowering Futures”.\nPakistan Museum of Natural History (PMNH), Pakistan Science Foundation, organized an event to mark the World Science Day for Peace and Development on Sunday. The event, arranged in collaboration with Health Services Academy and Islamabad Model College for Girls, Chak Shehzad, displayed a collection of natural history specimens for the awareness of the visitors.\nStudents from various educational institutions also participated in diverse science related activities on the occasion.\nThe day is celebrated annually on November 10, highlights the role of science in society and the need for public engagement in scientific discussions. The theme emphasized the role of science in empowering individuals and societies to make informed decisions for a sustainable and resilient future.\nThis occasion encourages collaborations among scientists, educators, policymakers, and communities to build a science-informed society equipped to tackle pressing issues such as climate change, health crises, and technological transformation.\nWorld Science Day for Peace and Development was proclaimed by UNESCO in 2001 and is celebrated annually on November 10.\nThe day was established to strengthen public awareness of the role science plays in advancing peaceful and sustainable societies.\nIt aims to bridge the gap between science and society, encouraging a greater connection between scientific progress and the everyday lives of people around the world.\nSince its inception, the day has spotlighted key issues related to science and its contributions to solving global challenges, from climate change to sustainable development, and from healthcare advancements to inclusive education. UNESCO and its partners use the day to promote responsible science practices, advocate for funding and support, and encourage educational initiatives that foster interest in STEM (science, technology, engineering, and mathematics).\nBy addressing these topics, World Science Day highlights how science can empower communities, especially young people, by offering them the tools to engage in meaningful conversations and solutions that affect their future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:10:58.617Z"
}
