{
  "title": "Youth entrepreneurship to get Rs300 bln boost under PM’s business loan scheme: Chairman",
  "link": "https://www.app.com.pk/national/youth-entrepreneurship-to-get-rs300-bln-boost-under-pms-business-loan-scheme-chairman/",
  "date_published": "2024-11-10T09:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP):Chairman Prime Minister’s Youth Programme Rana Mashhood Ahmed Khan Sunday announced that Prime Minister’s Youth Business Loan Scheme has achieved remarkable success, disbursing approximately Rs186 billion to young entrepreneurs across Pakistan and now sets its sights on an ambitious target of Rs300 billion.\nIn an exclusive interview with PTV news channel, he explained that the Prime Minister’s Youth Loan Scheme has made significant strides in empowering young entrepreneurs, with approximately 186 billion rupees distributed among 790,000 young entrepreneurs to boost economic development.\nThe Prime Minister’s Youth Business and Agriculture Loan Scheme has made significant strides in empowering female entrepreneurs, with 13% of female beneficiaries in previous years, adding, this year, the target has been set at 33% female participation, aiming to provide more loan opportunities to young women.\nResponding to a query, he said many students lack knowledge on how to apply for loans, to address this issue, facilitation centers are being established where financial experts will guide students through the loan application\nThese centers will also utilize web portals to streamline the process, making it easier for students to apply, he mentioned.\nChairman further unveiled a comprehensive vision for youth-driven socio-economic development in Pakistan, as outlined by Prime Minister Shahbaz Sharif.\nThis vision empowers young girls and boys equally through various initiatives, including Youth Loan Schemes to provide financial support to young entrepreneurs, Laptop distributions to enhance digital access and education, Skill Programs to equip youth with marketable skills, facilitation centers to offer resources and guidance for youth development, and Scholarship Programs to support education and personal growth, he added.\nBy investing in Pakistan’s youth, who make up about 70% of the country’s population, Khan aims to harness their potential for a brighter future and sustainable development.\nThe PML-N has taken groundbreaking initiatives for youth empowerment, he said, adding, these initiatives aim to equip young Pakistanis with essential skills, education and economic opportunities to thrive in the modern world.\nThe Prime Minister’s Youth Program is taking a huge step forward in empowering young Pakistanis with in-demand\nThrough collaborations with NEFCDC and TEVTAS,  we are introducing ‘Demand-Based Skilled’ programs that cater to the needs of countries around the world. This means our youth will be trained in skills that are actually needed, both internationally and locally, he mentioned.\nPM Shahbaz Sharif also instructed to facilitate students through the Laptop Scheme to talented students on merit through an online transparent system, adding, this scheme is envisioned to promote outreach of youth to information and communication technologies, bridging the digital divide within the higher education sector and beyond, he highlighted.\nLast year, one million laptops were distributed in Punjab, and 600,000 in the Federal capital, he said, adding, this year, the distribution numbers are expected to increase with an additional 1 million smartphones being distributed interest-free.\nHe added that the present government has re-announced a collaboration with the Higher Education Commission (HEC) to offer scholarship programs and endowment funds for students.\nThis initiative aims to promote higher education and research in Pakistan, providing opportunities for students to pursue their academic goals without financial constraints, he added.\nIn his concluded remarks said that Pakistan is experiencing a significant turnaround, with the world’s trust in the country being restored and its economy getting back on track.\nThis is a remarkable achievement, and now it is time for the youth to play their part. To truly unlock their potential, young Pakistanis must learn to trust themselves, respect their parents and value the guidance of their teachers, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:11:33.943Z"
}
