{
  "title": "President, PM congratulate Pak cricket team on ODI series win against Aussies",
  "link": "https://www.app.com.pk/national/president-pm-congratulate-pak-cricket-team-on-odi-series-win-against-aussies/",
  "date_published": "2024-11-10T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif on Sunday felicitated Pakistan Cricket Team on winning the one-day international (ODI) series against Aussies eleven at their home ground in Australia.\nThe president lauded the national team for achieving the remarkable triumph in Australia after a gap of 22 years span, President Secretariat Press Wing said in a press release.\nHe further observed that Pakistan team performed well for which the entire team deserved accolades.\nThe president expressed the optimism that the national cricket team would continue its winning streak in future.\nThe prime minister termed it as the happiest occasion for the nation because the national team achieved victory in ODI series in Australia after a gap of 22 years, PM Office Media Wing said in a press release.\nThe bowlers and batters displayed an excellent performance against Australia, he said, adding the members of the team and management worked hard for which they deserved such victory.\nSeparately, on X account, the prime minister posted, “Big Day for Pakistani Cricket! Congratulations to the Pakistan cricket team on their historic ODI series victory against Australia. After 22 years, Pakistan as defeated Australia on their home ground, and that too, in a convincing manne.”\nHe further posted that this victory was the result of unity and teamwork of their brilliant players; as well as efforts of coaching staff and the PCB under the able leadership of Chairman Mohsin Naqvi.\n“May this be the start of a great and glorious period for Pakistani Cricket Team”, he added.\nhttps://x.com/CMShehbaz/status/1855551612057469330\nThe national team overwhelmed the last two games with ball and bat, completely outclassing the strong Aussies team.\nPakistan cricket team defeated Australian team by 2-1 in ODI series and registered a historic and rare win since 2002.",
  "retrievedAt": "2025-08-10T15:11:01.787Z"
}
