{
  "title": "Palestine, Kashmir share struggle for freedom from colonial occupation: AJK President",
  "link": "https://www.app.com.pk/national/palestine-kashmir-share-struggle-for-freedom-from-colonial-occupation-ajk-president/",
  "date_published": "2021-05-28T15:18:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: May 28 (APP): AJK President Sardar Masood Khan, while paying tribute to the people of Azad Kashmir and Pakistan said that their bold and courageous stand on both the Kashmir and Palestine’s cause is a testament to our resolve and determination towards global peace and harmony.\nHe said that the nation as a whole has displayed solidarity with our Palestinian brothers and sisters because of religious and brotherly obligations and the Government of Pakistan made seminal contributions towards bringing around a ceasefire in Palestine.\nThe President made these remarks on Friday while addressing a seminar titled “Palestine and Kashmir Crises: Call for Justice”, organized by The Parliamentary Committee on Kashmir and Muslim Institute. Other speakers at the event included Senator Raja Zafar-ul-Haq, Chairman Parliamentary Kashmir Committee Shehryar Afridi, Ambassador of Palestine to Pakistan H.E. Mr Ahmed Rabaie and Lord Nazir Ahmed, AJK President office said Friday evening.\nThe President said that there are many similarities between the struggle of Kashmir and Palestine, as both demand their right to self-determination, restoration of their rights, and peace. “Kashmir and Palestine are, in a sort, twins that define humanity’s endeavor for peace and justice and also symbolizing the failure of the global community. They are geographically apart but share the same aspirations”, he said.\nMasood Khan said that the Balfour deceleration initiated a process of settler colonialism in Palestine, which non-indigenous Jews now call their home. Like Kashmir, the land grab is rampant in Palestine, he said.\nLast year, in Palestine, Israel declared sovereignty over the land they had grabbed, and unfortunately, the then US President backed these illegal claims. Likewise, millions of Hindus from all over India have been brought into the disputed territory of IOJK and given domiciles.\n“That is the tragedy of our times”, he said.\nThe AJK President said that knocking on the doors of the UN Security Council is futile as they have since the origin of the Kashmir and Palestine dispute ignored the resolution of the issues.\nPresident Masood Khan said that we have to unite as an Ummah and individual countries should forgo their weak postures on both Kashmir and Palestine. “Unless Muslims, as a body, do not stand up and unite, they will be beaten again and again. They will have to go to those chambers where their voices have not and will not be heard”, he said.\nThe President said Palestine enjoys support from the international community and the global citizenry is more aware and supportive of the Palestinian cause. On the other hand, the people of Kashmir don’t enjoy this luxury, he said. “Despite this, the Palestine issue like the Kashmir remains unresolved. Their land is being grabbed on a daily basis and they are being made homeless”, added Masood Khan.\nMasood Khan urged that our efforts for peace should not be episodic or spasmodic and we must not forget the countless sacrifices made for the just causes of Kashmir and Palestine. Our efforts for liberating Kashmir or attaining the Palestinian statehood should not be driven by hate but rather on pursuance of a world-order based and anchored in values of justice, dignity and love for humanity.",
  "retrievedAt": "2025-08-11T20:46:38.927Z"
}
