{
  "title": "Pakistan, Russia agree to build Pakistan Stream Gas Pipeline",
  "link": "https://www.app.com.pk/national/pakistan-russia-agree-to-build-pakistan-stream-gas-pipeline/",
  "date_published": "2021-05-28T16:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP): Pakistan and Russia Friday signed an inter-government agreement to develop Pakistan Stream Gas Pipeline for gas transportation from Karachi to Kasur.\nIn this regard, both the countries signed a protocol on the amendments to the Agreement on North-South Gas Pipeline Project in Moscow, according to the Pakistan Embassy in Russia.\nThe protocol was signed by Pakistan’s Ambassador in Moscow Shafqat Ali Khan and the Russian Minister for Energy Nikolay Shulginov.\nThe agreement signed after successful negotiations between Pakistan’s Ministry of Energy and Russian Ministry of Energy.\nAs per the protocol, the project has been renamed as “Pakistan Stream Gas Pipeline”.\nThe pipeline will run from Karachi to Kasur for transportation of gas.\n1/4 Pakistan and Russia signed the Protocol on the amendments to the Agreement on North-South Gas Pipeline Project in Moscow today. #PakistanStreamGasPipeline #northsouthgaspipeline #pakistanrussia @ForeignOfficePk @MID_RF @mfa_russia @RusEmbPakistan pic.twitter.com/M35aiRIvpj\n— Pakistan Embassy Russia (@PakinRussia) May 28, 2021\nPakistan Stream Gas Pipeline (SPV) would be set up within 60 days of the agreement signing.\nPakistan Russia Inter Governmental Agreement (IGA) on North South Gas pipeline was signed between both countries in 2015 but was not implemented.\nThe Project has been delayed since 2015 years with no headway.\nThe pipeline project is a flagship strategic venture between Pakistan and Russia that would strengthen bilateral cooperation.\nPakistan desires a strategic partnership with Russia and looks forward to enhanced bilateral relations in all fields of mutual interest.\nНиколай Шульгинов и Посол Пакистана в Российской Федерации Шафкат Али-Хан подписали Протокол о внесении изменений в межправительственное соглашение от 16 октября 2015 г. по строительству газопровода в Пакистанеhttps://t.co/lpGtVB04cU pic.twitter.com/fD38dvUM0r\n— Министерство энергетики РФ (@MinenergoGov) May 28, 2021\nA gas pipeline with a length of over 1.1 thousand km and connect terminals for receiving liquefied gas (LNG) in the ports of Karachi and Gwadar with power plants and industrial consumers of gas in the Kasur district (Punjab) in the north of the country, the Russian Ministry of Energy said in a translated statement.\nIt said the relevant departments of the two countries had done a lot of work on the preparation of this Protocol, its signing will allow our companies to begin practical implementation of the project in the very near future, thereby helping the Pakistani side to strengthen its own energy security and increase the use of natural gas as an environment friendly source of energy.",
  "retrievedAt": "2025-08-11T20:46:36.750Z"
}
