{
  "title": "Pakistan urges OIC to step up efforts to facilitate Kashmir’s lasting solution",
  "link": "https://www.app.com.pk/national/pakistan-urges-oic-to-step-up-efforts-to-facilitate-kashmirs-lasting-solution/",
  "date_published": "2020-06-22T03:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP):Foreign Minister Shah Mahmood Qureshi on Monday said the oppressed people of Indian Occupied Jammu and Kashmir (IOJ&K) would never accept the ‘sinister Hindutva agenda’ and called upon the Organization of Islamic Cooperation (OIC) to step up efforts for facilitating a lasting solution to the Kashmir dispute.\n“Kashmiri people would never accept the sinister Hindutva agenda of dispossessing them of their land, marginalizing them politically and economically, and depriving them of their distinct identity,” the Foreign Minister said in his address at the Emergency Virtual Meeting of the OIC Contact Group on Jammu and Kashmir, convened on Pakistan’s call.\nSaudi Foreign Minister Faisal bin Farhan Al-Saud, Turkish FM Mevlut Cavusoglu, Azerbaijan’s FM Elmar Mammadyarov, FM of Niger KallaAnkourao, OIC Secretary General Dr. Yousef Al-Othaimeen and President Azad Jammu and Kashmir Sardar Masood Khan attended the video meeting.\nQureshi said the oppressed people of IOJ&K, now more than ever, were counting upon OIC and the Muslim Ummah.\n“The OIC must urge India to rescind its unilateral and illegal actions since 5 August 2019; implement the relevant UNSC resolutions to hold a UN-supervised plebiscite in IOJ&K, halt its blatant human rights violations and provide unhindered access to OIC, IPHRC, UN, human rights organizations and international media to investigate and report on the situation in the occupied territory,” he said.\nForeign Minister Qureshi drew the attention of the forum towards “aggravated situation in Indian Occupied Jammu and Kashmir (IOJ&K)” with deteriorating human rights conditions in the Valley since the last year’s meeting of the Contact Group held in New York.\nHe mentioned that the Indian leadership remained bent upon perpetuating India’s illegal occupation of Jammu & Kashmir, adding that the “Hindutva” agenda of the RSS-BJP combined was deliberately targeting defenceless Kashmiris with unspeakable violence to break their will.\n“Brute force is being used to crush the Kashmiris’ quest for their fundamental rights — especially the right to self-determination enshrined in the relevant UN Security Council and OIC Resolutions,” he said.\nHe highlighted the suffering of Kashmiri people in shape of continuous lockdown, military siege, communications blockade, and unprecedented restriction, which were imposed following India’s illegal and unilateral actions of August 5, 2019.\nHe pointed out that to prevent the world from knowing the Kashmir reality, the occupation forces were suppressing, intimidating and incarcerating Kashmiri male and female journalists.\nQureshi mentioned that Pakistan had been consistently sensitizing OIC and international community about the real Indian intention behind its actions, aimed at changing the demographic structure of IOJ&K and further disempower and disenfranchise Kashmiris.\n“The latest steps in this direction are the Jammu and Kashmir Reorganization (Adaptation of State Law) Order 2020 and the Jammu and Kashmir Grant of Domicile Certificate (Procedure) Rules 2020. Pakistan has repeatedly underlined that the measures to alter IOJ&K’s demographic structure are illegal and in violation of the UNSC Resolutions and international law, in particular the 4th Geneva Convention and UNSC resolution 122,” he said.\nQureshi said it was “highly reprehensible” that while the world community was grappling with COVID-19 pandemic, India remained busy intensifying its brutalization of Kashmiri people denying them access to medical supplies.\nHe said India’s actions represented state-terrorism at its worst and mentioned that in last 20 days, 30 young Kashmiris had been martyred along with severe collective punishment in the form of torching of houses.\n“Not unexpectedly, India is seeking to cover up the reality of the popular and indigenous struggle of the Kashmiri people, by terming it as “terrorism” and also by blaming Pakistan, raising the familiar bogey of cross-Line of Control infiltration,” he said.\nForeign Minister Qureshi said as part of this cover up, India had intensified its violations of the ceasefire along the LoC and Working Boundary.\n“Since January 1st, India has committed 1440 ceasefire violations in breach of the 2003 Ceasefire Understanding. India has deliberately targeted innocent civilians on the Pakistani side of the LoC, killing 13, and injuring 104, including women and children,” he said.\nQureshi warned the meeting of a possibility of a ‘false flag’ operation by India to divert world’s attention from its state-terrorism and unacceptable actions in IOJ&K.\nHe said despite Indian military and political leaders’ belligerent rhetoric and aggressive actions on the ground, Pakistan exercised maximum restraint.\n“Pakistan does not want another conflict. However, it has the will and capacity to respond forcefully and effectively, and defend itself resolutely against any act of aggression,” he said.",
  "retrievedAt": "2025-08-11T19:22:26.509Z"
}
