{
  "title": "PM chairs meeting to review progress on development of merged tribal areas",
  "link": "https://www.app.com.pk/national/pm-chairs-meeting-to-review-progress-on-development-of-merged-tribal-areas/",
  "date_published": "2020-06-22T05:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP):Prime Minister Imran Khan Monday chaired a meeting to review progress on the development of the merged tribal areas, erstwhile known as the federally administered tribal areas (Fata).\nAccording to a press release of the PM Office media wing, the meeting was attended by Minister for Planning Asad Umar, Information Minister Senator Shibli Faraz, Adviser on Finance Dr. Abdul Hafeez Sheikh, Special Assistant to PM Dr. Shahbaz Gill and senior officials.\nChief Minister Khyber Pakhtunkhwa Mehmood Khan, KP Finance Minister Taimur Saleem Jhagra and Punjab Finance Minister Hashim Jawan Bakht attended the meeting through video link.\nLater, in video press briefing as shared by PM office, minister for information and broadcasting Senator Shibli Faraz said that during the meeting, the prime minister reviewed pace of progress on the development projects of erstwhile FATA.\nThe prime minister laid emphasis that the people of erstwhile tribal areas and its youth were very dear to him and he desired their immediate development and progress.\nUnder the 2018 arrangements, the federal government had already released its share of funds allocated for the uplift of these areas, he said.\nThe minister further informed that a committee had been set up under the finance minister to look after the other issues and it would in coordination with other provinces also ensure availability of funds for the development of these areas.\nTo recognize the huge sacrifices offered by the people of these areas against terrorism, the prime minister, he said, was taking special interest in the development and progress of these areas.\nSenator Shibili Faraz expressed the hope that the ground work on these projects would commence soon.",
  "retrievedAt": "2025-08-11T19:22:25.505Z"
}
