{
  "title": "Saudi Arabia reaffirms support for Kashmir cause",
  "link": "https://www.app.com.pk/national/saudi-arabia-reaffirms-support-for-kashmir-cause/",
  "date_published": "2020-06-22T03:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP):Saudi Foreign Minister Prince Faisal bin Farhan Al Saud has reaffirmed Saudi Arabia’s traditional support for the Kashmir cause, the Foreign Office said on Monday.\nIn a statement issued here following the telephonic conversation between Saudi Foreign Minister and Foreign Minister Shah Mehmood Qureshi, the Foreign Office mentioned the support extended by Saudi Arabia on the issue of Kashmir.\nPrince Faisal also attended today the Emergency Virtual Meeting of the Organization of Islamic Cooperation (OIC) Contact Group on Jammu and Kashmir, convened on Pakistan’s call.\nForeign Minister Qureshi shared deep concern over the continuing double lockdown as well as the intensification of military crackdown by Indian occupation forces and attempts to change the demographic structure of the occupied territory by introducing new domicile law.\nThe two foreign ministers agreed to remain in close contact to take forward the important bilateral agenda and close cooperation in various fields.\nThe matters of mutual interest including COVID-19 pandemic and enhanced bilateral cooperation were discussed.\nQureshi underscored that fraternal ties between Pakistan and Saudi Arabia were deep-rooted and multi-faceted and the strategic relationship between the two countries was growing in myriad dimensions.\nForeign Minister thanked for condolence messages issued by the King and the Crown Prince of Saudi Arabia over PIA plane crash.\nForeign Minister Qureshi offered condolences on the loss of precious lives in Saudi Arabia due to COVID-19 pandemic and highlighted the measures being taken by Pakistan to contain the virus, with focus on saving lives and securing livelihoods.\nThe Saudi Foreign Minister expressed solidarity with Pakistan in its efforts to combat the outbreak.",
  "retrievedAt": "2025-08-11T19:22:26.519Z"
}
