{
  "title": "AJK President calls for imposition of sanctions against India",
  "link": "https://www.app.com.pk/national/ajk-president-calls-for-imposition-of-sanctions-against-india-2/",
  "date_published": "2020-06-21T22:25:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 22 (APP):President, Azad Jammu and Kashmir (AJK), Sardar Masood Khan on Monday called upon the Organization of Islamic Cooperation (OIC) to immediately impose due sanctions against India for the continual pre-planned genocide of innocent freedom-loving people by the Indian occupational forces in Indian Occupied Jammu and Kashmir (IOJK).\n“Kashmiris’ screams must reach the multilateral chambers that take decisions on human security and the rights enshrined in the international laws and commitments”, he said in a statement on the eve of the emergency virtual meeting of the OIC Contact Group on Jammu and Kashmir held on Monday.\nHe also highlighted massive human rights abuses in IOJK on innocent Kashmiri people.\nHe thanked Secretary General, OIC, Dr. Yousef Al-Othaimeen, and Foreign Ministers of Pakistan, Turkey, Saudi Arabia, Azerbaijan and Niger for participation in this meeting and for support of the Kashmiris.\nHe also expressed his gratitude to OIC Special Envoy for his recent visit to Azad Kashmir and statements of the OIC’s Human Rights Commision.\nHe also acknowledged support of OIC countries over their losses of precious lives during the Covid 19 pandemic.\n“During the pandemic, while the rest of the world was silent, we are beholden to the OIC for condemning India’s fascist steps to introduce new domicile rules that have fast-tracked a process to transform the Muslim-majority occupied Jammu and Kashmir into a Hindu state by settling non-native Hindus from all over India. This is a replication of the Israeli settlements in the West Bank. This is a revival of the Nazi Party’s 1935 Nuremberg laws”, he remarked.\n“European Parliamentarians too have been active. Fifteen MEPs have written to the President of the European Commission and European Union’s High Representative advising them to address the “worst human rights violations’ and ‘intolerable suppression of freedom and fundamental rights’ in the Indian Occupied Jammu and Kashmir in the past 73 years”, he said.\nHe mentioned that United Nations Secretary General has recently asked Indian authorities to stop detaining and killing children in the IOJK.\nUnder the cover of Covid 19, every day dozens of young men were being killed by occupation forces in staged encounters. Floodgates for new Hindu settlers from India have been opened, while Kashmiris are running from pillar to post to prove that their homeland is theirs.\nHe said they were witnessing the biggest land grab of our times, adding, Kashmiris were being deprived of their human habitat.\nSome thirteen thousand boys and children are being tortured in concentration camps, the president AJK said.\n“Demonstrators are being blinded and maimed. Women are being raped and molested. The occupied territory has been torn asunder into two parts, without the consent of its people, and is now being ruled directly as a colony by Delhi. We see the rise of imperialism in this century”, he said.\nIn Azad Kashmir, across the Line of Control (LOC), some 80,000 civilian households are directly targeted by Indian forces frequently, resulting in killings, serious injuries, disabilities and destruction of critical infrastructure, he said.\nMasood Khan said besides, India has also created war psychosis by threatening to attack Azad Kashmir and Gilgit-Baltistan militarily. Their prime minister (Narendra Modi) has twice threatened to wipe out Pakistan by the use of nuclear weapons.\nHe said India hurled false accusations of terrorism against Pakistan to hide genocide, war crimes, ethnic cleansing and crimes against humanity perpetrated by it in IOJK.\n“As President of Azad Jammu and Kashmir, I say, with full authority, that there are no `launch pads’ in our territory and that we are not sending fighters across the LOC.”\nThe BJP-RSS religious supremacist doctrine is anti-Muslim, anti-Arab and anti-Kashmir, he said.\nDespite their brutalisation by India, Kashmiris remained undeterred and have vowed that they would continue their peaceful struggle for freedom, liberty and self-determination in accordance with the UN Security Council resolutions, the AJK president said.\nHe urged OIC leaders to send a message to the UN Secretary General to appoint a Special Envoy on Kashmir without further delay and to hold result-oriented meetings on Kashmir to implement its own relevant resolutions.\nHe also reminded the High Commissioner for Human Rights to revive the proposal for the establishment of a Commission of Inquiry for investigating the human rights situation in the Occupied Jammu and Kashmir.\nHe also stressed OIC leaders to paly their part for ensuring Kashmiris’ right to self-determination recognised by international law and the international community and to ask India to restore the disputed status of the Occupied\nState of Jammu and Kashmir;\nMasood Khan urged OIC to force India for forthwith stopping its illegal settlements in Kashmir and restore Kashmiris’ rights to life, residence, property, livelihood and education, protected under international law;\nThe AJK president also asked to initiate a boycott, divestment and sanctions movement against India and, to start with, impose a ban on import of non-Halal meat and all non-Halal products from India into OIC countries.\nHe also urged for establishment of a Kahsmir Humanitarian Fund (KHF) with the help of the Islamic Development Bank (IDF) and Islamic Solidarity Fund (ISF).",
  "retrievedAt": "2025-08-11T19:22:36.354Z"
}
