{
  "title": "How to build on a win - Newspaper - DAWN.COM",
  "author": null,
  "content": "CONFIRMATION by India’s Chief of Defence Staff Gen Anil Chauhan of the downing of an unspecified number of Indian Air Force (IAF) warplanes and also of their grounding — he said, they learned from and corrected their ‘tactical mistake’ before taking to the air again — will reinforce the mood of jubilation in Pakistan.\n\nGen Chauhan was speaking to Bloomberg at a Singapore security conference where he was asked if one or more IAF jets had been downed. His confirmation came couched in interesting language as he insisted what was important was not that “they” [plural for fallen aircraft] were downed but that lessons were learned and the planes were back in the air in two days.\n\nAgainst the backdrop of considerable relief and raised morale in Pakistan on account of its defence forces acquitting themselves well against an adversary six to seven times bigger, with an equally greater defence outlay, it is incumbent on Pakistan to do some serious soul-searching regarding the consolidation of its gains.\n\nAt the same forum in Singapore where Gen Chauhan spoke to Bloomberg, Pakistan’s Chairman of Joint Chiefs of Staff Committee Gen Sahir Shamshad told Reuters that forces on both sides have pulled back, or are in the process of doing so, to pre-April 22 positions.\n\nIt is of paramount importance to ensure that there are no chinks in the armour that the adversary can exploit.\n\nBut he also acknowledged that with India’s new doctrine announced by Prime Minister Narendra Modi, the hostilities-trigger threshold had been lowered considerably. India’s unilateral decision to hold in abeyance the Indus Waters Treaty was also a threshold-lowering factor, he said, adding that 240 million lower-riparian people in an agrarian society could not sit back and see their water tap turned off.\n\nThen there are the belligerent statements of Mr Modi that some Indian commentators are attributing to the state elections due in Bihar in four to five months. These statements are not without consequences as these create an expectation in over a third of the Indian electorate that voted for BJP in the last elections that something must/ will be done to ‘punish’ Pakistan.\n\nPerhaps one factor weighing on India and staying its hand somewhat is its foreign policy failure as not one country, unlike in the past, was willing to endorse New Delhi’s stance and blame Pakistan for the April 22 terrorist attack, which targeted and killed around two dozen unarmed civilians in Pahalgam in held Kashmir.\n\nAfter the failure of Foreign Minister S. Jaishanker to win over nations to India’s view, the BJP government roped in the articulate Shashi Tharoor, who has served as UN assistant secretary general in the past and is currently with the Indian National Congress.\n\nTragically for India, the usually well-spoken politician sounded no better than a social media troll when he complained about the lack of support from Colombia which, he said, condemned the killings in Pakistan as a result of the Indian military strikes, but did not echo India’s views on terrorism and Pakistan.\n\nAll this is not being written to deride a neighbour 10 times Pakistan’s size, with healthy economic growth, but to underline how the recent conflict has left them feeling humiliated. There is great confusion in India. On the one hand, they may be trying to jump-start their new victory narrative through a network of mushrooming ‘defence and military affairs’ websites that are lauding their achievements in the war and declaring victory and, on the other, the rather candid admission by their chief of defence staff.\n\nWith this frame of mind, I wouldn’t put it past India’s Hindu nationalist political leadership to try something again. Whether Pahalgam was a false flag I don’t know but something like it may happen again before long, possibly before the Bihar elections due in October/ November.\n\nThe situation warrants a state of readiness 24x7. An important point to consider here is which of the two can sustain a longer-term state of alert better, as it is costly to maintain military preparedness just below the outright war threshold.\n\nWith the forthcoming budget, it is likely to become clear what this state of readiness will cost this country, including in terms of the acquisition of military assets, in the light of the vulnerabilities identified in the four-day conflagration. A nation, a majority of whose people is crushed under financial pressures, may well be asked to make more sacrifices.\n\nSo it is of paramount importance to ensure that there are no chinks in the armour that the adversary can exploit. Internal harmony needs to be prioritised. A rapprochement, a grand reconciliation at home, is the need of the hour. All those in power, those who aspire to power and those who believe they were cheated out of power, must be willing to make concessions, and leave their cemented positions — whether rooted in principle or ego or a mix of both.\n\nWe have heard innumerable times how India and its security services are behind the terrorism in Balochistan. The hammer and nail approach has been tried and has had limited success. Ergo, reconciliation should extend to not just mainstream political parties/ leaders but also to smaller ethnic groups whose reconcilable elements should be brought back into the national mainstream.\n\nFor this to happen, the establishment poster boys in Balochistan, who’d struggle to win a local bodies election and have no stake in reconciliation because they fear being the main losers in any such exercise, may have to be forced to work with more representative elements, or asked to leave the stage altogether.\n\nI truly believe that Mr Modi’s belligerence, rooted in a gross miscalculation which he seems hell-bent on repeating, may be a godsend for Pakistan to close ranks and secure internal cohesion. If anyone can capitalise on this gift from the heavens, they will deserve every accolade. This will be the impregnable defence that will enable us to focus on the economy and the alleviation of poverty that plagues so many millions across the country.\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail.com\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683bb5ef35635.jpg",
  "retrievedAt": "2025-08-18T03:02:04.339Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914646",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T02:09:06.000Z"
}
