{
  "title": "Arshad Nadeem thanks nation for javelin victory ahead of arrival in Lahore - Sport - DAWN.COM",
  "author": null,
  "content": "Less than 24 hours after striking gold in the javelin final at the Asian Athletics Championship, javelin phenom Arshad Nadeem on Sunday thanked the nation for its support and prayers, dedicating the win to Pakistan.\n\nYesterday, Arshad returned to international competition and won a gold medal with a throw of 86.40 metres in the men’s javelin final in Gumi, South Korea. India’s Sachin Yadav took silver with an 85.16m and Japan’s Yuta Sakiyama took home bronze with an 83.75m throw. Both athletes threw a personal best.\n\nIn a post on Instagram today, Nadeem said: “It is because of all your prayers that Allah made me successful in the finals, and gave respect to Pakistan, when I won gold at the Asian Athletics Championship.\n\n“This is a result of your prayers, and the hard work of me and my coach, Salman Iqbal Butt,” he said in a short video message as he adorned a green and white Pakistan jersey.\n\nHe noted that he would be arriving at Lahore International Airport at 10:20pm tonight.\n\n“It gives me great happiness that this was my first competition since the Paris Olympics, and Allah delivered victory to Pakistan,” the 28-year-old said.\n\nNadeem, who holds the Olympic record after throwing a monstrous 92.97m at Paris 2024, narrowly missed breaking the championship record of 86.72m.\n\nThe triumph also marks the first time Pakistan has won gold at the Asian Athletics Championship in 50 years.\n\nNadeem will soon be going to England to prepare for September’s World Athletics Championships, the only major tournament where he has yet to win gold.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/01144724b4cf08e.jpg",
  "retrievedAt": "2025-08-18T03:01:44.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914747/arshad-nadeem-thanks-nation-for-javelin-victory-ahead-of-arrival-in-lahore",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T09:53:31.000Z"
}
