{
  "title": "India’s monsoon rains kill at least 30 in northeast parts of country - World - DAWN.COM",
  "author": null,
  "content": "Flash floods and landslides after torrential monsoon rain over the last two days killed at least 30 people in India’s northeast, officials said on Sunday.\n\nState disaster management officials said eight people died in Assam, and nine in Arunachal Pradesh, many of them in landslides as earth loosened by the water slumped into the valley below.\n\nAnother five people died in a landslide in the neighbouring state of Mizoram, state authorities said.\n\nThe officials said that six people lost their lives in Meghalaya, while at least two others were killed in the states of Nagaland and Tripura.\n\nA red alert warning was issued for several districts in the region after the non-stop downpour over the last three days.\n\nRivers swollen by the lashing rain — including the mighty Brahmaputra, which rises in the Himalayas and flows through India’s northeast towards its delta in Bangladesh — broke their banks across the region.\n\nThe Indian army said that it had saved hundreds “in a massive rescue operation” across Manipur state.\n\n“People have been shifted to safer places,” the army said on Saturday. “Food, water and essential medicines were provided.”\n\nConrad K Sangma, the chief minister of Meghalaya state, has ordered officials to remain on high alert “especially in landslide-prone and low-lying areas”, according to a statement.\n\nScores of people die each year during the rainy season due to flash floods and landslides across India.\n\nIndia’s annual monsoon season from June to September offers respite from the intense summer heat and is crucial for replenishing water supplies, but also brings widespread death and destruction.\n\nSouth Asia is getting hotter and in recent years has seen shifting weather patterns, but scientists are unclear on how exactly a warming planet is affecting monsoons.\n\nLast month, India’s financial capital Mumbai was swamped by monsoon rain that began two weeks earlier than usual, the earliest for nearly a quarter of a century, according to weather forecasters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/011515539f45911.jpg",
  "retrievedAt": "2025-08-18T03:01:38.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914751/indias-monsoon-rains-kill-at-least-30-in-northeast-parts-of-country",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T10:23:35.000Z"
}
