{
  "title": "Non-bailable warrants out for arrest of Malik Riaz, others - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: An accountability court on Saturday issued non-bailable warrants for arrest of controversial property tycoon Malik Riaz, his son and others in the Bahria Town Karachi (BTK) land grab case.\n\nThe National Accountability Bureau (NAB) had filed a reference a few months ago against the owners of Bahria Town, senior PPP leaders and government officials for allegedly converting, exchanging, and transferring government land to Bahria Town for its BTK project.\n\nJudge Syed Nadeem Hussain Shah of the Accountability Court-III issued the non-bailable warrants against Malik Riaz, his son, Ahmed Ali Riaz, son-in-law, Zain Malik, former Board of Revenue official, Ahmed Baksh Narejo, former land utilisation secretary and others.\n\nThe court directed investigating officer Waqar Anwar to arrest and produce them in court on July 17.\n\nThe warrants were issued since Mr Riaz and others did not appear in court despite repeated summons and notices. NAB officials had informed the court that Mr Riaz’s employees had refused to receive the notices, upon which the court had ordered publication of the notices in newspapers.\n\nNAB claimed in the reference that the executives, BoR and MDA had conspired to cede valuable public property to an individual for some gains and in active connivance grabbed for BTK 17,671.87 acres under the garb of adjustment/exchange/consolidation in 2013-14 in sheer violation of law, causing a colossal loss of over Rs708.08 billion to the national exchequer.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/17160642f398e3e.jpg?r=160646",
  "retrievedAt": "2025-08-18T03:02:55.445Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914560/non-bailable-warrants-out-for-arrest-of-malik-riaz-others",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T01:50:39.000Z"
}
