{
  "title": "Hundreds arrested as celebrations turn wild in Paris after PSG’s Champions League win - World - DAWN.COM",
  "author": null,
  "content": "Thousands of Paris Saint-Germain supporters took to the streets of the French capital on Saturday to celebrate their club’s victory in the Champions League final, but clashes with the police led to the arrest of over 500 people, while two people lost their lives amid the celebrations in separate instances.\n\nAs per the French interior ministry, a woman riding a scooter died after she was hit by a car in the southwest of Paris, while a 17-year-old in the southwestern town of Dax was stabbed to death during the celebrations. In total, 559 people were arrested, including 491 in Paris.\n\nThe majority of fans celebrated peacefully, but Paris police said scuffles broke out near the city’s Champs-Élysées avenue and PSG’s Parc des Princes stadium, where 48,000 had watched the 5-0 win against Inter Milan in Munich on big screens.\n\nMost of the people detained were suspected of possessing fireworks and causing disorder, Paris police said.\n\nAFP journalists saw police use a water cannon to stop a crowd reaching the Arc de Triomphe.\n\n“Troublemakers on the Champs-Élysées were looking to create incidents and repeatedly came into contact with police by throwing large fireworks and other objects,” police said in a statement.\n\nIn a video posted by a user on X, police can be seen dispersing the fans.\n\nVideos circulating on social media, posted by a French press agency CLPRESS, show burning vehicles as the celebrations turned into riots.\n\nOutside Paris, police said a car careered into fans celebrating PSG’s win in Grenoble in southeastern France, leaving four people injured, two of them seriously.\n\nAll of those hurt were from the same family, police said.\n\nThe driver handed himself in to the police and was placed under arrest.\n\nA source close to the investigation said it was believed the driver had not acted intentionally.\n\nIn Paris, most fans showed their joy by singing and dancing in the streets, with cars sounding their horns, after their team won the biggest prize in European club football for the first time in their history.\n\nOne 20-year-old PSG supporter, Clement, said: “It’s so good and so deserved! We have a song that talks about our struggles and it hasn’t always been easy.\n\n“But we got our faith back this year with a team without stars. They’re 11 guys who play for each other.”\n\nFrench President Emmanuel Macron’s office said he would host the victorious players on Sunday to congratulate them.\n\nIn a separate message on X, Macron hailed a “day of glory for PSG”.\n\n“Bravo, we are all proud,” he wrote. “Paris is the capital of Europe tonight.”\n\nParis mayor Anne Hidalgo hailed it as a “historic” win.\n\nThe PSG team will hold a victory parade on the Champs-Élysées today, when tens of thousands of supporters are expected to gather to get a glimpse of their returning heroes.\n\nTeenager Desire Doue scored twice to inspire Paris St Germain to their first European Cup triumph with a crushing victory over Inter Milan.\n\nPSG’s young team achieved what the likes of Lionel Messi, Neymar and Kylian Mbappe could not do in their colours as they became only the second French side to win the trophy after Olympique de Marseille in 1993.\n\n“Making history was a goal from the start of last season,” the club’s manager, Luis Enrique, said.\n\n“I really felt a connection with the players and the fans, a very strong connection that we saw throughout the season. We were able to handle the tension and excitement in the best possible way.”\n\nLuis Enrique, visibly emotional after the final whistle and wearing a T-shirt with a tribute to his daughter Xana who died in 2019, has turned PSG from a side of superstars into a group of humble players finally playing as a team.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/01122602b930e61.jpg",
  "retrievedAt": "2025-08-18T03:01:51.514Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914725/hundreds-arrested-as-celebrations-turn-wild-in-paris-after-psgs-champions-league-win",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T08:08:46.000Z"
}
