{
  "title": "May sees modest rise in attacks, but militants fail to escalate amid regional crisis: report - Pakistan - DAWN.COM",
  "author": null,
  "content": "Despite heightened military tensions between Pakistan and India in May, militant groups were unable to significantly escalate their activities in Pakistan, according to data released by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (PICSS) on Sunday.\n\nThe PICSS monthly security assessment recorded 85 militant attacks in May —up slightly from 81 in April — resulting in 113 fatalities. These included 52 security forces personnel, 46 civilians, 11 militants, and four peace committee members.\n\nA total of 182 people were injured, comprising 130 civilians, 47 security personnel, four militants, and one peace committee member.\n\nThis marks a five per cent increase in militant attacks compared to April. Notably, there was a 73pc rise in security personnel deaths, and a dramatic 145pc increase in civilian injuries (from 53 in April to 130 in May).\n\nHowever, injuries among security personnel decreased by 20pc, falling from 59 to 47.\n\nIn operations initiated by security forces during the month, at least 59 militants were killed, while five security personnel lost their lives. Additionally, seven security personnel and five militants sustained injuries. Security forces also arrested 52 suspected militants during various intelligence-based operations.\n\nCombining militant attacks and security operations, the overall casualty toll for May stood at 172 deaths — including 57 security personnel, 65 militants, 46 civilians, and four peace committee members.\n\nA total of 194 people were injured, comprising 130 civilians, 54 security personnel, nine militants, and one peace committee member. Militants also abducted at least 19 individuals during the month.\n\nA striking aspect of the May security landscape was a 78pc rise in the deaths of security personnel, contrasted with a 68pc decline in militant deaths compared to April.\n\nNotably, May was the first month since October 2024 in which militant fatalities were recorded in double digits (65), a sharp drop from 203 in April.\n\nBalochistan and Khyber Pakhtunkhwa remained the most affected provinces, accounting for 82 of the 85 attacks nationwide.\n\nBalochistan experienced the highest level of violence, with 35 militant attacks that left 51 people dead — including 30 civilians, 18 security personnel, and three militants — and 100 injured (94 civilians, five security personnel, one militant). Militants also abducted nine individuals in the province.\n\nA particularly tragic incident occurred in Khuzdar, where a blast targeted an Army Public School bus, killing eight children (mostly girls) and two staff members, and injuring 35 others.\n\nIn the merged tribal districts of Khyber Pakhtunkhwa, 22 militant attacks led to 45 deaths, including 23 security personnel, 12 civilians, six militants, and four peace committee members.\n\nAdditionally, 58 people were injured, comprising 30 security personnel, 27 civilians, and one peace committee member.\n\nIn mainland KP, excluding the tribal districts, 25 militant attacks resulted in 14 deaths, including 10 security personnel and two each from civilians and militants. Additionally, 24 people were injured, including 12 security personnel, nine civilians, and three militants.\n\nSindh witnessed three militant attacks, resulting in the deaths of two civilians and one security personnel.\n\nNo militant attacks were reported from Punjab, Azad Jammu & Kashmir (AJK), or Gilgit-Baltistan.\n\nHowever, Punjab recorded the highest number of militant arrests, with 39 suspects detained in intelligence-based operations. In Azad Kashmir, security forces conducted a raid in Rawalakot, killing four militants reportedly affiliated with Tehreek-i-Taliban Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/02004647bba75cc.png?r=004657",
  "retrievedAt": "2025-08-18T03:01:17.248Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914767/may-sees-modest-rise-in-attacks-but-militants-fail-to-escalate-amid-regional-crisis-report",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T16:09:25.000Z"
}
