{
  "title": "14 killed, over 1,300 injured in road accidents in May - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: As many as 14 people were killed, and 1,374 injured in 1,226 road accidents reported to Emergency Services Rawalpindi in May.\n\nThe victims included 1,187 men and 201 women, with most of them aged between 11 and 40 years, according to the official statistics.\n\nCitizens said the Rescue 1122 had been working to reduce road accidents, but the traffic police department needs a full-time chief traffic officer to focus solely on traffic management and enforcement of rules.\n\nA spokesman for Emergency Services Rawalpindi revealed in its monthly report that the Rawalpindi district reported 1,226 road traffic accidents to Rescue 1122 in May, with a total of 1,388 people affected. In these accidents, 608 were seriously injured and 766 sustained minor injuries.\n\nThe emergency staff also provided timely rescue services to all victims, said the spokesman. The majority of these road accidents involved car and motorcycle riders. Among the 1,388 victims, 1,187 were men and 201 were women.\n\nThe spokesman said that the causes of these accidents included speeding, careless driving, wrong turns, tire blowouts and other factors. Most of the victims were between the ages of 11 and 40.\n\nHe added that Rescue Service Rawalpindi is also working to reduce the number of road traffic accidents. Compliance with traffic rules is essential to achieve this goal, he said.\n\nWhen more than a dozen people, including motorcyclists, pedestrians, and car riders, were asked about the performance of the traffic police and the rising number of road accidents, they expressed dissatisfaction with traffic management. They demanded that the Punjab chief minister and the IGP look into the affairs of the traffic police.\n\nAs many as 37 people were injured in 137 fire incidents reported to rescue services in May.\n\nRescue firefighters managed to control these fires.\n\nAccording to the official, Rescue 1122 saved approximately Rs127 million in potential damages during these incidents. The causes of fires included short circuits, careless cigarette use, gas leakage and other factors, said the spokesman.\n\nRawalpindi also reported 11 forest fires in May. Rescue firefighters controlled the fires and prevented them from spreading, he said.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/2911065614654cc.jpg?r=110815",
  "retrievedAt": "2025-08-18T03:03:14.288Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914584/14-killed-over-1300-injured-in-road-accidents-in-may",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T01:50:23.000Z"
}
