{
  "title": "PAKISTAN AND INDIA: WHERE TO FROM HERE? - Newspaper - DAWN.COM",
  "author": null,
  "content": "“…In peace there’s nothing so becomes a man\nAs modest stillness and humility:\nBut when the blast of war blows in our ears,\nThen imitate the action of the tiger;\nStiffen the sinews, summon up the blood,\nDisguise fair nature with hard-favour’d rage;\nThen lend the eye a terrible aspect…“ — William Shakespeare, Henry V; Act 3; Sc 1\n\n“[Is] a ‘decisive battle’ the true metric of victory? Does the usual claim hold even about the most famous instances, bearing names so familiar they are fixed in our minds…? How do we know that a victory in battle was “decisive”, in the larger sense of fixing the outcome of a war? — Cathal J. Nolan in The Allure of Battle\n\nThe battles won by England’s Henry V at Harfleur and Agincourt, set apart by just over a month in 1415, were spectacular as battles go but were part of the Hundred Years War, a war the French ultimately won at the Battle of Castillon in 1453. England and France were to go on to fight many more wars, with both sides scoring battlefield victories until they found themselves allied when World War I began. Since then, the two have been on the same side, after centuries of bloodletting.\n\nWhy do I mention this? The “Once more unto the breach” speech by Henry V, which is more about William Shakespeare’s eloquence than Henry V’s, might proffer us an insight into the passions of a battle, but it fails to satiate our urge to find clarity in war.\n\nThe notions of victory and defeat, military historian Cathal J. Nolan informs us, are “emotive terms, subject to passions that distort memory and understanding.” And when battles are fought more for domestic-political reasons than some important strategic goal that “gains a lasting advantage [to secure] one side’s key values and interests, the terms become vacuous and devoid of any real meaning.\n\nAfter the recent slugging, both Pakistan and India are claiming victory. The fact is that wars are not just about bean counting in terms of losses. In the case of conventional blows between a nuclear dyad, unless the two sides walk away from a confrontation or near-confrontation drawing the same lessons, stability will not return. Violence will.\n\nWhat are the lessons to be learnt from the recent military face-off between Pakistan and India? Given India’s escalatory adventurism, its adoption of the Israeli playbook and the continuing war rhetoric coming from Indian PM Narendra Modi, can another conflict be far? And what can Pakistan do in response?\n\nDuring the Cold War, there was much talk of fighting under the nuclear overhang and even discussions on whether a limited nuclear war could be fought and won without forcing the other side to resort to a massive response. The Cuban Missile Crisis played a significant role in establishing deterrence, highlighting the risks of escalation and flagging the importance of communication and confidence-building measures between the US and the USSR.\n\nIn doing so, the crisis contributed to a stable centre at the heart of which then-West and East Germany were situated. While the periphery was destabilised through proxy wars, the centre remained quiet through a stalemate. This is what is today called the instability-stability paradox.\n\nNo such periphery exists between Pakistan and India. The entire theatre is the centre. Escalation inheres in India’s policy. Given India’s stated position, its government has boxed itself in and, even if it didn’t want to, the entry point of every new conflict will be on a higher escalation rung on the ladder.\n\nLet me quote Nolan again because nothing describes India’s wanton aggression against Pakistan better than these lines: “More often, war results in something clouded, neither triumph nor defeat. It is an arena of grey outcomes, partial and ambiguous resolution of disputes and causes that led to the choice of force as an instrument of policy in the first place.”\n\nLet’s now get to the heart of the matter, India’s ‘Operation Sindoor.’\n\nFar from poppycock masquerading as intellectual concepts, the basic fact about statecraft and any viable strategy is to increase one’s options, not reduce them to the point where one is boxed in. That is exactly what Mr Modi’s Hindutva-driven government has done. And this is not just with regard to Pakistan but every neighbour in the region. As it happens, when the actual shooting began, no one stood with India except Israel, which indicates the kind of company India keeps.\n\nINDIA’S GAMBIT\n\nMany analysts in India and the West are trying to provide a conceptual underpinning to India’s strategy. As would become clear subsequently, most of these assessments focus on what India has tried to do while treating Pakistan as a passive actor, against whom coercion is and can be used.\n\nFor instance, we are told that “Operation Sindoor adds a new approach to India’s strategic toolbox” even as it “offer[s] a powerful lesson in restraint.” In this assessment, “Undue prominence was given to the performance of specific platforms”, instead of seriously analysing “India’s targeting methodology, command intent, or escalation thresholds…”\n\nPakistan’s quiet operational success “obscures a more consequential truth: despite Pakistani tactical successes, India appears to have largely achieved its stated objectives”, because the Indian Air Force “demonstrated a credible capacity to identify and destroy what New Delhi characterised as terrorist-linked infrastructure in Pakistani territory.” New information tells us the IAF only targeted two sites; other sites were targeted by Indian artillery.\n\nIn this view, India showed restraint and managed escalation: it signalled to Pakistan that it was not interested in escalating and was only targeting “terrorist infrastructure.”\n\nThis is basically the same line which India’s increasingly flustered foreign minister S. Jaishankar gave in an interview — ‘we told them that we were only targeting terrorist targets and the [Pakistani] military had the option of standing out and not interfering in this process.’ This line of reasoning, as noted above, focuses arbitrarily on India’s strategic objectives and expects, incredulously, that India’s strategic objectives are holier than Pakistan’s.\n\nThe quotes above are from an article by Walter Ladwig for the British Royal United Services Institute. Ladwig is a good scholar, which makes this piece particularly disappointing. But this has generally been the case from writers such as Happymon Jacob to Raja Mohan to Arzan Tarapore to Yogesh Joshi and Harsh Pant, to name a few.\n\nThe motifs that run through their assessments, almost like the Indian government’s talking points, need to be listed: India began with the “surgical strikes” in 2016; they were shallow incursions. In 2019, it used the air force (escalatory step) to strike a single target in Pakistan; this time it crossed more red lines as part of “an assertive strategy of escalation dominance to impose steep costs on future Pakistan-backed terrorism”; it has struck harder, bigger, deeper and has demonstrated military superiority and technological precision.\n\nIn this view, pursuing escalation, India has strengthened its position for future crises, while making no diplomatic concessions. By throwing the Indus Waters Treaty into the mix, India has signalled that it would not talk Kashmir with Pakistan but force Pakistan to talk water with it, a non-kinetic lever to coerce Pakistan to change its behaviour.\n\nThis strategy was also enunciated in Indian Prime Minister Narendra Modi’s “victory” speech: India will respond militarily to any “terror” threat; India will make no distinction between “terrorists” and their sponsors; India does not need to present evidence of a linkage between a “terror” attack and Pakistan and, finally, India will not tolerate any nuclear blackmail.\n\nIt is amazing that these enthused scholars think that these capabilities give India military options short of starting a war because “missiles and drones are quicker to launch and easier to calibrate — as Operation Sindoor showed, successive waves of sorties can be ratcheted up or down, giving national leaders flexibility to escalate or de-escalate as required.”\n\nHere’s the problem: Pakistan seems to have more of these capabilities, so India is not and won’t be operating in a vacuum or applying force to an inanimate object.\n\nBut before I analyse why this line of reasoning is bunkum, let me present evidence of where this is coming from.\n\nROOTS OF INDIA’S ‘NEW NORMAL’\n\nIndia’s thinking that it can coerce Pakistan through the use of force and, over a longer trajectory, that by attacking Pakistan at will and degrading its capabilities, it can change Pakistan’s behaviour, or at least increase the cost for Pakistan, is straight out of Israel’s playbook.\n\nThree concepts stand out in this: “cumulative deterrence” (see Maj Gen Doron Almog and Maj Gen Amos Malka), “triadic deterrence” (political scientists Boaz Atzili and Wendy Pearlman) and “culminating point of deterrence” (political scientist Dmitry Adamsky).\n\nThere is nothing new in the last concept, which Carl von Clausewitz discussed in Book 6 of On War: the supreme genius of the commander is in recognising the culminating point of victory, an outcome with which both sides can live together when the hostilities are over. But let me explain the other two concepts.\n\nFrom the Israeli perspective, the concepts of ‘cumulative’ and ‘triadic’ deterrence eschew the standard notions of deterrence as it evolved in Western IR literature and practice, though they are underpinned by coercion theory. These deterrence concepts have been conceptualised in conventional war-fighting scenarios and involve state-on-state deterrence as well as deterrence against non-state actors, what Israel gratuitously calls “terrorist” groups (Hamas, Hezbollah and now Yemen’s Houthis).\n\nTo quote Almog, “cumulative deterrence is based on the simultaneous use of threats and military force over the course of an extended conflict.” Equally, given the nature of the threat, deterrence in this context is not about wielding the sword to ensure the sword is never used. In classical deterrence, as political scientist Zeev Moaz puts it, “When the sword becomes covered with blood, deterrence is said to have failed, no matter whose blood was spilled.”\n\nWithout going into these conceptual debates supporting or dismissing the concept, for our present purpose it is enough to flag the point made by Almog that cumulative deterrence requires multiple iterations of a conflict, until one side can raise the costs for the other to the point where the other decides to eschew violence.\n\nThe concept of triadic deterrence “is the situation when one state uses threats and/or punishments against another state to coerce it to prevent non-state actors from conducting attacks from its territory.” In the Israeli context, this is Hezbollah- and Lebanon-specific.\n\nIt is precisely for this reason that Atzili and Pearlman argue that “the complex asymmetrical structure of this conflict requires attention to the targeted regime’s relationship to its own society. The stronger the targeted regime, the more likely deterrent action will prove effective.”\n\nAs Raphael Marcus details the meandering conceptual and operational course of Israel against Hezbollah in his 2018 book Israel’s Long War with Hezbollah, cumulative and triadic deterrence are not easy to achieve, though he does not use these terms. Every Israeli innovation and adaptation begot a response from Hezbollah.\n\nIf anything, concepts such as “Systemic Operational Design”, developed by the Israeli Defence Forces (IDF) think tank Operational Theory Research Institute, contributed to much confusion during Israel’s 2006 invasion of Lebanon. Hezbollah learnt and adapted just as Israel did, despite a massive differential between the two sides in terms of international support and material resources.\n\nBut the most striking aspect of Israeli writings on strategy and operational art, just like the case with such Indian writings, is to completely ignore the context in which violence takes place. In the case of Israel, it is the slow-structured violence of a settler-colonial state against Palestinians; in India’s case it is the same vis-a-vis Kashmiris.\n\nIn both cases, while “scholars” write papers and provide intellectual underpinning to state oppression, the real and essential point is deliberately set aside to present Israel and India as victims rather than the perpetrators and perpetuators of violence. In this “scholarly” ecosystem, Israel and India have to adopt strategies of deterrence, including aggression and pre-emptive strikes as self-defence.\n\nThat both countries — incidentally, very close allies — have developed a systemic approach to their occupations is conveniently ignored. As Israeli architect Eyal Weizman argued in his book Hollow Land, “the built environment that sustains Israeli occupation makes clear that the Separation Wall and hilltop settlements are not merely sites of occupation but its weapons.”\n\nIt is the narrative Israel and India have created. Israel’s, mercifully, has already been taken to the cleaners, among others by conscientious Jewish intellectuals. Kashmiris are still awaiting more moral voices from among the Indians. But as state narratives go, none of the Western analysts analysing this conflict has paused to ask the simple question: what “terrorist” infrastructure has India struck?\n\nHow many women and children were killed, since these were civilians places of residence and prayers, not military targets. Why exactly was the Indian state demolishing houses of Kashmiris if the attackers were Pakistanis? Why did the Western media say India had failed to even provide a smoking gun against Pakistan, a fact that should be obvious from India’s own insistence that, from now on, attribution to Pakistan will be automatic regardless of any evidence.\n\nSTRATEGY OR CUL DE SAC?\n\nLet’s now turn our attention to the reality of what India has achieved. In a previous article in this space I have already detailed Clausewitz’s grammar of war and its triple nature, so I won’t recap that. But it’s important to remember that the highest level of war is the politico-strategic object. If India’s objective is/was to deter Pakistan or, an even more difficult proposition, to compel Pakistan to accept its red lines, it has singularly failed.\n\nAs international relations academic Philip Windsor noted in his Strategic Thinking: An Introduction and a Farewell, “…victory, far from being causal in nature and imposed by one side upon another, is after all consequential. It depends upon the other’s willingness to accept defeat.”\n\nBut what if the idea is not to deter Pakistan? What if we should be looking at the political objective more in terms of India’s rightwing Hindutva government’s domestic-political objectives than the sense in which Clausewitz understood and presented the term?\n\nIn 2018, at the Military Literature Festival in Chandigarh, Lt Gen DS Hooda, GOC-in-C Northern Command who oversaw the so-called 2016 Indian “surgical strikes”, criticised the “overhype” and said that “it is not good [when] military operations get politicised.”\n\nIt was the same after the failed 2019 Balakot strike. There was no reference to the action as part of a deterrence or compellence strategy. Despite losing at least one plane and a captured pilot, Mr Modi managed to swing abject failure to his political advantage.\n\nThis time too, he made a “victory” speech and announced a 10-day victory celebration, while banning thousands of Pakistani and even Indian accounts and forcing publications to remove the story about three aircraft crashing in Occupied Kashmir and at least one in Bhatinda. According to The Hindu, the unidentified aircraft that crashed in Bhatinda killed one person on the ground and injured nine others.\n\nOne doesn’t need to take a course in statistics to figure out the probability of four fighter aircraft falling from the skies on the night of May 6/7. I say fighter aircraft because no passenger airliner has reported civilian aircraft crashing on that night.\n\nSo, what exactly did India achieve? In his 2016 book Choices: Inside the Making of India’s Foreign Policy, former National Security Adviser and foreign secretary Shivshankar Menon makes an interesting observation about the internal discussions following the 2008 Mumbai attack.\n\nIn Chapter Three of the book, he candidly concedes that his own initial reaction was that India should use the military option — “But on sober reflection and in hindsight, I now believe that the decision not to retaliate militarily and to concentrate on diplomatic, covert and other means was the right one for that time and place.”\n\nFar from poppycock masquerading as intellectual concepts, the basic fact about statecraft and any viable strategy is to increase one’s options, not reduce them to the point where one is boxed in. That is exactly what Mr Modi’s Hindutva-driven government has done. And this is not just with regard to Pakistan but every neighbour in the region.\n\nIt is amazing that some scholars in India have chosen to actually intellectualise this failure by pronouncing that South Asia is not a region! As it happens, when the actual shooting began, no one stood with India except Israel, which indicates the kind of company India keeps.\n\nFar from deterring Pakistan, Mr Modi has set the stage for a bigger and more high-intensity conflict down the road. He has already said that much himself: this is not a ceasefire; this is a pause. But before I conclude with what choices Pakistan has and how it must offset India’s so-called “new normal”, it is important to say something about the Pakistan Air Force (PAF).\n\nSOFTWARE DOMINATES HARDWARE\n\nSince the May 6/7 encounter, I have closely followed a number of articles and videos on what happened and why. Barring a few, most miss the central point. It’s like people are looking at different parts of the elephant and describing it as the elephant. It’s either about the PL15E missile or it’s about the Rafale vs the J10C fighter jets; or it’s about Chinese tech vs Western.\n\nThe fact is that it’s not one component that won it for the PAF. It is the ‘kill-chain’ the force has created through integration, where every required component fits neatly and optimises performance. And this system is not just created on a whiteboard. It is underpinned by a war-fighting doctrine and hard, consistent training and validation. It is also a system that requires innovation.\n\nMy own sense is that Western analysts have still to understand and digest the fact that PAF is not some average air force fielded by a developing country. It is right up there with the best. The mismatch between Pakistan as it generally performs and the PAF is creating cognitive dissonance.\n\nIt’s what the PAF calls “locked by A, launched by B, guided by C” combat system, integrating ground radars with fighter jets, and airborne warning aircraft. Call it a combat musical ensemble, like an orchestra with a pattern of sounds, silences and accents, all working in supreme harmony to create the complete effect.\n\nLet’s be clear. This is not an effect one creates in a day. It requires integration, software upgrades, constant innovation and validation and hard training of the pilot and his/her catholic marriage with the machine (s)he is flying and how that machine talks to other machines in the air and on the ground, creating a 360 degree situational awareness. To get a sense of what this means, here’s a factoid: the United States is still attempting to create “this kind of kill-chain within and between its services through the Combined Joint All Domain Command and Control concept.”\n\nOne other point regarding PAF’s mission to neutralise the S-400 air defence (AD) system. First, denial is India’s default response. Second, Suppression/Destruction of Enemy Air Defences (SEAD/DEAD) missions do not need to take out every component of a ground AD system. In a SEAD mission you do not need to target every component. Targeting just the radar vehicle would render the system dysfunctional.\n\nWHAT NEXT?\n\nLet me first say that Pakistan does not want war. It sincerely wants India to get off its high horse of hubristic unilateralism and disengagement and address the causes of violence in substantive terms. Unfortunately, that’s not happening. So, this is our si vis pacem, para bellum [if you want peace, prepare for war] moment.\n\nFrom the shallow ground incursion in 2016 to the use of air force in 2019 to the use of air force, missiles, UCAVs and loitering munitions this time, India has escalated both vertically and horizontally. Allied with this is a pronounced change from looking for a band below the nuclear threshold to punish Pakistan, to now wanting an open conventional field with scant regard for the nuclear overhang. This is the implication of Mr Modi’s four points listed above.\n\nWhile Western analysts are trying hard to inform the world that India’s policy is non-escalatory (despite using the air force which is an escalatory force), given Mr Modi’s commitment trap and the trajectory of India’s aggression, any future round will see India enter the conflict at a higher rung on the escalation ladder, as I noted in my previous article in this space.\n\nTwo factors are important: India’s actions show that it is signalling to Pakistan that it is not escalation-averse; two, it wants to put the onus of escalation on Pakistan. So, what should Pakistan do?\n\nI am likely to be alone in this but Pakistan needs to (a) establish its own ‘new normal’ and (b) force the onus of escalation on India. The first requires becoming proactive — ie don’t wait for India to strike. The second needs a targeting strategy that hits hard, deep and repeatedly. The operating principle is to deny India an open conventional field and raise the cost for it of this iterative policy that it thinks it can use to degrade Pakistan’s capabilities.\n\nThis is also important because, statements aside, Pakistan did not operationalise its quid pro quo plus (QPQ+) response this time. If anything, Pakistan’s retaliation was underwhelming and it did not employ a number of weapons systems it could have.\n\nWe are told that “New Delhi has embraced a strategy of military escalation to impose consequences on Pakistan while maintaining dominance over the conflict.” There’s nothing new about escalate to de-escalate. But, in the same breath, we are told that “as a safeguard against prolonged resistance, India’s… approach aims to pressure the international community, particularly the United States, into persuading Pakistan that continued retaliation is futile.”\n\nIt is this very logic that Pakistan needs to reverse. Doing so requires outmatching India qualitatively, somewhat akin to the US’ “second offset strategy” against the Soviet Union, which rested on technological improvements and separating conventional from nuclear deterrence without letting go of the first-use doctrine.\n\nIn essence, Pakistan must not only dominate every rung of the escalation ladder, it should exact enough punishment to see if India really wants to escalate or climb down. It’s risk-prone, sure, but it’s the only way to address the problem of India deciding whenever it so chooses, to attack Pakistan.\n\nProfessor Farhan Siddiqi at Quaid-e-Azam University analyses India-Pakistan conflicts in terms of “resolve paradox”, escalation with an eye on partisan win. This is how the puzzle of escalation squares with de-escalation. My point is rooted in what economics Nobel-laureate Thomas Schelling called a threat that leaves something to chance — make it credible by introducing the element of uncertainty and raise the cost for India. That’s the only way for Pakistan to break this cycle.\n\nThis intent must also be conveyed clearly to the world capitals: Pakistan will not just retaliate, it will preempt, given India’s stated policy of attacking Pakistan whenever Kashmiri fighters attack Indian forces or nationals in Occupied Kashmir. If they don’t want a higher risk in South Asia, they should get India to start acting like a normal state in its dealings with its neighbours.\n\nThis policy does not exclude diplomatic and legal tools. Those tools, in fact, must define the broader sweep of Pakistan’s India policy within the region and outside it. The threat to use force is one option but a key one to signal to India clearly that there’s another ‘new normal’, and it comes from Pakistan.\n\nThe writer is a journalist interested in security and foreign policies. X: @ejazhaider\n\nPublished in Dawn, EOS, June 1st, 2025\n\nHeader image: A screenshot from a video released by the Pakistan military on May 10, 2025 showing missiles being fired at “Indian targets”: Pakistan needs to (a) establish its own ‘new normal’ and (b) force the onus of escalation on India | Screenshot",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683bbbc073b9f.jpg",
  "retrievedAt": "2025-08-18T03:01:50.578Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914673/pakistan-and-india-where-to-from-here",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T02:39:15.000Z"
}
