{
  "title": "Larkana judge escapes unhurt, police guard killed in dacoits’ firing on convoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Larkana sessions judge and in-charge of Anti-Terrorism Court survived attack by a gang of highwaymen who opened fire on his car and his security detail following him in police mobile van on Khairpur-Larkana road late on Friday night.\n\nA police constable, Maqbool Sheikh, died and his colleagues, Iqbal Baloch and Safeer Ahmed Kehar, suffered gunshot wounds in the attack that took place within the jurisdiction of Tando Masti police station in Khairpur district.\n\nPolice officials said the judge, Samkan Ahmed Mughal, and his security squad came under fire from the armed dacoits but the judge remained unharmed in the attack. The judge was on his way to Larkana last night after attending an event at the Sindh High Court’s Sukkur bench, they said.\n\nThey said that the armed highwaymen were standing by the road within the limits of Tando Masti police station when they signaled the judge’s convoy to stop.\n\nIn reply to media persons’ questions if it was a targeted attack on the judge and linked to some cases he was hearing or if it was only an act of highway robbery, the officials said they had just started investigation into the incident and it was premature to say whether it was pre-planned attack or merely a random act of highway robbery.\n\nThey said that police teams had cordoned off all routes leading into riverine area from where the criminals came out to commit the crime on the highway.\n\nMartyred cop’s funeral held in Larkana\n\nThe funeral for the martyr Maqbool Ahmed Sheikh was held with full police honours at the Police Headquarters in Larkana, according to a press release issued by Sukkur DIG’s office.\n\nIt said the martyr had sacrificed his life fighting valiantly against dacoits. The funeral prayer was attended by the martyr’s family and a large number of police officers, Rangers personnel, the judge, DIGs of Sukkur and Larkana, commissioner and deputy commissioner of Larkana, SSPs and officials of other law enforcement agencies, leaders of various schools of thought, civil society members and general public.\n\nIt said that the Sukkur DIG and other officers laid wreaths on the martyr’s coffin.\n\nThe DIG said in his message that no stone would be left unturned in the treatment of the injured police officials. All officers and personnel of Sindh Police stood like a solid wall for the restoration of law and order, he said.\n\n“We are proud of our martyrs, our spirits are high, and we will not shy away from any sacrifice for the establishment of peace. Insha Allah, the gang of dacoits who martyred our official will be found and eliminated soon,” he said.\n\nPeople react angrily to attack\n\nPeople of Khairpur district complained to journalists that the district had been left at the mercy of dacoits and outlaws who came out of the riverine areas and committed crimes at their whim and disappeared with utmost ease while police acted as silent spectators.\n\nThey said that due to constant political interference in the district police, no honest SSP was allowed to work and restore peace in the area.\n\nThey recalled that former SSP, Dr Samiullah Soomro, had cracked down on dacoits and criminals and forced them to flee the district, but he was soon transferred as he was deemed disobedient by some political figures.\n\nAs a result, Khairpur district had once again fallen into the hands of criminals, they lamented and demanded that SSP Dr Samiullah or an honest officer like him be posted in the crime-infested district to restore peace on the roads.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:02:58.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914553/larkana-judge-escapes-unhurt-police-guard-killed-in-dacoits-firing-on-convoy",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T01:50:39.000Z"
}
