{
  "title": "COAS Munir vows to ‘crush Indian-sponsored terrorists’ with support of Baloch tribal elders - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir has vowed to “crush” terrorists in Balochistan, stating that India’s involvement in terrorism in the country’s largest province was “no longer hidden”, state-run Radio Pakistan reported on Sunday.\n\nHis comments came during a grand jirga in Quetta on Saturday, organised to interact with tribal leadership and discuss the evolving security situation in Balochistan, with particular focus on terrorists receiving support from India. The COAS and Prime Minister Shehbaz Sharif delivered speeches and interacted with tribal elders.\n\nIn April, at least six people, including three students, lost their lives and over 40 others — mostly students — sustained injuries after a bomb targeted a school bus in Balochistan’s Khuzdar. Following the attack, the military accused India of activating its “assets” to inte­nsify terrorist attacks in Pakistan, presenting “irr­e­futable evidence” of Ind­ian state-sponsored terrorism, directed by the Ind­ian military personnel.\n\nReaffirming that the enemy’s “nefarious designs will fail”, the field marshal said: “It is an open malicious act of terrorism waged on our people, our progress, and our peace. Pakistan has concrete evidence of India’s involvement with terrorist networks in Balochistan.\n\n“The Pakistan Army, with the unwavering support of the nation and the brave Baloch people, will confront and crush every enemy, foreign or domestic, that dares to challenge our sovereignty.”\n\nStating that Pakistan was ready to respond to any act of aggression, the field marshal said, “Peace in Balochistan is non-negotiable and that the future of Pakistan is directly linked to a stable, prosperous Balochistan.”\n\nEarlier during the event, PM Shehbaz underscored that terrorist groups under the umbrella of Fitna Al Hindustan sought the support of locals, which must be denied to them.\n\n“Indian-sponsored proxies operating in Balochistan have intensified their efforts to undermine peace, destabilise the province, and disrupt development initiatives led by the Government of Pakistan and the Armed Forces,” PM Shehbaz emphasised.\n\nThe prime minister reiterated the need for engagement at the grassroots level and ensuring that terrorists find no social space.\n\nThe tribal elders agreed to stand “shoulder-to-shoulder” with the government and the armed forces, reaffirming their commitment to the security, stability, and development of the province.\n\nThe security situation in Balochistan has worsened in recent months, as militants, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. The outlawed Balochistan Liberation Army, in particular, has adopted new tactics to inflict higher casualties and directly target Pakistani security forces.\n\nIn March, the Jaffar Express train was hijacked near Balochistan’s Sibi area, resulting in the deaths of 26 hostages, including 18 security personnel. Five more security personnel were martyred during the operation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/01221256d49a54a.jpg",
  "retrievedAt": "2025-08-18T03:01:09.707Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914774/coas-munir-vows-to-crush-indian-sponsored-terrorists-with-support-of-baloch-tribal-elders",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T17:36:56.000Z"
}
