{
  "title": "Cotton import bill goes up by 114pc - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid falling local production, the cotton import bill swelled by 114 per cent in the first 10 months of FY25 compared to the last year.\n\nFrom July to April, the cotton import bill soared to $2.545 billion, compared to $1.189bn during the same period last year. According to data released by the State Bank, the significantly low cotton production has become a burden on the economy, particularly affecting exports.\n\nAt the beginning of the current fiscal year, it was estimated that cotton imports would be around $1.9bn, but the frequent decline in lint production has increased the import bill.\n\nThe country witnessed a record trade deficit in April. The rising cotton imports could jeopardise the country’s effort to keep the current account positive by the end of FY25. So far, the current account has a surplus of $1.88bn in 10MFY25.\n\nThe SBP data indicated that cotton imports surged by 58.4pc in the first ten months of FY25 compared to the entire FY24 figure of $1.6bn.\n\nThe official data showed that cotton production has decreased to one-third of its peak of 14 million bales. The cotton experts view this massive decline as a major reason for the decline in exports. Despite some growth, the country has failed to boost its exports significantly.\n\nUS cotton\n\nPakistan faces approximately 29pc reciprocal tariffs on its exports to the US. Formal negotiations are underway with the Trump administration to seek relief by importing US cotton and soybeans.\n\nThe US is the single largest export market. To save its exports, Pakistan has chosen to import American products to reduce around $3bn trade surplus.\n\nA significant number of textile units have already shut down, primarily due to higher electricity tariffs, in fact, the highest in the region. With the shortage of domestic cotton and high costs, textile exports are unlikely to surpass the $16.6bn threshold recorded in FY24. The textile sector accounted for 54pc of the country’s total exports.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/6778825d06a54.gif",
  "retrievedAt": "2025-08-18T03:02:24.632Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914656/cotton-import-bill-goes-up-by-114pc",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T02:16:03.000Z"
}
