{
  "title": "Poland votes in tight presidential race between pro-EU and nationalist visions - World - DAWN.COM",
  "author": null,
  "content": "Poland was voting on Sunday in a tight presidential election that will determine whether the country cements its place in the mainstream of the European Union or turns toward Donald Trump-style nationalism.\n\nBoth Rafal Trzaskowski of ruling centrists Civic Coalition (KO) and his rival Karol Nawrocki, backed by nationalists Law and Justice (PiS), are hoping to mobilise their supporters and clinch the race.\n\nTrzaskowski had a narrow lead in pre-election opinion polls, but the difference was within the margin of error. Voting was due to end at 9 pm (1900 GMT), with exit polls published soon afterwards. The electoral commission says it hopes final results will be announced on Monday morning or early afternoon.\n\nParliament holds most power in Poland, but the president can veto legislation, so the vote is being watched closely in neighbouring Ukraine, as well as in Russia, the US and across the EU.\n\nBoth candidates agree on the need to spend heavily on defence, as US President Trump is demanding from Europe, and to continue supporting Ukraine in its fight against Russia’s three-year-old invasion.\n\nBut while Trzaskowski sees Ukraine’s future membership of NATO as essential for Poland’s security, Nawrocki has recently said he would not ratify it as president as this could draw the alliance into a war with Russia.\n\nTrzaskowski says strong relations with both Brussels and Washington are essential for Poland’s security, but Nawrocki, who met Trump in the White House in May, prioritises relations with the United States.\n\nTurnout stood at 24.8 per cent at noon, the head of the electoral commission, Sylwester Marciniak, told reporters on Sunday. That compared with 24.7pc at the same stage of voting in the second round of the presidential election in 2020, when the final turnout was at 68pc.\n\n“The most important thing is foreign policy,” said IT specialist Robert Kepczynski, 53, who was voting in Warsaw. “We can’t look both ways, to the US and the EU, and looking only to the US for help is short-sighted.”\n\nEconomist Maria Luczynska, 73, said that going to vote made her emotional. “(The election) is important because this is how we decide our future. What country my daughter, my grandchildren will live in.”\n\nIf Nawrocki wins, he is likely to follow a similar path to outgoing President Andrzej Duda, a PiS ally who has used his veto power to block the government’s efforts to undo the previous PiS administration’s judicial reforms, which the EU says undermined the independence of the courts.\n\nComing around a year and a half since Prime Minister Donald Tusk took office, the vote provides the toughest test yet of support for his broad coalition government, with Nawrocki presenting the ballot as a referendum on its actions.\n\nIn 2023, huge queues outside polling stations in large cities forced some to stay open later than planned. Analysts said that high participation by younger, liberal, urban Poles was crucial in securing a majority for Tusk.\n\nTrzaskowski is hoping that such scenes will be repeated on Sunday. “Encourage everyone, so that as many Poles as possible vote in the presidential election,” he told a rally in Wloclawek, central Poland, on Friday.\n\nNawrocki, who draws inspiration from Trump and his Make America Great Again (MAGA) movement, told supporters in Biala Podlaska in the country’s east that “these elections could be decided by single votes”.\n\nThe two candidates also differ on social issues, with Trzaskowski favouring the liberalisation of abortion laws and introduction of civil partnerships for LGBT couples, while Nawrocki says predominantly Catholic Poland should reject such moves.\n\nThe first round of the election on May 18 saw a surge in support for the anti-establishment far-right, suggesting that the KO-PiS duopoly that has dominated Polish politics for a generation may be starting to fracture.\n\nNevertheless, after a tumultuous campaign in which Nawrocki in particular faced a slew of negative media reports about his alleged past conduct, once again candidates representing the two main parties are facing off in the second round.\n\nPiS has traditionally enjoyed high support in small towns and rural areas, especially in the south and east. These areas are typically more socially conservative than larger cities and poorer, creating a sense of exclusion that PiS has tapped into.\n\n“They want to build a Poland for the elites,” Nawrocki told voters in Biala Podlaska, referring to his opponents from KO.\n\nKO, meanwhile, campaigns on a pro-European centrist agenda that appeals to more liberal-minded Poles who mainly live in cities or bigger towns.\n\nTrzaskowski took heart from the turnout at a rally in Ciechanow, central Poland. “Looking at this mobilisation, I see how much hope you have - hope in a future in which Poland plays a leading role in the European Union,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/011819570b8c38c.jpg",
  "retrievedAt": "2025-08-18T03:01:32.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914762/poland-votes-in-tight-presidential-race-between-pro-eu-and-nationalist-visions",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T13:42:25.000Z"
}
