{
  "title": "Israel blocks Arab ministers’ visit to West Bank - World - DAWN.COM",
  "author": null,
  "content": "AMMAN: The foreign ministers of five Arab countries, who had planned to visit the occupied West Bank this weekend, condemned on Saturday Israel’s decision to block their trip.\n\nThe ministers condemned “Israel’s decision to ban the delegation’s visit to Ramallah (on Sunday) to meet with the president of the State of Palestine, Mahmud Abbas”, the Jordanian foreign ministry said.\n\nMinisters from Egypt, Jordan, Qatar, Saudi Arabia and the United Arab Emirates had been expected to take part alongside Turkiye and the secretary-general of the Arab League.\n\nIsrael had announced late Friday that it would not cooperate, effectively blocking the visit as it controls the territory’s borders and airspace.\n\nHamas responds to US truce proposal, to free 10 prisoners, return 18 bodies\n\nAbbas “intended to host in Ramallah a provocative meeting of foreign ministers from Arab countries to discuss the promotion of the establishment of a Palestinian state,” an Israeli official said. “Such a state would undoubtedly become a terrorist state in the heart of the Land of Israel. Israel will not cooperate with such moves aimed at harming it and its security.”\n\nHad the visit gone ahead, the delegation’s head, Prince Faisal bin Farhan, would have become the first Saudi foreign minister to visit the occupied West Bank.\n\nIsrael this week announced the creation of 22 new Jewish settlements in the West Bank, regarded by the United Nations as illegal under international law and one of the main obstacles to a lasting peace between Israelis and Palestinians.\n\nDuring a visit to one of the new settlement sites on Friday, Defence Minister Israel Katz vowed to build a “Jewish Israeli state” in the Palestinian territory.\n\nIn June, Saudi Arabia and France are to co-chair an international conference at UN headquarters meant to resurrect the two-state solution to the Israeli-Palestinian conflict.\n\nSaudi Arabia was said to have been close to recognising Israel before the start of the Gaza war, and US President Donald Trump, during a recent visit to Riyadh, called normalisation between the countries “my fervent hope and wish”.\n\nBut de facto ruler Crown Prince Mohammed bin Salman has repeatedly said Saudi Arabia will not recognise Israel without an independent Palestinian state.\n\nSaudi Arabia is co-hosting with France a conference at the United Nations headquarters in New York aiming to revive the two-state solution to the Israeli-Palestinian conflict.\n\nFrench President Emmanuel Macron previously said he could recognise a Palestinian state at that conference, drawing a sharp rebuke from Israel.\n\nPrisoner deal\n\nMeanwhile, Hamas on Saturday said it had responded to a ceasefire proposal from US envoy Steve Witkoff, saying 10 living prisoners would be freed from Gaza as part of the deal.\n\nThe Palestinian group did not explicitly say it had accepted the version of the proposal it received on Thursday, which reportedly included a provision for the release of 10 living prisoners.\n\nHamas noted that its response had been made out of a “sense of responsibility towards our people and their suffering”.\n\nThe White House previously said the proposal had been approved in advance by Israel, which on Friday warned Hamas to either accept the deal and free the prisoners “or be annihilated”.\n\nHamas said in a statement on Friday that it had “submitted its response to US Special Envoy Steve Witkoff’s latest proposal to the mediating parties”.\n\n“As part of this agreement, 10 living prisoners of the occupation held by the resistance will be released, in addition to the return of 18 bodies, in exchange for an agreed-upon number of Palestinian prisoners,” it added.\n\nA breakthrough in negotiations had been elusive since a previous ceasefire fell apart on March 18 with the resumption of Israeli operations.\n\nUS President Donald Trump had said Friday that the parties were “very close to an agreement”.\n\nTwo sources close to the negotiations have said the deal involves a 60-day truce, potentially extendable to 70 days. It would see the release of five living prisoners and nine bodies in exchange for a number of Palestinian prisoners during the first week, followed by a second exchange the following week, the sources said.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683ba7dbb0e9e.jpg",
  "retrievedAt": "2025-08-18T03:03:36.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914612/israel-blocks-arab-ministers-visit-to-west-bank",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T01:49:27.000Z"
}
