{
  "title": "Punjab govt ‘wakes up to regularise’ over 5,000 illegal housing schemes - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government on Saturday decided to initiate a process to “regularise” more than 5,000 ‘illegal’ housing societies in order to protect the investment of the people.\n\nSince the successive provincial governments hardly paid any attention to the housing societies sector in the past, the National Accountability Bureau (NAB) has been struggling to recover the looted money from a number of housing societies in Punjab that would sell files/plots without acquiring the required land.\n\n“A total number of housing societies in Punjab are 7,905, covering an area of about two million kanals. Of them 2,687 housing schemes are approved, while 5,118 are illegal (or under approval process) across Punjab,” Chief Minister Maryam Nawaz was briefed in a meeting here on Saturday.\n\nIt was also told that some 206 Lahore Development Authority (LDA) schemes were illegal, and were in the approval process.\n\nCM sees collusion between depts and developers in mushroom growth of colonies\n\nThe CM took exception to the matter and questioned how come these housing societies in such a large number were set up without meeting legal requirements. “The government departments must be equally responsible for the establishment of illegal housing societies in the province…I believe.”\n\nSince these societies have been established, these must be regularised, she commented. “The housing schemes that have been built should be regularised as soon as possible according to the law, so that the people (who bought plots/files) could get a relief. These were established with different government departments’ collusion, but only the common men who bought plots there suffered,” she said.\n\nThe CM also asked why did the relevant institutions had turned a blind eye when illegal housing societies were being built. “Money is taken from the poor people but plots are not given.” She directed the authorities concerned to abolish unnecessary NoCs for the registration of housing societies and also ordered formation of a high-level committee for the regularisation of illegal housing schemes. Measures should also be taken to digitise the housing sector, she directed and added the housing society management system should be introduced.\n\n“Housing society approval, management and transfer would be made possible online. The NoC fees also be paid online after uploading the required documents. Development and management should also be made possible through the housing society management system,” Maryam Nawaz said.\n\nThe Maryam administration, however, did not clarify how would those housing societies be regularised which have been set up on the land illegally acquired and plots/files sold in excess of the land in possession.\n\nNo framework has also been elaborated regarding those private housing societies who met all legal requirements by bribing different government departments and are now defrauding the people with impunity. A good number of cases related to the private housing societies in Punjab are pending with NAB. Every such society is accused of defrauding people worth billions of rupees.\n\nA senior official told Dawn that the Maryam dispensation would have to introduce a foolproof mechanism to regularise these illegal housing societies otherwise this step might give rise to ‘corruption opportunities’ for the relevant departments. He said the main culprit in the flourishing of illegal housing societies in Punjab was the government’s ‘lopsided’ regulatory framework.\n\n“Interestingly, the current regime has tied the hands of NAB through legislation under which it can’t take up a housing fraud worth less than Rs500 million,” he said and added, “the scale of fraud in housing sector is to the level that ‘certain influential groups having political backing’ are fleecing public by launching the same housing society with different names and selling plots in all of them. And the authorities concerned are compromised.”\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/201016496aea939.jpg?r=102106",
  "retrievedAt": "2025-08-18T03:02:13.683Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914682/punjab-govt-wakes-up-to-regularise-over-5000-illegal-housing-schemes",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T02:35:07.000Z"
}
