{
  "title": "Trump says will double steel, aluminium tariffs to 50pc - World - DAWN.COM",
  "author": null,
  "content": "WEST MIFFLIN: US President Donald Trump’s announcement that he would double steel and aluminium import tariffs to 50 per cent from next week drew ire from the European Union Saturday in the latest salvo in his trade wars aimed at protecting domestic industries.\n\nThe EU warned it was “prepared” to retaliate against the latest tariffs, adding the sudden move “undermines ongoing efforts to reach a negotiated solution” between the bloc and the United States.\n\n“We’re going to bring it from 25 percent to 50pc, the tariffs on steel into the United States of America,” Trump said Friday while addressing workers at a US Steel plant in Pennsylvania.\n\n“Nobody’s going to get around that,” he added in the speech before blue-collar workers in the battleground state that helped deliver his election victory last year.\n\nShortly after, Trump wrote in a Truth Social post that the elevated rate would also apply to aluminium, with the new tariffs “effective Wednesday, June 4th.” Since returning to the presidency in January, Trump has imposed sweeping tariffs on allies and adversaries alike in moves that have rocked the world trade order and roiled financial markets.\n\nThe tariffs had seen a brief legal setback earlier this week when a court ruled Trump had overstepped his authority, but an appellate court on Thursday said the tariffs could continue while the litigation moves forward.\n\nTrump has also issued sector-specific levies that affect goods such as automobiles.\n\nOn Friday, he defended his trade policies, arguing that tariffs helped protect US industry.\n\nHe added that the steel facility he was speaking in would not exist if he had not also imposed duties on metals imports during his first administration.\n\n‘Devil in the details’\n\nOn Friday, Trump touted a planned partnership between US Steel and Japan’s Nippon Steel, but offered few new details on a deal that earlier faced bipartisan opposition.\n\nHe stressed that despite a recently announced planned partnership between the American steelmaker and Nippon Steel, “US Steel will continue to be controlled by the USA.” He added that there would be no layoffs or outsourcing of jobs by the company.\n\nUpon returning to Washington late Friday, Trump told reporters he had yet to approve the deal.\n\n“I have to approve the final deal with Nippon, and we haven’t seen that final deal yet, but they’ve made a very big commitment,” Trump said.\n\nLast week, Trump said that US Steel would remain in America with its headquarters to stay in Pittsburgh, adding that the arrangement with Nippon would create at least 70,000 jobs and add $14 billion to the US economy.\n\nTrump in Pennsylvania said that as part of its commitment, Nippon would invest $2.2 billion to boost steel production in the Mon Valley Works-Irvin plant where he was speaking.\n\nAnother $7 billion would go towards modernizing steel mills, expanding ore mining and building facilities in places including Indiana and Minnesota.\n\nA proposed $14.9 billion sale of US Steel to Nippon Steel had previously drawn political opposition from both sides of the aisle. Former president Joe Biden blocked the deal on national security grounds shortly before leaving office.\n\nThere remain lingering concerns over the new partnership.\n\nPublished in Dawn, June 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/010852125a193c1.jpg",
  "retrievedAt": "2025-08-18T03:02:18.351Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914658/trump-says-will-double-steel-aluminium-tariffs-to-50pc",
  "dateList": "2025-06-01",
  "date_published": "2025-06-01T02:17:00.000Z"
}
