{
  "title": "Govt intends to tackle no-trust motion against PM democratically: Qureshi",
  "link": "https://www.app.com.pk/national/govt-intends-to-tackle-no-trust-motion-against-pm-democratically-qureshi/",
  "date_published": "2022-04-09T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP): Foreign Minister Shah Mehmood Qureshi Saturday said that the PTI government intended to tackle the resolution of no-confidence against Prime Minister Imran Khan, jointly moved by the Opposition parties, in a constitutional, political and democratic way.\nSpeaking on a Point of Order in the National Assembly, the minister said that the government admitted that the motion against the Prime Minister was in line with the Constitution of Pakistan, which the Opposition had the right to move and the government had the duty to defend it.\nHe put on the record that the PTI government never intended to violate the constitution. “Respecting the Constitution is binding on all of us.”\nThe minister said the government had accepted the verdict of the Supreme Court in a Suo Moto case on the April 3 ruling of Deputy Speaker Qasim Khan Suri.\nQureshi also informed the House about an international conspiracy to change the democratically elected government and a ‘threat letter’ discussed in the National Security Committee meeting.\nHe said the government also wanted to hold an in-camera session of the Parliamentary Committee on National Security for briefing on the letter.\nThe minister said that it was unfortunate that with the support of the foreign powers, the majority of the Pakistan Tehreek-e-Insaf in Lower House of the Parliament was being converted into a minority.\nQureshi expressed the confidence that history would expose the elements that hatched the conspiracy against the democratically elected government.\nHe said that it was the right time for the nation to decide whether they wanted to live with dignity and pride or otherwise.\nThe minister also informed the parliamentarians that the Prime Minister had undertaken the bilateral visit to Russia in consultation with all stakeholders.\nPakistan always believed in true implementation of international laws and United Nations charter, he added.\nHe said Prime Minister Imran Khan time and again said that Pakistan would be partner in the peace not in the conflict.\nThe minister said all Pakistani nationals and students stranded in Ukraine had been brought back under a safe and successful evacuation operation.\nHe also informed the House about the efforts being made by Pakistan on the diplomatic front to solve the Russia-Ukraine crisis through dialogue and diplomacy.\nQureshi also dispelled the impression created by the Opposition parties that the ‘threatening letter’ had been prepared in the Foreign Office and said, “This is an authentic letter, written by a Grade-22 senior and seasoned diplomat posted there.”\nQureshi also shared some contents of the letter with the parliamentarians that contained clear threat that if the no-confidence motion failed, Pakistan would have to face the consequences, and if succeeded “We will pardon Pakistan.”\nHe said it was the fundamental principle of the PTI government’s foreign policy to had cordial ties with all the countries.\nHe said that Election Commission of Pakistan (ECP) was constitutionally bound to conduct free, fair and transparent election within 90 days after the task is given to it.\nHe said fresh elections and mandate would protect the country from any constitutional crisis.\nThe Foreign Minister said that joint Opposition parties had nothing common in their agenda, but to avoid corruption cases.",
  "retrievedAt": "2025-08-11T14:40:32.635Z"
}
