{
  "title": "DIG Islamabad enforces strict accountability",
  "author": null,
  "content": "ISLAMABAD, Jan 07 (APP):Islamabad Capital Territory (ICT) Police, led by Deputy Inspector General (DIG) Syed Ali Raza, reinforced a strict accountability process on Tuesday.\nA police spokesperson told APP that the services of multiple officers, including SHOs of various police stations, were suspended for negligence and misconduct, while a Dolphin Squad officer was dismissed over bribery allegations.\nFurthermore, the services of the SHO of Shams Colony, Sabzi Mandi, and Secretariat Police Stations were suspended for two years, while the officer of the Dolphin Squad was dismissed from his job following a bribery complaint.\nOn this occasion, DIG Raza emphasized that there is no room for corrupt police officers in the department. He stated that Islamabad Police is committed to the process of self-accountability, and no officer is above the law.\nDIG further mentioned that any police officer who exceeds his powers or neglects his duties will face strict legal and departmental action. Non-compliance and negligence in duty will not be tolerated within the department.\nDIG Raza added that the protection of the lives and property of the city’s residents is the primary responsibility of Islamabad Police, and no negligence will be accepted.\nHe also said that only officers who perform their duties properly will remain part of the team. Immediate action will be taken on any complaint, and no negligence will be tolerated in safeguarding the lives and property of citizens.\nDIG Raza further said that the process of accountability will continue to improve the performance of the institution. Officers who perform well will be awarded with awards and certificates of appreciation, while those with poor performance will face appropriate penalties.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:26:34.285Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dig-islamabad-enforces-strict-accountability/",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T16:08:00.000Z"
}
