{
  "title": "Egyptian, Ethiopian envoys call on NA speaker ; discuss bilateral relations, regional, int’l issues",
  "link": "https://www.app.com.pk/national/egyptian-ethiopian-envoys-call-on-na-speaker-discuss-bilateral-relations-regional-intl-issues/",
  "date_published": "2024-10-03T14:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 03 (APP): National Assembly (NA) Speaker, Sardar Ayaz Sadiq on Thursday said Pakistan valued high its cordial ties with Egypt and intended to further expand the existing relations through enhanced parliamentary and economic cooperation.\nHe expressed these views in a meeting with Ambassador of Egypt Dr. Ihab AbdelHamid Hassan who called on him at the Parliament House.\nAyaz Sadiq said the relation between the two brotherly countries was based on common religion, culture, history, mutual respect and brotherhood.  He expressed grave concern over the current situation in the Middle East and condemned Israeli aggression in Palestine and Lebanon. He urged upon the international community to play its role in ending Israeli occupation and aggression so that durable peace can prevail in the region.\nHighlighting the importance of parliamentary diplomacy, the speaker said parliamentary diplomacy could play a vital role in strengthening the bilateral relations. He further said the exchange of parliamentary delegations would enable parliamentarians of both countries to learn from each other’s experiences.\nHe also said enhanced contacts between Parliamentary Friendship Groups (PFGs) of both countries would result in strengthening of bi-lateral relations as well.\nAyaz also extended invitation to his Egyptian counterpart to visit Pakistan along with parliamentary delegation.\nEgyptian Ambassador Dr. Ihab AbdelHamid Hassan appreciated the remarks of the speaker for further expanding relations between both brotherly countries and parliaments. He further said Egypt attached great importance to its cordial relation with Pakistan. He also commended Pakistan’s efforts for promotion of durable peace in the region.\nLater on, Ambassador of Ethiopia to Pakistan, Jemal Beker Abdula also called on the speaker at the Parliament House. The matters pertaining to bilateral relations and important regional and international issues were discussed  during the meeting.\nAyaz said Ethiopia was the gateway to the African Continent and Pakistan accordeed great importance to its friendly relations with Ethiopia. He further said Pakistan according to its “Look Africa Policy” sought to strengthen its trade and diplomatic relations with African countries including Ethiopia.\nHe also stressed the vast opportunities for both countries to achieve growth in their trade, industry, and education sectors through enhancing bilateral ties.\nEthiopian Ambassador Jemal Beker Abdula endorsed the views of speaker regarding further enhancement of bilateral relations and also lauded Pakistan for its praise-worthy role in promotion of regional stability.\nHe said Ethiopia sought to further solidify its relationship with Pakistan. He said enhancing  parliamentary contacts between both countries was essential for strengthening of bilateral relations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:49:10.605Z"
}
