{
  "title": "PSW’s Khadijah Women Entrepreneurship Program awarded Int’ prize",
  "link": "https://www.app.com.pk/national/psws-khadijah-women-entrepreneurship-program-awarded-int-prize/",
  "date_published": "2024-10-03T09:37:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 03 (APP):Pakistan has been awarded the “International Prize for Gender Equality in Trade” by the World Trade Organization (WTO) for the Pakistan Single Window (PSW)’s innovative “Khadijah Women Entrepreneurship Program”.\nThe award ceremony was held in September, during the WTO Public Forum 2024.\nAccording to a press release issued by the PSW here on Thursday, the prize has recently been introduced by the WTO and is given to governments which have implemented result-oriented and impactful initiatives for Gender Equality in Trade.\nThe PSW “Khadijah” Program has been recognized for its innovative approach towards encouraging more women entrepreneurs to join international trade and is a significant acknowledgment of the government of Pakistan’s efforts towards promoting fair and equitable trade through a combination of inclusive policies and practical measures with a special emphasis on gender equality in the cross border trade sector.\nAccording to WTO’s communication, PSW’s Khadijah Program, Pakistan’s submission for the prize, stood out from amongst other entries and earned the honor of the award under the top category of “Female Entrepreneurs”. Other countries that won under respective categories are Spain, Columbia, Chile and Australia.\nClare Kelly, Ambassador and Permanent Representative of New Zealand to the WTO spoke at the WTO Public Forum 2024 award ceremony about why Pakistan’s PSW Khadijah Women Entrepreneurship Program won the International Prize for Gender Equality in Trade.\nShe highlighted how the Khadijah Program has empowered female entrepreneurs by providing them access to international markets and global opportunities. The program’s alignment with key selection criteria, including promoting women’s inclusion in international trade, fostering digital and financial literacy, facilitating international networking and B2B connections and demonstrating strong potential for replication, was instrumental in its selection.\nAli Sarfaraz Hussain, Ambassador, Permanent Mission of Pakistan to the WTO, extended heartfelt congratulations to Pakistan and PSW for winning the first-ever “International Prize for Gender Equality in Trade” at the WTO for its transformative Khadijah Women Entrepreneurship Program. “This award celebrates the Khadijah Program’s outstanding contributions to advancing women’s participation in international trade through innovative, result oriented strategies and techniques at the national, regional and international level,” he said.\nAccepting the award for Pakistan, the lead of the Khadijah Program at PSW, Misbah Khatana spoke about its significance to women entrepreneurs.\nThe program design revolves around three pillars: Access to Information, Access to Financial and Digital Literacy and Access to International Markets and B2B connectivity.\n“It is indeed a great honor for Pakistan to receive this prize,”said Syed Aftab Haider, CEO PSW in a statement released from his office. ” We are thrilled that PSW’s Khadijah Program has been recognized for our efforts in this regard and hope that it will contribute to project Pakistan’s positive image before the international community”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:49:34.910Z"
}
