{
  "title": "SUPARCO to celebrate World Space Week",
  "link": "https://www.app.com.pk/national/suparco-to-celebrate-world-space-week/",
  "date_published": "2024-10-03T08:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 3 (APP):The Space and Upper Atmosphere Research Commission (SUPARCO) will mark World Space Week 2024 celebrations across Pakistan through a series of activities from October 04-10 under the theme “Space and Climate Change”.\nThis annual celebration, recognized by the United Nations, focuses on space exploration, innovation, and education. This year’s theme highlights the critical role that space technology plays in addressing urgent climate change issues. Given Pakistan’s vulnerability to climate impacts, this theme holds particular significance for the country, emphasizing the importance of space-based solutions for sustainable development.\nAccording to an official source, the inauguration ceremony of World Space Week 2024 will be held on October 04 at the National Centre for Remote Sensing and Geo-Informatics (NCRG), SUPARCO Complex, Karachi. Vice Chancellor of Fatimiyah International University, Dr. Jamil Kazmi will be the chief guest of the ceremony.\nAs the national coordinator of World Space Week since 2005, SUPARCO has taken the lead in organizing a series of activities and contests to raise awareness and promote interest in space science across Pakistan.\nSUPARCO’s Space Education and Awareness Drive (SEAD) will engage schools, colleges, universities, astronomy and science societies, and the general public through various contests and activities including the ‘Best Space School Contest’, ‘Space Ambassador Contest’, ‘University Contest’, and ‘Contests for the Public’.\nA series of webinars will also be conducted, focusing on the role of space technology in monitoring climate change, managing resource sustainability, and developing climate adaptation strategies.\nSpace Vans will visit schools in Islamabad, Karachi, and Lahore to deliver lectures and academic visits will also be arranged. Additionally, live astronomical observations will be broadcast on SEAD’s Facebook page.\nThese initiatives aim to make World Space Week 2024 a nationwide event, involving participation from all corners of Pakistan. The detailed schedule and further information about events and contests can be found at www.sead.pk and on the Space Education and Awareness Drive Facebook page.\nSUPARCO encourages students, educators, space enthusiasts, and the general public to join the celebrations and contribute to spreading knowledge about the vital role of space technology in addressing climate challenges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:49:42.832Z"
}
