{
  "title": "Aamir declares proposed merger between Telenor Pakistan & PTCL as significant",
  "link": "https://www.app.com.pk/national/aamir-declares-proposed-merger-between-telenor-pakistan-ptcl-as-significant/",
  "date_published": "2024-10-03T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 03 (APP):Jazz CEO Aamir Ibrahim stressed the importance of healthy competition and market repair to drive innovation and benefit customers.\nCommenting on the proposed merger between Telenor Pakistan and PTCL , Aamir acknowledged it as a significant development for the telecom sector.\n“While we support initiatives that create synergies and efficiencies, we must also recognize the need for market repair,” he stated, referring to the ongoing decline in industry-wide penetration and profitability. “Without addressing these fundamental issues, achieving the vision of Digital Pakistan becomes increasingly difficult.”\nAccording to company news release Aamir emphasized that the merger should lead to a healthier, more competitive landscape, which in turn benefits consumers. “Jazz has always supported efforts that push the industry forward, but it’s vital that any consolidation ensures a level playing field, fair competition, and customer-centric innovation,” he added.\nHe also highlighted the critical need for regulatory fairness, particularly in terms of spectrum allocation. “If operators are allowed extra spectrum without a transparent process,  we will have no choice but to explore all legal remedies. Equal access to spectrum and infrastructure is essential for fostering a truly competitive telecom environment,” Aamir remarked.\nAs Pakistan’s leading digital operator, Jazz remains committed to working collaboratively with industry stakeholders to build a vibrant, future-ready telecommunications sector.\nAamir reaffirmed Jazz’s dedication to a competitive ecosystem, stating: “The customer must always remain at the center of innovation, and that can only happen when the industry is on a solid footing, both financially and operationally.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:49:18.086Z"
}
