{
  "title": "From religion, and politics to AI, Bibliophile President Alvi shares his best reads of 2023",
  "link": "https://www.app.com.pk/national/from-religion-and-politics-to-ai-bibliophile-president-alvi-shares-his-best-reads-of-2023/",
  "date_published": "2024-03-07T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): President Dr Arif Alvi on Thursday shared his 10 best reads of 2023 encompassing varying subjects including politics, history, Sufism, artificial intelligence and astronomy while giving his intellectual analysis in the perspectives of the modern-day world.\nThe President, in a detailed video message, shared that the aim of his extensive study was motivated by his quest for exploration into Allah’s universe, Sufism, democracy, Pakistan, his passion for artificial intelligence and global peace and development.\nThe president recommended the people to read “Economic Origins of Dictatorship and Democracy” written by Daron Acemoglu and James A. Robinson which gave a mathematical analysis of the revival of democracies in the world either consequent to any struggle or accidents.\nIt outlines the arduous journey of reclaiming people’s rights from dictators, spanning centuries of struggle as well as the resistance of the elite towards democracy.\nThe book “Democracy and Islam in History” by SM Zafar delves into the democratic processes observed during the election of the four caliphs and how they established democratic and judicial institutions. It highlights the evolution and significance of consultative practices in Islamic history.\nThe book references a letter by Hazrat Umar (RA), advising one of his judges to maintain accessibility to the masses, facilitate litigants, ensure the enforcement of decisions, and revise judgments if deemed against the spirit of justice.\nPresident Alvi also emphasized that while hearing the representations against the Ombudsmen’s decisions, he kept special care of the impoverished litigants and those from remote regions.\n“The Impossible State: Islam, Politics, and Modernity’s Moral Predicament” by Wael B. Hallaq explores the historical evolution of legislative processes in Islamic history. It highlights that during the caliphates, rulers didn’t enact laws rather, Muftis interpreted them based on the Quran, Sunnah, and past precedents.\nPresident Alvi outlined the five fundamental principles of an Islamic state: protecting life and property, ensuring freedom of thought and religion for all, and fostering a free society.\nThe President also recommended Elif Shafak’s “The Forty Rules of Love: On Mawlana Rumi and Shams Tabraizi,” which explores Sufism and the profound friendship between Rumi and Tabraizi.\nDescribing the Holy Quran as a guiding light for humanity, Rumi offered a distinctive perspective on love: “love yourself, love your family, love your neighbors, love your nation, love humanity, love everything created by Allah, love your prophet, and love Allah,” encouraging people to begin their journey of love from the most immediate to the divine.\nAmong the president’s top reads was also “The God Equation: The Quest for a Theory of Everything” by Michio Kaku, which charts the evolution of our understanding of the universe over time, from the Aristotelian concept of four elemental components—earth, water, fire, and air—to modern scientific discoveries such as magnetic fields, radio waves, atoms, and nuclei.\nIt tells that the universe visible to humans constitutes just 5% of its total size, with dark matter comprising 26% and dark energy 70%.\nThe President endorsed “On The Origin of Time” by Thomas Hertog, a student of Stephen Hawking, which delves into the anthropic principle of the universe’s creation. The book supports the Quranic concept that Allah crafted the universe for humanity and out of love for the Holy Prophet.\nQuoting Stephen Hawking, the president mentioned that while we currently perceive three to four dimensions, there exist an additional 10 dimensions and parallel universes inhabited by diverse, undiscovered beings.\nThe President also studied “Scary Smart: The Future of Artificial Intelligence and How You Can Save Our World” by Mo Gawdat which deliberated on the world’s increasing fear of artificial intelligence.\nThe writer argues against the human expectations of controlling AI, claiming that by 2040-50, AI will be one billion times more powerful than humans.\nAnother book, suggested by Alvi was “Honor Bound to Pakistan in Duty, Destiny and Death: Iskandar Mirza, Pakistan’s First Elected President’s Memoir From Exile” written by Syed Khawar Mehdi which is a compilation of Mirza’s tape recordings, conversations and notes.\nOne of the president’s best reads is “Fear: An Alternative History of the World” by Robert Pekham, which explores the pervasive role of fear throughout history, both as a means of control and as a necessary element for governance.\nThe book provides historical examples, including the mistreatment of indigenous peoples, the rise of production capitalism, and the destruction caused by wars, drawing parallels to contemporary fears experienced by communities like those in Karachi and Gaza.\nAnother interesting book was C. Renee James’10- Things “That Go Bump in The Universe: How Astronomers Decode Cosmic Chaos” which highlights the vast scale of the cosmos, from the smallest particles to the largest celestial bodies.\nHe shared scientific facts like human body containing billions of germs, 40 trillion cells, and 30 trillion bacteria, with each cell composed of 100 trillion atoms. Moreover, the book discusses astronomical marvels like the largest known Black Hole being 69 billion times larger than the sun, and the largest star which is five billion times bigger than the sun.\nIn the end, the President said that the quest for knowledge was good but we need to have a loving heart first. The real strength of our country was our family values based on morality and expressed hope that Pakistan had all the potential to lead and to present before the world, an example of a loving state. We all need to come forward and contribute our share for the same, he added.",
  "retrievedAt": "2025-08-11T01:11:44.446Z"
}
