{
  "title": "Empowering women a key factor in building climate resilience of vulnerable communities",
  "link": "https://www.app.com.pk/national/empowering-women-a-key-factor-in-building-climate-resilience-of-vulnerable-communities/",
  "date_published": "2024-03-07T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): Being increasingly vulnerable to adverse fallouts of climate change, women are the major victim of natural disasters, particularly floods or droughts and to climate-related health risks like under-nutrition and malaria.\nHowever, mainstreaming women-focused resilience-building actions into policymaking is key to lower their exposure to the adverse fallouts of climate change, particularly floods, stated Ministry of Climate Change and Environmental Coordination spokesperson Muhammad Saleem Shaikh in a news release on Thursday.\nHe said, “Building climate-resilience women by engaging them into climate policymaking and policy implementations processes as well as enhancing investment in the women-focused climate risk management programmers and actions is an important ingredient in building climate resilience of the women.\nThe ministry official said this on the eve of the International Women’s Day being marked on March 8 every year globally. This year it is being celebrated under the theme Invest in women: Accelerate progress.\nHe said, while climate change was affecting everyone including men, women, elderly and children. Yet, not all of them are equally affected by devastating impacts of climate change. “Climate vulnerability is exacerbated by inequity and marginalization linked to gender, ethnicity, low income, and other social and economic factors,” he highlighted.\nWomen bear the most responsibility for managing efforts for household food, energy and water supplies in most of the developing countries including Pakistan. They also produce roughly 60 percent of the food in these countries he stressed and suggested that, “elevating women and girls as change makers or catalysts in their communities could also enable them to lead resilient, local, and rights-based solutions to climate adaptation.”\nThe ministry official highlighted that various studies show that when women are not fully engaged in climate work, programs are unlikely to meet failure, putting women at greater risk of increased exposure to climate change impacts.\nGiven the urgency and scale of the climate crisis, it was imperative to ensure that women are provided enabling environment to participate in developing and implementing climate solutions to the problems because of which they suffer, he said.\nThe ministry spokesperson Muahmmad Saleem said, “Given the realization of the importane of women’s engagement in managing climate risks, the national climate change policy recognises that there was an unprecedented opportunity and benefits in recognising and formalising women’s role in disaster management processes, right from preparedness to recovery. Doing so would improve the resilience of communities and people and also yield co-benefits for gender equality in general, as work by the World Bank has shown.”\nHalf of the world’s population was comprised of women and girls, yet they remained mostly left out of the conversation when it came to building of the climate resilience of the communities.\n“Thus, if achieving the Paris Agreement goal of limiting global temperature rise to 1.5 degrees Celsius was required, everyone, particularly women needs to heard and be on board, meaning more women and girls need to be empowered and involved in climate change and disaster risk management policies and actions,” he remarked.\n“This calls for the women, irrespective of their backgrounds, cultures, languages, to be involved at all stages – right from climate talks to forests and fields, especially in sectors and regions like Pakistan, Bangladesh and Nepal hit hard by the devastating fallouts of the climate change.”\nAccording to UN reports, Women make up nearly half of the agricultural labor force in developing countries including Pakistan. When provided with the same access to resources as men, women can increase their agricultural yields by 20 to 30 percent. This boost in productivity not only improves total agricultural output by 2.5 to 4 percent, but it can also help reduce world hunger by 12 to 17 percent.\n“Empowering women in agriculture could also lead to a positive impacts and support lasting benefits of climate adaptation in the farming sector. By providing them with access to suitable technology and resources, who plough the world’s most of the farming lands, we can achieve sustainable farming goals to achieve durable food security and resilience of the food sector to the climate shocks and mitigate rural poverty and unemployment,” Saleem Shaikh said.\nHe emphasized that the various UN and World Bank reports have concluded that building climate resilience in communities, involving women was unprecedented and yielded far-reaching positive impacts, resulting in communities’ durable resilience to the climate change-caused natural hazards.\n“By engaging women in community planning and disaster response efforts at all levels could lead to building stronger, more disaster-resilient and climate-safe communities that are better prepared to confront the exacerbating impacts of the global climate crisis,” he said.",
  "retrievedAt": "2025-08-11T01:11:08.246Z"
}
