{
  "title": "PM for removing hurdles to expedite privatisation process",
  "link": "https://www.app.com.pk/national/pm-for-removing-hurdles-to-expedite-privatisation-process/",
  "date_published": "2024-03-07T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday stressed for expediting the privatisation process of those State Owned Enterprises (SOEs), causing constant dent to the national exchequer, to stabilize the national economy and provide maximum relief to the common man.\n“Obstacles in the process of privatisation be removed at the earliest so that the country and the nation can get rid of losses of billions of rupees and improve the economic condition,” he said while chairing a high level meeting on privatisation.\nThe prime minister also directed to take immediate steps for enhancing the capacity of departments linked with the privatisation process.\nReviewing the complete list and progress report of all the institutions involved in the privatisation process, the prime minister directed to submit the detail of actions and goals with a clear determination of time frame.\nHe also directed the Privatization Commission and the Ministry to present pending issues related to the privatization to the cabinet soon after its formation for timely decisions as there was no room for further delay.\nShehbaz Sharif, on the proposal of handing over the power distribution companies to the provinces, directed to constitute a review committee, which would submit its recommendations to the prime minister.\nHe made it clear that the responsibility of the privatisation process lied totally upon the Privatisation Commission and the Ministry. He also directed to remove all the bottlenecks in the process.\nHe also stressed to ensure transparency of the privatisation process at the institutional level and to adopt effective international standards of its monitoring.\nThe prime minister said that the country and its people were compelled to pay the heavy price of loss-making institutions, urging the quarters concerned to play their sincere role in getting rid of them.\nHe made it clear that quality, transparency and national interest would be kept supreme, stressing the need for creating an environment of business competition and serving the public, terming them essential for improvement. “The ministries and institutions should suggest solutions exhibiting professionalism and passion as it is a matter of Pakistan’s betterment.”\nThe meeting took an overview of the latest situation on the process of privatization of Pakistan International Airlines (PIA), House Building Finance Corporation, First Woman Bank, Roosevelt Hotel, Heavy Electrical Complex, power plants & distribution companies, Pakistan Steel Mills Corporation and other loss-making institutions.\nIt also deliberated over the progress made so far and the obstacles confronted in this regard.\nThe Secretary of the Ministry of Privatization and other relevant officials gave a briefing.\nThe meeting was informed that one of the main reasons for delay in the process of privatization was the stay orders issued by courts.\nThe prime minister directed to make the legal team effective and asked the Ministry of Law to suggest appropriate measures accordingly.\nThe meeting was apprised that March 5 was the last date for receiving bids for outsourcing the airport.\nThe meeting was attended by Senators Ishaq Dar and Musadik Malik, Shaza Fatima Khawaja, Rumina Khursheed Alam, Ahad Cheema, Ali Pervaiz Malik, Rana Ehsan Afzal, Deputy Chairman Planning Commission, Federal Board of Revenue Chairman, Secretary Privatisation Commission, Secretary Ministry of Law and other high officials. Renowned Banker Muhammad Aurangzeb participated in the meeting through a video link.",
  "retrievedAt": "2025-08-11T01:11:38.202Z"
}
