{
  "title": "PM announces Rs 7.5 billion Ramazan relief package for poor people",
  "link": "https://www.app.com.pk/national/pm-announces-rs-7-5-billion-ramazan-relief-package-for-poor-people/",
  "date_published": "2024-03-07T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Prime Minister Shehbaz Sharif Thursday announced a historic subsidy based Ramazan relief package 2024 of Rs 7.5 billion for the poor and middle classes.\nHe was chairing a high level meeting on Prime Minister’s Ramazan Relief Package and Benazir Income Support Programme (BISP).\nSenator Ishaq Dar, Ahad Cheema, Shiza Fatima Khawaja, Romina Khursheed Alam and high ranking officials attended the meeting.\nThe PM was given a detailed briefing on the Ramazan relief package.\nDuring Ramazan ul Mubarak, under the package more than 39.6 million families will be provided edible goods on lower rates.\nUnder the Benazir Income Support Programme, 88 percent of the eligible families will be given 19 edible items including flour, rice, pulses, ghee, cooking oil, sugar, sherbet and milk on lower than market rates. The rate of subsidy on these goods would be 30 percent which was more than the inflation rate.\nSubsidy of Rs 77 per kilo would be given on the 20 kilogramme flour bag and Rs 70 subsidy on every kilogramme of ghee.\nThe Prime Minister’s Ramazan relief package would be distributed among the needy families through 4775 utility stores across the country and the supply would continue till the end of Ramazan.\nThose who would face any difficulty in registration for the Ramazan relief programme, would be facilitated and registered at the spot and their complaints would be resolved.\nThe prime minister said it was priority of the government to distribute edible items to the poor and low income class on lower than market rates.\nHe said no compromise would be made on the quality of the edible items being provided under the relief package.\nThe quality of the eatables would be strictly monitored, he added.\nThe prime minister said it would be ensured that the people should not face any difficulty while availing the Ramazan package.\nHe directed to increase the counters for distribution of Ramazan package especially cheap flour besides mobile units.\nHe said strict action would be taken against those who were resorting to artificial price hikes and hoarding during the holy month of Ramazan.\nThe PM instructed that the deserving people should be properly guided through an awareness campaign across the country about the relief package so that they could avail the facility and should not face any difficulty in getting the edible items.\nHe said the system for resolving complaints of people coming to get the relief package, should be more effectively coordinated, adding no negligence or laxity would be tolerated.\nHe resolved that the government would not leave the poor alone and middle classes who were worried about the price hikes in the month of Ramazan.\nAs per the prime minister’s instruction, under Benazir Income Support Programme (BISP) the quarterly installment for poor people was increased to Rs 10,500 which would be distributed during the holy month.\nBesides the BISP’s quarterly installment, the prime minister also directed the distribution of additional Rs 2,000 among needy people in Balochistan.",
  "retrievedAt": "2025-08-11T01:11:10.483Z"
}
