{
  "title": "SJC declares Justice Mazhar Naqvi as guilty of misconduct",
  "link": "https://www.app.com.pk/national/sjc-declares-justice-mazhar-naqvi-as-guilty-of-misconduct/",
  "date_published": "2024-03-07T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): The Supreme Judicial Council (SJC) on Thursday declared Justice Sayyed Mazhar Ali Akbar Naqvi as guilty of misconduct and recommended for his removal from the office of judge.\nSJC rendered its opinion in respect of the nine complaints against Sayyed Mazhar Ali Akbar Naqvi under Article 2009(6) of the constitution, said a press release.\nIt said that The Supreme Judicial Council (SJC) met on 29 February 2024 and 1 March 2024.\nAllegations are leveled against judges of the supreme court and high courts and the same are publicized. A number of judges have expressed concern that if they respond to such allegations the same may be construed as misconduct because the code of conduct, dated 2 September 2009 issued by the SJC, in its Article-V states that a judge should not seek publicity.\nThe SJC deliberated upon the matter and was of the opinion that if a reply or clarification is issued by or on behalf of a judge it does not violate Article-V. However, since concerns have been expressed by judges it was agreed that the following be added to article-V of the Code of Conduct:\n‘However, if an allegation is publicized against a judge he may respond to it.’\nTherefore, Article-V of the Code of Conduct is amended to read as under:\n‘Functioning as he does in full view of the public, a judge gets thereby all the publicity that is good for him.\nHe should not seek more. In particular, he should not engage in any public controversy, least of all on a political question, notwithstanding that it involves a question of law. However, if an allegation is publicized against a judge he may respond to it.’\nThe press release said that SJC considered six different complaints, in chronological order, and in respect of five the opinions expressed by the members to whom it was referred, recommended that there was no substance therein, with which the SJC concurred.\nHowever, in respect of complaints submitted against a judge of the high court of Balochistan the SJC issued notice to submit his reply/explanation within fourteen days, it said.",
  "retrievedAt": "2025-08-11T01:11:10.636Z"
}
