{
  "title": "Pakistan signs multiple deals at LEAP",
  "link": "https://www.app.com.pk/national/pakistan-signs-multiple-deals-at-leap/",
  "date_published": "2024-03-07T11:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): The Pakistani contingent stood out with remarkable achievements at premier tech event LEAP 2024 at Riyadh, Saudi Arabia, witnessing the signing of multiple deals and partnership agreements between Pakistani companies and their global counterparts.\nThe third edition of the LEAP conference and exhibition, a beacon for cutting-edge technology, artificial intelligence (AI) initiatives, and innovations, is being held in said a news release received here on Thursday.\nThis premier event boasts a gathering of over 1,800 local and international exhibitors, approximately 1,000 technical experts, and 600 startups.\nAmong the standout achievements, Pakistan’s leading ERP company has secured a transformative equity partnership with Saudi and Pakistani investors at the TechdestiNation Pakistan pavilion, a collaborative effort organized by Pakistan Software Export Board (PSEB) and TDAP at LEAP 2024.\nThis landmark investment not only signifies a pivotal moment for Pakistan’s IT industry but also underscores Saudi Arabia’s role as a global advocate for Pakistan’s technological capabilities, as remarked by Ahmed Farooq, Pakistan’s Ambassador to the Kingdom of Saudi Arabia (KSA).\nFurther strengthening Pakistan’s presence on the global tech stage, a significant partnership has been forged between Jazz, Pakistan’s premier digital operator, and TenX, an acclaimed global consultancy.\nThis collaboration aims to revolutionize data management through Enterprise Feature Store (EFS) and Predictive AI Models.\nAdditionally, Abacus and ELM have solidified their commitment to innovation by officially signing a Memorandum of Understanding (MoU), laying the groundwork for future synergies.\nP@SHA, in a historic move, has signed its largest MoU to date during this mega event.\nThe focus of this collaboration is on fostering cooperation and enhancing business-to-business engagement with the IT association of Bahrain.\nFurthering the spirit of collaboration, Inbox Technologies has entered into a partnership deal with Saudi Arabia’s GISSAN, showcasing the strength of cross-border cooperation in driving technological advancement.\nThe CEO of PSEB Ms. Aisha Humera Moriani held pivotal meetings with high-ranking officials from the Kingdom of Saudi Arabia (KSA), paving the way for future collaborations.\nKey discussions with the Ministry of Communication and Information Technology (MCIT) underscored the potential for bilateral collaboration and highlighted Pakistan’s capability to meet the diverse needs of KSA’s evolving economy.\nFurthermore, meetings with ELM explored collaborative possibilities in acceleration centers and future projects, while discussions with SDAIA focused on potential collaborations and partnerships in artificial intelligence.\nBuilding on previous engagements with DCO, connections were strengthened to explore opportunities for expanding business in DCO member states.\nSpeaking to the media, Ms. Aisha Moriani, CEO of Pakistan Software Export Board, highlighted the significant impact of Pakistan’s participation in LEAP, with last year witnessing a remarkable 60% growth in IT trade with KSA. This year’s participation, featuring over 70 companies and 800 delegates, holds even greater potential, reflecting Pakistan’s robust presence in the global tech landscape.\nThe success and momentum generated at LEAP 2024 reinforce Pakistan’s position as a key player in the global tech ecosystem, fostering innovation, collaboration, and growth.",
  "retrievedAt": "2025-08-11T01:11:36.627Z"
}
