{
  "title": "Senator Bahramand Tangi bid farewell speech with heavy heart",
  "link": "https://www.app.com.pk/national/senator-bahramand-tangi-bid-farewell-speech-with-heavy-heart/",
  "date_published": "2024-03-07T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): Senator Bahramad Tangi on Thursday in his farewell speech said that he will cast his vote in favor of Asif Ali Zardari on March 9 and part his ways from Pakistan Peoples Party.\nIn his emotional speech, senator Tangi blamed Senator Sherry Rehman and Nayyar Ali Bukhari for hatching conspiracy against him and creating differences between him and party leadership.\nHe said that every senator should be given freedom for work for the strengthening of democratic and parliamentary system.\n“I am satisfied with my six years tenure as senator” said Tangi adding that after March 9, he will start a fresh political journey but will always respect the leadership of Pakistan Peoples Party who honored his 44 years political struggle and nominated him for senator ship.\nSenator Tangi appreciated Chairman Senate Sadiq Sanjrani and Deputy Chairman Senate Mirza Khan Afridi for conducting the house business in smooth ways.\nSenator Mohammad Akram said that during his tenure he raised the issue of missing persons and development of Baluchistan but unfortunately failed to resolve those issues.\nHe said Pakistan witnessed different systems but unfortunately did not witness development and prosperity.\nCountries in the world got freedom after Pakistan left behind us in the race for development, means the system of Pakistan needs overhauling.\nPakistan cannot prosper until and unless free and fair election are to be conducted and the Parliament is made sovereign.\nSenator Saifullah Abro said that political parties should never close doors for dialogue and must sit together to resolve the issues of Pakistani people.\n“I assure this house on behalf of my party PTI that we are ready to sit with all political parties but only if they concede special and reserve seats allotted to them by Election Commission of Pakistan” said the senator.\nHe said no political party is bad but the people in the party are good or bad who bring good name or bad name to the party.\nHe said all politicians and political parties must respect the constitution of Pakistan and struggle for uphold of the constitution.\nSenator Kisho Bai thanked her party for given her representation in the upper house and entrusting her.\nShe said that she tried her best to come up to the expectations of her party and represent her people in the upper house.\nShe said that the upper house provided her an opportunity to represent Pakistan at international stage.\nSenator Abida Azeem thanked her party leader Mehmood Khan Achakzari for giving her representation in the upper house.\nShe said that she learned a lot from her senior senators which will help her in the rest of the life.\nShe also requested senators to vote for Mehmood Khan Achakzai in presidential election.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:11:43.238Z"
}
