{
  "title": "Coalition partners to elect Asif Zardari as President: PM",
  "link": "https://www.app.com.pk/national/coalition-partners-to-elect-asif-zardari-as-president-pm/",
  "date_published": "2024-03-07T18:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Prime Minister Shehbaz Sharif Thursday said Asif Ali Zardari would be elected as President of Pakistan as coalition partners had overwhelming majority in the National Assembly, Senate and provincial assemblies.\nSpeaking at a dinner hosted in honour of leaders of allied parties, he said Asif Zardari would be the candidate of the allied parties in the presidential election on March 9.\nThe coalition government secured two thirds of the votes in the recent general elections and it would be reflected during the presidential election, he added.\nHe said the coalition federal government was formed again with consensus and unity besides formation of Pakistan Peoples Party government in Sindh, Pakistan Muslim League(N) government in Punjab and a coalition government in Balochistan.\n“We have to respect mandate of the people,” he said adding, “the world is looking towards Pakistan and seeing how the new government will overcome challenges and resolve issues.”\nHe thanked his coalition partners, Quaid PML Nawaz Sharif and leaders of allied parties for electing him as the prime minister once again.\nThe Prime Minister said his government was facing Himalaya like challenges and the facts about economy were troublesome.\n“Our gas and electricity circular debt had hiked to Rs five trillion. The debt of PIA had ballooned to Rs 825 billion. The annual theft of electricity amounted to Rs 500 billion”.\nHe said these figures showed the gravity of the economic situation.\nHe said the government refunded Rs 65 billion to the exporters, adding the tax base should be expanded while burden on those who were already taxed, should be reduced.\nHe pointed out that Pakistan’s tax to GDP ratio was just 9.8 percent whereas this percentage was higher in other countries.\nHe said state owned entities were making losses of hundreds of billions of rupees and the government was paying these losses by taking more loans.\nHe informed that Rs 1.7 trillion taxes were stuck in courts due to legal disputes, vested interests and collusion.\n“We have to unite to take Pakistan out of the present economic difficulties. If we cannot take Pakistan out of this situation history will not forgive us,” he remarked.\n“Our target is to change condition of the nation and we have to present our proposals to friendly countries to attract investment.”\nIn his remarks, co-chairperson of Pakistan Peoples Party Asif Ali Zardari said his party would support the prime minister as he would work to steer Pakistan on the path of progress.\nHe was of the view that Pakistan could make economic progress with growth in the agriculture sector.\nHe mentioned that history was amended with the Supreme Court judgment in the reference on judicial murder of Zulfikar Ali Bhutto.\nSpeaking on the occasion, Chairman PPP Bilawal Bhutto Zardari said last time during his presidential tenure, his father Asif Zardari gave up his powers in favour of the Parliament.\nAsif Zardari would be elected as the civilian president for the second time, he noted.\nHe said economy and reconciliation in Pakistani politics would be priority of the coalition government.\nHe thanked the political parties for supporting Asif Zardari for the presidential election.",
  "retrievedAt": "2025-08-11T01:11:08.242Z"
}
