{
  "title": "Bukhari says, over 500 Japanese IT companies keen to invest in Pakistan",
  "link": "https://www.app.com.pk/national/bukhari-says-over-500-japanese-it-companies-keen-to-invest-in-pakistan/",
  "date_published": "2020-12-18T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP):Special Assistant to Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (HRD), Sayed Zulfikar Abbas Bukhari met with Japanese ambassador to Pakistan, Kininori Matsuda to discuss the export of Pakistani IT Engineers in Japan, said a press release.\nThe meeting was followed by a video conference held with the Japanese IT Companies association.\nOfficials from the ministry of foreign affairs, ministry of information technology, Pakistan Software House association and embassies of both countries participated in the meeting.\nSpeaking on the occasion, Japanese IT Association said that the shortage of IT engineers is intensifying in Japan. According to Japan’s Ministry of Commerce and Industry, by 2030, Japan will face a shortage of 800,000 IT engineers. They further said that after the COVID-19 situation subsides, more than 500 Japanese IT companies will come to Pakistan.\nThe Ambassador of Pakistan in Japan apprised the SAPM about 100 Japanese companies who have contacted the embassy following the Pak-Japan Skilled Workforce agreement.\n“Following the Pak-Japan Skilled Workforce Agreement, more than 100 major Japanese IT companies, including NEC Corporation, Mac, Sankyo, and Orix Japan, have approached the Pakistani Embassy in Japan.” The ambassador said\nSAPM Sayed Zulfikar Bukhari said that under the new vision, the Ministry of Overseas Pakistanis is expanding its horizon of Pakistani manpower exports to countries other than GCC. He said that the ministry is in close contact with South Korea, Romania, Germany and Japan and sending manpower to Japan is our top priority.”\n“I will be making an important visit to Japan next year.” said Zulfi. He said that 2021 will mark a new beginning of Pak-Japan relations.\nZulfi said that he hope that in 2021, the ministry will pave the way for Pakistani IT engineers to work in Japan and Japanese IT companies would also be welcomed to set up training centers in Pakistan.\nHe further said that after the Japan visit, Pak-Japan IT Conference will also be held in Pakistan and that Japan will soon become the second largest market for Pakistanis after the Gulf countries.\nSpecial Assistant to Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Developemnt (HRD), Sayed Zulfikar Abbas Bukhari met with Japanese ambassador to Pakistan, Kininori Matsuda to discuss the export of Pakistani IT Engineers in Japan.\nHe further said that after the Japan visit, Pak-Japan IT Conference will also be held in Pakistan and that Japan will soon become the second largest market for Pakistanis after the Gulf countries.\n.\nSpecial Assistant to Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (HRD), Sayed Zulfikar Abbas Bukhari met with Japanese ambassador to Pakistan, Kininori Matsuda to discuss the export of Pakistani IT Engineers in Japan.\nOver 500 Japanese Information Technology (IT) companies were keen to invest in Pakistan, after coronavirus.",
  "retrievedAt": "2025-08-11T20:09:25.569Z"
}
