{
  "title": "Instead of turning into Asia tiger, govt striving to make Pakistan welfare state: PM",
  "link": "https://www.app.com.pk/national/instead-of-turning-into-asia-tiger-govt-striving-to-make-pakistan-welfare-state-pm/",
  "date_published": "2020-12-18T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP):Prime Minister Imran Khan on Friday said the present government was fully striving to make the country a true Islamic welfare state in line with the vision of Riasat-e-Madina and as per the Objective Resolution – adopted by the Constituent Assembly of Pakistan in1949.\n“Instead of claims of making the country an Asian tiger or making the Lahore city Paris, we are striving to make Pakistan an Islamic welfare state as per the Objective Resolution,” he said while speaking at the launching ceremony of Sehat Sahulat Programme’s Universal Health Coverage (UHC) for Azad Jammu and Kashmir (AJK).\nThe prime minister said 1.2 million people in the AJK would benefit from the health insurance and would be entitled for free of cost medical treatment from 350 government and private hospitals across Pakistan.\nHe said the introduction of health insurance in AJK would also send a message to the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK), who were facing severe hardships at the hands of fascist Indian regime, that how Pakistan treated its people in Azad Kashmir.\nThe prime minister said health insurance was first launched by the previous government of Pakistan Tehrik-e-Insaaf (PTI) in Khyber Pakhtunkhwa, and now the present KP government had decided to provide the facility to all citizens.\nSimilarly, he said, 6 million people in Punjab were being provided with the facility of health insurance by the provincial government, which was striving to extend the scheme to the whole province by the end of 2021.\nImran Khan said the vision of a welfare state, which was introduced by Holy Prophet Hazrat Muhammad (Peace Be Upon Him), was aimed at looking after the poor and ensuring the provision of basic facilities to all.\nHe referred to the model of welfare state adopted by Scandinavian countries, including Denmark, Sweden and Norway, whose governments, he said, were bound to provide all basic facilities to their citizens.\n“It is my faith that when you take care of the welfare of people, especially the poor, your resources are increased by Allah Almighty,” he remarked. That was why the welfare states in world were richer, he added.\nThe prime minister also recounted how he struggled for ten years to establish the Shaukat Khanan Cancer Hospital, which was providing free of cost treatment to cancer patients for the last 25 years.\nHe had thought about the launching of a system such as the current health insurance scheme during his struggle for the Shaukat Khanam Hospital, he added.\n“When I entered the politics, I thought that if I got a chance to serve the country, I will launch such a health scheme in which the poor people get free of cost medical treatment,” he remarked.",
  "retrievedAt": "2025-08-11T20:09:25.709Z"
}
