{
  "title": "No increase in gas tariff for domestic consumers, Tandoors: Petroleum Division",
  "link": "https://www.app.com.pk/national/no-increase-in-gas-tariff-for-domestic-consumers-tandoors-petroleum-division/",
  "date_published": "2020-10-03T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 03 (APP): The Petroleum Division Saturday clarified that there would be no increase in gas price for domestic consumers and ‘Roti Tandoors,’ rejecting some media reports about the Economic Coordination Committee (ECC)’s decision on revised- tariff summary of the commodity.\n“In the first summary by the Petroleum Division for annual gas price revision, the ECC decided to keep the gas tariff unaffected for domestic and Roti Tandoors from July 1, 2019 levels,” the Petroleum Division said in a press statement.\nIt regretted that a certain section of the media reported the decision of the forum [ECC) erroneously, which was subject to ratification of the Federal Cabinet by next week.\nFurther explaining the factual position, the Petroleum Division said the ECC had also decided that the applicable Gas Infrastructure Development Cess (GIDD) would be eliminated for all other customers in the light of order of Supreme Court and “the prices for those previously subject to GIDC would be increased by one-third of what would have been applicable in GIDC.”\nAs per the proposed and actual figures, there was no change in the existing price of Rs 1,283 per Million British Thermal Unit (MMBTU) gas for the Commercial sector.\nSimilarly, the per MMBTU gas price for Fertilizer-Feed-New and Cement sectors would remain unchanged at Rs 108.5 and Rs 1,277 respectively.\nHowever, the gas price for Fertilizer-Feed sector has been proposed to increase from Rs 300 per MMBTU to Rs 302, Fertilizer-Fuel Rs 1,021 to Rs 1,023, Power Rs 824 to Rs 857, General Industry Rs 1,021 to Rs 1,054, Captive-Gen Industry Rs 1,021 to Rs1,087, Textile Process (Export) Rs 786 to Rs 819, Captive Power-Textile (Export) Rs 786 to Rs 852, CNG (Region-I) Rs 1,283 to Rs 1,371 and CNG (Region-II) Rs 1,283 to Rs1,350.\nThe second summary, the Petroleum Division said, pertained to supply of gas to five export-oriented industrial sectors in the Sui Southern Gas Company (SSGC) system; under which “blend of available local gas with LNG [Liquefied Natural Gas) would be supplied to these industries at the rate of Rs 930/MMBTU for five months of winter season till end of February 2021, in view of drastic drop in production of indigenous gas in Sindh.\n” After February 2021, the supply of local gas would resume as per existing practice when the demand from the domestic sector normalized.\n“For comparison, five export sector industries in Punjab are being provided LNG at the rate of USD 6.5/MMBTU (approx. Rs1080) as per agreement.”\nThe government has agreed and approved upon this formula to protect the export-oriented industry in the SSGC system by supplementing the gas supply with LNG during winter in consultation with industrialists.",
  "retrievedAt": "2025-08-11T19:51:52.601Z"
}
