{
  "title": "Governor greets Iftikhar Malik for landslide victory in LCCI election",
  "link": "https://www.app.com.pk/national/governor-greets-iftikhar-malik-for-landslide-victory-in-lcci-election/",
  "date_published": "2020-10-03T15:03:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 03 (APP): Punjab Governor Chaudhry Mohammad Sarwar Saturday greeted veteran trade leader and chairman Founder Group Iftikhar Ali Malik\nfor landslide victory in annual election of the Lahore Chamber of Commerce and Industry (LCCI).\nTalking to Iftikhar Malik by telephone, the Governor said that PIAF Founder alliance candidates had a clean sweep on all seats which reflects its popularity in the business community.\nHe said that Lahore after Karachi was second hub of economic activities and traders always played a key role in national development and progress of the country.\nHe said the LCCI was the largest and the oldest in the country established in 1923 which produced eminent figures in Pakistan.\nHe said the PTI government especially Prime Minister Imran always attached great importance to business community and had already issued directives to all federal and provincial departments to address the genuine grievances of the business community on top priority.\nMohammad Sarwar said, “He is all the time available to them and always not only extend cooperation but also take up their legitimate issues to the quarters concerned for their redressal.”\nIftikhar Malik thanked Governor for his support and acknowledgment of democratically conducted fair free and transparent elections in chamber.\nHe said it was indeed important to increase exports and for that purpose cost of doing business needed to reduce so that products can remain competitive in the world markets.\nHe said that LCCI always acts as a bridge between the government and the business community.\nIt has always tried to ensure a business-friendly\nenvironment through sharing views with the government and by taking all the stakeholders on-board on all the economy related issues.",
  "retrievedAt": "2025-08-11T19:51:52.323Z"
}
