{
  "title": "Defense Minister advises opposition to stop politicking for personal interests",
  "link": "https://www.app.com.pk/national/defense-minister-advises-opposition-to-stop-politicking-for-personal-interests/",
  "date_published": "2020-10-03T15:34:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 03 (APP): Defense Minister, Pervaiz Khattak Saturday advised opposition to stop politicking for personal interests and said that government would consider their positive suggestions and proposals except issues relating to corruption.\nHe was addressing ceremonies held in Nowshera Kalan and Aman Gardh to welcome new entrants in the party. He said government is ready for talks on matters except those that are related to corruption.\nRejecting the outcry of opposition parties, he said government would continue its constitutional tenure. He said that people fully comprehend the narrative of Nawaz Sharif and Asif Zardai who are now busy in placating their own party members adding rifts between two parties have surfaced prior to the start of their joint agenda.\nHe said that government would not be blackmailed by threat of opposition to tender resignations. He said opposition would not be barred from launching protests but any attempt to break law would be dealt accordingly.\nPervaiz Khattak said that country is passing through a sensitive phase and opposition should abandon their useless efforts that are aimed to achieve personal interests.\nHe said that corruption of previous ruling drained out public exchequer and put country into a quagmire of problems. He said that Prime Minister Imran Khan is tirelessly working to steer country out of crises and now making efforts to augment economy of country defeating challenges emerged in backdrop of corona pandemic.\nDefense Minister lamented that opposition is trying to create a chaos in the country that has progressing on a course of prosperity and development due to result oriented policies of Prime Minister, Imran Khan.\n“Tirade of opposition against public institutions would serve nothing but provide enemies of the country an opportunity to fulfill their nefarious designs”, he said and maintained that time demands that religious and political entities should join hands to establish peace in the region and support Kashmiris to get right of self determination.\nHe said that opposition alliance would soon face dismemberment as it was being constituted to get NRO for party leaders adding that no one would be granted NRO and compromise on corruption is out of question.\nHe said that problem of sui gas low pressure in Nowshera Kalan would be resolved and new schemes of sewerage would be approved for the area.\nOn the occasion, Haji Baladar Khan, Mian Gohar Ali Shah, Mian Ghous Ali Shah, Mian Sayed Ali Shah, Khalid Shah and Mansoor Ali Shah reposed confidence on Pervaiz Khattak and announced joining PTI with their families and friends.",
  "retrievedAt": "2025-08-11T19:51:51.365Z"
}
