{
  "title": "AJK PM, JI Chief condemn Indian aggression in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-pm-ji-chief-condemn-indian-aggression-in-iiojk/",
  "date_published": "2020-10-03T11:47:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK):  Oct 03 (APP): Azad Jammu & Kashmir President Sardar Masood Khan Saturday held a meeting with Jamaat-e-Islami (JI) Ameer Siraj-ul-Haq and discussed in detail the human rights violations and rapid demographic changes taking place in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe President said that despite the condemnation of India’s moves on 5 August last year, India continues unabated with its plans to colonize and strengthen its illegal occupation of IIOJK, President office told media here.\nHe added that not only this, the India government was economically starving the Kashmiris by awarding existing businesses contracts of the Kashmiris to non-State Hindus from all over India; and under dubious historical records and mappings was planning to build thousands of temples all over IIOJK.\n“What took decades under the Balfour declaration is being replicated and implemented in a matter of two-three years in IIOJK under the New Domicile Rules. The unique identity of Kashmir is being totally be wiped out and we will have no Kashmir to defend”, he said.\nThe AJK President on behalf of the Kashmiri thanked the Jamaat-e-Islami and other international organisations working under its umbrella like Tahreek-e-Kashmir for engaging masses, organising massive rallies and creating awareness on Kashmir.\nHe said that political mobilisation was a key factor in raising the profile of the Kashmir dispute, in helping stop the illegal settlement of non-state hindus and the massacre of Kashmiris in IIOJK.\n“Through political and diplomatic efforts, we must transform the Kashmir issue into an international movement, which the global community cannot overlook”, he maintained.\nSiraj-ul-Haq reaffirmed the support towards the realization of the right to self-determination of the Kashmiri people.\nHe said that liberating Kashmiris from Indian occupation was our topmost priority and we would continue to advocate and strive for this just cause.\nHe said that in the face of Indian repression and subjugation, the people of IIOJK have not shown any signs of giving up and we would not give up on their Kashmiri brothers and sisters.\nBoth the leaders expressed their commitment to intensify awareness-raising on the Kashmir issue and continue to mobilise support for the cause both nationally and internationally.",
  "retrievedAt": "2025-08-11T19:51:55.846Z"
}
