{
  "title": "Pakistan’s active participation in UNGA session shows commitment to UN purposes, principles: FO",
  "link": "https://www.app.com.pk/national/pakistans-active-participation-in-unga-session-shows-commitment-to-un-purposes-principles-fo/",
  "date_published": "2020-10-03T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 3 (APP): The Foreign Office on Saturday said that Pakistan’s active and prominent participation in the United Nations General Assembly’s opening session and allied meetings manifested its support and commitment to the UN’s purposes and principles.\nIn a statement, the Foreign Office spokesperson said that Pakistan would continue to participate actively in that endeavour, in cooperation with other member states, to build a world where conflict was outlawed and equitable prosperity for all is pursued in conditions of peace and security.\nHe said as noted by Prime Minister Imran Khan in his address to the General Assembly on September 25 that “the United Nations should be made fully responsive to the challenges of our times.”\nHe said Pakistan participated at the highest level in the opening segment of the UN General Assembly’s annual session from September 21 to October 1, 2020.\nHe said this year’s session was of enhanced significance due to the United Nations 75th anniversary celebrations. The limitations imposed by COVID-19 necessitated the conduct of meetings in a virtual format.\nPrime Minister Imran Khan reaffirmed Pakistan’s commitment to multilateralism; exposed egregious violations of human rights and international law in Indian Illegally Occupied Jammu and Kashmir (IIOJK); called for realization of the Kashimirs’ right to self-determination; and articulated Pakistan’s perspective on a host of contemporary global and regional challenges.\nHe also participated as one of the key speakers in four other high-level events organized on the side-lines, pertaining to poverty alleviation; illicit financial flows; financing for development; and bio-diversity summit.\nForeign Minister Makhdoom Shah Mahmood Qureshi took part in numerous activities including the high-level Plenary meeting of the General Assembly to commemorate the 75th anniversary of the UN and the 25th anniversary of the Fourth World Conference on Women, as well as the Ministerial meetings of SAARC; “Uniting for Consensus” group; and the UN Alliance of Civilizations.\nThe prime minister highlighted the developments in Indian Illegally Occupied Jammu and Kashmir (IIOJK), and demanded the peaceful resolution of the dispute in accordance with UN Security Council resolutions and the wishes of the Kashmiri people.\nHe also shared Pakistan’s perspective on a wide array of issues confronting the international community such as the COVID-19 pandemic; debt relief measures for developing countries; financing for development; climate change; Islamophobia; the rise of extremist BJP-RSS ‘Hindutva’ ideology; the Afghanistan peace process; Palestine; and a comprehensive reform of the United Nations.\nIn order to address the most pressing challenges currently faced by the international community, he offered concrete proposals like creation of at least US$500 billion in new Special Drawing Rights and reallocation of unutilized SDRs to developing countries to allow fiscal space to deal with socio-economic challenges posed by COVID-19.\nHe called for fulfilling the commitments made through the Paris Agreement (on climate change), in particular the commitment to mobilize US$ 100 billion annually as climate finance.\nCalling for universally outlawing willful provocations and incitement to hate and violence, the prime minister urged the UNGA to declare an “International Day to Combat Islamophobia”.\nIn his various engagements at the UNGA, the foreign minister echoed concerns and proposals shared by the prime minister, especially with respect to IIOJK and the growth of Islamophobia worldwide including in Pakistan’s neighbourhood.\nReaffirming Pakistan’s abiding commitment to multilateralism, the foreign minister underscored that Pakistan would continue to play a leading role in advancing the mutually reinforcing goals of peace and security, development, and human rights.\nHe called for strengthening and democratizing the structures and performance of the United Nations.",
  "retrievedAt": "2025-08-11T19:51:55.344Z"
}
