{
  "title": "Govt to spend Rs 7.3 billion to stop locust attacks: Khusro",
  "link": "https://www.app.com.pk/national/govt-to-spend-rs-7-3-billion-to-stop-locust-attacks-khusro/",
  "date_published": "2020-01-30T21:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP):Minister for National Food Security and Research Khusro Bakhtiar Friday told the National Assembly that Rs 7.3 billion would be spent in one and a half year to combat the locust attacks to save the agriculture sector from their devastating effects.\nHe was responding to a calling attention notice of MNA Malik Ehsanullah Tiwana regarding unabated invasion of swarms of locusts on standing crops and trees worth millions of rupees, spread over large areas in Sindh, South Punjab and Khyber Pakhtunkhwa.\nGiving details about the flight pattern of the locust, he said the locust went from Cholistan and Thar deserts in Punjab and Sindh to Balochistan and for the first time it was sighted in March last year.\nLast attack of the locust in Pakistan was in 1993 and after that year, the Plant Protection Department of the federal ministry which dealt with the problem was neglected and its planes and vehicles were in disrepair, he disclosed.\nHe said the Prime Minister had also taken notice of the situation and called the representatives of the federal and provincial governments which had come up with a plan of action to be implemented in one and a half year to curb the locust attacks.\nAfter the present attack of locust over an area of 0.9 million hectares, action was taken against the pest over 0.3 million acres and aerial spray was done on 20,000 hectares.\nHe said the district administration, voluntary organizations, aviation division and armed forces were put into operation to combat the attack and save the crop lands.\nThis time the locust swarm had not only spread into areas of Punjab and Sindh but it went further afar in Dera Ismail Khan in Khyber Pakhtunkhwa province, he informed.\nHe said the committee of the National Assembly should help monitor and review the situation arising out of the locust attack and give feedback to the federal government.\nDue to persistent efforts of the government and an early release of Rs 500 million, the crops of rice and cotton were saved from the locust attack, he informed.\nThe minister said the usual entry of the locust from Pakistan to Iran and Oman was delayed for some days due to severe winter weather and climate change but eventually the insects would enter these countries.\nSpeaking on a point of order, MNA Rana Tanveer demanded that a special committee should be formed to ascertain the causes of sugar and wheat crises and reveal names of those responsible for the shortages of these commodities. He said the prime minister had already received a report about the crisis.",
  "retrievedAt": "2025-08-11T18:43:33.394Z"
}
