{
  "title": "PM launches foolproof cash transfer scheme for 7 mln poor women",
  "link": "https://www.app.com.pk/national/pm-launches-foolproof-cash-transfer-scheme-for-7-mln-poor-women/",
  "date_published": "2020-01-31T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP):Prime Minister Imran Khan Friday launched Ehsaas Kafaalat programme to give stipend of Rs 2000 each to seven million poverty-stricken women, through a foolproof and biometric-enabled cash disbursal mechanism, across the country.\n“The foundation of Pakistan as a welfare state is being made here. We have now started moving towards a welfare state. Soon, it will turn into the Pakistan of Quaid-e-Azam and Allama Iqbal,” the prime minister said addressing the launching ceremony of the scheme.\nThe ceremony marked the distribution of the Kafaalat cards among the poorest women who sat beside the prime minister at the venue as per his own desire what the event moderator Senator Faisal Javed said were the only VVIPs of the event.\nSpecial Assistant to Prime Minister (SAPM) on Social Protection and Poverty Alleviation Dr Sania Nishtar, SAPM on Information and Broadcasting Dr Firdous Ashiq Awan, other cabinet members, parliamentarians, diplomats and people from cross sections of the society attended the event.\nUnder the programme, each beneficiary woman would get a bank account and smart phone as part of the initiative to empower women through their formal interaction with the economy and digital inclusion.\n“The smart phones would help educate the children of the poor women from their childhood. This will bring about a new revolution,” the prime minister remarked.\nHe said seven million women would benefit from the scheme while another six\nmillion families had already been give health insurance card what was the biggest\nachievement of the current government.\nHe said within fortnight, the government would launch another programme under\nEhsaas umbrella, to transfer assets to the poor women like cows, hens or others\nto help them earn their livelihood.\nThe prime minister congratulated Dr Sania Nishtar for successfully launching the\nscheme, amid immense pressure from the government which desired to utilize\nRs 200 billion allocated for its anti-poverty initiative without any delay.\nHe lauded her for developing a system based on data analytics to ensure that\nthe government’s assistance reached only to the deserving citizens, not the rich\nones, as the government had recently detected and delisted above 800,000 ineligible\npeople who had been receiving the cash assistance, despite having government job,\ncars and having done foreign visits.\nThe prime minister said no anti-poverty initiative could meet success unless it was\ntransparent.\nHe said the beneficiaries of Kafaalat programme would also be able to benefit from\ngovernment’s upcoming ration scheme and other initiatives.\nHe said the initiatives including the student scholarship, youth skill training and\nstart-ups loan programme were solely aimed at uplifting the poor people in true\npursuance of the golden principles of the State of Madinah.\nIn her presentation, Dr Sania Nishtar drew a comparison between Kafaalat\nand Benazir Income Support Programme, saying the former featured a 10-year\nold database, multiple quarterly payment systems, paper-based surveys, sole\nsource contracted banks and being a standalone programme.\nContrarily, the Kafaalat program would provide monthly assistance through\na fully biometric system on point of sales agents with secure gadgets, biometric\nATMs and designated bank branches. The beneficiaries had been identified\nthrough a door-to-door digital survey plus data analytics, desk and web surveys.\nContrary to BISP, the Kafaalt beneficiaries would be able to avail all the\nEhsaas graduation opportunities.\nShe said for the first time, the poor people would be able to get government\nassistance on demand as they would not have to wait for 10 years to enlist\nthemselves in the poverty survey, rather they could get themselves registered\nany time at the NADRA Desk Registration Centers to be established in each\nTehsil.\nShe said the enrollment of one million families in 70 districts had been started\nwhich would start receiving stipend from February to March this year. Other\ndistricts would be added by end of the year while more beneficiaries would be\nincluded through desk registration over the course of the year.\nDr Sania Nishtar said under Ehsaas Governance and Integrity Policy, maximum\nmeasures were being taken to ensure transparency in the programme through true\nimplementation of the whistleblower law, audit and data usage.\nShe said contrary to the previous governments, the prime minister had taken a\nbold decision of replacing his photo from Kafaalat Card with that of Quaid-e-Azam and\nresolved to eliminate corruption and political interventions from the social protection\ninitiatives.",
  "retrievedAt": "2025-08-11T18:43:21.547Z"
}
