{
  "title": "Minister Jamal Shah shares plan of Second CPEC Cultural Caravan with Ambassadors of Central Asian States",
  "link": "https://www.app.com.pk/national/minister-jamal-shah-shares-plan-of-second-cpec-cultural-caravan-with-ambassadors-of-central-asian-states/",
  "date_published": "2024-01-23T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Federal Minister for National Heritage and Culture, Jamal Shah, on Tuesday held a meeting with Ambassadors of Central Asian States Russia and China to discuss the initial plan of second  ‘CPEC Cultural Caravan 2024, aimed at strengthening cultural bonds between Pakistan, China, Russia and Central Asian States.\nThe high level meeting held here at Pakistan National Council of the Arts (PNCA) attended by Ambassador of Russia to Pakistan His Excellency Albert Khorev, Embassy of China Counselor Bao Zhong, Ambassador of Turkmenistan to Pakistan H.E. Mr. Atajan Movlamov, Ambassador of Kazakhstan to Pakistan H.E.Yerzhan Kistafin,  Ambassador of Kyrgyzstan H.E. Totuiaev Ulanbek Asankulovich, Ambassador of Uzbekistan H.E. Aybek Arif Usmanov and Ambassador of Azerbaijan to Pakistan H.E. Khazar Farhadov.\nFederal Secretary National Heritage and Culture Humaira Ahmed, Advisor National Heritage and Culture Muhammad Kashif Irshad, Director General PNCA Ayuob Jamali, Executive Director Lok Virsa Uzair Khan and Chairperson Pakistan Academy of Letters (PAL) Dr Najeeba Arif were also present on the occassion.\nAddressing the diplomats, Federal Minister for National Heritage and Culture Jamal Shah apprised that his ministry plans to organize a second China Pakistan Economic Corridor (CPEC) Cultural Caravan aimed at promoting economic ties and strengthening cultural bonds between Pakistan, China and the Central Asian States.\nJamal Shah said that CPEC Cultural Caravan will commence its journey from Xi’an, China, and traverse through Kyrgyzstan, Tajikistan, Uzbekistan, Turkmenistan, Iran, UAE, Gwadar, Karachi, ultimately concluding in Islamabad.\n“Cultural Caravan to Document Diverse Lives on CPEC, Silk Route” he added.\nThis cultural excursion will document the experiences and stories of the people along the China-Pakistan Economic Corridor and the Silk Route, covering Central Asian countries.\nHe said that the Cultural Caravan will be composed of diverse groups of Pakistani, Chinese and Central Asian artists, musicians, photographers, anthropologists, writers and filmmakers.\nHe said that the CPEC Cultural Caravan aims at promoting dialogue, cultural exchange, understanding, trust and respect between the nations, adding that it will also strengthen international relations in terms of protection of cultural heritage, cultural and academic exchange.\nHe said that CPEC Cultural Caravan will also strengthen and support the promotion of arts and creative industries on the caravan route in fields of culture, history, education, and economic and heritage tourism. He said that the idea is this that cultural excursion under the title ‘CPEC Cultural Caravan 2024’ will be composed of diverse groups of Pakistani, Chinese and Central Asian artists, musicians, photographers, anthropologists, writers and filmmakers.\nThe caravan will bring together a diverse group of artists, musicians, photographers, anthropologists, writers, and filmmakers from Pakistan, China, and Central Asia. In their separate remarks, the Ambassadors commended the idea of joint CPEC cultural caravan. They said that it was very important to promote people to people contacts by organizing such mega cultural activities. They assured full support in convening this important event and agreed to continue work on the overall plan of Cultural Caravan 2024.\nEarlier, Secretary National Heritage and Culture Humaira Ahmed in her welcome note, highlighted the importance of CPEC cultural caravan. She said that this will be second episode of CPEC Cultural Caravan. The meeting was aimed at sharing the overall concept of the Cultural Caravan.\nThe meeting was moderated by Advisor National Heritage and Culture Muhammad Kashif Irshad.  A documentary showcasing first CPEC Cultural Caravan work of professional photographers and artists of Pakistan and China was also screened. The meeting concluded with flute performance by Salman Adil.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:50:25.785Z"
}
