{
  "title": "Shahid Ashraf Tarar reviews arrangements for upcoming polls",
  "link": "https://www.app.com.pk/national/shahid-ashraf-tarar-reviews-arrangements-for-upcoming-polls/",
  "date_published": "2024-01-23T17:25:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 23 (APP):Federal Minister for Communications, Railways and Maritime Affairs Shahid Ashraf Tarar on Tuesday, called for thorough compliance with directives of the Election Commission of Pakistan to ensure free, fair and transparent polls in a secure and organized manner.\nHe was presiding over a meeting of a high-level committee to oversee security for the upcoming general elections scheduled on February 8, 2024.\nThe committee was constituted by the caretaker Prime Minister Anwaar ul Haq Kakar to ensure the security and peaceful conduct of the 2024 general elections, said a statement issued here.\nChief Secretary Sindh, Dr. Muhammad Fakhr e Alam, caretaker Provincial Home Minister Brigadier (retd) Haris Nawaz, Additional Chief Secretary Home Muhammad Iqbal Memon, Director General Pakistan Rangers Sindh Major General Azhar Waqas, Inspector General Police Riffat Mukhtar Raja, and representatives of Pakistan Army attended the meeting.\nThe meeting reviewed in detail overall arrangements particularly security measures envisaged for the upcoming general elections. Sindh CS briefed the meeting on administrative measures while DG Rangers and IG Sindh provided insights into the security situation and preparedness.\nFederal Minister Shahid Ashraf Tarar emphasized that the primary objective of the committee is to ensure the conduct of the 2024 general elections in a secure and peaceful environment.\nHe informed about the establishment of an Election Cell within the Federal Interior Ministry for monitoring of security arrangements and law and order situation during the general election 2024 with representation from all law enforcement agencies.\nHe underscored the significance of adhering to the directives of the Election Commission of Pakistan for ensuring free, fair and transparent polls in a secure and organized manner.\nDuring the meeting, Chief Secretary Sindh presented detailed information on the preparations for the general elections, highlighting the damages caused to schools in the province due to recent floods. He informed that funds amounting to Rs 1.5 billion were allocated for the repair of these schools. Additionally, Rs 3 billion were allocated for missing facilities in polling stations for the elections.\nChief Secretary Sindh also informed that 4,000 highly sensitive polling stations would be equipped with CCTV cameras funded by the provincial government.\nSpeaking on security matters, DG Rangers Sindh Major General Azhar Waqas informed that 10,000 Rangers personnel will be deputed on security duties during the general elections. IG Sindh, in his briefing, stated that 122,000 police officers would be deployed for security purposes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:50:23.507Z"
}
