{
  "title": "PARC using tech to empower farmers, agriculture sector: Chairman",
  "link": "https://www.app.com.pk/national/parc-using-tech-to-empower-farmers-agriculture-sector-chairman/",
  "date_published": "2024-01-23T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Chairman of the Pakistan Agricultural Research Council (PARC), Dr Ghulam Muhammad Ali on Tuesday said that technology is rapidly reshaping agriculture in Pakistan and creating more investment opportunities which would lift rural areas and empower traditional farming techniques.\nTalking to the PTV news channel, he said that PARC continued leading capacity-building programs for individuals engaged in agriculture across various regions of the province on modern agricultural techniques.\n“The agriculture sector needs investment. Connecting agriculture with technology is the need of the hour,” he said.\n“There is a need to improve agricultural productivity through farm mechanism and promote agricultural credit for rural economies, especially to purchase modern technologies,” he added.\nPARC has also been organizing training programs to provide knowledge on the application of gain-sharing tools and share best practices to make agribusiness enterprises more productive and profitable.\nHe also stressed that the farmers should not only adopt this technology but they should also create awareness among other farmers and guide them properly regarding the hydroponics technology to avoid food shortages in our country in the future.\nReplying to a question, he said that agricultural research can play a major role in improving the productivity of these crops to enhance their profitability for the farmer, adding that it is the need of the hour to strengthen industry-academia ties on promote modern agricultural technology for which agriculture scientists will also have to make every effort to solve the problems of farmers.\nPARC had also started developing new varieties of high-yielding seeds of major and minor crops to enhance per-acre crop output to tackle the growing demand for food, he added.\nPARC also stressed that every scientist should contribute to promoting research culture in the council, he mentioned.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:51:25.486Z"
}
