{
  "title": "SC summons Qasim Suri in election rigging case",
  "link": "https://www.app.com.pk/national/sc-summons-qasim-suri-in-election-rigging-case/",
  "date_published": "2024-01-23T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):The Supreme Court of Pakistan on Tuesday summoned former deputy speaker national assembly and Pakistan Tehreek e Insaf (PTI) leader Qasim Suri in person next month in an appeal against orders of re-election in NA-265.\nThe court sought a report from the Registrar’s Office within three weeks on non-fixation of Qasim Suri’s case for long time after the issuance of a stay order against the verdict of the election tribunal.\nThe bench also served notices to Lashkrai Raisani and summoned him on the next date.\nA three-member bench headed by Chief Justice of Pakistan Qazi Faez Isa heard the appeal of Qasim Suri challenging the decision of the election tribunal in which it has ordered for re-election in his constituency in 2018.\nDuring the court proceeding, the CJP questioned the lawyer that asked when Suri dissolved the assembly if he was still on stay. Qasim Suri dissolved the assembly illegally, the decision of the 5-member bench recommended high treason proceedings against Qasim Suri under Article 6, he said.\nThe CJ asked that why not action under high treason law should be taken against him. CJ Faez Isa remarked that after obtaining the stay order, the case was not allowed to be fixed for hearing, the internal system of the court was manipulated.  CJP said that we will inquire how the case was clubbed and why it was not fixed for hearing for so much time.\nComplainant Lashkri Raisani’s lawyer said that Qasim Suri had been enjoying immunity or incentives as a parliamentarian on a stay order.  Later, further hearing of the case was then adjourned for one month with the above instructions. It may be mentioned here that Qasim Suri was accused of rigging the elections in NA-265 during the 2018 polls. The election tribunal on the petition of Lashkri Raisani had declared the elections void and ordered for re-elections.\nQasim Suri obtained a stay order from the top court against the decision of the election tribunal and restored Suri as a member national assembly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:50:51.139Z"
}
