{
  "title": "49 foreign journalists issued visas so far for coverage of upcoming elections : Solangi",
  "link": "https://www.app.com.pk/national/49-foreign-journalists-issued-visas-for-feb-8-elections-coverage-so-far-solangi/",
  "date_published": "2024-01-23T09:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Tuesday that certain elements were just harping on the rumours that “no foreign journalists and observers would be arriving Pakistan for coverage of upcoming general elections” which was contrary to facts.\nHe was addressing a press conference flanked by Secretary Information and Broadcasting Shahera Shahid, Executive Director General External Publicity Wing Ambreen Jan, Principal Information Officer Dr Tariq Mehmood and Director General Radio Pakistan Saeed Sheikh.\nMany international media persons had applied for visas to cover the elections, Murtaza Solangi said adding that 49 visas (for Islamabad Lahore and Karachi) had been issued as of today while 32 requests were under process with many other requests were still being received from different stations of the world.\nHe said that these 32 visa applications for coverage of elections were under process which had been received in Pakistan High Commission New Delhi and were being processed due to manual visa system in India for issuing visas.\nHe said that so far 174 requests for ECP Accreditation Cards had been received and processed for foreign media representatives and their associated Pakistani staff who were based in Pakistan.\nResponding to a question by media, he said so far 25 applications were under process from the UK alone, 08 from Russian Federation, 13 from Japan, 02 from South Africa while 05 from Commonwealth under the category of International Observers.\nAccreditation Cards had also been processed for local Pakistani media houses, Murtaza Solangi said and added so far 6,065 journalists had been processed including 1200 from Lahore, 1470 from Karachi, 1050 from Peshawar, 600 from Quetta, 355 from Hyderabad, 250 from Faisalabad and 290 from Multan.\nThe cases where the media intends to go and cover other cities, besides Islamabad, Lahore and Karachi, would be examined on case-to-case basis, in consultation with relevant ministries, he said.\nThe minister said that even though the last date for application for visas of January 20 had already passed, the relevant institutions of the Election Commission of Pakistan and Ministry of Information were still receiving visa requests, which would be processed on case-to-case basis.\nExecutive Director General EP Wing, Ambreen Jan said visa applications for election coverage were received from 14 countries. She added in total 81 foreign journalists applied for visas, out of which 49 had been issued visas while others were under the process.\nShe said that a Code of Conduct for international media and Observers has been issued by the ECP which had been shared with them. She said that the number of applications for International Election Observers was 55.\nTo a question she said Press Information Department would set up a media cell for election coverage to provide facilities to the media and a 24-hour election cell will also be operational in the EP Wing to provide facilities to foreign journalists.\nReplying to a question, Murtaza Solangi said that it was the responsibility of the state to protect its citizens and it would take necessary measures to provide security to foreign journalists and observers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:51:58.861Z"
}
