{
  "title": "More Brits in Pakistan can now vote in UK Parliament elections",
  "link": "https://www.app.com.pk/national/more-brits-in-pakistan-can-now-vote-in-uk-parliament-elections/",
  "date_published": "2024-01-23T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): A recent change in UK law has made British citizens living abroad eligible to vote in United Kingdom Parliament elections.\n“British citizens living abroad are now eligible to register to vote in UK general elections, regardless of how long they’ve been living outside the UK” said a news release issued here on Tuesday.\nThe British High Commission Islamabad is actively supporting the awareness campaign initiated by the UK’s Electoral Commission, urging British residents in Pakistan to check their eligibility. The Electoral Commission is an independent and impartial organization overseeing elections in the UK.\nUnder the new law, individuals who have previously lived in or been registered to vote in the UK now have the right to vote in UK Parliament elections.\nRegistration can be done online at www.gov.uk/registertovote, and registrants will need to confirm their personal information every three years.\nBeing on a UK electoral register also qualifies individuals as permissible donors to UK political parties and campaigners.\nThe spokesperson for the British High Commission said, “A change in UK law means that more British citizens living abroad are now eligible to vote in UK Parliament elections. Eligible people must be made aware of the changes so that they can register to vote and cast a ballot when the time comes.”\nThe spokesperson encouraged those who used to live in the UK or know anyone who did to spread the information about their eligibility to participate in the next UK general election. Registration takes only five minutes and can be completed online at gov.uk/registertovote. Additionally, individuals can now apply online to vote by post or proxy.\nApplicants are required to provide details of their last registered or resident address and the time they were last registered. Local authorities must be able to verify the applicant’s identity and past connection to the area.\nMore information is available on the Electoral Commission’s website, and voters living overseas can find contact details for the relevant local council by entering the postcode of the last place they lived in the UK, using the Commission’s postcode lookup tool.",
  "retrievedAt": "2025-08-10T23:51:20.844Z"
}
