{
  "title": "Sargodha Citrus Fest kicks off in capital; captivates fruit enthusiasts",
  "link": "https://www.app.com.pk/national/sargodha-citrus-fest-kicks-off-in-capital-captivates-fruit-enthusiasts/",
  "date_published": "2024-01-23T09:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): The first-ever two-day `Sargodha Citrus Fest’ kicked off at COMSTECH on Tuesday displaying around 45 varieties of citrus fruit and its products attracting a large number of visitors.\nThe fest is being organized by the University of Sargodha and COMSTECH jointly where the visitors enjoy the products, especially citrus fruit-made cakes, juices, desserts, candies and green tea besides a variety of citrus fruit.\nThe varieties of citrus fruit including Rangpur Lime, Carrizo Citrage, Gada Dahi, Rangpur, Gilgil, Mitha, Pishawari Mittha, Kinnow, Seedless Lemon, Jati Khati, Bara Masii, Ornad Blood, Mosambi, Murcott and many others were exhibited through several stalls.\nThe citrus fest is set to captivate visitors especially fruit enthusiasts of all ages on Wednesday too offering citrus-infused culinary delights and interactive exhibits.\nThe staff of the University of Sargodha briefed the visitors about the products made from citrus fruit and offered them to taste.\nSpeaking on the occasion, the Vice Chancellor of the University of Sargodha, Prof. Dr. Qaisar Abbas welcomed the participants of the inaugural ceremony and said that this is a first-ever citrus exhibition being organized in Islamabad.\nProf. Qaisar Abbas shed light on the brief history of the University of Sargodha and said that the uniqueness of this university is that it has faculties of both medical and agriculture.\nHe informed that they have started a project to work on the scientific properties of the citrus fruit which is a novel initiative.\nProf. Abbas said that 45 varieties of citrus fruit have been displayed in today’s exhibition and promised to display more varieties in next year’s exhibition.\nHe also recommended that although Pakistan is blessed with huge varieties of citrus fruit however there is a need to develop value-added products from this magic fruit to export.\nCoordinator General COMSTECH, Prof. Dr M. Iqbal Choudhary said that the University of Sargodha is playing a very important role in being a member of the COMSTECH Consortium of Excellence and has offered fellowships to the students from OIC states, and many scholars have been placed in the University of Sargodha.\nProf. Choudhary said that citrus is a very highly nutritional fruit and stressed the need to explore the medicinal properties of this fruit.\nHe appreciated the University of Sargodha’s initiative to explore the medicinal properties of this fruit. He informed that COMSTECH has established a citrus processing unit in Nigeria.\nProf. Choudhary thanked the diplomatic community for patronizing COMSTECH activities and initiatives.\nProf. Dr. Irfan Ullah, the Citrus fruit expert, gave a comprehensive presentation on the nutritional importance of citrus fruit.\nHe also talked about the challenges being faced by the farmers in the cultivation and gave recommendations to overcome those challenges.\nHe informed that the cultivation area and the share of provinces have been decreasing. He recommended establishing a citrus market, an expo centre and a dry port to facilitate the export of this magic fruit.\nAmbassadors and diplomats from Sudan, Yemen, Iran, Azerbaijan, Palestine, Kyrgyzstan, the Turkish Republic of Northern Cyprus, Kenya, and Russia participated in the inaugural ceremony.  Advisor COMSTECH, Murtaza Noor conducted the proceedings of the inaugural ceremony.",
  "retrievedAt": "2025-08-10T23:51:35.219Z"
}
