{
  "title": "PM resolves to continue operation against Fitna-al-Khawarij till complete eradication",
  "link": "https://www.app.com.pk/national/pm-resolves-to-continue-operation-against-fitna-al-khawarij-till-complete-eradication/",
  "date_published": "2024-09-06T17:49:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Sep 6 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday reaffirmed his government’s unwavering commitment to combating terrorism, pledging to continue the ongoing operation against Fitna-al-Khawarij until their complete eradication.\n“All our armed forces and law enforcing agencies will continue their operation for which there is a national consensus,” he said while addressing a ceremony held here at General Headquarters (GHQ) in connection with Defence Day.\nPaying rich tributes to the valiant sons of soil and brave heroes of Armed Forces who fearlessly fought, and defeated the enemy that attacked our motherland across the international border on 6 September 1965.\nDespite their numerical advantage, the prime minister said the enemy designs were thwarted by the valiant Armed Forces and were handed an unforgettable defeat, on all fronts.\nHe saluted the families of Shuhada, whose immense resilience and strength continued to inspire the nation.\nThe prime minister emphasized that divisions within the nation posed threat to the country’s integrity and any movement in the country aimed at weakening the state will not be tolerated at any cost.\n“Abuse or bullets are not solution to the issues,” he said stressing the need of unity among the nation.\nThe prime minister said all Pakistanis were responsible to ensure development, peace and stability in the country. “We might be in different fields but our goal is only one that is development, integrity and security of Pakistan.”\nHe said Pakistan was a peace loving country. “We have proved that Pakistan does not have aggressive designs against its neighbors.”\nHe said Pakistan was playing positive role of promoting regional and global peace.\n“The prosperity always comes with peace, we desire respectful and peaceful relations with regional countries, but we will never compromise on our national interests, respect and independence,” the prime minister added.\nHe said recalled “we have defeated our enemy’s evil designs for multiple times but their evil intentions were still a big threat to Pakistan’s security.\nAs regards the issue Kashmir, the prime minister said non-resolution of the Jammu & Kashmir dispute was hampering the pace of positive development in the region. “Kashmir is the unfinished agenda of partition that needs immediate settlement as per the aspirations of the people of Kashmir and according to the relevant UN Security Council resolutions through an impartial plebiscite. At the same time, roots of terrorism stemming from our neighbors need to be curbed in our common interest,” he added.",
  "retrievedAt": "2025-08-10T20:49:42.071Z"
}
