{
  "title": "ISSI commemorates Defence Day",
  "link": "https://www.app.com.pk/national/issi-commemorates-defence-day/",
  "date_published": "2024-09-06T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):The Arms Control and Disarmament Centre (ACDC) at the Institute of Strategic Studies Islamabad (ISSI) organized a ceremony to commemorate Pakistan Defence Day.\nThe thematic focus of the event was on “Pakistan Strategic Defence: A Journey to Ensure Credible Deterrence.”\nCommencing with the national anthem, the proceedings were attended by the ISSI Research faculty, interns and students, a news release said.\nDG ISSI Ambassador Sohail Mahmood, in his remarks paid rich tributes to the Pakistan Armed Forces and paid homage to the martyrs who made the ultimate sacrifice while defending the country.\nHe stated that Pakistan, by virtue of its geography, has always faced complex security challenges. It was a region where the pursuit of peace and security demanded constant vigilance and readiness. He added that over the past 77 years, Pakistan had navigated through turbulent waters, adapting to evolving threats and challenges.\nHe underscored that Pakistan’s journey in strategic defence had been one of perseverance, innovation, and determination. Further, the spirit of the nation was never dampened, no matter what the odds. The nation had abiding faith in what Quaid-e-Azam Muhammad Ali Jinnah had said: “There is no power on earth that can undo Pakistan. Over the decades, Pakistan has built a credible deterrence capability, ensuring that no one can threaten its existence. From strengthening our conventional forces to developing a robust nuclear deterrent, our defence strategy evolved to meet the changing dynamics of regional and global security.”\nHe stressed the importance of renewing the commitment to ensure that Pakistan remains strong, secure, prosperous, and on-track to realize the Quaid’s vision.\nHe concluded by underscoring that with unity, faith and discipline, we will continue to build on the legacy of our founding fathers, honour the sacrifices of our martyrs, and bequeath a better Pakistan to our succeeding generations.\nEarlier, Malik Qasim Mustafa, Director ACDC, stated that the nation commemorates this national day as one of the proudest moments in Pakistan’s history when Pakistani soldiers sacrificed their lives to safeguard our freedom and protect the homeland.\nSardar Jahanzaib, Research Associate ACDC, gave a presentation on the event’s theme. He outlined the key security challenges faced by Pakistan since its inception.\nHe emphasized Pakistan’s adoption of “Credible Minimum Deterrence” following India’s nuclear tests and elaborated on the evolution of Pakistan’s nuclear doctrine in response to the Indian Nuclear Doctrine of 2003, India’s Cold Start Doctrine of 2004, and the development of India’s second-strike capability with nuclear submarines.\nHe detailed Pakistan’s “Full Spectrum Deterrence” to ensure comprehensive security at tactical, operational, and strategic levels.\nParticipants appreciated the sacrifices of the Pakistan armed forces and added that there was no compromise on territorial integrity and sovereignty. They also highlighted the importance of national unity, social cohesion, economic strength, and the sacrifices of ordinary Pakistanis.\nParticipants also discussed the ideological aggression Pakistan faces from the adversary as part of hybrif warfar, which needs to be countered.\nIn his remarks, Ambassador Khalid Mahmood, Chairman BoG ISSI, stated that today security is an all-embracing concept encompassing territorial integrity, safeguarding ideological frontiers, and achieving economic security. As a nation, we have the responsibility to meet these challenges.\nThe event concluded with dua for the shuhada.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:50:57.183Z"
}
