{
  "title": "Returning Pakistani workers can claim unclaimed insurance benefits",
  "link": "https://www.app.com.pk/national/returning-pakistani-workers-can-claim-unclaimed-insurance-benefits/",
  "date_published": "2024-09-06T07:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP): Pakistani workers who have completed their employment in South Korea are missing out on insurance benefits owed to them can claim insurance benefits.\nPakistan Employment Permit System (EPS) Center is helping workers recover unclaimed funds, but many are unaware of how to claim these benefits.\nThe Pakistan EPS Center, led by Director Kim Ki-wook, is offering guidance to workers who have returned to Pakistan after working in South Korea under the Employment Permit System (E9), information shared by the Korean embassy.\nMany of these workers have completed their maximum stay of four years and ten months, but they have not claimed their insurance benefits. The benefits include ‘departure guarantee insurance’ and ‘return cost insurance.’\nThese benefits, referred to as “dormant insurance,” remain unclaimed for several years. Dormant insurance occurs when the policyholder does not collect the insurance money within three years after the reason for payment arises.\nThe money remains with the insurer, waiting to be claimed. For many returning workers, this is the case for their departure and return expenses.\nThe Pakistan EPS Center is now reaching out to these workers to help them access their unclaimed insurance funds. However, the process has become challenging. Many workers have either changed their contact details or moved, making it difficult for the center to reach them individually.\nTo address this issue, the EPS Center has partnered with the Overseas Employment Corporation (OEC) in Pakistan. Together, they have posted the names of workers eligible for dormant insurance on the OEC website. Workers can check their eligibility by visiting the OEC’s homepage. If eligible, they can apply for their insurance by sending the necessary documents via registered mail to the Pakistan EPS Center.\nIn addition, workers who have returned from South Korea recently, but have not yet applied for their insurance, can also apply directly to the insurance provider, Samsung Fire & Marine Insurance.\nBy following the instructions on the OEC website and preparing the required documents, workers can claim their benefits with the help of the Pakistan EPS Center.\nThis initiative by the EPS Center aims to ensure that returning workers do not miss out on the money they are entitled to.\nHowever, the workers must act promptly and check their status on the OEC website to claim their insurance funds.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:49:20.067Z"
}
