{
  "title": "Aurangzeb meets family of Shaheed L/NK Waqar, pays tribute to martyrs",
  "link": "https://www.app.com.pk/national/aurangzeb-meets-family-of-shaheed-l-nk-waqar-pays-tribute-to-martyrs/",
  "date_published": "2024-09-06T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): Minister for Finance and Revenue Senator Muhammad Aurangzeb on Friday visited the residence of Shaheed Lance Naik (L/NK) Waqar Hussain Shah, who laid down his life in the line of duty, defending the nation with unparalleled bravery and dedication.\nDuring the visit, the minister met with the martyr’s widow Sania Nazir and their children, extending his deepest condolences and expressing the nation’s immense pride in the valor and sacrifice of Shaheed Waqar, a news release said.\nHe said the entire nation stood in gratitude and solidarity with the families of those who have given their lives for Pakistan.\nThe minister remarked, “Our martyrs are the pride of the nation, and their sacrifices serve as a beacon of courage and patriotism for generations to come. The bravery of heroes like Shaheed Waqar Hussain Shah will forever be remembered, and the nation is indebted to their service.”\nSania Nazir expressed her gratitude for the minister’s visit, reiterating her commitment to raising their children in the spirit of patriotism and service to the country.\nThe children of Shaheed Waqar were assured of continued support and recognition by the government for their father’s supreme sacrifice.\nMuhammad Aurangzeb also commended the Pakistan Army and other security forces for their unwavering commitment to safeguarding the nation’s sovereignty and ensuring peace within the region.\nHe emphasized that the sacrifices of martyrs were a reminder of the enduring strength and resilience of Pakistan’s military and the spirit of its people.\nHe offered Fateha and prayed for Shaheed Waqar Hussain Shah and all martyrs of the Pakistan Armed Forces, whose legacy continued to inspire the nation.",
  "retrievedAt": "2025-08-10T20:50:27.010Z"
}
