{
  "title": "NDRMF preparing application to safe school from natural disasters",
  "link": "https://www.app.com.pk/national/ndrmf-preparing-application-to-safe-school-from-natural-disasters/",
  "date_published": "2024-09-06T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):The National Disaster Risk Management Fund (NDRMF) in partnership with the Ministry of Federal Education and Professional Training, is taking a significant step towards safeguarding educational institutions across Pakistan by developing the NatCat Safe School Application.\nAccording to the Education Ministry, this pioneering digital tool aims to enhance the safety and resilience of school infrastructures against natural disasters.\nNDRMF on Friday in that regard presented the first live demo of the NatCat Safe School Application to Federal Secretary Education, Mohyuddin Wani, at ICMG F-8/1 Islamabad. The demo showcased the app’s potential to revolutionize school safety standards.\nFollowing the demonstration, the Federal Secretary congratulated NDRMF for this forward-thinking initiative, recognizing its capacity to mitigate risks and protect students and school staff from disasters.\nHe commended the potential of the app to strengthen educational safety standards and lauded the use of innovative technologies to bolster educational infrastructure resilience across the country.\nThe NatCat Safe School Application leverages data from a range of stakeholders, including teachers, parents, and students, combined with risk and loss information from the NatCat Model. It identifies vulnerabilities in schools and assesses risks posed by natural hazards such as earthquakes, floods, and landslides.\nBy gathering and analyzing data on school buildings and their surroundings, the app empowers authorities to develop and implement retrofitting plans to enhance the resilience of educational facilities.\nThe application offers two distinct interfaces: Mobile Application Interface that is designed for on-the-go reporting and data submission by users, allowing for real-time risk identification. Expert View Interface that provides education authorities with the ability to evaluate disaster scenarios, simulate risks using NatCat data, and generate actionable insights for disaster mitigation.\nCEO NDRMF Mr Bilal Anwar mentioned that “The NatCat Safe School Application represents a significant leap forward in our efforts to build resilient educational institutions. By using cutting-edge data and real-time reporting, this tool will enable us to protect schools from the growing threats posed by natural disasters. Our goal is to ensure that every school in Pakistan is equipped to safeguard its students, teachers, and staff.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:50:34.150Z"
}
