{
  "title": "Senators demand capping of medical tests prices at private labs",
  "link": "https://www.app.com.pk/national/senators-demand-capping-of-medical-tests-prices-at-private-labs/",
  "date_published": "2024-09-06T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):The Senators from the opposition benches on Friday demanded the Upper House of the Parliament to direct the federal government to regulate the medical tests’ prices at private laboratories within the limits of Islamabad Capital Territory (ICT).\nSenator Mohsin Aziz of Pakistan Tehreek during the fifth meeting of the 342nd Senate session here at calling attention notice to draw attention of the Minister for National Health Services, Regulation and Coordination towards the matter of public importance regarding disparities in charges for the lab tests among various private laboratories operating in Islamabad.\nAt his calling attention notice, Senator Mohsin Aziz said when the elected representatives and the government had no concern towards public welfare then such situations take place.\nThe government had spent Rs18 billion for metro bus project in Islamabad, whereas the healthcare services were shrinking with every passing year amid exponentially rising population of the federal capital, he added.\n“The capital was 100,000 masses city in 1972 and the only healthcare facility Poly Clinic Hospital was established and in 1985 PIMS was established when the population had reached 400,000-500,000 masses and today it stood at 2.5 million people but the healthcare facilities are the same,” Senator Mohsin regretted.\nHe mentioned that the patients were not treated accordingly in the federal capital of 35 kilometers area where institutions were being created rapidly but it also demanded us to control our expenses.\n“There are different labs in the city. A simple HRCT test cost ranges within Rs12,000, Rs10,000 and Rs8,000, an ordinary lipid profile test costs Rs2,400, Rs2,600, Rs3,000, urine test for Rs800, Rs280, and Rs1300, and CRP test Rs 400, Rs2,500, Rs2,000, Rs2,800, and Rs1,800,” he said.\n“If this city is for the elite only then there is no issue and therefore an aura has been established that it is for the elite. But the middle class people are not able to afford such tests,” Senator Mohsin said.\nThe doctors, he alleged that were running a commission business as they used to refuse to accept the tests other than the labs they prescribe to the patients and in this scenario only mafias can prevail.\nHe underlined that to establish a hospital is one thing, regulating the facility is other and to enforce the government’s writ is another thing.\nMinister for Law and Justice, Senator Azam Nazeer Tarar said the private sector services have their own criterion and prices. “This is market competitivity which is like Suzuki and Mercedes car prices cannot be same. The labs having expensive and hi-tech machinery working state of the art operations like Agha Khan, Shaukat Khanam, and IDC will set prices keeping in view the expensive infrastructure being employed for their services,” he added.\nThe minister while point out to the opposition benches said that they should also commend the government at some occasion for its efforts as Jinnah Medical Tower projected for which the federal government had allocated Rs15 billion.\n“It’s a difficult matter to regulate the prices of lab tests and before that the provinces should be consulted for if they had done capping of prices of lab tests as it will compromise the quality,” he said.\nOpposition Leader in the Senate, Shibli Faraz said it was a critical matter and Pakistani nation that were ailing needed support and there should be some SOPs being set in this regard.\nHe alleged that the House was not taking up such public welfare issues. Shibli urged the chair that the issue should be referred to the committee concerned.\nPresiding Officer, Senator Manzoor Ahmed Kakar while chairing the session referred the matter to the committee concerned.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:51:16.040Z"
}
