{
  "title": "President for stronger Navy to protect Pakistan’s geo-economic interests",
  "link": "https://www.app.com.pk/national/president-for-stronger-navy-to-protect-pakistans-geo-economic-interests/",
  "date_published": "2024-09-06T12:32:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 06 (APP): President Asif Ali Zardari on Friday called for making the Pakistan Navy further stronger in order to protect the geo-economic interests and defend maritime frontiers of the country.\nWelcoming the induction of MILGEM Class Corvette Pakistan Navy Ship (PNS) Babur and Offshore Patrol Vessel PNS Hunain into the Pakistan Navy (PN) fleet, he said that the ships would enable the Navy to perform its ever-growing operational responsibilities.\nThe President expressed these views while addressing the induction ceremony of PNS Babur and Hunain into the Pakistan Navy fleet, here at the PN Dockyard.\nThe ceremony was attended by Deputy Minister of National Defence Turkiye, Bilal Burdali, Chairman Joint Chiefs of Staff Committee, General Sahir Shamshad Mirza, Chief of the Naval Staff, Admiral Naveed Ashraf, senior representatives of construction yards, high-ranking officials of the Armed Forces and the political leadership.\nPNS Babur is a multipurpose ship built and commissioned at Istanbul Naval Shipyard on 23 September 2023. PNS Hunain, an Offshore Patrol Vessel, was built and commissioned at DAMEN Shipyard, Romania on 25 July 2024.\nAddressing the ceremony, the President said that the induction of PNS Babur and Hunain into the fleet was a milestone achievement in fortifying Pakistan’s maritime defence capabilities.\nHe noted that these ships would enhance the operational readiness of the Navy to counter both conventional and asymmetric threats.\nThe President underscored the pivotal role played by the Pakistan Navy in ensuring maritime security, contributing to regional stability, and supporting the country’s economic growth by safeguarding sea lanes of communications.\nHe said that the Pakistan Navy was ensuring the continuous flow of maritime commerce and defending the maritime boundaries, in view of the great potential of the blue economy for country’s economic growth.\nThe President reiterated Pakistan’s resolve to defend its sovereignty, uphold peace, prosperity and stability, and defend the motherland at all costs.\nHe said that Defence and Martyrs’ Day reminded of the courage, unity, and determination of the Armed Forces and citizens who defended the nation against external aggression. He paid rich tributes to the martyrs who laid down their lives in defence of the motherland.\nAcknowledging the collaborative efforts involved in the construction of the newly inducted ships, the President expressed his gratitude to the teams from Pakistan, Turkiye and the Dutch DAMEN Shipyard for their dedication and hard work.\n“These ships symbolize our strong friendship with Turkiye and our trust in the Dutch DAMEN Shipyard in Romania,” he remarked. He added that the development would further boost the Navy’s ability to defend the country’s maritime boundaries.\nThe President also extended special congratulations to the Commanding Officers and crew of PNS Babur and PNS Hunain, wishing them success in their future endeavours.\nIn his welcome address, the Chief of the Naval Staff termed the induction of the two ships in the PN Fleet as a major milestone in the capacity building of the PN Fleet.\nHe acknowledged the government’s full support for providing the best possible resources for this purpose. He also acknowledged the professional competence of M/s ASFAT, Istanbul Shipyard, DAMEN Shipyard Galati Romania, and the entire project team for delivering potent ships which showcased the deep-rooted friendship and cooperation between friendly countries.",
  "retrievedAt": "2025-08-10T20:48:52.968Z"
}
