{
  "title": "Delegation of scholars calls on Mohsin Naqvi, Chaudhry Salik Hussain",
  "link": "https://www.app.com.pk/national/delegation-of-scholars-calls-on-mohsin-naqvi-chaudhry-salik-hussain/",
  "date_published": "2024-09-06T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): A delegation of scholars from all schools of thoughts and leaders of other religions, led by Chairman Ruet-e-Hilal Committee Maulana Abdul Khabeer Azad Friday called on Interior Minister Mohsin Naqvi and Federal Minister for Religious Affairs Chaudhry Salik Hussain\nSpeaking to the delegation, Mohsin Naqvi said consultations with scholars and leaders of other religions have been started to eliminate the menace of terrorism in the country.\nHe said, “First and foremost, we all are Pakistanis, and Pakistan comes first.” He emphasized that we need to get out of this menace of terrorism in which we are being pushed into, and with the help of scholars we can get rid of this menace.\nHe stressed that we need to unite as a nation to eliminate terrorism. We need to stop the misuse of Islam and prevent people from being misled into terrorism.\nMohsin Naqvi clarified that anyone who takes up arms against the state is a terrorist, and our religion and constitution also clearly state that anyone who takes up arms against the state is a terrorist.\nHe said that Islam and our country’s law do not allow anyone to be killed without reason. We need to unite against the curse of terrorism for the sake of our country.\nHe said, “We will visit every province, meet chief ministers and scholars, and convey the same message. We will also convey this message to the federal Government, which is working day and night for this purpose.\nInterior minister emphasized that we need to stop the misuse of Islam’s name, and the true leaders of the religion are scholars and spiritual leaders, not those who take up arms against the state.\nHe said that today, we need to convey the message that we are united against terrorism, and the Ministry of Interior and the Ministry of Religious Affairs will provide all possible support in this regard.\nFederal Minister for Religious Affairs Chaudhry Salik Hussain said that we need to save the new generation from guns and the Government, institutions, and scholars need to work together to provide a safe future for the new generation.\nHe said that protection of every Pakistani’s life and property is the responsibility of the state. He further said that the scholars and spiritual leaders should guide the people and raise their voices against those who take up arms against the state.\nAfter the meeting, a joint declaration was approved. All the scholars and spiritual leaders rejected the narrative of extremists and terrorists in the country. The declaration stated that Islam is a religion of peace that teaches respect for humanity and strives for a society which is free from violence.\nThe declaration further stated that in the current situation, interfaith, inter-sect harmony and national unity are essential.\nIslam does not allow anyone to be killed without reason. The declaration praised the sacrifices of the Pakistan Army and stated that the entire nation stands with its brave and courageous armed forces.\nThe declaration also stated that Islam guarantees the rights of minorities, women, and children.\nAccording to the declaration the “Paigham e Pakistan” is the great narrative, which will be made the voice of every household through the pulpit and the mosque. This is the time for unity and cohesion within the country, not division.\nThe meeting was attended by scholars and leaders of various schools of thought, including Maulana Zia-ur-Rehman Imam of Faisal Mosque, Maulana Muhammad Tayyab Qureshi Chief Khateeb of Khyber Pakhtunkhwa, Allama Mukhtar Ahmad Nadeem Chief Khateeb of Punjab, Allama Shabbir Hassan Secretary-General Shia Ulema Council Pakistan, Allama Arif Hussain Waheedi, Mufti Gulzar Ahmed Naeemi, Maulana Tariq Ahmed Alvi, Maulana Sardar Muhammad Laghari, Mufti Farhan Naeem, Maulana Abdul Zahoor Farooqi, Maulana Abdul Aziz, Maulana Haroon-ur-Rashid Balakoti, Allama Sajjad Hussain Naqvi, Allama Mustafa Haider Naqvi, Maulana Hussein Ali, Mufti Yousuf Kashmiri, Maulana Maqsood Ahmed Toheedi, Maulana Abid Israr, Qari Bilal Golravi, Sardar Ranjit Singh Giani, Maulana Ikrarullah Zahid, Maulana Abdul Salam Jalali, Mufti Abu Bakr Sadiq, Allama Saeed Ahmed Awan, Maulana Malik Amjad Awan, Dr. Ershad Ahmed Khan, Sahibzada Atiqullah Mazhar, Bishop Dr. Joseph Arshad, Pir Mumtaz Ahmed Zia Nizami, Maulana Muhammad Iqbal Naeemi, Allama Muhammad Rasheed Trabani, Fahad Jamil, Professor Zafarullah Jan.\nFederal Secretary of Interior, Chief Commissioner Islamabad, Inspector General of Police Islamabad, Deputy Commissioner Islamabad and relevant authorities also attended the meeting.",
  "retrievedAt": "2025-08-10T20:50:10.464Z"
}
