{
  "title": "All is set for formation of new Taliban Govt",
  "link": "https://www.app.com.pk/national/all-is-set-for-formation-of-new-taliban-govt/",
  "date_published": "2021-09-02T19:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP):Taliban Rahbari Shura headed by Amir ul Monineen Mullah Haibat Ullah Akhunzada on Thursday after three-days consultative meeting in Kandahar, approved to form a new government in Afghanistan, expected to be announced after Friday prayers.\nThe sources informed APP that the Taliban can announce formation of new Government of Islamic Emirate of Afghanistan after Friday prayers, however no official statement from the Taliban was made so far.\nTaliban on August 15 without firing a single bullet took control of Afghanistan and had started consultation with former Afghan President Hamid Karzai, chief executive in Ashraf Ghani’s government Abdullah Abdullah and Hizb-i-Islami chief Gulbuddin Hekmatyar for formation of a new government in Afghanistan.\nDuring the first week of Taliban’s takeover and their consultation with various political and ethnic groups, there was a consensus on formation of an inclusive government comprising all political and ethnic groups.\n“Such a government could stop further bloodshed in Afghanistan and steer the war-ravaged country out of the present crisis,” said Gulbuddin Hekmatyar in an exclusive interview with APP in Kabul, a week after the Taliban seized control of the country.\nWhile the Taliban in their initial statement had claimed the government would be inclusive comprising all political and ethnic groups, but their spokesperson later said sharing power was not the group’s priority for now.\nThe Taliban reiterated their pledge to bring peace and security in the country after decades of war.\nMeanwhile, Sher mohammad Abass Stanikzai, deputy leader of the Taliban political office in Doha on Thursday told the foreign media that women and members from all tribes in Afghanistan will be part of the new government set-up.\n“Any person who was part of former Afghan government in the last 20 years will not be included in the new Taliban administration,” he said.\nThe Taliban want to have friendly relations with the world community and the Taliban political office in Doha is in close contact with different foreign countries, he said.\nHe said Kabul airport will be functional in next 48 hours and people with valid travel documents will be allowed to leave the country, adding that it will cost $25 to30 million to renovate the airport.",
  "retrievedAt": "2025-08-11T21:10:14.288Z"
}
