{
  "title": "PM, British Foreign Secretary discuss situation in Afghanistan",
  "link": "https://www.app.com.pk/national/pm-british-foreign-secretary-discuss-situation-in-afghanistan/",
  "date_published": "2021-09-03T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP):British Foreign Secretary Dominic Raab called on Prime Minister Imran Khan here on Friday and exchanged views on the latest developments in Afghanistan as well as bilateral matters and regional and international issues.\nRecalling his telephonic conversation with Prime Minister Boris Johnson, the Prime Minister shared Pakistan’s perspective on the evolving situation in Afghanistan.\nThe Prime Minister underlined the importance of a peaceful, secure and stable Afghanistan for Pakistan and regional stability.\nThe Prime Minister noted that it was critical to stabilize the security situation in Afghanistan, take steps to consolidate peace, and preclude any mass exodus. In this context, preventing humanitarian crisis and stabilizing the economy were the urgent needs, he added.\nThe Prime Minister stressed that the international community should stand in solidarity with the Afghan people, undertake positive engagement, and create incentives for ensuring a peaceful, stable and inclusive polity.\nThe Prime Minister also cautioned against the role of “spoilers”, both inside and outside Afghanistan, which could destabilize the situation.\nThe Prime Minister further sensitized the UK side on the gross human rights violations in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), including the inhuman snatching away of the mortal remains of Syed Ali Shah Geelani, the senior Kashmiri leader.\nOn the bilateral plane, the Prime Minister inter alia noted the long-standing relationship and strong people-to-people ties between the two countries.\nThe Prime Minister shared concerns on the retention of Pakistan on the Red List, causing inconvenience to dual nationals.\nMatters relating to climate change, peace and stability in South Asia, and global geopolitical situation were also discussed.",
  "retrievedAt": "2025-08-11T21:10:09.441Z"
}
