{
  "title": "President for adopting a holistic approach to make elections transparent, secure",
  "link": "https://www.app.com.pk/national/president-for-adopting-a-holistic-approach-to-make-elections-transparent-secure/",
  "date_published": "2021-09-03T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Sep 3, (APP): President Dr Arif Alvi Friday urged the need to adopt a holistic approach by reforming all stages of the electoral process to make the upcoming elections more transparent, secure and impartial.\nHe said that it was the national obligation of all political parties and other concerned stakeholders to make collective efforts for strengthening the electoral system in the country.\nHe also called for accelerating efforts to ensure the inclusion of Overseas Pakistanis in the elections through the mechanism of i-voting so as to enable them to exercise their right to vote. The President made these remarks during a meeting about the electoral reforms process, at Aiwan-e-Sadr.\nFederal Minister for Information and Broadcasting Chaudhary Fawad Hussain, Federal Minister for Science and Technology, Senator Syed Shibli Faraz, Federal Minister for Railways  Senator Azam Khan Swati, Advisor to PM on Parliamentary Affairs  Zaheer-ud-Din Babar Awan and  Sarwar Bari attended the meeting.\nThe meeting discussed various proposals with regard to improving the existing electoral laws in the country.\nThe meeting emphasised the need for evolving consensus among political parties and other relevant stakeholders to take forward the electoral reforms process and make it more inclusive. It was highlighted that political parties needed to adopt a more democratic process for the selection of female candidates, especially for filling the reserved seats of women in the Parliament and provincial assemblies.\nThe meeting also discussed the issue of candidates contesting elections from multiple constituencies.\nFederal Minister for Science and Technology Senator Shibli Faraz apprised that practical demonstrations of Electronic Voting Machines (EVMs) were being given in order to raise awareness and dispel any doubts about their use in the elections.\nThe President urged the need to rise above the political differences and jointly work for the fundamental political rights of the people of Pakistan.",
  "retrievedAt": "2025-08-11T21:10:09.402Z"
}
