{
  "title": "AJK PM lauds Sardar Ibrahim’s vibrant  role in Kashmir freedom struggle",
  "link": "https://www.app.com.pk/national/ajk-pm-lauds-sardar-ibrahims-vibrant-role-in-kashmir-freedom-struggle/",
  "date_published": "2022-07-30T19:16:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK )Jul 30 (APP) :: Prime Minister Azad Jammu and Kashmir Sardar Tanveer Ilyas Khan has said that Ghazi-e-Millat Sardar Muhammad Ibrahim Khan’s sole mission was to rid his nation of the menace of Hindu’s slavery and make Kashmir an invincible part of Pakistan.\nHe expressed these views in a statement issued on the occasion of the 19th death anniversary of Ghazi-e-Millat Sardar Ibrahim Khan, the founder president of Azad Government of the State of Jammu and Kashmir, observed at both sides of the LoC on Saturday.\nThe PM said that the deceased leader’s life (from 1915 to 2003) had been a mixture of many ups and downs but he never compromised on his ideals. He said Ghazi-e-Millat pursued higher education from London and was elected as assistant advocate general of the Maharajah Government.\n“Later he was elected as a member of the Prajya Sabha from which he resigned and fought for the freedom and identity of Kashmiris”, the PM said, adding that his role in the Kashmir’s freedom struggle would be remembered for a long time in the annals of Kashmir history.\nGhazi Millat, he said, started a strong movement against Dogra Raj under crucial circumstances. He said that when there was no place for the Muslims to gather, Ghazi-e-Millat offered his residence in Srinagar in which a Kashmiri representative unanimously decided to link their fate with Pakistan by adopting the historic accession to Pakistan resolution on July 19, 1947.\nTo achieve this goal, the PM said that people in the occupied Jammu and Kashmir were creating a new history of sacrifices while fighting the worst oppression and tyranny of India.\nReiterating his pledge to continue the mission of the deceased leader, the PM said:“Kashmiris will continue the freedom struggle until the last drop of blood. The Modi government’s barbarism and brutality won’t deter the valiant people of Kashmir from pursuing their cherished goal for which they have rendered unprecedented sacrifices.”\nHe went on saying that Kashmiris will dash into the ground the Modi’s nefarious designs and its dream of Akhandbaharat will be shattered into pieces. Modi’s hands were soaked with the blood of the people of Kashmir and Gujarat.\nHe said that Kashmiris would never compromise on their identity and rights. “India wants to erase the political, religious and cultural identity of Kashmiris and Modi government’s 5th August 2019 move was part of this plan.”\nReferring to constitutional, political and administrative machinations by the Indian government, he said that after stripping Kashmir of its nationhood status, India was hell bent on turning the Muslim majority of Occupied Kashmir into a minority.\nReferring to Kashmiris unconditional love and affinity with the people of Pakistan, the PM said, “One can have political differences with the government of Pakistan, but there is none so far as the state of Pakistan is concerned.”\nThe PM AJK said that given the volatile situation in the region, it was imperative that the United Nations and Islamic countries must take effective notice of India’s expansionist designs and help resolve the dispute peacefully once and for all.",
  "retrievedAt": "2025-08-11T15:19:18.797Z"
}
