{
  "title": "President directs UBL to reimburse Rs 5.49 mn to a defrauded customer",
  "link": "https://www.app.com.pk/national/president-directs-ubl-to-reimburse-rs-5-49-mn-to-a-defrauded-customer/",
  "date_published": "2022-07-31T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 31 (APP): President Dr Arif Alvi while upholding a decision of the Banking Mohtasib, has directed the United Bank Ltd (UBL) to refund the swindled amount of Rs 5.49 million to a complainant and declared that maladministration on part of the bank had been established.\nThe president rejected UBL’s representation against Mohtasib’s decision and held that bank had displayed negligence by clearing two stolen cheques bearing forged signatures as established by the bank’s own forensic report.\nHe regretted that the bank did not follow its own SOPs which clearly mandated a call back for transfer/clearing/remittance for the amount of Rs 500,000 and above, President Secretariat Press Wing said in a press release on Sunday.\nHe highlighted that SOPs were framed for application across the board without giving any discretion or choice to anyone with the underlying objective to avoid the possibility of fraud and fraudulent practices.\nThe president held that since the bank could not establish incontrovertibly its stance against the complainant, had failed to discharge the burden of proof and statutory liability cast upon it under the law, thus, its representation was devoid of any merit and deserved to be rejected.\nWhile further dilating upon the representation, the president pointed out that the cheques in dispute bore no stamp or narration required to be affixed on the back of the two cheques as required by the said SOPs.\nHe wrote that there was negligence on part of the bank in matching the signatures on stolen cheques against the admitted signatures of the complainant as per bank’s record, adding this fact was very tangible, obvious and sufficient for the bank to settle the claim in favour of the complainant.\nHe said that the forged cheques were a nullity and the customer’s account could not be debited on the basis of such cheques.\nAs per details, Feroze Khan (the complainant) was swindled out of his money when cheques were stolen from his office and Rs 5.49 million were debited from his account by the bank without any callback confirmation from UBL, as mandated by law and its own SOPs regarding the clearance of cheques for amounts of Rs 500,000 and above.\nThe complainant had filed a complaint with the Bank for seeking a refund of his lost money but without any result. Subsequently, he approached the Banking Mohtasib (BM) for retrieval of his swindled money, which passed the orders in his favour.\nThe bank, however, did not comply with BM’s decision and filed a representation with the president, which was also rejected in favour of Feroze Khan.",
  "retrievedAt": "2025-08-11T15:19:18.418Z"
}
