{
  "article_id": "2025-03-01_09f581dbe9947c7944c565cacb7475c5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-chief-directs-swift-action-on-islamabads-development-projects/",
    "retrieved_at": "2025-08-27T13:15:15.375Z"
  },
  "metadata": {
    "title": "CDA Chief directs swift action on Islamabad’s development projects",
    "author": null,
    "date_published": "2025-03-01T12:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 396,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 01 (APP):Capital Development Authority (CDA) has ramped up efforts to enhance Islamabad's infrastructure, with Chairman Muhammad Ali Randhawa issuing key directives during a high-level meeting held via Zoom on Saturday. The meeting, attended by senior CDA officials, NESPAK consultants, and architects, focused on various development and beautification projects across the capital. One of the primary issues discussed was the repair and maintenance of the Islamabad Police Academy. Officials briefed Chairman Randhawa on the ongoing preparation of cost estimates for the project. The chairman instructed that timelines be finalized promptly and daily progress reports submitted. He also recommended that NESPAK consultants provide technical assistance in the repair work. Another major point of discussion was the beautification of the Pakistan Secretariat buildings. Chairman Randhawa emphasized the need for a cost-effective yet aesthetically appealing design for the building facades. He directed that landscaping and horticultural improvements be made in the surrounding areas and called for a survey-possibly using drones-to identify a dedicated parking space for the Secretariat. Additionally, the chairman instructed the DMA Directorate to assess its assets and determine their market value. During the briefing, it was revealed that repair work on graveyards across the city was progressing rapidly. In a significant move, Chairman Randhawa ordered the immediate waiver of all charges for the funeral bus and directed the launch of an electric hearse bus for graveyard services. He stressed the need to hire top architects to create visually appealing signage across the city. The meeting also reviewed the ongoing repair and beautification of major roads in Islamabad. Officials reported that patchwork and kerbstone repairs were already underway. The chairman ordered the speedy completion of these works, particularly on key roads such as Club Road, Constitution Avenue, Express Highway, Faisal Avenue, Srinagar Highway, Margalla Road, and Jinnah Avenue. He also instructed that permanent lighting be installed along these highways and pedestrian bridges, with work continuing day and night during Ramadan to ensure timely completion. Finally, special attention was given to the renovation of Faisal Mosque. Chairman Randhawa directed that cleaning and restoration work be completed before the start of Ramadan. Additionally, he called for the installation of decorative lighting at the mosque for the holy month. With Ramadan approaching, the CDA chairman stressed the urgency of completing these projects to enhance the city's infrastructure and aesthetics, ensuring a more welcoming environment for residents and visitors alike.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}