{
  "title": "Trade diversification crucial for country’s economic growth: SAPM",
  "link": "https://www.app.com.pk/national/trade-diversification-crucial-for-countrys-economic-growth-sapm/",
  "date_published": "2023-02-23T12:05:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 23 (APP):Special Assistant to Prime Minister (SAPM) Malik Raza Rabbani Khar has said that trade diversification was crucial for economic stability and growth of the country in the present scenario.\nInaugurating the second ‘Engineering and Healthcare Show’ at Expo Centre here on Thursday, he said the locus of international trade was shifting towards diversification and Pakistan was also following the global trade scenario, and diversifying its global trade in terms of products as well as markets.\nHe said that Pakistan exported goods and services of US$38 billion in 2021-22, but it had a lot more potential. “We can supply more engineering goods, electrical appliances, pharmaceuticals, sports goods, surgical instruments, cosmetics, furniture, agricultural machinery, auto parts, tractors and many other products,” he added.\nThe SAPM said that it was government’s vision to double the trade of Pakistan in the next few years. “We need to accelerate export diversification and product sophistication and make our trade more inclusive for the purpose,” he added.\nHe said that it would enable the country to shift from an over dependence on commodities to higher value-added products and services. He said that it would also build resilience to movements in demand and help in fetching better prices, adding that it was the fastest path to economic growth, job creation and poverty reduction.\nRaza Rabbani Khar also appreciated the Trade Development Authority of Pakistan (TDAP) for its efforts in organising the exhibition and bringing all top guns of the engineering and healthcare sectors on a single platform.\nHe said that the exhibition had provided a unique opportunity for investors and international buyers to communicate with Pakistani companies to explore lucrative opportunities such as joint ventures with the local firms. He said that the exhibition was aimed to bring together businessmen from non-traditional countries under one roof to explore and open up new frontiers for enhancing trade.\nTDAP Chief Executive Officer Muhammad Zubair Motiwala and secretary also spoke, and said that the exhibition was aimed to present the true image of Pakistan before the world.Special guest Third Deputy Prime Minister of Uganda Nakadama Rukia Isanga, Advisor to President of Kenya Dr Faith Mwikan Ndiwa and other foreign dignitaries also attended the ceremony.\nMore than 180 Pakistani companies , belonging to 20 different sectors, participated in the exhibition and put their products on display. Also, 370 foreign buyers from 40 countries, including African and Central Asian countries, visited the exhibition.",
  "retrievedAt": "2025-08-11T06:10:38.859Z"
}
