{
  "title": "Pakistan-Italy bilateral trade volume reaches  €2 billion: Andreas Ferrarese",
  "link": "https://www.app.com.pk/national/pakistan-italy-bilateral-trade-volume-reaches-e2-billion-andreas-ferrarese/",
  "date_published": "2023-02-23T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): Ambassador of Italy to Pakistan, Andreas Ferrarese, has said that the bilateral trade volume between Italy and Pakistan has grown exponentially to €2 billion in 2022, and Pakistan’s exports are more than imports in Italy.\nHe made these remarks while talking to APP after the launching ceremony of Italian FPT Generators in Pakistan.Ambassador Andreas Ferrarese said although global trade shrank during the Covid-19 pandemic, Pakistan’s exports to Italy in 2022 grew to €1.2 billion. Italian exports to Pakistan were around € 800 million in the same period. Pakistan has a surplus with Italy, he added. “We will try to take the challenge and recover the next year, but the amount of our exports is more than the year before so, you grow more,” he said.\nPakistan’s market is vast for Italians as its population is more than 220 million. Therefore, the Embassy is continuously inviting Italian companies and also to say that “we have a special place in the heart of our Pakistani brothers. I also would like to invite all of you to Italy, adding Pakistan remains an attractive market for Italian manufacturers and businesspeople”, he told the business community in Embassy.\nHe said the Italian Embassy fully supports both country’s companies in enhancing trade and increasing investments. The Pakistani and Italian companies are collaborating, and Head of Commercial Operations of FPT, Michelangelo Amelia, said that his company has been working throughout Asia. Still, he feels at home here in Pakistan. Both countries have good partnerships, and more will come.  The Ambassador also expressed his best wishes for FPT’s business in Pakistan.\nTalking about the quality of Italian products, he said our companies invest very much in quality, and our products are sometimes at the top in the world. The good thing is that in Pakistan, quality is a value. Because in Pakistan, there is a taste for quality that is important.\n“We also think that the economic partnership is also bringing information training, increasing the skills of your people, which is remarkable. Because there is huge talent in your country”, he added.The Italian Embassy has granted more than 1500 visas to Pakistani business people and families who visit Italy. They also took the opportunity to explore business opportunities at the same time.",
  "retrievedAt": "2025-08-11T06:10:48.804Z"
}
