{
  "title": "Jammu High Court Bar Association suspends work in protest against Property Tax",
  "link": "https://www.app.com.pk/national/jammu-high-court-bar-association-suspends-work-in-protest-against-property-tax/",
  "date_published": "2023-02-23T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):The Jammu High Court Bar Association has suspended work on Thursday in all courts including the High Court to protest against the imposition of the Property Tax in the territory by Narendra Modi-led fascist Indian government.\nPresident of the Jammu High Court Bar Association, M K Bhardwaj, said there is an alarming situation as the occupation authorities have imposed Property Tax without any prior consultations with either the elected representatives of the Municipal Corporations, Councils, Committees, political parties or the civil society, Kashmir Media Service reported.\nHe said, hapless people of Jammu and Kashmir in particular Jammu are already reeling under the anti-people and anti-Jammu policies of Modi government and its puppet administration.\nM K Bhardwaj said, the imposition of Property Tax, which is one of the series of measures taken by the Modi government to financially burden the predominantly middle class and poor populace of Jammu and Kashmir without making them financially viable to bear this burden, has forced the Jammu High Court Bar Association to respond to the situation.\nHe said, such a decision of far-reaching consequence should have been left by the administration for an elected government to take. The elected representatives of the people are better versed with people’s problems and their economic status rather than the closely-seated bureaucratic rule, he added.\nThe Jammu Bar President said, the imposition of the Property Tax is reprehensible and condemnable beyond words. The Bar steadfastly stands by the people and also demands of the political parties, social and religious organizations to unitedly fight against this misguided anti-people tax regime, he added.",
  "retrievedAt": "2025-08-11T06:10:41.775Z"
}
