{
  "title": "PMYP to disburse Rs. 30 billion among about 40,000 young entrepreneurs till June 2023",
  "link": "https://www.app.com.pk/national/pmyp-to-disburse-rs-30-billion-among-about-40000-young-entrepreneurs-till-june-2023/",
  "date_published": "2023-02-23T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):Special Assistant to the Prime Minister for Youth Affairs Shaza Fatima Khawaja Thursday said that the Prime Minister Youth Program (PMYP) with the help of its partners successfully disbursed about Rs. 800 million among more than 3,300 people within one month.\nAddressing the cheque distribution ceremony among the beneficiaries of the PMYP she said that as per direction of the Prime Minister Shehbaz Sharif PMYP is committed to ensuring the disbursement of Rs. 30 billion among about 40,000 young entrepreneurs till June 2023.\n“Half of these loans will be given for the agriculture sector while the remaining half will be the business loans for small and medium enterprises,” she said.\nThe SAPM said that Pakistani Youth has a lot of potential for taking Pakistan towards the destination of micro-economic development and sustainability.\nShe also thanked the relevant ministries, banks, microfinance organizations, NADRA, and business and social media partners for their services and contribution to the success of the program.\nShe at the outset expressed her gratitude towards the Ministry of Finance and the State bank of Pakistan, who besides their limited resource, ensured the timely release of PMYP.\nShe said that Tik Tok is working with us to promote this program by producing videos and ensuring women’s inclusion.\nThe SAPM informed that the Islamabad Chamber of Commerce and Industry (ICCI) is establishing a facilitation center for the mentorship of young beneficiaries of capital and its surroundings.\nShe said that with the support of these partners, we are trying to make this program more successful and beneficial for the youth of the country.\nOn this occasion, Prime Minister Shahbaz Sharif launched the freelancer card and distributed cheques among the successful applicants who got loans under Prime Minister Youth Business and Agriculture Loan Scheme.",
  "retrievedAt": "2025-08-11T06:10:10.739Z"
}
