{
  "title": "EPA public hearing participants grill high-rise project proponents on poor preparation",
  "link": "https://www.app.com.pk/national/epa-public-hearing-participants-grill-high-rise-project-proponents-on-poor-preparation/",
  "date_published": "2023-02-23T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): The participants comprising experts, academia and students at the Pakistan Environmental Protection Agency (Pak-EPA) public hearing of the environmental impact assessment (EIA) report of a skyscraper project to be built in DHA-III lambasted the project proponent over poor performance.\nThe public hearing was presided over by Deputy Director, EIA and Monitoring Khalid Mehmood Chaudhary, Deputy Director Legal Aamir Abbas Khan along with the representatives of the One Serene Residence project proponent.\nThe public hearing under the Pakistan Environmental Protection Act, 1997 and review of IEE/EIA Regulations, 2000 includes a detailed account of existing environmental conditions, a project description, an analysis of the impacts and proposed mitigation measures to be implemented during the project execution.\nOne Serene Residence Project is a 14-storey high-rise residential project intended to facilitate the residents of the federal capital with the most modern residential area with all the required facilities in one place.\nThe project consists of 238 units with green spaces, pools, lounge and terrace areas, two basements, a lower ground floor, a ground floor, a mezzanine floor and 10 upper floors. It also includes a car parking area for two basements and a lower ground floor with a capacity of around 375 cars.\nThe project land sprawls over an area of 13.72 kanals and the covered area of the proposed project will be 585,000 square feet. The project includes apartments, gyms, pools, green and open spaces, and a water filtration plant. Its total cost was Rs3.51 billion and would be completed in three years.\nThe EIA report by the project proponent mainly revolved around the flora and fauna of the federal capital, environmental conditions, possible impacts of the project on the environment and mitigation measures to ensure eco-friendly development.\nA local resident, Zia Ul Islam pointed out that the project proponent should share his profile which was not available so that the stakeholders were confident to believe in their claims and project proposals.\nHe also mentioned that the project proponent briefed the participants during the hearing that it would dump sewage into DHA ‘s STP, adding, “please clarify which phase of DHA has STP because liquid waste is being dumped into nearby Nullahs.”\nIslam said that the DHA was the custodian of this society but there was no representation of the authority. He added that there were many important points missing from the project details that should be elaborated.\nThe project proponent informed that his firm had executed many high-rise projects abroad whereas its first project was One Canal done in Lahore and the second one was One Serene Residence in Islamabad.He added that the project was mainly for overseas Pakistanis.",
  "retrievedAt": "2025-08-11T06:10:49.212Z"
}
