{
  "title": "PM for making Pakistan-US partnership diverse, multidimensional",
  "link": "https://www.app.com.pk/national/pm-for-making-pakistan-us-partnership-diverse-multidimensional/",
  "date_published": "2023-02-23T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday highlighting the significance of long-standing cooperation between Pakistan and the United States underscored the need to make this partnership diverse and multidimensional.\nHe underlined that parliamentary exchanges between the two countries, as vibrant democracies, were vital to promoting understanding of each others’ perspectives at the political level.\nThe Prime Minister expressed these views while welcoming a six-member U.S. Senate delegation from the Democratic Party, which led by Senate Majority Leader Senator Chuck Schumer called on him here.\nOther members of the delegation included Senators Maria Cantwell, Amy Klobuchar, Gary Peters, Catherine Cortez Masto, and Peter Welch.\nThe Prime Minister highlighted that Pakistan and U.S. celebrated 75 years of diplomatic relations last year, and that this diplomatic milestone presented an ideal opportunity to chart future course for Pak-US bilateral ties.\nPointing to the unrealized potential in the trade, investment and technology realms, he emphasized the importance of forging a more robust and mutually beneficial bilateral economic partnership.\nThe Prime Minister recognized the important role that the vibrant Pakistani community plays in serving as an important bridge between the two countries.\nHe thanked the U.S. for its support and solidarity with the people of Pakistan during the 2022 floods and its participation in the International Conference on Climate Resilient Pakistan.\nA number of issues of mutual interest and importance including the situation in Afghanistan, and deteriorating human rights situation and growing repression in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) were also discussed during the meeting.\nThe Prime Minister urged the U.S. Congress to play its due role in raising its voice for the rights of the Kashmiri people and against the rising wave of anti-Muslim extremism in India.\nSenator Schumer, thanking the Prime Minister on behalf of the delegation, affirmed the desire to further strengthen Pakistan-US bilateral ties in various dimensions through continued engagement and wider co-operation.",
  "retrievedAt": "2025-08-11T06:10:18.570Z"
}
