{
  "title": "Thousands of women martyred, molested in IIOJK since Jan 1989",
  "link": "https://www.app.com.pk/national/thousands-of-women-martyred-molested-in-iiojk-since-jan-1989/",
  "date_published": "2023-02-23T10:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):The miseries and victimization of Kashmiri women by the Indian troops and police personnel continue unabated in Indian illegally Occupied Jammu and Kashmir (IIOJK).\nThis was revealed by a report released by the Research Section of Kashmir Media Service on the occasion of the Kashmiri Women’s Resistance Day, on Thursday.\nThe Day is observed on both sides of the Line of Control every year to pay tribute to the struggles and sacrifices of the survivors of mass rape and torture in Kunanposhpora.\nCall for the observance of the day as Women’s Resistance Day was, first, given by Jammu and Kashmir Coalition of Civil Society and supported by the All Parties Hurriyat Conference in 2014.\nIndian troops had gang-raped around 100 women of all ages from eight to eighty years old on the night of February 23 in 1991 during a siege and search operation in Kunanposhpora in Kupwara district.\nThe report maintained that at least 682 women have been martyred by Indian troops since January 2001 till date Feb 2023. It pointed out that since January 1989, the unabated Indian state terrorism rendered 22,957 women widowed while Indian forces’ personnel have molested 11,256 women.\nIt said that thousands of women lost their sons, husbands, fathers and brothers in the occupied territory who were subjected to custodial disappearance by Indian Army, police and paramilitary personnel.\nThe report pointed out that over two dozen women and girls including Hurriyat leaders, Aasiya Andrabi, Fehmeeda Sofi and Naheeda Nasreen, were facing illegal detention in different jails of IIOJK and India.\nThey are being victimized only for the reason that they represent the aspirations of the people of Jammu and Kashmir and their demand for the right to self determination, it said.\nThe report deplored that despite the passing of thirty-two years, justice continues to elude the victims while the troops involved in heinous crime are roaming free.\nIt said that the memories of Kunanposhpora mass rape are still fresh in the minds of the Kashmiri people. It said, the impunity given by India to its troops under draconian laws is the main reason behind the Kunanposhpora-like tragedies.\n“Kunanposhpora mass rape is a glaring example of Indian troops’ brutalities in IIOJK. It is a blot on the so-called democratic face of India, which is using rape of women as an instrument of state terrorism in IIOJK.\nKunanposhpora tragedy is a proof of institutionalized violence being using by India and the war crimes perpetrated by Indian troops in Kashmir,” it said.\nThe report maintained that India was employing rape as a military tactic to humiliate the Kashmiris and break their resolve for freedom from its subjugation.\nIt said that New Delhi must be pressurized to reopen Kunanposhpora mass rape case to bring perpetrators to book. India must be held accountable for the heinous crimes perpetrated by its troops against the Kashmiris, it added.",
  "retrievedAt": "2025-08-11T06:10:48.897Z"
}
