{
  "title": "KPEZDMC issues LoI to InfraCo Asia for solarization of economic zones",
  "link": "https://www.app.com.pk/national/kpezdmc-issues-loi-to-infraco-asia-for-solarization-of-economic-zones/",
  "date_published": "2023-02-23T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): The Khyber Pakhtunkhwa Economic Zone Development and Management Company (KPEZDMC) has issued a Letter of Intent (LoI) to InfraCo Asia to undertake a complete feasibility study for the solarization of economic zones in Khyber Pakhtunkhwa.\nThe LoI signifies the commitment of KPEZDMC and InfraCo Asia to work together in exploring the potential of solar energy and expanding its use in the province’s economic zones.\nSolar energy is not only a critical component of the global efforts to combat climate change, but it also has the potential to play a transformative role in promoting sustainable economic development.\nBy harnessing the province’s immense potential for solar energy, KP can, thus, reduce its reliance on fossil fuels, minimize its carbon emissions, and create new opportunities for businesses and employment in the region, said a news release issued by the British High Commission in Pakistan.\n“Innovation and collaboration are key to driving sustainable economic growth.\nThrough this partnership, we aim to harness the potential of renewable energy while also creating new opportunities for businesses and people in Khyber Pakhtunkhwa,” said Jo Moir, Development Director, British High Commission, Pakistan.\nThe Sustainable Energy and Economic Development (SEED) Programme has been providing technical support to the Government of Khyber Pakhtunkhwa since its inception, culminating in the signing of the LOI. The SEED Programme is funded by the UK.’s Foreign, Commonwealth, and Development Office (FCDO).\nDr. Omar Mukhtar Khan, Team Lead, SEED, shared, “The solarization of economic zones in Khyber Pakhtunkhwa will help reduce energy costs and improve the reliability and affordability of energy supply. By embracing renewable energy, we can create a more sustainable and prosperous future for our province.”\nImdad Ullah Bosal, Chief Secretary, KP, emphasized the role of the KP government in promoting sustainable economic development and the use of renewable energy. “KP is committed to promoting sustainable economic development, and this collaboration with InfraCo Asia is a step towards achieving this objective,” he said.\nThe partnership between KPEZDMC and InfraCo Asia demonstrates the power of collaboration in driving sustainable economic development through renewable energy. As the world transitions to cleaner energy sources, initiatives like the solarization of economic zones in Khyber Pakhtunkhwa are essential for promoting sustainable economic growth while reducing carbon emissions.\nThis innovative model could serve as a roadmap for other regions striving to achieve a greener and more prosperous future.\nCCO-KPEZDMC, Adil Salahuddin, remarked: “We are delighted to be partnering with InfraCo Asia for the solarization of economic zones in KP. This collaboration will not only help reduce carbon emissions but will also create new opportunities for businesses and generate employment in the region.”",
  "retrievedAt": "2025-08-11T06:10:45.274Z"
}
