{
  "title": "President lauds special initiatives under Ehsaas programme for women, children",
  "link": "https://www.app.com.pk/national/president-lauds-special-initiatives-under-ehsaas-programme-for-women-children/",
  "date_published": "2023-02-23T17:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): President Dr Arif Alvi Thursday lauded special initiatives under the Ehsaas programme focused on providing education and stipends to children and loans to women as a step towards their social and economic empowerment.Speaking at an event arranged for the screening of documentary Ehsaas 2047, he said that Ehsaas programme was a good example of a welfare initiative in which poor people were provided relief and technology was used for disbursing money transparently.He said Ehsaas had various programs and all of these were in the spirit of Islamic welfare state and its objective was to alleviate poverty.Such programmes should continue, he added. He said an important aspect of such programmes was to stop pilferage of funds.He underlined the need for ensuring the inheritance rights of women in order to empower them financially.He expressed the hope that Pakistan would emerge out of the current economic pressures.\nThe President said Pakistan still lagged behind in enrollment of children in primary schools which stood at 68 percent while India, Bangladesh and Sri Lanka had more than 90 percent of enrollment of students at primary level.He mentioned that Pakistan was among the top three countries when it comes to the philanthropy of its people who were known for their generosity. He said the issue of malnutrition and stunting among youth also needed attention of policymakers.Senator Sania Nishtar highlighted various features of the Ehsaas programme aimed at helping vulnerable sections of society.Ehsaas 2047, a feature-length documentary capturing the impact and scale of Pakistan’s most ambitious poverty alleviation programme in history was premiered on the occasion.\nEhsaas, a flagship poverty alleviation programme named after the Urdu word for empathy, committed to the ambitious goal of ‘social protection for all’ by 2047 – the 100th anniversary of Pakistan’s creation. Since its inception in 2019, Ehsaas had become one of the country’s most impactful projects, delivering 16 programs to tens of millions of people – from cash transfers during the COVID-19 pandemic, health protection, undergraduate scholarships, cash for work, temporary housing, nutrition packages and measures to promote financial inclusion.The documentary Ehsaas 2047 showcased the country’s historic attempt to build a welfare state and shared stories from resilient people breaking the chains of poverty across Pakistan. From the mountainous town of Skardu in Gilgit-Baltistan to the southern port city of Gwadar, the film highlighted what change was beginning to look like for mothers, shop owners and children living across Pakistan’s diverse countryside.This remarkable film, outlining efforts to lift the poorest and most marginalized out of poverty, was a testament to the hard work and determination of the team that delivered Ehsaas.Ehsaas was deliberately designed with an apolitical structure to deliver quality social services to people across Pakistan so that no one was left behind.Ehsaas 2047 aimed to foster a better understanding of the people facing complex challenges, as well as shared lessons on how to create pathways to prosperity not only in Pakistan, but around the world.",
  "retrievedAt": "2025-08-11T06:10:04.745Z"
}
