{
  "title": "President for proactive role of political leadership, media to creating awareness on non-communicable diseases",
  "link": "https://www.app.com.pk/national/president-for-proactive-role-of-political-leadership-media-to-creating-awareness-on-non-communicable-diseases/",
  "date_published": "2023-02-23T11:45:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 23 (APP):President, Dr Arif Alvi here on Thursday underlined the need for creating mass awareness about non-communicable diseases and active role of all stakeholders including political leadership and media in that regard.\nAddressing as a chief guest during the third international public health conference on ‘Breaking the manacle: non-communicable diseases” at Khyber Medical University (KMU), he said that most of the diseases including cancer were non-communicable and if diagnosed and treated at early stage could save many precious lives.\nThe president said lung cancer was also curable if diagnosed timely, and late diagnoses and treatment of the disease could prove fatal.\nHe said precautionary and preventive measures should be taken on priority to save people from communicable and non-communicable diseases.\nPresident, Dr Arif Alvi said that Pakistan had achieved great success against fatal coronavirus after taking solid preventive measures, which was widely appreciated.\nHe suggested that special programs should be aired and broadcast on media especially during morning shows for public awareness about causes and treatment of communicable and non-communicable diseases for a healthy and prosperous society.\nThe president called for implementation of the already existing health policies in letter and spirit to save lives including mothers and children.\n“We have all the required policies but lack implementation,” he maintained.\nHe said the rapidly increasing population was exerting extraordinary pressure on the economy and national resources, adding that about nine million pregnancies were being reported annually in the country including about 50 percent unwanted pregnancies.\nDr Arif Alvi said that contraceptive techniques were being used in the world to control the unwanted pregnancies and high birth-rate and suggested the use of such techniques here also to overcome the issue of overpopulation and poverty with a view to create balance between economic resources and population.\nThe president observed that wrangling among political forces would hardly serve any purpose rather focus should be made on resolution to the issues of national priority.\nDr Arif Alvi advised the doctors’ community to do intellectual exercises and convince their patients during the treatment process for a healthy and prosperous Pakistan.\nKhyber Pakthunkhwa Governor, Ghulam Ali, Adviser to the caretaker chief minister, Dr Abid Jamil, Vice Chancellor KMU, Dr Ziaul Haq and others concerned were present.\nThe president was accorded warm welcomed after arrival at KMU.\nEarlier, the president was briefed about the objectives of the international conference by the vice chancellor and the organizers.\nThe conference was attended by national and international doctors, health experts, scholars, faculty members of KMU and students.",
  "retrievedAt": "2025-08-11T06:10:30.456Z"
}
