{
  "title": "Austerity measures aim to reduce burden on national exchequer: Shazia Marri",
  "link": "https://www.app.com.pk/national/austerity-measures-aim-to-reduce-burden-on-national-exchequer-shazia-marri/",
  "date_published": "2023-02-23T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):Federal Minister for Poverty Alleviation and Social Safety Shazia Marri Thursday said the present government was fully cognizant of the sufferings of the common man and decided to reduce the expenses of the cabinet members as a part of its austerity campaign.\nThe initiated austerity measures were being initiated keeping in view the numerous challenges being faced by the country, including economic hardships, Shazia Marri, who is also Chairperson of the Benazir Income Support Programme (BISP), said while addressing a presser.\nPrime Minister, Shehbaz Sharif, she said, had already constituted a committee on austerity measures, which would prepare a comprehensive plan for implementation of the campaign.\nShe recalled that former prime minister Syed Yousaf Raza Gillani had introduced a monetization policy during his tenure, which could not be implemented. “We have now decided to implement that policy in letter and spirit as a part of the austerity measures.”\n“The cabinet members have been directed to strictly implement the austerity campaign while the prime minister will personally monitor the process,” she added.\nThe austerity campaign, she said, would save Rs 200 billion annually from the national exchequer, which would be spent on the welfare of the people.\nShazia Marri said the present government had taken difficult decisions to ensure economic stability and reduce the burden on public exchequer.\nThe government was also considering to reduce the size of cabinet as a part of the austerity measures, she added.\nStructural reforms, she stressed, were needed to address the crises. The government was working on the reforms, which would be announced soon.\nThe minister said political stability was a must to ensure economic stability in the country, but Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan Pakistan Tehreek-i-Insaf was persistently creating chaos.\nThe ineffective policies of the last PTI regime had pushed the country into the economic quagmire and the incumbent government had to take difficult decisions to overcome the challenges, she added.\nAbout the audio leaks issue, Shazia Marri said they had always condemned the ‘culture of audio leaks’ as it was immoral and unethical. However, it was Imran Khan who as prime minister had made fun of others over their audio leaks, but today he himself was facing the dilemma, she added.\nThe minister said it was an irony that Imran Khan had been criticizing former president Asif Ali Zardari, who had taken historical steps for the supremacy of parliament and institutions during his tenure.\nThe announcement of the National Finance Commission (NFC) Award, 18th Constitutional Amendment, transfer of powers to the parliament, besides initiating the China-Pakistan Economic Corridor and Thar coal projects, and many others were on the credit of Asif Zardari, she added.\nAs regards the PTI’s ‘Jail Bharu’ drive, Shazia Marri said that drama should be stopped as the country needed political stability and economic reforms to move forward.\nAbout the BISP, she said the number of beneficiary families would be increased to nine million under the Benazir Kafalat Programme till June.\nThe internationally acclaimed BISP, she added, had been proved as the most successful social protection intervention for the most vulnerable communities of the country. Its budgetary allocations were being increased to extend the financial benefits to the maximum deserving population.\nShe said the first ever dynamic survey had been launched to include more deserving beneficiaries and exclude the non- deserving ones.\nResponding to a question, Shazia Marri said the decisions taken in the recent cabinet meeting would be shared with the provincial governments so that they could also contribute to the austerity campaign.",
  "retrievedAt": "2025-08-11T06:10:35.154Z"
}
