{
  "title": "Fake domiciles issued to 4.2 mln non-residents to change IIOJK’s demography: Barrister Sultan",
  "link": "https://www.app.com.pk/national/fake-domiciles-issued-to-4-2-mln-non-residents-to-change-iiojks-demography-barrister-sultan/",
  "date_published": "2023-02-23T15:37:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Feb 23 (APP): Azad Jammu & Kashmir (AJK) President Barrister Sultan Mehmood Chaudhary on Thursday said the Indian government had issued fake domiciles to some 4.2 million non-residents to change the demography of the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nSince scrapping the special status of IIOJK in its constitution on August 5, 2019, India had been taking such measures under its nefarious designs, besides resorting to the worst human rights abuses in the state, he told a news conference after returning from a three-week visit of the United States, Europe and Turkey.\nBarrister Sultan said the international media like The Guardian, New York Times and BBC had already reported the facts about demographic changing measures and the worst human rights violations carried out by the occupation authorities in the valley.\nHis visit to the influential world capitals was aimed at further highlighting India’s nefarious acts vis-a-vis the IIOJK and stressing the international fora, including the United Nations and the European Union, to get stop the reign of terror being unleashed by the Indian occupation forces on the hapless people, he added.\nHe said being the president of the AJK, the base camp government of the Kashmir freedom movement, he was fulfilling his responsibility to highlight the Kashmir cause internationally. He was bearing the expenses of the foreign tours he had been undertaking since he took the office, he added.\nBarrister Sultan termed his tour successful as he had held high-profile meetings with UN Assistant Secretary-General for the Middle East, Asia and the Pacific Khalid Khiali and Assistant Secretary-General for Human Rights Ilze Brands Kehris, US senators and Congress members, British, European Union and Turkish parliamentarians, and officials of other international forums.\nHe said it was much encouraging when Khalid Khiali told him that the Kashmir issue was very much on the United Nations’ agenda and the secretary General was making his efforts to resolve the longstanding dispute. Ms Kehris assured him that a resolution on the lingering issue, besides other measures, would be adopted in the forthcoming meeting of the UN Human Rights Commission, he added.\nPakistan should demand the UN Human Rights Commission to constitute a special commission in its next meeting for assessing the on-ground situation in the held Kashmir, as its head had assured him full support in that regard, he proposed.\nSimilarly, he said, the EU and Turkish parliamentarians assured him to constitute all parties Kashmir committees in their respective parliaments while the British members of parliament committed to taking up the Kashmir issue with the United Kingdom prime minister.\nThe US Congress and Senate members also assured their support on Kashmir, he added.\nThe AJK president said he also addressed a number of public gatherings of the Kashmiris diaspora at different places in the UK, US and European countries. With the people IIOJK braving the Indian brutalies and cruelties, the Kashmiris living abroad had been keeping the Kashmir issue alive, he added\nHe said he would also apprise the foreign minister of the feedback of his visit, with the request to raise the human rights violations in the IIOJK issue internationally.",
  "retrievedAt": "2025-08-11T06:10:00.949Z"
}
