{
  "title": "EOBI committed to release increased pension on Sept 1",
  "author": null,
  "content": "ISLAMABAD, Aug 28 (APP):As per the instructions of the Committee Chairman, Employees’ Old-Age Benefits Institution (EOBI) has committed to release pensions to pensioners and assured the committee that the pension increased from rupees 10,000 to rupees 11,500 with effect from 1st January, 2025, will be disbursed along with all arrears on September 1, 2025.\nThis was instructed in the 5th meeting of the National Assembly Standing Committee on Overseas Pakistanis and Human Resource Development held here on Thursday under the Chairmanship of MNA Syed Rafiullah.\nAt the beginning of the meeting, the committee members congratulated the Chairman EOBI on assuming new responsibilities.\nTwo positive decisions were taken in the committee, in which the chairman of the committee announced that EOBI employees or pensioners can approach the committee in case of any issue, and the committee will take action immediately on such cases.\nThe Acting Chairman of the EOBI briefed the Committee on the institution’s overall performance, structure, and operations. The briefing covered Pakistan’s social security framework, EOBI’s organizational setup, contribution mechanisms, and the range of benefits provided under the EOB Act, 1976.\nThe committee was informed about ongoing and completed projects, pension disbursements, fund collection and utilization, and key institutional challenges. Members raised critical questions and provided recommendations and directions for improving service delivery and efficiency.\nThe meeting was attended by Mian Khan Bugti, Zulfiqar Ali Behan, Ms. Saeeda Jamshid, Ms. Erum Hamid, Ms. Tamkeen Akhter Niazi, Fateh Ullah Khan, Dr. Mehreen Razzaq Bhutto, Farhan Chisti, Ms. Sofia Saeed Shah, Mr. Muhammad Ilyas Choudhary MNA’s and Senior Officers from the EOBI, Ministry of Overseas Pakistanis and Human Resource Development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:38:20.866Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/eobi-committed-to-release-increased-pension-on-sept-1/",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T12:29:00.000Z"
}
