{
  "title": "Lawmakers for exemplary punishment to perpetrators of May 9 violence",
  "link": "https://www.app.com.pk/national/lawmakers-for-exemplary-punishment-to-perpetrators-of-may-9-violence/",
  "date_published": "2023-05-23T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): The lawmakers in the National Assembly here on Tuesday called for inflicting exemplary punishment for the perpetrators of the 9th May riots and attacks on defense and government installations.\nSpeaking on the floor of the National Assembly, Member National Assembly (MNA) Muhammad Aslam Bhootani condemned the 9th May terrorist attacks by miscreants of the Pakistan Tehreek-e-Insaf (PTI) on government installations.\nHe endorsed the Pakistan armed forces’ announcement to observe May 9 as a black day in the country and asked the government to award exemplary punishment to people involved in the May 9 incidents.\nFederal Minister Mian Javed Latif said that the violent acts of May 9 including the attack on Jinnah House in Lahore were plotted by PTI chairman Imran Khan which was tantamount to “mutiny against the state”.\nHe said those who ransacked and vandalized the public and private properties were trained miscreants. The federal minister said those who attacked military installations and ransacked other buildings including that of Radio Pakistan Peshawar need to be taken to task in accordance with the law.\nHe said, “All culprits involved in the May 9 incidents should be dealt according to law.” He also endorsed for trying the cases of culprits involved in the May 9 under Army Act.\nMNA Moulana Abdul Akbar Chitrali said, his party stands with Pakistan Armed Forces. “We expressed solidarity with the Pakistan Army”, he said, adding that he was disagreed with the point of trying culprits of May 9 under Army Act.Sheikh Salahuddin said Pakistan Tehreek-e-Insaf chairman Imran Khan is the real culprit and mastermind of May 9 riots. He was of the view that Imran Khan misled his workers.\nHe said that the culprits involved in damaging and attacking the defense and public buildings should not be spared. He also endorsed the decision of trying May 9 culprits under Army Act.",
  "retrievedAt": "2025-08-11T08:32:39.384Z"
}
