{
  "title": "Imran Khan gets interim bail in eight terrorism cases till June 8",
  "link": "https://www.app.com.pk/national/imran-khan-gets-interim-bail-in-eight-terrorism-cases-till-june-8/",
  "date_published": "2023-05-23T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): An Anti-Terrorism Court (ATC) on Tuesday granted interim bail till June 8, to Pakistan Tehreek e Insaf (PTI)’s chairman Imran Khan in eight cases registered by capital police with regard to protests, vandalizing public property and violation of Section-144 of the Pakistan Penal Code (PPC).\nATC Judge Raja Jawad Abbas heard the interim bail petition of former prime minister Imran Khan in FIRs registered in various police stations of Islamabad.\nImran Khan appeared before the court along with his wife Bushra Bibi at judicial complex Islamabad. Foolproof security arrangements had been made during the appearance of PTI’s chief.\nAt the outset of hearing, the judge remarked that as per his knowledge, the petitioner had submitted his statement in only one case. Imran Khan’s lawyer Salman Safdar Advocate said they had come for bail in eight cases, adding that Imran Khan had joined investigations and signed his written statements to submit in all cases but no one was ready to receive it. They had not approached this court directly rather, they got protective bail from IHC previously, he said.\nThe lawyer said that the JIT was constituted on the directions of Lahore High Court (LHC) for investigation and the Islamabad High Court (IHC) had also directed his client to join the investigation. He said as the statements were ready to be submitted his client was ready to answer if the investigators had any further question. He prayed the court to grant permission for arguments in all cases simultaneously.\nProsecutor Muhammad Adnan opposed the interim bail petitions and adopted the stance that Imran Khan never appeared before the investigation team despite he was repeatedly summoned. Even he didn’t appear before the JIT despite the orders of IHC, he said.\nTo a query of the judge, the prosecutor said that the accused should appear before the JIT when and where he was summoned. The court asked that why the JIT didn’t record the statement of Imran Khan when he was in custody in police line, the prosecution could have approached this court for the permission.\nThe court observed that whether the JIT served any questionnaire to the accused to which the prosecutor said that the JIT was formed in four cases but the accused never appeared before it. Then exemptions had been sought on medical grounds and security excuses by the accused, he said.\nHe prayed the court to issue directions to Imran Khan for joining the investigation process in the said cases. He said that the Islamabad police was providing security to the accused during his appearance on this day.\nImran Khan arrived at the rostrum and said that there were threats to his life and had already faced attacks. He said that JIT visited his house in Lahore and he cooperated with them. Imran Khan said that he just wanted to be included in investigations as per the direction of the Lahore High Court (LHC). The court said that he would issue an order on the application of the petitioner.\nThe court also noted that no members from the JIT appeared before it during hearing and summoned them within 30 minutes. The court asked the JIT to tell how it wanted to record the statement of the accused.\nThe court granted interim bail to Imran Khan till June 30, in all eight cases and stopped the police from arresting him till said time period. It may be mentioned here that police stations including Ramna and Khanna had registered two each cases while CTD, Golar, Sangjani and Bharakau police stations had registered one case each against Imran Khan.",
  "retrievedAt": "2025-08-11T08:32:42.792Z"
}
