{
  "title": "Steps on anvil for provision of quality infrastructure, transport facilities to residents of Islamabad: PM",
  "link": "https://www.app.com.pk/national/steps-on-anvil-for-provision-of-quality-infrastructure-transport-facilities-to-residents-of-islamabad-pm/",
  "date_published": "2023-05-23T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that practical steps were being taken for provision of best infrastructure and transport facilities to the residents of Islamabad.\nThe prime minister directed the relevant authorities to make efforts for extending global standard facilities to the citizens of the capital.\nThe prime minister chaired a meeting on the development projects of Islamabad. The meeting was attended by Minister for Finance Ishaq Dar, Minister for Interior Rana Sanaullah, PM’s adviser Ahad Cheema, PM’s special assistant Tariq Bajwa, Hanif Abbasi, Dr Tariq Fazal Chaudhry, Anjum Aqeel, former MNAs, chairman Capital Development Authority, secretaries and other senior officials, PM Office Media Wing said in a press release.\nThe prime minister also directed for acceleration of pace on the ongoing development projects without compromising on transparency and quality work.\nThe meeting was apprised that in the rural areas of Islamabad, work on Rs10 billion package was being carried out which would bring a new era of development in these areas.\nFor improvement of the transport system in Islamabad, a total of 160 electric buses would run on different routes while 30 electric buses out of this batch would arrive by the mid of June to ply on two routes.\nAddressing the participants, the prime minister said that overseas Pakistanis were the precious assets of the country and their welfare was among the top priorities of the government.\nThe meeting was apprised that a number of housing units equipped with the latest facilities were being constructed in the federal capital for the overseas Pakistanis while residential schemes for expatriates were also initiated in which they would be provided with concession of 15 percent over full payment.\nThe meeting was informed that a total of 45 commercial plots located at the best locations of Islamabad were ready for auction.\nIt was further informed that for the rural and urban areas of Islamabad, a short-term solid waste management project would commence in June, this year whereas an international tender had been floated for the solid waste management under a long-term plan.\nThe prime minister directed that a comprehensive solid waste management plan should be presented before the federal cabinet for approval.",
  "retrievedAt": "2025-08-11T08:32:25.714Z"
}
