{
  "title": "Control Room set up to assist visiting intending Pilgrims",
  "link": "https://www.app.com.pk/national/control-room-set-up-to-assist-visiting-intending-pilgrims-2/",
  "date_published": "2023-05-23T15:37:00.000Z",
  "source": "APP",
  "content": "Madinah, May 23 (APP): Ministry of Religious Affairs and Interfaith Harmony has established a dedicated Control Room to monitor and provide essential assistance to visiting intending pilgrims during their stay in Al-Madinah al-Munawwarah.\nThe Control Room, established in Pakistan House Al-Madinah al-Munawwarah is staffed by a team of highly trained professionals.\nIt serves as a central hub to monitor the situation and promptly address any issues or challenges faced by pilgrims. The Control Room houses, a lost and found department, and other essential facilities.\nEquipped with advanced technology and real-time communication systems, it will ensure efficient coordination and quick response to the evolving needs of the pilgrims.\nThe primary objective of the Control Room is to offer guidance, support, and necessary assistance to intending pilgrims throughout their sacred journey.\nFurthermore, the Control Room will collaborate closely with relevant authorities, airlines, hotels, and transportation providers to ensure a seamless experience for the pilgrims.\nIt will address any emergencies or contingencies promptly, guaranteeing the safety and well-being of the pilgrims during their pilgrimage.\nThe dedicated team will be available round the clock to address any concerns and provide the necessary support, fostering a more convenient and spiritually fulfilling journey for all pilgrims.\nMeanwhile, according to spokesman Umer Butt, a total of 5,591 pilgrims have so far reached Madinah Munawwarah for Hajj in 2023. These pilgrims have been accommodated in 16 centrally located hotels, providing them with comfortable lodging during their stay.\nThey are being served breakfast, lunch, and dinner as part of their Hajj experience. Additionally, excellent transportation facilities have been arranged for them, ensuring a seamless journey from the airport to their respective hotels.",
  "retrievedAt": "2025-08-11T08:32:35.131Z"
}
