{
  "title": "‘Progeny of RTS’ becomes hostile towards country: Marriyum",
  "link": "https://www.app.com.pk/national/progeny-of-rts-becomes-hostile-towards-country-marriyum/",
  "date_published": "2023-05-23T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Tuesday said the May 9 arson and vandalism unequivocally demonstrated the growing hostility of Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan’s against the country.\n“Imran Khan victimized political opponents, became hostile towards media and above all turned against the country which is an unforgiveable crime,” the minister said in a series of tweets which also included pictorial depiction of unprecedented political vendetta carried out by the PTI chief against the Pakistan Muslim League-Nawaz (PML-N) leadership during his government’s tenure.\nThrough the pictures shared by her on her Twitter handle, she drew a comparison between the PML-N leadership which was penalized unjustly and stood firm in face of Imran Khan’s adversity and the “thieves” (PTI leadership) who were quitting the PTI in droves.\n“Imran Khan made every false case against us but we along with Quaid Nawaz Sharif stood firm and stand vindicated,” she said, adding the PML-N leadership as well as the people knew that they did not commit corruption of a single dime.\nDuring those challenging times, she said, the PML-N leadership exhibited remarkable courage, standing resolutely in their duty to serve the nation. Their unwavering commitment to the welfare of the people was an obligation which they embraced with utmost dedication.\n“These pictures are unforgettable examples of bravery and loyalty of the PML-N leadership,” she said, adding there were living proofs of “fascism, the worst political revenge and oppression” of Imran Khan’s government tenure.\nMarriyum said the PML-N leadership presented the money trail of their four generations and stood vindicated. On the other hand, Imran Khan and his aides were not only crying but also running away and “hiding like jackals” to avoid their arrests.\nShe said the PTI leaders left the PTI as they realized that Imran Khan was a “thief of Toshakhana, liar, foreign agent and a robber of Rs 60 billion in the Al-Qadir Trust case”.\nThe minister asked Imran Khan to refrain from comparing the PML-N with the PTI, which had waged a war against the country.\nBy blackmailing the former NAB chairman and abducting Tayyaba Gul, Imran Khan lodged multiple fake cases against his political opponents, she said while citing a drug case against Interior Minister Rana Sanaullah as an example.\nShe said Imran Khan-led government sent the PML-N leaders into jail on the pretext of fake and fabricated cases.\n“Our daughters and sisters became the target of your cruel revenge. Maryam Nawaz was arrested in front of her father,” she said, adding the PML-N chief organizer was put into death cell considering her weakness of Nawaz Sharif.\nShe said Imran Khan should read judgments delivered in the cases against the PML-N leadership and should be ashamed of him for carrying out political vendetta during his government’s tenure.\n“These pictures are not created through artificial intelligence like you [did], but are living proofs of the worst fascism of your dark era,” she said while referring to the pictures she tweeted.\nMarriyum regretted that the first two rows of the opposition benches, including the then opposition leaders, were sent to jail to silence dissenting voices.\n“Hamza Shehbaz, the then opposition leader of Punjab, was put in jail because he used to question Imran Khan’s theft, incompetence and hostility towards masses,” she added.\nThe minister maintained that the cases against the PTI leaders and workers were filed for burning the building of Radio Pakistan, hospitals, mosques, ambulance and schools as well as for attacking the military installations.\nReferring to the courage shown by the PML-N leadership during Imran Khan’s tenure and abrupt departure of the PTI leaders from the party, she said, “This is the difference between an actual political party and the armed groups who hide under political cloak.”\nIn the 75 years of the country’s history, she said, political leaders had done opposition, but it was only Imran Khan who had become hostile towards the country.\nShe said the PML-N leadership bravely faced Imran Khan’s oppression to protect the country, democracy and politics, and it would continue to do so.",
  "retrievedAt": "2025-08-11T08:32:29.769Z"
}
