{
  "title": "Former Saudi Ambassador Riaz Al-Khatib remembered for strengthening Pak-Saudi ties",
  "link": "https://www.app.com.pk/national/former-saudi-ambassador-riaz-al-khatib-remembered-for-strengthening-pak-saudi-ties/",
  "date_published": "2023-05-23T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Former Saudi Ambassador Riaz Muhammad Fawad Hassan Al-Khatib, who played a significant role in strengthening the ties between Saudi Arabia and Pakistan, was fondly remembered on Tuesday.\nSaudi Press Attaché Dr. Naif Al-Otaibi took to Twitter to pay tribute to the former ambassador, highlighting his notable achievement of inaugurating the King Faisal Library at the University of Engineering and Technology (UET), Lahore. The inauguration took place on May 23, 1978.\nDuring the inauguration, the ambassador revealed that the King Faisal Library boasted an impressive collection of 52,000 books and references. This establishment served as a beacon of knowledge for the students and faculty of UET, Lahore offering a wealth of resources to aid in their academic pursuits.\nIn addition to the vast collection of books, the ambassador also unveiled an exquisite oil painting of King Faisal, further immortalizing the revered leader’s legacy.\nThe following tweet received widespread attention, as social media played a significant role in spreading the news far and wide. Thousands of individuals from various walks of life had the opportunity to view the tweet and express their admiration for the strong bond between Saudi Arabia and Pakistan.\nIn response to Dr. Naif Al-Otaibi’s tweet, senior journalist Sohail Iqbal Bhatti nostalgically commented, “Golden memories of two great brotherly countries.” This sentiment echoed the sentiments of many who recognized the profound significance of the King Faisal Library as a symbol of friendship and cooperation between Saudi Arabia and Pakistan.\nThe King Faisal Library continues to stand as a testament to the enduring friendship between the two nations, serving as a reminder of the shared values and cultural ties that bind them together. Its significance extends beyond its physical presence, embodying the ideals of knowledge, collaboration, and diplomatic harmony cherished by both Saudi Arabia and Pakistan.",
  "retrievedAt": "2025-08-11T08:32:35.452Z"
}
