{
  "title": "PTCL distributes ration packs over 7000 families in 30 cities",
  "link": "https://www.app.com.pk/national/ptcl-distributes-ration-packs-over-7000-families-in-30-cities/",
  "date_published": "2020-05-20T01:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):Pakistan Telecommunication Company Limited (PTCL) in its massive nationwide drive to support underserved communities affected by the COVID-19 pandemic has distributed ration packs over 7000 families in 30 cities across the country including Azad Jammu Kashmir and Gilgit-Baltistan.\nPTCL has taken numerous measures to provide support to the people in these trying times during the month of holy Ramazan, said, a news release.\nA comprehensive nationwide Ramazan ration drive activity started on May 8, concluded successfully with the assistance of philanthropic partners, Alkhidmat, Saylani and Akhuwat.\nPTCL has also provided support to the Shaukat Khanum Research Center for the purpose of augmenting its testing facilities. Moreover, the company has sponsored the Pakistan Red Crescent Society (PRCS) 120-bed Quarantine Facility in Rawalpindi and also provided Personal Protective Equipment (PPE) for approx. 500 frontline workers to the National Disaster Management Authority (NDMA).\nChief Human Resource Officer, PTCL Syed Mazhar Hussain said, “This is a moment of great pride for PTCL as our Razakaar force has significantly contributed through their efforts to support the nation during the ongoing crisis. Furthermore, our employees have also donated generously to the PTCL Razakaar Trustto support deserving communities across Pakistan. During the pandemic, PTCL has made concerted efforts to not only keep the nation connected, but also spread happiness and positivity amongst people to observe Ramazan in its true spirit.”\nPTCL, being a socially aware and responsible organization, is committed to extend its support for worthy causes that enhance the lives of individuals and communities during the pandemic.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:23.965Z"
}
