{
  "title": "Palestinian president ends security agreements with Israel, US",
  "link": "https://www.app.com.pk/national/palestinian-president-ends-security-agreements-with-israel-us/",
  "date_published": "2020-05-20T00:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):Palestinian President Mahmoud Abbas on Wednesday declared an end to the agreements and\nunderstandings signed with Israel and the United States and turned over responsibility on the\noccupied territories back to Israel.\n“The Palestine Liberation Organization and the State of Palestine are absolved, as of today,\nof all the agreements and understandings with the American and Israeli governments and of\nall the obligations based on these understandings and agreements, including the security\nones,” Abbas declared at an emergency meeting held in Ramallah, the Palestinian city\nlocated in the West Bank.\nThe meeting was held to discuss Israeli plans to annex parts of the occupied Palestinian\nland as declared in the new Israeli government’s coalition agreement, the embassy of Palestine\nin Islamabad said here quoting Palestinian News Agency, Wafa.\nPresident Abbas said the Israeli occupation authority had to shoulder all responsibilities and\nobligations in front of the international community as an occupying power over the territory of\nthe occupied state of Palestine, “with all its consequences and repercussions based on\ninternational law and international humanitarian law, particularly the Fourth Geneva Convention\nof 1949”.\nThe president mentioned that the Convention held the occupying power responsible for the\nprotection of the civilian population under occupation and their property, criminalized punishment,\nbanned theft of resources, appropriation and annexation of land, banned forced transfer of the\npopulation of the occupied territory and also banned transfer of the population of the occupying\nstate (the colonialists) to the land it occupies.\nIn his speech, President Mahmoud Abbas referred to the provisions of the Israeli government\ncoalition agreement, which stated that “the Prime Minister will be able to bring the agreement that\nwas reached with the United States on applying sovereignty starting on 1 July 2020 to the\nCabinet and the Knesset'”\nHe also mentioned the speech of the Prime Minister of the occupation government at the\nKnesset the day before yesterday, which he said, did not include anything about commitment\nto the signed agreements, rather asserted the application of Israeli sovereignty on the Israeli\ncolonies in the Palestinian territories.\nThe Palestinian president rejecting the so-called “deal of the century” said it meant that the\noccupation authority had annulled the Oslo Agreement and all agreements signed with it.\nHe said the American administration recognized Jerusalem as capital of Israel and moved its\nembassy there, its publication of the deal, which set the base for the Israeli annexation declaration\nas a blatant violation of the resolutions of the international legitimacy and international law.\nHe reiterated firm adherence to the right of Palestinian people to continue in their national\nstruggle to end the occupation and establish the independent, contiguous and sovereign state\nof Palestine on the June 4, 1967 borders with East Jerusalem as its capital, solve the refugee\nissue based on the Arab Peace Initiative and release of the Palestinian prisoners from Israeli\njails and detention centers.\nPresident Abbas stressed a just and comprehensive peace based on the two-state solution,\nas came in the Arab Peace Initiative and the resolutions of the international legitimacy,\nparticularly Security Council resolution 1515 regarding adopting the Arab Peace Initiative,\nresolution 2334 on Jerusalem and settlements, UN resolution 194 on refugees, and UN\nGeneral Assembly resolution 19/67 on the membership of the state of Palestine in it.\nHe held the American administration fully responsible for the oppression befalling the\nPalestinian people, terming it a “primary partner with the Israeli occupation government\nin all its aggressive and unfair decisions and measures against our people”.\nPresident Abbas reaffirmed commitment to the international legitimacy and the relevant\nArab, Islamic and regional resolutions, and also to fighting international terrorism regardless\nof its shape or source.\nHe called upon the countries that did not yet recognize the state of Palestine to quickly\nrecognize it to protect peace, international legitimacy and international law, and to implement\nthe Security Council resolutions on providing international protection to our people in their\noccupied state.\n“We vow to our martyrs and heroic prisoners and wounded that we will remain loyal to the\noath until victory, freedom, independence and return, to raise together the flag of Palestine\nover Al-Aqsa Mosque and the Church of the Holy Sepulcher in our Jerusalem, the eternal\ncapital of our Palestinian state,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:24.268Z"
}
