{
  "title": "India using IOJ&K lock-down to cover trails of its brutalities",
  "link": "https://www.app.com.pk/national/india-using-iojk-lock-down-to-cover-trails-of-its-brutalities/",
  "date_published": "2020-05-20T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):The ongoing lockdown to avoid COVID-19 outbreak in the Indian Occupied Jammu and Kashmir (IOJ&K) is proving as double whammy for the Kashmiris who have already been enduring a worst kind of situation after Modi’s fascist government illegally annexed it through controversial legislation.\nAround the Muslim world, the COVID-19 outbreak has dampened the usual life activities during the holy month of Ramadan, but in IOJ&K, the lockdown measures turned into a nightmare as the people were prevented from attending congregational prayers and social gatherings.\nAmid the pandemic, on March 31, India promulgated a new domicile law as part of broader extremist and fascist policies of the Rashtriya Swayamsevak Sangh (RSS), directly under the influence of German Nazi and being frantically implemented by Modi’s Bharatiya Janata Party.\nEarlier, India had unilaterally abrogated Article 370 in August last year eliminating special status of the occupied valley which blatantly flouted resolutions of the United Nations Security Council.\nThe latest illegally promulgated law aimed at demographic flooding in IOJ&K, allowing non-Kashmiris to obtain property and compete for government jobs thus impacting the Kashmiri Muslim population.\nDemographic flooding as a colonial strategy had already been used by Israel along the West Bank.\nTaking advantage of the COVID-19 situation, the Indian forces accelerated pace of crackdowns on Kashmiri residents, journalists, rising policing powers and enhanced curfew measures. These actions clearly suggested that the Indian government is exploiting the pandemic to accelerate its nefarious ambitions in the disputed territory.\nDuring these measures, a number of youths were martyred; scores tortured, injured with senseless use of pellet guns, hundreds of people including women and children were forced to spend nights in the open during hours long cordon and search operations by the Indian troops.\nContingents of Indian army, special operations group and paramilitary Central Reserve Police Force were seen regularly driving their armoured vehicles to different areas of IOJ&K to terrorise the Kashmiri.\nThere were also rampant cases of Indian troops subjecting inmates to brutal torture during door-to-door search operations.\nThe coronavirus-linked restrictions in Indian-administered Kashmir were enforced after the first positive case of COVID-19 was confirmed in Srinagar on March 18.\nAuthorities in IOJ&K too have barred people from offering Taraweeh prayers in gatherings. Srinagar’s grand mosque — Jamia Masjid — is also shut.\nMoreover, due to inadequate health facilities, COVID-19 cases were showing a spike with dozens of deaths.\nThe discrimination against Muslims as minority has now become a hallmark of Modi’s government as evident with treatment of the Kashmiri populace.\nVoicing alarm, Sam Brownback, the US ambassador-at-large for international religious freedom, in a statement pointed to both physical and online attacks against Muslims in India and IOJ&K.\n“In India, we’ve seen reports of unfortunate COVID-related rhetoric and harassment, particularly against the Muslim community, exacerbated by fake news reports – misinformation – being shared via social media,” he maintained.\nSimilarly, the International Commission of Jurists (ICJ) had also raised the alarm bells over the “discriminatory” enforcement of laws against Muslims and other minority communities during the lockdown.\nMedia watchdogs and rights groups also joined the chorus calling police actions against journalists in Indian-administered Kashmir as “brazen attacks” on freedom of expression.\nA 38-year-old Geelani, a journalist was charged by police with “indulging in unlawful activities through his posts and writings on social media”. The action against him came two days after Ashiq, another reporter was charged with filing a “factually incorrect” news story which the police said “could cause fear or alarm in the minds of the public”.\nPhotojournalist Zahra, 26, was also charged under the stringent Unlawful Activities (Prevention) Act over “anti-national” social media posts.\nThe concocted cases against the three Kashmiri journalists were described as a “misuse of power” with an aim to “strike terror” into the disputed region’s media community.\nIn the latest developments, the Indian forces also demolished dozens of shops and residential houses in Pampore town of Pulwama district in the occupied valley of Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:15.499Z"
}
