{
  "title": "DRAP approves five clinical studies on Covid-19 patients",
  "link": "https://www.app.com.pk/national/drap-approves-five-clinical-studies-on-covid-19-patients/",
  "date_published": "2020-05-20T05:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):A meeting of Clinical Study Committee of Drug Regulatory Authority of Pakistan (DRAP) on Wednesday approved five clinical studies on Covid-19 patients.\nThe meeting was held under the chairmanship of Dr Abdur Rashid, Director of Division of Pharmacy Services, DRAP.\nThe Shaukat Khanum Hospital Lahore in collaboration with the World Health Organization (WHO) will conduct Solidarity Clinical Studies at five sites, including Pakistan Institute of Medical Sciences (PIMS) Islamabad, Shifa International Hospital, Agha Khan University Hospital and Indus Hospital on Covid-19 patients.\nDr Tahir Shamsi was given approval for plasma study at the Pathology Department, Hayatabad Medical Peshawar Complex , while PIMS was also given approval after long discussion of Protect International trial along with Pro Javed Akram, University of Health Sciences Lahore.\nThe application of Jinnah Burn Centre Lahore of stem cells was differed to Prof Dr Riaz Ur Rehman Committee on stem cells while application of Prof Dr Muhammad Umra, Vice Chancellor Rawalakot Medical College on plasma was also approved.\nSimilarly, four studies of Clinical Research Centre of Karachi University were approved on Lamotrigine tablets, Rivaroxaben tablets, Ticagrelab tablets and Rosuvastatin tablets by the Clinical Study Committee.\nFour studies of Pharma Professional Services Karachi were rejected on technical grounds and to protect the patients.\nThe study of Getz Pharma Karachi was deferred due to deficiencies of documents. Agha Khan University study on TB for Phase III clinical trial and its protocol was approved.\nThe Sub-Committee on National Data Safety Monitoring was approved by the Clinical Study Committee. Prof Aziz Ur Rehman, Prof of Medicines was nominal Chairman and Dr Abdur Rashid, Director Pharmacy Services was designated of the Sub Committee.\nOther members are Prof Abdul Basit Baqai Medical University Karachi, Dr Zeeshan Danish, University of Punjab, Dr. Salman Shahid Additional Secretary Specialized Healthcare, Government of Punjab, Dr Suhail Additional Secretary Primary and Secondary Healthcare Punjab, Prof Chaudhry Iqbal Hej Karachi, Dr Asma Zaka Rashid Latif Medical College and five other members.\nThis sub-committee will review the clinical study for subject safety, and efficacy. It will make recommendations on clinical study committee regarding modifications or termination of the trial.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:19.361Z"
}
