{
  "title": "Govt proposes 39 amendments in election laws to ensure transparency",
  "link": "https://www.app.com.pk/national/govt-proposes-39-amendments-in-election-laws-to-ensure-transparency/",
  "date_published": "2020-05-20T05:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):The Pakistan Tehreek-e-Insaf (PTI) government, which has been working on its electoral reforms’ agenda efficiently, has proposed 39 amendments in the election laws to make voting process more free, fair and transparent.\nAddressing a joint press conference, Minister for Education Shafqat Mahmood and Minister for Narcotics Control Azam Khan Swati on Wednesday said efforts would be made for evolving a consensus among all the political parties on the electoral reforms.\nThey said strict sentences had been recommended in these amendments on interruption in smooth holding of the election or making the voting process doubtful. There was also a suggestion to hold future Senate elections through ‘show of hands’ rather than secret balloting to avoid horse-trading.\nAzam Swati said,“Although we need majority to pass these laws from the parliament but we are hopeful that all the political parties will study the amendments and make their support. This initiative has been taken for the first time after 1973 to hold all forms of elections in the country without any reservation.”\nHe added that under these amendments, the election plan would have to be presented four months before the date fixed for polling. Certain amendments had also been proposed to ensure deployment of impartial polling staff or taking action on biased conduct of a presiding officer towards polling agents.\nShafqat Mehmood said unlike the present practice, there was a suggestion that the from political parties should submit the names of their candidates for special women seats after holding of the general election to give chance to unsuccessful potential candidates.\nHe said the use of biometric system in the election was mandatory to remove doubts about transparency in manual polling process. He, however, added that still many things had to do on proper use of electronic voting machines.\nHe said the amendments were related to the pre-election activities, election day activities and polling results, besides the deployment of impartial polling staff. He added that there were also suggestions about sharing of electoral rolls to the candidates and post-election activities.\nHe said the amendments also covered several other aspects with an objective to avoid any illegality and ensure transparency to maintain voters’ trust in the election process.\nHe expressed the hope that the amendments would be passed with the consensus and support of all political parties.\nHe said as per law the prime minister had the mandate to select members of his cabinet as minister, special assistant or advisor. The practice of appointing technocrats in the cabinet was common in the world for smooth functioning, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:19.143Z"
}
