{
  "title": "Pakistan supportive of sustainable peace in Afghanistan: President Alvi",
  "link": "https://www.app.com.pk/national/pakistan-supportive-of-sustainable-peace-in-afghanistan-president-alvi/",
  "date_published": "2020-05-20T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):President Dr Arif Alvi on Wednesday said Pakistan supported sustainable peace in Afghanistan\nand wanted to maintain good relations with its neighbouring country.\nAddressing at the distribution ceremony of ration packs among Afghan refugees here, the\npresident said Pakistan welcomed the recent peace efforts in Afghanistan, aimed at ensuring\nbringing stability to the conflict-hit country.\nPresident Alvi said Pakistan would extend similar treatment to Afghan refugees in the wake of\nprotection against coronavirus, along with general public.\nHe said the some states as champions of human rights showed their real face by closing doors on\nmigrants. On other hand, he said, Pakistan hosted millions of Afghan refugees for last 35 years and\nTurkey helped out thousands of refugees coming in from Syria as a gesture of humanity.\nThe President said helping the needy through Zakat and charity was an important side of Islamic\nteachings.\nHe said as COVID-19 impacted all segments of society, the only way to remain safe was to follow\nsafety measures.\nHe stressed maintaining social-distancing and wearing masks in Bazars and mosques.\nFor Eid, he said the prayers could be held within homes to ensure protection of nears and dear\none from the pandemic.\nHe recalled formulating a 20-point Standard Operating Procedures for Taraweeh at mosques.\nPresident Alvi said Pakistanis as a responsible nation, needed to adopt precautionary measures\nfor the safety of all.\nFirst Lady Samina Alvi, Federal Minister for SAFRON Sahibzada Mehboob Sultan, Managing\nDirector Baitul Maal Aon Abbas Bappi, Turkish ambassador Mustafa Yardakul, the Afghan\nAmbassador and senior officials were present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:19.018Z"
}
