{
  "title": "Haleem announces to expose PPP’s new corruption network soon",
  "link": "https://www.app.com.pk/national/haleem-announces-to-expose-ppps-new-corruption-network-soon/",
  "date_published": "2021-10-07T16:08:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 07 (APP): Leader of the Opposition in Sindh Assembly, Haleem Adil Sheikh, Thursday said that a new corruption network was active in the province and he was going to expose it in coming days.\nHaleem Adil Sheikh, while speaking at a press conference along with Special Assistance to the Prime Minister on Sindh Affairs Arbab Ghulam Rahim here at Sindh Assembly building, said that previously we used to hear about Tapi, Adee, Zardari, Younas and other systems looking after affairs of corruption in the province but nowadays a new system was in place.\n“The system led by Bilawal Zardari and CM Sindh Murad Ali Shah is comprised of some women and a few young men and it looked after all the matters related to corruption in all the provincial departments and projects,\nHaleem alleged adding that he was going to unmask the people who were part of that system before the media in coming days. Murad Alli Shah has violated sanctity of the office of chief minister and CM house has become head quarter of corruption mafia in Sindh, Haleem Adil alleged.\nHaleem Adil Sheikh applauded Arbab Ghulam Rahim’s honesty and righteousness and said that Arbab Rahim spent three and a half year in the same CM house but not a single allegation of corruption was framed against him.  Earlier, speaking to media, Arbab Ghulam Rahim said that Pakistan Tehreek-e- Insaf has decided to observe month of Rabi-ul-Awal with due reverence and religious sanctity in every nook and corner of the country.\nHe said that Prime minister Imran Khan chaired a meeting at Sindh Governor House through videolink and directed to arrange events at divisional, district and tahsil level to highlight life and teachings of Prophet Hazrat Muhammad (PBUH), basic principles of state of Madina and Islamic values.\nPrime Minister Imran Khan has become leader of Muslim Ummah and he was advocating point of view of Muslims throughout the world. Arbab said adding that PTI government has taken important decision in perspective of regional peace and situation of Afghanistan.\nHe said that Prime Minister Imran Khan was on the path of achievement of objectives for which Pakistan was created and he wanted to take religious scholar  of all schools of thought on board.Responding to a query on NAB amendment ordinance, Arbab said that Constitution allows legislation through ordinance when Parliament is not in session. The ordinance would be tabled in the Parliament as well, he added.\nFederal government has issued Health Card to every person of Tharparkar district to ensure their access to better medical facilities, Arbab said answering another question and alleged that Sindh government did not want to extend the facility of health card to other districts of the province.\nArbab Rahim said that after devolution of powers PPP government was keen to take control of Jinnah Hospital but they failed to manage affairs of the hospital and now even employees of the hospital were demanding to hand over the hospital to federation.\nArbab Rahim claimed that he constructed roads in Tharparkar to provide better communication facilities to people of the most under-developed district of Sindh while project of new assembly building was also proposed by him.\nArbab said that his picture was removed from CM House while inauguration plaque of new Sindh Assembly building was also removed.",
  "retrievedAt": "2025-08-11T21:24:49.880Z"
}
