{
  "title": "Asad Umar questions UK’s reasoning for not accepting Chinese vaccines",
  "link": "https://www.app.com.pk/national/asad-umar-questions-uks-reasoning-for-not-accepting-chinese-vaccines-2/",
  "date_published": "2021-10-07T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP): Minister for Planning and Development Asad Umar Thursday questioned the reasoning behind UK authorities’ decision of not accepting the Chinese anti-COVID vaccines which raised concerns among Pakistanis.\nThe minister took to Twitter to criticize the UK government which he said decided to accept “gora (western) certificates & vaccines but not “most non gora vaccine certificates and Chinese vaccines.”\nThe UK had taken Pakistan off Travel Red List on September 22 after being on no-travel list for five months.\nHowever, as per the latest decision, the UK would still not accept Chinese vaccines.\nAs most of the Pakistan’s population has got Chinese vaccines, therefore they would need to self-isolate for up to 10 days which is being dubbed as UK’s discriminatory approach vis-à-vis Pakistan that has always given significant importance to its relations with the UK.\nThe planning minister said the UK took the decision despite widespread evidence of fake certificates in US and Europe.\n“Chinese vaccines are WHO approved. Health considerations or hangover of a colonial mindset?,” the minister questioned.\nThe UK’s High Commissioner in Pakistan Christian Turner; however said the UK would accept Pakistan’s vaccine certificates issued by NADRA. The statement has generated a muddle as to what is the actual status of Pakistani visitors.\nThe WHO had validated the Sinovac-CoronaVac vaccine for use in June 2021 while assuring countries, funders, and communities that the vaccine meets international standards for efficacy, safety, and manufacturing.\nUnlike UK, the US authorities are ready to welcome fully vaccinated foreigners from early November 21, as long as they have had a full course of one of the medications listed for emergency use by the World Health Organization, including those from Chinese developers Sinopharm Group and Sinovac Biotech Ltd. that aren’t used in the US.\nSaudi Arabia has announced to accept six vaccines including Pfizer/BioNTech, Oxford, AstraZeneca, Johnson & Jhonson, Moderna, Sinopharm and Sinovac. Qatar has approved Oxford/ AsraZeneca, Johnson & Johnson and Sinopharm for the travelers. Four vaccines got the nod in the Emirates including Sinopharm, Oxford/AstraZeneca, i.e Covishield, Pfizer/BioNTech, Sputnik V and Moderna.\n71 countries of the world validly accepts Chinese vaccination particularly Sinopharm and Sinovac including many EU countries like Austria, Finland, Greece, Netherlands, Spain, Sweden, Switzerland etc.\nAccording to the critics, the decision is not only discriminatory but also seemed to be politically motivated.\nMuhammad Tariq Khan, a UK-based social activist, said the UK had given Pakistan a temporary relief by removing from Red List just to divert the anger over Cricket Tour cancelation.\n“Now within weeks imposed a new restriction, Chinese Vaccine not accepted, Knowing full well that majority of Pakistanis got Chinese vaccines,” he said on Twitter.\nThe Pakistani citizens have urged the UK authorities to undo the decision as it was illogical since it lacked realistic data as primary consideration behind the move.\nThe UK restrictions will cause inconvenience to a large number of Pakistani students, expats and professionals, who regularly travel to the UK.",
  "retrievedAt": "2025-08-11T21:24:51.518Z"
}
