{
  "title": "Any wait-and-see approach on Afghanistan tantamount to abandonment: Moeed",
  "link": "https://www.app.com.pk/national/any-wait-and-see-approach-on-afghanistan-tantamount-to-abandonment-moeed/",
  "date_published": "2021-10-07T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP): Calling any wait-and-see approach on Afghanistan to be tantamount to abandonment, Pakistan called for a holding a major donor conference to formulate immediate humanitarian and economic relief plans for averting risks of instability and terror threat to the entire world.\n“A wait-and see approach, although more politically tenable for many countries, would be tantamount to abandonment… A starting point could be a major donor conference where regional players and Western countries sit together and draw up specific plans for immediate humanitarian and economic relief,” said Moeed Yusuf, Prime Minister’s National Security Advisor.\nIn an article published in US-based journal Foreign Affairs Thursday, the NSA said President Joe Biden was right to end the U.S. military mission in Afghanistan and “today, Afghanistan faces a choice: it can either walk the arduous path of peace or revert to civil unrest. The latter will have catastrophic repercussions for the Afghan people and spillover effects for the neighborhood and beyond.”\nHe said the spread of refugees, drugs, weapons, and transnational terrorism from a destabilized Afghanistan does not serve the interests of the Afghan people nor the rest of the world, most of all Pakistan.\nHe said as Pakistan can and will assist in pushing Afghanistan in a positive direction, it alone cannot guarantee the outcomes we all desire.\nHe said Pakistan does not wield any extraordinary influence over the new rulers in Kabul, as both monetary assistance and legitimacy for the Taliban can only come (or not) from the world’s major powers.\n“History will judge us very poorly if we do not create the most conducive possible environment to push them in a healthy direction—for the collective benefit of Afghans and the world.”\nHe said any failure to do so will leave Pakistan to bear the brunt of any negative spillover from Afghanistan. “We have already carried more than our share of the burden,” he said referring to Pakistan’s sacrifices in US-led war on terror.\nReferring to Ashraf Ghani regime, he said it was clearly unable to sustain itself, and propping it up with billions more dollars would only have delayed its inevitable collapse.\nHe said apart from the Afghan people, Pakistan has been the greatest victim of the wars in Afghanistan. The Soviet invasion in 1979 and the subsequent U.S.-led military campaign after 9/11 were not of Pakistan’s making. Yet our society, polity, and economy bore the brunt of the conflict over the last four decades.\nIn 2001, he said Pakistan joined the U.S. war on terrorism against the very same actors who were hailed as freedom fighters when Washington and Islamabad together trained and backed them to defeat the Soviets in the 1980s. After the 9/11 attacks, the United States issued an ultimatum to Pakistan’s military dictator General Pervez Musharraf that he was either “with us or against us.” Under pressure, he provided the United States and its partners with virtually unconditional support, including access to our airbases, ground and air supply routes, and helped to arrest hundreds of members of al Qaeda.\nThe post-9/11 decision to launch a military campaign against Afghanistan’s erstwhile freedom fighters, many of whom had deep cultural and ethnic affiliation with tribesmen in the Pakistan-Afghanistan border regions, resulted in a massive insurgency against the Pakistani state.\n“Over 50 militant groups sprang up, seeking to punish the Pakistani state for collaborating with the United States. They targeted our cities and massacred our children; 3.5 million civilians were displaced from their homes at the height of this onslaught. In the last 20 years, Pakistan has suffered over 80,000 casualties as a result of terrorist attacks, as well as over $150 billion in economic losses,” he stated.\nMoeed Yusuf said the cost of providing for Afghan civilians fleeing war in their home country has also largely fallen on Pakistan as the country hosted approximately four million Afghan refugees even today.\nFurthermore, Afghanistan’s chaos brought a “Kalashnikov culture” and narco-trafficking to Pakistan: our country’s addiction rates rose nearly 50 times.\nYet, Western governments continued to accuse the Pakistani state of being duplicitous and asked us to “do more” to turn the tide of the war in Afghanistan.\nThis disconnect colored the Pakistan-U.S. partnership for the better part of the last two decades. At its core, it stemmed from a divergence of views on how to end the war and bring peace to Afghanistan.\n“The United States’ solution was to achieve a total victory over the Taliban. Even when Washington began considering negotiations with the group, many American officials saw it as a means of creating internal fractures within the Taliban rather than negotiating an even-handed deal.”\nThe NSA said the Pakistani government spoke hard truths to the United States about the folly of its plans. Pakistan urged the United States and its NATO allies to recognize that al Qaeda had been dealt a severe blow and that, even as Western powers continued their mission against international terrorist groups, they needed to recognize that the Taliban were a political reality in Afghanistan.\nA decade ago, when U.S. troop numbers were at their peak, Pakistan counselled using this leverage to negotiate an acceptable political settlement to the war. “Washington ignored this advice, and talks never became the principal pillar of U.S. strategy.”\nYusuf said many Western governments turned a blind eye to their and the Afghan government’s failures, which were helping resuscitate the Taliban. Nevertheless, Pakistan engaged with the government in Kabul with sincerity of purpose.\nHe said all of Pakistan’s requests were turned down, ignored, or actively resisted. For instance, as early as 2007 Afghan authorities physically tore down border biometric systems Pakistan was installing under the flimsy pretext that Afghanistan did not recognize the international border and was therefore opposed to physical controls.\nIt stands to reason that if the porousness of the border was really the Afghan government’s chief concern, it would have moved swiftly to help Pakistan monitor it effectively.\nHe said the government in Kabul was unwilling or unable to fix these internal failures, so it shifted attention and blame onto Pakistan. This also suited countries that were pouring billions of dollars into Afghanistan, with little to show for it in terms of defeating the Taliban.\nThe advisor wrote that focus on the border also masked the reality that terrorists based in Afghanistan were collaborating with our arch rival, India, and with elements in the Afghan intelligence services to regularly carry out attacks inside Pakistan.\nAs Pakistan publicly detailed in a report released last year, India ran as many as 66 training camps in Afghanistan for groups like the Pakistani Taliban and other militant organizations active in our western province of Balochistan.\nHe said with Indian support, these groups conducted targeted killings across Pakistan and high-profile attacks on Pakistan’s largest stock exchange, a major university, and a luxury hotel in the port city of Gwadar, among many others. Simultaneously, India worked to taint Pakistan’s reputation through an orchestrated propaganda campaign, using fake news networks to perpetuate a diversionary narrative that sought to blame Pakistan for Afghanistan’s failings.\nMeanwhile, the United States kept pressing for Pakistan to further escalate its own military campaign against the Afghan Taliban. The truth, however, is that the group had no organized presence in Pakistan and military action against a few dispersed individuals—who may from time to time have managed to melt away among the thousands of Afghan refugees—would not have changed the outcome in Afghanistan, but would have left thousands more Pakistanis martyred.\n“An escalation was therefore unacceptable to us, as we repeatedly conveyed to the United States for over a decade. Our alternative of leading with a political dialogue that forced all sides to compromise, supplemented by military and other tools as needed, would have produced a naturally inclusive government while ending the conflict years earlier. And yet every time we raised this, we were seen as insincere.”\nMoeed Yusuf said the rapid collapse of former President Ashraf Ghani’s administration has left no doubt that the government’s failures were not of Pakistan’s making.\n“Corruption, bad governance, refusal of Afghans to stand behind their government and state, and the 300,000-strong Afghan National Security Forces’ choice not to fight against a lightly armed insurgency lie at the heart of the return of the Taliban.”\nHe said shockingly, some voices in Washington and other Western capitals continue to scapegoat Pakistan for this failure. But blaming Pakistan is not only factually incorrect—it also undermines the spirit of international cooperation necessary to end the cycle of violence that has devastated Afghanistan, he added.\nSuggesting the way forward, the NSA said Afghanistan deserves peace and prosperity, and a blame game among international actors will not get us there. Nor will a repeat of the mistakes of the 1990s, when the United States abandoned Afghanistan and sanctioned Pakistan.\nHe said the prudent way forward is for the international community to engage constructively with the new government in Kabul. The goal must be to create the conditions for Afghan civilians to earn a respectable livelihood and to live in peace. This will require the international community, especially the countries who were present in Afghanistan for two decades, to play a positive role in leveraging their influence to further the cause of peace and stability.\nThe adviser said Pakistan has been at the forefront of international humanitarian efforts since the fall of Kabul. It has helped evacuate approximately 20,000 foreign citizens and Afghans from the country, as well as creating an air and land bridge to channel emergency supplies to the country.\n“These efforts are important, but diplomatic engagement with Afghanistan must go much further. Afghanistan does not have the resources or institutional capacity to stave off economic disaster on its own. In order to ensure a durable peace, the international community must determine the means through which development assistance can be provided, while ensuring that its concerns about the situation in the country are addressed. But given the precarious humanitarian and economic situation in Afghanistan, time is of the essence.”\nHe said just like the western governments, Pakistan too wants an Afghanistan state that is inclusive, respects the rights of all Afghans, and ensures that Afghan soil is not used for terrorism against any country.\nHe said unlike the 1990s, the Taliban have repeatedly stated their interest in continued engagement with the world. “This is an opportunity for the international community—the leverage generated through assistance and the legitimacy Taliban will derive from it can be used to secure inclusive governance from the new government.”\nHe said the Western diplomacy needs to be better connected with regional initiatives to forge a common agenda for engagement and decide on the multilateral and bilateral avenues available to channel assistance.\nAn understanding is also required on the terms of the release of the Afghan central bank’s reserves, most of which are held by the United States. Such a forum could also be used to encourage countries that have unfinished development projects in Afghanistan to consider completing them for the benefit of the Afghan people.\n“A coordinated global approach will reduce the risks of international divisions over how best to engage the Taliban. While it is important to remain realistic about what is achievable in the present context, this approach will improve the prospects for an outcome that benefits the average Afghan and is acceptable to the international community.”\nHe said Pakistan and Afghanistan share a more than 1600-mile border and cultural links that stretch back centuries. These geographical and societal connections compel Pakistan to advocate for peace in Afghanistan, as instability there risks spilling over into our country.\n“The Pakistani Taliban, the Islamic State, and other anti-Pakistan groups in Afghanistan cannot be allowed to harm Pakistan. Nor are we in a position to accept more Afghan refugees, who will inevitably be driven onto our soil by another spasm of violence in their home country.”\nHe said the livelihoods of millions of Afghans are linked to Pakistan as being landlocked, Afghanistan depends on Pakistan for trade and transit. The country’s geographical position could become an advantage if it transforms itself into a transit hub that connects Central Asia to Pakistan’s warm waters. The Ghani government had stalled these possibilities, snubbing Pakistan’s offers for more streamlined trade and economic cooperation and fast-tracking of connectivity projects with Central Asia.\n“Such connectivity is not only key to Pakistan’s geoeconomic vision, but it also corresponds with the U.S.-led regional vision of establishing economic linkages between Uzbekistan, Afghanistan, and Pakistan.”\nYusuf said multiple such projects are already underway, including energy and electricity inflow from Central Asia, a trans-Afghanistan rail project from Uzbekistan, and projects to upgrade the road infrastructure to create a viable corridor of connectivity.\nThe U.S. investments in energy, minerals, and infrastructure could potentially herald a new era of cooperation in these regions and buttress peace efforts.\nHowever, coordinated engagement involving Western powers, China, Russia, Middle Eastern countries, and Afghanistan’s immediate neighbors would maximize the chances of realizing our common objectives in Afghanistan.\nThe NSA said Pakistan is committed to peace in Afghanistan and in the region. Today, Pakistan is seeking to foster economic interdependence through regional connectivity and development partnerships, while settling political disputes amicably.\n“Afghanistan could serve as a model for this regional vision, but the international community must also play its part. By engaging with the new Afghan authorities now, the United States and other global powers can avert a humanitarian crisis, help Afghans live in peace, and ensure that the threat of terrorism emanating from Afghan soil is ended once and for all. This is not only their collectively responsibility, it is also in their self-interest.”\nOf course, he said the new Taliban authorities will ultimately have to prove that they intend to govern Afghanistan in a more inclusive manner.",
  "retrievedAt": "2025-08-11T21:24:52.519Z"
}
