{
  "title": "Awareness, early diagnosis key to protect children from rising number of ‘Eye tumor’",
  "link": "https://www.app.com.pk/national/awareness-early-diagnosis-key-to-protect-children-from-rising-number-of-eye-tumor/",
  "date_published": "2021-10-07T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP): Eye Specialists Thursday stressed for the importance of early screening of ‘Eye tumor’ and called upon the national and international stakeholders to make a comprehensive national plan for creating awareness as almost 30 percent of eye cancer patients are children in the country.\nTalking to a private news channel, a senior consultant of eye surgeon Dr Arslan Ahmed said that a healthy lifestyle, clean environment, increased awareness, and early screening have great potential to reduce the risk of ‘Eye cancer’.\nHe said social media awareness around the disease is extremely important, with healthy eating, regular, regular medicine exercise and regularly testing your blood sugar levels can profit in managing the problems in the future.\nExpert said that annually over 2200 people are diagnosed with eye cancer and the number of cases is growing on alarming stage, adding, eating a vitamin-rich diet and wearing UV-blocking sunglasses that wrap around the eyes in a protective manner are other preventive steps which can safe people from eye cancer.\nHe asked parents that they should be careful if they notice symptoms like white pupil, squint and constantly painful red eye in children.\nDr said that timely detection can save sight as the problem gets complicated if treatment is delayed that may cause vision loss, loss of the eye or may prove fatal as patients are brought to hospitals only in the final stage.\nReplying a question, he said screen time has increased across the globe including Pakistan which is a leading cause of vision-related issues in adults and children, adding, mostly individuals who spend a great deal of time looking at electronic devices and screens can protect their eyes from excessive HEV light with special filters available for smart phones, tablets and computer screens that prevent significant amounts of blue light from reaching the eyes without affecting the visibility of the display.\nAnother option is to filter out high-energy blue light with a coating added to eyeglasses or using special filtering non-corrective lenses, he suggested.\nHe said during the COVID-19 pandemic, children are spending more time than ever on digital devices to learn, connect with family and friends, and for entertainment, adding, children have their eyes checked regularly by a pediatrician starting at birth.\nIf the doctor finds a problem with your child’s vision, parents should be referred to a pediatric ophthalmologist on early stage.",
  "retrievedAt": "2025-08-11T21:24:40.999Z"
}
