{
  "title": "From Putin to Trudeau to Modi, world leaders, missions condole deaths in PIA plane crash",
  "link": "https://www.app.com.pk/national/pia-flight-carrying-91-passengers-crashed-before-landing-spokesman/",
  "date_published": "2020-05-22T06:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):The leaders from across the world and foreign missions of various countries in Pakistan Friday condoled the death of dozens of people after a Pakistan International Airlines’ passenger plane crashed in Karachi.\nThe Lahore-Karachi bound PIA flight PK 8303 crashed in the densely populated area near Karachi’s airport also damaging some houses and injuring the residents.\nIn their separate messages, Russian President Vladimir Putin, Canadian Prime Minister Justin Trudeau, Indian Premier Narendra Modi, Afghan President Ashraf Ghani, United Nations Secretary-General Antonio Guterres, Tajik President Emomali Rahmon, Nepalese Prime Minister K P Sharma Oli, OIC Secretary General Dr Yousef Al-Othaimeen and Turkish Foreign Minister Mevlut Cavusoglu conveyed their heartfelt condolences on behalf of their respective governments and people.\nThe condolences also poured in from the foreign missions of the United States, China, the United Kingdom, Australia, France, the United Arab Emirates, the Netherlands and European Union in Islamabad, besides the celebrities from across the world .\nIn a message to Prime Minister Imran Khan and President Arif Alvi, Russian President Vladimir Putin expressed his deepest condolences over the “tragic consequences” of the passenger plane crash.\n“The people of Russia share the grief of those who lost their families and friends in this disaster, and hope for a quick recovery for all who were injured,” President Putin said.\nCanadian Prime Minister Justin Trudeau, while calling the news of plane crash “devastating”, said the Canadians were keeping the victim families and friends in their thoughts.\n“The news from Pakistan this morning is devastating. To the families and friends of those … our hearts go out to you.”\n“Deeply saddened by the loss of life due to a plane crash in Pakistan. Our condolences to the families of the deceased, and wishing speedy recovery to those injured,” Indian Prime Minister Narendra Modi said on his Twitter handle.\n“My heart goes out to the families of victims who lost their lives… I offer my sincere commiserations to the people and the Government of Pakistan. Afghans stand with you in this moment of grief,” President Ashraf Ghani tweeted.\nUnited Nations Secretary-General Antonio Guterres also voiced his sorrow over the “horrendous” crash.\n“Our condolences to the Government of Pakistan on learning of this horrendous accident, as it also comes on the eve of the Eid holiday,” his spokesman Stephane Dujarric said in response to a question from APP at the regular noon briefing in New York.\n“We understand many of the passengers were going home (to celebrate Eid), which adds another level of tragedy, but our thoughts are with the families of the victims as well the government and the broader people of Pakistan.”\nNepalese Prime Minister KP Sharma Oli also took to Twitter and expressed his “heartfelt condolences to the Government of Pakistan and the bereaved family members” and wished early recovery to the injured.\nOrganization of Islamic Cooperation (OIC) Secretary General Dr Yousef Al-Othaimeen offered condolences and profound sympathy to the government and people of Pakistan as well as the bereaved families.\n“To Allah we belong and to Him we shall return,” the Muslim world body chief said quoting a Quranic verse.\nThe Chinese Embassy in Pakistan, while sympathizing with the victim families, said, “We stand with Pakistan in the time of sadness.”\n“On behalf of the US Mission to Pakistan, I offer my deepest condolences to the people of Pakistan and the families of those who lost their lives today in the plane crash near Karachi,” US Chargé d’ Affaires a.i. Ambassador Paul W. Jones said.\nIn his message, Turkish Foreign Minister Mevlut Cavusoglu condoled over the life loss in the plane crash and prayed for mercy on those who lost their lives.\n“Condolences to our Pakistani brothers & sisters. Friendly & brotherly Pakistan’s pain is our pain,” the Turkish foreign minister said on Twitter.\nAustralian High Commissioner Dr Geoffrey Shaw and British High Commissioner Christian Turner, while condoling over the tragic loss, said their offices were in touch with local authorities to determine whether any Australians were affected.\nPalestinian Ambassador Ahmad Rabaie said, “It is indeed a great loss and we Palestinians are very much grieved over the loss of our brothers and sisters…Our good wishes and prayers are with the bereaved families in this difficult time as we pray to Almighty Allah to bless them with the courage to bear such a great loss.”\nIndian Congress Leader Rahul Gandhi while expressing condolence over the tragic crash said, “News of survivors is a ray of hope & I pray that there are many miraculous stories of survival tonight.”\n“The news on the deadly accident on the eve of Eid al-Fitr broke our hearts. Our deepest condolences to those who lost their loved ones,” Azerbaijan’s foreign ministry said in a statement.\nIn their separate messages, foreign ministers of Austria, Ukraine and Latvia, Ambassador of the European Union Androulla Kaminara, UAE Ambassador Hamad Alzaabi, Netherlands Ambassador to Pakistan Wouter Plomp and French embassy in Pakistan expressed their grief and sympathized with the bereaved families.\nWorld Professional Boxing Champion Amir Khan also wrote on Twitter, “Heartbroken by the loss of life lives in a plane crash in Pakistan. My prayers are deepest condolences to the families who lost their loved ones.”\nIndian cricketer Irfan Pathan also joined the celebrities from across the world to condole the loss and said, “They (passengers) were just few minutes away from meeting their families.”\nWorld Tennis Star Sania Mirza commented, “No amount of condolences can be enough .. Heartbreaking and so so tragic.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:14:49.769Z"
}
