{
  "article_id": "2025-01-06_6437389fe27b5e9ea76b9fe2c27549b8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/anf-recovers-1231-kg-drugs-in-10-operations/",
    "retrieved_at": "2025-08-27T11:25:53.186Z"
  },
  "metadata": {
    "title": "ANF recovers 1231 kg drugs in 10 operations",
    "author": null,
    "date_published": "2025-01-06T08:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 239,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jan 06 (APP):Anti-Narcotics Force (ANF) while conducting 10 operations across the country recovered 1231 kg drugs worth over Rs 220 million and arrested nine suspects, said an ANF Headquarters spokesman on Monday. He informed that 250 grams heroin was recovered from the possession of a motorcyclist near Main Korangi Road, Karachi. The arrested suspect confessed to selling drugs to the students of educational institutions. 40 heroin-filled capsules were recovered from the stomach of a passenger going to Bahrain at Lahore International Airport. 64 ice-filled capsules were recovered from the stomach of a passenger going to Jeddah through Lahore Airport. 1208 kg hashish was recovered from two different areas of Pishin in Balochistan. 8.4 kg hashish was recovered from secret cavities of a vehicle intercepted near M-1 Interchange, Islamabad and a suspect was arrested. 3 kg heroin, 2 kg ice and 1.2 kg hashish were recovered from the possession of an accused rounded up near Daska Chowk, Sialkot. 4.8 kg hashish was recovered from the possession of two accused held near Sargodha Mor, Mianwali. In an operation, 2.5 kg heroin was recovered from secret cavities of a truck near Kamunki Toll Plaza, Gujranwala and an accused was arrested. In 10th operation, 700 grams hashish was recovered from the possession of a drug dealer nabbed near Burhan Toll Plaza, Attock. Separate cases have been registered against the arrested accused under the Narcotics Control Act and further investigations are under process.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}