{
  "article_id": "2025-01-06_ac9bffc579eebac2b42cd4d4c125499e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-declares-toshakhana-ii-case-of-further-inquiry/",
    "retrieved_at": "2025-08-27T11:24:21.193Z"
  },
  "metadata": {
    "title": "IHC declares Toshakhana-II, case of further inquiry",
    "author": null,
    "date_published": "2025-01-06T16:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 706,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 06 (APP):The Islamabad High Court (IHC) on Monday declared the Toshakhana II case against the founder of PTI as a case of further inquiry. The court said that according to the rules, action could be taken for not submitting the gift receipt. When action cannot be taken for not submitting the gift, then this is a case of further inquiry, it said. Justice Miangul Hassan Aurangzeb issued a detailed 14-page order regarding the matter. It said that the founder of PTI and his wife are accused of not submitting the gift of a Bulgarian jewelry set received from the Saudi Crown Prince to the Toshakhana. Criminal proceedings were initiated against the PTI founder and his wife for not submitting the gift to the Toshakhana. It said that according to the prosecutor, by not submitting the gift, the founder of PTI and his wife violated the procedure and a criminal breach of trust was committed. The two people were also accused of misusing their position to get undervalue market assessment of the gift. It is alleged that the national exchequer suffered a loss of Rs 32.8 million by buying a jewelry set at a lower price. The order further said that according to the FIA challan, it was necessary to submit the gift along with the gift receipt. The court said that according to the 2018 Toshakhana Rules, it was not necessary to submit the gift but only the receipt. It was not denied that the founder of PTI submitted the receipt to the Toshakhana through the Deputy Military Secretary, the order said. In the first place, action could not have been initiated for not submitting the gift. To get out of this matter, the Cabinet Division amended the Office Memorandum in 2023. The Office Memorandum was amended to include action for not submitting the gift along with the receipt. The Office Memorandum issued in 2023 could not have come into effect on actions of two years back. The FIA prosecutor also admitted that the memorandum cannot be applied to the process that took place two years ago, the court said. It further stated that according to the court's provisional determination, Toshakhana-II case is a case for further inquiry. The prosecutor had emphasized that the founder of PTI is also convicted in Toshakhana-I and is not entitled to bail. The sentence of the founder of PTI in Toshakhana-I case has been suspended due to the NAB prosecutor not objecting and requested to cancel the sentence due to irregularities in the trial and remand the case back. The court said that the FIA prosecutor emphasized that PTI founder used his influence in setting the price of the gift low. It is not the FIA's case that the PTI founder or his wife directly threatened or pressured someone. The order said the statement of Sohaib Abbasi, who determined the price of the gift, has not been recorded before the trial court yet, adding that Mr. Abbasi became an approver in the case after receiving forgiveness from the NAB chairman. The court said that nothing has come out about Sohaib Abbasi's forgiveness from the FIA officials. It said that the allegation was made in connection with the receipt of the gift money, which was actually issued in the name of Bushra Bibi, not the founder of PTI. The court said that the founder of PTI is 72 years old and was detained in this case for more than four months. After the case was transferred to the FIA, the investigating officer did not feel the need to question the founder of PTI. The reference against the founder of PTI was filed by NAB, which means that the investigation has been completed, it said. The order stated that the founder of PTI has not been indicted yet and the trial does not seem to be completed soon. The documentary evidence of the case is already in the possession of the prosecution and there is no fear of tampering. It said that the founder of PTI should not misuse the exemption from bail and appear in the trial court at every hearing. If the founder of PTI misuses the bail, the prosecution can file a petition for cancellation of bail.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}