{
  "article_id": "2025-06-03_05cffe6bba0765ef0f7341891fd8fa10",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-committed-to-sustainable-energy-future-pervaiz-malik/",
    "retrieved_at": "2025-08-27T10:45:50.785Z"
  },
  "metadata": {
    "title": "Pakistan committed to sustainable energy future: Pervaiz Malik",
    "author": null,
    "date_published": "2025-06-03T11:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 323,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 3 (APP):Federal Minister for Petroleum, Ali Pervaiz Malik, on Tuesday reaffirmed Pakistan's commitment to building a balanced, inclusive, and sustainable energy future under the leadership of Prime Minister Shehbaz Sharif. Delivering a keynote address at the Ministerial Plenary titled \"Global Cooperation for a Resilient and Sustainable Energy Future\" during the prestigious Baku Energy Week, he said Pakistan is actively working towards an energy transition that reduces dependence on fossil fuels and incorporates more renewable sources. Marking the 30th anniversary of the Baku Energy Forum, the minister congratulated Azerbaijan's Energy Minister Parviz Shahbazov and pledged Pakistan's full cooperation with the forum's goals, said a news release received here. He highlighted Pakistan's readiness to support global efforts in shifting towards a diversified and environmentally responsible energy mix. Highlighting Pakistan's growing energy needs due to industrialization, the minister said the country must increase its use of renewable energy and adopt clean technologies to meet rising demand. He stressed the importance of aligning policies to ensure a coordinated energy transition. To strengthen this coordination, the Cabinet Committee on Energy, chaired by the Prime Minister, is being revived to streamline efforts between the Petroleum and Power Divisions, he said. The minister also pointed out Pakistan's focus on expanding its gas infrastructure through local exploration efforts. \"We are thankful to the government of Azerbaijan and other friendly countries for their support in helping us localize gas resource development,\" he added. Despite economic challenges, Pervaiz Malik said Pakistan is implementing reforms to make the gas sector more efficient and sustainable. He underlined that energy conservation is also a key component of the country's strategy. \"We are committed to building a sustainable energy sector. Reform remains at the heart of the Prime Minister's vision for a resilient energy future,\" he said. The session was attended by key international figures, including Azerbaijan's Energy Minister Parviz Shahbazov, Turkish Deputy Minister of Energy, and Cristina, Director of Energy at the European Commission.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}