{
  "article_id": "2025-06-03_afb6072fed7bd5b2e2d9104f217b25bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dawat-e-islamis-fgrf-establishes-medical-center-in-egypt/",
    "retrieved_at": "2025-08-27T10:44:39.412Z"
  },
  "metadata": {
    "title": "Dawat-e-Islami’s FGRF establishes medical center in Egypt",
    "author": null,
    "date_published": "2025-06-03T18:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 3 (APP): Under the humanitarian efforts of Dawat-e-Islami's welfare wing, Faizan Global Relief Foundation (FGRF), a dedicated medical center has been established in Egypt to provide free healthcare services to Palestinian refugees displaced from Gaza. Speaking at the inauguration ceremony, Maulana Abdul Habib Attari, head of FGRF and spokesperson for Dawat-e-Islami, stated that this center has been set up specifically to serve the oppressed Palestinian patients who have taken refuge in Egypt due to the ongoing conflict, said a press release. The medical center will offer completely free treatment and medication to all patients. \"If any patient requires surgery or advanced medical care, FGRF Dawat-e-Islami will provide support to the best of its ability,\" said Abdul Habib Attari. He emphasized that this initiative reflects the deep compassion, religious duty, and unity of the Muslim Ummah that Dawat-e-Islami upholds. \"This is a shining example of FGRF's solidarity with our oppressed Palestinian brothers,\" he added. \"May Allah accept this effort and make it a means of relief and peace for the people of Palestine.\" Abdul Habib Attari further reiterated Dawat-e-Islami's commitment to the people of Gaza, stating, \"We stand with the oppressed Muslims of Gaza. Our relief activities continue inside Gaza, and we have not forgotten the refugees who have been displaced. We will assist them to the best of our capacity.\" This latest initiative highlights Dawat-e-Islami's ongoing dedication to global humanitarian efforts, especially in regions affected by crisis and conflict.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}