{
  "article_id": "2025-06-03_50fd1f7e82e5f3105d20613f8b077ab8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-takes-major-step-towards-implementing-school-meal-programmes-across-provinces/",
    "retrieved_at": "2025-08-27T10:44:43.664Z"
  },
  "metadata": {
    "title": "Pakistan takes major step towards implementing school meal programmes across provinces",
    "author": null,
    "date_published": "2025-06-03T17:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 262,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 03 (APP): The Ministry of Federal Education and Professional Training and the United Nations World Food Programme (WFP) have jointly convened a high-level, two-day national consultation in Islamabad to advance coordinated efforts to implement school meal programmes across provinces. The consultation was attended by representatives from various federal and provincial departments, development agencies, private sector, academia, and non-governmental organisations. The event aimed to ensure every child in Pakistan has access to healthy, nutritious food at school. Pakistan's Prime Minister, Mohammad Shehbaz Sharif, emphasized the need for urgent action, citing the country's 25 million out-of-school children and many enrolled students struggling to learn due to hunger and malnutrition. The consultation concluded with a clear demonstration of political will from federal and provincial government representatives to expand school meals across Pakistan. The Government of Balochistan committed significant multiyear budget, Punjab pledged to expand school meals to more districts, while Sindh reaffirmed plans to launch a new school meals programme. Khyber Pakhtunkhwa committed to strengthening its cash-based model and exploring a school meals programme. Minister of State for Federal Education and Professional Training, Wajiha Qamar, affirmed the government's commitment to institutionalising school meals as part of the broader education agenda. WFP Representative and Country Director in Pakistan, Coco Ushiyama, highlighted the transformative impact of school meals in bringing children to school, keeping them there, and giving them a fair chance to learn, grow, and succeed. This initiative aligns with Prime Minister Shehbaz Sharif's declaration of an education emergency last year and the urgent national priority to bring every out-of-school child into the classroom.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}