{
  "article_id": "2025-06-03_889c81bb6c7f628c349e4fe6b221fe99",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mou-sign-to-strengthen-academic-professional-and-research-collaboration/",
    "retrieved_at": "2025-08-27T10:45:03.607Z"
  },
  "metadata": {
    "title": "MoU sign to strengthen academic, professional, and research collaboration",
    "author": null,
    "date_published": "2025-06-03T14:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 390,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 03 (APP): The National University of Modern Languages (NUML) hosted a Memorandum of Understanding (MoU) signing ceremony with Teach for Pakistan (TFP) and the Pakistan Institute of Living and Learning (PILL) to foster meaningful collaboration between academia and industry, and to promote research, career development, and public health initiatives. The first MoU was signed between NUML and Teach for Pakistan (TFP) to create strong linkages in areas of mutual interest. Under the agreement, TFP will offer fellowship, internship, and employment opportunities to NUML graduates. In addition, TFP will organize information sessions, career development events, and professional skill-building workshops for NUML students. NUML will facilitate collaboration between student societies and TFP to maximize student engagement and mutual benefit. The university will also extend logistical support to TFP for the smooth execution of its programs and initiatives on campus. The MoU was signed by Director General NUML, Brigadier Shahzad Munir, and Head of development and partnerships (TFP) Mr. Muhammad Uzair. The ceremony was graced by Rector NUML, Major General (Retd.) Shahid Mahmood Kayani, who emphasized the need for practical implementation of the agreement to ensure tangible outcomes and lasting benefits for both institutions. He expressed gratitude to TFP for their partnership and voiced optimism about the positive impact of this collaboration. In another development, NUML also signed an MoU with the Pakistan Institute of Living and Learning (PILL) to jointly advance research in mental and public health, aiming to create a transformative impact through interdisciplinary collaboration. The agreement, signed by DG NUML Brig. Shahzad Munir and Focal Person for PILL, Assistant Director Research and Development, Dr. Tayyeba Kiran, envisions the establishment of a dedicated research center that will focus on promoting evidence-based solutions to regional and global health challenges. The center will emphasize capacity building, resource sharing, and community impact. As part of the collaboration, NUML and PILL will jointly conduct mental health awareness initiatives, structured academic sessions, and community health engagement programs, including school-based mental health sessions. These efforts aim to enhance mental health literacy and preventive strategies across academic and wider community settings. Additionally, both will promote and support research projects addressing local mental health challenges, thereby contributing to national efforts for public well-being and informed policy development. The signing ceremony was also attended by Pro-Rector (Research and Strategic Initiatives), Dr. Safeer Awan and Registrar NUML, Dr. Waqas.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}