{
  "article_id": "2025-06-03_6ed8571e8c1a263fc84bfc85b38fd11e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/railways-beefed-up-security-in-trains-at-stations-during-eid/",
    "retrieved_at": "2025-08-27T10:45:55.477Z"
  },
  "metadata": {
    "title": "Railways beefed-up security in trains, at stations during Eid",
    "author": null,
    "date_published": "2025-06-03T08:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 3 (APP):Pakistan Railways Police has issued instructions to all Superintendent of Police (SP) Railways to tighten security in trains as well as at stations to avoid any untoward incident during Eid-ul-Azha days. On the direction of Federal Minister for Railways Muhammad Hanif Abbasi, the department had directed all SPs Railways to depute sufficient force at exit and entry points of all railway stations and strict watch to be carried out of suspicious persons, an official in the Ministry told APP. Pakistan Railways Police Commando Force would be deputed at vulnerable installations and in trains, while bomb disposal staff would also be kept on alert for search of luggage and passengers at railway stations. \"The SPs Railways directed to conduct complete check and search of empty rakes before trains reach the platforms for departure for their destinations,\" the official added. All the SPs Railways would also be directed to remain present on Eid holidays and randomly check trains, stations and escorting staff, the official added. The official said the number of passengers was increasing day by day at railway stations and trains ahead of Eid and the Railway administration had arranged special trains across the country to facilitate the extra passengers. It is pertinent to mention here that Pakistan Railways has decided to operate five Eid Special Trains from various cities to facilitate passengers during the Eid-ul-Azha. According to the details, the first special train had departed from Karachi Cantonment Railway Station for Lahore at 1:00 pm on June 2. The second special train had left Quetta for Peshawar at 10:00 am on June 3. On the same day, the third special train will depart from Lahore for Karachi at 5:00 pm while fourth special train will leave Karachi Cantonment for Rawalpindi at 7:30 pm. The fifth and final Eid Special Train will depart from Karachi Cantonment for Lahore at 7:30 pm on June 4.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}