{
  "title": "Bilawal asked to join opposition struggle against new canals project - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Grand Democratic Alliance on Sunday asked Pakistan Peoples Party chairman Bilawal Bhutto-Zardari to join the struggle against the construction of new canals on the Indus River from the platform of the opposition alliance if he genuinely opposed the controversial scheme.\n\nThe GDA and Pakistan Tehreek-i-Insaf (PTI) announced a joint candidate for the upcoming by-election in National Assembly constituency NA-213, Umerkot, where Lal Malahi will represent the united front in the by-polls. The polling will be held on April 27.\n\nBoth sides reached the decision following a meeting of allied parties at Functional House on Sunday.\n\nThe alliance vowed to mount a joint struggle against the controversial six canals on the Indus River.\n\nGDA and PTI to field joint candidate in Umerkot by-poll on NA seat, announces Sadruddin Rashdi\n\nSyed Sadruddin Shah Rashdi, chief coordinator of GDA, while talking to journalists after the meeting, extended a public invitation to the PPP chairman, urging him to join their ongoing movement against the canals on Indus.\n\nHe criticised the PPP leadership for its role in “striking deals” on Sindh’s water.\n\n“The PPP chairman will not get any benefit from his father’s dealings, but could gain much by joining the forces of the GDA and PTI.”\n\nHe accused the PPP leadership of exploiting Sindh’s resources for their own benefits, warning that the people of the province would reject these “fake coins”.\n\nHe said that the alliance’s leaders also emphasised the dire need to address the broader political and economic issues plaguing Pakistan.\n\nMr Rashdi decried the government’s “failure” to engage in meaningful dialogue to resolve the challenges facing Balochistan, stressing the importance of respecting the public mandate.\n\nHe also criticised the growing dominance of traders in politics, accusing them of draining the country’s resources for their own profit.\n\nHis remarks were echoed by PTI’s Haleem Adil Sheikh who attended the meeting.\n\nSpeaking to journalists, the PTI leader reminded the people of Sindh of former president Dr Arif Alvi, who had refused to sign the controversial project when he was president.\n\nHe underscored the importance of protecting Sindh and the Indus River, and warned that under the PPP rule, the province would suffer further neglect in key sectors like health and education.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:59:57.665Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898385/bilawal-asked-to-join-opposition-struggle-against-new-canals-project",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:43.000Z"
}
