{
  "title": "Five martyred in ambush on forces near Noshki - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Suicide bomber rams explosive-laden vehicle into security convoy; over 30 troops wounded\n• ISPR says three militants killed, vows to bring perpetrators to justice\n• Security beefed up in Quetta amid ‘threats’, police and paramilitary personnel on active patrol\n\nQUETTA: At least five people, including three security men, embraced martyrdom while about 40 troops sustained injuries on Sunday after militants rammed an explosive-laden vehicle into a security convoy near Noshki on the Quetta-Taftan highway.\n\nThe military’s media wing confirmed the suicide bombing, saying five people were martyred in the attack, including two civilians. Officials told Dawn that a convoy of Frontier Corps comprising eight vehicles — six coa­ches and two cars — was on its way to Nokundi from Quetta. When it reached near the Darkhshan flour mill near Noshki, a powerful explosion took place near a coach, followed by the suicide attack.\n\n“[A] suicide bomber rammed the explosive-laden car into one of the coaches and detonated it,” a senior security official told Dawn, adding that the coach caught fire after the explosion. However, seven other vehicles remained safe in the attack and they were promptly moved to safety.\n\nSources said the suicide bombing was followed by heavy gunfire by militants who were hiding in the nearby mountains. However, the security forces returned the fire and an intense shoot-out ensued, lasting over an hour. Soon afterwards, the security forces cordoned off the area and launched a search operation. Heli­copters were also witnessed hovering in the area during the operation.\n\nLocal authorities said the bodies and the injured were shifted to the Noshki Teaching Hospital. “Five bodies and over three dozen injured were brought to the hospital,” a senior officer told Dawn, adding that the injured and the bodies were later shifted to Quetta on a helicopter. The injured were admitted to the Quetta Combined Military Hospital. Officials said two helpers, who got injured in the suicide car bombing, were out of danger after they were operated at the CMH.\n\nIn a statement issued in the evening, Inter-Services Public Relations said a vehicle-borne suicide bomber “exploded himself on a security forces convoy in Noshki”. “Resultantly, five brave sons of soil embraced shahadat; three security forces personnel and two innocent civilians.”\n\nThe martyred “included Havildar Ma­n­zoor Ali, 38, resident of Nawabshah, Havildar Ali Bilawal, 39, resident of Naseerabad, Naik Abdul Raheem, 34, resident of Badin), civilian driver Jalaluddin, resident of Quetta and civilian driver Muhammad Naeem, resident of Kharan”.\n\n“In the ensuing sanitisation operation, the terrorists were pursued and after intense fire exchange, three terrorists were effectively neutralised by the security forces,” the ISPR statement said. It further added that sanitisation operations in the area would continue and perpetrators of this heinous and cowardly act will be brought to justice.\n\nThe attack was claimed by the banned Balochistan Liberation Army.\n\nSecurity beefed up\n\nMeanwhile, the security measures have been tightened in Quetta. The security has been beefed up in the city, and the Zehri Flyover has been closed to traffic due to the prevailing security threat.\n\n“The overhead bridge at the ‘Koila Phattak railway crossing’ has also been closed for security reasons in view of the security threat till further order,” Hamza Shafqaat, Quetta commissioner told Dawn. Heavy contingent of security forces, including police and paramilitaries, were patrolling in and around the city.\n\nGovt denounces attack\n\nMeanwhile, President Asif Ali Zardari condemned the attack and expressed deep grief and sorrow over the loss of lives. The president prayed for the high ranks of the departed souls and for the bereaved families to bear the losses with fortitude, said a statement issued by his office.\n\nPrime Minister Shehbaz Sharif also expressed sorrow over the loss of precious lives in the blast. “Such cowardly acts cannot deter our resolve to eliminate the menace of terrorism from the country,” he said.\n\nBalochistan Governor Jaffar Khan Mandokhail and Chief Minister Sarfraz Bugti also denounced the deadly bombing. “We will not allow the peaceful situation of our province to be sabotaged under any circumstances. It is the government’s responsibility to ensure the safety and security of the lives and property of the people,” he said.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d743ba49f75.jpg",
  "retrievedAt": "2025-08-25T15:14:55.614Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898361",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:05.000Z"
}
