{
  "title": "Finance: Leveraging remittances wisely - Newspaper - DAWN.COM",
  "author": null,
  "content": "The foreign exchange reserves held by the State Bank of Pakistan (SBP) slipped to $11.1 billion on March 7 from $11.25bn at the end of February, the latest data reveals. Total forex reserves, including those held by the commercial banks, however, rose to about $15.93bn from around $15.87bn.\n\nDespite impressive growth in remittances throughout this fiscal year, SBP’s forex reserves have remained on the decline for some time due largely to external debt payments.\n\nThe central bank’s reserves peaked at $12.04bn in November before falling to $11.73bn at the end of the last calendar year. Since then, the SBP’s reserves have remained under pressure and are now at their lowest level of $11.1bn as of March 7, 2025.\n\nThe amount is insufficient to cover three months of the country’s merchandise import bill — a level generally considered the bare minimum. Monthly goods imports consumed $4.3bn in February, an increase of 10 per cent in a year.\n\nAs policymakers navigate IMF negotiations and fiscal adjustments, remittances remain a crucial pillar of economic support\n\nSince imports are growing fast with the economy showing signs of recovery and exports’ growth falling below expectations, the resultant widening of the trade deficit is also putting pressure on the forex reserves.\n\nIn effect, it is also weakening the impact of an impressive growth in home remittances; between July 2024 and February 2025, Pakistan booked a merchandise trade deficit of $15.78bn, up from $14.84bn, as seen in the same period of the last fiscal year. This widening of the trade deficit could have inflicted more pain on the economy had our home remittances not been growing rapidly.\n\nRemittance inflows reached $3.1bn in February 2025, marking a 3.8pc increase from January and a 38.6pc jump compared to February last year, the latest SBP data reveals. Cumulatively, during the first eight months of this fiscal year, remittances have totalled $24bn, reflecting a 32.5pc year-on-year increase.\n\nAs long as remittances remain higher than or equal to the amount of goods’ trade deficit, current account management will remain a bit easier, though the trend in services’ trade deficit can make a difference.\n\nHowever, keeping the current account deficit within manageable limits will become too difficult the day cumulative remittances become equal to or fall behind the goods’ trade deficit. Pakistan has experienced this several times in the past two decades.\n\nThat’s why ensuring the continuation of robust growth in remittances is crucial. However, even that is no match for managing the trade deficit with a rapid increase in export earnings.\n\nWill the current hybrid regime be able to boost exports and ensure the continuation of double-digit growth in remittances in the remaining four months of this fiscal year? The answer is that exports may not see an immediate boost regardless of trade policy refinements and even some incentives in the form of lower energy prices.\n\nBasically, exports respond to incentives and favourable circumstances with a time lag, particularly when the international trade landscape becomes as unpredictable as the US trade war with Europe and China has made it.\n\nHowever, remittance growth may continue for the next four months, primarily because of Eidul Fitr and Eidul Azha, when overseas Pakistanis traditionally send more foreign exchange back home.\n\nMoreover, despite expectations of a rate cut, the SBP has maintained the policy rate at 12pc in its latest monetary policy announcement on March 10. Though the decision is not without merits, it may impede the recovery of industrial output and lengthen the response period of exports to whatever incentives the government may now offer, including lower energy prices.\n\nThe central bank cited concerns about inflationary risks and external account vulnerabilities as key reasons for holding the interest rate steady.\n\nThe external sector vulnerability is evident from the fact that in the seven months of this fiscal year (between July 2024 and January 2025), Pakistan witnessed an overall balance of payments deficit of $1.4bn despite external debt rollovers of a few billion dollars by friendly countries and despite receiving $1.1bn from the International Monetary Fund (IMF) as the first tranche of an ongoing $7bn loan.\n\nSimilarly, inflationary risks are real because, as the central bank has noted in its monetary policy announcement, core inflation is still elevated, indicating that inflation bottomed out to 1.5pc in February, largely due to some respite in food and energy prices.\n\nUnfortunately, both food and energy prices may start rising any time in the near future because the ongoing negotiations with the IMF for the release of the second tranche are not expected to leave any room for lowering energy prices by manipulating circular debts, and food prices may begin to rise again as prospects of agricultural growth in the upcoming Rabi season have been marred by a severe water crisis.\n\nThe resilience of overseas Pakistanis continues to play a pivotal role in stabilising the economy, providing much-needed liquidity at a time of financial uncertainty.\n\nAs policymakers navigate IMF negotiations and fiscal adjustments, remittances remain a crucial pillar of economic support. However, structural reforms will be essential to sustain economic momentum beyond short-term financial inflows.\n\nPakistan can strategically utilise home remittances to stimulate economic activities by channelling these funds, under institutional arrangements, into small and medium-sized enterprises.\n\nAbove all, remittances can be easily leveraged to support education and skill development programmes. By funding vocational training centres and higher education institutions, Pakistan can build a skilled workforce capable of driving economic growth in sectors like technology, healthcare, and engineering. This human capital development would ensure long-term economic sustainability.\n\nPublished in Dawn, The Business and Finance Weekly, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:14:42.940Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898367",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:24.000Z"
}
