{
  "title": "National Highway Authority faces huge losses as deficit tops Rs318bn - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With its net deficit for the fiscal year 2024-25 going beyond Rs318 billion, the aggregate losses and loans of the National Highway Authority (NHA) have crossed Rs1.82 trillion and Rs3.1tr, respectively, while its annual revenues stand at a mere Rs54.15bn.\n\nThe NHA’s total assets, valued at Rs5.8tr, have been declining for the past two years, down from Rs5.9tr in FY22 and Rs5.84tr in FY23.\n\nIn a written statement to the National Assembly, Communications Minister Abdul Aleem Khan put the NHA’s net deficit for FY24 at Rs318.03bn, down 23 per cent from Rs413bn a year earlier, but almost double the deficit in FY22.\n\nThe minister also pointed out that the federal government was providing development funds to the NHA annually in the form of a cash development loan through the Public Sector Development Progra­mme (PSDP) at a specified markup rate.\n\nAggregate losses cross Rs1.82tr, debt soars to Rs3.1tr\n\nTherefore, the “net deficit reflects the impact of non-cash expenditures, such as finance costs on PSDP and foreign-relented loans, exchange losses on foreign loans, and depreciation”, the minister said.\n\n“Therefore, the NHA is not incurring financial losses in real terms, as these factors are accounting adjustments rather than actual cash outflows,” he claimed.\n\nDebt crisis, govt liabilities\n\nOn the other hand, the Central Monitoring Unit (CMU) of the Ministry of Finance noted that the NHA faced significant financial challenges, underscored by an escalating debt burden and complex accounting issues.\n\n“Currently, the NHA holds outstanding loans totalling around Rs3.1tr, with an annual debt accretion rate of Rs300bn. This debt portfolio generates Rs98bn in markup, which is expected to rise to more than Rs150bn per annum, creating a substantial credit risk for the government of Pakistan, which guarantees these loans,” it said.\n\nOn top of that, the Ministry of Finance said the presence of sovereign guarantees for public-private partnership (PPP) contracts adds further financial strain, amplifying the government’s credit risk exposure.\n\nIt pointed out that NHA’s dependence on government support for debt servicing, combined with its limited revenue generation capabilities, strains the government’s fiscal stability, particularly if loan defaults or liquidity crises arise.\n\nOn the balance sheet, the NHA’s total assets stand at Rs5.889tr, with total liabilities of Rs2.9tr, reflecting a high level of leverage. However, its total income is only Rs74.007bn, against total expenditures of Rs242.57bn, indicating an operational deficit that further exacerbates its dependency on government funding.\n\nAdditionally, the NHA faces high depreciation costs, exceeding Rs5.2tr due to the revaluation of its extensive infrastructure assets.\n\nEscalating risks\n\nAgainst this backdrop, the ministry has categorised the NHA’s financial troubles into three major risk areas: credit risk, market risk, and operational risk.\n\nIt said its credit risk was escalating debt and interest obligations. “The NHA’s debt of Rs3.1tr, coupled with a rising annual interest obligation, is projected to surpass Rs150bn, placing the government at a substantial credit risk,” it said.\n\nWith an annual debt accretion of Rs300bn, the authority’s reliance on government-backed loans and sovereign guarantees adds significant fiscal wpressure, the ministry said.\n\nAs for the market risk, the Ministry of Finance said NHA’s infrastructure projects were vulnerable to inflation and rising costs for construction materials like cement, steel and fuel.\n\nAs these costs fluctuate, the expenses associated with long-term projects increase, especially when inflationary adjustments are not reflected in project budgets or revenue models.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:22.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898419/national-highway-authority-faces-huge-losses-as-deficit-tops-rs318bn",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:18.000Z"
}
