{
  "title": "5 injured in grenade attack on SHO’s house in Balochistan’s Khuzdar: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Five people, including four children, were injured on Monday in a grenade attack on the house of Hub City Station House Officer (SHO) Qadir Sheikh in Balochistan’s Khuzdar, police said.\n\nSpeaking to Dawn.com, Khuzdar Senior Superintendent of Police (SSP) Javed Zehri said unknown assailants threw a hand grenade on a house in the Kaushik area of Khuzdar City.\n\nAmong the injured were SHO Sheikh’s father and his brother’s four children. His father was sent to Karachi after being administered first aid, while the children were sent home after being given first aid.\n\nSSP Zehri said the incident is being investigated.\n\nThe attack comes a day after a vehicle-borne suicide bomber attacked a security forces convoy in Balochistan’s Noskhi district, leaving three security personnel and two civilians martyred.\n\nThe martyred soldiers were identified as Nawabshah district’s Havildar Manzoor Ali, Naseer Abad district’s Havildar Ali Bilawal and Badin district’s Naik Abdul Raheem, according to a statement by the Inter-Services Public Relations (ISPR).\n\nBus drivers Jalaluddin from Quetta and Muhammad Naeem from Kharan were also martyred, ISPR said.\n\nOn Saturday, a cop was martyred while six others were wounded in a blast near a vehicle of Balochistan’s Anti-Terrorist Force (ATF) in Quetta.\n\nIt also follows the recent Jaffar Express train hijacking near Balochistan’s Sibi area, in which 26 hostages, including 18 security personnel, lost their lives. Five more security personnel were martyred during the operation.\n\nFollowing the attack, the military vowed to take decisive action against terrorists operating in Balochistan, along with their abettors and facilitators, both inside and outside the country.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:14:40.039Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898511/5-injured-in-grenade-attack-on-shos-house-in-balochistans-khuzdar-police",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T13:09:14.000Z"
}
