{
  "title": "KP will decide whether to expel Afghans after March 31 - Newspaper - DAWN.COM",
  "author": null,
  "content": "• CM Gandapur terms Centre’s policy to repatriate refugees back ‘inhumane’\n• Blames institutions ‘preoccupied with PTI’ for terror resurgence\n\nPESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur on Sunday said his government would decide whether to follow the Centre’s directives to expel Afghans residing in the province after March 31.\n\nThe federal government has asked Afghan Citizen Card holders to leave Pakistan voluntarily by March end, after which they’d be deported from the country.\n\nMr Gandapur slammed the federal government’s repatriation policy as ‘inhumane and oppressive’. “I am not in favour of Afghans’ repatriation as per the policy of the federal government,” the chief minister said while talking to the media.\n\n“When the deadline [March 31] will arrive,” Mr Gandapur said he, as the chief executive of KP, would decide whether Afghans should be forcefully repatriated or not. “I will decide what suits me, suits the culture and traditions of KP,” he said on the decision to expel Afghans.\n\nHe said it was “wrong and inhuman” to forcefully send back Afghans without any arrangement for them in their country.\n\nThe forced repatriation of Afghans at a time when they had no facility in their country was a “violation of basic human rights”.\n\nIn reply to a question, CM Gandapur said the federal government had not contacted him on this issue, rather he was criticised when he suggested negotiations with Afghanistan though the federal government had earlier agreed with him on the issue of talks with Afghanistan.\n\nRise in militancy\n\nEarlier, in a press conference, the chief minister said the state and its institutions were responsible for the surge in militancy.\n\nHe alleged the state and its institution have been “wasting their energies in dismantling and breaking the PTI and creating rifts in its leadership”.\n\nThe KP CM said the state and its institutions were not focusing on their prime duty of maintaining law and order and curbing militancy.\n\nIt has resulted in the emergence of terrorism, he claimed.\n\n“Today, I openly say that resurgence in militancy is the failure of the authorities at the helm of affairs and incompetency of the federal government and institutions,” he remarked.\n\nHe said the state and its institutions needed to be careful and make the right decisions in view of the law and order situation.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:14:51.910Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898354",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:10.000Z"
}
