{
  "title": "Situationer: Banks push back on power debt plan - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Lenders claim coercion by govt to acquiesce; say they’d suffer losses if deal goes through\n• Question marks remain over strategy to curb line losses, theft\n\nTHE government’s efforts to tackle mounting power-sector debt may have hit a snag, as several — if not all — commercial banks seem reluctant to restructure Rs683 billion in existing loans and extend Rs567bn in fresh lending to Power Holding Limited (PHL) at below-market rates — something the government believes is essential to stabilising the country’s energy sector.\n\nThe government last week announced it had reached an agreement with banks to extend PHL, a state-owned entity, Rs1.25 trillion in financing at a favourable floating interest rate of Kibor minus 0.90 per cent per annum. The move was described as part of a broad strategy to eliminate the circular debt that has plagued Pakistan’s power sector, which has been fuelled by unpaid bills, theft, and distribution losses that have continued to accumulate over the past decade.\n\nDespite the government’s claims of a breakthrough, however, it appears that its new deal is far from done. The term sheets have yet to be signed by the banks, many of whom appear hesitant, wary of the financial losses they are likely to incur. The Rs1.25tr loan is also to remain on PHL’s books, which hasn’t helped reassure the banks.\n\nThe banks’ reluctance has reportedly led to tense negotiations. According to a senior banker, who requested anonymity due to the sensitivity of the talks, lenders were strong-armed during discussions at the finance ministry.\n\n“We were told we had no choice but to lend, and there were veiled threats of dire consequences if we didn’t agree,” the banker said.\n\nAnother banking official likened the atmosphere to the pressure faced by independent power producers (IPPs) in their own recent negotiations with the government’s energy task force — a group made up of senior civil and military officials. The Inter­national Monetary Fund (IMF) had later taken a very dim view of the reports it received from IPPs in this regard.\n\nRepayment concerns\n\nThe government plans to repay the debt over six years through a Rs2.83 per unit surcharge already being collected from electricity consumers, generating an estimated Rs350bn annually.\n\nBut bankers say the financial hit they will take remains a major concern. PHL’s current liabilities carry an average interest rate of Kibor plus 0.45pc. Under the government’s proposed rate of Kibor minus 0.90pc, banks would face a negative spread of 1.35pc — translating into an estimated total Rs9.2bn annual loss for the lenders. Additionally, the new debt, priced on similar terms, will lead to roughly the same reduction in profits.\n\n“The frequent restructuring of previous loans and the negative spread on both old and new debt make this plan highly unattractive,” said the chief financial officer of a major bank. “On top of that, such large-scale lending to the power sector would severely restrict liquidity for private-sector borrowers and misallocate financial resources, harming economic growth.”\n\nAdding to the banks’ unease is the absence of a sovereign guarantee for the fresh loans — a requirement Pakistan cannot fulfil due to the conditions of its ongoing bailout programme with the IMF. Without this guarantee, banks face heightened risk in lending to PHL.\n\nThe ‘real’ issue\n\nThe circular debt crisis is one of the most contentious issues in Pakistan’s negotiations with the IMF. While the government aims to retire Rs1.5tr of circular debt through Rs1.25tr in new borrowing and Rs250bn in budget support, it does little to address the underlying issues fuelling the debt buildup. Media reports suggest the IMF is sceptical of the proposal, fearing that a drop in power demand in the coming years could further complicate debt repayment.\n\nCritics argue that without meaningful reforms, the plan is little more than a temporary fix.\n\n“How can this succeed without addressing the real problems — rampant power theft and massive transmission and distribution losses?” asked Tahir Basharat Cheema, a former chairman of the Pakistan Electric Power Company.\n\nPakistan has been down this road before. In 2013, the PML-N government paid Rs480bn to clear outstanding circular debt — only for it to start accumulating again shortly after, as the root causes remained unaddressed.\n\n‘Deal could work’\n\nDespite the ba­nks’ misgivings, some officials remain optimistic. Zafar Masud, chairman of the Pakistan Banks’ Association, noted that more than half of the Rs1.25tr debt is already on the books of 18 banks and it’s been sitting there for a while and currently lacks identifiable cash flows to support its repayment.\n\n“Now cash flows in the shape of an already existing debt service surcharge in the electricity bills will be utilised by the lenders to be recovered at source for loan repayment. There will be no new burden on consumers and this deal will help in clearing up all the new and old debt in the next four to six years, depending on where the interest rates stand. Lower the interest rates, quicker the payment of this 1.25trn debt,” Mr Masud said.\n\nHe dismissed allegations of coercion, describing the talks as “exceptionally well-conducted in a brilliant, respectful, and business-like environment.”\n\nHe insisted that the deal would have a positive impact on the economy by stabilising power prices and encouraging business activity.\n\nStill, serious questions remain. As long as theft, inefficiency, and distribution losses continue to drain the power sector, the risk of circular debt’s return looms large. For now, banks remain cautious — and the government’s ambitious plan hangs in the balance.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:00:43.868Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898357",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:05.000Z"
}
