{
  "title": "Prosecution dept dissatisfied with police investigation into DI Khan Vani case - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: The prosecution department has expressed dissatisfaction with the quality of the police investigation into the sensitive Bhagwani Shumali Vani case, lamenting the police’s traditional negligence and sluggishness.\n\nDistrict public prosecutor Farastullah had formed a four-member committee to oversee the case. The committee is headed by public prosecutor Sheikh Shakeel, who has made serious allegations regarding the police’s handling of the investigation.\n\nAccording to the prosecution committee spokesperson, the police failed to contact the committee for forensic assistance and neglected to implement the instructions provided by the committee.\n\nThe spokesperson revealed that the deceased’s wife and brothers had formally charged seven suspects, including two key accused, Inayatullah, who acted as an arbitrator in the Vani decision, and Mohammad Ramzan, a witness to the stamp paper.\n\nSpokesperson says investigation marred by non-compliance with prosecution committee’s directives\n\nBoth had obtained pre-arrest bail from the court, with their initial hearing scheduled for March 15. However, due to the absence of the suspects’ lawyer, the next hearing was rescheduled to Tuesday (March 18). A two-member senior prosecution team will present arguments in court, opposing the interim bail of the accused.\n\nMeanwhile, three arrested suspects – Ghulam Fareed, document writer Kifayatullah, and Mohammad Imran – have yet to apply for bail. Additionally, two prime suspects, Waqas (to whom the deceased’s daughter was given in Vani), and the deceased’s nephew, Jalal (believed to be the catalyst for the tragic incident), remain at large.\n\nThe prosecution has raised grave concerns about the police’s lax approach, stating that the investigation is marred by delay and non-compliance with the committee’s directives.\n\nThe police were required to complete the investigation and present the case in court within 15 days, a deadline that remains unmet.\n\nThe prosecution committee spokesperson further disclosed that due to the unavailability of a proper stamp paper at the time of the marriage, signatures were taken on a simple register, with the intention to later transfer them onto official stamp paper. Unfortunately, the tragic incident occurred before this could happen. As a result, forensic examination of the signatures and thumb impressions on the register have become crucial.\n\nMoreover, the spokesperson highlighted the significance of the deceased’s audio recording prior to the suicide and the medical reports as critical pieces of evidence in the case.\n\nEmphasis was placed on the necessity for police cooperation with the prosecution committee, particularly regarding forensic analysis and other pivotal evidence, to ensure justice is served.\n\nIt is noteworthy that this case carries immense sensitivity, demanding a transparent and expeditious investigation to uphold the principles of justice. The prosecution’s concerns over the police’s handling of the case have only added further complexity to the proceedings.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:05.675Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898335/prosecution-dept-dissatisfied-with-police-investigation-into-di-khan-vani-case",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:09:07.000Z"
}
