{
  "title": "Medics protest proposed privatisation of health centres - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Health department employees, including doctors, paramedics, nurses, lady health workers and clerical staff, staged protests in Attock against the Punjab government’s decision to outsource basic health units (BHUs) and rural health centres (RHCs).\n\nScores of male and female employees of the health department including District Health Authority, Punjab Health Facilities Management Company (PFHMC), Integrated Reproductive, Maternal, Neonatal and Child Health (IRMCH), Prime Minister’s Health Initiative Program (PMHI) took out a protest rally from Asfandyar Bukhari District Headquarters Hospital to deputy commissioner office against the privatisation.\n\nThe employees staged a protest outside Kachhari Chowk and raised slogans against privatisation.\n\nSpeaking on the occasion, the protesters’ leaders said that the Punjab government looked determined to carry out a “financial massacre” of health workers as it had decided to sell out the health sector at throw-away prices to the private sector.\n\nThey added that the grand health alliance had decided to thwart the government’s bid to privatise the health sector.\n\nThey pointed out that earlier the government had sold out many hospitals, labs and blood banks while many departments like radiology, security and correspondence were also being run by third parties.\n\nThey claimed that the sanitation and security systems worsened in the hospitals and caused a nuisance for the people.\n\nThey said that society was already faced with issues like terrorism and crimes and the current step would bring a new flood of joblessness.\n\nThey claimed that the private companies running different health outlets charged the people heavily.\n\n“The number of patients at these hospitals has plunged seriously due to costly treatment and Kidney Centre Multan is a big example,” they added. They said that the companies running these hospitals also made government servants surplus and recruited contracts and daily wages against them.\n\n“It is our financial murder and exploitation. It is the duty of every Pakistani to raise voice for the rightful,” they demanded.\n\nSpeaking on the occasion, Allied Health Professionals Council Attock chapter leader Iqbal Khan declared that privatisation of health centres is unacceptable under any circumstances.\n\nHe accused the government of depriving citizens of their fundamental right to healthcare by handing over public health facilities to private entities.\n\nHe alleged that the privatisation policy was a tactic to lay off staff, worsening financial hardships for healthcare workers already struggling with inflation.\n\nHe threatened a mass sit-in outside the Punjab Assembly on April 7, if their demands were not met.\n\nPresident Allied Health Professionals’ Council Attock chapter Khalid Mehmood in his address has warned that if their demands were not met, they would intensify and expand their protest movement.\n\nHe described the move as the “economic murder” of workers who had served the rural health sector for over a decade.\n\nLater the leaders of the protesting employees were called by a member national assembly Sheikh Aftab Ahmed and apprised him about the reservation of the protesting employees.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d74013ce0bd.jpg",
  "retrievedAt": "2025-08-25T15:15:06.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898347/medics-protest-proposed-privatisation-of-health-centres",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:09:01.000Z"
}
