{
  "title": "KWSC chief Salahuddin resigns amid inquiry - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Chief Executive Officer of the Karachi Water and Sewe­rage Corporation (KWSC) Syed Salahuddin, who was restrained from attending office in the interest of an inquiry, has tendered his resignation from the post that he held for over two and a half years.\n\nFollowing his removal from the office, Chief Operating Officer Asad­ullah Khan was given additional charge of managing director and CEO until the final results of the inquiry were submitted. The inquiry, however, is still pending disposal with the AEC, though the provi­ncial corruption watc­hdog was ordered to sub­mit its report within two weeks.\n\nThe provincial government had on Jan 7 restrained Mr Salahuddin from attending office and performing functions of MD and CEO of the water utility after the Sindh Anti-Corruption Establ­ishment started a major crackdown against the issuance of licences for groundwater extraction and water theft within the corporation.\n\nIn his resignation letter to the chairman of the KWSC Board of Directors on March 3, Mr Salahuddin said that he had joined Senior Management Cou­rse (SMC) at the nati­onal Institute of Public Admi­nistration, therefore, he tendered resignation from the post of MD and CEO.\n\nAttaching with his resignation a performance report, he said that he had served the water utility to the best of his ability while observing highest order of integrity and selfless devotion to duty in true sense.\n\nMr Salahuddin stated in his performance report that the monthly income of the KWSC from legal hydrants rose from Rs60m to Rs230m.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/17104310f641da7.jpg",
  "retrievedAt": "2025-10-12T02:00:16.798Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898382/kwsc-chief-salahuddin-resigns-amid-inquiry",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:43.000Z"
}
