{
  "title": "Man kills young girl for rejecting marriage proposal in Sahiwal - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: A 19-year-old girl was shot dead by a married man after she refused his marriage proposal at the Mohalla Noor Park. The girl sustained a gunshot wound in her abdomen and succumbed to her injuries on the way to the Sahiwal Teaching Hospital.\n\nThe district police officer (DPO) took notice of the incident and formed a special team to apprehend the suspect, identified as Imran. The suspect, a married man with a young daughter and a resident of Mohalla Shamsia, had developed a relationship with Alisha, the daughter of a widow, Farzana. Imran had proposed marriage to Alisha, but both she and her mother rejected the proposal.\n\nAlisha went to Lahore to visit her aunt and returned home in the evening. Unconfirmed accounts suggest that Imran picked her up from the bus stand on his motorcycle and dropped her home. During this interaction, a heated argument reportedly took place between them. On dropping her off at Mohalla Noor Park, Imran allegedly shot her.\n\nThe Ghala Mandi police registered a murder case on a complaint of Farzana. The suspect is at large.\n\nSHOT: A man was shot and tortured over a love marriage issue at Mohallah Hasanpura in Pakpattan city.\n\nAccording to the first information report (FIR), Muhammad Areez, a tailor residing in Hasan Pura, had married Rabia, a resident of the same area, through the court in the first week of February. Fearing retaliation, the couple went into hiding after their marriage. Rabia’s mother filed a kidnap case against Areez with the City Police Station. On Sunday, Rabia’s family members launched a sudden attack on Areez’s house and shop. They found his brother Usman there and subjected him to torture and shot him twice in the legs with a pistol. The neighbours, alerted by the gunshots, rushed to the scene and managed to save Usman by locking him in a room. The attackers fled the scene while firing shots into the air.\n\nThe City police registered a case against Muhammad Usman, Ali Raza, Riaz Ahmed, and two unidentified individuals based on a complaint filed by Usman.\n\nCASES RESOLVED: Police resolved two cases of murder and arrested the main suspects in both incidents within 24 hours in Pakpattan.\n\nDPO Rana Tahir told Dawn that both murders were linked to honour killings. In the first case, a widow’s only son was shot dead by unidentified individuals at Chak 165A/9-L during Sehri on Friday.\n\nKashif Tanveer was fatally shot in the head while milking animals and the assailants fled the scene. Ghaziabad Police had registered a murder case against unidentified suspects, based on a complaint filed by the victim’s mother, Mariam.\n\nThe DPO visited the crime scene and formed an investigation team, led by DSP Chichawatni. The investigators interrogated Kashif’s young cousin, Zaman. During questioning, Zaman confessed to committing the murder, stating that he suspected Kashif having a relationship with his wife.\n\nIn the second case, Bahadur Shah police investigated the death of 12-year-old Sonia, whose maternal uncle initially claimed she had committed suicide by hanging herself in a room in village Dalawar Kay Kathiya on March 8. Sonia’s mother, Musarat, told police she had left her daughter in the care of her two brothers, Javed and Sadam Hussain, who lived with their wives, Saima and Kanwal, in the same village. After two hours, she heard news of her daughter’s suicide. Musarat claimed that her daughter was having no sign of any depression and there was no chance of her suicide. Sub-Inspector Muhammad Usman from Bahadur Shah Police reached the crime scene.\n\nPolice investigation revealed that Sonia had knowledge of her maternal aunt Kanwal’s extramarital affair and had threatened to disclose it to her uncle, Saddam. Initially, it appeared that Sonia had committed suicide as her body was discovered by her uncle and aunt Kanwal. However, Kanwal’s unusual behaviour, including her absence from Sonia’s Qul ceremony, raised suspicions. During interrogation, Kanwal confessed to suffocating Sonia with a pillow after she threatened to expose her affair. To cover up the murder, Kanwal staged the drama of suicide and got her lover’s help to hang Sonia’s body from the ceiling of the room. Kanwal has been arrested and police are conducting raids to apprehend a man who assisted her in staging the crime.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:07.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898312/man-kills-young-girl-for-rejecting-marriage-proposal-in-sahiwal",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:08:55.000Z"
}
