{
  "title": "Govt urged to divert 190m pounds to cash-starved universities - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: At a time when country’s public sector universities, including Quaid-i-Azam University (QAU), are struggling to meet their expenditures, the government is all set to establish Daanish University of Emerging Sciences in the federal capital.\n\nThe new university will be established from the 190 million pounds which the UK government seized from a Pakistani property tycoon and returned to Pakistan.\n\nThe university will be set up in Islamabad’s sector H-16 on 100 acres and as per plan the first section of the university will become operational on August 14, 2026.\n\nInterestingly, the university is going to be constructed at a time when public sector universities in the country have been protesting to get funds as Higher Education Commission (HEC) is facing a shortfall of Rs60 billion.\n\nPlan to set up Daanish University from funds returned by UK govt questioned as public sector varsities in dire financial straits\n\nSources said HEC had sought Rs125 billion for the fiscal year 2024-25, but got only Rs65 billion and as a result the allocation per student further decreased in the recurring grant from Rs67,528 in 2018-19 to Rs50,956 in 2023-24.\n\nThe country’s higher education sector gets less than 2pc of GDP and recently the National Assembly standing committee recommended to the government to enhance the budgetary allocation to at least 4pc of the GDP in the fiscal year 2025-26.\n\nOn the other hand, almost all the 160 public sector universities in the country have increased their fees due to the financial issues putting extra burdens on parents. But still the increase in fees is not adequate to meet the budgetary shortfall of the universities.\n\nCurrently, almost all the three universities, including the QAU, in Islamabad are facing financial crunch and even unable to arrange salaries and pensions.\n\nLast month, the HEC and the ministry of education moved a summary to the government for the release of a Rs2.5 billion additional grant for QAU, International Islamic University Islamabad (IIUI) and Federal Urdu University to mitigate their financial issues.\n\nSources said the required funds for the three universities were yet to be released.\n\n“In Pakistan, there is no shortage of universities rather we have already extra universities. Instead of setting up Daanish University, perhaps for political purposes, the government should help existing universities and pay scholarships to students and take steps to improve quality of education,” said a faculty member of one of the public sector universities.\n\nMeanwhile, the Federation of All Pakistan Universities Academic Staff Association (FAPUASA) also showed its concerns about the government decision of setting up Daanish University.\n\n“Instead of a new university, the government should utilise the 190 million pounds on existing universities, which have been facing financial crunch,” said FAPUASA President Dr Amjad Magsi.\n\nHe said even in Ramazan many universities mainly in Baluchistan and Bahawalpur were unable to pay salaries of February.\n\n“I fail to understand the priorities of the government. Our existing universities desperately need funds and government wants to construct one more. You know HEC had sought Rs125 billion for fiscal year 2024-25 and it got Rs65 billion. Universities don’t have funds for research as they are grappling with crisis of salaries. If 190 million pounds are released for all public sector universities, the crisis in higher education sector will be resolved,” he said and added that university teachers had also been protesting against abolition of 25pc tax rebate. “There is a need to review this decision of setting up a new university to help existing ones,” he said.\n\nTalking about fee increase issue, Dr Magsi said access to higher education was around 13pc in Pakistan and the apathy of the government towards funding may deprive another huge chunk of the youth from getting higher education from public sector universities.\n\n“The hike in fees will ultimately lead to low intakes in universities and thus the financial issues will remain there along with fatal outcome of depriving youth from access to higher education especially to those who belong to lower and middle classes,” he said.\n\nSources said besides Daanish University, the government will also set up some Daanish Schools in other parts of the country from the 190 million pounds.\n\nThis project would be executed by a company being set up in Education Ministry.\n\n“The government will deposit the 190 million pounds in accounts of the company for construction of Daanish University and some schools,” said an official source. He said that in next few days, the ministry will receive the fund.\n\nThe other day, Prime Minister Shehbaz Sharif while addressing at a ceremony of Daanish University project, appreciated the former chief justice of Pakistan Qazi Faez Isa and incumbent Chief Justice Yahya Afridi for transferring the 190 million pounds to the government exchequer, which could be utilised for the establishment of the Daanish University.\n\nHe said that establishment of the university in the federal capital will not only become a model in the country but will also carve a niche among the world’s top educational centres on basis of quality of education, research and development in applied sciences.\n\nHe said that the university could be equal to renowned educational institutions of the world like Stanford, Oxford, MIT and others.\n\nAn official of the education ministry said that all public sector universities would be provided required funds in the budget of fiscal year 2025-26, adding that the state-of-the-art Daanish University was need of the hour.\n\nPublished in Dawn, March 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:07.713Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898350/govt-urged-to-divert-190m-pounds-to-cash-starved-universities",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T01:09:01.000Z"
}
