{
  "title": "Suspect held for ‘anti-state campaign’ after Balochistan train attack sent on 3-day physical remand - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Federal Investigation Agency (FIA) on Monday arrested a suspect involved in an alleged “anti-state campaign” on social media over the Jaffar Express train attack from Banigala on the outskirts of Islamabad and he was later produced before a judge, who sent him on a physical remand for three days.\n\nThe recent attack in Balochistan occurred on Tuesday afternoon when the train, travelling from Quetta to Peshawar and carrying 440 passengers, was ambushed by Balochistan Liberation Army (BLA) terrorists. They opened fire on the train and held the passengers hostage, prompting the security forces to initiate an operation that lasted two days.\n\nOn Wednesday evening, Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry confirmed that the operation had been concluded, with 33 terrorists killed. The ISPR chief also said that 26 hostages, including 18 security personnel, lost their lives but no hostages were harmed during the final rescue phase. Five more security personnel were martyred during the operation.\n\nAccording to an order, signed by Senior Civil Judge Mohammad Abbas Shah, the investigation officer requested an eight-day remand for “investigation and recovery”.\n\nHowever, the judge approved a three-day physical remand, according to the order seen by Dawn.com, adding that the suspect should now be produced before the court on Thursday.\n\nAccording to a statement issued by an FIA spokesperson, the suspect, identified as Haider Saeed, was arrested during a raid in Banigala for “spreading a hate campaign against state institutions”.\n\nThe suspect had “shared negative propaganda and derogatory content against institutions during the Jaffar Express tragedy”, the statement added.\n\nThe FIA further cited his involvement in “supporting and promoting banned terrorist organisations on social media” and said that the suspect was “not only running a poisonous campaign against state institutions but also kept sharing inflammatory statements and content in favour of terrorists”.\n\nAn investigation was launched by seizing the suspect’s social media accounts and digital evidence, the statement added, warning that strict action would be taken against him.\n\nFIA’s cybercrime wing filed a first information report (FIR) on March 16, a copy of which is available with Dawn.com. The FIR detailed that the suspect allegedly propagated false and misleading information on social media.\n\nThe FIR said, “[The suspect] is found sharing highly intimidating content/tweets on social media/Twitter…”\n\nIt further stated: “Moreover, the user […] propagated highly intimidating tweet by glorifying the banned outfit ie Balochistan Liberation Army […] with criminal intent to coerce, intimidate, create sense of fear and panic/insecurity in government and public.\n\n“Such intimidating content […] to glorify the banned outfit BLA and their terrorist activities, is clearly fanning insurgency in the state and a mischievous act of subversion to damage the state of Pakistan.”\n\nA YouTube channel, purportedly of Saeed, shows pro-PTI videos as old as November 2022.\n\nA post by PTI’s official X account yesterday termed Saeed a “committed activist and supporter of Imran Khan”. It quoted his father as claiming that their residence was raided by the “police and intelligence personnel”.\n\nMeanwhile, Punjab Information Minister Azma Bokhari slammed the PTI for allegedly running a “poisonous” campaign against the state and security forces.\n\nSpeaking on the Jaffar Express incident, she said: “In these times, you need to keep political divides aside and stand with your country and institutions. [But] there is a party which always runs a poisonous anti-state campaign, especially against security forces and our enemies take advantage of that.”\n\nShe highlighted the involvement of the Indian media during the incident. “Their media was prepared and had AI footage to run during the incident to give the impression that Pakistan is a failed state.”\n\n“The campaign [by PTI] was the same as the Indian media,” Bokhari said, claiming the similarities were not coincidental.\n\n“There were tweets from the party’s official X handle in support of the terrorists,” the PML-N leader added.\n\nAzma also criticised KP Chief Minister Ali Amin Khan Gandapur for ignoring the security concerns in his province.\n\n“KP is on the front line of terrorism, but CM Gandapur held a press conference regarding the Afghan policy saying they should not be expelled out,” she added.\n\nShe highlighted the involvement of Afghanistan in recent terror attacks such as the Jaffar Express incident and the Bannu attack, stating, “Gandapur is more worried about the Afghan people than those in KP.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/171315026bd2bdc.jpg",
  "retrievedAt": "2025-10-12T02:00:47.497Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898469/suspect-held-for-anti-state-campaign-after-balochistan-train-attack-sent-on-3-day-physical-remand",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T08:41:16.000Z"
}
