{
  "title": "FO rubbishes Modi’s ‘misleading and one-sided’ remarks on regional peace - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan has denounced and rubbished the “misleading and one-sided” remarks by Indian Prime Minister Narendra Modi regarding regional peace, according to a statement from the Foreign Office (FO) on Monday.\n\nThe FO’s response came in reaction to remarks by Modi in a podcast with American computer scientist and podcaster Lex Fridman released on Sunday, where he said that “every attempt to foster peace with Pakistan was met with hostility and betrayal” and that he hoped that “wisdom would prevail on the leadership in Islamabad to improve bilateral ties”.\n\nIn a statement issued today, the FO said: “The remarks are misleading and one-sided. They conveniently omit the Jammu and Kashmir dispute, which remains unresolved for the last seven decades despite India’s solemn assurances to the United Nations, Pakistan and the Kashmiri people.”\n\nIn the interview, Modi was questioned about the frosty ties between India and Pakistan and what he saw as their future. Responding to that, the Indian premier said that after the tragic events of Partition that saw bloodshed on both sides, “we expected them (Pakistan) to live and let live and yet, they chose not to foster a harmonious coexistence. Time and again, they decided to be at odds with India. They have waged a proxy war against us.”\n\nHe further alleged that Pakistan’s involvement was found in global incidents of terrorism, saying, “Wherever terror strikes in the world, the trail somehow leads to Pakistan. Let’s take the September 11th attacks, for example. The main mastermind behind it, Osama bin Laden, where did he eventually emerge from? He had taken refuge in Pakistan.\n\n“The world has recognised that in a way terrorism and the terrorist mindset are deeply rooted in Pakistan. Today, it stands as an epicentre of turmoil, not just for India but for the world. And we have repeatedly asked them what good can come from this path? We have urged them to abandon the path of state-sponsored terrorism for good.”\n\nRegarding his overtures for peace, Modi claimed: “When I became prime minister, I specially invited Pakistan to my swearing-in ceremony so we could turn over a new leaf. Yet, every noble attempt at fostering peace was met with hostility and betrayal.”\n\nRebuffing his remarks, the FO said India’s “fictitious narrative of victimhood” could not hide its alleged involvement in fomenting terrorism on Pakistan’s soil and the state-sanctioned oppression in Indian-occupied Kashmir (IoK).\n\n“Instead of blaming others, India should reflect on its own record of orchestrating targeted assassinations, subversion and terrorism in foreign territories.\n\n“Pakistan has always advocated constructive engagement and result-oriented dialogue to resolve all outstanding issues, including the core dispute of Jammu and Kashmir. However, peace and stability in South Asia have remained hostage to India’s rigid approach and hegemonic ambitions.”\n\nThe FO concluded by saying that the anti-Pakistan narrative emanating from India disturbed the bilateral environment and impeded prospects for peace and cooperation. “It must stop,” the FO demanded.\n\nIslamabad and New Delhi have historically shared a tumultuous relationship, with India often releasing statements against Pakistan and the latter issuing rebuttals. More recently, in the aftermath of the Jaffar Express train attack in Balochistan, Indian media ran a disinformation campaign surrounding the incident to mislead the world, according to Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry.\n\nGen Chaudhry had also maintained that India was the main sponsor of terrorism in the province.\n\n“We must understand that in this terrorist incident in Balochistan, and others before, the main sponsor is your eastern neighbour (India),” he had said, adding that the Jaffar Express attack was a “continuation of the same policy”.\n\nIn January, Indian Army Chief General Upendra Dwivedi claimed that “60 per cent of the terrorists eliminated” in IoK in 2024 were allegedly of Pakistani origin. General Dwivedi further alleged that “80pc of the remaining fighters in IoK were of Pakistani origin”. The remarks had elicited a strong response from the Pakistan Army.\n\nArmy chief General Asim Munir had termed the remarks “hollow statements” that were indicative of the Indian military’s “growing frustration” that served only to “divert the attention of their masses and the international community from their multiple internal fissures and blatant violations of human rights”.\n\nMeanwhile, the FO had highlighted the issue of extra-territorial killings — including in Pakistan — which, according to multiple reports by international media outlets, were carried out by the Indian government.\n\nA December 2024 report in the Washington Post has laid bare the ins and outs of an Indian intelligence campaign, which has been orchestrating killings — on Pakistani soil — of individuals it deems a threat to its national interests\n\nAccording to WaPo, the Research and Analysis Wing (RAW) has been running an assassination campaign in Pakistan since 2021, an operation that shares similarities with covert actions recently attributed to Indian agencies in North America.\n\nBased on interviews with Pakistani and Indian officials, militant associates, family members, and a review of police documents, the report documents six killings in Pakistan that are allegedly part of this coordinated effort.\n\nThe report notes that India extended this campaign beyond Pakistan, employing similar tactics in North America against Sikh activists, including Hardeep Singh Nijjar in Canada and Gurpatwant Pannun in the United States.\n\nThe report draws comparisons between the tactics used in Pakistan and similar Indian operations against Sikh activists in Canada and the US. In both cases, Indian operatives allegedly relied on local criminal networks and poorly trained contractors.\n\nHowever, these operations faced significant setbacks in North America, including the plot to assassinate Sikh activist Gurpatwant Pannun in New York. The assassination attempt failed when an intermediary unknowingly approached a Drug Enforcement Agency (DEA) informant posing as a hitman.\n\nCanadian officials have also accused Indian diplomats of surveilling, intimidating and plotting to assassinate Sikh activists. Electronic communications reportedly linked these diplomats to such activities, further straining relations between India and Western nations.\n\nIndia’s Ministry of External Affairs declined to comment on the report, maintaining its longstanding position of neither confirming nor denying involvement in specific killings, but Indian officials have previously justified their actions.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/17191730de813fd.jpg",
  "retrievedAt": "2025-08-25T15:14:40.328Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898503/fo-rubbishes-modis-misleading-and-one-sided-remarks-on-regional-peace",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T12:16:15.000Z"
}
