{
  "title": "PTI to attend NA moot on national security amid tight security arrangements - Pakistan - DAWN.COM",
  "author": null,
  "content": "The PTI on Monday decided to take part in tomorrow’s (Tuesday) in-camera meeting of a parliamentary panel on national security to discuss the issue of terror attacks in Balochistan and Khyber Pakhtunkhwa amid tight security arrangements.\n\nOver the last few months, both KP and Balochistan have witnessed a surge in terrorist attacks, mainly targeting the security forces, the police, and other law enforcement agencies. In the last two days, several police stations in KP have come under attack, which were successfully thwarted.\n\nMeanwhile, last week, a dramatic showdown unfolded in Balochistan with terrorists who hijacked the Jaffar Express train and took hundreds of passengers hostage. An operation to rescue the passengers lasted two days.\n\nNational Assembly Speaker Sardar Ayaz Sadiq convened the meeting for 11am at Parliament House on Tuesday in the National Assembly Hall, to be attended by parliamentary leaders from all political parties represented in parliament, along with their representatives.\n\n“The session will meet under his chairmanship and entail a comprehensive briefing on the country’s security situation to the committee members,” according to a press release issued by the National Assembly Secretariat.\n\nIt added that the military leadership would also brief the committee members on the current security situation. Furthermore, cabinet members would also participate in the meeting.\n\nA statement from the National Assembly spokesperson said there were tight security arrangements for the meeting and law enforcement agencies were also put on alert. It added that the media would not be allowed access to the parliament building and no one would be allowed inside without a special invitation.\n\nThe PTI also confirmed its attendance after PTI chief whip in the National Assembly Malik Mohammad Amir Dogar sent a list to Speaker Sadiq containing the party’s names of 14 lawmakers that would attend the meeting, including PTI interim Chairman Barrister Gohar Ali Khan, Leader of the Opposition in the National Assembly Omar Ayub, Leader of the Opposition in the Senate Shibli Faraz, and others.\n\n“We will raise the issue of the ban on meetings with Imran Khan in the National Security Committee. If the party decides to attend the meeting, we will go and talk. The war against terrorism cannot be won without PTI.\n\n“We are standing in the queue and you are not counting us,” Gohar told Dawn.com at an Iftar dinner for the opposition. He criticised Defence Minister Khawaja Asif for targeting and mentioning only the PTI in his recent speeches in the National Assembly while ignoring India and the roles of its intelligence agency RAW.\n\nThe government had announced it was convening the meeting to discuss the recent surge in terror attacks days after the hijacking of the Jaffar Express train in Balochistan’s Bolan, resulting in at least 31 casualties.\n\nMeanwhile, the government is also said to be mulling a massive operation against the outlawed Balochistan Liberation Army and other terrorist organisations, involved in growing terror attacks in the province.\n\nA source in the National Assembly had told Dawn on Sunday that since no parliamentary committee on security was formed, therefore, members of the standing committees on defence and foreign affairs from the National Assembly, federal cabinet members, chief ministers of the four provinces and leaders of all parliamentary parties or their representatives would attend the huddle.\n\nPrime Minister Shehbaz Sharif and Chief of Army Staff Gen Syed Asim Munir will also join the briefing.\n\nMeanwhile, one of the PM’s aides, Rana Ahsan Afzal, said that the government would soon also convene a Multi-Party Conference to discuss the security situation. Speaking to DawnNewsTV on Sunday, he expressed the hope that the government would invite all political forces and stakeholders to the conference.\n\nHe also revealed plans to carry out a massive operation against terrorists in Balochistan but did not offer any details.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:14:38.493Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898514/pti-to-attend-na-moot-on-national-security-amid-tight-security-arrangements",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T15:10:41.000Z"
}
