{
  "title": "Unprecedented cleaning operation across ICT, Punjab improves cities’ look on Eid",
  "link": "https://www.app.com.pk/national/unprecedented-cleaning-operation-across-ict-punjab-improves-cities-look-on-eid-2/",
  "date_published": "2022-07-11T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP):The civic authorities of Islamabad and Punjab’s different cities launched a massive cleanliness operation in their respective areas to clean up the urban centres in line with the directives of Prime Minister Shehbaz Sharif.\nThe management and disposal of animal waste, offal and entrails has always been a serious challenge for the civic authorities on the occasion of Eid-ul-Azha whereas this year due to leadership guidance of Prime Minister Shehbaz and Punjab Chief Minister Hamza Shehbaz, the district administration amicably disposed of animal left over to their designated dumping sites.\nThe solid waste management companies established in collaboration with Turkish partners Albayrak Corporation ensured a well-managed network of waste collection and disposal across all the major districts of Punjab province under the leadership of then Chief Minister Shehbaz Sharif.\nThe companies through their coordinated and field efficient staff adopted best practices in difficult to manage areas of Punjab for waste disposal especially on the occasion of Eid-ul-Azha which have been replicated under the patronage of Prime Minister Shehbaz Sharif in federal capital.\nJananzab, a daily commuter of twin cities of Rawalpindi and Islamabad, told APP that he witnessed a swift operation by the civic authorities in various areas of the garrison city to collect and dump animal offal.\nHe said every year there used to be heaps of garbage and animal waste flowing out of carcasses creating huge smell and filth in the environment. But this time the situation is very well managed as the teams were timely collecting animal waste from different corners of the city.\nAli, a resident of Rawalpindi said every year on Eid-ul-Azha, the offal used to rest and rot on the streets and roads along the dumpsters that used to generate massive odor and pathogens in the environment that are detrimental for human health and nature. The gypsies hovering over their donkey carts and three wheeler mini trucks in the city used to collect offal and entrails for extracting fats and other recyclable items out of animal waste. They used to tear the animal entrails and spread the animal waste all over the street and roads, leaving the atmosphere unlivable and unbreathable, he said.\nBut this time waste management companies and civic authorities ensured in time management of animal offal that helped reduce the risk of pollution on the streets and roads, he added.\nHina, a resident of Islamabad said the civic authorities have surprised the masses through their efficient response and timely collection of animal waste as the streets that used to end up full of filth and smell were now found neat and clean during animal sacrifices on Eid.\nTo ensure success of cleanliness operation, the Capital Development Authority (CDA) had cancelled the leaves of sanitation staff and divided the federal capital into four zones to ensure neat and clean federal capital. The civic agency has deputed over 200 vehicles tractor trolleys, garbage compactors, escape lifters, truck dumpers, front loaders, shovels and dozers and more than 2,000 sanitation staff, besides digging up 80 pits in 44 locations to dispose of remains of sacrificial animals.\nA helpline 1334 has also been set up for registering complaints regarding lifting of animal waste on civic agency’s telephone numbers including 051 9213908; 051 9203216;051 9223171;051 9211555. While complaints could also be lodged on WhatsApp number 0335-55001213.\nIn addition, two emergency cells have been established in G-6/1/4 and transport section of the sanitation directorate will work day and night at the Fire Headquarters in G-7/4.\nFaisalabad Waste Management Company has disposed of over 6,500 tons animal waste with the help of 75 dumpers on the first day of Eid-ul-Azha. The 15 transfer stations were being cleaned on daily basis.\nOn the first day of Eid-ul-Azha the helpline 1139 received over 2,310 complaints of citizens. Of which 2,286 were resolved promptly while working was continued on resolving remaining 24 complaints. While 8 complaints received by a local government control room had also been resolved, said Faisalabad Waste Management Company (FWMC), Chief Executive Officer (CEO) Bilal Firoz Joya.Meanwhile, Punjab government has set a new record of ensuring cleanliness on Eid-ul-Azha after successful execution of operation clean up in Lahore, Multan, Nankana Sahib, Gujranwala, Bahawalpur, Sheikhupura and other districts. The district administration has lifted over millions of tons offal and entrails of sacrificial animals despite monsoon rains and flood like situation in various areas.\nThe operation clean up was initiated at 5 am with thousands of tractor trolleys, cleaning and lifting machines and trucks. The waste management authorities established Eid Awareness camps to education masses and distribute waste bags among citizens to properly dump their animal waste.",
  "retrievedAt": "2025-08-11T15:14:00.254Z"
}
