{
  "title": "Coalition govt thwarts Imran’s conspiracy to turn Pakistan into Sri Lanka: Marriyum",
  "link": "https://www.app.com.pk/national/coalition-govt-thwarts-imrans-conspiracy-to-turn-pakistan-into-sri-lanka-marriyum/",
  "date_published": "2022-07-11T17:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Monday said the coalition government, led by Prime Minister Shehbaz Sharif, had thwarted Imran Khan’s conspiracy to turn Pakistan into Sri Lanka whose economy was completely collapsed.\n“Keep lying Imran Sahib, while Shehbaz Sharif, his brother (Nawaz Sharif) and his allies in the government will continue to strive for the economic self-sufficiency and national development, and to resolve problems of people,” she said in a news statement while reacting to the Pakistan Tehreek-e-Insaf Chairman’s address to a public gathering.\nThe minister said Imran Khan should be ashamed of himself as it was his government which signed agreement with the International Monetary Fund (IMF) on tough conditions.\n“Shame on you, Imran Khan as it is you who has said that he would rather commit suicide instead of going to IMF,” Marriyum added.\nShe said the national economy would have been in better state if Imran had not misused the power to make billions through corruption.\nCalling Imran Khan a “beggar”, she said he sold watches (gifts) from Toshakhana to make a few millions.\n“What he has done while being into the power for four years? Why is he crying and whining now,” she questioned.\nShe said ironically, the person, who took loans worth over Rs 20,000 billions, was showing his concern for the economy.\nIf Imran had really cared about the economy, he would not have rejected Shehbaz Sharif’s offer for the charter of economy with arrogance, the minister added.\n“By listening to Imran’s lies, the character of Mr Fradiya (fraudster) comes to mind,” she quipped.\n“The quality of Imran’s speech is neither that of a political leader nor that of a modest person,” the minister observed while advising him to start taking part in comedy dramas.",
  "retrievedAt": "2025-08-11T15:14:00.287Z"
}
