{
  "title": "Ground breaking of Balakot Hydro Power Plant next month",
  "link": "https://www.app.com.pk/national/ground-breaking-of-balakot-hydro-power-plant-next-month/",
  "date_published": "2021-03-05T18:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 05 (APP): Khyber Pakhtunkhwa Chief Minister Mahmood Khan Friday directed the Energy and Power Department to finalize arrangements for ground breaking of Balakot Hydro Power Plant next month.\nPrime Minister Imran Khan was expected to perform the ground breaking of the plant, he said while chairing a meeting regarding the project here at the Chief Minister’s Secretariat.\nAdvisor to Chief Minister for Energy and Power Himayat Ullah Khan, Principal Secretary to Chief Minister Shahab Ali Shah, Secretary Energy and Power Zubair Khan, Chief Executive Officer PEDO and other relevant high-ups attended the meeting.\nThe chief minister was briefed about the progress so far made on the said project. It was told that contract of project had been awarded while contract agreement would be signed with the contractor soon.\nThe 300 mega watt power project is being set up on Kunhar River in Mansehra district with the assistance of Asian Development Bank at an estimated cost of Rs 85 billion.\nThe meeting was informed that land acquisition for the project was in process and the department was in close coordination with the concerned district administration in order to complete the land acquisition process as soon as possible.\nThe chief minister also directed the District administration of Mansehra to complete land acquisition process on priority basis and hand over the land to Energy and Power Department so that practical work on Balakot Hydro Power Project could be initiated well in time.\nThe chief minister said that incumbent government was taking result oriented steps under a well devised strategy to utilize the hydro power potential of the province with the aim to meet the province’s needs of energy, create job opportunities and promote industrial activities in the province.\nMahmood Khan remarked that the incumbent provincial government had planned a number of mega hydro power projects in the province which, on completion, would make the province self-sufficient in power production.",
  "retrievedAt": "2025-08-11T20:26:48.496Z"
}
