{
  "title": "ANF seizes 2,698 kg drugs worth US$ 87,716 mln in 23 operations; arrests 24",
  "link": "https://www.app.com.pk/national/anf-seizes-2698-kg-drugs-worth-us-87716-mln-in-23-operations-arrests-24/",
  "date_published": "2021-03-05T11:56:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 05 (APP): Anti Narcotics Force (ANF) Pakistan has seized 2698.085 kg narcotics worth US $87.716 million in international market, arrested 24 culprits including two ladies and impounded 13 vehicles while conducting 23 counter-narcotics strikes throughout the country.\nAccording to an ANF spokesman, the seized drugs comprised of 60 kg Heroin, 1550.61 kg Hashish, 1084.1 kg Opium and 3.375 kg Amphetamine.\nANF Balochistan, Police Station, Quetta intercepted a car and recovered 5 kg Hashish from parking area of AK Mover Bus terminal at Nawa Killi road District Quetta. An accused namely Abdul Ghani resident of Nasirabad Zhob, Balochistan was arrested.\nIn another operation, Police Station Quetta intercepted a truck and recovered 186 kg Hashish from Mugha Faqirzai cross Kuchlak-Zhob Highway District Qilla Saifullah. In third operation, Police Station Gwadar in collaboration with Pakistan Navy, Karachi recovered 700 kg Hashish from a pickup parked at general area of Pishukan District Gwadar.\nANF Punjab, Police Station Sialkot raided near Cheema Hospital, Wazirabad road Daska and recovered 2.100 kg Hashish from personal possession of the arrested accused persons namely Zahid Khan and Farooq Khan residents of Sialkot. In another operation, Police Station Sialkot intercepted two suspected parcels from Couriers Service Company Wazirabad road Sialkot booked for Taiwan by Muhammad Shahzad Butt who was arrested.\nThe parcel consisted of 14 kitchen accessories. Two kg Amphetamine Ice was recovered which was tactfully concealed in both the cartons. In third operation, Police Station, Lahore raided near Mohallah Ali Block Rehman City situated near Saggain bypass Lahore intercepted a car and recovered 130.800 kg Hashish from arrested accused, Ali Raza resident of Gujranwala and Muhammad Bilal resident of Sheikhupura. In forth operation, Police Station, Faisalabad raided near Darvaish Hotel Canal road Faisalabad and recovered 0.500 kg Amphetamine Ice from secret cavities of a car.\nTwo accused persons namely Yasir Shafi resident of Islamabad and Raidullah Khan resident of Mardan were arrested on the spot. In fifth operation, Police Station Multan raided near Shah Rukn-e-Alam/Makhdoom Rasheed Motorway Toll Plaza District Multan and arrested an accused person namely Aman Ullah resident of Dera Bughti alognwith 180 Kg Hashish recovered from secret cavities of the vehicle.\nIn sixth operation, Pakistan Rangers Punjab handed over an accused person namely Muhammad Shakeel resident of Lahore to Regional Directorate ANF Police Station, Lahore with recovery of two kg Heroin.\nIn seventh operation, Pakistan Rangers Punjab handed over four accused persons namely Ali Asghar, Muhammad Shahbaz resident of Sheikhupura, Ansar Javed resident of Narowal and Samar Abbas resident of Lahore to Regional Directorate ANF Police Station, Lahore with recovery of 15 kg Heroin.\nIn eighth operation, Police Station Mianwali conducted a raid near Hamza Mill, Tehsil Piplan District Mianwali. An accused person namely Zaheer Abbas resident of Gujranwala was arrested.\nDuring search of the vehicle two kg Heroin was recovered. In ninth operation, Police Station Faisalabad raided near Saleem Chowk Satyana Road Faisalabad and arrested an accused namely Abdul Qayyum resident of Peshawar. During search of the vehicle, nine kg Heroin was recovered.\nANF Sindh, Police Station Korangi conducted a raid at QICT Port Qasim, Karachi and seized a consignment of container. During search 198 kg Opium was recovered from the container which was booked by Exporter namely M/S Universal Logistic System, Karachi for Canada.\nIn another operation, Police Station Sukkur in collaboration with 82 Wing Shahbaz Rangers local Police and District Administration conducted an operation at Goth Masjid, Goth Rahoo Ja Aithya and Goth Konkar Tehsil and District Qamber Shahadkot and destroyed 40 acres Poppy Crop and seized 1.500 kg Poppy Sprout (Doday).\nANF KP, Police Station Peshawar visited at TCS Head Office on Ring road, Peshawar and checked a suspected parcel which was booked by Abdul Wahid for Gujranwala and seized two packets of Hashish weighing 1 kg. In another operation, Police Station Peshawar intercepted a truck near Matni bypass Kohat road Peshawar and recovered 312 kgs Hashishk. An accused namely Qat Ali Khan resident of Wazirstan was arrested on the spot.\nIn third operation, Police Station DI Khan conducted an operation at Sheikh Yousaf road DI Khan and recovered 3.600 kgs Hashish from the arrested accused namely Muhammad Junaid resident of DI Khan.\nIn fourth operation, ANF Staff at Bacha Khan International Airport, Peshawar (BKIAP) apprehended an accused namely Numan Khan resident of Charsadda and recovered 0.875 kg Amphetamine Ice, which was concealed in the wooden crate of Oranges. In fifth operation, Police Station Kohat arrested an accused from Al Faisal YuTong Express Adda area nearby Pindi Pul Kohat (Pindi road Kohat) and recovered 3.300 kg Hashish from Muhammad Zeeshan resident of Charsadda.\nIn sixth operation, PS ANF Peshawar conducted an operation on the house of notorious drug smuggler namely Bakht Rawan resident of Nawan Kalay District Charsadda and recovered 11 agricultural items. During search 881 kg Opium was recovered.\nMoreover, four magazines of Ak-47, 55 rounds and 433 rounds of 303 gun were also recovered. Accused and owner of the house Bakht Rawan was arrested on the spot.\nANF Rawalpindi, Police Station Attock established a Naka near Iqbal Shaheed Toll Plaza, G.T Road Attock and recovered 1 kg Hashish from a woman, Saima alias Sana resident of Mardan on the spot.\nIn another operation, Police Station Rawalpindi during routine checking at Motorway Link Road, Islamabad, intercepted a car and recovered 1.410 kg Hashish which was concealed in the vehicle.\nTwo accused including a lady namely Jan Muhammad and Zolaida Bibi residents of Swabi were arrested on the spot. In third operation, Police Station Dina intercepted a truck at Tarkai Toll Plaza, main G.T road Sohawa, District Jhelum and recovered 32 kg Heroin, 24.400 kg Hashish & 3.600 kg Opium and arrested accused Ijaz Hussain resident of Peshawar.\nAll cases have been registered at respective ANF Police Stations under CNS Act 1997 and further investigations are underway.",
  "retrievedAt": "2025-08-11T20:26:58.658Z"
}
