{
  "title": "NAHE holds E-Office training for HEC employees",
  "link": "https://www.app.com.pk/national/nahe-holds-e-office-training-for-hec-employees/",
  "date_published": "2021-03-05T11:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP): The National Academy of Higher Education (NAHE) organized a hands-on training for e-office to top-up virtual trainings provided on the subject in conjunction with the National Information Technology Board (NITB).\nThe HEC staff was now able to benefit from a practical training with onsite instructors to answer questions and practically work through problems respective employees were facing.\nMembers from the Faculty Affairs Division were trained in the first round – other HEC divisions will receive similar top-up training in the weeks to come.\nDirector General of Faculty Affairs Muhammad Raza Chohan appreciated NAHE for conducting this training as well as Saif ur Rehman of NITB for conducting an interactive and effective session.\nThe E-office is an electronic system of office and operational management which will help make functions more efficient and improve accountability at HEC. The programme is being implemented across various ministries in the government and has been approved by the Federal Cabinet and the Nation e-Government Council.\nThe instructor was able to showcase unique features of the e-office system, inclusive of databases of all government offices, ministries, and officers.\nThe potential benefits for this are environmental as well as practical because with its proper utilization, there will be flexibility in where employees can work from. This will help support staff as services increasingly move online and ensure efficiency, consistency, and transparency across the board.\nNAHE is established as a stand-alone, autonomous institution operating under the auspices of HEC to improve the quality of teaching, research and governance in Higher Education Institutions (HEIs) across Pakistan.\nIt is envisioned as the premier institution for quality research and teaching related to all aspects of higher education in Pakistan. This series of trainings is one of multiple ongoing NAHE endeavors at HEC.",
  "retrievedAt": "2025-08-11T20:26:58.270Z"
}
