{
  "title": "Tourism Expo and Family Festival, PM’s vision to promote tourism sector for creating jobs: Shibli",
  "link": "https://www.app.com.pk/national/tourism-expo-and-family-festival-pms-vision-to-promote-tourism-sector-for-creating-jobs-shibli/",
  "date_published": "2021-03-05T07:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Friday that tourism sector was being promoted under the vision of Prime Minister Imran Khan to create new job opportunities in the country.\nSpeaking at the inaugural ceremony of three-day “Islamabad Tourism Expo and Family Festival 2021” here he said that the festival, being organized on the directives of the prime minister to promote tourism industry, was also meant to provide healthy entertainment facilities to the local residents. He asked the residents of the capital to visit F -9 Park and bring their families to enjoy the multiple activities being offered by the organizers.\nThe minister asked the youth to participate in paragliding as it was an affordable sports activity arranged in the event. He said that delegates from Pakistan and foreign countries were participating in the festival. The minister urged the media to give coverage to this event as it would help promote the country’s sports and culinary delights.\nBesides paragliding, para-trooping, children’s games and eatables stalls have been set up in the festival to attract more and more visitors to the event. Horse riding, vintage cars exhibition and motorcycle show would also feature the festival and would hopefully attract a large number of youth.\nMinister for Civil Aviation Ghulam Sarwar, Minister for Energy Umar Ayub, Special Assistant to the Prime Minister on Zulfiqar Bukhari, Minister for Inter Provincial Coordination Fehmida Mirza, also addressed the participants on the occasion .\nThe three-day event is being organized by the private sector in which the government is extending all necessary facilities to make the event a complete success.",
  "retrievedAt": "2025-08-11T20:27:01.691Z"
}
