{
  "title": "Pakistan to be made tourism-magnet to catch world adventurers: Omar Ayub",
  "link": "https://www.app.com.pk/national/pakistan-to-be-made-tourism-magnet-to-catch-world-adventurers-omar-ayub/",
  "date_published": "2021-03-05T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP): Minister for Energy Omar Ayub Friday said the government was making all-out efforts to attract the attention of tourists across the globe to exploit the country’s real potential in the tourism sector.\n“Pakistan will be made tourism-magnet to get the attention of world adventurers in line with the vision of Prime Minister Imran Khan,” he said while talking to media persons at the inaugural ceremony of a three-day “Tourism Expo & Family Festival” here at the Fatima Jinnah Park.\nMinister for Information and Broadcasting Senator Shibli Faraz, Special Assistant to Prime Minister on Overseas Pakistanis and Human Resource Development Syed Zulfikar Abbas Bukhari, Minister for Aviation Ghulam Sarwar Khan and Minister for Inter-Provincial Coordination Dr Fehmida Mirza, besides top officials of the district administration also attended the ceremony.\nHighlighting the importance of the event, Omar Ayub said it would add more to the beauty of the Capital as visitors, as well as locals, would witness the mesmerizing environment and the sky full of colours during the paragliding and skydiving shows.\nHe said these air shows were being arranged in collaboration with the Armed Forces wherein civilian paragliders and skydivers would also be participating.\nThe minister appreciated and thanked the national leadership for ensuring coordinated efforts in holding such a mega event, which would open up new avenues of adventure tourism in Pakistan.\nOmar Ayub said similar events would also be arranged in other parts of the country including northern areas and mentioned that a suitable site for paragliding and skydiving activities were being identified in Gwadar, an ultimate destination of China Pakistan Economic Corridor (CPEC).",
  "retrievedAt": "2025-08-11T20:27:03.105Z"
}
