{
  "title": "Free & fair elections do not suit opposition’s ideology: Shibli",
  "link": "https://www.app.com.pk/national/free-fair-elections-do-not-suit-oppositions-ideology-shibli/",
  "date_published": "2021-03-05T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Friday said the opposition did not give positive response to the Pakistan Teheek-e-Insaf’s initiatives for open balloting to hold free and transparent Senate elections because it did not suit their ideology and priorities.\nAddressing a news conference flanked by Minister for Science and Technology Chaudhry Fawad Hussain and PTI’s Senator-elect Ali Zafar, he said the scourge of corruption was introduced in politics after 1985 party-less elections when the persons like Nawaz Sharif had entered the political arena.\nThe society’s social and ethical values, he said, were destroyed and importance was given to accumulating wealth instead of protecting the people’s interests.\nBoth the Pakistan Muslim League-Nawaz and the Pakistan Peoples Party (PPP) were responsible for moral degradation in the political culture and democratic values, ruining economy, and undermining the credibility of traditional institutions.\nThe minister said Prime Minister Imran Khan joined politics with the slogan to end corrupt practices like horse-trading, use of money and bullying.\nHe said elections were the essence of democracy. A building could not be erected properly if its foundation was faulty. With transparency in the electoral process, the image of institutions and parliamentarians could be restored, he added.\nShibli Faraz said the PTI did strive to materialize the PM’s narrative about transparent elections by introducing the bill in the National Assembly, and sending a presidential reference to the Supreme Court for guidance for open balloting in the Senate polls.\nHe said on one side there was Imran Khan, the torch-bearer of hope and truth, and on the other there were the harbingers of ‘darkness’. The results of recent Senate elections had vindicated the prime minister’s stance.\nReplying to the questions of media-persons, he said the PTI had expelled its members of the provincial assembly for violation of party discipline in the 2018 Senate elections and the media should ask the Pakistan Democratic Movement (PDM) parties as to how many members they had expelled on that count.\nThe PTI’s struggle, he said, was for purging the system of corruption for the coming generations keeping political considerations aside.\nHe said the prime minister’s decision to take a fresh vote of confidence proved that values were more important for him than power, and no such example existed in the country’s political history .\nHe said Imran Khan was fighting against those, who had plundered the national resources, and every upright and honest person stood by him in that struggle.\nThe minister said one had to face odds and difficulties in the fight for truth, but it was more important as to who stood firm on his / her stance.\nHe said Prime Minister Imran Khan as an individual started his struggle against the status quo and now with the grace of Allah Almighty, the PTI was the single largest party in both the National Assembly and the Senate.\nShibli Faraz said the opposition leaders considered those elections fair and free which they won and, otherwise, the polls were termed unfair and rigged. Whereas the PTI leadership had the clear stance that objections would be raised if elections were not free.\nTo a question, he said the PML-N had made a ludicrous claim that they had offered party tickets to the PTI members for voting for the PDM candidate Yusuf Raza Gilani. The PML-N ticket had no value in comparison to that of the PTI, which had well worth. Actually PML-N leader Maryam Nawaz had used the word ‘ticket’ as simile for ‘currency notes’.\nIt was also a matter of disappointment that Pakistan Peoples Party leader Bilawal Bhutto Zardari despite being an educated person, was giving justifications for corruption, he added.\nThey were the people, who made victory signs while coming out of jail for court proceedings in corruption cases, and Imran Khan was fighting against that mindset, the minister remarked.\nAbout the incumbent Sadiq Sanjrani nomination for the Senate chairmanship, Shibli Faraz said the PTI leadership took the decision after consultations with the allied parties.\nSanjarani belonged to Balochistan and the government wanted that province’s representation in the Federation as the National Assembly speaker belonged to the Khyber Pakhtunkhwa,the PM to Punjab, and the president belonged to Sindh.\nAnother reason for Sanjrani’s nomination was his performance of the past three years as Senate chairman as he was a popular figure who had run the House in a very efficient manner, he added.",
  "retrievedAt": "2025-08-11T20:26:52.111Z"
}
