{
  "title": "Sherry Rehman tributes PPP coalition govt, partners on 13th anniversary of 18th Amendment",
  "link": "https://www.app.com.pk/national/sherry-rehman-tributes-ppp-coalition-govt-partners-on-13th-anniversary-of-18th-amendment/",
  "date_published": "2023-04-19T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):Federal Minister for Climate Change, Senator Sherry Rehman on Wednesday paid tribute to the then coalition partners of the Pakistan Peoples Party (PPP) government on the 13th anniversary of the 18th Constitutional Amendment.\nIn a series of tweets, the federal minister took to Twitter to share her thoughts on the occasion saying, “Today marks 13 years since the passage of the historic 18th Amendment.”\nShe said the credit for the restoration of the 1973 Constitution went to the coalition government of the People’s Party and former President Asif Ali Zardari.\nمتفقہ طور پر 102 ترامیم اس کو ایک بے مثال پارلیمانی کامیابی بناتا ہے۔ گزشتہ حکومت میں 18ویں ترمیم کے خلاف ہرزہ سرائی کی گئی، 18ویں ترمیم کو واپس اور منسوخ کرنے کے  مطالبے کئے گئے۔ کسی کو نہیں بھولنا چاہیے کہ 73کا متفقہ آئین اور 18ویں متفقہ ترمیم  ہی ملک کی سلامتی کے ضامن ہیں۔ 3/3\n— SenatorSherryRehman (@sherryrehman) April 19, 2023\n“I salute the coalition government of PPP and all the partners involved in achieving this great milestone. Behind the 18th Amendment was Asif Ali Zardari’s vision of provincial autonomy and rights,” Sherry Rehman said.\nHe (Asif Zardari) transferred all the rights enjoyed by the President to the Parliament and the elected prime minister, she said, adding, “Around 27 ministries and departments were transferred to the provinces, and provincial recognition was given as per the long-standing demand of the people of Khyber Pakhtunkhwa.”\nShe added that some 102 unanimously enacted amendments made this an unprecedented parliamentary achievement. The 18th Amendment was criticised by the previous government, She said.\n“There were demands made to roll back and repeal the 18th Amendment. No one should forget that the 1973’s unanimously approved Constitution and the 18th consensus-based Amendment are the guarantors of the country’s security,” Sherry Rehman said.",
  "retrievedAt": "2025-08-11T08:20:19.102Z"
}
