{
  "title": "SC disposes of Defence Ministry’s plea seeking all elections simultaneously",
  "link": "https://www.app.com.pk/national/sc-disposes-of-defence-ministrys-plea-seeking-all-elections-simultaneously/",
  "date_published": "2023-04-19T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): The Supreme Court on Wednesday disposed of the plea filed by the Defence Ministry to hold general elections across Pakistan simultaneously.\nA three-member SC bench comprising Chief Justice of Pakistan (CJP) Umar Ata Bandial, Justice Ijaz Ul Ahsan and Justice Munib Akhtar heard the petition.\nThe court in its written order stated that there were a number of miscellaneous matters before the court in the shape of various CMAs.\n“We first take up CMA Nos. 2770-2772/2023 since they relate to the compliance required by the order dated 14.04.2023, for the release of Rs 21 billion to the Election Commission of Pakistan for the holding of general elections to the Punjab and Khyber Pakhtunkhwa assemblies.\n“CMA 2771/2023 was a report filed by the State Bank of Pakistan stating that a sum of Rs 21 billion from Account No. I of the Federal Consolidated Fund (“Fund”) has been allocated for purposes of the aforementioned general elections. The Commission has, however, filed a report (CMA 2770/2023) stating that the said funds have not yet been made available to it. These CMAs were taken on record.\n“The Finance Division has also filed a report (CMA 2772/2023) in terms of the Order. The report sought to justify why the funds had not been made available. Briefly stated, it was reported that the matter of providing the funds was placed before the Federal Cabinet which, at its meeting held on 17.04.2023, decided that a demand for the authorization and release thereof be sent to the National Assembly for its consideration in terms of Article 82(2) read with Article 84 of the Constitution. The following\nmotion was tabled before the National Assembly the same day. The Finance Division had reported that this motion was rejected by the National Assembly and the necessary funds could not therefore be made available to the Commission.\n“The first point to note was that, as set out in the Order, it was specifically queried from the team from the Finance Division and confirmed by them, that Article 84 allowed and enabled the Federal Government to make expenditures from the Fund for, inter alia, “expenditure upon some new service not included in the Annual Budget Statement” during any financial year. For suc\nh expenditure the Federal Government obtained ex post facto authorization from the National Assembly in the form of a Supplementary Budget Statement. The team from Finance Division also stated that the normal practice was for the Supplementary Budget Statement for the current financial year (as also any previous years) to be laid before the National Assembly along with the Annual Budget Statement for the succeeding financial year, with both then to be approved.\nThere can therefore be no doubt, as noted in the Order, that the Federal Cabinet all along itself had the authority and power to authorize the expenditure of Rs. 21 billion from the Fund in order to enable the Federation to perform its constitutional obligations in relation to the general elections.\n“The Attorney General, in our view quite correctly and properly, did not attempt to seriously dispute the position as just stated. However, the reason why in the present case the matter was first referred to the National Assembly was sought to be explained. The Attor\nney General submitted that at an earlier date, the National Assembly had passed a resolution expressing its disapproval of the release of any funds for the holding of the general elections. It was this resolution that created a certain doubt and uncertainty, and so the Federal Cabinet decided to first refer to the National Assembly. On a query from the Court the learned Attorney General stated that the earlier resolution was not in terms of a specific request for a grant of funds for a financial measure.\nWith respect, we were not satisfied that the earlier resolution stood in the way of the Federal Cabinet exercising its constitutional power under Article 84. The reasons for this are set out below. To the extent therefore that the report of the Finance Division concludes, or proceeds on the basis that, the Federal Government did not itself have the requisite constitutional authority and power at all times to authorize the expenditure of Rs 21 billion for the general elections, it cannot be accepted.\n“The effect of the Federal Cabinet’s decision to refer the matter to the National Assembly in terms as noted above, and for Demand No. 64A to be rejected when voted upon by that House may now be considered. In terms of the system of parliamentary democracy envisaged by the Constitution the Government of the day must command the confidence of the majority of the National Assembly at all times.\nFurthermore, given that the office of Prime Minister has primacy (who is declared by Article 91(1) to be the chief executive of the Federation), this also means that the Prime Minister must enjoy the confidence of the majority of the National Assembly at all times. It followed from the foregoing (and this was an important constitutional convention) that the Government of the day must be able to secure the passage of all financial measures that it submits before the National Assembly.\nThis would be certainly true for a financial measure of constitutional importance, i.e., one that seeks the release of funds for the holding of general elections to two Provincial Assemblies. When viewed from this perspective the rejection of Demand No. 64A has serious constitutional implications. One possibility was that the Government (and also, since the Federal Cabinet was appointed on the advice of, and is headed by, him, the Prime Minister) had lost the confidence of the majority of the members of the National Assembly. The Attorney General categorically stated that this was not so.\nThe Federal Cabinet and the Prime Minister have, and had, at all times the confidence of the majority of the National Assembly. For present purposes, we accept this statement made by the Attorney General. The other possibility then was that the putative rejection of Demand No. 64A was to be regarded as anomalous, and the resulting situation could be rapidly rectified. The Attorney General fully appreciated the serious constitutional consequences that would flow, were the first possibility to reflect the correct position.\nFurthermore, any future to and fro of this matter between the executive and legislative branches would not advance or serve any constitutional purpose. There would be a serious breach of constitutional duty and obligation.\n“It is also to be emphasized that the orders of this Court seek only to enforce and effectuate binding constitutional obligations. A disobedience and defiance of the orders of the Court can itself have serious consequences. The Attorney Gener\nal was therefore directed to draw the attention of the Federal Cabinet and the Prime Minister to the foregoing so that the matter is remedied at the earliest. The Court required that appropriate remedial measures be taken in full measure not later than 27.04.2023 and, in particular, by that date the sum of Rs 21 billion be provided, in immediately available and realizable funds, to the Commission for the holding of the general elections to the Punjab and KPK Assemblies. CMA 2772/2023 was, for the time being, dealt with in the foregoing terms.\n“CMA 2773/2023 was filed by the Federal Government. It seeks to place on record a report, prepared by the Ministry of Defence, on the security situation in the country at the present time and for the next few months This CMA was moved under Order 33, R. 6 SCR and the relief sought was for the order dated 04.04.2023, whereby CP 5/2023 was finally disposed of, be recalled.\nIt was pointed out to the Attorney General that such an application could not be entertained nor relief granted, as CP 5/2023 had been decided by final judgment. CMA 2773/2023 was therefore disposed of as not maintainable.\n“The last matter was CMA 2769/2023 which purports to be a representation filed by the Commission. It seeks, in essence, for the Court to restore the date for the general elections to be 08.10.2023, which was impugned before the Court in CP 5/2023 and set aside by the order dated 04.04.2023.\nThe Commission seeks restoration of the said date on essentially security grounds, which in large measure overlap the concerns expressed in the report of the Ministry of Defence appended to CMA 2773/2023. In our view the Commission seeks, in the guise of a representation, to re-agitate matters that were before the Court when CP 5/2023 was heard and decided, and in which two fully instructed learned counsel were permitted to make submissions on its behalf.\nIt was impermissible to attempt to so reopen issues and questions that already stand finally decided. The representation was not maintainable and CMA 2769/2023 was disposed of accordingly.”",
  "retrievedAt": "2025-08-11T08:20:28.308Z"
}
