{
  "title": "PM terms Gwadar Int’l airport a gift from China; to serve as catalyst for economic prosperity, regional connectivity",
  "link": "https://www.app.com.pk/global/pm-terms-gwadar-intl-airport-a-gift-from-china-to-serve-as-catalyst-for-economic-prosperity-regional-connectivity/",
  "date_published": "2024-10-14T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said that the completion of Gwadar International Airport showed Chinese leadership’s commitment and dedication to support Pakistan’s economic agenda and to help develop its backward areas.\nAddressing a ceremony of virtual inauguration of the newly completed Gwadar International Airport here, the prime minister said that the landmark achievement was all about time-tested friendship between the two countries.\nHe expressed the hope that the completion of this international airport would transform Gwadar’s economy in particular and the economy of Pakistan in general.\nPrime Minister Shehbaz Sharif and Chinese Prime Minister Li Qiang were at hands to unveil the plaque of Gwadar International Airport. The ceremony was attended by members of the both delegations, ministers, military leadership and senior officials.\nThe prime minister said that today, both sides had witnessed the signing and exchange of MoUs between the two countries in various fields of industry, commerce and agriculture.\n“No doubt these MoUs will shape into agreements very soon through joint efforts of both countries. Once again, I thank you for your visit to Pakistan out of your busy schedule which is a reflection of your commitment to promoting friendship between the two countries,” the prime minister told the Chinese premier.\nHe further said that earlier today, the two sides held comprehensive discussions.\nThe prime minister also thanked President Xi, the Chinese premier and the people of China for their generous gift in shape of Gwadar International Airport.\nHe said “This gift is another feather in CPEC’s cap” and assured his Chinese counterpart to work closely with him to complete the second phase of China Pakistan Economic Corridor (CPEC) and the peace and security of the people of Pakistan and China.\nPrime Minister Sharif further said that the completion of project reflected the untiring efforts of the Chinese and Pakistani engineers and workers who made it possible as world class airport.\n“It will be remembered as another gift by China,” he added.\nChinese Prime Minister Li Qiqang, in his remarks, congratulated the Pakistani nation and the government on behalf of the Chinese government and his people on the completion of Gwadar airport which was a manifestation of the commitment of the Chinese and Pakistani engineers and workers and also thanked the Pakistani society for their support.\nHe said that it was a critical step for realizing the vision of regional connectivity and whatever they had achieved in the last many years, demonstrated the strength of Pak-China friendship, adding the inauguration would significantly capitalize to promote shipping and port activities and enhance regional connectivity in the entire region.\nPremier Li further said that as a symbol of deepening cooperation, ‘CPEC played a positive role in Pakistan’s economic and social development and regional integration’.\nHe said that it was all possible owing to the consistent efforts of both sides.\nThe Chinese prime minister assured that China would continue to work closely with the intimate Pakistani friends in building and benefiting together by pursuing the goals of high standards, sustainability and high quality of Belt and Road initiative.\nLi Qiang, referring to the Pak-China ties, termed them as of ‘special relationship and friendship’ and said that this all-weather strategic partnership was further deepening.\n“The unique and unbreakable time-tested ironclad friendship stood the global changing landscape,” he added\nHe reiterated to work hand in hand with the Pakistani friends to accelerate the mutual economic development in the future.\nMinister for Planning and Development Ahsan Iqbal, expressed his deepest gratitude to the Chinese premier for his inspiring input and dedication.\nHe said the completion of state-of-the-art Gwadar International Airport underscored the strength of their bilateral ties, adding the airport was not only a symbol of economic prosperity but would also pave way for the regional connectivity.",
  "retrievedAt": "2025-08-10T20:03:31.954Z"
}
