{
  "title": "Two-day SCO CHG summit kicks off Tuesday as delegates start arriving",
  "link": "https://www.app.com.pk/national/two-day-sco-chg-summit-kicks-off-tuesday-as-delegates-start-arriving/",
  "date_published": "2024-10-14T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): The twenty-third meeting of the Council of the Heads of Government (CHG) of the member states of the Shanghai Cooperation Organization (SCO) is set to begin on Tuesday, bringing together regional leaders to discuss enhancing collaboration with a focus on trade, economy, and cultural linkages.\nThe delegates from the countries participating in the annual gathering of SCO leaders have already started landing in the federal capital which has got a facelift with colorful lights, floral decorations, SCO countries’ flags and banners to welcome the dignitaries.\nThe LED display screens have been installed on the main intersections – also beautifully painted with lights and murals. The landmarks across the city have been adorned with colorful lights and Pakistani flags, also creating a rare photo-op for the citizens and fodder for social media timelines.\nPremier of the State Council of China Li Qiang, along with a high-level delegation, has already landed in the federal capital to attend the moot and hold meetings with Pakistan’s civil and military leadership.\nThe two-day meeting of SCO CHG, the second highest forum within the SCO, will be chaired by Prime Minister Shehbaz Sharif as the current chair of the Council.\nPakistan had assumed the rotating chair of the SCO CHG for 2023-24 at the previous meeting held in Bishkek on October 26, 2023 where the country was represented by that time Foreign Minister Jalil Abbas Jilani.\nThe leaders from the SCO member states attending the summit include China’s Premier of the State Council Li Qiang, Prime Minister of Belarus Roman Golovchenko, Prime Minister of Kazakhstan Olzhas Bektenov, Russian Prime Minister Mikhail Mishustin, Tajik Prime Minister Kohir Rasulzoda, Uzbek Prime Minister Abdulla Aripov, Kyrgyzstan’s Chairman of Ministers’ Cabinet Zhaparov Akylbek, Iran’s First Vice President Mohammad Reza Aref, and Indian External Affairs Minister Subrahmanyam Jaishankar.\nBesides, Mongolia is participating in the summit as an Observer State being represented by Prime Minister Oyun-Erdene Luvsannamsrai and Turkmenistan as Special Guest represented by Deputy Chairman of the Cabinet of Ministers Rashid Meredov.\nAmong other dignitaries attending the moot include SCO Secretary-General Zhang Ming, Director of Executive Committee SCO Regional Anti-Terrorist Structure (RATS) Ruslan Mirzayev, Chairman of the Board of SCO Business Council Atif Ikram Shaikh and Chairman of the Council of SCO Interbank Union Marat Yelibayev.\nThe CHG meeting will discuss ongoing cooperation in the fields of economy, trade, environment, socio-cultural linkages and review the performance of the Organization. The leaders will adopt important organizational decisions to further enhance cooperation among SCO member States and approve the budget of the Organization.",
  "retrievedAt": "2025-08-10T20:03:57.973Z"
}
