{
  "title": "Growing cases of Covid-19 – Govt shuts down educational institutions in ICT, 7 cities of Punjab from March 15",
  "link": "https://www.app.com.pk/national/government-announces-closure-of-educational-institutions-in-ict-7-cities-of-punjab-from-march-15/",
  "date_published": "2021-03-10T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): The Federal Government on Wednesday announced the closure of educational institutions of all grades in specific cities of Punjab and Islamabad Capital Territory (ICT), keeping in view the rising trend in COVID-19 cases from past 10 days.\nMinister for Federal Education and Professional Training Shafqat Mahmood in a presser along with Special Assistant to the Prime Minister on Health Dr Faisal Sultan announced the decision.\nNumerous decisions were taken and announced in the press conference after holding a detailed consultation with the provinces and other concerned departments at National Command and Operation Centre (NCOC).\nShafqat Mahmood said that we noticed the huge impact of education sector on the epidemic as around 50 million children were at risk due to attending their classes physically.\nHe said that it is good news that the situation in the Sindh and Balochistan was favorable and the classes with 50 percent strength would continue in these provinces. Azad Jammu and Kashmir (AJK) & Khyber Pakhtunkhwa (KP) witnessed increase in pandemic trend, therefore 50 percent students will also attend classes physically in these areas.\nHe said the major cities of Punjab including Faisalabad, Gujranwala, Lahore, Gujrat, Multan, Sialkot and Rawalpindi along with the Islamabad Capital Territory witnessed rising trend in corona cases due to which the schools in these cities will go on spring break for two weeks from Monday 15-28 March. However, the other districts in the province would observe classes with 50 percent strength under Covid SOPs including wearing of masks, washing of hands and social distancing.\nHe said that it is expected that the decision of physically classes with 50 percent students will also be applied in Muzaffarabad, and Peshawar as well.\nThe minister clarified that send-ups in schools will continue and the restriction imposed today, doesn’t apply on continued exams at all level.\nWe have agreed that the metric and intermediate level exams will be taken in June this year and further decision in that regard will be made later, he added.\nHe said the today’s decisions were applicable on all schools, colleges and universities as it had been made after Higher Education Commission and provinces feedback.\nEducation Minister said that provinces are closely monitoring the situation and repeated analysis of schools will continue for two weeks.\nHe urged the educational institutions to inform the concerned department promptly if witnessed any kind of unfavorable situation due to pandemic in their institution.\nThe provincial governments’ could close their educational institutions in case of rising trend in pandemic cases, he mentioned.",
  "retrievedAt": "2025-08-11T20:27:57.585Z"
}
