{
  "title": "Bilawal, CM to attend Livestock Expo-2021",
  "link": "https://www.app.com.pk/national/bilawal-cm-to-attend-livestock-expo-2021/",
  "date_published": "2021-03-10T13:41:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Mar 10 (APP): The three-day Sindh Livestock Expo-2021 will be held at Hatri bypass on March 13 to 15, will be inaugurated by Sindh Chief Minister Syed Murad Ali Shah while PPP chairman Bilawal Bhutto Zardari will be the chief guest of concluding ceremony.\nThis was stated by provincial Minister for Livestock and Fisheries Engineer Abdul Bari Pitafi during a press conference at Hyderabad press club.\nHe said after the successful launch of the first edition of the expo last year, this would be its second edition in which thousands of rare breeds of buffaloes, cows, oxen, goats, sheep, rare species of peacocks, hens, fish, pigeons and other birds would be exhibited.\nThe minister said that the Livestock Minister of Punjab will consented to be the chief guest of the second day of the Livestock Expo.\nApart from ministers and secretaries of different government departments, diplomats, agriculturists, Agro based investors and livestock farmers would participate in the exhibition along with cattle.\nThe aim of holding second edition of the livestock expo was to provide great opportunities to stakeholders to give a boost to their businesses by using latest technology and modern methods of farming, minister said and added that expo would serve as a bridge to connect foreign missions, big businesses, farmers, progressive growers and other stakeholders of the livestock sector.\nHe said as many as 40 breeds of goats, 12 breeds of buffaloes and cows will be presented at the second edition of the expo which will attract a large number of people belonging to livestock and agriculture sector.\nThe second edition of the livestock expo is being organized by Sindh Livestock department in collaboration with departments of information, tourism, culture, agriculture and sports and youth affairs.\nThis expo would highlight issues of livestock which was one of the major sectors of the national economy but unfortunately ignored, Minister said.\nHe said major investors, diplomats and the organizations working for the uplift of livestock, agriculture, poultry and other sectors had been invited to attend the expo for exhibiting livestock potential of Sindh.\nHe said the Sindh government has signed a memorandum of understanding with the province of Punjab for vaccination of livestock before crossing the border of the provinces, adding that Sindh was also working with the Arid Zone University, Rawalpindi, on different breeds of livestock.\nHe said Sindh Agriculture University’s vice chancellor, faculty members, experts and students had been invited to visit the expo and inspect exhibition while experts would also educate livestock farmers regarding treatment and nutrition of their livestock animals.\nIn order to facilitate media persons, a separate place would be designated for them for covering expo activities, he said while replying to a question.\nHe said different government departments including Livestock and Fisheries, Agriculture, Animal Husbandry, culture, tourism, and others would set up several stalls in the expo for exhibition of their products while seminars and lectures would also be arranged to educate livestock farmers for providing balanced nutrition and treatment to the livestock animals.\nAs many as 93 stalls of various departments would be set up in the expo, beside entertainment for families and animal exhibitions, the seminars on various related topics, bird show, pet show, animal parade, flower show, Malakhara, Lucky Draw, play area for children, food court would also be arranged in the Expo, he said and added that music and cultural programs would also be arranged to provide entertainment to the visitors.\nHe said this year expo was being organized on a larger scale as compared to last year and models of ponds will be made to showcase different and rare species of fish while camel and horse race competitions would also be organized.\nThe Secretary Livestock Qazi Aijaz Mahessar, Director Information Zulifiqar Ali Shaikh, HPC president Abdullah Shaikh, Secretary Iqbal Mallah and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:27:51.226Z"
}
