{
  "title": "SC directs ECP to submit record of NA-75 election",
  "link": "https://www.app.com.pk/national/sc-directs-ecp-to-submit-record-of-na-75-election/",
  "date_published": "2021-03-10T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): The Supreme Court on Wednesday directed the Election Commission of Pakistan (ECP) to submit records regarding the NA-75 Daska by-poll held on February 19.\nA three-member SC bench comprising Justice Umar Ata Bandial, Justice Sajjad Ali Shah and Justice Yahya Afridi sought record on a plea filed by Ali Asjad Malhi who contested election in NA-75 on Pakistan Tehreek-e-insaf ticket against the ECP’s order to re-election in the whole constituency.\nDuring the course of proceedings, Advocate Shahzad Shoukat counsel for the petitioner said that the Election Commission did not have the power to hold re-elections in the entire constituency.\nJustice Bandial said that the Election Commission was bound to hold transparent elections under Article 218 of the Constitution.\nThe counsel said that the Election Commission could hold re-elections in these 23 constituencies which were controversial.\nJustice Bandial asked the counsel did the other party had accepted the results of the other polling stations.\nThe counsel said that the PML-N had objected to only 23 polling stations. According to the returning officer, the results of 340 out of 360 polling stations were not objected, he added.\nHe said that the PTI did not object to re-election at 23 polling stations.\nAdvocate Salman Akram Raja counsel for the PML-N said that his client’s request for re-polling in the entire constituency was not fixed by the Supreme Court.\nJustice Sajjad Ali Shah noted that the ECP had the authority to take action without receiving a formal application, but asked on what basis the ECP authorised a re-election in the whole constituency.\nThe counsel for the petitioner said that the cases of firing were also registered.\nJustice Bandial said that a man named Zeeshan was also killed. In various cases, the Supreme Court had asked for re-polling at the affected polling stations, he added.\nThe court rejected PTI candidate’s plea to suspend ECP order. The court observed that it would review the PTI candidate’s plea seeking a stay order on the upcoming by-election scheduled for March 18 after it reviewed all records submitted to the court and the detailed order issued by the ECP on March 8.\nThe Supreme Court sought a record from the Election Commission regarding the annulment of the NA-75 election.\nThe court also directed the PML-N candidate to submit relevant records.\nLater, hearing of the case was adjourned until Tuesday.",
  "retrievedAt": "2025-08-11T20:27:54.078Z"
}
