{
  "title": "Ijaz for collective efforts to check drugs use in society",
  "link": "https://www.app.com.pk/national/ijaz-for-collective-efforts-to-check-drugs-use-in-society/",
  "date_published": "2021-03-10T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Minister for Narcotics Control Syed Ijaz Ahmed Shah on Wednesday underlined the need for collective efforts by all segments of society, to root out menace of drugs use.\nChairing a meeting to devise strategy for awareness-raising, the minister said it was a serious threat for the society but unfortunately during previous years, it had not been the top priority. “Either it is resources constraint or lack of will, this area had been the least priority of the developing nations. We have also been experiencing this trend in the past.”\n“It is slow poisoning and seriously damages our social fabric. Therefore, we need to move forward for rooting out this menace,” he told the meeting, attended by Secretary Narcotics Control Akbar Hussain Durrani, and Secretary Information Shahera Shahid.\nSenior officials from Ministries of Information and Narcotics Control besides representatives from Education, Art and Culture Departments and civil society, took part in the deliberations.\nHe informed the meeting that an estimated nine million people in the country were addicted to drugs and with introduction of new forms of drugs in the market, the figure may further go up in coming days.\n“Therefore, it is high time to take this issue very seriously and involve all stakeholders including Health and Education Departments as well as law-enforcement agencies to root out this evil.”\nThe minister also stressed to cut the supply-line besides measures for demand\nreduction of the drugs, and simultaneously focusing on the awareness raising and rehabilitation of drug addicts in the society.\nHe expressed concern on rising drugs addiction trend at some elite educational institutions and said, when the government would be conducting operation against bigwigs, other institutions must lend a hand to discourage the use of drugs. “It has to be a combined and persistent effort by every segment of society,” he added.\nHe also advised to prepare a strategy where the addicts were portrayed as victims or patients, instead of abhorring them as criminals. “We need law enforcement agencies’ action against the culprits and patience for the addicts to bring them back to mainstream, because they are already a victim of this curse.”\nSecretary Narcotics Control Akbar Hussain Durrani called upon the participants to join hands with the Narcotics Ministry for raising awareness and purging society of outlaws, poisoning the society and rehabilitation of the affected people.\nHe said at present there were only 216 beds at different hospitals in the country, specified for treatment of drug addicts. “This trend needs to be revisited with specifying space at almost every major hospital in the country.”\nThe participants were informed that 70 to 80 percent drugs were smuggled to Pakistan from Afghanistan and it had now become the most profitable business. There were 3.7% daily users of drugs and 10% occasional users among whom around 50% range between ages of 18 to 26.\nIt was also briefed that 79% people think the drug users as criminals while 21% take them as patients. During 2000 to 2015 death rate due to drugs use, recorded an increase of 60 while its usage in developing countries did increase by 16% and decreased by 10% in developed countries.\nSecretary Information and Broadcasting Shahera Shahid extended all out support to highlight the endeavors of the Narcotics Division as well as raising awareness through different departments of the Information Ministry.\nShe proposed to prepare weekly and monthly action plans as well as awareness raising campaigns besides putting logo on advertisements and prepare slogans for social and digital media. “We shall be fully cooperating in the implementation of any strategy, prepared for awareness raising.”\nDuring the course of discussion, the participants stressed for the revival of strong family and social bonds, with parents focusing more on their children. Afterward, it was responsibility of the clerics and the teachers to educate younger generation about harmful effects of drugs usage.\nThe participants also recommended to include this topic in curriculum, make it part of social media campaigns, drama serials, awareness messages.",
  "retrievedAt": "2025-08-11T20:27:51.946Z"
}
