{
  "title": "Universities asked to utilize public funds stringently",
  "link": "https://www.app.com.pk/national/universities-asked-to-utilize-public-funds-stringently/",
  "date_published": "2021-03-10T11:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 10 (APP): The Public Accounts Committee (PAC) of Khyber Pakhtunkhwa Assembly Wednesday asked the public sector universities to take concrete measures for preventing waste of public funds by tackling their financial matters prudently.\nIt further directed the universities to follow rules, regulations and estacode in service and management matters and ensure immediate recovery of misappropriated public funds from the officials responsible.\nThe committee observed that educational institutions were sacred centers of learning, producing future builders of the nation and hence there should be high standards of financial and management discipline to be an example for all.\nThe observation was made during a meeting of the PAC on disposal of audit paras on certain fiscal anomalies in Abdul Wali Khan University (AWKUM).\nThe meeting was chaired by MPA Muhammad Idrees at KP Assembly Secretariat Peshawar.\nMPAs Inayatullah, Babar Saleem Swati, senior officials of Higher Education, Law, Finance, Accounts & Audit departments and KP Assembly attended the meeting.\nThe University head in reply to certain Audit Paras told the meeting that a big chunk of losses had been so far recovered from the responsible individuals.\nThe committee expressed satisfaction in the process of recovery.However, it referred cases of certain fiscal irregularities to the concerned sub committees for further investigation and clarification.\nA special subcommittee comprising expert officers from Accountant General and Advocate General offices, Power and Energy, Planning and Development, Finance, Law, Higher Education, Communication and Works department were constituted to probe audit para on recovery of losses on unauthorized and wasteful expenditure on construction of power house with cost of Rs305.604 million.\nHowever, the committee asked for expediting process of recoveries in respect of damages caused to public funds in AWKUM including loss due to delay from defaulter.\nPhD scholars (Rs26.702m), non deduction of income tax from suppliers (Rs 31.277m) and allowing higher rates to the contractors (4.736million).",
  "retrievedAt": "2025-08-11T20:27:57.404Z"
}
