{
  "title": "Court records statements of two witnesses in money laundering case against Shehbaz family",
  "link": "https://www.app.com.pk/national/court-records-statements-of-two-witnesses-in-money-laundering-case-against-shehbaz-family/",
  "date_published": "2021-03-10T12:31:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 10 (APP): An accountability court on Wednesday recorded statements of two prosecution witnesses in a money laundering case against Shehbaz Sharif family till March 18.\nAccountability Court Judge Syed Jawadul Hassan conducted the case proceedings. The jail authorities produced Opposition Leader in National Assembly Shehbaz Sharif before the court, whereas, his son Hamza Shehbaz, also appeared.\nShehbaz Sharif stated before the court that he could not appear due to back pain at the last hearing. Shehbaz stated that he was taken to Islamabad through motorway for casting vote in Senate elections, due to which he was enduring back pain. He submitted that he had sought permission from Election Commission for casting vote in Lahore but the same was not granted. He submitted that he served the nation and saved billions of\nrupees.\nHowever, the court noted he could inform about such matters at the time of recording of his statement. Subsequently, the court adjourned further proceedings till March 18 after recording statements of two prosecution witnesses.\nThe court also reserved verdict on a reply filed by deputy superintendent jail to the show cause notice issued by the court over failure to produce Shehbaz Sharif on the last hearing.\nThe NAB had nominated 16 people as accused in the case. However, only 10, out of 16, were indicted yet. Besides, Shehbaz Sharif, Hamza Shehbaz, Javeria Ali, Fazl Dad Abbasi, Rashid Karamat, Muhammad Usman, Masroor Anwar, Nisar Ahmad, Shoaib Qamar, and Qasim Qayyum had been indicted in the case.\nHowever, Salman Shehbaz, Nusrat Shehbaz, Rabia Imran, Syed Muhammad Tahir Naqvi, Haroon Yousaf Zai and another could not be indicted due to their absence.\nIn a reference, comprising 55 volumes, the bureau had alleged that Shehbaz Sharif family committed massive money laundering of Rs 7 billion. Yasir Mushtaq, Mushtaq Ahmad, Shahid Rafique and Aftab were made approvers in the reference.",
  "retrievedAt": "2025-08-11T20:27:54.765Z"
}
