{
  "title": "KP CM directs preparation of plan to attract mineral sector investment",
  "link": "https://www.app.com.pk/national/kp-cm-directs-preparation-of-plan-to-attract-mineral-sector-investment/",
  "date_published": "2021-03-10T14:28:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 10 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan Wednesday directed the Mines and Mineral Department for preparing a comprehensive plan to attract maximum private investment in the sector of merged districts and ensure optimum utilization of mineral resources available in these areas.\nHe issued these directives while chairing a meeting of the Provincial Task Force held here at Chief Minister’s Secretariat.\nBeside, Provincial Minister Akbar Ayub and Special Assistant to KP CM on Information, Kamran Bangash, the meeting was attended by Corps Commander Peshawar, Lt. Gen. Nauman Mahmood, Chief Secretary Dr. Kazim Niaz, Inspector General Police, Dr. Sanaullah Abbasi, Inspector General Frontier Corps North, Maj. General Adil Yamin Additional Chief Secretary Shakeel Qadir, administrative secretaries of concerned departments and other civil and military authorities.\nThe meeting reviewed overall security situation, progress on developmental schemes, matters related to administration, good governance and merger in the Newly Merged District Mohmand.\nThe meeting was given detailed sector wise briefings by the concerned quarters and it was informed that the Newly Merged District Mohmand had an overall developmental portfolio worth Rs 45 billion and work is in progress on a number of developmental projects adding that developmental schemes worth Rs 21 billion have been reflected in the Accelerated Implementation Plan (AIP) and schemes worth Rs 19 billion have been reflected in the provincial Annual Development Program (ADP) for district Muhammad.\nThe forum was further informed that Education, Health, Communication, Agriculture, Drinking Water Supply and other social sectors had been given top priority in the development portfolio of district Mohmand as the case with other merged districts.\nThe forum was further informed that under the supervision of Pakistan Army five projects of permanent reconstruction had been completed in districts Mohmand which include Ghalanai- Mamad Ghat Road, Jhanda-Dhab Road, Cadet College Mamad Ghat, Muhammad Model School and Tehsil Headquarter Hospital Mamad Ghat. Similarly, 86 various schemes of immediate rehabilitation have also been completed in Mohmand under the supervision of the armed forces.\nTalking on the occasion, the Chief Minister also directed the concerned high ups to strengthen the Mines and Mineral Development Department in district Mohmand and to establish the district set up of its Mines’ Inspectorate and Commissionerate in the district with the aim to streamline matters related to marble industry there.\nHe further directed the high ups of Mines and Communication Departments to work out a project for the construction of a dedicated access road from the Mohmand Marble City to Northern Bypass in Peshawar in order to facilitate the transportation of refined marble from Muhammad to other parts of the province.\nThe Chief Minister also directed the authorities concerned for necessary steps to ensure the availability of all missing facilities in the healthcare facilities and educational institutions of district Mohmand by the end of the current financial year and to ensure the commencement of classes from the upcoming educational session in all the newly completed education institutions in Muhammad as well as other merged districts.\nBriefing about the progress made so far on ADP Projects in District Mohmand, the authorities told that Rs 1554 million had been spent on the various developmental activities in newly established Mohmand Industrial Estate (Marble City).\nThey informed that project on completion would create more than 18000 employment opportunities. It was further informed that efforts were underway to ensure processing of marble and other precious stones at local level and a joint venture of companies was under consideration for the purpose.\nBriefing about the extension of police to district Mohmand, the forum was informed that additional four police stations had been set up and operationalized in the district whereas 2672 Levies and Khassadar out of total 2872 have been absorbed into police and absorption of leftover Khassadar was in progress.\nSimilarly, 450 Levies and Khassadar have been imparted police training so far. The authorities informed that after the merger, performance of police in district Mohmand has significantly increased adding that during the last year, a total of 396 FIRs were logged against different crimes whereas 950 arrests have been made.\nThe chief minister directed the authorities concerned to immediately start physical work on the approved road sector projects in district Mohmand further directing all the provincial departments to ensure cent percent utilization of funds released for the developmental projects of newly merged areas.",
  "retrievedAt": "2025-08-11T20:27:48.700Z"
}
