{
  "title": "Japan prioritized human safety, livelihood in aftermath of 2011 quake: Ambassador Kuninori",
  "link": "https://www.app.com.pk/national/japan-prioritized-human-safety-livelihood-in-aftermath-of-2011-quake-ambassador-kuninori/",
  "date_published": "2021-03-10T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): The Ambassador of Japan to Pakistan, Kuninori Matsuda on Wednesday said the Japanese government had prioritized the economic and industrial revival of areas hit from ‘Great East Japan Earthquake’ occurred on March 11, 2011 to ensure human safety and provide livelihood to affected people.\nAfter the huge disaster in ‘Great East Japan Earthquake’, rescue, rehabilitation, reconstruction and revitalization were the biggest challenges which were overcome by the joint efforts of Japanese central and city government, local community and especially the commitment shown by expatriate Pakistanis living in Japan’s affected areas, Matsuda told APP here.\nThe envoy said in Japan, the government was always prepared for disaster and had adopted the preemptive measure to meet any untoward incident, however this time, “We face three different types of catastrophes which are beyond our imagination. But the government’s teamwork, unity and determination helped to revive the socioeconomic life of earthquake and tsunami hit areas of Japan.”\nHe admired the volunteers especially hailing from the Pakistani community in rescue, reconstruction and rehabilitation works in the areas affected by the earthquake and Tsunami including Kamaishi city, coasts of Iwate prefecture, Ibaraki, Chiba and south of Miyagi.\nHe said Japan experienced the strongest earthquake in its recorded history recently as it struck below the North Pacific Ocean, 130 kilometers east of Sendai, the largest city in the Tohoku region, a northern part of the island of Honshu.\nThe ambassador said the disaster education was part of the curriculum in local education institutions including school, colleges and universities to aware the future generation for adopting the preemptive measure to minimize the loss against the calamities.\nHe said preemptive measures through education, utilization of modern technology, political will, sense of responsibility, teamwork and unity were the major measures adopted by the Japanese nation to revive from the ‘Great East Japan Earthquake’.\nReplying to a question on cooperation and coordination between the Japanese and Pakistan’s disaster management institutions, he said, “We are in close coordination with National Disaster Management Authority (NDMA) to enhance the cooperation and information sharing in future to minimize the loss in natural disasters.”\nHe said Japan had introduced reforms in the education sector in 1970 and now our education system was producing the modern innovative technology driven generation, who could adequately work in any sort of situation for economic, social and cultural growth of the country.\nThe Japanese envoy said the two countries are committed to extend cooperation in every sector of the economy to boost trade and investment relations between the two countries.\nMeanwhile, addressing a webinar on the 10-year completion of ‘Great East Japan Earthquake’ organized by the Japanese embassy here in Islamabad, Ambassador of Pakistan to Japan, Imtiaz Ahmad said Japanese were committed nationals, who faced and amicably done the rescue, rehabilitation and managed the twin disasters of ‘Great East Japan Earthquake’ through their commitment, dynamism, zeal, unity and tendency of teamwork.\nSharing his experience about the ‘Great East Japan Earthquake’, he said, “I was deputy ambassador in Japan during this huge disaster and witnessed how Pakistani community in Japan played an exemplary role in rescue and provided food to the people in affected areas.”\nHe said this exceptional voluntary work and welfare activities enhanced the image of Pakistan not only in Japan but all over the world, when the Japanese government and people admired their support in this critical situation.\nHe said Pakistan embassy fully supported the volunteers to carry on the relief activities at that crucial time. “We established a helpline for Pakistani lived in Tsunami hit areas,” he added.\nHe said few Pakistani students and workers were in the affected areas and the Pakistani embassy provided every support to them as it provided relief goods to the local community.\nReplying to a question, he said the Japanese government had executed the 10-year plan and revived from this huge disaster within one decade, which was a remarkable joint efforts by the Japanese government and community.\n“We can learn from Japan for preemptive measures, rescue and rehabilitation in this kind of situation to minimize the loss of human life and material lost” he said.\nWhile in discussion, Mayor of major areas earthquake hit Kamaishi city, Iwate Takenori Noda said the rehabilitation and reconstruction work after the ‘Great East Japan Earthquake’ was almost 97 percent completed and few works of infrastructure to be completed by next few months.\nHe said the huge catastrophe of the earthquake and Tsunami’s destruction were not a challenge for us but it was an opportunity for reemergence from crucial situations with national unity, teamwork and commitment.\nHe said the national government and local governments in the affected areas continued to work together during the last ten years for the reconstruction and revitalization\nSharing his experience about the huge disaster, the Pakistani community volunteer Mian Ramazan, said after a day, “We reached the Tsunami hit area of Kamaishi city and provided food to the local people.”\nHe said during this critical situation, “I learnt that Japanese are a more disciplined nation of the world.”\nAnother volunteer Anees Ahmed said he was religiously motivated to help people without discrimination of creed, color and race.",
  "retrievedAt": "2025-08-11T20:27:52.219Z"
}
