{
  "title": "KP Govt introduces smart school system: Shahram",
  "link": "https://www.app.com.pk/national/kp-govt-introduces-smart-school-system-shahram/",
  "date_published": "2021-03-10T12:26:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 10 (APP): Khyber Pakhtunkhwa Minister for Elementary and Secondary Education Shahram Khan Taraqai Wednesday said the provincial government was introducing smart school systems to provide IT skills to women folk so that they can get decent jobs at home.\nTalking to a delegation of UNICEF and UNDP led by Canadian High Commissioner Wendy Gilmore here at his office, he said education is the top priority of the government and huge amount has been allocated for education sector.\nIn order to encourage girls’ education and reduce dropout ratio, he said the government is giving monthly stipend to female students, adding that about 70 percent of all new schools in the province are reserved for women.\nThe minister said that UNDP and UNICEF are doing a great job and Pakistan values their support and cooperation by all donors as well.\nDuring the meeting, the two sides discussed in detail the projects launched for the provision of quality education in the merged districts, initiatives taken for the education of girls and ongoing projects with donors on a participatory basis and future strategy.\nShahram told the delegation that KP government was paying special attention to quality education in the merged districts and especially to the education of girls.\nHe said the government has recruited about 80,000 teachers in eight years to meet the shortage of teachers, adding that various scholarships are also being given to provide higher education opportunities to girls and boys.\nAppreciating the excellent initiatives of the KP, the Canadian High Commissioner said that reforms are being made for both public and private institutions here. Regarding the education of girls, he said targets of development, peace, awareness and a better prosperous society can only be achieved through promotion of female education.\nThe High Commissioner took interest in initiating projects in the field of education with the government and said that all the donors are focusing on education improvement in the entire province and especially in the merged districts.\nOn the occasion, the forum was informed that 100 dilapidated schools are being renovated and reconstructed in Orakzai and Kurram districts in collaboration with Education Department and UNDP.\nThe government was also imparting training to teachers besides setting up of 100 new Early Childhood Education centers where more than 2000 children would be educated while upon completion of this project by December 2022, about 14,000 children would have access to higher education.\nLater, the delegation also visited various government schools. The members of delegation included UNICEF Deputy Country Representative, UNDP Program Manager, Head of Cooperation and Secretary Elementary and Secondary Education KP Nadeem Aslam Chaudhry.",
  "retrievedAt": "2025-08-11T20:27:54.783Z"
}
