{
  "title": "KP establishes four RFCs to materialize PM’s Naya Pakistan Housing Project",
  "link": "https://www.app.com.pk/national/kp-establishes-four-rfcs-to-materialize-pms-naya-pakistan-housing-project/",
  "date_published": "2021-03-10T11:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 10 (APP): Provincial Housing Minister, Dr. Amjad Ali Wednesday said that Khyber Pakhtunkhwa government was materializing the vision of Prime Minister Imran Khan of providing affordable housing facilities to the people and to achieve the objective, the KP Housing Department had specified four divisions to establish Regional Facilitation Centers (RFZs) to implement the project in letter and spirit.\nThe main purpose of setting up Divisional Facilitation Centers at Peshawar, Abbottabad, Kohat and Swat was to resolve the problems of the people in their respective divisional headquarters on an urgent basis so that they would not have to go to Peshawar.\nHe expressed these views while addressing a function held at the Regional Facilitation Center, Abbottabad on Wednesday on the occasion of handing over 70 allotment letters to Hazara Division Residential and Provincial Housing Authority customers.\nDirector General Khyber Pakhtunkhwa Housing Authority Nadir Khan Rana, Director Housing Shahzada Behram, officials concerned of the Housing Authority besides those who received allotment letters were also present on the occasion.\nDr. Majid Ali said that the people of Hazara Division had been issued allotment letters who had submitted their applications in Hangu Township through a transparent draw. He further said that customers from other divisions of Khyber Pakhtunkhwa including Peshawar and Swat were also being provided allotment letters from the facilitation centers.\nEstablishment of regional facilitation centers would prove a milestone achievement for the Provincial Housing Authority with regard to Prime Minister’s Housing Scheme.\nEstablishment of these facilitation centers, he said would also help speeding up the PHA affairs and timely progress of the projects.\nAt these facilitation centers, he said plot owners could easily deal with matters relating to finance, bank, home financing, transfer and cancellation of the plots.\nDr Amjad said we introduced tangible reforms in provincial departments that depicted the people friendly policies of the government. Our departments, he said, were making the services delivery easier and timely to facilitate the general public. Owing to our public friendly policies, he said investors were now taking extra interest in investing in the province.",
  "retrievedAt": "2025-08-11T20:27:55.877Z"
}
