{
  "title": "Japan marking 9th Great East Japan Earthquake anniversary on Wednesday",
  "link": "https://www.app.com.pk/national/japan-marking-9th-great-east-japan-earthquake-anniversary-on-wednesday/",
  "date_published": "2020-03-10T01:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP):Japan is marking the 9th anniversary of the Great East Japan Earthquake on Wednesday, March 11, which devastated the north-eastern coast of the country in 2011, killing and rendering tens of thousands of people homeless.\nAmbassador of Japan to Pakistan MATSUDA Kuninori, on this commemoration day, has expressed his heartfelt gratitude and thanks to the government and the people of Pakistan for their generous support to the Japanese people during that difficult time after they were badly struck by the devastating earthquake and tsunami, said a press release on Tuesday.\nIt is pertinent to mention here that soon after the earthquake and tsunami, a group of Japan-based Pakistani volunteers had immediately reached to the affected areas and carried out rescue and relief activities besides providing food to the affected people.\nPaying tributes to the victims of the Great East Japan Earthquake, the ambassador has said the support extended by the people of Pakistan at that difficult time is still fresh in the hearts and minds of the people of Japan.\n“The bonds of friendship between Japan and Pakistan always gets vigor and strength from the fact that the two countries have always stood by each other in the hours of need and difficulty. We deeply appreciate the government and the people of Pakistan for their generous and unwavering support” said Ambassador MATSUDA.\nThe ambassador further has said the government of Japan has always stood by Pakistan no matter it is a natural disaster or economic development of the country.\nHe added that after the outbreak of coronavirus, the government of Japan has recently provided coronavirus detection kits to Pakistan for better diagnosis of the deadly virus and is also working on to provide assistance to combat the locusts swarm.",
  "retrievedAt": "2025-08-11T18:55:52.287Z"
}
