{
  "title": "ARU made successful investigations in one and half year: Shazad Akbar",
  "link": "https://www.app.com.pk/national/aru-made-successful-investigations-in-one-and-half-year-shazad-akbar/",
  "date_published": "2020-03-10T01:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP):Special Assistant to the Prime Minister on Accountability and Interior Mirza Shahzad Akbar has said Asset Recovery Unit (ARU) had established as per rules and regulations on the approval of the federal cabinet and made successful investigations during the one and half year.\nTalking to a private news channel, he said National Accountability Bureau (NAB) and Federal Investigation Agency (FIA) were taking action and made recovery on the investigation of ARU.\nHe said according to term of references (ToRs) of ARU, it was just pointed out the assets but not responsible for the recovery.\nShahzad Akbar said Nawaz Sharif went to abroad with the permission of the court and now he was on the visit visa in London, adding the government had written a letter to England government for his repatriation.\nHe said as per doctors’ reports, the government considered that Nawaz Sharif was ill and his condition was not stable but he did not get admitted in any hospital to get treatment there till date.\nReplying to a question, he said those were involved in sugar and wheat crises they must face the music and their names would be published.\nHe said all political parties should work together and support the government for removing menace of corruption from all over the country.\nTo another query, he said consultation with opposition regarding amending in the NAB laws was underway but it wanted to make the institute as toothless and remove the cases against their leadership.\nThe special assistant said missing persons was a serious matter and Prime Minister Imran Khan was focused on it and the cases were sub judice in Balochistan High Court in that regard.",
  "retrievedAt": "2025-08-11T18:56:06.375Z"
}
