{
  "title": "NAVTTC sets up institutional accreditation process to ensure quality in TVET",
  "link": "https://www.app.com.pk/national/navttc-sets-up-institutional-accreditation-process-to-ensure-quality-in-tvet/",
  "date_published": "2020-03-10T03:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP):National Vocational and Technical Training Commission (NAVTTC) is setting up an Internationally Acceptable Accreditation System to ensure growth and quality in TVET sector of Pakistan.\nPrime Minister’s Special Assistant on Youth Affairs, Usman Dar appreciated the steps taken by NAVTTC for improving the quality of TVET institutes of the country, a press release Tuesday said.\n“Accreditation process would be helpful in identifying the best TVET institutes across the country where quality training would be imparted to our youth at par with international standards”, he added.\nAddressing the 15th meeting of NAVTTC – TVET Accreditation & Quality Evaluation Committee (TA&QEC) held at NAVTTC HQs here Tuesday, he urged that the selection of TVET institutes should be transparent and based on merit.\nUsman Dar said the government’s prime objective was to equip youth with modern technological skills and help them become productive citizens of the country.\nExecutive Director, National Vocational & Technical Training Commission (NAVTTC) Dr. Nasir Khan has stressed upon the need to expedite the process of accreditation of TVET Institutes in the country to bring quality culture in TVET Sector of Pakistan so that the employability of our youth as per National and International Industry’s requirements can be ensured.\nOver the past few years, NAVTTC has evolved procedures and criteria for assessment of quality of TVET institutes against appropriate benchmarks.\nTVET Accreditation & Quality Evaluation Committee (TA&QEC) aims to facilitate national and international comparability and recognitions of institutions, programmes and degrees as laid down in National Vocational Qualification Framework.\nThe Committee will review reports of around 100 TVET institutes from all over the country to grant accreditation.\n“I hope this exercise, in the longer run, will help the students, parents, and employers in making a judicious choice among competing TVET institutions and their programs on the basis of quality assurance”, Dr. Khan said.\nMian Waqas Masud from Islamabad Chambers of Commerce & Industry chaired the meeting. He appreciated work done for accreditation of institutes in a very short time by the NAVTTC team and said that it will create public trust in institutions for imparting quality training and will enhance workforce mobility and employability in the country.\nDirector General (AC&C) NAVTTC, Mr. Muqeem-ul-Islam said that “NAVTTC aims to enhance the quality of TVET institutes, their capability to deliver TVET programmes and to support TVET institutes to set up their own internal quality assurance processes to sustain quality development”.\nThe Members from Federation of Pakistan Chamber of Commerce and Industry (FPCCI), National Skill University, TEVTA Punjab, TEVTA AJK, TEVTA KPK, TTB Baluchistan, representatives from Sindh, Pakistan Engineering Council (PEC), Higher Education Commission (HEC), National Institute of Science and Technical Education (NISTE), GIZ, officers of NAVTTC and representatives of TVET Reform Support Program (TRSP) are attending the 3-day long meeting which will evaluate accreditation assessment reports of institutes from all over the country.",
  "retrievedAt": "2025-08-11T18:56:03.017Z"
}
