{
  "title": "CPEC , a strategic alliance between two nations: AJK PM",
  "link": "https://www.app.com.pk/national/cpec-a-strategic-alliance-between-two-nations-ajk-pm/",
  "date_published": "2020-03-10T01:36:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 10 (APP):Azad Jammu and Kashmir (AJK) Prime Minister Raja Farooq Haider Khan Tuesday said China Pakistan Economic Corridor (CPEC) was not just a road or development project but a strategic alliance between two nations.\nHe was addressing as a chief guest on the launching ceremony of report titled “CPEC in Azad Kashmir” produced by Center for Peace Development under the auspicious of Institute of Strategic Studies in the federal metropolis, said an official handout issued here.\nThe prime minister said that AJK’s inclusion in the CPEC would bring economic revolution in the state.\n“China is Pakistan’s sincere and time tested friend that always came-forward and supported us at every stage”, he added.\nHe said education and infrastructure were basic elements which significantly contribute for the sustainable development.\n“We reformed these sectors and aiming to turn the liberated state into a tourist center for all four seasons”, he said.\nRaja Farooq Haider said Neelum Jehlum and Mangla upraising projects were completed without delay.\n“Work on Kohalla Power Project will also start soon”, Haider informed.\n“It is my responsibility to help strong the ideological bond between the people of Kashmir and Pakistan. Kashmiris will prefer to die but will never cheat Pakistan. Love for Pakistan is part of our faith”, he added.\nReferring to the Kashmir issue, the prime minister said that Kashmir was not the territorial dispute between India and Pakistan but a matter of the right to self determination of the Kashmiri people.\n“Those who are burying their loved ones in Pakistani flag in Kashmir are looking toward Pakistan. We need to take practical steps on the longstanding dispute”, he asserted.\nInviting the attention of the audience towards the development and reform agenda of the present government, the prime minister said that basic infrastructure of the state had been up-graded.\nHe said an effective financial discipline had been maintained which resulted into the surplus administrative budget.\nEarlier, Additional Chief Secretary (Development) Dr. Syed Asif Hussain Shah briefed the participants about the progress on CPEC projects in Azad Kashmir.\nAmbassador Khalid Mehmood, Aizaz Ahmed Chaudhary, Zulifqar Abbasi, Talat Shabbir and others also addressed the ceremony.",
  "retrievedAt": "2025-08-11T18:56:09.843Z"
}
