{
  "article_id": "2025-10-05_e9280b855e10dbed1b55a27b7c2c384d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/seminar-on-practice-based-research-held-at-rims/",
    "retrieved_at": "2025-10-11T23:51:35.104Z"
  },
  "metadata": {
    "title": "Seminar on Practice-Based Research Held at RIMS",
    "author": null,
    "date_published": "2025-10-05T14:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 186,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 05 (APP): The Riphah Institute of Media Sciences (RIMS) organized a seminar on \"Practice-Based Research in Creative Arts and Communication\", featuring Dr. Suriyya Choudhary, Chairperson of the Department of Fine Arts, Fatima Jinnah Women University, as the keynote speaker. Addressing faculty and students, Dr. Suriyya discussed the growing significance of practice-based research in bridging creative exploration with academic rigor, said a press release. She offered deep insights into critical theory, visual methodologies, and the postcolonial gaze, emphasizing their role in advancing scholarly and artistic inquiry in Pakistan's higher education landscape. Speaking on the occasion, Prof. Dr. Riaz Adil, Chairman, Riphah Institute of Media Sciences, said that the seminar aimed to strengthen interdisciplinary learning and encourage research-driven creativity among students of media and communication. He appreciated Dr. Suriyya's contribution, terming it \"an inspiring intellectual engagement\" that would enrich both faculty and students. The session concluded with an engaging discussion, where participants reflected on the intersection of artistic inquiry and theoretical frameworks in fostering innovation within media education. The event reaffirmed RIMS's commitment to promoting academic excellence, creative leadership, and research culture in Pakistan's media sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}