{
  "article_id": "2025-10-05_278b78c049c1ae440b5a7d95f881844f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rana-mashhood-congratulates-newly-elected-pra-leadership/",
    "retrieved_at": "2025-10-11T23:50:55.896Z"
  },
  "metadata": {
    "title": "Rana Mashhood congratulates newly elected PRA leadership",
    "author": null,
    "date_published": "2025-10-05T18:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 05 (APP):Chairman Prime Ministeras Youth Programme, Rana Mashhood Ahmad Khan, has extended warm congratulations to the newly elected leadership of the Parliamentary Reporters Association (PRA), recognizing their pivotal role in strengthening democratic values, promoting transparency, and upholding journalistic ethics within Pakistanas parliamentary system. In his congratulatory message, Rana Mashhood lauded the association as a bridge between the parliament and the public, ensuring that legislative proceedings and national issues are conveyed with accuracy and responsibility. He extended special congratulations to President M.B. Soomro, Secretary Naveed Akbar, Vice President Usman Kakar, Finance Secretary Shakir Abbasi, Information Secretary Javed Hussain, and other newly elected office-bearers, expressing confidence that their leadership will bring new energy and commitment to the association. aThe Parliamentary Reporters Association serves as a guardian of both parliamentary decorum and journalistic values,a Rana Mashhood said, adding that aparliamentary reporters are the backbone of democratic traditions, and their fair, factual reporting helps strengthen the connection between the government, lawmakers, and the people.a He emphasized that credible journalism plays a crucial role in shaping public opinion and ensuring accountability within democratic institutions. aAt a time when the media landscape is evolving rapidly, the responsibility of parliamentary reporters has increased manifold a to report with integrity, impartiality, and a deep sense of national duty,a he added. Rana Mashhood expressed hope that the new PRA leadership will continue to safeguard the sanctity and dignity of parliament, promote constructive journalism, and uphold professional standards that reflect the true spirit of democracy. The Chairman also conveyed his best wishes to the new office-bearers for a successful tenure, reaffirming that the government values the contribution of the journalistic community in building a transparent, informed, and democratic Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}