{
  "article_id": "2025-10-05_0d153bf709c994ee9217432bf69597b3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/a-soulful-tribute-pnca-celebrates-the-legacy-of-maestro-master-ghulam-haider/",
    "retrieved_at": "2025-10-11T23:51:36.837Z"
  },
  "metadata": {
    "title": "A soulful tribute: PNCA celebrates the legacy of maestro Master Ghulam Haider",
    "author": null,
    "date_published": "2025-10-05T13:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 437,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 05 (APP): The Pakistan National Council of the Arts (PNCA) reverberated with nostalgia, melody, and emotion as its Performing Arts Division hosted a mesmerizing musical evening to honor the legendary composer Master Ghulam Haider, a man whose genius transformed the very soundscape of South Asian cinema. The event, held at the PNCA late Saturday, was attended by a vibrant mix of artists, music connoisseurs, students, and cultural enthusiasts, all united by their admiration for a man often hailed as the father of film music in the subcontinent. The evening was not merely a concert; it was a journey through time, revisiting the melodies that once defined an era of grace, romance, and artistic brilliance. Master Ghulam Haider, celebrated for fusing classical ragas with modern orchestral arrangements, created a new sound that bridged tradition and modernity. His compositions carried a rare emotional depth-music that could make one smile, weep, or dream. Decades after his passing, his songs continue to stir hearts, proving that true art transcends time. The stage came alive with performances by Nirmal Shah, Lubna Shehnaz, Usman Raees, Bano Rahmat, Ustad Raees, and Farah Laal, who paid soulful tribute to the maestro by recreating his timeless hits. Each rendition was met with thunderous applause as the audience swayed to familiar tunes that once echoed through radios and cinema halls across the region. The singers' heartfelt delivery evoked memories of a golden age when lyrics carried poetry, and melodies carried meaning. The audience members were visibly moved. \"Listening to these songs feels like reliving the finest chapter of our musical history,\" said one attendee, her eyes glistening with emotion. Another remarked that PNCA's initiative not only honored a musical legend but also rekindled the nation's appreciation for Pakistan's rich cultural and artistic heritage. The ambiance inside the auditorium was electric yet nostalgic offering a perfect blend of reverence and celebration. Large portraits of Master Ghulam Haider adorned the stage, while gentle lighting and classical instrumentals in the background set a tone of warmth and remembrance. In his brief remarks, a PNCA representative emphasized the council's commitment to preserving and promoting Pakistan's artistic traditions, saying, \"Maestro Ghulam Haider gave our music an identity- a soul that continues to inspire. Honoring him means honoring the roots of our creative journey.\" The evening culminated in a standing ovation, as the hall resonated with the immortal strains of Haider's melodies. For many, it was not just an event but an emotional reunion with the music of their memories-roof that even decades later, the genius of Master Ghulam Haider remains timeless, his compositions still breathing life into Pakistan's cultural rhythm.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}