{
  "title": "Asad Umar urges media to foil international campaign against CPEC",
  "link": "https://www.app.com.pk/national/asad-umar-urges-media-to-foil-international-campaign-against-cpec-asad-umar/",
  "date_published": "2021-10-06T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): Minister for Planning, Development and Special Initiatives Asad Umar on Wednesday urged the media to foil the international unjustified campaign against China Pakistan Economic Corridor (CPEC) instead of becoming part of it.\nAddressing a press conference flanked by Special Assistant to Prime Minister on CPEC Khalid Mansoor here, the minister said today was the era of 5th generation hybrid warfare when the enemy was utilizing new tools to flop the opponent’s projects.\n“We are witnessing the international campaign against our national project under which false and baseless news are being disseminated to reverse the progress,” he said adding “this campaign is understandable but it is quite nonsense that our local media is also becoming part of it deliberately or unintentionally by quoting the Western media’s report against CPEC”.\nReferring to some news reports published in local media which quoted a US think tank’s report that many information with regards to CPEC were being kept secret, the minister said each and every thing about the project was kept public.\nAsad Umar said the concerned authorities were bound to tell all the required information to the parliament and the parliamentary committees besides, all information about tariff structure of the energy projects under CPEC were also available on the website of National Electric Power Regulatory Authority (NEPRA) .\nHe told that the International Monetary Fund (IMF) also asked for information about the projects under CPEC which were provided by the government of Pakistan.\nHe said the government of Pakistan gives sovereign guarantee to all the foreign funded projects and all the Independent Power Producers (IPPs) whether they were from China, US or any other country were given sovereign guarantee by the Pakistan government.\nWith respect to financing cost of CPEC energy projects, the minister informed that the average rate pf loans for the private sector projects under CPEC was around LIBOR (London Interbank Offered Rate) plus 4.25 percent while for the projects owned by the government, the average interest rate was about 2.4 percent.\n“There are many projects that are executed through the Chinese government’s grant so if we include the amount of grant, then the average interest rate turns to even less than 2%,” he added.   He said the Chinese loans were even cheaper than those executed by the other international lending agencies such as International Finance Commission (IFC), Asian Development Bank (ADB), German lending agency and other Western agencies.\nAsad Umar said the return of loan period was 20 years with a grace period of five years.  He informed that the Chinese debt was around 10 percent of Pakistan’s total loans while it was 26 percent of the external debts.\nSo the argument that the Chinese debt would create trouble for Pakistan was not correct.   “It is no doubt that Pakistan is facing debt sustainability challenges but these challenges were not related to China,” he added.\nThe minister said the conditions offered by Pakistan to install power plants were not only for China but for all countries, adding, only China responded to the conditions.   To a question the minister said, “We have already provided details with proofs that work on CPEC was done more rapidly during last three years than the previous tenures”.\nKhalid Mansoor said when work on Thar coal power project was initiated, no one other than China was ready to invest in this project. He said the mismanagement in the conditions of the projects was committed by then Pakistan government which should not be linked to China.\nTo another query, Asad Umar said Pakistan had conveyed its message to the world to develop economic relations with Afghanistan by supporting the country in its development process.\nHe said Pakistan and China had already offered other countries to take part in CPEC so Afghanistan could also become part of it.\nThe minister said the second phase of CPEC would create huge job opportunities as compared to the first phase, adding, in each industry thousands of local workers were employed.\nHe said the newly formed Joint Working Group on Information Technology would also help creating thousands of high value job opportunities for Pakistanis.",
  "retrievedAt": "2025-08-11T21:24:24.398Z"
}
