{
  "title": "Gwadar Eastbay Expressway completion likely by October end",
  "link": "https://www.app.com.pk/national/gwadar-eastbay-expressway-completion-likely-by-october-end/",
  "date_published": "2021-10-06T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP): Gwadar Eastbay Expressway the most important mega connectivity and road infrastructure project worth $168 million is likely to be completed this month.\nThe completion of the Gwadar Eastbay Expressway being constructed under China Pakistan Economic Corridor (CPEC) would trigger a major jump in the development of the Coastal City, a senior official of Gwadar Development Authority told APP on the mega project status.\nHe said the project was envisaged under the Early Harvest Scheme during the first phase of CPEC.\nThe project was part of a wider $1.1 billion development package for the city and Port of Gwadar.  While elaborating the project details, the official informed that Gwadar Eastbay Expressway was a six-lane urban motorway. “The road will connect Gwadar Port with Gwadar Free Trade Zone and Makran Coastal Highway.\nCurrently, more than 92 percent of construction work has been completed,” he added. Expressway, he said, would improve the trading potential of Gwadar Port whereas the Expressway aimed at meeting the transportation requirements of the Port.\nEconomic and Commerce Experts said that Gwadar Eastbay Expressway would prove to be a major step in utilizing the full potential of Gwadar Port for trade, especially the way it would help connect Gwadar Port with Gwadar Free Trade Zone.\nSenior Economist Dr Fazl Shah said this would increase the flow of business transactions across the Port. “Gwadar Free Trade Zone is currently in the attraction of investors across the globe.\nIn this context, the completion of Gwadar Eastbay Expressway this year will certainly turn out to be a major development,” he added.\nMoreover, the Expressway would connect Gwadar Port with other cities across the country, said Akram Sheikh, infrastructure expert at a leading real estate firm.\nHe said the significance of Gwadar Eastbay Expressway was further highlighted as it connected Gwadar Port with Makran Coastal Highway. The Makran Coastal Highway was a 653 km national highway that extended from Karachi in Sindh to Gwadar in Balochistan.\n“This will certainly pave the way for businesses across Pakistan to capitalize on the rich business potential of Gwadar. The Expressway will create a business boom in Gwadar,” he said.\nIt may be mentioned here that the completion of Gwadar Eastbay Expressway carried a lot in its lap for the Coastal City. It would not only help Gwadar Port to fully capitalize on its trading potential but would also make Gwadar a hub of investment for businesses across Pakistan.",
  "retrievedAt": "2025-08-11T21:24:11.971Z"
}
