{
  "title": "Removing taboos about breast cancer to help save women lives: President",
  "link": "https://www.app.com.pk/national/removing-taboos-about-breast-cancer-to-help-save-women-lives-president/",
  "date_published": "2021-10-06T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): President Dr Arif Alvi on Tuesday said early diagnosis of breast cancer was the only way to save the lives of 40,000 women in the country, who fell victim to the disease in a year.\nThe president said removing taboos about breast cancer through strong awareness campaigns would help the women not to shy away from seeking urgent medical help.\nAlong with his wife Samina Alvi, the president in an interactive session with journalists of print and electronic media here at the Aiwan-e-Sadr highlighted the importance of the media’s role in sensitizing the public about breast cancer.\nPresident Alvi said in a developing country like Pakistan, prevention was the best way to avoid expensive medical treatment of several diseases, including breast cancer.\nHe said it was the responsibility of the society to give more public space to women by providing them access to facilities, whether relating to education, health or a safer environment free from harassment.\nThe president urged the journalists to join the cause of fighting breast cancer by highlighting the topic in their content so as to make the people more aware.\nBegum Samina Alvi said in view of her awareness campaign on breast cancer, the media had been effectively highlighting the subject in their television programmes and newspapers.\nShe said she would be visiting colleges in different cities this month to raise awareness among girls on self-diagnosis.\nShe also urged the male members of the family to realize the suffering attached with the disease and support women to get proper medical care.\nPrime Minister’s Special Assistant on Health Dr Faisal Sultan said in view of the seriousness of breast cancer, there was a need to strengthen the capacity of relevant health facilities.\nHe mentioned that producing an increased number of oncologists and surgeons, and reducing reliance on imported medicine and technology was important in this regard.\nHe said the government would consider facilitating local production of drugs used in the expensive treatment such as molecular therapies.\nDr Muhammad Asad Pervez, oncologist and Consultant Shaukat Khanum Memorial Cancer Hospital said one in every eight women in Pakistan was diagnosed with breast cancer every year, meaning every such patient in 13 minutes.\nHe said research showed that the stage-wise survival rates of breast cancer patients in the span of five years was Stage 0 (100%), Stage 1 (98%), Stage 2 (88%), Stage 3 (52%) and Stage 4 (16%).\nHe said the safety plan comprised awareness, modifying lifestyles, early detection including self-examination and mammography, and immediate treatment.\nLater, President Alvi and Samina Alvi responded to the queries and feedback of the journalists relating to making the awareness campaign more effective.",
  "retrievedAt": "2025-08-11T21:24:16.443Z"
}
