{
  "title": "Central Punjab make two in two against Sindh",
  "link": "https://www.app.com.pk/national/central-punjab-make-two-in-two-against-sindh/",
  "date_published": "2021-10-06T18:25:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 06 (APP):A disciplined bowling performance from Home City Central Punjab followed by Hussain Talat’s breezy half-century saw their side to the top of the points table as they defeated GFS Sindh by a comfortable margin of eight wickets in the opening match of the National T20’s Lahore-leg at on Wednesday the Gaddafi Stadium.\nThis was Central Punjab’s second win over Sindh in the season after they had beaten Sarfaraz Ahmed’s side by 12 runs (DLS method) at the Pindi Cricket Stadium, Rawalpindi on last Saturday.\nCentral Punjab pacers ensured Sindh’s innings never took off as Faheem Ashraf accounted for Sharjeel Khan (0 off one) in the first over and Khurram Manzoor (two off 10), the most successful batter in the National T20 history, in his next. Sameen Gul and Wahab Riaz, the most successful bowler in the tournament’s history, accounted for a batter each in the fourth and fifth overs as Sindh managed a paltry 32 in the powerplay.\nThat Sindh bowlers had something to bowl at was because of their captain Sarfaraz who scored a fighting half-century. The wicketkeeper-batter scored an unbeaten 37-ball 54, hitting five fours and a six, and stitched partnerships worth 35 and 41 with Danish Aziz and Anwar Ali – who scored 20 runs each.\nSarfaraz smashed two fours and a six in the final over, bowled by Wahab, as Sindh finished at 128 for seven.\nCentral Punjab overhauled the target in 15.4 overs thanks to Hussain Talat’s 13th half-century. The left-handed batter made sure his side cross the line without any further hiccups after they lost two wickets for 33 runs in five overs.\nHe smashed eight fours and a six in his unbeaten 52-ball knock and stitched a solid partnership with Shoaib Malik (40 not out off 25, four fours and a six) worth 98.Scores in brief:\nCentral Punjab beat Sindh by XX wicketsSindh 128-7, 20 overs (Sarfaraz Ahmed 54 not out, Ahsan Ali 23, Anwar Ali 20, Danish Aziz 20; Faheem Ashraf 2-19, Hasan Ali 2-31)\nCentral Punjab 131-2, 15.4 overs (Hussain Talat 68 not out, Shoaib Malik 40 not out, Ahmed Shehzad 20)Player of the match – Hussain Talat (Central Punjab).",
  "retrievedAt": "2025-08-11T21:24:04.894Z"
}
