{
  "title": "Pakistan is leading world on climate action with highest CCBs: PM",
  "link": "https://www.app.com.pk/national/pakistan-is-leading-world-on-climate-action-with-highest-ccbs-pm/",
  "date_published": "2021-10-06T18:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): Prime Minister Imran Khan Wednesday said that Pakistan was leading the world on climate action with achievement of the highest climate co-benefits (CCBs) during fiscal year 2021 through a number of mega green initiatives on ground.\nOn his twitter handle, the prime minister said the World Bank (WB) endorsed Pakistan’s vision with 2021 lending data.The prime minister also shared a graph showing Pakistan’s World Bank commitments and climate co-benefits (CCBs), showing a surge in the CCBs during fiscal year 2021. The WB data showed that a total of US$ 1.635 billion CCBs were achieved in Pakistan in FY21 which represented 44% of the total US$ 3.696 billion IDA/IBRD financing approved for the country in FY21.\n“World Bank endorses Pakistan’s climate vision with 2021 lending data showing Pak (Pakistan) is leading the world on Climate Action – massive 44% of its mainstream dev (development) funding now climate compatible thru (through) on ground initiatives like 10 Billion Tree Tsunami, Clean Energy, Protected Areas Initiative,” the prime minister posted.\nSpecial Assistant to the Prime Minister on Climate Change Malik Amin Aslam, on his twitter handle, said that climate vision of Pakistan under the leadership of Prime Minister Imran Khan was on the concrete ground which had been acknowledged by the World Bank.\n“The climate vision of Pakistan under PM Imran Khan is about real concrete action on ground and World Bank data conclusively shows that Pakistan leads the world on Climate Action not just Climate Talk – in the run up to UNFCCC,” he posted. Earlier, World Bank Country Director for Pakistan, Najy Benhassine, on his twitter account acknowledged that Pakistan showed the way on climate action as World Bank new engagements in Pakistan during FY21 had the highest climate co-benefits(CCBs) in the world, in terms of absolute value & highest in South Asia as new commitments on climate action.\nHe further posted that these CCBs referred to the share of World Bank’s lending commitments that contributes to the climate action. “A total of US$ 1.635 billion CCBs were achieved in Pakistan in FY21 which represent 44% of the total US$ 3.696 billion IDA/IBRD financing approved for the country in FY21,” he added.\n“Out of these CCBs, 61% will contribute towards mitigation while 39% are tagged for adaptation measures. The World Bank is committed to support the Government of Pakistan’s ambitious climate agenda,” he further posted.",
  "retrievedAt": "2025-08-11T21:24:04.836Z"
}
