{
  "title": "STEM project to refurbish science education paradigm in Pakistan: Shibli",
  "link": "https://www.app.com.pk/national/stem-project-to-refurbish-science-education-paradigm-in-pakistan-shibli/",
  "date_published": "2021-10-06T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP):Federal Minister for Science and Technology, Senator Syed Shibli Faraz Wednesday said the Science, Technology, Engineering and Mathematics (STEM) programme will help refurbish and revamp the science education paradigm in Pakistan.\nThe minister was addressing the inaugural function of the STEM project at the Presidency.\nSpeaking on the occasion, the minister said Ministry of Science and Technology (MoST) selected the schools under this programme on the basis of merit which would be equipped with modern facilities and laboratories along with training the faculty.\nHe said his ministry will soon launch the National Science and Technology Innovation Policy and a Startup Policy which will bring a technological revolution in the country.\nHe said all this work is being done through the patronage extended by the President Dr Arif Alvi and Prime Minister Imran Khan.\nShibli stressed the need to focus on socioeconomic development projects in the country and enhancing the potential of the youth.\nHe said President Dr Arif Alvi and Prime Minister Imran Khan have been patronizing for the development of the science and technology sector in the country.\nHe said he was fully supported by the MoST secretary and Pakistan Science Foundation (PSF) chairman in the STEM project.\nHe said his ministry has selected the schools included in this programme on the basis of merit, not political affiliation.\nHe said the prosperity of Pakistan is associated with this programme.\nUnder STEM, 50 schools have been selected which represent the whole country including Azad Jammu and Kashmir and Gilgit-Baltistan. These schools will be equipped with modern facilities and laboratories while faculty will also be trained.\nHe said the scope of such educational projects will be extended to the whole country while a monitoring system will also be set up for its success.\nHe said a road map will be drawn up under which the graduates of these educational institutions will be educated up to universities as well as given scholarships for higher studies abroad.\nShibli said in the first phase, the STEM programme will be introduced in 50 schools where laboratories will be set up, teachers will be trained and these schools will be affiliated with the university.\nThe minister congratulated the heads of the educational institutions selected in the project.\nEarlier, PSF Chairman Dr Shahid Baig while outlining the project, said the field of science and technology plays an important role in the economic development of any country.\nHe said the project, being supported by China, will not only educate the students but also provide training to the faculty.\nMoST secretary Dr Akhtar Nazir and heads of science and technology institutions and scientists also attended the function.",
  "retrievedAt": "2025-08-11T21:24:07.069Z"
}
