{
  "title": "Opposition to change Shahbaz Sharif, if wants consultations on NAB chairman appointment: Fawad",
  "link": "https://www.app.com.pk/national/opposition-to-change-shahbaz-sharif-if-wants-consultations-on-nab-chairman-appointment-fawad/",
  "date_published": "2021-10-06T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday ruled out the possibility of consulting opposition leader Shahbaz  Sharif on the appointment of the National Accountability Bureau (NAB) Chairman.\n“Opposition has to change its leader, if they want consultation with the government on appointment of the NAB’s chairman,” he said in a news conference.\nFlanked by Minister of Law and Justice Dr. Muhammad Farogh Naseem, info minister said said, Prime Minister Imran Khan would not speak to Shahbaz Sharif at any cost.\n“Now its up to President of Pakistan, as I speak for Prime Minister,” he said, adding neither he knowledgeable about the opinion of President, nor consulted the President Office in this regard.\nThe minister said consultation with Shahbaz Sharif on the appointment of NAB Chairman will be tantamount to assigning the investigator a thief on his whims and wishes.\nIf Shahbaz Sharif has an iota of shame, he should step down from the position of opposition leader in the National Assembly, the minister said while wondering over the insistence of Shahbaz to become a part of the consultation on appointment of NAB Chairman.\nHe sarcastically said some people wanted that the government should appoint the Station House Officer (SHO) after consulting the thieves.\nFawad said the government had omitted clauses pertaining to private and banking conflicts and tax related issues from the Ordinance to be promulgated after the President’s nod.\nThe government would issue the Ordinance in a first place, later an Act of Parliament would be introduced after consultation with opposition to further improve the NAB law.\nThe suggestions from opposition would also be incorporated in the amendments of the NAB law if there would be any.\nNow the bureau would concentrate on its original task of eradication ofcorruption, Fawad said, adding, but its performance was compromised with additional responsibilities after inclusion of business and other crimes.\nHe said the NAB would now concentrate on nabbing the ‘big fish’.\nThe FBR has been authorized to arrest the tax evaders, he said, adding the government was striving to strengthen the state institutions including the NAB.",
  "retrievedAt": "2025-08-11T21:24:09.176Z"
}
