{
  "title": "Utmost efforts a must for Pakistan to join global tech race: President",
  "link": "https://www.app.com.pk/national/utmost-efforts-a-must-for-pakistan-to-join-global-tech-race-president/",
  "date_published": "2021-10-06T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): President Dr Arif Alvi Wednesday said that it required utmost efforts for Pakistan to join the global race of technology which would also guarantee the future national economic development.\nThe president, addressing the launching ceremony of STEM (Science, Technology, Engineering, Mathematics) pilot project, said the children’s motivation towards science education would create actual wealth for the country which would later support the industry and IT sector too.\nUnder the umbrella of Ministry of Science and Technology, the Pakistan Science Foundation is executing the STEM’s first phase project under PSDP program. The project is initially being launched in 50 schools across Pakistan, selected based on their excellent academic results during last three years.\nCalling STEM education “very dear” to him, the president referred to a survey by Annual Status of Education Report (ASER) which showed that the interest of Pakistani children towards STEM was comparatively low in the region.\nQuoting a study by University of Sargodha, the president said parents, visiting museum and science festivals as well as encouragement by the teachers played key role to motivate children towards STEM education.\nHe said China produced around 4.7 million STEM graduates annually, India 2.6 million and Iran 0.35 million while Pakistan would be far behind in the list.\nCalling the launching of STEM as a timely step, the president called for adopting the required factors for promotion of STEM education which provided the basis for development in organized societies.\nHe also hinted at visiting the STEM schools sometime and added that it was inevitable to uplift the people to compete the world.\nMinister for Science and Technology Senator Shibli Faraz said the program would be spread throughout the country. The selected schools will become hubs of STEM education and will serve as model schools for all schools of adjoining areas.\nHe said the program also feature training of teachers and preparation of master trainers. Moreover, a monitoring mechanism will also be in place to examine the productivity of the program.\nMoreover, he said the STEM FABLABS will be established in all STEM designated schools which would have state of the art research facilities and will also provide latest resources for digital fabrication.\nFederal Education Minister Shafqat Mahmood said the education ministry had launched a pilot program in 35 educational institutes of Islamabad which would also benefit the Pakistan Science Foundation in STEM initiative.\nHe said STEM was also part of uniform education curriculum and added that teacher training was of high importance to achieve the desired results. Chairman of Pakistan Science Foundation Dr Shahid Baig also addressed the event, attended by provincial ministers, diplomats and principals of the STEM designated schools.",
  "retrievedAt": "2025-08-11T21:24:16.938Z"
}
