{
  "title": "Online visa service to be started for Afghanistan: Sheikh",
  "link": "https://www.app.com.pk/national/online-visa-service-to-be-started-for-afghanistan-sheikh/",
  "date_published": "2021-10-06T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP): Minister for Interior, Sheikh Rashid Ahmad on Wednesday said that online visa service will be started for Afghan citizens to make this process more transparent and smooth.\nTalking to the media, the minister said that this new system will start working within 10 days as the government will provide an on-arrival visa.\nHe said that the government will use modern technology to get data and maintain the complete records of entry and exit movements. He said that this system will be applicable on two borders initially while other five borders will be included later. He said that the government was going to announce an amnesty to all visa-holders to submit an application by 30th of next month and make sure their exit from Pakistan.\n“Otherwise, they have to face cases against them in Pakistan”, he added. He said that the Federal Investigation Agency (FIA) had been given the task to avoid hoarding of dollars in the country. He added the present government was making sincere efforts to provide all basic facilities for the country’s people.\nHe said that things were changing in the region and Pakistan being a responsible state would fulfill its responsibility of national security while meeting international expectations as a major country in the region with the objective to strengthen peace in Afghanistan.\nHe said that the borders of Torkham and Chaman had been placed on the biometric system while the remaining borders will also be added to the system later. He said that the Pakistan army was proficiently accomplishing its responsibility to safeguard the country and performing duties on borders to protect every inch of the motherland.\nHe said that unfortunately Pakistan Muslim League-Nawaz (PML-N) was trying to malign state institutions for petty political gains but it will fail to do so, he added.\n“Defeat was their fate and it will face same in future as well, as they were doing all this out of their to be in power,” he added. He advised Nawaz Sharif  to come back if he wanted a serious role in the country’s politics.\nReplying to a question about barring former Prime Minister Yousaf Raza Gilani from traveling abroad, Sheikh Rashid said that his name was placed on Exit Control List (ECL), however, he can approach Interior Ministry or the court regarding the matter.",
  "retrievedAt": "2025-08-11T21:24:09.620Z"
}
