{
  "title": "Linkages with Central Asia via Afghanistan to usher new era of regional prosperity: Fawad",
  "link": "https://www.app.com.pk/national/linkages-with-central-asia-via-afghanistan-to-usher-new-era-of-regional-prosperity-fawad/",
  "date_published": "2021-10-06T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP):Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain Wednesday said the establishment of communication linkages with Central Asian States through Afghanistan would usher in new era of prosperity and development in the entire region.\nTalking to Ambassador of Republic of Kazakhstan to Pakistan Yerzhan Kistafin, the minister said that stable and peaceful Afghanistan would help to realize the vision of an interconnected, prosper and economically vibrant region.\nFawad told that Pakistan had extended all possible support in the provision and facilitation of humanitarian relief besides helping in the international evacuation efforts in Afghanistan.Prime Minister Imran Khan in his address at United Nations General Assembly rightly pointed out that new economic security paradigm was based on three central pillars of peace, development partnerships and connectivity, he added.\nChaudhry Fawad Hussain said Pakistan’s response to COVID-19 was one of the best in the World.The government had been able to contain the pandemic through timely decisions, smart lockdown strategy and effective implementation of standard operating procedures (SOPs), he added.\nNational Command and Operation Centre (NCOC) was playing a leading role in our fight against the pandemic, he said.\nHe said focusing on self-reliance, the masks and ventilators were produced locally and now they were being exported abroad.\nBoth the sides also emphasized the need to strengthen cooperation in the fields of media and information.\nThe minister said that memorandum of understanding (MoU) for exchange of news between the state media organizations of both countries would be signed on the occasion of Kazakhstan’s President visit to Pakistan.\nChaudhry Fawad Hussain also assured the ambassador that Kazakhstan would be provided with Pakistani dramas and films which would be dubbed in Kazakh language for telecast in Kazakhstan.\nThe ambassador said that his country would extend all possible support to Prime Minister Imran Khan’s vision of regional connectivity.\nHe also appreciated Pakistan’s role in evacuation of foreign nationals, diplomats and international media personnel from Afghanistan.\nBoth the sides also agreed to hold a grand ceremony at Pak-China Friendship Center on February 24, 2022 to celebrate 30th anniversary of establishment of diplomatic relations between the two brotherly countries.",
  "retrievedAt": "2025-08-11T21:24:07.436Z"
}
