{
  "title": "Winter’s juicy delight: oranges bring flavor & health benefits to Capital",
  "link": "https://www.app.com.pk/national/winters-juicy-delight-oranges-bring-flavor-health-benefits-to-capital/",
  "date_published": "2024-12-11T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP): As winter descends, local markets in the capital are abuzz with people flocking to buy oranges, savoring their juicy pulp, sweetness, and tangy flavor. A quintessential winter treat, oranges are enjoyed in raw form, sprinkled with salt, or presented as a token of hospitality to guests.\nThe main suppliers of oranges in Pakistan are Sargodha and Toba Tek Singh in Punjab, and Haripur in Khyber Pakhtunkhwa (KP). The most popular varieties, Kinnow and Fruiter, dominate the fruit stalls in the capital’s markets.\nIftikhar Ahmed, a seasoned fruit vendor in Sector G-6 with over 20 years of experience, said, “Currently, two types of oranges are available in the market. In the coming months, more varieties will arrive to satisfy people’s taste buds.”\nHe noted that the prices of Fruiter range between Rs 150-200, while Kinnow is priced from Rs 150 to over Rs 300 depending on size. “The rates are almost the same as last year,” he added, calling the business profitable and recommending it to aspiring entrepreneurs.\nDespite steady prices, Iftikhar requested to relevant authorities to reduce petroleum prices to provide relief from inflation, which he believes would benefit both vendors and consumers.\nAli, a regular customer, shared his love for the fruit: “I buy oranges almost daily. My family’s favorite is Kinnow. They enjoy eating it raw.”\nHe added, “Presenting a basket of this seasonal fruit to guests is a delightful gesture during the colder months.”\nFor some, Fruiter is the preferred choice. Tanvir, a vendor operating from his Suzuki van in Sector G-8, said, “Most customers here prefer Fruiter for its sweet taste and juice richness. This fruit is high in demand, and the profit doubles during winter because it’s both tasty and affordable.”\nSaleh, another customer said, “When I bring Fruiter home, we sit on the rooftop in the winter sun, sprinkling salt on the slices and enjoying them together.”\nHe appreciated the affordability of oranges but urged authorities to make other seasonal fruits and essentials more accessible.\nDr. Zakir, a private clinic owner in Islamabad, said, “Beyond the delightful flavor, oranges are a great source of Vitamin C, antioxidants, and essential minerals. They boost immunity, help combat seasonal illnesses, and energize and hydrate the body during winter.”\nShe advised people of all ages to consume oranges daily to reap their health benefits.\nIn a season marked by cold winds and rising costs, oranges remain a vibrant, affordable treat that warms hearts and boosts health, making them a cherished staple of winter in the capital.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:41:15.636Z"
}
