{
  "title": "Kyrgyzstan to initiate Conservation Trust Fund for saving mountains ecosystem: Ambassador Atakhanov",
  "link": "https://www.app.com.pk/national/kyrgyzstan-to-initiate-conservation-trust-fund-for-saving-mountains-ecosystem-ambassador-atakhanov/",
  "date_published": "2024-12-11T18:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP): Ambassador Republic of Kyrgyzstan to Pakistan Avazbek Atakhanov on Wednesday said that Kyrgyzstan has decided to initiate the Conservation Trust Fund to save the ecosystem of the mountains, which will be for the common cause of the countries that have mountains.\nAddressing the ‘International Mountains Day’ ceremony held at the embassy of Kyrgyzstan, he said there are ten countries including Pakistan and Kyrgyzstan which are suffering from various environmental challenges due to their mountainous geography which requires comprehensive planning.\nThe Ambassador said that Pakistan is a beautiful country and protecting nature is our survival, for which Pakistan, Kyrgyzstan and other countries have to make joint efforts.\nHe said that Kyrgyzstan is considering establishing a Conservation Trust Fund (CTF) to protect the mountain ecosystems and biodiversity.\nMeanwhile, reading out the message of President of the Kyrgyz Republic Sadyr Japarov he said that, today on December 11, he congratulated the people of Kyrgyzstan on International Mountain Day.\nHe said the Day reminds us of the importance and uniqueness of mountain ecosystems, as well as the threats that mountains face due to climate change and environmental degradation around the world.\nHe said that for the Kyrgyz people, mountains are not only a natural wealth given to us by the Almighty, but also a source\nof life, a native land that has long served as a safety and support for our ancestors.\n“Kyrgyzstan, being a mountainous country, is proud of its unique natural resources – majestic mountains, sparkling glaciers and full-flowing rivers. They are vital not only for our people, but also for the entire Central Asian region. At the same time, mountains remain one of the most vulnerable parts of the ecosystem. They suffer from excessive human activity, climate change, degradation of biodiversity and depletion of natural resources.”\nAt the initiative of Kyrgyzstan, the UN General Assembly at its 77th session recognized the importance of promoting sustainable development of mountain regions and adopted the resolution “Sustainable Mountain Development”. Within the framework of this resolution, 2023-2027 were declared the Five Years of Action for Mountain Development, he said.\nToday, “We face serious challenges: melting glaciers, pollution of mountain ecosystems, natural disasters, extreme weather conditions, water scarcity, desertification, degradation of mountain pastures and loss of biodiversity. We strive to advance the global agenda for mountain conservation, uniting the efforts of the international community to jointly respond to global and regional challenges. In addition, Kyrgyzstan, together with other countries, is actively promoting initiatives to protect the snow leopard.”\nHe said that this year, at the 60th session of the UN Subsidiary Body for Scientific and Technical Advice (SBSTA), an expert dialogue on mountains and climate change was held, during which it was emphasized that it is necessary to consolidate the efforts of the international community to support mountain countries.\nAlso, at the 29th Conference of the Parties to the UN Framework Convention on Climate Change, Kyrgyzstan held a number of important events related to the mountain agenda and organized a National Pavilion called “Sustainable Mountain Development”.\nHe said the Kyrgyz Republic took the initiative to adopt a Declaration on Climate Change, Mountains and Glaciers, which was supported by 16 states.\n“We are confident that by combining efforts at the national, regional and global levels, we will be able to preserve mountain ecosystems for future generations.”\nIn this regard, “I call on every citizen of Kyrgyzstan to contribute to the protection of nature, the careful use of mountain resources and the fight against climate change. Let our actions be aimed at preserving the greatness of the Kyrgyz mountains, their unique nature and priceless glaciers, which are the wealth of all mankind!”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:36:26.570Z"
}
