{
  "title": "Empower HER Digital Tech Summit empowers Pakistani women in technology",
  "link": "https://www.app.com.pk/national/empower-her-digital-tech-summit-empowers-pakistani-women-in-technology/",
  "date_published": "2024-12-11T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP): UN Women Pakistan and the Korea International Cooperation Agency (KOICA) hosted the Empower HER Digital Tech Summit in Islamabad on Wednesday, bringing together thought leaders, innovators, and young women to explore the transformative power of digital skills for women’s economic empowerment.\nFunded under KOICA’s Digital Transformation for Women’s Economic Empowerment (D4WEE) project, the Summit spotlighted strategies to close the gender gap in the digital economy. Through engaging panel discussions, exhibitions showcasing women-led tech innovations, and competitions celebrating digital creativity, the event emphasized the pivotal role of women in shaping Pakistan’s digital future.\n“This Summit serves as a catalyst for change,” said Mr. Jamshed Kazi, Country Representative, Designate, UN Women Pakistan, in his closing remarks. “Through collective action, we aim to ensure that young women are not just participants in the digital economy but leaders and innovators. When women succeed in the digital sector, it benefits families, communities, and society as a whole.”\nEchoing this sentiment, Mr. Je Ho Yeon, Country Director, KOICA Pakistan, remarked: “Empowering women in technology is not only about inclusion but also about driving innovation and economic growth. We are proud to partner with UN Women in equipping young women with the skills needed to thrive in the digital age.”\nA key highlight of the Summit was the “Digital Divas” Panel Discussion, where leading female tech pioneers Ms. Nadia Patel Gangjee (Founder & CEO, Femprow), Ms. Faiza Yousuf (Co-founder & CPO, CaterpillHERS), and Ms. Irum Ahsan (Founder & CEO, CIRCLE Women) shared their personal journeys, success strategies, and insights on how women can thrive in digital spaces. Topics ranged from leveraging e-commerce to overcoming gender-based challenges in the tech sector. The interactive Q&A session provided participants with a chance to engage directly with the panelists. The event brought together over 100 young women, university students, tech enthusiasts, private sector leaders, and government representatives to inspire, educate, and empower women to pursue careers in the technology sector.\nThe Student Digitalization Initiative Showcase featured student teams from six universities in Punjab and Khyber Pakhtunkhwa. Students presented innovative digitalization projects judged by an independent jury nominated by UN Women. The top three winners were awarded shields, and all participants received certificates of participation.\nThe Summit also included a Digital Career Fair, where leading tech companies and startups showcased career and internship opportunities for women in the digital sector. Participants engaged with private sector representatives and explored interactive exhibits set up by local and international tech companies.\nThe event concluded with a Call to Action session, urging all stakeholders to actively support gender equality in the digital sector. The UN Women Country Representative emphasized, “To bridge the gender gap in digital spaces, we must create pathways for young women to become not only users of technology but also its designers and leaders. Through this initiative, we hope to support a generation of women who are confident, capable, and connected in the digital economy.”\nThe Empower HER Digital Tech Summit was organized as part of the KOICA-funded D4WEE (Digitalization for Women’s Economic Empowerment) project, which aims to enhance the participation of women aged 18-35 in the technology sector through capacity building, mentorship, and engagement with private sector stakeholders. The project is being implemented across Lahore, Faisalabad, Multan, Mardan, Peshawar, and Swabi and seeks to bridge the digital divide in Pakistan.\nThe Summit also highlighted its alignment with the ongoing “16 Days of Activism against Gender-Based Violence” campaign, drawing attention to the role of economic empowerment in preventing gender-based violence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:41:38.704Z"
}
