{
  "title": "UN chief affirms Pakistan’s initiatives to protect minorities rights: Firdous",
  "link": "https://www.app.com.pk/national/un-chief-affirms-pakistans-initiatives-to-protect-minorities-rights-firdous/",
  "date_published": "2020-02-18T05:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Tuesday said United Nations Secretary General António Guterres had himself witnessed the government’s steps and initiatives for the protection of minorities’ rights in Pakistan, whereas across the border in India the fascist hard-line Modi regime had made the lives of minorities miserable.\nTalking to the media at the oath-taking ceremony of newly-elected office-bearers of Chitral Press Club here, she said the entire nation was grateful to the UN secretary general for his statement on Kashmir, which was a victory of Pakistan’s narrative and that of the Kashmiris, negating Indian claims of held valley being its integral part.\nThe way the Indian police had attacked the Jamia Millia on the directives of Narendra Modi was an eye-opener for the whole civilized world, including the UN, she added.\nDr Firdous said the minorities in Pakistan were enjoying equal religious, legal and individual rights, whereas in the Indian Occupied Jammu and Kashmir, humanity was being humiliated by India denying the Kashmiris their right to self-determination as per the UN resolutions.\nShe expressed the hope that the visit of UN secretary general to Pakistan would prove to be helpful in provision of justice to the hapless Kashmiris as the world body would take practical steps for the implementation of its Security Council’s resolutions on the Kashmir issue.\nShe said a real soft image of Pakistan was brought to the fore by the UN chief by acknowledging its constructive and positive role in hosting and sheltering the Afghan refugees for over 40 years.\nShe said peace was the only way to progress and that was why Pakistan was play a role for peace, which was imperative for the progress and prosperity of the entire region.\nShe said the whole world had appreciated the efforts of Prime Minister Imran Khan for peace in the country and region, and the UN secretary general’s visit was a proof of that.\nThe SAPM said global warming was one of the biggest issues of the region and the entire world should take steps for overcoming the challenge.\nShe said the Pakistan Super League was going to start in a couple of days, which manifested that Pakistan was a peaceful country.\nIt was a change as in the past the UN and many countries used to issue travel advisories asking their citizens to avoid visiting Pakistan but now they had termed it the safest country.\nShe urged the opposition to learn sportsmen spirit from the PSL teams and wait for the 2023 elections.\nCongratulating the newly-elected office-bearers of Chitral Press Club, she said the government was aware of the difficulties being faced by the journalists and was taking steps for their resolution.\nPaying tributes to the martyrs of the war against terrorism, she said the credit for restoration of peace in Pakistan went to the personnel of armed forces, police, law enforcement agencies, media persons and general public, who had sacrificed their lives.\nCondemning the gruesome murder of journalist Aziz Memon in Sindh, she said the prime minister had sought a report from the Inspector General of Police Sindh and justice would be provided to his family and the responsible would be taken to task.\nTo a question, she said it was the government’s topmost priority to play its role in payment of outstanding dues to the media persons. She had been holding meetings with all the stakeholders for the purpose, she added.\nAbout the Utility Stores Corporation (USC), she said the present government had revived the institution and its restructuring was underway. The time would come when the USC stores would become a benchmark for provision of good quality items at cheaper prices.",
  "retrievedAt": "2025-08-11T18:49:24.192Z"
}
