{
  "title": "PM orders countrywide crackdown to check smuggling of food items, other goods",
  "link": "https://www.app.com.pk/national/pm-orders-countrywide-crackdown-to-check-smuggling-of-food-items-other-goods/",
  "date_published": "2020-02-18T05:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Prime Minister Imran Khan, in a major decision to check smuggling of food items and other goods, Tuesday ordered to immediately launch an anti-smuggling crackdown across the country on a large scale.\nThe decision was taken during a high level meeting chaired by the prime minister here about curbing the smuggling of food items and other goods.\nThe meeting was attended by Minister for National Food Security Makhdoom Khusro Bakhtiar, Minister for Planning Asad Umar, Advisor on Commerce Abdul Razak Dawood, Secretary Interior, Secretary National Food Security, Acting Chairman of Federal Board of Revenue (FBR), provincial home secretaries and other senior officers.\nThe prime minister directed the Ministry of Interior, federal and provincial law enforcing institutions, FBR and the provincial governments to immediately launch a joint anti-smuggling operation.\nHe ordered the Ministry of Interior to present him within the next 48 hours a report based on the actions being taken along with a comprehensive strategy.\nThe prime minister directed to start taking short-term, medium-term and long-term measures while keeping in view the recommendations of the task force constituted to check smuggling.\nIntelligence Bureau (IB), Inter-Services Intelligence (ISI) and Federal Investigative Agency (FIA) were also directed to present monitoring reports of the effective anti-smuggling crackdown, to the prime minister on regular basis.\nAs the report of progress on the establishment of border markets along the western frontiers was presented during the meeting, Prime Minister Imran Khan also directed to speed up the pace of progress on the establishment of border markets in Balochistan.\nThe prime minister said the smuggling of food items, which caused price-hike and difficulties for the common man, was totally unacceptable.\nHe said as effective control of smuggling, which was causing billions of rupees losses to the country’s economy, was a matter of national interest, no negligence would be tolerated in that respect.\nThe prime minister further directed to formulate a comprehensive policy regarding the Iranian petroleum products. Technology should be utilized in curbing the smuggling, he added.",
  "retrievedAt": "2025-08-11T18:49:20.938Z"
}
