{
  "title": "NHA arranges road show, offers Sukkur-Hyderabad Motorway for foreign investment",
  "link": "https://www.app.com.pk/national/nha-arranges-road-show-offers-sukkur-hyderabad-motorway-for-foreign-investment/",
  "date_published": "2020-02-18T03:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):In order to attract foreign investment, the National Highway Authority (NHA) has arranged a Road Show at its head office here Tuesday where in Sukkur-Hyderabad Motorway (M-6) was offered for foreign investment.\nBesides Chairman NHA Capt ® Sikandar Qayyum, Zhang Bing, Second Secretary of Economic and Commmercial Sector, Embassy of China and Hasan Javed- Secretary to Commercial Counsellor, Turkey also participated in the Road Show.\nNHA’s Member Public Private Partnership (PPP) Tufail Ahmad Sheikh, Member Coordination Asim Amin and Member (Engineering-Coordination) Arbab Ali were also present.\nIn his welcome remarks, Chairman NHA Capt ® Sikandar Qayyum said Prime Minister Imran Khan was endeavoring for providing concrete infrastructure to the country for economic uplift.\nTo this effect, he said, road communication sector possessed a great significance. Pakistan has already undertaken gigantic China Pakistan Economic Corridor (CPEC) project with neighbouring friendly country China.\nHe said except Sukkur-Hyderabad section, Peshawar-Karachi Motorway (PKM) project was complete. Now, this only missing link (Sukkur-Hyderabad Section) was being offered for foreign investments.\nGiving a detailed picture of NHA’s working, Member Coordination Asim Amin said NHA was the custodian of 47 national highways, motorways and strategic roads throughout the country.\nSpeaking about Pakistan’s extra ordinary geo-strategic location in the region, he said, NHA had been implementing China Pakistan Economic Corridor (CPEC) project. Sukkur-Hyderabad Motorway (M-6) is the last missing link of Peshawar-Karachi Motorway and steps are underway to build this section with foreign investment.\nGeneral Manager NHA (Public Private Partnership) Azeem Tahir said the length of proposed Sukkur-Hyderabad Motorway would be 306km, with 14 interchanges, one major bridge on River Indus, 6 flyovers, 10 Service Areas and 12 Rest Areas will also be built on this motorway.\nThe project is planned to be completed in 30 months at construction cost of approximately Pak Rupees 175 billion with Intelligent Transport System (ITS).",
  "retrievedAt": "2025-08-11T18:49:13.261Z"
}
