{
  "title": "Zufi Bukhari chairs meeting on tourism promotion",
  "link": "https://www.app.com.pk/national/zufi-bukhari-chairs-meeting-on-tourism-promotion/",
  "date_published": "2020-02-18T03:36:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 18 (APP):Special Assistant to Prime Minister (SAPM) on Overseas Pakistanis and Human Resources Development & Chairman National Tourism Coordination Board Syed Zulfiqar Abbas Bukhari, also known as Zulfi Bukhari, Tuesday said that tourism industry could play a crucial role in boosting Pakistan’s economy.\nWhile chairing a meeting on tourism promotion at the Tourism Development Corporation of Punjab (TDCP) head office, he said Pakistan had been declared among the top 10 tourist destinations this year.\nTherefore, it is our responsibility to provide a well managed, more hospitable and friendly environment to those who visit Pakistan from around the globe.\nZulfi Bukhari stressed that all organisations and authorities responsible for tourism should unite and work together for the national cause, as tourism and tourists could help promote Pakistan’s positive image abroad.\nHe appreciated the efforts of the TDCP management, the adviser on tourism and steps taken by the Punjab government and pledged his full support for tourism at every level and forum.\nHe also visited the Institute of Tourism and Hotel Management Lahore Campus and addressed the orientation session of Kamyab Jawan Programme.\nAdviser to Chief Minister (CM) on Tourism Asif Mehmood briefed the chair about the potential of tourism in Punjab and initiatives taken by the government for promotion of tourism in the province. He added that on the directions of PM and CM Punjab, the TDCP had made plans to identify and establish new tourist sites in Punjab so that the burden on few specific points could be reduced.\nHe said that Punjab had beautiful landscapes like Chakwal, Kotli Satian, Koh-e-Suleman and Soan Valley where construction of resorts and other facilities had been started and would be opened soon for the public.\nTDCP Managing Director Tanveer Jabbar briefed the National Tourism Coordination Board (NTCB) chairman about the initiatives taken by the TDCP for service delivery and facilitation of tourists as well as the status of work on the new sites.\nHe also spoke about promotion of the new sites with the collaboration of private tourist organisers.\nHe said that the TDCP was not only focused on just landscape tourism, it was also working on other dimensions like sports tourism, agri tourism and religious tourism to attract the tourists with different interests.",
  "retrievedAt": "2025-08-11T18:49:31.832Z"
}
