{
  "title": "UK Deputy High Commissioner visits Sialkot",
  "link": "https://www.app.com.pk/national/uk-deputy-high-commissioner-visits-sialkot/",
  "date_published": "2020-02-18T04:28:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Feb 18 (APP):-:British Deputy High Commissioner in Karachi Mike Nithavrianakis on Tuesday stressed the need for making sincere efforts to strengthen mutual trade ties between the UK and Pakistan.\nAddressing the exporters at Sialkot Chamber of Commerce and Industry (SCCI), Mike\nNithavrianakis said the UK was intending to develop long term sustainable trade and\nbusiness relations with Pakistan.\nHe also stressed the need for promoting Business to Business contacts between the\nbusinessmen of both countries. He said the UK could be the biggest market of Sialkot-made traditional and non-traditional export products.\nHe said that 5,000 British companies in UAE and 150 companies were working in Pakistan.\nHe said the time had ripen that private sector should be encouraged at every level to promote bilateral trade between UK and Pakistan.\nHe said that Pakistan was taking magnificent steps to enhance business relations between\nthe UK and Pakistan.\nHe eulogized all social welfare and human development-oriented projects being run successfully by the Sialkot exporters on self help basis under the supervision of Sialkot Chamber of Commerce and Industry (SCCI).\nOn this occasion, Sialkot exporters hailed the UK support to Pakistan in terms of giving awareness to the world that Pakistan was now a safe country through several measures including the softening of travel advisory for Pakistan and resumption of British Airways operations in Pakistan.\nSialkot exporters said the UK was Pakistan’s third largest export destination; and also, the\nthird-highest source of Foreign Direct Investment in Pakistan.\nThe total trade volume between the two countries was around 3.2 billion Pounds in 2018.\nHe also showed keen interest in SCCI’s documentary “Sialkot, the City of Progressive People” which was screened during the meeting.\nEarlier, Mike Nithavrianakis visited Sialkot international airport. The British envoy discussed\nin details the matters of mutual interest with the management of Sialkot International Airport Limited (SIAL). British High Commission’s senior officials, Chairman SIAL Nadeem Anwar Qureshi,CEO of SIAL Maj-Gen (Retd) Muhamad Abid Aziz, General Manager Brig (Retd) Muhammad Nawaz and Manager Public Relations Abdul Shakur Mirza were also present on the occasion.\nHe highly hailed the spirit of Sialkot exporters for establishing mega project of Sialkot international airport on self help basis.\nThe UK Deputy High Commissioner also visited several leading industrial units in Sialkot.\nHe took keen interest in manufacturing and production processes of sports goods and\nsurgical and musical interments.\nPresident Sialkot Chamber of Commerce and Industry (SCCI) Muhammad Ashraf Malik\nwas also present.",
  "retrievedAt": "2025-08-11T18:49:29.572Z"
}
