{
  "title": "Around 97 pc findings of Federal Ombudsman implemented",
  "link": "https://www.app.com.pk/national/around-97-pc-findings-of-federal-ombudsman-implemented/",
  "date_published": "2020-02-18T03:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Federal Ombudsman Syed Tahir Shahbaz has shown complete satisfaction over 97 percent implementation on findings passed by him against the federal government Agencies during, 2019.\nThe Implementation Wing gave a detailed briefing to the Federal Ombudsman on the implementation status of findings passed by the Federal Ombudsman against maladministration by different federal government Agencies, said a press release on Tuesday.\nThe ombudsman was informed that overall percentage of implementation of the findings pertaining to the year 2019 was around 97 percent.\nHe was also informed that during the last three months out of 9775 decisions 7138 have been fully implemented, whereas, 2637 decisions are at different stages of implementation. Performance of all the Regional Offices in the context of implementation of findings relating to those offices was also reviewed individually.\nIt was observed that the Regional office, Lahore implemented 2333 cases out of a total of 2961 while the Regional Office Karachi implemented 1035 cases out of 1319. Similarly, Regional Office Dera Ismial Khan implemented 807 out of 1102 cases. Implementation ratio of the remaining Regional Offices was also found to be satisfactory.\nHe was informed that some of the cases could not be implemented for either being sub-judice in court of law or due to non-availability of funds for which requests for supplementary grant have been made by the concerned Agencies to the Finance Division.\nIn the context of the unimplemented cases pertaining to the CDA as well as Federal Government Employees Housing Authority, the Federal Ombudsman was pleased to direct that a meeting should be convened with the said Agencies shortly to indentify the impediments in the implementation process and to work out modalities for removing those impediments.\nThe federal ombudsman said that being the poorman’s court the Wafaqi Mohtasib Secretariat should ensure expeditious relief to the people. He showed complete satisfaction on the process on implementation of his recommendations/decisions.",
  "retrievedAt": "2025-08-11T18:49:13.299Z"
}
