{
  "title": "60 per cent work on Khisar dam completed",
  "link": "https://www.app.com.pk/national/60-per-cent-work-on-khisar-dam-completed/",
  "date_published": "2020-02-18T03:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):The Senate Standing Committee on Water Resources on Tuesday was informed that 60 per cent work on Khisar dam district Noskhi has already been completed and it would store 3000 acre feet of water.\nThe committee which met with Shammim Afridi in chair was briefed about Khisar dam Bhimber Dam, AJK Projects.\nThe Committee was informed that the proposed Dam site was located 18 Km from Nushkhi Town, Balochistan. The objective of the project was to recharge the ground water acquirer in the area located downstream of these dams.\nThe Dam would also be instrumental in protecting downstream areas from flash floods.\nThe Committee inquired reasons for delay of the project since execution of work had begun in 2017. It was informed that less allocation of funds was the main cause of lack in progress of work on the dam.\nThe Committee directed that the Finance Division must be summoned in the next meeting.\nA progress report of the project was demanded as well. The Committee was informed that approved PC-I cost was Rs 444.001 million, whereas updated revised cost was Rs 381.551 million.\nOfficials of Provincial Irrigation department Balochistan told the committee that the project was part of constructing 100 small dams in the province. However, the project was delayed due to unavailability of required fund, they said.\nMir Muhammad Yusaf Badini said there would be water shortage issue in Noskhi if the dam was completed in time.\nThe committee deferred proposed briefing regarding PSDP proposed by the Water Resources Ministry for Budget 2020-21 as observed that relevant documents were not shared with the members. The members would give their view points, once they studied the said documents.\nDeliberating over the work conducted over Bhimber Dam, the Committee was informed that PM AJK desired for the construction of small dam projects on Bhimber Nullah in 2010.\nWAPDA submitted a PC-II for feasibility study. CDWP approved the PC-II (Rs 86.089) on 29 November, 2013 subject to WAPDA financing and addressing AJK concerns.\nWAPDA requested Government of AJK to arrange funds, since it was the sole beneficiary of the project.\nAJK refused funding due to financial constraints. At that WAPDA requested Ministry of Water Resources to consider providing funds through PSDP for the project.\nThe meeting was attended by Senator Brig, (R) John Kenneth Williams, Senator Muhammad Yousaf Badini, Senator Usman Khan Kakar, Senator Syed Muhammad Sabir Shah and senior officers from the Ministry of Water Resources, Planning Division and IRSA etc.",
  "retrievedAt": "2025-08-11T18:49:10.599Z"
}
