{
  "title": "Guterres for joint efforts to defeat polio",
  "link": "https://www.app.com.pk/national/guterres-for-joint-efforts-to-defeat-polio/",
  "date_published": "2020-02-18T05:37:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 18 (APP):United Nations Organization (UNO) Secretary General Antonio Guterres said on Tuesday that fatal disease of polio can effectively be fought out through joint, concerted efforts.\nHe was talking to media after administering anti-polio vaccine to children up to five years of age at a private school in DHA area. Punjab Health Minister Dr. Yasmin Rashid and high officials of relevant departments were also present.\nUN Secretary General said, “Together, we can eliminate polio from across the world, and I appeal to all the world leaders to join hands to fight out polio.”\nAntonio Guterres added that eradication of polio from the world is his top most priority for which UNO has been putting in comprehensive measures.\nUN Secretary General appreciated government of Pakistan as well as Punjab government’s efforts to control hazardous polio virus,saying, “I am glad to be here in Pakistan. I am here in solidarity with anti-polio workers, who rendered even their lives for this noble cause of humanity.” He acknowledged that Pakistan is now more safe country than ever before.\nWelcoming the UN Secretary General to Punjab, Provincial Health Minister Dr. Yasmin Rashid said, “We are grateful to you for visiting Pakistan.” She said that government was working day and night to control polio, while Prime Minister was also utilizing all possible resources for eradication of polio. She expressed with hope that”One day soon Pakistan will be polio-free.”\nShe elaborated that a total of 45,000 workers were engaged in anti-polio drive in Punjab for door-to-door vaccination, while anti-polio vaccination centres were also established in the province. Children up to five years of age have also been vaccinated at railway stations, bus stands and other public places, she elaborated, and added that no polio infection case has so far been reported in Punjab.",
  "retrievedAt": "2025-08-11T18:49:20.939Z"
}
