{
  "title": "PM orders setting up complaint management system at capital’s all police stations",
  "link": "https://www.app.com.pk/national/pm-orders-setting-up-complaint-management-system-at-capitals-all-police-stations/",
  "date_published": "2020-02-18T05:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Prime Minister Imran Khan on Tuesday directed the Interior Minister to establish complaint management system at every police station of the capital and make Islamabad a model safe and secure city.\nThe prime minister was chairing a meeting on civic amenities in the capital including law and order, health and education, which was attended by Interior Minister Brig (retd) Ijaz Shah, Education Minister Shafqat Mehmood, Planning minister Asad Umer, Special Assistant for Capital Development Authority Ali Nawaz Awan, MNA Raja Khurram Shehzad and relevant secretaries.\nThe prime minister stressed capacity-building of Islamabad Police and taking steps according to the required needs relating to human resource.\nHe said the complaint management system would receive online feedback of citizens which would be used for improvement of service delivery.\nTaking serious notice of complaints regarding lack of health facilities in federal capital, the prime minister said negligence would not be spared and directed the Secretary Health to urgently focus on proper utilization of hospital administration, shortage of human resource and provision of medicines.\nThe prime minister directed to address the shortage of teaching staff by valuing education as an emergency need. He said knowledge was linked to bright future and vowed to provide all necessary resources to ensure quality education.\nHe instructed that special attention be paid on upgrading quality of 24 model schools and colleges and devise a roadmap outlining time-line of targets achieved.\nImran Khan stressed laying equal focus on educational institutes of female students as well.\nTaking serious notice of illegal concrete construction in green areas of capital, the prime minister directed the Chairman Capital Development Authority to pinpoint the violators for a strong action against them.\nHe said action would be taken against those violating the CDA byelaws, may it individuals and owners of housing societies.\nHe said that use of concrete without proper planning was disturbing the environmental balance and needed an understanding by all segments of society.\nEarlier, Education Minister Shafqat Mehmood briefed about steps taken for improvement of 423 public schools and colleges in the premises of Islamabad.\nSecretary Health Dr Allah Bux gave a detailed briefing to the prime minister on step taken to improve health-related facilities in the capital.\nHe said four community health centres and 16 basic health units would be made fully operational by this June, which would complement the medical treatment being provided at four major hospitals.\nHe shared the plan of construction of Polyclinic II hospital in Sector G-11, new emergency ward at Pakistan Institute of Medical Sciences (PIMS) and a new hospital at Sarai Kharbuza to expand health facilities to locals.",
  "retrievedAt": "2025-08-11T18:49:20.964Z"
}
