{
  "title": "NA Speaker stresses collective efforts for thriving Pakistan",
  "link": "https://www.app.com.pk/national/na-speaker-stresses-collective-efforts-for-thriving-pakistan/",
  "date_published": "2024-10-10T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):National Assembly Speaker Ayaz Sadiq on Thursday reaffirmed the government’s commitment to achieving a healthy and prosperous Pakistan through collective efforts and divine guidance.\n“We will soon achieve this mission with Allah’s guidance and our collective efforts,” the speaker stated in his message on World Mental Health Day being observed on Oct 10 (Thursday).\nHe stressed the importance of taking proactive steps to curb the rise of mental health issues, adding, “Now, more than ever, there is an urgent need for comprehensive and effective action to tackle mental health challenges.”\nSpeaker Ayaz Sadiq emphasized the critical role of mental health in national development, stating, “A healthy mind is the cornerstone of a prosperous nation.” He highlighted the impact of supportive workplace environments in alleviating stress and anxiety. He also noted that health is a divine blessing and that mental well-being is essential for personal growth, adding, “It is through a healthy mind that individuals are able to think, understand, and innovate.”\nCiting the World Health Organization (WHO), Speaker Sadiq pointed out that over one billion people globally suffer from mental health disorders. He also outlined the key contributing factors, including injustice, mistreatment, loneliness, intolerance, anxiety, unemployment, poverty, and insufficient healthcare.\nSpeaker Sadiq expressed profound concern over the mental suffering of Palestinians amidst the ongoing Israeli aggression, noting that they are enduring immense psychological distress alongside other hardships. “Our Palestinian brothers and sisters face severe mental anguish due to Israeli brutalities,” he remarked.\nHe also condemned the atrocities in Indian Illegally occupied Jammu and Kashmir, emphasizing the devastating psychological toll on the Kashmiri people. “The relentless Indian oppression and persistent human rights violations are causing catastrophic mental impacts on our Kashmiri brothers and sisters,” Sadiq added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:59:29.542Z"
}
