{
  "title": "Islam grants fundamental rights to all irrespective of gender: Ayaz",
  "link": "https://www.app.com.pk/national/islam-grants-fundamental-rights-to-all-irrespective-of-gender-ayaz/",
  "date_published": "2024-10-10T16:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):Speaker National Assembly Sardar Ayaz Sadiq Thursday said that Islam stressed upon the provision of all basic rights to girl child irrespective of gender.\nWhile referring to the profound sayings of the Holy Prophet Muhammad (PBUH), who advocated for empowerment of women and declared them as blessings from Almighty Allah, he said that  the teachings of Islam urged for the protection and welfare of girl children.\nHe said the teachings of Islam provide unequivocal rights to women, including the right to inheritance of property and access to education, which underscores their dignity and status in society.\nHe also highlighted the essential rights and privileges granted to girl children through religion and culture, particularly within Islam.\nAyaz Sadiq expressed these views, in his message, on the eve of the ‘International Day of the Girl Child’, which will be celebrated with the theme of ‘Girls’ vision for the future’, on October 11 under the auspices of the United Nations.\nHe urged the nation to treat girls and boys indiscriminately while stating that the women comprise half of the country’s population and their empowerment is crucial for socio-economic progress of the country.\nHe said that girls should be considered as integral for future success because their contributions and vision completes the recipe for sustainable growth and progress.\nAyaz Sadiq reiterated that providing equal opportunities to girls, especially educational opportunities, is vital for the well-being of future generations.\nHe reaffirmed the importance of inheritance laws and social safety nets designed for women and girls, stating that our society, especially the Muslim Ummah, honors the girl child, providing her with social and financial comforts alongside necessary protection.\n“Our culture and religion encourage us to consider every girl child as an integral member of society,” he added.\nThe Speaker emphasized the provisions of the Constitution of the Islamic Republic of Pakistan, stated that every citizen including children are equal before law.\nHe said that the Constitution of Pakistan, without any gender discrimination, guarantees the right of children to inheritance of property & right to free & compulsory education from the ages of 5 to 16.\nAyaz Sadiq said that the Child Marriage Restraint (Amendment) Act, 2016 is a testament to the commitment of the Parliament of Pakistan to protect children against forced and early marriages.\nHe reiterated that the formation of the Parliamentary Caucus on Child Rights in the National Assembly demonstrates the Parliament’s commitment to enhancing the well-being and protection of the rights of children in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:58:41.047Z"
}
