{
  "title": "Pakistan, Saudi Arabia sign MoUs valuing $2.2 bn in multiple sectors",
  "link": "https://www.app.com.pk/national/pakistan-saudi-arabia-sign-mous-valuing-2-2-bn-in-multiple-sectors/",
  "date_published": "2024-10-10T17:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): Pakistan and Saudi Arabia on Thursday signed 27 Memorandum of Understandings (MoUs) valuing US$2.2 billion in various sectors including industry, agriculture, Information Technology (IT), food, education, mine & minerals, health, petroleum, energy and other areas of mutual cooperation.\nPrime Minister Muhammad Shehbaz Sharif accompanied by Saudi Investment Minister Khalid Bin Abdul Aziz Al Falih and Chief of Army Staff Lt. General Syed Asim Munir witnessed the exchange of the signed copies of the MoUs.\nAddressing on the occasion, the prime minister said the visit of Saudi business delegation was a true manifestation of great sincerity and affection for people of Pakistan from Saudi Crown Prince Mohammad bin Salman.\nHe hoped that today’s ceremony would lead to many more such events in times to come.\nHe expressed the government’s resolve to implement these MoUs and to transform them into agreements in future through “hard work and untiring efforts”.\n“Our Saudi brothers lead by Khalid Bin Abdul Aziz Al Falih have done remarkable job to promote Saudi economy and with his presence here, we will have his full cooperation to promote bilateral investments and business opportunity,” he remarked.\nThe prime minister hoped that in future there would be many more such ceremonies both in Saudi Arabia and Pakistan.\nHe assured the Saudi delegation that the MoUs signed today would be fully materialized and there would be no delay or red tape-ism in the implementation process.\nRecently, he said that Pakistan had secured the International Monetary Fund (IMF) programme which he hoped would be the last programme. He thanked the Saudi leadership for their support in having the programme as without their support, the programme could not have materialized.\n“Finally this programme is through, but we hope that this will be the last programme as we have already through a wonderful team work, managed to improve our economic indicators, inflation came down from 32% to 6.9% this month, our policy rate has come down from 23% to 17.5%, exports are increasing, foreign remittances are also increasing”, he said.\nAdditionally, he said the government was moving towards deep rooted reforms in the country’s economy through very stringent measures and there was no compromise on these decisions.\nThe prime minister also conveyed his warm regards to the Custodian of the Two Holy Mosques, His Majesty King Salman bin Abdulaziz, and His Royal Highness Crown Prince Mohammed bin Salman, acknowledging their leadership and support in enhancing bilateral ties.",
  "retrievedAt": "2025-08-10T19:57:57.948Z"
}
