{
  "title": "Pakistan, Saudi Arabia reaffirm deepening economic cooperation",
  "link": "https://www.app.com.pk/national/pakistan-saudi-arabia-reaffirm-deepening-economic-cooperation/",
  "date_published": "2024-10-10T04:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): Pakistan and Saudi Arabia on Thursday reaffirmed their commitment to enhancing cooperation in key areas including economy, agriculture, mining and information technology.\nIn the meeting between President Asif Ali Zardari and the visiting Saudi delegation led by Saudi Minister for Investment Khalid bin Abdulaziz Al-Falih here at the Aiwan-e-Sadr, both sides underlined the need to work together to build a prosperous and peaceful future for the region as well as for the Islamic World, according to a President House press release.\nWelcoming the delegation, the president emphasized the longstanding and time-tested relationship between Pakistan and the Kingdom of Saudi Arabia (KSA).\nHe expressed Pakistan’s desire to elevate the bilateral ties into a long-term strategic and economic partnership, underscoring that such collaboration would bring the two brotherly nations further closer.\nPresident Zardari reaffirmed Pakistan’s deep respect for the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud, and reiterated Pakistan’s unwavering commitment to stand in solidarity with Saudi Arabia.\nHe also praised the visionary leadership of Crown Prince and Prime Minister of Saudi Arabia Mohammed bin Salman Al Saud.\nThe president also highly commended the remarkable progress Saudi Arabia was making under Vision 2030 and expressed gratitude for the Kingdom’s continued support to Pakistan during challenging times. The president said that he was happy to witness the progress and prosperity of Saudi Arabia.\nEngr. Khalid bin Abdulaziz Al-Falih said that Saudi Arabia recognised the strategic geographical significance of Pakistan and its potential for natural resources and renewable energy.\nHe informed that Saudi Arabia had planned to invest in the infrastructure and mining sectors of Pakistan and, in this regard, his delegation would sign 25 agreements in different sectors to boost economic cooperation between the two brotherly nations.\nHe expressed the hope that the signing of the agreements would mark a new era of economic cooperation between the two countries. Both sides emphasized to increase collaboration in the areas of agriculture and information technology.\nThe meeting was attended by Minister for Petroleum Senator Musadik Masood Malik, Minister for Commerce Jam Kamal Khan, Minister for Privatization Abdul Aleem Khan, Minister for Interior Senator Syed Mohsin Raza Naqvi, Minister for Religious Affairs & Interfaith Harmony Chaudhry Salik Hussain and Senator Saleem Mandviwalla. Saudi Ambassador in Islamabad Nawaf Saeed Al Malki was also present in the meeting.",
  "retrievedAt": "2025-08-10T19:59:34.764Z"
}
