{
  "title": "Widow’s Right to Marry: FOSPAH Leads the Way, and Lahore High Court Echoes",
  "link": "https://www.app.com.pk/national/widows-right-to-marry-fospah-leads-the-way-and-lahore-high-court-echoes/",
  "date_published": "2024-10-09T19:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): In a groundbreaking move for women’s rights, the Federal Ombudsperson for Protection Against Harassment of Women at the Workplace (FOSPAH) recently ruled in the matter of Javeria Yasir Vs. Civil Aviation Authority (CAA) that the CAA’s requirement for widows to submit an annual non-marriage certificate to retain employment was unconstitutional and discriminatory.\nJaveria Yasir has been working in CAA since 2013, after the death of her husband, under the Family Assistance Package Scheme, 2006. Under the 2014 CAA Service Regulations, Ms Yasir was asked to submit proof of her marital status, that she is still single, by sharing a non-marriage certificate annually, said in a Press Release issued here on Wednesday.\nThe Hon’ble Ombudsperson, Ms Fauzia Viqar, declared the requirement for a non-marriage certificate to be unconstitutional and against the spirit of Article 25 of the Constitution, which not only guarantees equality of citizens, it also imposes a duty on the State to take special measures for the empowerment of women and children. Section 26 of the Contract Act of 1872 also invalidates agreements that restrict marriage.\nBy abolishing this discriminatory policy, FOSPAH reaffirmed widows’ rights to remarry across the country and emphasized that no woman should be penalized for remarrying after her husband’s death.\nBuilding upon this momentum, the Lahore High Court (LHC) echoed FOSPAH’s stance in a recent ruling regarding the case of Zoya Islam Vs. Government of Pakistan, etc.\nThe appellant, Ms Zoya, the widow of the deceased employee, was appointed as Naib Qasid under the Memorandum/Order dated 03.01.2020 on a contract basis for five years in pursuance of the Family Assistance Package Scheme. She contracted a second marriage upon which her place of employment, Pakistan Mint, terminated her service relying on a notification issued by the Establishment Division, which stated, “After remarriage, the widow becomes ineligible to receive family pension.\nTherefore, this Division is of the view that her contract should be terminated from the date of her remarriage”. This was even though the memorandum had already been declared illegal by the Hon’ble Supreme Court of Pakistan in 2017.\nDelivered by a Division Bench, the LHC declared that a widow’s employment cannot be terminated due to her remarriage.\nThe decision emphasized that Islamic principles, the Constitution, and Shariah collectively support a widow’s right to remarry.\nThe LHC’s ruling not only reinforces FOSPAH’s earlier decision but also demonstrates the effectiveness of FOSPAH’s proactive approach to championing gender justice. With these landmark rulings, both FOSPAH and the LHC send a powerful message that gender-based discrimination, particularly against widows, will not be tolerated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:59:57.746Z"
}
