{
  "title": "Father-son exhibition at PNCA Islamabad celebrates cultural exchange",
  "link": "https://www.app.com.pk/national/father-son-exhibition-at-pnca-islamabad-celebrates-cultural-exchange/",
  "date_published": "2024-10-10T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):The Pakistan National Council of the Arts (PNCA) has hosted the concluding leg of a remarkable father-son art exhibition by internationally acclaimed Sri Lankan abstract artist Mueen Saheed and his son, Bilaal Raji Saheed.\nFollowing successful exhibitions at the Lahore Museum and a prominent gallery in Lahore, this exhibition marks the final stop of their highly anticipated three-show tour in Pakistan.\nThe exhibition has garnered widespread appreciation from the Pakistani public, art enthusiasts, and prominent collectors, said a news release.\nFederal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar graced the occasion as a chief guest and expressed his admiration for the thought-provoking artwork and its contribution to cross-cultural dialogue.\nIn his address, he emphasized the importance of such international exhibitions in strengthening artistic and cultural ties between nations.\nHe further invited Mueen Saheed to commemorate the strong friendship between Pakistan and Sri Lanka by creating a painting at a significant heritage site in Pakistan.\nMueen Saheed, celebrated for his abstract interpretations of cultural heritage, presented a body of work that explores the ancient cave and rock inscriptions of Sri Lanka.\nMerging these with elements of the famous Apsara paintings, his pieces resonated deeply with the audience. In a gesture of goodwill, Mueen also gifted one of his paintings to the Lahore Museum’s permanent collection, a contribution warmly acknowledged by the Director General of the museum.\nBilaal Raji Saheed, a graduate of the Royal College of Art in London, showcased a series of works that reflected his cultural musings and observations from his Sri Lankan heritage. His distinct artistic voice added an innovative dimension to the exhibition, offering a unique blend of modernity and tradition.\nThe Minister also expressed gratitude to Shaykha Mayassa bint Hamad Al Thani, Chairperson of Qatar Museums, for her patronage of the arts and her efforts in fostering cross-cultural exchanges between Pakistan and Qatar.\nHe noted the significance of the Saheeds’ exhibition in continuing this trend of cultural collaboration, with hopes for future exchanges both locally and internationally.\nThe Saheeds’ exhibition tour coincided with the prestigious Lahore Biennial, elevating the event’s profile this year.\nIn addition to their exhibitions, Mueen and Bilaal presented a series of engaging talks at notable institutions, including the National College of Arts (NCA) and Punjab University’s Faculty of Arts.\nThe exhibition at PNCA will run until October 20, 2024, accompanied by ongoing artist talks and workshops.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:58:22.974Z"
}
