{
  "title": "Australia, Pakistan mark 40 years of agriculture cooperation with bus art campaign",
  "link": "https://www.app.com.pk/national/australia-pakistan-mark-40-years-of-agriculture-cooperation-with-bus-art-campaign/",
  "date_published": "2024-10-10T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): Australia and Pakistan are celebrating four decades of cooperation in agriculture through a creative bus art campaign which promotes water conservation and sustainable farming.\nThe project aims to spread awareness among the public, highlighting efforts to address key agricultural challenges.\nTo mark 40 years of agricultural collaboration between Australia and Pakistan, the Australian High Commissioner Neil Hawkins and CEO of the Australian Centre for International Agricultural Research (ACIAR), Professor Wendy Umberger, launched a bus art initiative. This project features artwork designed to promote water conservation and improve food security.\nPublic buses in Punjab, Pakistan, will display cartoons by Nigar Nazar, an Australian alumna and well-known cartoonist. These cartoons aim to raise awareness about simple practices to achieve sustainable agriculture. They also highlight the impact of climate change, particularly issues like water scarcity. The campaign reflects the long-standing efforts of both Australian and Pakistani teams to enhance Pakistan’s agricultural sector.\nDuring the launch, High Commissioner Hawkins emphasized the strong partnership between the two countries in agriculture and water management. “For 40 years, Australia has been working with Pakistan to address critical issues in agriculture. This bus art project is a unique way to inspire action and connect with people in rural and urban areas across Punjab,” he said.\nACIAR CEO, Professor Umberger, praised the initiative for reaching a wide audience. She noted that ACIAR has collaborated with Pakistani farmers, scientists, and policymakers over the years to develop sustainable farming methods, improve food security, and support livelihoods, particularly in the provinces of Punjab, Sindh, and Balochistan. “This project goes beyond the fields. It enters the everyday lives of Pakistanis and reminds them of the importance of sustainable practices,” she added.\nThe initiative will involve five buses traveling through Punjab’s key agricultural regions, spreading important messages to thousands of commuters and pedestrians. The goal is to encourage water conservation and support sustainable farming, which is critical for addressing the challenges faced by Pakistan’s agriculture sector.\nCartoonist Nigar Nazar, who created the artwork for this project, is a graduate of the University of Canberra. She was recently honored with the Tamgha-i-Imtiaz, one of Pakistan’s highest civilian awards, for her contributions to art and social causes.\nThis collaboration between Australia and Pakistan highlights the importance of agriculture and water management in facing climate-related challenges, while using innovative methods to engage the public in these efforts.",
  "retrievedAt": "2025-08-10T19:58:22.379Z"
}
