{
  "title": "Committee advocates for enhanced research, quality standards and coastal erosion solutions",
  "link": "https://www.app.com.pk/national/committee-advocates-for-enhanced-research-quality-standards-and-coastal-erosion-solutions/",
  "date_published": "2024-10-10T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):The Senate Standing Committee on Science and Technology in a meeting held here Thursday advocated for enhanced research, quality standards and coastal erosion solutions.\nThe meeting, presided over by Senator Kamil Ali Agha, held a comprehensive discussion on the implementation status of the recommendations made during its meeting on September 25.\nThe Joint Secretary of the Ministry of Science and Technology updated the Committee members, informing them that all funds for the Science Expo have been refunded to the respective firms and organizations.\nSecondly, regarding the PSQCA’s submission of a report on the number of cases where fines were imposed, the Chair suggested providing a comprehensive report on the department’s current activities.\nHe expressed displeasure, stating that if the department remains inactive, it would be better to shut it down.\nSenator Kamil Ali Agha added that the PSQCA was established in 1996, and after 28 years, no consideration has been given to the total expenditure on 31 inspectors. He also inquired about their remunerations and suggested digitizing the entire system.\nRegarding the compliance report for standards and quality assurance in the cement sector, the Chair recommended that the Attorney General may handle it.\nSenator Kamil Ali Agha commented that this is not merely a matter of money; it concerns construction materials.\nHe emphasized that the government should ensure the protection of quality. Concerning the report on the restructuring process of STEDEC as IRADA, Senator Kamil Ali Agha also recommended expediting the process of restructuring STEDEC as IRADA.\nThe Committee held an in-depth discussion on the roles, functions, and performance of ongoing projects at the National Institute of Oceanography (NIO) and the Council for Works and Housing Research (CWHR).\nRepresentatives from NIO also highlighted its international footprint, collaboration, and government-to-government (G2G) projects.\nThe Chairman appreciated NIO’s achievements and recommended further expediting its efforts.\nDuring a detailed briefing by CWHR, the Chairman recommended the restoration of multi-storey buildings and emphasized that during rightsizing, employee rights must not be violated. Senator Kamil Agha also stressed the importance of conducting laboratory tests, noting that the quality of construction materials and water in affected areas is crucial for the future of property buyers.\nCiting the situation in Faisal Town, the Chairman pointed out that despite being developed and populated, the area suffers from water scarcity and poor material quality. He further recommended that testing facilities should be easily accessible and not located far away.\nThe Committee discussed the status of sea intrusion and erosion along the coastal belt with NIO and its allied agencies.\nThe Chairman emphasized the need for solutions to address erosion, noting that oceanography plays a crucial role, especially as climate change and environmental degradation worsen over time.\nHe further stressed that the unchecked dumping of filth into seawater is causing significant damage, and unless this issue is properly monitored and addressed, it could lead to severe consequences.\nSenator Nadeem Ahmed Bhutto highlighted that both Sindh and Balochistan are directly impacted. Acknowledging this, the Chairman added that the entire country is being affected by these issues, and close monitoring is essential.\nThe NIO representative mentioned that work on the retaining wall has already begun and specifically noted that the Sur Bunder area of Gwadar is being protected from sea intrusion by the retaining wall.\nDuring a detailed presentation on the implementation status of the National Science Technology Innovation Policy, 2022, the Secretary of the Ministry of Science and Technology recommended convening a joint meeting with the Higher Education Commission (HEC) due to the overlapping functions of both departments.\nThe Chairman informed the Committee that one of the key reasons for the failure of our departments is their frequent shutdown, while internationally, research departments are highly valued.\nHe further suggested that private universities and all sectors must prioritize research, with efforts focused on motivating the younger generation to engage in it.\nThe meeting was attended by Senator Husna Bano, Senator Dr. Afnan Ullah Khan Senator Nadeem Ahmed Bhutto, Senator Muhammad Aslam Abro, the Secretary of the Ministry of Science and Technology, and senior officials from the concerned department.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:59:11.704Z"
}
