{
  "article_id": "2025-07-23_6cd39e865e476cb31b35ec7fb339a038",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nha-clears-key-routes-in-landslide-hit-gilgit-baltistan/",
    "retrieved_at": "2025-08-27T09:57:48.239Z"
  },
  "metadata": {
    "title": "NHA clears key routes in landslide-hit Gilgit-Baltistan",
    "author": null,
    "date_published": "2025-07-23T09:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 283,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):In the wake of cloudburst-triggered floods and landslides in Gilgit-Baltistan, the National Highway Authority (NHA), continued its full-scale operation to restore traffic flow along multiple sections of the Karakoram Highway (KKH), which has been severely disrupted by debris and road blockages. According to the NHA spokesperson on Wednesday, acting swiftly on the directives of the Federal Minister for Communications Abdul Aleem Khan, teams are working round the clock, using heavy machinery to clear blocked routes. At Tatta Pani, where a landslide had recently disrupted traffic, the road has once again been cleared. The highway at this location had also been previously reopened just two days ago but was again blocked due to fresh landslides. The NHA teams have now re-established connectivity. The vital stretch between \"Loshi Bridge\" to Naran, has been fully cleared and opened to traffic. Similarly, roads in Chilas Main Bazaar and Babusar Bazaar have been reopened, restoring access to local residents and travelers, he added. Traffic restoration work is also actively underway at the landslide-affected \"Loshi Bridge\" area. Essential materials have already started arriving at the site, and the NHA has pledged to resume traffic at the earliest possible time. Furthermore, the Babusar Top to Chilas highway has been successfully reopened, while the Jaglot-Skardu Road was also cleared by NHA teams yesterday and is now open for two-way traffic. To maintain efficiency, all operations are being closely monitored from a control room established at the NHA Headquarters. The Chairman NHA Muhammad Sheheryar Sultan himself is supervising the entire clearance and rehabilitation process, ensuring real-time response and coordination. The spokesperson confirmed that road restoration efforts will continue unabated until all blocked routes across the region are fully functional.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}