{
  "article_id": "2025-07-23_f56059edb0110cb2351879a419cbb462",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-tops-global-erasmus-mundus-scholarships-list-for-4th-consecutive-year/",
    "retrieved_at": "2025-08-27T09:58:03.260Z"
  },
  "metadata": {
    "title": "Pakistan tops global Erasmus Mundus Scholarships list for 4th consecutive year",
    "author": null,
    "date_published": "2025-07-23T18:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 331,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP): Pakistan has once again secured the highest number of of scholarships in the European Union-funded Erasmus Scholarship Program, reaffirming its growing academic footprint on the international stage. According to official document, in the current year 2025,114 Pakistani students have been awarded scholarships, including 66 female scholars - representing nearly 58 percent of the national awardees. A total of 2,176 students from 137 countries around the world were selected under the European Union's Erasmus Mundus Scholarships, among which Pakistan was in first place. This marks the fourth consecutive year that Pakistan has emerged at the top among 137 participating countries. India followed with 96 scholarships, while Bangladesh secured third place with 95 recipients. Other notable countries include Mexico (93), Nigeria (75), and Brazil (73). The Erasmus Mundus Joint Master Degree programme offers fully-funded scholarships for joint master's degrees at leading universities across Europe. It covers tuition fees, travel, visas, accommodation, and living expenses, while providing students with valuable academic and research experiences across at least three European countries. The current batch of Pakistani recipients will pursue joint master's degrees, gaining exposure to cross-cultural learning, research, and internship opportunities. This year's result is also notable for its gender inclusivity, reflecting progress toward greater female representation in higher education. It may be noted that last year in 2024, 189 students from Pakistan received scholarships, including 100 male and 88 female scholars. Speaking in this regard, Chairman Higher Education Commission (HEC) Dr. Mukhtar Ahmed said that the youth should take advantage of this opportunity and keep getting information through the website. This is a good opportunity that can change the lives of Pakistani youth. \"These scholarships are entirely merit-based and open annually. I encourage students to stay informed through official channels and prepare thoroughly. This initiative has the power to transform lives,\" he said. Dr. Ahmed added that the HEC provides full support to students applying for international scholarship programs, ensuring access to global educational platforms for deserving youth across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}