{
  "article_id": "2025-07-23_af858a7f6cae9d7fa34c179ba4e8b113",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/anf-recovers-over-738-kg-drugs-in-11-operations-arrests-12-accused/",
    "retrieved_at": "2025-08-27T09:57:12.069Z"
  },
  "metadata": {
    "title": "ANF recovers over 738 kg drugs in 11 operations; arrests 12 accused",
    "author": null,
    "date_published": "2025-07-23T10:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):Anti-Narcotics Force (ANF ) while conducting 11 operations across the country managed to recover over 738 kg drugs worth more than over Rs 253 million and arrested 12 drug traffickers during two days. According to an ANF Headquarters spokesperson, in an operation at Allama Iqbal International Airport, cargo shed, 300 grams opium was recovered from a parcel booked for Canada. In second operation at Faisal Bus Terminal near Islamabad, 2.5 kgs heroin, 2.4 kgs hashish, & 1 kg ice were recovered from the possession of three suspects. ANF recovered 56 kgs hashish from a vehicle checked near University Road, Peshawar, and a drug trafficker was arrested. In 4th operation near Garh Mor Road, Muzaffargarh, 7 kgs ice was recovered from two suspects, traveling in a truck while in an operation near DG Khan Road in Loralai, 168 kgs heroin hidden for smuggling was recovered. In an operation against drug traffickers near Toll Plaza Road, Mansehra, 18 kgs hashish was recovered from a vehicle and a drug smuggler was rounded up. The spokesperson informed that in an operation, 2 kgs hashish and 7 kgs suspicious material were recovered from a parcel sent to Karachi at a Cargo Office in Rawalpindi. Near RCD Road, Hub, 24 kgs hashish was recovered from a vehicle and two accused arrested while in a operation near RCD Road, Hub, 64.8 kgs hashish was recovered from the secret cavities of a vehicle. ANF also arrested an accused during the operation. In a raid at a warehouse located on Adam G. Dawood Road, Karachi, 384 kgs potassium permanganate was recovered from the possession of a person. In 11th operation on National Highway, Hyderabad, 2 kgs opium was recovered from a passenger bus and a drug smuggler was arrested. The spokesperson informed that separate cases have been registered under the CNS Act against the accused.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}