{
  "article_id": "2025-07-23_d90e0c01ab70300feacaeebecc6ada2c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sherry-rehman-sounds-alarm-on-water-crisis-slams-outdated-systems-poor-planning/",
    "retrieved_at": "2025-08-27T09:58:29.769Z"
  },
  "metadata": {
    "title": "Sherry Rehman sounds alarm on water crisis, slams outdated systems, poor planning",
    "author": null,
    "date_published": "2025-07-23T16:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 463,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):Pakistan is on the brink of a major water crisis, and the country is dangerously unprepared to face it, Senator Sherry Rehman warned on Wednesday during a meeting of the Senate Standing Committee on Climate Change. \"Pakistan is not ready for any water crises,\" she declared, urging urgent reforms as climate-induced disasters escalate. Chairing the meeting, Senator Rehman painted a grim picture of the country's vulnerability to extreme weather events, particularly during this year's devastating monsoon season. Between June 26 and July 22 alone, 242 people have died and nearly 600 injured in rain-related incidents. \"Just in the last 24 hours, 21 people have died. This is climate change in motion,\" she said, calling Pakistan \"the number one climate-vulnerable country.\" The Senator criticized the unchecked construction on natural waterways, citing Saidpur Village in Islamabad and DHA Rawalpindi as examples where unplanned development directly contributed to the destruction and loss of lives. \"We cannot call this a natural disaster anymore. These are human-induced disasters, driven by poor planning and climate inaction,\" she emphasized. Search operations, she added, are still ongoing for a father and daughter swept away in DHA Rawalpindi. She also recommended restricting tourism in emergency-hit Gilgit-Baltistan. A significant part of the meeting focused on the country's dwindling groundwater resources. Officials admitted that no ministry had a complete map or data on groundwater extraction or surface water consumption. Senator Rehman called the absence of data and planning a \"totally fragmented and inadequate response,\" particularly in a country declared \"water scarce\" by the United Nations this year. \"Provinces must be told how many tube wells they are allowed to install,\" Rehman said, citing government figures showing tube wells increased from 160,000 in 1975-76 to 1.39 million in 2017-18. \"Meanwhile, other South Asian countries have city-level systems to monitor groundwater.\" Rehman also pointed to the lack of progress on basic water conservation tools, such as rainwater harvesting and recharge wells. \"The world is prioritizing this, but in Pakistan, we are stuck in inertia,\" she remarked. \"Land in Balochistan and Chitral is already turning barren, and provinces face acute shortages even after monsoons.\" Another major concern raised was the country's outdated early warning systems. \"We are still using a model from 1912, while the rest of the world is using real-time, AI-enabled alerts,\" Rehman said. She assured the committee would issue directives to provincial and district administrations to upgrade and implement stronger early warning mechanisms. The committee directed that provinces must submit up-to-date reports on groundwater status, recharge efforts, and tube well regulation in the next meeting. The session was attended by Senators Bushra Anjum Butt, Falak Naz, Syed Waqar Mehdi, and Shahadat Awan, along with senior officials from the Ministry of Climate Change, Ministry of Water Resources, and the Federal Flood Commission.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}