{
  "article_id": "2025-07-23_a33ad0df2852a33d62e53cb7a973a36e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-launches-daily-coordination-conference-to-tackle-monsoon-risks/",
    "retrieved_at": "2025-08-27T09:57:34.690Z"
  },
  "metadata": {
    "title": "NDMA launches daily Coordination Conference to tackle monsoon risks",
    "author": null,
    "date_published": "2025-07-23T10:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 258,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):The National Disaster Management Authority (NDMA) has initiated a series of daily National Monsoon Coordination Conferences at its National Emergencies Operation Center (NEOC), aimed at ensuring robust preparedness and a unified response to monsoon-related challenges across Pakistan. This daily conference is aimed at serving as a centralized platform to assess evolving monsoon threats such as flash floods, riverine flooding, urban inundation, landslides, and Glacial Lake Outburst Floods (GLOFs). Based on these assessments, timely arrangements and response strategies are formulated to mitigate the impact of anticipated hazards. The series of National Monsoon Coordination Conferences, convened at NDMA's National Emergencies Operation Center (NEOC), was initiated on the special directives of Prime Minister Muhammad Shehbaz Sharif. Senior representatives from Provincial and District Disaster Management Authorities (PDMAs/DDMAs), the Pakistan Meteorological Department (PMD), Rescue and Civil Defence units, Irrigation Departments, the Pakistan Telecommunication Authority (PTA), and various national and international humanitarian organizations participated in the sessions to strengthen preparedness and ensure a coordinated response to monsoon-related risks across the country. Each participating entity is encouraged to share its operational status, challenges, resource needs, and coordination issues to build a common operational picture and enhance inter-agency collaboration. The platform allows for identifying strengths and addressing weaknesses in real-time to streamline national response capabilities. NDMA reiterated its commitment to ensure round-the-clock coordination, timely dissemination of alerts, and proactive engagement of all stakeholders to minimize disaster risk and safeguard lives and infrastructure during the ongoing monsoon season. National Monsoon Coordination Conference will continue on a daily basis at NEOC throughout the monsoon spell.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}