{
  "article_id": "2025-07-23_133672b0ac85c739e7c70e3bf93470a2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-not-ready-for-any-water-crisis-sherry-rehman/",
    "retrieved_at": "2025-08-27T10:00:05.471Z"
  },
  "metadata": {
    "title": "Pakistan not ready for any water crisis: Sherry Rehman",
    "author": null,
    "date_published": "2025-07-23T12:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 678,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):Chairperson of Senate Standing Committee on Climate Change, Senator Sherry Rehman, convened the committee meeting on Wednesday to address the alarming scale of climate-induced disasters and Pakistan's growing vulnerability to extreme weather events. The committee took serious note of the monsoon devastation, outdated disaster response infrastructure, and rapid groundwater depletion that is exacerbating the country's water crisis, said a press release. Senator Rehman underscored that from June 26 to July 22, Pakistan has already lost 242 lives, while 598 people have been injured due to heavy monsoon rains. \"Just in the past 24 hours, 21 people have died, and 6 were injured. This is not a one-off tragedy-this is climate change in motion, and Pakistan is ranked number one in climate vulnerability,\" she stated. She condemned the unplanned construction on natural waterways, citing Saidpur Village and DHA Rawalpindi as examples where negligence led to lives lost and infrastructure destroyed. \"We cannot call this a natural disaster anymore. That absolves us of responsibility. These are human-induced disasters fueled by poor planning and inaction in the face of climate change,\" she remarked. Senator Rehman noted that search operations are still underway for a father and daughter swept away in DHA Rawalpindi. She stressed that tourist activity must be restricted in Gilgit-Baltistan, where emergency conditions continue. Sherry Rehman noted that no ministry could provide a map of Pakistan's groundwater extraction on any scale. Groundwater extraction and water scarcity were on the agenda of the Senate Standing Committee for Climate Change. The Water Resource Ministry was also struggling with answers on surface water consumption per capita, as well as how many tube wells we have working in the country for agriculture, and how many are recharging. No ability to map the scale of usage for irrigation or normal consumption. She noted, \"For a country that has been declared water scarce by the U.N. this year, no evidence of harvesting water in PSDP or other planning, especially while we go through a torrential monsoon. It was a totally fragmented and inadequate response.\" Senator Rehman further pointed out that Pakistan lacks a modern early warning system, despite the UN Secretary-General's repeated calls to treat early warning as a basic human right. \"We are still using a 1912 model to issue warnings. Meanwhile, the rest of the world is using real-time, AI-enabled systems,\" she said. Officials requested that the Senate Committee issue directions to the provinces to strengthen their early warning efforts, to which Senator Rehman assured full cooperation, stating that directives would be issued to both provincial and district administrations. Groundwater depletion was another key concern. She stated, \"Provinces must be told how many tube wells they are allowed to install. The number has increased so dramatically that groundwater is vanishing at an alarming rate.\" Officials informed the committee that Pakistan had 0.16 million tube wells in 1975-76, which grew to 1.39 million by 2017-18. In comparison, other South Asian countries have city-level systems to monitor groundwater decline, they noted. \"We are still relying on 2022 data-we need 2025 groundwater status updates,\" emphasized Senator Rehman. She directed all provinces to present up-to-date reports on groundwater conditions in the next meeting. She also expressed deep concern that no action is being taken to conserve rainwater, and no meaningful work is being done on recharge wells, a basic tool for climate adaptation. \"The world is prioritizing this, but in Pakistan, we are stuck in inertia,\" she added. \"There's no current status on water storage; institutions are merely engaging in dialogue while the ground realities worsen.\" Senator Rehman noted that land in Balochistan and Chitral has already turned barren, and that provinces face acute water shortages after every monsoon. Sherry Rehman directed that in the next meeting, provinces must bring updated figures and plans regarding groundwater recharge, tube well regulation, and rainwater harvesting. The meeting was attended by Senators Bushra Anjum Butt, Falak Naz, Syed Waqar Mehdi, and Shahadat Awan. Also present were senior officials from the Ministry of Climate Change and Environmental Coordination, the Ministry of Water Resources, and the Federal Flood Commission.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}