{
  "article_id": "2025-07-23_e5fcdc110587c0b482695058c9387b97",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sidra-foundation-hosts-two-day-exposure-visit-to-khanspur-for-working-professionals/",
    "retrieved_at": "2025-08-27T09:57:46.196Z"
  },
  "metadata": {
    "title": "Sidra Foundation hosts two-day exposure visit to Khanspur for working professionals",
    "author": null,
    "date_published": "2025-07-23T09:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 23 (APP):Sidra Foundation, a non-profit organization, in collaboration with Youth Parliament Pakistan, District Youth Office Abbottabad, and Galyat Development Authority (GDA), hosted a two-day exposure visit to Khanspur for working professionals. The event brought together youth entrepreneurs, clinical psychologists, and media professionals under one roof to provide them with a space for networking and a stress-free environment, said a press release issued here on Wednesday. Esteemed speakers included Rehan Khan, CEO of Sidra Foundation; Osama Nadeem, Chairman of Youth Parliament Pakistan; Maroof, an entrepreneur running her own initiative eHub; Syeda Yasmin, Newscaster at PTV Peshawar; Sidra, a clinical psychologist with the HIV/AIDS program; Sardar Yasi, CEO of Heaven Group; Wazeer Khan, CEO of Marketing Fawad Ali, social activist and entrepreneur; and others. Fun activities such as archery, balloon shooting, and cricket were also arranged to engage the participants. Each individual was given the chance to plant a sapling in the cricket ground under the GDA tree plantation drive on the final day of the two-day activity. A total of 150 saplings were planted. At the end, shields were distributed among the speakers and the winners of the various fun competitions. Certificates of participation were also given to all participants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}