{
  "title": "Thousands of jobs being created under climate ministry’s executed projects: Amin",
  "link": "https://www.app.com.pk/national/amin-climate-change-jobs/",
  "date_published": "2020-08-20T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): Special Assistant to the Prime Minister on Climate Change Malik Amin Aslam Thursday said thousands of jobs being created in the projects executed under the Ministry of Climate Change.\nAddressing a joint press briefing flanked by Federal Minister for Information and Broadcasting Shibli Faraz along with Advisor on Commerce Abdul Razzak Dawood, Minister of State for Climate Change Zartaj Gul, Minister for SAFRON and Narcotics Control Shehryar Afridi, Minister of State for Parliamentary Affairs Ali Muhammad Khan regarding the two years performance of the government, he said the initiatives taken by the government about climate change had earned appreciation for the country at international level.\nHe said Climate Change was a big challenge but with the efforts of Prime Minister Imran Khan taking up these challenges at United Nations forum with the strong commitment.\nHe said the ministry was working on five point agenda including tree plantation, clean and green index, protected areas, plastic bags and electric vehicles policy, adding that ‘Ten Billion Tsunami Tree Project’ was initiated with one billion trees from Khyber Pakhtunkhwa.\nHe said the programme was extended to seven units of the federation after formally issuing its PC-1 besides increasing the number of nurseries from 50 million to 300 million.\n“Currently, we had planted 500 million trees across the country and the ministry had allocated its 70 percent budget for this purpose,” he added.\nThe second part of the programme, the minister said, conversion of public transport to environment-friendly electric fuel, under which indigenous production of two wheeler rickshaw had been started.\nHe also added that quality improvement of vehicles’ fuel under shifting the system from Euro-2 to Euro-5 was also part of this initiative.\nMalik Ameen Aslam said the third section of the Clean and Green Initiative was imposition of ban on use of plastic bags which was started from Islamabad as currently it was being produced five billion in our country as compared to 20 million in 1999.\nHe said the ministry had provided 35 indicators to 20 cities of Punjab and Khyber Pakhtunkhwa under the Clean and Green Pakistan, he added.\nReplying a question, he said Ministry of Climate Change would upgrade the Islamabad Murghazar Zoo and in that regard, sufficient funds had been placed for it.",
  "retrievedAt": "2025-08-11T19:41:36.981Z"
}
