{
  "title": "M-3, two sections of M-4,M-5, Hazara Motorway, LSM major NHA projects completed during past two years",
  "link": "https://www.app.com.pk/national/nha-m-4m-5-hazara/",
  "date_published": "2020-08-20T05:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): National Highway Authority (NHA) striving for up-gradation of road infrastructure projects in the country has succeeded to complete several mega projects during the past two years.\nThe major road infrastructure projects accomplished during the tenure of the present government included among others Lahore -Abdul Hakeem Motorway (M-3), Sukkur-Multan Motorway (M-5) Havelian-Mansehra and Mansehra-Thakot section of Hazara Motorway, Gojra-Shorkot and Shorkot-Khanewal section of Pindi Bhattian-Multan Motorway (M-4) and Lahore-Sialkot Motorway, an official of National Highway Authority (NHA) told APP on Thursday.\nHe said that 230 km Abdul Hakeem Motorway (M-3) which was opened for traffic in March 2019 costing Rs148.65 billion passes through districts of Sheikhupura, Nankana Sahib, Faisalabad,Toba Tek Singh and Khanewal. The cities and towns located along M-3 include Lahore, Sheikhupura, Mangtanwala, Nankana Sahib, Bucheki, Jaranwala, Syedwala, Tandalyanlwala, Samundri, Mamon Kanjan, Muridwala, Toba Tek Singh, Rajana, Kamalia, Peer Mahal, Shorkot and Kot Islam, he said.\nThe NHA official said eight inter-changes, three service areas, 46 bridges, 60 underpasses, 201 cattle creeps and 705 culverts are built on M-3, he said adding that Intelligent Transport System (ITS) has been installed on M-3 for traffic management.\nThe official said that in November last year, 392 km Sukkur-Multan Motorway (M-5) , an important segment of China Pakistan Economic Corridor, was opened for traffic. The Multan-Sukkur Motorway has reduced travel time between Multan and Sukkur to a considerable extent.\nThe motorway, he said, would not only accelerate industrial growth but the agricultural sector will also be benefited at large and it would pave the way for socioeconomic uplift in south Punjab.\nAnother important road infrastructure project, 39 km Havelian-Mansehra section of the 118-km Havelian-Thakot motorway project was opened for traffic in November 2019, he said. The motorway section reduced the travel time between Islamabad and Mansehra by up to 2.5 hours, he said adding the controlled access motorway, part of the China Pakistan Economic Corridor (CPEC) would in future serve as main route for the commercial traffic between the two countries.\nThe Havelian-Mansehra section has two tunnels, 47 bridges, nine fly-overs, 143 underpasses and culverts, four toll plazas and one service area. The section has three inter-changes at Havelian, Abbottabad and Mansehra.\nMansehra-Thakot section of Hazara Motorway was opened for traffic in July this year on the eve of Eidul Azha. The 80-kilometer, Mansehra-Thakot Expressway is an extension of 40 km Havelian-Mansehra four-lane Motorway. As an access route towards Naran Valley and Gilgit-Baltistan, the facility is expected to boost tourism activity in the area.\nThe Gojra-Shorkot section of the M-4 was opened for traffic on February 4,2019 to promote regional trade, tourism and economic growth of the country under the China-Pakistan Economic Corridor (CPEC).\nThe Asian Development Bank provided $178 million in financing for the four-lane, access-controlled 61-kilometre motorway, while the Department for International Development (DFID) of the United Kingdom provided $92 million in grant financing. The Gojra-Shorkot section,has three interchanges at Toba Tek Singh, Warriyamwala and Shorkot while 21 underpasses, 39 subways are also a part of the project.\nAnother portion of the M-4 Shorkot-Khanewal Section of Faisalabad-Khanewal Motorway (M-4) was opened to traffic last year. With accomplishment of this section, all five sections of the Pindi-Bhattian-Multan Motorway have been accomplished and now the commuters can enjoy controlled access motorway journey from Peshawar to Sukkur.\nA 91-kilometre-long Lahore-Si­alkot Motorway (M-11) which became operational in March this year has reduced the total distance between both the cities from two and half hours to only 45 minutes.\nThe project has been completed by Frontier Works Organisation (FWO) on Built Operate Transfer (BOT) mode. The maintenance and operation of said motorway would remain with FWO for the next 25 years after which it would be handed over to the NHA.\nThe four-lane motorway has been completed at the cost of around Rs43 billion. There are 7 interchanges, 6 flyovers, 24 bridges, 22 underpasses, 13 subways and 274 culverts have been included in this project.\nThe motorway starts from La­hore where it is connected with eastern bypass and Ring Road while its first interchange is situated at Kala Shah Kaku, which joins it with N-5, commonly known as GT Road as well as the Lahore-Islamabad Motorway (M-2).\nBy virtue of the Lahore-Sialkot Motorway, the commuters can travel from Lahore to Sialkot in just 50 minutes. The Lahore-Sialkot Motorway has also reduced the traffic load on the Lahore-Islamabad M-2 Motorway and the GT Road.\nThe newly opened sections of motorways and highways would not only provide modern road facilities but also offer new economic opportunities to the people of the adjacent areas and play a catalyst role in progress of the local population.",
  "retrievedAt": "2025-08-11T19:41:32.714Z"
}
