{
  "title": "No rift in Pak-Saudi ties as strong economic, political, military cooperation continues: FO",
  "link": "https://www.app.com.pk/national/blasphemy-incidents-indian-premeditated-attempt-to-incite-communal-violence-target-muslims-fo/",
  "date_published": "2020-08-20T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP):The Foreign Office on Thursday denied any rift between Pakistan and Saudi Arabia, saying their relations had “strong economic, political, security and military cooperation at all levels”.\nForeign Office Spokesperson Zahid Hafeez Chaudhri, at a weekly press briefing here, said “Relations between the two brotherly countries have continued to grow over time.” They enjoyed unique relations deep rooted in historic, religious, cultural and social ties.\nThe spokesperson said Pakistan and Saudi Arabia not only closely cooperated with each other at international fora, but always stood by each other at times of need also.\n“Pakistan values Saudi Arabia’s important role in the OIC Contact Group on Jammu and Kashmir,” he said, adding the long-term strategic relationship between the two brotherly countries was time-tested, which would continue to grow to mutual benefit.\nThe FO spokesperson rejected the impression that the current visit of Foreign Minister Shah Mehmood Qureshi was taking place in the backdrop of Saudi Arabia’s demand to Pakistan to repay its loan.\n“The foreign minister’s visit to China is not linked to Pakistan’s relations with Saudi Arabia. It is a part of our continued strategic engagement with China. The foreign minister is leading Pakistan delegation to the Second Round of the China-Pakistan Foreign Ministers’ Strategic Dialogue,” he said.\nZahid Chaudhri said Pakistan had an abiding commitment to defending the sanctity of Harmain Sharifain (Two Holy Mosques), and remained firmly committed to the sovereignty and the territorial integrity of Saudi Arabia.\nAsked if former Chief of Army Staff Gen Raheel Sharif was still working with the military alliance in Saudi Arabia, he confirmed: “There is no change in that and there is no rift in Pakistan-Saudi Arabia relations that could lead to any such situation.”\nOn the Middle East, he said peace and stability of the region remained Pakistan’s key priority, stressing that “there is no change in Pakistan’s principled position on Palestine”.\n“We have an abiding commitment to the full realization of the legitimate rights of the Palestinian people, including the right to self-determination.”\nHe said for a just, comprehensive and lasting peace, Pakistan consistently supported a two-state solution in accordance with the relevant United Nations and OIC resolutions as well as international law, with pre-1967 borders and Al-Quds Al-Sharif as the capital of Palestine.\nOn persistent ceasefire violations by India at the Line of Control, he said this year alone, there had been 2,027 such incidents resulting in 176 injuries and 16 martyrdom of innocent people on the Pakistani side.\n“It is unfortunate that by such acts India has been imperiling regional peace and stability. By increasing the ceasefire violations, the Indian government is trying to divert attention from its internal issues as well as from the gross human rights violations in the Indian Illegally Occupied Jammu and Kashmir,” he said.\nTo a question on update on Indian spy Kulbhushan Jadhav’s case, the FO spokesperson said the Islamabad High Court had its next hearing on the 3rd of September.\n“Since the review and reconsideration in this case will be provided by the Pakistani courts and to be precise in this case the Islamabad High Court, we have been calling upon the Indian government and urging them to cooperate with the courts in Pakistan,” he said.\nThe spokesperson said rather than indulging in blame game, India should come forward and cooperate with the Pakistani courts so that full effect could be given to the judgment of International Court of Justice.\nTo a question whether Pakistan had submitted its new political map to the United Nations and had any plans to share it with Google maps, he said, “I can confirm that the division concerned within this ministry and all other stakeholders are taking all necessary steps in this regard to ensure that only the official political map of Pakistan is used locally and internationally.”\nRegarding the political map, he said there was no change in Pakistan’s historical position.\n“Pakistan has always believed and continues to believe that the IIOJK is not a part of India. And by drawing an international border between India and the IIOJK, we have rejected the illegal Indian claim on Jammu and Kashmir,” he said.\nThe Indian occupation of Junagarh and Manavadar, he added, was illegal and Pakistan’s claim in that regard was based on legal and historical facts.\n“The Instrument of Accession to Pakistan by the Nawab of Junagarh is a legal reality that cannot be denied,” he said.",
  "retrievedAt": "2025-08-11T19:41:29.623Z"
}
