{
  "title": "Pakistan on course to become Islamic welfare state: PM",
  "link": "https://www.app.com.pk/national/pakistan-islamic-welfare-state/",
  "date_published": "2020-08-20T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): Prime Minister Imran Khan on Thursday said the pro-people measures like extension of health insurance facility to entire population of Khyber Pakhtunkhwa, manifested that Pakistan was on the course to become an Islamic welfare state.\nAddressing the agreement signing ceremony here between the KP government and State Life Insurance Corporation, the prime minister said any country taking the responsibility of its people would be called a civilized state.\nUnder the agreement, an annual health insurance cover of Rs 1 million each would be provided to around six million families of the province enabling the whole 40 million population to avail free medical treatment at over 250 public and private hospitals across the country.\nKP Health Secretary Syed Imtiaz Hussain Shah and SLIC Chairman Dr Riaz Ahmed Memon signed the agreement while the prime minister along with KP Governor Shah Farman and Chief Minister Mahmood Khan witnessed the ceremony.\nFederal ministers Pervaiz Khattak, Asad Umar, Ali Amin Gandapur and Murad Saeed, Special Assistants to the PM Lt Gen (Retd) Asim Saleem Bajwa and Shahbaz Gill, provincial cabinet members and senior officials attended the ceremony.\nThe prime minister congratulated the KP government for taking the remarkable initiative, which, he believed, would also compel other federating units to follow the suit consequent to the possible public pressure.\nHe said he would ask the Punjab and Balochistan governments too to provide health insurance cover to their entire population which would ultimately put the opposition-led Sindh government under pressure to extend the facility to its people.\nHe said no service could match supporting a cash-starved poor family having a member with a serious disease. The illness was among the top factors to push a stable family down below the poverty line, he added, recalling his difficult experience of getting treated her cancer patient mother.\nThe prime minister said the launch of Sehat Insaf Card for the entire population by the KP government amidst the financial constraints due to the COVID-19 pandemic was highly laudable.\nHe said besides benefiting the people, the massive health insurance cover would also beget competitive environment to help improve the service delivery at public and private hospitals.\nHe said the government had already incenitivised the health sector by allowing duty free import of medical equipment, besides announcing reduced prices for the evacuee properties to establish hospitals and educational institutions.\nThe prime minister asked the KP government to provide Sehat Insaf Card to the people instead of using the national identity card for the purpose as it would help compilation of data and discourage the pilferage.\nIn his remarks, KP Health Minister Taimur Saleem Jhagra said the provincial government would spend Rs 18 billion to provide health insurance facility to entire 40 million population across all 35 districts. He said the six-phased programme would complete by January 31, 2021.\nThe minister said of Rs 1 million cover, Rs 200,000 had been specified for emergency, maternity services, fracture and general surgery; Rs 400,000 for cardiovascular, diabetes, kidney, basic cancer and neurological diseases; and the rest Rs 400,000 for cancer, chemotherapy, kidney transplant, accident and emergency.",
  "retrievedAt": "2025-08-11T19:41:37.856Z"
}
