{
  "title": "OIC organs chart way",
  "link": "https://www.app.com.pk/national/oic-organs-chart-way/",
  "date_published": "2022-01-06T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): COMSTECH-the OIC Standing Committee on Scientific and Technological Cooperation Thursday held a virtual meeting of its steering committee for implementation of the Science Technology Innovation (STI) Agenda 2026, mainly to chart the way forward for new initiatives.\nThe agenda of the meeting was to review the progress on the implementation of STI Agenda 2026 during the last two years and to discuss new initiatives for the promotion of Science, Technology and Innovation (STI) in the light of the decisions of the 2nd OIC Science and Technology Summit held last year.\nThe meeting was attended by all 12 members of the steering committee, including the Assistant Secretary General OIC for Science and Technology, the Coordinator General COMSTECH, the Director General of, OIC (S&T), COMCEC, IAS, IOFS, SESRIC, SMIIC, and senior officials from ICCIA, ICYF, IsDB, ICESCO, and OIC-CERT.The Coordinator General COMSTECH Prof Dr M Iqbal Choudhary welcomed the participants and expressed appreciation for their continued cooperation with COMSTECH and with each other for the implementation of the STI Agenda 2026.\nDr Choudary highlighted the importance of this meeting both in terms of reviewing the progress of the past four years since the approval of STI Agenda, and its importance in charting the way forward in the light of the Abu Dhabi declaration.\nThe Assistant Secretary General OIC for S&T Ambassador Askar Mussinov addressed the meeting and shared the vision of the OIC as elaborated in the Abu Dhabi declaration of the 2nd Summit.\nHe emphasized the need for identifying ways to expand the impact of STI Agenda by increasing the participation of member states in the various initiatives of the steering committee. He stressed the need of an increased focus on enhancing the scientific and technical capacities of the less developed member states, particularly in Africa.\nThe members of steering committee appreciated the efforts of COMSTECH for coordinating the implementation of the STI Agenda and preparing the various reports on the progress and the way forward.\nIt was decided that the steering committee would constitute expert groups on various disciplines to review the efforts of the committee and also to provide expert advice to member states in respective disciplines.\nIt was decided that an online platform will be established that will contain updated information on ongoing and planned initiatives of members of the steering committee.\nThe matrix of proposed actions for the next few years was presented and explained by the Coordinator General COMSTECH.\nThe participants of the meeting discussed it and showed their willingness to participate in selected thematic actions.\nThe meeting concluded with the closing remarks by the Assistant Secretary General OIC and the Coordinator General COMSTECH with the resolve to enhance cooperation and identify the ways and means for increasing the participation of member states in the new initiatives of the steering committee.",
  "retrievedAt": "2025-08-11T14:01:53.195Z"
}
