{
  "title": "HEC launches series of progress review meetings, trainings for QECs",
  "link": "https://www.app.com.pk/national/hec-launches-series-of-progress-review-meetings-trainings-for-qecs/",
  "date_published": "2022-01-06T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 (APP): Keeping up with its continuing efforts to implant quality culture in the Degree Awarding Institutions (DAIs), the Quality Assurance Agency (QAA) of Higher Education Commission has launched a series of progress review meetings as well as trainings for heads and officers of all Quality Enhancement Cells (QECs) of DAIs across the country.\nIn this connection, a three-day session for the first group of QEC heads and officers from 21 HEIs of Islamabad, Rawalpindi and Azad Kashmir was held at Air University, Islamabad.\nExecutive Director HEC, Dr Shaista Sohail, along with Vice Chancellor Air University, Javaid Ahmed, graced the opening ceremony of the session.\nThe Executive Director HEC acknowledged the role of QAA and QECs in sensitising the DAIs for building upon quality culture in the academic sphere.\nShe emphasized the need for strengthening Internal Quality Assurance mechanism to ensure provision of quality education.\nThe first day was followed by an interactive session on “how to strengthen Internal Quality Assurance” and a discussion on how the performances of QECs could be enhanced.\nThe second day session was focused on “Verification of Research Publications and HJRS” by representatives of Research and Innovation Division of HEC. This was followed by a session on Plagiarism Policy and modalities involved in obtaining NOCs for MS/MPhil and PhD programmes.\nThe third and final day witnessed a training of QECs on modalities of Institutional Performance Evaluation, MS/MPhil and Equivalent Programme Review and PhD Programme Review and Yearly Progress Report of QECs.\nIt is pertinent to note that QECs have been established in 221 DAIs in the country to strengthen the Internal Quality Assurance mechanism. QAA annually assesses these QECs for their performance against defined parameters.\nAnd, in order to build their capacities and overview their progress, QAA annually conducts the progress review meetings and trainings for all QECs. Whereas, for External Quality Assurance (EQA,) different mechanisms have been devised at institutional level as well as programme level.",
  "retrievedAt": "2025-08-11T14:01:51.251Z"
}
