{
  "title": "Pakistan remains committed, stands in solidarity with Kashmiris: Ambassador Janjua",
  "link": "https://www.app.com.pk/national/pakistan-remains-committed-stands-in-solidarity-with-kashmiris-ambassador-janjua/",
  "date_published": "2022-01-05T19:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Pakistan’s Ambassador to Belgium, Luxembourg and European Union Zaheer A. Janjua on Wednesday said that Pakistan remained fully committed and stood in solidarity with its Kashmiri brothers and sisters.\n“We will continue to extend all moral, political and diplomatic support to the Kashmiris till the realization of their inalienable right to self-determination, in accordance with the UNSC Resolutions and their wishes,” Ambassador Janjua said in his message on the occasion of Kashmiris’ Right to Self-Determination Day.\n“January 5, marks the 73rd anniversary of the United Nations commitment to the resolution of the Jammu and Kashmir Dispute through the democratic process of free and impartial plebiscite under its auspices,” he added.\nAmbassador Janjua said that the Resolution of the United Nations Commission on India and Pakistan of January 5, 1949, guaranteed the inalienable right of self-determination to the people of Kashmir, which had been denied due to India’s blatant disregard for the international law and the UN Resolutions.\n“With the deployment of 900,000 troops, India has turned the occupied territory into the largest open-air prison and the most militarized zone in the world.\n“The continued surge in oppression of the people of IIOJ&K through arbitrary detentions, rape and torture, custodial murder, enforced disappearances and extra-judicial killings in staged encounters and cordon and search operations has resulted in the martyrdom of over 500 Kashmiris since August 5, 2019. This is a clear manifestation of the abhorrent behavior and moral bankruptcy of the Indian state,” he added.\nAmbassador Janjua said that since August 5, 2019, India had been brazenly pursuing further consolidation of its illegal occupation, including through land confiscation, influx of non-Kashmiris and creation of alien settlements in the disputed territory.\n“These actions are a flagrant violation of the international law, especially the UN Charter, relevant UNSC Resolutions and the Fourth Geneva Convention,” he remarked.\nAmbassador Janjua pointed that during the last seven decades, Kashmiris have rendered unparalleled sacrifices for the realization of their right to self-determination promised to them by the United Nations.\n“Any amount of Indian atrocities cannot deter or subjugate the Kashmiri people. We are confident that their sacrifices would bear fruit very soon,” he stressed.\nAmbassador Janjua called upon the international community, including the United Nations, the European Union, human rights organizations and the global media, to take full cognizance of the aggravating situation in IIOJK and hold India accountable for egregious human rights violations and serious crimes against humanity in the occupied territory.\n“I encourage you all to be the voice of the Kashmiris in exposing Indian atrocities in IIOJ&K and elicit a strong international response,” he stressed.",
  "retrievedAt": "2025-08-11T14:01:59.736Z"
}
