{
  "title": "PM for early completion of RUDA, CBD, Nullah Lai Expressway projects",
  "link": "https://www.app.com.pk/national/pm-for-early-completion-of-ruda-cbd-nullah-lai-expressway-projects/",
  "date_published": "2022-01-06T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): Prime Minister Imran Khan on Thursday called for early completion of the government’s flagship urban development projects including RUDA and CBD in Lahore and Nullah Lai Expressway in Rawalpindi.\n“Urban development through modern real estate projects like Ravi Urban Development Aurhority (RUDA), Central Business District (CBD) Walton and Nullah Lai Expressway are the government’s flagship initiatives and should be put on fast track for early completion”, he said while chairing a review meeting on RUDA and CBD.\nThe Prime Minister said it was for the first time in country’s history that dead capital in the form of unutilized public land was being converted into valuable asset for wealth creation through these innovative projects.\n“These projects will not only provide employment opportunities but will also cater to the needs of growing urban population”, he added.\nEarlier the Prime Minister was briefed that CBD has planned revenue generation through the auction of 07 mix use commercial plots in Lahore downtown; the construction of Burj Al-Jinah, Pakistan’s tallest skyscraper; the construction of two premium residential towers and a 500-bed hospital at Bab-e-Pakistan; the construction of CBD Square and Walton Road Flyover; and the construction of Classic Aviation Museum for legacy retention of Walton Airport.\nMoreover, it was told that developmental work was in top gear on Ravi River Waterfront Development, establishment of Industrial Estate; and the development of Saphire Bay and Ravi Chahar Bagh Society.\nThe Prime Minister was also apprised that an effective awareness campaign through media has been launched to fetch maximum revenue through local and foreign investment in these landmark projects.\nThe Prime Minister directed the authorities concerned to clear all legal hiccups at the earliest to attract as many investors as possible.\nThe meeting was attended by Finance Minister Shaukat Tarin, Information Minister Ch. Fawad Hussain, Special Assistant to PM on Political Communication Dr Shehbaz Gill, Chairman Naya Pakistan Housing and Development Authority (NAPHDA) Lt. Gen. ® Anwar Ali Haider and senior officers concerned.\nPunjab Housing Minister Malik Asad Khokhar, Punjab Local Government Minister Mian Mehmood ur Rasheed, Advisor to CM Punjab Dr Salman Shah, Spokesperson to CM Punjab Hassan Khawar, Chief Executive Office (CEO) RUDA Imran Amin and other senior officers from Punjab joined the meeting via video link.",
  "retrievedAt": "2025-08-11T14:01:52.164Z"
}
