{
  "title": "Govt committed to protect public health, environment from impacts of chemicals: Zartaj",
  "link": "https://www.app.com.pk/national/govt-committed-to-protect-public-health-environment-from-impacts-of-chemicals-zartaj/",
  "date_published": "2022-01-06T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): Minister of State for Climate Change Zartaj Gul Thursday said the incumbent government is committed to protect public health and environment from devastating impacts of toxic chemicals and hazardous waste materials through their management in scientific manner.\nAddressing a national event here, the state minister noted that management of hazardous waste materials in improper and unscientific manner over the years in the country and their collection, treatment, and disposal of waste material had been causing significant harm to human health and the environment.\n“But, now in the light of the PM Imran Khan’s vision for clean and green Pakistan, we have launched efforts for implementation of an overarching project for strengthening national capacity for chemical and hazardous waste management in a way that meets global guidelines to regulate the practice of hazardous-waste management for protection people and the environment of the country,” Zartaj Gul Wazir revealed.\nShe explained that hazardous wastes can take the form of solids, liquids, sludges, or contained gases, and they are generated primarily by chemical production, manufacturing, and other industrial activities.\n“However, we understand that improper hazardous-waste storage or disposal frequently contaminates surface water and groundwater supplies as harmful water pollution and can also be a source of dangerous land pollution.\nThe state minister for climate change highlighted, “People settled in homes built around old and abandoned waste disposal sites may be in a particularly vulnerable position.\nWhile addressing the event “National Inception Workshop for the Project on Strengthening of National Legislation and Capacity Building of Stakeholders for Sound Chemicals and Hazardous Waste Management in Pakistan”, Climate Change Ministry Secretary Captain (R) Sikander Qayyum,\ntold participants that the climate change ministry in collaboration with United Nations Environment is implementing the project that aims to effectively implement he international conventions including Basel, Rotterdam, Stockholm and the Minamata for management of environmentally-harmful chemicals and hazardous materials in a scientific way.\nThe event aimed to sensitise all the relevant stakeholders from national and international government and non-governmental organisations and industrial and educational sectors on the importance of the project today here at a local hotel, the secretary added.\nSyed Mujtaba Hussain, Senior Joint Secretary (International Cooperation), Ministry of Climate Change said, “Chemicals and hazardous wastes possess a potential threat to human health and the environment in many ways.\nThese chemicals and hazardous wastes are mostly non-degradable, persistent in nature, can be biologically magnified, are highly toxic and even harmful at very low concentrations.”\nDeputy Director (Chemical) and National Project Coordinator, Dr. Zaigham Abbas said important work was currently being carried out under the United Nations Environment Programme (UNEP) Special Programme for institutional strengthening.",
  "retrievedAt": "2025-08-11T14:01:48.073Z"
}
