{
  "title": "Govt fulfilling its promise of low cost housing for poor, middle classes: PM",
  "link": "https://www.app.com.pk/national/govt-fulfilling-its-promise-of-low-cost-housing-for-poor-middle-classes-pm/",
  "date_published": "2022-01-06T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): Prime Minister Imran Khan on Thursday said that with the provision of 12,400 low-cost and quality apartments to residents of Islamabad Kachi Abadis (slums) for the first time in country’s history, the government was fulfilling its promise of low-cost housing for the poor and middle classes.\n“Loans of Rs. 38 billion have been provided to people for the construction of their own houses,” Imran Khan said while presiding over the meeting of National Coordination Committee on Housing Construction and Development.\nFederal Ministers Shaukat Tarin, Ch. Fawad Hussain, AJK Prime Minister Sardar Abdul Qayyum Khan Niazi, Minister of State Farrukh Habib, Special Assistant to PM Dr. Shehbaz Gill, Governor State Bank, AJK Ministers Sardar Tanvir Ilyas, Khawaja Farooq, Chairman Naya Pakistan Housing and Development Authority and senior officers attended the meeting.\nThe meeting was told that the Capital Development Authority (CDA) and Naya Pakistan Housing Authority will provide subsidy for the flats in Islamabad to keep the monthly installments at minimum level. The flats will have all civic facilities.\nThe Prime Minister directed to construct a cricket stadium of an international standard in Islamabad.\nHe also directed for the development of commercial buildings at government residences in Islamabad’s expensive sectors through public-private partnership.\nThe meeting was told that with the receipt of loan applications worth over Rs. 6 billion during the last two weeks alone, an exceptional increase was being witnessed in the average percentage of bank loans.\nThe Prime Minister said that boundaries of all the cities should be specified to check the unorganized expansion and protect green areas.\nHe said that the huge potential of tourism in Azad Jammu and Kashmir should be explored and exploited.\nThe Prime Minister also called for making strict regulations to curb illegal constructions in Azad Kashmir.\nThe meeting was told that the AJK government will provide land worth Rs. 5.6 billion for the construction of houses for migrants. In the first phase 1300 families will be provided with houses.\nThe Prime Minister directed for the early construction of quality and low cost residences for migrants from the Illegally Occupied Jammu and Kashmir (IIOJK).\nThe meeting was told that with 63% area of AJK consisting of forests, 56.5% of the total AJK territory comprised public land. Land-use mapping of 10 districts of AJK had been completed.\nThe Prime Minister directed to take all possible measures for the protection of forests and their natural growth.",
  "retrievedAt": "2025-08-11T14:01:49.496Z"
}
