{
  "title": "Progress on Water Governance Project discussed at PCRWR",
  "link": "https://www.app.com.pk/national/progress-on-water-governance-project-discussed-at-pcrwr/",
  "date_published": "2022-04-19T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): A delegation from UK’s Foreign Commonwealth and Development office (FCDO) and International Water Management Institute (IWMI) Tuesday visited Pakistan Council of Research in Water Resources (PCRWR), Islamabad to discuss the Water Governance Project (WRAP).\nHead Climate and Resilience Group, British High Commission, Islamabad, Ms. Pauline Seenan briefed the participants about the project objectives and focus areas of the project.\nShe discussed briefly about the three components of the project with a special focus on water accounting system at pilot scale in Islamabad and Punjab in line with Pakistan National Water Policy 2018 and early drought warning and crop insurance system (EDWCIS).\nSpeaking on the occasion, Chairman PCRWR, Dr. Muhammad Ashraf shared his experience and briefed the guests about the PCRWR and IWMI contribution towards the instrumentation of canals by installing telemetry system with the generous funding of USAID.\nHe shared the lesson learned in the flow measurements of main canals and conflicts resolution among the provinces of Pakistan under Water Apportionment Accord 1991.\nHe briefly discussed the DaaS (Data as a Service) concept and emphasized the need of building of trust among the provinces and involvement of stakeholders in water distribution.\nHe also described about the ongoing project of PCRWR with Capital Development Authority (CDA) in which PCRWR is accounting surface and groundwater balance in the ICT area.\nUK Development Adviser Punjab, Ms. Sana Zia gave a brief about the pilot area of the WRAP and how they are going to implement the project in Punjab.\nDr. Muhammad Ashraf thanked the participants for their visit to PCRWR and hoped such initiatives will help strengthen water governance system.",
  "retrievedAt": "2025-08-11T14:43:40.635Z"
}
