{
  "title": "Lawmakers for concerted efforts to uplift agriculture sector",
  "link": "https://www.app.com.pk/national/lawmakers-for-concerted-efforts-to-uplift-agriculture-sector/",
  "date_published": "2022-04-19T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): Lawmakers in the National Assembly here on Tuesday asked the government to make concerted efforts for uplift of the country’s agriculture sector and address the problems of farming community.\nSpeaking on a point of order Rao Muhammad Ajmal Khan of the Pakistan Muslim League-Nawaz (PML-N) urged the government to announce incentives for the agriculture sector and said” Sincere efforts should be made to address the problems of the farmers.”\nShaikh Rohale Asghar of PML-N while congratulating the Raja Pervaiz Ashraf for being elected as new speaker of the National Assembly said that steps should be taken for the supremacy of the parliament.\nRana Muhammad Ishaq Khan said it was the prime responsibility of the government to give due attention towards improving the agriculture sector, keeping in view the hardship being faced by the farmers.\nHe was of the view that there should be a smooth supply of fertilizer to farmers for the sector playing a crucial role in strengthening of the national economy.\nDr. Muhammad Afzal Khan Dhandla of Pakistan Tehreek-e-Insaf (PTI) said farmers of the country had been ignored by the past government that failed to provide fertilizer to them on cheaper rates.\nMehar Irshad Ahmad Khan of Pakistan Peoples Party Parliamentarians (PPPP) hoped that the government would take required measures to tap the country true potential in agriculture sector, stressing the need for making a parliamentary committee for uplift this sector that was considered backbone of the national economy.\nSpeaking on point of order Ali Gohar Khan Baloch congratulated the Pervaiz Ashraf for assuming the office of Speaker National Assembly.\nHe said former deputy speaker Qaism Khan Suri bulldozed the entire legislation during his tenure and passed many bills despite non-presence of required members.\nThe PTI has resorted to politics of agitation and wanted to push the country towards anarchy, he said.\nHe alleged that former prime minister Imran Khan was imposed through a conspiracy. The then prime minister Nawaz Sharif conducted nuclear tests in 1998 by refusing $ 5 billion package offered by US President Bill Clinton, he added.\nDr Shahnaz Naseer Baloch said the coalition government should also join hands to address hosts of problems being faced by the people of Balochistan. The past government has miserably failed to deliver in all sectors despite tall claims, she said.",
  "retrievedAt": "2025-08-11T14:43:39.892Z"
}
