{
  "title": "Education Ministry engages varsities to promote STEAM learning in schools",
  "link": "https://www.app.com.pk/national/education-ministry-engages-varsities-to-promote-steam-learning-in-schools/",
  "date_published": "2022-04-19T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): The Ministry of Federal Education and Professional Training (MoFEPT) has launched an initiative for improving learning outcomes in science, technology, engineering, arts, and mathematics (STEAM) in middle and high schools across the country to provide a chance to the school students to be university-ready.\nAs a step forward in this regard, the Education Ministry engaged eight renowned higher education institutes by signing memorandum of understandings (MoUs) here on Tuesday, according to a press release.\nThe institutes include National Textile University, Faisalabad, NFC Institute of Engineering & Fertilizers Research, Faisalabad, NFC Institute of Engineering & Technology, Multan, Pakistan Institute of Fashion Design, Lahore, Federal College of Education, Islamabad, Allama Iqbal Open University, Islamabad, Quaid-e-Azam University, Islamabad, and National Skills University, Islamabad.\nFederal Secretary Education Naheed S. Durrani, vice chancellors along with other officials of these universities and Malala Fund’s Pakistan Director Javed Ahmed Malik were present at the MoUs signing ceremony.\nThe education secretary on the occasion said, “Universities, with their expertise and resources such as qualified faculty members, laboratories, maker-spaces, studios, larger academic ecosystem, and a significant geographic spread of student population, present a unique opportunity that the Ministry is keen to leverage to advance STEAM education at the school level.”\nTheir aspiration, she added, was for 100,000 schoolchildren and 5,000 teachers to be directly impacted by the collaboration within the first year of the partnership.\nThe education secretary mentioned that a number of Pakistani universities already had interaction and outreach programmes targeting schools. “These range from adopting or running K-10 schools to hosting summer camps and engineering admission preparation courses. However, there is no established framework for university-school collaborations,” she added.\nAdditional Secretary Education Mohyuddin Ahmad Wani said it was for the first time in Pakistan that in line with the best international practices a framework of university-school engagements had been developed with the specific objective to target improvement in STEAM learning.\n“This framework is designed to ensure that our girls are not left behind in the pursuit of modern education,” he commented.\nThe vice-chancellors from the partner universities have welcomed this move as they believe it will provide a chance to the school students to be university-ready. In the long run, such programmes are also likely to strengthen the universities’ outreach and enrich their communities by attracting more students from diverse backgrounds to their STEAM programs.\nThe initiative is part of the STEAM Pakistan intervention for which Malala Fund is also providing support to the Federal Ministry of Education and Professional Training. As part of this support, a policy unit, led by Pak Alliance for Science & Math (PAMS) has also been established in the ministry to provide technical assistance to the government.\nJaved Malik, in his remarks, underlined the need to engage high schools with a range of players including industry leaders, universities, science promotion bodies as well as media and CSOs to help promote science education in the society.\n“If provided, the elements missing in high school education such as effective lab usage, remedial education, art, and sports have the potential to transform the learning experience of students, especially girls,” he added.",
  "retrievedAt": "2025-08-11T14:43:39.927Z"
}
