{
  "title": "Justice prevails in Pakistan; says Sri Lankan envoy",
  "link": "https://www.app.com.pk/national/justice-prevails-in-pakistan-says-sri-lankan-envoy/",
  "date_published": "2022-04-19T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): Sri Lanka’s High Commissioner to Pakistan Vice Admiral Mohan Wijewickrama RSP VSV ndc on Tuesday said the Anti Terrorism Court had given a landmark decision in Sri Lankan citizen Priyantha Kumara’s lynching case.\nAddressing a press conference along with former Prime Minister’s Special Representative for Interfaith Harmony and Middle East and Pakistan Ulema Council Chairman Hafiz Tahir Mehmood Ashrafi here in the embassy, he said, “Justice prevails in Pakistan.”\nHe said during the entire process of trial and tribulation, the most inspiring thing was that the whole Pakistani nation was on one page and condemning the Sialkot’s sad incident in the strongest terms.\nHe thanked the government and judiciary for taking the case to a logical conclusion in a short span of time.\nHe said the government of Sri Lanka was quite satisfied with the court decision and it had further cemented the 75-year old bilateral relations between the two countries.\nMeanwhile, Tahir Ashrafi said Pakistan was totally against the culture of intolerance, extremism and terrorism and it would not help promote these inhuman acts at all costs in the country.\nExpressing gratitude’s to the government, judiciary and security institutions, he said Pakistan had fulfilled its promise which it made with the government of Sri Lanka and people with dignity and honor.\nReacting on the court decision in Sri Lankan citizen Priyantha Kumara’s lynching case, Council of Islamic Ideology (CII) Chairman Dr Qibla Ayaz said submission of challan by the Sialkot police and court’s decision in one month and four days was a positive gesture.\nHe said the CII, in its recommendations, had always emphasized that the delivery of justice should not be delayed.\nHe said investigation of this particular case and identification of real culprits was a difficult task but the diligence with which Sialkot police had completed both the legal proceedings and submitted challan in the court was commendable.\nHe expressed the hope that the police department would continue to carry out its duties with the same spirit. Following the decision of the ATC in this case in a short period of time, other courts would also play their role in ensuring speedy delivery of justice, he maintained.",
  "retrievedAt": "2025-08-11T14:43:32.775Z"
}
