{
  "title": "Project for enhancing domestic pharmaceutical ingredients production inaugurated",
  "link": "https://www.app.com.pk/national/project-for-enhancing-domestic-pharmaceutical-ingredients-production-inaugurated/",
  "date_published": "2024-02-14T11:25:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 14 (APP): The Caretaker Federal Minster for National Health Services, Regulations and Coordination, Dr. Nadeem Jan, Wednesday, inaugurated a project of expansion and revamping of Active Pharmaceutical Ingredient (API) manufacturing facility at DrugPharma Chemicals.\nIt is the second project under endeavor of revival and invigorating domestic production of API and at completion of the project the production capacity of the Drugpharma would increase in a phased manner from existing 52000 liters to over 105000 liters by end of the year.\nThe federal minister speaking at the occasion said that APIs are used as basic ingredient in medicines of different disease and their enhanced indigenous production will not only lessen reliance on API imports but it will also help reducing the price of medicines and improving quality and availability of the basic pharmaceutical ingredients in the country.\nHe said that medicines and other pharmaceutical products manufactured in Pakistan were in a great demand in Central Asia as well as in African countries and we can enhance our exports by ensuring expansion opportunities the local pharmaceutical sector.\nIncrease in export of pharmaceutical products will also contribute significantly in ensuring the availability of quality medicines on appropriate prices across the country, he added.\n“Since formation of caretaker government, I have pursued a three pronged strategy in health sector with core objectives of health sector reforms; decreasing imports, enhancing indigenous production and mobilizing health sector resources for economic stabilization; and increasing the dignity of Pakistan across the globe,” the minister stated and expressed satisfaction on substantial progress so far.\nThe health ministry had set a target of $ 1 billion for exports of medicines, pharmaceutical products and medicinal equipment in the current financial year, he said adding that we are poised to achieve or even surpass the target. In fact Pakistan has potential and it was possible to expand the pharmaceutical exports to $ 2 billion, he further added.\nGovernance in health ministry and its allied entities has improved with digitization of the system, accountability is in place and all administrative decisions were being made on merit, Dr. Nadeem Jan said and further informed that control programs on Diabetics and Hepatitis are devised while 500 primary health care centers has mad functional as well.\nGovernment brought structural reforms in PMDC to enhance quality of medical education in the country while measures were also underway for quality enhancement of the Nursing Council, Dr. Jan stated and highlighted the demand of trained nurses across the world.\nElaborating on steps for ensuring availability of quality medicines on appropriate price in the country the minister informed that monitoring system of the Drug Regulatory Authority of Pakistan (DRAP) is fully functional and actions were being taken against illegal profiteering and hoarding of drugs.\nDRAP’s systems of registration, licensing, review and renewal are made completely online to promote transparency and inclusion of all the stakeholders while measures have also been taken for capacity building and strengthening accountability within the regulatory authority, the minster informed.\nThe ministry has launched an app to receive and redress public grievances and any citizen could register complaint about prices, availability and other relevant issues on the app and DRAP team will contact the aggrieved person.\nThe Caretaker Federal Health Minster, at the occasion, unveiled the plank to formally inaugurate the project and also reviewed the progress on the project.\nEarlier, Director Business Drugfarma Chemicals Pvt Ltd, Sohail Siddidui briefed about the company and informed that company was manufacturing a number of APIs from drug classes including Penicillin, Steroids, Analgesics and Antipyretics.\nThe firm had an operating capacity of 52000 liters of reaction equipment installed, he informed adding that current expansion program may enhance the production capacity more than 100%.",
  "retrievedAt": "2025-08-11T00:40:09.407Z"
}
