{
  "title": "Keel Laying Ceremony of second HANGOR Class Submarine held at Karachi Shipyard",
  "link": "https://www.app.com.pk/national/keel-laying-ceremony-of-second-hangor-class-submarine-held-at-karachi-shipyard/",
  "date_published": "2024-02-14T16:27:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Feb 14 (APP): Achieving another milestone in indigenous submarine development project at Pakistan, the Keel Laying Ceremony of second HANGOR Class Submarine was held at Karachi Shipyard & Engineering Works (KS&EW) where Chief of the Naval Staff, Admiral Naveed Ashraf graced the occasion as Chief Guest on Wednesday.\nAs per the defence agreement between Pakistan and China for development of eight HANGOR Class Submarines, four submarines are under construction at Wuchang Shipbuilding Industry in China whereas remaining four are being built at KS&EW under Transfer of Technology (ToT) agreement, an Inter Services Public Relations (ISPR) news release said.\nSpeaking on the occasion, Chief of the Naval Staff Admiral Naveed Ashraf said, “It is a matter of great pride to witness the Keel Laying of HANGOR Class Submarine at Karachi Shipyard in collaboration with China Shipbuilding & Offshore International Co. Ltd (CSOC).”\nHe lauded the joint efforts and performance of Ministry of Defence Production, Pakistan Navy, Karachi Shipyard (KS&EW) and CSOC for construction of these Submarines.\nThe Chief of the Naval Staff highlighted that indigenization was a top priority of Naval Headquarters policy which is being manifested by construction of these state of the art Submarines at KS&EW.\nEarlier during his welcome address, the Managing Director KS&EW, Rear Admiral Salman Ilyas highlighted that Karachi Shipyard was fully cognizant and completely aligned with the goals set forth by Government and Pakistan Navy in pursuing self-reliance in submarine construction. These submarines are a testimony of our commitment to this national cause.\nHe also thanked Ministry of Defense Production and Pakistan Navy for their continued support and cooperation in realizing various projects at hand. This is the 2nd Submarine to undergo Keel Laying at KS&EW. Earlier, in Dec 2022, Keel Laying of first Submarine was successfully undertaken and currently it is at advanced stage of construction.\nThe ceremony was attended by representatives of Embassy of China, CSOC (China), WSIG (China) and other high-ranking government officials including distinguished guests from Ministry of Defence Production (MoDP) and armed forces of Pakistan.",
  "retrievedAt": "2025-08-11T00:39:23.208Z"
}
