{
  "title": "Senate Body on education seeks plan for teachers training, moral values",
  "link": "https://www.app.com.pk/national/senate-body-on-education-seeks-plan-for-teachers-training-moral-values/",
  "date_published": "2024-02-14T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Chairman Senate Standing Committee on Federal Education and Professional Training Senator Irfan Siddiqui on Wednesday instructed the education ministry to devise plans for teacher training encompassing dress code, moral values, and teaching acumen.\nThe session of the Senate Standing Committee on Federal Education and Professional Training took place at Parliament House, presided over by Senator Irfan Siddiqui.\nBefore delving into the agenda, the chair conveyed to committee members that this marks the final meeting of the standing committee before its dissolution.\nExpressing gratitude, the chair acknowledged the unwavering support of both committee members and officials from the education ministry and HEC over the past three years.\nCommittee members commended the chair for ensuring the smooth functioning of the standing committee proceedings.\nThe committee addressed the agenda item related to a starred question posed by Senator Bahramand Khan Tangi during the Senate Session on 5th January 2024.\nThe question inquired about government-established institutes for teacher training.\nThe Caretaker Minister for Federal Education and Professional Training informed the committee about two such institutions in Islamabad.\nSenator Tangi urged international training for teachers to expose them to modern educational practices.\nA point of public importance concerning the absence of a service structure for university teachers was discussed. The HEC Chairman reported on the special committee’s progress, and the chair directed the HEC to submit an interim report by Friday.\nThe committee also discussed a starred question from Senator Mushtaq Ahmed regarding the number of students studying “A” and “O” levels under the Cambridge system in Pakistan.\nSenator  Mushtaq Ahmed expressed concerns about the lack of information, citing a message received from the UK embassy in which the sought information was being termed as “Business Secret.\nThe chair emphasized the need for control and directed ministry officials to coordinate with the foreign ministry to obtain this vital information.\nThe committee meeting was attended by Senators Prof. Dr. Mehr Taj Roghani, Fawzia Arshad, Engr Rukhsana Zuberi, Mushtaq Ahmed Khan, Falak Naz, Naseebullah Bazai, and Bahramand Khan Tangi, along with the caretaker Ministry for Federal Education and Professional Training, Special Secretary Education, and Chairman HEC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:39:45.522Z"
}
