{
  "title": "Ashrafi commends institutions for ensuring law, order during elections",
  "link": "https://www.app.com.pk/national/ashrafi-commends-institutions-for-ensuring-law-order-during-elections/",
  "date_published": "2024-02-14T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Prime Minister’s Special Representative on Religious Affairs and Pakistani Diaspora in Middle East and Muslim Countries, Hafiz Muhammad Tahir Mehmood Ashrafi on Wednesday commended the significant role of all institutions, including the Pakistan Army, security agencies, and police for their efforts in ensuring law and order, especially during the recent general elections held on February 8, across the country.\nAddressing a joint press conference along with other prominent religious scholars and leaders, he acknowledged that despite attempts by adversaries to disrupt the peaceful conduct of elections, their efforts had been thwarted, leading to the successful completion of the electoral process.\nAshrafi who is also the chairman of Pakistan Ulema Council said in light of the current political and religious landscape, there was a pressing call for unity among Pakistan’s political and religious factions to strengthen the nation.\nAcknowledging election results, he emphasized on utilizing legal channels such as the Election Commission of Pakistan and courts to address grievances and ensure fairness.\nAshrafi called on major political parties to unite and foster an environment conducive to reconciliation and dialogue.\nEmphasising the importance of maintaining peace and stability within the country, he announced that a high-level delegation from the Pakistan Ulema Council would engage with all major political parties to foster understanding and cooperation.\nAshrafi also urged the leadership of Pakistan Tehreek-e-Insaf, to prioritize national stability and engage in dialogue for the betterment of the country. He reiterated that negotiations were key to resolving all issues encouraging political parties to engage in constructive dialogue. “A strong government with a robust opposition is deemed essential for Pakistan’s progress and prosperity,” he added.\nHe opined that there was a pressing need for political parties to forge a national pact for the betterment and stability of Pakistan. He urged all parties to set aside personal interests and prioritize the nation’s well-being. He, raising concerns regarding external commentary on Pakistan’s elections, emphasized on the importance of respecting national sovereignty and democratic processes.\nAshrafi said Pakistan Ulema Council would observe a day of condemnation against Israeli aggression on Friday, along with a call to boycott both Israeli and Indian products to express solidarity with Palestinian people in the Muslim world.\nAdditionally, he disclosed plans for a 10-day nationwide activism campaign from February 18 to 28, commemorating the organization’s ‘Foundation Day’.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:39:45.096Z"
}
