{
  "title": "FTO decides Rs 17,742.16 million refund claims in 2023",
  "link": "https://www.app.com.pk/national/fto-decides-rs-17742-16-million-refund-claims-in-2023/",
  "date_published": "2024-02-14T11:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): The Federal Tax Ombudsman (FTO) has addressed the grievances of the taxpayers by processing 8,963 cases with an implementation status of 94.07% during 2023 as compared to 73.29% last year.\nLikewise, requests for refund claims were also decided to the tune of Rs. 17,742.16 million in 2023 and the due amount was paid to the aggrieved taxpayers by the Federal Board of Revenue (FBR).\nThis was highlighted by the Federal Tax Ombudsman Asif Mahmood Jah, who called on President Dr Arif Alvi and presented FTO’s Annual Report 2023 at Aiwan-e-Sadr on Wednesday.\nThe Federal Tax Ombudsman briefed the president about FTO’s overall performance and its key initiatives to facilitate taxpayers and expeditiously address their grievances against maladministration of tax officials.\nHe stated that concerted efforts were undertaken to enhance FTO’s outreach by launching awareness campaigns and opening up regional offices in the country.\nHe informed that Honorary Advisors had also been appointed abroad to facilitate overseas Pakistanis in the USA, Canada, Sweden, UAE, Hong Kong and the Philippines.\nHe added that FTO had appointed leading businessmen as Honorary Advisors from various Chambers of Commerce and Industries to facilitate the business community. “To ensure prompt response against the maladministration of tax authorities, a mobile App has been developed enabling aggrieved complainants to lodge complaints and check their status using mobile/smart devices”, he stated.\nHe apprised that highly informative training sessions had also been conducted to enhance the professional skills and expertise of Ombudsman institutions in the country.\nWhile appreciating the performance of FTO, the president said that FTO had done an excellent job by processing a record number of cases and providing refunds worth Rs Rs17,742.16 million to taxpayers.\nHe remarked that the institution of FTO needed to be further strengthened as it was providing free-of-cost and prompt justice to aggrieved taxpayers. He called for using the latest technology for seamless service delivery and timely disposal of taxpayers’ complaints to improve the country’s tax regime. He said that FTO had effectively contributed to promoting good governance in the country.\nIt is worth stating that the FTO is a quasi-judicial forum, mandated to diagnose, investigate, redress and rectify any injustice or maladministration done to a person by the functionaries administering federal tax laws. It aims at enhancing the overall satisfaction of the taxpayers and strengthening their trust in the system.",
  "retrievedAt": "2025-08-11T00:40:09.073Z"
}
