{
  "title": "TBTT jots to be scaled up to 200,000 till December: Amin",
  "link": "https://www.app.com.pk/national/tbtt-jots-to-be-scaled-up-to-200000-till-december-amin/",
  "date_published": "2020-09-06T07:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):The daily wages jobs created under Ten Billion Tree Tsunami project (TBTT) and Clean Green Pakistan Index (CGPI) would be scaled up from current 65,000 to 200,000 by December 2020 with the assistance of World Bank’s US $ 60 million assistance.\nTalking to APP, Special Assistant to the Prime Minister (SAPM) on Climate Change, Malik Amin Aslam said keeping in view risk of increasing unemployment of daily waged labour due to the COVID-19 pandemic, the government had based its decision on the priorities for creating greater job opportunities during and post COVID-19.\nThe Ministry of Climate Change had proposed a “Green Economic Stimulus”, largely focusing to divert and re-configure implementation and roll out TBTTP and CGPI\ncreating greater opportunities for jobs and incomes, he added.\nWB grant of US $ 60 million, he said, was proposed to provide short term relief in the shape of job creation and livelihood operations.\nPakistan’s “Green Stimulus”, was acknowledged by World Economic Forum (WEF) as “win – win for the environment and for the unemployed”.\nHe added that for 2019-20; the TBTT project had generated a minimum of 65,000 jobs which were planned to be scaled- up to 200,000 by December 2020 that included\nArgo-Forestry, Social Forestry (Individual Subsistence Farmers), Raising of Potted Nurseries (Subsistence Communities in Hilly Areas), Seed Collection and Sale to Government and Private Nurseries), Rakha (guard) or Watchers and Fire Collies in Afforestation Areas (Seasonal Employment), Water Shed Management (Bioengineering) and Soil Conservation Works’ Labor, Rangeland and Grassland Improvement Work Labor, Fuelwood Plantation Raising (Traditional Hurries in Sindh), Evolving value chains; supply chains for engagement of larger section of labor and innovative enterprises revolving around many products of forestry, horticulture, Agro- forestry.\nHe went on to mention that under, “Enhancement of Forest cover and management”, component of TBTT, on July 2, 2020, the Prime Minister launched development of 15 national parks over the next three years with the allocation of Rs four billion .\nIt was aimed to expand protective areas from 12 to 15 percent by 2023 with proper management and would provide livelihood opportunities through enhanced management of protected areas with focus on Eco-tourism on international standards.\n“Almost 5,000 direct green jobs will be created in the initial phase of the project. Job Creation through Protected Areas Management include Seasonal Rakha or Watchers in Protected Areas/National Park Fringes, Eco-Tourism Seasonal Guides, Removable Information Kiosks and Food Outlets, Local Jeep Drivers for Tourist Mobility and Social Mobilization for Conservation (Local Awareness and Outreach Activists).”",
  "retrievedAt": "2025-08-11T19:46:32.800Z"
}
