{
  "title": "Air Force Day to be observed with traditional zeal tomorrow",
  "link": "https://www.app.com.pk/national/air-force-day-to-be-observed-with-traditional-zeal-tomorrow/",
  "date_published": "2020-09-06T11:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 06 (APP): Air Force Day will be observed with patriotic zeal on Monday (tomorrow) to commemorate dexterity and valor of the defenders of air space of the\ncountry against Indian aggression in September 1965 war.\nEvery year on September 7, Air Force Day is celebrated across the country to re-live the memory of 1965 war when our valiant pilots despite limited resources not only annihilated Indian air aggression but also inflicted\nhumiliating defeat on the so-called mighty India through unprecedented skill in the warfare and insurmountable courage.\nIndian Air Force, to aide the Indian army which had launched a clandestine attack on Lahore at Burki border with the dream of a sumptuous breakfast at Gymkhana Lahore in the morning but had failed miserably after valiant\nresistant by proud sons of soil like Major Raja Aziz Bhatti Shaheed, attacked Pakistani air space but were mauled by the Pakistani Shaheens (falcons) in the air and decimated in the blink of an eye.\nThe day belonged to the Pakistan Air Force (PAF) ace Muhammad Mahmood Alam (commonly known as M.M.Alam) who shot down five of the Indian Air Force\nHawker Hunter Mk. 56 fighters in less than a minute. M.M.Alam destroyed the first four Indian fighter jets in first 30 seconds while the fifth became his victim within next 30 seconds. He claimed 11 kills in a day and became history’s only jet ‘ace-in-a-day’ in One Hundred years history of the World Aircraft. He is one of the few aviators who became a hero in few seconds and not only won international\nacclaim but also was deservedly bestowed with Sitara e Jurrat (SJ) for his dexterity and eagle eyes action.\nSeptember – Air Force Day – also raised status of the PAF in the comity of nations as a great air force with impeccable skills and dexterity.\nThough, the Pakistan Defence Day 2020 will not be observed with traditional pomp and show owing to the novel coronavirus (Covid-19) pandemic in the country. All the traditional air shows have been cancelled at the air bases. However, the PAF will release a special documentary ‘Mujahiddin e Aflak ko Salam’ (A tribute to warriors of Skies) which will be aired by Pakistan Television (PTV)\nand private channels from 9 a.m to 11 a.m. on September 7 (Monday).\nAlthough, public and private organizations, educational institutions and the armed forces are holding virtual ceremonies to pay homage to the martyrs and ghazis of\nIndo-Pak 1965 war in connection with the Air Force Day 2020, special prayers will be offered for the solidarity, integrity and independence of the motherland in all the mosques after Fajr prayers.\nSpecial wreath-laying ceremonies will be held at the graves of the September 1965 war heroes while the city roads have already been bedecked with banners and streamers\nshowing solidarity with the armed forces and acknowledging the great feat of brave soldiers who defended the sacred frontiers of their country with exemplary mettle.\nEducational institutions have planned ‘virtual events’ to observe the day and apprise the young students about the historic significance of the day and imbibe in their minds\nspirit of patriotism for the years to come.\nRadio Pakistan Lahore will air special programs besides current affairs programs on television channels which include talks, discussions, interviews of renowned personalities highlighting the significance of the day, whereas, national songs will be part of the transmission.\nThe national dailies will publish special editions of newspapers on the day to underline the fearlessness, bravery and dexterity of our air force which successfully defended air spaces in Lahore, Sialkot and Sargodha.",
  "retrievedAt": "2025-08-11T19:46:26.152Z"
}
