{
  "title": "Solangi appeals 120 m voters to cast vote for better Pakistan",
  "link": "https://www.app.com.pk/national/solangi-appeals-120-m-voters-to-cast-vote-for-better-pakistan/",
  "date_published": "2024-02-08T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Thursday appealed to the masses to cast vote in the elections for a better future of Pakistan.\nWhile talking to PTV’s special transmission titled “Vote Pakistan”, he said that he was the first voter to cast his vote in the polling station of Constituency NA-46.\nHe said that over 120 million Pakistanis had the right to vote and they should cast a vote for the candidate or party of their choice as it was a national responsibility.\nHe said that it was possible to choose a candidate of one’s own choice only by voting.\nTerming casting a vote as a sign of patriotism, Murtaza Solangi said that the country could move forward only by exercising the right to vote.\nHe said in his first press briefing as Caretaker Information Minister, the first question he was asked was about the conduct of elections.\nDuring the entire tenure of the caretaker government, there were speculations regarding the election but the government was fully committed to conducting of elections on time, Murtaza Solangi remarked.\n“Speculations regarding the holding of elections are dismissed today,” Murtaza Solangi maintained.\nMurtaza Solangi said that the caretaker regime showed full responsibility for conducting the election and he opposed the resolution in the Senate for postponement of the elections.\nThe minister promised that the present government would hand over the country in a better condition to the elected representatives.\nThe caretaker government inherited a situation in which the country was facing many problems including security and economic meltdown.\n“When the caretaker cabinet was sworn in, the parity of the dollar with the rupee stood at Rs 296, while the dollar in the open market was available in Rs 350 to 400 rupees.\nTerming economy as the biggest problem of the country, he said everyone agreed on the real problems faced by the people.\n“It is written in the preamble of the constitution of Pakistan that this country will be run by its elected representatives,” Murtaza Solangi remarked.\nThe focus of the future leadership would be the people and economy of the country, he opined.\nHe said that despite all the difficulties, the people of Pakistan were not disappointed with democracy and the entire election process of Pakistan was under the eyes of the whole world.\nHe said that more than 200 journalists working for foreign organizations were already in Pakistan whereas a large number of foreign journalists and observers had especially come to Pakistan to cover the elections.\nMoreover, he said more than 600,000 illegal residents have been sent back to their respective countries.\nHe said that Pakistan Television Corporation as a national broadcasting organization has to further improve the quality of content and production.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:22:16.171Z"
}
