{
  "title": "Role of women inevitable in civilized society’s construction: Ashrafi",
  "link": "https://www.app.com.pk/national/role-of-women-inevitable-in-civilized-societys-construction-ashrafi/",
  "date_published": "2022-01-26T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP):Prime Minister’s aide on interfaith harmony Hafiz Tahir Mehmood Ashrafi Wednesday said the role of women in the construction of a civilized society was inevitable.\nHe was addressing a seminar for female on ‘The Role of Aalimat in Creating Peace in the Society’ organized by Shari’ah Academy of International Islamic University Islamabad as a ‘guest speaker’.\nAshrafi termed Hazrat Khadijaul Kubra as role model for women because she was the first lady who testified the Muhammad Peace Be Upon Him as the Prophet of Allah Almighty.\nHe said there was no need for the women to be confined within the four walls of the house as Hazrat Khadijatul Kubra was a dominated figure in the business community of Makkah and the Holy Prophet happily tied the knot with her.He urged the women to come ahead and prove your mettle in all spheres of life as neither Islam forbid women from education nor trade.\nFurther shedding the light on the significance of women in the Islamic history, he said the four caliph of Islam – Hazrat Abu Bakr, Umar, Usman and Ali used to consult with Syeda Fatima, Hafsa and Aysha over certain issues.Ashrafi quoted a living example from his private persona of life and said my strength was my daughters.\nHe said at a certain juncture of his 37-year political and religious life, he wanted to leave all his activities but his daughters raised his morale saying they did not want to see him a coward man but a bold person.He said, “Those words infused a new spirit in my life and today, what I am, it is because of my mother, wife and daughters,” he added.\nAshrafi said the parents should not underestimate their daughters as they were being called ‘Bushra’ (good news) in the holy Quran. Moreover, Allah Almighty had revealed a complete chapter ‘Suratul Nisa’ about women in the divine command, he added.\nCriticizing so-called civil societies raising voice for women’s rights, he said the women’s rights were completely protected in Islam.He said if you had a glance in those so-called human rights activists personal lives, they themselves were not ready to give women their legal rights in the inherited property.\nHe was sorry to say that there were some big names in the society which did not marry their daughters because if they did so their property would be distributed among out of family members.He also pointed out the issue of dowry as this social evil had created big problems for the parents of daughters.He said a great number of girls were waiting in queue for their perfect match in the life but due to lack of dowry, they were being ignored by the bridegrooms’ parents.\nHe urged the people to mend their ways as this practice was totally against the teachings of the Holy Prophet and Islam.Lauding the Paigham-e-Pakistan and Dukhtaran-e-Pakistan initiatives, he said in these doctrines, the solution of all persistent issues in the society either it was about women’s rights, sectarianism or interfaith harmony had been discussed exclusively.\nTalking about the birthday of Hazrat Isa AS, he said minorities had a great role in the independence of Pakistan and the people should avoid such campaigns degrading them.He said such hatred campaigns projected a negative image of Islam in the world.Pointing out the issue of forced marriage or conversion to Islam, he said there was no room for such practices in Islam.\nIn the end, Ashrafi said today, Pakistan was being confronted many issues including extremism, terrorism and Islamophobia and it had placed a huge responsibility on women to counter them with their pragmatic approach to get Pakistan out of these crises.",
  "retrievedAt": "2025-08-11T14:11:19.229Z"
}
