{
  "title": "Civil, criminal law reforms to ensure speedy justice: PM",
  "link": "https://www.app.com.pk/national/civil-criminal-law-reforms-to-ensure-speedy-justice-pm/",
  "date_published": "2022-01-26T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Prime Minister Imran Khan on Wednesday said the government was making reforms in the civil and criminal laws system so as to ensure effective and speedy justice to the citizens.\nChairing a high-level meeting on civil law reforms, the prime minister said for the first time since 1908, the government was making changes in the law to bring improvement to dispensation of justice.\nThe prime minister said no government in the past ever thought about reforming the century-old laws in order to maintain status quo and accommodate the elite.\nHe said during the tenure of present government, the judiciary was enjoying complete freedom.\nHe said prompt and guaranteed delivery of justice was directly linked to improved governance.\nThe meeting was briefed in detail on the reforms implemented during the three-year tenure and the future course of action.\nIt was highlighted that the provision of inheritance certificate would start from January 2021 in Islamabad, June 2021 in Punjab and Sindh and in December 2021 in Khyber Pakhtunkhwa. Also, in Balochistan, the work is in full swing on the passage of this law.\nSo far, a total of 10,485 households have received inheritance certificates under the new system (over a period of 15 days).\nIn 12 countries, 22 counters have been set up at Pakistani embassies abroad to issue inheritance certificates.\nThe meeting was also informed that under the law for protection of women’s inheritance rights, around 136 out of 198 cases were decided in Islamabad, 122 out of 810 in Punjab and 78 out of 421 in Khyber Pakhtunkhwa. .\nUnder the said law, provision of inheritance to women is being ensured.\nThe prime minister directed implementation of reforms on priority basis, strengthening linkages and enhancing cooperation between the institutions.\nThe meeting was attended by federal ministers, Farogh Naseem, Chaudhry Fawad Hussain, Special Assistant Dr. Shahbaz Gill, Punjab Chief Minister Sardar Usman Bazdar, Parliamentary Secretary Law Ministry Maleeka Bukhari and senior officials.\nKhyber Pakhtunkhwa Chief Minister Mahmood Khan and Provincial Law Ministers Raja Basharat, Fazal Shakur Khan and provincial officials concerned attended the meeting through video link.",
  "retrievedAt": "2025-08-11T14:11:20.625Z"
}
