{
  "title": "Hungarian PM to visit Pakistan next month: Ambassador",
  "link": "https://www.app.com.pk/national/hungarian-pm-to-visit-pakistan-next-month-ambassador/",
  "date_published": "2022-01-26T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Pakistan’s Ambassador to Hungary Muhemmed Aejaz on Wednesday said Hungarian  Prime Minister Viktor Orban would visit Pakistan next month, on the invitation of Prime Minister Imran Khan.\nDuring the visit, the two leaders would  discuss various bilateral and regional issues, particularly matters related to enhancing bilateral trade and economic cooperation.\n“The visit is historic and significant due to several reasons. It will be the first ever visit by a prime minister, from either side, the ambassador said.  According to a press release received here from Budapest, Viktor Orban, who is currently serving his 3rd consecutive term as Prime Minister of Hungary, is now the longest serving leader in the European Union, after departure of German Chancellor Angela Merkel.\nThe ambassador said the Hungarian prime minister’s visit was also important as it would be the first visit by a leader of the European Union to Pakistan in 15 years.  Both the countries had engaged closely during the past two years, and specially during 2021, he said, adding the foundation for the latest warmth in the relationship was laid during the visit of Hungarian Foreign Minister Péter Szijjarto to Pakistan on the invitation of Foreign Minister Shah Mahmood Qureshi, in April. A large business delegation had also accompanied the Hungarian foreign minister during the visit, he added.\nIn March 2021, Foreign Minister Qureshi, under his economic diplomacy campaign, had jointly inaugurated the Hungary-Pakistan-Tade & Economic Window (HPTEW) together with his Hungarian counterpart. Muhemmed Aejaz said several high level return visits were undertaken from Pakistan to Hungary, afterwards. Those included among others the visit of a Pakistani parliamentary delegation, visit by the Prime Minister’s Advisor/Minister for Climate Change and visit of Punjab Governor to Budapest.\nPlaced at notable geo-economic locations, both Pakistan and Hungary have a tremendous potential to develop long term economic cooperation in the months and years ahead, the ambassador said and added that both sides, particularly the two Embassies have played an active role in promoting bilateral trade, commercial and economic interests and in opening new windows of opportunity for the business community.",
  "retrievedAt": "2025-08-11T14:11:21.475Z"
}
