{
  "title": "India not democrat but a terrorist country: Mushaal",
  "link": "https://www.app.com.pk/national/india-not-democrat-but-a-terrorist-country-mashal/",
  "date_published": "2022-01-26T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Chairperson of Peace and Culture Organization, Mushaal Hussein Mullick Wednesday said that India is not a democratic country but a terrorist.\nShe said Indian army troops are involved in genocide and ethnic cleansing of innocent Kashmiri people in Indian Illegal occupied Jammu and Kashmir (IIOJK).\nShe said that Indian Republic Day is a black day for Kashmiris who have been deprived of their fundamental and constitutional rights for over seven-decades.\nMushaal said that Indian forces unleashed a wave of state terrorism in Indian Illegally Occupied Jammu and Kashmir (IIOJK), who used all brutal tactics to silence the dissenting voices in the occupied valley.\nThe hurriyat leader said that India portrays itself as champion of human rights, whereas, minorities and non-Hindu communities living in India are persecuted by RSS backed fascist Modi government.\nThe chairperson lamented that due to the world’s apathy and inaction to stop Indian forces for committing war crimes, the Hindutva regime further emboldened and resorted to change the demography of Kashmir by bringing settlers from other parts of India.\nMushaal said that the over 900,000 Indian occupying forces have detained 8 million Kashmiris and turned the occupied territory into one of the largest open prisons in the world.\nShe said that despite facing the worst form of Indian state terrorism, the people of occupied valley have always shown extraordinary courage, strength and resilience, adding that fascist India cannot break their will by using brutal force.\n“I salute our Kashmiri mothers, sisters, elders and brothers on the occasion of Black Day for their sacrifices and their invincible spirit in fight for their just and birth right of right to self-determination,” she added.\nMushaal appealed that the international community and world powers should force the brutal India to stop the killing spree in IIOJK and ensure resolution of the Kashmir dispute as per the UN resolutions.",
  "retrievedAt": "2025-08-11T14:11:15.506Z"
}
