{
  "title": "Boycott of Parliamentary panel meeting on COVID proves national interest not opposition’s priority: Shibli",
  "link": "https://www.app.com.pk/national/boycott-of-parliamentary-panel-meeting-on-covid-proves-national-interest-not-oppositions-priority-shibli/",
  "date_published": "2020-11-25T10:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Wednesday that opposition parties’ boycott of Parliamentary Committee’s meeting on COVID-19 once again proved that the national interest,people’s health and economic development were not among their priorities.\nAddressing media after the Parliamentary Committee meeting chaired by Speaker National Assembly Asad Qaiser he said that the opposition talked about democracy and democratic norms but practically they do not care for them. The minister said that there were some national issues which should be above politics and be tackled with consensus strategy.\nTo a question he said that under parliamentary system, both treasury and opposition had their own role which they should fulfil. He said that the government wanted to create consensus on the issue and opposition would be approached in this regard.\nHe said after failure of Peshawar rally the opposition should adopt a sensible approach and cancel its future rallies. He said that the objective of the opposition was to protect the money it plundered when in power but the government would not give them any concessions.  He said that for personal gains, the opposition parties were playing with the lives of the people.\nShibli Faraz said so far five meetings of the committee had been held out of which four were attended by the opposition and the government implemented the suggestions given by them. Unfortunately today they stayed away from the meeting and PTI and its allies attended it, he added. He said that objective of the meeting was to create consensus on how to tackle the second wave of the coronavirus. He said that with consensus first wave of the pandemic was successfully defeated and entire world not only appreciated Pakistan’s handling of the coronavirus but tried to replicate it. Shibli said it was need of the hour that all stakeholders should show unity in larger national interest and set aside political differences to counter the second wave of the pandemic.\nThe government would take all possible steps for protection of lives and livelihood of the people with opposition or without opposition, the minister remarked. He said that opposition wanted that unemployment should increase and hospitals should be filled to capacity with Corona patients so that they could do politics on it.\nHe said that the people of Pakistan and their own party workers would take the opposition leadership to task for their irresponsible behaviour. He said that the organisers of the illegal public rallies and the leaders who attended them would be booked under the relevant laws as the government had not issued any NOCs for the rallies following the spike in coronavirus cases.",
  "retrievedAt": "2025-08-11T20:03:18.231Z"
}
