{
  "title": "Qureshi to attend OIC foreign ministers moot in Niger on Nov 27",
  "link": "https://www.app.com.pk/national/qureshi-to-attend-oic-foreign-ministers-moot-in-niger-on-nov-27/",
  "date_published": "2020-11-25T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Foreign Minister Shah Mehmood Qureshi will visit Niger along with a delegation to attend 47th Session of Organization of Islamic Cooperation (OIC)’ s Council of Foreign Ministers scheduled to be held from November 27 to 28, 2020.\nRepresentatives of 57 OIC member states and five Observer States are expected to attend the meeting to be held in Niamey, the capital of Niger, a Foreign Office press release said.\nDuring the two-day session, the CFM will discuss a wide range of issues confronting the Muslim world with particular focus on combating Islamophobia and defamation of the religions; Palestine and Jammu and Kashmir dispute.\nMoreover, the moot would also deliberate over situation of Muslim communities and minorities in non-OIC states; OIC 2025 Programme of Action; and various matters related to promotion of civilizational, cultural and religious dialogue.\nThe council will hold a brainstorming session on “Security and Humanitarian Challenges Confronting African Sahel States Members of the OIC.”\nDuring the visit, the foreign minister will highlight aggravating human rights and humanitarian situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK) in the wake of Indian illegal and unilateral actions of August 5, 2019 and subsequent measures to change the demographic structure of the occupied territory.\nHe will also highlight rising incidents of Islamophobia and hate speech against Muslims and emphasize the need for unity of the Islamic world to combat the scourge of Islamophobia and promote inter-faith harmony.\nOn the sidelines, FM Qureshi will hold bilateral meetings with his counterparts of member states.\nBeing the collective voice of the Muslim Ummah, the OIC is the second largest international organization after the United Nations with 57 members and five observers spanned over four continents.\nThe organization has completed 50 years of its existence. Pakistan is one of the founding members of the OIC and has actively contributed towards the objectives and goals of the OIC.",
  "retrievedAt": "2025-08-11T20:03:20.380Z"
}
