{
  "title": "Pakistan hosts inaugural meeting of SAARC Planning Ministers",
  "link": "https://www.app.com.pk/national/pakistan-hosts-inaugural-meeting-of-saarc-planning-ministers/",
  "date_published": "2020-11-25T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP):Pakistan hosted the inaugural meeting of SAARC Planning Ministers Wednesday on the theme: ‘Shaping the SAARC Vision 2030’ in virtual mode.\nAll member states and the SAARC Secretary General, Esala Ruwan Weerakoon participated in the meeting which was chaired by Minister for Planning, Development and Special Initiatives (PD&SI) Asad Umar.\nThe meeting was preceded by the SAARC Planning Secretaries’ meeting on November, 23 2020 which was also hosted by Pakistan virtually to lay the groundwork for the Ministerial Meeting.\nThe meetings discussed national Sustainable Development Goals (SDGs) approaches, impact of COVID-19 on economic growth in the South Asian region and a strategy for collective action for development financing in the wake of pandemic.\nIn his opening remarks in Asad Umer briefed the member states about Pakistan’s national SDGs policy.\nHe noted that political ownership for SDGs is manifested at the highest level as Pakistan was one of the 1st countries to adopt SDGs as National Development Agenda through a unanimous parliamentary resolution.\nHe also highlighted Pakistan’s success in devising a coordinated approach taken by Government of Pakistan towards its social protection and environment conservation initiatives such as the 10 Billion Tree Tsunami.\nHe expressed hope that the meeting would shape SAARC countries’ response for mitigating the adverse impacts of COVID-19 on the most vulnerable groups of SAARC societies and efforts to accelerate the successful implementation of SDGs targets within the region.\nIn this regard, he emphasized affordable and effective provision of Covid-19 vaccine for SAARC countries which seems vital keeping in view the fact that the region is home to 1/4th of global population and further 96 million people in the region live in extreme poverty.\nHe further deliberated the importance of Debt relief and availability of concessional financing for the SAARC region in order to tackle the COVID-19 pandemic proficiently.\nHe indicated that the Prime Minister Imran Khan has already extended the concept of ‘Global Initiative for Debt Relief’ to provide much needed fiscal space to the developing countries currently faced with worsening financial meltdown due to the pandemic and SAARC countries can join their voices for this common initiative.\nHe noted that Pakistan continues to extend its unconditional support to strengthening coordination and cooperation to all the SAARC Member States for the greater benefits of vulnerable groups within the region.\nHe expressed hope that this initiative by Pakistan, and the Meeting Report adopted by all Member States with consensus, will go a long way in devising a coordinated strategy towards achieving SDGs in the region, especially in the post-COVID environment.\nThe SAARC Planning Ministers and Secretaries virtual meetings were a reaffirmation of Pakistan’s commitment to the SAARC process and its efforts to forge closer cooperation among member states.\nAll member states and the SAARC Secretary General appreciated Pakistan’s timely initiative of organizing the meetings on such an important subject.",
  "retrievedAt": "2025-08-11T20:03:15.091Z"
}
