{
  "title": "IT ministry faces grilling over ‘selective’ AI collaboration - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Senators ask why LLM development initiative was not open to other stakeholders from industry, academia\n• Committee discusses bill to establish legal, ethical framework for AI regulation\n\nISLAMABAD: A Senate standing committee on on Thursday questioned the Ministry of Information Technology and Telecommunication over its apparent collaboration with a mobile service provider and a public sector university in a project that aims to develop an indigenous Large Language Model (LLM).\n\nLLMs are trained on immense amount of data to make them capable of generating responses based on the input prompt. They are at the back of generative AI tools like ChatGPT and DeepSeek.\n\nThe IT ministry has collaborated with Jazz and the National University of Sciences and Technology to produce Pakistan’s first LLM.\n\nChaired by Senator Palwasha Mohammad Zai Khan, the meeting of the Senate Standing Committee on IT and Telecommunication expressed concern that the ministry had apparently excluded other capable players from academia and industry.\n\nSenator Humayun Mohmand took the lead in grilling ministry officials. “Why were other telecom companies and technical universities not invited to participate?” he asked.\n\nResponding to the criticism, the IT secretary clarified they had not formally selected Jazz and Nust, rather both entities had independently launched the initiative and were self-financing it.\n\n“No public funds are involved,” he assured the committee.\n\nNonetheless, Senator Mohmand recommended that the opportunity be publicly advertised to invite open participation from other stakeholders — a proposal the Secretary accepted, adding that universities across the country were now being invited to express interest.\n\n![ .]https://www.dawn.com/news/1924070)\n\nTo justify their involvement in the venture, representatives from Jazz made a presentation before the committee, underscoring that many native languages in Pakistan are on the verge of extinction. They said the LLM initiative was aimed at preserving the country’s rich linguistic heritage, though they admitted data collection remains a significant hurdle.\n\nThe Jazz delegation subsequently left the meeting after cross-questioning from lawmakers.\n\nSenator Mohmand also expressed the concern that the mobile company could have an unfair advantage in the field, given its association with the ministry.\n\nAcknowledging these concerns, IT secretary assured the committee that future projects will ensure transparency and open participation for all stakeholders.\n\nRegulation of AI bill\n\nThe committee also held detailed deliberations on the proposed ‘Regulation of Artificial Intelligence Bill, 2024,’ introduced by Senator Afnan Ullah Khan.\n\nThe legislation seeks to establish a legal and ethical framework for AI development in Pakistan amid growing global adoption of intelligent technologies. Committee members stressed the urgency of such regulation to ensure responsible and safe AI deployment.\n\nThe ministry also revealed that a newly established Emerging Technology Wing has been assigned the task of accelerating work in four high-priority domains: AI, semiconductors, cybersecurity, and quantum computing.\n\nIn response to a query from Senator Saifullah Sarwar Khan Nyazee regarding financial feasibility, the IT secretary confirmed that Rs16 billion had been allocated under the Public Sector Development Programme (PSDP) for FY2024–25 to support these efforts.\n\nThe meeting also featured a briefing by the National Cyber Crime Investigation Agency on a sweeping crackdown on illegal call centers operating across the country.\n\nThe committee was informed that 54 call centers were raided, resulting in the arrest of 254 individuals, with Islamabad emerging as the hotspot.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:47:51.927Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927946/it-ministry-faces-grilling-over-selective-ai-collaboration",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:45:33.000Z"
}
