{
  "title": "Three minor siblings die of ‘mysterious disease’ in Vehari - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: Three minor siblings, including two infants, died of a mysterious disease at village Sundhal in the suburbs of Mailsi in Vehari district.\n\nThe deceased were identified as Rehan and six-month-old twins, Muhammad Farhan and Muhammad Khan, sons of a labourer Imran. Rehan had died five days ago and Farhan and Khan died on Wednesday. Imran’s fourth son Khurram is also stated to be in serious condition.\n\nImran alleged that his sons died of measles while the health department denied it. In this respect, the deputy director public relations, Vehari, issued the health department’s denial in a press release, quoting CEO health Dr Fahad Waheed as saying that there was no death in the whole of the district due to measles.\n\nHowever, the department did not make it clear how and why the children died.\n\nFOOD POISONING: A minor boy died while three others fell ill due to alleged food poisoning at Sammasatta near Tonga Adda.\n\nAccording to Rescue 1122, the children had eaten cabbage mixed with potatoes last night. One of them, Muhammad Salman (6), died while other three, Muhammad Usman (4), Shamsheer (3) and Luqman (3), were shifted to Bahawal Victoria hospital (BVH). Their condition is stated to be out of danger.\n\nRAIN: Bahawalpur, Hasilpur, Yazman and other areas of the district received first-ever monsoon rain on Thursday.\n\nThe intermittent rain in the city and other parts of the district continued for the day. The low-lying areas were submerged in rainwater, creating problems for the motorists and pedestrians.\n\nThe supply of electricity was also disrupted at many places.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/25112204e3ed3e3.jpg?r=112211",
  "retrievedAt": "2025-08-16T06:46:51.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927871/three-minor-siblings-die-of-mysterious-disease-in-vehari",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:46:00.000Z"
}
