{
  "title": "McIntosh and Marchand dazzle for gold at world championships - Sport - DAWN.COM",
  "author": null,
  "content": "SINGAPORE: Summer McIntosh came within a whisker of breaking a long-standing world record and Leon Marchand failed to improve on a new mark he set just a night earlier, but both young guns won gold medals at the world championships in Singapore on Thursday.\n\nRomania’s David Popovici also flirted with a record on day five at the World Aquatics Championships Arena, the 20-year-old claiming a thrilling 100 metres freestyle gold to go with his 200 crown on day three.\n\nThe 200 butterfly world record of 2:01.81 set by China’s Liu Zige in 2009 is the last surviving mark from the supersuit era in women’s swimming — and Canadian phenomenon McIntosh all but took it down.\n\nShe stormed to her third individual gold medal of the meet in 2:01.99, the second-fastest swim of all time and a yawning three seconds better than American silver medallist Regan Smith, with Australia’s Elizabeth Dekkers third in 2:06.12.\n\nHaving made the last turn under world record pace the 18-year-old flagged slightly coming home and shouted an expletive when she spied the clock.\n\n“I know that I messed up the last 15 metres of my race,” she said. “Overall, happy with the time and a PB, but I didn’t reach my goal tonight.”\n\nChina’s 12-year-old marvel Yu Zidi finished just off the podium again having also placed fourth in the 200 IM.\n\nMcIntosh might console herself in the knowledge that her bid for five individual titles remains intact, with the 400 IM and a hugely anticipated showdown with American great Katie Ledecky in the 800 freestyle still to come.\n\nOnly Michael Phelps has won five individual golds at a world championships.\n\nThe 23-year-old Marchand, dubbed the “French Phelps”, embellished his status as the biggest thing in men’s swimming on Wednesday by obliterating Ryan Lochte’s world record that had stood since 2011.\n\nMarchand’s new mark of 1min 52.69sec in the world championships semi-finals wiped more than a second off Lochte’s 1min 54.00 and meant he added the 200m medley world record to his record in the 400m.\n\nTwenty-four hours after the fastest swim of his life, Marchand climbed back in the pool and defied tiredness to take the world crown in 1:53.68, the second-quickest time ever.\n\nMarchand was made to work hard for the win, with American Shaine Casas pushing him hard before finishing second in 1:54.30, with Hungary’s Hubert Kos third in 1:55.34.\n\nIt gave Marchand, who won four individual golds in front of his home fans at the Paris Olympics a year ago, his first gold in Singapore.\n\n“I felt so excited yesterday that I couldn’t sleep,” he said after sealing gold. “So I think I lost a lot of energy yesterday night, but it was my goal to break the record, so I was really happy with it.”\n\nMarchand will also race in the 400m medley in Singapore this week.\n\nPOPOVICI SPRINT DOUBLE\n\nPopovici then emerged the winner of a sensational men’s 100 freestyle final, clocking 46.51 to give Pan Zhanle’s world record (46.40) a big scare.\n\nPopovici’s time was the second-fastest ever and he had just too much finishing power for a field missing Olympic champion Pan.\n\nAmerican runner-up Jack Alexy also broke the 47-second barrier (46.92), while Paris Games silver medallist Kyle Chalmers took the bronze for Australia (47.17).\n\nAt 20, 200 Olympic champion Popovici has already completed the 100-200 sweep twice at world championships, having done the double at Budapest three years ago.\n\nThe relaxed Romanian said he had reached a higher plain; no longer worried about winning or losing.\n\n“I just feel very relieved that this huge pressure of being afraid of winning or losing is off me,” he said. “I don’t mean it in an arrogant way, I mean it in a self-maturing way.”\n\nThere was a United States one-two in the women’s 50m backstroke, with Katharine Berkoff (27.08sec) edging team-mate Smith (27.25) for victory.\n\nIn the finale of Thursday’s programme, Australia’s women clinched a second relay gold as Mollie O’Callaghan held off Ledecky of arch rivals the United States in a thrilling final leg to guide her 4x200 freestyle relay team over the finish line.\n\nO’Callaghan, a five-time Olympic gold medallist, was barely able to stand afterwards.\n\nChina claimed bronze to delight the large number of Chinese fans in the arena.\n\nAustralia also won the men’s and women’s 4x100 freestyle golds on Sunday.\n\nO’Callaghan, whose 11th gold tied her with Ian Thorpe as the most successful Australian at the world championships, will now look to add the 100 freestyle title to her 200 crown on Friday.\n\nMedals will also be decided in the men’s 200 breaststroke, 200 backstroke and 4x200 freestyle relay, as well as the women’s 200 breaststroke.\n\nPublished in Dawn, August 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688c444f71dcb.jpg",
  "retrievedAt": "2025-08-16T06:46:01.009Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927988/mcintosh-and-marchand-dazzle-for-gold-at-world-championships",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T04:35:58.000Z"
}
