{
  "title": "Pakistan beat West Indies in first T20I in 3-match series - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan beat the West Indies in their opening T20 international on Friday as their spin bowlers inflicted the damage in a 14-run victory to extend a miserable run for the West Indies.\n\nThe Pakistani spin specialists halted the West Indies’ chase of 179 to ease to a 14-run victory under the lights in Lauderhill, Florida.\n\nSaim Ayub posted a half-century and his teammates produced a steady flow of runs as the West Indies slumped to a sixth T20 defeat in a row, having been whitewashed 5-0 by Australia on home soil earlier in July.\n\nWhen Jason Holder dismissed Ayub for 57, the West Indies sensed an opening but solid contributions from Faheem Ashraf and Hasan Nawaz and a spectacular six from Mohammad Haris helped Pakistan collect 58 from their last 31 balls.\n\nPakistan dismantled their opponents’ batting order with Mohammad Nawaz removing Johnson Charles and 18-year-old Jewel Andrew — who became the youngest debutant for the West Indies in a T20 international — for 35 runs each.\n\nThe sides meet again in Lauderhill on Saturday for the second game of the three-match series before shifting to Tarouba for a three-match one-day international (ODI) series.\n\nEarlier, the Pakistan Cricket Board (PCB) had announced: “Salman Ali Agha will captain the T20I side, while fast bowlers Haris Rauf, Hasan Ali and Shaheen Shah Afridi return to the squad in this format.”\n\nThe following teams were announced for the T20Is and ODIs:\n\nT20I squad: Salman Ali Agha (captain), Abrar Ahmed, Faheem Ashraf, Fakhar Zaman, Haris Rauf, Hasan Ali, Hasan Nawaz, Hussain Talat, Khushdil Shah, Mohammad Haris (wicket-keeper), Mohammad Nawaz, Sahibzada Farhan (wicket-keeper), Saim Ayub, Shaheen Shah Afridi and Sufyan Moqim.\n\nPakistan ODI squad: Mohammad Rizwan (captain), Salman Ali Agha (vice-captain), Abdullah Shafique, Abrar Ahmed, Babar Azam, Faheem Ashraf, Fakhar Zaman, Hasan Ali, Hasan Nawaz, Hussain Talat, Mohammad Haris (wicket-keeper), Mohammad Nawaz, Naseem Shah, Saim Ayub, Shaheen Shah Afridi and Sufyan Moqim.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/01190918b7b4d80.png",
  "retrievedAt": "2025-08-16T06:45:22.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928069/pakistan-beat-west-indies-in-first-t20i-in-3-match-series",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T14:13:06.000Z"
}
