{
  "title": "Enduring Pak-China partnership to keep playing pivotal role in regional stability: COAS - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir on Friday stressed that the “enduring partnership” between Pakistan and China will continue to play a pivotal role in regional stability.\n\nPakistan and China share a longstanding strategic partnership rooted in mutual trust, economic cooperation and regional connectivity. Over the decades, ties have expanded across different sectors — including trade, energy, defence and infrastructure — with the China-Pakistan Economic Corridor (CPEC) symbolising a shared vision for development.\n\nThe army chief made the remarks at the 98th anniversary of the founding of the People’s Liberation Army (PLA) of China, which was commemorated at General Headquarters in Rawalpindi today, according to a press release by the military’s media affairs wing.\n\n“He emphasised that their enduring partnership will continue to play a pivotal role in promoting regional stability and safeguarding shared strategic interests,” said the statement by the Inter-Services Public Relations (ISPR).\n\nChina’s Ambassador to Pakistan Jiang Zaidong graced the occasion as the chief guest, while Defence Attaché Major General Wang Zhong, Chinese Embassy officials and senior military officers from the Pakistani tri-services were also present.\n\nCOAS Munir extended a warm welcome to the Chinese guests and congratulated the PLA on its 98th founding anniversary, lauding the army’s “pivotal role in China’s defence, security and nation-building”, the ISPR said.\n\nThe army chief emphasised that “despite shifting strategic dynamics, the friendship between the two nations has remained steadfast and unshakable”, according to the press release.\n\n“The COAS underscored the strength and strategic significance of Pakistan-China relations, emphasising that the bond between the two nations is unique, time-tested, and exceptionally resilient amid evolving regional and global challenges.\n\n“The Field Marshal highlighted that the Pakistan-China strategic relationship exemplifies mutual trust, unwavering support, and shared commitment,” the statement added.\n\nConcluding his address, COAS Munir “reaffirmed that the Pakistan Army and the PLA are true brothers-in-arms”, the ISPR stated.\n\nAddressing the gathering, Ambassador Zaidong expressed his sincere gratitude to the army chief for hosting the event commemorating the PLA’s 98th anniversary.\n\nHe acknowledged the steadfast role of the armed forces in the “fight against terrorism and reaffirmed China’s unwavering support for and commitment to its strategic partnership with Pakistan”, according to the ISPR.\n\nToday’s renewed affirmation of the strong bilateral ties comes just a week after COAS Munir paid an official visit to China, where he met with Vice President Han Zheng and Foreign Minister Wang Yi.\n\nDuring the visit, the Chinese leadership hailed the Pakistan Army as a “cornerstone of resilience and a vital contributor” for peace in the region.\n\nEarlier this month, Foreign Minister Ishaq Dar and his Chinese counterpart reaffirmed their commitment to strengthening bilateral cooperation and promoting regional peace, stability, and development.\n\nIn recent weeks, both countries have strengthened their cooperation in maritime, agriculture, media, disaster management and various other fields.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/01163652b72cb46.png",
  "retrievedAt": "2025-08-16T06:45:36.343Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928039/enduring-pak-china-partnership-to-keep-playing-pivotal-role-in-regional-stability-coas",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T11:46:44.000Z"
}
