{
  "title": "Tax collection rises 14pc to Rs748.6bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) collected Rs748.6bn in July, surpassing its monthly target and posting a 14 per cent year-on-year increase, signalling renewed economic momentum in the country.\n\nThe collection in July compares with Rs659bn in the same month last year. The performance reflects a promising start to the fiscal year and aligns with the government’s push for stronger enforcement and tax compliance.\n\nIn FY25, the FBR missed its annual target by nearly Rs163bn, collecting Rs11.737tr against a revised target of Rs11.9tr. However, this still represented a 26.19pc year-on-year growth from Rs9.301tr in FY24.\n\nTo maximise revenue in FY25, the FBR has announced stricter enforcement measures, including efforts to curb leakages and tax fraud. Officials anticipate notable gains through the digital monitoring of production in key industrial sectors.\n\nDigital enforcement helps FBR exceed July target\n\nIn line with commitments under the International Monetary Fund (IMF) programme, the government introduced additional revenue measures totalling Rs1.05tr in the FY25 budget. These include Rs655bn from new tax initiatives and Rs400bn from enhanced enforcement.\n\nThe revenue collection target for FY26 has been set at Rs14.131tr.\n\nThe budget focuses on sectoral relief, broadening the tax base, equitable burden-sharing, and stronger enforcement.\n\nMeasures such as a digital taxation framework, carbon levies and regulation of e-commerce and digital transactions are expected to align Pakistan’s system with global standards.\n\nIn July, the FBR issued Rs81bn in refunds and rebates, slightly up from Rs79bn in the same period last year.\n\nA breakdown of July’s collection shows income tax revenue at Rs294bn, falling short of the Rs315bn target, though still posting a 3pc rise from Rs284bn last year.\n\nSales tax collections reached Rs302bn, exceeding the Rs290bn target and up 18pc from Rs256bn a year earlier. Customs duty stood at Rs106bn, beating its Rs92bn target and rising 31pc year-on-year from Rs81bn.\n\nFederal Excise Duty (FED), however, missed its target of Rs51bn, recording Rs46bn in July. Nonetheless, this reflects a 24pc increase from Rs37bn in the same month last year.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/01083909469dad9.jpg?r=083921",
  "retrievedAt": "2025-08-16T06:47:20.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927922/tax-collection-rises-14pc-to-rs7486bn",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:45:39.000Z"
}
