{
  "title": "FBR exempts online foreign services from 5pc levy - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has exempted the 5 per cent tax on digitally imported goods and services as part of a tariff-related agreement with the United States, signalling efforts to maintain favourable trade ties and attract foreign digital businesses.\n\nAccording to a senior tax official, the exemption applies to all taxable digital supplies made by foreign entities. The legal provision itself remains intact under existing law. The Federal Board of Revenue (FBR) notified the exemption through SRO1366 of 2025, with retrospective effect from July 1, 2025.\n\nThe 5pc tax had been introduced in the FY25 budget, sparking concerns from foreign governments — particularly the United States — about its impact on cross-border digital trade. The official confirmed that a Pakistani delegation led by Finance Minister Muhammad Aurangzeb had negotiated the deal with Washington, although the specifics of the agreement remain undisclosed.\n\n“We do not have any information about the content of the deal,” the tax official said, suggesting that Pakistan may have secured reciprocal trade benefits. A commerce ministry official added that, similar to India and other countries, Pakistan may have gained market access in other sectors in exchange for the exemption.\n\nExemption to benefit global digital platforms, local freelancers; govt retains provision to reintroduce levy\n\nMinister for Information Technology Shaza Fatima Khawaja announced the exemption via her official social media account, stating: “Pakistan is open for business,” and confirming that international e-commerce companies would not be subject to the withdrawn levy.\n\nThe FBR had projected considerable revenue from the digital tax in the FY25 budget. However, the tax official did not clarify how the government plans to make up for the revenue shortfall. “I am not sure how it will be compensated,” the official said, hinting that increased exports resulting from the US deal may help offset the loss.\n\nDespite the exemption, the statutory provision for taxing digitally imported goods and services remains in place.\n\nThe federal government retains the authority to reintroduce the levy at any time, with the official citing Pakistan’s sovereign right to tax consumption at the point of destination. “We have adhered to international standards,” the official added.\n\nThe exemption is expected to benefit high-tech global firms from countries like the United States and China. The FBR clarified that the newly introduced Digital Presence Proceeds Tax will not apply to goods and services ordered online from foreign companies.\n\nThis means users of platforms such as Google, Netflix, Amazon Web Services, Zoom, and other digital utilities will no longer face the additional 5pc tax.\n\nIndustry analysts believe the move will support individuals and businesses in Pakistan reliant on international platforms. Freelancers, IT professionals, and digital entrepreneurs stand to gain significantly from the policy shift.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/311237028f521a2.png?r=144855",
  "retrievedAt": "2025-08-16T06:47:36.508Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927927/fbr-exempts-online-foreign-services-from-5pc-levy",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:45:39.000Z"
}
