{
  "title": "Trump is right about Indian economy, says Rahul Gandhi - World - DAWN.COM",
  "author": null,
  "content": "• US president criticises India for doing business with Russia, describing both economies as ‘dead’\n• Medvedev brushes aside Trump’s attack\n\nNEW DELHI: By declaring the Indian economy as dead in the water on Thursday, President Donald Trump has put Prime Minister Narendra Modi and his party in a bind. Until recently, the ruling Bharatiya Janata Party was canvassing support for the US president’s election. Its supporters were holding special prayers and muttering mystical chants for Trump’s victory. There was at least one temple created where a sculptured image of Trump was worshipped.\n\nBut Trump has ignored the lavish praise and called out India’s energy imports from Russia and its tariff regime as non-negotiable.\n\nThe Indian government said it was trying to figure out a response by consulting all the “stakeholders”, a euphemism for angry businesses whose hopes were riding on Mr Modi’s daring ability to play both sides of the street.\n\nThat appears to have hit a dead-end. Encouraging words have come from former Russian president Dmitry Medvedev who poohpoohed Mr Trump’s vitriol and continued to see a world in good cheer despite the US president’s hissed warnings.\n\nOn the other hand, opposition leader Rahul Gandhi was sanguine that Trump was right at least about the state of the Indian economy. “He [Trump] is right. Everybody knows that the Indian economy is a dead economy, except the prime minister and the finance minister. I am glad that President Trump has stated a fact.\n\n“The whole world knows – India’s economy is a dead economy and the BJP has destroyed the economy. Why did they destroy it? To help Adani,” said Mr Gandhi while speaking to reporters outside the parliament on Thursday.\n\nMr Gandhi was carefully silent about India’s Russia ties. The reference to tycoon Gautam Adani seemed more severe as the billionaire businessman close to Mr Modi is facing a corruption case in the US.\n\nRahul Gandhi’s statement came hours after Donald Trump announced on Wednesday that a 25 per cent tariff, plus a penalty, will be imposed on India starting Aug 1. The Modi government has responded to it saying that it “will take all steps necessary to secure our national interest”.\n\nLater on Wednesday, Trump mou­nted a sharp attack and said: “I don’t care what India does with Russia. They can take their dead economies down together, for all I care.”\n\nMedvedev’s ‘unmoved’\n\nIn Moscow, Mr Medvedev responded to Trump’s comments with studied calm, saying they were “nervous reaction” and are evidence that Moscow is pursuing the right path.\n\nThe US president had described Medvedev as a “failed” former leader and warned him to “watch his words”, adding that Medvedev was “entering very dangerous territory”.\n\nMedvedev was unmoved. “If some words from the former president of Russia trigger such a nervous reaction from the high-and-mighty president of the United States, then Russia is doing everything right and will continue to proceed along its own path,” Medvedev, who currently serves as deputy chairman of Russia’s security council, wrote on social media.\n\nHe also ridiculed Trump’s claim that the Russian and Indian economies were “dead” and going “down together” due to lack of cooperation with the US.\n\nMedvedev had earlier dismissed Trump’s demands for Moscow to swiftly end its military campaign against Ukraine, calling the threats of secondary sanctions against Russian energy customers “theatrical” and ineffective.\n\nTrump previously criticised the BRICS group of nations, which includes Brazil, Russia, India, China and several other states, for pursuing a new multipolar world order. The US president claimed proposed tariffs on countries doing business with BRICS members could cripple the organisation.\n\nTrump’s statement regarding India and Medvedev followed New Delhi’s refusal to accommodate US demands on trade.\n\nMr Gandhi said that the Modi government had “destroyed India’s economic, defence and foreign policy. They are running this country into the ground”.\n\nPublished in Dawn, August 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:46:30.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927951/trump-is-right-about-indian-economy-says-rahul-gandhi",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T02:23:20.000Z"
}
