{
  "title": "Israel sharpens travel warning for Israelis in UAE, cites terror threat - Pakistan - DAWN.COM",
  "author": null,
  "content": "Israel is evacuating most of its diplomatic mission staff in the United Arab Emirates after Israel’s National Security Council sharpened its travel warning for Israelis staying in the Gulf country.\n\nThe UAE’s Israeli and Jewish community has grown more visible since 2020, when the UAE became the most prominent Arab state in 30 years to establish formal ties with Israel under a US-brokered agreement dubbed the Abraham Accords.\n\n“We are emphasising this travel warning given our understanding that terrorist organisations (the Iranians, Hamas, Hezbollah and Global Jihad) are increasing their efforts to harm Israel”, the NSC said in a statement.\n\n“They are driven by heightened motivation to exact revenge following Operation Rising Lion, in addition to the anti-Israel and pro-Palestinian incitement which has intensified since the start of Operation Iron Swords, and even more so in response to Hamas’ starvation campaign,” it said, using the names for its military assaults on Iran and Gaza.\n\nThe NSC statement said “past experience” has taught Israel that “terrorist organisations often focus their efforts in neighbouring countries” and warned of possible attempts to target Israeli and Jewish individuals in the UAE, especially around Jewish holidays and Shabbat.\n\nThe NSC’s travel alert for the UAE — which remains unchanged at level III — strongly advises against non-essential travel and urges Israeli citizens to “seriously reconsider” visiting the Gulf state.\n\nThe Israeli foreign ministry spokesperson’s office did not immediately respond to a request for comment.\n\nThere was no immediate comment from the UAE’s foreign ministry.\n\nIsrael is concerned about retaliatory attacks following its recent military operation against Iran and as it faces mounting international pressure over the humanitarian crisis in the Gaza Strip.\n\nIn March, the UAE sentenced three people to death for the murder of an Israeli-Moldovan rabbi who was killed in November in the Gulf country. Such crimes are rare in the UAE, which is largely viewed as one of the safest places in the Middle East.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/011324402248097.jpg",
  "retrievedAt": "2025-08-16T06:45:44.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928031/israel-sharpens-travel-warning-for-israelis-in-uae-cites-terror-threat",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T08:40:09.000Z"
}
