{
  "title": "Thousands forced out of homes as floods hit Layyah, Taunsa - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Thousands of people in Layyah and Taunsa are forced to live under the sky as their houses and crops have been flooded after a breach in a dyke on the newly-constructed Layyah-Taunsa bridge on the Indus River.\n\nSeveral villages in Layyah were flooded after a guide embankment on the Layyah-Taunsa bridge could not bear the pressure of 300000 cusecs of river water. The water entered into several villages and devastated hundred of homes and crops. The floodwater still surround the area even after the passage of six days.\n\nIn Layyah, people were evacuated from several villages with floodwater entering cultivated lands. The same situation was observed in Dera Ghazi Khan where several villages were also submerged by water.\n\nA resident of Alliyani village, Maqbool Elahi, told Dawn that around 800,000 to 1,000,000 cusecs of water crossed these villages in the 2010 flood. That flood did not cause any harm here, but only 300,000 cusec water submerged the villages, he added.\n\nPDMA issues another flood alert as rains continue\n\nHe claimed that the guide embankment of the bridge was constructed with substandard material, and it could not bear the water pressure and washed away.\n\nHe said the government should launch an inquiry into the matter and take action against those responsible for not ensuring the safety of the embankment.\n\nHe said that thousand of acres of crops and hundreds of houses were damaged and people were forced to live under the sky. “If the flow of the river, which subsided two days ago, would again increase, then it would cause another flood as the embankment could not bear the water pressure,” he said.\n\nHe said that people of 13 union councils were affected in Layyah due to the flood and claimed the government was not taking any measure to help them.\n\nHe said that all the crops were completely damaged, while houses in two union councils either washed away or partially damaged in 11 union councils.\n\nEarlier, the Provincial Disaster Management Authority (PDMA) issued another flood alert as monsoon rains continue to lash various parts of the province.\n\nThe Met Office recorded 100mm rainfall at Faisalabad, 47mm at Gujranwala and 18mm at Jhang in the last 24 hours. Over the next 24 hours, rain is expected in most districts of Punjab, including Lahore and Rawalpindi. Eastern regions of the province are likely to experience heavy to very heavy rainfall. This weather system is expected to persist through Friday, particularly affecting Dera Ghazi Khan, Rajanpur, Bahawalpur and other southern districts.\n\nPDMA reported that Chenab River was experiencing low-level flooding at Marala, while medium-level flooding was reported at Khanki and Qadirabad. The water flow in the river had decreased compared to the previous day. The flow in the Chenab had reduced from 215,000 cusecs to 170,000 cusecs.\n\nIn the Indus River, low-level flooding was reported at Tarbela, Kalabagh, Chashma, and Taunsa. The water flow in the Jhelum, Ravi, and Sutlej rivers was at normal levels.\n\nPDMA Director General Irfan Ali Kathia said monitoring teams were working round-the-clock as the Indus River showed low-level flooding at Tarbela, Kalabagh, Chashma and Taunsa.\n\nPDMA confirmed 162 rain-related deaths this monsoon season, including four women and a child who drowned in rainwater drains. At least 558 injuries, 214 damaged homes and 121 livestock deaths have been reported across the flood-hit areas.\n\nPunjab government had directed all deputy commissioners in vulnerable districts to remain on high alert. Rescue 1122 teams were mobilised and emergency control rooms had been established.\n\nEarlier, the provincial cabinet committee on disaster management convened an emergency meeting chaired by Health Minister Khawaja Salman Rafique to review the situation.\n\nPunjab Emergency Services Secretary Dr Rizwan Naseer, Irrigation Department Secretary Wasif Khurshid, PDMA DG Irfan Ali Kathia and senior officials from relevant departments were present.\n\nThe committee approved six anti-erosion schemes worth Rs500 million to protect vulnerable communities along the Chenab and Indus rivers.\n\nPunjab Irrigation Department (PID) secretary also briefed about the construction of marginal embankments on the Jhelum River.\n\nMinister Khawaja Imran Nazir said that they were implementing immediate measures to prevent riverine erosion and special de-silting campaign of river was improving drainage.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:46:59.339Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927886/thousands-forced-out-of-homes-as-floods-hit-layyah-taunsa",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:46:00.000Z"
}
