{
  "title": "Pakistan to get first US oil shipment as Cnergyico seals import deal - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan’s largest refiner Cnergyico will import 1 million barrels of oil from Vitol in October, its Vice Chairman Usama Qureshi told Reuters on Friday, marking the country’s first-ever purchase of US crude following a landmark trade deal.\n\nThe West Texas Intermediate light crude cargo will be loaded from Houston this month and is expected to arrive in Karachi in the second half of October, Qureshi said.\n\n“This is a test spot cargo under our umbrella term agreement with Vitol. If it is commercially viable and available, we could import at least one cargo per month,” he said, adding that the shipment was not meant for resale.\n\nThe deal follows months of multiple negotiations, which first began in April, he said, after US President Donald Trump threatened to impose 29pc tariffs on imports from Pakistan.\n\nOn Thursday, Pakistan hailed a trade deal struck with the US, its top export market, and said the agreement would increase investments. The White House said on Thursday the US will charge a 19pc tariff on imports from Pakistan.\n\nQureshi said Pakistan’s finance and petroleum ministries encouraged local refineries to explore US crude imports after the April tariff announcement. Vitol did not immediately respond to a request for comment sent outside of office hours.\n\nA key China ally, Pakistan has been warming up to Trump after he threatened tariffs. It has credited US diplomatic intervention for ending recent hostilities with neighbouring India and nominated Trump for the Nobel Peace Prize.\n\nOil is Pakistan’s biggest import item, and its shipments were valued at $11.3 billion in the year ended June 30, 2025, accounting for nearly a fifth of the country’s total import bill.\n\nThe import deal will help Pakistan diversify its crude sourcing and reduce reliance on Middle Eastern suppliers, who account for nearly all of its oil imports.\n\n“Gross refining margin is on par with Gulf grades, and no blending or refinery tweaks are required,” Qureshi said.\n\nCnergyico can process 156,000 barrels of crude per day and operates the country’s only single-point mooring terminal near Karachi, enabling it to handle large tankers, unlike other refiners in Pakistan.\n\nThe company plans to install a second offshore terminal to allow larger or more frequent shipments, and to upgrade its refinery over the next five to six years, Qureshi said.\n\nThe refiner, which has been operating at an average refinery run rate of 30 to 35pc due to tepid local demand, is betting on growth in demand for oil products.\n\n“We expect run rates to rise as domestic demand strengthens and local production is prioritised over imported fuels,” Qureshi said.\n\nTrump said on Wednesday the US would also cooperate with Pakistan to develop the South Asian country’s “massive oil reserves”, without providing further details.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:45:54.160Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928002/pakistan-to-get-first-us-oil-shipment-as-cnergyico-seals-import-deal",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T06:35:02.000Z"
}
