{
  "title": "Country’s 18th polio case of this year reported in KP’s Tank - Pakistan - DAWN.COM",
  "author": null,
  "content": "A newly confirmed case of polio in Khyber Paktunkhwa’s Tank district has brought the total number of polio cases in Pakistan this year to 18, the Regional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH) in Islamabad said on Friday.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy and misinformation have slowed progress.\n\nA press release by the Pakistan Polio Eradication Programme confirmed that a 10-month-old boy from Union Council Mullazai in Tank district was confirmed as the 11th polio case from KP this year, bringing the country’s total number of cases in 2025 to 18. Last year, 74 cases were reported nationwide.\n\n“The continued detection of polio cases underscores the persistent threat to children, particularly in areas with low vaccine acceptance,” the press release said. “It is crucial for communities to understand that poliovirus can re-emerge wherever immunity gaps persist.”\n\nIt added that every unvaccinated child remained vulnerable and could also contribute to the spread of the virus.\n\nThe press release pointed out that the only effective protection for polio — a highly infectious and incurable disease that can cause lifelong paralysis — was through repeated doses of the oral polio vaccine for every child under five during each campaign, along with the timely completion of all essential immunisations.\n\nDespite “significant improvements” in the quality of polio vaccination campaigns nationwide, the laboratory said that southern districts of KP remained a key area of concern due to restricted access and operational challenges in house-to-house vaccination, leaving “thousands of children unvaccinated”.\n\nAccording to the press release, six campaigns, including four nationwide, have each reached over 45 million children since September 2024.\n\nIt added that the National Emergency Operation Centre (NEOC) plans to conduct two nationwide and one sub-national campaign between August and December this year, as well as targeted campaigns in selected high-risk districts, to help stop transmission and protect children from the virus.\n\nAs part of intensified efforts to eradicate polio in South KP, the prime minister’s Focal Person on Polio Eradication, Senator Ayesha Raza Farooq and NEOC Coordinator retired Captain Anwarul Haq held a meeting with KP Chief Secretary Shahab Ali Shah in Peshawar on Tuesday to review ongoing initiatives in the province.\n\nThe meeting focused on “campaign performance, current challenges, and targeted strategies to interrupt poliovirus transmission”, particularly in high-risk southern districts of KP, including Tank.\n\nFarooq emphasised the need to “resolve persistent access barriers and ensure the uninterrupted presence and performance of frontline vaccinators in high-risk union councils”.\n\nMeanwhile, Anwarul Haq presented a targeted strategy to improve the quality of campaigns and strengthen routine immunisation, particularly in southern KP.\n\nThe press release added, “A special planning meeting focused on South KP is scheduled to be held at the chief secretary’s office on August 2-3.”\n\nThe programme called polio eradication “a collective responsibility that requires unified efforts at all levels”.\n\n“While dedicated frontline polio workers continue to deliver life-saving vaccines, it is equally critical for parents and caregivers to ensure their children receive every dose of the polio vaccine,” it said.\n\n“Communities must play an active role by supporting vaccination efforts, dispelling misinformation, and encouraging others to protect their children through timely immunisation.”\n\nIt directed citizens to the Sehat Tahaffuz Helpline at 1166 for information, as well as the Polio Helpline on WhatsApp at 0346-7776546.\n\nLast Saturday, the NIH had confirmed three new polio cases in the country in KP and Sindh.\n\nIn June, Health Minister Mustafa Kamal claimed that Pakistan has witnessed a decline of over 99 per cent in polio cases, saying that polio eradication remains a top priority of the government.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/242023207dc21ef.jpg?r=202418",
  "retrievedAt": "2025-08-16T06:45:25.009Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928059/countrys-18th-polio-case-of-this-year-reported-in-kps-tank",
  "dateList": "2025-08-01",
  "date_published": "2025-08-01T14:44:16.000Z"
}
