{
  "title": "Arson attack by settlers kills man in West Bank - World - DAWN.COM",
  "author": null,
  "content": "SILWAD: The Palestinian Authority said Israeli settlers set fire to homes and cars in a West Bank village on Thursday, killing one man, in the latest attack in the occupied territory.\n\n“Forty-year-old Khamis Abdel-Latif Ayad was martyred due to smoke inhalation caused by fires set by settlers in citizens’ homes and vehicles in the village of Silwad at dawn,” the Palestinian health ministry said in a statement.\n\nWitnesses provided corresponding accounts of the attack on Silwad, a village in the central West Bank near several Israeli settlements.\n\nRaafat Hussein Hamed, a resident of Silwad whose house was torched in Thursday’s attack, said that “a car dropped them (the settlers) off somewhere, they burned whatever they could and then ran away.” Hamed said the assailants “come from an outpost”, referring to wildcat settlements that are illegal under Israeli law, as opposed to formally recognised settlements.\n\nAll settlements in the West Bank, which Israel has occupied since 1967, are illegal under international law.\n\nThe Palestinian Authority (PA) said some villages around Silwad also came under attack by settlers, with vehicles, homes and farmlands set ablaze.\n\nAccording to the PA’s government media office, “Israeli soldiers accompanying the settlers fired live bullets and tear gas at unarmed Palestinian civilians who tried to defend the communities.” The Israeli military said “several suspects... set fire to property and vehicles in the Silwad area”, but forces dispatched to the scene were unable to identify them.\n\nIt added that Israeli police had launched an investigation.\n\nThe West Bank is home to some three million Palestinians, who live alongside about 500,000 Israeli settlers.\n\nViolence in the territory has surged throughout the Gaza war triggered by Hamas’s October 2023 attack on Israel.\n\nEarlier this month, the Palestinian Authority and witnesses in the village of Taybeh — just southeast of Silwad — reported two arson attacks by Israeli settlers.\n\nIn 2015, a Palestinian couple and their baby burned to death after settlers attacked their village of Duma, also in the central West Bank.\n\nAccording to a tally based on PA figures, Israeli security forces and settlers have killed at least 966 Palestinians, including militants and civilians, in the West Bank since the start of the Gaza war.\n\nAt least 36 Israelis, including civilians and troops, have been killed in Palestinian attacks or during Israeli military operations over the same period, according to official figures.\n\nPublished in Dawn, Aug 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/01115229181a9dc.jpg",
  "retrievedAt": "2025-08-16T06:47:04.103Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927929/arson-attack-by-settlers-kills-man-in-west-bank",
  "dateList": "2025-08-01",
  "date_published": "2025-07-31T23:45:47.000Z"
}
