{
  "title": "Pakistan has to set target to become a share holder in Global Halal food market: Shibli Faraz",
  "link": "https://www.app.com.pk/national/pakistan-has-to-set-target-to-become-a-share-holder-in-global-halal-food-market-shibli-faraz/",
  "date_published": "2021-12-24T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):Federal Minister of Science and Technology, Senator Syed Shibli Faraz Friday said Pakistan has to set targets to become a share holder in the global Halal food market which is of over $ 750 billion.\n“All the legal formalities for Pakistan Halal Authority (PHA) have been completed and now the country has to set realistic targets to get fair share in the global Halal food market gradually through fixing the timelines”, Shibli Faraz said while addressing the `Stakeholders Session to Develop Understanding of Halal Regulations’ held here.\nThe minister said that although the Halal Authority was established in the year 2016 in papers but was non functional. “We have completed all the legal formalities regarding to PHA and now we have to determine the future targets”, he said.\nThe minister stated that the Halal Authority business laws and Halal certification is an important milestone towards ensuring the country’s vibrant share in the global Halal food market.He said that a proper campaign would be launched to educate the people on the concept of Halal food as well as Halal products. “The concept of Halal is not merely limited to the meat but it has a larger scope”, he said.\nHe said that Ministry of Science and Technology should have a key role in the socio-economic development of the country and it has started its journey in right direction to make the country self-sufficient, increase exports and earn foreign exchange.\nThe ministry is in efforts to extend benefits of all its initiatives and projects to the local people at first.\nHe said that our religion has provided us a complete code of life which meant for our welfare not for punishment. Each and every aspect of our religion has a guideline for the humanity, he added.\nPakistan carries great importance among all the Islamic countries due to its vibrant role in certain sectors and having a large population. We have resources and we can play a lead role in Islamic countries in terms of exporting Halal meat and other products.\nThe minister said that it is important to raise awareness among people about the concept of all products and the certification bodies for which the ministry will launch a campaign.\nThe country cannot rely on only earning foreign exchange through textile industry and incentivizing this sector. The other sectors could have flourish, if such facilities would be given to them, he added.\nThe minister stressed the need to diversify exports through facilitating different sectors.",
  "retrievedAt": "2025-08-11T21:45:27.829Z"
}
