{
  "title": "Housing loans facility to help low-income class own a house, boost economy: PM",
  "link": "https://www.app.com.pk/national/housing-loans-facility-to-help-low-income-class/",
  "date_published": "2021-12-24T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP): Prime Minister Imran Khan Friday said that the government’s scheme of subsidized loans for house construction would not only help the low-income group to own a house but also boost the national economy through enhanced construction activity.\nThe prime minister, addressing an event marking the approval of over Rs 100 billion housing construction loans by private banks under Mera Pakistan Mera Ghar Scheme, the prime minister said the previous governments never throught of extending such a facility to the common man.\n“This is a great moment for Pakistan because we are heading on the path which we should have opted way earlier,” the prime minister said.\nAppreciating the Finance Advisor Shaukat Tarin, State Bank Governor Raza Baqir and Naya Pakistan Housing Chairman Anwar Ali Hyder for their efforts, the prime minister particularly lauded the banks for mending their attitude toward the common man who otherwise used to consider himself an alien in a westernized atmosphere of the banks.\nHe said the salaried class never had the resources to buy a house but no one ever thought to find out the ways to support them to have the facility.\nRecalling his interactions with the overseas Pakistanis during his cricketing career, Prime Minister Imran Khan said they spent years away from their families with the greatest desire of making money to build a house back in Pakistan.\nHe told the gathering that contrary to Pakistan, it was very easy for the salaried class in the West to buy a house through mortgage finance with a very low and easily affordable interest rate.\nHe said the elite-centric decision-making was the real problem in Pakistan as the rich class used to avail banks loans and English medium education for their children.\nHe said the incumbent government was not only extending housing loan facilities to the low-income group but had also introduced single national curriculum to provide equal quality education to their children.\nSimilarly, he said similarly, the condition of the government hospitals deteriorated as the ruling elite either used to go to a private hospital or abroad for medical treatment.\nThe prime minister said the elitist mindset had greatly hurt the country as previous governments never formulated inclusive policies.\nCiting the success of the Chinese model, he said China had steered its 700 million out of poverty by uplifting its low-income group.\nPrime Minister Imran Khan said by adopting the very approach, Pakistan – a 220 million population – should have been a very strong country and powerful economy. No country, with a very low ratio of people with buying power, can excel, he added.\nThe prime minister said it was pleasing that the banks had approved over a hundred billion rupee loans for the low-income group and hoped that more people could be attracted if the scheme was properly marketed citing its ease and incentives.\nMoreover, he said the scheme would also help boost the national economy by increasing construction activity.\nHe said the foreclosure was stuck up since the 1990s but the previous government showed a blithe lack of concern for the needs of the common man.\nHe said as another incentive, the government also introduced a subsidy on the housing loan which he also promised to further increase with the improvement of the economic situation.\nEarlier, the prime minister also distributed home keys among the beneficiaries of the loan scheme as well as shields among three private banks who showed impressive performance during the process.\nFinance Advisor Shaukat Tareen spoke high for the prime minister’s relentless efforts, his decision of subsidy of Rs300,000 a house and reducing markup to just 3-4 percent.\nHe said in the past, the banks never extended loans to the low-income group but the current volume of Rs 260 billion loans applications and approval of over Rs 100 billion manifested a remarkable change.\nThe finance advisor said if desired to take the mortgage ratio to 10%, the country should provide around Rs 5.5 trillion loan within 10 years. He said the target of loans equaling 1-1.5% of GDP a year would lead the country to development.\nChairman of Naya Pakistan Housing and Development Authority Lt. General (Retd) General Anwar Ali Hyder appreciated the approval and disbursement rate of the housing loans.\nHe said six months ago, there was no concept of providing housing loans to the low-income group as no one ever paid attention to the segment.\nHe also appreciated the SBP and private banks for facilitating the common man by easing the farm and loan approval process, adding that now the microfinance banks could also participate in the program.\nState Bank Governor Raza Baqir shared the progress of the scheme since inception, highlighting that all stakeholders are taking steps in right direction to translate Prime Minister’s vision of increasing home ownership into reality.\nHe told the gathering that loans worth Rs 109 billion had been approved while the banks had received applications requesting Rs 260 billion of loan.\nHe said the banks had so far disbursed Rs 32 billion as housing loans among the applicants.\nWhile shedding light on the theme of the event, he mentioned that during the last month, banks on average approved Rs. 4 billion and disbursed Rs. 1.6 billion on weekly basis. He underscored the need to maintain and accelerate this momentum. There are six banks which disbursed over Rs. two billion each and seven banks have disbursed over Rs. 1 billion each in the span of nine months under the housing finance scheme.",
  "retrievedAt": "2025-08-11T21:45:25.780Z"
}
