{
  "title": "PTI Govt puts country on path of development: Ghulam Sarwar",
  "link": "https://www.app.com.pk/national/pti-govt-puts-country-on-path-of-development-ghulam-sarwar/",
  "date_published": "2021-12-24T16:29:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 24 (APP):Federal Minister for Aviation Ghulam Sarwar Khan on Friday said that the Pakistan Tehreek-e-Insaf (PTI) government had put the country on the path of development and the masses would soon get relief.\nAddressing a public meeting after inauguration of 10 km road project from Sangjani to Paswal, he expressed his wish that the foundation stone of the Ring Road project would also be laid in this area.\nHe informed that the rehabilitation and construction of the road project would be completed in 12 months at an estimated cost of Rs 70 million.\nGhulam Sarwar said that this area was a most backward area but, now it was on the path of development.\nPakistan’s largest Islamabad International Airport, China-Pakistan Economic Corridor and Motorway were adjacent to this area, he said adding, more facilities would be provided to the residents of this area.\nReferring to the results of local body elections in Khyber Pakhtunkhwa, the minister said that for the first time in the history of Pakistan, a leader (Prime Minister Imran Khan) after admitting defeat of his party was trying to correct the mistakes and shortcomings.\nHe said that efforts would also be made to set up a college in this area next year as the people living in this area were not only residents of his constituency rather, he had a relation of love with them.\nGhulam Sarwar said that the local body elections would be fought with the support of the residents of the area and the candidates would be announced in consultation with the residents.\nOn the occasion, Member National Assembly, Mansoor Hayat Khan and Member Punjab Assembly, Ammar Siddique Khan also addressed the public meeting.",
  "retrievedAt": "2025-08-11T21:45:20.871Z"
}
