{
  "title": "PML-N leadership discussed various options for taking action against transgressors of Constitution: Marriyum",
  "link": "https://www.app.com.pk/national/pmln-leadership-discusses-various-options-for-taking-action-against-transgressors-of-constitution-marriyum/",
  "date_published": "2022-05-11T19:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said various options were discussed under the leadership PML-N Supreme leader Muhammad Nawaz Sharif for taking a decisive action against the transgressors of the Constitution.\nIn a news statement, she said the options were came under discussion during a meeting\nchaired by Pakistan Muslim League-Nawaz Supreme leader Nawaz Sharif in London.\nShe said the PML-N leadership was unanimous in dealing with the violators of the Constitution in accordance with the law.\nShe said during the consultative meeting, PMLN leader Nawaz Sharif was briefed on the serious constitutional, economic and administrative issues inherited by the current government from the previous one.\nNawaz Sharif was also apprised on the current state of economy by a delegation of the current government, she added.\nShe said another meeting would be held on Thursday for taking final decisions to steer the country out of these challenges.\nAll the decisions would be announced with endorsement of all the coalition parties, she added.\nThe minister said the meeting was told that the prices of petroleum products had not been increased to provide relief to the masses.\nShe said the meeting was also given detail briefing on the crisis created by the Pakistan Tehreek-e-Insaf government in the energy sector, especially in form of load shedding. Besides, details were also shared as to why the oil and LNG were not imported by the\nprevious government.\nMarriyum said the meeting also discussed various proposals to help masses get rid of inflation by providing them relief.\nShe said the steps taken by the current government so far was also reviewed in detail. The government team also informed the meeting about the measures which would be taken in light of the current state of economy.\nThe minister said the current political situation was also reviewed during the meeting.",
  "retrievedAt": "2025-08-11T14:53:25.005Z"
}
