{
  "title": "Pakistan to work with international community to fight COVID-19: Bilawal",
  "link": "https://www.app.com.pk/national/pakistan-to-work-with-international-community-to-fight-covid-19-bilawal/",
  "date_published": "2022-05-12T17:04:00.000Z",
  "source": "APP",
  "content": "Foreign Minister Bilawal Bhutto Zardari stated this while participating in the 2nd Global Covid-19 Summit co-hosted, virtually, by the United States, Belize, Germany, Indonesia, and Senegal. President of the United States opened the Summit with his address followed by remarks of President of Senegal and Indonesia, Chancellor of Germany, and Prime Minister of Belize.Speaking at the second session of the Summit, “Vaccinate the World- Getting Vaccines to the Most Vulnerable”, the Foreign Minister underscored that any approach to deal with pandemic must be grounded firmly in scientific evidence and logic; responses, monitoring and evaluation should be guided by established methods of epidemiology and community medicine. It was added by the Foreign Minister that our responses must be customized to the specific and peculiar needs of our societies. Every country and region will have to devise its own strategy. One-size-fits-all approach cannot be used to battle such pandemics. By way of example, China’s dynamic Zero-COVID approach, rooted in China’s realities, was particularly successful in eliminating the virus, saving countless lives and swift economic recovery.The foreign minister emphasized that international cooperation and coordination was of fundamental importance to the success of national efforts. Health security, especially in times of pandemic, was indivisible. Microorganisms did not recognize Nation-States. “For them, we were all the same. To counter them, we must act as one,” he stressed.The foreign minister appreciated that the U.S. was generous in providing 62 million vaccines to Pakistan, and China, from the outset, supported us tremendously. Pakistan, too, provided COVID-related assistance to countries that needed it, he underlined.Foreign Minister Bilawal Bhutto Zardari underlined the importance of developing synergies with specialized agencies such as WHO, UNICEF, GAVI and COVAX to battle the scourge.To collectively fight this menace, Foreign Minister stressed that “we should avoid finger-pointing and politicking, both at national and international levels, as well as profiteering and rumor-mongering, especially when it is related to undermining the scientific evidence and hard data”. The Foreign Minister emphasized that the fight against COVID must promote international cooperation and solidarity.“It has been evidently clear in the last two years that our survival hinges on our ability to work together and platforms like these should help forge greater unity among humanity so that the battle against this menace can be won decisively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:52:42.640Z"
}
