{
  "title": "Govt pursuing constructive, skillful diplomacy: Hina Rabbani",
  "link": "https://www.app.com.pk/national/govt-pursuing-constructive-skillful-diplomacy-hina-rabbani/",
  "date_published": "2022-05-12T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar said on Thursday that the present government was pursuing a quite constructive and skillful diplomacy, keeping national interest supreme.\nSpeaking in the National Assembly, she said it was unfortunate that the previous government of Pakistan Tehreek-e-Insaf (PTI) toyed with country’s diplomacy and used it for its political gains, adding there was ‘most immature’ handling of the country’s foreign policy during the last three and half years.\n“We will only serve the state and the Pakistani nation’s interest,” she added.The minister said Pakistan wanted to open its doors to other countries and desired reciprocal action by them.\nShe said when the former prime minister Imran Khan returned from the USA after meeting with that time US President Donald Trump, he said that he had felt like winning the 92 world cup of cricket.\nThe minister said soon after the meeting the USA president, the India prime minister Narendra Modi had taken the illegal action August, 5, 2019 to change the demographic apartheid of the Indian Illegal Occupied Jammu and Kashmir (IIOJK).\nShe said the government intended to write to every OIC foreign minister regarding the situation in IIOJK. She said that it was exceptionally important to do what needed to be done in the time.\nThe minister further said there was no change in policy towards India. She said that Pakistan had a consistent stance that the country could not engage with beleaguered India in the existing circumstances. She said that Pakistan could not antagonize any country, adding that “we are not against any country”.\nShe said Pakistan wanted to improve the level of engagement with the European Union as the GSP Plus status had helped in improving the country’s exports.",
  "retrievedAt": "2025-08-11T14:53:01.182Z"
}
