{
  "title": "ECP dismisses PTI’s disqualification reference against  20 defecting MNAs",
  "link": "https://www.app.com.pk/national/ecp-dismisses-ptis-disqualification-reference-against-20-defecting-mnas/",
  "date_published": "2022-05-11T20:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): In a detailed judgment, the Election Commission of Pakistan (ECP) on Wednesday dismissed the Pakistan Tehreek-e-Insaf’s (PTI) reference against its 20 defecting members of the National Assembly for disqualification on grounds of defection under Article 63A (1) (a) of the constitution.\nA three-member panel of the ECP headed by Chief Election Commission Sikandar Sultan Raja heard the case. The Chief Election Commissioner read the verdict, which was earlier reserved by the election commission’s three-member panel.\nThe detailed order of the three-member commission which was issued later said, ” We are of the unanimous view that declarations/references have not been proved in terms of Article 63 A (1) (a) of the Constitution of Islamic Republic of Pakistan, 1973.”\nIt added, in the light of arguments of the learned counsel for the parties and material available before the commission, the members have arrived at the irresistible conclusion that the petitioner party has failed to substantiate the factum of defection as mentioned in the declaration in compliance with the provisions of Article 63A(1)(a) of the Constitution.\nThe commission said that the perusal of record reveals that the alleged defectors have neither resigned nor made any statement before the media or any other forum that they have joined any other parliamentary party.\nThe judgment said it is settled law that the issue of defection entails panel consequences resulting in de-seating the Member of Parliament. It is a well-settled principle of interpretation that a panel provision should be construed strictly and its scope should not be extended unless it is to be required by the clear language used therein or by necessary intendment.\nThe commission observed that the burden of proof squarely lies on the petitioner to prove that the respondents have practically left PTI and joined another political party. They said that the petitioner has neither attached such reliable document with reference nor been able to produce any such document that respondents have actually left PTI or tendered their resignations.\nThe order said the only reliance placed upon were the newspaper clippings and videos which were just mentioned in the notices and declarations without details and source thereof like name of news channels etc.\nThe order said that conclusive proof for joining another political party is also lacking and that all the case is built up on allegations, conjunctures and surmises.\nThe judgment said, the declarations were sent to the Commissioner on April 9, 2022, and were received to the CEC on April 11, 2022. However, from the date of receiving the declaration till date, the petitioner did not produce any reliable, credible, and authentic evidences in support of their claim.\nThe only material provided to the Commission was a copy of the show-cause notice and a copy of the declaration passed by the party head of PTI, the order added.",
  "retrievedAt": "2025-08-11T14:53:20.193Z"
}
