{
  "title": "CDA to install dancing fountain at Kashmir Chowk roundabout",
  "link": "https://www.app.com.pk/national/cda-to-install-dancing-fountain-at-kashmir-chowk-roundabout/",
  "date_published": "2022-05-12T15:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): Capital Development Authority (CDA) will install a cybernetic (dancing) water fountain at Kashmir Chowk (roundabout) to give the federal capital an attractive and tempting look.\nIt was decided in a meeting chaired by CDA chairman Aamer Ali Ahmed the other day which approved a three-dimensional image for installation of fountain.\nThe tenders will be floated in the newspapers after estimation of total cost of the fountain by the departments concerned.\nThe Environment Wing officials briefed the authority’s chairman about progress on various projects underway for beautification of Islamabad.\nThe federal apex agency, following CDA chairman directions had installed a number of dancing water fountains at various locations in the federal capital.\nThe colourful dancing fountains was a source of entertainment for people from all walks of life, as they were visually interesting and attractive. Moreover, they were an addition to the beauty of landscapes of the vicinities they had been installed in.\nFurthermore, the tranquil sound produced by the fountain was relaxing and provide an eye catching view to the visitors, visiting the fountains. The fountains have a range of laser lights that creates a three-dimensional image.\nIn addition to the installation of these fountains, different busy intersections of the city were also being decorated with colourful lights.\nMoreover, to further boost the beauty of the city, CDA had also planted flower towers in the capital in all major avenues, intersections and entry points. Furthermore, landscapes along the major avenues and at major intersections were also being revitalized to restore the natural beauty of the city.\nThe environment wing of the authority had been directed not only to install decorative fixtures in strategic public locations but also carry out landscape in the green belts along major avenues and flower beds with colourful flowering plants.",
  "retrievedAt": "2025-08-11T14:52:55.029Z"
}
