{
  "title": "Meeting held to review progress on investment , privatization",
  "link": "https://www.app.com.pk/national/meeting-held-to-review-progress-on-investment-privatization/",
  "date_published": "2024-11-28T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): In light of the recent visit of a high-level Pakistani delegation to Azerbaijan, an important review meeting was held under the chairmanship of Federal Minister for Board of Investment, Privatization and Communications Abdul Aleem Khan to ascertain the progress on investment and privatization issues.\nPakistan’s Ambassador to Azerbaijan Qasim Mohi Uddin also attended the meeting via video link and apprised that Azerbaijani Government institutions are keen in investing in Pakistan on a “G2G” model and take part in privatization of institutions.\nHe said that the investment from Azerbaijan is also under consideration in two motorways M6 and M9 in the communications sector of Pakistan. He said that he is keen to quickly resolve investment issues with Central Asian Countries and the purpose of today’s follow-up meeting is also to review the progress made in this regard.\nAleem Khan asked the Ambassador to complete his Embassy’s homework before the meeting of Joint Commission being held the two countries on December 24 & 25, this year.\nHe added that he wanted to move forward through coordinated measures in all the three sectors of Privatization, Investment and Communication for which he will soon the meeting separately with the Ambassadors of Turkey, Azerbaijan and Uzbekistan.\nAleem Khan said that on trade issues, Central Asian Countries can prove to be a gateway for Pakistan to access Eastern Europe for which we have to make our efforts. He said that Pakistan’s representation in the COP 29 held in Baku, Azerbaijan this month was prominent in the presentation by our country.\nThe federal secretaries of the privatization and communications departments and the Chairman of the National Highway Authority briefed the meeting regarding their departments and assured to deal with bilateral issues expeditiously in the light of the instructions of Federal Minister.\nThe meeting also decided to nominate a Focal Person from each department for Pakistan-Azerbaijan issues.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:42:39.906Z"
}
