{
  "title": "Kashmir Martyrs’ Day to be commemorated on February 11",
  "link": "https://www.app.com.pk/national/kashmir-martyrs-day-to-be-commemorated-on-february-11/",
  "date_published": "2023-02-10T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP): The Kashmir Martyrs’ Day (Youme Shudaha-e-Kashmir) will be commemorated on Saturday (tomorrow) with full fervor and enthusiasm to pay tributes to all Kashmiri martyrs who laid their lives for the freedom movement to get their just right to self-determination from illegal Indian occupation.\nThe Kashmir Martyrs’ Day will not only be observed on both sides of the Line of Control but all across the world by the Kashmiris to pay homage to 22 Kashmiris who were martyred in 1931 for freeing Kashmir from the brutalities of despotic Dogra rulers.\nThe Kashmiri martyrs such as Elahi Bukhshi, Afzal Guru, Burhan Wani, Maqbool Bhatt, Syed Ali Gillani, Ashraf Khan, Zakir Musa, Riaz Naiko, Ahsan Dar, Ashraf Dar, Maqbool Allai would be eulogised who were the real heroes of Kashmir.\nThe tragic day is a milestone in the history of Kashmiri struggle against foreign occupation which still continues under the Indian illegal rule. The history of Dogra rule (1846-1947) in Kashmir is replete with brutal treatment of Kashmiri Muslims by Dogra forces.\nYoume Shuhada-e-Kashmir is an ideal day for Kashmiri people to seek inspiration to carry their struggle for freedom to its logical end. At this time of distress, the people of Pakistan side with the oppressed ones in sharing the grief of Kashmiri freedom lovers.\nPakistan also observes Youme Shudaha-e-Kashmir while launching protests against the oppressive policies of Indian occupation, which keep on going against the hapless Kashmiris. The day is also a message for Indians that if the people of Kashmir did not bow down their heads before the tyranny of Dogra rule, then how they will succumb to the illegal Indian rule?\n“India would have to answer before the international court about the crimes it has committed against humanity in Kashmir. India should return the bodies of Shaheed Kashmiri leaders which it has burried in jails,” the Kashmiri leadership demanded on the occasion.\nThey added that the international community must respond to the atrocities being committed under the cloak of democracy.",
  "retrievedAt": "2025-08-11T06:01:09.873Z"
}
