{
  "title": "PTI’s 4-year rule at Centre, 10-year in KP leaves behind a trail of plunder & destruction: Marriyum",
  "link": "https://www.app.com.pk/national/ptis-4-year-rule-at-centre-10-year-in-kp-leaves-behind-a-trail-of-plunder-destruction-marriyum-2/",
  "date_published": "2023-02-10T13:33:00.000Z",
  "source": "APP",
  "content": "ABBOTTABAD, Feb 10 (APP): Federal Minister for Information and Broadcasting Marriyum Aurangzeb on Friday said the Pakistan Tehreek-e-Insaf (PTI) during its four years of rule at the Centre and 10 years in Khyber Pakhtunkhwa did nothing for the welfare of the common man rather than leaving behind a trail of plunder and destruction.\nThe incumbent government would eventually revive the economy by focusing on national development and prosperity with the ultimate objective of self-reliance, she said addressing a press conference.\nFlanked by Minister for Parliamentary Affairs Murtaza Javed Abbasi, the minister said the Imran Khan-led regime had signed the agreement with the International Monetary Fund on tough conditions and then itself violated its provisions, and the present government had no option but to renegotiate for the revival of the economy.\nShe said Pakistan Muslim League-Nawaz Quaid Nawaz Sharif as prime minister had successfully negotiated the IMF programme in 2014, and during its implementation, not a single rupee increase in the prices of daily-use commodities and utilities was witnessed. Resultantly, no burden was passed on to the common people.\nThe minister said PML-N’s Senior Vice President and Chief Organizer Maryam Nawaz had launched a campaign to reorganize the party by holding conventions and meeting with workers across the country.\nFor organizing the party in Khyber Pakhtunkhwa, Maryam Nawaz was now in Hazara Division. She had addressed a workers’ convention on Thursday and today met members of the party’s women and social media wings in Abbottabad, she added.\nShe said the PML-N Quaid had great love and affection for the people of Khyber Pakhtunkhwa, particularly of the Hazara Division. He had always taken care of the KP people, as evident by the facility of health cards which was launched from Abbottabad in 2014.\nShe said Prime Minister Shehbaz Sharif had recently inaugurated the Hazara Electric Company and it was a continuity of the legacy of Nawaz Sharif, who had given the gift of a motorway to the people of Hazara.\nMarriyum said the PML-N government had the vision to provide facilities like metro-bus, Daanish Schools, Orange Train, modern hospitals, information technology centers and universities in Khyber Pakhtunkhwa like those of Punjab, but the last PTI government did nothing in that regard.\nShe regretted that the PTI government during the last ten years had not added a new single room in the KP hospitals and schools.\nThe minister said during her last visit to the Abbottabad Press Club, she was impressed with the facilities being provided to its members, which should be emulated across the country.\nShe invited the newly-elected members of the press club for oath-taking in the Federal Capital and assured the provision of laptops and equipment for digital studio.\nMarriyum recalled the difficulties faced by journalists during the four years of PTI government and said the Ministry of Information was working on the rules for the implementation of the bill for the safety and security of journalists.\nThe bill would be sent to the Federal Cabinet next week for its approval, she said. All the stakeholders would be taken on board for the protection and security of journalists, the minister added.\nShe also announced the inclusion of the president of Abbottabad Press Club in the committee.\nThe minister said that amendments had been made in the PEMRA Act and for the first time, PFUJ had been given representation in the Council of Complaints of the Pakistan Electronic Media Regulatory Authority to redress the grievances of the electronic media.\nThe amendments, she added, had been approved by the cabinet and currently, the Cabinet’s Legislation Committee was working on them. Under the amended law, no payment of government dues would be made to those media houses which failed to pay salaries to their employees.\nShe assured that the issue of grants for the Abbottabad Press Club would be sorted out.\nTo a question, she said, the PTI members of the National Assembly had themselves submitted resignations in total disregard for the sanctity of the parliament and now wanted to return to the same House.\nThe parliament, the Election Commission of Pakistan and the judiciary could not act as per an individual’s whims rather they worked under the ambit of the Constitution, she added.\nEarlier, Abbottabad Press Club President Raja Muhammad Haroon and General Secretary Raja Munir Khan, Abbottabad Union of Journalists President Saqib Khan and General Secretary Atif Qayyum along with their members warmly welcomed Marriyum Aurangzeb on her arrival at the press club.",
  "retrievedAt": "2025-08-11T06:00:28.683Z"
}
