{
  "title": "CJP asks govt to adopt measures to stop foreign currency smuggling",
  "link": "https://www.app.com.pk/national/cjp-asks-govt-to-adopt-measures-to-stop-foreign-currency-smuggling/",
  "date_published": "2023-02-10T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP): Chief Justice of Pakistan (CJP) Justice Umar Ata Bandial on Friday asked the federal government to adopt measures to stop foreign currency smuggling.\nThe Chief Justice remarked this while heading a three-member bench comprising on Justice Ayesha A Malik and Justice Athar Minallah which heard the Federal Board of Revenue’s (FBR) petition challenging the Lahore High Court (LHC) order regarding collection of Super Tax from large scale industries.\nThe government had imposed a one-time ten percent tax on industries’ profits to ease the impact of the rising inflation on the poor.\nDuring the course of proceedings, the court consolidated all the Super Tax cases and fixed them for hearing next week.\nThe FBR counsel Faisal Siddiqui said that the LHC had suspended the implementation of its final decision in the case for 60 days.\nThere were traditions in tax cases where the court orders companies to pay 50 percent of the tax, he added.\nBarrister Farogh Naseem, counsel for the industries, said that all petitions of the FBR against the LHC’s interim order had become ineffective after the final decision of the Lahore High Court.\nThe court could not order payment of 50 percent Super Tax after petitions become ineffective, he added.\nThe Chief Justice said the case could be fixed for the hearing next week. He remarked that the FBR imposed the Super Tax in good faith.\nHe said that it was also known that Shell Pakistan, one of the petitioners, paid taxes in the millions of rupees.\nAdvocate Faisal Siddiqui said that he was representing the FBR.\nHe said that he would also represent the federal government if the country went into default.\nUpon this, the Chief Justice said that the country was not going bankrupt. Everyone need to improve themselves in the better interest of the country, he added.\nHe said that four million dollars were going out of Pakistan illegally every day. “We just need to get organized and take action,” he added.\nHe said that the situation could improve if the government took steps to stop the smuggling of foreign currency abroad.\nLater, the hearing of the case was adjourned till February 16.",
  "retrievedAt": "2025-08-11T06:00:29.159Z"
}
