{
  "title": "Wapda retains National Women’s Volleyball C’ship title",
  "link": "https://www.app.com.pk/national/wapda-retains-national-womens-volleyball-cship-title/",
  "date_published": "2023-02-10T11:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):Defending Champions Wapda retained the National Women’s Volleyball Championship title by defeating Pakistan Army in the final here at Hamidi Hall of Pakistan Sports Complex on Friday.\nWapda outplayed Pakistan Army in the final by 3-1 set with 24-26, 25-18, 25-14 and 25-20 points. Higher Education Commission (HEC) downed Sindh by 3-0 (25-18, 25-10, 25,15) in the third-position match.\nSpecial Assistant to the Prime Minister Shaza Fatima Khawaja, Senator Khushbakht Shujaat, Chairman of Pakistan Volleyball Federation, Chaudhry Muhammad Yaqoob, President of Pakistan Volleyball Federation, Chaudhry Iftikhar Ahmed, Chairperson, Women’s Volleyball Development Committee, PVF Malika Junaid and Madiha from Interwood attended the closing ceremony.\nSpeaking at the ceremony, Shaza Fatima Khawaja said sports were the top priority of the federal government and all-out efforts were being made for the promotion and encouragement of games at all levels.\nShe lauded the women players who featured in the championship and said, “Women have been working hard in every field and proving their mettle.”\n“They (women) are no less than men in any field. The government will support volleyball including all sports at all levels,” she underlined.\nShaza Fatima said efforts were underway to encourage and promote women not only in sports but in every walk of life. “Support programs for sportspersons will be launched so that young girls can come forward from the grass-roots level,” she informed.\nCh. Muhammad Yaqoob said all-out efforts were afoot to promote women’s volleyball. “Pakistan women’s team would bag the top position in the South Asian Games,” he added.\n“Pakistan will also try to qualify for the Olympics. We will emerge victorious in Asia in two years,” he said.Yaqoob also asked for the cooperate sector to come forward and support the games. “There is a need for the cooperate sector to help in promoting sports, as it is difficult for the government to do it single-handedly,” he urged and thanked all the sponsors and congratulated the Wapda team.\nMalika Junaid thanked all sponsoring teams and guests and emphasised on organising women’s volleyball events in the future to improve the game of female volleyball players in Pakistan.",
  "retrievedAt": "2025-08-11T06:00:32.386Z"
}
