{
  "title": "Pakistan to extend every possible support to quake-hit Turkiye: PM",
  "link": "https://www.app.com.pk/national/pakistan-to-extend-every-possible-support-to-quake-hit-turkiye-pm/",
  "date_published": "2023-02-10T07:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 10 (APP): Prime Minister Shehbaz Sharif on Friday said Pakistan would extend every possible support to Turkiye in the wake of catastrophic earthquake that killed and injured thousands and urged the people to donate to the Prime Minister’s relief fund.\nTalking to media here at the Lahore airport, the prime minister handed over 100 tonnes relief goods including food, medicines and winterized tents for the people of Turkiye.\nShehbaz Sharif said the people of Pakistan stand in solidarity with their brethren in distress and would do everything to help them rebuild their lives.\nHe recalled that how Turkiye had established an air bridge with Pakistan after the horrific 2005 earthquake that killed around 80,000 people in Azad Kashmir.\nThe prime minister was earlier briefed about the collection and dispatch of the relief goods from Pakistan to Turkiye and Syria. He was informed that the NDMA was coordinating and rushing relief goods from various cities of Pakistan to the quake affected areas.\n“We would leave no stone unturned to help the Turkish brethren … we have never seen such catastrophe in a century and can feel the pain and loss of the people of Turkiye,” the prime minister said and likened the people of Turkiye and Pakistan as “two hearts and one soul.”\nHe recalled that the wife of President Erdogan even had donated her precious necklace to help the people of Pakistan who lost their homes and livelihood after the 2005 earthquake.\nHe said his government had decided to turn the ongoing rescue and relief efforts for Turkiye into a nationwide support campaign.\nIn this regard, he said, the support of the business community, religious scholars and educational institutions would also be sought.\nThe prime minister said an air bridge has already been set up to transport relief good to Turkiye and the trucks of National Logistic Cell will carry 100 tonnes relief goods to Turkey via Iran.\nA PIA 777 aircraft earlier in the day carried relief goods to Turkiye from Lahore, while 30 tonnes would be airlifted from Islamabad today. Another batch of 40 tonnes relief goods will be sent from Lahore on Saturday.\nThe prime minister made an impassioned appeal to the people, the business community and the philanthropic organisations to gear up their efforts and send winterized tents, blankets, food and clothing for those who lost everything in the 7.8 magnitude earthquake.\nHe asked the people to send their donations to the Prime Minister’s Relief Fund for the earthquake in Turkiye. He said it was bitter cold in the earthquake affected areas and urgent help was required to save precious lives.\nHe said the search and rescue teams from Pakistan were already in Turkiye and lending their help in trying to rescue people trapped in the rubble. He said that he has also spoken to the chief ministers and requested them to take ownership of national relief campaign for earthquake-hit people in Turkiye. He said he has also asked the Minister for education for a campaign in the schools to collect donations from the students.\nHe also lauded caretaker Chief Minister Punjab Mohsin Naqvi for his quick response in the collection and dispatch of the relief goods.\nThe Turkish Consul General Emir Ozbay appreciated the expression of solidarity of the people and the government of Pakistan and said the two countries were tied together with strong bonds.",
  "retrievedAt": "2025-08-11T06:00:51.571Z"
}
