{
  "title": "8th Multinational Maritime Exercise AMAN-2023 & PIMEC begins at Karachi",
  "link": "https://www.app.com.pk/national/8th-multinational-maritime-exercise-aman-2023-pimec-begins-at-karachi/",
  "date_published": "2023-02-10T15:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 10 (APP): The 8th Multinational Maritime Exercise AMAN-2023 and Pakistan International Maritime Expo & Conference (PIMEC) kicked off here on Friday.\nThe flags hoisting ceremony was held at Pakistan Navy Dockyard, Karachi, to formally commence the proceedings of 8th Multinational Maritime Exercise AMAN-23, according to a press release issued here.\nAMAN-23, the 8th Exercise of the AMAN series is being held from February 10-14, 2023. A large number of senior military representatives from participating countries, observers, diplomats, and Pakistan Navy officials attended the ceremony.\nThe opening of the Exercise was marked with simultaneous hoisting of flags of all the participating nations of AMAN-23.\nThe Message of Chief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi was read during the ceremony.In his message, the Naval Chief warmly welcomed the participants of Exercise AMAN-23.\nThe Admiral underscored that the AMAN Exercise was a regular feature that involved regional and extra-regional navies to create a secure and favorable maritime environment for smooth and unhindered maritime activities in the region.\nHe further underlined that Pakistan Navy had been a forerunner in its quest for promoting collaborative maritime security in the region besides generating the camaraderie as highlighted under the Exercise motto ‘Together for Peace.’\nAdmiral Niazi emphasized that this bond would continue to grow and “bring us even closer to the cherished goals of realizing regional peace and shared prosperity.”\nSpeaking on the occasion, Commander Pakistan Fleet, Vice Admiral Ovais Ahmed Bilgrami warmly welcomed all the participants and thanked them for their wholehearted participation in the Exercise.\nHe sought their cooperation in achieving the Exercise objectives and hoped that it would prove to be mutually rewarding for all. He also acknowledged the flags of participating countries from across the globe fluttering together as an embodiment of the Exercise motto, ‘Together for Peace’.\nThe Naval chief in his message about PIMEC highlighted that Pakistan Navy being the major stakeholder in shaping the maritime thought in the country was proactively playing its role in creating the requisite maritime awareness for exploitation of untapped potential of blue economy.\nHe further underscored that this milestone event would bring together international and national stakeholders, creating a marketplace for presenting innovative ideas while showcasing maritime potential and opportunities in this dynamic field.\nThe Admiral further emphasized, “PIMEC is a platform to reaffirm our commitment and resolve towards preserving and sustainable use of oceans and marine resources, exploiting natural resources and to spur growth for collective and shared prosperity.\nThe exercise is one of the major events of Pakistan Navy held biennially to signify the commitment towards making seas safer for positive human activities while inviting regional and extra-regional navies.\nThis year the AMAN Exercise is being attended by more than 50 countries with their ships, aircraft, Special Operation Forces and a large number of observers.\nBesides, another mega event of Pakistan International Maritime Expo & Conference (PIMEC) commenced at Karachi Expo Center, a protruding initiative of Pakistan Navy under the patronage Ministry of Maritime Affairs aimed to raise awareness amongst national stakeholders and international fraternity about the huge untapped potential of Pakistan’s blue economy.\nThe opening ceremony of PIMEC was graced by Minister for Foreign Affairs Bilawal Bhutto Zardari, and the Naval chief was also present during the event. Besides, a large number of civil, military, foreign and local delegates attended the event.\nIn the background of PIMEC, International Maritime Conference has also been organized by National Institute of Maritime Affairs (NIMA), under the auspices of Pakistan Navy from February 10 to 12.\nInternational Maritime Conference would cover the thoughts of distinguished international and national scholars on the theme ‘Embracing Blue Economy: Challenges and Opportunities for Developing Countries.’\nThe maiden PIMEC has showcased overwhelming interest with the participation around 133 exhibitors, including foreign and local firms. The PIMEC will continue till February 12.",
  "retrievedAt": "2025-08-11T06:00:57.636Z"
}
