{
  "title": "President for joint efforts to treat mental health issues",
  "link": "https://www.app.com.pk/national/president-for-joint-efforts-to-treat-mental-health-issues/",
  "date_published": "2023-02-10T14:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP): President Dr Arif Alvi has called for making joint efforts towards the prevention and treatment of mental health disorders in the country as it was one of the most neglected fields in Pakistan. He added that 24% of the population in Pakistan was under mental stress and anxiety according to a survey conducted by the National Commission for Human Rights in August 2022.The President stated that 60-80% of the college students were under stress, which was a major concern that needed to be addressed by providing counselling and guidance to college students. He further said that the government was developing a helpline to advise and educate the people about the issues related to mental health and well-being.The President expressed these views while chairing a virtual meeting on mental health, at President House on Friday. Chief Executive of the British Asian Trust (BAT), Richard Hawkes, and Chair of the British-Pakistani Psychiatrists Association (BPPA), Dr Shahid Latif, joined the meeting via video link.The representatives of the Caretech Charitable Foundation, Global Institute of Human Development, and members of the British-Pakistani Psychiatric Association and Pakistani diaspora in the UK also participated in the meeting virtually.Addressing the participants, the President highlighted the need for collaborative networking between mental health professionals working in and outside Pakistan as well as non-governmental organizations (NGOs) to increase the accessibility and affordability of mental healthcare in Pakistan.He regretted that due to the acute shortage of mental health professionals and lack of resources and awareness about mental disorders in Pakistan, the majority of psychiatric patients either went untreated or consulted traditional faith and religious healers.He said that there were almost 2000 mental health professionals in Pakistan who were unable to provide proper treatment and counselling to 24% of the population suffering from some form of mental issue.The President said that the availability of cutting-edge and quality healthcare to the masses could be ensured by working together to build standardized systems.He informed that existing helplines/chatbots would be integrated into a single national mental health helpline/chatbots, which would be launched in the form of a one-year pilot project. He emphasised the need for launching an awareness campaign regarding mental health to educate the people about the importance of counselling and treatment.While addressing the meeting from the UK, First Lady Begum Samina Alvi said that the high mortality rate due to breast cancer and lack of facilities for persons with disabilities (PWDs) were among the major social and health issues in Pakistan. She added that Pakistan had the highest mortality rate in the world due to breast cancer for a lack of awareness about its symptoms and late diagnosis of the disease. She also highlighted the efforts made by her for raising awareness about the disease as well as the rights and facilitation of PWDs.The President urged the trained counsellors of Pakistani origin in the UK to volunteer for online counselling of patients in Pakistan and called for the support of the British Pakistani Psychiatrists Association for this cause. He also appreciated the role of overseas medical professionals of Pakistani origin for contributing to the betterment of the country.The participants lauded the important initiative taken by the President and his keen interest in raising awareness about mental health and well-being in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T06:01:08.532Z"
}
