{
  "title": "Muslim Hands provides over 20 houses to flood victims in Mastung, Jafarabad",
  "link": "https://www.app.com.pk/national/muslim-hands-provides-over-20-houses-to-flood-victims-in-mastung-jafarabad/",
  "date_published": "2023-02-10T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP):The “Muslim Hands” active in relief, rehabilitation, and reconstruction projects in flood-hit areas of the country have handed over 20 houses to flood victims in Mastung and Jafarabad while the construction of around 200 other houses has entered the final stage.\nExecutive Director of Muslim Hands in Pakistan, Syed Javed Gilani told APP on Thursday that Muslim Hands has successfully reached 1 million beneficiaries through its Emergency response in flood-affected regions across Pakistan during the past six months. The organization perpetrated about USD 8 million for rescue, relief, and rehabilitation projects out of which USD 4 million have been spent/disbursed.\n“We are constructing hundreds of disaster resilience houses in Mastung, Jaferabad, and Badin out of which 90 percent has been entered in the final stage while more than 20 houses have already been handed over to the flood affectees” Gilani added.\nHe told that 222,928 people were provided with ready meals, and food baskets, 4,782 with winter kits, and 4,527 with other Non-Food Items. In the health sector, 259 medical camps and 10 basic health centers were established where more than 120,000 people were provided with free check-up medicines and other health facilities apart from 2400 herbal medicine and 64 wheelchairs.\nSyed Javed Gilani further informed that 4,902 people were provided with employment support which includes shops, rickshaws, agricultural equipment kits (fertilizers, seeds, tools), and other skill-based kits.\n“We also provided temporary shelters to more than 33,000 people which includes tents, community centers, and shelter kits while clean drinking water facilities (bottles, wells, water pumps, filtration plant) have also been provided to 544,000 people,” he said.\nSyed Javed Gilani said that despite its own resources the Muslim Hands has also provided relief to millions of victims with the support of UNICEF, USAID, Concern Worldwide, and the Turkish Organization TIKA.\nGilani appreciated the great cooperation and efforts of the Government of Pakistan, NDMA, PDMAs, and other stakeholders and donors during the relief operations in the flood-affected areas.",
  "retrievedAt": "2025-08-11T06:00:34.920Z"
}
