{
  "title": "Japan provides $12.7 mln for upgrading girls’ primary schools in Sindh",
  "link": "https://www.app.com.pk/national/japan-provides-12-7-mln-for-upgrading-girls-primary-schools-in-sindh/",
  "date_published": "2023-02-10T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):The Government of Japan has agreed to provide new grant assistance worth around $12.7 million (Rs. 3,510 million PKR) for upgrading girls’ primary schools into elementary schools in rural Sindh.\nAmbassador of Japan WADA Mitsuhiro, Chief Representative of Japan International Cooperation Agency (JICA) KINOSHITA Yasumitsu, Secretary, Ministry of Economic Affairs Dr. Kazim Niaz, attended the signing ceremony for the assistance at the Ministry of Economic Affairs, said a news release issued here by Japan embassy in Pakistan on Friday.\nThe project has been conceived keeping in view the fact that the number of middle, and elementary schools is much lower (2,162) than the primary schools (35,377) in rural Sindh.This particular issue is also adversely affecting primary school students’ retention and is the biggest cause of students’ dropout from school.\nThe net enrollment rate for lower-secondary education (grades 6-8) is 49% (boys 53%, girls 45%). Girls in government schools drop out drastically from primary education as middle or high schools are not available in close vicinity, particularly in rural Sindh.\nAccording to Alif Alan, the accessibility distance hinders girls’ education more (13 % dropout due to access) than boys (5 % dropout due to access).The project aimed to improve access to girls’ middle education by providing school facilities for female students in rural areas of Sindh Province.\nThis is the third grant aid through which Japan will be upgrading 20 new girls’ primary schools into elementary schools, which brings the total number of schools provided with Japan’s assistance to 74.The assistance contributes to improving the school enrollment rate and gender equality in the target areas, contributing to SDGs Goals 4 (Quality education) and 5 (Gender equality).\nOn the occasion, WADA Mitsuhiro said, “This project will also be implemented in the areas affected by the devastating flood last year. The project will contribute to the reconstruction efforts of the Pakistani people. And, it is my hope that girls educated in these schools will play an active role in various fields in Pakistan.”\nMr. KINOSHITA, while speaking at the event said ” As some of the target districts of the project were affected by the flood last year, we hope that the new grant aid project will bring hope back to the brave and resilient girl students and keep them motivated so that they remain on track for “learning continuity”, during the post floods recovery phase”.",
  "retrievedAt": "2025-08-11T06:00:27.851Z"
}
