{
  "title": "Six reports of standing committees presented in Senate",
  "link": "https://www.app.com.pk/national/six-reports-of-standing-committees-presented-in-senate-3/",
  "date_published": "2023-02-10T08:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP): As many as six reports of various standing committees including the number of detained Pakistani in Guantanamo Bay jail, details of postings of incumbent Civil Aviation Authority director general and incidents of target killings in South and North Waziristan districts were presented in the Senate on Friday.\nSenator Abida Muhammad Azeem on behalf of the Standing Committee on Human Rights Chairman Senator Walid Iqbal presented the report of the committee on the subject matter of starred question number 14 asked by Senator Mushtaq Ahmed on 4th January, 2022, regarding the number of Pakistani citizens who are currently detained in Guantanamo Bay jail indicating the nature of cases filed against them and duration of imprisonment with separate details of each Pakistani detainee.\nStanding Committee on Aviation Chairman Senator Hidayat Ullah presented a report of the committee on the subject matter of starred question number two asked by Senator Naseebullah Bazai on 5th November 2021, regarding details of postings of incumbent Civil Aviation Authority director general, during the last fifteen years, indicating designations, tenure and places of postings.\nHe also presented report of the committee on the subject matter of starred question number four asked by Senator Bahramand Khan Tangi on 5th November 2021, regarding service/group to which the current, Civil Aviation Authority director general, belongs and what is his substantive pay scale.\nHe further presented report of the committee on the subject matter of starred question number five asked by Senator Bahramand Khan Tangi on 5th November 2021, regarding the incumbent, Civil Aviation Authority director general, is not a professional having experience in Aviation field but rather an officer of Pakistan Administrative Service, if so, the reasons thereof.\nIn addition, he presented report of the committee on the subject matter of starred question number three asked by Senator Naseebullah Bazai on 11th January 2022, regarding personal staff posted with the current, Civil Aviation Authority director general, their grade-wise details and mode of appointment.\nSenator Saif Ullah Abro on behalf of the Standing Committee on Interior Senator Mohsin Aziz presented report of the committee on a point of public importance raised by Senator Mushtaq Ahmed on 4th August 2022, regarding the incidents of target killings in South and North Waziristan districts.\nSenator Abida Muhammad Azeem on behalf of the Standing Committee on Human Rights Chairman Senator Walid Iqbal moved under Sub-Rule (1) of Rule 194 of the Rules of Procedure and Conduct of Business in the Senate, 2012, that the time for the presentation of the report of the committee on a point of public importance raised by Senator Keshoo Bai on 14th February 2022, regarding implementation of recommendations of the Functional Committee on Human Rights with respect to treatment of a child by K-electric, may be extended for a period of three days with effect from 12th February, 2023.",
  "retrievedAt": "2025-08-11T06:00:47.066Z"
}
