{
  "title": "Senator Mushtaq grills new cabinet members for absence in Senate session",
  "link": "https://www.app.com.pk/national/senator-mushtaq-grills-new-cabinet-members-for-absence-in-senate-session/",
  "date_published": "2023-02-10T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP): Senator Mushtaq Ahmad Khan from Jamaat-e-Islami Pakistan (JIP) on Friday grilled the new cabinet members for remaining absent from the Senate proceedings and demanded the Chairman Senate to write to the Prime Minister to take notice of their negligence.\nWhile taking to the House, the JIP Senator in supplementary query during the question hour told the Upper House members and the Chairman that some five new ministers were included in the federal cabinet swelling it upto 88 members.\nSenator Mushtaq said, “It will take till March for the cabinet to score a century. The Prime Minister would appoint a special minister to keep count of his cabinet ministers. It’s the biggest cabinet in the world.”\nThe Senator regretted that the newly appointed ministers were unfamiliar to him and other members of the House. “We don’t even know them. None of the minister added to the cabinet recently have appeared in the Senate Sessions,” he added.\nChairman Senate Sadiq Sanjrani directed the Secretary of the Senate Secretariat to write a note to the Prime Minister to inform that his ministers did not attend the Senate meeting.\nReferring to his question, he said the Guns and Country Club (GCC) audit comprised of 88 paras which should be briefed in detail since its inception in 2018 till 2022.\nOn the question of Senator Bahramand Khan Tung on educational institutions, Senator Mushtaq said the reply to his questions were incomplete.\n“The universities’ fees are high and they are facing financial crisis. The Minister of State for Law should inform that what plan does government has to provide quality education to poor masses on merit and why universities are in financial crisis?” he added.\nMinister of State for Law, Shahadat Awan in his response said the Supreme Court had taken up the GCC matter. He added that all the matters related to GCC were managed by the Supreme Court and had ordered a special audit of the GCC. The Chairman GCC had appointed A.F. Ferguson to conduct the audit. The GCC Committee Member Naeem Bokhari had also given his terms of reference (TORs) for the audit, he said, “This entire audit has been done by Ferguson. It is all monitored under the supervision of the Supreme Court. The House is requested to avoid intervening in the matters of other departments,” he added.\nThe Minister of State said that the agenda item should be referred to the Senate Committee on Law. The Chairman Senate ordered the matter to be sent to the Committee.\nSenator Bahramand Khan Tungi of Pakistan Peoples Party Parliamentarians (PPPP) on his question in supplementary query said the breakup of the funds provided to the universities was not provided in the Ministry’s response.\nReferring to the details he said the National University of Technology, National Skill University, and Health Services Academy, Islamabad were established after the enactment of legislation. “I ask how many universities in the Capital have been created after passing laws and how much funds have been released to them?” he added.\nMinister of State for Law, Shahadat Awan informed that some four universities were created in Khyber Pakhtunkhwa (KP) from 2019-21. He added that no universities were in crisis and every day enactments were being made in the Senate for creation of new universities.\nSenator Dr. Zarqa Suharwardy Taimur of Pakistan Tehreek-e-Insaf (PTI) on her point of order demanded the Minister of State to respond on his mandate to answer queries related to the nationwide institutions as his prerogative was limited to the Islamabad Capital Territory.\n“There are 174 universities across the country and the Federal Ministry is only limited to the Capital,” she added. Shahdat Awan replied, “I want to correct the madam senator that there are 248 total universities across the country and I have only provided my replies pertaining to federal capital level.”\nSenator Falak Naz of PTI on the supplementary query on her question related to incomplete Chitral-Shandur Road project said the project work was halted by the PDM government whereas the previous government had allocated Rs45 billion for the scheme.\nSenator Saifullah Abro of PTI on his point of order further added to her query and said the overall allocation so far was not 10% of the total project cost and it was not viable to complete it by 2024.\nThe Minister of State added that the PC-I of the road project was approved by former Prime Minister Shahid Khaqqan Abbasi in 2017. The project work was underway and 12.2% progress was made so far on the site. The construction work was mostly halted due to snowfall and inclement weather conditions, he added.\nDespite weather, he said there were other problems, the road needed to be widened 24 feet further with a 10 feet shoulder to be developed across the road. “NHA under its own specification construction of the project will need to procure more land. But the KP department of mines is intervening and not cooperating in the process. The Chitral-Shandur Road will be completed by 2024,” he added.",
  "retrievedAt": "2025-08-11T06:00:40.023Z"
}
