{
  "title": "Punjab cabinet approves minimum support price of sugarcane",
  "link": "https://www.app.com.pk/national/punjab-cabinet-approves-minimum-support-price-of-sugarcane/",
  "date_published": "2020-11-17T16:23:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 17 (APP): The provincial cabinet, which met under the chair of Punjab Chief Minister Sardar Usman Buzdar at his office on Tuesday, gave ex post facto approval to fix Rs 200 per maund minimum support price of sugarcane along with the approval of transportation charges and sugarcane development cess.\nThe meeting also decided to constitute a ministerial committee for the procurement of additional imported sugar. This committee will submit recommendations after a review of sugar stock. The meeting stressed the sugarcane growers will be given a full reward of their hard work during the crushing season and legal action will be initiated against those failing in timely payments.\nThe cabinet allowed the Food department to enter into an agreement with PASSCO (Pakistan Agriculture Shortage and Service Corporation) for the purchase of 63,000 metric ton imported wheat.\nThe participants expressed satisfaction over the stabilization of prices of flour and sugar.\nIt decided to secure implementation of 3 per cent job quota for the visually-impaired and approved a further five-year age relaxation for employment purposes. Now, the visually-impaired candidates will enjoy up to 15-year relaxation.\nThe meeting also approved the draft law of the 17-member Punjab Tourism, Culture and Heritage Authority with the CM and Tourism minister as its Chairman and vice-chairman, respectively. The authority will work for the promotion of tourism and culture.\nThe meeting decided in principle to lift the ban on the lease of coal mines and also gave in principle approval to lift the ban on renewal of the mines leases. The meeting decided to constitute a ministerial committee to dispose of the aeroplane (AP-BX/400-A, RK-80) grounded since 2004.\nThis committee will submit its report after reviewing different options including auction.\nThe meeting approved setting up Rescue 1122 station in Khairpur Tamewali tehsil of Bahawalpur while the release of NOC for transfer of 6-kanal land of Tehsil Council Jhang for setting up another Rescue 1122 station was also approved.\nThe appointment of the registrar for the University of Jhang was approved along with the decision to hand over assets of Inland Water Transport Company to the Tourism Department. The meeting decided to resolve the matter of acquisition of land for Greater Thal Canal Project Chaubara Branch phase-II and it was further decided to process the case with Asian Development Bank. The 448 miles long Greater Thal Canal will irrigate 290,000 acres of land.\nThe meeting decided to relax rules for the appointment of senior registrars posted in hepatology, liver hepatology and medical ICU from 2019. Meanwhile, approval was granted to issue notification of the medical teaching institute under Section 3(1) of the Medical Teaching Institute Act.\nIt was also decided to implement the MTI Act at Khawaja Safdar Medical College Sialkot. The participants approved to bring King Edward Medical College under King Edward Medical University.\nThe cabinet also approved a south Punjab reallocation allowance for the officers posted in south Punjab secretariat. As many as 655 posts have been created for 17 departments in this paperless secretariat, 237 posts will be in grade 17 and above. As many as 154 IT officials will also be posted beside the miscellaneous staff of 264 officials.\nThe meeting approved further extension in the registration date of online registration with the charity commission.\nThe cabinet standing committee for finance and development will take stock of matters relating to the release of a letter of comfort or bridge financing for land requisition for Ravi Urban Development Authority.\nThe cabinet approved to present annual reports of Punjab Information Commission to Punjab Assembly and appointment of regular president/CEO of Punjab Cooperative Bank Limited. It also approved the appointment of Dr Arfa Iqbal as CEO Punjab Board of Investment and Trade.\nThe cabinet standing committee for legislation will submit its report to the cabinet regarding permanent appointments under Rule 17. The next cabinet meeting will be held in DG Khan.\nProvincial ministers, advisors, special assistants, chief secretary and others attended the meeting.",
  "retrievedAt": "2025-08-11T20:01:35.219Z"
}
