{
  "title": "As against rising trends of intolerance worldwide, Pakistan promoting tolerance: FM",
  "link": "https://www.app.com.pk/national/as-against-rising-trends-of-intolerance-worldwide-pakistan-promoting-tolerance-fm/",
  "date_published": "2020-11-17T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP):Foreign Minister Makhdoom Shah Mehmood Qureshi Tuesday said as against the worldwide rising trends of intolerance, Pakistan with a representative parliament and protecting the rights of minorities was promoting tolerance in the society.\nHe was speaking at an event on the theme of “Tolerance in Contemporary Times” organized here at the Ministry of Foreign Affairs to observe the International Day of Tolerance.\nThe event was attended by Parliamentary Secretary for Foreign Affairs Ms Andleeb Abbas, as well as high-level representatives of the United Nations, members of the diplomatic community and senior government officials.\nThe foreign minister said with a flourishing democracy, Pakistan had a distinguished parliament with representation from all segments of the society, including the minorities.\nAt a time when there were rising trends of intolerance internationally, the representation of Christians, Hindus, Sikhs and other minorities in the parliament, besides promoting tolerance, gave a message of inter-faith harmony and coexistence in Pakistan, he added.\nThe foreign minister said the launching of Kartarpur Corridor by the present government, which also gave the message of religious harmony and coexistence, was in line with the Islamic values and the country’s Constitution, which provided the protection of minorities and their basic fundamental rights.\nHe further said that in the current situation of COVID-19 pandemic where people were feeling insecure across the world, the promotion of tolerance was very important.\nThe foreign minister referred to the situation in a neighboring country, which was giving mixed signals with rise in intolerance, extremist ideology taking over and the rights of minorities being ignored through new discriminatory laws.\nContrary to that, he said, Pakistan had sent a clear message to the world that all ethnic and religious segments in the country were well protected.\nHe expressed his confidence that the event would help further promote tolerance in the country and the society.\nThe foreign minister highlighted the importance of inclusion, peaceful co-existence and respect for different religious beliefs, values and cultures.\nHe noted that the Pakistani society was inherently tolerant, being the product of millennia old civilization with a rich heritage.\nQureshi recalled that in its historic Kartarpur Corridor initiative, Pakistan had opened the largest and holiest Sikh shrines in Kartarpur to Sikhs from India and elsewhere.\nHe also called for addressing the growing trend of Islamophobia and intolerance world over.\nThe parliamentary secretary for foreign affairs reiterated Prime Minister Imran Khan’s call for universally outlawing willful provocation and incitement to hate and violence, and to designate an International Day to Combat Islamophobia.\nShe regretted that the Hindutva inspired RSS-BJP regime in India had institutionalized Islamophobia as the state policy. Its worst manifestation was the treatment being meted out to the people of Indian Illegally Occupied Jammu & Kashmir (IIOJK), who were being subjected to the most egregious human rights violations.\nMs Andleeb Abbas also called for promoting tolerance and mutual understanding among the people of all faiths.\nRenowned panelists, including Dr Qibla Ayaz, Bishop Humphrey Sarfaraz Peters, Kishan Sharma and Taranjeet Singh – representing the Muslim, Christian, Hindu, and Sikh communities in Pakistan – echoed the message of inter-faith harmony.\nThey emphasized that the minorities of Pakistan enjoyed equal rights as citizens of the country and actively participated in all walks of life.\nVideo messages from Professor of Psychiatry Dr Mowadat Rana, Baroness Sayeeda Warsi, and Islamic scholar and anthropologist Akbar S Ahmed were played at the event.\nThe participants were also provided with an overview of Pakistan’s efforts and activities at the UN and other multilateral fora for combating intolerance, and promoting inter-faith and cultural harmony.\nThe International Day for Tolerance is celebrated each year on November 16, to promote respect, acceptance and appreciation of the rich diversity of the world’s cultures, forms of expression and ways of being human.",
  "retrievedAt": "2025-08-11T20:01:37.234Z"
}
