{
  "title": "Int’l community’s promise of right of self-determination remains unfulfilled: Speakers",
  "link": "https://www.app.com.pk/national/intl-communitys-promise-of-right-of-self-determination-remains-unfulfilled-speakers/",
  "date_published": "2022-01-05T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 05 (APP): The Speakers at the Round Table titled “Commemorating Kashmiris’ Right to Self-Determination Day” organised by the India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI) on Wednesday said on January 05, 1949, the international community promised Kashmiris to get them the right of self-determination and free and fair plebiscite would be held according to the wishes of Kashmiris that remained unfulfilled.\nSpeaking on the occasion, Director ISC, Dr. Saif ur Rehman Malik said that ISC focuses on all events pertaining to Kashmir and commemorate the special days on Kashmir.\nThe ISC at ISSI was commemorating the Right to Self-Determination Day with the aim of highlighting the Kashmir cause, he added.\nIn his welcome remarks Ambassador Aizaz Ahmad Chaudhary, DG ISSI said, “Today is the special day in the annals of the Kashmir.”\nDG ISSI in his speech gave a reference of his op-ed titled “Self-determination” published today on January 05, 2022 in Dawn Newspaper in which he articulated that imagine yourself as a Kashmiri born in Srinagar on Jan 5, 1949.\n“You are 73 years old, and have completed nearly every phase of your life. But at every stage, you were reminded that you were not free, that you were under Indian occupation, a kind of colonial rule. Kashmiris do not want to live with India and the day is reminder for us that Kashmiris must be granted self-determination,” he added.\nNasir Qadri, Advocate, a Human Rights Lawyer from IIOJK also heads the Legal Forum for Kashmir (LFK). He opined that Kashmir deserves the right to self-determination. We have seen Kashmir through a small prism, but we need to look Kashmir through the lens of armed conflict. We are losing the ground and losing the case and Pakistan has to recognize the Kashmir liberation movement, he added.\nDr. Waleed Rasool Sheikh, Director General at Institute of Multi-Track Dialogue, Development and Diplomatic Studies maintained that the primary responsibility of presenting a solution for Kashmir issue rests on the shoulders of academicians and scholars who are not consulted enough.\nHe highlighted the fragility of the international system and criticized the fact that it is manipulated by countries for their own benefits. In this case, he mentioned the instance of India breaching the sovereignty of Pakistan in 1971 in Bengal, breaching Simla agreement and international protocols again in 1984 in Siachen yet no legal action was taken against it by the international community.",
  "retrievedAt": "2025-08-11T14:01:23.849Z"
}
