{
  "title": "PML-N investment on Akbar S Babar in vain as PTI vindicated in foreign funding case: Farrukh",
  "link": "https://www.app.com.pk/national/pml-n-investment-on-akbar-s-babar-in-vain/",
  "date_published": "2022-01-05T16:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Wednesday accused former Pakistan Tehreek-e-Insaf (PTI) leader Akbar S Babar of getting an ‘easyload’ from the PML-N to file a frivolous petition against the foreign funding of ruling party.\n“The Pakistan Muslim League-Nawaz (PML-N) has been trying to give an impression that the PTI was taking funds from foreign countries or multinationals asking it to work against the national interest,” the minister said in a news conference.\nMocking the PML-N for its ‘failed financial investment’ on Akbar S Babar, who totally misled the party on the PTI’s foreign funding and the former misled the nation on that count.“Those who used to give an easyload to Akbar S Babar have wasted their money and time,” he said, adding the PTI stood vindicated as the scrutiny committee of Election Commission of Pakistan (ECP) perused its financial documents.\nAs Akbar S Babar was on the PML-N’s payroll, he had to provide every ‘misleading’ information, he added.“English [language] troubles the PML-N,” the minister said, recalling the embarrassment faced by its leaders after celebrations sans reading of the decision on the Panama Paper case.Farrukh also lashed out at the PML-N leaders for their analysis without going through the scrutiny committee’s report.\nHe said it was the PTI which had introduced culture of ‘political fund raising’ in the country by collecting funds from the overseas Pakistanis.He noted that after the 9/11 incident, the laws were stiffened in the United States (US) where registration needed if remittances exceeded over $30.\n“It was stated in the last para of the scrutiny committee report’s page 81 that the petitioner should have provided authentic information, but failed. Even, the report of Ahsan S Ahsan was not accepted,” the minister maintained.As regards some media reports that funds amounting to Rs 310 million, out of the total funding of Rs 1.68 billion received by the PTI, he said it had been clarified that the amount was counted twice.\nNo transaction was made from some accounts, while few of them were with ‘zero-balance’, he added.He said all the funds poured in the PTI accounts through legal means as unlike other political parties, it had an elaborate and legal system maintained by top-ranking chartered accountants.The minister said Prime Minister Imran Khan was a ‘bold’ leader and the PTI believed in transparency. The ruling party had not only defended its foreign funding sources but also made startling facts against the others public.\nHe dared the PML-N and the Pakistan Peoples Party (PPP) to present record of a few people who funded them from abroad. Both the parties should come forward and present details about their accounts before the scrutiny committee.The minister said he had urged the ECP to direct its scrutiny committees to furnish reports on bank accounts relating to the foreign funding of PML-N and the PPP.\nBoth the opposition parties, he said, had no right to comment on the scrutiny report on the PTI’s funding as they themselves had concealed their bank accounts from the ECP and had no any record in that regard.They should better address to the questions regarding the funds received through Illegal means, he added.\nFarrukh said the PPP kept nine accounts secret from the ECP in 2013, 11 of them in 2014 and 10 in 2015. It had no record of the funds amounting to Rs 350 million.The perusal of PML-N financial documents by the PTI financial experts, he said, had revealed that nine accounts were hidden by the party from the ECP. The party only managed to submit bank statements of two such accounts when it was revealed that it kept some nine secret accounts.\nFunds amounting to Rs 620 million poured in their accounts, but they had no record of donations amounting to Rs 450 million, he added.Farrukh said limited companies were registered by the PML-N in the US and the United Kingdom (UK) bearing numbers 6521 and 9781563, respectively, which were involved in commercial activities, including poultry and other items.\nSimilarly, he said, the PPP also had a registered company abroad, with Asif Zardari its head.To a query, he said Jamiat Ulema-e-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman admitted that he himself, Zardari and Nawaz had committed corruption.Fazlur Rehman should get ready to give details of the funding received from Libya, he said, accusing him of building his party secretariat in Peshawar through foreign funding.",
  "retrievedAt": "2025-08-11T14:01:12.519Z"
}
