{
  "title": "Spread of Omicron virus imminent in country: Asad Umar",
  "link": "https://www.app.com.pk/national/spread-of-omicron-imminent-in-country/",
  "date_published": "2022-01-05T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Minister for Planning, Development, and Special Initiatives Asad Umar Wednesday said that like in other parts of the world, the new variant of COVID-19 named Omicron was also spreading rapidly in Pakistan and feared that the virus would spread even more quickly in days to come.\nThe minster said vaccination and following Standard Operating Procedures (SOPs) were the only way out to avoid spread of the new variant-Omicron.\nAddressing a media briefing along with Special Assistant to Prime Minister on Health Dr Faisal Sultan here after chairing a meeting of National Command and Operation Center (NCOC), Asad Umar dispelled the impression that the virus was not as fatal as the other variants of COVID, saying that the number of hospitalized patients in South Africa, UK, and USA increased manifold after spread of Omicron.\nHowever, the most important is that how far the vaccination played role in mitigating the effects of this virus, he added.\nHe said as per information, the areas where vaccination ratio was high, the impact of the new variant was far low compared to the places where the vaccination ratio was low.\nHe called upon the people to strictly follow SOPs so that the impact should be contained to minimum level.\nThe NCOC Chief said that in South Africa number of Omicron cases increased by 3500% from 116 to 25000 within four weeks while the number of patients hospitalized rose by 700% in the same period.\nSimilarly, he said number of cases in USA and UK increased by 400% and 292% respectively in four weeks while that of hospitalized patients increased by 92% and 132% respectively.\nHe informed that in Pakistan 60% cases were reported from two major cities-Karachi and Lahore. “During last two weeks, the virus spread at a pace of 66% in Sindh province overall while it spread by 984% in Karachi alone,” he said adding the spread ratio in Punjab was recorded at 190% in one wee.\nHowever he said this is just beginning in Pakistan that would spread more quickly in coming days.\n“I urge all the people to vaccinate themselves as soon as possible if they have not vaccinated yet.” He said specially the elderly and women must inoculate themselves.",
  "retrievedAt": "2025-08-11T14:01:20.800Z"
}
