{
  "title": "Pakistan strongly condemns extra-judicial killing of seven more Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK)",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-the-extra-judicial-killing-of-seven-more-kashmiris-in-indian-illegally-occupied-jammu-and-kashmir-iiojk/",
  "date_published": "2022-01-05T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Pakistan on Wednesday strongly condemned the “relentless killing spree” by Indian occupation forces’ that led to martyrdom of three more Kashmiris in Pulwama district in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAlarmingly, the past few days have seen a distinct spike in India’s state-terrorism, as evident in the staggering numbers – at least 7 innocent Kashmiris have been martyred in the last 72 hours in different parts of IIOJK, the Foreign Office said in a statement.\n“The intensified military crackdown and the rising numbers of extra-judicial killings in fake encounters and staged operations in IIOJK are part of the extremist anti-Muslim designs of the “Hindutva” inspired BJP-RSS combine in India,” the Foreign Office said in a statement.\n“In the most inhuman practice, the Indian occupation forces are also refusing to hand over the mortal remains of the martyred Kashmiris to their families for proper burials,” the statement from the office of the spokesperson said.\nThe Foreign Office said that despite continued repression and blatant violations of human rights and international humanitarian law in IIOJK, “the Kashmiri people stand firm in their just and valiant struggle for self-determination.”\n“India must know that no amount of its brutalities and repression can break the will of the Kashmiri people.”\nPakistan also reiterated its call for investigation of extra-judicial killings in IIOJK by the Commission of Inquiry as recommended by the Office of the United Nations High Commissioner for Human Rights (OHCHR) in its Kashmir reports of 2018 and 2019.\nIt urged the international community to play its role for a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UNSC resolutions and wishes of the Kashmiri people for durable peace and stability in South Asia.",
  "retrievedAt": "2025-08-11T14:01:06.289Z"
}
