{
  "title": "Fawad for promoting Pak-UK bilateral trade",
  "link": "https://www.app.com.pk/national/fawad-for-promoting-pak-uk-bilateral-trade/",
  "date_published": "2022-01-05T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday underlined the need for promoting trade and investment opportunities between Pakistan and the United Kingdom (UK).\nThe minister, in a meeting with British High Commissioner Christian Turner, said exchange of trade delegations between the two countries would foster bilateral cooperation in the trade sector.\nMatters pertaining to film, drama, and new variant of coronavirus – Omicron, and promotion of bilateral ties in trade and investment sectors came under discussion during the meeting. Fawad said Pakistan had succeeded to curb all the waves of coronvirus pandemic in the past effectively and now again the best strategy was being followed to tackle the Omicron.\nThe coronavirus situation in Pakistan was far better than other countries as the government had achieved all the targets set for vaccinating the citizens against the virus, he added. The minister said the entire world was facing challenge of fake news emanating from excessive use of technology.\nHe made a passionate call for global efforts to curb the threatening phenomena. He said the government was taking steps on war-footing for revival of the film industry in Pakistan as films and dramas played a crucial role in highlighting the  culture and positive image of any country. High Commissioner Turner lauded the efforts of Pakistan Government for dealing with the coronavirus pandemic in an effective way.\nThe journals across the globe had acknowledged Pakistan’s smart lock-down policy to suppress the spread of virus. He assured the minister of his full support for promoting bilateral cooperation between Pakistan and the UK. It was agreed in the meeting to make documentaries on Pakistan’s Diamond Jubilee (75th anniversary celebrations) and Lord Mountbatten. The PTV and the BBC would jointly produce a documentary film in that regard.",
  "retrievedAt": "2025-08-11T14:01:01.781Z"
}
