{
  "title": "Shireen Mazari expresses solidarity with Kashmiri brethren",
  "link": "https://www.app.com.pk/national/shireen-mazari-expresses-solidarity-with-kashmiri-brethren/",
  "date_published": "2022-01-05T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Minister for Human Rights Dr. Shireen Mazari on Wednesday expressed solidarity with Kashmiri brethren here at daylong activity organized by Youth Forum for Kashmir (YKF) in connection with Right to Self-determination Day.\nAddressing the participants, she strongly condemned the Indian atrocities and human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nShe urged the world community to immediately stop the genocide and HR violations in IIOJK by the Indian occupant forces. She urged the world community to stop Indian state sponsored terrorism in IIOJK that could engulf the entire region.\nDr. Mazari said that Pakistan will never hold any kind of dialogue with India at any forum, unless it has taken back 5 August revocation special status of Kashmir.She urged the UN to implement the UN Security Council resolution on Kashmir and give Kashmiris the right to self-determination as it is their fundamental right.\nMazari said that whole Pakistani nation stands by Kashmiris and will continue to support them till their freedom from Indian illegal and brutal occupation.She said that unfortunately, the United Nations has not been able to implement its Security Council resolution on Kashmir.\nShe said that entire nation was observing this day to express solidarity with Kashmiri brethren.Shireen Mazari also urged OIC to take notice of the human rights violations and brutalities on Kashmiri women and children. She said that pallet guns were also used against the children.She said that Prime Minister Imran Khan has redefined the narrative of Kashmir and exposed Modi fascist agenda.\nShe termed it a shameful that India was a member of UN Security Council and also involved in killing and torturing innocent people in IIOJK.",
  "retrievedAt": "2025-08-11T14:00:59.263Z"
}
