{
  "title": "Youth-centric think tank CDS launched to roll out national dialogue platform",
  "link": "https://www.app.com.pk/national/youth-centric-think-tank-cds-launched-to-roll-out-national-dialogue-platform/",
  "date_published": "2024-02-28T17:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP):The Centre for Development and Stability (CDA), youth-centric think tank focussing educated youth, media, experts and intelligentsia, has been launched with the prime goal of providing a national dialogue platform to resolve pressing issues and channelise innovation to improve governance and nation building.\nThe Centre for Development and Stability was launched here at the Ripah University Islamabad Campus under the slogan “empowering innovation for sustainable growth and stability.”\nSpeaking on the occasion, Director General of CDS, Dr Irfan Ashraf said the country was lagging in the field of research on pressing issues like terrorism, one of the biggest scourge faced by the nation. “Our vision is to conduct and provide research on economic and geopolitical issues by approaching educated youth, young students and media persons to navigate their innovative ideas for outcome-oriented endeavours.\n“Our youth is directly affected by unemployment and poor performance of political leadership and governments and the international hostile powers are exploiting such fault lines to divide and spoil the nation,” he added.\nDr Irfan Ashraf underlined that under the CDS platform field visits and interactions with stakeholders in Balochistan, Azad Jammu and Kashmir (AJK), Khyber Pakhtunkhwa (KP), Sindh and would also take vice-chancellors of various universities on board and generate a direct debate between policymakers and the youth.\n“We will try to bridge the gap between youth and policymakers. We welcome all research ideas and surveys, and encourage everyone to take part in CDS activities,” he added.\nThe Centre, he said would take the initiative to research policy problems provide possible solutions and offer policy advice to government officials for informed decision-making.\nThe platform would also combat the challenge of disinformation address pressing issues and underline urgent needs, such as Pakistan’s water crisis, climate change and economic deterioration, he added.\nThe Forum would provide accurate and timely reports founded on ground-based research, facts and data related to global conflicts and tensions, explore root causes of poor governance and national integration through inclusive initiatives and youth mobilisation, he said.\nThe key research would focus on geopolitical development, industrial sector challenges, water and energy crises, tourism, mines and minerals potential, road infrastructure improvement, climate change impacts, refugee crisis, trade and economic policies, terrorism and cyber security, Dr Irfan said.\n“The CDS will hold international events with the country’s diplomatic missions on board, will launch exchange programmes for university students at the international level and engage national level experts for our solution-oriented reports,” he said.\nDr Irfan mentioned that the Centre would also provide support to students through short documentaries, interviews and movie-making, whereas the research authors will be given complete credit for their publications under the proud slogan of work for positivity and empowerment of youth.\nUnder the patronage of Brig (R) Asif Haroon Raja, the Centre would welcome everyone to work voluntarily as this organization was a not-for-profit forum, he said.\nMeanwhile, the CDS signed its memorandum of understanding (MoU) with the Ripah University and Youth Council to promote its objective of youth-led think tanks and policy research initiatives.\nPatron in Chief, CDS, Brig (R) Asif Haroon Raja extended his felicitations to Dr Irfan Ashraf for launching the Centre and commended the passion of participants and appreciated Dr Irfan’s works for highlighting Balochistan’s issues.\nHe said the Forum was the right place for national ideas for national service as at present, Pakistan was suffering from the battle of minds (referring to information warfare) as perceptions were being manufactured and spread across the world against the country.\nThe monopoly of Western media is dominating the information landscape whereas India and Israel are causing subversion attempts against Pakistan,” he said.\nThe Western world was ageing and the country had the biggest asset of youth that was becoming a liability due to lack of proper facilities and forums to utilize their abilities, he said.\n“It’s a platform where we can put in our apolitical efforts with national spirit in mind, as 1000 think-tanks are supporting the US for its policy and development and endeavours and we also need to change our attitudes and think forward to serve our nation in the same spirit,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:59:45.305Z"
}
