{
  "title": "Independent assembly members joined PML-N unconditionally: Shehbaz",
  "link": "https://www.app.com.pk/national/independent-assembly-members-joined-pml-n-unconditionally-shehbaz/",
  "date_published": "2024-02-28T17:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Pakistan Muslim League-Nawaz President Shehbaz Sharif on Wednesday said that independent elected members of assemblies had joined the PML-N without any condition.\nAddressing the PML-N’s Parliamentary Party meeting at the Parliament House, Shehbaz, who is also PML-N’s nominee for prime ministership, said that with the addition of independents, his party’s representation in the National Assembly had increased to 104 members.\nHe said that Raja Khurram Nawaz, who won as an independent candidate from Islamabad was now part of the PML-N. Similarly, Barrister Aqeel Malik and Waseem Qadir, who contested NA election as independents from Rawalpindi and Lahore respectively, had also joined the PML-N.\nShehbaz Sharif recalled the problems faced by the party over the past few years. He also highlighted the accomplishments of the PML-N governments under Nawaz’s leadership, pointing out motorway projects and elimination of power power loadshedding throughout the country.\nHe said the country today needed sacrifices and hard work to get out of the crises.\nThe PML-N president criticized the Pakistan Tehreek-e-Insaf (PTI) for alleging that the February 8 general elections were ‘rigged’. Ironically the party was highlighting its own victories in the elections in Khyber Pakhtunkhwa, he added.\nShehbaz said PML-N Quaid Nawaz Sharif had faced the opponents without resorting to politics of destruction. Despite having unfair treatment, he never labeled anyone as ‘Mir Jafar’.\nHe said it was Nawaz Sharif who had brought the China-Pakistan Economic Corridor (CPEC) to the country. “Even the residents of Karachi still recall the efforts of PML-N for restoring peace in the country,” he added.",
  "retrievedAt": "2025-08-11T00:59:21.907Z"
}
