{
  "title": "Caretaker PM disapproves PTI’s move of writing a letter to IMF",
  "link": "https://www.app.com.pk/national/caretaker-pm-disapproves-ptis-move-of-writing-a-letter-to-imf/",
  "date_published": "2024-02-28T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday expressing his disapproval over Pakistan Tehreek-e-Insaf leadership’s latest political salvo of writing a letter to International Monetary Fund (IMF), termed it as ‘highly irresponsible’.\nAppearing in a talk show of a private Tv channel (SAMAA news), the prime minister said the letter was sent at time when the caretaker government had worked significantly for the economic revival with the relevant indicators showing positive trends, besides it achieved different financial targets.\nThe negotiations with the IMF were in the process for $6 billion dollars agreement which was important for the economic health of the country, he said, adding moreover, different multilateral agreements were also dependent over it.\nHe said that there were appropriate forums for the electoral disputes and the PTI’s gesture of writing letter to IMF was unjustified and highly irresponsible.\nHowever, he maintained that in the tangible terms, the letter would have no effects, but it would have political costs for the PTI that had a narrative in this regard.\nTo a question, the caretaker prime minister said that he had appeared before the Islamabad High Court (IHC) in the Baloch missing persons’ case to show that the interim set up was functioning under a constitutional order.\nThe courts’ orders should be respected and he appeared before it to reiterate the same stance and set a precedent, he added.\nThe prime minister further said that the court had been apprised about the number of missing people traced so far under its orders and the IHC judge appreciated efforts in this regard.\nPrime Minister Kakar also termed the number of missing persons as ‘highly exaggerated’.\nTo a query about terrorist incidents in Balochistan, he said that non state actors had been spreading violence in the society to achieve their designs and also misusing human rights platforms.\n“They wanted to create an echo chamber for themselves,” he said, adding that such banned outfits often continued their violence spree and on the other hand, attempted to get sympathies by using a section of society.\nThe prime minister said neither the UN standards nor the international procedures accept mere allegations. If you had leveled allegations, you would have to provide data.\nThere were general sweeping statements to malign state institutions, he said, adding that terrorist groups unleashed violence as a tool.\nThe caretaker prime minister, to another question, said that various efforts were made in the past to engage with the families of missing persons; it was reiterated that commissions in this regard had been formed where they could take up these cases. There was an existing mechanism to address such grievances, he emphasised.\nHe reiterated that use of violence as tool would have no acceptance and justification. For the political grievances, constitution had laid down a mechanism through peaceful means, he added.\nThe prime minister said that violence through armed militia was not acceptable and legitimate.\nThe prime minister said that citizens’ rights to life in the province that had been facing violent incidents, perpetrated by the terrorist groups, should be ensured and regretted that this aspect was not properly highlighted in media and by the rights groups.\nThe BLA was declared by the State Department, the UK government, the European Union and China as terrorist outfit, he said, adding that the outlaw organization was a ‘perpetrator of genocide’ in the province.\nTo a query, he further said that grievances over political and economic issues should be addressed by the federation in good faith. It had been and should be a priority of the federation to prioritize development and progress of Balochistan, Gilgit Baltistan, Waziristan and other backward areas.\nBesides, resources enhancement, there was need to utilize the available resources judiciously as in the past, the allocated resources for Balochistan were squandered which did not ensure dividends, he observed.\nSummoning up his limited period in the government, he said that he was leaving the office as ‘a contented and happy man’.\n“I felt humbled for the opportunity,” he added.\nThe interim set up was given a responsibility for a brief time. The economic crises had made them sleepless but now the country was out of the woods, he recounted.\nResponding to a question he said that he did not think of joining any political party.\nHe also clarified that he was not interested in any position in the parliament rather he would prefer to serve as a member of the Senate.",
  "retrievedAt": "2025-08-11T00:59:21.922Z"
}
