{
  "title": "Sit-in by TLP at Faizabad causing massive gridlock in twin cities",
  "link": "https://www.app.com.pk/national/sit-in-by-tlp-at-faizabad-causing-gridlock-in-twin-cities/",
  "date_published": "2020-11-16T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): A sit-in by the Tehreek-e-Labaik (TLP) Pakistan at Faizabad has caused a massive gridlock in the twin cities, disrupting normal life and causing problems to commuters, office workers, students and in particular for those with medical conditions.\nThe TLP had planned to hold a march from Liaqat Bagh to Faizabad on Sunday to protest against the blasphemous caricatures, but was denied permission by the District administrations of both Rawalpindi and Islamabad, owing to its violent history.\nThe supporters of Allama Khadim Hussain Rizvi despite the road blocks gathered at Liaqat bagh Sunday afternoon and after a prolonged confrontation with the riot police managed to reach Faizabad interchange, the central linkage between the twin cities and blocked the road.\nDeputy Commissioner Islamabad Hamza Shafqaat in a tweet earlier in the day said the Islamabad Expressway was blocked for all north bound traffic from Khanna and appologized for the inconvenience. He also promised for early rectification of the situation.\nIslamabad Expressway from Zero Point till Khanna Bridge will stay sealed. Everyone is requested to plz use alternate routes. Apologies for inconvenience. We are trying our best to clear the route.\n— Deputy Commissioner Islamabad (@dcislamabad) November 16, 2020\nThe SSP Islamabad Traffic Police Farrukh Rashid in a tweet gave the detailed traffic diversion plan, however owing to the clashes many of the alternative entry points were blocked by the police as a precaution.\nITP Traffic Diversion Plan for Faizabad Protest from 16-November-2020 till further notification.@ICT_Police @Safecityibd @DigIslamabad pic.twitter.com/OdGN6Rfvgo\n— SSP Traffic Islamabad (@SSPITP) November 16, 2020\nPeople have demanded of the TLP leader to end their sit in as they have already registered their protest against the caricatures, however creating obstacles and roadblocks was also un Islamic and forbidden by the Holy Prophet (Peace be upon Him).",
  "retrievedAt": "2025-08-11T20:01:30.087Z"
}
