{
  "title": "Secretary WPC along with MNAs visit NORI hospital",
  "link": "https://www.app.com.pk/national/secretary-wpc-along-with-mnas-visit-nori-hospital/",
  "date_published": "2024-10-04T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP):The Secretary Women’s Parliamentary Caucus (WPC) Shahida Rehmani along with women parliamentarians visited the Nuclear Medicine, Oncology and Radiotherapy Institute (NORI) hospital in Islamabad to commemorate the start of Breast Cancer awareness month.\nThe delegation was briefed by Director NORI, Dr. Muhammad Faheem, and Head of the Department of Oncology, Dr. Humaira Mahmood, said a news release.\nThe visit was organized to acknowledge the critical issue of breast cancer in Pakistan, assess the current state of healthcare delivery, and discuss the support mechanisms available for patients facing challenges in affording treatment.\nThe Women Parliamentarians also evaluated the hospital’s capacity to manage the increasing patient load and reviewed the use of advanced technologies and medications that offer cutting-edge treatments.\nDuring the visit, Dr. Humaira presented detailed statistics on breast cancer in Pakistan, highlighting that breast cancer remains the most prevalent form of cancer, affecting one in every eight women.\nShe emphasized that the country has a significantly lower rate of early detection compared to Western nations, attributing this disparity to a lack of awareness, poverty, and cultural barriers.\nThe members stressed the urgent need for effective awareness campaigns, particularly for encouraging early detection, to help reduce the alarming number of cases.\nThe WPC underscored their commitment to amplifying awareness on breast cancer and acknowledged the efforts of NORI Hospital in providing comprehensive cancer care.\nThey praised the hospital’s provision of diagnostic and treatment services, including chemotherapy, radiotherapy, and surgical interventions, noting that in 2023 alone, NORI treated 10,198 breast cancer patients, reflecting a rising trend in the incidence of this disease.\nEstablished in 1983 by the Pakistan Atomic Energy Commission (PAEC), NORI Hospital serves over 18 million people and continues to be at the forefront of cancer treatment in the region.\nWith 19 PAEC hospitals across the country and support from provincial, private, and armed forces hospitals, the healthcare system remains dedicated to combatting cancer and supporting affected families.\nThe Women Parliamentarians who participated in the visit included Dr. Shahida Rehmani, Aasia Ishaque Siddiqui, Dr. Shazia Sobia Aslam Soomro, and Husna Bano.\nThey reiterated WPC’s commitment to standing with institutions like NORI to advocate for stronger healthcare policies and support mechanisms to address the growing burden of breast cancer in Pakistan.\nAs part of Breast Cancer Awareness month, the WPC’s aims to further collaborate with healthcare institutions, civil society, and media to promote early detection and facilitate better healthcare outcomes for women across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:50:11.463Z"
}
