{
  "title": "Traversaal.ai from Pakistan wins Meta APAC AI Accelerator Finals in Singapore",
  "link": "https://www.app.com.pk/national/traversaal-ai-from-pakistan-wins-meta-apac-ai-accelerator-finals-in-singapore/",
  "date_published": "2024-10-04T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): The Traversaal.ai team has won the prestigious Meta APAC AI Accelerator Finals in Singapore their innovative project, a virtual tutor leveraging Meta’s Llama technology, earned them a $100,000 grant.\n“This groundbreaking solution offers high-quality learning resources in both English and Urdu, reflecting the immense talent within ‘Tech Destination Pakistan’ while addressing critical societal challenges like educational inequality,” a message received here from Singapore on Friday said.\nRunners-up from Indonesia and New Zealand were also recognized, further emphasizing Pakistan’s growing stature as a hub for technological development and AI-driven solutions, and reinforcing its position as an emerging leader in the global digital economy.\nCommenting on the momentous achievement, Minister of State for IT & Telecommunication Shaza Fatima Khawaja said, “The success of Traversaal.ai at the Meta APAC AI Accelerator Finals highlights the growing role of Pakistan as a major force in AI innovation. The government’s commitment to fostering technological progress is bearing fruit, and events like the Meta Llama Pitchathon demonstrate our dedication to empowering local talent and positioning Pakistan as a global tech destination.”\nIgnite’s Chief Executive Offficer Adeel Aijaz Shaikh, in his remarks, said, “Traversaal.ai’s victory is a testament to the incredible potential of Pakistan’s tech ecosystem. At Ignite, we are committed to supporting ground-breaking ideas that drive technological progress and solve pressing societal issues. This win at the Meta APAC AI Accelerator Finals showcases Pakistan’s capacity to lead in the AI sector and our journey towards establishing ‘Tech Destination Pakistan’ on the global stage.”\nEarlier in the year, Pakistan made history by hosting Asia-Pacific’s first Meta Llama Pitchathon at Ignite – NICAT. The landmark event was a significant step in positioning “Tech Destination Pakistan” on the global AI innovation map, with strong government backing.\nThe Pitchathon attracted AI enthusiasts and innovators from across Pakistan, showcasing the nation’s potential to become a key player in the global digital economy.\nThe call for competition began on July 19, 2024 attracting 112 submissions. After a rigorous selection process, seven teams were shortlisted by e27 and Meta officials to pitch their ideas in the final round on August 13, 2024, before a distinguished panel of judges. The panel meticulously evaluated each project based on technical feasibility, potential impact, and responsible AI usage.",
  "retrievedAt": "2025-08-10T19:50:17.983Z"
}
