{
  "title": "PILDAT hosts launch ceremony of Javed Jabbar’s new anthologies",
  "link": "https://www.app.com.pk/national/pildat-hosts-launch-ceremony-of-javed-jabbars-new-anthologies/",
  "date_published": "2024-10-04T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): The Pakistan Institute of Legislative Development and Transparency (PILDAT) on Friday hosted the launch of two new anthologies by former senator Javed Jabbar – a distinguished author and filmmaker.\nThe event featured discussions surrounding the themes of “Streams” and “Shade and Light,” highlighting Javed Jabbar’s intellectual contributions to Pakistan’s literary and cultural discourse.\nPILDAT President Ahmed Bilal Mehboob, in his opening remarks, spoke about his longstanding relationship Jabbar, spanning over 22 years. He talked about the importance of engaging with the nuanced perspectives Jabbar brings to the forefront in his works, particularly in an era of rapid global and local change.\nNavid Shahzad, Professor Emeritus, Head of LGS Resource Centre, and accomplished author, introduced “Streams” as a vital offering. She referred to it as an “intellectual history of our times” that probes new dimensions of media, content, and culture, focusing on essays like “Knowledge and Nowledge” highlighting how Javed Jabar stated that in today’s fast paced world everything is now.\nShe praised the book’s ability to navigate contemporary complexities with clarity and depth.\nDr Sikandar Hayat, Dean at Forman Christian College University, introduced “Shade and Light” by reflecting on its unique treatment of historical figures such as Muhammad Ali Jinnah.\n“The anthology delves into critical moments of Pakistan’s history, including lesser-explored narratives of East Pakistan and Bangladesh, while also analyzing the nation’s evolving relations with India and the USA,” he added.\nDr Hayat noted that the anthology presented not just history, but lived experiences and personal insights that challenge traditional accounts.\nJaved Jabbar, in his keynote address, shared the inspiration behind both anthologies, expressing how “Streams” embodies an exploration of knowledge and media in a rapidly changing world, while “Shade and Light” addresses pivotal historical events that continue to shape Pakistan today.\nWith essays like “Saving the Quaid,” Jabbar explained how the work aimed to offer fresh perspectives on well-trodden paths in Pakistani history.\nHe emphasized the importance of maintaining optimism and focusing on Pakistan’s achievements, while learning from, rather than dwelling on, the challenges of the past seven decades.\nDuring the Q&A session, the attendees engaged with the author on a range of contemporary issues. Discussions touched upon censorship and bans in media, the gig economy and its impact on youth, the evolving sense of “Pakistaniat,” and much more.\nThe event concluded with gratitude extended to all speakers and participants, reinforcing the importance of dialogue in understanding Pakistan’s past and future.\nThe event was attended by a diverse pool of individuals from academia, media & CSO community.",
  "retrievedAt": "2025-08-10T19:50:13.325Z"
}
