{
  "title": "UNESCO has announced MAB Young Scientists Awards 2024",
  "link": "https://www.app.com.pk/national/unesco-has-announced-mab-young-scientists-awards-2024/",
  "date_published": "2024-04-16T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP): UNESCO has announced MAB Young Scientists Awards 2024 for the young researchers carrying out interdisciplinary research in line with UNESCO’s Man and the Biosphere (MAB) Programme.\nThe researchers (under the age of 35) either pursuing research in UNESCO Biosphere Reserves or potential sites or their work contribute to the achievement of the 2030 Agenda and its Sustainable Development Goals may apply for the awards.\nAccording to the ECOSF Pakistan, the deadline for submission of applications for the MAB Young Scientists Awards is May 15 while the priority will be given to projects carried out in biosphere reserves.\nCreated in 1989, the grant sheds light on interdisciplinary research in line with UNESCO’s Man and the Biosphere Programme carried out by young scientists.\nSince 2022, with the generous support from the Principality of Monaco, five additional annual fellowships are granted specifically to studies on marine, island and coastal issues in biosphere reserves, totaling a number of 11 awards.\nThrough the MAB Young Scientists Awards, the MAB programme is investing in a new generation of scientists worldwide as well-trained and committed young people are key to addressing ecological and sustainability issues.\nThe MAB Young Scientists awards can grant up to US$ 5,000 to young researchers in support of their research on ecosystems, natural resources and biodiversity.\nUntil 2025, implementation of the UNESCO MAB Programme is guided by the MAB Strategy and Lima Action Plan (LAP) for UNESCO’s MAB Programme and its World Network of Biosphere Reserves (WNBR), which contributes to the achievement of the 2030 Agenda and its Sustainable Development Goals (SDGs). MAB Young Scientists Award applicants are strongly encouraged to consider the priorities of the LAP, and to identify in their applications how their research contributes to the research-related actions of the LAP and to the SDGs.\nSince 2022, the MAB YSA Scheme has received support from the Principality of Monaco enabling five additional annual fellowships specifically benefitting studies on marine, island and coastal issues in biosphere reserves.\nThis generous support reinforces the contribution of the MAB Programme towards the UN Decade of Ocean Science for Sustainable Development. Around the world, more than 200 coastal, island and marine biosphere reserves make a crucial contribution to the Decade by promoting the integrated conservation of marine and coastal ecosystems with sustainable human development supported by research and knowledge exchange.\nThe MAB Programme’s World Network of Islands and Coastal Biosphere Reserves plays a particular global coordinating role in this regard, mobilizing island and coastal biosphere reserves in support of the UN Decade.\nThe MAB Young Scientists Award Scheme aims to encourage young scientists, in particular those from developing countries, to use MAB research, project sites and biosphere reserves in their research; encourage young scientists who already use such sites to undertake comparative studies in other sites in or outside their own country.\nThe award will help promote and encourage the exchange of information and experience among a new generation of scientists and strengthen communication of the LAP within the young scientists and strengthen its visibility.\nThis initiative will involve young scientists in the implementation of the LAP and enhance awareness among young scientists of the role of research in the implementation of the SDGs – in particular when conducted in biosphere reserves.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:52:54.138Z"
}
