{
  "title": "Pakistan, KSA resolve to further build strong partnership, promote economic cooperation",
  "link": "https://www.app.com.pk/national/pakistan-ksa-resolve-to-further-build-strong-partnership-promote-economic-cooperation/",
  "date_published": "2024-04-16T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 16 (APP): Pakistan and the Kingdom of Saudi Arabia (KSA) on Tuesday reiterated their resolve to build a strong partnership and further promote economic cooperation for the mutual benefit of the two brotherly countries.\nThis was discussed during a meeting between President Asif Ali Zardari and Saudi Foreign Minister Prince Faisal bin Farhan Al Saud, who called on him, at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nWelcoming the delegation, the president said that Pakistan and KSA enjoyed a long-standing and decades-old relationship and Pakistan wanted to transform the existing ties into a long-term strategic and economic partnership.\nThe two sides discussed the regional dynamics and recent developments in the Middle East and called for an immediate and unconditional ceasefire and end to the Israeli atrocities in Gaza.\nBoth sides also exchanged views on issues of bilateral importance and the challenges being faced by the Muslim Ummah.\nThe Saudi foreign minister was accompanied by a high-powered delegation, comprising the Minister of Water and Agriculture, the Minister of Industry and Mineral Resources, the Assistant Minister of Investment, the Head of the Saudi Special Committee and senior officials from the Ministry of Energy and Saudi Public Investment Fund.\nChairman Pakistan People’s Party (PPP) Bilawal Bhutto Zardari, Minister for Foreign Affairs Muhammad Ishaq Dar, Minister for Privatization and Board of Investment Abdul Aleem Khan, Minister of Petroleum and Water Resources Musadik Masood Malik, Minister of Industries and Production Rana Tanveer Hussain, Foreign Secretary Syrus Sajjad Qazi and senior government officials also attended the meeting.\nPresident Zardari also highlighted that the Government and the people of Pakistan had the highest regard for the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud and would continue to stand with KSA.\nHe said that the prosperity of the Islamic world was linked to the progress of KSA.\nThe president lauded the courageous and visionary leadership of Crown Prince and Prime Minister of KSA Muhammad Bin Salman and the remarkable progress being made under the Vision 2030.\nHe also thanked the leadership of KSA for its support to Pakistan in difficult times.\nThe Saudi Foreign Minister said that KSA considered its relations with Pakistan very critical and was committed to building a strong partnership with Pakistan. He highlighted that both countries enjoyed strong bonds and had helped each other for decades.\nHe appreciated the contributions of the Pakistani diaspora in the development of KSA.\nHe also conveyed the greetings of Saudi leadership and underlined the importance of Pakistan for the Kingdom.\nPresident Zardari also conveyed best wishes to the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al Saud.",
  "retrievedAt": "2025-08-11T01:52:35.870Z"
}
