{
  "title": "Pakistan, KSA call for immediate ceasefire in Gaza, regret int’l community’s failure",
  "link": "https://www.app.com.pk/global/pak-ksa-call-for-immediate-ceasefire-in-gaza-regret-intl-communitys-failure-to-enforce-ceasefire/",
  "date_published": "2024-04-16T13:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP):Pakistan and the Kingdom of Saudi Arabia (KSA) on Tuesday, while regretting the failure of the international community to ensure ceasefire in Gaza, demanded its immediate enforcement, opening of a humanitarian corridor and averting of famine that was leading to a catastrophe.\nAddressing a joint presser along with Saudi Foreign Minister Prince Faisal bin Farhan Al Saud, Foreign Minister Ishaq Dar said that Pakistan was deeply concerned over the catastrophic situation in Gaza.\nBoth the brotherly countries shared the same feelings on Gaza, he said, stressing upon the international community to help end the genocide.\nMore than 33,000 Palestinians had been killed, the world conscience must wake up and enforce an immediate and unconditional ceasefire to ensure unimpeded humanitarian aid, he added.\nMore Palestinians should not be killed due to starvation, he said, demanding for a global probe into the crimes committed against humanity in Gaza.\nForeign Minister Dar said that different investigations had been carried out across the world over the war crimes against humanity so why it could not take place in Gaza!\nHe reiterated that Pakistan believed that the perpetual solution to the issue was in the establishment of an independent state of Palestine with its pre-1967 borders and Al-Quds Al-Sharif as its capital.\nHe shared views of the Saudi Foreign Minister that the world woke up after the killing of six aid workers from the West but not on the deaths of thousands of Palestinians.\nThe foreign minister said that the world must act fast and quick.\nSaudi Foreign Minister Prince Faisal bin Farhan Al Saud said that in Gaza, so far more than 33,000 people had been killed.\n“They are now facing a famine like situation and starving to death as the international humanitarian aid is not getting in. It is a complete failure of the international community,” he added.\nTerming the situation unacceptable, he said there was no justification to it.\nIn reality, he said, the two United Nations resolutions regarding immediate ceasefire in Gaza had not seen implementation.\nEfforts were seen after six Western aid workers were killed but not when 33,000 Palestinians died which showed the double standards, he regretted.\nPrince Faisal called for an immediate end to the killings and sufferings of the people of Gaza.\nHe said that they were already living in an unstable region leading to a catastrophe in Gaza and ‘there is no need for further confrontation’, adding that ‘de-escalation should be everybody’s priority’.\nReplying to various queries, both sides reiterated to further build up and convert the strong partnership into a strategic partnership and further promote economic cooperation for the mutual benefit of the two brotherly countries.\nForeign Minister Ishaq Dar expressed his pleasure on the arrival of the high-powered delegation from the KSA, terming it an ‘impressive group of dignitaries visiting Pakistan for the first time during his long political career’.\nAbout their deliberations, he said that they had discussed ways and means to transform the cordial cooperation between the two brotherly nations into a strategic partnership and enhancement of investment in Pakistan.\nHe explained that the Special Investment Facilitation Council (SIFC) was functioning like one window for fast tracking foreign investment, adding that Pakistan was committed to strengthening of its investment environment.\nHe expressed the hope that Pakistan would soon become a hub for investment and innovations.\nHe further expressed the optimism that their detailed briefings had highlighted the extensive opportunities for the Saudi investors in energy, agriculture, minerals and IT sectors.\nForeign Minister Dar said that they would ensure full support to the Saudi investment and provide a conducive environment under the directives of Prime Minister Muhammad Shehbaz Sharif.\nSaudi Foreign Minister Prince Faisal expressed his profound appreciation for the warm welcome and hospitality accorded to him and his delegation.\nHe termed his meetings with the Pakistani leadership very productive.\nThe Saudi FM stressed upon the importance of strategic partnership between the two countries and expressed commitment for strengthening of investment.\nHe said that the delegation was impressed with the proactive and business focused approach of the Pakistani side.\nThe minister said that there were significant investment opportunities in Pakistan, and termed their visit ‘very positive on their perspective’, which would lay the groundwork for future ventures.\nThe untapped potential in Pakistan needed to be tapped, he emphasised.\nPrince Faisal bin Farhan further reaffirmed to continue working closely for the economic progress and regional security with historic bilateral cooperation.\nForeign Minister Ishaq Dar, to another query, said that the SIFC and launch of Sovereign Wealth Fund were established through the acts of parliament.\nThe Fund had a worth of 9 million dollars now as against its initial launch at $2.3million. Moreover, the country had 10 trillion dollars worth mineral assets, he added.\nHe said both the countries enjoyed fraternal ties and had historic background of common approach at all the regional and multi-lateral fora.\nHe said the KSA was hosting about 2.5 million Pakistanis that formed 28 percent of total number of Pakistani expatriates working abroad and they had been sending 25 percent out of the total remittances received by the country.\nHe informed that the Government of Pakistan would export trained and skilled workforce to meet the KSA’s new policy.\nThe Saudi Foreign Minister also lauded contributions made by the Pakistanis to the development of KSA, expressing the confidence that the positive contribution in their economy would continue in the future.\nThe Saudi minister further said that the two brotherly countries were facing the challenges together, cooperated and relied on each other in the past, and would continue in the future.\nThe two countries believed in dialogue to end the global challenges, he reiterated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:52:29.700Z"
}
