{
  "title": "Javed Jabbar resigns from 10th NFC Award",
  "link": "https://www.app.com.pk/national/javed-jabbar-resigns-from-10th-nfc-award/",
  "date_published": "2020-05-29T21:08:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 30 (APP):Former Senator Javed Jabbar Saturday announced his resignation from the 10th National Finance Commission (NFC) citing some political opposition in Balochistan to his nomination.\nHe thanked President Dr Arif Alvi, Governor of Balochistan Justice (retd) Amanullah Khan Yasinzai and Chief Minister of Balochistan Jam Mir Kamal Khan Alyani for his nomination as the non-statutory Member from Balochistan to the 10th NFC, as notified on May 12.\n“Any citizen of Pakistan who, in the opinion of the nominating authority and the approving authority is suitably qualified, irrespective of Province of residence, is eligible, as per the Constitution and law, to represent any of the 4 Provinces and to serve on the NFC, or any other Federal or Provincial body,” Javed Jabbar said in a statement.\nThe former Senator said, “Due to my long association with the great people and province of Balochistan for the past 45 years in different public service capacities including a 6-year tenure in the Senate, and three times as a Member of Federal Cabinets, and in the voluntary field in the development sector, I had accepted this unsought, unexpected honour — only in order to make a humble, potentially positive contribution.\n“My initial view was that even though I am not a resident of the province one could use experience in aspects of political economy and familiarity with the core problems of the province to advocate the cause of Balochistan. Several residents of Balochistan conveyed their valued felicitations and support for my nomination.\nHowever, he added, “in the past 2 weeks, some political opposition has been voiced within Balochistan to my nomination. Petitions have been filed in the Balochistan High Court which will render its just verdict soon, as per the Constitution and law”.\nJaved Jabbar stressed consensus is the cornerstone of NFC’s work and its declared Awards. “Ideally, there should also be a reasonably broad political consensus within Balochistan about nominations to the NFC. If such broad consensus does not exist, then the eventual outcome, however sincerely and competently pursued, and even regardless of the benefits accruing to Balochistan from the announced Award, are likely to be rejected by some — with the complaint that more should have been secured,” he added.\nHe said, “To enable representation on the basis of a broad political consensus, and to prevent prolonged opposition to the Chief Minister’s decision on this matter that would divert attention from the positive work being done by his Government, I hereby tender my resignation from the 10th National Finance Commission with immediate effect on May 30th, 2020.\n“A formal letter of resignation has been electronically transmitted/hard copy dispatched by courier earlier today to the honourable President, Governor and Chief Minister of Balochistan.”\nHe said, “I am confident that a new nominee will contribute a valuable role to obtaining an Award that is justly beneficial for the people and province of Balochistan.”\nJaved Jabbar said, “I will continue to serve Balochistan on a voluntary basis in already on-going projects, and through new initiatives.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:27.081Z"
}
