{
  "title": "Kyrgyzstan offers its markets to Pak merchandise",
  "link": "https://www.app.com.pk/national/kyrgyzstan-offers-its-markets-to-pak-merchandise/",
  "date_published": "2020-05-29T22:57:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 30 (APP)::Kyrgyzstan has offered its market of over 180 million people to Pakistani merchandise, saying that Pakistani businesspeople should come forward and avail the opportunity.\nKyrgyz Ambassador Erik Beishembiev made the offer in a meeting with business community here at the Lahore Chamber of Commerce & Industry (LCCI) on Saturday. LCCI President Irfan Iqbal Sheikh, Senior Vice President Ali Hussam Asghar and Vice President Mian Zahid Jawaid Ahmad also spoke on the occasion, while LCCI Executive Committee Members Haji Asif Sehar, Shahzad Aslam, Haris Attiq and Malik Muhammad Khalid were also present.\nThe ambassador said that his country greatly valued relations with Pakistan, and that was why it sought further diversification and strengthening of the relations. He said that Kyrgyz-Pakistani historical relations could be traced back centuries ago. “Our peoples have long-time and close cultural and spiritual ties. Today our countries enjoy excellent political relations and regularly exchange visits on the highest levels,’ he added.\nHe said that both countries were rich in mineral resources, have high skilled human resources, excellent opportunities for developing industry and agriculture, attracting foreign investments for joint production and supply of goods, including for export.\nAmbassador Erik said that Kyrgyzstan was interested in development of short transportation links through its territory between Central Asia and China and Pakistan with access to the Gwadar and Karachi ports, using railway and automobile roads, which are being constructed in the framework of China-Pakistan Economic Corridor (CPEC).\nToday, shortest automobile roads are connecting China to Kyrgyzstan through two border mountain passes in Kyrgyzstan – Torugart in the North and – Erkeshtam in the South, located only about 200-km from Chinese city of Kashgar. The road through Kyrgyz border post Irkestam is the shortest way from Fergana valley, which is shared between Uzbekistan, Tajikistan and Kyrgyzstan, to China.\nLCCI President Irfan Iqbal Sheikh said that Pakistan and Kyrgyzstan enjoy friendly and cordial relations. The meager trade values verify that our business and economic relations have not been adequately developed.\nHe said that very few items are being traded as only pharmaceutical products are mainly exported from Pakistan whereas trailers and semi-trailers are imported from Kyrgyzstan.\n“We have been talking about exploiting the untapped potential of trade in Central Asian Republics but no significant results have been ever produced”, the LCCI president said and added that the main reasons are least knowledge about each other’s markets and lack of regular bank to bank channels.\nLCCI Senior Vice President Ali Hussam Asghar and Vice President Mian Zahid Jawaid Ahmad said that organizing single country exhibitions on reciprocal basis, exchange of trade delegations and arranging country weeks can prove vital tools for introduction and marketing of products in each other’s countries.\nAt the end of the meeting, the Ambassador along with LCCI office-bearers took a round of the various LCCI departments and appreciated its working. He particularly appreciated one window operation for LCCI members.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:27.217Z"
}
