{
  "title": "1247 new coronavirus cases reported in Sindh : CM Sindh",
  "link": "https://www.app.com.pk/national/1247-new-coronavirus-cases-reported-in-sindh-cm-sindh/",
  "date_published": "2020-05-29T22:36:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 30 (APP):Sindh Chief Minister Syed Murad Ali Shah on Saturday said that 38 patients of COVID19 died and total 1247 new coronavirus cases were detected in the last 24 hours.\nIn a statement issued from the CM’s House, the CM Sindh said that the condition of 310 patients of coronavirus is critical.\nSyed Murad Ali Shah said that 522 patients recovered and went to their home in the last 24 hours.\nThe Sindh Chief Minister said 5481 tests were conducted in the last 24 hours, as a result, 1247 new patients appeared. So far 176703 tests of coronavirus have been performed, in which 27307 patients have been detected, he added.\nThe death toll due to coronavirus has risen to 465 in Sindh and at present 13623 patients are under treatment, Syed Murad Ali Shah said.\nThe Chief Minister Sindh said that 2565 patients are isolated in their homes and are undergoing treatment and 127 are in quarantine centers while 931 are being treated in different hospitals. As many as 310 patients of COVID19′ condition is critical and 68 patients are on ventilator, he added.\nHe said that with recovery of more 522 patients, the number of those who have recovered has reached 13,272 in Sindh.\nHe said that a total 923 new cases of coronavirus have been reported in Karachi including in Korangi District 215, East 213 and Central 183, South 180, West 69 and Malir district 63.\nSpeaking about new cases in other areas of Sindh, he said that 29 cases were reported in Ghotki, Hyderabad 24, Larkana 23, Jacobabad 22, Sukkur 21, Jamshoro 14, Shaheed Benazirabad 8, Sujawal 7, Khairpur 7 and Qambar 5, Kashmore 4, Dadu 4, Thatta and Badin 3-3 while Sanghar one new case.\nSyed Murad Ali Shah said that the number of cases is increasing due to non-compliance of precautionary measures by the people.\nThe CM Sindh said that the people have to be careful, otherwise the situation will get worse.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:24.164Z"
}
