{
  "title": "Pakistan reminds UNSC for playing role to stop Kashmiris’ killings in IOJK",
  "link": "https://www.app.com.pk/national/pakistan-reminds-unsc-for-playing-role-to-stop-kashmiris-killings-in-iojk/",
  "date_published": "2020-05-30T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Pakistan once again reminded the United Nations Security Council (UNSC) to play its primary role for maintenance of peace and security by urging India to stop extra-judicial killings of Kashmiris and end continuous military crackdown and unprecedented restrictions in the Occupied Kashmir.\nForeign Minister Shah Mahmood Qureshi has addressed another comprehensive communication to the President of UN Security Council and the UN Secretary General, apprising them of the latest situation in Indian occupied Jammu and Kashmir (IOJK), according to a Foreign Office press release.\nIn his letter of May 21, the foreign minister drew attention towards the newly-notified “Jammu & Kashmir Reorganization Order 2020” and “Jammu & Kashmir Grant of Domicile Certificate Rules 2020” aimed at changing the demographic structure of IOJK. It has been underscored that these actions are illegal and in violation of the UNSC resolutions and international law, in particular the 4th Geneva Convention.\nThe foreign minister called the UNSC president to urge India to refrain from: committing serious crimes against Kashmiri people; extra-judicial killings, arbitrary detentions and incarcerations; use of pellet guns and live ammunition; changing the demographic structure of IOJ&K; burning and looting of Kashmiris’ houses to inflict “collective punishment,” and end continuing military crackdown and unprecedented restrictions.\nAs part of Pakistan’s active diplomatic outreach and taking up the Jammu and Kashmir dispute at all international fora, the foreign minister has kept the UN Security Council fully apprised of the evolving situation in IOJK and urged the Council to play its role in the maintenance of peace and security.\nSince India’s illegal and unilateral actions of August 5, 2019, the Jammu & Kashmir dispute has been taken up in the Security Council on three different occasions.\nThe foreign minister highlighted India’s opportunistic exploitation of the ongoing COVID-19 pandemic to further intensify its military crackdown in IOJK. While conveying serious concerns over India’s state-terrorism in IOJK, the foreign minister rejected Indian efforts to undermine the indigenous struggle of the Kashmiri people against illegal Indian occupation and brutalization of Kashmiris by terming it as “terrorism.”\nForeign Minister Qureshi also conveyed Pakistan’s concern over the continued ceasefire violations at the Line of Control (LoC) and the Working Boundary (WB) and deliberate targeting of innocent civilians by the Indian occupation forces.\nRejecting the baseless Indian allegations of so-called “launch pads” of “infiltrators”, the foreign minister reiterated Pakistan’s offer to the UN Military Observer Group in India and Pakistan (UNMOGIP) to visit the alleged sites to confirm the veracity of unfounded Indian allegations.\nHe underlined that the real Indian motive behind blaming Pakistan was to create a pretext for a “false flag” operation, about which Pakistan has been forewarning the international community.\nThe foreign minister separately spoke to UN Secretary General Antonio Guterres on May 22, 2020 and briefed him in detail on the worsening situation in IOJ&K as well as regional peace and security.\nHe urged the UN chief to play their role in preventing any escalation and facilitating peaceful resolution of the Jammu and Kashmir dispute.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:29.172Z"
}
