{
  "title": "Indian grilled over abuse of human rights in occupied Kashmir during a debate at HRC",
  "link": "https://www.app.com.pk/national/indian-grilled-over-abuse-of-human-rights-in-occupied-kashmir-during-a-debate-at-hrc/",
  "date_published": "2020-09-27T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): India become under severe criticism at the UN Human Rights Council in Geneva where reputed international rights groups during a day long debate took a dig at the BJP government for human rights violations in the occupied Kashmir.\nThe representatives urging the Council to impress upon the Indian government to hold accountable members of its security forces involved in heinous crimes such as torture, arbitrary detentions, killings, and forced disappearances.\nAccording to press statement received here, while taking part in a debate held under agenda item 3, the representatives of International Muslim Women Union (IMWU), World Muslim Congress (WMC), Community Human Rights and Advocacy Center (CHR&AC) and Amnesty International voiced their serious concerns over the dire political and human rights situation in the disputed territory.\nSpeaking on the occasion the CHR&AC representative Eemaan Gilani, while referring to the genesis of Kashmir dispute said, “Jammu and Kashmir is a disputed territory, UN has passed a number of resolutions calling for a free an impartial plebiscite under the UN auspicious to allow the people Kashmir to determine their political future in freely an atmosphere free of coercion.\nThese resolutions she said were endorsed by the then prime minister Jawaharlal Nehru and the Indian representative in the UN Security Council. Despite the fact India has been always reluctant to implement these resolutions.\nNotwithstanding the international commitments, she said, Indian had forcibly occupied the territory and deployed over 900,000 military and paramilitary troops in the region, which makes it the highest military zone in the world. Urging the world body to take effective notice of the situation in held territory she said, “It was high time that the pressure be built on the government of Indian to stop human rights violations in Kashmir and abide by the international laws”.\nTerming denial of right to self-determination as a violation of human rights, the IMWU representative Ms Warda Najum said, “Kashmiris are subjected to the worst kind of violence and subjugation for demanding this right”.\nAsking the world audience to hear the cries of suffering humanity in Kashmir she said, “In the middle of media blackout and clampdown on civil society and human rights defenders I can hear the mournful wails of millions of Kashmiris under Indian occupation for more than 10 months now”.\n“If Indian thinks it can prevent itself from censoring its evil India is mistaken”, she said adding that the Indian occupied territory is a place where people are denied justice, where occupation is enforced and dejection prevails, where people are made to feel robbed, degraded and humiliated”.\nReferring to the situation in Indian held Kashmir the WMC representative Mr. Raja Saeed uz Zaman, said, “What defines today’s Kashmir is extra-judicial killings, fake-encounters, forced disappearances, detention of Kashmiri youth and torture”.\nThey said harassment of the civilian, killing and blinding people by pellet-firing shotguns have become a new normal in Kashmir.\nSpeaking on the occasion, the Amnesty international representative, while expressing his grave concerns over the rising tide of fascism, intolerance, and racism in Indian said, “We are alarmed by the deteriorating situation in India where draconian laws are being used to detain and arrest the human rights defenders and peaceful protesters. Regarding the arrests and torture on peaceful protesters by the Indian police he said, “People who were protesting against Citizenship Act were subjected to excessive force”. This reality he said could no longer be ignored. He said, “We urge the council to hold India accountable for human rights obligations and commitments”.",
  "retrievedAt": "2025-08-11T19:50:38.042Z"
}
