{
  "title": "NA Education Committee support government’s decision of reopening of educational institutions",
  "link": "https://www.app.com.pk/national/na-education-committee-support-governments-decision-of-reopening-of-educational-institutions/",
  "date_published": "2021-01-11T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): The National Assembly’s Standing Committee on Federal Education and Professional Training on Monday unanimously supported the government’s decision of reopening educational institutions from January 18.\nThe committee which met here under the chairmanship of Najeeb Ud Din Awaisi, observed that reopening of the institutions would help overcome educational loss of students.\nParliamentary Secretary for Federal Education Wajiha Akram said, although the decision of schools’ reopening was difficult but it was unanimously taken on the recommendation of National Command and Operation Centre (NCOC).\nShe said loans were given to small private schools to support their business and added that this matter would also be raised in the cabinet meeting.\nSecretary, Ministry of Federal Education Farah Hamid informed the committee that the bill regarding provision of loans to small private schools was in the Finance Division and hoped that it would be approved in next three days.\nShe said after approval from Finance Ministry, the bill would be sent to the cabinet meeting for final approval and hoped the deserving private schools would be benefited soon.\nThe committee was informed that Rs 0.5 to 01 million budgets would be given to each school.\nIn his briefing, Chairman Federal Directorate of Education (FDE) Dr Ikram Ali Malik said educational session of the schools, colleges have been extended. He further informed that the syllabus was also being reduced to facilitate students, adding that examinations would be held from the course in May.\nTo a question, Chairman FDE said they did not have enough budget for corona testing of teachers prior their joining the schools.\nTo another query, he said FDE has no such tool to monitor the ratio of those students taking benefit from online classes during the pandemic.\nDirector General, Quality Assurance Agency (QAA), Higher Education Commission (HEC) Dr Nadia Tahir in her briefing said that when the academic activities were shifted to online amid COVID-19, HEC had the online facility for only 23 courses while, currently out of 118331, around 113617 courses were available online.\nShe went on saying that around 57 percent universities of the country were ready to teach the students through online mode of education.\nThe Member HEC Lt. General (Retd) Muhammad Asghar told the committee that they did not have enough budget to support the universities. He said universities were demanding grants from HEC but they already had given lower budget than our needs.\nHe requested the committee to ask the government for providing more budget to HEC as per its needs.\nThe representative from Private Educational Institution Regulatory Authority (PEIRA) informed that committee about the measures taken to implement COVID-19 Standard Operating Procedures (SOPs) in the educational institutions.\nThey said those schools which did not follow SOPs, had been sealed with support of District Management.\nAmong others the meeting was also attended by the Members National Assembly Sadaqat Ali Khan, Mehnaz Akbar Aziz, Hamid Hameed, Shazia Sobia Aslam Soomro, Asmatullah, Ali Nawaz Awan, Javairia Zafar Aheer, Umar Aslam Khan, Farooq Azam Malik, Andleeb Abbas, Ghazala Saifi, Asma Qadeer, Tashfeen Safdar, Kiran Imran Dar, Musarat Asif Khawja, Abid Husain Bhayo, Mussarat Rafiq, Farukh Khan and Nafeesa Inayatullah.",
  "retrievedAt": "2025-08-11T20:13:53.222Z"
}
