{
  "title": "Turkish FM arrives tomorrow on three-day official visit: FO",
  "link": "https://www.app.com.pk/national/turkish-fm-arrives-tomorrow-on-three-day-official-visit-fo/",
  "date_published": "2021-01-11T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): Turkish Foreign Minister Mevlut Cavusoglu will arrive here on Tuesday on a three-day (January 12-14) official visit to Pakistan along with a delegation.\nDuring the visirt, the Turkish Foreign Minister will hold bilateral talks with Foreign Minister Shah Mahmood Qureshi and call on Prime Minister Imran Khan and President Dr. Arif Alvi.\nThe two Foreign Ministers will review the entire gamut of bilateral relations and exchange views on regional and international issues, Foreign Office said in a press statement issued here.\nForeign Minister Cavusoglu’s visit to Pakistan is part of regular high-level exchanges between the two countries. This will be his third visit during the last two and half years.\nThe fraternal relations between Pakistan and Turkey are deeply embedded in common faith, culture and history and underpinned by exceptional mutual trust and respect.\nPakistan-Turkey bilateral relations have been institutionalized under the High Level Strategic Cooperation Council (HLSCC), which is the highest level decision-making forum, providing strategic direction to further boost the partnership.\nCo-chaired by President Recep Tayyip Erdogan and Prime Minister Imran Khan, the 6th Session of HLSCC was held in Islamabad in February 2020.\nThe Strategic Economic Framework (SEF), signed at 6th Session of HLSCC, has 71 action points for deeper cooperation between the two countries in diverse fields.\nPakistan and Turkey enjoy close collaboration on issues of mutual interest at multilateral fora such as the United Nations, Organization of Islamic Cooperation and\nEconomic Cooperation Organization.\nTurkey is an important member of the OIC Contact Group on Jammu and Kashmir and has been consistently supporting the cause of self-determination of the Kashmiri people.\nThe forthcoming visit of the Turkish Foreign Minister will help further cement the bilateral ties and enhance cooperation in multiple areas, the statement concluded.",
  "retrievedAt": "2025-08-11T20:13:53.209Z"
}
