{
  "title": "Enemies of Pakistan trying to create unrest through sectarianism: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/enemies-of-pakistan-trying-to-create-unrest-through-sectarianism-sheikh-rashid/",
  "date_published": "2021-01-11T06:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Minister for Interior Sheikh Rashid Ahmed on Sunday said that enemies of the country were trying to create unrest through sectarianism as major cities were put on high alert.\nTalking to a private news channel, he said the government had recently arrested terrorists from Bahara Kahu and Sargodha.\nHe said the government would fulfill demands of Hazara community and address their issues.\nTo a query, the minister said he was the first one who went to Quetta after the tragic incident of Machh.\nHe said the government had signed written agreement with the Hazara community for addressing their issues, adding it did happen for the first time in history of the country.\nHe said investigation was under way regarding killing of Usama Satti and pointed out that the culprits were arrested and cases against them had been registered with strict clauses of the law.\nCommenting on the PDM, he said his prediction was proved correct as the opposition had no plan to tender resignations from the assemblies. Now, they were going to contest the Senate and bye elections, he added.\nSheikh Rashid said the government would complete its constitutional tenure and the general election of 2023 would be held in time, adding Prime Minister Imran Khan would never make any compromise over the corruption cases of corrupt leaders of the opposition.\nHe said provision of the health cards to the masses was a historic initiative of the PTI led government.\nTo another question, he said Nawaz Sharif went abroad for medical treatment but he did not admit in any hospital in London.\nHe said Nawaz was declared absconder by the court, adding the government was making efforts to bring him back. The government was going to cancel his passport in February 16, he added.\nHe said Chairman of PPP Bilawal Bhutto Zardari and co-chairman Asif Ali Zardari had different political approaches",
  "retrievedAt": "2025-08-11T20:13:58.137Z"
}
