{
  "title": "Ashrafi emphasizes need for unity among Muslim Ummah",
  "link": "https://www.app.com.pk/national/ashrafi-emphasizes-need-for-unity-among-muslim-ummah/",
  "date_published": "2023-05-01T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Prime Minister’s Special Representative on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mahmood Ashrafi on Monday emphasized the need for unity among the Muslim Ummah to solve their problems.\nSpeaking to the media, he said the fundamental issues faced by the Muslim Ummah were Kashmir and Palestine, and practical steps should be taken to resolve them.\nAshrafi who is also the Chairman of the Pakistan Ulema Council and Secretary-General of the International Tazim-e-Haramain Sharifain Council, applauded the efforts of Islamic scholars in combating extremism and terrorism and urged for dialogue between leaders of all religions to end Islamophobia.\nHe also praised Saudi Arabia’s commendable role in addressing the Sudan crisis and called on all countries to support it for a permanent ceasefire in Sudan.\nHe further emphasized that the true interpretation of Islamic teachings could be found in the Muslim World League’s ‘Charter of Makkah’ and Pakistan’s religious scholars’ ‘Message of Pakistan’.\nRegarding the recent cases of blasphemy in the country, Ashrafi stressed that no one should be accused of blasphemy without proper research and evidence.\nHe added that if any individual or group used blasphemy laws for their own personal or political interests, the government should take action against them.\nHe also expressed his concern over the oppression of minorities, including Muslims, in India and Occupied Kashmir, and called on the political and religious leaders of the G20 countries to boycott their upcoming meeting in India.\nHe said India’s desire to hold the R20 meeting in Occupied Kashmir on the occasion of the G20 meeting would not be fulfilled.\nIn conclusion, Ashrafi emphasized that Islam was a religion of peace and did not tolerate extremism and terrorism in any form.\nHe further termed the restoration of Iran-Saudi Arabia and Arab-Syria relations a good omen as it would help resolve the issues faced by the Muslim Ummah.",
  "retrievedAt": "2025-08-11T08:24:54.492Z"
}
