{
  "title": "Pakistani expatriate elected as Parish Councillor in Chiseldon",
  "link": "https://www.app.com.pk/national/pakistani-expatriate-elected-as-parish-councillor-in-chiseldon/",
  "date_published": "2023-05-01T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Saudi-born Pakistani, who holds Irish citizenship, has been elected as the Parish Councillor in Chiseldon Parish, in a predominantly white town of Swindon, England two weeks ago.\nFareed Qidwai is a pharmaceutical professional and member of a small party called Liberal Democrat. He rose to the ranks recently and was selected as the Treasurer of the Swindon Liberal Democrat and also the Election Campaign Manager back in 2021. Two years on, this is the party’s first victory.\nIn 2023, the party made history by running candidates from every ward in Swindon Borough. Due to the bad performance of the ruling Party (the Conservatives), the general public is very disillusioned and unsatisfied which is why they are turning to smaller parties as an alternative. Moreover, Fareed has contributed immensely to the local community in Chiseldon, Swindon which resulted in his victory.\nFareed is also running for two other elections as a candidate for South Swindon Central Parish (Lawn & Badbury Park) which is another parish and also for Swindon Borough Council.\nFareed says that his journey in politics started at the grass root level back in his teenage. He partook in the antiracism campaign and represented Irish Muslim youth in a youth train, attended an inter-religious workshop in Strasbourg (France) in the Parliament of Europe. This is where, as a young teenager, He saw the power of the EU and how different nations getting together to make Europe a better place to live.\nLater on, when the Brexit referendum took place in the UK in 2016, Fareed resigned from his job in Ireland and moved to the UK to join the struggle to rejoin the EU. Later that year, Fareed moved to Swindon UK and started the Anti-Brexit Group: Swindon for Europe. He also co-founded Plastic Free Swindon and arranged a cricket and Badminton Club for the local residents. He also fundraised and actively worked for the local primary schools.",
  "retrievedAt": "2025-08-11T08:24:54.308Z"
}
