{
  "title": "CDA Mazdoor Union leader stresses for practical steps, implementation of ‘labour laws’ in country",
  "link": "https://www.app.com.pk/national/cda-mazdoor-union-leader-stresses-for-practical-steps-implementation-of-labour-laws-in-country/",
  "date_published": "2023-05-01T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Senior leader Capital Development Authority (CDA) Mazdoor Union, Chaudhry Muhammad Yaseen Monday has paid rich tributes to the labourers for their hard work and urged all government, non-government organizations (NGOs), trade unions and labour rights organizations to practically implement labour laws in the country.\nWhile talking to PTV news channel, on the occasion of World Labour Day Yaseen said that 1st May always reminds us of the sacrifices of the workers who laid down their lives while waging a relentless struggle for their rights.\nHe regretted that despite labour’ contribution towards economic prosperity, labourers were facing many issues like the unsafe working environment, unfair labour practices, poor wages, lack of job security, harassment of women at the workplace, long working hours and arbitrary dismissal.\nHe said our labour force is the backbone of our economy and it is highly essential to take practical steps for the protection of their rights by strictly enforcing the labour laws to discourage unfair labour practices.\nHe expressed hope that the federal and provincial governments would continue their endeavours to work for their welfare as well as to provide them with marketable skill sets.\nHe also urged the workers of the country to be aware of their due rights, adding, for the first time in the country, the labour policy was issued and the rights of trade unions were introduced by Prime Minister Shaheed Zulfikar Ali Bhutto on February 10, 1972.\nCh Yasin mentioned that Islamabad and Punjab governments had taken exemplary steps for the welfare and prosperity of the home-based women.\nHe also stressed the need for developing a social security system to cover such workers.\nHe urged the federal and provincial governments to amend outdated labour laws in conformity with ILO Conventions and bring the contract and temporary workers in government and autonomous bodies and private industries, banks, trade and media on a regular basis.",
  "retrievedAt": "2025-08-11T08:25:02.632Z"
}
