{
  "title": "Labour Day highlights importance of public communications in amplifying workers’ voices: Fahd Haroon",
  "link": "https://www.app.com.pk/national/labour-day-highlights-importance-of-public-communications-in-amplifying-workers-voices-fahd-haroon/",
  "date_published": "2023-04-30T19:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Minister of State and Special Assistant to the Prime Minister for Public Communication and Digital Platforms Fahd Haroon has said that Public communication has a critical role to play in amplifying the voices of workers and raising awareness about the challenges they face.\nIn a message on International Labour Day, he said May 1 is an occasion of great significance, as it highlights the contributions of workers and the importance of their rights and dignity.\nHe acknowledged the challenges faced by workers in Pakistan, including low wages, poor working conditions, and lack of social protection.\nThe minister lauded Prime Minister Shehbaz Sharif’s efforts towards ensuring labour dignity and equal wages without gender and other discrimination.\nHe also commended Foreign Minister and Chairman of the Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari for his unwavering commitment to the labour struggle in Pakistan. “Chairman Bilawal provided great support for public communication, through which we can mobilize public opinion, create a sense of solidarity and empathy, and put pressure to prioritize workers’ rights and well-being.”\nFahd Haroon also expressed gratitude to Bilalwal for announcing an immediate increase of 25% in the amount of the Benazir Income Support Programme (BISP) stipend, vowing that the process of providing relief money to the flood-affected small farmers by the Sindh government be accelerated also.\nHe emphasized that the labour struggle was not just a matter of economic justice but also a fundamental human right. He called upon all political leaders, civil society organizations, and employers to join hands and support the labour struggle in Pakistan and around the world.\nHe encouraged everyone to take inspiration from past and present labour struggles and work towards a better future of work based on dignity, fairness, and social justice.",
  "retrievedAt": "2025-08-11T08:25:07.763Z"
}
