{
  "title": "Govt. committed to ensuring well-being of laboureres, workers: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-ensuring-well-being-of-laboureres-workers-pm-2/",
  "date_published": "2023-04-30T19:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Prime Minister Muhammad Shehbaz Sharif while highlighting the workers’ pivotal role in the economic development, on Sunday reiterated that the government was committed to ensuring the benefits of economic progress translated into prosperity for all sections of the population, particularly the labourers and workers.\nIn a message on the “International Workers Day”, which is being celebrated globally on May 1, the prime minister said the day reminded them of the sacrifices of those workers who laid down their lives while waging a relentless struggle for their rights.\nThe day symbolized the sanctity and dignity of labour and at the same time, it was an acknowledgment of the importance of workers and labourers for being central to the economic growth of the country, he added.\nPaying tributes to the working classes for their contributions to the development of the country, he called upon all the stakeholders to renew their pledge both at the individual and collective levels to ensure the welfare of working classes by investing in their socio-economic and social well-being.\nThe prime minister further said “Our great religion, Islam, emphasizes the principles of social justice, equity and respect for the rights of the people. Allah Almighty and the Holy Prophet (Peace Be Upon Him) have ordered us to fulfill the rights of the workers and not be lax in the performance of this core duty,” he added.\nHe said they found numerous inspiring examples of the dignity of laborer and respect for the rights of the working classes in the life of the Holy Prophet (PBUH).\n“Respect for hard work and recognition of the rights of workers are extremely important in the process of progress. Islam accorded the sanctity to these fundamental human rights much before the establishment of labour laws,” said the press release issued by the PM Office Media Wing quoting him as saying.\nOn the same ground, the prime minister said, they believed that workers and employers were partners in the production process and their cooperation and amicable relationship was essential for the socio-economic development of the country.\nHe said that the present government was committed to improving the working and living conditions of workers and to supplement their welfare by providing better housing, education facilities and health cover for them and their families.\nKeeping in view the high inflation rates and other economic challenges, the government had increased the minimum wages of workers from Rs. 17,500 to 25,000 per month, he said, adding that it also aimed to develop automated, integrated systems for workers’ welfare institutions to ensure transparency and to curtail delays in providing relief to the labourers and workers.\nKeeping in view the requirements of the labour market, the prime minister further said that the present government had embarked upon programmes of vocational training and skills development to enable workers to get their due share in job markets within and outside the country.",
  "retrievedAt": "2025-08-11T08:25:07.209Z"
}
