{
  "title": "Seminar held on China’s Global Development Initiative",
  "link": "https://www.app.com.pk/national/seminar-held-on-chinas-global-development-initiative-2/",
  "date_published": "2023-05-27T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):China Pakistan Study Centre (CPSC) at the Institute of Strategic Studies Islamabad (ISSI), organized a seminar here on China’s “Global Development Initiative” aimed at development cooperation for achieving sustainable development goals.\nThe chief guest at the seminar was Senator Mushahid Hussain Sayed, Chairperson Senate Defense Committee. Former Ambassador to China Masood Khalid was the keynote speaker.\nWhile delivering his address, Senator Mushahid Hussain Sayed lauded China for the launch of the far-reaching and consequential Global Development Initiative (GDI).\nHe stated that the world was currently experiencing both transformation and turmoil. Different leaders were describing this decade in different ways.\nPresident Macron accurately stated that this decade marked the end of 300 years of Western dominance.\nThe current era was witnessing the rise of China and the ‘Asian Century.’ Despite global conflicts, climate change, poverty, and energy-related challenges, China had shown impressive leadership. China’s global strategy included the Global Development Initiative, Global Security Initiative, and Global Civilization Initiative, which shared many similarities. This initiative reflected that Chinese values were all about cooperation, peace and respect.\nHe noted that Chinese strategic culture without a second thought was an embodiment of cooperation, peace and respect for all.\nHe concluded by saying that Pakistan and China shared a long-standing, all-weather and time-tested strategic relationship. Therefore, both should work together to build an Asian century of progress, prosperity and cooperation.\nIn his welcome remarks, Director General ISSI Ambassador Sohail Mahmood said that GDI was a critical initiative launched by China at a time when the world was deeply affected by the health and economic effects of Covid-19 pandemic and the deficit in the achievement of SDGs was growing.\nPresident Xi Jinping presented the GDI at the 76th Session of the UN General Assembly in September 2021 to pool efforts to tackle the challenges of the world and to facilitate the post-pandemic recovery.\nHe noted that Pakistan was one of the first countries to lend its strong support to the GDI. Pakistan was also among the first countries to become a member of the GDI’s ‘Group of Friends’ at the United Nations.\nA lot of progress had since been achieved from that platform. He underscored that at a time of global food, fuel, and financial crises, initiatives like GDI were essential for the developing world.\nHe also highlighted the contribution of BRI’s flagship project, CPEC, to Pakistan’s continued progress and prosperity.\nHe concluded by expressing the hope that GDI would be perceived in its right perspective by all and it would help advance the noble cause of achievement of SDGs by 2030.\nEarlier, in his introductory remarks, Dr. Talat Shabbir stated that GDI aimed to accelerate the implementation of the Sustainable Development Goals (SDGs) 2030 agenda by focusing on people-oriented development.\nIt sought to promote stronger, greener, and healthier global development by revitalizing global development partnerships.\nPang Chunxue, Charge d’ Affairs of the Chinese Embassy, noted that GDI was a re-prioritization of SDGs and rejuvenation of global development efforts.\nNoting that GDI was an initiative that aimed to reactivate international development cooperation, she highlighted in detail the progress made in advancing the aims and objectives of GDI through practical cooperation with partner countries and organizations. She added that Pakistan occupied the position of a ‘priority partner’ in the GDI framework.\nThe two countries needed to work hand-in-glove in the domains of agriculture, industry, technology and all other areas of mutual interest.\nAmbassador Masood Khalid, while expressing his views, said that the launch of the Global Development Initiative (GDI), Global Civilization Initiative (GCI), and Global Security Imitative (GCI) was taking place at a time of major transformation in the international system.\nThe major motivation behind GDI was the adverse impact of COVID-19. GDI aimed to take advantage of technology, innovation, and modern infrastructure to tackle the issues faced by the world.\nHe added that today’s world was driven by multiple challenges and the developing countries needed support. Unilateralism and a zero-sum mindset were creating more disorder in the already destabilized world.\nAmidst this growing polarization, China emerged as a spokesman for peace, development, and cooperation.\nDr. Tahir Mumtaz Awan from COMSATS University noted that as people, development, and civilizations were linked GDI, GSI, and GCI inter-linked initiatives.\nThe Global Development Initiative by China talked about the collective development of all countries. BRI and CPEC were living examples of development initiatives launched by China.\nSumming up his remarks, he stressed that GDI had provided Pakistan with an alignment to carve out a path for development and made clear the targets that should be met.\nDr. Sumeera Imran from NDU, while expressing her views, said that GDI reflected President Xi’s agenda of global responsibility. It was a model initiative that aimed to boost cooperation.\nWithin the framework of GDI, Pakistan sought to benefit from China. Emerging technologies could play a big role to achieve the targets of global development. She suggested that, for China-Pakistan cooperation in GDI, the first target should be poverty alleviation, as 55 percent of the Pakistani population was living below the poverty line.\nFurthermore, the two sides needed to strengthen cooperation in the domains of agriculture, food security, health security, education, etc.\nDr. Wang Shida, from the China Institutes of Contemporary International Relations (CICIR), said that the essence of President Xi Jinping’s Global Development Initiative was based on some core objectives, which included: adhering to priorities, inclusivity, innovation drive, action-oriented approaches, capacity building, and economic cooperation.\nHe noted that climate change was one of the foremost challenges in regional and global development. Summing up, he stated that to tackle the major changes in development there was a need to promote conservation, improve taxation, and mindful use of resources.\nAmbassador Khalid Mahmood, Chairman, of BoG ISSI, in his concluding remarks, stated that the key objective of GDI was that development should be at the centre of all human efforts. Problems of development could be solved by joint and concerted efforts.\nThere should be policy formation through a participatory process and joint consultations and the outcome should be shared with everyone. This initiative, without doubt, will enable global rejuvenation.",
  "retrievedAt": "2025-08-11T08:34:12.133Z"
}
