{
  "title": "Marriyum rules out talks with elements which ‘attacked state institutions’",
  "link": "https://www.app.com.pk/national/marriyum-rules-out-talks-with-elements-which-attacked-state-institutions/",
  "date_published": "2023-05-27T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday ruled out negotiations with Imran Khan, stating talks could not be held with those who attacked the state, rather were awarded punishment.\nIn a statement issued here, the minister said Imran Khan was not appealing for negotiations, he was, in fact, seeking an “NRO”.\nTaking a jibe at Imran, she said the foreign agent who committed robbery on Rs 60 billion was to be brought to justice.\nShe ruled out talks with those who attacked sensitive installations and buildings which were symbols of national pride including General Headquarters, those who desecrated the memorials of martyrs and Ghazis, who attacked ambulances, hospitals and schools and were involved in vandalism.\nShe said talks cannot be held with those who poisoned the minds of the youth.\nThe minister said that negotiations could not be held with the leaders of the criminals and terrorists.\nShe said while his party crumbled like a castle of sand, Imran was pleading for talks, recalling how electables were brought in planes to join the Pakistan Tehreek-e-Insaf.\nMarriyum Aurangzeb opined that parties not formed on any political ideology were disintegrated like the PTI.\nThe entire leadership of the PML-N including Nawaz Sharif, Shehbaz Sharif, Hamza Shahbaz, Maryam Nawaz spent hundreds of days in jails and detention centres, she said adding they faced false cases but stood firm and finally emerged victorious.\nShe said Imran Khan refused to negotiate with his political opponents on the economy, Kashmir and security issues.\nImran was not ready to sit with the opposition parties on critical issues like corona pandemic and the FATF issue, she said.\nShe maintained that dialogue could not be held with those who set the country on fire, create chaos and anarchy, fills the minds of masses with hatred, and harbour armed groups.",
  "retrievedAt": "2025-08-11T08:34:07.937Z"
}
