{
  "title": "May 28, a red-letter day in Pakistan’s history which ensures invincible defence, regional stability",
  "link": "https://www.app.com.pk/national/may-28-a-red-letter-day-in-pakistans-history-which-ensures-invincible-defence-regional-stability/",
  "date_published": "2023-05-27T07:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): The nation is fervently celebrating 25th anniversary of Pakistan’s nuclear tests conducted on May 28, 1998 which was a historic day that led to achievement of invincible defence capabilities and ensured regional stability through power equilibrium.\nThe day brought a revival for the entire Pakistani nation and became a moment of pride for the Muslim Ummah.\nThe day, now remembered as Youm-e-Takbeer is being celebrated every year across the country as a day of national pride and thanksgivings which made Pakistan the seventh nuclear nation of the world and the first Muslim state, having the nuclear arsenal in its defense stockpile to exercise maximum deterrence for peaceful purposes.\nThe tests not only demonstrated the resolve of the Pakistani nation to safeguard Pakistan’s territorial integrity, independence and sovereignty, but also the desire to preserve strategic balance in South Asia.\nThe historic statement of former Prime Minister Zulfikar Ali Bhutto that they would starve but transform the country into a nuclear power, led to achievement of this milestone.\nOn that day, the Pakistani leadership, notwithstanding external pressures and Indian hegemonic designs to tilt power balance through its nuclear tests, opted courageously in 1998 to respond, and restored the power balance in South Asia by conducting nuclear tests.\nWith such tactical and sagacious response by Pakistan on May 28, 1998, it became “a red letter day” in the country’s history, silencing the belligerent ruling junta in its neighbourhood that was clamouring with ill-conceived expansionist designs.\nYoum-e-Takbeer, which literally means “the day when Allah’s name was exalted” regularly infuses new verve into the high soaring spirits of a nation which refused to cower down by the repeated threats of war mongering mindset in its neighourhood.\nThe history of acquiring the modern nuclear technology for exercising maximum restraint and for purely peaceful purposes, entails commitment, patriotism and strong obligation on the part of Pakistani leadership, for territorial integrity of the country.\nIndia had tested its “device” for the first time in 1974 which compelled Pakistan to expedite its nuclear programme with renewed commitment.\nAmid slogans of “Allah-o-Akbar”, Pakistan conducted its first test on May 28, 1998, at the RasKoh hills in the Chaghai District of Balochistan.\nBut resisting the mounting external pressures to restrain and not to respond in kind, the then Prime Minister of Pakistan Muhammad Nawaz Sharif went for the bold decision to test the Pakistani nukes and thus balancing the strategic slanting power in the region.\nPakistan is committed to the promotion of environment of peace and stability in South Asia, while preserving its capability to ward off aggression or adventurism in any form.\nIt is a partner in international efforts to strengthen the global non-proliferation regime based on the principles of non-discrimination and equal security for all states.\nIt adheres to the latest international standards on export controls and maintains highest standards of nuclear safety and security.",
  "retrievedAt": "2025-08-11T08:34:13.934Z"
}
