{
  "title": "Missing limbs and loved ones, children from Gaza begin treatment journey abroad - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: Six-year-old Omar Abu Kuwaik still believes that by his next birthday, his missing hand will have grown back.\n\nHe is one of thousands of Palestinian children who have lost limbs and loved ones in Israel’s bombing campaign of the Gaza Strip. “It’ll be big again when I turn seven,” he tells his aunt, softly rubbing his left arm, which ends just below his elbow.\n\nOmar was the lone survivor of an Israeli airstrike that flattened his grandparents’ home in Gaza in Dec 2023, killing his parents, sister and extended family. He is among a small group of Gazan families transferred from Cairo to Beirut earlier this month for medical treatment.\n\nHis aunt Maha Abu Kuwaik says he now calls her “mama”. “He’s scared of everything now — sleep, doctors, any loud sound. He asks me not to be sad. ‘Smile, Mama,’ he says. ‘I don’t like it when people cry’”, she said, her voice cracking.\n\nOmar was pulled from the rubble with severe burns, a shattered leg, and his left hand already severed by the blast. With Gaza’s hospitals in ruins, Maha sought help from the World Health Organisation.\n\nThey helped evacuate Omar to Egypt for basic treatment, before his transfer to Lebanon under a programme sponsored by the Palestinian Children’s Relief Fund and a fund set up by Ghassan Abu Sittah, a British-Palestinian surgeon.\n\nMaha had to leave her own children in Gaza to accompany Omar. “It was the hardest decision of my life to leave my sons in a war zone,” she said. “But Omar had no one else. I couldn’t leave him.”\n\nDoctors in Beirut are now considering a prosthetic hand and reconstructive surgery for Omar.\n\nYou’re a hero\n\nFourteen-year-old Amir Hajjaj only remembers snapshots of the night his world changed: a red flash, an explosion, then silence.\n\n“I was just sitting on a chair,” he said softly, “then everything turned red, and I was on the ground. I didn’t even know what happened.”\n\nAn Israeli strike hit his family’s home in northern Gaza in late 2023. Shrapnel pierced both his shoulders, his leg, and his hand. He bled for hours as Israeli tanks shelled their street during their escape, Amir’s older sister Alaa said.\n\n“He kept saying, ‘Leave me, save yourselves’,” Alaa recalled. “But how could I leave him behind?”\n\nAmir bled for four days in an overcrowded hospital. By the time doctors got to him, it was too late to save the fingers of his right hand.\n\nHe was evacuated to Cairo, where the Palestine Children’s Relief Fund later arranged for his transfer to Beirut. He is now awaiting nerve treatment and physiotherapy.\n\n“He tries to hide his hand in photos. I tell him, ‘You’re a hero,’” Alaa said.\n\nAt least 45,000 children have been wounded in Gaza, many of them suffering life-changing injuries, according to the United Nations Children’s Fund (Unicef. Over 18,000 children have been killed in the conflict, among a total death toll of 64,000, it said.\n\nOlfat Abdulkarim Abdallah, a mother of three, arrived in Lebanon with her two wounded daughters: Mays, 5, who has three fractures and a torn nerve in her leg, and Aya, 7, who lost her right leg.\n\nAn Israeli strike tore through their home in Gaza on Nov 8, 2023. “I didn’t even hear the explosion,” Olfat said, her voice barely above a whisper.\n\n“I only heard Aya scream. Mays didn’t make a sound. She just looked down at the blood pouring out of her.”\n\nOlfat clings to the hope that her daughters’ pain might finally give way to healing. Doctors at the American University of Beirut Medical Center and the Ghassan Abu Sittah Children’s Fund said Aya will need a new limb, while Mays might walk again with physiotherapy alone.\n\n“I’m holding onto the possibility that this treatment will give them a better life than the horrors they’ve lived,” their mother said. Mohammed Ziara, a Gaza-born plastic surgeon working on the cases in Beirut, said treatment plans were in place and progressing as expected. Organisers are hoping to bring 30 more wounded Gazan children to Lebanon for treatment.\n\n“The children are happy and comfortable,” he said. “We’re also providing all the psychological support needed for their recovery.”\n\nPublished in Dawn, September 11th, 2025\n\nHeader image: Omar Abu Kuwaik, a six-year-old child who lost an arm, with his aunt in the apartment where they stay during his medical treatment in Beirut.—Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/111232332834f25.webp",
  "retrievedAt": "2025-10-12T04:05:36.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941086/missing-limbs-and-loved-ones-children-from-gaza-begin-treatment-journey-abroad",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:23:59.000Z"
}
