{
  "title": "‘China Inside’: How Chinese EV tech is reshaping global auto design - Business - DAWN.COM",
  "author": null,
  "content": "When Audi executives first saw the Zeekr 001 in 2021, a long-range electric vehicle with European aesthetics, it was a wake-up call for the premium German auto brand — if it wanted to compete with the Chinese, it needed their technology.\n\n“The Zeekr 001 back then shocked quite everyone,” said Stefan Poetzl, president of SAIC Audi Sales and Marketing. “We needed to do something about it.”\n\nTo boost its EV lineup for Chinese consumers, Audi built the AUDI E5 Sportback in just 18 months using technology provided by Chinese partner SAIC, including batteries, electric powertrain, infotainment software and advanced driving assisted systems.\n\nAudi expects to start delivering the $33,000 EV to customers in China this month and its global rivals are now also looking to use Chinese intellectual property to roll out new models rapidly.\n\nToyota and Volkswagen have joint development plans for China-dedicated models with technology from Chinese partners GAC and Xpeng, respectively.\n\nRenault and Ford want to go one step further and develop global models on Chinese EV platforms, sources said. Renault did not respond to a request for comment. Ford declined to comment.\n\nSuch licensing deals make up relatively small but growing revenue streams for Chinese EV makers and, for now, offer a new quid-pro-quo. Global automakers need Chinese technology to leapfrog development hurdles and launch new EVs quickly.\n\nMeanwhile, Chinese companies desperately need additional revenue amid a bruising price war at home and intensifying trade war abroad.\n\n“It is a very smart, win-win solution,” said Will Wang, General Manager of Shanghai-based consulting firm Autodatas, which provides teardown reports of best-selling EV models.\n\nThis new strategy resembles the “Intel Inside” campaign of the 1990s — where US chipmaker Intel used state-of-the-art components to transform computers into premium products.\n\nIn this case, Chinese automakers sell EV technology in a box: the underpinnings for ready-to-build, white label battery-powered cars suitable even for low-volume manufacturers with small budgets.\n\nLeapmotor has partnered with Stellantis to sell its EVs outside China and is talking to other brands to license its technology, CEO Zhu Jiangming told Reuters.\n\nUsing a ready-made Chinese EV chassis and software could save billions of dollars and years of development time and help traditional automakers catch up with Chinese rivals, auto industry experts say.\n\nRenault was an early adopter, building the low-cost Dacia Spring EV on a platform from China’s Dongfeng for sale in Europe starting in 2021.\n\nRenault has gone one step further with the new electric Twingo under development at its research centre in Shanghai, with a Chinese EV engineering firm Launch Design providing technical support in developing an EV platform, according to two people familiar with the matter.\n\nLaunch did not respond to requests for comment.\n\nOther “China Inside” models could be coming soon. Ford is seeking a Chinese partner to provide EV platform technologies, said two people with knowledge of the matter. CEO Jim Farley has frequently tested Chinese EVs and recently praised Xiaomi’s SU7 electric sedan.\n\nVolkswagen has expanded plans to develop China-dedicated models of all fuel types based on platforms co-developed with Xpeng, using the latter’s layout designs of electronics and software.\n\nAnalysts say legacy automakers typically struggle to develop agile EV systems that can be rapidly updated, due to complicated organisational structures.\n\nThat is why Volkswagen wants to see if Xpengs EV technologies can complement or replace Volkswagen’s own, said Yale Zhang, managing director at Shanghai-based consultancy AutoForesight. If it works in China, Volkswagen could apply the strategy globally, Zhang added.\n\nA Volkswagen China spokesperson told Reuters its collaboration with Xpeng was focused on China for now.\n\nXpeng’s He Xiaopeng has said the two automakers want to expand their partnership beyond China. That would boost Xpeng’s revenue without building plants overseas, said Autodatas’ Wang.\n\nOliver Wyman analyst Marco Santino said traditional automakers could use “firepower” of fierce Chinese EV competition to jump ahead of the development curve.\n\n“You get a much more quality-proof product in the market in a shorter timeframe,” Santino said.\n\nInspired by Tesla, China’s EV makers have developed modular platforms that cut costs and accelerate development and lower barriers of entry.\n\n“They are quick learners from Tesla,” said Forest Tu, a former executive at Chinese battery giant CATL who founded consulting firm Mapleview Technology.\n\nThat advantage is now big enough to sustain “licensing and royalty service” as Chinese EV makers expand overseas, Tu said.\n\nCATL adopted that approach with Ford, licensing its technology for a battery plant. Exporting Chinese technology could help less-industrialised countries build their own “national EV brands,” Tu said.\n\nAbu Dhabi-based CYVN Holdings, a strategic investor in Nio, has developed its own premium EV model using the Chinese EV maker’s chassis and software.\n\nCYVN bought British sports car maker McLaren in April and now plans to sell its EV using the McLaren brand, according to two sources familiar with the matter. But future models will incorporate far more McLaren “DNA” and less Chinese technology, one source said.\n\nNio declined to comment. CYVN did not respond to a request for comment.\n\nCATL’s new EV chassis, meanwhile, will allow consumers to “decide what an EV looks like, rather than having giant automakers decide what to sell,” its executive president Hu Guoliang said.\n\nCATL said it would ramp up chassis production in the next three years after signing with several domestic automakers. Its Bedrock Chassis debuted in Europe this week at the IAA Mobility show in Munich.\n\nWhether the mutual benefits of China’s EV technology last over the longer-term, however, remains a key question.\n\nFormer Aston Martin CEO Andy Palmer said while there were savings in R&D, automakers should avoid over-reliance on third-party technology. “In the long-term you’re screwed because you’re just a retailer,” said Palmer.\n\nOliver Wyman’s Santino said the big risk for traditional automakers is that using someone else’s technology means “your capability to differentiate your brand is really limited.”\n\nBy blending in their own technology, automakers can “limit the risk,” Santino added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/11113512bfef699.webp",
  "retrievedAt": "2025-09-19T14:34:34.532Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941184/china-inside-how-chinese-ev-tech-is-reshaping-global-auto-design",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T06:57:25.000Z"
}
