{
  "title": "Three years, three uprisings - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE last three years have seen three separate regimes in our region fall like dominoes before a popular uprising.\n\nGotabaya Rajapaksa’s regime in Sri Lanka fell in July 2022, when mobs enraged by the severity of the crisis brought on by sovereign default a few months earlier stormed the presidential palace, forcing the president and his ministers to flee the country.\n\nSheikh Hasina Wajed’s government in Bangladesh fell before a mob of students that marched on her residence in Dhaka two years later in August 2024. And now Nepal, where the prime minister has resigned as violent mobs of youth burned down the parliament building and overran the residences not only of the government leadership but other political figures as well.\n\nIt is hard to escape the impression that all three episodes of a popular uprising causing the countries’ leadership to abdicate authority and flee are connected in some way. The points of divergence are obvious and visible. The immediate trigger in Sri Lanka was the severe degradation of life brought on by sharp economic deterioration after a default. This included food and energy shortages, spiking inflation and mass unemployment.\n\nIn Bangladesh, the immediate trigger seemed to be an announcement about quotas for government jobs, something that was a burning issue in that country for many years as Sheikh Hasina used these quotas to entrench her power by assigning them to loyalist groups. In Nepal, the immediate trigger appeared to be the shutdown of social media sites by the government, though the intensity and ferocity of the uprising seemed to suggest deeper frustrations being vented.\n\nThe three uprisings in three years were all organic, in the sense there was no party vanguard, no organising force making them happen. The mobs did not consist of people brought in convoys of buses supplied by a political party, nor did they have a leadership at the helm, except perhaps a loosely knit group of student leaders that messaged out to everyone else. None of these uprisings were built on organised crowds, mobilised by party leaders, transported on vehicles supplied by the party or fuelled by speeches on loudspeakers delivered by party leaders riding in party-supplied cars.\n\nThis is the key thing to understand about these uprisings. How did the trigger event lead to the formation of such a large mob so fast?\n\nThis can only happen if there are some common elements binding all the people who joined the mob in the first place. This can include disaffection with the material conditions of life, perhaps following a protracted bout of inflation that burned away large amounts of purchasing power and left the people to fend for themselves in the face of the awful choices that grinding austerity thrusts upon us. Or it can be large-scale loss of trust in the institutions of society, where even a fake news item can trigger mass solidarities of the sort it takes to make an uprising.\n\nThe uprisings in Sri Lanka, Bangladesh and Nepal were all organic.\n\nIn Sri Lanka, the trigger was a sudden overnight power blackout for a population already reeling from the effects of sharply rising fuel prices. In June 2021, for instance, the government had sharply raised the price of petrol for the first time in many years, bringing it to Sri Lankan rupees157. From there onwards, till the month of default in March 2022, the price had reached Rs338. In July, when the uprising hit, it had reached Rs450.\n\nThis is a near tripling of the price of an essential fuel in one year. For perspective, it took almost two decades for the same price to triple in Sri Lanka, going from somewhere around Rs50 in the mid-1990s to around Rs150 in the mid-2010s. For this price to do in one year what it took 20 to do in years past is evidence of a massive shock to the purchasing power of the masses.\n\nIn Bangladesh, a key role seems have been played by unemployment. That country always had high rates of youth unemployment, and even higher rates of graduate unemployment. Among university graduates, government jobs were always deeply aspirational. The pandemic was the first shock to employment, especially among the youth.\n\nThis trend seems to have dovetailed with the growing centralisation of power by Sheikh Hasina, in which quotas for government jobs were reserved for her party loyalists only. The resentment this built, blew up in July 2024 when the high court issued a questionable judgement reinstating a controversial quota system that handed over government jobs to Hasina loyalists. Following the uprising, the judges who authored that judgement were removed from service.\n\nIt is too early to say what lay behind the Nepal uprising. But in time it will become clear what conditions created the large-scale disaffection that needed only a single trigger to ignite. The generalised anger among the youth — who comprised the rank and file of that movement — against the entire political class shows the anger had deep wellsprings.\n\nIn Pakistan, the ground is quite fertile for something similar to happen. The speed with which protests by schoolchildren spread across Punjab following a fake rumour about a female student having been a victim of a violent crime shows that such organic crowds can form rapidly here too, without direction from any party.\n\nIt would be hard for such a mob to march on the capital, since unlike the other three countries, Pakistan’s capital is a long distance away from population centres (except Rawalpindi). But provincial capitals are still vulnerable.\n\nThe long bout of inflation that has eaten away more than a third of people’s household income in some cases, coupled with the very low levels of trust in government institutions, sets the stage for such an event here. This is why recourse to repression must be tempered, and a credible focus on employment creation must become a government priority.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c23692ba340.jpg",
  "retrievedAt": "2025-10-12T04:05:33.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941112",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:41:42.000Z"
}
