{
  "title": "Mike Hesson dismisses Pakistan batting concerns ahead of Asia Cup India clash - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s white-ball head coach Mike Hesson dismissed concerns about the national squad’s batting performance on Thursday ahead of the upcoming Asia Cup clash with India.\n\nThe arch-rivals will clash in a geopolitically-charged men’s Asia Cup contest in Dubai on Sunday. It will be the first cricket match between the sides since four days of military conflict between the nuclear-armed neighbours in May.\n\nWhile reigning T20 world champions India are the firm favourites to retain their title, Pakistan are on a high, having convincingly beaten Afghanistan in the final of a tri-series, also involving hosts United Arab Emirates (UAE), on Sunday. Pakistan play against Oman tomorrow.\n\nQuestioned during a pre-match press conference in Dubai about the team’s batting performance and judgement, Hesson said he was “not quite sure” where the concerns were arising from, saying the team had played against the “best wrist spin attack” in the world and won by over 70 runs against Afghanistan in the tri-series final.\n\n“It’s very much a developing batting lineup. There’s many players who can win you the game on their day but they don’t have as many good days as you’d like at the moment … the thing for us is that we are more interested in the sum of the parts as a batting group.”\n\nHesson said that as a batting unit, “we have got the job done”.\n\nThe coach said what mattered for a team over a fifty or 190 runs was “what’s required to win the game and can we get above that — that’s the only thing that matters — it’s not about average strike rate”.\n\nHesson said it was exciting to be part of the “highly charged” event, adding that ultimately it was about keeping everyone focused on the task at hand. “That will be no different in the weekend,” he said.\n\nHe said India were “hugely confident and rightfully so” in terms of their performance, adding that Pakistan were “very much focused on improving as a team day by day and not getting too far ahead of ourselves”.\n\nThe coach further said: “We are well aware of the, I wouldn’t say the enormity of the task [of beating India], I would say the challenge of the task ahead and we are certainly looking forward to it.”\n\nHe said the squad for tomorrow’s match had not yet been finalised, adding that the Dubai pitch was very different from Sharjah regarding the abrasiveness of the grass. “I think within our squad we have got the balance to deal with it, we have got plenty of multi-skilled players which give us a bit of flexibility,” the coach added.\n\nHesson said he did not expect the pitch to provide spin as the one in Sharjah did. “The beauty of our side is we have got five spinners,” he said, saying Mohammad Nawaz was the “best spin bowler” in the world and also pointed to the performances of Abrar Ahmed, Sufyan Moqim, Salman Ali Agha and Saim Ayub.\n\n“We have got a lot of spin bowling options if we think the conditions suit that. If we don’t, we’ve got five seamers as well,” he added.\n\nThe eight-nation T20 tournament began on Tuesday with Afghanistan beating Hong Kong by 94 runs. India crushed the hosts, the UAE, by nine wickets on Wednesday.\n\nSince winning the World Cup last year, India has won 18 of their 21 T20Is.\n\nIndia, Pakistan, Oman and UAE are in Group A, while Sri Lanka, Afghanistan, Hong Kong and Bangladesh form Group B.\n\nThe top two teams from each Group will qualify for the Super Four stage.\n\nThe top two teams will then play the September 28 final in Dubai.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/11184848dadd608.webp",
  "retrievedAt": "2025-09-19T14:34:36.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941252/mike-hesson-dismisses-pakistan-batting-concerns-ahead-of-asia-cup-india-clash",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T14:37:08.000Z"
}
