{
  "title": "Lahore’s female bikers push for space on the road - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Women on motorcycles are becoming an increasingly common sight in Pakistan’s major cities.\n\nFrom university students navigating traffic to working women managing school runs, two-wheelers have become a practical and affordable solution to unreliable public transport.\n\nYet, despite this growing presence, female riders continue to face significant hurdles, limited infrastructure, patchy support and the challenges of navigating a male-dominated road culture.\n\nIn Lahore, female motorcyclists regularly weave through the traffic in residential neighborhoods and around university campuses. Often in traditional shalwar kameez and carrying backpacks, they ride alongside men. This surge is a response to a powerful trifecta of forces: economic pressure, the need for safety and a push toward personal independence.\n\nThe rise in female riders is primarily driven by necessity.\n\nSidra Farooq, a university student, explains, “A rickshaw to my office costs Rs500 a day. Petrol on my bike costs less than Rs200.”\n\nEconomy, need for safety, personal independence behind the change\n\nGiven that motorcycles make up 74pc of all registered vehicles in Pakistan, their affordability makes them a natural choice for women juggling work, study, and family responsibilities. While affordability is key, safety and autonomy are equally powerful motivators.\n\nHarassment on public transport has long restricted women’s mobility in Pakistan. A UN Women Safety Audit in Public Places in Lahore found that 90pc of women have faced harassment while commuting, including 82pc at bus stops. Such challenges partly explain why Pakistan’s female labour force participation rate remains just 24.26pc, among the lowest globally, the World Bank’s 2024 report shows.\n\nBeyond cost and safety, motorcycles have emerged as empowering tools, offering privacy, control and greater access to work, education, and social spaces.\n\n“It makes me feel independent. Whenever and wherever I want, I can go without troubling my brother or father or booking a ride daily,” says Hiba Afzal, a student at UMT, Lahore. This shift is evident not just on the streets but also in electric vehicle (EV) sales and policy initiatives.\n\nMuhammad Saeed Akhtar, vice president of sales at an EV company in Pakistan, says the shift reflects trends across the wider electric vehicle market.\n\n“Seventy percent of EV buyers are now women nationwide,” he says, noting that sales across the EV industry have surged by 30pc in the last six months.\n\nCompared to the previous year, total EV bike sales in Pakistan have more than doubled, from around 20,000 units to between 43,000 and 45,000, with Lahore driving sales.\n\nThis growth coincides with Pakistan’s EV Policy 2025, which reserves 25pc of e-bike subsidies specifically for women, a clear institutional effort to boost female mobility.\n\nVisibility campaigns and training programs have reinforced this confidence, helping normalise women’s presence on the roads.\n\nThe Punjab government’s Strategic Reforms Unit (SRU) launched Women on Wheels (WoW), one of the earliest formal initiatives to empower women through riding lessons and subsidised bikes. Between 2016 and 2019, over 5,000 women were trained before the programme was discontinued. Its founder, Salman Sufi, later carried forward the mission through his non-profit.\n\nToday, WoW’s legacy is evident in parts of Lahore, where women ride motorcycles and scooters and riders note a gradual shift in public attitudes.\n\nAnum Shehzadi, a bank employee who began riding bike in 2020, recalls, “When I started, drivers would slow down their vehicles just to stare. Now, reactions are more respectful.”\n\nThis gradual acceptance has encouraged women to explore new avenues for mobility, including digital ride-hailing platforms, where they are not only passengers but increasingly drivers themselves. Such participation signals a rising visibility of women on the city’s roads. While this represents an important shift, sustained support is needed to expand female driver programmes and corporate initiatives.\n\nNotwithstanding these gains, many women still face barriers. Family pressure often forces the riders to abandon biking, while unsafe conditions add further risk.\n\n“Women innovate their own solutions, like modifying abayas (robe) to avoid wheel entanglement, but they still struggle to find protective gear and reliable support. Proper training on traffic rules, bike maintenance, and safe riding, along with stricter enforcement of safety laws, would significantly boost their confidence,” says one Fariha Zulfiqar.\n\nPast mobility initiatives, though promising, have struggled without long-term government backing. Despite Rs90m subsidy allocation, only 700 subsidised bikes were distributed under WoW. The programme was eventually phased out in 2019 after a change in the government.\n\nWhile some women push through challenges, progress often remains individual rather than systemic. Even trailblazers like Faryal Ashraf, Pakistan’s first aspiring female road racer, face exclusion from all-male clubs and races.\n\n“Some people still believe riding and racing are only for men,” she says. “People often stare, and acceptance is still limited in some spaces.” For Ashraf, the challenge extends beyond riding to transforming societal perceptions.\n\n“Riding and racing aren’t just for men—they’re for anyone with skill, dedication, and courage. I want to see professional training facilities and legal racing events where riders, especially women, can develop their riding skill safely and professionally. Every time I ride, I’m breaking barriers not just for myself but for other women too,” she adds.\n\nLasting change, however, cannot rest on personal determination alone. It requires coordinated action from city authorities, transport agencies, and the private sector.\n\nWith strict enforcement of protective laws, inclusive infrastructure, and a culture that accepts women as a normal, respected part of traffic, riding becomes safe and empowering. Training programmes and accessible facilities help, but true progress comes when women on motorcycles are no longer exceptions, but a natural part of Lahore’s everyday rhythm, confidently claiming their place alongside men.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c253de60894.jpg",
  "retrievedAt": "2025-10-12T04:05:59.125Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941150/lahores-female-bikers-push-for-space-on-the-road",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T04:44:27.000Z"
}
