{
  "title": "Uzbekistan Airways to increase flights to Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As part of efforts to deepen ties, enhance economic diplomacy and boost tourism cooperation, Uzbekistan Airways is increasing the number of regular flights between the two countries.\n\nThe Uzbek embassy in Islamabad said on Wednesday that Uzbekistan and Pakistan continued to strengthen their friendly relations and expand cooperation across multiple sectors. In this process, transport and logistics, particularly air connectivity, played a crucial role.\n\nStarting October 28, the frequency of flights on ‘Tashkent-Islamabad-Tashkent’ route will be doubled, from once a week to two flights per week.\n\nCurrently, Uzbekistan Airways operated flights twice a week — on Wednesdays and Fridays — on the ‘Tashkent-Lahore-Tashkent’ route, and once a week (on Saturdays) on the ‘Tashkent-Islamabad-Tashkent’ route.\n\nDue to consistently high demand, with flights running at full passenger capacity and tickets selling out several days in advance, the airline had decided to expand its flight schedule.\n\nThe Embassy of Uzbekistan said increase in flight frequency would not only provide greater convenience for travelers but also foster closer trade and economic cooperation, encourage business partnerships and support more frequent exchanges between the two nations.\n\nThe embassy said these additional flights would also strengthen cultural and humanitarian ties between the brotherly peoples of Uzbekistan and Pakistan.\n\nFurthermore, the expansion of flights offers significant advantages for international travelers. Tashkent International Airport serves as a strategic transit hub, providing convenient connections from Pakistan to destinations across Europe, North America, and Asia. This made Uzbekistan Airways an attractive option for passengers seeking smooth and efficient travel to global destinations.\n\nAccording to the Uzbek embassy, the regular expansion of flight frequencies was a strategic step for both Uzbekistan and Pakistan, reflecting the growing partnership between the two nations and taking bilateral relations to a new level of cooperation and connectivity.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/111208381f02ec9.webp",
  "retrievedAt": "2025-09-19T14:34:49.758Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941041/uzbekistan-airways-to-increase-flights-to-pakistan",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:24:19.000Z"
}
