{
  "title": "Pakistan ‘better off’ than last floods, but fiscally bound - Pakistan - DAWN.COM",
  "author": null,
  "content": "• HRW calls on government to address unchecked development amid changing climate\n• HRCP highlights plight of climate refugees\n\nISLAMABAD: Pakistan has ente­red this year’s flood season with more substantial economic buffers than it had before the 2022-23 floods, but the country’s improved macroeconomic situation comes with new constraints, according to a `targeted analysis’ carried out by the Famine Early Warning Systems (FEWS) Network.\n\nThe analysis expects that the 2025 floods will primarily drive short-term, localised, food insecurity among flood-affected households.\n\nProduced at the request of the US government as a part of FEWS NET’s global coverage, the report notes that this time, the flood response will be constrained by limited fiscal intervention capacity, in contrast to the emergency subsidies in 2022-23.\n\nThe 37-month IMF Extended Fund Facility explicitly prohibits the use of untargeted subsidies and market interventions that were used during the previous floods.\n\nAccording to the analysis, increases of eight to 10 per cent in wheat prices are expected in coming months due to flood-related market supply disruptions, but will likely return to near-normal levels once affected roads are restored.\n\nHowever, production losses of Kharif season crops due to flooding are expected, particularly for rice, sugarcane, cotton, and vegetables.\n\nThe government can deploy foreign reserves in the event that emergency imports are needed, and negative food inflation provides a substantial cushion against the level of price spikes that devastated household purchasing power in 2022, according to the analysis.\n\nThe ongoing floods are expected to affect the Kharif season, which started in April. While complete information on the extent of crop damage due to flooding is not yet available, early findings indicate a significant localised impact.\n\nThey are expected, however, to affect household income from agricultural labour and crop sales, particularly in Punjab, the report warns.\n\nHRW report\n\nIn a separate statement, global rights watchdog Human Rights Watch has called upon the government to address unchecked development amid a changing climate.\n\nIt noted that unchecked development exacerbates the effects of floods, and one representative example is the Ravi Riverfront Urban Development Project, which the government launched in August 2020 to address Lahore’s many problems — pollution, sewage, water, housing and employment — while aiming to revive the city’s “lost glory”.\n\nThis is just the latest in a string of failures by successive governments in Pakistan to enact needed reforms and policies to regulate development, HRW said.\n\nIt assailed the government over its history of conducting “poor quality environmental assessments for politically connected infrastructure projects”.\n\n“In this case, it ignored warnings by independent environmental activists and experts who called the project ecologically and financially unviable and argued that building barrages and other dams on the river and replacing farmland with paved concrete could swell water levels upstream and cause flooding.”\n\nToday, most of the area earmarked for the project is submerged, along with parts of Lahore city itself, HRW regretted.\n\nProtecting the vulnerable\n\nMeanwhile, the Human Rights Commission of Pakistan (HRCP), has called for expanding the rescue and relief operations that are currently underway, with a particular focus on the most vulnerable segments.\n\nIn a statement issued on Wednesday, the rights body highlighted the plight of climate refugees, who have been forced to abandon their homes and livelihoods.\n\n“Particular attention must be given to the most vulnerable — women, children, the elderly and persons living with disabilities.”\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:35:01.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941095/pakistan-better-off-than-last-floods-but-fiscally-bound",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:23:39.000Z"
}
