{
  "title": "Pakistan, Bahrain agree to expand cooperation in multiple sectors - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and Bahrain on Wednesday agreed to enhance cooperation in the fields of counter-terrorism, anti-narcotics, and immigration.\n\nThe agreement was reached during a meeting between Interior Minister Mohsin Naqvi and his Bahraini counterpart, General Rashid bin Abdullah Al Khalifa.\n\nDuring the meeting, the two sides also agreed to establish a Joint Working Group (JWG) to enhance collaboration across multiple sectors, including counter-narcotics, counter-terrorism, coast guard operations, border security, immigration and police training.\n\nThey also decided to sign Mem­oranda of Understanding (MoUs) covering extradition, mutual legal assistance, and specialised battalion training.\n\nBoth sides agree to form a joint working group for the purpose\n\nSpeaking on the occasion, Interior Minister Naqvi emphasised the importance of intensified efforts against drug trafficking, saying: “Cooperation in counter-narcotics is of utmost importance — it concerns the future of our coming generations.”\n\nHe praised Pakistan’s Anti-Narcotics Force (ANF) for achieving a record-breaking $146 million recovery despite limited resources, and welcomed Bahrain’s move to appoint a Drug Liaison Officer at its embassy in the federal capital.\n\nHighlighting the strong people-to-people ties, Mr Naqvi pointed out that over 120,000 Pakistanis living in Bahrain contribute significantly to the development of both countries.\n\nBahrain’s interior minister reaffirmed his country’s commitment to Pakistan, stating, “Bahrain attaches great importance to its brotherly relations with Pakistan and seeks to advance cooperation in all sectors”.\n\nHe said that formation of a Joint Working Group and signing of MoUs would provide fresh momentum to bilateral relations.\n\nHe said his country was keen to advance relations with Pakistan in all sectors. He said the establishment of the JWG and the signing of the MOU will promote cooperation between the two countries.\n\nDelegation-level talks were also held between officials of the interior ministries of Pakistan and Bahrain, during which detailed discussions were held on enhancing cooperation in various fields.\n\nBoth sides also agreed to form a joint working group to further strengthen cooperation between the two countries.\n\nLater, the Bahrani interior minister also met President Asif Ali Zardari and Prime Minister Shehbaz Sharif separately.\n\nAccording to the PM Office, the PM during the meeting expressed Pakistan’s desire to enhance cooperation with Bahrain in trade and other diverse sectors.\n\nThe prime minister said that Pakistan was providing expedited visa processing facilities for Bahraini businessmen.\n\nHe expressed the hope that Bahrain would invest in various sectors of Pakistan, emphasising the country’s commitment to offer maximum facilitation to foreign investors and entrepreneurs.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/110942467bcebff.webp",
  "retrievedAt": "2025-09-19T14:35:02.141Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941097/pakistan-bahrain-agree-to-expand-cooperation-in-multiple-sectors",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:23:39.000Z"
}
