{
  "title": "JI’s Peshawar protest condemns Israel’s attack on Hamas office in Qatar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Jamaat-i-Islami on Wednesday strongly condemned Israel attack on Hama’s negotiators in Qatar.\n\nSpeaking at a protest in the provincial capital, JI’s Peshawar Ameer Bahrullah Khan advocate said Hamas had already shattered Israel and accused Israel of carrying out two years of “systematic killings” of women, children, and civilians in Gaza and Palestine and condemned the United States and the United Nations for failing to act.\n\n“It is a shame for all global powers that speak of human rights but remain silent over the Palestinians genocide,” Mr Khan said in a statement issued from Markaz-i-Islami.\n\nThe speakers during the protest demonstration said that Hamas, despite being poorly armed, humiliated Israel and its allies, praising the Hamas leaders, mothers, and even children who sacrificed their lives.\n\nThey said that Hamas had agreed to meet in Qatar to consider the US proposal for a ceasefire but during talks, Israel launched missile strikes, allegedly backed by the Americans.\n\n“This attack was not only against Hamas but against diplomacy, humanity, and peace itself,” said Hafiz Hameedullah.\n\nHamas, they warned, had vowed to continue its resistance. “Even if Israel kills a thousand of our leaders, our struggle will not stop,” said another JI leader Tariq Mateen.\n\nThe demonstration was called by JI emir Hafiz Naeem ur Rehman. Similar protests were held across the country.\n\nJI held protests against Israeli attack on Hamas leaders in Qatar\n\nCHARSADDA: The Jamaat-e-Islami also organised a protest demonstration at Farooq Azam Chowk Charsadda against the attack on Hamas leaders in Qatar.\n\nThe protesters, holding placards and banners, chanted slogans of “Death to Israel and America”. They strongly criticised the American support to Israel, saying that Israel’s history is full of atrocities and barbarity, but the world powers, especially the United States, are openly supporting it.\n\nThe protest was addressed by Jamaat-e-Islami’s acting district emir Shah Zaman Durrani, general secretary Fawad Ahmed, Al-Khidmat Foundation president Saddam Hussein, Pir Masood Jan, Haroon Khan, Abdul Rehman and others.\n\nThe speakers said that atrocities being committed against the unarmed Palestinian people are inhumane. They strongly condemned Israel’s attacks on the Hamas office in Qatar, in which several key Hamas leaders were martyred. They demanded of the international community to intervene immediately stop the Israeli aggression against the Palestinian people..\n\nHARIPUR: Nominating US president Trump for Nobel Prize is worst form of slavery as the Americans were abetting the Israeli terrorism against innocent Gazans. This was stated by Tahir Atiq Sidiqi, district emir of Jamaat- i- Islami, while addressing a protest rally to condemn the Israeli attack on Hamas leaders in Qatar.\n\nAccusing the US president of being hand in gloves with Israel in the history’s worst genocide of Palestinian Muslims, Mr Sidiqi said that nominating Trump for Nobel Prize by Pakistani government was tantamount to supporting the oppression against the innocent Muslims in Gaza.\n\nHe also exhorted the COAS Field Marshal Syed Asim Munir to use his influence for the protection of Muslim Ummah. Qazi Tanzeel ur Rehman, Maulana Shafiul Haq, Ashraf Awan and Qazi Wajaat advocate were prominent among those who spoke to the protesters.\n\nBATTAGRAM: In response to Israel forces on Hamas leadership in Qatar, the Battagram chapter of the JI organised a protest gathering on the Karakoram Highway at Khatm-i-Nabuwat Chowk to denounce the attack on the Hamas leaders during a dialogue session.\n\nThe protesters carrying placards and banners with slogans against Israel and America termed Israel a “terrorist and rogue state.”\n\nAnwar Baig, the district emir of Jamaat-i- Islami, strongly condemned the attack, describing it a cowardly act. Khalid Khan, president of the Al-Khidmat Foundation, highlighted the humanitarian crisis in Gaza, where children, women, and men are dying due to starvation as Israel has blocked aid routes. He criticised America for ignoring the situation despite its claims of championing human rights.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c1e97ea81f3.jpg",
  "retrievedAt": "2025-09-19T14:34:48.729Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941024/jis-peshawar-protest-condemns-israels-attack-on-hamas-office-in-qatar",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:24:27.000Z"
}
