{
  "title": "Islamabad sessions court overturns judicial magistrate’s order banning 11 YouTube channels - Pakistan - DAWN.COM",
  "author": null,
  "content": "An Islamabad district and sessions court on Thursday set aside a lower court’s order to block 27 YouTube channels, granting relief to 11 petitioners.\n\nIn July, it emerged that an Islamabad court had ordered YouTube in June to block 27 channels for disseminating “fake, misleading, and defamatory” content against the government and armed forces. The sanctioned accounts were being run by journalists, political commentators and social media influencers in Pakistan and overseas. The ban order sparked criticism from various legal and digital rights groups.\n\nAmong the 27 channels were those of the PTI, journalists Matiuallah Jan, Wajahat Khan, Ahmad Noorani and Asad Ali Toor; former anchors Imran Riaz, Orya Maqbool, Sabir Shakir, and Moeed Pirzada.\n\nAdditional District and Sessions Judge (ADSJ) Muhammad Afzal Majoka had later suspended the order for at least seven petitioners. A total of 11 of those impacted had appealed against the lower court’s order.\n\nADSJ Majoka conducted a hearing over the matter today and expressed anger at the prosecutor of the National Cyber Crimes Investigation Agency.\n\n“You have started getting your work carried out through us. I will never let this happen. Tell me under which authority channels can be shut down? You are trying to defame the judges,” he remarked.\n\nThe judge said he would dismiss the petitions of those whose lawyers did not appear in court for non-compliance.\n\nHe subsequently reserved his verdict and later overturned the lower court’s order to the extent of 11 petitioners.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:34:33.371Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941258/islamabad-sessions-court-overturns-judicial-magistrates-order-banning-11-youtube-channels",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T15:35:05.000Z"
}
