{
  "title": "Scores tear-gassed, held amid violent protests across France - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Nearly 300 protesters were arrested as they disrupted traffic, torched a bus besides rubbish bins on roads and at times clashed with police across France on Wednesday in a bid to “Block Everything” in a show of anger against President Emmanuel Macron, the political establishment and planned budget cuts.\n\nThe demonstrators vented their anger against Macron, who is already facing political turmoil after the parliamentary opposition united to defeat his government on Monday.\n\nTens of thousands of security forces who had been deployed across the country removed blockades as fast as possible, officials said, meaning that France was, for now, not blocked despite some scuffles.\n\nThe president appointed a close ally as his new prime minister, conservative Sebastien Lecornu, who took office facing the same challenge to rein in France’s ballooning debt as his predecessor.\n\nNew PM promises a ‘profound break’ with past policies\n\n“It’s the same shit, it’s the same, it’s Macron who’s the problem, not the ministers,” Fred, a representative for the RATP public transport branch of the CGT union, said at a protest in Paris. “He has to go.”\n\nIn Paris, police fired tear gas on youths blocking the entrance to a high school and firefighters removed burnt objects from a barricade.\n\nPolice said they had stopped a large group of about 1,000 protesters from entering the Gare du Nord train station in the city.\n\n“I was expecting either a dissolution (of parliament) or a left-wing prime minister and we have neither, it’s frustrating,” said 18-year-old student Lisa Venier, who was among the protesters near the Gare du Nord.\n\nProtesters torched a bus in the western city of Rennes, Interior Minister Bruno Retailleau told reporters. He also said some protesters had attacked police with heavy cobblestones, but did not specify where.\n\nRetailleau warned that protest rallies scheduled for later in the day could be infiltrated by hard-line, ultra-left groups and become violent.\n\nThe “Block Everything” movement — a broad expression of discontent that has no centralised leadership and is organised in ad hoc fashion on social media — sprung up online in May among right-wing groups, researchers and officials said, but has since been taken over by the left and far-left.\n\nThe movement reflects popular discontent with a dysfunctional ruling elite preaching a painful gospel of austerity. It is drawing comparisons to the 2018 “Yellow Vest” protests, which arose over fuel price hikes but morphed into a broader movement against Macron and his plans for economic reform.\n\nAnger over budget cuts\n\nA teacher taking part in the protests in Paris said he was against the budget cuts that Prime Minis­ter Francois Bayrou had planned and that led to his defeat in Mon­day’s parliamentary confidence vote.\n\n“Bayrou was ousted, (now) his policies must be eliminated,” said teacher Christophe Lalande, calling for more funding for schools and hospitals.\n\nAt another protest in the city, unionist Amar Lagha said: “This day is a message to all the workers of this country: that there is no resignation, the fight continues.” In the western city of Nantes, protesters blocked a highway with burning tires and bins. Police used teargas to disperse people trying to occupy a roundabout.\n\nNew French PM\n\nFrance’s new Prime Minister Sebastien Lecornu on Wednesday promised a “profound break” with the past as he took over from Francois Bayrou who resigned after losing a confidence vote in parliament.\n\nSpeaking at a handover ceremony, Lecornu promised to find “more creative” ways than before to work with opposition parties as he assembles his cabinet, in a bid to end the political crisis.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c1f2fef1600.jpg",
  "retrievedAt": "2025-09-19T14:35:02.547Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941076/scores-tear-gassed-held-amid-violent-protests-across-france",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:23:32.000Z"
}
