{
  "title": "Tajik experts plant 300,000 flower saplings in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Horticulture and landscaping experts from Tajikistan planted around 300,000 flowers in various places of the capital, including President and Prime Minister House and Constitution Avenue.\n\nTajik experts not only brought local flowers, including Sylvia, from their country but also provided training to CDA staff.\n\nThe experts visited Pakistan on the special direction of Tajik president to help Islamabad in its beautification drive. On the direction of Prime Minister Shehbaz Sharif, the CDA on Wednesday gave a reception to the visiting delegation.\n\nAfter the reception, the CDA issued a press release, stating that a delegation of landscaping and horticulture experts from Tajikistan visited CDA headquarters, where they were welcomed by CDA chairman and chief commissioner Islamabad Mohammad Ali Randhawa who was accompanied by the civic body’s board members and other senior officers.\n\nIt said the Tajik delegation compromising horticulture experts apprised the chairman of the floral landscaping initiatives undertaken in Islamabad and offered practical support, expertise and guidance to the civic body in the field of horticulture.\n\nThe delegation mentioned that, in line with the vision of Prime Minister Shehbaz Sharif, special attention had been given to environmentally-friendly afforestation and landscaping to enhance the beauty of Islamabad. The experts shared their valuable experiences on plant cultivation and afforestation in Tajikistan with the CDA officials, the press release said.\n\nIt went on to say that the delegation visited various parks and green areas in the capital and praised the city’s beautiful and lush green parks.\n\nThey also provided important suggestions to the CDA’s Environment Team regarding the seasonal changes of flowers and introduced the cultivation of the Sylvia flowers in Islamabad.\n\nThe Tajik delegation appreciated CDA’s efforts to enhance the beauty of Islamabad and expressed their commitment to continue mutual cooperation in future.\n\nAccording to the press release, Mohammad Ali Randhawa said Pakistan held its relations with its brotherly country Tajikistan in high esteem and respect. He appreciated Tajikistan’s commitment to cooperating in the field of horticulture and beautification of Islamabad.\n\nThe meeting reaffirmed the commitment to further strengthen cooperation in various fields between Dushanbe and Islamabad.\n\nThe press release said the visit by the Tajik delegation would open new doors of cooperation between the two countries in areas of urban beautification and environmental improvement.\n\nAt the end of the meeting, on behalf of the prime minister, the CDA chairman presented souvenirs to the Tajik experts as a token of appreciation for their services and expressed his best wishes for them.\n\nIt is relevant to note here that on the request of Prime Minister Shehbaz Sharif, Azerbaijan with billions of rupees of their own funding and expertise, has been carrying out beautification work in Islamabad including Melody Market, Saidpur Village and on the entire Srinagar Highway.\n\nMinister plants sapling\n\nMinister of State for Education Wajiha Qamar on Wednesday planted trees at Islamabad’s major colleges — H-9 and H-8 Commerce College — and requested students and citizens to plant more and more trees to reduce effect of climate change.\n\nAfter chairing a meeting at Federal Directorate of Education, she visted said both colleges and planted trees.\n\nSpeaking on the occasion, she called for collective efforts to fight climate change stating that tree plantation is imperative.\n\nShe urged students and citizens to plant more and more trees. “Trees are lungs for the earth,“ she said.\n\nShe got briefing of achievements and challenges of both colleges.\n\nPrincipal of IMCB H-9 Prof. Javed Iqbal briefed her on the institution’s academic achievements, research projects, and community outreach activities.\n\nLater, at IMPCC H-8/4, (Commerce College) state minister planted a sapling and was briefed by Principal Dr. Muhammad Khalid on the college’s academic and extracurricular initiatives.\n\nFederal Government College Teachers Association also shared thier concerned over disclosure of ADP and some BS programs.\n\nPublished in Dawn, September 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:34:49.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941039/tajik-experts-plant-300000-flower-saplings-in-islamabad",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T02:24:19.000Z"
}
