{
  "title": "Washington, New Delhi ‘not that far apart’ on tariffs, says Trump’s India nominee - World - DAWN.COM",
  "author": null,
  "content": "Republican President Donald Trump’s nominee to be the United States ambassador to India said on Thursday that Washington and New Delhi were “not that far apart” on tariffs.\n\n“We’re not that far apart on a deal on these tariffs,” Sergio Gor, a close Trump aide who is currently director of the White House Presidential Personnel Office, said at his Senate confirmation hearing.\n\n“I do think it will get resolved in the next few weeks,” Gor said.\n\nUS-India ties have been strained by Trump’s trade war, with talks on lower tariff rates collapsing after India, the world’s fifth-largest economy, resisted opening its vast agricultural and dairy sectors. Bilateral trade between the two countries is worth more than $190 billion each year.\n\nTrump first imposed additional tariffs of 25 per cent on imports from India, then said they would double to 50pc from August 27 as punishment for New Delhi’s increased purchases of Russian oil, as Washington works to end the war in Ukraine.\n\nTrump said on Tuesday his administration is continuing negotiations to address trade barriers with India and that he would talk to Modi, in a sign of a reset after weeks of diplomatic friction.\n\nAsked whether he would commit to pushing to ensure that a summit meeting of the Quad, which groups India with Australia, Japan and the US, would take place as scheduled later this year, Gor said: “Without committing to exact dates … the president is fully committed to continue to meet with the Quad and strengthening it.”\n\nIndia has been expected to host a November Quad summit, with a more explicit focus on security regarding China than previously, but a person familiar with the matter told Reuters this month that Trump has yet to schedule a trip there.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/112252001a19ec3.webp",
  "retrievedAt": "2025-09-19T14:34:33.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941280/washington-new-delhi-not-that-far-apart-on-tariffs-says-trumps-india-nominee",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T17:56:36.000Z"
}
