{
  "article_id": "2025-03-25_d6b6f56c1c6d4c737e2162ea40b73edf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aurat-foundation-for-substantial-increase-in-excise-tax-on-cigarettes-other-tobacco-products/",
    "retrieved_at": "2025-08-27T14:00:21.932Z"
  },
  "metadata": {
    "title": "Aurat Foundation for substantial increase in excise tax on cigarettes, other tobacco products",
    "author": null,
    "date_published": "2025-03-25T11:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 299,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 25 (APP):A delegation from Aurat Foundation met with Federal Minister for National Health Services, Regulations, and Coordination Syed Mustafa Kamal on Tuesday, urging him to increase taxes on tobacco and nicotine products in the upcoming budget. On this occasion, Ms. Mumtaz Mughal, Director Program of Aurat Foundation said that Pakistan currently ranks 54th among 84 countries for tobacco smoking prevalence, said a press release. Alarmingly, tobacco advertising disproportionately targets youth, particularly young girls, adversely affecting their health, education, and future prospects. According to recent statistics, approximately 31.9 million adults aged 15 and above 19.7% of the adult population are current tobacco users. Safdar Raza, team leader explained that a recent study conducted by a reputable organization highlights the following key findings: 31.6 million adults (aged 15 and above), or 19.9% of the adult population, currently use tobacco, including 17.3 million smokers. Tobacco use is linked to more than 160,000 deaths annually in Pakistan. The total estimated economic cost of smoking-related diseases and deaths amounts to 1.6% of Pakistan's GDP each year. The study further highlights that without an increase in tobacco taxes, more than 490,000 individuals are projected to start smoking in Pakistan by 2025-26. Furthermore, Raza continued that the study reveals that cigarettes have become increasingly affordable due to the freeze on tobacco tax rates since February 2023. To address this, an excise tax increase of Rs. 39 per pack could lead to significant positive outcomes, including, reduction of 263,000 smokers, 6.9% decrease in cigarette consumption and additional government revenue of Rs. 67.4 billion. \"In view of the above, substantial tax Increase on tobacco and nicotine products would not only serve as a strong deterrent to tobacco use but also significantly contribute to improving public health outcomes and strengthening national fiscal revenues\", Ms. Mumtaz Mughal concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}