{
  "title": "PCB seeks Pakistan-India match referee’s removal from Asia Cup over alleged violations of ICC rules - World - DAWN.COM",
  "author": null,
  "content": "The Pakistan Cricket Board (PCB) on Monday lodged a complaint with the International Cricket Council (ICC) against the match referee for yesterday’s Asia Cup game between Pakistan and India over his alleged violations of rules pertaining to the “Spirit of Cricket”, PCB Chairperson Mohsin Naqvi said.\n\n“The PCB has lodged a complaint with the ICC regarding violations by the Match Referee of the ICC Code of Conduct and the MCC (Marylebone Cricket Club) Laws pertaining to the Spirit of Cricket,” Naqvi posted on X, referring to referee Andy Pycroft.\n\n“The PCB has demanded an immediate removal of the match referee from the Asia Cup,” he added.\n\nAccording to an earlier press release by the Asian Cricket Council (ACC), Pycroft was scheduled to be the match referee for the Pakistan-UAE match on Wednesday.\n\nThe Asia Cup match between the two sides took place on Sunday in Dubai, where spinners led by Kuldeep Yadav helped India beat Pakistan by seven wickets as the neighbours met on the cricket pitch for the first time since a military conflict between them in May.\n\nAfter hitting the winning shot, Suryakumar and his teammates refused to shake hands with their Pakistan counterparts. The captain said in the post-match press conference that the move was in alignment “with the BCCI (Board of Control for Cricket in India) and the government”.\n\nIn the post-match presentation, Suryakumar said India took the match against Pakistan as “just another game” and dedicated the win to the Indian armed forces.\n\n“We stand with the victims of the families of the Pahalgam terror attack, and we express our solidarity,” Suryakumar said. “We want to dedicate today’s win to the armed forces.”\n\nThe April 22 attack on civilians in India-occupied Kashmir’s Pahalgam triggered Pakistan-India hostilities in May. New Delhi, without evidence, accused Pakistan of backing the attack — a charge Islamabad strongly denies.\n\nAfter the match, the PCB confirmed to Dawn.com that Pakistan team manager Naveed Akram Cheema had “registered a protest against the match referees’ behaviour.”\n\n“It was against the sportsman spirit that the Indian team did not shake hands,” the PCB statement quoted the manager as saying. It alleged that the “match referee had asked the captains not to shake hands at the time of the toss”.\n\nPakistan skipper Salman Ali Agha did not show up in the post-match ceremony as a reaction to the Indian team’s move.\n\nPakistan’s coach Mike Hesson explained that the reason Salman was absent from the ceremony was because of the Indian team’s “disappointing” conduct at the end of the match.\n\n“It was a follow-on effect of the fact that we were obviously keen to engage and shake hands at the end of the match, but that obviously didn’t happen,” Hesson said.\n\nFollowing the developments, PCB chief Naqvi earlier today said on X: “Utterly disappointing to witness the lack of sportsmanship today. Dragging politics into the game goes against the very spirit of sports.\n\n“Let’s hope future victories are celebrated by all teams with grace.”\n\nThe match had been coloured from the start by calls from across the border to ‘boycott’ the fixture.\n\nThe Indian cricket board had said it could not boycott an international event and that such a move would “bring a lot of negativity for all our future endeavours of hosting any multinational tournament”.\n\nNew Delhi only cleared the match in a recently announced sports policy, saying the Indian national team can play Pakistan in multi-national events but not in bilateral competitions. Pakistan last played a bilateral series against India in 2012, when the Green Shirts toured India for an ODI and T20I series.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/15134427ffbc87d.webp",
  "retrievedAt": "2025-09-19T14:30:10.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942166/pcb-seeks-pakistan-india-match-referees-removal-from-asia-cup-over-alleged-violations-of-icc-rules",
  "dateList": "2025-09-07",
  "date_published": "2025-09-15T08:50:35.000Z"
}
