{
  "title": "Kazakh Deputy PM to arrive in Pakistan tomorrow on 2-day visit to further cement ties - Pakistan - DAWN.COM",
  "author": null,
  "content": "Kazakhstan’s Deputy Prime Minister and Foreign Minister Murat Nurtleu will arrive in Pakistan tomorrow on a two-day official visit to further cement bilateral ties, the Foreign Office said on Sunday.\n\nPakistan and Kazakhstan maintain friendly diplomatic relations, with bilateral trade worth $239 million, according to its envoy Yerzhan Kistafin.\n\nNurtleu will undertake an official visit to Pakistan from September 8 to 9, the FO said in a statement, adding that the trip will serve as a precursor to Kazakh President Kassym-Jomart Tokayev’s visit scheduled in November 2025.\n\nDuring his stay, the visiting dignitary will “hold a tête-à-tête” with his Pakistani counterpart Ishaq Dar, followed by delegation-level talks.\n\nNurtleu is also expected to call on President Asif Ali Zardari and PM Shehbaz Sharif, according to the FO.\n\n“The discussions will provide an opportunity to review preparations for the upcoming presidential visit and to deliberate comprehensively on the entire spectrum of Pak-Kazakh bilateral cooperation, with particular focus on trade and investment, agriculture, education, cultural and tourism exchanges, regional connectivity and logistics, and collaboration at multilateral fora.”\n\nNurtleu will be accompanied by a high-level 13-member delegation, including the Transport Minister Nurlan Sauranbayev. The Joint Working Groups meetings on agriculture and IT will also be held on the sidelines of the visit.\n\nThe Kazakh deputy PM’s visit will “further cement the longstanding Pakistan-Kazakhstan ties and contribute to deepening bilateral engagements in diverse fields, for the benefit of the people of the two countries”, the FO statement added.\n\nKazakhstan is Pakistan’s top export destination among Central Asian countries, but exports dropped sharply by 47.12pc in the fiscal year 2025. It is also among the biggest importers of Pakistani mangoes.\n\nIn July, Pakistan, Uzbekistan and Afghanistan signed an agreement for a joint study on a major railway project intended to connect Central Asia with Pakis­tani seaports via Afghanistan.\n\nLater that month, the Central Asian nation’s senior military officials also attended the Regional Chiefs of Defence Staff Conference held in Islamabad.\n\nIn April, Pakistan and Kazakhstan agreed to sign a transit trade accord for the movement of goods through three Pakistani ports — Karachi, Bin Qasim and Gwadar — and to engage other regional landlocked nations for opening multiple trade corridors.\n\nBoth sides also agreed to promote tourism by sharing lists of certified tour operators and launching joint promotional activities. In August last year, Ambassador Kistafin highlighted the opportunity of a direct flight from Kazakhstan to Skardu.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/07151003cd5e877.webp",
  "retrievedAt": "2025-09-19T14:29:59.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940275/kazakh-deputy-pm-to-arrive-in-pakistan-tomorrow-on-2-day-visit-to-further-cement-ties",
  "dateList": "2025-09-07",
  "date_published": "2025-09-07T10:20:37.000Z"
}
