{
  "title": "Reviving the rural economy - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE recent floods have resulted in misery, displacement, death, loss of property and livestock, crop destruction and damage to infrastructure.\n\nWhile the total losses are yet to be calculated, it is critical to understand their economic repercussions and the urgent need to initiate damage limitation measures.\n\nThe 2022 floods, which affected only Sindh and Balochistan, had displaced 33 million people, submerged their homes, destroyed livestock and crops and damaged infrastructure including the irrigation network. That deluge killed over 1,100 people and caused economic losses to the tune of $30 billion, or 10 per cent of GDP. Clearly, global warming has taken firm root in the form of droughts, glacier melt, floods, torrential rains, heatwaves and rising sea levels. Our response capacity must match the challenge.\n\nNo other economic sector has such strong backward and forward linkages for national well-being as agriculture. The situation, therefore, requires a holistic rather than a narrow sectoral approach. In the immediate term, the IMF’s ongoing review warrants a revision of performance indicators and structural benchmarks in light of projected changes in the underlying variables. At least, seven important linkages can be identified.\n\nGDP growth rate: Although agriculture’s direct contribution to GDP is only 23pc, manufacturing, wholesale and retail trade, transportation and storage and other ancillary services rely on its inputs such as raw material, processing, marketing, distribution of crops, livestock, dairy, fruit and vegetables, pulses, oil seeds, etc. A guesstimate of this indirect contribution would add another 25pc arising from these non-agricultural activities. Thus the rate of GDP growth rate is highly dependent not only on agricultural performance but also allied activities. Together, they account for 50pc of the economy.\n\nEmployment: The proportion of labour force employed directly on the farm is almost 37pc, including non-farm incomes. A rough guess is that about 60-70pc of total employment can be attributed to the rural economy. A significant drop in rural employment would result in a decline in purchasing power and the increased incidence of poverty.\n\nWhat steps should be taken to minimise the impact of flood losses?\n\nInflation: Shortage of grains, vegetables, pulses, and disruption of the supply chain would push up the consumer price index causing inflationary pressures. Coming on top of rising wheat flour and sugar prices the likelihood of higher inflation in the months ahead cannot be ruled out.\n\nThe lowest income quintile spends about 40pc of their income on food. Floods would thus hurt the poor who cannot afford higher food prices.\n\nPoverty and income distribution: Income poverty estimates show that rural poverty is 28pc compared to 11pc in the urban areas. Income distribution is also skewed in favour of the big landlords.\n\nThe recent agriculture census shows that the top 4pc of landholders own one-third of the total farm area while the bottom 80pc of farmers possessing less than five acres own another third, with the remaining one-third belonging to medium landholders. Negative changes in poverty headcount and income distribution are the result of flood losses.\n\nExports: Eighty per cent of Pakistan’s merchandise exports derive their raw material, such as ginned cotton, husked rice, leather and food products, from rural sources. Cotton and yarn are already being brought from abroad. This volume is likely to rise in the floods’ aftermath, affecting our current account balance.\n\nFood security and nutrition: In Pakistan, 38m people face moderate to severe food insecurity (18pc of children are malnourished). These numbers must have risen after the floods.\n\nWheat is the main crop in Pakistan — thus, policies and incentives for sowing on a greater area during the coming Rabi season should be assured through a coordinated federal-provincial strategy.\n\nOutput of manufactured goods: The production of goods such as motorbikes, bicycles, fertilisers, pesticides, tractors and other farm equipment as well as light consumer items are dependent on the demand of rural household. The manufacturing sector is already under stress and a drop in demand is likely to result in decreased production, shedding labour and intensifying unemployment and poverty.\n\nWhat steps should be taken to minimise the impact of flood losses in the short and medium term?\n\nAs the National Water Policy 2018 recommends, an integrated water resource management system that takes into account surface water conveyance, groundwater recharge and usage, drainage, flood protection works, barrages, drinking water, industrial water needs and water conservation should be established.\n\nAs I’ve pointed out previously: ‘the changing weather patterns will significantly affect temporal distribution and availability of water in the coming decades and accelerated melting of glaciers and overloading of rivers will affect food, water and energy security, posing a grave threat to living standards’.\n\nThe writer is a former governor of the State Bank of Pakistan.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c8e9186ecf2.jpg",
  "retrievedAt": "2025-10-12T04:01:16.033Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942351/reviving-the-rural-economy",
  "dateList": "2025-09-07",
  "date_published": "2025-09-16T04:36:27.000Z"
}
