{
  "title": "Air Force Day: Air chief Sidhu says PAF committed to advancing capabilities in electronic warfare, cyber tech - Pakistan - DAWN.COM",
  "author": null,
  "content": "Air Chief Marshal (ACM) Zaheer Ahmed Baber Sidhu on Sunday said the Pakistan Air Force (PAF) was committed to advancing its capabilities in electronic warfare and cyber technologies.\n\nHe made the remarks while addressing the central Martyrs’ Day ceremony held at Air Headquarters in Islamabad, as the nation observes the Pakistan Air Force Day to honour PAF martyrs.\n\n“He (ACM Sidhu) affirmed that Pakistan Air Force would remain committed to advancing its capabilities in space, electronic warfare, cyber technologies, niche domains and indigenous defence production to safeguard the sovereignty and territorial integrity of the nation,” said a press release by the Inter Services Public Relations (ISPR).\n\nThe PAF solemnly observed Martyrs’ Day across all its bases nationwide, ISPR noted.\n\nThe day commenced with special prayers and recitation of the Holy Quran, “dedicated to the martyrs of the 1965 and 1971 wars, as well as to all those who have rendered the ultimate sacrifice in the line of duty since the creation of Pakistan”.\n\nAddressing the ceremony as the chief guest, ACM Sidhu underscored the proud legacy of sacrifice, courage and professionalism that defines the PAF.\n\nHe emphasised that Martyrs’ Day “symbolises the extraordinary bravery, impeccable professionalism and unparalleled spirit of sacrifice demonstrated” by the armed forces.\n\nThe air chief stressed that well-cognisant of the fast-changing security dynamics, the PAF stood committed to its mission with singularity of purpose.\n\n“The latest link in [the] chain of victories secured by PAF in Marka-i-Haq / Bunyanum Marsoos has once more proved our will and capability to guard the aerial frontiers of our motherland,” he was quoted as saying.\n\nAs New Delhi launched deadly air strikes on Pakistan in early May over allegations about the Pahalgam attack, which Islamabad denied, PAF downed six Indian jets in retaliation. After tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nThe martyrs of Marka-i-Haq — the term used for the period of conflict with India — along with the country’s military and civilian leadership, were conferred with a total of 488 national awards on August 14. These included eight Sitara-i-Jurat, seven Sitara-i-Basalat, 23 Tamgha-i-Basalat and 79 Imtiazi Sanad for PAF personnel.\n\nIn his address today, the PAF chief reiterated his firm resolve to make “every possible effort for the progress and prosperity of Pakistan in the evolving global environment”, the ISPR statement said.\n\nPaying “heartfelt tribute” to the fallen heroes of PAF, the air chief said, “We owe our heroes an eternal debt of gratitude for their supreme sacrifices, which serve as an enduring example for future generations.“\n\nHe further expressed unwavering solidarity with the people of India-occupied Kashmir in their “legitimate and indigenous struggle for the right to self-determination”, the press release added.\n\nACM Sidhu also laid a floral wreath at the Martyrs’ Monument and offered fateha for the departed souls to pay homage to the martyrs.\n\nTo mark the Defence and Air Force Day, the PAF released a new song titled “Shaheen”.\n\nMeanwhile, President Asif Ali Zardari and Prime Minister Shehbaz Sharif hailed the PAF’s “decisive“ role during the military conflict with India in May, when the air force shot down six Indian jets.\n\n“In recent history, the Pakistan Air Force, together with the armed forces, played a decisive role in Marka-i-Haq [and Bunyanum Marsoos] and the way it defeated the enemy on all fronts amazed the whole world,“ PM Shehbaz was quoted as saying by the Associated Press of Pakistan.\n\n“Undoubtedly, this high-level performance of the Pakistan Air Force was a manifestation of fearless leadership, the skill of the fighter sons, superior strategy, and effective implementation of multi-faceted combat capabilities,“ he added.\n\n“The invincible multi-faceted combat capabilities of the Pakistan Air Force are a testament to its innovation in recent years.\n\n“I am particularly proud that the Pakistan Air Force, while keeping its glorious historical tradition alive, defeated an enemy many times larger than itself,“ the premier emphasised.\n\n“Our heroes of the Pakistan Air Force proved with their bravery that no matter how strong and well-armed the enemy is, it can never defeat passion and courage,” he observed.\n\nThe prime minister paid tribute to the PAF’s “unparalleled performance”, observing that the martyrs’ “immortal sacrifices are illuminated in history”.\n\nPM Shehbaz said: “Undoubtedly, the founders of the Pakistan Air Force laid its foundation as a high-class and leading institution in accordance with the vision of the founder of Pakistan, Quaid-i-Azam Muhammad Ali Jinnah.\n\n“Pakistan Air Force continues to perform well in all professional aspects and is no less than any other air force in the world in terms of professionalism,” the premier added.\n\n“We are proud that the Pakistan Air Force has shown its professionalism and immense strength in [the] last decades during air combat.“\n\nIn his statement, President Zardari said: “Whether it was the 1965 war or the more recent Marka-i-Haq Bunyanum Marsus, our air warriors have always risen to the challenge, giving the enemy a decisive response and filling the nation with pride.”\n\nThe president highlighted that the world had “witnessed the remarkable skill and professionalism of PAF”, hailing its evolution into a “modern, capable, and highly professional institution”.\n\n“My heart goes out in deep respect to our martyrs and ghazis whose courage and sacrifices continue to inspire the nation,” President Zardari said.\n\nHe recalled: “In 1965, our air warriors, against overwhelming odds, wrote a story of extraordinary bravery and determination. Their daring actions not only defended our skies but also lifted the morale of an entire nation.\n\n“That spirit of sacrifice and excellence remains alive in every generation of the PAF,” he added. The president paid tribute to the martyrs’ families for bearing the “greatest sacrifice of all”, as well as the warriors for their resilience and dedication.\n\n“I am confident that the Pakistan Air Force will continue to protect our skies and sovereignty with the same resolve and passion that has always defined it.”\n\nAdditional input by Nadir Guramani",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/0712511517a4519.webp",
  "retrievedAt": "2025-09-19T14:30:05.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940264/air-force-day-air-chief-sidhu-says-paf-committed-to-advancing-capabilities-in-electronic-warfare-cyber-tech",
  "dateList": "2025-09-07",
  "date_published": "2025-09-07T08:01:19.000Z"
}
