{
  "title": "A ‘real’ movie fights back in anime-ruled Japan - World - DAWN.COM",
  "author": null,
  "content": "Pensioner Shizue Kato didn’t fancy the new “Demon Slayer” anime blockbuster and instead watched “Kokuho”, a rare live-action cinema hit in Japan, where animation rules.\n\n“Many of our friends already watched the film, and they were amazed we hadn’t yet,” Kato told AFP as she emerged from a Tokyo cinema on a recent weekday.\n\n“I read the original novel,” her husband Kuni said.\n\nLasting almost three hours, “Kokuho” is about two “onnagata”, male players of female roles in kabuki, a rarefied form of classical Japanese theatre.\n\nLee Sang-il’s film, shot by Tunisian cinematographer Sofian El Fan, follows the friendship and rivalry of the son of a slain yakuza gangster and a boy born into a kabuki family.\n\nThe plot is gripping but markedly more sedate than this summer’s other hit, the second movie from the “Demon Slayer” anime and manga mega-franchise.\n\nThat dark fantasy, the first of a trilogy, is about sword-swishing Tanjiro Kamado’s final showdown to slay demons and make his sister human again in a kaleidoscopic castle.\n\nIt has set records, just like its predecessor in the series and other anime films, becoming Japan’s fastest film to gross 10 billion yen ($67 million).\n\nIt overtook “Titanic” to become the third-highest-grossing film in Japan, behind the last “Demon Slayer” and Studio Ghibli’s more highbrow — but still animated — “Spirited Away”.\n\nAnime is king in Japan. Of its top 10 films, only three are live action, and just one of those — “Bayside Shakedown 2” — is Japanese-made.\n\nThe others are “Titanic” and the first “Harry Potter”.\n\nThe same is increasingly true elsewhere — Chinese animated fantasy “Ne Zha II” is the highest-grossing film of 2025.\n\nOn streaming platforms, Netflix’s most-watched movie ever is the animated “KPop Demon Hunters”, and the firm says its viewers watched anime over a billion times in 2024.\n\nBut “Kokuho” is a hit in Japanese cinemas at least, the fastest domestic-made live action film to pass 10 billion yen since “Bayside” in 2003.\n\nIt helps that both the main actors — Ryo Yoshizawa and Ryusei Yokohama — are heartthrobs in Japan.\n\n“Ryo Yoshizawa has this beautiful face,” gushed Toyoko Umemura, 65, who came with her daughter to watch the film.\n\n“His acting was also great,” she told AFP.\n\n“Kokuho” has even revived flagging interest in kabuki, according to Shochiku, the entertainment company that manages the famous Kabuki-za theatre in Tokyo’s Ginza district.\n\nThe movie benefited from its distributor being Toho, the Japanese giant behind “Godzilla”, and from the deep pockets of Sony.\n\nToho’s internal projections were for a few billion yen in revenues, business daily Nikkei reported, until “Kokuho” premiered at Cannes in May.\n\nThen it took off, and Toho used some of the same techniques from its anime hits — not least “Demon Slayer” — to generate buzz on and offline.\n\nThe film’s run in theatres has also been extended, while word of mouth spread. Many people went to see it twice.\n\nAccording to Parrot Analytics, demand — a measure based mainly on actual consumption plus search and social media activity — was 25 times higher than the average film in Japan.\n\nFormer Warner Bros executive Douglas Montgomery, CEO of Global Connects Media and a Temple University professor, said anime provides a “more consistent return” for studios, not least from merchandising.\n\n“The film functions as a marketing lead to the (intellectual) property, where the real money is made later. This makes it tougher for live-action films as the revenue streams are fewer and shorter,” Montgomery told AFP.\n\n“The lesson [from ‘Kokuho’] for the Japanese film industry is that it can pay to take chances on something different,” he said, with the warning that reproducing such a “rare gem” would be tough.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/080924020891ba7.webp",
  "retrievedAt": "2025-09-19T14:30:04.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940290/a-real-movie-fights-back-in-anime-ruled-japan",
  "dateList": "2025-09-07",
  "date_published": "2025-09-07T15:00:04.000Z"
}
