{
  "title": "How will Japan pick its next leader? - World - DAWN.COM",
  "author": null,
  "content": "With Japanese Prime Minister Shigeru Ishiba announcing his resignation, attention turns to who will next steer the world’s fourth-largest economy.\n\nThe process to pick Japan’s next leader is more complicated than before, as Ishiba’s Liberal Democratic Party (LDP), which has ruled Japan for most of the post-war period, and its junior coalition partner lost their majorities in both houses of parliament during his tenure.\n\nFirst, the LDP must pick a new president to replace Ishiba. The date has not been set yet.\n\nIn the last party leadership race in September 2024, candidates needed to secure 20 nominations from the party’s lawmakers to be eligible to run.\n\nCandidates will embark on a period of debates and campaigns across Japan, culminating in a vote by lawmakers and rank-and-file party members. In the last race, there were nine contenders, and Ishiba won in a run-off.\n\nBased on the last leadership race, each lawmaker has a vote with an equal number distributed among the rank-and-file members in the first round of voting.\n\nA candidate securing a simple majority in that poll becomes party leader. If no one secures a majority, a run-off vote follows between the two candidates with the most votes.\n\nIn the second round, each lawmaker again gets one vote, but the share of the rank-and-file drops to 47 votes, one for each of Japan’s prefectures.\n\nIn the unlikely event of a tie, the winner will be decided by lot. That has never happened in a leadership contest, but was used in 2010 to decide who would chair the LDP’s upper house caucus.\n\nSince the party does not have a majority in either house, it is not guaranteed that the LDP president will become prime minister.\n\nIn 1994, the LDP formed a three-way alliance with its arch rival, the Japan Socialist Party and a smaller startup party to regain power, having socialist leader Tomiichi Murayama elected as prime minister.\n\nBased on precedent, the more powerful lower house will first vote on its choice for prime minister. Lawmakers can nominate any candidates from the chamber and historically, the leaders of opposition parties have been put forward for the vote.\n\nAny candidate who secures a simple majority in the first round wins approval. If no one secures a majority, a run-off poll follows between the two candidates with the most votes.\n\nVoting then passes to the upper house, where a similar process begins, although only members of the lower house are eligible to be prime minister. If there is a disagreement between the houses, the choice of the lower house prevails.\n\nThis happened in 2008 when the lower house chose the LDP candidate and the upper house picked an opposition candidate.\n\nThe new prime minister may also call a snap general election to seek a national mandate.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/0718015859e3768.webp",
  "retrievedAt": "2025-09-19T14:29:33.808Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940291/how-will-japan-pick-its-next-leader",
  "dateList": "2025-09-07",
  "date_published": "2025-09-07T13:15:09.000Z"
}
