{
  "article_id": "2025-03-03_3e17b3c2476b41c3ada9c48385448d62",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-committee-approves-zakat-and-ushr-bill-forms-subcommittee-to-oversee-bisp-disbursement-model/",
    "retrieved_at": "2025-08-27T13:17:53.041Z"
  },
  "metadata": {
    "title": "NA Committee approves Zakat and Ushr Bill, forms subcommittee to oversee BISP disbursement model",
    "author": null,
    "date_published": "2025-03-03T15:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 396,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 03 (APP):The National Assembly Standing Committee on Poverty Alleviation and Social Safety Monday constituted a subcommittee to strengthen oversight of BISP's newly proposed payment disbursement model. The committee chaired by Mir Ghulam Ali Talpur, convened its meeting at the Benazir Income Support Programme (BISP) headquarters, to deliberate on key issues related to the social protection systems in the country. The subcommittee formed was comprised over Nawabzada Iftikhar Ahmed Khan Babar (Convenor), Ahmad Atteeq Anwar, Ms. Aasia Ishaque Siddiqui, and Mr. Mohammad Ilyas Choudhary. The subcommittee will monitor the implementation of the payment model to ensure transparency, efficiency, and fairness. MNA Ahmed Atteeq Anwar presented a comprehensive briefing on the subcommittee's previous findings, which were unanimously endorsed by the committee for their meticulous approach. The committee expressed concern over the unexplained absence of the Secretary of the Poverty Alleviation and Social Safety Division, directing that all future absences be formally communicated in writing well in advance. The committee also approved the Zakat and Ushr (Amendment) Bill 2025, presented by Ms. Shazia Marri, MNA, marking a significant legislative milestone to improve the distribution of Zakat funds. The Managing Director of Pakistan Bait-ul-Mal (PBM) briefed the committee on the organization's operational framework and upcoming nationwide awareness campaign. He announced a collaborative food distribution initiative with 33 private vendors and invited committee members to visit PBM's responsive call center. The Chairperson of BISP raised concerns about the lack of a dedicated BISP cadre and the staff shortage due to the government's recruitment ban since 2012, compelling the organization to rely heavily on deputationists. The committee directed the Secretary of BISP to submit a comprehensive staffing proposal to the government. The committee further instructed the Poverty Alleviation and Social Safety Division to provide a detailed technical and legal briefing on the proposed amendments to the Memorandum of Association of the Pakistan Poverty Alleviation Fund (PPAF) before any decision on its transformation into a State-Owned Enterprise. The meeting was attended by MNAs Mir Khan Muhammad Jamali, Misbah Uddin, Mohammad Ilyas Choudhary, Awais Haider Jakhar, Ms. Aasia Ishaque Siddiqui, Muhammad Bashir Khan, Ms. Aniqa Mehdi, Arshad Abdullah Vohra, and Jamshaid Ahmad. Additionally, Adil Khan Bazai, Nawabzada Iftikhar Ahmed Khan Babar, Shafqat Abbas, Shahid Usman, and Shazia Marri attended the meeting virtually. Senior officials from the Poverty Alleviation and Social Safety Division, BISP, PBM, and PPAF were also present at the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}