{
  "article_id": "2025-03-03_1b6f089f43021fe7a4e947ed43dbbd3e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nab-recovers-rs-1-5-billion-from-four-housing-projects-in-one-year-deputy-chairman/",
    "retrieved_at": "2025-08-27T13:18:11.855Z"
  },
  "metadata": {
    "title": "NAB recovers Rs. 1.5 billion from four housing projects in one year: Deputy Chairman",
    "author": null,
    "date_published": "2025-03-03T14:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 357,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 03 (APP):The National Accountability Bureau (NAB) has successfully recovered Rs. 1.5 billion from the management of four residential projects within a year, Deputy Chairman Sohail Nasir said on Monday. During a cheque distribution ceremony, Nasir handed over refund cheques to individuals affected by fraudulent housing schemes. A ceremony was held at the National Accountability Bureau (NAB) Headquarters in Islamabad to distribute recovered funds to the victims of housing society scams. The event was chaired by NAB Deputy Chairman Sohail Nasir. Substantial cheques were distributed among victims of four housing projects in Rawalpindi and Islamabad- Ghauri Town, Arain City, Gulshan Rehman, and Jeddah Town. Deputy Chairman NAB Sohail Nasir, Prosecutor General Accountability Syed Ehtisham Qadir Shah, Director General NAB Rawalpindi Mirza Muhammad Irfan Baig, and other officers distributed the cheques among the victims. In his address on the occasion, Deputy Chairman NAB Sohail Nasir stated that comprehensive measures are being taken to prevent corruption under the leadership of the Chairman NAB, with the prompt return of public looted funds to the affectees is the top priority. He advised citizens to only invest in legally approved housing projects after thorough scrutiny and knowledge to protect themselves from fraud and deception. He said that NAB's public awareness campaign regarding safe investments in real estate is ongoing, however, it is the duty of citizens to take all possible precautions to avoid fraud. Deputy Chairman NAB Sohail Nasir said that NAB's crackdown against those who loot public funds has been intensified. He distributed shields among NAB officers who demonstrated excellent performance and paid tribute to the services of NAB investigation officers who played a crucial role in recovering the funds of the victims in these four housing projects through their day and night efforts. Director General NAB Rawalpindi Mirza Muhammad Irfan Baig, while outlining the performance of NAB Rawalpindi, stated that NAB Rawalpindi has so far recovered Rs 38.059 billion in housing fraud cases. Out of this, Rs 32.825 billion have been returned to the public or deposited into the national treasury. DG NAB Rawalpindi further informed that since January 2023, 23.896 billion rupees have been returned to 8,000 victims.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}