{
  "article_id": "2025-03-03_2ba0407abd788eacbbac67a4528a9e96",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/strict-measures-to-prevent-accidents-on-highways-minister/",
    "retrieved_at": "2025-08-27T13:18:10.266Z"
  },
  "metadata": {
    "title": "Strict measures to prevent accidents on highways: Minister",
    "author": null,
    "date_published": "2025-03-03T15:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 03 (APP):In a high-level review meeting of the National Highway Authority (NHA) chaired by Federal Minister for Communications, Privatization and Board of Investment Abdul Aleem Khan further stringent measures were decided to prevent accidents on Motorways and National Highways. He emphasized that efforts must be made to curb accidents caused by the negligence of the drivers on Motorways, said a press release issued here on Monday. He stressed that Emergency Services Centers should be established every 30 kilometers and that measures would also be taken for helicopter and air ambulance services along Motorways and Highways. Abdul Aleem Khan stated that the Government is ready to pay any price to save human lives and every step will be taken in this regard. He instructed that Rescue Services 1122 stations be connected to Motorways to ensure the swift provision of emergency medical aid in the shortest time possible. During the meeting, Federal Minister Abdul Aleem Khan was also presented with a report on the recent bus accident on M-2 in which the bus driver acknowledged his negligence and error. Based on this report, it was decided to enforce stricter inspections of commercial buses. In the high-level meeting, Abdul Aleem Khan was briefed on various NHA projects. He directed the NHA to bring transparency to the Annual Maintenance Plan and establish a cohesive approach for which the Secretary of Communications was given specific instructions. The meeting also reviewed reports on safety barriers and fence on Motorways and complaints about potholes at various locations. Federal Minister instructed the IG of Motorways to increase patrolling and ensure strict action against those damaging or stealing the fence. The meeting was attended by the Federal Secretary of Communications, Chairman of NHA, IG Motorways and the Director-General of Rescue Services 1122 who briefed the Federal Minister. Necessary decisions were also made on key departmental matters.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}