{
  "article_id": "2025-05-08_d2d5826739f8ba0b980bf6963c65f836",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/turkish-envoy-calls-on-president-scbap/",
    "retrieved_at": "2025-08-27T15:14:32.538Z"
  },
  "metadata": {
    "title": "Turkish envoy calls on President SCBAP",
    "author": null,
    "date_published": "2025-05-08T17:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 355,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 8 (APP):On the invitation of Mian Muhammad Rauf Atta, President and the 27th Cabinet of the Supreme Court Bar Association of Pakistan (SCBAP), Irfan Neziroglu, Ambassador of Republic of Turkiye to Pakistan, paid a visit to the SCBAP head office, Islamabad. He was warmly received and cordially welcomed by the Cabinet members. Speaking on behalf of the entire legal fraternity of Pakistan in general, and the 27th Cabinet of SCBAP in particular, the President reiterated the enduring and brotherly relations between the two countries, with special emphasis on the longstanding bonds shared by the legal communities of both nations. The President also appreciated the support extended by Government of Turkiye to Government of Pakistan in aftermath of current security situation. In his remarks, the Ambassador reciprocated brotherly sentiments and highlighted the deep-rooted, historical, religious, cultural, and even linguistic ties between the two nations. He noted that the resilience of the friendship between the two countries is evident during challenging times, growing stronger with every test. Commending Pakistan's efforts and sacrifices in the fight against terrorism, the Ambassador extended his unwavering support and solidarity. He remarked that a threat to one of the two nations is, in essence, a threat to both. Emphasizing the depth of this relationship, he drew on the Hadith of the Prophet Muhammad (PBUH): \"If one part of the body feels pain, the whole body suffers\", equating it with the spirit of the bilateral friendship. The Ambassador further stated that his mission is to connect with the 250 million people of Pakistan at the grassroots level, with the goal of fostering cooperation in every sphere of society-be it education, legal, health, or otherwise. He described Pakistani society as youthful and dynamic, which he viewed as a vital asset in promoting mutual collaboration in today's modern world. After the formal meeting, the Ambassador visited the Bar Room, where he was once again warmly welcomed by members of the Bar Association. During his address to the general body, he reaffirmed the long-standing ties between the two nations and expressed his steadfast support for the legal fraternity and the civil society in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}