{
  "article_id": "2025-05-08_0726197c69fb36fa935b2fa985184b96",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mnas-pay-tributes-to-armed-forces-for-giving-befitting-response-to-india/",
    "retrieved_at": "2025-08-27T15:15:53.282Z"
  },
  "metadata": {
    "title": "MNAs pay tributes to armed forces for giving befitting response to India",
    "author": null,
    "date_published": "2025-05-08T10:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 893,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 08 (APP):Parliamentarians in the National Assembly Thursday paid rich tributes to Pakistan armed forces, Pakistan Air Force (PAF) for giving befitting response to Indian aggression and said nation stand united should to shoulder with their forces. Speaking in the House, they strongly condemned the cowardly attack by Indian forces, calling it a shameful act and Pakistan is fully prepared to respond to any aggression with full force. The lawmakers said Indian unprovoked attack is not only a serious threat to regional peace and stability, but also a blatant violation of international laws and human rights. Initiating the debate in the House, Pakistan Tehreek-e-Insaf (PTI) lawmaker Malik Amir Dogar said that PTI leadership firmly stands with the country's armed forces. Paying tribute to the Pakistan Air Force (PAF), Amir Dogar lauded its fitting response to Indian aggression. He also saluted the martyrs and those injured in the attacks, vowing a resolute reply that \"India will remember in the times to come.\" PTI legislator Iqbal Afridi strongly condemned the India's attack on civilians under the cover of darkness. He said the tribal people have always stood at the frontlines in defense of the country and will continue to respond to any form of aggression. \"Our forefathers laid down their lives for the sovereignty of Pakistan, and we will uphold that legacy,\" he added. Iqbal Afridi said the nation expects a firm and befitting response to the cowardly attack of enemy. He said that national unity is critical in these challenging times, urging all stakeholders to come together and forge a united front. Pakistan Muslim League (N) lawmaker Malik Muhammad Iqbal said the Indian attack in Bahawalpur was a direct assault on Pakistan's sovereignty. He said that the enemy had miscalculated, forgetting that the nation stands united and resilient when the homeland is under threat. Muhammad Iqbal appreciated Pakistan army for demonstrating its professional strength in defending the country's borders and lauded the PAF for successfully shooting down enemy's aircrafts. He paid tribute to the martyrs, expressing solidarity with their families, and stressed that Pakistan's desire for peace should not be mistaken for weakness. \"We are always prepared to defend our motherland, even if it means sacrificing the last drop of blood,\" he added. Senior Pakistan People's Party (PPP) leader Raja Pervaiz Ashraf paid tribute to all members for demonstrating patriotism and courage in the wake of Indian attack inside Pakistan. He said India has historically been hostile towards Pakistan and never accepted its existence, continuously attempting to inflict harm over the years. He said Narendra Modi- is RSS leader who had committed atrocities on Muslims and other minorities. Modi-led government is pursuing a politics of hatred and extremism, as they are enemy of humanity. Pervaiz Ashraf said India continuously blames Pakistan without any solid evidence, citing the Pahalgam incident of April 22 as an example, calling it a fabricated narrative used to malign Pakistan. He said Pakistan's armed forces and the nation are fully prepared to respond to any Indian aggression. He lauded the PAF for its swift action in downing Indian aircrafts. Pervaiz Asharf said Pakistan's armed forces are professional, noting that it abides by international conventions and only targets military objectives, in contrast to Indian forces who, he said, deliberately targeted civilians and places of worship. Sending a direct message to the Indian premier, Pervaiz Ashraf said that Modi orchestrating the recent escalation and involved in terrorist activities within Pakistan, called him a 'threat to humanity.' He called for national unity, saying that internal differences must be set aside to give a clear and collective message of strength and resolve. Pervaiz Ashraf also paid homage to the soldiers sacrificing their lives for the defense and sovereignty of the country. Regarding the Indus Waters Treaty, Pervaiz Ashraf said that Pakistan's 240 million people are the custodians of their water resources, adding that even during past wars between Pakistan and India, the treaty was never suspended or violated. Jamiat Ulema-e-Islam (F) lawmaker Shahida Akhtar Ali said Pakistan is a peace-loving country that seeks stability and harmony in the region. She said India is a terrorist state who is supporting or doing terrorism inside Pakistan. Shahida Akhtar paid tribute to Pakistan's armed forces for their bravery and for strengthening the country's defense, praising their strong and effective response to enemy. She said Pakistan is actively fighting the menace of terrorism and expressed confidence that this challenge can be overcome through collective resolve. Samina Khalid Ghurki said that all political forces in the country stand united to respond any Indian aggression. She paid tribute to Pakistan's armed forces, and added that our soldiers are fighting in tough terrain and rendering sacrifices for the defense of the country. Member of the National Assembly Pullain Baloch condemned India's baseless allegations against Pakistan regarding the Pahalgam incident, and said that no evidence was provided in this regard. He further denounced the subsequent Indian attacks inside Pakistan, which targeted civilians and places of worship. PTI leader Aniqa Mehdi said the enemy carried out a cowardly attack under the cover of darkness, targeted civilians and mosques. She praised the timely and effective response of Pakistan's armed forces, which thwarted the enemy's malicious intentions. Aniqa Mehdi affirmed that the nation of 240 million stands shoulder to shoulder with its brave forces and remains united in the defense of the country's borders.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}