{
  "article_id": "2025-05-08_368a839b94d3ac48ae88b754d9a1ab5b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ishaq-dar-eus-vp-discuss-prevailing-regional-situation/",
    "retrieved_at": "2025-08-27T15:14:35.553Z"
  },
  "metadata": {
    "title": "Ishaq Dar, EU’s VP discuss prevailing regional situation",
    "author": null,
    "date_published": "2025-05-08T16:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 215,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 8 (APP): Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar on Thursday held a telephone call with the European Union High Representative for Foreign Affairs and Security Policy/Vice-President of the Commission (HR/VP), Kaja Kallas at the latter's initiative. The two leaders had also previously discussed the regional situation on May 2, 2025, a press statement issued by the Foreign Offices Spokesperson said. During the call, the deputy PM thanked Kallas for the EU's support and solidarity with Pakistan during these difficult times. He strongly condemned India's blatant act of war, which violated Pakistan's sovereignty and jeopardized regional peace and stability. Emphasizing that India's actions were in violation of the UN Charter, international law, and the norms governing interstate relations, the DPM/FM rejected India's baseless claims of targeting terrorist infrastructure. He reiterated that there was no credible evidence linking Pakistan to the Pahalgam attack. He added that Pakistan reserved the right to respond appropriately at a time and place of its choosing, in accordance with Article 51 of the UN Charter and as enshrined in international law. HR/VP Kallas expressed heartfelt condolences for the loss of civilian lives and extended her sympathies to the families of the victims. She reiterated that both sides must exercise full restraint and pursue dialogue and diplomacy.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}