{
  "article_id": "2025-05-08_d83c071e673a8fa189cfbbc4ae9d8a22",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/conspiracy-against-islamic-teachings-the-dangerous-alliance-of-khawarij-and-india-exposed/",
    "retrieved_at": "2025-08-27T15:15:51.143Z"
  },
  "metadata": {
    "title": "Conspiracy against Islamic teachings: The dangerous alliance of Khawarij and India exposed",
    "author": null,
    "date_published": "2025-05-08T10:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 705,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "PESHAWAR, May 28 (APP):The conspiracies of hostile forces against Pakistan have taken a new turn, and what is most concerning at present is the growing alliance between the Khawarij and India. Recently, a video statement surfaced from the Khawarij leader, Noor Wali Mehsud, in which he appeals to India for help and describes his group's agreements with Hindu overlords as jihad. In this narrative, the Khawarij have mocked the fundamental teachings of Islam and portrayed their alliance with India as a religious strategy. \"This is not only contrary to Islamic principles but also poses a grave threat to Pakistan's national security,\" said Brigadier (Retd) Mahmood Shah, former Secretary Law and Order while talking to APP. He said Pakistan's security forces have successfully carried out operations against terrorism, launching a crackdown on the Khawarij. Following these successful operations, he said the Khawarij are in a state of panic, and that their leader, Noor Wali Mehsud, has instructed his followers to use the internet and telecommunication services cautiously meaningby to evade the effective actions of Pakistani forces and continue their activities covertly. However, a critical point is that these Khawarij have secured Indian support for their un-Islamic actions and terrorist activities. He claimed that the use of advanced Indian-made quadcopters in recent terrorist attacks in Pakistan is clear evidence that this group is operating under India's agenda. Brigadier Mahmood said the Khawarij continue to carry out terrorist attacks in various regions of Pakistan including KP, targeting civilians, including women and children. \"Particularly in Khyber Pakhtunkhwa, they have used quadcopters for such attacks, targeting innocent children. As always, they tried to shift the blame onto security forces, but video evidence exposed that these attacks were carried out by the Khawarij themselves for accomplishment of their nefarious designs.\" These Khawarij, who endanger the lives of Pakistani citizens, enjoy Indian backing, and Indian agents are funding them to promote terrorism within Pakistan, he reiterated. \"India's goal is not only to destabilize peace in Pakistan but also to weaken Islamic forces, and the Khawarij are advancing that agenda\" he said. He questioned what Islamic teachings do Khawarij like Noor Wali Mehsud represent? They label an alliance with Indian overlords as \"jihad,\" which is completely contrary to Islamic teachings. The Holy Qur'an clearly states that friendship with non-believers is forbidden. In Surah Al-Ma'idah, Allah Amighty says: \"Whoever among you takes them as allies is surely one of them.\" So what kind of religion do these Khawarij claim to represent, where alliances with disbelievers are deemed acceptable? Brigadier Mahmood said that seeking help from Indian overlords and carrying out terrorist acts in Pakistan under their support is in no way jihad; rather, it is a conspiracy that negates the teachings of Islam. He said the actions of the Khawarij are a betrayal of the faith and a blow to the Muslim Ummah, adding that justifying terrorism under Indian patronage is a violation of Islamic ethics. Brigadier Mahmood said now is the time for the Pakistani nation to recognize its enemies and resist the false propaganda of the Khawarij, adding these Khawarij are not only conspiring against Pakistan but also against Islam. He reitetated that these Khawarij have used religion for their personal gain and distorted the true message of Islam. Their attacks, strategies, and propaganda remind us that their goal is to harm the Islamic social system. He said it is the duty of the Pakistani people to stand alongside the security forces and expose these Khawarij terrorists, adding protecting Pakistan's security and true spirit of Islam is our shared responsibility. He said defeating the alliance between the Khawarij and India should be our top priority so that peace, stability, and the correct message of Islamic teachings can spread throughout Pakistan. The security expert said this new alliance between the Khawarij and India has become a serious threat not only to Pakistan but to the peace of the entire region. He said their terrorist acts and efforts to exploit Islamic teachings serve as a stark reminder that we must remain vigilant against the intentions of our enemies. He maintained that justifying the Khawarij and supporting India is a disgrace to our religion, and we must respond to it with unity and national cohesion.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}