{
  "title": "NA panel slams mismanagement in Hajj, Zaireen affairs",
  "link": "https://www.app.com.pk/national/na-panel-slams-mismanagement-in-hajj-zaireen-affairs/",
  "date_published": "2024-11-19T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP):The National Assembly Standing Committee on Religious Affairs and Inter-Faith Harmony raised serious concerns over the management of Hajj and Zaireen, pointing to mismanagement, corruption, and nepotism as major issues.\nThe committee chaired by Malik Muhammad Aamir Dogar expressed deep concern over the Hajj operations and Zaireen management, highlighting issues of mismanagement, corruption, and nepotism.\nDogar stressed the need for proper arrangements to assist religious tourists both domestically and internationally.\nHe urged the ministry to establish a framework for Zaireen and present a schedule of visits for both sides at the next Committee meeting.\nThe chair directed the Secretary Ministry of Religious Affairs (MORA) to complete the composition of the Ziarat Management Committee (ZMC) and write a letter to the Speaker for the required nomination of one Honorable Member of the National Assembly as per rules.\nThe secretary of the Ministry of Religious Affairs and Inter-Faith Harmony briefed the Committee on the ministry’s operations, performance, and challenges.\nThe committee directed the Secretary to promptly address the issue of Pakistani beggars in Saudi Arabia in coordination with the Ministry of Overseas Pakistanis and Human Resource Development.\nAt the outset of the meeting, Committee members congratulated Chairman Malik Muhammad Aamir Dogar and pledged their full support. The Chairman thanked them for their confidence and expressed hope that, through collective efforts, the Committee would effectively oversee the executive.\nThe Committee deferred consideration on “The National Commission for Minorities Bill, 2024” due to the absence of its mover.\nThe meeting was attended by the Members of National Assembly (MNAs) Sardar Muhammad Yousaf Zaman, Chaudhry Armghan Subhani, Syed Imran Ahmad Shah, Seema Mohi ud Din Jameeli, Shahnaz Saleem Malik, Asiya Naz Tanoli, Dr. Nelson Azeem, Mussarat Rafique Mahesar, Ms. Shagufta Jumani, Samina Khalid Ghurki, Ahmed Saleem Siddiqui, Muhammad Bashir Khan, Mujahid Al.\nThe meeting was also attended by the Secretary and senior officers from the Ministry of Religious Affairs and Inter-Faith Harmony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:26:56.565Z"
}
