{
  "title": "Durable peace cannot be achieved without resolution of Kashmir, Palestine dispute: NA Speaker",
  "link": "https://www.app.com.pk/national/durable-peace-cannot-be-achieved-without-resolution-of-kashmir-palestine-dispute-na-speaker/",
  "date_published": "2024-11-19T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP):Speaker National Assembly Sardar Ayaz Sadiq Tuesday said that durable global peace cannot be achieved without the resolution of Kashmir and Palestine dispute.\nHe said this during a meeting with Minister/Parliamentary Under-Secretary of State at the Foreign, Commonwealth and Development, United Kingdom, Himesh Falconer along with UK Parliamentary delegation who called on him at the Parliament House.\nAyaz Sadiq expressed concern over the grave human rights violations in these regions, stating that without addressing these issues, regional stability would remain elusive. The Speaker stressed that Parliament of Pakistan represents all political parties and the incumbent Parliament has active opposition that plays a constructive role on matters of national importance.\nHe affirmed his impartiality as Speaker, ensuring a balanced approach in managing parliamentary proceedings.\nAyaz Sadiq has said that Pakistan is committed to fostering regional peace and stability in the region. He also said that Pakistan has long standing and historic ties with the United Kingdom.\nThe Speaker said that by enhancing and promoting parliamentary and economic cooperation these ties can be further strengthened. He emphasized that close interaction and cooperation between the parliaments of both countries could play a pivotal role in bolstering bilateral relations.\nThe Speaker mentioned that Pakistan has rendered immense sacrifices in the global war on terror and it has always strived for regional peace.\nHe also highlighted initiatives of the Parliament, namely the Sustainable Development Goals (SDGs) Secretariat established in 2014, which actively works toward achieving sustainable development goals in Pakistan.\nAdditionally, he mentioned the establishment of a parliamentary caucus to protect the rights of women and children, playing a vital role in addressing discrimination against women and promoting gender equality.\nFurthermore, the Speaker underscored Pakistan’s minimal contribution to global greenhouse gas emissions while being one of the most affected countries by climate change. He called for greater international collaboration to address this pressing challenge.\nParliamentary Whips of various political parties, present during the meeting, also emphasized the importance of Pakistan-UK diplomatic relations.\nPML-N Chief Whip, Dr. Tariq Fazal Chaudhry highlighted the significance of Pak-UK friendly ties.\nMNA Syeda Shehla Raza expressed deep concern over human rights violations in Kashmir and Palestine.\nMNA Malik Muhammad Amir Dogar thanked the UK for its aid during the COVID-19 pandemic.\nMNA Syed Amin-ul-Haq described Pakistan-UK relations as historic. MNA Noor Alam Khan emphasized Pakistan’s sacrifices in the fight against terrorism and urged global acknowledgement of these efforts.\nHimesh Falconer thanked the Speaker for the warm reception and reaffirmed the UK’s commitment to its longstanding ties with Pakistan.\nHe announced £108 million aid package to tackle climate change induced challenges in Pakistan, highlighting that a partnership on this issue is mutually beneficial.\nThe minister pledged continued UK support for Pakistan in strengthening its democratic institutions and fostering economic and social cooperation.\nThe UK Parliamentary Delegation, accompanying the UK Minister, comprised British High Commissioner to Pakistan, Jane Marriott, Personal Assistant to the Minister, Calum Matthews, Political Counsellor, Zoe Ware, Deputy Political Counsellor, Mark Bailey, and Principal Political Adviser to the High Commissioner, Saqib Riaz.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:27:41.635Z"
}
