{
  "title": "CDA chief inspects construction work on Sarena Chowk, F8 Interchanges",
  "link": "https://www.app.com.pk/national/cda-chief-inspects-construction-work-on-sarena-chowk-f8-interchanges/",
  "date_published": "2024-11-19T16:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP):Chairman CDA Muhammad Ali Randhawa on Tuesday conducted a detailed visit of the Sarena Chowk and Jinnah Avenue F-8 Interchange projects and  reviewed the ongoing progress of construction work.\nHe also inspected the ongoing construction activities at the sites.\nOn this occasion, Deputy Commissioner Islamabad Irfan Memon, relevant CDA officers, contractors, and consultants were also present.\nChairman CDA Muhammad Ali Randhawa instructed the contractors to ensure the completion of the projects within the stipulated time frame under all circumstances.\nHe also praised the workers involved in the projects. Additionally, he directed that the process of reallocation of service lines be completed promptly.\nChairman CDA Muhammad Ali Randhawa emphasized that the pace of work should be further increased by ensuring 24/7 operations on the projects, while the construction work should be carried out simultaneously at various sections of the projects.\nHe also instructed that work on the flyover at the Jinnah Avenue F-8 Interchange be initiated at the same time.\nChairman CDA stated that the highest standards of construction work must be ensured.\nHe further mentioned that the Federal Minister for Interior, Mohsin Naqvi, is personally monitoring the progress of both projects.\nChairman CDA Muhammad Ali Randhawa was also briefed on the ongoing construction work at the sites.\nHe was informed that all activities on the projects are in line with the timelines and schedules, with construction work proceeding simultaneously on various sections, including the underpasses.\nThe work on piling and casting of girders is also progressing rapidly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:27:15.793Z"
}
