{
  "title": "Ahsan for ‘National Curriculum Summit’ to work out reforms on modern lines",
  "link": "https://www.app.com.pk/national/ahsan-for-national-curriculum-summit-to-work-out-reforms-on-modern-lines/",
  "date_published": "2024-11-19T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP): Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Tuesday said the Ministry of Education had been asked to hold a ‘National Curriculum Summit’ to work out necessary reforms and align the country’s education system with the requirements of the modern era.\n“We want to take the national curriculum beyond the O and A level education system,” he said while addressing the launch ceremony of the Model Assessment Framework at the auditorium of the Federal Board of Intermediate and Secondary Education (FBISE).\nHe called for inviting experts from both the private and public sectors to discuss educational reforms so that a ‘comprehensive review’ could be carried out to frame and implement a modern curriculum system in the country.\nThe Planning minister also expressed the desire to establish a state-of-the-art Teachers Training Center to improve the quality of education and produce manpower that meets contemporary needs, for which the Ministry of Education had already been given the task.\nHe said the Pakistan Muslim League-Nawaz (PML-N) government had initiated this project during its last tenure but could not complete it due to political instability.\nHe added that the center, in collaboration with provincial education departments, would be the best in South Asia, where students could receive quality education focused on improving their critical thinking, creativity, problem-solving, and team-learning skills.\n“It will be a paradigm shift from memorization-based education,” Iqbal said, adding that the initiative would also reform the existing examination system.\nAhsan Iqbal said memorization-based education was irrelevant in the modern era, where innovation and creativity drive development.\nHe believed that the country could not achieve the required goals of progress and prosperity without improving education standards and developing human resources. “Today’s era is not about muscle power; it’s about brain power. Nations with superiority in brain power will succeed. The first step toward national progress is improving the education system.”\nMentioning a recent report by Pakistan’s District Education Performance Index (DEPIx), which evaluated 134 districts’ performance, he regretted that not a single district was listed in the ‘Very High’ category. Only Islamabad was placed in the ‘High’ category, while 56 districts secured the ‘Medium’ category—32 from Punjab, 16 from Khyber Pakhtunkhwa and 8 from Sindh.\nHe said 77 districts fell into the ‘Low’ category, with 33 from Balochistan and 22 from Sindh.\nLooking at the overall performance, the minister said Punjab’s score stood at 61.39 percent, Khyber Pakhtunkhwa’s at 54.47 percent, Sindh’s at 51.55 percent and Balochistan’s at 45.50 percent.\nAhsan Iqbal stressed that every country in the world today faced the challenge of aligning its education system with the needs of the modern age, due to the rapid changes taking place in all fields.\n“In the coming days, the pace of development will further accelerate, and we (Pakistan) need to prepare its next generations with the skills of intellect, modern education, critical thinking, creativity, problem-solving and team learning,” he remarked.",
  "retrievedAt": "2025-08-10T15:26:08.135Z"
}
