{
  "title": "APP, Radio, PTV’s digitalisation to commence by August: Fawad",
  "link": "https://www.app.com.pk/national/app-radioptvs-digitalisation-to-commence-by-august-fawad/",
  "date_published": "2021-06-26T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Saturday that the digitalisation of official media including APP (Associated Press of Pakistan), Radio Pakistan and PTV (Pakistan Television) would be initiated by August this year.\nSpeaking at National Immature Short Film Festival,he said improvements were being introduced in the ministry of Information and Broadcasting to enable it to meet contemporary challenges.\nPakistan has offered numerous sacrifices in the war against terrorism but failed to articulate its narrative in an effective way – consequently the world had not acknowledged Pakistan’s sacrifices the way it should have been because the country did not work vociferously to create public opinion.\nHe said media was an important tool with the states around the globe to help moulding public opinion (in their favour).\nThe media played an important role in promoting the narrative of the states, he added.\nThe minister said wars in the world were now fought through the victory of one’s narrative.\nIronically, no heed was paid to that aspect in past, he added.\nHe said that today’s world was a world of public opinion, now wars were fought through rhetoric, the more the narrative was accepted, the more victory would be determined.\nThe journey of a “Naya Pakistan” had already begun under the leadership of Prime Minister Imran Khan, Fawad said.\nHe said Pakistan Tehreek-e-Insaf (PTI) was set to complete three years in the government in upcoming August. Prime minister had accomplished his promises to the nation, he added.\nHe thanked the prime minister for providing the building, which was abandoned for the last so many years.On completion of three year of the incumbent government, the media technology university would start workings in that building, he added.\nISPR (Inter-Services Public Relations) has given a new dimension to short films in Pakistan, he said, adding that the country was taking measures to use modern technology for making films.\nThe minister said short duration films were of less than 40 minutes and\nin the form of tick talk on digital media, films with seconds were also being made. Filmmakers were also turning to short films, he added.\n“Pakistan occupied third position in film making during the decade of 1970’s.Then a time came when Pakistan had made zero film.While only two films were made this year.\nThe cinema business has gone into deficit.Various steps are underway to improve the situation,” the minister said.",
  "retrievedAt": "2025-08-11T20:53:41.951Z"
}
