{
  "title": "95pc Ehsaas survey completed in Pakistan: Dr Sania",
  "link": "https://www.app.com.pk/national/95pc-ehsaas-survey-completed-in-pakistan-dr-sania/",
  "date_published": "2021-06-26T12:42:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 26 (APP): Special Assistant to Prime Minister (SAPM) on Poverty Alleviation and Social Safety Senator Dr Sania Nishtar said on Saturday that 95 per cent Ehsaas survey had been completed across country and every effort was being made to complete the remaining part by July 31, 2021.\nBriefing the media here at the commissioner’s office, she said that 34 social security benefits were being provided to the poor and deserving families through various initiatives under the Ehsaas programme.\nShe said that scope of the Ehsaas programme had also been extended to 12 million deserving and needy people. Under this programme, she added, the government was providing interest-free loans for self-employment/ starting own business through various NGOs [non-governmental organisations] so as to enable the poor families to earn their livelihood at their own.\nTo a question, the SAPM said that more effective and comprehensive measures were being taken to prevent cyber attacks on the Ehsaas programme, and in this connection a constant liaison was also being maintained with the Federal Investigation Agency (FIA).\nShe said that cyber attackers on the Ehsaas programme had recently been arrested in areas of south Punjab and Khyber-Pakhtunkhwa (KPK) province.\nTo another question, she said that there were quick checks in Ehsaas programme’s survey, adding that domestic workers working in posh areas of cities should get themselves registered at the Ehsaas Desk, set up in those areas.\nShe said that the Ehsaas programme was being subjected to an unwarranted political criticism. There was a huge difference between Ehsaas programme and the BISP (Benazir Income Support Programme), and the government employees, whose wives or families used to draw money from the BISP had been fired.\nHowever, it was very unfortunate to deem the poor people benefiting from the Ehsaas programme and the BISP as beggars, she added.\nAccording to the Bureau of Statistics, the poverty ratio in south Punjab was high and also as per Ehsaas survey, south Punjab and FATA [Federally Administered Tribal Areas] were more poverty-stricken areas.\nTo a query, Dr Sania Nishtar said that the Ehsaas survey comprised 65 questions pertaining to a family’s assets and Ehsaas surveyors feed the data provided by people in the computer tablet, and “We are not relying only on survey data but verify those whereabouts through various other means.\n“The Ehsaas survey is absolutely free of cost and no fee is charged from people for providing personal data to the Ehsaas surveyors.”\nThe pace of Ehsaas survey in Lahore was slow and effective steps were being taken to complete it for early realisation of the programme. No survey would be conducted in Cantonment area and an Ehsaas Desk would be set up the next month.",
  "retrievedAt": "2025-08-11T20:53:44.180Z"
}
