{
  "title": "Prime Minister Imran Khan gives approval to induct more people in ANF: Ijaz Shah",
  "link": "https://www.app.com.pk/national/prime-minister-imran-khan-gives-approval-to-induct-more-people-in-anf-ijaz-shah/",
  "date_published": "2021-06-26T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Federal Minister for Narcotics Control, Brig (R) Ijaz Ahmad Shah Saturday said the Prime Minister Imran Khan had given a go ahead to recruit more people in Anti Narcotics Force (ANF) to build a drug-free society.\nAddressing the audience here at D Chowk awareness walk ‘Ride Walk and Fun’ organized on the occasion of International Day against Drug Abuse and Illicit trafficking, he said in order to secure the future of our coming generations, every individual had to play his role in fighting against the drugs and this was the only way by which we could achieve the goal of creating a drug-free society.\n“If the spread of drugs not be controlled the in society, it will be as annoying as climate change in the next five to ten years”, Ijaz Shah said.\nHe further said that budget to upgrade ANF the current setup as per requirement had also been allocated. To a question, he said pay raise of ANF and further facilitation of families of martyrs was also under discussion.\nThe minister reinforced the fact that the ones who fall prey to this menace must be treated as victims.”Real culprits are the ones who supply the drugs” he said.\n“If you know about suppliers in your surroundings, please report them to the ANF without any fear and fulfill your role in war against drugs” Ijaz Shah added.\nThe minister was of the view that ANF alone could not fight this menace, adding entire nation had to stand united in order to achieve the goal of a drug free society.\nHe said that Government College University , Lahore (GCU) had been given drug free status due to the relentless efforts of all stakeholders.\nRepresentative of UNODC, Federal Secretary for Narcotics Control Akbar Durrani , Celebrities Shehzad Roy, Faisal Qureshi, officials of Ministry of Narcotics Control, students and a large number of people from different professions participated in the walk.",
  "retrievedAt": "2025-08-11T20:53:39.537Z"
}
