{
  "title": "Drug-day Int’l Day against drug abuse observed",
  "link": "https://www.app.com.pk/national/drug-day-intl-day-against-drug-abuse-observed/",
  "date_published": "2021-06-26T18:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): International Day against Drug Abuse and Illicit Trafficking was observed on Saturday aimed at strengthening global action and cooperation to achieve the goal of an international society free of drug abuse.\nMinistry of Narcotics Control (MNC) in collaboration with UNODC organised a cycle rally and walk which was attended by children, youth, senior citizens, families, and people from various walks of life to commemorate International Day against Drug Abuse and Illicit Trafficking in a befitting manner.\nThe walk titled ‘Ride Walk and Fun’ held from Jinnah Avenue -D Chowk-Kohsar Block, Islamabad.\nAddressing the walk Minister for Narcotics Control, Brig (R) Ijaz Ahmad Shah said Prime Minister Imran Khan had given a go ahead to recruit more people in Anti Narcotics Force (ANF) to build a drug-free society.\nThe minister was of the view that ANF alone could not fight this menace, adding entire nation had to stand united in order to achieve the goal of a drug free society.\nMeanwhile addressing a webinar, organized by United Nations Office on Drugs and Crime (UNODC), Ijaz Shah sought the assistance of developed countries in ending the social evil of drug-abuse from the country.\nHe hoped that national and international institutions would help Pakistan in its fight against the drugs.\nIjaz Shah stressed the need to reduce the demand and supply of drugs at international level as it would greatly help overcome the issue.\nIn his message on International Day Against Drug Abuse and Illicit Trafficking, President Dr Arif Alvi Saturday called for the regional countries to make integrated efforts to check illicit cross-border drug trade to save the future generations.\nHe said the Government of Pakistan accorded priority to combating drug abuse and taking effective measures against illicit trafficking.\nThe International Day against Drug Abuse and Illicit Trafficking was first observed by the UN General Assembly in 1987. The day help raising awareness to fight against the substance abuse as well as the unlawful trade of drugs.\nShare Drug Facts to Save Lives is the theme of the 2021 International Day Against Drug Abuse and Illicit Trafficking aimed at combating misinformation and encouraging the exchange of drug facts. From health hazards to solutions to the global drug problem to evidence-based prevention, rehabilitation, and aftercare.\nThe Day is utilized to instill a feeling of responsibility in individuals all around the world, particularly children and teens.\nOn the day, all around the globe, events were also held in schools, colleges, workplaces, and public areas to raise awareness of the overall issue, as well as the risks of drugs and their usage.\nThe United Nations, through its anti-drug misuse arm, the United Nations Office on Drugs and Crime (UNODC), raised awareness, advises authorities to avoid fueling the Narcotics industry, and combats drug trafficking under the cover of legal medicinal enterprises\nDrug abuse is one of the most serious health problems. Besides causing serious diseases such as HIV, hepatitis, tuberculosis, it has several side effects in the form of economic loss, antisocial behaviour such as stealing, violence and crime besides social stigma and overall downfall of the society.\nDrug racket operates internationally, but some countries are transshipment points for drug circulation. India possibly because of its strategic location was more prone to drug activities including drug trafficking and local consumption. The influence of westernization, changing family structure and peer pressure are some of the reasons behind drug abuse.",
  "retrievedAt": "2025-08-11T20:53:39.379Z"
}
