{
  "title": "Opposition narrative over FATF shameful, condemnable: Hammad Azhar",
  "link": "https://www.app.com.pk/national/opposition-narrative-over-fatf-shameful-condemnable-hammad-azhar/",
  "date_published": "2021-06-26T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Federal Minister for Energy Hammad Azhar Saturday termed the opposition parties’ narrative on Financial Action Task Force (FATF) shameful and condemnable.\nAddressing a press conference, the minister said the world community and FATF acknowledged and recognized the considerable progress and efforts made by Pakistan on action plan with high-level commitment.\nHe said the opposition was making political point scoring for its gains adding the national economy was heading into right directions due to prudent economic policies of the incumbent government.\nHe said FATF has also given a new 7-point action plan. The new action plan was mainly focused to counter money laundering, which was relatively easy than the terror financing. “We have set a target to meet this in 12 months,” he said.\nHammad Azhar said Pakistan was included in FATF grey list during the tenure of Pakistan Muslim League-Nawaz (PML-N) regime. However, now we were facing this challenge and we would try to address or resolve it.\nHe said the Pakistan Tehreek Insaf (PTI) led government presented people-friendly budget for the fiscal year 2021-2022 despite of financial crunch. All economic indicators showed upward trend and the industry was also growing fast, he added.\nOn the issue of energy shortage, he said that in the meantime, we are also making alternative arrangements to meet the shortfall of electricity and we would face this challenge in coming days.\nThe minister said “We will try to fill this gap of load shedding and even if it is needed, it will be minimized so that all this can be done in a better way.” Load shedding was occurred due to down trend of water in Tarbella Dam, he added.\nHe said that the rate of use of furnace oil has come down to the lowest level in the last two and half years which will be further reduced in future.",
  "retrievedAt": "2025-08-11T20:53:42.214Z"
}
