{
  "title": "Turkish envoy pays tribute to Quaid-e-Azam, highlights shared vision with Atatürk",
  "link": "https://www.app.com.pk/national/turkish-envoy-pays-tribute-to-quaid-e-azam-highlights-shared-vision-with-ataturk/",
  "date_published": "2024-12-26T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP): The Ambassador of Türkiye to Pakistan, Dr. Irfan Neziroglu on Thursday paid glowing tribute to Quaid-e-Azam Muhammad Ali Jinnah, lauding his visionary leadership and timeless legacy that continues to inspire generations.\nSpeaking at an event commemorating the 148th birth anniversary of Pakistan’s founding father, Dr. Neziroglu expressed profound gratitude to the participants for joining in to honor Jinnah’s remarkable contributions. “Quaid-e-Azam’s unwavering dedication and noble character won the hearts of millions, guiding them in the historic struggle for Pakistan’s creation,” he remarked.\nDr. Neziroglu highlighted Jinnah’s enduring values of Unity, Faith, and Discipline, which not only galvanized a movement but also laid the foundation for a modern, sovereign state. He drew parallels between Jinnah and Mustafa Kemal Atatürk, the founder of Türkiye, emphasizing their shared vision of progress and modernization.\n“Jinnah admired Atatürk deeply. Following Atatürk’s passing in 1938, he referred to him as ‘one of the greatest men that ever lived,’” the envoy noted. He also celebrated the symbolic connection between the two nations, citing prominent streets in Ankara and Islamabad named after Jinnah and Atatürk, reflecting the deep-rooted brotherly ties.\nThe ambassador underscored the unique and enduring bond between Pakistan and Türkiye, forged through shared values, sacrifices, and historical solidarity. “This is a genuine bond of fraternity, admired by the world, and built on a foundation of mutual respect and eternal brotherhood,” he said.\nQuoting Quaid-e-Azam, Dr. Neziroglu reminded the audience of the urgency to strengthen bilateral relations. “As Quaid-e-Azam said, ‘time is running out.’ We must work tirelessly to institutionalize our relationship, combining our knowledge, experience, and power to achieve a brighter future for Türkiye, Pakistan, and a more peaceful world.”\nThe ambassador concluded by reaffirming the commitment to further enhancing the historic friendship between the two nations, guided by the enduring legacies of their visionary leaders.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:04:23.133Z"
}
