{
  "title": "Involvement in May 9 riots: Another 60 civilian get 2-10 years jail sentences",
  "link": "https://www.app.com.pk/national/involvement-in-may-9-riots-another-60-civilian-get-2-10-years-jail-sentences/",
  "date_published": "2024-12-26T11:20:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 26 (APP):As many as another 60 civilians involved in violent attacks on military installations during nationwide May 9, 2023 riots have been sentenced by the military courts two to 10 years prison.\n“Sequel to the announcement of the May 9 punishments in light of the Supreme Court’s decision, the Field General Court Martial has promulgated the punishments to the remaining 60 culprits after examining all evidences, ensuring the provision of all legal rights to the convicts, completion of due process and the appropriate legal proceedings,” said a news release issued by Inter Services Public Relations (ISPR) here Thursday.\nThe following 60 culprits were handed down the sentences:\n1.Hassan Khan Niazi s/o Hafizullah Niazi, 10 years rigorous imprisonment, involved in Jinnah House incident.\n2.Mian Abbad Farooq s/o Amanat Ali, 2 years rigorous imprisonment, involved in Jinnah House incident.\n3.Raees Ahmed s/o Shafi Ullah, 6 years rigorous imprisonment, involved in Jinnah House incident.\n4.Arzam Junaid s/o Junaid Razzaq, 6 years rigorous imprisonment, involved in Jinnah House incident.\n5.Ali Raza s/o Ghulam Mustafa, 6 years rigorous imprisonment, involved in Jinnah House incident.\n6.Raja Danish s/o Raja Abdul Waheed, 4 years rigorous imprisonment, involved in GHQ attack incident.\n7.Syed Hassan Shah s/o Asif Hussain Shah, 9 years rigorous imprisonment, involved in GHQ attack incident.\n8.Ali Hussain s/o Khalil ur Rehman, 7 years rigorous imprisonment, involved in AIMH Rawalpindi attack incident.\n9.Zahid Khan s/o Muhammad Nabi, 2 years rigorous imprisonment, involved in PRC Mardan incident.\n10.Sohrab Khan s/o Riaz Khan, 4 years rigorous imprisonment, involved in HQ Dir Scouts Timergara incident.\n11.Brig (Retd) Javed Akram s/o Chaudhary Muhammad Akarm, 6 years rigorous imprisonment, involved in Jinnah House incident.\n12.Khuram Liaqat s/o Liaqat Ali Shahid, 4 years rigorous imprisonment, involved in Multan Cantt Checkpost incident.\n13.Zakir Hussain s/o Shah Faisal, 7 years rigorous imprisonment, involved in Chakdara Fort incident.\n14.Ameen Shah s/o Mashter Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n15.Fahim Sajid s/o Muhammad Khan, 8 years rigorous imprisonment, involved in PAF Base Mianwali incident.\n16.Hamza Sharif s/o Muhammad Azam, 2 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n17.Muhammad Arslan s/o Muhammad Siraj, 7 years rigorous imprisonment, involved in Jinnah House incident.\n18.Muhammad Umair s/o Abdul Sattar, 6 years rigorous imprisonment, involved in Jinnah House incident.\n19.Noman Shah s/o Mehmood Ahmad Shah, 4 years rigorous imprisonment, involved in Jinnah House incident.\n20.Ikram Ullah s/o Khanzada Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n21.Muhammad Ahmed s/o Muhammad Nazir, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n22.Pirzada Mian Muhammad Ishaq Bhutta s/o Pirzada Mian Qamar ud Dind Bhutta, 3 years rigorous imprisonment, involved in Multan Cantt Checkpost incident.\n23.Muhammad Abdullah s/o Kanwar Ashraf Khan, 4 years rigorous imprisonment, involved in GHQ attack.\n24.Amjad Ali s/o Manzoor Ahmed, 2 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n25.Muhammad Raheem s/o Naeem Khan, 6 years rigorous imprisonment, involved in Jinnah House incident.\n26.Ehsan Ullah Khan s/o Najeeb Ullah Khan, 10 years rigorous imprisonment, involved in PAF Base Mianwali incident.\n27.Muneeb Ahmed s/o Naveed Ahmed Butt, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n28.Muhammad Ali s/o Muhammad Boota, 2 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n29.Sami Ullah s/o Meer dad Khan, 2 years rigorous imprisonment, involved in Bannu Cantt incident.\n30.Mian Muhammad Akram Usman s/o Mian Muhammad Usman, 2 years rigorous imprisonment, involved in Jinnah House incident.\n31.Mudassir Hafiz s/o Hafeez Ullah, 6 years rigorous imprisonment, involved in Jinnah House incident.\n32.Sajjad Ahmed s/o Muhammad Iqbal, 4 years rigorous imprisonment, involved in Jinnah House incident.\n33.Khizar Hayat s/o Umar Qiyaz Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n34.Muhammad Nawaz s/o Abdul Samad, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n35.Muhammad Bilal s/o Muhammad Afzal, 4 years rigorous imprisonment, involved in PAF Base Mianwali incident.\n36.Muhammad Suleman s/o Said Ghani Jan, 2 years rigorous imprisonment, involved in HQ Dir Scouts Timergara incident.\n37.Asad Ullah Durani s/o Badshah Zada, 4 years rigorous imprisonment, involved in HQ Dir Scouts Timergara incident.\n38.Ikram Ullah s/o Shah Zaman, 4 years rigorous imprisonment, involved in Chakdara Fort incident.\n39.Muhammad Farrukh s/o Shams Tabriz, 5 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n40.Waqas Ali s/o Muhammad Ashraf, 6 years rigorous imprisonment, involved in Jinnah House incident.\n41.Ameer Zohaib s/o Nazeer Ahmed Sheikh, 4 years rigorous imprisonment, involved in Jinnah House incident.\n42.Farhad Khan s/o Shahid Hussain, 7 years rigorous imprisonment, involved in AIMH Rawalpindi incident.\n43.Izzat Khan s/o Awal Khan, 2 years rigorous imprisonment, involved in HQ Dir Scouts Timergara incident.\n44.Asher Butt s/o Muhammad Arshad Butt, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n45.Saqlain Haider s/o Rafiullah Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n46.Muhammad Salman s/o Zahid Nisar, 2 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n47.Hamid Ali s/o Syed Hadi Shah, 3 years rigorous imprisonment, involved in Multan Cantt Checkpost incident.\n48.Muhammad Waqas s/o Malik Muhammad Khalil, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n49.Izzat Gul s/o Mirdat Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n50.Haider Majeed s/o Muhammad Majeed, 2 years rigorous imprisonment, involved in Jinnah House incident.\n51.Gp Capt Viqas Ahmed Mohsin (Retd) s/o Bashir Ahmed Mohsin, 2 years rigorous imprisonment, involved in Jinnah House incident.\n52.Muhammad Ilyas s/o Muhammad Fazal Haleem, 2 years rigorous imprisonment, involved in HQ Dir Scouts Timergara incident.\n53.Muhammad Ayaz s/o Sahibzada Khan, 2 years rigorous imprisonment, involved in Main Gate FC Cantt Peshawar incident.\n54.Raees Ahmed s/o Khaista Rehman, 4 years rigorous imprisonment, involved in Chakdara Fort incident.\n55.Gohar Rehman s/o Gul Rehman, 7 years rigorous imprisonment, involved in Chakdara Fort incident.\n56.Naik Muhammad s/o Nasrullah Jan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n57.Fahad Imran s/o Muhammad Imran Shahid, 9 years rigorous imprisonment, involved in ISI Office Faisalabad incident.\n58.Sufayan Idrees s/o Idrees Ahmed, 2 years rigorous imprisonment, involved in Rahwali Gate Gujaranwala incident.\n59.Raheem Ullah s/o Bait Ullah, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\n60.Khalid Nawaz s/o Hamid Khan, 9 years rigorous imprisonment, involved in Bannu Cantt incident.\nThe trial of 9th May accused under military custody, has hereby been concluded under the relevant laws.\nAll convicts retain the right to appeal and other legal recourses, as guaranteed by the Constitution and law, it further said.\n“The Nation, Government, and the Armed Forces remain steadfast in their commitment to upholding justice and ensuring that the inviolable writ of the state is maintained,” the news release said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:04:51.689Z"
}
