{
  "title": "Mohsin Naqvi inaugurates state-of-the-art passport and immigration Headquarters",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-inaugurates-state-of-the-art-passport-and-immigration-headquarters/",
  "date_published": "2024-12-26T09:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP): Federal Minister for Interior, Mohsin Naqvi on Thursday inaugurated the newly built state-of-the-art Passport and Immigration Headquarters and the Islamabad Regional Passport Office with an aim to provide better services to citizens, with the Islamabad Regional Passport Office now operating 24/7.\nSpeaking at the inauguration ceremony, Mohsin Naqvi announced a series of reforms and improvements in passport services nationwide. He stated that 24/7 passport issuance services would soon be available at NADRA mega centers in 14 cities, ensuring greater accessibility and convenience for the public.\nThe Minister revealed that the long-standing backlog in passport processing has been completely eliminated.\n“Citizens will now receive their passports on time,” he assured, adding that previously, delays of up to six months were common.\nThe inauguration ceremony also highlighted the Minister’s vision for improved service delivery.\nNaqvi toured the new reception area, online services section, production center, and data center, praising the upgraded facilities. He presented shields and cash prizes to staff members who had shown exceptional performance in passport production.\nThe Minister also announced plans to establish model passport centers in Karachi and Lahore, further expanding the availability of top-tier services across the country.\nNaqvi emphasized the government’s commitment to eradicating corruption and ensuring transparency in the system.\nThe event was attended by prominent figures, including NADRA Chairman Lieutenant General Muhammad Munir Afsar, Chief Commissioner Islamabad Muhammad Ali Randhawa, and IG Islamabad Police Ali Nasir Rizvi. DG Passports Mustafa Jamal Qazi also praised the improvements, stating that they were in line with the Minister’s vision of excellence in public service.\nThe minister shared his satisfaction following recent visits to passport and NADRA centers in Lahore and Karachi, where citizens expressed contentment with the improved services. “The conditions have drastically improved, with no long queues or delays,” he said.\nThis initiative marks a significant step toward modernizing public services in Pakistan, ensuring that citizens have access to efficient and timely passport and immigration facilities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:04:49.495Z"
}
