{
  "title": "Russia never gave up on peaceful, diplomatic solution to Ukrainian crisis: Russian envoy",
  "link": "https://www.app.com.pk/national/russia-never-gave-up-on-peaceful-diplomatic-solution-to-ukrainian-crisis-russian-envoy/",
  "date_published": "2024-12-26T12:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP):Ambassador of Russia to Pakistan, Albert P. Khorev on Thursday said that Russia has been trying to find a peaceful, political and diplomatic solution to the crisis in Ukraine, but unfortunately, these efforts have not been successful yet due to the regional and global dynamics.\nRussia has never given up on a political and diplomatic solution to the Ukrainian crisis, as it has repeatedly stated, he said.\nAmbassador of Russia to Pakistan, Albert P. Khorev said this while addressing to media briefing on the situation in and around Ukraine here in Russian embassy Islamabad.\nRussian Ambassador said that in a speech at the Russian Foreign Ministry on June 14, Russian President Vladimir Putin presented concrete proposals for a final settlement of the conflict.\nRussian envoy said that their key points include the withdrawal of Ukrainian armed formations from the new Russian regions and the Donetsk People’s Republic, the Luhansk People’s Republic, Zaporozhye and Kherson; the recognition of the new territorial realities; Kiev’s refusal to join NATO; the lifting of all Western sanctions against Russia; and the guarantee of full rights for Russian-speaking citizens of Ukraine.\nHowever, both Kiev and the allies forces continued to think in terms of war and the Russian proposal for a political and diplomatic settlement of the conflict was met with an invasion of the Kursk region by the Ukrainian armed forces.\nHe said that they are most aggressive, shooting civilians, looting Russian villages, attacking journalists and threatening nuclear facilities.\nAmbassador said that the Kiev regime is being equipped with increasingly destructive and lethal systems, including inhumane weapons (cluster munitions, depleted uranium shells) and various types of missiles.\nOn the occasion about the attacks on Russian Journalists, he said that the media front was and remains one of the main fronts in the aggressive anti-Russian campaign of the allies.\nHe said the Kiev regime continues to test the “limits of what is allowed” by its allies and does not encounter a hint of condemnation of its openly terrorist methods either from the capitals of “advanced democracies” or from the countless human rights structures and mechanisms controlled by its allies.\nThe Russian envoy said the allies are trying to preserve its image as a “model democracy” by silencing the war crimes of its accused in Ukraine and it is using the powerful resources of the mainstream media, doing everything to paralyze the activity of multilateral human rights bodies, blocking sources of undesirable information.\nThe envoy said the recent report of the UNESCO Secretariat on journalists killed in the exercise of their professional duties does not contain a single mention of all the known facts about the deaths of Russian journalists.\nHe said the emerging multipolar world cannot rely on a one-sided, Western-centered media landscape.\nThe Ambassador said that the Ukrainian example clearly shows what can happen to almost any country that happens to be on the next front line of geopolitical pressure and infact, what is being tested now is the strength of the global information space itself and its ability to resist attempts to manipulate the truth.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:04:46.300Z"
}
