{
  "article_id": "2025-03-19_b58e1c3b2c3df577081c1c852e116822",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hotline-against-malpractice-established-at-scp/",
    "retrieved_at": "2025-08-27T13:51:44.414Z"
  },
  "metadata": {
    "title": "Hotline against malpractice established at SCP",
    "author": null,
    "date_published": "2025-03-19T11:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):To reinforces the Superior Court commitment towards accountability and removing hurdles in expeditious justice to the public, the Supreme Court of Pakistan has established a dedicated Anti-Corruption Hotline 03264442444. The incumbent Chief Justice of Pakistan Mr Justice Yahya Afridi is determined to foster an environment that is free of corruption and guided by the principles of accountability and fairness. The Chief Justice shared a message for the general public encouraging them to come forward and contact the Hotline of the Supreme Court if anyone offers them help in fixing dates etc or undue favors for money. This Anti-Corruption Hotline has been developed with a focus on key characteristics that ensure its effectiveness. It provides a secure and confidential platform to the complainants to report incidents of graft, favoritism, or any form of corrupt practices, without fear of retaliation. Whistleblower's identity is protected, and the choice of remaining anonymous is fully respected. The Hotline is accessible through multiple channels, including phone, online portal, email, and text messages, and supports communication in Urdu and English. It operates 24/7, allowing citizens to report incidents at any time, ensuring inclusivity and ease of access. All complaints submitted are overseen independently by an impartial official reporting directly to the Chief Justice, maintaining transparency and objectivity throughout the process. Each report is thoroughly tracked and investigated, with resolutions provided within a timeframe-30 days for simpler case and up to 60 days for complex case. Additionally, the complainants is kept informed about the status of their complaints. This initiative reflects the Chief Justice's endeavor in building and strengthening the public confidence in the institution of the Superior Court. Citizens are urged to utilize this platform to contribute to eliminating bad practices and ensuring transparency and merit. For further details, readers are advised to visit supreme court of Pakistan website.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}