{
  "article_id": "2025-03-19_ed2d20acc09b226c8628b3ea2f3f5c33",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-hosts-iftar-dinner-for-african-missions-diaspora/",
    "retrieved_at": "2025-08-27T13:51:50.108Z"
  },
  "metadata": {
    "title": "ISSI hosts iftar dinner for African missions & diaspora",
    "author": null,
    "date_published": "2025-03-19T11:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 702,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):The Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI) in collaboration with the Africa Division Ministry of Foreign Affairs (MOFA) and Pakistan Africa Economic Council hosted an Iftar-dinner for the African diplomatic corps and diaspora based in Islamabad. Before the dinner remarks were made by Ambassador Sohail Mahmood, Director General ISSI; Ms. Amina Khan, Director CAMEA, ISSI; Mr. Tauseef Zaman, Secretary General Economic Council for Africa (PAEC); H.E. Mohammed Karmoune, Dean of the African Corps and Ambassador of Morocco to Pakistan; Ambassador Hamid Asghar Khan, Additional Secretary Africa, Ministry of Foreign Affairs Pakistan (MOFA), said a press release issued on Wednesday. Ambassador Sohail Mahmood highlighted Pakistan's deep-rooted ties with Africa, emphasizing its central place in the country's foreign policy. He recalled Pakistan's historic support for African nations in their struggle for independence, advocating for their right to self-determination and championing their cause at international forums. This solidarity, he noted, was built on shared struggles for independence and a common vision for a just and equitable world order. He further underscored Pakistan's expanding engagement with Africa across diplomacy, trade, security, and cultural ties, reaffirming the country's longstanding contributions to UN peacekeeping and its commitment to regional and global peace. He further elaborated on Pakistan's 'Engage Africa' policy, which has served as a framework for enhancing Pakistan's diplomatic footprint across the continent and broadening economic cooperation. This policy was crafted to recognise the strategic salience of Africa and its vast economic potential. In recent years, Pakistan's engagement with Africa has reached a new level, creating new opportunities, particularly in light of the African Continental Free Trade Area (AfCFTA), he said. He added that history and contemporary realities were the key drivers of Pakistan's relations with Africa. Deeper engagement with the African Continent has now become a strategic imperative. He lauded the efforts of Ambassadors Hamid Asghar Khan and Ahmed Ali Sirohey in advancing the 'Engage Africa' policy and acknowledged the African diaspora's role in strengthening Pakistan-Africa ties. He reaffirmed ISSI's commitment to deepening engagement through dialogue, research, and policy initiatives, urging collective efforts to maximize this partnership's potential. Ms Amina Khan, Director CAMEA highlighted the significance of Pakistan's engagement with Africa and CAMEA's commitment to strengthening these ties beyond politics and economics by fostering people-to-people connections. She emphasized that the Iftar was a reflection of this outreach, made possible through the support of the Africa Division at the Ministry of Foreign Affairs (MOFA) and the Pakistan-Africa Economic Council (PAEC). Tauseef Zaman emphasized the spirit of Ramadan-empathy, unity, and shared humanity-which resonates deeply in both Pakistan and Africa. He highlighted the vision of leaders like Quaid-e-Azam Muhammad Ali Jinnah and Kwame Nkrumah, who aspired for Global South nations to stand together. Noting the progress in trade, investment, and cultural exchange, he urged for greater collaboration in areas such as renewable energy, digital partnerships, and agricultural innovation. He called on leaders to turn dialogue into action, fostering deeper ties and shared prosperity between Pakistan and Africa. H.E. Mohammed Karmoune, highlighted Pakistan's longstanding solidarity with Africa, recalling the country's support for African liberation movements and contributions to UN peacekeeping missions. He noted that Pakistan has strengthened its diplomatic presence with 20 missions and active engagement in regional organizations. Emphasizing economic potential, he pointed to initiatives like the 'Look Africa' and 'Engage Africa' policy, which have helped boost trade to $7 billion. He emphasized the need for joint ventures, better connectivity, and investment partnerships while highlighting cultural, educational, and technological cooperation to foster shared prosperity between Pakistan and Africa. Ambassador Hamid Asghar Khan highlighted Africa's growing economic and strategic significance, emphasizing Pakistan's commitment to strengthening ties with the continent. He underscored the importance of enhancing trade, investment, and educational exchanges to foster deeper collaboration. He noted that Pakistan is actively working to expand its diplomatic and economic footprint in Africa, with future initiatives such as Africa Week and high-level visits aimed at furthering engagement. He encouraged stakeholders to explore new avenues of cooperation, reaffirming that Africa presents immense opportunities for mutual growth and prosperity. The event was attended by a large number of members of the African diaspora based in Islamabad, including diplomats, students, academics, and businessmen.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}