{
  "article_id": "2025-03-19_1d4188c2034f76ccf9b257bd6e42e17a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-food-authority-to-launch-lab-mobile-app-for-safer-food/",
    "retrieved_at": "2025-08-27T13:51:44.666Z"
  },
  "metadata": {
    "title": "Islamabad Food Authority to launch lab, mobile app for safer food",
    "author": null,
    "date_published": "2025-03-19T10:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 288,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP): The Islamabad Food Authority (IFA) approved sweeping measures during its 10th board meeting, including plans to establish a food testing lab, launch a public mobile app, and expand licensing categories to tighten oversight of food businesses. Talking to APP, Deputy Director Operations of Islamabad Food Authority (IFA) Dr Tahira Siddique said that the moves aim to enhance food quality checks and streamline operations in the Federal Capital. Chaired by Chief Commissioner Muhammad Ali Randhawa, the IFA board cleared all agenda items, focusing on improving food safety mechanisms and public access to quality products. Key decisions include setting up a dedicated food laboratory to expedite testing of consumables, purchasing new vehicles to bolster field inspections, and rolling out a mobile app to simplify public reporting of violations. DR Tahira confirmed that staff ensuring food quality during Ramazan will receive special allowances. The authority also plans to introduce new licensing tiers, bringing all food businesses-from street vendors to large outlets-under a unified monitoring system. \"These steps will strengthen our capacity to enforce standards and respond swiftly to complaints,\" she said. The food lab will enable rapid analysis of samples, while the mobile app will allow residents to flag issues directly to the IFA. To improve field operations, the authority will allocate additional vehicles to inspection teams, ensuring broader coverage across markets. The expanded licensing framework aims to eliminate unregulated food sales by requiring all vendors to register under specific categories. On the occasion, Chief Commissioner Islamabad, Muhammad Ali Randhawa emphasized that the reforms prioritize public health and align with efforts to ensure safe, affordable food access. Businesses are urged to comply with updated regulations, while residents are encouraged to use the upcoming app for real-time reporting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}