{
  "article_id": "2025-03-19_0bb3e93499b39e7490f82672531a21d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-paidar-commemorate-tunisias-independence-day/",
    "retrieved_at": "2025-08-27T13:51:42.652Z"
  },
  "metadata": {
    "title": "ISSI-PAIDAR commemorate Tunisia’s Independence Day",
    "author": null,
    "date_published": "2025-03-19T11:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 768,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):The Centre for Afghanistan, Middle East & Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with Pakistan Africa Institute for Development and Research (PAIDAR), on Wednesday organized an event to commemorate Tunisia's Independence Day. The event began with the national anthems of Pakistan and Tunisia - were moderated by Ms. Amina Khan, Director CAMEA, said a press release. Speakers included Ambassador Sohail Mahmood, Director General ISSI; Dorsaf Maaroufi, Charge d' Affairs of Tunisia to Pakistan; Javed Ahmed Umrani, Ambassador of Pakistan to Tunisia; Ambassador Khalid Mahmood, Chairman BOG ISSI. The Chief Guest on the occasion was Senator Mushahid Hussain Sayed, President PAIDAR, and the Keynote Speaker was Ambassador Hamid Asghar Khan, Additional Secretary (Africa), Ministry of Foreign Affairs Pakistan (MOFA). Senator Mushahid Hussain Sayed highlighted the historical and strategic significance of Pakistan-Tunisia relations within Pakistan's broader foreign policy framework and special affiliation with the Global South. He recalled Pakistan's support for North African liberation movements, including Algeria, Morocco, and Tunisia, emphasizing its active role in international diplomacy despite limited resources. Stressing the need for deeper economic and strategic engagement with Africa, he underscored the potential of initiatives like the 'Engage Africa' policy. Praising Tunisia's resilience and leadership, he called for stronger trade, education, and cultural exchanges, advocating deeper people-to-people and business linkages. He reaffirmed Pakistan's commitment to Africa, emphasizing that the future belongs to the Global South. Ambassador Sohail Mahmood extended warm felicitations to the Government and people of Tunisia on the 69th anniversary of their independence, acknowledging Tunisia's resilience in securing its sovereignty. He recalled Pakistan's strong support for Tunisia's independence, particularly its advocacy at the United Nations, and noted that this shared history laid the foundation for a lasting partnership. Emphasizing economic and political cooperation, he highlighted institutional mechanisms such as the Joint Ministerial Commission (JMC) and Bilateral Political Consultations (BPC), which have facilitated sustained engagement. While bilateral trade was valued at $14 million in 2023-2024, he stressed the need to bring the economic relationship at par with the excellent political ties between Pakistan and Tunisia. He also recognized Tunisia's active role in regional and global affairs, including its principled stance on the Jammu and Kashmir dispute at the Security Council during the term 2020-21. Ambassador Sohail Mahmood further highlighted convergent views of the two countries on a range of issues including the need for collective endeavors to combat Islamophobia. Reaffirming Pakistan's commitment to deeper ties, he underscored the importance of expanding educational exchanges, academic and think-tank collaboration, strengthening trade and investment, and fostering cultural cooperation. Ambassador Hamid Asghar reaffirmed Pakistan's deep ties with Tunisia, rooted in shared history, faith, and culture. He recalled Pakistan's support for Tunisia's independence and Habib Bourguiba's message to Quaid-e-Azam in 1947. Highlighting the 'Engage Africa' policy, he outlined efforts to boost trade, agriculture, energy, and industry, including talks on a Preferential Trade Agreement. He stressed expanding economic ties beyond the $13.58 million trade volume, citing opportunities in IT, pharmaceuticals, and tourism. He also emphasized Pakistan-Tunisia cooperation on global issues and Africa's economic potential, urging deeper engagement for mutual growth. In her remarks, Ms Amina Khan highlighted Tunisia's struggle for sovereignty and Pakistan's historic support for its decolonization. She emphasized Pakistan's commitment to Africa under the 'Engage Africa' policy and CAMEA's efforts to enhance diplomatic and economic ties. Stressing the need to expand trade and investment, she reaffirmed Pakistan's dedication to strengthening ties with Tunisia and the broader African Continent. Ms Dorsaf Maaroufi described Tunisia's Independence Day as a key milestone in its pursuit of sovereignty, democracy, and progress. She acknowledged Pakistan's steadfast support during Tunisia's struggle for independence and highlighted the strong diplomatic ties between the two countries. Noting the modest trade volume, she stressed the potential for greater economic cooperation, given Tunisia's strategic location. She also cited recent business engagements and the upcoming FITA 2025 forum as opportunities to enhance trade and investment. She concluded by reaffirming Tunisia's commitment to strengthening collaboration with Pakistan. Ambassador Javed Ahmed Umrani emphasized Pakistan-Tunisia's longstanding ties, recalling Pakistan's support for Tunisia's independence and their growing diplomatic and economic relations since 1958. He noted bilateral trade of $13.58 million in 2023-2024 and highlighted future cooperation in key sectors, including telecommunication, health, education, and agriculture. He reaffirmed Pakistan's commitment to strengthening ties and extended best wishes on Tunisia's National Day. Ambassador Khalid Mahmood, in his vote of thanks, said that as we celebrate Tunisia's 69th Independence Day, it reflects the strong historical and diplomatic ties between Pakistan and Tunisia. Noting low trade and investment, he stressed bridging gaps to strengthen ties with Tunisia and the broader African Continent.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}