{
  "article_id": "2025-03-19_55b938cf62e7d3585d296557feda2e97",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mustafa-kamal-visits-pims-hospital/",
    "retrieved_at": "2025-08-27T13:51:16.653Z"
  },
  "metadata": {
    "title": "Mustafa Kamal visits PIMS hospital",
    "author": null,
    "date_published": "2025-03-19T14:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):Federal Minister for Health, Syed Mustafa Kamal on Wednesday visited Pakistan Institute of Medical Sciences (PIMS) hospital to assess healthcare services, ongoing projects, and the challenges faced by the institution. During the visit, the hospital administration provided a detailed briefing to the minister. He was informed about the medical facilities available, the resources at hand, and the challenges faced by the hospital in delivering quality healthcare. Additionally, the minister was updated on ongoing projects and the upgradation initiatives at PIMS. During the briefing, the minister was informed that PIMS hospital receives approximately 6,000 to 7,000 patients daily. The minister was also briefed on the construction of a new 200-bed emergency facility, which is expected to become functional by June 2025. Mustafa Kamal inquired about the various tests being conducted in the hospital's laboratories. He instructed hospital authorities to submit a comprehensive report on the challenges, recommendations, and future plans for improvement at the earliest. Following the briefing, the minister inspected the Outpatient Department (OPD) and emergency wards. He personally reviewed the facilities being provided to patients and interacted with them to understand their concerns. The minister emphasized the importance of compassionate healthcare. \"Those who come to hospitals are in distress, and we must work to ease their suffering, not add to it,\" he remarked. He said, \"It is our duty to serve patients with sincerity and dedication. We must fulfill our responsibilities with integrity.\" The minister urged doctors, paramedical staff, and nurses to treat patients with kindness and professionalism. \"A few kind words can be a source of healing for patients. We must ensure the provision of quality healthcare and do everything in our power to improve hospital services,\" he said. Mustafa Kamal reaffirmed the government's commitment to strengthening healthcare infrastructure and ensuring the delivery of efficient medical services to the public.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}