{
  "article_id": "2025-03-19_be1970a6d31d63e92fe9e33ae12c0afc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/2nd-pakistan-south-africa-joint-defence-committee-meeting-concludes/",
    "retrieved_at": "2025-08-27T13:50:51.706Z"
  },
  "metadata": {
    "title": "2nd Pakistan-South Africa joint defence committee meeting concludes",
    "author": null,
    "date_published": "2025-03-19T16:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 189,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):The Ministry of Defence hosted the 2nd meeting of the Pakistan-South Africa Joint Defence Committee (JDC) held here from March 17 to 19, 2025, said a news release. Pakistan's delegation was led by Secretary Defence Lt. Gen. (Retd) Muhammad Ali while Dr. Thobekile Gamede, Acting Secretary of Defence headed the South African side. During the meeting, both sides discussed matters of mutual interest and reviewed existing defence cooperation. They expressed satisfaction with ongoing collaboration and explored opportunities for expanding defence ties between the two countries. Secretary Defence Muhammad Ali emphasized the strong historical ties between Pakistan and South Africa, founded on shared values of justice, freedom, and human rights. He highlighted Pakistan Army's significant contributions to United Nations peacekeeping missions, particularly in Africa. He stressed the need to enhance collaboration in emerging areas such as cyber security, space, artificial intelligence, research and development, technology transfer, and capacity building within the defence industry. Dr. Thobekile Gamede thanked the Government of Pakistan for its warm hospitality and appreciated the productive discussions. She reaffirmed South Africa's commitment to strengthening defence cooperation through joint ventures, technology transfer, and training exchanges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}