{
  "article_id": "2025-03-19_0dcae49c383196ee4de1773d6afc8a35",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-reaffirms-commitment-to-defeat-terrorism-ensure-sustainable-peace-development-in-balochistan/",
    "retrieved_at": "2025-08-27T13:50:35.249Z"
  },
  "metadata": {
    "title": "President reaffirms commitment to defeat terrorism, ensure sustainable peace, development in Balochistan",
    "author": null,
    "date_published": "2025-03-19T14:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "QUETTA, Mar 19 (APP): President Asif Ali Zardari on Wednesday reaffirmed the government's resolve to defeat terrorist elements at all cost and ensure sustainable peace and development in Balochistan. Chairing a meeting on the law and order situation in Balochistan, the president underscored the threat posed by the terrorists who wanted to divide the nation. The meeting was attended by Chairman Pakistan Peoples Party Bilawal Bhutto Zardari, Acting Governor Balochistan Captain (retd) Abdul Khaliq Achakzai, Chief Secretary Balochistan Shakeel Qadir Khan, IG Police Moazzam Jah Ansari and other high officials. Chief Minister Balochistan Mir Sarfraz Bugti briefed the meeting on the law and order situation in the province. \"The situation is clear, the state will continue to exist and we will have to win war against terrorism,\" the president remarked. He emphasized that the government will provide latest weapons to the anti-terrorism wing. Balochistan is close to our hearts and we want development and sustainable peace in the province, the president added. He said the government wanted to see every child of Balochistan enrolled in the school. It is the need of the hour to make the children aware of the modern technology, President Zardari added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}