{
  "article_id": "2025-03-19_a982e50e3e36ed2a37b0af751b97b9ef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-directs-to-make-motorways-automated-with-al-enhance-surveillance/",
    "retrieved_at": "2025-08-27T13:51:16.582Z"
  },
  "metadata": {
    "title": "Minister directs to make motorways automated with Al & enhance surveillance",
    "author": null,
    "date_published": "2025-03-19T14:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 399,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):Federal Minister for Communications Abdul Aleem Khan on Wednesday issued directives to make all motorways automated, enhance monitoring and surveillance by ensuring road safety including M-tag and other key measures. Presiding over a joint meeting of the National Highway Authority (NHA) and the Motorways and Highways Police, Federal Minister Abdul Aleem Khan emphasized that it should be mandatory for all commercial vehicles before coming on the Motorways to undergo physical fitness check. Similarly, no bus should operate on highways without the necessary certification. Additionally, overloading of commercial vehicles will not be tolerated under any circumstances, said a press release. The Motorway Police has been directed to ensure strict checks on buses and where ever passenger numbers exceed the limit, the bus should be offloaded at that same location. The minister further stated that within the next three months, the licenses of all existing commercial drivers will be re-verified. To ensure public awareness about these policies, the NHA and the Motorway Police will launch separate media campaigns for their effective promotion, he added. Abdul Aleem Khan also instructed the IG of Motorways and Highways Police to personally meet with transporters and take them into confidence about new measures. The minister emphasized that making national highways safer is a top priority. He added that as long as officers remain active, improvements will also continue. Abdul Aleem Khan highlighted that the recent actions taken by the NHA have not only resulted in an increase in revenue but have also led to a reduction in incidents of over speeding on the Motorways. He directed the Secretary for Communications, Chairman NHA and the Inspector General of Motorway Police to establish monitoring cells in their respective offices under an integrated system where data and videos of each Motorway and Highway can be accessed with the one click of a button. He also emphasized the use of Artificial Intelligence and advanced technology in this regard. During this high-level joint meeting, Minister Abdul Aleem Khan set financial targets and annual goals for the department, instructing them to make every effort to achieve them. In a briefing, the IG of Motorways reported that, in line with the Minister's directives, 76 FIRs have been registered for over speeding and there is a noticeable decline in such incidents. The Chairman of NHA also presented a report on the reduction of thefts of safety barriers along the Motorways.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}