{
  "article_id": "2025-03-19_1ba59ec3616c5d70a3e23dfa1f782c65",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/phaf-committed-to-improve-life-quality-promote-economic-prosperity-mobility-for-residents-of-pakistan/",
    "retrieved_at": "2025-08-27T13:51:47.464Z"
  },
  "metadata": {
    "title": "PHAF committed to improve life quality, promote economic prosperity, mobility for residents of Pakistan",
    "author": null,
    "date_published": "2025-03-19T11:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 468,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):Pakistan Housing Authority Foundation (PHAF), Ministry of Housing and Works has emerged as a beacon of hope for residents of Pakistan which was committed to enhance the quality of life, promoting economic prosperity, and improving mobility for the residents. As a recognized public works leader and in collaborations with Federal & Provincial public entities, PHAF was striving to continuously improve operations to provide a safe and sustainable environment and was consistently striving to eliminate shelterlessness and to reduce the housing shortfall in Pakistan. According to an official document, in 2000, PMHA was renamed as Pakistan Housing Authority Foundation (PHAF) and placed under the Ministry of Housing and Works. In 2012, PHAF was registered as an NPO under the Companies Ordinance. From 1989-2007, the FGE Housing Authority allotted 22,785 units to its members. Membership Drives I and II began in 2009 and 2015, registering over 186,000 employees. Members were accommodated in four housing schemes. PHAF major accomplishments included multiple successful projects in major cities, handing over 24 projects, including 6,362 apartments/houses. Over the past year, FGEHA made significant progress in project development and resolving related issues. Pak PWD contributed to infrastructure by completing office buildings and road rehabilitation, investing over 3 billion rupees. They also modernized operations with the Electronic Project Approval and Documentation System (EPADS). Moreover, several initiatives were implemented, including Creation of a web-based application and central database for improved coordination, Regular data updates and record management, Issuance of 2,136 allotments to federal government servants, Rent recovery of 730.37 million rupees, Transfer of maintenance operations to Estate Office, Launch of an upgraded One Window Cell for employee allotments. Having its own self revenue mechanism PHAF does not receive any grant from the government. Moreover, PHA-F was registered with Securities & Exchange Commission of Pakistan under section 42 of the Companies Act 2017 by taking over all rights, privileges and other interests of the existing authority i.e. Pakistan Housing Authority and working as a subordinate office of the Ministry of Housing & Works to carry out the purposes/affairs of the Federation. Total budget allocated for the PHA Foundation was Rs 10,298,094,885 out of which operational budget forn fiscal year was Rs 805,096,336 whereas its development Budget stood at Rs 9,492,998,549. The PHA Foundation had developed nearly 7,000 housing units in provincial capitals, with two ongoing projects totaling 4,550 units in Islamabad and Quetta. A 15,000-unit project in Peshawar, including an initial phase of 800 units, was in the tendering stage. These projects were being pursued on a self-finance basis. The current housing shortage in Pakistan was 10 million units annually, highlighting the need for state support and collaboration between public and private sectors. PHA Foundation was also finalizing policy and legislative developments including joint ventures, maintenance and management, and direct land purchase to improve performance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}