{
  "title": "Personal hygiene significant to curb Coronavirus spread: Dr Rashid",
  "link": "https://www.app.com.pk/national/personal-hygiene-significant-to-curb-coronavirus-spread-dr-rashid/",
  "date_published": "2020-03-28T23:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):The pandemic of coronavirus (COVID-19) has gripped the entire world where personal hygiene was significantly helpful in curbing the spread of the deadly infectious diseases in the society.\nThis was stated by Consultant Microbiologist and Expert of Infectious Diseases Dr Rashid Jehangir Sheikh in an exclusive talk with APP.\nHe said Coronavirus would affect every person whereas the most vulnerable were people belonging to the age group of less than 12 years and above 50 years e.\nAt the moment, he said, there was no treatment for COVID-19 rather precaution could be helpful in saving lives from the attack of the fatal outbreak.\nHe said the precautionary measures included personal hygiene, washing nose and gargle with lukewarm water and also in case of flue one should wear a safety mask and avoid contact with people developing coronavirus like symptoms.\n“When an affected individual sneezes and coughs, he or she could affect at least 350 more people in his surroundings,” he added.\nDr Rashid informed that every flu and cough was not coronavirus rather people should avoid creating panic as it might be seasonal cough or flu. “In this case people should consult doctor and take precautionary measures state above to avoid further spread,” he added.\nTo a question, he said washing hands with soap was 20 times better then washing hands with a sanitizer.\nPeople could make protective masks at home with a clean cotton cloth or any other fabric, he added.\nHe said “If you have no mask available to cover your face then use your arm to cough and sneeze.”\nHe informed that in case a person got stranded in an abandoned area due to coronavirus outbreak then he or she should practice self isolation to remain safe from coronavirus outbreak.\nHe said it was not difficult and it was similar like Muslim practices Itikaf in the last 10 days of Holy month of Ramadan. “It is not a difficult thing and most of the people are familiar with this so there should not be problem for the masses to observe self isolation during the lockdown to contain the pandemic.”\n“I predicted in February that coronavirus will come to Pakistan as unfortunately we are among those countries who failed to follow the protocols developed to contain the outbreak,” he pointed out.\nHe went on to mention that social media and other online information portals were providing information on use of medicine, chemicals or therapy to treat coronavirus or visit spiritual influencer to get rid of this pandemic.\n“I request the masses to pay no heed to such erroneous information and only consult an authorized physician.” For instance, any social media source provides guidelines like sitting in sunlight, intake of vitamin C and eating fruits, vegetables and dry fruit can help control and using warm water. All such information could be followed as it had no negative impact on health,” he added.",
  "retrievedAt": "2025-08-11T19:01:09.803Z"
}
