{
  "title": "Firdous castigates ex CM for neglecting health sector facilities in Punjab",
  "link": "https://www.app.com.pk/national/firdous-castigates-ex-cm-for-neglecting-health-sector-facilities-in-punjab/",
  "date_published": "2020-03-29T06:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Expressing dismay over the negligence of ex Chief Minister Shahbaz Sharif and PML-N government for ignoring many sectors including health in Punjab, Special Assistant to Prime Minister on Information and Broadcasting, Dr Firdous Ashiq Awan said the people were facing immense problems in acquiring health facilities due to lack of adequate and sufficient health institutions including hospitals amid recent corona outbreak.\nTalking to a private news channel programme, she said the PML-N leaders had ruled over the province for the last three decades but unfortunately, they could not establish an international standard health institution for provision of facilities to masses.\nLack of essential medical equipments being reported in number of hospitals in the province, she said the former Chief Minister Shahbaz Sharif was misleading the nation while taking advantage of the calamity emerged due to Corona virus in the country.\nShe advised the ex CM to shun playing gimmicks and keeping alive himself in the politics, adding the leaders of PML-N should respond to the questions asked by the national accountability bureau for plundering the national exchequer that had caused a colossal damage to many sectors including health.\nAppealing the Overseas Pakistanis for depositing foreign currency in the funds being established in the State Bank of Pakistan for helping Corona stricken patients, she said they had always played an active role in helping the country in hour of trial.\nSpecial Assistant to Prime Minister on Information and Broadcasting, Dr Firdous Ashiq Awan said that Overseas Pakistanis had always been committed and dedicated besides played a front-line role in steering the country out of crisis. She said coronavirus pandemic had affected a large number of people around the world and causing damage to global economy. Pakistan was also one of the nations confronting the same challenge in the present scenario, she added.\nShe hoped that with the support of Overseas Pakistanis in this hour of calamity, the government could avert the country from moving towards economic recession.",
  "retrievedAt": "2025-08-11T19:01:03.948Z"
}
