{
  "title": "Fawad Chaudhry to represent Pakistan in Ministerial Dialogue on COVID-19",
  "link": "https://www.app.com.pk/national/fawad-chaudhry-to-represent-pakistan-in-ministerial-dialogue-on-covid-19/",
  "date_published": "2020-03-29T06:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Federal Minister for Science and Technology Chaudhry Fawad Hussain will represent Pakistan in the Virtual Ministerial Dialogue titled “COVID-19 and Open Science” to be held on Monday (March 30) via video link.\nThe dialogue is being arranged by United Nations Educational, Scientific and Cultural Organization (UNESCO), an official source from the ministry told APP.\nThe purpose of the Ministerial Meeting is to consider proposals and future action plans for the prevention of global diseases with the help of science.\nThe meeting will also consider the possible immediate and equitable participation of data and scientific information worldwide regarding global war against COVID-19 and other unknown epidemic diseases and threats.\nAt the meeting, the Director General will also give a presentation on UNESCO science and the prevention of pandemic diseases.\nAll Ministers will discuss and consult on policy and lessons in this context.\nIn the meeting, the world-renowned Nobel laureate scientists will also inform participants of their experiences and observations on COVID-19, the official informed..\nAccording to the UNESCO, the purpose of the meeting is to provide a platform for dialogue and share experiences and lessons learnt on how science has informed evidence based decision making.\nThe ministerial meeting and the associated ‘Plea for a global pact for Open Sciences and international scientific collaboration’ intends to reaffirm the critical role of science to contain the pandemic and preparedness for the future.\nSpecifically: This initiative will help support the international coalition of scientists and mobilise policy makers and reaffirm the importance of science for informed policy-making and in meeting global challenges including addressing COVID-19.\nThe scientists and policy makers will discuss which policy measures are needed to ensure adequate scientific collaborations and what additional mechanisms and international platforms are necessary for ’opening science’.\nThey will ponder on how can science provide solutions in the ‘war against COVID-19” and other future unknown pandemics and threats.\nThe meeting will begin with a short presentation by the Director General-UNESCO, updating the situation and presenting how science has been informing the decision making to contain the spread of the Coronavirus pandemic, followed by interventions from Ministers to share policy responses and lessons learned.",
  "retrievedAt": "2025-08-11T19:01:03.254Z"
}
