{
  "title": "Chinese health experts’ delegation visits NIH",
  "link": "https://www.app.com.pk/national/chinese-health-experts-delegation-visits-nih/",
  "date_published": "2020-03-29T05:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):A team of Chinese health experts led by Luo Zhaohui, Ambassador of China to Pakistan on Sunday visited National Institute of Health (NIH) for sharing their experiences in managing and combating Coronavirus (COVID-19).\nChinese team including epidemiologist, ICU specialist, IPC specialist, medical specialist and outbreak control specialist was received and briefed by Executive Director NIH Maj. Gen. Aamer Ikram.\nHe apprised the delegates about the current situation of COVID-19 in Pakistan and major response activities at present.\nSpecial Assistant to Prime Minister on National Health Services Dr Zafar Mirza thanked the Chinese delegation for helping Pakistan through their experiences.\nHe said China’s response to disease was very effective in their homeland and it now started assisting other states as how to manage the outbreak.\nOn this occasion, Dr Aamer Ikram said that all departments and divisions of the National Institute of Health Islamabad, under the leadership of Dr Zafar Mirza were coordinating the national response activities for COVID-19.\nHe acknowledged the fight of the Chinese nation against COVID-19. He said that it is a great opportunity to learn from Chinese successful experience against COVID-19.\nHe said that China once again proved that they were true friends of Pakistan and always available to collaborate and coordinate with Pakistan in every situation and difficult times.\nChinese ambassador said that Pakistan and China were all-weather friends. China will continue its every kind of support for Pakistan, he added.\nThe technical team of NIH including epidemiologists, doctors, and emergency management team arranged a meeting with Chinese experts for sharing experience in managing and response of the COVID-19 outbreak in Pakistan.\nThe Chinese doctors visited different divisions of NIH and discussed various techniques that they utilized to combat the spread of the COVID-19 in China.\nThe Chinese delegate appreciated the response of NIH to the disease so far.",
  "retrievedAt": "2025-08-11T19:01:04.784Z"
}
