{
  "title": "745 corona patients stable, showing signs of recovery: Dr Mirza",
  "link": "https://www.app.com.pk/national/745-corona-patients-stable-showing-signs-of-recovery-dr-mirza/",
  "date_published": "2020-03-29T09:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Special Assistant to the Prime Minister on National Health Services Dr Zafar Mirza on Sunday said that 745 confirmed COVID-19 patients admitted in various hospitals across the country were stable and showing signs of recovery.\n“They were in mild to moderate condition and soon they will be discharged from the hospitals,” Dr Mirza said in a routine televised media briefing on prevailing corona situation in the country.\nHe said that out of total 756 hospitalized corona patients, only 11 were in critical condition and they were being treated at isolation rooms while some of them were on ventilators.\nHe said that 294 patients were hospitalized in Sindh, 247 in Punjab, 60 in Khyber Pakhtunkhwa (KP), 130 in Balochistan, 12 in Gilgit Baltistan (GB), two in Azad Jammu and Kashmir (AJK) and 11 in Islamabad Capital Territory (ICT).\nHe said the coronavirus caseload in Pakistan had 1,562 with addition of 121 new cases during last 24 hours. He added 28 patients had been recovered completely while total 13 deaths had been reported from the disease so far included five from Punjab, four from KP, two from Sindh, one each from Balochistan and GB.\nHe added out of 13 total death two death were reported during last 24 hours included one from Karachi and one from Lower Dir.\nDr Mirza said that total 8,066 people were living in different quarantine in provinces out of which PCR test of 4,365 people had been conducted with corona positive ratio of 20 percent as 869 people had COVID positive.\nHe added in total 1,527 confirmed corona patients, 857 patients (58%) had travel history of Iran, 191 patients (13%) had travel history of other countries and 420 patients (29%) had received virus in local transmission.\nHe said that during last 24 hours total 1,006 suspected cases were registered while total suspected cases were 3,324 out of which 1526 were confirmed patients included 558 cases from Punjab, 481 from Sindh, 188 from Khyber Pakhtunkhwa, 138 from Balochistan, 116 from GB, two from AJK and 43 from ICT.\nHe said the government has provided one month stock of personal protection equipment (PPE) kits to the administrations of ICT, AJK and GB for their health professionals, medical and para medical staff and doctors.\nHe added the government will ensure further supply of all such items for these areas in coming period while provinces were in touch with the federal government for provision of quality PPE kits.\nDr Mirza said the existing ratio of corona cases in Pakistan was very low which was against the speculation and urged the citizens to continue practicing preventive steps including social distancing to avoid from massive spread of cases.\nHe advised the citizens to avoid unnecessary movement outside home and adopt all preventive measures including staying at home, avoid shaking hands, washing hands for 20 seconds and social distancing.",
  "retrievedAt": "2025-08-11T19:01:01.729Z"
}
