{
  "title": "COVID-19: Police strives to implement sec 144 in capital",
  "link": "https://www.app.com.pk/national/covid-19-police-strives-to-implement-sec-144-in-capital/",
  "date_published": "2020-03-29T04:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Deputy Inspector General (Operations), Islamabad Waqar Uddin Syed Sunday said the police were making all-out efforts to ensure implementation of the section 144 imposed by the district administration to contain spread of the coronavirus in the federal capital.\n“The Islamabad Capital Territory (ICT) police have already launched an awareness drive to sensitize the capital’s dwellers about the precautionary measures against the COVID-19, said Waqar while reviewing the efforts of its operational force in ensuring compliance of the administration’s directives in the city.\nDuring the meeting, he said the police had formed special teams under the supervision of senior officers which had been visiting different sectors to educate the public against the COVID-19.\n“Apart from awareness, our teams are also distributing masks, hand sanitizers and gloves among citizens to prevent spread of the coronavirus,” he added.\nA press release issued by the police quoted the DIG as saying that the awareness campaign was started on the instruction of Inspector General Islamabad Aamir Zulfiqar Khan.\nWaqar said it was meant to aware people about preventive measures required to curb the deadly virus spread.\nLauding the efforts of police officials, Deputy Inspector General Waqar ud Din Sayed said: “Our Jawans are playing frontline role in protecting lives and properties of the citizens in wake of the coronavirus emergency.\nHe also appreciated the role of officers who were working diligently in this hour of distress.\nHe directed the officials to take strict action against those who were not following the restrictions imposed by the local administration in wake of the coronavirus emergency.\nWaqar said milk, vegetables, chicken shops would remain be opened and the people should wear masks in premises of shops. The customers should keep distance of 6 feet in markets, he said, stressing over sealing those shops which were not taking precautionary measures.\nThe DIG also sought people cooperation in defeating the coronavirus.The fight against coronavirus would only be won through cooperation of the people, he added. He said every police official was performing additional duties by considering it an obligation for the sake of human safety.\n“All the SPs and DSPs are present in their respective areas and extending all-out support to the district administration for ensuring peace and tranquility in the city,” he added.",
  "retrievedAt": "2025-08-11T19:01:05.669Z"
}
