{
  "title": "Minister urges youth to play role for awareness on Coronavirus",
  "link": "https://www.app.com.pk/national/minister-urges-youth-to-play-role-for-awareness-on-coronavirus/",
  "date_published": "2020-03-29T03:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Federal Minister for Education and Professional Training, Shafqat Mehmood Sunday called upon youth to play their active role in raising awareness among masses about coronavirus and wooing them to adopt the precautionary measures through social media platforms.\nTalking to a private news channel, he appealed before the nation specially youth to impose self discipline and should not indulge in panic situation, as with collective efforts, they would overcome the threats of Coronavirus (COVID 19) pandemic.\nThe Minister said that youth have a great national responsibility to play their part and create awareness amongst their relatives, neighbors in order to provide best possible help to wipe out COVID 19.\n“The only way to survive is to observe preventive measures”, he added.\nHe appreciated government’s efforts to increase testing capacity enable to facilitate everyone who has symptoms of the coronavirus.\nThe government has ensured that every Coronavirus patient should go into quarantined and treated well, he said, adding, the incumbent government is taking corrective measures to deal with any situation.\nHigher Education Commission is in contact with the major universities of the country for conducting a conducive research in wake of Coronavirus outbreak, he said.\nCoronavirus has emerged as an unprecedented global issue. We are hopeful that we would be able to find out some cure for this pandemic, he added.\nThe minister said the educational institutions has to play great role during crucial time.\nWe should keep in mind that this is not a fatal disease and we can recover but precaution is better than cure. It is high time for the students to spread awareness and educate the people to stay safe, he advised.\nOur religion teaches us to take all precautionary measures in wake of any pandemic. It is our social responsibility to stay safe and keep other safe too, he stressed.",
  "retrievedAt": "2025-08-11T19:01:07.605Z"
}
