{
  "title": "Sindh govt develops URL to register welfare organizations for ration distribution at door steps",
  "link": "https://www.app.com.pk/national/sindh-govt-develops-url-to-register-welfare-organizations-for-ration-distribution-at-door-steps/",
  "date_published": "2020-03-29T04:55:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 29 (APP):Sindh Chief Minister Syed Murad Ali Shah has established a Sindh Relief Initiative Application with a URL address under which social welfare organisaztions interested in working with government would have to get them registered so that ration could be distributed among daily waters at their door steps.\nThe URL address ihttps://play.google.com/store/apps/detailes?id=inc.codelabs.krtvolunteer.\nThis he said while presiding over a meeting of welfare organizations, said a spokesperson to the CM Sindh.\nThe meeting was attended by provincial ministers, advisor law, special assistants, head of different welfare organizations, chief secretary, IG Police, Home secretary, Adl IG Karachi, Secretary Finance and others.\nThe Sindh Relief Initiative is aimed at providing ration to the daily wagers and needy people at their door steps, the CM said and added the daily wagers would have to get them registered through an application (APP) and then the government would distribute different areas among different welfare organization for distribution of ration.\nThe chief minister said that according to 2017 census the population of the province comes to 50 million of them 10 million people or 1.4 million families are daily wagers, therefore the government in support of welfare organizations have to provide them with ration bags.\nHe said that out of 10 million daily wagers, 25 per cent were associated with construction industry who are covered under EOBI, 35 percent were affiliated with Textile and Ancillary industry and they were also registered with EOBI and 40 percent workers work in SME, cottage and roadside shops and transport industry and they were not registered with any organization such as EOBI or SESSI.\nThe CM Sindh said that if an average family was provided with a ration bag of Rs 5,500 the amount would come to Rs7.7 billion if 1.4 million families were covered. “I am developing a mechanism to reach each and every family so that no body go without ration,” he said.\nThe chief minister said that all stakeholders, including government and non-government organizations should use the same platform to promote uniformity in the whole disbursement exercise.\n“Standard Operation Procedure (SOP) for disbursement to be signed by all stakeholders,” he said and added ‘making use of technology for disbursement data management and record keeping.\nHe disclosed that Sindh Relief initiative App has been developed providing single platform for all relief activities. The App would ensure uniformity in disbursement by registering CNICs so that no duplication could happen. “The App will do volunteer management as well as register donors.\nHe thanked the organization such as Karachi Relief Trust, Saylani Welfare, Edhi, Bait-us-Salam, Citizen Foundation, Chhipa, Zindagi Trust, Patient Aid and various others who were supporting the government in its initiative.\nHe said that with the support of the government the welfare organisations, like Saylani, Chhipa, Almgir, Zindagi Trust and others have started distribution of ration among the daily wagers and needy people in different areas and around 200,000 families have so far been provided with a 15 days ration bag.\nAll the welfare organizations have been requested to down load the government APP https://play.google.com/store/apps/detailes?id=inc.codelabs.krtvolunteer and get them registered there so that a joint working group could be developed for distribution of ration without duplication. So far 12 organizations have down loaded the APP and joined the APP of the government.\nThe chief minister said that Minister energy Imtiaz Shaikh, Minister LG Nasir Shah and Advisor Murtaza Wahab would be coordinating with the welfare organization for fair distribution of ration at the door step of the people.\nSindh Chief Minister Syed Murad Ali Shah has said that there is ban on inter-provincial passenger transport but even then people from Sindh leave for Punjab and stuck up at the border.\n“The Punjab government, in consultation with Sindh government, has sealed its border for passenger transport, therefore they would not allow them enter Punjab. “I would like to advise you not to leave your home during these critical days,” he said.\nThe chief minister said that through home department he has issued directives to all the deputy commissioners not to allow inter-district passenger transport.",
  "retrievedAt": "2025-08-11T19:01:05.386Z"
}
