{
  "title": "36000 Afghan refugee families trapped in lockdown to get Rs 12000 each from UNHCR, says Shehryar Afridi",
  "link": "https://www.app.com.pk/national/36000-afghan-refugee-families-trapped-in-lockdown-to-get-rs-12000-each-from-unhcr-says-shehryar-afridi/",
  "date_published": "2020-05-01T21:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP):Minister for SAFRON and Narcotics Control Shehryar Khan Afridi Saturday said the UNHCR had decided to replicate the Ehsaas Programme of Pakistan under which 36000 Afghan refugee families trapped in lockdown would be provided Rs 12000 each.\nAddressing a gathering of Afghan refugees here after distributing food packages among 1500 families at Afghan Refugee Camp in I-12 sector, Afridi said in the second phase, UNHCR plans to give Rs 12,000 to each family.\nOn the occasion, Afridi said the ‘good news’ about peace process were coming from Afghanistan as Pakistan was facilitating peace talks to help bring peace in war torn-Afghanistan.\nHe said soon intra-Afghan peace talks could resume which would lay basis for peace and development of the region.\nHe said restoration of peace in Afghanistan would help dignified repatriation of Afghan Refugees to their own country.\nHe said Prime Minister Imran Khan was trying his maximum efforts to help out stranded Refugees.\n“Now it is up to the world nations and the UNHCR to immediately divert funds towards food supplies for the trapped refugees”.\nHe expressed his gratitude to the governments of China and Japan for allocating funds to the UNHCR. He said that China like a true friend had decided to provide food packages to Afghan refugees.\nAfridi said that Prime Minister Imran Khan had raised voice at international forums for helping out the Afghan refugees trapped in the lockdown.\nHe said despite intrigues and conspiracies, Pak, Afghan frienship would further strengthen, adding despite financial difficulties, Pakistan government would keep supporting the Afghan refugees.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:25.328Z"
}
