{
  "title": "PM launches web portal to support those rendered jobless due to COVID-19 pandemic",
  "link": "https://www.app.com.pk/national/pm-launches-web-portal-to-support-those-rendered-jobless-due-to-covid-19-pandemic/",
  "date_published": "2020-05-02T07:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP):Prime Minister Imran Khan Saturday formally launched a web portal to financially support those eligible individuals who have been rendered jobless due to COVID-19 pandemic.\nUnder this initiative, the disbursements from the PM COVID-19 Relief Fund will be made to those who have lost their jobs as a result of the COVID-19 crisis under the Ehsaas Emergency Cash.\nA web portal has been set up and applications are invited from those who fall in the categories mentioned in the drop menu of the application which can be accessed on https://ehsaaslabour.nadra.gov.pk/ehsaas/.\nSpeaking on the occasion, the prime minister said that the government was providing succor to the downtrodden and underprivileged classes through its flagship Ehsaas programme which was unprecedented in the country’s history.\nHe said so far under this programme, Rs83 billion had been distributed among 6.8 million families in three weeks.\nHe said under the second phase, those individuals would be supported who have lost jobs during the pandemic. Any person who was rendered jobless could visit the website, get himself registered, besides proving his job particulars.\nThe prime minister observed that they were aware that a number of people did not know how to proceed on the process, but they could seek help from the students whereas the Tiger Force could also prove as handy in this regard.\nThe registered people would be scrutinized and only qualified individuals would get the cash support under Ehsaas programme, he added.\nThe prime minister also assured donors that their donations for the PM COVID-19 Relief Fund would be judiciously distributed in a transparent manner.\nHe said that he would personally monitor the whole process and an audit of the whole amount would be conducted and shared with the nation.\nThe prime minister further said government would contribute four percent on every donated rupee in the relief fund so that maximum relief could be provided to the jobless people. It was an effort on short term basis.\n“The distribution will be made on merit and there would be no political interference. All deserving will get the support on merit irrespective of their political affiliations,” he added.\nThe government was also facing ordeals; he said and mentioned that tax collection saw a plunge of 35 per cent.\nFor arresting the financial impacts upon public after the coronavirus outbreak, he maintained, the government had slashed petroleum prices to provide further relief to the public.\nThe prime minister said the petroleum prices in Pakistan were currently the lowest ones when compared with the whole region particularly with India and Bangladesh.\nHe said in a span of one month, the government reduced price of petrol by Rs30 per liter, diesel Rs42 and kerosene Rs 45. The chief secretaries of all the provinces were directed to ensure reduction in the prices of different commodities in the wake of petroleum prices cut as announced by the government.\nThe prime minister also urged the nation to show discipline and prudence to face the challenge and stressed upon observance of the social distancing with all the precautionary measures.\nHe said nobody could predict how much this pathogen last, so the people should take extra care and practice self-discipline.\nHe also requested the people diagnosed with COVID-19 positive to go into quarantine into their homes with all the proper preventive measures as all the infected patients did not require to be taken to hospitals.\nThe prime minister also expressed his displeasure with treatment of infected people by the police force, and reiterated that in independent societies, these things did not take place.\nAbout latest coronavirus pandemic situation, he said that global efforts were being made to resume businesses and trade activities, even the hardest hit countries in the West with sound economies were opening different sectors as they had realized that continuing with the prolonged lockdown was causing negative impacts.\nThe prime minister said they had opened the construction industry to provide relief to the labour class and daily wagers. These incentives, which the government had announced for the industry had been unprecedented, he added.\nLater,PM’s special assistant on Poverty Alleviation and Social Protection Dr Sania Nishtar gave an overview of the support programme for the jobless. She said under the Ehsaas programme such individuals would be supported with cash.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:20.304Z"
}
