{
  "title": "Sindh government free to end or extend lockdown: Shibli Faraz",
  "link": "https://www.app.com.pk/national/sindh-government-free-to-end-or-extend-lockdown-shibli-faraz/",
  "date_published": "2020-05-02T05:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP):Federal Minister for Information and Broadcasting Senator Shibli Faraz on Saturday said the Sindh government was free to take any decision about ending or extending the lockdown in the province.\nPakistan Peoples Party Chairman Bilawal Bhutto and his party’s Sindh government, he said, should not blame the Federation for their own failures. Instead of political point scoring they should focus on controlling the coronavirus in the province, the minister said in a statement.\nShibli Faraz asked Bilawal Bhutto Zardari not to ruin the atmosphere of national unity and cohesion only to keep himself in politics.\nBilawal and his provincial ministers, he said, were holding long duration press conferences instead of working to stem the deadly virus. The opposition should support Prime Minister Imran Khan in the war against the coronavirus instead of doing petty politics.\nHe said they were not acknowledging the support given by the Federation to Sindh to control the pandemic. Over 45,000 Sindh industrial and 717,000 commercial consumers were given relief in electricity bills. Similarly, small business owners were also given the same facility in paying their bills. Moreover the people of Sindh, like other parts of the country, were benefited through the Utility Stores, Senator Shibli Faraz said.\nThe minister said the State Bank of Pakistan’s Deferred Scheme had facilitated in the repayment of loan installments, which would also benefit the people of Sindh.\nHe said a Rs 1.2 trillion support stimulus package would be given to all the provinces, including Sindh. Moreover small traders and business owners had been given a relief package to pay the salaries of their workers and under the Ehsaas Cash Emergency Programme, Rs. 27 billion had been distributed in Sindh so far.\nThe Sindh government, he said, had also been provided 504,447 face masks, 290,986 surgical masks, 30,142 N95 masks, 203,840 KN 95 masks and 148,334 protective suits by the Federation.\nThe equipment supplied by the Federal Government also included 77,992 testing kits, 200 thermal guns, 25,000 VTM and PCR machines, Senator Shibli Faraz said.\nThe federal government, he said, had also provided a large number of hand sanitizers, hand wash, soup chemical sprays, bio-hazard bags, safety boxes and body bags to the Sindh Government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:20.513Z"
}
