{
  "title": "Body formed to finalize Journalist Protection (Amendment) Bill: Marriyum",
  "link": "https://www.app.com.pk/national/body-formed-to-finalize-journalist-protection-amendment-bill-marriyum/",
  "date_published": "2022-07-01T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Friday that a special committee, comprising representatives from the ministries and media organizations concerned, had been formed to finalize the Journalist and Media Professionals Protection (Amendment) Bill 2022.\nShe informed the Pakistan Federal Union of Journalist’s (Dastoor) delegation, which was called on her, about the committee and its formation.\nThe delegation, led by its President Nawaz Raza, apprised the minister about the problems and professional issues faced by the journalists.\nShe said the draft of amendment bill had been received by the Information and Broadcasting Ministry on her special directives.\nRegarding the formation of the committee, the Minister said it comprised of representatives from different ministries including Information and Broadcasting, Human Rights, and Law and Justice.\nFederal Secretary Shahera Shahid was also made part of the body so that the journalists’ issues resolved at the earliest.\nShe said the amendment bill would be finalized after further consultation with the journalists and media organizations.\nMarriyum said Prime Minister Shehbaz Sharif, soon after coming into the power, initiated the process of abolishing all the anti-media laws and regulations.\n“It is foremost priority of the coalition government to protect journalists and ensure provision of conducive working environment for them,” she remarked.\nShe said restrictions on the media undermined the democracy. Freedom of media and expression was not a favour to anyone, but a basic right under the constitutional obligation.\nThe minister said respecting the media organizations and journalists was an essence of the democracy which eventually gave life to the politics.\nShe urged the media organizations and journalists to play a proactive role in curbing fake news and propaganda. The balance between media freedom and sense of responsibility could prevent growing division of the society.\nMarriyum said the collective responsibility was need of the hour to moderate public opinion by differentiating between hatred and difference of opinion.\nThe issues faced by the journalists would be resolved in light of the recommendations made by the media organizations, she maintained.",
  "retrievedAt": "2025-08-11T15:11:02.129Z"
}
