{
  "title": "‘Look Africa’ policy opens new avenues of cooperation: Sanjrani",
  "link": "https://www.app.com.pk/national/look-africa-policy-opens-new-avenues-of-cooperation-sanjrani/",
  "date_published": "2022-07-01T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP):Senate Chairman Muhammad Sadiq Sanjrani on Friday said Pakistan’s ‘Look Africa’ policy had been helpful in opening up new avenues of cooperation, enhanced connectivity and trade links.\nHe, on the sidelines of Non-Aligned Movement (NAM) Parliamentary Network conference in Azerbaijan, held meetings with delegates and parliamentary heads of different countries and exchanged views on the matters of mutual interests.\nTalking to the delegates, he said global dynamics of inter-state relations and cooperation had changed, and called for diversified bilateral and multilateral cooperation.\nHe said Pakistan was keen to further deepen ties with African countries. “Trade and investment opportunities can be explored through frequent exchanges in business sectors,” he observed.\nHe enticed African investors to explore investment opportunities in collaboration with their Pakistani counterparts.\nThe Senate chairman underpinned the significance of parliamentary cooperation, adding that parliamentary friendship groups could help in building synergy required to create a common ground for smooth working and develop an understanding for mutual benefit.\nHe highlighted the significance of such conferences and underlined Pakistan’s desire for peace and development in the region and beyond and urged the parliaments to play role in that regard.\n“We must utilize parliamentary diplomacy as a tool to promote regional peace, and harmony and make collective efforts to resolve issues hampering development”, he emphasized.\nThe Senate chairman underscored that parliamentary cooperation and institutionalized collaboration could help promote people-to-people contacts.\nThe parliamentary leaders from different African countries while appreciating Senate chairman’s remarks said Pakistan was an important country for them and in the region.\nThey underscored the need for more institutional collaboration and also acknowledged Pakistan’s stance presented by Senate chairman during the conference on NAM Parliamentary Network.\nSpeaker of Algeria, Brahim Boughali, Deputy Speaker of Gambia, Seedy Njie and Deputy Speaker of Libya, Fouzi Salim were the prominent leaders who held sideline meetings with Senate chairman in Azerbaijan.",
  "retrievedAt": "2025-08-11T15:11:03.283Z"
}
