{
  "title": "Three rescued squirrel kits get rehabilitation",
  "link": "https://www.app.com.pk/national/three-rescued-squirrel-kits-get-rehabilitation/",
  "date_published": "2022-07-01T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP):The Margalla Hills National Park (MHNP) during the hottest dry spell faced unprecedented number of forest fires in the capital that damaged the thriving biodiversity and wildlife of the national park.\nA pack of three northern palm squirrel kittens were found by the rangers of the Islamabad Wildlife Management Board (IWMB) who were only 15-16 days old that have been rehabilitated by the former Secretary of the Board to be released soon in the forest. It was assumed by the Board staff that they might not survive due to their vulnerable young stage after the demise of their mother in the forest inferno.\nThe kittens of northern palm squirrel were born blind and rely on their mother’s feed to survive for around two or three months, said the University of Michigan’s Animal Diversity Web.\n“A female carries her young for a gestation period of 29 to 65 days, depending on the size of the species; smaller squirrels have shorter gestation periods. Mothers give birth to two to eight offspring at one time,” the department said.\nAfter seven to eight weeks, the young are accustomed to feed on other food than their mother’s feed. “When the kits leave the nest, they don’t travel farther than 2 miles from home. Some species of squirrel bear new offspring every few months or as little as twice per year,” said the Massachusetts Department of Wildlife and Fisheries.\nFormer Secretary Abdul Hye Agha told APP that the IWMB staff during the post forest fire patrolling found the squirrel kittens.\nAfter taking congnisance of the issue that the IWMB staff told him that due to the very young and intricate stage of the young squirrels it was not an easy task to nurture them, he volunteered to look after the kits that were unable to be tackled at home during such an early stage.\n“The IWMB officials termed it an uphill task but I thought it can be taken up as nothing is impossible. I took all the squirrel kits from the Board office and brought them to my home,” he added.\nHe started feeding milk to the kittens after every two and a half hours on the first two days of their arrival at the weekend.\nIn the early days, it was very difficult to feed them after every two hours as even at night while sleeping he had to wake up to nourish the kits, the ex-Secretary IWMB said. Agha said, “I have been feeding them 12 times in 24 hours a day and after a month I used to feed them after every three hours.\nDuring my office timings, I used to carry them with me in a cage and manage their feeding after every two hours.”\nHe added that the process of looking after the squirrel kittens was really a meticulous and arduous job as it left him unable to leave home and go to attend any activity outdoors.\n“My family used to attend dinners outside him and I would refrain to go and looked after these kittens.\nMy family members once said to me that I was paying more attention to them than my kids. I said these kittens have no parents to care for them but my kids have their parents that are why I am helping them out,” he said passionately while sharing his vision behind protecting wildlife species.\nTo a question, he said the squirrel kits had become over three months old and mature enough to be released in the wild.\n“I have found a place in the old Islamabad Zoo which is connected to the forest area and has a colony of squirrels which will serve as a suitable habitat for them. I will release them in a week or so,” he concluded.",
  "retrievedAt": "2025-08-11T15:11:04.442Z"
}
