{
  "title": "Nation must remain united to foil enemies negative plans: Shafqat",
  "link": "https://www.app.com.pk/national/nation-must-remain-united-to-foil-enemies-negative-plans-shafqat/",
  "date_published": "2020-12-17T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): Minister for Federal Education and Professional Training Shafqat Mehmood has said that nation must remain united to foil the negative plans of the enemies of the country.\nHe also called for uniformity in our educational system as it is a dire need in current era.\nThe minister was addressing a national seminar titled “Hum Pakistani” organized by Islamic Research Institute (IRI) of International Islamic University Islamabad (IIUI) at the Faisal Masjid Campus, a press release said on Thursday.\nHe said Pakistanis are proud of armed forces as they have always offered sacrifices of lives for the protection of motherland.\nHe said Islamic scholars have a pivotal role in countering sectarianism and extremism and building a society.\nHe also stressed upon the important role of Ulema in peace building in light of “Paigham e Pakistan”. Shafqat Mahmood said the Ministry of Education is striving to formulate a uniform curriculum for all social classes for bringing unity among the society.\nHe furthered that nation is in urgent need of research culture to compete the world.\nDr Masoom Yasinzai, Rector IIUI while addressing the seminar said that Ulema are our main source to promote peace in society that can be possible only when we acknowledge differences of opinion with an attitude of openness and respect. He opined that we must let everyone express one’s thoughts.\nDr Hatal bin Hamood Alotaibi, President, IIUI also the event. He elaborated role of IIUI in peace building. He vowed that the IIUI will be among leading ranks for the promoting peace and harmony.\nDr Zia ul haq, Director General IRI, spoke about the objectives and importance of the conference. He also briefly elaborated future goals of IRI and Paigham e Pakistan forum for inclusive society.\nDr Asma shakir Head Department of Strategic studies National Defense University (NDU), Dr Maria Sultan, chairperson and President South Asian strategic stability institute (SASSI) and Dr Khurram Iqbal, Head of Department IR at National Defense University also addressed the event. It was also attended by IIUI Vice President, faculty members and other high officials of the university.",
  "retrievedAt": "2025-08-11T20:09:07.927Z"
}
