{
  "title": "SBP defers Rs 657.8 bn under refinancing scheme during COVID-19",
  "link": "https://www.app.com.pk/national/sbp-defers-rs-657-8-bn-under-refinancing-scheme-during-covid-19/",
  "date_published": "2020-12-17T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): The State Bank of Pakistan (SBP), under its refinancing scheme for protecting businesses from the impact of COVID-19, has so far deferred Rs. 657.3 billion principal repayments of loans up to one year.\nThe bank also allowed restructuring or rescheduling of around Rs. 238.236 billion so far, according to the updated data of the central bank.\nThe number of borrowers that would benefit from this rescheduling relief has risen to 1,612,848 with outstanding amount of Rs 2.518 billion, it said.\nUnder its Rozgar scheme for protecting businesses and employees working with them from the impact of COVID-19, the central bank has so far approved Rs 238.2 billion for 2,958 businesses.\nMeanwhile, the bank under this refinancing scheme for hospitals to combat Covid-19, approved financing of Rs7.77 billion for 39 hospitals so far.\nAs many as 45 hospitals had requested for the financing amounting to Rs13.23 billion.\nWith respect to progress on refinance scheme for setting up new projects or expansion, the central bank approved 294 projects with an amount of Rs 222.76 billion for which it received requests for 499 projects with amount of Rs 517.4 billion.\nFurthermore, from March 20, 2020 to December 11, the Bank had issued fresh currency notes to the commercial banks worth of Rs 1.194 trillion.\nSimilarly an amount of Rs 35.6 billion was quarantined during the period that was received from hospitals, clinics, and pharmacies.\nWhile overall the bank received cash worth of Rs 1.13 trillion which was quarantined for 14 days.\nIt is pertinent to mention here that in order to combat the impact of COVID-19 and to help the businesses in payment of wages and salaries to their workers and employees and thereby support continued employment in this challenging environment, State Bank of Pakistan (SBP) has introduced a temporary refinance scheme for payment of wages and salaries to the workers and employees of the business concerns.\nThis Scheme was aimed to ease cash flow constraints of the employers and thereby avoid layoffs. In addition, the SBP had expanded the scope of existing refinancing facilities and introduced a scheme to support hospitals and medical centers to purchase equipment to detect, contain, and treat COVID-19 besides, stimulating investment in new manufacturing plants and machinery, as well as modernization and expansion of existing projects.",
  "retrievedAt": "2025-08-11T20:09:17.346Z"
}
