{
  "title": "Sania opens digitally enabled Ehsaas survey in Sialkot",
  "link": "https://www.app.com.pk/national/sania-opens-digitally-enabled-ehsaas-survey-in-sialkot/",
  "date_published": "2020-12-17T12:01:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Dec 17 (APP): Special Assistant to Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar inaugurated the digitally enabled Ehsaas survey, here on Thursday.\nThe exercise has already been carried out effectively in Khyber-Pakhtunkhwa (KP) and other areas of the country and is now being replicated in Sialkot as well. The new model is principally centered on the fast-track approach to implement the survey across Sialkot, in collaboration with the School Education Department Punjab under the technical supervision of Ehsaas.\nThe new survey is being conducted in all areas of Sialkot. Through computer assisted approach, the socioeconomic data would be collected at the household level, which would facilitate the precise identification of deserving households.\nFor the purpose, around 3,500 teachers have been engaged through the education department.\nEasing out the survey listing and enumeration process, as many as 3,200 enumerators along with 320 supervisors are being deployed to execute the survey in 3,200 survey blocks district-wise.\nTo conduct the survey with accelerated momentum, the technical training of teachers as master trainers has just begun, in collaboration with the provincial government.\nEhsaas master trainers are providing technical training to teachers on the methodology of socioeconomic survey. As soon as the training is concluded, the field teams will go door to door to digitally collect poverty data in all tehsils of Sialkot including Pasrur, Daska and Sambrial.\nAn android-based tablet application has been utilised to gather the data. The data collected from the households will be submitted to central database through digital system for monitoring and review.\nIn line with the inclusive social protection policy of Ehsaas, results will facilitate proper targeting of poor households for the multitude of Ehsaas initiatives particularly the new Ehsaas Kafalat beneficiaries and households of deserving special persons, widows, orphans and labourers.\nWhile in Sialkot, Dr Sania also held an interactive briefing with the media to brief them on the progress and constraints with regard to the ongoing national Ehsaas survey. “The phase-wise survey continues in various districts across the country to enroll deserving households in Ehsaas. The entire survey process is expected to be completed before June 2021 across the country,” said Dr Sania.\n“Under the Ehsaas framework, the apolitical survey is committed to safeguarding utmost transparency because its findings would cater to changing socioeconomic conditions of the vulnerable populations in the post-COVID-19 Pakistan,” she added.\nShe said that the opening of registration desks for self-enrollment of left out households was also discussed. Once the survey nears completion in Sialkot, Ehsaas registration desks will be mobilised at tehsil level to facilitate registration of deserving households.\nAbout the survey, Dr Sania said, “Data collection is a very sensitive responsibility, local enumerators should perform it with full obligation.”\nShe also advised public to cooperate with the survey teams and share factually true data when the survey teams visit them. Also, she urged the provincial government and district administration to facilitate the execution of the Ehsaas survey in Sialkot.\nFollowing the media briefing, Dr Sania visited a local household in Sialkot tehsil to oversee the digital enrollment of the family through survey.\nShe also reviewed integrity measures in the computer assisted survey process that have been put in place to ensure transparency.\nDuring the survey demonstration, she also interacted with the surveyed household and the survey team to take their on-spot feedback about the data collection process.",
  "retrievedAt": "2025-08-11T20:09:13.962Z"
}
