{
  "title": "Pakistan, Sri Lanka hold 6th round of Bilateral Political Consultations",
  "link": "https://www.app.com.pk/national/pakistan-sri-lanka-hold-6th-round-of-bilateral-political-consultations/",
  "date_published": "2020-12-17T18:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): The 6th round of Foreign Secretary level Bilateral Political Consultations (BPC) between Pakistan and Sri Lanka was held virtually on Thursday, focusing on cooperation in economy, defence and investment.\nForeign Secretary Sohail Mahmood led the Pakistan side; the Sri Lankan delegation was headed by Foreign Secretary Admiral (Prof.) Jayanath Colombage.\nDuring the BPC, the two sides discussed the whole gamut of bilateral relations, including cooperation in the political, economic, defence, trade and investment, culture and education fields as well as people-to-people exchanges.\nEver since the establishment of diplomatic relations in 1948, Pakistan and Sri Lanka have enjoyed cordial relations based on trust, mutual respect and close cooperation.\nForeign Secretary Sohail Mahmood underscored the exceptional quality of bilateral political relations and rapport at the leadership level.\nHe underlined that the bilateral trade and economic ties must also be made commensurate with excellent political relations.\nThere was convergence on both sides for strengthening existing mechanisms of cooperation and exploring new avenues of bilateral collaboration.\nExchange of views also covered the impact of COVID-19 at the national and global level and the measures to mitigate the effects of the pandemic on the lives and livelihoods of the people.\nThe Foreign Secretary briefed the Sri Lankan counterpart about Prime Minister Imran Khan’s ‘Global Initiative on Debt Relief’ for the developing countries.\nThe Foreign Secretary shared Pakistan’s perspective on the situation in IIOJK, progress of CPEC, and Pakistan’s positive contribution to the Afghan peace process.\nHe also reaffirmed Pakistan’s commitment to SAARC and expressed the hope that the process of regional cooperation would be allowed to move forward.",
  "retrievedAt": "2025-08-11T20:09:07.905Z"
}
