{
  "title": "Balochistan government trying to hold PSL matches to promote sports: CM",
  "link": "https://www.app.com.pk/national/balochistan-government-trying-to-hold-psl-matches-to-promote-sports-cm/",
  "date_published": "2021-02-22T14:06:00.000Z",
  "source": "APP",
  "content": "QUETTA, Feb 22 (APP): Balochistan Chief Minister Mir Jam Kamal on Monday said incumbent provincial government was striving to promote sports and especially cricket, which was not considered before as sports in the province.\nHe expressed these views here while talking to media along with former national cricket team captain of Pakistan, Inzamam-ul Haq.\nThe CM also thanked ex, national cricketer captain Inzamam-ul Haq for visiting Quetta to encourage the local players which was positive sign for Balochistan sports.\nCM said we were trying to make players from Balochistan part of the national team in the coming days which was ignored in past regime saying that exemplary measures were being taken for advancement Gwadar and Ayub Stadiums which are better examples of this regard despite Corona virus has badly affected many sections.\n“Incumbent provincial regime is striving to hold Pakistan Supper League (PSL) in Gwadar so that sports activities would be improved in the province”, he said.\nChief Minister Jam Kamal said that we should wait for the result of everything adding that there should be an active government in Balochistan.\nThe CM described that this time you would see that the youth of Balochistan could play in Quetta team adding that Gwadar is becoming the biggest port of Pakistan and in the future which would create opportunities.\nJam Kamal said that we have overcome the weaknesses of the past saying that Quetta Gladiator is my favorite team in PSL.\nInzamam-ul-Haq wished that Quetta Gladiator would win the PSL, despite he declared Multan and Lahore as favorite teams in the PSL.\nInzamam said Chief Minister Jam Kamal Khan is working hard for sports and cricket in Balochistan saying that in the next two years, there would be positive effects on the sports activities.",
  "retrievedAt": "2025-08-11T20:23:42.384Z"
}
