{
  "title": "World political parties laud poverty alleviation, ethnic solidarity in Xinjiang",
  "link": "https://www.app.com.pk/national/world-political-parties-laud-poverty-alleviation-ethnic-solidarity-in-xinjiang/",
  "date_published": "2021-02-22T16:32:00.000Z",
  "source": "APP",
  "content": "BEIJING, Feb 22 (APP): Major politicians from across the world lauded efforts made by the strong leadership of the CPC in poverty alleviation and ethnic solidarity in Northwest China’s Xinjiang Uygur autonomous region.\nThey were speaking via video link at the thematic briefing on Xinjiang co-hosted by the International Department of the CPC Central Committee (IDCPC) and the CPC Xinjiang Uygur Autonomous Regional Committee and held in Urumqi on Monday.\nDeputy Speaker, National Assembly Qasim Khan Suri, Secretary of the Kurdistan Communist Party of Iraq, Kawa Mahmoud, Chairman of the Patriotic Party of Turkey, Dogu Perincek, Tonga’s Speaker of Parliament Lord Fakafanua, Member of Central Standing Committee of Cambodian People’s Party and 2nd Vice President of the Senate, Tep Ngorn and Zulkifli Hasan, leader of Indonesia’s PAN party, Zulkifli Hasan were the main speakers.\nThe leaders opined that it was the common goal and responsibility of political parties of all countries to work towards a better life for the overwhelming majority of the people.\nThey noted that COVID-19 had hit over 200 countries and regions, affected more than seven billion people around the world and claimed over two million lives and called for continuous efforts to ensure deploying medical expertise and critical supplies.\nThe leaders stressed that COVID-19 had plunged over 200 million people globally into extreme poverty and inflicted serious impact on the economic and social development of most countries, casting a dark shadow on the prospects of the United Nations 2030 Agenda for Sustainable Development.\nThey said that all the countries should take measures to boost the flow of trade, so that the world economy could soon recover and grow, which would help bring global poverty reduction back on the right track as speedily as possible.\nChen Quanguo, Xinjiang Party chief attended the briefing and outlined the real lives of people in Xinjiang with stories, data and facts.\nHe also strongly refuted the allegations and claims of forced labor and genocide on Uygurs in Xinjiang.\nHe informed the audience that from 2010-2018, the Uygur population in Xinjiang grew by 2.5 million, or 25.04%, percent, which is higher than Xinjiang’s overall population growth rate (13.99%), percent), ethnic minority population growth rate (22.14%) percent) and Han population growth rate (2%), percent).\nThis is the second time that the Xinjiang regional government has held a thematic briefing on the stories of the Communist Party of China. It was also the first of such briefing in the region to mark the 100th anniversary of the founding of the CPC.\nThe briefing was also held a week ahead of the country’s important political events – the two sessions and at the start of the 46th session of the United Nations Human Rights Council.\nChinese officials said the briefing, held at the beginning of the year marking the 100th anniversary of the founding of the CPC and the first year for implementing the country’s 14th Five-Year Plan (2021-25), demonstrates the openness and confidence of Xinjiang.\nOver 300 international participants representing nearly 200 political parties, international institutions, civil society organizations, media outlets and think tanks from dozens of countries attended the meeting via video link.",
  "retrievedAt": "2025-08-11T20:23:38.211Z"
}
