{
  "title": "FBR confident of raising tax-to-GDP ratio despite shortfall - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Despite concerns that FBR’s tax collection may fall short of the Rs12.97 trillion target for the current fiscal year, the top tax authority remains hopeful of achieving the goal of raising the tax-to-GDP ratio to 10.6 per cent as outlined in the ongoing IMF programme.\n\nThe tax-to-GDP ratio was recorded at around 9.6pc and 10.8pc in the first and second quarters, respectively. FBR officials anticipate the ratio will remain slightly below 10.6pc in the third quarter but exceed 11pc in the fourth quarter.\n\n“Overall, we believe that we will achieve the targeted tax-to-GDP ratio for the whole year,” a senior FBR official told Dawn.\n\nUnder the IMF agreement, the government is committed to raising the tax-to-GDP ratio by at least 3pc to 13-13.3pc over the 37-month duration of the funding programme. This ratio, which indicates how efficiently a government mobilises economic resources through taxation, is projected to be 8.77pc in FY24, down from 9.22pc in FY22.\n\nTax analysts warn govt may miss collection target by Rs1tr\n\nThe FBR anticipates a collection gap of nearly half a trillion rupees in an overly ambitious revenue target of Rs12.97tr, which requires a hefty 40pc increase from the last fiscal’s actual collection of Rs9.6tr. The top tax collecting agency is already facing a shortfall of Rs468bn in the revenue collection target for the seven-month period between July and January in spite of almost 26pc growth to Rs6.49tr from Rs5.143tr raked up during the same period the previous year.\n\nBased on the current situation, some tax analysts fear that the government could miss the target by almost a trillion rupees. The shortfall is largely attributed to reduced tax collection from imports, sluggish large-scale manufacturing growth and unexpected sharp drop in inflation to single digits in recent months.\n\nThe government expected an additional Rs3.66tr revenue from autonomous growth, enforcement actions and additional policy measures. “The kind of growth in taxes being targeted had built in autonomous growth of Rs1.86tr in revenues based on 3pc GDP expansion, 3.5pc real LSM growth, inflation rate of 12.9pc and an increase of nearly 17pc in imports,” noted the FBR official.\n\nThe rest of the tax revenue growth was expected from additional policy measures or new taxes and upward revision in tax rates and slabs (R1.34tr), and improved enforcement (Rs451bn). The FBR also aims to cover at least half of the estimated tax gap of Rs7.1tr (Rs3.4tr in sales tax, Rs2tr in income tax, and Rs1.2tr related to autonomous growth), up from last year’s Rs5.9tr, through better enforcement and use of technology.\n\nThe official was confident that the IMF would not mind the collection gap because “they are aware of the economic factors responsible for the anticipated shortfall in the tax target”. “The only way of filling this gap is to introduce new policy actions — additional taxation measures — which the prime minister has already rejected,” he argued.\n\nThe FBR has already prepared a Tax Transformation Plan aimed at broadening the tax net, scrapping the category of ‘non-filers’, and improving compliance and enforcement through fresh punitive measures to boost the tax-to-GDP ratio.\n\nFBR officials insisted the ratio could be increased to 18pc in a few years through reforms proposed in the plan. According to the FBR, the inflation-adjusted tax collection in years has increased by just 0.3pc between 2018 and 2024 despite a significant increase in the minimum tax rates.\n\nThe Shehbaz Sharif government recently introduced the Tax Laws Amendment Bill in parliament to implement the FBR’s plan, aiming to enforce broad spending restrictions on both taxpayers and evaders to boost compliance. The bill also seeks to penalise tax evasion and under-reporting while outlining several enforcement measures to strengthen compliance.\n\nThe FBR transformation plan, which introduces the new terms of ‘eligible’ and ‘ineligible’ persons depending on their status as tax filers and non-filers, suggests stringent curbs on the purchase of real estate and cars, maintaining bank accounts, investing in stocks, etc. It also bars the taxpayers from spending on property and car purchases by more than 30pc above their declared assets, including cash, in their wealth statements.\n\nThe FBR officials suspected that the punitive provisions related to property and car purchases in the proposed law could be struck down by parliament. “From discussions on the new legislation, we feel that the parliamentarians believe that these provisions, especially the curbs on real estate purchases, could be disruptive for the economy and should be implemented in phases. So these measures might be delayed for a few months,” they said.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:36:03.171Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891531/fbr-confident-of-raising-tax-to-gdp-ratio-despite-shortfall",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T01:35:19.000Z"
}
