{
  "title": "PTI’s losing gambit - Newspaper - DAWN.COM",
  "author": null,
  "content": "WHEN a political party decides that actively causing damage to the economy will somehow advance its interests, it needs to be urged to undertake a rethink. Such a strategy is most perfectly described by the saying about burning a country down in order to ‘rule over the ashes’.\n\nThe PTI has adopted this strategy. Back in August 2022, we saw them try to scuttle an IMF programme at a critical juncture. The country was precariously perched on the very edge of default in those days, with the energy supply chain nearing breaking point as the foreign exchange reserves had plummeted to a level that could not finance even one month’s worth of import.\n\nA few weeks more and the beginnings of total shutdown of our society’s vital functions would have commenced. A country the size of Pakistan should never allow itself to come this close to the edge of catastrophe.\n\nBut there we were. And right when all the gruelling decisions that were required in order to win a rescue package from the IMF had finally been made and the Executive Board was ready to consider Pakistan’s case, the PTI made an attempt to scuttle the whole thing by having the then finance minister of KP, Taimur Jhagra, write a letter directly to the IMF’s resident representative in Pakistan announcing his province would not be abiding by a commitment to keep its provincial surplus within the limits stipulated by the Fund programme.\n\nThe attempt proved futile. The Fund recognised it for what it was and ignored Jhagra’s letter. But the intention had been revealed. The party was willing to use its leverage in the negotiations with the Fund programme to advance its political aims, even if doing so meant possibly pushing the entire country into a potentially catastrophic default.\n\nA country the size of Pakistan should never allow itself to come this close to the edge of catastrophe.\n\nHowever, that gambit produced a powerful reaction, not only from the government (which booked former federal finance minister Shaukat Tarin in a sedition case over his alleged involvement in instigating the whole affair) but from the general public as well. Nobody wanted to see the country burn, no matter how strong the grievance prompting the actions.\n\nThe party learned a lesson from that affair and since then has not withheld any required cooperation from the KP government for the purposes of the Fund programme. But today, they are trying something else, which is even more futile, and just as craven in its purpose. They have been urging overseas Pakistanis to not send remittances to the country, for example. Khan has been calling for such a boycott since early December, terming it as a ‘civil disobedience’ campaign of some sort. He has repeated the call numerous times since then, most recently a few days ago.\n\nIn addition, officials from the party have tried to scuttle the GSP-Plus status Pakistan worked so hard to get from the European Union back in 2014. And most recently, the party has written to the visiting IMF delegation evaluating the quality of the country’s governance under a monitoring regime separate from the ongoing programme.\n\nLet’s start with this. The party has every right to call for a boycott of remittances. It also has every right to furnish its point of view to visiting IMF and EU delegations that are here to conduct a careful evaluation of the state of governance and human rights in the country. These actions do not amount to a grievous lapse of judgement that the letter of August 2022 was, since they don’t involve using governmental powers the party is entrusted with by the electorate to harm the state.\n\nBut here, the charitable view on the party’s politics ends. In calling for a boycott of remittances, for example, the party quotes Khan as saying people should not send their money “to the regime” while human rights are being violated and questions about the veracity of the 2024 election have not been answered.\n\nHowever, literally nobody sends remittances to ‘the regime’. They send remittances to their families so the latter can pay their bills. This is one reason why despite repeated calls by the party and from Khan directly, remittances only increased in the month of January (year-on-year). Asking people to stop these is a little like asking them to not pay their utility bills, something Khan urged people to do back in the days of the dharna. That call failed, too.\n\nLikewise, the IMF is not here to evaluate the state of the government’s legitimacy or the quantum of repression unleashed by the government. Those hoping that the Fund delegation’s visit with the chief justice has something to do with the state of domestic politics are in for another disappointment, much like the one that the remittance data from January brought. The Fund’s own Executive Board decided back in 2018 to expand monitoring of governance frameworks of member countries, but added that this would only be to the extent of its impact on macroeconomic stability.\n\nIn assessing the state of rule of law, for example, the board said the analysis should focus on “those aspects that are critical to economic performance” and laid special emphasis on “the protection of property and contractual rights”. In assessing corruption and governance overall, the board said the focus should be on determining whether any vulnerabilities are “sufficiently severe to significantly affect prospective or present balance-of-payments and domestic stability”.\n\nThe Fund will note that the balance-of-payments is improving, and domestic stability is returning. With these observations, the PTI’s wish that their grievances should be factored into the IMF’s assessment will be dashed again, much like the hopes that writing that letter would cause the Fund to pull away from Pakistan. The party needs to realise that it is pursuing a losing strategy, and that lurching from one vain hope of foreign intervention on their behalf to another is not going to get their leader out of jail, much less their people back in power.\n\nThe writer is a business and economy journalist.\n\nkhurram.husain@gmail.com\n\nX: @khurramhusain\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad5fca09701.jpg",
  "retrievedAt": "2025-08-25T19:35:28.836Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891604",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:00:07.000Z"
}
