{
  "title": "Trump’s folly - Newspaper - DAWN.COM",
  "author": null,
  "content": "DONALD Trump has reiterated his horrifying plan to take over Gaza and permanently displace its Palestinian residents. In a meeting with Jordan’s King Abdullah II at the White House, the US president signalled his intent to push ahead with the scheme despite global condemnation.\n\n“We’re going to take it. We’re going to hold it, we’re going to cherish it,” Mr Trump declared, making it abundantly clear that he views Gaza not as the homeland of 2.2m Palestinians, but as a piece of real estate to be seized and repurposed.\n\nThis latest pronouncement only reinforces the fears of those who see the plan as a blueprint for ethnic cleansing. The proposed mass displacement of Gazans amounts to a grave violation of international law.\n\nThat Benjamin Netanyahu supports this scheme should surprise no one: the Israeli PM has already made clear his vision for a ‘Greater Israel’, which would see Palestinian territories effectively erased. His map of a ‘New Middle East’, proudly displayed at the UN last year confirms his expansionist ambitions.\n\nThe reaction from the Arab world has been swift. King Abdullah, facing immense US pressure, has refused to endorse the plan. Egypt has rejected any moves that would force Palestinians onto its soil, while Saudi Arabia has called the proposal an “unacceptable violation of Palestinian rights”.\n\nThe Arab League, too, has opposed Mr Trump’s reckless vision. Yet, despite this overwhelming backlash, the Israeli PM and US president remain undeterred. Mr Netanyahu has termed the plan “remarkable”, while Mr Trump has threatened to cut aid to Jordan if it refuses to absorb Palestinian refugees. Washington’s coercive tactics to strong-arm its allies into supporting an apartheid-like restructuring of the region betray its moral bankruptcy.\n\nMr Trump’s plan will not bring peace; it will bring further devastation, radicalism, and instability. The mass expulsion of Palestinians will not end the conflict — it will ensure its perpetual escalation.\n\nThis latest move by the Trump administration also threatens the fragile ceasefire in Gaza, as Palestinian groups see it as yet another attempt to erase their presence from their land. Hamas, for example, has already warned that it will not resume hostage releases under the current conditions.\n\nWith tensions already at a breaking point, the dangerous Trump scheme has only deepened uncertainty and turmoil in the region.\n\nThe Trump-Netanyahu scheme is not just infeasible — it is a moral abomination. The international community must not only reject it outright but also ensure that those who promote such inhumanity are held accountable. The world cannot afford to stand by as such blatant violations of human rights unfold. This is Palestinian land. It is not for sale, and its people will not be erased.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:35.497Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891596/trumps-folly",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:52:43.000Z"
}
