{
  "title": "Power regulator notifies Rs1.23 per unit refund - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Elec­tric Power Regulatory Authority (Nepra) on Wednesday notified a Rs1.23 per unit negative fuel cost adjustment (FCA) for the consumers of both ex-Wapda distribution companies (Discos) and K-Electric in the current month’s bills.\n\nThe negative FCA for Discos was on account of electricity consumed in December, while it was against consumption in November in the case of K-Electric.\n\nNepra’s Member Tariff Mathar Niaz Rana protested over Rs1.23 per unit negative FCA for KE consumers, saying the KE had proposed about Rs4.98 per unit negative FCA with a refundable amount of Rs7.18bn. Nepra worked out a negative FCA of slightly over Rs5 per unit or Rs7.22bn refund, which should have been passed on to the consumers who had long expected this relief. Member Technical Rafi­que A. Shaikh also supported this.\n\nNepra, however, decided with a ma­­­­­jority vote to pass on only Rs1.23 per unit benefit to KE consumers. It said KE had also sought previous claims of Rs8.7bn on account of part loan, open cycle, start-up costs and degradation curves under the multi-year tariff for July 2023 to June 2024. In order not to overburden the cons­u­­mers at a later stage, Nepra de­­cid­­ed retention of Rs5.444bn, from the negative FCA for November use.\n\nGrills Discos for seeking up to 2,600pc hike in security deposit\n\nMeanwhile, the regulator also co­­m­­pleted a public hearing for Rs53bn refund to consumers for 2nd quarter (September-December 2024) of current fiscal year, mainly because of three factors. These included Rs18bn on account of debt reprofiling of Karachi Nuclear Power Plants (K2 and K3), Rs18bn non-payment of capacity payment to Neelum-Jhelum Hydropower Project due to its closure and Rs12bn on account of termination of contracts with old IPPs.\n\nSecurity deposit\n\nMeanwhile, Discos had faced stiff opposition from various consumer groups and criticism from Nepra for seeking steep increase in the security deposit amount from consumers that in some cases went beyond 2600pc.\n\nAt a public hearing on Tuesday, it was reported that eight out of nine Discos (for which data was shared) were holding more than Rs77bn consumers’ security deposit as of January 2025 and earned around Rs13bn in interest on that amount.\n\nThe Nepra members — Rafique A Shaikh, Mathar Niaz Rana, Maq­so­­od Anwar and Amina Ahmed — grilled Discos over their request increase in security deposit and announced that it would conduct audit of the existing security fee deposited by consumers to power companies.\n\nThis does not include K-Electric and Sukkur Electric Power Company (Sepco) who have not filed petitions for increase in security deposit so far but are understood to follow suit given uniform tariff and consumer service manual and other rules and regulations. Interestingly, the Nepra members raising questions over the rationale of the move and potential negative impact on electricity demand also asked KE and Sepco to file their petitions for uniformity.\n\nKarachi-based industrialists war­n­ed that they would prefer quitting supply from power companies and shi­ft to alternate sources, chiefly int­e­rnal solar systems, rather than paying Rs250-300m more for security deposit.\n\nIrfan Butt, who presented the Discos’ agreed that higher security deposit had the potential to push consumer out of the grid and curb demand.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad6059a3b18.jpg",
  "retrievedAt": "2025-08-25T19:35:39.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891608/power-regulator-notifies-rs123-per-unit-refund",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:14:58.000Z"
}
