{
  "title": "Woman critically burnt by female ‘faith healer’ in Sargodha - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: A sick woman suffered critical burns allegedly at the hands of a fake female faith healer and her father, who set her ablaze to “rid her of an evil spell” in Mohammadi Colony area of the city.\n\nAs per local sources, Hajra Bibi, wife of Muhammad Din, a resident of Muhammadi Colony, had been sick for a long time despite continuous medical treatment.\n\nMuhammad Din, who was desperate to get his wife cured, contacted a woman, Humaira, whose father Azizur Rehman claimed she was a faith healer.\n\nDin requested the father-daughter duo to “treat” his wife and they visited his house.\n\nOn seeing Hajra, the woman and her father told Din that his wife was under an “evil spell and needed spiritual treatment”. Din allowed them to go ahead with the “treatment”.\n\nOn Wednesday, the father and daughter visited Din’s house where they allegedly dowsed her with petrol and set her on fire to “cure her of evil spell”.\n\nHowever, as per application filed by Din to police, Azizur Rehman gave a bottle of petrol to his daughter Humaira who sprinkled petrol on his wife and set her a blaze.\n\nWhen Hajra started crying, her husband and other family members, along with some other locals, rushed to rescue the woman who had suffered critical burns.\n\nMeanwhile, both father and daughter manged to escape. Hajra was shifted to the district headquarters hospital, where doctors said that she suffered 70 per cent burns.\n\nOn being informed of the incident a team from Urban Area police station reached the hospital and quizzed Muhammad Din about the matter.\n\nHowever, Hajra, in a video statement posted on social media, said that instead of “harassing” her family the police should nab the woman and her father who caused her harm.\n\nShe alleged that in the name of healing her, the father dowsed her in petrol and the daughter set her on fire with a matchstick.\n\nActing on Hajra’s statement, the police claimed to have registered a case against both suspects and started investigations.\n\nPolice are conducting raids to arrest the suspects.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:43.932Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891556/woman-critically-burnt-by-female-faith-healer-in-sargodha",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:53:54.000Z"
}
