{
  "title": "Father, two sons among five killed in Attock - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: At least five people, including an expatriate from Hong Kong and his two sons, were killed while two others were injured critically in separate incidents in Attock district on Wednesday, police and hospital sources said.\n\nIn the first incident, an expatriate and his two sons were gunned down over a land feud in the Mallah village within the limits of the Rangoo police in the Hazro town of Attock.\n\nThe police, while quoting family sources, said the victim was reportedly working in his field with his two sons when the suspect along with his uncle reached the spot and pulled out a gun after a heated exchange of arguments.\n\nThey allegedly opened fire on the victims, killing them on the spot. They were identified as Haji Mohammad Ilyas, his son Junaid Khan and Bukhtair Khan. The police said the assailants managed to escape from the scene.\n\nMeanwhile, a woman was allegedly killed and her husband sustained critical injuries when their car collided with another one on the G.T. Road near a toll plaza in the limits of the Attock Khurd police station.\n\nThe injured and the deceased were shifted to the Hazro Tehsil Headquarters Hospital where the condition of the injured is stated to be critical.\n\nSeparately, a teenage boy lost his life while recording a TikTok video in front of a moving train in Hassanabdal on Wednesday.\n\nMoreover, in the same police station’s limits, a man was shot and injured over an old enmity.\n\nPolice sources said that the injured individual identified as Kamran was travelling back from work when two persons riding on a motorcycle intercepted him and opened gunfire. Resultantly, he received multiple bullet injuries.\n\nThe attackers reportedly fled the scene successfully and the injured was shifted to a hospital in critical condition.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:37.142Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891633/father-two-sons-among-five-killed-in-attock",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:31:36.000Z"
}
