{
  "title": "PAC meets after a year, finds irregularities in health ministry - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In its first meeting since last year’s general elections, PTI lawmaker Junaid Akbar Khan-led Public Accounts Committee (PAC) of the National Assembly took exception to alleged gross financial mismanagement in the Ministry of National Health Services, Regulations and Coordination.\n\nThe PTI leader was unanimously elected as the PAC chairman only last month, following a yearlong delay.\n\nAs it resumes its oversight responsibilities, the committee is expected to play a crucial role in ensuring transparency and accountability in government expenditures.\n\nWhile reviewing audit objections related to the health ministry and the national heritage and cultural division on Wednesday, PAC members raised concerns over financial irregularities and called for greater accountability in both departments.\n\nThe PAC chairman strongly objected to the failure of the relevant ministries to hold meetings of departmental accounts committee (DACs), warning their representatives that the NA panel would not discuss the audit objections that could have been settled at the level of DACs.\n\nPAC chairman tells senior officials to provide all relevant documents to audit department\n\nThe committee also expressed dissatisfaction over non-utilisation of Rs5.9bn Central Research Fund (CRF) for its very purpose. The office of Auditor General of Pakistan observed that the management did not utilise CRF for conducting research, development or evaluation of drugs. As per the audit, CRF’s non-utilisation for the intended purposes defeated the objective of its creation in 2012.\n\nFailing to reply to the objections raised, the audit department had proposed fixing responsibility for the irregularity.\n\nSimilarly, an objection was also raised over cash withdrawals and deposits in the security accounts worth a total of Rs1.42 billion, without supporting documents.\n\nObserving huge financial movement, it was noted during the audit that Rs87.55m cash was withdrawn out of the security accounts but the supporting record was not available.\n\nAnother amount of Rs1.33bn was deposited in the security account but the record of sources of receipt was not made known.\n\nAs per audit, in the absence of supporting record, the authenticity of cash withdrawal and receipts deposited could not be ascertained. It observed that the deposit of government fund to avoid lapse was negligence on the part of the management.\n\nThe PAC chairman directed senior officials of the health ministry to provide the audit department with all relevant documents.\n\nThe committee took strong exception to what it called gross financial mismanagement when members learnt that Rs216.934m had lapsed while an amount of Rs4.4bn was surrendered while on the other hand the health ministry had sought supplementary grant of Rs12.75bn.\n\nThis amount was sanctioned, but not included in the supplementary schedule of authorised expenditure, it was noted.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:48.731Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891591/pac-meets-after-a-year-finds-irregularities-in-health-ministry",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:47:51.000Z"
}
