{
  "title": "Worn clothing imports rise as poverty surges to 45pc - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Arrival of used clothing hits a record $511m in FY25\n• Flea markets have become vital for low-income groups as new branded goods become unaffordable\n\nKARACHI: Pakistan’s imports of second-hand clothing have surged to an all-time high of 1.137 million tonnes worth $511 million in the previous fiscal year, surpassing the previous record of 990,266 tonnes ($434 million) in FY24.\n\nThis sharp rise reflects both the growing demand for affordable clothing and the country’s deepening poverty crisis.\n\nA significant number of people, unable to afford locally made branded goods, have turned to second-hand clothing markets known as landa bazaars or flea markets.\n\nThese markets, such as those in Shershah and Banaras, have become a lifeline for lower-income groups, where used clothing, shoes, and other items are sold at a fraction of the price of new, branded goods.\n\nAccording to the World Bank’s latest report, nearly 45 per cent of Pakistan’s population now lives below the poverty line, with the new threshold set at $4.20 per person per day, up from $3.65.\n\nThis increase has pushed the poverty ratio for lower-middle-income groups to 44.7pc, up from 39.8pc under the previous threshold.\n\nMuhammad Usman Farooqui, General Secretary of the Pakistan Second Hand Clothing Merchants Associa­tion (PSHCMA), attributed the rise in second-hand clothing imports to escalating poverty.\n\nMr Farooqui noted that many families, especially from lower and middle-income brackets, are increasingly dependent on affordable used goods.\n\nFarooqui has called on the government to reduce various taxes and duties on these imports.\n\nThese include a 10pc regulatory duty, 5pc customs duty, 6pc advance income tax, and approximately 5pc sales tax, which, he said, make second-hand clothing unaffordable for those who need it most.\n\nTraders involved in the purchase and sale of used clothing also face additional taxes, including a 5pc sales tax on the difference between their sale and purchase prices. Domestic traders are also liable to pay income tax if their annual income from the business exceeds Rs 600,000.\n\nIn the Finance Bill 2024, second-hand clothing importers were designated withholding agents, requiring them to collect advance tax at 0.1pc from distributors, dealers, and wholesalers.\n\nHowever, if the parties involved are not registered with the Federal Board of Revenue (FBR), the withholding tax increases to 2pc or even 2.5pc for non-compliant retailers.\n\nAccording to Farooqui, many individuals working in the used clothing trade are not registered with the FBR, and often do not have fixed business locations or proper records, making it difficult for them to comply with these tax regulations.\n\nDespite the government’s efforts to stabilise the economy, Farooqui argued that the benefits of this recovery must be transferred to the masses.\n\nHe called for the removal of the regulatory duty and tax exemptions for used clothing imports to ease the financial burden on people with low incomes.\n\nUsed clothing is primarily imported from European countries, the USA, Japan, Korea, China, and Canada. Within Pakistan, exporters in special zones hold a dominant share of 60-70pc of the imports. These units sort through unsorted clothing to extract higher-quality items, which are then re-exported, with only 10-20pc sold locally.\n\nImport duties on used clothing stand at Rs 36 per kg, while shoes are taxed at Rs 66 per kg at the import stage. Farooqui stressed that reducing these taxes could provide much-needed relief for Pakistan’s disadvantaged segments.\n\nMarket surveys reveal the high prices of second-hand clothing.\n\nImported used jeans cost between Rs300-400, while a second-hand shirt is priced around Rs250-300. In contrast, new sports shoes made in Lahore are priced between Rs2,500-3,500, while branded shoes made in Vietnam or China can go for Rs4,000-5,500. However, used sports shoes are available for Rs600-800, making them more accessible for many consumers.\n\nWith the rising demand for affordable second-hand goods, landa bazaars have become essential in offering an alternative to increasingly unaffordable new items. While Pakistan’s economy continues to struggle, these flea markets are proving to be crucial for the lower-income population, struggling to make ends meet amidst a growing poverty crisis.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:36:15.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930963/worn-clothing-imports-rise-as-poverty-surges-to-45pc",
  "dateList": "2025-02-13",
  "date_published": "2025-08-15T01:55:54.000Z"
}
