{
  "title": "Justice Sarfraz Dogar appointed IHC acting chief justice amid reservations over seniority - Pakistan - DAWN.COM",
  "author": null,
  "content": "Justice Sardar Muham­mad Sarfraz Dogar on Thursday was notified as the acting chief justice of the Islamabad High Court (IHC) amid reservations expressed by some judges over his seniority.\n\nJudges recently elevated to the Supreme Court will also be sworn in by the chief justice of Pakistan (CJP) today.\n\nUnlike the usual practice, where a senior judge administers the oath to an acting chief justice of a high court, President Asif Ali Zardari will oversee Justice Dogar’s oath-taking. This follows speculation that five senior IHC judges, who had openly opposed Justice Dogar’s transfer, might refuse to administer the oath.\n\nAccording to a notification issued by the Ministry of Law and Justice, a copy of which is available with Dawn.com, Dogar was appointed acting chief justice by the president.\n\nHe will step into the position “with effect from the date he [takes] oath of his office, till appointment of regular chief justice.”\n\nDogar was moved to courtroom number one and has begun hearing cases.\n\nHis appointment as acting chief justice follows the appointment of Justice Aamer Farooq to the SC earlier this week.\n\nLate on Wednesday night, the Ministry of Law and Justice issued a notification formally announcing Justice Dogar’s appointment as acting chief justice of the IHC. The appointment, made by the president under Article 196, may diminish the controversy over seniority.\n\nThe law ministry also notified acting chief justices of the three other high courts: Justice Ejaz Swati has been appointed as acting CJ of Balochistan High Court (BHC), Justice Junaid Ghaffar has been named acting CJ of Sindh High Court (SHC) and Justice S.M. Attique Shah as acting CJ Peshawar High Court (PHC).\n\nIn addition, notifications for the appointment of seven judges to the Supreme Court have also been issued.\n\nBesides Justice Aamer Farooq, BHC Chief Justice Muhammad Has­him Khan Kakar, SHC Chief Justice Muhammad Shafi Sid­d­iqui and his colleague Justice Salah­ud­d­in Panhwar, PHC Chief Justice Ishtiaq Ibrahim and his colleague Justice Shakeel Ahmad, and Justice Miangul Hassan Aurangzeb will be sworn in by the chief justice of Pakistan.\n\nJustice Aurangzeb will serve as an acting Supreme Court judge under Article 181 of the Constitution to clear pending tax and commercial cases. The provision allows the president to appoint a high court judge to temporarily act as a Supreme Court judge.\n\nJustice Aurangzeb will remain a judge of the SC until the pleasure of the president, after which the judge may either return to the IHC or be confirmed as a Supreme Court judge, depending on the situation.\n\nEarlier, Justice Farooq cleared the way for Justice Dogar’s next move towards the office of the IHC chief justice by dismissing a representation filed by five IHC judges.\n\nThe representation had challenged the transfers of Justice Dogar (from LHC), Justice Khadim Hussain Soomro (from SHC), and Justice Mohammad Asif (from BHC), arguing that the move had unfairly affected their seniority.\n\nThe rejected representation was filed by Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat.\n\nThe judges contended that under the Constitution, a high court judge must take a new oath upon transfer to a different high court, which should affect their seniority ranking.\n\nThe IHC chief justice responded to the representation with a detailed ruling. His judgement referenced several key legal principles, particularly constitutional articles concerning the transfer of judges and the distinction between transfers and fresh appointments.\n\nHe cited Article 200 of the Constitution, which allows the president of Pakistan to transfer a judge from one high court to another, provided the transfer is made with the consent of the judge and after consultation with the chief justice of Pakistan and the chief justices of the involved high courts.\n\nThe chief justice emphasised that while the transfer is constitutionally valid, it does not imply a fresh appointment or a change in the seniority of the judge in the receiving court.\n\nThe ruling noted that the Constitution does not require a judge to take a new oath upon transfer from one high court to another. Once a judge has taken the oath of office in their original high court, that oath continues to apply upon transfer.\n\nTherefore, the seniority that the judge held in their previous high court should carry over to the new high court without resetting their position in the seniority list.\n\nInterestingly, four SC judges — Justice Mansoor Ali Shah, Justice Munib Akhtar, Justice Ayesha Malik and Justice Athar Minallah — also expressed similar reservations in a letter written to Chief Justice of Pakistan Yahya Afridi.\n\nThe four judges described the transfer of judges as “suspect” in the absence of an oath-taking ceremony.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:26.053Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891705/justice-sarfraz-dogar-appointed-ihc-acting-chief-justice-amid-reservations-over-seniority",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T07:42:41.000Z"
}
