{
  "title": "13 terrorists killed in Khyber Pakhtunkhwa operations: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces killed 13 terrorists in five separate operations carried out across Khyber Pakhtunkhwa on Thursday night, the military’s media wing said in a statement.\n\nAccording to the Inter-Services Public Relations (ISPR), the first operation took place in the Dera Ismail Khan area.\n\n“During the conduct of [the] operation, own troops effectively engaged the khwarij location, resultantly, five khwarij including Kharji Shah Gul @ Rohani were sent to hell,” the ISPR said, using a term designating members of the banned Tehreek-i-Taliban Pakistan (TTP).\n\nThe statement added that two other encounters took place in North Waziristan, where security forces engaged terrorists in the Dosali and Tappi areas. “Resultantly, five khwarij were effectively neutralised by own troops,” the statement read.\n\nIn the third operation in Lakki Marwat, two khwarij were “sent to hell”, while in the Khyber District’s Bagh area, security forces killed another terrorist.\n\n“Weapons and ammunition were also recovered from the killed khwarij, who remained actively involved in numerous terrorist activities against the security forces as well as the killing of innocent civilians,” the ISPR said.\n\nThe statement added that sanitisation operations were being conducted, stating that the security forces were “determined to wipe out the menace of terrorism from the country”.\n\nOn February 7, security forces killed three terrorists clad in burqas during an intelligence-based operation in KP’s North Waziristan district.\n\n“During the conduct of the operation, own troops effectively engaged the khwarij location as a result of which three khwarij were sent to hell, who were trying to escape wearing women’s attire (burqa).”\n\nPakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan.\n\nTerror attacks have increased since the banned TTP broke a fragile ceasefire agreement with the government in 2022.\n\nWith at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade, according to a 2024 report issued by the Centre for Research and Security Studies (CRSS) think-tank.\n\nAccording to the ISPR Director General, security forces conducted a total of 59,775 operations last year during which 925 terrorists were killed and 383 officers and soldiers were martyred.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:22.973Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891755/13-terrorists-killed-in-khyber-pakhtunkhwa-operations-ispr",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T18:31:55.000Z"
}
