{
  "title": "Britain won’t grant citizenship to paperless migrants - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The British government on Wednesday said it was toughening immigration rules to make it almost impossible for undocumented migrants who arrive on small boats to later receive citizenship.\n\nUnder new guidance migrants arriving by sea, or hidden in the back of vehicles will normally be refused citizenship. “This guidance further strengthens measures to make it clear that anyone who enters the UK illegally, including small boat arrivals, faces having a British citizenship application refused,” a Home Office spokesperson said.\n\nPrime Minister Keir Starmer’s Labour government is under pressure to reduce migration after Nigel Farage’s anti-immigration Reform UK party won roughly four million votes during the last general election — an unprecedented haul for a far-right party. But the change to the rules has been criticised by some Labour MPs.\n\n“If we give someone refugee status, it can’t be right to then refuse them a route to become a British citizen,” wrote lawmaker Stella Creasy on X, adding that the policy would leave them “forever second class”.\n\nFree Movement, an immigration law blog, said the changes had the potential to “block a large number of refugees from naturalising as British citizens, effective immediately”. It called the updated guidance “incredibly spiteful and damaging to integration”.\n\nThe announcement comes after MPs this week debated the government’s new Border Security, Asylum and Immigration Bill, designed to give law enforcement officials “counter-terror style powers” to break up gangs bringing irregular migrants across the Channel.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:46.489Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891580/britain-wont-grant-citizenship-to-paperless-migrants",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:53:34.000Z"
}
