{
  "title": "Asalanka heroics power Sri Lanka to win over Australia - Sport - DAWN.COM",
  "author": null,
  "content": "COLOMBO: Sri Lanka pulled off a stunning comeback against world champions Australia to clinch a 49-run victory in the first One-day International after a century by captain Charith Asalanka here on Wednesday.\n\nDefending a modest target of 215, Sri Lanka bowled out the visitors for 165 inside 34 overs to take a 1-0 lead in the two-match series.\n\nAsalanka smashed a career-best 127 before chipping in with the crucial wicket of Alex Carey, while Maheesh Theekshana took 4-40 to help scuttle Australia’s chase.\n\n“Really pleased with the knock,” Asalanka said. “It wasn’t easy batting out there… Had to settle in and then batting with the tail had to take a few risks, and glad it all paid off.”\n\nOpting to bat first, Sri Lanka found themselves in dire straits at 133-8 in the 33rd over, with Australia’s four-pronged pace attack running riot.\n\nAsalanka’s strike rate was just shy of a run a ball and included 14 fours and five sixes.\n\nHis ninth-wicket stand with Eshan Malinga was a stadium record of 79, even though the tailender made just a solitary run from 26 balls.\n\n“He hung in there and all we wanted to do was to take the game as deep as possible,” Asalanka said. “If not for that partnership we wouldn’t have got over the line.”\n\nAsalanka refused to throw in the towel and was last man out when he was deceived by a cleverly disguised slower delivery from Sean Abbott (3-61).\n\nThe packed crowd rose to their feet to see him back to the pavilion, while opposite number Steve Smith and wicket-keeper Alex Carey acknowledged his knock with a pat on the back.\n\nAustralia’s chase never really got going, with Asitha Fernando dismissing both openers cheaply before Sri Lanka’s spinners tightened the noose.\n\nDunith Wellalage struck with his very first ball to clean up Smith, who had tormented Sri Lanka with back-to-back centuries in the Test series.\n\nSmith misjudged a slog sweep and was out before he had settled in, a huge breakthrough that sent the crowd into raptures.\n\nWhite-ball stalwarts Glenn Maxwell and Travis Head were rested to give other squad members match practice ahead of the Champions Trophy.\n\nScoreboard\n\nSRI LANKA:\n\nP. Nissanka c Carey b Johnson 4 A. Fernando c Smith b Hardie 1 K. Mendis c Short b Hardie 19 K.D. Mendis c Fraser-McGurk b Johnson 5 C. Asalanka c Fraser-McGurk b Abbott 127 J. Liyanage c Smith b Abbott 11 D. Wellalage c Smith b Short 30 W. Hasaranga b Ellis 7 M. Theekshana c Carey b Ellis 2 E. Malinga not out 1 A.M. Fernando c Carey b Abbott 0 EXTRAS (LB-2, NB-1, W-4) 7 TOTAL (all out, 46 overs) 214 FALL OF WICKETS: 1-4 (Nissanka), 2-6 (A. Fernando), 3-30 (K. Mendis), 4-31 (K.D. Mendis), 5-55 (Liyanage), 6-122 (Wellalage), 7-133 (Hasaranga), 8-135 (Theekshana), 9-214 (Asalanka) BOWLING: Johnson 7-0-44-2 (2w), Hardie 6-0-13-2, Abbott 9-0-61-3 (1w, 1nb), Ellis 9-2-23-2 (1w), Zampa 6-0-32-0, Short 9-0-39-1\n\nAUSTRALIA:\n\nM. Short lbw A.M. Fernando 0 J. Fraser-McGurk c&b A.M. Fernando 2 C. Connolly lbw Theekshana 3 S. Smith b Wellalage 12 M. Labuschagne lbw Theekshana 15 A. Carey c Nissanka b Asalanka 41 A. Hardie lbw Hasaranga 32 S. Abbott c&b Theekshana 20 N. Ellis b Wellalage 0 A. Zampa not out 20 S. Johnson lbw Theekshana 0 EXTRAS (LB-5, W-15) 20 TOTAL (all out, 33.5 overs) 165 FALL OF WICKETS: 1-0 (Short), 2-7 (Fraser-McGurk), 3-18 (Connolly), 4-31 (Smith), 5-83 (Labuschagne), 6-85 (Carey), 7-126 (Abbott), 8-127 (Ellis), 9-145 (Hardie) BOWLING: A.M. Fernando 5-1-23-2 (1w), Malinga 4-0-12-0, Theekshana 9.5-1-40-4 (3w), Wellalage 7-0-33-2 (2w), Hasaranga 6-0-47-1, Asalanka 2-0-5-1 RESULT: Sri Lanka won by 49 runs. PLAYER-OF-THE-MATCH: Charith Asalanka\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad57d7cc458.jpg",
  "retrievedAt": "2025-08-25T19:35:46.439Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891568/asalanka-heroics-power-sri-lanka-to-win-over-australia",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:53:43.000Z"
}
