{
  "title": "Call for market-driven agri reforms - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: State Bank Deputy Governor Saleem Ullah on Wednesday emphasised the need for market-driven mechanisms in the agriculture sector instead of relying on government support price interventions, insisting that sectors operating without state interventions naturally adjust to market dynamics.\n\nSpeaking at the Agri Conference and Expo 2025 at the Expo Centre Karachi, Mr Saleem highlighted that subsidies should be limited to vulnerable segments while the broader sector should transition towards a market-based framework to strengthen the national economy.\n\nSpecial Assistant to the Sindh Chief Minister on Investment and Public-Private Partnerships, Qasim Naveed Qamar, who inaugurated the conference, noted that the provincial government offers various support programmes, including subsidised tractors, drip irrigation systems, agricultural machinery and direct subsidies for farmers.\n\n“We need strategic investments in modern farming techniques, precision agriculture and sustainable irrigation methods to drive productivity and profitability. Encouraging innovation in agri-tech, climate-smart farming and value chain development is essential,” Mr Qamar said.\n\nHe said the Sindh government was also facilitating farmers with access to loans on easy terms, supported by banks, to help them acquire modern equipment. Addi­tionally, initiatives such as Kibor subsidy provisions thro­ugh the Sindh Enterprise Development Fund aim to ease financial constraints.\n\nSenior agro-economist Matteo Lagatti from FGM International said that corporate farming remains in its infancy in Pakistan, with only 4pc of the country’s total cultivable land (840,000 hectares) allocated for its development.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:40.212Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891601/call-for-market-driven-agri-reforms",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:14:58.000Z"
}
