{
  "title": "India’s Modi seeks to boost Trump bromance on key US visit - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi will try to rekindle his bromance with Donald Trump — and avoid the US president’s wrath on tariffs and immigration — when they meet on Thursday at the White House.\n\nTrump will be pushing for a “fair” trade deal with India, while the two leaders will also discuss a new defence partnership and military sales during the meeting, senior White House officials said.\n\nModi will hold a joint press conference with Trump — a rare move from the Indian leader, who is a prolific social media user but seldom takes questions from reporters.\n\nHe will also hold a one-on-one meeting with tech billionaire Elon Musk, who has launched an aggressive effort as Trump’s right-hand man to overhaul the federal bureaucracy.\n\n“There’s a lot of natural warmth dating back to President Trump’s first term,” a senior Trump administration official said.\n\nBut the official said that while there was “early body language from the government of India that has been well received”, they were “modest steps” and there remained “a lot more work to do”.\n\nSo far Modi has offered quick tariff concessions ahead of his visit, with New Delhi slashing duties on high-end motorcycles — a boost to Harley-Davidson, the iconic American manufacturer whose struggles in India have irked Trump.\n\nThe two leaders would make a further push towards a trade deal with a hope to have it in place sometime this year, the official added.\n\nUS officials said it would be up to Trump to talk about any possible tariffs on India.\n\nThe United States had a $45.6 billion trade deficit with India in 2024, according to US figures.\n\nIndia has already accepted a US military flight carrying 100 shackled migrants last week as part of Trump’s immigration overhaul, and New Delhi has vowed its own “strong crackdown” on illegal migration.\n\nIndia’s top career diplomat Vikram Misri said last week that there had been a “very close rapport” between the leaders, although their ties have so far failed to bring a breakthrough on a long-sought bilateral trade deal.\n\nModi was among the first to congratulate “good friend” Trump after his November election win.\n\nFor nearly three decades, US presidents from both parties have prioritised building ties with India, seeing a natural partner against a rising China.\n\nBut Trump has also raged against India over trade, the biggest foreign policy preoccupation of his new term, in the past calling the world’s fifth-largest economy the “biggest tariff abuser”.\n\nFormer property tycoon Trump has unapologetically weaponised tariffs against friends and foes since his return.\n\nModi “has prepared for this, and he is seeking to preempt Trump’s anger”, said Lisa Curtis, the National Security Council director on South Asia during Trump’s first term.\n\nWhile US public attention has focused on deporting Latin Americans, India is the third-biggest source of undocumented immigrants in the United States after Mexico and El Salvador.\n\nIndian activists burned an effigy of Trump last week after the migrants on the US plane were flown back in shackles the whole journey, while the opposition accused Modi’s Hindu-nationalist government of weakness.\n\nOne thing Modi is set to avoid, however, is official US scrutiny of his record on the rights of Muslims and other minorities.\n\nTrump is unlikely to highlight an issue on which former president Joe Biden’s administration offered gentle critiques.\n\nModi is the fourth world leader to visit Trump since his return, following the prime ministers of Israel and Japan, and the king of Jordan.\n\nModi assiduously courted Trump during his first term.\n\nThe two share much in common, with both campaigning on promises to promote majority communities over minorities and both doggedly quashing dissent.\n\nIn 2020, Modi invited Trump before a cheering crowd of more than 100,000 people to inaugurate the world’s largest cricket stadium in his home state of Gujarat.\n\nTrump could visit India later this year for a summit of the Quad — a four-way grouping of Australia, India, Japan and the United States.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:35:22.863Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891744/indias-modi-seeks-to-boost-trump-bromance-on-key-us-visit",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T16:42:18.000Z"
}
