{
  "title": "Gen Faiz be held responsible for shedding Pashtuns’ blood: ANP - Pakistan - DAWN.COM",
  "author": null,
  "content": "MOHMAND: Awami National Party leader and former chief minister Ameer Haider Khan Hoti has said that people have paid a huge price for restoration of peace in the region.\n\n“The situation in Pakistan and Afghanistan is deteriorating day by day. We urge state to avoid war and try to resolve issues through diplomacy,” he told a meeting of ANP here on Wednesday.\n\nThe meeting was held to observe the joint death anniversary of Khudai Khidmatgar movement founder Bacha Khan and Khan Abdul Wali Khan. Mr Hoti said that the blood of Pashtuns was being shed both in Pakistan and Afghanistan and those involved in terrorism wanted to return and resettle in the region.\n\n“News is coming that investigation is being conducted against Gen Faiz Hameed that he has misused his powers,” he said.\n\nHe said that before the Top City investigation, Gen Faiz should be held accountable for shedding the blood of Pashtuns. He alleged that massacre of Pashtuns continued owing to his wrong policies.\n\nThe ANP leader said that Pashtuns were not terrorists, but terrorism was imposed on them. “Former military rulers in collaboration with the United States turned Pashtun land into a battlefield. It resulted in the bloodshed of thousands of innocent Pashtuns,” he alleged.\n\nHe said that situation in Mohmand, Bajaur, Waziristan, Bannu, Dera Ismail Khan, Lakki Marwat and Tank was deteriorating again as those experiments being conducted again.\n\nHe questioned as to who brought foreigners to Afghanistan and who promoted Kalashnikov and heroin culture. Regarding the situation in Kurram, he said that federal and provincial governments did not pay any attention to the issue, which was why situation there had worsened.\n\nThe gathering was also attended by ANP leaders Hussain Shah Yousafzai, Khadija Shah Chitrali, former MPA Nisar Mohmand, Maulana Khanzeb, Syed Masoom Shah Bacha, Iftikhar Mohmand, Meraj Khan and a large number of party workers.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad69f04a2b0.jpg",
  "retrievedAt": "2025-08-25T19:35:30.268Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891645/gen-faiz-be-held-responsible-for-shedding-pashtuns-blood-anp",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:40:57.000Z"
}
