{
  "title": "Physical fitness certificate mandatory for all heavy vehicles in Sindh: Sharjeel Memon - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Sindh government on Thursday made it mandatory for all heavy vehicles in Karachi to have a physical fitness certificate amid the rising number of traffic accidents involving dumper trucks.\n\nThe decision came following a high-level meeting chaired by Sindh Chief Minister Syed Murad Ali Shah to discuss the alarming number of traffic accidents in the metropolis and the ensuing criticism against the authorities for negligence.\n\nLast week, the provincial government had banned the entry of heavy vehicles into the city during the daytime, only allowing them to operate from 11pm to 6am. Exemptions, however, were granted to trucks carrying water, petroleum products, medicines, meat and other essential goods.\n\nAddressing a press conference following the meeting today, Sindh Information Minister Sharjeel Inam Memon said, “The provincial government will ensure that all heavy vehicles plying the roads carry a fitness certificate.”\n\nHe added that the transport department will issue the fitness certificate and barcodes will be given to all registered vehicles.\n\n“The Karachi Water & Sewerage Corporation (KWSC) will also provide barcodes to its water tankers and issue fitness certificates,” Memon said, adding that all heavy vehicles will have 30 days to receive the fitness certificate or they will not be allowed on the roads.\n\nMemon said that heavy vehicles coming from other provinces should have a fitness certificate issued by the Sindh government, stating that the Punjab government had issued similar rules which will be strictly implemented in the province now.\n\nRegarding the complaints that the vehicle number plates were not issued on time, he said, “The excise department has 80,000 number plates that have not been collected. There are only two motor vehicle inspectors in the province and the number is being increased.”\n\nThe minister said that the Sindh Assembly had passed a law according to which an unregistered vehicle cannot be sold by a car showroom owner or agent. He warned that any unregistered vehicle on the road will be impounded and the showroom that sold the vehicle will be sealed.\n\nHe urged showroom owners to implement the law and sell their vehicles after registering them.\n\nMemon added that showroom owners or agents can buy vehicles for investment placed on car carriers only. “Car showroom owners and agents cannot sell a vehicle before registering it,” he announced.\n\nRegarding imported vehicles, he said those for the province will be registered, while vehicles for other provinces can only be transported on car carriers.\n\nTaking notice of the worsening traffic issues and rising number of road accidents which have claimed at least nine lives and sparked protests in Karachi, CM Shah chaired a high-level meeting today and issued directives to take immediate measures, a statement from the CM House spokesperson said.\n\nAccording to the statement, the meeting included Memon, Minister for Local Government Saeed Ghani, Minister for Excise Mukesh Chawla, Home Interior Zia-ul-Hassan Lanjar, Mayor Karachi Murtaza Wahab, and other officials.\n\n“During the meeting, several important decisions were taken regarding vehicle fitness and traffic management,” the statement said. The chief minister issued instructions to the excise dept, local government, traffic police and district police through the police chief.\n\nRecent accidents have sparked widespread protests against traffic police for allowing the unhindered movement of dump trucks during the daytime. Opposition parties including the Muttahida Qaumi Movement-Pakistan (MQM-P) and Jamaat-i-Islami have called for restrictions on the movement of heavy vehicles to prevent the further loss of precious lives.\n\nGovernor Kamran Tessori expressed his anger over the growing fatal accidents and unchecked movement of the heavy traffic and urged the Sindh government, ministers and the police to take action.\n\nEarlier this week, MQM-Haqiqi chairman Afaq Ahmed was taken into custody on charges of vandalism and arson for allegedly inciting protestors to attack heavy vehicles.\n\nSindh IG Police Ghulam Nabi Memon said that the MQM-H chief was arrested on charges of “instigating people for torching heavy vehicles in the metropolis”. He was presented in court and sent to jail on judicial remand.\n\nOn Monday, Ahmed had held a press conference and called on the youth to “prepare themselves” and “assume responsibilities” rather than relying on the government’s promise of implementing the ban on the movement of heavy vehicles during daytime.\n\nSoon after in what appeared to be acts of vigilante justice, unknown persons torched four heavy vehicles in the city. Police said a trailer, two water tankers and a dump truck were attacked in Landhi, Awami Colony, Surjani Town and Sharifabad areas and set on fire.\n\nTransporters and owners took to the street after the loss of their vehicles and blocked the National Highway in Bin Qasim and Northern Bypass in protest over the violent incidents.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/13153522192e7ee.jpg",
  "retrievedAt": "2025-08-25T19:35:27.376Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891718/physical-fitness-certificate-mandatory-for-all-heavy-vehicles-in-sindh-sharjeel-memon",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T10:24:18.000Z"
}
