{
  "title": "Sindh govt allows over 3,500 heavy vehicles on Karachi roads at daytime - Pakistan - DAWN.COM",
  "author": null,
  "content": "• No bar on movement of garbage trucks, vehicles carrying petroleum products, medicines, water, milk, meat and other ‘essential’ goods\n• Home minister says heavy traffic can enter city between 11pm and 6am\n• Murad expresses concern over fatalities in traffic accidents\n\nKARACHI: Over 3,500 heavy vehicles, including dumper trucks involved in garbage disposal, will continue to ply on city roads round the clock after the Sindh government exempted trucks carrying water, petroleum products, medicines, meat and other essential goods from a ban imposed on the movement of heavy traffic during the daytime.\n\nHowever, Sindh Home Minister Zia Lanjar made it clear that heavy vehicles carrying construction material such as cement, sand and gravel, crushed stones and iron rods would not be allowed to enter the city limits during the daytime.\n\nA high-level meeting, chaired by Mr Lanjar and attended by Karachi Mayor Murtaza Wahab and Commissioner Hasan Naqvi, decided to allow the entry of all heavy traffic into the city from 11pm to 6am.\n\nThe meeting was held to review the measures being taken in view of growing incidence of traffic accidents, mostly involving dumpers and other heavy vehicles.\n\nIt was decided in the meeting that garbage trucks and essential heavy vehicles carrying petroleum products, medicines, medical gases, water, commodities and meat had been exempted from the ban.\n\nOfficials said that the meeting decided to tag and register over 3,500 essential heavy vehicles, including over 1,000 garbage trucks of the Sindh Solid Waste Management Board and 800 water carriers registered with the Karachi Water and Sewerage Corporation within 15 days.\n\nThey said that action would be taken against untagged vehicles after the deadline.\n\nThey said that the meeting decided that the operation and traffic police would jointly manage traffic in the city.\n\nThe officials said that the home minister also decided to give authority to the head constables to take action against violators and fine them.\n\nThey said that the commissioner would issue guidelines for heavy traffic and notifications to impose Section 144 on the entry of heavy vehicles into the city during daytime.\n\nThe home minister also said that a case would be registered against anyone who blocked road in the city.\n\nSpeaking on the occasion, Mayor Murtaza Wahab said that people were losing their lives in traffic accidents which must be prevented at all costs.\n\nHe said the action would be taken against the garbage trucks if they did not follow the law. The mayor urged to create a joint WhatsApp group to monitor the performance of the traffic police and accidents in the city.\n\nCM to review situation today\n\nTalking to the media at New Nazimabad, Chief Minister Syed Murad Ali Shah that the incidence of traffic accidents in the city was worrying and a meeting would be held on Thursday (today) to review the implementation of the measures to contain the menace.\n\n“Wherever I go, I see fancy number plates and vehicles without fitness,” he said, adding that the people had stopped abiding by the law.\n\nHe said that no one would be allowed to take the law into their own hands.\n\nThe chief minister said that funds had been allocated in the provincial budget for procurement of 500 EV buses. “We will add 8,000 buses to the city in three to four years,” he added.\n\nHe said that the work was already underway on our two major bus routes.\n\nMr Shah said that negotiations had also been held with Chinese companies on the revival of the Karachi Circular Railway (KCR).\n\nHe said that the company building the Orange Line in Lahore was also interested in the KCR project.\n\nUrges Centre to promptly transfer funds\n\nEarlier in the day, the CM expressed concerns regarding the Federal Board of Revenue’s (FBR) tax collection process, noting that while a significant amount, estimated to be over Rs0 billion, was collected last year, the funds from the previous year had only been transferred to the province this year.\n\n“We want the federal government to transfer the funds promptly to ensure prompt investment in the social sector,” he stated while speaking to the media after addressing the Pakistan Leadership Conversation 2025 at a local hotel.\n\nHe emphasised that despite collecting revenue on time, the province does not receive its rightful share on time.\n\nHe urged the federal government to ensure that these funds are transferred without unnecessary delays.\n\nRegarding domicile irregularities, CM Shah assured that the matter was under investigation.\n\nHe also stated that any individual found guilty of wrongdoing would face strict punishment, reaffirming the government’s commitment to transparency and accountability.\n\nIn his keynote address at a high-profile gathering of dignitaries, government officials, and stakeholders, the CM presented an ambitious vision for building a resilient and sustainable province.\n\nSpeaking on the theme “Building Resilience and Sustainability: Sindh’s Path Forward,” he underscored the urgent need for transformative action in education, healthcare, water management, infrastructure, and economic development.\n\nMr Shah acknowledged the province’s rich cultural heritage and immense potential while openly discussing the socio-economic and environmental challenges that require immediate attention.\n\nHe emphasised that Sindh was at a turning point, prepared to overcome obstacles and embrace progress.\n\nHe highlighted several key areas of concern, including poverty, low literacy rates, malnutrition, high infant mortality, and water scarcity.\n\nHe described the loss of up to 75 per cent of Sindh’s water resources due to inefficient practices as ‘unacceptable’ and vowed to implement sustainable solutions.\n\nHe assured that the provincial government is taking decisive steps to address these pressing issues.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad6500d2bd4.jpg",
  "retrievedAt": "2025-08-25T19:35:35.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891620/sindh-govt-allows-over-3500-heavy-vehicles-on-karachi-roads-at-daytime",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T03:17:19.000Z"
}
