{
  "title": "Hasina govt behind ‘crimes against humanity’, says UN - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: Bangladesh’s former government was behind systematic attacks and killings of protesters as it tried to hold onto power last year, the UN said on Wednesday, warning that the abuses could amount to “crimes against humanity”.\n\nBefore prime minister Sheikh Hasina was toppled in a student-led revolution last August, her government cracked down on protesters and others, including by “hundreds of extrajudicial killings”, the United Nations said.\n\nThe UN rights office (OHCHR) said it had “reasonable grounds to believe that the crimes against humanity of murder, torture, imprisonment and infliction of other inhumane acts have taken place”.\n\nThese alleged crimes committed by the government, along with violent elements of Hasina’s Awami League party and the Bangladeshi security and intelligence services, were part of “a widespread and systematic attack against protesters and other civilians”, OHCHR’s report into the violence said.\n\nThe world body estimates over ‘1,400 people may have been killed’ by security forces during the 45-day uprising\n\nHasina, 77, who fled into exile in neighbouring India, has already defied an arrest warrant to face trial in Bangladesh for crimes against humanity. Asked about Hasina’s personal culpability, UN rights chief Volker Turk told reporters that his office “found reasonable grounds to believe that indeed the top echelons of the previous government were aware, and in fact were involved in… very serious violations”.\n\nUp to 1,400 killed\n\nBangladesh’s interim leader Mohammed Yunus, who had asked the UN rights office to launch its fact-finding mission, welcomed the report, insisting that he wanted to transform Bangladesh “into a country in which all its people can live in security and dignity”.\n\nThe UN investigation examined events in Bangladesh between July 1 and August 15 last year, relying on hundreds of interviews with victims, witnesses and others, and on photos, videos and other documents. The team determined that security forces had supported Hasina’s government throughout the unrest, which began as protests against civil service job quotas and then escalated into wider calls for her to stand down.\n\nOHCHR estimated that “as many as 1,400 people may have been killed” over the 45-day period, the vast majority of them “shot by Bangladesh’s security forces”. Children made up 12 to 13 percent of those killed, it said. The overall death toll given is far higher than the most recent estimate by Bangladesh’s interim government of 834 people killed.\n\n‘Rampant state violence’\n\n“The brutal response was a calculated and well-coordinated strategy by the former government to hold onto power in the face of mass opposition,” Turk said.\n\nHe pointed to findings of “hundreds of extrajudicial killings, extensive arbitrary arrest and detention and torture and ill treatment”, decrying “a disturbing picture of rampant state violence and targeted killings”.\n\nThe rights office also found indications of widespread gender-based violence and the abuse and killing of children. On the other side, the report highlighted “lynchings and other serious retaliatory violence” against police and Awami league officials or supporters. Bangladeshi rights group Odhikar said that a dozen people had died in detention since Hasina’s ousting. Asked about these cases, Turk said his office had only examined the situation up to mid-August.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ad5c20be6dc.jpg",
  "retrievedAt": "2025-08-25T19:35:46.835Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891586/hasina-govt-behind-crimes-against-humanity-says-un",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:53:34.000Z"
}
