{
  "title": "Kremlin says Ukraine will be in peace talks ‘one way or another’ - World - DAWN.COM",
  "author": null,
  "content": "The Kremlin said on Thursday that Kyiv would be involved in peace talks to end the three-year-long Ukraine war “one way or another”, a day after US President Trump held separate calls with the leaders of Russia and Ukraine.\n\nMoscow also said there was no agreement on the timing or location for a face-to-face meeting between Trump and President Vladimir Putin, suggesting it could be “several months” away.\n\n“One way or another, of course, Ukraine will participate in the negotiations,” Kremlin spokesman Dmitry Peskov said in an interview on Russian state TV.\n\nHe said there would be a “bilateral Russian-American track” and another track that would be “connected to Ukraine’s involvement”. He did not say whether this would involve direct talks between Russian and Ukrainian officials.\n\nEarlier, Ukrainian President Volodymyr Zelensky said that Ukraine would not accept any bilateral agreement on its fate reached by Moscow and Washington without Kyiv’s involvement, calling for Europe to have a seat at the table in negotiations to end the war.\n\nThe Ukrainian leader made the comments at a nuclear plant on his way to the Munich Security Conference, a day after US President Donald Trump spoke to Russian leader Vladimir Putin and announced the start of negotiations.\n\n“We, as an independent country, simply will not be able to accept any agreements without us,” Zelensky told reporters.\n\nThe Putin call and remarks by Trump’s defence secretary, who said Kyiv cannot join Nato or that a return to Ukraine’s pre-2014 borders is unrealistic, have caused alarm in Europe that the White House could seek to make a deal with Russia without them.\n\n“Today it’s important that everything does not go according to Putin’s plan, in which he wants to do everything to make his negotiations bilateral [with the US],” Zelensky said.\n\nHe added it was important for the United States and Ukraine to draw up a plan to end the war before talking to the Russian side.\n\nHe has been pushing to meet Trump before Trump meets Putin, although the US president said on Wednesday that he was expecting to meet Putin in the future, probably in Saudi Arabia.\n\nUkraine has said it is working on a Zelensky-Trump meeting, but nothing firm has been announced so far.\n\nZelensky also said he did not discuss the matter of Nato membership during his phone call with Trump, though he said he knew that the US was against the idea.\n\nHe also tried to play down the significance of Trump calling Putin before him on Wednesday, saying it did not look like a marker of Washington’s real priorities but adding that it was nonetheless “unpleasant”.\n\nAs the third anniversary of Russia’s invasion nears, Moscow controls a fifth of Ukraine and has been slowly advancing in the east for months, while Kyiv’s smaller army grapples with manpower shortages and tries to hold a chunk of territory in western Russia.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/13224033a043631.jpg",
  "retrievedAt": "2025-08-25T19:35:22.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891740/kremlin-says-ukraine-will-be-in-peace-talks-one-way-or-another",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T15:04:10.000Z"
}
