{
  "title": "Justice Sarfraz Dogar set to take helm of ‘divided’ IHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "• President Zardari appoints him acting chief justice, will administer oath today\n• Outgoing chief justices of four high courts, three others set to be sworn in as apex court judges\n• Justice Ejaz Swati of BHC, Justice Junaid Ghaffar of SHC and Justice S.M. Attique Shah of PHC named acting CJs\n\nISLAMABAD: Justice Sardar Muham­mad Sarfraz Dogar is expected to take oath as the acting chief justice of the Islamabad High Court (IHC) today (Thursday), despite reservations shown by some judges over his seniority.\n\nJudges recently elevated to the Supreme Court will also be sworn in by the chief justice of Pakistan (CJP) today.\n\nUnlike the usual practice, where a senior judge administers the oath to an acting chief justice of a high court, President Asif Ali Zardari will oversee Justice Dogar’s oath-taking. This follows speculation that five senior IHC judges, who had openly opposed Justice Dogar’s transfer, might refuse to administer the oath.\n\nA similar precedent was set when the Punjab governor administered oath of office to Justice Shujaat Ali Khan as acting chief justice of the Lahore High Court (LHC) in June last year.\n\nA senior IHC official said that when a chief justice goes on leave, a senior judge usually administers the oath to the acting chief justice. However, when the office is vacant, the oath is taken before the appointing authority.\n\nThe IHC administration was informed about the oath-taking in the afternoon, as the outgoing chief justice, Aamer Farooq, is set to take oath as a Supreme Court judge today.\n\nLate on Wednesday night, the Ministry of Law and Justice issued a notification formally announcing Justice Dogar’s appointment as acting chief justice of the IHC, in the late night. The appointment, made by the president under Article 196, may diminish the controversy over seniority.\n\nThe law ministry also notified acting chief justices of the three other high courts: Justice Ejaz Swati has been appointed as acting CJ Balochistan High Court, Justice Junaid Ghaffar has been named acting CJ Sindh High Court and Justice S.M. Attique Shah as acting CJ Peshawar High Court.\n\nIn addition, notifications for the appointment of seven judges to the Supreme Court have also been issued.\n\nBesides Justice Aamer Farooq, Balochistan High Court Chief Justice Muhammad Has­him Khan Kakar, Sindh High Court (SHC) Chief Justice Muhammad Shafi Sid­d­iqui and his colleague Justice Salah­ud­d­in Panhwar, Peshawar High Court (PHC) Chief Justice Ishtiaq Ibrahim and his colleague Justice Shakeel Ahmad, and Justice Miangul Hassan Aurangzeb will be sworn in by the chief justice of Pakistan.\n\nJustice Aurangzeb will serve as an acting Supreme Court judge under Article 181 of the Constitution to clear pending tax and commercial cases. The provision allows the president to appoint a high court judge to temporarily act as a Supreme Court judge.\n\nJustice Aurangzeb will remain a judge of the Supreme Court until the pleasure of the president, after which the judge may either return to the IHC or be confirmed as a Supreme Court judge, depending on the situation.\n\nSeniority concerns\n\nEarlier, Justice Farooq cleared the way for Justice Dogar’s next move towards the office of the IHC chief justice by dismissing a representation filed by five IHC judges.\n\nThe representation had challenged the transfers of Justice Dogar (from LHC), Justice Khadim Hussain Soomro (from SHC), and Justice Mohammad Asif (from BHC), arguing that the move had unfairly affected their seniority.\n\nThe rejected representation was filed by Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat.\n\nThe judges contended that under the Constitution, a high court judge must take a new oath upon transfer to a different high court, which should affect their seniority ranking.\n\nThe IHC chief justice responded to the representation with a detailed ruling. His judgement referenced several key legal principles, particularly constitutional articles concerning the transfer of judges and the distinction between transfers and fresh appointments.\n\nHe cited Article 200 of the Constitution, which allows the president of Pakistan to transfer a judge from one high court to another, provided the transfer is made with the consent of the judge and after consultation with the chief justice of Pakistan and the chief justices of the involved high courts.\n\nThe chief justice emphasised that while the transfer is constitutionally valid, it does not imply a fresh appointment or a change in the seniority of the judge in the receiving court.\n\nThe ruling noted that the Constitution does not require a judge to take a new oath upon transfer from one high court to another. Once a judge has taken the oath of office in their original high court, that oath continues to apply upon transfer. Therefore, the seniority that the judge held in their previous high court should carry over to the new high court without resetting their position in the seniority list.\n\nInterestingly, four Supreme Court judges — Justice Mansoor Ali Shah, Justice Munib Akhtar, Justice Ayesha Malik and Justice Athar Minallah — also expressed similar reservations in a letter written to Chief Justice of Pakistan Yahya Afridi.\n\nThe four judges described the transfer of judges as “suspect” in the absence of an oath-taking ceremony.\n\nPublished in Dawn, February 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:24:52.505Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891571/justice-sarfraz-dogar-set-to-take-helm-of-divided-ihc",
  "dateList": "2025-02-13",
  "date_published": "2025-02-13T02:32:57.000Z"
}
