{
  "title": "COVID-19 claims 57 lives, infects 4,767 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-57-lives-infects-4767-more-people/",
  "date_published": "2021-03-28T10:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):The national tally on Sunday of total active COVID-19 cases recorded 44,447 with 4,767 more people tested positive for the deadly virus and 2,647 people recovered from the disease during the last 24 hours.\nFifty-seven corona patients have died during past 24 hours, 53 of whom were under treatment in hospital and four out of the hospital in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 57 deaths occurred during last 24 hours, 20 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 70 percent, Islamabad Capital Territory 62 percent, Gujranwala 60 percent and Lahore 55 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gujrat 98 percent, Gujranwala 85 percent, Peshawar 78 percent and ICT 56 percent.\nAround 388 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 45,656 tests were conducted across the country on Saturday, including 9,424 in Sindh, 19,377 in Punjab, 8,160 in Khyber Pakhtunkhwa (KP), 6,460 in Islamabad Capital Territory (ICT), 1,054 in Balochistan, 350 in GB, and 831 in AJK.\nAround 595,929 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 654,591 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 12,367, Balochistan 19,497, GB 4,999, ICT 55,594, KP 84,609, Punjab 212,918 and Sindh 264,607.\nAbout 14,215 deaths were recorded in country since the eruption of the contagion. Around 4,491 perished in Sindh where four deaths occurred in hospital during past 24 hours.\n6,229 in Punjab had died with 39 deaths occurred in past 24 hours. 35 of them in the hospital and four out of hospital. 2,283 in KP where nine of them died in hospital on Saturday, 559 in ICT among two deaths in hospital during past 24 hours, 206 in Balochistan among one death recorded in hospital during past 24 hours, 103 in GB and 344 in AJK among two of them succumbed to the deadly virus in hospital on Saturday.\nA total of 10,066,726 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 3,631 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:33:22.825Z"
}
