{
  "title": "NCOC imposes complete ban on marriages from April 5",
  "link": "https://www.app.com.pk/national/ncoc-imposes-complete-ban-on-marriages-from-april-5/",
  "date_published": "2021-03-28T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP): The National Command and Operation Center (NCOC) on Sunday imposed a complete on marriage ceremonies both indoor and outdoor from 5th April onwards to contain disease spread.\nThe NCOC special session was held here with Federal Minister for Planning, Development and Special Initiatives Asad Umar with provincial chief secretaries on board via video link.\nThe Forum took detailed stock of epidemic curve chart data, update on non-pharmaceutical interventions (NPIs or alternate measures to treat the disease other than medical treatment) and vaccination process.\nThe Forum had imposed complete ban on marriages (including indoor and outdoor) from 5th April onwards. However, the provinces would have the discretion to implement restrictions in early time frame as per the situation on ground.\nThe NCOC would also provide updated hotspot maps to the provinces for enforcement of expanded lockdowns (ranging from a union council to an entire town) with effect from 29th March.\nThe Forum had also decided that all kind of gatherings both indoor outdoor would be banned with immediate effect including all social, cultural, political, sports and other events.\nFurthermore, these decisions would be implemented in districts and cities with 8 percent positivity percentage (three days rolling average) to contain the spread of deadly coronavirus pandemic.\nThe Forum also considered various options for reduction of inter provincial transport whereas the final decision would be taken based on the input from provinces and analysis of data regarding number of inter provincial commuters via air, rail and road.\nThe Forum had directed the provinces to ensure that vaccination targets given by NCOC were timely met. Moreover, it added that correct and timely data ingestion in National Immunisation Management System (NIMS) be ensured by all provinces.",
  "retrievedAt": "2025-08-11T20:33:22.993Z"
}
