{
  "title": "HEC wins 118 medals in national games 2023",
  "link": "https://www.app.com.pk/national/hec-wins-118-medals-in-national-games-2023/",
  "date_published": "2023-06-06T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP): The Higher Education Commission (HEC), Pakistan has won as many as 118 medals, including eight gold, 17 silver, and 93 bronze medals, in the National Games Quetta 2023.\nPresident of Pakistan Dr Arif Alvi conferred HEC with the ‘Best Turnout Trophy’ for being an extraordinary contingent of the National Games.\nHEC players competed in individual as well as team events participated by 14 units hailing from Pakistan Army, WAPDA, Pakistan Navy, Pakistan Air Force, Sindh, Khyber Pakhtunkhwa, Punjab, Railways, Balochistan, Police, Islamabad, Gilgit-Baltistan and Azad Jammu & Kashmir.\nIn his address, Chairman HEC Dr Mukhtar Ahmed said, “This remarkable achievement of aspiring young players is a testament to hard work, dedication, and commitment to compete with professional departmental players.”\n“We are proud of our athletes’ accomplishments and are committed to supporting them in their future endeavors,” he added.\nDr Mukhtar maintained that HEC was committed to promoting sports among students and to providing them with an opportunity to excel in academia as well as in co-curricular activities.\n“Alongside managing academic activities and patronizing regulations of universities, HEC regularly carries out extracurricular activities to promote healthy activities among youth to project the soft image of Pakistan,” he added.\nDirector/In-charge Sports HEC Mr Javed Ali Memon said that HEC was acting as a nurturing institution for rising stars on the horizon of sports as our players are ready to replace experienced professional players.\nHe informed that HEC acquired gold medals in Athletics, Taekwondo, Wushu and Judo events. He further said that HEC Women’s Volleyball and Basketball teams thwarted experienced departmental teams with their rigour and mettle.\nAmtul Rehman bagged two gold medals in the long jump and triple jump and Manisha Ali won double gold in Taekwondo and Wushu; Uzma Azam won a gold medal in Hammer Throw; Maliha Ali and Fiza clinched gold medals in Wushu and Kainat managed to secure gold in Judo along-with other outperforming players.",
  "retrievedAt": "2025-08-11T08:38:05.783Z"
}
