{
  "title": "Govt to focus on people-friendly budget with maximum relief: Bilal Kayani",
  "link": "https://www.app.com.pk/national/govt-to-focus-on-people-friendly-budget-with-maximum-relief-bilal-kayani/",
  "date_published": "2023-06-06T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 6 (APP): Prime Minister’s Coordinator on Economy and Energy Bilal Azhar Kayani on Tuesday said the Federal Government led by PM Shehbaz Sharif would work out all options to ensure a people-friendly budget for the next fiscal year.\n“The priority will be given to specific measures that are crucial to curb inflation and stabilize economy with maximum relief to the lower and middle,” he said in an exclusive interview with APP.\n“Surely, we can opt for a popular budget, but it will adversely impact the economy and we will not go for it in the larger national interest,” he added.\nBilal Kayani said the budget’s main focus would be on development projects as over Rs 1.1 trillion would be allocated on that count, including Rs 950 billion for the Public Sector Development Programme (PSDP) initiatives and Rs 150 billion for the projects under the public-private partnership framework.\nHe said the last Pakistan Tehreek-e-Insaf government had agreed on the “inappropriate conditions” of the International Monetary Fund (IMF) and deviated from all the standard protocols. Even the then finance secretary had also voiced his opposition to these conditions, but no heed was paid.\nMoreover, he added, the former prime minister abruptly decided to withdraw from the IMF programme when he felt that he was going to be ousted from power, and that pushed the country on the verge of bankruptcy.\nHowever, “we had to take tough decisions that were necessary to avert the default,” he remarked.\nHe expressed the hope that the staff level agreement with the IMF would be reached soon.\nKiyani said the incumbent government had been facing many challenges since it assumed the charge. “The previous government had pushed 20 million people below the poverty line and rendered six million jobless due to its wrong economic policies,” he added.\nThe measures were now being taken to reduce the circular debt in the energy sector, while efforts were underway to get petroleum products at economical rate to provide maximum relief to the people, he said.\nResponding a question, Bilal Kayani said alternative energy was being promoted which would help reduce dependence on the imported fuel and pressure on foreign exchange reserves.\nCiticising the previous government’s foreign policy, he asserted that they had isolated the country internationally. The present government had to make extra efforts to reinvigorate diplomatic ties and mend relationships with foreign nations, he added.\nAs regards the flood-hit areas, Kiyani said the government had been using all its resources for the rehabilitation of victims and reconstruction of the affected areas.\n“When we will assume the charge of the next government after winning the election, we will bring a long-term structural programme to steer out the country out of crises,” he vowed.",
  "retrievedAt": "2025-08-11T08:38:01.957Z"
}
