{
  "title": "IPMG organizes meeting; importance of ‘Gender Data Portal’ discussed",
  "link": "https://www.app.com.pk/national/ipmg-organizes-meeting-importance-of-gender-data-portal-discussed/",
  "date_published": "2023-06-06T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP):National Commission on the Status of Women (NCSW) on Tuesday organized the 20th meeting of the Inter-Provincial Ministerial Group (IPMG) here, jointly with the collaboration of UN Women.\nFederal Minister for Human Rights Mian Riaz Hussain Pirzada attended the meeting as the chief guest  Meanwhile, Chairperson NCSW Ms. Nilofar Bakhtiar, Country Representative UN Women Sharmeela Rasool, Ms. Andrea S. Hillyer Advisor Gender Security, representatives of Bureau of Statistics, Planning and Development Departments and Women Development Departments of all provinces and Provincial Commissions on the Status of Women including Azad Jammu & Kashmir and Gilgit Baltistan were also in the attendees.\nThe main agenda of the 20th meeting was to have an update on National Gender Data Portal (NGDP) and review the provincial coordination mechanism; strengthening the role of partners and identifying strategies to establish NGDP as a credible source for gender-related data and information.\nWhile addressing the meeting, the minister lauded the efforts of NCSW and UN women in providing a crucial platform in the form of IPMG, where all the relevant stakeholders from the center and provinces would join hands to tackle the issues and challenges to achieve the combined aim of gender equality and women’s empowerment in Pakistan.\nHe said that there was a stronger need to support the provincial governments; especially the provincial women machineries working for women’s development, to set strategic priorities and plans for women’s emancipation.\nThe minister expressed that women’s issues were similar in all parts of Pakistan with some cultural exceptions within the different localities. IPMG had provided the underpinning for creating such a well-coordinated apparatus.\nTogether, under a roof, all stakeholders could bridge the gap of cultural differences related to the issues women were facing, and the ways to confront them.\nWith coherent and open communication among all relevant stakeholders, we can only address inequality prevailing in the country through gender-sensitive resilient policies and shifting cultural and social attitudes.\nIn his concluding remarks, the minister said that the most alarming thing was the gender gap of around 12.5 million in Pakistan’s electoral rolls which he called a major hindrance in the way of better and effective participation of women in the whole political process.",
  "retrievedAt": "2025-08-11T08:38:01.823Z"
}
