{
  "title": "PM for inclusion of mega incentives for IT sector in fiscal budget",
  "link": "https://www.app.com.pk/national/pm-for-inclusion-of-mega-incentives-for-it-sector-in-fiscal-budget/",
  "date_published": "2023-06-06T12:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 6 (APP):  Prime Minister Muhammad Shehbaz Sharif on Tuesday directed the relevant authorities to include mega incentives for the Information Technology sector in the fiscal budget 2023-24 to boost country’s IT export.\nChairing a high-level meeting on promotion of the IT sector, the prime minister directed to prepare a big package for the IT sector in the upcoming fiscal budget.\nThe prime minister decided to introduce fixed tax regime for the IT sector in the budget and also constituted a committee on it, besides directing the body to submit its recommendations immediately, PM Office Media Wing said in a press release.\nThe meeting also accorded approval in principle for providing special incentives to new business start-ups in the IT sector.\nSpecial concessions for promotion of business and trade through modern technology were also approved.\nDuring the meeting, it was also decided to take the initiatives that were crucial to encourage youth for starting their own businesses.\nThe prime minister approved a major decision of creating special training IT zones for promotion of entrepreneurship.\nThe prime minister said that the government would spend huge amount on the training of youth in IT sector. Currently, a total of 45,000 young people across the country were being trained in the IT sector, he added.\nThe prime minister further said that in the upcoming fiscal budget, the government would distribute 1,00,000 laptops among the youth on merit basis.\nDuring the previous tenure of the PML-N government, they had distributed laptops among the country’s youth and by utilizing this facility, the young people supplemented the foreign reserves during the Covid pandemic, he observed.\nThe prime minister further set a target for the IT sector to increase its export up to the tune of $4.5 billion for the next year.\nThe meeting was attended by Minister for Finance Ishaq Dar, Minister for Information Technology & Telecommunication Syed Ameenul Haque, Minister for Information and Broadcasting Marriyum Aurangzeb, PM’s Adviser Ahad Khan Cheema, Minister of State Ayesha Ghous Pasha, PM’s Special Assistants Tariq Bajwa, Jahanzaib Khan Tariq Pasha, Shaza Fatima Khawaja, senator Afnanullah, Governor State Bank of Pakistan, Chairman FBR and other relevant authorities.\nRenowned IT experts including Asif Pir, Zohaib Khan, Naseer Akhtar, PTCL CEO, VP Jazz and deputy CEO Telenor also attended the meeting.\nIn the meeting, the prime minister directed to include all the IT related recommendations in the upcoming fiscal budget, adding the approval of IT-related recommendations in the next budget would create massive job opportunities for the youth.\nHe also directed the authorities to take measures which were essential to provide special guidance and government assistance to the youth for setting up new companies in the IT sector.\nThe prime minister also directed for organizing IT sector road shows abroad to sensitize the world about the facilities being offered by the IT sector in Pakistan.",
  "retrievedAt": "2025-08-11T08:38:08.736Z"
}
