{
  "title": "Women journalists visit ECP",
  "link": "https://www.app.com.pk/national/women-journalists-visit-ecp/",
  "date_published": "2023-06-06T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 6 (APP): A delegation comprising 40 young women journalists under the leadership of the Women Media Center (WMC), visited the Election Commission of Pakistan (ECP), Secretariat on Tuesday for interaction and briefing on ECPs working and  Initiatives.\nThe interactive session was chaired by Secretary ECP Omar Hamid Khan, said a news release.\nThe secretary informed the participants that they were the agents of change in society, adding the commission was opened to new ideas and offered a training ship programme to all the participants.\nHe also asked WMC CEO Fauzia Shaheen to come up with proposals and asked to make working groups.\nThe session provided an opportunity for the WMC delegation to gain valuable insights into the ECP’s role in ensuring transparent and inclusive elections in Pakistan.\nDuring the meeting, various ECP officers provided comprehensive briefings on key aspects such as electoral processes, technology integration in the electoral process, voter education and initiatives to enhance women’s representation in electoral processes.\nBoth the Women Media Center and the ECP emphasized the importance of collaboration between media organizations and electoral bodies in promoting accurate and timely dissemination of information related to elections.\nThe WMC commended the ECP for its dedication to transparency, upholding democratic values, and promoting gender equality within the electoral processes.\nThe meeting witnessed as a mutual commitment towards strengthening democracy and fostering a more inclusive electoral system in the country.\nSecretary ECP Omar Hamid Khan presented shield to the CEO Women Media Center Fauzia Shaheen.\nMaster Trainer,  Muhammad Farooq, DG I.T, ADG MCO/M&E, ADG Gender/Training, ADG Election-I and ADG Election-II also attended the interactive session.",
  "retrievedAt": "2025-08-11T08:38:03.789Z"
}
