{
  "title": "Telehealth kiosks receiving tremendous response at ‘Panahgahs’",
  "link": "https://www.app.com.pk/national/telehealth-kiosks-receiving-tremendous-response-at-panahgahs/",
  "date_published": "2021-02-14T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Prime Minister’s Focal Person on Shelter Homes, Naseem ur Rehman has said telehealth kiosks, set up at the federal capital’s ‘Panahgahs’, were getting tremendous response as it provided free treatment to a large number of dwellers with underlying conditions.\nSo far, around 300 to 400 residents of the capital’s shelter homes had availed access to medical care and consultation with online doctors, who were part of EZ Shifa network in Canada, the United States of America and Pakistan, the focal person told the media after\nvisiting the ‘Panahgah’, located at Tarnol, Islamabad.\nHe said the initiative was taken by the shelter homes’ management in collaboration with EZ Shifa, which was a private company, virtually connecting volunteer teams of doctors, from Pakistan and abroad with marginalized segments of the society.\nHe said telehealth kiosks were fully functional at multiple ‘Panahgahs’ located in various areas of Islamabad including G-9, Tarlai and Tarnol.\nThe focal person expressed the hope that 50 ‘Panahgahs’, operational across the country, would get the facility by the end of February.\nExplaining the way, Kiosks operated, he said the healthcare staff deputed at the ‘Panahgahs’ helped the residents feed their main vital signs (body temperature, blood pressure etc) in the kiosks after connecting them with the online available medical\nprofessionals.\n“Once connected, the patient gets an opportunity to have face to face interaction with the doctor so that he could fully explain his condition and avail prescription in printed form from the printing system attached with the kiosk,” he remarked.\nTo a query, he said the kiosks were designed by keeping the coronavirus standard operating procedures under the consideration to reduce the risk of virus outbreak at the facility. It had thermogun and sanitizer facilities as well.\nHe said the initiative was part of the ‘Promoting Healthy Lifestyle’ campaign, launched at the shelter homes in the wake of first wave of coronavirus pandemic.\nThe drive was meant to transform the shelter homes in neat and clean facilities, where the daily wage earners could enjoy healthy lifestyle apart from food and shelter.\n“We are driven by the vision of Prime Minister Imran Khan, who is determined to provide free healthcare facility to every citizen of Pakistan,” he remarked while mentioning free health cards initiative of the present government.",
  "retrievedAt": "2025-08-11T20:21:33.669Z"
}
