{
  "title": "Govt’s reforms agenda to help meeting int’l health regulations",
  "link": "https://www.app.com.pk/national/govts-reforms-agenda-to-help-meeting-intl-health-regulations/",
  "date_published": "2021-02-14T10:03:00.000Z",
  "source": "APP",
  "content": "Pakistan Tehreek-e-Insaf (PTI) government’s health reforms agenda and implementation of national action plan will help developing a strong health system in line with international health regulations.\nIn order to build national surveillance and response capacity, all stakeholders have been engaged to undertake the desired capacity building efforts. For the purpose, a strategic framework for public health laboratories network, integrated disease surveillance and response and legal framework for surveillance has been developed.\nFor effective reforms in the sector, the federal government had developed a National Action Plan (2019-23). Meanwhile, provincial departments of health (DOH) have also finalized provincial health sector strategies aligned to National Health Vision.\nThe government has also established ‘emergency operation centres and coordination units’ for disease surveillance and response at federal and provincial level to provide meaningful information for actions.\nSimilarly, based on “One Health” approach, national and provincial focal points have been notified. A ‘national task force on heath’ was formed which is systematically reviewing key strategic priorities and functions to improve efficiency and effectiveness of health system.\n“Concrete steps are being taken to ensure universal health coverage for having safer and healthier future of every citizen in the country,” Special Assistant to Prime Minister on National Health Services, Regulations and Coordination Dr Faisal Sultan said.\nHe said universal health coverage under Sehat Cards would eventually revolutionalize the healthcare system and termed it a major step towards welfare state under sublime principles of Riyast-e-Madinah.\n“Health reforms introduced by the government were focused to improve quality of healthcare system by introducing reward and punishment system at government hospitals,” he added.\n“The government will make more investment in health system to ensure protection from diseases utilizing all available resources.”\nThe SAPM said the government has already provided free medical services to its citizens and is working on reform agenda to improve health sector performance.\nHe mentioned that Ministry of National Health Services has completed work on a project ‘Benefit Package of Pakistan’ to support the health reforms agenda in the country. Initially the benefit package will be started in two districts of each province and an area of every region.\nThe government has also developed and approved first ever Health Strategy for Islamabad Capital Territory (ICT) to ensure implementation of Islamabad Healthcare Model District, he said.\nMedia error: Format(s) not supported or source(s) not found\nJoint Executive Director Pakistan Institute of Medical Sciences (PIMS) Dr Minhaj Us Siraj said the hospital management has initiated various innovative projects to ensure implementation of health reforms agenda on the direction of Prime Minister Imran Khan.\n“This quality healthcare system is meant to provide citizens better medical facilities at public sector hospitals,” he said.\n“PIMS frontline caregivers have been leading in implementation of ‘Health for All’ agenda even before the current pandemic. We ensure that our staff is educated, trained and have resources they need.”\nHe said over 10,000 patients visit PIMS daily for treatment of various diseases. Six hospitals are working under PIMS including Children hospital, Cardiac Centre, Gynae Department and newly built Dentistry section. “We have already converted our emergency department on scientific line. A team of health professionals and trained nurses was available round the clock to immediately deal with emergency and routine cases.\nHe said special procedures have been adopted for emergency patients in view of the corona virus. There is also a set procedure to treat general emergency and cardiac emergency and facilities at hospitals were being improved with a vibrant role of doctors, nurses and paramedics.\n“Strong primary health care can provide people with the quality care they need, right in their communities. The administration of FGPC hospital tried its level best to ensure provision of best services at its dispensaries in the federal capital,” Dr Sharif Astori from Federal Government Poly Clinic (FGPC) said.\nUnder health sector reforms, various dispensaries were upgraded and the citizens of federal capital were availing free diagnostic and treatment facilities from these dispensaries besides free vaccination services, he added.\nDr Astori said that public sector hospitals were contributing a lot by providing best health services to citizens on the direction of the federal government. “Our efforts are meant for ensuring universal health coverage to people in line with the government’s reforms agenda.”\nHe said over 7,000 patient daily visit Poly Clinic hospital for treatment of multiple health complications. Despite heavy burden of patients on the hospital, the administration always tried to satisfy patients.\nDr Khawar Sultan Chairman Insaaf Doctors Forum saw the reforms agenda as a step forward to provide better health facilities to ailing Pakistanis. “Availability of better resources would definitely improve the healthcare system. Our basic aim should be improvement of the system.”\nHe hoped the government would fulfill its commitment to bring positive changes for improvement of the healthcare system especially to cater the needs of poor and needy people in the country.",
  "retrievedAt": "2025-08-11T20:21:33.644Z"
}
