{
  "title": "Mushahid lauds Pak Navy’s ‘Maritime Diplomacy",
  "link": "https://www.app.com.pk/national/mushahid-lauds-pak-navys-maritime-diplomacy/",
  "date_published": "2021-02-14T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Senator Mushahid Hussain Sayed, Chairman, Senate Foreign Affairs Committee has lauded Pakistan Navy’s Maritime Diplomacy as an example of Pakistan’s soft power outreach and ability to bring 45 diverse countries and navies on a common platform of peace in the Indian Ocean Region.\nHe was delivering the keynote address at the International Maritime Conference organised by National Institute of Maritime Affairs (NIMA), as part of the Pakistan Navy’s AMAN exercises, said a press release issued here.\nSenator Mushahid appreciated the Pakistan Navy’s positive regional role in peacetime, particularly anti-piracy operations and humanitarian help to victims of conflicts and natural disasters in the Indian Ocean Region.\nReferring to the geopolitical context, he talked about about the resurgence of the ‘Asian Century’ with an inexorable shift in the global balance of economic & political power from the West to the East. Senator Mushahid Hussain also analysed two contrasting visions for the future of Asia.\nThere is China’s Belt & Road Initiative (BRI), of which CPEC is the flagship, which focuses on connectivity and cooperation, with over 100 countries signed on to BRI. Conversely, there is talk of a ‘New Cold War’ through policies that seek ‘containment’ of China, led by the Quad of 4 countries: US, India, Japan and Australia.\nTalking of Pakistan’s foreign relations, he referred to Quaid eAzam’s vision of ‘peace within and peace without’, hence, Pakistan’s expanding role in regional connectivity.\nHe said today Pakistan has ‘strategic space’ with CPEC, Pakistan’s pivotal role on peace in Afghanistan, India increasingly mired in its own problems due to Modi’s shortsighted policies and a less interventionist, more inward-looking USA under President Biden.\nGiven this context, Senator Mushahid Hussain proposed a 3-point plan of policy doables to promote ‘Maritime Diplomacy’.\nFirst, since 50,000 square kilometres has been added to Pakistan’s seabed territory, from 200 nautical miles to 350 nautical miles, thanks to a UN ruling of the Conference of the Law of the Sea, the Government must initiate and implement a comprehensive Maritime commercial policy, with the Continental Shelf in the Indian Ocean as the core, and Pakistan Navy in the lead role.\nSecond, Pakistan should be the bridge between CAREC, the 11 country Cooperation forum for Central Asian countries, and RCEP, the 15 country free trade agreement in Southeast Asia. China is member of both CAREC and RCEP, while India is member of neither. That will open up huge economic opportunities.\nThird, in the wake of this successful ‘Maritime Diplomacy’, Pakistan needs to take a regional initiative on related issues of Climate Change and Cultural Tourism, which can provide a basis for regional cooperation on areas of common interest.\nPakistan is among the 5 top vulnerable countries to the vagaries of Climate Change, with South Asia’s 500 million people living along the coastline facing the challenge of global warming.\nOnn Cultural Tourism, he referred to opening up of Kartarpur Corridor for the Sikh Community, the Buddhist historic sites in Taxila and Takhtbai as well as Hindu holy sites.\nOther speakers in the session included Naval leaders from Indonesia & Nigeria, as well as academic, Professor Huma Baqai.\nThere was an animated question/answer session at the end of the Seminar.",
  "retrievedAt": "2025-08-11T20:21:30.593Z"
}
