{
  "title": "World needs to explore economic potential of digitalization: EU Envoy",
  "link": "https://www.app.com.pk/business/world-needs-to-explore-economic-potential-of-digitization-eu-envoy/",
  "date_published": "2021-02-14T11:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): European Union Ambassador to Pakistan, Androulla Kaminara Sunday said that the world needed to explore economic potential of digitalization as it had changed the working of the Global system due to its multi-dimensional impacts, including time efficiency and accuracy.\nShe said digitalization and Artificial Intelligence (AI) had changed the world pattern of working and it was more importance of using technology for people to create a fair and competitive economy, as well as an open, democratic and sustainable society.\nShe expressed these views with APP’s journalist Shabbir Hussain after a webinar convened by the Delegation of the European Union to Pakistan aimed at to showcase European policy initiatives on Digitization and to discuss the challenges and potential of the digital economy in Pakistan.\nShe said that digital transformation for economic growth and recovery required close collaboration, shared learning and exploring opportunities to work together on areas such as health, governance and satellite mapping.\nAndroulla Kaminara underlined the need for regulation of the digital space to ensure respect for human rights, including the right to privacy and freedom of speech and safety of vulnerable groups such as women and children.\nSharing details of the webinar, she said it was an attempt to start a continuous process of sharing best practices and legislative approaches between the EU and Pakistan, which could create opportunities for dialogue, partnerships and investments promoting regional and global connectivity.\nReplying to a question, she said the Covid19 pandemic was accelerating the digital transformation and also exposing its challenges, the webinar was a timely opportunity to share experiences and expertise.\nShe also highlighted how digitalization had impacted infrastructure, education and social systems in EU Member States and its partner countries and offered examples of potential venues for cooperation.",
  "retrievedAt": "2025-08-11T20:21:33.141Z"
}
