{
  "title": "Maritime Minister, National Security Adviser join int’l maritime conference",
  "link": "https://www.app.com.pk/national/maritime-minister-national-security-adviser-join-intl-maritime-conference/",
  "date_published": "2021-02-14T16:42:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 14 (APP):Federal Minister for Maritime Affairs Syed Ali Zaidi and Special Assistant to the Prime Minister on National Security Dr Moeed Yusuf among global maritime experts participated the 9th International Maritime Conference (IMC) 2021.\nThe 9th International Maritime Conference (IMC) 2021 organized by National Institute of Maritime Affairs (NIMA), under the aegis of Pakistan Navy and being conducted in tandem with 7th Multinational Naval Exercise AMAN-21,was in progress at Karachi, said a Pakistan Navy press release.\nThe IMC was themed on ‘Development of Blue Economy under a Secure and Sustainable Environment: A Shared Future for Western Indian Ocean Region’. The Second Day of the IMC featured eminent international and national scholars to elucidate variety of issues pertaining to maritime security, environment and relevant growth opportunities in the region.\nThe Second Day of the Conference was divided into three Sessions; Special Assistant to Prime Minister on National Security, Dr Moeed Yusuf graced the First Session as Chief Guest.\nIntellectuals across the globe extended their views on ‘Need of Maritime Security and Sustainable Growth – A Shared Vision for Western Indian Ocean Region’. During the session, Executive Director Institute of China America Studies, USA Dr. Nong Hong, delivered important keynote on BRI and its Implications on Maritime Security in the Indian Ocean Region and emphasized on keeping Indian Ocean stable in the wake of non-traditional security threats where interests of multiple stakeholders converge. Later, Commander Karachi Vice Admiral Faisal Rasul Lodhi, during his talk, enlightened the audience on Pakistan Navy’s contributions for Maritime Security and Regional Stability in the Western Indian Ocean Region.\nThe last speaker of the session was Rear Admiral (LH) Murat Dincman of Turkish Navy, who provided valuable insight on Turkish perspective on Maritime Security Challenges.\nDuring the Second Session, Federal Minister for Maritime Affairs, Syed Ali Haider Zaidi, graced the session as Chief Guest. Distinguished scholars presented their talks on ‘Development of Pakistan’s Maritime Sector and Blue Economy’.\nCEO JS Global, Mr Kamran Nasir highlighted Maritime Potential of Pakistan and Opportunities for Capitalizing on Blue Economy whereas, Executive Director, Pakistan National Shipping Corporation Mr. Khurram Mirza discussed Private Sector’s Engagements in the Shipping Industry of Pakistan.\nAdditionally, Head of Maritime Education & Training World Maritime University, Sweden Dr. Michael Ekow Manuel emphasized on the importance of Maritime Research Training in Education.\nLater, Head of Marine and Aviation, Lloyd’s Market Association, UK, Mr Neil Roberts presented paper on Marine Insurance Supporting the Blue Economy and the last speaker of the session was Dr Edmund Hughes from Green Marines Associates, UK underscored the Contemporary Shipping Trends and Regulatory Requirements for Safety Management and Environment.\nIn the third and last session of the day, Chief of Staff, Vice Admiral Ahmed Saeed graced the event as Chief Guest. During the session Scholars discussed the contours of ‘Contemporary Strategic Environment of Indian Ocean Region and Opportunities for Regional Cooperation’.\nSenator, Mushahid Hussain Syed was the first speaker to share his views on Significance of Building Strategic Partnership for Socio – Economic in Indian Ocean Region.\nBesides, Mayor Laut (P) Dedi Gunawan Widya tmoko from Indonesian Navy delivered talk on the roles of navies and Coast Guard in the South China Sea disputes and Take Aways for Western Indian Ocean Region.\nBesides, CT Ops Nigerian Navy, Rear Admiral Ibikunle Taiwo Olaiya discussed Nigeria’s Blue Economy Potentials and Sustainable Development in the Gulf of Guinea.\nThe last speaker of the session was the Associate Dean, IBA Dr Huma Naz Baqai who presented the paper on the Tripolar Great Game, Competition, cooperation or Acute Confrontation.\nThe conference was attended by a large number of dignitaries from across the globe, Defence Forces officers from Pakistan and friendly countries, academia, media representatives and researchers from local and international think tanks.\nInternational Maritime Conference (IMC-21) is being held from 13th to 15th February 2021 covering the thoughts of distinguished International and National scholars.",
  "retrievedAt": "2025-08-11T20:21:31.003Z"
}
