{
  "title": "SCCI to organize conference to highlight business community issues",
  "link": "https://www.app.com.pk/national/scci-to-organize-conference-to-highlight-business-community-issues/",
  "date_published": "2024-02-13T15:07:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 13 (APP):President Sarhad Chamber of Commerce and Industry (SCCI), Fuad Ishaq announced organizing a conference titled  “Watan Kay Maimar Tajir Aur Sanatkar’ (Builder of Nation), Trader and Industrialist] in the first week of May.\nHe said the conference aims to introduce current economic turmoil and business community problems in Khyber Pakhtunkhwa before the federal and provincial governments and frame a charter of the economy.\nPolitical leaders, high government officials, important dignitaries and members of the business community would be invited to the conference.\nFuad Ishaq announced while chairing a meeting of SCCI’s executive committee held here at the chamber house on Tuesday.\nThe meeting was attended by the chamber Senior Vice President Sanaullah Khan, Vice President Ijaz Khan Afridi, former Presidents Zahidullah Shinwari, Riaz Arshad, Zulfiqar Ali Khan, Engr Maqsood Anwar Pervez, Faiz Muhammad Faizi, Sherbaz Bilour, Ex-Senior Vice Presidents Imran Khan Mohmand, Engr Saad Khan Zahid, former Vice Presidents Haji Abdul Jalil Jan, Haris Mufti, members of the chamber executive committee Affaf Ali Khan, Pervez Khan Khattak, Farhad Asfandyar, S. Minhajuddin, Hamza Ibrahim Butt, Haji Ghulam Hussain, Kashif Amin, Ismail Khan Safi, Qurat ul Ain, Faiz Rasool and Ishtiaq Muhammad and others.\nThe meeting approved the utilization of all resources to make the conference successful. K-P has been blessed with ‘God-gifted’ natural resources like oil, gas, hydel power generation, marble, agriculture, tourism, mining, minerals and others, Fuad said.\nHe added that despite these unmatched natural reserves, the youth of our province are unemployed and the business community has faced enormous challenges and issues.\nThe SCCI chief underscored the need to frame a comprehensive 20-year economic development and prosperity plan in Khyber Pakhtunkhwa.\nHe maintained KP was lagging as compared to federating units despite the countless mineral deposits and other natural resources.\nWhy KP’s businessmen, industrialists, traders and shopkeepers are upset and disappointed and the youth of the province unemployed, wherein treasures of natural resources exist, Fuad questioned.\nThe chamber president said the youth of the KP province are highly talented and skilful and only need to provide them equal opportunities to play their role in the economic prosperity and development of the province.\nFuad Ishaq informed that the purpose of the conference was to frame a joint policy by presenting business community issues before the government, political leaders and stakeholders to promote business, trade and industries, besides creating employment avenues for youth in the province.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:38:05.484Z"
}
