{
  "title": "PPP to puts its weight in PML-N’s candidature’s slot for PM: Bilawal",
  "link": "https://www.app.com.pk/national/ppp-to-puts-its-weight-in-pml-ns-candidatures-slot-for-pm-bilawal/",
  "date_published": "2024-02-13T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Chairman Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari on Tuesday announced to support the candidate of Pakistan Muslim League-Nawaz (PML-N) for Prime Minister and abstain from joining to be coalition government’s federal cabinet.\nAddressing a press conference here after the meeting of party’s Central Executive Committee (CEC), he said that PPP was accepting the election results despite its concerns in the larger interest of the country.\nHe said the reality was that his party did not have a mandate to form the government in the federation, adding that the PML-N and the independents had greater numbers in the Centre. “I will not be putting myself forward for the candidacy of the prime minister,” he said.\nBilawal Bhutto said the PPP had formed a committee to engage with other political parties for the formation of government and political stability in the country.\n“PPP has decided that we ran this general election on a manifesto based on issues of public importance; we want to restore political stability and end this environment of political toxicity,” he added.\nThe PPP chairman said that his party had raised concerns regarding a level playing field with former President Asif Ali Zardari during the PPP’s CEC meeting and the latter had assumed that these complaints would be addressed.\n“I am assuring the public that the Parliament will be formed and it is a forum where their issues will be resolved,” Bilawal Bhutto said.\nHe said that now the Pakistan Tehreek-e-Insaf (PTI) had refused to form a coalition government with the PPP which left the PML-N as the only party that had invited PPP to join the upcoming coalition government.",
  "retrievedAt": "2025-08-11T00:38:29.976Z"
}
