{
  "title": "KE told to ensure uninterrupted power supply as Karachi struggles with crippling outages - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The provincial government on Thursday finally stepped in, urging K-Electric to ensure uninterrupted power supply as the city continued to grapple with a severe power crisis, despite the monsoon system having subsided and no heavy spells of rainfall expected.\n\nSindh Energy Minister Syed Nasir Hussain Shah paid a surprise visit to KE’s head office following a spate of public complaints and expressed serious concern over the prolonged loadshedding. He directed KE officials to take immediate and practical measures to address citizens’ grievances.\n\nIn a statement, the power utility claimed that its network was stable and that feeders affected by the rains had been restored.\n\nDespite KE’s claim of normal power supply after the recent rains, residents reported prolonged outages lasting several hours, with some areas going without electricity for more than 48 hours, casting doubt on the performance of the city’s sole power utility.\n\nMinister Nasir Shah makes surprise visit to utility’s head office amid mounting complaints; KE attributes electricity failures to localised faults caused by rains\n\nPower outages in some localities, lasting 30-36 hours, were attributed to localised faults in underground cables, which require complete drainage of rainwater before repairs can be carried out.\n\nA resident of Block-10, Gulistan-i-Jauhar, said that his part of the neighbourhood had been without electricity for the past three days.\n\nAccording to a KE spokesman, teams were working round the clock to repair localised faults, but the utility did not disclose the exact number of cases reported across the city. Reports suggested that heavy rains had triggered faults in almost all areas, resulting in prolonged power outages for many residents.\n\nThe affected localities included Gulshan-i-Iqbal, Korangi, Malir, North Nazimabad, Bhitai Colony, PECHS, Gulzar-i-Hijri and Surjani Town, with some neighbourhoods facing outages for more than 24 to 48 hours.\n\nExpressing grave concern over the continued power crisis in Karachi, the energy minister directed the power utility to keep field staff and machinery mobilised on an emergency basis. He instructed KE to prepare a comprehensive plan for the timely repair and restoration of feeders, noting that prolonged outages were not only disrupting citizens’ daily lives but also severely affecting the supply and drainage of water from pumping stations.\n\nKE officials assured the minister that the company would further improve its services and utilise all available resources to ensure timely resolution of complaints.\n\nMr Shah also announced that he would again pay a surprise visit to KE’s head office to review the measures taken to address public grievances.\n\nMeanwhile, police on Thursday registered a case against the management of KE on charges of manslaughter after a youth and his teenage brother were electrocuted in Shah Faisal Colony during the rain on Tuesday evening.\n\nThe FIR has been lodged against the management of the utility on the complaint of the victims’ father, Sultan, under Section 322 of the Pakistan Penal Code.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:30.661Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933138/ke-told-to-ensure-uninterrupted-power-supply-as-karachi-struggles-with-crippling-outages",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:36.000Z"
}
