{
  "title": "PPP finally decides to enter the by-polls fray - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: As the PTI is still in two minds over contesting the upcoming by-polls, the Pakistan People’s Party (PPP) has finally decided to invite applications to enter the ‘contest with PML-N’.\n\nThe PPP has shown interest in contesting on six vacant seats – NA-143 and PP-203 (Sahiwal), NA-185 (Dera Ghazi Khan), and NA-96, NA-104 and PP-98 (Faisalabad) – and sought applications from the interested candidates.\n\nThe by-polls on these six seats will be held in the first week of October. Interestingly, on the other three seats – NA-129 (Lahore), NA-66 (Wazirabad) and PP-87 (Mianwali) – where by-elections are going to take place on Sept 18, the PPP has not yet announced candidates.\n\n“The PPP leadership that gave an open field to its senior ally PML-N on the Sept 18 by-polls on three seats, is apparently persuaded by the Punjab chapter leaders who asked it not to totally surrender to the will of the Sharifs in the province. Therefore, the party has now sought applications from the interested candidates so that it could have some bargaining chip with the PML-N close to the polls,” a PPP insider told Dawn.\n\nParty invites application in six constituencies\n\nHe said some PPP leaders in Punjab were [literally] upset when the top leadership did not give them a go ahead to field candidates on the three by-poll seats especially in Lahore.\n\nIt is worth mentioning that the top PPP leadership have already asked Punjab Governor Sardar Saleem Haider Khan and ‘outspoken’ Hasan Murtaza to keep mum when it comes to criticism of Chief Minister Maryam Nawaz.\n\n“After some strong outburst against CM Maryam in the past, both PPP leaders in question were given a warning by President Asif Ali Zardari not to target her anymore,” he said.\n\nIn the past, the PML-N and PPP also used to have an agreement that either of the party wouldn’t contest against each other in by-polls if the first runner-up was from (either of) it.\n\nHowever, in the current scheme of things, none of the party believes this agreement is still intact between them. PPP (Parliamentarians) General Secretary Nayyar Bokhari did not respond to Dawn’s queries in this regard on Thursday. However, he told a local daily that the PPP would decide to contest by-polls after consulting the PML-N since it was in alliance with it.\n\nOn the other hand, the PTI is still giving it a second thought to contest the by-poll.\n\n“Though PTI patron-in-chief Imran Khan has barred the party from contesting the by-poll, some leaders are of the strong view that the PML-N government should not be given an open field to grab these seats,” a PTI leader told Dawn.\n\nHe said Mr Khan would be conveyed the sentiment within the party and it was likely that he might change his mind. “We are pretty sure that the PTI will not leave the field open for the PML-N to grab these seats,” he said.\n\nEarlier, Mr Khan had said the PTI would not field candidates to show solidarity with disqualified members who stood firm with the party despite extreme challenges.\n\n“The party will completely boycott the vote,” Imran Khan had said in a recent tweet.\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:20.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933586/ppp-finally-decides-to-enter-the-by-polls-fray",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T04:22:50.000Z"
}
