{
  "title": "PM contacts party leaders to discuss flood relief efforts - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Assures Sindh, KP authorities of cooperation in flood response and disaster management\n• Inaugurates Pakistan’s first business facilitation centre\n\nISLAMABAD: Prime Minister Sheh­baz Sharif on Thursday reached out to leaders of mainstream political parties and assured them of the federal government’s cooperation and support in dealing with the aftermath of floods and monsoon rains.\n\nAccording to the Prime Minister’s Office (PMO), the PM telephoned PPP Chairman Bilawal Bhutto-Zardari and expressed grief over the loss of lives caused by the torrential rains and urban flooding in southern Sindh, particularly Karachi.\n\nHe offered full support from the federal government to assist the Sindh government in addressing the emergency situation.\n\nPrime Minister Shehbaz directed the National Disaster Management Autho­rity (NDMA) chairman to stay in close coordination with the Sindh government, provide all possible assistance to the Provincial Disaster Management Autho­rity (PDMA), and ensure the early warnings to the people about potential risks.\n\nThe prime minister also spoke with Jamaat-i-Islami (JI) emir Hafiz Naeemur Rehman and Federal Minister for Education and Professional Training Dr Khalid Maqbool Siddiqui.\n\nDuring his conversation with the JI emir regarding the damage caused by recent rains in Khyber Pakhtunkhwa and ongoing relief efforts, the PM appreciated the proactive role of the Al-Khidmat Foundation in rescue and relief operations.\n\nHe also discussed with Dr Khalid Maqbool Siddiqui the recent rains and flood situation in Sindh, as well as potential risks from expected rainfall, assuring full cooperation from NDMA and other federal institutions to address any emergency situation.\n\nBusiness Facilitation Centre\n\nLater, Prime Minister Shehbaz inaugurated the country’s first-ever Business Facilitation Centre (BFC), aimed at promoting ease of doing business and attracting investment in Pakistan by providing a one-stop solution for investors and entrepreneurs.\n\nEstablished by the Board of Investment (BoI), the BFC will facilitate the business community by providing a wide range of services, including guidance on regulatory requirements and facilitating business registration, licensing, and permits.\n\nThe centre will serve as a one-stop service, reducing hurdles and facilitating efficient interaction between businesses and government entities.\n\nThe prime minister was briefed on the centre’s operations, including investor gui­­dance, application processes for special economic zones, and streamlined procedures for licensing and payments with significantly reduced timelines.\n\nHe also unveiled the project plaque and exp­res­sed his intent to replicate the mo­­del acr­oss the country if it meets its objectives.\n\nThe prime minister urged all the relevant departments to efficiently run the centre to make it a success by facilitating and guiding the investors from other sectors, just like other countries.\n\n“Otherwise, this will be nothing more than brick and mortar. That is not my vision… We should welcome customers with a smiling face combined with genuine support without any delay, not even for a second,” he advised.\n\nThe PM emphasised the need to promote the facilitation centre internationally and establish it as a model to be replicated in other parts of the country.\n\nPM Shehbaz, who also visited different desks of the facilitation centre, was told that the investors would be able to submit their applications for setting up special economic zones or other projects at the centre, by answering different queries such as the nature of the business, loan and equity structure, target market, export potential, expected employment generation, and utility requirements.\n\nThe system will reflect all attached documents as well as an activity log, besides enabling the applicant to track their application, who will also be timely informed about any shortcomings on their part.\n\nIn his remarks, BoI Minister Qaiser Ahmed Sheikh described the centre’s establishment as a major breakthrough in investment facilitation. He noted that previously, investors had to visit multiple departments to complete the procedures for setting up businesses.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a7ab6480e7c.gif",
  "retrievedAt": "2025-10-12T03:52:07.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933258/pm-contacts-party-leaders-to-discuss-flood-relief-efforts",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:05:40.000Z"
}
