{
  "title": "President Zardari constitutes 11th National Finance Commission to divvy up revenue - Business - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari on Friday constituted the 11th National Finance Commission (NFC) to announce a new award for the sharing of federal divisible resources between the Centre and the provinces.\n\nAccording to a notification from the Finance Division, the president constituted the commission with Finance Minister Muhammad Aurangzeb as the chairman and the four provincial finance ministers as its members.\n\nThe commission also includes former bureaucrat Nasir Mahmood Khosa as a member representing the Punjab government, economist and researcher Asad Sayeed as a member representing the Sindh government, former bureaucrat Dr Musharraf Rasool Cyan as a member representing the Khyber Pakhtunkhwa government and Farmanullah as a member representing the Balochistan government.\n\nThe commission will make recommendations to the president on the distribution between the federation and the provinces of the ““net proceeds of the taxes mentioned in clause (3) of Article 160 of the Constitution”, it read.\n\nThe taxes are taxes on income, including corporation tax, but not including taxes on income consisting of remuneration paid out of the Federal Consolidated Fund; taxes on the sales and purchases of goods imported, exported, produced, manufactured or consumed; export duties on cotton, and such other export duties as may be specified by the president; duties of excise as may be specified by the president and other taxes as may be specified by the president.\n\nThe body will also recommend the president regarding the grants-in-aid by the federal government to the provincial governments and the exercise, by the federal government and the provincial governments, of the borrowing powers conferred by the Constitution.\n\nThe commission will further make recommendations to the president on issues relating to the sharing of financial expense incurred or to be incurred by the federation in respect of subjects and matters falling within the domain of the provinces; issues relating to the sharing of financial expense incurred or to be incurred by the federation or the provinces or both in respect of trans-provincial matters; issues relating to financial expense for national projects to be shared by the federation and the provinces; and any other matter relating to finance referred to the commission by the president.\n\nFor several years, policymakers associated with the finance ministry, as well as political actors across different parties at the centre, have spoken about revising revenue transfers to the provinces to improve the federal government’s financial position.\n\nThe 10th NFC expired on July 21. The 7th NFC Award has now been in effect for nearly 15 years — far beyond its five-year tenure. The president has extended the award every year due to a disagreement between the provinces and the Centre over the new formula.\n\nThe 18th Amendment provided constitutional protection to the share of the federating units, stipulating that a sub-federation’s share in any future award must not be less than its share in the previous award.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:11.404Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934294/president-zardari-constitutes-11th-national-finance-commission-to-divvy-up-revenue",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T15:10:20.000Z"
}
