{
  "title": "Fact-finding committee finds senior journalist ‘died by suicide’ in Sanghar - Pakistan - DAWN.COM",
  "author": null,
  "content": "A fact-finding committee formed by police investigating the death of senior DawnNews reporter Khawar Hussain Bajwa has ruled that he died by suicide, according to a copy of its final report available with Dawn.com.\n\nThe senior journalist was found dead in his car last week, parked on Hyderabad Road in Sanghar under what police termed “mysterious circumstances”. The body was found in the driving seat, with a gunshot wound to the head.\n\nThe day after the incident, police said that they were probing the incident “from all possible angles” and a fact-finding committee had been formed to probe Hussain’s death. This committee, led by Sindh Additional Inspector General of Police (IGP) (Counter-Terrorism Department) Azad Khan, comprised Karachi West Zone Deputy IGP Irfan Baloch and Sanghar Senior Superintendent of Police (SSP) Abid Baloch.\n\nThe committee reached its conclusion based on a detailed examination of the crime scene, interviews of witnesses, examination of postmortem and forensic reports and analysis of CCTV footage, concluding that the cause of death was suicide.\n\n“It is clear from the firearm forensic report that the lone bullet that caused [the] death of the deceased was fired from his 9mm licensed pistol, recovered from his right hand,” the report read.\n\nThe report noted that Hussain’s vehicle was parked outside a restaurant in Sanghar for two hours, according to an “exhaustive” analysis of CCTV footage from the scene. It stated that there was no evidence that he met anyone, nor did anyone approach the vehicle.\n\n“The blackening (soot deposition) around the entry wound mentioned in the first postmortem report of Civil Hospital Sanghar suggests a close-range shot. The re-postmortem carried out at LUH (Liaquat University Hospital), Hyderabad, mentions blackening, charring (burn around wound margin) and muzzle mark (abrasion/imprint of muzzle of weapon on skin) at entry wound.”\n\nThe report stated that muzzle marks are produced when the muzzle of a firearm is pressed firmly against the skin at the time of firing.\n\n“The findings exclude homicide or accidental fire as a cause of death,” the report stated. “The committee finds suicide as the only probable cause of death.”\n\nThe committee was also of the opinion that Hussain died sometime between 9:58pm and 10:35pm. It also noted that its findings are unlikely to change, despite reports pending from laboratory and gunshot residue tests.\n\n“A number of journalists and acquaintances confided, off the record, about some friendships of the deceased, that were [the] cause of severe rift between him and his spouse,” the report stated, mentioning that the motive behind the incident needed further investigation.\n\n“However, this aspect was not touched upon for the time being, as this would require interviewing and questioning his friends, colleagues and family members, at this time of grief.”\n\nA request was submitted to the Sindh Home Department for the constitution of a medical board comprising senior doctors and forensic experts to perform a “fair, transparent, and impartial postmortem examination”.\n\nSanghar SSP Baloch said that Hussain’s brother-in-law told police that he did not inform them about his Saturday arrival, although he asked them to hold an annual religious ritual as per the family’s tradition. Hussain had neither told friends in Sanghar about his visit nor did he attend the ritual.\n\n“His sister confirmed that he had celebrated Eidul Azha with her on her insistence, after their parents shifted to the US this May,” he said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:10.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934160/fact-finding-committee-finds-senior-journalist-died-by-suicide-in-sanghar",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T13:14:41.000Z"
}
