{
  "title": "Leeds face daunting trip to Arsenal, City aim to build momentum - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Leeds United enjoyed a triumphant return to the Premier League with a home victory over Everton at Elland Road this week, but Saturday’s trip to north London to face Arsenal could prove a reality check for Daniel Farke’s side.\n\nTheir clash at Arsenal is one of several intriguing fixtures on the second weekend of the top-flight season which kicks off on Friday with Chelsea at West Ham United.\n\nManchester City will aim to build early momentum as they face Tottenham Hotspur at home on Saturday while champions Liverpool travel to Newcastle United in the final offering on Monday.\n\nIt says something about the standards expected of Mikel Arteta’s Arsenal when a 1-0 win at Manchester United was greeted with negativity. They banked three points despite new big-money striker Viktor Gyokeres failing to manage a shot on target and the team’s xG (expected goals) of 0.28 being third-lowest on the opening weekend.\n\nMore will be expected on Saturday from their attack, and Gyokeres in particular, as Arsenal seek to extend a remarkable 42-match unbeaten run at home against promoted clubs.\n\nThey have won 37 and drawn five of those with their last loss coming against Newcastle United in November 2010.\n\nAvoiding defeat will match Chelsea’s unbeaten run against promoted teams from 2001-2015, but that will not be playing on the mind of Arteta, who has bigger fish to fry this campaign, chiefly ending a five-season trophy drought.\n\nLeeds have lost their last six meetings with Arsenal, but will arrive in buoyant mood even if it is hard to make a case for them winning their opening two games in a top-flight campaign for the first time since 2002.\n\nWhile Leeds continued their summer spending by signing forward Noah Okafor from AC Milan on Thursday, Arsenal’s splurge shows no sign of ending with Crystal Palace forward Eberechi Eze set to become their fourth marquee acquisition after Gyokeres, Martin Zubimendi and Noni Madueke.\n\nPep Guardiola will need no reminder of the problems he has often encountered against Tottenham. Last season the north Londoners won 4-0 at the Etihad Stadium as City’s hopes of a fifth successive title began to disintegrate spectacularly.\n\nIt feels like a new era for City though and it began with a 4-0 rout of Wolverhampton Wanderers in which new recruits Tijjani Reijnders and Rayan Cherki both scored and Erling Haaland grabbed a brace.\n\nTottenham, who finished 17th last season, began with a 3-0 win against promoted Burnley but a rejuvenated City will offer more instructive evidence of the north London club’s potential under new manager Thomas Frank.\n\nChelsea used six attackers signed for a combined 250 million pounds ($336.15 million) in their opening game against Crystal Palace but none could break the deadlock in a 0-0 draw.\n\nThe journey across town to a West Ham side already under a cloud after a 3-0 drubbing at promoted Sunderland might provide lift-off for the likes of Joao Pedro, Jamie Gittens, Estevao Willian or Liam Delap.\n\nNowhere will tensions run higher this weekend than in south London where Crystal Palace face Nottingham Forest on Sunday.\n\nOrdinarily it would be a clash between two passionately-supported clubs with no obvious rivalry. But things have changed. FA Cup winners Palace’s demotion from the Europa League to Conference League because of breaches of UEFA’s multi-ownership rules was a bitter pill to swallow and made worse by the fact their place went to Forest.\n\nPalace are in action in their Conference League playoff against Fredrikstad on Thursday and their fans will be keen to bring Forest down to earth after Nuno Espirito Santo’s team beat Brentford 3-1 in their opener.\n\nNewcastle’s home opener against champions Liverpool on Monday under St James’ Park’s lights is the stand-out match of the weekend, but also one under a cloud created by United’s stand-off with striker Alexander Isak.\n\nIsak has made it clear he wants to move to Liverpool and will again not be part of the squad as Newcastle refuse to bend to the Sweden international’s desires.\n\nLiverpool have largely stayed out of the spat after having a reported 110 million pounds ($148.34 million) bid rejected and maybe already have enough firepower as new signing Hugo Ekitike scored a goal and made an assist in a 4-2 home win against Bournemouth to open the defence of their title.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/221300420fcf12f.jpg",
  "retrievedAt": "2025-10-12T03:52:27.573Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933210/leeds-face-daunting-trip-to-arsenal-city-aim-to-build-momentum",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:18.000Z"
}
