{
  "title": "Ex-SBCA chief, 18 others acquitted in Nasla Tower encroachment case - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Special Anti-Corruption (Provincial) Court on Thursday acquitted for want of evidence former Sindh Building Control Authority (SBCA) director general Manzoor Qadir alias Kaka and others in the Nasla Tower case.\n\nThe 15-storey commercial-cum-residential building on Sharea Faisal was demolished on the directives of the Supreme Court for having been partially built on a portion of land meant for the service road.\n\nThe court exonerated all the accused of charges after hearing arguments from prosecution and defence sides.\n\nDefence counsel Barrister Iftikhar Ahmed Shah told Dawn that the court has acquitted the all “19 accused person” as prosecution failed to established its case against them.\n\nThe 15-storey building on Sharea Faisal was demolished on Supreme Court orders a couple of years ago\n\nThe accused, including SBA officers and office-bearers of the Sindhi Muslim Cooperative Housing Society (SMCHS), were charged with offences under Sections 409 (Criminal breach of trust by public servant, or by banker, merchant or agent), 420 (Cheating and dishonestly Inducing delivery of property), 468 (Forgery for purpose of cheating), 471 (Using as genuine a forged document) and 34 (Common intention) of the Pakistan Penal Code read with Section 5 (2) (Criminal misconduct) of the Prevention of Corruption Act-II of 1947.\n\nThey were tried for their alleged involvement in encroaching upon a thoroughfare, where the now demolished Nasla Tower was illegally built a couple of years ago.\n\nDuring the trial, Barrister Iftikhar argued that the extra land had been allotted to the SMCHS in 1957 by the commissioner of Karachi. He added that the land was regularised in the 1980s and the accused had no connection with either the alleged illegal allotment or the additional land allotment, as the land had been legally purchased by the SMCHS.\n\nHe further contended that the Supreme Court had ordered the demolition of Nasla Tower without considering this aspect of the case.\n\nBarrister Iftikhar claimed that the evidence and documents produced by the prosecution did not indicate that any of the accused persons had committed an act of illegality.\n\nFormer DG SBCA Qadir, SMCHS officials, master plan department director and deputy director, their subordinates and those of other departments were booked for illegal construction of Nasla Tower by occupying 341 sq-yards of a service road along Sharea Faisal.\n\nAccording to the indictment, the accused persons allegedly cheated the government by acting dishonestly and with mala fide intention. They illegally approved an additional 341 sq-yards of land in respect of Nasla Tower, which was originally meant for an amenity/service road. The land had been subleased only for 780 square yards in favour of co-accused Muzaamil Amin Darzi (owner/attorney of Giga Builder).\n\nThe indictment stated that the accused fraudulently forwarded the matter to the Master Plan Department (MPGO) for conversion of the land from residential to commercial without submitting proper title documents of the plot. On the basis of such fraudulent approval, the KMC mukhtiarkar of Jamshed Town allegedly made a false entry in the record of rights.\n\nIt further alleged that the accused were also involved in illegally processing and approving commercialisation of the plot without conducting a proper survey or verifying title documents. They fraudulently issued a conversion order for 1,121 square yards in 2007, while the approved layout plan was limited to 780 square yards.\n\nOn the basis of this fraudulent commercialisation, the accused allegedly issued an illegal NOC in 2013 for 1,121 sq-yards in respect of the plot, despite the title being only for 780 sq-yards, without forwarding the letter and complete title documents to facilitate the builder.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a7a0891648d.gif",
  "retrievedAt": "2025-08-23T07:58:30.665Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933139/ex-sbca-chief-18-others-acquitted-in-nasla-tower-encroachment-case",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:36.000Z"
}
