{
  "title": "US, Europe finalise military options on Ukraine - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON/MOSCOW: Military chiefs from the United States and a number of European countries have completed military options on Ukraine and will now present the options to their respective national security advisers, the US military said on Thursday.\n\nUS and European military planners have begun exploring post-conflict security guarantees for Ukraine, following President Donald Trump’s pledge to help protect the country under any deal to end Russia’s war in Ukraine.\n\n“These options will be presented to each nations respective national security advisers for appropriate consideration in ongoing diplomatic efforts,” a US military statement said.\n\nThe meetings between the chiefs of defence for the United States, Finland, France, Germany, Italy, United Kingdom and Ukraine took place in Washington, DC, between Tuesday and Thursday.\n\nUkraine and its European allies have been buoyed by Trump’s promise during a summit on Monday of security guarantees for Kyiv, but many questions remain unanswered.\n\nRussia carries out the biggest drone and missile attack in weeks\n\nOfficials have cautioned that it would take time for US and European planners to determine what would be both militarily feasible and acceptable to the Kremlin.\n\nOne option was sending European forces to Ukraine but putting the United States in charge of their command and control, sources said.\n\nKremlin rejects plan\n\nRussian Foreign Minister Sergei Lavrov on Thursday said any presence of European troops in Ukraine would be “absolutely unacceptable”, as Kyiv’s allies worked on security guarantees for the country.\n\n“This would be absolutely unacceptable for the Russian Federation,” Lavrov said in response to a journalist’s question about security guarantees for Ukraine, calling them “foreign intervention in some part of Ukrainian territory.”\n\nDrones, missiles attacks\n\nRussia launched hundreds of drones and missiles at Ukraine overnight, the Ukrainian air force said Thursday, Moscow’s largest attack in weeks after US-led efforts to halt the Kremlin’s invasion.\n\nThe air force said Russian forces had launched 574 drones and 40 missiles in an attack that left at least one dead. Air defence units downed 546 of the drones and 31 missiles.\n\nNord Stream blasts\n\nA Ukrainian suspect has been arrested in Italy over the sabotage of the Nord Stream underwater gas pipelines from Russia to Europe in 2022, German prosecutors said on Thursday.\n\nThe man, identified as Serhii K., is accused of being part of a cell “who placed explosive devices on the Nord Stream 1 and Nord Stream 2 gas pipelines”, they said.\n\nHe is “believed to have been one of the coordinators of the operation” in which a group allegedly hired a yacht in the German Baltic Sea port of Rostock to carry out the attacks.\n\nThe pipelines that long shipped Russian gas to Europe were hit by huge explosions in September 2022, several months after Russia launched its invasion of Ukraine.\n\nWestern powers were initially quick to blame Russia, which in turn accused them.\n\nGerman investigations then pointed to a Ukrainian cell of five men and one woman believed to have chartered the yacht “Andromeda” to carry out the attack, according to Der Spiegel magazine and other media.\n\nTheir aim was to destroy the pipelines to prevent Russia from profiting in future from gas sales to Europe. Serhii K. was arrested in the early hours of Thursday in the Italian province of Rimini on a European arrest warrant, the prosecutors said.\n\nHe and his accomplices are accused of using forged identity documents to hire the yacht that departed Rostock to carry out the attacks, the prosecutors said. Italy’s carabinieri police confirmed that a 49-year-old Ukrainian was arrested without putting up resistance, at a bungalow where he was staying with his family, and taken to a local prison.\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a7a9d4d479f.gif",
  "retrievedAt": "2025-08-23T07:58:30.805Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933238/us-europe-finalise-military-options-on-ukraine",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:26.000Z"
}
