{
  "title": "Poor internet service irks Shangla people - Pakistan - DAWN.COM",
  "author": null,
  "content": "SHANGLA: The flash floods hit areas’ residents have complained about the poor mobile and internet services, as they said they were facing problems in connectivity with their family members abroad, while the non-locals were also finding it difficult to provide relief.\n\nAccording to the Shangla administration, the search operation for the missing seven people has been underway since the area was devastated by the raging floods on Aug 15.\n\nThe administration said that rehabilitation of roads, water supply schemes and bridges and relief activities were continuing in the area.\n\nAccording to the Shangla deputy commissioner, Muhammad Fawad, 36 people lost their lives and 24 were injured in the area, while 74 roads and 16 bridges were damaged in the floods.\n\nDayan Ghafar, a local activist from the affected Puran tehsil, told Dawn that the mobile networks were down in the area and consumers had to dial the desired numbers persistently but in vain.\n\nHe said people coming from the other areas and bringing relief for the affected people were facing severe problems due to faulty networks.\n\nHe urged the government to take serious note of this problem and improve the mobile networks and internet services for better relief activities in the area.\n\nRasool Khan Sharif said that they were in the disaster-hit area for the sixth consecutive day and were still searching for seven missing persons, adding, the floods brought big boulders and massive debris and buried everything underneath.\n\nJamal Khan, a resident of Dunkacha said that their entire population had been cut off from the rest of the district as the bridge was washed away, and the government had yet to provide any alternative bridge for crossing the river.\n\nHe said the villagers today (Thursday) crossed the river to fetch food items from Aloch bazaar by making a human chain, while neither any government official nor any elected MNA or MPA visited their village yet.\n\nThey demanded early installation of an alternative bridge on the river in Dunkacha village for crossing the river as there were sick and elderly people including women who might face some exigencies.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:26.631Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933182/poor-internet-service-irks-shangla-people",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:54.000Z"
}
