{
  "title": "Pakistan Railway bars use of brakeless, faulty coaches in trains - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Alarmed by repeated derailments and other accidents on the mainline-1 and other routes, the Pakistan Railways (PR) has decided not to use the faulty coaches without brakes in any express, passenger, or goods trains across the country.\n\nIn this connection, a directive has been issued, on the orders of the Minister for Railways Hanif Abbasi, to the PR’s divisional headquarters at Lahore, Rawalpindi, Peshawar, Multan, Sukkar, Karachi and Quetta, and the officers concerned have started implementing the orders.\n\nHowever, according to an insider, the orders are not being implemented by the officers responsible for running the goods trains’ operations, as the brakeless, faulty wagons are still in use in the rakes.\n\n“Though the orders are being implemented in the passenger trains operations across the country, these are not being fully followed while operating the goods trains,” says an officer-bearer of the train drivers’ association seeking anonymity. He warned of a major derailment or accident involving any goods train if the practice of using faulty wagons is not stopped with immediate effect, hoping Mr Abbasi would take notice of the situation.\n\nThe PR high-ups have issued certain directions to the officers handling the train operations, through a letter, to ensure the safe and smooth running of all passenger and goods trains in the country.\n\n“In the wake of recent overshooting of 116-Down and 14-Down and as per orders of the Federal Minister for railways, it is directed that all passenger and goods trains will run with coaches and wagons having adequate and tested braking power,” the letter says.\n\nIt seeks that only the rolling stock cleared by the mechanical department, with certified braking efficiency, is attached to the trains. The mandatory brake power tests must be conducted before departure from originating and major stations en route, it says, adding that any coach found deficient in braking power must be detached immediately and reported for corrective action during the examination.\n\n“Strict adherence to the rules pertaining to brake power requirement must be ensured,” it warns, adding that the core objective behind the implementation of the orders is to safeguard passengers’ lives, maintain punctuality and uphold the “highest standards of train operations.”\n\nAccording to the instructions issued in the past, no “switched-off” coach is allowed in a passenger train from the originating station. However, in an extreme emergency, only one switched-off coach may be allowed from the originating station in a passenger train. However, 20pc switched-off coaches may be used in certain conditions (in passenger trains)— “not more than two in one hook and not the last one.” In goods train operation, 15pc switched-off wagons are allowed from the originating station and it can be increased to 20pc en route.\n\n“But the problem is that the trains are being run with 50pc faulty coaches in violation of the operational instructions. However, this practice is being ended gradually after issuance of the new orders,” another official told Dawn. He said the ideal situation is that the trains’ rakes have not even a single faulty coach or wagon.\n\nAccording to him, the officers concerned have started cancelling the trains having coaches with inadequate braking power.\n\nAround 75 derailments and accidents since January 2025 have alarmed the PR authorities, compelling them to take steps to ensure safe train operations in the country.\n\nThe use of a large number of faulty passenger coaches and goods wagons, including those damaged in accidents, for operations, is affecting the actual composition of all trains. Besides, other infrastructure flaws, including faulty tracks and signaling/interlocking systems, along with human errors, are also posing a threat to safe train operations across the country.\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:20.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933588/pakistan-railway-bars-use-of-brakeless-faulty-coaches-in-trains",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T04:23:58.000Z"
}
