{
  "title": "Olympic champion Lin agrees to gender test for worlds - Sport - DAWN.COM",
  "author": null,
  "content": "TAIPEI: Taiwanese Oly­mpic champion boxer Lin Yu-ting will undergo compulsory gender testing ahead of the world championships in Liverpool next month, her coach told AFP on Thursday.\n\nLin and Algerian boxer Imane Khelif were embroiled in a gender row at the 2024 Paris Olympics, where they both won gold medals in different weight classes.\n\nWorld Boxing said on Wednesday that women wanting to compete at the World Boxing Champ­ionships in Liverpool would have to undergo “mandatory sex testing” under its new policy that took effect the same day.\n\n“They announced that everyone must submit, so we will submit as well,” Lin’s coach Tseng Tzu-chiang said. “If you want to compete you have to follow the rules of the competition.\n\nSince we are participating, we will go by their rules.”\n\nUnder the new policy, athletes over 18 who want to participate in a World Boxing-sanctioned competition need to take a PCR, or polymerase chain reaction genetic test, to determine their sex at birth.\n\nLin and Khelif both fought at the Tokyo Olympics in 2021. There was no controversy at the time and neither won a medal.\n\nThe pair were excluded from the International Boxing Association’s (IBA) 2023 world championships after the IBA said they had failed gender eligibility tests.\n\nHowever, the Intern­ational Olympic Commi­ttee (IOC) allowed them both to compete in Paris, saying they had been victims of “a sudden and arbitrary decision by the IBA”. Both went on to triumph.\n\nNeither Khelif nor Lin are transgender women. Both were born and raised as women, which is how they are registered on their passports.\n\nWorld Boxing will organise the boxing competition at the 2028 Los Angeles Olympics after being granted provisional recognition by the IOC.\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/221255547ba5742.jpg",
  "retrievedAt": "2025-08-23T07:58:32.756Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933204/olympic-champion-lin-agrees-to-gender-test-for-worlds",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:18.000Z"
}
