{
  "title": "Pakistan Fisherfolk Forum’s Fatima Majeed appointed head of Sindh Fisheries Department - Pakistan - DAWN.COM",
  "author": null,
  "content": "Climate activist Fatima Majeed has been appointed as the chairperson of the Sindh Fisheries Department, becoming the first woman from the fishing community to become so, it emerged on Friday.\n\nMajeed is an activist, social worker and senior vice-chairperson of the Pakistan Fisherfolk Forum (PFF).\n\nThe PFF, a democratic organisation with over 100,000 memberships across the country, having a minimum 35 per cent women ratio, today is one of the strongest social movements in Pakistan.\n\nIt has, over the years, proven itself as a nursery for producing leaders in the fishing and peasant communities of Pakistan.\n\nIts struggle targets policy issues related to fishing rights, fish marketing and fish conservation, rehabilitation of the Indus Delta, sustainable fisheries policy, abolition of the contract system over inland waters, historical fishing rights on entire water bodies for indigenous fisherfolk, discouraging industrial fishing by deep sea trawlers and marine pollution, and detention of fishermen.\n\nIn a post on X today, the Sindh Information Department announced that Majeed was appointed to the role “in line with the inclusive vision of [PPP] Chairman Bilawal Bhutto Zardari and the Sindh government’s commitment to women empowerment”.\n\nIt added that she was the first woman from a fishing community to lead the vital sector.\n\n“This milestone reflects a strong commitment to community empowerment, inclusive representation, and merit-based leadership within public institutions,” it said.\n\nMajeed has participated in protests every year for the past three years against climate change and demanding climate justice.\n\nThe World Trade Organisation (WTO) said in March that Pakistan had formally accepted the Agreement on Fisheries Subsidies.\n\nWTO Director-General Ngozi Okonjo-Iweala had said Pakistan’s formal acceptance of the agreement marked a vital step toward ensuring the long-term sustainability of global marine resources, while safeguarding the livelihoods and food security of the millions of people, who depend on healthy fisheries.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:11.758Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934392/pakistan-fisherfolk-forums-fatima-majeed-appointed-head-of-sindh-fisheries-department",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T16:48:16.000Z"
}
