{
  "title": "PDMA issues widespread rain advisory for KP as death toll surges to 393 - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: With the death toll from last week’s flash floods in Khyber Pakhtunkhwa reaching 393, the Provincial Disaster Management Authority (PDMA) on Thursday issued an advisory for widespread rains in the province from August 22 to 26.\n\nA PDMA report issued here said that the tally of deaths from last Friday’s catastrophic rains and flash floods had gone up to 393, with Buner, the most affected district, reporting 234 fatalities as well as injury to 128 people.\n\nAlso, 42 people were killed and 20 injured in Swabi district, while Shangla district has recorded 36 deaths, Mansehra 25, Bajaur 22 and Swat 20.\n\nThe PDMA report said that the Pakistan Meteorological Department had forecast the start of widespread rains in the province’s central and upper parts from August 22.\n\nMost 234 fatalities reported in Buner district\n\nIt said that widespread downpour, along with wind and thunderstorms, were very likely in Chitral, Dir, Swat, Shangla, Kohistan, Kolai-Palas, Malakand, Buner, Mansehra, Battagram, Torghar, Abbottabad, Haripur, Swabi, Mardan, Nowshera, Charsadda, Peshawar, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Kohat, Hangu, Karak, Bannu, North and South Waziristan, Lakki Marwat, Tank and Dera Ismail Khan from August 22 to 26.\n\nThe PDMA warned that heavy to very heavy rainfall could generate flash floods in nullah and streams of Galiyat, Mansehra, Kohistan, Kolai-Palas, Abbottabad, Buner, Bajaur, Battagram, Buner, Hangu, Torghar, Haripur, Karak, Chitral, Dir, Swat, Shangla, Khyber, Kohat, Nowshera, Swabi, Mardan, Peshawar, Shangla, Kurram, Lakki Marwat, Malakand, Mansehra, Mohmand, Orakzai, Dera Ismail Khan, Bannu, Waziristan and Tank district during the period.\n\nIt also issued a warning about flooding in low-lying urban areas of Peshawar, Nowshera, Tank and Dera Ismail Khan districts and said that landslides could cause road closures in the vulnerable hilly areas of Abbottabad, Battagram, Buner, Chitral, Dir, Khyber, Kohistan, Kolai-Palas, Kohistan, Kurram, Malakand, Mansehra, Mohmand, Orakzai, Shangla, Swat, Torghar and North Waziristan districts.\n\nIn addition, heavy rainfall along with windstorms and lightning could damage weak structures like the roofs and walls of mud houses, electric poles, billboards, vehicles and solar panels.\n\nThe PDMA asked authorities to take all precautionary measures to avoid or minimise damage to public life and property, cattle and infrastructure.\n\nIt urged local administrations to plan provision of additional resources and exercise control over traffic leading to and in vicinity of vulnerable choke points and tourist places and keep people away from structures under construction, advertisement hoardings, electric poles and solar panels.\n\nThe PDMA also called for the removal of debris and obstacles from drainage systems to ensure efficient flow of water and minimise the risk of urban flooding, and coordinate with the relevant municipal administrations to ensure mitigation and preparedness measures for landslides and urban flooding.\n\nIt also emphasised the removal of billboards and hoardings to prevent damage to public life and property due to wind, dust, thunder and hailstorms.\n\nIt asked people to seek shelter in sturdy buildings or underground structures to prevent damage from wind, dust, thunder and hailstorms, or lightning.\n\nPublished in Dawn, August 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:26.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933185/pdma-issues-widespread-rain-advisory-for-kp-as-death-toll-surges-to-393",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:54.000Z"
}
