{
  "title": "Worst civilian era? - Newspaper - DAWN.COM",
  "author": null,
  "content": "NONE of our past regimes established durable progress and many have even put us back. But perhaps only Zia’s era, our worst one by far, matches the reversals we have seen under the current hybrid set-up in just 18 months, contrary to claims of making major progress.\n\nThe main harm has been done to democracy as civilian sway is at its lowest in key areas. While our two oldest parties are ruling overtly, they seemed to have nixed the political progress of yore. They began by violating their Charter of Democracy oath not to win power with the establishment’s aid. In 2013, they had ensured our only fair civilian power transfer but won this time through arguably our most rigged poll since the 2002 one held under martial law. To end rigging by incumbents, both had adopted the global good model of neutral caretakers that bars them from joining the next set-up to reduce conflict of interest. But in 2024, they bent their own good law to induct caretakers in cabinets.\n\nOur post-2009 higher judiciary hiring system too was among the best globally as its use of judicial and balanced bipartisan assembly committees ended the executive’s hold. But instead of improving it by adding merit criteria and open applications, they re-cemented the executive hold, which has harmed the judiciary. A crackdown is underway against the PTI, nationalist Baloch and KP groups and even ordinary citizens reminiscent of the Zia era. Media and other freedoms are being nixed via bad laws. While they had rightly criticised the PTI’s era for such political sins, their own have now left the former behind.\n\nThe government has achieved fragile economic stability but is clueless about durable growth. The real economic reversal, though, is the loss of ambition. CPEC, along with the Gulf inflows, was a solid way of industrialising. But 10 years later, greater attention is focused on US ties in controversial areas like crypto and natural wealth — a globally feared curse for misruled states like ours — plus remittances and establishment-led farming. The last seems to reflect a concern that greater industrialisation may bring in meritorious rulers, and so dubious sectors are a better focus for the rulers’ narrow interests. Zia had done the same. Ayub and Bhutto had at least adopted varied, though faulty, state-led ways to industrialise. But Zia moved the focus to predatory sectors such as US aid, real estate, etc.\n\nThe main harm has been done to democracy.\n\nInsecurity is increasing and negatively affecting the gains of the 2008-18 era. While this set-up rightly pins the blame for this trend on the PTI-era hybrid government for resettling TTP fighters in KP, its own steps have exacerbated matters. Its forcible approach to Balochistan, even towards peaceful marchers, is pushing common people away from normal politics. Oddly, we tell other states facing terrorism to address the root causes but avoid doing so ourselves in Balochistan. Many say the state’s distinction among ‘good and bad’ Taliban stokes terrorism in KP and new operations will only add to people’s miseries.\n\nThe big reversal externally is the rekindling of that old, on-off romance with the US via personal, non-civilian ties instead of normal state ties. While the regime calls it progress, many vividly recall the damage three decades of such ties did. The chances of us being fourth time lucky are slim as the key actors on both sides resemble past ones. For us, it’s again a set-up desperately seeking global patrons to overcome its low domestic legitimacy and su­­­-rvive. For the US, it’s a very short-visioned and self-centred (Trump) regime even by US norms. So, many fear the results may benefit our ruling elites but harm the masses.\n\nSo, all the reversals approach those in non-civilian eras, making one wonder if this will be the worst civilian era ever and how much more harm it will cause. Sages say talks are the best way out of the mess. But strong autocracies don’t voluntarily concede; instead, they use talks to pressure dissidents to yield and give themselves legitimacy. The current set-up might only accept calls for fair polls, civilian sway, judicial freedom and end to crackdowns if dissidents form a strong joint platform, which seems unlikely for now.\n\nThough the nation is angry, it remains divided. Diverse angry groups are angry on diverse issues and often don’t relate to and even oppose the basis of anger of other angry groups. So, regime may cave in under the weight of its own missteps, as always pushed gently and jointly by dissidents.\n\nThe writer has a PhD from the University of California, Berkeley, in political economy and 25 years of grassroots to senior-level experiences across 50 countries.\n\nmurtazaniaz@yahoo.com\n\nX: @NiazMurtaza2\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a3e1c784846.jpg",
  "retrievedAt": "2025-08-23T07:58:55.561Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931815/worst-civilian-era",
  "dateList": "2025-08-22",
  "date_published": "2025-08-19T02:32:34.000Z"
}
