{
  "title": "Breetzke, Ngidi star as South Africa crush Australia to win ODI series - Sport - DAWN.COM",
  "author": null,
  "content": "Matthew Breetzke slammed a superb 88 and speedster Lungi Ngidi claimed five wickets as South Africa crushed Australia by 84 runs to win the second one-day international (ODI) and the series in Mackay on Friday.\n\nThe Proteas took out the opening game by a thumping 98 runs, making the third and final match on Sunday a dead rubber.\n\nWorld champions Australia have now lost the past five ODI series against South Africa, with their batsmen again failing to fire.\n\nAfter skipper Aiden Markram won the toss and opted to bat, Breetzke crunched eight fours and two sixes to continue his top form since making his debut this year. He has posted a century and three half-centuries in his first four ODIs.\n\nTristan Stubbs was also impressive in making 74 before the Proteas were dismissed in the final over for 277, with Adam Zampa taking 3-63 and Cameron Green holding four catches.\n\nJosh Inglis blitzed 87 in Australia’s reply, but no one else rose to the occasion and they were dismissed for 193 in the 38th over. Ngidi ended with 5-42.\n\n“It’s a great feeling, of course, never an easy feat coming to Australia and wrapping up the series in two games,” said Markram. “Really good from the boys.”\n\nSouth Africa rattled Australia early despite being without off-spinner Prenelan Subrayen, who was cited for a suspect action during the first game, and injured pace spearhead Kagiso Rabada.\n\nTravis Head lasted just nine balls before being taken at mid-wicket off Nandre Burger, while the out-of-touch Marnus Labuschagne failed again, out for one.\n\nSkipper Mitchell Marsh lashed four boundaries in a quickfire 18, but he too fell cheaply before Green and Inglis began to rebuild. They put on 67, but Green departed for 35, caught and bowled by spinner Senuran Muthusamy.\n\nAlex Carey (13) and Aaron Hardie (10) didn’t last long, but Inglis battled on until Ngidi enticed an edge and he was caught by wicketkeeper Ryan Rickelton, spelling the end for Australia.\n\n“Disappointing,” said Marsh. “I thought as a collective we pegged them back beautifully with the ball, but as a batting unit we just didn’t get the job done tonight.”\n\nEarlier, South Africa started tentatively as Xavier Bartlett bagged both openers inside the first six overs.\n\nThe paceman had Markram caught by Head at mid-wicket without scoring. He then tempted Rickelton (eight) to poke at a seaming ball, with wicketkeeper Inglis taking a fine diving catch.\n\nBut Breetzke relieved the pressure when Hardie came on, slamming the quick for two sixes and a four in one over to steer them to 56-2 after the 10-over powerplay.\n\nHe then built a breezy 67-run stand with Tony de Zorzi (38), and shared another 89-run partnership with Stubbs before skying Nathan Ellis to Carey in the deep.\n\nStubbs stuck around as wickets fell until he slogged Zampa down the ground and Green got underneath it, before a late flurry from the tail.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2220232899691ea.jpg",
  "retrievedAt": "2025-08-23T07:58:07.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934317/breetzke-ngidi-star-as-south-africa-crush-australia-to-win-odi-series",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T15:33:14.000Z"
}
