{
  "title": "Karachi traders face Rs14-15bn losses amid rain - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Torrential rains in Karachi have claimed 17 lives and caused devastating losses to local businesses, as floodwaters inundated markets, shops, and godowns, destroying goods and disrupting trade.\n\nAs rains persist, traders are growing increasingly frustrated, with forecasts predicting more wet weather in the coming days. They are calling on the provincial government for assistance in recovering their losses.\n\nSharjeel Gopalani, Patron-in-Chief of the All City Tajir Ittehad (ACTI), stated that traders in Karachi’s old city areas alone had reported significant damage to between 150 and 200 shops, many of which dealt in clothing. Other sectors, such as the furniture market, were also hit hard by the floods.\n\n“Preliminary reports from areas like Orangi, Landhi, Malir, Korangi, and Lyari suggest that more than 1,000 shops and godowns have been affected,” Gopalani said. He also noted that even posh areas like DHA had seen extensive damage, particularly to basement godowns.\n\nIn addition to damage to goods, Gopalani claimed that over 200 vehicles, including cars and motorcycles, were severely affected by the urban flooding.\n\nTorrential rains damaged over 1,000 shops and godowns\n\nThe ACTI plans to submit a detailed list of the affected traders to the provincial government, hoping to secure compensation. Initial estimates place the total trade losses at Rs14-15bn, encompassing both goods and vehicles.\n\nGopalani also raised concerns about the lingering floodwaters in Karachi’s old city markets, where the pumping stations have been out of service since the rains began, further exacerbating the situation.\n\nBusinessmen Group (BMG) Chairman Zubair Motiwala and Karachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani urged the Sindh government to offer immediate compensation to affected shopkeepers. They recommended freezing provincial taxes in light of the widespread devastation.\n\n“The KCCI stands with the affected shopkeepers and is ready to facilitate their communication with the government for prompt relief,” Motiwala and Bilwani said in a joint statement.\n\nThe industrial sector has also suffered severely. Many factories have had their production halted due to prolonged power outages, as K-Electric has failed to restore the electricity supply for over 36 hours. “Both residential and industrial areas have faced repeated power tripping, leaving residents and businesses without power,” they explained. In response, they called for the deferral of electricity and gas bill payments until the situation stabilises, noting that business activities across Karachi are nearly at a standstill.\n\nDespite being the economic engine of the country, Karachi continues to suffer from neglect, the business leaders said, with little reinvestment in the city’s dilapidated infrastructure. Motiwala and Bilwani recalled letters sent to the Sindh’s chief minister and others in April, which had warned of the potential for such disasters if the city’s drainage systems were not improved.\n\n“The government ignored these warnings, and tragically, many lives could have been saved had the necessary steps been taken,” they said.\n\n“Cleaning the city’s nullahs and improving the sewerage infrastructure was critical, but no action was taken in time.\n\n“The city needs year-round maintenance and an effective strategy to manage stormwater, sewage, and flood risks,” they stressed, urging the government to declare an emergency in Karachi.\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:38.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933224/karachi-traders-face-rs14-15bn-losses-amid-rain",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T02:06:01.000Z"
}
