{
  "title": "Japan city proposes two-hour daily smartphone limit - World - DAWN.COM",
  "author": null,
  "content": "A Japanese city will urge all smartphone users to limit screen time to two hours a day outside work or school under a proposed ordinance that includes no penalties.\n\nThe limit — which will be recommended for all residents in central Japan’s Toyoake City — will not be binding and there will be no penalties incurred for higher usage, according to the draft ordinance.\n\nThe proposal aims “to prevent excessive use of devices causing physical and mental health issues… including sleep problems”, mayor Masafumi Koki said in a statement on Friday.\n\nThe draft urges elementary school students to avoid smartphones after 9:00pm, and junior high students and older are advised not to use them after 10:00pm.\n\nThe move prompted an online backlash, with many calling the plan unrealistic.\n\n“I understand their intention, but the two-hour limit is impossible,” one user wrote on social media platform X.\n\n“In two hours, I cannot even read a book or watch a movie (on my smartphone),” wrote another.\n\nOthers said smartphone use should be a decision for families to make themselves.\n\nThe angry response prompted the mayor to clarify that the two-hour limit was not mandatory, emphasising that the guidelines “acknowledge smartphones are useful and indipensable in daily life”.\n\nThe ordinance will be considered next week, and if passed, it will come into effect in October.\n\nIn 2020, the western Kagawa region issued a first-of-its kind ordinance calling for children to be limited to an hour a day of gaming during the week, and 90 minutes during school holidays.\n\nIt also suggested children aged 12 to 15 should not be allowed to use smartphones later than 9:00pm, with the limit rising to 10:00pm for children between 15 and 18.\n\nJapanese youth spend slightly over five hours on average a day online on weekdays, according to a survey published in March by the Children and Families Agency.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2211054801110a1.png",
  "retrievedAt": "2025-08-23T07:58:18.260Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933707/japan-city-proposes-two-hour-daily-smartphone-limit",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T06:20:45.000Z"
}
