{
  "title": "Token feminism in development - Newspaper - DAWN.COM",
  "author": null,
  "content": "WOMEN in Pakistan constitute 48.5 per cent of the population but face systemic disadvantages in education, healthcare and economic participation. To realise the country’s full potential, increa­sing women’s economic participation is critical.\n\nPakistan hit rock bottom in the World Economic Forum’s 2025 Global Gender Gap Index out of 148 countries, with 56.7pc gender parity; it has closed only 2.3pc of the gap since 2006. It ranks below Sudan, Chad, Iran, Guinea and Congo. In South Asia, Bangladesh holds the 24th position, demonstrating a far more favourable gender equality landscape. This is the second year in a row that Pakistan’s gender parity score has declined.\n\nThis alone is a damning indictment of the little progress made — despite millions being poured into gender equality initiatives by international development agencies. However, the deeper problem is not lack of funding, but the misuse of a noble narrative to justify wasteful development programming. It should lead to deep introspection about why gender equality efforts keep failing.\n\nTake, for example, the Asian Development Bank’s (ADB) initiative with Pakistan’s National Transmission and Despatch Company to increase female participation in technical and leadership roles.\n\nA $182,000 technical assistance grant — part of the broader Power Transmission Enhance­ment Investment Programme — was awarded to support ‘gender mainstreaming’ through drafting a workplace gender policy, training 20pc of female staff and auditing an internship programme. This reads more like an HR department’s annual plan than a serious development intervention. Any functional organisation with a competent HR team can perform such tasks.\n\nSo why is our ailing power sector the testing ground for gender experiments scripted in distant multilateral offices?\n\nThe broader problem is a development culture that rewards symbolism over substance.\n\nThis is not an isolated case. ADB partnered with the State Bank of Pakistan (SBP) to develop a Wo­­men Entrepreneurs Finance Code under a Wom­en-Inclusive Financial Sector Development Prog­ramme funded through a $5.5m grant and $150m loan.\n\nIn June 2025, another $350m loan was app­ro­ved to support women’s access to finance and provide credit to women-led micro SMEs. The code, launched with fanfare, is merely a declaration of intent to close financing gaps by designating a leader to monitor data and introduce targets.\n\nWhile gender-responsive finance is a valid policy goal, was this multimillion-dollar donor intervention truly necessary when the SBP already has the legal mandate, institutional capacity and technical expertise to design such policies? Or is this just donor funding chasing headlines, not solutions?\n\nHas the central bank run out of ideas to promote financial inclusion, which it championed until a decade ago when the Economist Intelligence Unit rated Pakistan’s microfinance regulatory framework the best in the world in 2010 and 2011, and the third best in 2013 and 2014? Either way, such supply-driven initiatives only weaken state institutions.\n\nADB has been involved in Pakistan’s financial sector since 2000, when it launched a $150m microfinance sector development programme to provide financial services to the poor, especially women. The World Bank is also actively involved in gender empowerment projects, focusing on education, economic participation and access to fin­ance.\n\nIn March this year, the World Bank approved a $102m loan to enhance access to microcredit and support the resilience of the microfinance sector. ADB and World Bank have extended loans for the same purpose for over 25 years. Similarly, bilateral donors continue to fund gender empowerment initiatives. The UK’s FCDO-owned Karandaaz also invests in profitable banks and established corporates to increase access to SME finance, including for women entrepreneurs.\n\nThis unneeded donor exuberance in Pakistan’s most profitable financial sector underscores a lack of interest in addressing core development challenges. These initiatives mainly advance the careers and networks of donor staff, consultants and local counterparts. There is clearly a problem when aid becomes a lucrative industry. It absolves the government of its responsibility to work for the welfare of its citizens. This aid addiction — fostered by international donors — has contributed to institutional decay, economic stagnation and insurmountable debt.\n\nIn fact, the actual outcomes of donor programmes implemented over the past decades show deteriorating trends. Pakistan’s credit-to-GDP ratio fell from 27pc in 2008 to 9pc in 2024 — the lowest among emerging countries. Credit remains concentrated in large corporates, with nearly 70pc allocated to manufacturing.\n\nThis reflects banks’ disconnect from the broader economy as well as the ineffectiveness of SBP regulation and donor involvement in the financial sector. More troubling is the steady decline in SMEs’ access to finance; their share of total private sector credit dropped from 17pc in the mid-2000s to just 6pc in 2024. The number of SME borrowers also declined from 185,000 in 2007 to 172,000 in 2024. Most financing is directed towards medium enterprises.\n\nThe broader problem is a development culture that rewards symbolism over substance. Pakistan’s addiction to foreign aid has fostered a policy environment where any externally funded programme is welcomed without scrutiny. Frivolous projects are designed to please donors, not solve real problems, reflecting waste and abuse. Whether in foreign-funded tax reforms, energy sector financial sustainability projects, or gender mainstreaming campaigns, the pattern is consistent: poor design, poor results.\n\nTragically, these projects are celebrated with MoUs, photo-ops, and social media hype, while the women they claim to empower remain invisible. This isn’t just inefficient — it’s unethical. Tokenism empowers donor staff, consultants and policymakers, not women; it reduces gender equality to a funding checkbox. Worse, they hide behind bizarre buzzwords like ‘gender-responsive climate finance’ or ‘gender-transformative value chains’ — jargon-masking emptiness.\n\nWe must not confuse real gender empowerment with bureaucratic parody. Genuine change means women’s access to education and healthcare, legal rights (especially inheritance), protection from violence, and more women in the workforce — not elite seminars, lavish launches, or pricey consultants churning out reports that nobody reads. Pakistan needs genuine reforms, not donor-driven theatre. And it is time we start calling out the phoney feminism that masquerades as development.\n\nThe writer is the author of The Shady Economics of International Aid. He is a former senior adviser of the IMF and ex-chief economist of the SBP.\n\ndr.saeedahmed1@hotmail.com\n\nPublished in Dawn, August 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a7ece793aa9.png",
  "retrievedAt": "2025-08-23T07:58:19.471Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933559/token-feminism-in-development",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T04:08:12.000Z"
}
