{
  "title": "Saleema Imtiaz set for ODI debut in Pakistan-South Africa women’s series - Sport - DAWN.COM",
  "author": null,
  "content": "Saleema Imtiaz is set for her umpiring debut in the upcoming women’s ODI series between Pakistan and South Africa in Lahore, the Pakistan Cricket Board (PCB) announced on Friday, alongside confirming other match officials for the series.\n\nLast year, Saleema became the first Pakistani female official to join ICC’s International Panel of Development Umpires, enabling her to officiate women’s bilateral international matches and ICC women’s events.\n\nThe three-match One-Day International series will be staged at Lahore’s Gaddafi Stadium from September 16-22.\n\nSaleema, who is part of the ICC International Panel of Umpires will be joined by Australia’s Claire Polosak, who returns to Pakistan after officiating in the Pakistan v West Indies women’s series last year in Karachi, PCB said.\n\nPolosak, also a member of the ICC International Panel of Umpires, will stand in all three ODIs as an on-field umpire.\n\nHumairah Farah has been named as the reserve umpire for the series, while Tariq Rasheed from the PCB Elite Panel of Umpires will also perform duty of an on-field umpire during the series.\n\nFormer Test cricketer Ali Naqvi, a member of the PCB and ICC Elite Panel of Match Referees, will lead the playing control team, PCB said.\n\nUmpire and match referee appointments\n\nSept 16 — First ODI: Claire Polosak and Saleema Imtiaz (on-field umpires), Tariq Rasheed (third umpire), Humairah Farah (reserve umpire); Ali Naqvi (match referee)\n\nSept 19 — Second ODI: Claire Polosak and Tariq Rasheed (on-field umpires), Saleema Imtiaz (third umpire), Humairah Farah (reserve umpire); Ali Naqvi (match referee)\n\nSept 22 — Third ODI: Claire Polosak and Saleema Imtiaz (on-field umpires), Tariq Rasheed (third umpire), Humairah Farah (reserve umpire); Ali Naqvi (match referee)",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T07:58:12.368Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934115/saleema-imtiaz-set-for-odi-debut-in-pakistan-south-africa-womens-series",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T12:30:26.000Z"
}
