{
  "title": "Pakistan dominates at Amerigol Latam ice hockey tournament in US - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistani teams on Thursday displayed their prowess at the Amerigol Latam Cup ice hockey tournament in Coral Springs, Florida in the United States with the men’s team clinching the Division III championship and the women’s team claiming the Division II bronze medal in their debut appearance.\n\nThe tournament is designed to showcase talent from regions where ice hockey is a growing sport and “break barriers and unite non-traditional hockey markets in a thrilling display of skill, passion, and camaraderie”, according to the organisers’ website.\n\nA press release from the National Hockey League (NHL), stated that this year’s Latam Cup features 62 women’s, men’s and youth teams and over 1,450 players representing 17 countries and territories. The tournament started on Sunday and will continue through August 24.\n\nThe NHL stated that Pakistan’s men’s team went undefeated throughout the tournament and playoffs, defeating Peru 6-1 to win the championship for the first time.\n\nThe Pakistani Ice Hockey Team wrote in an Instagram post: “Pakistan men’s Division III champions! Undefeated run capped off with gold. What a tournament!”\n\nIn their first outing in the Latam Cup last year, Pakistan only won one game.\n\n“I thought we’d be winning several years from now,” said Donny Khan, the NHL’s senior director of hockey development and strategic collaboration. “I didn’t think we’d be doing this in year two.”\n\nThe NHL stated that Khan helped form the Pakistani teams that competed.\n\nKameron Sabir, an Edmonton physician who coached the men’s team, was quoted as saying, “You can’t do better than this first gold … first cup.\n\n“It’s just an amazing day for the country and ice hockey. The women did such an amazing job too. Tremendous [performance] for their first tournament. They had only 10-12 players, so hats off to them.”\n\nMariya Rauf, who coached the women’s team, clutched a cricket bat given to her by her players and smiled while watching the men celebrate their victory against Peru, the NHL said.\n\n“Cricket is our national sport, but I think after this, it just shows [ice] hockey’s growing very single day,” she was quoted as saying. “This shows that there’s talent and that we’re just going to keep getting better.”\n\nRauf is also a junior forward on Yale University’s National Collegiate Athletics Association Division I women’s ice hockey team.\n\nThe NHL noted that most of the countries and territories competing in the tournament aspire to play ice hockey on the world stage, but don’t have skating rinks or suitable ice facilities that meet International Ice Hockey Federation regulations, enabling them to compete in events like the Olympics.\n\n“The hope is that exposure from winning or competing in the tournament will persuade sports federations, Olympic committees or private investors in those countries and territories to support ice hockey, mainly by building rinks,” the NHL stated.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2219300116b2633.jpg",
  "retrievedAt": "2025-08-23T07:58:11.429Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934260/pakistan-dominates-at-amerigol-latam-ice-hockey-tournament-in-us",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T14:44:15.000Z"
}
