{
  "title": "KP govt promises dignified return of Afghans - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Adviser to the chief minister on health Ihtesham Ali on Monday announced the provision of sufficient quantities of medicines for the returning Afghan nationals along with nutritional food for their children.\n\nDuring a visit to the “temporary withholding camp” in Landi Kotal here, he said that every effort would be made to send Afghans home in a dignified manner while fulfilling all legal requirements.\n\nHe said staff members at the withholding camp were strictly asked to fulfil all health-related and other requirements of the returning Afghans while caring for their self-respect, as people of both countries shared norms and values.\n\nOfficials told the adviser to the CM that on average, around 3,000 families were returning to their country on a daily basis.\n\nHe met with Afghans and asked them about the facilities offered at the camp.\n\nIn Lower South Waziristan district, around 650 Afghan individuals returned to their homeland via the Angoor Adda border crossing in the last two days, said deputy commissioner Musarrat Zaman here on Monday.\n\nThe statement came as the phased repatriation of Afghan refugees under the supervision of the district administration continued in the day.\n\nThe DC said that the returnees included men, women and children, who crossed the border in an orderly manner under the guidance of staff deployed at the gate.\n\nHe said the entire process was being conducted peacefully in line with regulations and in coordination with security forces.\n\nThe official said a temporary shelter established at the Angoor Adda border point had been made functional with a capacity of 50 beds, while drinking water, electricity and food were provided to families awaiting their return to Afghanistan.\n\nAlso, the district administration has set up a tent village at the Agri Park Wana to temporarily accommodate Afghan families.\n\nMeanwhile, Haripur’s deputy commissioner Waseem Ahmad on Monday said that the district administration was making all-out efforts to facilitate hassle-free voluntary repatriation of Afghan refugees to their country.\n\n“We have assured them [returnees] that their cultural norms would be respected, while their journey to Torkham border would be made hassle-free and respectful,” he told reporters on Monday.\n\nThe DC said that he asked Afghans to vacate the camps and private houses without delay and the district administration would utilise available resources to make their repatriation easy and dignified.\n\nHe said that on a complaint about overcharging by transporters, a committee headed by the additional deputy commissioner (general) and comprising officials of motor vehicle examiner, traffic personnel and officials of Afghan directorate had been constituted to ensure that the repatriating families are not fleeced by truckers.\n\nThe DC said he hoped that the refugees would vacate the camps, private houses and businesses without delay.\n\nAbout the investment of Afghan refugees in different businesses as well as the renting of shops and plazas in Haripur, the DC said that both sides were aware of the government’s decision of not extending the stay of Afghans, so “whatever they did was at their own risk.”\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68b607a7e962e.jpg",
  "retrievedAt": "2025-10-12T03:58:15.936Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938996/kp-govt-promises-dignified-return-of-afghans",
  "dateList": "2025-09-02",
  "date_published": "2025-09-01T23:33:42.000Z"
}
