{
  "title": "PIA to be privatised by November - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Senate panel says four companies in race, two disqualified; Discos next in line\n• Senators seek clarity on energy supply, debt before privatisation\n\nISLAMABAD: A parliamentary committee was informed on Monday that Pakistan International Airlines Corporation Limited is expected to be privatised by November this year.\n\nBriefing the Senate Standing Committee on Privatisation on the current status of the process, the Privatisation Commission secretary said that four companies were participating and would need to form consortiums with established airlines to operate PIA. Two applicants had already been disqualified for not meeting standards.\n\nWhen Senator Zeeshan Khanzada raised concerns over PIA’s Rs650 billion debt, committee chairman Senator Dr Afnan Ullah Khan suggested that the airline’s two hotels could be sold to offset liabilities.\n\nWhen Senator Khanzada questioned the government’s strategy of selling profitable companies in the first phase, the Privatisation Com­mis­sion secretary replied that investors are naturally more interested in profitable entities. Even if such companies were given away for free, he argued, it would still be the right decision as they may not remain profitable in the future.\n\nThe committee, chaired by Afnan Ullah Khan and attended by Senators Zeeshan Khanzada, Umer Farooq and Asad Qasim, also reviewed progress on other key privatisation initiatives, including power distribution companies (Discos), generation companies (Gencos), and Pakistan Minerals Development Corporation (PMDC).\n\nThe committee members stressed the need for clarity on energy supply agreements, debt restructuring and protection of profitable state assets before moving forward with privatisation.\n\nPower Division officials informed the committee that Nandipur and Guddu power plants are on the privatisation list. “Eight important issues of Nandipur have been resolved, with only one pending related to the gas purchase and sale agreement,” they said, adding that the government was still deciding whether to provide a dedicated gas supply or continue with the current arrangement of supply on availability.\n\nRegarding the Guddu power pla­nt, the officials said that four of nine outstanding issues had been resol­v­­ed, while disputes over land transfer re­­mained. The plant’s land is still re­­g­­istered under Wapda, though the latter has issued an NOC and the transfer process is underway.\n\nSenator Afnan Ullah underlined the importance of resolving the energy supply issue for successful privatisation.\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:58:37.355Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939074/pia-to-be-privatised-by-november",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T02:16:19.000Z"
}
