{
  "title": "KP asks Centre to release over Rs71 billion net hydel profit - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government has asked Water and Power Development Authority (Wapda) to make arrangements for release of Rs71.1 billion net hydel profit (NHP) to the province.\n\nIn a letter, dated September 1 and addressed to chairman of Wapda, KP finance department noted that the province received Rs3 billion on account of arrears of NHP for the last fiscal on August 18.\n\nThe letter pointed out that for the current fiscal, NHP payable to KP was calculated at Rs34.5 billion and accordingly the proportionate share for the month of July and August amounted to Rs5.762 billion, which was yet to be released by Wapda to the province.\n\nBesides, it said that with regard to the arrears of previous financial year 2024-25, out of Rs28.6 billion an amount of Rs6 billion was released to the province during the current fiscal, leaving an outstanding amount of Rs22.8 billion.\n\nCM aide alleges unfair disbursement of funds to provinces\n\nThe finance department also said that an amount of Rs42.6 million was also payable to the province by Wapda/federal government on account of five per cent annual indexation for the period 2015-16 to 2024-25.\n\n“Based on the estimated generation data provided by Wapda, the total NHP amount for the said period is also to be settled,” it added.\n\nIt has asked Wapda to make necessary arrangements for the release of these outstanding amounts at the earliest.\n\nThe adviser to chief minister on finance, Muzzammil Aslam, told Dawn that the federal government was unfair in NHP disbursement to provinces. He said that in 2024-25, the federal government disbursed Rs34.58 billion to KP while it released Rs65 billion to Punjab.\n\n“Interestingly, the federal government has provided extra Rs30 billion to Punjab in last quarter of 2024-25 silently supporting the most resourceful province of Pakistan,” said Mr Aslam. Besides, he said that it was urgently demanded to release the outstanding Rs71.7 billion to KP.\n\nHe said that Prime Minister Shehbaz Sharif had promised Chief Minister Ali Amin Gandapur during the last meeting of Council of Common Interests (CCI) in May 2025 that next CCI would be called in July to resolve three decades long issue of NHP in the light of AGN Kazi methodology and Jahanzeb Committee formula. “However, so far the prime minister office has failed to fulfil his promise,” he added.\n\nThe profit from generation of hydroelectricity, known as net hydel profits (NHP), is payable to those provinces where power plants are located, under the Article 161(2) of the Constitution.\n\nIn 2018, the KP government took the issue of full implementation of Kazi Committee methodology to CCI, which, in a meeting on April 24, 2018, constituted a committee, headed by the then deputy chairman of Planning Commission to discuss the determination of NHP in light of its decisions.\n\nCCI formed an “out-of-box” committee to act on its report. The committee has so far held at least five meetings but no agreement has been reached over the mechanism to pay Rs1.5 trillion NHP to KP as per Kazi methodology for the period from 2016-17 to 2022-23.\n\nThe KP government suggested to the committee that the federal government should pay NHP in line with Article 161(2) of the Constitution, Presidential Order No.3, decisions of CCI from 1991, 1993, 1997, 1998, 2016, 2018 and 2022, and the calculation made by the Jehanzeb Khan committee in the report approved by CCI on Dec 23, 2019.\n\nThe provincial government has also been asking the federal government to fund the power house component of Wapda development projects through Public Sector Development Programme instead of revenues coming from Wapda generation tariff to make funds available for the payment of NHP to the province.\n\nKP has also proposed that Centre should transfer hydropower projects to it on analogy of the power generation policies of 1995 and 2015 and outstanding payment of NHP as per Kazi methodology to be made by the federal government till the date of transfer of HPP to provinces, while the operation and maintenance can be retained by Wapda.\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:00:06.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939002/kp-asks-centre-to-release-over-rs71-billion-net-hydel-profit",
  "dateList": "2025-09-02",
  "date_published": "2025-09-01T23:33:42.000Z"
}
