{
  "title": "Over one million children to be vaccinated during anti-polio drive in Pindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A five-day anti-polio campaign kicked off in Rawalpindi district to vaccinate more than one million children under five years of age.\n\nAccording to the District Health Authority, 225 union council medical officers (UCMOs), 765 area in-charges (AICs), 4,731 mobile teams, 263 fixed teams, and 194 transit teams are participating in the drive to achieve the target.\n\nThe campaign is being conducted in Gujar Khan, Kahuta, Kallar Syedan, Kotli Sattian, Murree, Rawalpindi Cantt, Rawalpindi Rural, and Taxila Rural.\n\nDeputy Commissioner Dr Hassan Waqar Cheema directed the District Health Authority to achieve the target with the support of the dedicated health workforce.\n\n“The high deployment of mobile teams will bridge gaps in rural areas, but sustaining this momentum requires addressing systemic challenges like education and access,” he said, urging citizens to cooperate with health workers.\n\nHe also called on religious scholars and parliamentarians to motivate people to vaccinate their children.\n\nHealth authority officials said two districts of Punjab, including Rawalpindi, have been moved from the red zone to the yellow zone due to their strong performance in the anti-polio campaign, which they termed an honour for the district.\n\nDr Cheema noted that Rawalpindi has the largest population of migrants, which is why cases of polio, dengue, and other diseases are reported in the area.\n\nHowever, he added that due to the efforts of the administration, the number of cases has remained very low. He instructed that measures at the micro level should be further strengthened, warning that strict action would be taken against officials or staff found negligent or careless, as no leniency would be tolerated.\n\nHe emphasised that special attention should be given to union councils where a large number of migrants from Khyber Pakhtunkhwa and other adjoining areas reside, ensuring that not a single child is left without polio drops.\n\nIn a seperate development, as many as 1,800 police personnel are performing duty with 554 polio vaccination teams across the district to ensure foolproof security.\n\nA police spokesman said Rawalpindi Police had made security arrangements for the four-day polio campaign, with around 1,800 officers and officials deployed. Security is being provided to 554 polio teams, 304 transit points and 207 fixed centers across the district.\n\nAs part of the security plan, police station mobiles, the elite squad and the Dolphin Force are also carrying out special patrol duties in different areas.\n\nFoolproof arrangements have been made to ensure the safety of the campaign.\n\n“Rawalpindi Police is always committed to protecting the lives and property of citizens,” the spokesman said.\n\nMohammad Asgher also contributed to the story\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/021226293e20312.webp",
  "retrievedAt": "2025-10-12T03:58:44.816Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939013/over-one-million-children-to-be-vaccinated-during-anti-polio-drive-in-pindi",
  "dateList": "2025-09-02",
  "date_published": "2025-09-01T23:33:35.000Z"
}
