{
  "title": "Next two days critical as India releases more water into Sutlej - Pakistan - DAWN.COM",
  "author": null,
  "content": "KASUR: The district administration and rescuers have once again put the flood-hit villages on high alert after India released more water into the Sutlej on Monday.\n\nAccording to the administration, the next two days are critical and they are making all-out efforts to tackle any untoward situation.\n\nThe Sutlej was in exceptionally high flood despite the fact that the water receded to over 100,000 cusecs. Crops at 10 downstream villages were submerged with water as Jalaldinwala embankment was washed away.\n\nThe villages include Fatohiwala, Chohriwala, Wazirpur, Kujian, Nooriwala, Kharaipar, Aloanna, Chhabar, Bhadian and Usmanwala whereas the villages on upstream would face a flood wave if Talwar post embankment breaks, said a handout.\n\nIt is important to mention here that, in case, the Talwar post dyke breaches, the villages near the city could also be flooded.\n\nThe police deputed at Talwar post are not allowing any one to go ahead of the post in the wake of the rising risk of water surge to a dangerous level.\n\nAt the Talwar post near the border, the district administration has established its camps, which are in danger as cracks have started appearing in the embankment.\n\nA couple of days back, the administration decided to leave the Talwar post and establish camps somewhere else, keeping in view the condition of embankment.\n\nOn Monday, according to official handout, the water discharge at Ganda Singh headworks was 240,000 cusecs. The Sutlej recently witnessed a water discharge of 385,000 but it reduced significantly in a day as water spread to the villages, washing away several embankments.\n\nThe river has been wreaking havoc with its mighty water waves for the last seven days in over 72 villages, the handout further said.\n\nAccording to the handout, 70,000 people had been evacuated besides 169,000 animals were shifted to safer place in the district so far.\n\nAccording to Rescue officials, it rescued a boat carrying two families and volunteers of a charity organization in the Kothi Fateh Muhammad area of Kanganpur. The rescuers rushed to the spot as the boat riders called for help at 1122. The incident took place due to engine failure.\n\nSeparately, two people drowned in the floodwater. Abdul Salam, 30, drowned at village Rajiwal near Mandi Usmanwala while fetching fodder for his cattle. Muhammad Arshad, 18, drowned while bathing in the Ravi at village Sindhu Kalan of Pattoki.\n\nSo far, four persons had drowned in the floodwater in Kasur.\n\nOn the other hand, water discharge in the Ravi at Head Balloki has reduced to 162,290 from the peak discharge of 225,000 cusecs.\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/02105839188bded.webp",
  "retrievedAt": "2025-10-12T03:58:40.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939115/next-two-days-critical-as-india-releases-more-water-into-sutlej",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T04:37:25.000Z"
}
