{
  "title": "At least 5 dead, 29 injured in blast at BNP rally in Quetta’s Shahwani Stadium - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least five people were killed and 29 were injured in a blast at a rally of the Balochistan National Party-Mengal (BNP-M) at Quetta’s Shahwani Stadium on Tuesday night.\n\nA statement from the Balochistan Health Department said the blast occurred at a rally of the BNP-M and listed five dead and 29 injured in the incident. It said the injured were brought to the Quetta Civil Hospital for treatment and were provided first aid before being admitted to the trauma centre for further medical attention. Quetta Civil Hospital spokesperson Dr Waseem Baig also confirmed the same toll.\n\nIn a media talk at the hospital, Advocate Sajid Tareen, acting president of the BNP-M, said 13 party workers were killed in the blast and several were injured, adding that the attack occurred in the parking lot after a party rally to observe the death anniversary of party founder Attaullah Mengal.\n\nHe had earlier posted a picture on X of the crowd gathered for the rally.\n\nTareen said the party already had apprehensions of such an incident and had contacted the district administration in advance for security. He added that former MPA Ahmed Nawaz and party leader Musa Baloch were among the injured.\n\nA statement from the Balochistan Home Department said rescue teams had reached the scene and the injured were being taken to the hospital for treatment, adding that security forces had cordoned off the area and begun collecting evidence.\n\nIt said the government ordered a high-level investigation into the incident and appealed to the public not to heed rumours and to cooperate with institutions.\n\nBalochistan Chief Minister Sarfraz Bugti strongly condemned the incident and termed it a “cowardly act of enemies of humanity”.\n\nHe said that “malicious elements” were “playing with the blood of innocent citizens”, vowing that the “evil intentions of terrorists” would be thwarted at all costs.\n\n“Instructions have been given to provide the best medical facilities to the injured. Hospital administration and medical staff should remain alert, there should be no negligence in the treatment of the injured,” he said.\n\nSaying that the investigation committee had been ordered to submit its report soon, the chief minister said those involved in the incident would be brought to justice and security agencies had been instructed to immediately apprehend the perpetrators.\n\n“Protection of people’s lives and property is the first responsibility of the government. Malicious elements will not be allowed to succeed in their designs against the peace. The federal and provincial governments will work together to ensure the protection of people’s lives and property.”\n\nBalochistan Health Minister Bakht Muhammad Kakar reached Civil Hospital on the chief minister’s instructions and was personally overseeing all medical relief activities.\n\nHe said that an emergency was imposed in all hospitals after the blast and all doctors and medical staff had been called for duty immediately.\n\nKakar further said that the regional blood centre was functional and emergency measures were underway to ensure the supply of blood, adding that the best medical facilities were being provided to the injured and operation theatres and ICUs in all hospitals were on alert, along with ambulance services and paramedical staff.\n\nThe minister expressed solidarity with the injured and assured all possible support to their families.\n\nNo group has yet claimed responsibility for the blast.\n\nInterior Minister Mohsin Naqvi condemned the blast and extended his condolences to the injured.\n\n“The terrorists and their facilitators of Fitna-al-Hindustan are targeting innocent people to create instability through a nefarious conspiracy. With the support of the nation, we will crush the sinister designs of Indian-sponsored terrorists,” he said.\n\nIn May, the government designated all terrorist organisations in Balochistan as Fitna al-Hindu­stan — a new phrase aimed at framing India’s alleged role in terrorism as a deliberate destabilisation strategy, potentially to galvanise domestic support.\n\nJamiat Ulema-i-Islam-Fazl chief Maulana Fazlur Rehman criticised the state over the incident, terming it a case of “incompetence and negligence”.\n\nOpposition coalition Tehreek Tahafuz Ayeen-i-Pakistan strongly condemned the attack and termed it the “worst form of cowardice”.\n\n“We express grief and anger over the martyrdom of political workers. The federal and provincial governments have failed badly in protecting the lives and property of the people.\n\n“The enforcement of the Constitution and law has ended in the country, and every citizen feels insecure. We are assessing the situation and will soon present a detailed stance of the alliance before the public,” the alliance said.\n\nMajlis Wahdat-i-Muslimeen Pakistan (MWM) central chairman Senator Allama Raja Nasir Abbas Jafri said the incident was not only an attack on a democratic political party and its leadership but also a “direct assault on Pakistan’s constitutional and democratic framework”.\n\n“I strongly demand from the federal and provincial governments and law enforcement agencies that the perpetrators of this attack be immediately arrested and brought to a deterrent end, and that the protection of the lives and property of political leaders and workers across the country be ensured,” he said.\n\nSardar Akhtar Mengal and other participants of a BNP-M protest sit-in had survived a suicide attack near the Lakpass area of Mastung district in March.\n\nOfficials had said the suicide bomber had detonated the explosives strapped to his body away from the sit-in site after security guards intercepted him, preventing him from reaching the stage where the BNP-M leaders were present.\n\n“Sardar Akhtar Mengal, party workers and supporters remained unharmed in the attack,” police had confirmed, adding that no casualties were reported. However, Mengal claimed that at least four party members were injured in the blast.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/02224149f543b9b.webp",
  "retrievedAt": "2025-09-06T09:59:44.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939202/at-least-5-dead-29-injured-in-blast-at-bnp-rally-in-quettas-shahwani-stadium",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T17:45:14.000Z"
}
