{
  "title": "Two injured as police van attacked in Naran - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Two policemen sustained critical injuries when a group of terrorists allegedly opened fire on a police patrol van in Gattidas area of Naran near the boundary of Khyber Pakhtunkhwa and Gilgit-Baltistan on Sunday night.\n\n“We have cordoned off the area on our side of the boundary, while GB police have also taken similar measures to ensure the rounding up of the fleeing terrorists,” district police officer Shafiullah Khan Gandapur, who rushed to the scene after the attack, told reporters on Monday.\n\nThe armed men, positioned in the nearby mountains, fired at the patrolling van, leaving two of the five policemen on board seriously injured. A search and strike operation was launched immediately after the incident on both sides of Babusar Top, he added.\n\nThe injured policemen were first shifted to a health facility in Naran and later referred to Ayub Medical Complex Hospital, Abbottabad.\n\nAuthorities said both KP and GB police had already enforced a night travel ban on the Mansehra-Naran-Jalkhad Road in upper parts of the Kaghan Valley. Passenger coaches and other vehicles were only allowed to cross Babusar Top in police-led convoys. “The Chilas (GB) police have also sealed the artery on their side to prevent the terrorists from escaping,” Mr Gandapur said.\n\nHe said that police were fully prepared to thwart such cowardly acts carried out by armed groups sneaking into the Kaghan Valley from the neighbouring Chilas district of GB. “We are committed to ensuring the safety of our forces and passengers travelling between KP and GB via Kaghan Valley, and those behind this attack will soon be apprehended,” the DPO said.\n\nMeanwhile, Hazara DIG Nasir Mehmood Satti visited the AMC and enquired after the injured policemen. “I have no words to praise the lofty courage and bravery you demonstrated while confronting terrorists in the line of duty,” he said.\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/09/011010387650f01.webp",
  "retrievedAt": "2025-09-06T10:00:05.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939001/two-injured-as-police-van-attacked-in-naran",
  "dateList": "2025-09-02",
  "date_published": "2025-09-01T23:33:42.000Z"
}
