{
  "title": "Pakistan, China vow to deepen ‘all-weather strategic cooperative’ partnership - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and China on Tuesday reaffirmed their commitment to strengthening their “iron-clad and all-weather strategic cooperative partnership” through enhanced cooperation, reflecting their unique bilateral relationship.\n\nPakistan and China share a longstanding strategic partnership with ties ranging across different sectors — including trade, energy, defence, and infrastructure.\n\nThe bilateral ties and cooperation were discussed in a meeting between Prime Minister Shehbaz Sharif and Chinese President Xi Jinping at the Great Hall of the People on the sidelines of the Shanghai Cooperation Organisation (SCO) Council of Heads of State (CHS) summit, held from August 31 to September 1.\n\n“During the meeting, the two leaders agreed that the relationship between their countries was unique and unparalleled, which should be reflected in their enhanced bilateral cooperation,” the state-run Associated Press of Pakistan (APP) said.\n\n“Both leaders also discussed important regional and global developments and agreed to continue close cooperation between Pakistan and China in this regard.”\n\nPM Shehbaz reaffirmed the desire to continue working closely with China for the successful implementation of the next phase of the upgraded China-Pakistan Economic Corridor (CPEC), with its five new corridors, the report said.\n\n“He congratulated President Xi on the success of the SCO Council of Heads of State Summit in Tianjin and offered his felicitations on the 80th anniversary of the World Anti-Fascist War.”\n\nLauding President Xi Jinping for his visionary and transformational leadership that has inspired China’s remaining journey towards modernisation and progress, the prime minister said that Pakistan took great pride in Beijing’s achievements and would always stand ready to work together with China in this great journey.\n\nHe also appreciated China’s unflinching support for Pakistan’s territorial integrity, sovereignty, and socio-economic development, as well as the significance of CPEC as a flagship project of President Xi’s Belt and Road Initiative (BRI) to help both countries build an even stronger Pakistan-China community with a shared future.\n\nThe prime minister hailed President Xi’s strong commitment to strengthening multilateralism and said Pakistan fully supported China’s landmark steps in this regard, including the Global Governance Initiative, Global Development Initiative, Global Security Initiative, as well as Global Civilisation Initiative.\n\n“These initiatives would serve the collective global good and contribute to regional as well as global peace, stability and development,” the PM was quoted as saying in the report.\n\nPresident Xi said that China would continue to assist Pakistan in all fields of economic growth and development, especially as the two countries were now ushering in the second Phase of CPEC, which would focus on Pakistan’s most important economic sectors.\n\nPM Shehbaz renewed his “most cordial” invitation to President Xi to undertake an official visit to Pakistan next year, when both countries would celebrate the 75th anniversary of the establishment of Pakistan-China diplomatic ties.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/021208021c52345.webp",
  "retrievedAt": "2025-09-06T09:59:49.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939128/pakistan-china-vow-to-deepen-all-weather-strategic-cooperative-partnership",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T07:12:43.000Z"
}
