{
  "title": "Taiwanese Olympic boxer Lin won’t compete at world championships amid gender row - Sport - DAWN.COM",
  "author": null,
  "content": "Taiwanese Olympic boxing gold medallist Lin Yu-ting will not compete at the world championships starting this week, Taiwan’s association told AFP on Tuesday, despite reportedly submitting her gender test results.\n\nLin and Algerian boxer Imane Khelif were at the centre of a major gender row at the 2024 Paris Olympics, where they won titles in separate weight classes.\n\nWorld Boxing said last month that women wanting to compete at the championships in Liverpool on September 4-14 would have to undergo mandatory gender testing under its new policy.\n\nThe 29-year-old Lin had agreed to undergo the testing, her coach Tseng Tzu-chiang told AFP at the time.\n\nTaiwan’s boxing association said it submitted the results to World Boxing and had not received a response, the semi-official Central News Agency reported late Monday.\n\n“We cannot allow the athlete to travel to the UK without any guarantee,” the association was quoted as saying.\n\nThe association told AFP in a message on Tuesday that Lin “will not attend the world championships in Liverpool”, but did not give a reason or respond to AFP’s other questions.\n\nLin’s coach Tseng did not respond to phone calls or messages.\n\nAFP has contacted World Boxing for comment.\n\nUnder its policy, fighters over 18 who want to participate in a World Boxing-sanctioned competition need to take a PCR, or polymerase chain reaction genetic test.\n\nLin and Khelif were excluded from the International Boxing Association’s (IBA) 2023 world championships after the IBA said they had failed eligibility tests.\n\nHowever, the International Olympic Committee (IOC) allowed them both to compete in Paris, saying they had been victims of “a sudden and arbitrary decision by the IBA”. Both went on to triumph.\n\nKhelif has turned to sport’s top court, CAS, to challenge World Boxing’s gender testing.\n\nAt present, neither boxer is set to compete in Liverpool.\n\nKhelif and Lin were subjected to attacks on social media, rumours about their biological sex and disinformation during the Paris Games.\n\nThe IOC leapt to their defence, saying they were born and raised as women, and have passports attesting to that.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/02153543ff5601e.webp",
  "retrievedAt": "2025-09-06T09:59:45.324Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939170/taiwanese-olympic-boxer-lin-wont-compete-at-world-championships-amid-gender-row",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T10:38:54.000Z"
}
