{
  "title": "Afghanistan earthquake death toll crosses 1,400, authorities say - World - DAWN.COM",
  "author": null,
  "content": "The death toll from Afghanistan’s worst earthquake in years jumped to over 1,400 on Tuesday with thousands more injured, authorities said, as difficult terrain hindered rescue efforts in isolated villages of the country’s mountainous eastern region.\n\nAt least 1,411 people have died, 3,124 have been injured and over 5,400 houses have been destroyed, Taliban administration spokesperson Zabihullah Mujahid said.\n\nMore people are feared trapped under rubble, said the Afghan Red Crescent Society, a humanitarian group working in the region. The United Nations coordinator in Afghanistan said the toll was likely to rise.\n\nA magnitude 5.2 earthquake struck eastern Afghanistan later today, according to the US Geological Survey (USGS). The epicentre of the quake was 34 kilometres northeast of Jalalabad city in Nangarhar province, according to the USGS.\n\nAfghanistan is prone to deadly earthquakes, particularly in the Hindu Kush mountain range, where the Indian and Eurasian tectonic plates meet.\n\nThe earthquake, with a magnitude of 6.0, struck around midnight local time on Sunday, at a shallow depth of 10km, with the eastern provinces of Kunar and Nangarhar being the worst hit.\n\nRescue operations were carried out in four badly hit villages in Kunar on Monday and efforts will now be focused on reaching more remote mountain areas, said Ehsanullah Ehsan, the provincial head of disaster management.\n\n“We cannot accurately predict how many bodies might still be trapped under the rubble,” said Ehsan. “Our effort is to complete these operations as soon as possible and to begin distributing aid to the affected families.”\n\nEmergency “operations continued throughout the night”, Ehsan separately told AFP.\n\nHe said there were “still injured people left in the distant villages” in need of evacuation to hospitals.\n\nMeanwhile, villagers joined the rescue efforts, using their bare hands to clear debris from mud and stone homes built into steep valleys.\n\nObaidullah Stoman, 26, who travelled to the village of Wadir to search for a friend, was overwhelmed by the level of destruction.\n\n“I’m searching here, but I didn’t see him. It was very difficult for me to see the conditions here,” he told AFP. “There is only rubble left.”\n\nThe dead, including children, were wrapped in white shrouds by villagers who prayed over their bodies before burying them.\n\nSome of the hardest-hit villages remain inaccessible due to blocked roads, the United Nations migration agency told AFP.\n\nMountainous terrain and inclement weather have hindered rescuers from reaching remote areas along the border with Pakistan, where the quake flattened hundreds of mud-and-brick homes.\n\nAccess for vehicles along narrow mountain roads was the main obstacle, said Ehsan, adding machinery was being brought in to clear roads of debris.\n\nOn Tuesday, a line of ambulances was on the damaged mountain road trying to reach Kunar villages, as helicopters flew in, bringing aid supplies and taking the injured to hospitals, according to a Reuters witness.\n\nSome of those injured have been transferred to hospitals in Kabul and the adjacent province of Nangarhar, said Ehsan.\n\nThousands of children were at risk, the United Nations Children’s Fund (Unicef) warned on Tuesday.\n\nUnicef said it was sending medicines, warm clothing, tents and tarpaulins for shelter, and hygiene items such as soap, detergent, towels, sanitary pads, and water buckets.\n\nTaliban soldiers were deployed in the area, providing help and security.\n\nRescue teams and authorities were trying to dispose of animal carcasses quickly so as to minimise the risk of contamination to water resources, a UN official said on Monday.\n\n“Damaged roads, ongoing aftershocks, and remote locations of many villages severely impede the delivery of aid,” the World Health Organisation said, adding that over 12,000 people had been affected by the quake.\n\n“The pre-earthquake fragility of the health system means local capacity is overwhelmed, creating total dependence on external actors,” it said.\n\nFood and tents were desperately needed, said Safiullah Noorzai from Aseel, a humanitarian tech platform with networks around Afghanistan. With their houses in ruins, many people were living in the open amid a fear of aftershocks, Noorzai added.\n\nAfter decades of conflict, Afghanistan is one of the poorest countries in the world, facing a protracted humanitarian crisis and the influx of millions of Afghans forced back to the country by neighbours Pakistan and Iran in recent years.\n\nSince the Taliban seized power in 2021, foreign aid to the country has been slashed, undermining the already impoverished nation’s ability to respond to disasters.\n\nThe United States was the largest aid donor until early 2025, when all but a sliver of funds were cancelled after President Donald Trump took office.\n\nIn June, the United Nations said it was drastically scaling back its global humanitarian aid plans due to the “deepest funding cuts ever”.\n\nOn Monday, UN Secretary General Antonio Guterres said in a statement the organisation was working with authorities to “swiftly assess needs, provide emergency assistance and stand ready to mobilise additional support”, and announced an initial $5 million.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif also expressed deep condolences to the families who lost their loved ones in the earthquake.\n\nMeanwhile, the Khyber Pakhtunkhwa government decided to immediately dispatch a consignment of essential medicines to earthquake-stricken reg­ions of Afghanistan, with Chief Minister Ali Amin Gandapur announcing that the provincial government was fully prepared to deploy medical staff.\n\nToday, adviser to KP CM on Information Barrister Mohammad Ali Saif further assured that the provincial government “will extend full support to the affected Afghan families, emphasising solidarity in this hour of hardship.”\n\n“We stand shoulder to shoulder with our Afghan brothers during this difficult time and assure them of all possible assistance,” state-run Associated Press of Pakistan (APP) reported on Tuesday.\n\nThe report quoted him as saying that “hospitals across Khyber Pakhtunkhwa are open and ready to treat injured Afghan victims of the earthquake. Relief teams, rescue workers, medicines, tents, and food supplies are prepared for immediate dispatch to the affected areas.”\n\nEarlier, Foreign Minister Ishaq Dar also held a phone call with his Afghan counterpart Amir Khan Muttaqi and assured him of Pakistan’s “readiness to extend all possible support”.\n\nAccording to the Foreign Office (FO), Dar held a phone call with Muttaqi on Monday “to convey condolences on the tragic loss of lives, with thousands injured in last night’s earthquake in Afghanistan.”\n\nMeanwhile, Britain has allocated 1 million pounds to support the efforts of the UN and the International Red Cross in delivering critical healthcare and emergency supplies to Afghanistan.\n\nIndia delivered 1,000 tents and was moving 15 tonnes of food supplies to Kunar, with more relief materials to be sent on Tuesday.\n\nOther nations such as China, the United Arab Emirates, the European Union and Iran have also pledged help, but aid is yet to arrive.\n\nAfghanistan is frequently hit by earthquakes, especially in the Hindu Kush mountain range, near the junction of the Eurasia and India tectonic plates.\n\nIn October 2023, western Herat province was devastated by a 6.3-magnitude earthquake, which killed more than 1,500 people and damaged or destroyed more than 63,000 homes.\n\nA 5.9-magnitude quake struck the eastern province of Paktika in June 2022, killing more than 1,000 people and leaving tens of thousands homeless.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/02141727e26a22a.webp",
  "retrievedAt": "2025-09-06T09:59:49.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939163/afghanistan-earthquake-death-toll-crosses-1400-authorities-say",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T10:05:36.000Z"
}
