{
  "title": "UN launches migration network in Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "• Initiative follows 2016 New York Declaration, aligned with Global Compact for Migration and SDGs\n• IOM to coordinate, with UN Resident Coordinator Mohamed Yahya as network chair\n• Pakistan’s first Migration Multi-Partner Trust Fund Programme also launched\n\nISLAMABAD: The United Nations launched on Monday the Network on Migration in Pakistan to strengthen migration management and governance to facilitate safe, orderly and regular migration.\n\nThe establishment of the United Nations Network on Migration (UNNM) marked a significant step towards a unified, collaborative approach to migration governance and responding to the inter-connected challenges of human trafficking and migration smuggling.\n\nThe network has been established in Pakistan in pursuance of the ‘New York Declaration for Refugees and Migration’, unanimously adopted by UN member states in 2016, which created the UNNM. The declaration marked a major commitment to address large movements of people and laid the foundation for two global compacts, including one on safe, orderly and regular migration\n\nIt is aligned with international frameworks, including the 2030 Agenda for Sustainable Development and the Global Compact for Safe, Orderly and Regular Migration (GCM), which is the first comprehensive, intergovernmental framework on migration.\n\nThe International Organisation for Migration (IOM), as coordinator and secretariat of the UN Network on Migration, plays a central role in the network, alongside the United Nations Resident Coordinator in Pakistan, who will serve as the network’s chair. The network will leverage partnerships across the UN system to promote policy coherence and integrate migration policies into the broader development goals.\n\nSpeaking at the launch ceremony, UN Resident Coordinator in Pakistan Mohamed Yahya said the network provides a crucial platform to shift the narrative on migration, amplify a unified voice, and foster the innovation needed to address complex challenges related to mobility and protecting the rights of all people on the move.\n\nCoinciding with the UNNM launch, Pakistan’s first Migration Multi-Partner Trust Fund Programme (MMPTF) was also launched. The MMPTF aimed at ‘Streng­thening Response to Combat Trafficking in Persons’ and ‘Smuggling of Migrants in Pakistan’ is being implemented jointly by the IOM and the United Nations Office on Drugs and Crime (UNODC) in collaboration with the Pakistan government, private sector, and civil society.\n\nThe joint programme supports national efforts in migration management and governance and in combatting human trafficking and migrant smuggling with a whole-of-government and whole-of-society approach. The MMPTF was established to support the implementation of GCM and is the only pooled funding mechanism dedicated to migration, open to all states.\n\nIn a video message, Head of UN Migration Network Secretariat Jonathan Prentice congratulated Pakistan for continuing to play a significant role in the global effort to help improve migration governance in the world.\n\nThe launching ceremony also featured a Pakistani migrant recently returned from an arduous journey to Europe and reintegrated back home. “Life makes us move. But journeys, either from our home to new destinations or back to our country, should become easier and more dignified,” said Moazzam Ali, who opted for voluntary return to Pakistan from Romania with IOM’s support.\n\nA high-level panel discussion titled “Enhancing Whole-of-Government Migration Governance in the Age of Complex Mobility Dynamics and Emerging Global Challenges” was also held. It was moderated by Dr Nasra M. Shah, Professor of Migration and Development at the Lahore School of Economics. Panelists included representatives from the ministries of foreign affairs, interior, overseas Pakistanis and human resource development, the National Commission for Human Rights, IOM, and civil society organisations.\n\nPublished in Dawn, September 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:00:25.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939052/un-launches-migration-network-in-pakistan",
  "dateList": "2025-09-02",
  "date_published": "2025-09-01T23:33:00.000Z"
}
