{
  "title": "Nestle investors face more turbulence after CEO ousted over affair with subordinate - Business - DAWN.COM",
  "author": null,
  "content": "Nestle investors were pitched back into choppy waters on Tuesday after the Swiss food giant changed its chief executive officer for the second time in a year, ousting boss Laurent Freixe over an affair he had with a subordinate.\n\nThe company’s shares were indicated 1.9 per cent lower in premarket activity in Zurich following Freixe’s sudden dismissal on Monday following a board meeting to discuss the findings of an investigation into the relationship.\n\nThe downturn is another blow for Nestle investors who have been frustrated with three years of share price declines between 2022 and 2024 and no signs of a recovery this year.\n\nFreixe will be replaced by Philipp Navratil, a rising star at the maker of Nescafe coffee and KitKat chocolate bars, which has been struggling with sales volumes since the pandemic.\n\nThe dismissal of Freixe follows an investigation into an undisclosed romantic relationship with a direct subordinate, which breached Nestle’s code of business conduct, Nestle said late on Monday.\n\nFreixe, who spent 39 years with Nestle, will receive no exit package following his departure, the company told Reuters.\n\nThe Nestle veteran’s abrupt removal comes a year after predecessor Mark Schneider was axed, and two and a half months after longstanding chair Paul Bulcke announced he would step down in 2026 in one of the most turbulent periods in the company’s 159-year history.\n\nIn a short statement, Bulcke thanked Freixe for his years of service at Nestle, but said the dismissal was a “necessary decision”.\n\nNestle’s shares, a bedrock of the Swiss stock exchange, have lost almost a third of their value over the past five years, underperforming European peers.\n\nFreixe’s appointment failed to halt the slide, with the company’s shares shedding 17pc during his leadership, disappointing investors.\n\nIn July, Nestle launched a review of its underperforming vitamins business that could lead to the divestment of some brands after first-half sales volumes missed expectations.\n\n“The market did not particularly like Freixe, and the restructuring goals were also put on the back burner,” said Maurizio Porfiri, chief investment officer at trading firm Maverix.\n\n“Another fresh start is needed, and it is time for more stability to return to the management at this global corporation,” he told Reuters.\n\nFreixe’s dismissal was featured on the front page of Swiss newspapers, with Neue Zuercher Zeitung noting that Nestle had lost its “legendary stability” where CEOs stayed for years before eventually becoming chairmen.\n\nThe latest change is likely to leave questions unanswered about Nestle’s mid-term direction and “keep a lid on the equity story until we hear more about Mr Navratil’s plan,” JP Morgan analysts said in a research note.\n\nThe bank’s analysts said the news of Freixe’s ouster was unlikely to reassure investors because it was the second time in a year that the company had appointed a new boss without carrying out a thorough search for a replacement.\n\nThe note also expressed concern that incoming CEO Navratil looked as though he would be “boxed in” by Freixe’s turnaround strategy for now at a time when the market remained unconvinced.\n\nJon Cox, an analyst at Kepler Cheuvreux, said he expected Nestle’s shares to come under pressure due to the latest upheaval at Nestle’s HQ in Vevey, next to Lake Geneva.\n\n“This is not the Nestle way to do things, to have two CEO replacements in just over a year,” Cox said. “Hopefully this will get them back on the straight and narrow.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/021257059be8b8c.webp",
  "retrievedAt": "2025-09-06T09:59:49.436Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939147/nestle-investors-face-more-turbulence-after-ceo-ousted-over-affair-with-subordinate",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T08:06:52.000Z"
}
