{
  "title": "North Korea’s Kim Jong Un to line up with the ‘big boys’ at China military parade - World - DAWN.COM",
  "author": null,
  "content": "Kim Jong Un’s trip to Beijing this week offers the reclusive young North Korean leader an unprecedented opportunity to stand beside partners from China and Russia, gain implicit support for his banned nuclear weapons, and expand his diplomatic circle.\n\nKim rode into the Chinese capital in his signature armoured train on Tuesday, ahead of his attendance at a military parade to be held by China to commemorate the end of World War Two. He has never attended a world event with so many other foreign leaders, and it marks one of his most momentous diplomatic moves since holding historic summits with Donald Trump during the US president’s first term, analysts and South Korean officials said.\n\nWhile more than two dozen national leaders will attend, the Kremlin has said Russian President Vladimir Putin and Kim will flank Chinese President Xi Jinping on either side during the parade.\n\n“It’s elevating North Korea’s position to kind of the big boys, and then Kim can project that image back home like he did with his summit with Donald Trump, he can really show off his world statesman side,” said John Delury, a senior fellow at The Asia Society. “Kim Jong Un is a global brand.”\n\nSome Western analysts have dubbed the trio an “Axis of Upheaval,” but South Korea’s National Intelligence Service (NIS) told lawmakers in Seoul on Tuesday that the event may be unlikely to lead to real trilateral cooperation soon.\n\nWhat is more clear, however, is the political, economic, and military benefits to Kim and North Korea, which is under numerous international sanctions for its nuclear weapons and ballistic missile programmes, and the government’s human rights abuses.\n\n“This China visit is a bold move by Kim Jong Un as he makes a debut in multilateral diplomacy by displaying the optics of allying with China and Russia and it’s likely he will go on to take dramatic steps both domestically and internationally,” South Korean lawmaker Lee Seong-kweun told reporters after a closed-door briefing by the intelligence agency.\n\nSouth Korea’s parliament speaker will also be attending the event and said on Tuesday he would raise the issue of peace on the peninsula if he gets a chance to see Kim, but that he was not sure a meeting would happen.\n\nKim visited North Korean missile production facilities immediately before leaving for China, underscoring the country’s status as a nuclear power, said Hong Min, a senior research fellow at Seoul’s Institute for National Unification.\n\n“In addition, North Korea’s legitimacy for possessing nuclear weapons is indirectly supported by watching and applauding a military parade featuring China’s advanced [nuclear] weapons,” he said.\n\nIn 2023, Kim embarked on a significant diplomatic gambit with Putin that led to summits in Russia and in North Korea, a mutual defence treaty, and the sending of thousands of troops and weapons for Russia’s war with Ukraine.\n\nThe Beijing visit will help restore North Korea’s relations with China, which have frayed as Kim cultivated those Russian ties, and help Pyongyang secure economic aid in the face of continued sanctions, the NIS said.\n\nIt could also help Kim hedge his bets in case the war in Ukraine winds down and Russia no longer needs as much help, and could send signals to Washington by displaying China’s support, the agency concluded.\n\n“From Kim’s perspective, this visit and these events present nothing but opportunities and benefits,” said Michael Madden, a North Korea leadership expert with the US-based Stimson Centre, noting that the last time a North Korean leader was present at a big, multilateral event like this outside the country was in 1959.\n\nBeyond Xi and Putin, Kim will have his first chance to meet with leaders of many countries, even if only informally, and potentially expand cooperation or simply make a first impression on otherwise wary officials, Madden said.\n\n“As we have seen in the past, the impact of the North Korean leaders presence, shorn of the trappings of the … propaganda machine, is almost always disarming to foreign leaders,” he said. “Foreign leadership who have avoided North Korea may change their minds if they meet Kim.”\n\nMoreover, Sang Uk, a military expert at the Asan Institute in Seoul, said, “I do believe that the sales for weapons are one of the purposes of this visit.”\n\nThat is likely secondary to the political messaging, however, and given that United Nations Security Council resolutions technically remain in force on North Korea, any arms deals would have to happen under the table, he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/021516528bfe461.webp",
  "retrievedAt": "2025-09-06T09:59:47.463Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939169/north-koreas-kim-jong-un-to-line-up-with-the-big-boys-at-china-military-parade",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T10:30:41.000Z"
}
