{
  "title": "COVID-19 has disrupted learning of children, youth, adults at unprecedented scale: UNESCO",
  "link": "https://www.app.com.pk/national/covid-19-has-disrupted-learning-of-children-youth-adults-at-unprecedented-scale-unesco/",
  "date_published": "2021-09-08T17:52:00.000Z",
  "source": "APP",
  "content": "The United Nations Educational, Scientific, and Cultural Organization (UNESCO) in a message on International Literacy Day said the COVID-19 crisis has disrupted the learning of children, young people and adults at an unprecedented scale.\nIt has also magnified the pre-existing inequalities in access to meaningful literacy learning opportunities, disproportionally affecting 773 million non-literate young people and adults. Youth and adult literacy were absent in many initial national response plans, while numerous literacy programmes have been forced to halt their usual modes of operation. Even in the times of global crisis, efforts have been made to find alternative ways to ensure the continuity of learning, including distance learning, often in combination with in-person learning. Access to literacy learning opportunities, however, has not been evenly distributed.\nThe rapid shift to distance learning also highlighted the persistent digital divide in terms of connectivity, infrastructure, and the ability to engage with technology, as well as disparities in other services such as access to electricity, which has limited learning options.\nThe pandemic, however, was a reminder of the critical importance of literacy.\nBeyond its intrinsic importance as part of the right to education, literacy empowers individuals and improves their lives by expanding their capabilities to choose a kind of life they can value. It is also a driver for sustainable development.\nLiteracy is an integral part of education and lifelong learning premised on humanism as defined by the Sustainable Development Goal 4. Literacy, therefore, is central to a human-centred recovery from the COVID-19 crisis, it added.\nILD 2021 will explore how literacy can contribute to building a solid foundation for a human-centred recovery, with a special focus on the interplay of literacy and digital skills required by non-literate youth and adults.\nIt will also explore what makes technology-enabled literacy learning inclusive and meaningful to leave no one behind. By doing so, ILD2021 was an opportunity to reimagine future literacy teaching and learning, within and beyond the context of the pandemic.\nIt is to mention here that ILD is an opportunity for governments, civil society and stakeholder to highlight improvements in world literacy rates, and reflect on the world’s remaining literacy challenges.\nThe issue of literacy is a key component of the UN’s Sustainable Development Goals and the UN’s 2030 Agenda for Sustainable Development.\nThe theme of this year’s ILD is Literacy in a Digital World'. International literacy day is dedicated toilliteracies for the 21st century’ to highlight the need to realise `basic literacy skills for all’ as well as equip everyone with more advanced literacy skills as part of lifelong learning.",
  "retrievedAt": "2025-08-11T21:11:13.382Z"
}
