{
  "title": "RSS-BJP regime in Delhi launches baseless campaign against Pakistan HC in New Delhi : Shibli",
  "link": "https://www.app.com.pk/national/rss-bjp-regime-in-delhi-launches-baseless-campaign-against-pakistan-hc-in-new-delhi-shibli/",
  "date_published": "2020-06-01T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP):Minister for Information and Broadcasting, Senator Shibli Faraz said on Monday the RSS-BJP government in India, targeting minorities, especially Muslims, for racist and violent acts, has launched a campaign of baseless and false allegations against the staff of the Pakistani High Commission in New Delhi.\nIn a statement, the minister said under the international law, preventing the Pakistan High Commission from discharging its diplomatic duties and arresting and torturing diplomatic staff was a heinous and highly reprehensible act.\nThe aim of vicious campaign, he said, was to cover up its crimes, to avoid global stigma against its treatment with minorities and divert attention from state terrorism against unarmed Kashmiris in Indian occupied Jammu and Kashmir.\nThe international community should take note of India’s actions and hold New Delhi accountable for its violations of diplomatic and international laws.\nIndia is guilty of aggression against all its neighbours in the region, said Senator Shibli Faraz.\nIndian mischief and expansionist mindset had forced even a peace-loving and progressive country like China to deploy its army on Indian border.\nHe said similar news were reported in the media regarding Nepal.\nShibli Faraz said unilateral and illegal Indian action in Indian occupied Jammu and Kashmir, an internationally recognized unresolved dispute was a clear violation of United Nations Security Council resolutions and international laws and a charge sheet against New Delhi.\nForeign Office spokesperson Aisha Farooqui had already rejected Indian act.\n“We condemn the detention and torture as well as threatening and pressuring of the diplomatic officials to accept false charges,” she said in her response.\nShe said Pakistan strongly rejected the baseless Indian allegations and deplored the Indian action which she termed as clear violation of the Vienna Convention on diplomatic relations as well as the norms of diplomatic conduct especially in an already vitiated atmosphere.\n“The High Commission for Pakistan in New Delhi has always worked within the parameters of international law and diplomatic norms.\nThe Indian action is clearly aimed at shrinking diplomatic space for the working of Pakistan High Commission,” she added.",
  "retrievedAt": "2025-08-11T19:16:47.378Z"
}
