{
  "title": "PM discusses COVID-19, other subjects with his Italian counterpart",
  "link": "https://www.app.com.pk/national/pm-discusses-covid-19-other-subjects-with-his-italian-counterpart/",
  "date_published": "2020-06-01T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP):Prime Minister Imran Khan held a telephonic conversation with his Italian counterpart Giuseppe Conte on Monday, and discussed the COVID-19 pandemic and a broad range of other subjects.\nOffering deep condolences over the loss of precious lives, the prime minister commended Italy’s efforts to fight the pandemic.\nHe briefed the Italian prime minister about the latest situation in Pakistan and the steps taken by the government to contain the spread of the virus.\nUnderlining the imperative of saving lives and livelihoods, the prime minister highlighted the salient points of Pakistan’s strategy to deal with the twin challenges of health and socio-economic impacts.\nHe also apprised the Italian prime minister about his “Global Initiative on Debt Relief” for the developing countries. Underscoring the need for a comprehensive plan of action to create fiscal space and strengthen economies, he appreciated Italy’s support for the initiative. He emphasized that the developed countries could not deal with global economic recession without taking the developing countries along. The global challenge required a global and holistic response, he added.\nPrime Minister Imran Khan shared deep concern over continuing double lockdown as well as the intensification of military crackdown by the occupation forces in the Indian Occupied Jammu & Kashmir (IOJ&K). He denounced India’s moves to alter the demographic structure of the occupied territory, calling it a clear violation of relevant United Nations Security Council resolutions and international law, including the 4th Geneva Convention.\nThe Indian government’s policies were posing serious threat to regional peace and security, he stressed.\nThe prime minister also highlighted demonization of Muslims in India in the context of COVID-19, underlining that it should be rejected by the international community.\nHe reiterated his invitation to Prime Minister Conte to visit Pakistan, once the COVID-19 situation improved.\nThe two leaders agreed to remain engaged on all matters of mutual interest.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:46.302Z"
}
