{
  "title": "Provinces agree to NCOC proposed negative list",
  "link": "https://www.app.com.pk/national/provinces-agree-to-ncoc-proposed-negative-list/",
  "date_published": "2020-06-01T02:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP):The provincial chief ministers on Monday agreed to the negative list proposed by the National Command and Operation Centre (NCOC) to allow operational activities to the left over economic and industrial sectors halted due to the COVID-19 pandemic.\nThe provincial chief ministers had joined the NCOC meeting through video link which was chaired by Minister for Planning, Development and Special Initiatives Asad Umar.\nChief Minister Punjab Usman Buzdar expressed his agreement on the negative list aimed at allowing left over closed economic sectors with strict compliance of Standard Operating Procedures (SOPS). He suggested the forum to review the testing regime as every single individual could not be tested and the policy should be reduced to testing of only symptomatic and affected patients.\nChief Minister Sindh Syed Murad Ali Shah said that the negative list was agreed, however, opening of restaurants with SOPs compliance was not possible as proposed in the negative list. He added that there was no public compliance of SOPs which made it difficult to allow restaurants to operate. Shah suggested that the media campaigns should underscore the following of safety guidelines and SOPs.\nChief Minister Khyber Pakhtunkhwa Mehmood Khan also supported the negative list. He highlighted the issues faced by overseas Pakistanis stranded in the Kingdom of Saudi Arabia (KSA) and requested the forum to provide assistance in this regard.\nChief Minister Balochistan was represented by the parliamentary Secretary who conveyed the comments of Chief Minister Jam Kamal Khan. She mentioned that SOPs compliance was a major challenge in the province and, therefore, it was not possible to open up schools in the prevailing contagion.\nChief Minister Gilgit Baltistan Hafiz Hafeezur Rehman also agreed to the proposed negative list and said that GB had already closed the sectors flagged in the list. He underscored the need for a budgetary support for the province as its tourism sector, the backbone of the province, had borne the brunt of economic crunch due to the lockdown. He added that the available ventilators were already occupied, and requested the forum to provide its share from the procured ventilators of the federal government.\nThe Chief Minister noted that the tourism sector would remain closed till the outbreak risk reduces.\nPrime Minister Azad Jammu and Kashmir (PM AJK) Raja Farooq Haider Khan said that there was a need to deploy provincial health assets on the Airports of the country for swift screening and credible data gathering. He said that the AJK administration fully agreed to the halting of the tourism sector till the pandemic fades away. The PM AJK also assured strict compliance of SOPs in all the sectors which were being allowed to open.\nSpeaking on the occasion, Asad Umar said that the provincial suggestions and reservations were well noted and incorporated in the decision making. He said that the national and political leadership at the forum had agreed upon the right to earn livelihood without jeopardizing other people’s life by spreading the virus and that punitive actions should be undertaken to ensure strict compliance of SOPs.\nSpecial Assistant to the Prime Minister on National Security Dr Moeed Yusuf informed the forum that testing regime for the Airports was going to be abolished from the 2nd of June where only symptomatic patients would be tested on arrival whereas the asymptomatic arrivals would be home quarantined and put under the track and trace system. He added that two 777 aircrafts were going to fly for KSA to bring back 26 dead bodies of the stranded Pakistanis.",
  "retrievedAt": "2025-08-11T19:16:52.182Z"
}
