{
  "title": "PM for provision of all possible incentives to industry in budget",
  "link": "https://www.app.com.pk/national/pm-for-provision-of-all-possible-incentives-to-industry-in-budget/",
  "date_published": "2020-06-01T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP):Prime Minister Imran Khan on Monday said every effort should be made to provide all possible incentives to the industry, create jobs for the youth and moving the wheels of economy. He said that the most affected sectors be identified so as to provide them with maximum possible support in the forthcoming budget.\nThe prime minister stated this while chairing a meeting to discuss the objectives and considerations for the forthcoming budget (FY 2020-21).\nThe meeting was attended by Foreign Minister Shah Mehmood Qureshi, Minister for Industries & Production Muhammad Hammad Azhar, Planning Minister Asad Umar, Finance Adviser Dr Abdul Hafeez Sheikh, Adviser Commerce Abdur Razzak Dawood, Adviser Institutional Reform Dr Ishrat Hussain and senior officials.\nThe prime minister said the corona pandemic had severely affected the upward trajectory of economy towards stabilization and strengthening. The government, despite its financial constraints, gave an unprecedented stimulus economic package to support businesses and industry, and to minimize the impact of coronavirus.\nDiscussing priorities for the forthcoming budget, the prime minister directed that the process of cutting unnecessary government expenditure should be expedited at all levels, including the Federal Government as well as the provincial governments.\nImran Khan stressed upon the need for reviewing the existing system of provision of subsidies to make them target-oriented and ensure their optimum utilization.\nHe said the present situation called for expediting the reforms process in critical sectors so as to reduce burden on the national exchequer and provide relief to the masses.\nThe prime minister also directed the adviser finance to apprise the people about the current economic situation and the strategy being followed by the government to cope with the challenges.\nDr Hafeez Sheikh apprised the meeting about the overall state of economy and the philosophy, objectives and considerations for the next budget, FY2020-21.\nHe also dilated upon various economic constraints, especially in the wake of corona pandemic, that had made the government to further focus on providing incentives to the industry for its revival and growth, cutting unnecessary government expenditure, rationalize subsidies and expedite reforms process in critical sectors.\nVarious proposals were discussed in detail to stimulate the corona-affected economy, especially ensuring greater participation of the private sector in the development process and promoting public-private partnership to complement public sector development programme.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:46.377Z"
}
