{
  "title": "27th Amendment ‘dethrones’ Supreme Court, legal experts warn",
  "author": "Nasir Iqbal",
  "content": "• Article 175 tweak ‘ends judiciary as we knew it’, says senior counsel\n• Supporters believe new constitutional court will modernise judiciary\n\nISLAMABAD: The initial draft of the 27th Constitutional Amendment Bill, ta­­b­led in the Senate on Saturday, has led many legal experts to believe that the tw­­eaks would, in effect, dethrone the Sup­r­e­­me Court as the country’s highest judicial forum, ceding that position to a proposed Federal Constitutional Court (FCC).\n\nHowever, proponents of the amendment say the new constitutional court would modernise the judiciary, reduce backlogs and separate constitutional and appellate jurisdictions — a reform they argue will improve efficiency and clarity in the justice system.\n\n“Left with a limited jurisdiction of deciding ordinary civil, criminal and statutory appeals, the Supreme Court has now become all the more a ‘Supreme District Court’,” remarked a senior counsel who asked not to be named.\n\nHe warned that the government could now amend laws like the Elections Act 2017 and others to route appeals to the FCC instead of the Supreme Court.\n\nAmendment to Article 175, he said, was “virtually the end of the judiciary as we knew it”, arguing that the Supreme Court had been “amended out of the Constitution by making it irrelevant”.\n\nFormer additional attorney general Tariq Mehmood Khokhar said the essence of the package was twofold.\n\nFirst, the insertion of a new Chapter 1A in the Constitution that, in his view, tightens executive control over the superior judiciary through expanded powers to transfer high court judges, and establishes an FCC “empowered by disempowering the Supreme Court”.\n\nSecond, an amendment to Article 243 that formally vests the office of Chief of the Defence Forces in the Chief of the Army Staff and constitutionally guarantees the Field Marshal rank for life.\n\nAnother lawyer, also speaking on condition of anonymity, said that although the senior-most of the two chiefs would chair the Judicial Commission of Pakis­tan, “for all other purposes, the FCC will be in the commanding position”.\n\nHe pointed out that wherever the oaths of judges of the Supreme Court and FCC are mentioned, the FCC is referenced first. “It is clear now which court is higher in terms of hierarchy,” he said.\n\nHe noted that under the amended Article 175A, the chief justice of the FCC is listed before the chief justice of the Supreme Court and will have a longer tenure, retiring at 68, compared to the current retirement age of 65 for Supreme Court judges.\n\n‘Forward-looking reform model’\n\nIn contrast, senior counsel Hafiz Ahsaan Ahmad Khokhar welcomed the initiative, calling the proposed 27th Amendment “a major and long-awaited structural shift” in the justice system.\n\nHe said the creation of two separate apex courts — the existing Supreme Cou­rt dealing primarily with appellate functions, and a new FCC with exclusive jurisdiction over constitutional interpretation, inter-governmental disputes and matters arising under Article 199 — ref­lected “a forward-looking reform model”.\n\nThis division, he argued, would bring Pakistan closer to systems in many established democracies where constitutional and advisory jurisdictions are institutionally distinct, providing “greater clarity, efficiency and constitutional coherence”.\n\nHe said the reforms could help depoliticise the higher judiciary, eliminate internal divisions, reduce backlogs and prevent overlapping between constitutional and appellate benches.\n\nMr Khokhar said the amendments to Article 243 were in line with “modern constitutional democracies”, with a unified advisory framework under a principal military adviser answerable to the prime minister, the defence minister and the National Security Committee.\n\nMeanwhile, newly elected Supreme Court Bar Association President Haroonur Rasheed supported the idea of setting up an FCC, and said the association was considering convening an All Pakistan Lawyers Convention, in consultation with the Pakistan Bar Council and other bar bodies. “I am glad that an FCC is being established in the country by amending the Constitution with consensus and unanimity,” he said.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0907235869ca412.webp",
  "retrievedAt": "2025-11-09T02:53:11.917Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954002/27th-amendment-dethrones-supreme-court-legal-experts-warn",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:21.000Z"
}
