{
  "title": "‘The name is Mamdani’: Democrat Zohran elected New York City’s first Muslim mayor",
  "author": "Anwar Iqbal | AFP | Reuters",
  "content": "Zohran Mamdani, a 34-year-old Democratic socialist, won the New York City mayoral race on Tuesday, capping a meteoric rise from a little-known state lawmaker to one of the United State’s most visible Democratic figures.\n\nAccording to CBS, Mamdani received 1,035,645 votes (50.4 per cent) against 854,783 (41.6pc) for former New York governor Andrew Cuomo and 146,127 (7.1pc) for Republican candidate Curtis Sliwa.\n\nMamdani will become the first Muslim mayor of the largest US city. He defeated Democratic former Governor Andrew Cuomo, 67, who ran as an independent after losing the nomination to Mamdani in the primary election. The campaign served as an ideological and generational contest that could have national implications for the Democratic Party.\n\nDemocrats won two key state governor races, sending an early warning signal to Republican President Donald Trump ahead of the 2026 midterms.\n\nThe clean sweep among several ballots nationwide has boosted morale among Democrats bruised by Trump’s return to the White House and has set alarm bells ringing among Republican circles.\n\nMamdani, the youngest to serve in more than a century, was born in Uganda to a family of Indian origin and has lived in the United States since he was seven, becoming a naturalised US citizen in 2018.\n\nThe Democratic socialist’s victory came in the face of fierce attacks on his policies and his Muslim heritage from business elites, conservative media commentators and Trump himself, who had made an eleventh-hour intervention in the race, calling Mamdani a “Jew hater“.\n\n“Hope is alive,” Mamdani declared in his victory speech. “We won because New Yorkers allowed themselves to hope that the impossible could be made possible. We won because we insisted that no longer would politics be something that is done to us. Now, it is something we do,” he said.\n\nMamdani said New York would no longer be a city where one can “traffic in Islamophobia and win an election”, adding that the city will be a light “in this moment of political darkness”.\n\nHe pledged a city hall “that stands steadfast alongside Jewish New Yorkers and does not waver in the fight against the scourge of anti-Semitism, where the more than one million Muslims know that they belong”.\n\nHe quoted Jawaharlal Nehru, saying, “A moment comes, but rarely in history, when we step out from the old to the new, when an age ends, and when the soul of a nation, long suppressed, finds utterance.”\n\nThe Democrat also gave a message to the US president, who is also a New Yorker, saying, “Donald Trump, since I know you are watching, I have four words for you: Turn the volume up!”\n\nMamdani said he would put an end to the “culture of corruption” that has allowed billionaires like Trump to “evade taxation and exploit tax breaks”.\n\n“We will stand alongside unions and expand labour protections because we know, just as Donald Trump does, that when working people have iron-clad rights, the bosses who seek to extort them become very small indeed,” he said.\n\nPromising to fight for all New Yorkers, Mamdani said his administration would represent “immigrants, members of the trans community, Black women fired by Trump from federal jobs, single mothers struggling with rising costs — anyone with their back against the wall”.\n\nHe concluded his speech by thanking New Yorkers, saying, “This power is yours. This city belongs to you.”\n\nHis emphatic speech concluded with Bollywood song ‘Dhoom Machale’ blaring over the speakers.\n\nTurnout was high in this year’s vote with 2.06 million ballots, or 98pc of votes cast, counted by 12:31am on Wednesday — more than the total number of voters in the 2021 race.\n\n“The next and last stop is City Hall,” Mamdani said in a video posted to X after his victory was declared.\n\nEx-president Bill Clinton congratulated Mamdani. “I’m wishing you success as you work to transform the passion of your campaign into building a better, fairer, more affordable New York,” he said.\n\nThe former US First Lady and 2016 presidential candidate Hillary Clinton said that “more people voted in New York City’s election this year than they have in 50 years”.\n\nUS Senator Bernie Sanders said Mamdani had “pulled off one of the great political upsets in modern American history”.\n\n“Yes. We CAN create a government that represents working people and not the 1pc,” he said.\n\nFormer US president Barack Obama congratulated all the Democrat candidates who won on Tuesday, calling it a reminder that “when we come together around strong, forward-looking leaders who care about the issues that matter, we can win”.\n\n“We’ve still got plenty of work to do, but the future looks a little bit brighter,” he said.\n\nIn New York, one group exclaimed “Mamdaniiiiii“, substituting the 34-year-old’s name for the customary “cheese” as they posed for a photo at a Brooklyn bar watch party.\n\nVoters gathered there in cautious optimism, sporting Mamdani merch as they anxiously awaited the evening’s results, classic songs such as Frank Sinatra’s “New York, New York” and edgier tracks from Lou Reed blasting from the speakers.\n\nIt was a “local victory” that offered a means of “resisting and pushing back” against the political establishment in Washington, 40-year-old Ben Parisi told AFP, adding that the night stood in stark contrast to Trump’s victory a year ago.\n\n“A lot of us worked hard in one way or another to make this happen,” Parisi said, “and here we are… we get to celebrate“.\n\nMeanwhile, Ghazala Hashmi defeated Republican writer and conservative talk show host John Reid in the Virginia lieutenant governor’s race on Tuesday, becoming the first South Asian to hold statewide office in the state and the first Muslim woman ever elected to a statewide post in the United States\n\nHashmi maintained a steady lead over Reid throughout the campaign, though polling tightened in the final days before election day. She secured 747,773 votes (53.8 per cent) against 659,421 (46.4pc) for her Republican rival.\n\nEarlier in June, Hashmi narrowly clinched the Democratic nomination, defeating former Richmond Mayor Levar Stoney and state Senator Aaron Rouse in a closely contested primary.\n\nA member of the party’s progressive wing, Hashmi enjoyed strong support from prominent figures such as Representative Ro Khanna, a California Democrat, who backed her during the primary campaign.\n\nBorn in Hyderabad, India, Hashmi moved to the United States in her youth and later earned a PhD in English from Emory University. She began her career in academia, teaching English for over two decades at community colleges in Virginia before entering politics.\n\nHer election to the state Senate in 2019 marked her as the first Muslim woman to serve in the Virginia legislature, a milestone she has now extended to statewide office.\n\nIn Virginia, Democrat Abigail Spanberger easily won the election for governor, becoming the first woman elected to serve in that role, while Democrat Ghazala Hashmi won the Virginia lieutenant governor’s race, becoming the first South Asian to hold statewide office in the state and the first Muslim woman ever elected to a statewide post in the United States. And in New Jersey, Democrat Mikie Sherrill won the governor’s race.\n\nSpanberger defeated Republican Earle-Sears in the Virginia governor’s race, flipping control of the state and making her the first woman ever to serve as the state governor.\n\nA former congresswoman and CIA officer, Spanberger maintained a consistent lead over Earle-Sears through most of the campaign, buoyed by strong fundraising and strong support in the state’s suburban counties. Her victory gives Democrats a significant boost as they seek to regain political footing following their 2024 national election losses.\n\nSpanberger, 47, centred her campaign heavily on economic and affordability issues, as well as public safety and her support for abortion rights. Her campaign and allied groups attacked Earle-Sears over her conservative record on social issues and her loyalty to Trump. Earle-Sears, 61, struggled throughout much of the race to find a coherent message.\n\n“We sent a message to the world that in 2025 Virginia chose pragmatism over partisanship,” Spanberger said in her victory speech. “We chose our Commonwealth over chaos.”\n\n“You all chose leadership that will focus relentlessly on what matters most: lowering costs, keeping our communities safe and strengthening our economy for every Virginian,” she said.\n\nSeparately, Democrat Sherrill won New Jersey’s election for governor. Sherrill, a US representative and former Navy pilot, defeated Republican Jack Ciattarelli and will succeed Democratic Governor Phil Murphy.\n\nIt is the first time since the 1960s that New Jersey voters have elected governors from the same party for three consecutive terms.\n\nThe races offered the beleaguered Democratic Party a test of differing campaign playbooks a year ahead of the 2026 midterm elections, when control of Congress will be at stake.\n\nSince Trump’s win last year, Democrats have found themselves locked out of power in Washington and struggling to find the best path out of the political wilderness.\n\nReacting to Republican losses, Trump cited unspecified pollsters who attributed the loss to the ongoing government shutdown and Trump not leading the ballot.\n\n“‘TRUMP WASN’T ON THE BALLOT, AND SHUTDOWN, WERE THE TWO REASONS THAT REPUBLICANS LOST ELECTIONS TONIGHT,’ according to Pollsters,” Trump wrote on his Truth Social platform.\n\nProminent business people, including Bill Ackman, had noisily attacked Mamdani and funnelled cash to his rivals, while conservative media, including The New York Post, published blanket negative coverage.\n\nMamdani’s improbable rise highlights the Democratic Party’s debate over a centrist or a leftist future, with some leading national figures offering only tepid endorsements of Mamdani ahead of voting.\n\nSyracuse University political science professor Grant Reeher said ahead of the result that Mamdani would face an uphill battle.\n\n“Everybody’s got their knives out, and it’s a very difficult city to govern,” he told AFP.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0516321310bfc86.webp",
  "retrievedAt": "2025-11-09T00:45:21.490Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953265/the-name-is-mamdani-democrat-zohran-elected-new-york-citys-first-muslim-mayor",
  "dateList": "2025-11-09",
  "date_published": "2025-11-05T02:06:52.000Z"
}
