{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Rauf Parekh",
  "content": "Allama Iqbal’s date of birth has always been a contentious issue among scholars. Though the government of Pakistan had officially declared November 9, 1877 as Iqbal’s date of birth and the year 1977 was celebrated as Iqbal centennial year, some scholars have had their doubts and argued that it could not be said with absolute certainty that Iqbal was born on the official date.\n\nA great many articles have been written, both in Urdu and English, elaborating the issue of Iqbal’s date of birth. Going through these articles and some books — notably Allama Iqbal Ki Tareekh-i-Vilaadat: Aik Mutal’a, compiled by Waheed Qureshi and Zahid Muneer Aamir (Bazm-i-Iqbal, Lahore, 1994) — there are some interesting facts which emerge. Firstly, during the last 100 years or so, scholars have mentioned different dates while discussing Iqbal’s life. Second, despite the official announcement, disagreement still exists on Iqbal’s correct date of birth.\n\nAkber Hyderi Kashmiri, an Indian scholar, in his article published in Nuqoosh’s special issue on Iqbal (1977) listed contrasting years that different writers had mentioned as Iqbal’s birth year. These included: 1870, 1872, 1873, 1875, 1876 and 1877.\n\nMuhammaduddin Fauq (1877-1945), editor of Kashmiri Magazine, was among the scholars who penned the earliest writings on Iqbal. Fauq had mentioned 1875 as Iqbal’s year of birth, in his article published in 1909, but when Zulfiqar Ali Khan — in his book A Voice from the East (1922) — said Iqbal was born in or around 1876, Fauq changed his stance and, in Nairang-i-Khayal’s special issue on Iqbal (1932) wrote that Iqbal was born in 1876.\n\nToday, November 9, is celebrated as Muhammad Iqbal’s birthday and Iqbal Day every year. But there is still debate about Allama Iqbal’s actual date and year of birth\n\nOne of the reasons for this confusion was Iqbal’s own indifference to his year of birth. Once, when Fauq tried to gather some biographical details, Iqbal did not cooperate and wrote back in a letter (1922) saying that “there was nothing in it.”\n\nScholars had been quoting different years as to when Iqbal was born, but an editorial note and its correction in Inqelaab, one of Lahore’s leading newspapers at that time, sparked a debate that lives on even today.\n\nInqelaab had published, after Iqbal’s death (April 21, 1938), December 1876 as the month and year of Iqbal’s birth. But in its May 7, 1938 issue, another editorial note appeared, saying that Iqbal’s date of birth mentioned in a previous issue was based on what Sheikh Ata Muhammad, Iqbal’s real brother, had said. The note further said that it was established after research that Iqbal’s correct date of birth was February 22, 1873 and, according to the Islamic calendar, it was Zilhaj 23/24, 1289 Hijri.\n\nThis caught on and some writers began to quote Iqbal’s newly assumed date of birth. For instance, Muhammad Tahir Farooqi, in his Seerat-e-Iqbal (1939), wrote that he was born on 24 Zilhaj 1289, which corresponded to February 22, 1873. In 1951, the government’s archaeology department sent a letter to Bazm-i-Iqbal, Lahore, asking for the authentic date on which Iqbal was born, wrote Waheed Qureshi. Bazm-i-Iqbal constituted a committee which, after obtaining some records from Sialkot’s Municipal Committee and others from Iqbal’s school and college, discussed the issue in detail to resolve that Iqbal was born on February 22, 1873.\n\nThe committee decided to convey the date to the archaeology department to amend the year of Iqbal’s birth inscribed on his tombstone, which read 1292 Hijri (corresponding to 1875-76). Interestingly, the tombstone had been presented by the government of Afghanistan and nobody knew where they had got the year from.\n\nWith this authentication from Bazm-i-Iqbal, some writers — such as Abdul Majeed Salik in his Zikr-i-Iqbal (1955) — mentioned February 22, 1873 as Iqbal’s date of birth. Also, Pakistan’s postal department issued a commemorative postage stamp on Iqbal’s 20th death anniversary in 1958 and it carried 1873 as Iqbal’s year of birth.\n\nBut in 1958, Prof Jan Marek of Prague University published a research paper titled ‘The Date of Muhammad Iqbal’s Birth’ in which he said that, according to Iqbal’s own account, he was born on Ziquad 3, 1294 Hijri, in Sialkot which, according to the Gregorian calendar, was November 9, 1877, though Iqbal had mistakenly thought that it corresponded with 1876.\n\nThe renowned German scholar Dr Annemarie Schimmel wrote in Gabriel’s Wing that “9th November 1877 would correspond to this hijra date and this date would match also better with the different phases of Iqbal’s life in college and university than 1873” (Iqbal Academy, Lahore, p.35).\n\nFaqeer Vaheeduddin, Abdul Vahid Moini and some other scholars agreed that Iqbal had wrongly assumed that 1294 Hijri would correspond to 1876 and his correct date of birth was Nov 9, 1877. So it was generally accepted as Iqbal’s correct date of birth and Pakistan’s postal department issued two commemorative postage stamps on April 21, 1967, giving 1877 as Iqbal’s year of birth.\n\nIn 1971, Khalid Nazeer Sufi, who was related to Iqbal, published his book Iqbal Daroon-i-Khana and in it, quoting from Sialkot Municipality’s register of births and deaths, he claimed that, as per the record, Iqbal was born on December 29, 1873.\n\nTo discuss the issue, Bazm-i-Iqbal, Lahore, constituted a sub-committee in 1972. On the committee were renowned scholars like Syed Nazeer Niazi and Allama Iqbal’s son Justice Dr Javid Iqbal and others. Later on, Waheed Qureshi, too, was included in the committee and he and two other members of the committee visited Sialkot to obtain the records.\n\nGovernment committees\n\nWhile Bazm-i-Iqbal’s sub-committee was still researching the matter, the government of India announced the formation of a committee, with the then prime minister Indira Gandhi as its head, to celebrate Iqbal’s centennial in 1973, assuming that Iqbal was born in 1873. This prompted the Pakistan government to declare that Iqbal’s centenary would be celebrated on a grand scale here, too.\n\nBut the issue of Iqbal’s correct date of birth, however, was yet to be resolved. To settle the issue, a committee was constituted by the government of Pakistan. So Bazm-i-Iqbal’s sub-committee stopped its work. The committee formed by the government, after deliberations, decided that the date of birth mentioned by Iqbal himself in his PhD dissertation, ie November 9, 1877, should be accepted as authentic.\n\nBut some members included in the government’s committee, such as Waheed Qureshi and Hameed Ahmed Khan, disagreed and insisted on adding a clause to their work that said “until no further evidence is available, November 9, 1877, should be accepted as Iqbal’s date of birth.” In other words, they had accepted this date tentatively. But when the official announcement was made, the clause was missing and it was officially pronounced that the year 1977 was to be celebrated as Iqbal’s centenary year.\n\nAt least four scholars, Khalid Nazeer Sufi, Dr Waheed Qureshi, Malik Ram and Dr Akber Hyderi Kashmiri, were of the view that it was more probable that Iqbal’s correct date of birth was December 29, 1873. Waheed Qureshi in Nuqoosh’s Iqbal number (vol. 2) and Malik Ram in his book Tehqeeqi Mazameen have discussed the issue in detail.\n\nOf three dates, often quoted as Iqbal’s correct date of birth, the first one is February 22, 1873. Inqelaab wrote that it was based on Sialkot’s Municipality’s records. But Justice Dr Javid Iqbal, Iqbal’s son, quoting senior members of his family, said that this date referred to a baby boy born to Iqbal’s parents before Iqbal’s birth and that boy died in infancy.\n\nThe second date, December 29, 1873, is — as claimed by Khalid Nazeer Sufi — recorded in Sialkot’s Municipal register of births and deaths. Sufi’s claim was rejected by Javid Iqbal on the basis that the entry assumingly referring to Iqbal, in fact, belonged to a baby boy whose father shared the same name as Iqbal’s father. Also, the other details, such as father’s caste and profession mentioned in the register, did not match with Iqbal’s father.\n\nBut Waheed Qureshi, while mentioning Iqbal’s educational records and the years in which Iqbal attended certain educational institutes, said this date was most probably Iqbal’s correct date of birth, as it coincided with Iqbal’s life events. Malik Ram, too, said that if this date is accepted as Iqbal’s date of birth, the other events of his life, such as passing certain exams at educational institutes, fitted in well.\n\nAs for November 9, 1877, it is not recorded in Sialkot’s Municipal register. But it can be safely assumed that, for some reason, the birth was not reported to the municipality and not being reported is not a proof of not being born. What gives credence to this date is that Iqbal himself mentioned it in his doctoral dissertation note, though he had mistakenly written 1876 instead of 1877.\n\nOn the basis of this evidence, some scholars believe November 9, 1877, should be accepted as Iqbal’s correct date of birth.\n\nThe writer has served as Professor of Urdu at the University of Karachi, Chief Editor of the Urdu Dictionary Board and Director General of the National Language Promotion Department\n\nPublished in Dawn, Books & Authors, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/091036503df80be.webp",
  "retrievedAt": "2025-11-09T05:51:04.034Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954056/essay-when-was-allama-iqbal-actually-born",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T03:26:55.000Z"
}
