{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "The Newspaper's Staff Reporter",
  "content": "ISLAMABAD: The Ministry of Maritime Affairs has launched measures to address congestion at Port Qasim, where slow unloading of sugar consignments has disrupted port operations and delayed cement and clinker exports.\n\nA high-level meeting chaired by Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry reviewed the situation and its impact on export activities. Officials said sugar unloading was occurring at rates well below the port’s operational capacity, creating a backlog of vessels and slowing overall turnaround times.\n\nSenior officials present included Secretary Maritime Affairs Syed Zafar Ali Shah, Secretary Commerce Jawad Paul, Chairman Port Qasim Authority (PQA) Rear Admiral (Retd) Syed Moazzam Ilyas, Acting Chairman Karachi Port Trust (KPT) Rear Admiral Atiq-ur-Rehman, Chief Executive Officer of the Trading Corporation of Pakistan (TCP) Syed Rafeo Bashir Shah, Technical Adviser Maritime Affairs Commodore (Retd) Muhammad Jawad Akhtar, and representatives of the Cement Exporters Association, led by Arif Habib.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nThe meeting was told that despite directives from the Prime Minister’s Office to divert up to 60pc of sugar imports to Gwadar Port to ease pressure on Karachi’s terminals, most shipments continued to arrive at Port Qasim. Participants discussed ways to improve vessel scheduling, berthing priorities, and coordination among state importers to prevent recurring delays.\n\nThe minister instructed the PQA to increase the pace of sugar discharge to match the port’s capacity of 4,000-4,500 tonnes per day, stressing that efficient handling was critical to avoid disrupting export operations.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0908011533728ca.webp",
  "retrievedAt": "2025-11-09T04:47:33.492Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953991/pqa-told-to-speed-up-sugar-unloading",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T00:42:28.000Z"
}
