{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "AFP",
  "content": "Elena Rybakina clinched her biggest title since Wimbledon in 2022 by defeating world number one Aryna Sabalenka 6-3, 7-6 (7/0) at the WTA Finals in Riyadh on Saturday.\n\nThe world number six put on yet another serving masterclass and was at her returning best as she became the first Kazakh and the first player representing an Asian country to lift the WTA Finals singles trophy.\n\nHaving gone 3-0 in round-robin play, Rybakina earned a record $5.235 million and will finish the year ranked number five in the world.\n\n“It’s been an incredible week, I honestly didn’t expect any result, and to go so far, it’s just incredible,” said Rybakina, who battled a shoulder injury all week.\n\nThe ace leader on tour with 516 struck this season, Rybakina fired 13 against Sabalenka on Saturday, and finished the week with a total of 48 in Riyadh.\n\nRybakina was the last of the eight players in the singles field to qualify for the WTA Finals in Riyadh, and she did it by winning the 500-level title in Ningbo and reaching the semi-finals in Tokyo before withdrawing from the tournament.\n\nHer winning streak now stands at 11 matches and she improved her head-to-head record against Sabalenka to 6-8.\n\nAfter the match, Rybakina refused to pose for a photo alongside Sabalenka and WTA CEO Portia Archer.\n\nRybakina has been at odds with the tour ever since they suspended her coach Stefano Vukov in February, for breaking the WTA code of conduct.\n\nVukov was initially suspended for a year but appealed the decision and was back in Rybakina’s corner in August.\n\nAsked why she snubbed the ceremonial photo with Archer, Rybakina said she preferred to keep the reason between her and the WTA chief.\n\nOn whether she has had reconciliation talks with the tour to move past their issues, Rybakina said: “I think we’re all doing our job and we had the opportunity to have conversations but in the end it never happened so we’re all doing our job and I think we’re going to keep it this way.”\n\nSquaring off for the 14th time, Sabalenka and Rybakina form one of the most gripping rivalries of the WTA, dating back to 2019.\n\nRybakina entered the final carrying a 10-match winning streak. The last player to beat her was Sabalenka, who knocked out the Kazakh in the Wuhan quarter-finals four weeks ago.\n\nBoth players brought their A-game from the start, showcasing their signature brand of boom-boom tennis to stay neck and neck through the first five games.\n\nIt was Rybakina’s defence though that paid off in game six, her desperate lob drawing the error from Sabalenka, who netted the overhead to get broken.\n\nThat one break was all Rybakina needed to secure the opening set in 44 minutes.\n\nRybakina was untouchable on serve in the second set, dropping just two points on serve through four service games.\n\nSabalenka was more vulnerable in that department, feeling the pressure on her own serve but still finding ways to save four break points, including two crucial ones at 4-4.\n\nAgainst the momentum, Sabalenka suddenly got her hands on two set points on Rybakina’s serve in game 10 but the Kazakh stood her ground to level for 5-5.\n\nThe set fittingly went to a tiebreak, and despite her remarkable 22-2 tiebreak record for the season, Sabalenka couldn’t halt Rybakina, who sealed the deal after one hour and 47 minutes of play.\n\nRybakina finished the match with 36 winners against just 22 unforced errors.\n\nDespite the loss, Sabalenka set a new WTA Tour record for most prize money earned in a single season, her $15,008,519 surpassing the $12,385,572 Serena Williams made in 2013.\n\n“Not the best performance from me but Elena, you were definitely a better player today. You literally smashed me out of the court. Very well done. I’m happy to see you back playing your best tennis,” Sabalenka said during the trophy ceremony.\n\nFighting tears, the Belarusian addressed her team, saying: “Maybe not the result we all wanted today, but so many things we… I guess I’m getting old, I’m getting really sensitive. So many things to be proud of.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09113720324e8fe.webp",
  "retrievedAt": "2025-11-09T12:12:03.245Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954073/elena-rybakina-outguns-world-no1-aryna-sabalenka-to-win-wta-finals",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T06:40:06.000Z"
}
