{
  "title": "Redefining disability: Sana Bahadar’s journey to global squash stardom",
  "author": "Anushe Engineer",
  "content": "All was quiet in Sana Bahadar’s mind when she entered the squash court on the last day of October for her quarterfinal at the CNS Squash Championships. Her immediate aim: to clinch the fourth game and move a step closer to claiming another title.\n\nIt wasn’t to be. The hotly-contested first three games had been indicative of a battle to the end and Sana would soon have to put her body on the line to win when her opponent’s racket hit her in the throat. Struggling to breathe as she clutched her throat, Sana stumbled out the glass door and into the stands.\n\nHer father, Sher, rushed over and crouched in front of her, asking what happened. He told a concerned referee rushing over that she had been hit in the throat, but the referee told him not to interfere during play.\n\n“I was speaking for Sana because you don’t understand sign language,” Sher quipped to silence the referee. He opened his mouth to argue with Sher but shut it just as quickly, staring at the medical officer and Sher attending to Sana. Her opponent, Sadia Gul, eyed the cluster from across the arena.\n\nSana is entirely deaf and mute, and although she communicates using sign language, the rest of the world doesn’t.\n\nThe 19-year-old became the first deaf squash player in Pakistan and across Asia when she began competing a decade ago, followed by her younger brother Saifullah. Both only have 10 per cent of their hearing — able to hear a jet plane soaring above, but not a conversation someone is having with them.\n\nThis is how every squash game unfolds for Sana; not the rough play and string of injuries she’s unable to articulate, but the constant need for her father to step in and speak on her behalf. She signs to her father, he then speaks in Pashto, Urdu, English, depending on where in the world she’s competing. There were no accommodations for her deafness, no special training centres or sign language interpreters; this setup with Sher is all she has.\n\nAfter a three-minute medical break, Sana signalled a thumbs-up to the referee to resume the fourth game, which she ultimately lost to Sadia despite protesting more foul play.\n\nThe deciding fifth game was equal parts aggression and theatrics; Sadia was arguing with the referee after calling him out on a first-name basis when he awarded the point to Sana; moments later, the duo collided and Sana slammed to the floor. At 10-10 game and match point, Sana equalled the score and roared in triumph to cheers from the sparse audience. Sadia was once again a single point away from winning when Sana turned the score 11-11, with the mildest of contact between the two players prompting Sadia to stumble backwards until she slammed into the court’s glass wall.\n\nMoments later, Sadia hit her head against the wall and sent her racket flying, which Sana picked up and returned to her before offering a helping hand. The game point bounced between the two for a few more points until Sadia won it 16-14 to advance.\nThey embraced before walking off court. Sana clapped her hand against her racket to thank the referee before slumping down next to her father and brother.\n\nTempers flaring, Sher walked up to Sadia and congratulated her before accusing her of foul play.\n\nHours later that Friday evening at the Koh-e-Noor Hotel, Sher had calmed down. He kicked off a shoe and tucked one foot under his thigh as he sat on the edge of his bed. Sana and her brother, Saif, were playfully wrestling on another bed in the narrow room. Sana gestured to her throat and opened a fist as though holding a cricket ball to emphasise how much her throat had swollen.\n\n“Believe me, I’ve cried three or four times today since the match,” Sher said slowly as he looked down at his dark grey kameez. The air in the room hung heavy, punctured only by the flashing light of Sana’s phone buzzing for a notification. His children were oblivious of the conversation unfolding, just as they were to almost everything other than squash.\n\nNeither was aware that Sher had already emailed the Professional Squash Association (PSA) asking them to independently review and assess the match footage. He alleged that unqualified “referees” officiating local matches like these were why foul play was allowed unabated.\n\n“Sana works so hard,” Sher continued after a deep breath. “The angst of this match kept her up till midnight last night. “I told her I want her to be happy, not just win in this sport.”\n\nSquash was unaffordable for a young Sher from a middle class family in Charsadda, some 42 kilometres from Peshawar where he lives now. Watching squash matches on a tiny black-and white Russian TV set they owned was the closest he ever got to the sport.\n\n“I’ve instilled what I call ‘Charsadda discipline’ in her; I don’t want to teach her to be snide or do anything that brings dishonour to where I’m from.\n\n“When we compete abroad, I want Sana to hold herself in a way that brings respect to Pakistan, and to herself,” Sher said.\n\nContrary to the CNS quarterfinal, Sana’s international matches end with Sher being showered with praise for Sana’s exceptional skills on court, her sportsmanship, her vibrant personality and equally glowing smile.\n\nWhen asked what squash means to her, Sana signed that it pulled her out from the cloak of invisibility her deafness put her under.\n\n“I was a nobody when I was younger. But when I started playing squash, people began to recognise me,” Sana signed to her father, who then translated in Urdu. She tugged the Pakistan logo on her shirt and signed that it was a dream come true to don the green jersey.\n\n“They began acknowledging me, greeting me, taking pictures with me. I’ve become famous, and it makes me really happy,” she signed, her smile growing wider when she said top ranked players Nour El Sherbini and Nouran Gohar wanted photos with her, in awe of her capabilities. Most of her opponents have never competed against a deaf player before.\n\nSana has close to a dozen national titles to her name and was ranked No. 1 in all the national age-group categories through the years. She’s also bagged a handful of international titles while competing across Australia and the US, where she reached a career-high PSA ranking of 212.\n\nSher has scraped together money to finance international tours that most squash players attain through long-term sponsorships, which Sana has only ever had in the short run. He knows that if given more exposure through international competitions, Sana would make it to the upper echelons of squash rankings.\n\nFinancial shortfalls aside, Sana and Saif have come to experience a “normal” life because Sher challenged the limitations of disability imposed on them. He chaperones them everywhere and translates conversations for them, picks and drops them from every practice session, wakes up at 5am for physical training before school.\n\nBut his devotion has come at a price. Age is catching up with him, and worries for his children’s future often seep into the present.\n\n“I pray to Allah for life and courage because 10 years like this has been exhausting, and I often get disheartened,” he admitted quietly as he stared at his hands. Even so, he does his best for his children and leaves his fate in the hands of Allah and the blessings of his aged parents.\n\nIronically, Sher has literally outrun age catching up to him as he joins Sana during her morning runs before school. “If she runs 4 kilometres for training, I run it with her. I do everything in tandem so she feels like she has my support,” Sher said.\n\n“Even today’s fight is a win for her — she learned what life is like, and what hurdles she’ll have to face.”\n\nSana’s journey ahead is long. She wants to be the contemporary version of Pakistani champions like Jansher Khan and Qamar Zaman, who once dominated the sport’s hall of fame. “We’ve come this far, and we’ll keep going till we reach that goal,” Sher said.\n\nIt was almost as if the family was beholden to have the surname Bahadar — brave.\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09130036677e6d2.webp",
  "retrievedAt": "2025-11-09T12:11:38.827Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954076/redefining-disability-sana-bahadars-journey-to-global-squash-stardom",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T08:01:59.000Z"
}
