{
  "title": "Taking back education",
  "author": "Faisal Bari",
  "content": "ONE of the issues that has been mentioned, though we do not have any details or the draft of the proposed amendments yet, is that the 27th constitutional amendment will ‘take back’ education to the federation again.\n\nSince we do not have any details, it is not clear what ‘taking back’ education means but we need to have clarity on what it should or should not mean.\n\nBefore the 18th Constitutional Amendment, education was a shared responsibility between the federation and the provinces. Will the 27th amendment take it back to sharing or will education be solely the centre’s domain?\n\nTeacher recruitment, posting, transfer, teacher training and teacher management have always been a provincial subject. As have been school management and administration. Textbook publishing has also been a provincial subject. Examination boards are and have been under provincial governments as well, although there is a federal body that ensures compatibility across boards.\n\nThe only thing that was at the federation level, prior to the 18th Amendment, was the curriculum and this was devolved after the amendment’s passage. Will the 27th amendment take it back to the federal level?\n\nIt clearly does not make sense for the federation to be involved in teacher recruitment, posting, transfers, teacher training or teacher management. Punjab has some 400,000 teachers. A similar number must be there for all other provinces combined.\n\nIt is hard to manage teacher issues from even a provincial capital — our provinces are too large. We need to take teacher management to the local level. The principle should be that the decision-making should happen at the level where we have the information for the required decisions and where stakeholders impacted by the decision can have a say.\n\nThe curriculum has always been a thorn in the side of successive federal governments.\n\nSimilarly, school administration and management needs to be devolved to the local level too. I am pretty certain the federation has no interest in school management and administrative issues.\n\nWhat it boils down to, of course, is the curriculum. This has been a thorn in the side of successive federal governments and deep state elements since independence and it continues to be one.\n\nHistorically, from a technical point of view, the federal government has always had a large or complete role in curriculum setting. And though the curriculum was devolved by the 18th Amendment, for many years the provinces continued to use the pre-18th Amendment curriculum since they did not have capacity for curriculum work. When they started getting ready for curriculum work, the federal government came up with the brilliant idea of the Single National Curriculum and most of the curriculum debate was taken up with the useless and damaging discussion about the benefits of having a single curriculum across the country. Though most provinces were ‘persuaded’ to go along with the SNC, some were quite reluctant and resisted it.\n\nClearly, it is not about the curriculum of science or mathematics that is the issue here. When have we heard the debate that provinces have diverged in what they teach in mathematics or science or that Punjab is teaching a different mathematics or science compared to Sindh? It is always about local culture and local languages and how they might impact the unitary identity that the federation has always wanted to impose and has imposed.\n\nThe federation fears local control over the curriculum might lead to changes that allow local languages and cultures to become so dissipative that our identity as Pakistani and Muslim may get threatened or diluted.\n\nIs the 27th amendment an attempt to ensure there is no resistance to the idea of a single curriculum? Is it the continued game of ensuring that we shape young minds to have a particular religious and Pakistani identity? Have 76 years of these attempts taught us nothing? We introduced Islamiat and Pakistan Studies as compulsory subjects in the 1970s.\n\nHave we started producing better Muslims and Pakistanis as a result? If we had, we would not keep insisting that we need to do more. We have now added Quranic studies and Islamiat topics in Urdu and English as well. But we are still not satisfied with the results.\n\nWhat we are not willing to learn is that this is not the way to ensure a particular identity or address issues of personality formation. True, religion is important and has a place in the curriculum, but it need not be overwhelming and at the cost of local cultures, languages and traditions. The same is true of national identity.\n\nIn fact, local languages and cultures are the strength that allows stronger national and religious identities. The federation has looked at the issue of unity from the wrong lens and continues to make the same mistake. Having five or six national languages does not mean Urdu or English lose out.\n\nBetter education in local language at the start of a child’s academic journey will strengthen not only his or her language skills in the regional tongue but also help in learning other languages. And it will help in developing students’ cognitive abilities for other subjects and in general as well. Clearly, local cultures have to be part of our individual identity to have a full sense of belonging.\n\nSo, why the insistence on ‘taking back’ education? The federation, when it had education, did not do a stellar job. The provinces have not done much either but are no better or worse than when the federation had control. In principle, education should be devolved as much as possible.\n\nWill the federation be able to do any better this time? Of course not. And if the interest is only in controlling the narrative on identity, culture, religion and language, how is that helpful for education or for Pakistan in general?\n\nThe writer is a senior research fellow at the Institute of Development and Economic Alternatives and an associate professor of economics at Lums.\n\nPublished in Dawn, November 7th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690d59e10c2af.jpg",
  "retrievedAt": "2025-11-09T00:44:54.427Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953639/taking-back-education",
  "dateList": "2025-11-09",
  "date_published": "2025-11-07T02:31:48.000Z"
}
