{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "AFP",
  "content": "WASHINGTON: President Donald Trump has said no US officials will attend the G20 summit in South Africa, reviving debunked claims of white Afrikaners being systematically “killed and slaughtered” in the country.\n\nTrump had announced in September that Vice President JD Vance would travel to the meeting later this month instead of him, but has now said that US representatives will skip it entirely.\n\n“It is a total disgrace that the G20 will be held in South Africa,” Trump said on his Truth Social network. “No US Government Official will attend as long as these Human Rights abuses continue.”\n\nTrump said that Afrikaners — descendants of the first European settlers of South Africa — “are being killed and slaughtered, and their land and farms are being illegally confiscated”. He added that he looked forward to hosting the 2026 G20 summit in the US — which the billionaire US president will controversially hold at his own golf resort in Miami, Florida.\n\nSouth Africa calls Trump’s decision ‘regrettable’, pledges smooth summit\n\nThe South African foreign ministry cal­led Trump’s comments “regrettable” and said it was looking forward to hosting a “successful” summit set for November 22-23.\n\n“The characterisation of Afrikaners as an exclusively white group is ahistorical. Furthermore, the claim that this community faces persecution is not substantiated by fact,” it said in a statement.\n\nPretoria chose “Solidarity, Equality, Sustainability” as the theme for its G20 presidency but has faced some resistance, including from Washington.\n\n“South Africa’s focus remains on its positive global contributions,” the foreign ministry said.\n\n“Drawing on our own journey from racial and ethnic division to democracy, our nation is uniquely positioned to champion within the G20 a future of genuine solidarity.”\n\nTrump has singled out South Africa for harsh treatment on a number of issues since he returned to the White House in January, most notably on his false claims of a “white genocide” in the country.\n\nHe ambushed South African President Cyril Ramaphosa in the Oval office earlier this year, playing a video in which he alleged a campaign against white farmers by the post-apartheid government.\n\nSouth Africa’s government denies any such policy. Trump’s administration announced plans last week to drastically cut back the number of refugees to be accepted annually by the United States to a record low of 7,500 — and give priority to white South Africans.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09082120c6260e0.webp",
  "retrievedAt": "2025-11-09T04:47:17.948Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954024/us-boycotts-g20-event-to-protest-whites-killing",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:24:44.000Z"
}
