{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Muhammad Kashif",
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) posted losses for the third consecutive week as foreign corporates and mutual funds took profits in a bearish market.\n\nThis decline follows a broader trend of investor uncertainty, fuelled by a combination of macroeconomic pressures, including rising inflation, a widening trade deficit, and sluggish domestic demand. However, the market showed signs of recovery on Friday, as investor sentiment improved amid positive developments, including higher-than-expected remittance inflows and a robust fiscal surplus for the first quarter of FY26.\n\nExtending its weekly downtrend, PSX recorded a third consecutive week in negative territory, losing 2,039 points or 1.26pc. The KSE-100 index opened at 162,827, touched a high of 163,935, and hit a low of 158,253 before closing the week at 159,593.\n\nThe macroeconomic backdrop remained mixed throughout the week. The Consumer Price Index (CPI) for October registered a year-on-year increase of 6.2 per cent, the highest since October 2024, up from 5.6 per cent in September. This surge in inflation dampened sentiment, especially as investors braced for the impact of rising costs on both corporate profitability and consumer purchasing power.\n\nBenchmark index lost over 2,000 points to settle below the 160,000-point barrier\n\nIn a similar vein, Pakistan’s trade deficit widened to $3.2 billion in October, a 56 per cent year-on-year in­­crease. However, it saw a slight month-on-month improvement, narrowing by 4pc from September. Ex­­ports, however, showed some resilience, increasing 14 per cent month-on-month, although they remained down 4.5pc compared to the same period last year.\n\nOn a positive note, remittances from overseas Pakistanis surged 12pc year-on-year to $3.42bn in Oct­ober, offering some relief to the economy. This was compounded by a marginal increase in the rupee, which appreciated by 0.03 per cent to close at Rs280.8 against the US dollar.\n\nDespite the challenging macroeconomic conditions, specific sectors showed resilience. The cement sector, for example, saw a notable year-on-year uptick in dispatches, rising by 7.3pc in October, driven by strong domestic demand. On the other hand, sales in the urea and DAP fertiliser segments contracted significantly — urea sales declined by 2pc. At the same time, DAP saw a sharp 55pc fall compared to the previous year, highlighting the continued weakness in agricultural demand.\n\nMeanwhile, oil marketing companies (OMCs) saw a modest 2pc incr­e­a­se in overall sales, driven by a 4pc rise in high-speed diesel (HSD) dem­and, thanks to the ongoing Rabi sowing season. However, the overall performance of the PSX remained constrained by the uncertain macroeconomic environment, with average dai­­ly traded volumes dropping by 30 per cent week-on-week to 887 million shares.\n\nOutlook for the week ahead\n\nAnalysts suggest the market may continue on a cautious path, with investor sentiment closely tied to developments regarding the Inte­rnational Monetary Fund (IMF) and the proposed constitutional amendments. According to Arif Habib Ltd (AHL), constructive progress on these fronts could bolster market confidence and support the potential for a recovery after this week’s dip.\n\nFurther supporting the bullish case, analysts note that the KSE-100 index is currently trading at a price-to-earnings (P/E) ratio of 8.07x, slightly below its 15-year average of 8.59x. With an attractive dividend yield of approximately 6.0 per cent, the market remains an appealing proposition for long-term investors, particularly in the absence of compel­ling alternative investment avenues.\n\nIn summary, while the broader market sentiment remains cautious, the ongoing developments in Paki­stan’s economic and political landscape could serve as catalysts for a sustained recovery, provided key issues such as inflation and the trade deficit are addressed effectively.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/090817296b7e647.webp",
  "retrievedAt": "2025-11-09T04:47:33.945Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953994/psx-extends-weekly-losses-amid-mixed-economic-indicators",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T00:42:28.000Z"
}
