{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Reuters",
  "content": "WASHINGTON: US President Donald Trump unlawfully ordered National Guard troops to Portland, Oregon, a federal judge ruled on Friday in a legal setback to the administration’s use of the military in American cities.\n\nThe ruling by US District Judge Karin Immergut is the first to permanently block Trump’s use of military force to quell protests against immigration authorities. Trump is also attempting to do that in Democratic-led cities such as Los Angeles, Chicago, and Washington, DC. It replaces her interim order that had prevented the Portland deployment.\n\nWhite House spokeswoman Abigail Jackson said in a statement on Friday that Trump had exercised his lawful authority to protect federal officers.\n\nPresident Trump will not turn a blind eye to the lawlessness plaguing American cities, and we expect to be vindicated by a higher court, Jackson said.\n\nThe Oregon Attorney General’s Office did not immediately respond to an email seeking comment.\n\nImmergut, a Trump appointee, stated that the administration had no lawful basis to claim that a rebellion was occurring in Portland or that the government was unable to enforce federal law due to the protests.\n\n“The occasional interference to federal officers has been minimal, and there is no evidence that these small-scale protests have significantly impeded the execution of any immigration laws,” she said in her 106-page opinion and order.\n\nTrump’s attempts to use military force to tamp down unrest are a sharp break with long-standing but rarely tested norms against deploying troops on US soil.\n\nThe Trump administration is likely to appeal Friday’s ruling, and the case could ultimately reach the Supreme Court.\n\nThe City of Portland and the Oregon Attorney General’s Office sued in September, alleging the Trump administration was exaggerating occasional violence to justify sending in troops under a law permitting presidents to do so in cases of rebellion.\n\nDueling narratives emerged during a three-day bench trial.\n\nJustice Department lawyers described a violent siege overwhelming federal agents, echoing Trump’s description of the city as  “war-ravaged”. Lawyers for Oregon and Portland said violence has been rare, isolated, and contained by local police.\n\nImmergut concluded in her order that the violence was small-scale, isolated, disorganised, and had largely subsided by the time Trump ordered in the National Guard in late September.\n\nDemocrats have said Trump is abusing military powers meant for genuine emergencies such as an invasion or an armed rebellion.\n\nImmergut blocked Trump from deploying troops to Portland with an interim order on October 5.\n\nThe Ninth US Circuit Court of Appeals is considering the Trump administration’s appeal of that decision.\n\nThree judges, including Immergut, have issued preliminary rulings that Trump’s National Guard deployments are not allowed under the emergency legal authority cited by his administration.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09094133f76d997.webp",
  "retrievedAt": "2025-11-09T04:55:13.564Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954011/us-judge-rules-trump-illegally-ordered-national-guard-troops-to-portland",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:38.000Z"
}
