{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Bakhtawar Mian",
  "content": "ISLAMABAD: Senate Chairman Syed Yousaf Raza Gilani on Saturday highlighted the significance of the forthcoming speakers’ conference, saying it would mark an unprecedented milestone in the country’s pursuit of international dialogue, peace and cooperation through parliamentary diplomacy.\n\nSpeaking on the floor of the House, he termed the event a “momentous occasion in Pakistan’s parliamentary history.”\n\nMr Gilani, being the founding chairman of the Inter-Parliamentary Speakers’ Conference (ISC), said the conference on “Peace, security, and development”, scheduled to be held in Islamabad on November 11-12 will bring together ten speakers of parliaments, fifteen deputy speakers, thirty-seven members of parliaments and representatives from various multilateral organisations, totaling 174 international delegates.\n\nHe said two former presidents will also represent their countries at the event — an extraordinary testament to Pakistan’s growing diplomatic stature and leadership role in global parliamentary engagement.\n\nSays 174 international delegates to attend conference starting on Nov 11 in capital\n\n“Hosting such a distinguished assembly is not merely an achievement for the Senate; it is a significant national cause that elevates our standing on the global stage,” he stated.\n\nEmphasising the broader national value of the conference, he said that the ISC is not confined to the Senate alone, but is a collective national endeavour that embodies Pakistan’s vision for peace, security, and inclusive development.\n\nHe called upon all senators to actively participate as hosts and ambassadors of Pakistan’s values and aspirations, rather than as mere attendees.\n\n“As we welcome our esteemed guests from both the Global South and the Global North, we are not just participants in a conference; we are representatives of our nation’s resolve to foster dialogue, understanding, and cooperation across borders,” he remarked.\n\nMr Gilani extended his gratitude to President Asif Ali Zardari, Prime Minister Mohammad Shehbaz Sharif, Speaker National Assembly Sardar Ayaz Sadiq and Deputy Prime Minister and Minister for Foreign Affairs Senator Ishaq Dar for their support in the preparation and organisation of the conference.\n\nThe chairman urged every member of the House to play a constructive role in making the conference a resounding success.\n\n“This initiative belongs to all of us. It is not solely the responsibility of the Senate Secretariat, but a collective endeavour that calls for the participation and ownership of every parliamentarian,” he said.\n\nHe reaffirmed his confidence that the conference would serve as a beacon of hope and collaboration, leaving a lasting impact on the region and the world by highlighting Pakistan’s leadership in promoting parliamentary diplomacy.\n\n“Together, we can make this event a defining moment in strengthening Pakistan’s role as a champion of peace, dialogue and development,” the chairman said.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/091040433af0e7b.webp",
  "retrievedAt": "2025-11-09T05:51:11.440Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953956/speakers-moot-a-milestone-in-pakistans-parliamentary-diplomacy-gilani",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:56.000Z"
}
