{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Ishaq Tanoli",
  "content": "• After Rano’s relocation to Islamabad, bench broadens scope of petition to welfare of all zoo animals\n• In written order released on Saturday, court orders formation of new committee comprising govt officials and civil society members\nto inspect zoos across Sindh\n\nKARACHI: The Sindh High Court has ordered formation of a new committee to visit zoos across the province and suggest steps for improvement as well as sending the exotic animals to their natural habitats.\n\nInviting suggestions to phase out zoos in the entire province, a two-judge SHC bench comprising Justice Mohammad Iqbal Kalhoro and Justice Syed Fiaz-ul-Hassan Shah declared that the court had decided to examine the whole concept of keeping zoos and caging animals.\n\nThe remarks were part of a written order issued on Saturday regarding the Nov 6 hearing of a petition seeking shifting of lone female bear Rano from Karachi Zoological Gardens to Bear Sanctuary, Islamabad Wildlife Management Board.\n\nThe order stated that the Karachi Metropolitan Corporation (KMC) and other respondents filed statements and reports and submitted that Rano had been successfully transported to the federal capital on Nov 5 in compliance with the orders issued by the bench earlier.\n\nHowever, the bench enhanced the scope of the petition from Rano to the welfare of all animals kept in zoos and invited suggestions as to how to phase out zoos in the entire province.\n\nSindh Wildlife Conservator Javed Ahmed Mahar proposed that a committee may be constituted with the municipal commissioner, forest & wildlife secretary, wildlife conservator and KMC’s senior director-zoo as its members.\n\nRepresenting the petitioner, Mohammad Jibran Nasir also suggested that philanthropist Ava Ardeshir Cowasjee, Dr Uzma Khan from Asia lead for WWF Pakistan, Advocate Nazia Hanjrah, Zhalay Sarhadi and petitioner/animal rights activist Jude Allen Preira may also be made part of the committee.\n\nThe bench ordered constitution of the committee and inclusion of all the names suggested by the wildlife conservator and the petitioner’s counsel.\n\nThe bench in its order stated: “In addition, the committee shall be given mandate to co-opt experts of the subject fields, who shall visit the zoos in the province and suggests steps for improvement in the zoos and identify issues being confronted by them at the moment to resolve them as a short term measure. As a long term measures, they shall recommend steps to be taken which may include but not limited to sending the exotic animals to their natural habitat.”\n\nIt further stated that as per the petitioner’s counsel the committee, constituted by the chief minister for shifting of Rano, had visited Karachi Zoo and found all the medical equipment out of order.\n\nThe bench stated that Zoo Director Aklaq Ahmed Yousufzai had undertaken to replace all out-of-order machines immediately and to outsource vets for treatment of the animals.\n\nThe hearing was adjourned till Nov 21.\n\nAt a previous hearing, the bench had directed the committee formed by the CM to visit the Karachi zoo and prepare a detailed report about the number of animals kept there as well as their physical and mental health.\n\nIt also asked the committee to examine the circumstances under which animals are being kept as well as to identify the animals as natives or exotic and must also make recommendations for improving the situation if it found the animals were kept in improper conditions.\n\nThe bench further ruled that since the issue was not of one bear but hundreds of animals being kept in captivity apparently just for entertainment of people and court has decided to examine the whole concept of keeping zoos and caging animals.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/090852203c99ddb.webp",
  "retrievedAt": "2025-11-09T04:47:25.998Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953943/shc-decides-to-examine-whole-concept-of-keeping-zoos-and-caging-animals",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:44.000Z"
}
