{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "News Desk",
  "content": "A Senate session has been convened today — on a Sunday in a rare move — with a one-point agenda to deliberate on the bill for the 27th Constitutional Amendment.\n\nThe 26-page Constitution (Twenty-Seventh Amendment) Act, 2025 was tabled in the Senate yesterday amid the opposition’s outcry over the pace and scope of the proposed changes, just hours after its approval by the federal cabinet.\n\nAddressing the upper house of the parliament, PTI Senator Ali Zafar detailed “five points” that he said formed the basic spirit of the 1973 Constitution and were now being “punctured” in the 27th Amendment.\n\nThe first, he said, was that Pakistan was a federation with autonomous provinces. Secondly, the elected parliament had authority but was bound to the Constitution. Zafar said the third point was the fundamental rights provided therein, with courts formed to protect and implement them.\n\nFourth pillar of the Constitution, he added, was an independent judiciary to protect people’s rights and guarantee democracy, while the fifth one was civilian supremacy.\n\n“If you alter this balance of five pillars even slightly through any amendment, the entire Constitution will be shaken and can result in major chaos,” Zafar warned.\n\nZafar stressed that the Constitution was a contract between the state and the public, with a “spirit of its own”. He added that the document was a pledge that everyone, regardless of the region they hailed from, would live according to the laws.\n\n“When you make any change in the Constitution, it is equal to tampering with the foundation of a building, and if you make any mistake, the entire building can collapse,” he contended.\n\nRecalling that two dictators made amendments to the 1973 Constitution that “broke it”, Zafar highlighted that even they took “a lot of time” to be passed. He added that the “real spirit” of the 1973 Constitution was restored through the 18th Amendment in 2010.\n\nThe PTI senator then went on to recall how the parliament has “systematically” reached the 27th Amendment today, highlighting the “slow, gradual but effective erosion of democracy and the Supreme Court”.\n\nZafar went as far back as March 2023, when the SC had ordered that elections be held for the Khyber Pakhtunkhwa and Punjab assemblies within 90 days.\n\nHe pointed out that the ruling was violated, alleging that the Pakistan Democratic Movement (PDM) coalition and the Election Commission of Pakistan (ECP) “colluded to make those 90 days’ government into a year and a half”.\n\nThe PTI senator then mentioned the Jan 13, 2024 verdict by a bench led by then-chief justice of Pakistan Qazi Faez Isa, which revoked the PTI’s electoral symbol a month before the general elections. He also recalled the SC’s ruling in the Article 63A case that struck down an earlier order and allowed the ballots of lawmakers who voted against party policy to be counted.\n\n“It was as if the judiciary opened the gates for the 26th Amendment through this decision,” Zafar claimed, further alleging that the ruling coalition coerced some lawmakers to vote in 26th Amendment’s favour. The senator clarified that the PTI had never agreed to even the formation of constitutional benches, and had instead termed them “lesser of the two evils” compared to a constitutional court.\n\nSenate Chairperson Syed Yousaf Raza Gilani is presiding over the session today, which began with the House remembering Allama Iqbal on his birth anniversary.\n\nDuring the session, PTI lawmakers had pictures of their party founder Imran Khan placed on their desks. At the beginning of the proceedings, a PTI leader raised an objection, to which Gilani replied that as per his ruling yesterday, the senator could bring his concerns to the Senate chairman’s office.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09160923c2e1cd3.webp",
  "retrievedAt": "2025-11-09T12:15:48.261Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954085/ptis-zafar-warns-against-altering-balance-of-1973-constitution-as-senate-debates-27th-amendment",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T10:51:14.000Z"
}
