{
  "title": "‘Funeral of judicial independence’: How proposed constitutional changes affect structure of Pakistan’s judiciary",
  "author": "News Desk",
  "content": "Barely had the dust settled on the 26th Amendment when another constitutional storm began to brew in Islamabad. The government’s freshly tabled 27th Amendment promises, on paper, to “streamline” governance — through new constitutional courts, revived executive magistrates, and even a relook at how the armed forces are commanded.\n\nKey changes proposed to judicial structure:\n\nAt the heart of the amendment is the creation of a new apex court: the Federal Constitutional Court (FCC). Inserted into the Constitution as Chapter 1A, the FCC would have its own chief justice — serving a fixed three-year term — and judges, who may be appointed from the Supreme Court (SC), senior High Court (HC) judges with at least seven years of experience, or very senior advocates with over two decades in practice. Judges would retire at 68.\n\nThe amendment further stipulates that the president may transfer a high court judge from one high court to another on the recommendation of the Judicial Commission of Pakistan. A judge of a high court who does not accept a transfer under this Article shall be deemed to have retired from his office.\n\nThe FCC would assume some of the SC’s most significant powers. Under the new Article 189, the SC would be downgraded to the apex court for civil and criminal appeals only, while FCC decisions would be binding on all courts, including the SC itself. The FCC would also hold exclusive jurisdiction over disputes between the Federation and provinces, or among provinces, and could, on its own motion, take up any case involving a “substantial question of law as to the interpretation of the Constitution.”\n\nMoreover, the FCC would take over the Supreme Court’s authority on cases concerning the enforcement of fundamental rights, appeals from high courts on constitutional matters, writ petitions under Article 199 (except family and rent cases), and even the President’s power to seek advisory opinions from the apex court.\n\nBeneath all the bureaucratic phrasing lies a familiar unease: is this reform, or a fundamental reinvention of Pakistan’s judicial architecture?\n\nWith the ink on the last amendment still contested in court, the legal fraternity isn’t buying the calm. Lawyers across the country have now entered the debate, warning that the proposed changes could redraw — or perhaps blur — the boundaries between the judiciary, the executive, and the federation itself.\n\nAbdul Moiz Jaferii described the proposed amendment in stark terms, saying a draft of it “should be sent to North Korea, so that Kim Jong Un can read it to his children as a lullaby.”\n\n“This is the stuff of tinpot dictatorships,” he added, drawing parallels to “sub-Saharan African regimes where the rule of law has never taken root.”\n\nJaferii emphasised that Pakistan has historically maintained a system of laws and justice, “as deficient as it may be,” along with a warrant of precedence and democratic governance. But, he argued, a regime whose election is in doubt and which cannot satisfactorily address questions about its legitimacy is “delegitimising the state itself.”\n\n“Our social contract is being altered by people who know they were not elected into office legitimately,” he said. “The fabric of the state is being stitched up to allow for this power grab to continue.”\n\nHe criticised senior figures in politics, noting that “a few old men with ulterior motives are rolling back the rules of the game in a country where the vast majority of the population finds nothing in common with their age, their politics or their principles.”\n\n“The nation of smartphone natives has been made subject to the dial-up dreams of septuagenarian landline merchants,” he concluded.\n\nFor lawyer Basil Nabi Malik, “If the 26th amendment was the death of the independence of the judiciary, the 27th amendment is its funeral.”\n\n“In essence, this amendment seeks to strip the judiciary of the remaining vestiges of independence that one could possibly conceive to remain within it. It straitjackets judges into forced consent when it comes to transfers, nominations or appointments, failing which they would be retired, firmly retains and expands executive control over judicial functions, and even secures the selection of the first batch of FCC judges to make sure they fit their deemed ‘criteria’.”\n\nAccording to Malik, the age of FCC judges has been increased, while that of SC judges remains the same, thereby adding a reward and punitive element to the selection or non selection to the FCC.\n\n“All in all, it is marvellous invention. The institution which makes the law controls the institution that is supposed to interpret it and ensure it protects the citizens rights,” he said.\n\nWhen a person is aggrieved by the government, he said, they are supposed to be happy going to a court controlled by that government against that very government. And they need not complain about it. “After all, what could possibly go wrong? How could such a court not be inclined to side with the government? How could one even think that this is a bad idea?”\n\n“It is said that all is well that ends well, but this, unfortunately, will not end well by any means.”\n\nLawyer Mirza Moiz Baig too warned that the 27th Amendment “spells the final death knell of an independent judiciary.” He said that while the 26th Amendment had reconstituted the Judicial Commission of Pakistan by giving members associated with the executive a majority, the 27th Amendment goes further by creating a Federal Constitutional Court.\n\n“Not content with an executive-dominated Judicial Commission,” Baig explained, “the Amendment also provides that the first Chief Justice of the Constitutional Court shall be appointed by the President in consultation with the Prime Minister. The other judges of the Constitutional Court would then be appointed by the President on the prime minister’s advice, and in consultation with their handpicked Chief Justice.”\n\nBaig argued that the 27th Amendment “deals a greater blow to our Constitution than any change introduced by dictatorial regimes.” He added that with the creation of the Constitutional Court and its packing with judges handpicked by the government, “the polis has finally fallen apart.”\n\nLawyer Rida Hosain also criticised the proposed amendment, saying it effectively creates “a new court that serves the government.” She explained that the first Chief Justice of the new “Federal Constitutional Court” is to be appointed by the President on the Prime Minister’s advice, leaving “not even a semblance of independence.”\n\nHosain further underscored that the amendment permits the transfer of judges without their consent, with refusal treated as a “deemed resignation.” She warned that the amendment is “a tool to intimidate, punish, and purge independent judges, turning the judiciary into a servile arm of the executive.”\n\nFor lawyer Ahmad Maudood Ausaf, the 27th Amendment is “an extension of the 26th, though this time the disguise is fully gone.” He said that while the legal fraternity had warned of the implications back then, “now the fear has a face.” According to him, the judiciary, “once the last line between citizen and state, is being folded neatly into the hands of those it was meant to hold accountable.”\n\n“How could this have ever been about reform? It is not,” Ausaf said, calling the amendment “a retreat, and the biggest one post the 2009 lawyers’ movement.” He argued that the measure is designed to hollow out institutions and constitutes a direct assault on the independence of the judiciary.\n\nAusaf warned that the new ‘constitutional court’ will allow those in power to “decide who gets to sit, who gets to stay and for how long, and who gets quietly transferred out of sight,” with seniority rendered meaningless. Citing the 26th Amendment as a “trial run,” he said judges were moved “like chess pieces, shuffled around for convenience rather than competence.”\n\nHe also dismissed claims that the amendment is meant to speed up cases, noting that only a sliver of all pending cases sit before the Supreme Court” and the real backlog is in lower courts. He added that the reform will blur more than it solves and could spark jurisdictional conflicts among top courts.\n\n“In the end,” Ausaf noted, “this amendment trades independence for influence, merit for loyalty, and justice for convenience. And when that happens, the courts don’t decide anymore. They are decided.”\n\nHeader image: A general view of the Supreme Court of Pakistan in Islamabad on April 4, 2022. — Reuters\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/081604443a3027b.webp",
  "retrievedAt": "2025-11-09T00:44:03.377Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953890/funeral-of-judicial-independence-how-proposed-constitutional-changes-affect-structure-of-pakistans-judiciary",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T10:36:36.000Z"
}
