{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Anwar Iqbal",
  "content": "WASHINGTON: US Secretary of State Antony Blinken has removed Syrian President Ahmed al Sharaa from a list of Specially Designated Global Terrorists (SDGTs).\n\nIn a coordinated move, the Treasury Department also delisted Syrian Interior Minister Anas Hasan Khattab from the same sanctions regime.\n\nOn Thursday, Pakistan joined 14 other members of the UN Security Council in supporting a US-backed resolution that lifted UN sanctions against both Syrian leaders.\n\nThe resolution formally removed the two officials from the Council’s sanctions list against the militant Islamic State (IS) group and Al Qaeda, ending measures such as asset freezes, travel bans, and arms embargoes imposed on listed individuals.\n\n“Pakistan has always emphasised the need for sanctions relief to enable Syria’s reconstruction and reintegration into the international community, while also facilitating sustained dialogue and engagement,” said Pakis­tan’s UN Ambassador Asim Iftikhar Ahmad.\n\n“The Syrian people have suffered through more than a decade of conflict, chaos, and civil war. Today’s vote is a welcome step by this Council, signalling the international community’s support for helping the Syrian people transition into a new phase of their political journey,” he added.\n\nChina was the only Council member to abstain. Explaining its position, China’s permanent representative to the United Nations, Fu Cong, said the United States “did not fully heed the views of all members and forced the Council to take action even when there were huge differences among members.”\n\nThe US State Department, however, said the resolution’s adoption “sent a strong political signal that further recognises Syria’s transition to a new chapter”.\n\nExplaining the decision, the State Department noted that the delisting was made “in recognition of the progress demonstrated by the Syrian leadership after the departure of Bashar al Assad and more than 50 years of repression under the Assad regime”.\n\nIt added that the new Syrian government, led by President Sharaa, was “working to locate missing Americans, fulfil its commitments on countering terrorism and narcotics, and eliminate any remnants of chemical weapons”.\n\nThe statement also cited the government’s efforts to “promote regional security and stability, and advance an inclusive, Syrian-led and Syrian-owned political process”.\n\nThe delisting marks a significant shift in US policy toward Syria. Both Sharaa and Khattab had been under sanctions for years for their alleged links to extremist groups and roles in the former Assad administration.\n\nIn May, the United States, the United Kingdom, and the European Union lifted punitive measures covering around $15 billion in restricted assets and trade controls.\n\nRegional powers, including Saudi Arabia, Türkiye, and Qatar, have also backed renewed engagement, offering to fund public salaries, rebuild energy infrastructure, and help Syria meet its obligations to international financial institutions.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/09100413e7820e0.webp",
  "retrievedAt": "2025-11-09T05:39:49.653Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954010/us-removes-syrian-president-minister-from-terrorist-list",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:39.000Z"
}
