{
  "title": "US influencers falsely associate NYC mayor-elect Mamdani with Islamic State group",
  "author": "AFP",
  "content": "US right-wing influencers falsely linked New York’s mayor-elect Zohran Mamdani to the militant Islamic State (IS) group, amplifying a fabricated statement that garnered millions of views on social media, researchers said on Thursday.\n\nMamdani — the first Muslim and South Asian elected to lead America’s largest city — secured a decisive victory this week in the face of fierce attacks on his policy proposals and religious background.\n\nA slew of anti-Mamdani accounts on the Elon Musk-owned platform X have circulated a statement purportedly from IS titled “Operation Manhattan Project”, which alluded to an attack in New York City on Election Day against what it called “American aggression”.\n\nAmong the influencers who linked the fake communique to Mamdani was Laura Loomer, a conservative influencer who has Trump’s ear.\n\n“The Muslims can’t think of a better way for the Muslims to celebrate the victory of a Muslim mayoral candidate today than by committing an ISIS (Islamic State) attack in NYC,” Loomer wrote in a post on X that racked up more than 200,000 views.\n\nOther conservative accounts cited the purported statement to falsely claim that the militant group had endorsed Mamdani as mayor.\n\nThe posts collectively amassed millions of views across the platform.\n\nThe purported letter, which displayed the logo of the IS-affiliated Amaq News Agency, was fabricated, according to multiple researchers including the disinformation watchdog NewsGuard.\n\nMeili Criezis, an American University academic, told the watchdog that the supposed communique did not bear the hallmarks of other statements that emanated from Amaq.\n\n“Amaq is used [by the IS] to share news and claim responsibility for attacks,” Criezis said. “It doesn’t make threats like what is stated in the screenshot.”\n\nThe Information Epidemiology Lab, another research group, also said the circulated communique “sharply” diverged from established IS “media practices in language, style, formatting, and distribution”.\n\nThe fabricated statement appeared to first surface on the far-right message board 4chan, a known haven for conspiracy theories.\n\nIn recent months, Mamdani, a long-standing supporter of the Palestinian cause, has vocally denounced anti-Semitism as well as the Islamophobia he himself suffered following the September 11, 2001 attacks.\n\nThe 34-year-old state lawmaker — who appealed to voters by pledging to tackle the soaring cost of living — has repeatedly been targeted by racist tropes and misinformation.\n\nIn the weeks leading up to the highly anticipated election, AFP’s fact-checkers debunked several false internet claims targeting Mamdani, including that a non-citizen illegally voted for him and that one of his campaign staffers posed beside graffiti of Nazi swastika.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0711184767ea02c.webp",
  "retrievedAt": "2025-11-09T00:45:12.039Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953683/us-influencers-falsely-associate-nyc-mayor-elect-mamdani-with-islamic-state-group",
  "dateList": "2025-11-09",
  "date_published": "2025-11-07T06:58:23.000Z"
}
