{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "The Newspaper's Staff Reporter",
  "content": "KARACHI: Residents of Clifton Block 5 held a peaceful protest on Saturday evening at The Justice Rana Bhagwandas Family Park to oppose the conversion of neighbourhood parks into padel courts and the commercialisation of quiet residential areas.\n\nThe Justice Rana Bhagwandas Family Park and Dr Fareduddin Sethna Family Park were renovated in 2022 under the World Bank–funded Karachi Neighbourhood Improvement Project (KNIP) using public funds.\n\nThe residents expressed concern that these newly upgraded parks — complete with walkways, greenery, benches, and lighting — are being dismantled for private purposes, bringing late-night lights, noise, and traffic to peaceful residential areas.\n\n“These parks were built for the community, not for commercialisation,” said a resident representative from the Save Bhagwandas Park Campaign. “Millions were spent under KNIP to create safe, family-friendly spaces. It’s unacceptable that public parks are being torn down just two years later.”\n\nOppose plan to convert family parks into padel courts\n\nIt may be noted that the Sindh High Court and Supreme Court have both ruled that public amenity land — including parks — cannot be leased, granted, or converted for private or commercial use.\n\nResidents have also become parties to a constitutional petition at the SHC to legally halt all commercial construction and ensure that these parks remain public, peaceful, and non-commercial spaces.\n\nBoundary walls of Beach Park, Bagh Ibn-i-Qasim demolished\n\nThe Karachi Metropolitan Corporation (KMC) has torn down the outer walls of the Beach Park and Bagh Ibn-i-Qasim in Clifton to “show green beauty vibrantly and openly to the public like parks in other countries”.\n\nA KMC spokesperson told Dawn that the decision would only be applied to the two parks facing Clifton Beach.\n\nRegarding a video that went viral on social media showing some people taking out iron bars from the rubble, he said that it was KMC staff and the iron bars will be used in future infrastructure projects.\n\nMeanwhile, Opposition Leader of the Karachi City Council Advocate Saifuddin strongly condemned the demolition of the protective walls of Bagh Ibn-i-Qasim and Beach Park, calling the move a criminal act.\n\nHe has sent an official letter to Municipal Commissioner Afzal Zaidi, with copies forwarded to Local Government Minister Nasir Hussain Shah and mayor Murtaza Wahab.\n\nIn his letter, Mr Saifuddin demanded an immediate halt to the demolition and the reconstruction of the destroyed walls, stressing that tearing down park walls built with millions of rupees in public funds is a gross misuse of authority.\n\nHe questioned, “Who can authorise the demolition of properties worth crores? The parks are being destroyed, and now their beautiful walls are being razed as well. Without these protective boundaries, how will the park’s safety and demarcation be ensured?”\n\nHe termed the action incomprehensible and regrettable, calling for a thorough investigation and strict punishment for those responsible.\n\nSuch a major decision cannot be made without the City Council’s approval, he said and reiterated that Bagh Ibn-i-Qasim is a landmark of Karachi, and protecting and maintaining it is the primary responsibility of municipal authorities.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690fc0042233d.gif",
  "retrievedAt": "2025-11-09T04:47:26.438Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953946/clifton-residents-in-karachi-protest-commercialisation-of-neighbourhood-parks",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:44.000Z"
}
