{
  "title": "Opt out of the sale or sharing of personal information",
  "author": "Reuters",
  "content": "NEW YORK: James D. Watson, the brilliant but controversial American biologist whose 1953 discovery of the structure of DNA, the molecule of heredity, ushered in the age of genetics and provided the foundation for the biotechnology revolution of the late 20th century, has died at the age of 97.\n\nThe New York Times reported that Watson died this week at a hospice on Long Island.\n\nIn his later years, Watson’s reputation was tarnished by comments on genetics and race that led him to be ostracised by the scientific establishment.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nEven as a younger man, he was known as much for his writing and for his enfant-terrible persona, including his willingness to use another scientist’s data to advance his own career, as for his science.\n\nHis 1968 memoir, The Double Helix, was a racy, take-no-prisoners account of how he and British physicist Francis Crick were first to determine the three-dimensional shape of DNA. The achievement won the duo a share of the 1962 Nobel Prize in medicine and eventually would lead to genetic engineering, gene therapy and other DNA-based medicine and technology.\n\nCrick complained that the book “grossly invaded my privacy” and another colleague, Maurice Wilkins, objected to what he called a “distorted and unfavourable image of scientists” as ambitious schemers willing to deceive colleagues and competitors in order to make a discovery.\n\nIn addition, Watson and Crick, who did their research at Cambridge University in England, were widely criticised for using raw data collected by X-ray crystallographer Rosalind Franklin to construct their model of DNA, as two intertwined staircases, without fully acknowledging her contribution.\n\nIn 2007, Watson again caused widespread anger when he told the Times of London that he believed testing indicated the intelligence of Africans was “not really … the same as ours”. Accused of promoting long-discredited racist theories, he was shortly afterwards forced to retire from his post as chancellor of New York’s Cold Spring Harbour Laboratory.\n\nAlthough he later apologised, he made similar comments in a 2019 documentary, calling different racial attainment on IQ tests, attributed by most scientists to environmental factors, “genetic”.\n\nJames Dewey Watson was born in Chicago on April 6, 1928, and graduated from the University of Chicago in 1947 with a zoology degree. He received his doctorate from Indiana University, where he focused on genetics.\n\nIn 1951, he joined Cambridge’s Cavendish Lab, where he met Crick and began the quest for the structural chemistry of DNA.\n\nJust waiting to be found, the double helix opened the doors to the genetics revolution. In the structure Crick and Watson proposed, the steps of the winding staircase were made of pairs of chemicals called nucleotides or bases.\n\nPublished in Dawn, November 9th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/090957560b41d36.webp",
  "retrievedAt": "2025-11-09T05:07:03.706Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1954005/co-discoverer-of-dnas-double-helix-dies-at-97",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T02:02:39.000Z"
}
