{
  "title": "How does the 27th Constitutional Amendment Bill change the military leadership structure?",
  "author": "Baqir Sajjad Syed",
  "content": "The government presented the much anticipated draft of the 27th Constitutional Amendment Bill in the Senate on Saturday afternoon. The far-reaching legislative proposal, among other changes, rewrites Article 243 of the Constitution, creating the post of Chief of Defence Forces and abolishing the long-standing office of the Chairman of the Joint Chiefs of Staff Committee (CJCSC).\n\nIt also vests broader, constitutionally protected powers and privileges in the country’s top military leadership.\n\nArticle 243 governs the relationship between the prime minister (as head of the federal government) and the president (as the head of state) in relation to the control and command of the armed forces.\n\nKey changes proposed to Article 243:\n\nAccording to the draft tabled in the Senate today, the amendment would make the Chief of the Army Staff the constitutionally recognised Chief of the Defence Forces, effectively merging the army chief’s current authority with a new overarching title that places him at the top of Pakistan’s armed services.\n\nIt also proposes establishing a Commander of the National Strategic Command and defining extensive entitlements for officers elevated to the rare five-star ranks of Field Marshal, Marshal of the Air Force or Admiral of the Fleet.\n\nUnder the new language, the president, acting on the prime minister’s advice, would appoint the army, naval and air chiefs, with the army chief serving “concurrently as Chief of the Defence Forces”.\n\nThe draft further provides that the Commander of the National Strategic Command, a position overseeing the country’s nuclear and strategic assets, would be appointed by the prime minister on the recommendation of the army chief, and must come from within the army.\n\nA separate set of clauses grants life-long constitutional protection to officers promoted to five-star rank. Such officers would “retain the rank, privileges and remain in uniform for life”, removable only through the impeachment-like procedure under Article 47. Immunities similar to those enjoyed by the president under Article 248 would apply in this case.\n\nTheir post-command duties and remuneration would be determined by the federal government and the president on the prime minister’s advice.\n\nWhile presenting the draft in the Senate today, Minister for Law and Justice Azam Nazeer Tarar said that the Chief of Army Staff Asim Munir had been awarded the title of field marshal, which “is not a rank or an appointment as such … whereas army chief is an appointment with a five-year tenure”.\n\n“Field marshal, or marshal of the air force, admiral of the fleet — these exist in different countries for land, navy and air forces — these have been mentioned, and it has been stated that these titles will be given to national heroes.\n\n“These titles are for a lifetime. It is a title,” he said.\n\nTarar noted that it was clarified that the “impeachment or reversal” of the title would not be at the premier’s authority but the Parliament’s, adding that the office of CJCSC would be abolished from November 27, 2025.\n\n“The present CJCSC is also our hero; it [the position] will be abolished after his appointment ends. Parliament cannot even think of depriving him of the role during his tenure,” he said.\n\nHowever, the minister continued, there would be no new appointment because the COAS had been given the role of the chief of defence forces. He further said that the bill proposed that the prime minister, on the recommendation of the COAS, would appoint the commander of the National Strategic Command.\n\n“Where the federal government promotes a member of the armed forces to the rank of field marshal, marshal of the air force or admiral of the fleet, such officer shall retain the rank, privileges and remain in uniform for life,” he said, reading from the bill.\n\n“Upon completion of the term of his command, under the law, the federal government shall determine the responsibilities and duties of field marshal, marshal of the air force or admiral of the fleet in the interest of the state,” he read out from the draft.\n\nGovernment officials and some lawmakers describe the measure as a technical update meant to modernise command arrangements and regularise extraordinary promotions made in recent months. But the proposal has set off a storm of political debate in Islamabad, with opposition parties and civil-rights groups warning that it could tilt the balance of power further toward the military at the expense of civilian institutions.\n\nThe amendment’s political context has fueled controversy. The proposal surfaced earlier this month amid delicate negotiations within the ruling Pakistan Muslim League-Nawaz coalition. It became public when Pakistan Peoples Party Chairman Bilawal Bhutto Zardari disclosed on November 3 that a PML-N delegation, including Prime Minister Shehbaz Sharif, had sought the PPP’s support for a package of constitutional changes.\n\nThe timing of the introduction of the bill drew further scrutiny because the draft’s changes to Article 243 coincide with the extraordinary promotion of Gen Asim Munir to the rank of Field Marshal after the India-Pakistan confrontation of May 2025. That promotion, the second in Pakistan’s history, has been cited by government officials as a reason to formalise such ranks in law.\n\nIf approved, the office of the Chairman, Joint Chiefs of Staff Committee, long regarded as the principal inter-service coordinating body, would be abolished on Nov 27 — the date on which incumbent CJCSC Gen Sahir Shamshad Mirza is set to retire. Gen Mirza would hence become the last Chairman of Joint Services in the country’s history.\n\nFor now, the 27th Amendment Bill sits at the centre of an increasingly charged debate over the limits of civilian oversight and the military’s constitutional role. If enacted, it would mark the most consequential revision of Pakistan’s defence command structure since the constitutional battles of the 1980s and could redefine, in law, the delicate balance that has long shaped the country’s civil-military relations.\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/081512426c1d2d4.webp",
  "retrievedAt": "2025-11-09T00:44:02.868Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953888/how-does-the-27th-constitutional-amendment-bill-change-the-military-leadership-structure",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T09:38:48.000Z"
}
