{
  "title": "Police books Imran, other PTI leaders with terrorism charges for causing ‘chaos’ outside FJC",
  "link": "https://www.app.com.pk/national/police-books-imran-other-pti-leaders-with-terrorism-charges-for-causing-chaos-outside-fjc/",
  "date_published": "2023-03-19T18:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): Islamabad Police on Sunday have registered an FIR – including terrorism charges – against Imran Khan and more than a dozen other PTI leaders for attacking police officers and causing chaos outside the Federal Judicial Complex (FJC).\nHours-long clashes were reported between PTI workers and the police on Saturday after Imran Khan reached the FJC to attend a hearing in the Toshakhana case.\nIn the violent confrontation, the PTI supporters used tear gas against law enforcers to push them back. The PTI workers used rocks against the police alongside petrol bombs to set their vehicles on fire. The mob also set a police post on fire while 52 officials got injured during the confrontation.\nRamna Police Station House Officer (SHO) Malik Rashid Ahmed registered an FIR at the Islamabad Counter Terrorism Department against Imran and other PTI leaders.\nThe complaint invoked sections 148 (rioting, armed with a deadly weapon), 149 (every member of unlawful assembly guilty of the offence committed in prosecution of common object), 186 (obstructing public servant in discharge of public functions), 353 (assault or criminal force to deter public servant from discharge of his duty), 380 (theft in dwelling house, etc), 395 (punishment for dacoity), 427 (mischief causing damage to the amount of fifty rupees), 435 (mischief by fire or explosive substance with intent to cause damage to amount of one hundred rupees), 440 (mischief committed after preparation made for causing death or hurt) and 506 (punishment for criminal intimidation) of the Pakistan Penal Code.\nIt also included Section 7 (punishment for acts of terrorism) of the Anti-Terrorism Act (ATA), 1997.\nAccording to the FIR, the PTI chief along with 17 other PTI leaders violated Section 144, imposed in Islamabad yesterday, and blocked the road to traffic.\nIt named PTI Secretary General Asad Umar, former deputy speaker Asad Qaiser, leaders Hammad Azhar, Ali Amin Gandapur, Ali Nawaz Awan, Murad Saeed, Shibli Faraz, Hassaan Khan Niazi, Omer Ayub Khan, Amjad Khan Niazi, Khurram Nawaz, Jamshed Mughal, Aamir Kiyani, Farrukh Habib, Dr Shehzad Waseem, Umer Sultan and Imran’s Chief Security Officer retired lieutenant colonel Muhammad Asim.\nThe FIR also named 18 people involved in causing damage to the FJC, 22 others involved in causing damage in the parking area of the complex and lighting up fires, and 19 others involved in allegedly injuring police officials.",
  "retrievedAt": "2025-08-11T06:26:00.171Z"
}
