{
  "title": "FGEHA allocates 1,188 category-I plots in Park Road Housing Scheme for employees",
  "link": "https://www.app.com.pk/national/fgeha-allocates-1188-category-i-plots-in-park-road-housing-scheme-for-employees-2/",
  "date_published": "2023-03-19T08:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): The Federal Government Housing Authority (FGEHA) has allocated around 1,188 category-I plots in Park Road Housing Scheme, Islamabad for allotment to federal government employees as per the approved layout plan.\n“As per the decision of the 142nd meeting of the executive committee of the authority, a 3.5 per cent quota was further segregated into constitutional serving (2.5 per cent), constitutional retired (0.5 per cent) and constitutional widows (0.5 per cent) categories with the criteria “age-wise seniority” and “length of service” respectively,” said a document available with APP.\nIt said a number of plots to be allotted as per the above-approved quota reserved in the Park Road Housing Scheme for the registered members of constitutional bodies/quota.\nThe bodies included in the said quota were the Supreme Court of Pakistan, Islamabad High Court, Federal Shariat Court, Election Commission of Pakistan, Senate Secretariat, National Assembly Secretariat, Islamic Ideological Council, Wafaqi Mohtasib Secretariat and Federal Tax Ombudsman Office, the document said.\nThe allotment in Park Road Housing Scheme would be made under age-wise seniority to above mentioned constitutional bodies registered in membership Drive-II.\nThere is no specific membership for Park Road Housing Scheme.\nHowever, applicants registered under Membership Drive-II on age-wise seniority will be considered for allotment, it added.\nThe document said the first right of allotment had been reserved in Sector F-14/F-15 for remaining registered members and they would be accommodated in Park Road Housing Scheme as per available plots.\nIt said the number of applications received in constitutional quota which become eligible for allotment of Category-I plot upon up gradation from Category II along with their details.\nSince there was litigation in F-14/F-15, it said the quota was still to be finalized, adding after clearance of litigation and finalization of the layout plan of F-14/F-15, the allotment to the employees of constitutional bodies in the Park Road Housing Scheme would be made accordingly as per the approved quota policy.\nC:sra/P:sra/L:mzy/R:mzy",
  "retrievedAt": "2025-08-11T06:26:00.745Z"
}
