{
  "title": "PR doles out additional Rs 2m for upgradation of Shaddadpur Station platform",
  "link": "https://www.app.com.pk/national/pr-doles-out-additional-rs-2m-for-upgradation-of-shaddadpur-station-platform-2/",
  "date_published": "2023-03-19T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): Pakistan Railways has allocated around Rs 2 million more funds for completing the renovation and construction of a platform of Shaddadpur Railway Station, to be spent during the current financial year.\n“Shaddadpur Railway Station, operating with three platforms, is one of the important stations situated on mainline where most of the mail and express trains have their stoppages,” an official in the Ministry of Railways told APP here Sunday.\nHe said that the contractor had stopped the construction work due to non-payment of bills and funds, adding that 50 percent of the renovation work had been already completed. However, the official said the requisite funds are being arranged for the remaining work.\nHe said that on the downside, the platform was in dilapidated condition therefore, it was decided to carry out its repair under the head of improvement and welfare expenditure. The total budget for the construction and renovation work is Rs 22.686 million, out of which Rs 5.679 million is released and utilized by June 2022, he added.\nTo a question, the official said that Pakistan Railways was a big organization comprising of around 63,000 employees and its network stretched across the country.\nHe said the employees are paid special care under the welfare activities like health facilities through a wide network of hospitals, dispensaries and child healthcare units. The provision of government accommodation according to entitlement and priority list, staff benevolent funds, benefits and incentives are provided to them through the Prime Minister’s Family Assistance Package policy for families of deceased employees, he told.\nHe said the other welfare activities included benefits and incentives provided through policy for disabled employees’ families, monthly grants to widows scale-wise, the establishment of primary and high schools, industrial schools to teach handicrafts, sports activities through the constitution of Pakistan and pick and drop facility for schools/offices.\nThe installation of water filtration plants, special provision of five medical seats in Ripha Islamic Universities with a reduction of 50 percent in admission and tuition fees, loans on easy installments, availability of all recreational facilities, payment for burial and ambulance charges, marriage grant, farewell grant, free passes and concession in railways fares are additional facilities provided to the, the official expressed.",
  "retrievedAt": "2025-08-11T06:25:59.093Z"
}
