{
  "title": "PM resolves to steer country out of current economic woes",
  "link": "https://www.app.com.pk/national/pm-resolves-to-steer-country-out-of-current-economic-woes/",
  "date_published": "2022-06-21T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 21 (APP): Prime Minister Muhammad Shehbaz Sharif Tuesday said that unfortunately, they had inherited severe economic crises left behind by the previous government, but with hard work and dedication, the collation government would steer the country out of the current challenges.\nSpeaking to media after chairing a meeting of the federal cabinet, the prime minister, in an apparent reference to the Pakistan Tehreek-e-Insaf government, said that it had left behind a backlog of worst and imprudent economic policies, tainted with poor performance.\nCriticizing his predecessors, he said the previous government reduced petroleum prices at the time of their exit from power corridors which smack of conspiracy and based upon ill-will.\n“If they had any concerns and felt pains for the people, they ought to leave behind a precedent of serving the masses by providing any relief in their three and half years rule, so that it can be said that they had worked for the people,” the prime minister regretted.\nThe prime minister said that these were hard times, and they had taken difficult and bold decisions and hinted that if required in future, they would take such like steps for the economic turnaround.\n“We will not budge from taking the necessary steps to set country’s economy on the right track with hard work and nation’s prayers,” he stressed.\nThe coalition government was determined to steer the country out of the current economic crises by striving day and night.\nExpressing his optimism, the prime minister said it was his strong conviction that the good times were in store for the country.\nAbout the International Monetary Fund (IMF) agreement, the prime minister observed that the previous PTI’s government had promised to increase prices and impose taxes, but they retracted and violated the pact which they ought to abide by.\nHe said that due to such ploys by the previous government, today, the country was facing difficulty with the IMF.\nHe also mentioned that global economic situation was complicated as the prices of petrol and grains were spiraling.\nThe government had decided to increase prices of petroleum products with heavy heart, he said, adding, under a decision in the budget, about 70 million people were being provided financial support worth millions of rupees through activation of a helpline.\nThe prime minister further explained that in the budget, they had decided to divert burden from the poor and levy tax upon the wealthy people.\nHe expressed the confidence that the affluent and wealthy class would pay taxes and offer sacrifice for the country and nation.",
  "retrievedAt": "2025-08-11T15:07:37.185Z"
}
