{
  "title": "Two reports laid, two motions passed in Senate",
  "link": "https://www.app.com.pk/national/two-reports-laid-two-motions-passed-in-senate/",
  "date_published": "2022-06-21T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):The Senate on Tuesday passed two motions granting extension to two standing committees for presentation of reports and also witnessed laying of two reports.\nOn behalf of Senate Standing Committee on Human Rights chairman, a member of the committee Senator Abida Muhammad Azeem moved a motion under Rule 194 (1) seeking 60-day extension for the presentation of report on a starred question.\nIt was regarding the number of Pakistani citizens who were currently detained in Guantanamo Bay jail indicating the nature of cases filed against them and duration of imprisonment with separate details of each Pakistani detainee. The motion was passed by the house after voice voting.\nChairman of Standing Committee on Railways Muhammad Qasim moved a motion under Rule 194 (1) seeking 60-day extension for the presentation of report on a starred question.\nIt was regarding termination of employment of patrollers by Pakistan Railways, who were appointed for protection of railways tracks during the last ten years and steps being taken by the ministry for protection of almost 12,000 kilometers long track after terminating employment of patrollers. The motion was also passed by the house after voice voting.\nMeanwhile, two other reports of Standing Committee on Narcotics Control were presented in the house.\nThe chairman of Standing Committee on Narcotics Control Senator Ejaz Ahmad Chaudhary presented the report of the committee on various interventions.\nThe first report was regarding a starred question regarding five years (2010-2014) master plan of upgrading and setting up new treatment and rehabilitation centers while other was related to a point of public importance regarding the death of people due to use of alcohol in Sindh.",
  "retrievedAt": "2025-08-11T15:07:34.357Z"
}
