{
  "title": "Pak-Saudi relations beyond domestic politics: Ashrafi",
  "link": "https://www.app.com.pk/national/pak-saudi-relations-beyond-domestic-politics-ashrafi/",
  "date_published": "2022-06-21T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East, Hafiz Tahir Mehmood Ashrafi on Tuesday said the Saudi government always stood by Pakistan in trying times as these ties were beyond the domestic politics.\nTalking to reporters of national and international media, he expressed the hope that this cooperation and coordination would continue in the future with the same zeal and zest.\nAshrafi, who is also the chairman of Pakistan Ulema Council, said Pakistan and Saudi Arab relations were flourishing in the economic sectors as the Saudi business community was showing their great interest to invest in different sectors in Pakistan.\nHe urged the stakeholders to improve the investment environment and facilitate the investors of Arab Islamic countries.\nHe made it clear that Pak-Saudi relations were not based on person specific; these were between the two nations which were strengthening with every passing day.\nThere were positive news regarding the financial assistance and provision of oil from Saudi Arabia while certain elements were passing inappropriate and irresponsible remarks without credibility which was totally unjustified, he remarked.\nAppreciating the ‘Road to Makkah’ project, initiated by the Saudi government, he said this facility was a great source of relief for the pilgrims.\nAshrafi said the Saudi government was providing every possible assistance to the pilgrims adding the Saudi Vision 2030 program of Crown Prince Muhammad bin Salman would facilitate Hajj and Umrah pilgrims to a larger extent.\nTo a query, he responded that the visit of crown prince Muhammad bin Salman to Egypt, Turkey and Jordan was a matter of great pleasure for the Muslim Ummah.\nHe said the solution of all issues including Palestine and Kashmir was lying in unity and stability of the Muslim Ummah.\nHe said at present, the Organization of Islamic Cooperation (OIC) was headed by the Kingdom of Saudi Arabia and a score of expectations were pinned with the visits of Muhammad bin Salman, which would be fulfilled.\nHe said Pakistan wanted to see the Islamic world united and OIC stronger adding Pakistan would never support any other organization parallel to it.\nIn response to another question, he said the stance of the Muslim Ummah on blasphemy issue was very clear and unanimous.\nHe said the Friday sermons delivered in Harmain Al-Sharifain during last Friday’s congregations had clearly expressed sentiments and pain of Muslim Ummah. The way, Muslim Ummah and Arab Islamic world boycotted the Indian products was a testament of unity of the Muslim Ummah.\nHe hoped that we would succeed in the matter of blasphemy from the Indian rulers as we won in the United Nations against the Islamophobia.",
  "retrievedAt": "2025-08-11T15:07:23.036Z"
}
