{
  "title": "Incessant rain lashes various parts of country: PMD",
  "link": "https://www.app.com.pk/national/incessant-rain-lashes-various-parts-of-countrypmd/",
  "date_published": "2022-06-21T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): Torrential rains lashed different parts of the country including the twin cities of Rawalpindi and Islamabad decreasing temperatures on one hand but causing inconvenience for the people due to flash flooding and land sliding in the vulnerable areas on the other hand.\nThe consistent rain although contributed to increase the water level in dams and rivers and provided relief to the citizens from the hot weather conditions but caused flash floods and damaged crops and properties in the vulnerable areas.\nThe torrential rains started from Tuesday afternoon and continued for a few hours with gaps as a result of a strong weather system that entered the upper and central parts of the country on Monday and will continue to impact till Wednesday.\nThe rainfall recorded during the last 24 hours was Dera Ghazi Khan 67 mm, Rawalpindi (Shamsabad 60, Chaklala 34), Islamabad (Zero point 58, Saidpur 54, Golra 43, Bokra 20, Airport 15), Jhang 51, Bhakkar 50, Lahore (Chowk Nakhuda 40, Wasa Office, Lakshmi Chowk) 26, Gulshan Ravi 25, Tajpura, Farrukhabad, City 25, Upper Mall, Jail Road 22, Nishtar Town, Paniwala Talab 20, Mughalpura 19, Samanabad 18, Iqbal Town 16, Johar Town and Airport 16), Murree 39. Multan (City 36, Airport 17), Okara, Jhelum 30, Kasur 28, Khanpur 23, Gujarat 19, Attock 18, Bahawalpur (Airport, City 17), Toba Tek Singh 16, Khanewal, Mangla, Sahiwal 15, Sialkot (Airport 13, City 10), Narowal 12, Gujranwala 10, Kot Addu 06, Layyah 05, Nurpur Thal, Faisalabad 04, Joharabad, Chakwal 03, Sargodha, Hafizabad 02,Khyber Pakhtunkhwa: DI Khan (City 64, Airport 26), Kakul 40, Dir (Lower 22, Upper 14), Takht Bai, Cherat 18, Malam Jabba 13, Balakot 11, Parachinar 10, Kalam, Pattan, Saidu Sharif 09, Saidu Sharif 07, Peshawar (City 05, Airport 03), Bacha Khan (Airport 04), Mirkhani 03, Kashmir: Rawalakot 45, Muzaffarabad (Airport 32, City 26), Kotli 28, Garhi Dupatta 23, Balochistan: Barkhan 28, Zhob 20, Gilgit Baltistan: Babusar 07 , Gupis 05, Drosh, Astor 04, Hunza, Gilgit 02 and Bagrote 01 mm.For Tuesday, the Pakistan Meteorological Department (PMD) has forecast rain-windstorm/thundershower for Khyber Pakhtunkhwa, upper/central Punjab, Islamabad, Gilgit Baltistan and Kashmir during daytime.Hot and dry weather is expected elsewhere in the country.Rain-windstorm/thundershower is expected in Islamabad during daytime, while partly cloudy weather is expected during evening/night.Rain-wind/thundershower is expected in Rawalpindi, Murree, Galyat, Attock, Chakwal, Jhelum, Mianwali, Sargodha, Khushab, Hafizabad, Faisalabad, Mandi Bahauddin, Nankana Sahib, Toba Tek Singh, Chiniot, Jhang, Sialkot, Narowal, Lahore, Sheikhupura, Okara, Kasur, Sahiwal, Vehari and Lodhran in Punjab during daytime.In Khyber Pakhtunkhwa, rain-windstorm/thundershower is likely in Malakand, Chitral, Dir, Swat, Buner, Shangla, Kohistan, Mansehra, Abbottabad, Haripur, Swabi, Peshawar, Nowshera, Mardan, Lower Dir, Charsadda, Bajaur, Mohmand, Khyber, Kurram, Kohat, Lakki Marwat. Bannu, Dera Ismail Khan, Karak, Hangu and Waziristan. While heavy falls are also likely at a few places.However in Sindh, hot and humid weather is expected in most parts of the province with chances of rain-wind/thundershower in Sukkur and Larkana.In Balochistan, hot and dry weather is expected in most parts of the province with chances of rain-thunderstorm in Zhob, Barkhan and surroundings.Rain-wind/thundershower with heavy falls and hailstorm during morning hours is expected in Kashmir and Gilgit Baltistan.About the possible impacts of the rains, the PMD has warned of the heavy falls that may trigger landsliding in vulnerable areas of Khyber Pakhtunkhwa, Galyat, Kashmir and Gilgit Baltistan during the forecast period.\nHeavy falls may generate flash flooding in local Nullahs or Rivers of Khyber Pakhtunkhwa, Punjab, Kashmir, Gilgit Baltistan and Northeast Balochistan during the period.\nHeavy downpour may cause urban flooding in Peshawar, Mardan, Nowshera, Islamabad, Rawalpindi, Sargodha, Faisalabad, Gujranwala and Lahore. Windstorms may damage loose structures of vulnerable locations in Khyber Pakhtunkhwa, Punjab, Kashmir and Gilgit Baltistan.\nTravelers and tourists are advised to remain extra cautious during the forecast period and avoid unnecessary journeys.\nAll the concerned authorities have been advised to remain alert and take precautionary measures during the forecast period.\nThe highest maximum temperatures recorded during the period were Turbat 45 C, Lasbela 42, Hyderabad, Mithi, Tando Jam and Shaheed Benazirabad 40 C.",
  "retrievedAt": "2025-08-11T15:07:26.682Z"
}
