{
  "title": "Strict adherence to competition laws can help break nexus of monopolists: Rabbani",
  "link": "https://www.app.com.pk/national/strict-adherence-to-competition-laws-can-help-break-nexus-of-monopolists-rabbani-2/",
  "date_published": "2022-06-21T17:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Senator Mian Raza Rabbani on Tuesday said increasing inflation could be controlled by strict adherence to the competition laws, which would help break the nexus of monopolists and cartels, besides providing a level playing field to the local industrialists and farmers to achieve sustainable economic growth.\nResuming debate on the Federal Budget-2022-23 in the Senate, Senator Rabbani called for the restoration of trade unions and revisiting the lists of organizations performing more essential services in order to protect labour rights.\nHe also demanded implementation of the tax relief relief measures announced by the government in its budget for the low income and salaried classes to protect them from the rising inflation.\nHe stressed the need for preparing indigenous policies, besides minimizing the influence of multilateral and landing institutions in order to maintain fiscal and financial sovereignty.\nRaza Rabbani suggested the government to renegotiate with the International Monetary Fund the loan facility under new terms and conditions, with keeping the parliament on board. He regretted that the parliament had never been taken into confidence on any agreement with the IMF.\nHe also proposed the government to withdraw th State Bank of Pakistan Amendment Bill, 2022 and asked for keeping parliamentary oversight to maintain financial and fiscal discipline.\nRegarding the import of cheap petroleum products from Russia, Senator Rabbani said there was not any formal agreement between the two countries. All the major refineries in Pakistan were not capable to refine the Russian oil, he added.\nSenator Danesh Kumar of the Balochistan Awami Party emphasized the need for including measures in the budget which might bring the less developed areas under development priorities.\nHe called for rationalization of funding for the projects initiated under the Public Sector Development Programme and allocation of resources for timely completion of the on-going projects.\nHe also asked for allocating special resources for the development of less developed areas of Balochistan and also providing better facilities of communication, education and health to the people there.\nHe expressed his concern on various incomplete development schemes, which were initiated in 2015, but still in progress. It appeared for the funds allocated in the budget that it would take more than a decade to complete them.\nHe suggested that the legislators should be given appropriate time to go through the budgetary document so that they could help in proper policy formulation.\nSenator Muhammad Abdul Qadir said there was need to decrease imports and focus on increasing exports. A conductive atmosphere should be created for businessmen, while facilitation centers should be set up to attract foreign investment, he added.\nSenator Behramand Tangi criticized the economic policies of previous government and termed the federal budget a good attempt to provide relief to the poor.\nSenator Dilawar Khan said keeping in view the facts and figures, it would be difficult for the government to even meet its expenses. The rising inflation was a serious issue that needed to be addressed, but the imposition of petroleum levy would further increase it, he added.\nHe urged the government to provide targeted subsidies to protect the vulnerable segments of the society, in spite of measures benefiting the elite class.\nHe asked for establishing industrial units in each district with public private partnership to reduce poverty instead of distributing Rs 2,000 under the Benazir Income Support Programme.\nHe also called for financial compensation for the tobacco farmers as their crop had been affected by the rains.\nSenator Mahtab Hussain Dahar said the government should work on the promotion of agriculture sector through various schemes and programmes.The farmers should be provided relief through various effective measures, including reducing prices of tractors and provision of free solar panels.\nHe said efforts should be made for the promotion of agriculture research in the country. More research centers should be set up for the purpose.\nHe said wind power generation should be increased in the country and local industry should be encouraged to produce maximum wind power equipment.\nSenator Sardar Shafiq Tareen said the people of Balochistan were facing hardships due to shortage of water and drought in various parts of the province. The government should allocate more funds for the water projects to facilitate the people of Balochistan.\nHe said health cards scheme should also be provided to the all the districts of the Balochistan province.\nSenator Kamil Ali Agha said loadhsedding should be decreased as the people were facing problems due to hot weather conditions.\nHe proposed that a committee should be constituted regarding the role of Senate in making budget recommendations.\nSenator Muhammad Akram said the education budget should be increased as the country needed more creative minds and experts in various fields.\nHe said Balochistan’s fishermen community should be provided maximum facilities. The government should resolve the problems being faced by the people of the province on priority basis.\nHe said the people of low income segment were facing hardships due to inflation and the government should give maximum relief to them.\nSenator Rana Maqbool Ahmad said tax laws and filing of returns should be simplified. The tax net should also be expanded for enhancing revenue collection.\nSenator Zeeshan Khanzada recommended the government to take measures to protect the poor segments of society from the impacts of inflation.\nSenators Muhammad Humayun Mohmand and Fawzia Arshad also took part in the budget debate and recommended the government to expand the tax net for strengthening economy.",
  "retrievedAt": "2025-08-11T15:07:23.177Z"
}
