{
  "title": "Imran, ex-NAB chairman should be behind bars for trampling law: Marriyum",
  "link": "https://www.app.com.pk/national/imran-ex-nab-chairman-should-be-behind-bars-for-trampling-law-marriyum/",
  "date_published": "2022-06-21T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): Federal Minister for Information and Broadcasting Marriyum Aurangzeb on Tuesday said Imran Khan and the former National Accountability Bureau (NAB) chairman should be behind bars for trampling upon the law and justice of the country.\nResponding to PTI chief’s statement, Marriyum said, “Imran’s corruption had been exposed for the entire country to see and he could no longer harp on false narratives and accusatory politics.\nThe four years of incompetence and corruption were now known to people who had figured out Imran’s false narrative of accountability to persecute his political opponents.\nHe went to insane lengths to file false cases against the opposition, But even after abusing all resources and power, Imran could not prove a single penny of corruption on the opposition leaders.\nHe embarrassed himself in front of UK’S National Crime Agency and Broadsheet where his false allegations were dismissed.”\nThe minister said after crushing the masses under inflation for four years and misleading them over false conspiracy narrative, Imran now wanted to deceive the nation over NAB laws.\nThis was because he wanted to use NAB for political victimisation so that he could imprison political opponents in death row cells once again, she added.\nShe pointed out that Imran should have been in jail but instead Prime Minister Shehbaz Sharif was appearing before courts over these political cases.\n“The truth was that even after abusing NAB, FIA, and Prime Minister’s Office, Imran could not prove anything but he continued violating the human rights of political opponents. Maryam Nawaz too was dragged to courts over these false allegations and made up cases,” she said.\nImran’s hoopla over NAB was nothing but an attempt to hide his own corruption, she added.\nMarriyum clarified that the recent amendment in NAB law would have no bearing on the cases already in process.\nBut even after knowing this, Imran continued to lie to the people of Pakistan because he could only misguide them, she said.",
  "retrievedAt": "2025-08-11T15:07:23.919Z"
}
