{
  "title": "Sherry pays tributes to BB on her 69th birth anniversary",
  "link": "https://www.app.com.pk/national/sherry-pays-tributes-to-bb-on-her-69th-birth-anniversary/",
  "date_published": "2022-06-21T10:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Tuesday paid tribute to the former Prime Minister and Chairperson Pakistan Peoples Party Mohtarma Benazir Bhutto on her 69th birth anniversary and resolved the nation had to end the politics of hatred and anarchy to keep the country united.\nThe Minister in a series of tweets eulogized the late PPP chairperson also known with her acronym BB who was assassinated on December 27, 2007 in Rawalpindi outside Liaquat Bagh after a public procession.\nSherry wrote, “On the occasion of the 69th birth anniversary of Shaheed Mohtarma Benazir Bhutto, I congratulate her family, party workers and all the loved ones. Shaheed Mohtarma Benazir Bhutto is a personality of Pakistan who has fans not only in the country but all over the world.”\nThe Minister also expressed her heartfelt feelings on the absence of her leader in the prevailing crisis scenario.\n“In view of the crisis and problems facing the country, the memory and absence of Shaheed Mohtarma Benazir Bhutto is felt more.\nThe present democratic continuity is due to her. If she were alive, the country would not be suffering from these internal and external crises today.”\nShaheed Mohtarma Benazir Bhutto was a chain of the federating units of the country, she said, adding, “she kept the federation and the whole nation united, Shaheed BB saved Pakistan from terrorism, anarchy and division”.\nThe tweets were followed by the hash tag #HappyBirthdaySMBB.The Mohatarma had the honour to become the first woman Prime Minister of the Muslim World and in a patriarchal society of Pakistan with men dominating the political canvas at that time.\nShe was born on June 21, 1953 in Karachi. She was brought up in the wealthy aristocrat family under special supervision of her father who nourished her as seasoned and well trained politician. Bhutto was a graduate of the Havard University and the University of Oxford.\nHer life as a politician is much idealised as the force against oppression and dictatorship that led to the restoration of democracy while resisting the military General Zia-ul-Haq’s dictatorial regime. She along with her mother fought the battle of democracy after her father’s execution in 1979.",
  "retrievedAt": "2025-08-11T15:07:37.954Z"
}
