{
  "article_id": "2025-08-12_f7f807d8ade34330cfdbd0eb028c20a4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-library-holds-seminar-on-youth-empowerment-marka-e-haq-independence-day/",
    "retrieved_at": "2025-08-17T20:00:55.556Z"
  },
  "metadata": {
    "title": "National Library holds seminar on Youth Empowerment, Marka-e-Haq, Independence Day",
    "author": null,
    "date_published": "2025-08-13T05:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 222,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP):National Library of Pakistan held a seminar on Youth Empowerment, Marka-e-Haq (Bunyan Al Marsous) and Independence Day here on Tuesday. The event brought together prominent figures from national, social, and educational sectors, along with teachers and students. The seminar was presided over by Director General of the National Library of Pakistan, Rana Yasir Arafat, while the chief guest was former Federal Secretary Ali Begum. The guests of honour included former Federal Secretary Abu Ahmad Akif and Assistant Professor, Department of History, Allama Iqbal Open University, Dr. Abdul Basit. In his address, Rana Yasir Arafat delivered a highlighted the importance of intellectual and practical training of youth, the significance of the struggle between truth and falsehood, and the importance of Independence Day. Students presented speeches in both Urdu and English and showcased various performing arts, earning warm appreciation from the audience. Addressing the gathering, chief guest Ali Begum emphasized that the progress of nations depends on the role and positive thinking of their youth. She urged young people to remain committed to education, unity, and a spirit of national service. Abu Ahmad Akif and Dr. Abdul Basit also shared thoughtful insightful and comprehensive views on the theme of the seminar. At the conclusion, DG Rana Yasir Arafat presented commemorative shields to all distinguished guests and expressed gratitude to the participants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}