{
  "article_id": "2025-08-12_8d198f7e04395a79b5eb6e8b7c6d7d46",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/first-lady-calls-for-united-action-to-prevent-breast-cancer/",
    "retrieved_at": "2025-08-17T20:02:26.709Z"
  },
  "metadata": {
    "title": "First Lady calls for united action to prevent breast cancer",
    "author": null,
    "date_published": "2025-08-12T23:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP): First Lady Aseefa Bhutto Zardari Tuesday called for united action involving government institutions, health professionals, media, and communities to raise awareness to combat breast cancer, the most common cancer among women in Pakistan and the highest in prevalence in Asia. She made these remarks during a meeting with Founder and Honourary CEO of Pink Ribbon Pakistan Omer Aftab at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release. Highlighting that one in every nine Pakistani women was at risk, the first lady warned that delayed detection claimed thousands of lives annually. She noted that survival rates exceed 90 percent when the disease was diagnosed early and stressed \"Every woman, regardless of where she lives, must have access to timely screening, diagnosis, and treatment.\" Aseefa Bhutto Zardari emphasized making women's health a national priority with targeted efforts on prevention, early detection, and treatment. She called for expanding breast cancer facilities to underserved rural areas, breaking cultural taboos that delay consultations, and promoting mobile mammography units, community outreach, and male family involvement to overcome stigma. She urged all the stakeholders including the media, educators, and religious leaders to spearhead a nationwide awareness drive, encouraging early detection and timely medical intervention. Commending Pink Ribbon Pakistan for its awareness and screening initiatives, the first lady lauded its efforts to establish the country's first dedicated breast cancer hospital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}