{
  "article_id": "2025-08-12_571daa87e6d1b3549cdca64c92025492",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/polio-surveillance-shows-sharp-decline-in-positive-samples/",
    "retrieved_at": "2025-08-17T20:03:45.812Z"
  },
  "metadata": {
    "title": "Polio surveillance shows sharp decline in positive samples",
    "author": null,
    "date_published": "2025-08-12T21:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 486,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP):Pakistan has recorded a notable decline in positive polio environmental samples, reflecting progress in curbing the virus, though limited transmission continues in some parts of the country, official surveillance data shows. According to official sources, the environmental surveillance system collected total 127 sewage samples from 87 districts during month of July, 2025. The Regional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH) Islamabad has confirmed 75 sewage samples as negative and 42 as positive. They said 10 samples are currently being processed in the lab while the overall trend shows a decline in positive detections, reflecting the impact of high-quality campaigns, the virus continues to circulate in certain areas. As per results, 22 negative, and one positive sewerage samples were reported from Balochistan while 24 negative, seven positive and three samples were under process in Khyber Pakhtunkhwa. In Punjab, 15 negative, 12 positive and four samples were under process while in Sindh 10 negative and 19 positive samples were reported besides one negative, three positive, and one sample under process in Islamabad. In Azad Jammu and Kashmir (AJK), two negative and one sample was under process while in Gilgit Baltistan one negative and one sample was under process. The July data shows steady progress in containment. Balochistan reported a marked reduction, with only one positive site in July, down from 15 in January. As many as 22 of the 23 sites in the province tested negative. In Quetta Block, six out of seven sites tested negative. In Khyber Pakhtunkhwa, positive sites dropped from 14 in January to seven in July. Total 24 sites in the province tested negative. Of these seven positive sites in July, three are from South Khyber Pakhtunkhwa. In Peshawar, four out of six sites tested negative. In Punjab, the number of positive sites decreased from 15 in March to 12 in July. In Sindh, the number of districts with positive detections has also declined compared to previous months, from 20 in March to 12 in July. In AJK and GB, all the tested samples so far are negative. Over the past year, the Pakistan Polio Programme has conducted six high-quality vaccination campaigns, four of them nationwide, each reaching over 45 million children. These sustained efforts have significantly reduced both polio cases and positive environmental samples nationwide, demonstrating strong progress toward interrupting transmission. The next sub-national polio vaccination campaign is scheduled for September 1- 7, 2025. The campaign aims to vaccinate 28 million children across 91 districts in all provinces and regions, with the goal of rapidly boosting immunity and closing protection gaps. Parents and caregivers have been asked to ensure their children receive polio drops during this round. In addition to polio drops, the government provides free routine immunization for children up to 15 months of age, offering broader protection against preventable diseases. Repeated polio vaccination alongside routine immunization strengthens immunity and prevents lifelong paralysis.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}