{
  "article_id": "2025-08-12_8c26d2c9fa90f0e625b5eac549f55406",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-advises-opposition-to-approach-courts-for-relief/",
    "retrieved_at": "2025-08-17T20:02:08.774Z"
  },
  "metadata": {
    "title": "Tarar advises opposition to approach courts for relief",
    "author": null,
    "date_published": "2025-08-13T01:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 234,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP):Minister for Law and Justice Azam Nazeer Tarar on Tuesday advised the opposition to approach the courts, stating that relief does not come from protests or speeches but by following the legal process. Responding to points raised by Senator Ali Zafar, he said the remedy lies with the constitutional courts-either the High Court or the Supreme Court-under the legal framework enacted by Parliament. \"If someone commits a crime, whether guilty or innocent, the matter must go through the legal course, and remedies are available within that system,\" he added. The minister cited past examples, including the cases of Hanif Abbasi, former prime minister Muhammad Nawaz Sharif, Shehbaz Sharif, Hamza Shehbaz, and others, who faced convictions, disqualifications, and imprisonment but eventually obtained relief through appeals in the courts. He added that political leaders from all parties had, at times, faced such situations, with many front-row members of the National Assembly spending time in jail. Referring to the events of May 9, he said the nation witnessed attacks on Jinnah House, the Mianwali airbase, monuments of martyrs in Mardan, Radio Pakistan Peshawar, Lahore's Shadman police station, and other places. He stressed that the law must take its course in such cases. The minister added that in politics, parties should strengthen each other and resolve issues collectively, noting that the judicial process, as seen in the case of Jamshed Dasti, ensures remedies where due.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}