{
  "article_id": "2025-08-12_df1946d89d035356948d910fcdda8a2d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-emphasizes-significance-of-pakistan-morocco-economic-ties-highlighting-vast-bilateral-cooperation-potential/",
    "retrieved_at": "2025-08-17T20:02:59.162Z"
  },
  "metadata": {
    "title": "President emphasizes significance of Pakistan-Morocco economic ties highlighting vast bilateral cooperation potential",
    "author": null,
    "date_published": "2025-08-12T23:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 220,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP):President Asif Ali Zardari on Tuesday emphasized that Pakistan attaches great importance to its economic relations with Morocco and highlighted the vast potential for expanding economic cooperation between the two countries. He made these remarks during a meeting with the Ambassador of Morocco, Mohamed Karmoune , who called on him at Aiwan-e-Sadr, a Presidency's news release said. President Zardari observed that Africa is poised for significant economic growth in the coming years, and Morocco, with its remarkable economic development, is well-placed to lead this transformation and contribute to regional prosperity. He added that Pakistan and Morocco enjoy fraternal ties, based on common faith, shared values, and mutual respect, which need to be further strengthened for the mutual benefit of the two countries. The President said that Pakistan is committed to further enhancing bilateral cooperation with Morocco in diverse fields. He expressed gratitude for Morocco's for its support to Pakistan during the 2022 floods, noting that such gestures reflect the depth of friendship between the two nations. Reaffirming that Pakistan and Morocco enjoy close and brotherly ties, the President expressed his best wishes for the continued health of His Majesty King Mohammed VI. He also requested the Ambassador to convey the goodwill and warm regards of the people of Pakistan to the King and the people of Morocco.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}