{
  "article_id": "2025-08-12_23a46f2be76ddb81687a17878af9b632",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pta-huawei-arrange-next-gen-cyber-resilience-workshop/",
    "retrieved_at": "2025-08-17T20:01:20.226Z"
  },
  "metadata": {
    "title": "PTA ,Huawei arrange Next-Gen cyber resilience workshop",
    "author": null,
    "date_published": "2025-08-13T04:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 168,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 12 (APP):The Pakistan Telecommunication Authority (PTA) in collaboration with Huawei organized the Next-Gen Cyber Resilience Workshop and Telecom Cyber Security Awards 2025, bringing together senior officials, industry leaders, and cybersecurity experts to discuss emerging digital security challenges. The workshop addressed cybersecurity implications of Pakistan's upcoming 5G rollout, Low Earth Orbit (LEO) Satellite Internet, Artificial Intelligence (AI) adoption, and FinTech expansion. PTA reaffirmed its commitment to working with local and international partners to enhance capacity, share knowledge, and adopt advanced security solutions. Federal Minister for IT&Telecom, Shaza Fatima Khawaja, lauded PTA's initiatives, stating, \"Building a cyber-resilient Pakistan is not just a technological priority but a national imperative. The government is fully committed to supporting innovative solutions and robust security measures that safeguard our digital ecosystem.\" Chairman PTA, Maj. Gen. (R) Hafeezur Rehman, said, \"Cyber resilience is the cornerstone of our digital future. PTA will continue fostering collaboration and innovation for a secure digital Pakistan\". The event concluded with awards recognizing excellence in cybersecurity innovation, resilience, and leadership.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}