{
  "title": "Govt taking concrete steps to promote Iqbal’s philosophy",
  "author": null,
  "content": "ISLAMABAD, Nov 09 (APP): Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi on Sunday said that the government was taking concrete measures to promote and preserve Iqbal’s philosophy as a guiding force for the nation’s intellectual and moral development.\n\nOn the occasion of the birth anniversary of Allama Dr. Muhammad Iqbal, the Poet of the East, the federal minister announced the formation of a committee to commemorate the 150th birth anniversary of Allama Iqbal, comprising Iqbal scholars, educationists, and researchers.\n\nThe Iqbal Academy Pakistan will play a central role in implementing various national and international initiatives under this plan.\n\nThe minister revealed that the government plans to establish Iqbal Studies Centres across all four provinces, Azad Jammu and Kashmir, and Gilgit-Baltistan to encourage research and learning on Iqbal’s thought.\n\nHe also announced the launch of the Iqbal Research and Cultural Complex in Sialkot, which will serve as a hub for research, training, and academic exchange.\n\nKhichi added that the Iqbal Academy is working on translating Iqbal’s poetry and prose into major world languages, while national and international research projects on Iqbal’s philosophy will also be published.\n\nIn collaboration with universities and research institutions, the Ministry will organize international conferences and exhibitions to promote Iqbal’s message of selfhood, intellectual freedom, and universal brotherhood.\n\n“The government is committed to incorporating Iqbal’s vision into the national curriculum and policy framework,” the minister stated, adding that special initiatives are being launched to familiarize the youth with Iqbal’s message of Khudi and nation-building.\n\nHe emphasized that “the solution to today’s global challenges lies in the teachings of Iqbal, whose vision inspires humanity, freedom of thought, and universal harmony.”\n\nHighlighting upcoming cultural diplomacy efforts, Khichi said that on November 13, the Pakistan Academy of Letters will introduce Portuguese translations of Iqbal’s works in a special event featuring the ambassadors of Brazil and Portugal.\n\n“Our foremost priority is to safeguard our civilizational heritage including the timeless philosophy of Allama Iqbal and pass it on to future generations,” he said.\n\n“Through art, literature, and cultural engagement, we will continue to inspire youth in the light of Iqbal’s teachings,” the minister said.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/5558558601745733274.jpg",
  "retrievedAt": "2025-11-09T12:14:15.729Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-taking-concrete-steps-to-promote-iqbals-philosophy/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T12:11:09.000Z"
}
