{
  "title": "Abrar, Saim guide Pakistan to ODI series win against South Africa",
  "author": null,
  "content": "LAHORE, Nov 08 (APP): Individual best bowling figures by Abrar Ahmed curtailed South Africa to 143-10 while third ODI half-century by Saim Ayub guided Pakistan to a seven-wicket win with 151 balls to spare in the third ODI of the three-match series at the Iqbal Stadium in Faisalabad on Saturday night. Pakistan won the series 2-1.\n\nThe spin trio of Abrar Ahmed, Muhammad Nawaz and Salman Agha changed the completion of the game with eight wickets between them. Salman Agha put brakes to the threatening first wicket stand between Pretorius and de Kock but Abrar Ahmed proved to be the wrecker-in-chief as he claimed four wickets for 27 runs and the Proteas could never get out of the rut.\n\nThe third and last match of the series proved to be a replay of the second match with the roles reversed. In the previous tie Pakistan batted first and could not put up a big total which was overhauled by South Africa with ease. In today’s match, South Africa were on the losing side.\n\nAfter electing to bat first, South Africa got off to an excellent start with a 72-run opening wicket partnership between Quinton de Kock (53, 70b, 6x4s, 1×6) and Lhuan-dre-Pretorius (39, 45b, 4x4s, 1×6). Salman Ali Agha (4-0-18-2) removed the latter to break the partnership in the 15th over. Salman then got rid of Tony de Zorzi in the 19th over as the scoreboard read 87-2.\n\nMohammad Nawaz (9-0-31-2) trapped top-scorer de Kock lbw in the 25th over to trigger a collapse for the visitors when they were 106-3. Just four deliveries later, Abrar clean-bowled the debutant Rubin Hermann for one.\n\nTwo overs later, Abrar weaved his magic again, dismissing Donovan Ferreira (7) and Corbin Bosch on consecutive deliveries to leave South Africa reeling on 117-6. Nawaz pitched in with another wicket in the next over as he removed Bjorn Fortuin.\n\nSouth Africa’s woes deepened when Pakistan saw the back of their skipper Matthew Breetzke in the 34th over, who nicked one off Abrar to Mohammad Rizwan who completed a sharp catch as the scoreboard read 130-8. Skipper Shaheen then cleaned up the tail to bundled South Africa out for 143 in 37.5 overs.\n\nFor Pakistan, Abrar spearheaded the attack with his career-best 4-27 in 10 overs. Nawaz, Agha and Shaheen (4.5-0-18-2) chipped in with two wickets apiece.\n\nPakistan chased the 144-run total in 25.1 overs for the loss of three wickets. Opening batter Saim Ayub anchored the chase with a 70-ball 77 hitting 11 fours and a six.\n\nSaim also knitted a 64-run partnership with Babar Azam (27, 32b, 5x4s) for the second wicket and a 65-run alliance with Mohammad Rizwan (32 not out, 45b, 3x4s, 1×6) for the third wicket.\n\nFor the tourists, Nandre Burger (1-29) and Bjorn Fortuin (1-34) picked up one wicket each.\n\nPakistan beat South Africa by seven wickets at Iqbal Stadium\n\nSouth Africa 143 all out, 37.5 overs (Quinton de Kock 53, Lhuan-dre Pretorius 39; Abrar Ahmed 4-27, Shaheen Shah Afridi 2-18, Salman Ali Agha 2-18, Mohammad Nawaz 2-31)\n\nPakistan 144-3, 25.1 overs (Saim Ayub 77, Mohammad Rizwan 32 not out, Babar Azam 27; Nandre Burger 1-29, Bjorn Fortuin 1-34)\n\nPlayer of the match – Abrar Ahmed (Pakistan)\n\nPlayer of the series – Quinton de Kock (South Africa)\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/APP43-081125Faisalabad.jpg",
  "retrievedAt": "2025-11-09T00:47:16.353Z",
  "source": "APP",
  "link": "https://www.app.com.pk/sports/abrar-saim-guide-pakistan-to-odi-series-win-against-south-africa/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T19:09:28.000Z"
}
