{
  "title": "PCB chairman congratulates Pakistan team on historic home series win",
  "author": null,
  "content": "FAISALABAD, Nov 08 (APP): Pakistan Cricket Board (PCB) Chairman Mohsin Naqvi has congratulated the Pakistan cricket team and management on their remarkable home-ground victory against South Africa, marking the nation’s first-ever One Day International (ODI) series triumph over the Proteas on home soil.\n\nPCB spokesperson Rafiullah while talking to media persons at Iqbal Stadium Faisalabad said that the chairman extended heartfelt felicitations to the entire national squad for their outstanding performance, describing it as a proud moment for Pakistan cricket and the passionate Faisalabad crowd.\n\n“Well done, Team Pakistan — and thank you, Faisalabad!” Mohsin Naqvi said in his message, commending the team’s commitment and unity in clinching the ODI series following their earlier T20 success.\n\nMohsin Naqvi noted that after 17 years, the victory at Iqbal Stadium rekindled fond memories of the city’s glorious cricketing past. He appreciated the team’s overall performance, emphasizing that the players displayed immense skill, discipline and teamwork.\n\n“The team revived the spirit of national cricket by playing fearless and quality cricket before a charged home audience”, he said, adding that the achievement was a reflection of collective effort of the players, management and fans.\n\nCongratulating Head Coach Mike Hesson, Captain Shaheen Shah Afridi and the entire playing XI, the PCB chairman particularly praised Abrar Ahmed for his brilliant bowling and Saim Ayub for his fluent batting display, both of whom played pivotal roles in Pakistan’s victory.\n\nHe said that their performances showcased the depth of Pakistan’s emerging cricketing talent and the bright future ahead for the national side.\n\nMohsin Naqvi also acknowledged the overwhelming enthusiasm of cricket fans, saying that the revival of international cricket in Faisalabad was met with tremendous energy and passion as thousands filled the stands during all three matches of the series.\n\nHe expressed his gratitude to the local administration, law enforcement agencies and PCB officials for ensuring flawless event management and top-tier security arrangements that made the series a resounding success.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/cover_1729240911cover_1722319516cover_17200885042132.jpg",
  "retrievedAt": "2025-11-09T00:47:16.429Z",
  "source": "APP",
  "link": "https://www.app.com.pk/sports/pcb-chairman-congratulates-pakistan-team-on-historic-home-series-win/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T19:01:05.000Z"
}
