{
  "title": "Govt committed to educate youth in light of Iqbal’s thought: PM",
  "author": null,
  "content": "ISLAMABAD, Nov 08 (APP): Prime Minister Muhammad Shehbaz Sharif said that in the light of thought of Allama Muhammad Iqbal, the government of Pakistan was committed to provide such an education for the young generation that was not only a source of livelihood but also improved intellect and character.\n\nIn a message on Iqbal Day celebrated on November 9, he said, “Today, on the birth anniversary of the Poet of the East, thinker of Islam and architect of Pakistan, Allama Iqbal, we pay tribute to his thoughts and insights and his extraordinary role for the Islamic nation and the Muslims of the subcontinent.”\n\n“Allama Iqbal is the name of such a spiritual and intellectual force that lit a candle of light in the darkness of slavery, and gave a message of self-reliance to a nation that was in despair,” he added.\n\nThe prime minister said, “Allama Iqbal taught the lesson that faith, knowledge and action are the pillars on which a living nation builds itself. Even today, Iqbal’s thought provides guidance in national and global situations.”\n\n“Iqbal’s youth is the architect of the nation and the falcon of the future,” he remarked.\n\nHe said, “The ideological formation of our education in the light of Iqbal’s thought is our need as on it our bright and strong future depends.”\n\n“Allama Iqbal’s dream was that the youth should write their own destiny and create a new world with their own imagination. To give practical form to this thought, the government has started several programmes including Uraan Pakistan to provide modern education, skills, and employment opportunities for the youth.”\n\nThe prime minister said, “Iqbal was an Islamic thinker and Iqbal’s dream was the unity of the Islamic world and the establishment of peace in the world. He saw the Muslim Ummah as one body. Today, the world needs this message of Iqbal so that there is brotherhood instead of sectarianism, love instead of hatred, and justice instead of use of might.”\n\n“Iqbal’s thoughts are a guide for national policy, educational priorities, and individual and collective life. We have to make Iqbal’s thoughts the focal point of our actions so that Pakistan can truly become the Pakistan of Iqbal’s dreams, where knowledge and action, love and tolerance, and peace and justice prevail,” he continued.\n\nHe said, “Pakistan will continue to play its constructive role in promoting the unity of the Muslim Ummah and world peace in the light of Iqbal’s thoughts. Long live Pakistan!”\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/Prime-Minister-Shehbaz-Sharif-Vows-to-End-Pakistans-Dependence-on-IMF-1024x576-1.png",
  "retrievedAt": "2025-11-09T00:46:27.764Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-committed-to-educate-youth-in-light-of-iqbals-thought-pm/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T19:00:10.000Z"
}
