{
  "title": "Pakistan hosts landmark ISC to promote peace, development",
  "author": null,
  "content": "ISLAMABAD, Nov 09 (APP): All arrangements have been finalized for the Inter-Parliamentary Speakers’ Conference (ISC), set to be held in Islamabad from November 11 to 12, 2025, under the theme “Promoting Peace, Security, and Development.”\n\nSpeakers of Parliaments, 15 Deputy Speakers, 37 Members of Parliament, and representatives from several international organizations—making a total of 174 delegates from over 40 countries—are expected to attend the event.\n\nParliamentary delegations from various countries have already begun arriving in Pakistan for the conference. Dr. Tageldin Ibrahim Hamad, President of the Universal Peace Federation (UPF)—an organization associated with the United Nations Economic and Social Council (UN ECOSOC)—arrived in Islamabad along with his delegation and was warmly received by senior officials of the Senate Secretariat.\n\nFrom Somalia, Saadia Yasin, First Deputy Speaker of the House of the People, arrived with her team, while Prosper Kasongo Lukali Tunda, a Member of Parliament from Congo, and Ubraj Narine, Director of National Peace Initiatives from Guyana, also reached Islamabad to participate.\n\nThe Moroccan delegation, accompanying the Speaker of the House of Councillors, included the Speaker’s Executive Director, a senior journalist, an interpreter, and other officials.\n\nChairman Senate and Founding Chairman of the Inter-Parliamentary Speakers’ Conference, Senator Syed Yousaf Raza Gilani, described the event as a “momentous occasion in Pakistan’s parliamentary history.”\n\nHe said the conference marks an important milestone in Pakistan’s efforts to promote international dialogue, peace, and cooperation through parliamentary diplomacy.\n\nHe further disclosed that two former Presidents will also attend the event, underscoring Pakistan’s growing diplomatic engagement and credibility on the global stage.\n\n“Hosting such a distinguished assembly is not merely an achievement for the Senate; it is a national cause that elevates Pakistan’s standing internationally,” Gilani said.\n\nHighlighting the broader significance of the conference, he said the ISC represents a collective national effort reflecting Pakistan’s vision for peace, security, and inclusive development.\n\nHe urged all Senators to act as hosts and ambassadors of Pakistan’s values rather than mere participants.\n\n“As we welcome our esteemed guests from both the Global South and Global North, we embody Pakistan’s resolve to promote dialogue, understanding, and cooperation across borders,” he added.\n\nGilani expressed gratitude to President Asif Ali Zardari, Prime Minister Muhammad Shehbaz Sharif, Speaker of the National Assembly Sardar Ayaz Sadiq, and Deputy Prime Minister and Foreign Minister Senator Ishaq Dar for their support in organizing the conference.\n\nHe especially commended Senator Ishaq Dar for chairing the curtain-raiser session of the ISC and appreciated the active participation of the National Assembly Speaker, noting that such coordination among national leadership reflects unity and purpose.\n\nThe Senate Chairman also lauded the contributions of key ministries and departments—including the Ministry of Interior, Ministry of Foreign Affairs, Ministry of Information and Broadcasting, and the Capital Development Authority (CDA)—for ensuring the smooth execution of the event.\n\n“Their dedicated efforts reflect the spirit of national unity and commitment toward making this conference a resounding success,” Gilani said.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/20251108141654_customMedium_1300x450_37-1-e1762680935875.webp",
  "retrievedAt": "2025-11-09T12:14:12.692Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-hosts-landmark-isc-to-promote-peace-development/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-09T12:11:09.000Z"
}
