{
  "title": "President for renewing pledge to Allama Iqbal’s principles",
  "author": null,
  "content": "ISLAMABAD, Nov 8 (APP): President Asif Ali Zardari on Saturday stressed upon renewing their commitment to Allama Muhammad Iqbal’s principles and drawing strength from his ideals for a brighter future.\nIn a message on the birth anniversary of Allama Iqbal being observed on November 9, he said that as they paid tribute to his remarkable personality, they renewed their commitment to his principles and to striving for a Pakistan ‘that is prosperous, peaceful and united. Let us draw strength from his life and ideals as we work together to build a brighter tomorrow.’\nToday, he said they marked the birth anniversary of Allama Muhammad Iqbal, the poet-philosopher whose vision helped awaken the spirit of independence and self-determination among the Muslims of the Subcontinent.\nIn his address at the All-India Muslim League session in 1930, he emphasized the importance of securing the rights of Muslims which laid the foundation for a sovereign nation, he added.\n“Iqbal’s legacy goes well beyond his literary works such as Asrar-e-Khudi, Rumuz-e-Bekhudi and Bang-e-Dara, which explore matters of identity, spirituality and freedom. His insistence on political representation for Muslims and on values rooted in Islam has left a lasting imprint on Pakistan’s national identity,” President Secretariat Press Wing, in a press release, quoted the president as saying.\nThe president prayed that Allama Iqbal’s vision might guide them in their shared endeavour for progress, and may his legacy continue to inspire generations.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/2206627-asif-ali-zardari-1.webp",
  "retrievedAt": "2025-11-09T00:46:24.306Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-for-renewing-pledge-to-allama-iqbals-principles/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T19:00:23.000Z"
}
