{
  "title": "UN panel adopts four Pakistani resolutions aimed at underpinning regional, world peace",
  "author": null,
  "content": "UNITED NATIONS, Nov 09 (APP): A key committee of the UN General Assembly has adopted Pakistan’s four annual disarmament-related resolutions that are\naimed at underpinning regional as well as international peace and security, reflecting the country’s strong commitment to accomplish those objectives.\n\nTwo of these resolutions, adopted by the 193-nation Assembly’s First Committee (Disarmament and International Security),  were unanimously adopted. The\nresolutions are entitled: “Regional disarmament” and “Confidence-building measures in the regional and sub-regional contexts”.\n\nThe other two resolutions entitled “Conclusion of effective international arrangements to assure non-nuclear-weapon States against the use or threat of use of nuclear weapons” and “Conventional arms control at the regional and subregional levels” were adopted by an overwhelming majority of members.\n\nThe texts are expected to come up for endorsement by the General Assembly next month.\n\nFor decades, Pakistan has been trying to promote issues of nuclear disarmament, regional disarmament, conventional arms control, and Confidence-Building Measures (CBMs), a press release of the Pakistan Mission to the UN pointed out. The adoption of these resolutions reaffirms the importance the international community attaches to “negative security assurances” as well as embracing regional approaches to disarmament and arms control.\n\nDiplomats at the UN expressed appreciation for Pakistan’s initiatives.",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2022/09/Fall-Back-Image-2.png",
  "retrievedAt": "2025-11-09T00:47:09.326Z",
  "source": "APP",
  "link": "https://www.app.com.pk/foreign-correspondent/un-panel-adopts-four-pakistani-resolutions-aimed-at-underpinning-regional-world-peace-2/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T17:32:12.000Z"
}
