{
  "title": "Balochistan Pavilion showcases province’s vibrant culture at Lok Mela 2025",
  "author": null,
  "content": "ISLAMABAD, Nov 08 (APP): The Balochistan Pavilion at the ongoing Lok Mela 2025, organized by Lok Virsa under the Ministry of National Heritage and Culture, is drawing large crowds with its vibrant display of the province’s rich cultural heritage, arts, crafts, music, and cuisine.\n\nSet up by the Department of Culture, Government of Balochistan, the pavilion has become one of the main attractions of the festival. Its beautifully designed entrance reflects traditional Balochi architecture and aesthetics, giving visitors the feeling of stepping into the heart of Balochistan.\n\nThe pavilion featured an impressive lineup of master artisans, including Kaneez Fatima and Shakir Bibi, known for their intricate embroidery work; Arzi Khan, who specializes in woodcraft and musical instrument making; Fazal Kakar, an expert in Balochi embroidery; and Rozi Khan, who showcases traditional Balochi footwear.\n\nParticularly notable is Kaneez Fatima, a 48-year-old artisan who has been participating in Lok Mela for the past 26 years.\n\nHighly respected for her craftsmanship and dedication, she has trained many students who have gone on to become professional artisans themselves.\n\nOver the years, she has received numerous awards and certificates in recognition of her efforts to preserve traditional embroidery and promote it among younger generations.\n\nAdding to the cultural experience, visitors are also enjoying “Sajji,” one of Balochistan’s most famous traditional dishes, which has become a crowd favorite among attendees from Rawalpindi and Islamabad for its authentic flavor and preparation style.\n\nA Balochistan Musical Night held on Saturday enthralled the audience with performances by renowned folk singers and musicians, including Akhtar Chanal, Urooj Fatima, Zakir Hussain, Muhammad Baloch, Azeem Jan, Muhammad Qasim, Moeen Sherani, Raza Sheeda, and Muhammad Asim.\n\nTheir soulful performances received enthusiastic applause from the audience. The colorful Lok Mela 2025 continues until November 16, offering visitors a chance to experience the diverse and vibrant cultures of all provinces of Pakistan in one place.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/Lok-Virsa-Museum-Cover-14-09.jpg",
  "retrievedAt": "2025-11-09T00:46:25.362Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/balochistan-pavilion-showcases-provinces-vibrant-culture-at-lok-mela-2025/",
  "dateList": "2025-11-09",
  "date_published": "2025-11-08T19:00:23.000Z"
}
