{
  "title": "President calls for imparting skills to Pakistan’s youth bulge",
  "link": "https://www.app.com.pk/national/president-calls-for-imparting-skills-to-pakistans-youth-bulge/",
  "date_published": "2022-07-15T19:28:00.000Z",
  "source": "APP",
  "content": "He made these remarks during a virtual address to the Association of Physicians of Pakistani Descent of North America (APPNA).\nHe said the digital skills programme in Pakistan had imparted skills to 2.4 million youth and enabled them to enter the job market.\nHe said he knew about the struggle that doctors went through to establish the APPNA organization in the United States.\nHe congratulated the organization for serving the Pakistani community and American society for the last 45 years.\n“We recognize the contributions of the Pakistani diaspora,” he said adding the association had contributed to improving the health sector of Pakistan.\nDr Alvi underlined the need for promoting telehealth and said there should be a helpline so that people could get medical aid online.\nHe said it was unfortunate that Pakistani talent including professionals, doctors and engineers left Pakistan because of lack of opportunities in their country.\nHe said he lived in Michigan in the United States and saw the unique condition of the Pakistani diaspora as it was passionate about keeping its contact with Pakistan and maintaining their cultural traditions and values.\nThe president said every society had good societal values including loving your families, children and taking care of elderly.\nTalking about foreign relations, the president said Pakistan cooperated with the international community in the war against terrorism.\nNow Pakistan’s policy had shifted from geostrategic to geoeconomics, he noted.He said Central Asian countries wanted trade with Pakistan and Gwadar port would play an important part in enhancing regional trade.\nThe president stressed that women empowerment should be ensured in Pakistan and women should be included in the society by ensuring their property rights and financial inclusion like opening of bank accounts.\nWomen who leave the medical profession due to family responsibilities should be welcomed back later when they could return, he suggested.\nHe urged the doctors to transfer their different skill sets to the people living in Pakistan.\nHe said a new knowledge-based world had emerged and the Pakistani diaspora in the interest of their country should lobby the United States congressmen and Senators and increase goodwill for the country and remove misgivings in the wake of rapid withdrawal of the US troops from Afghanistan.\nThe president talked about the human rights violations in India and the persecution of Muslims and other minorities.\nDr Alvi said Pakistan protected human rights and the prime example was the refuge it gave to the Afghan refugees for four decades.He said overseas Pakistanis should get their right to vote in the general elections.",
  "retrievedAt": "2025-08-11T15:15:09.251Z"
}
