{
  "title": "Federal govt allocates portfolios to newly inducted cabinet members",
  "author": null,
  "content": "ISLAMABAD, Mar 7 (APP): The federal government on Friday assigned portfolios to the newly inducted members of the cabinet sworn in at the end of February while also reassigning the portfolios of serving federal ministers.\nAccording to notifications issued by the Cabinet Division, the portfolios were assigned upon inductions as federal ministers and ministers of state, under clause (1) of Article 92 of the Constitution.\n“The prime minister, under rule 3(4) of the Rules of Business, 1973, has been pleased to allocate the portfolios (business of the government) to the federal ministers and ministers of state,” the notification read.\nThe federal ministers assigned portfolios included Dr Tariq Fazal Chaudhary Parliamentary Affairs, Ali Pervaiz Malik, Petroleum, Aurangzeb Khan Khichi National Heritage and Culture, Khalid Hussain Magsi Science and Technology, Muhammad Hanif Abbasi Railways, Muhammad Mueen Wattoo Water Resources, Muhammad Junaid Anwar Maritime Affairs, Muhammad Raza Hayat Harraj Defence Production, Sardar Muhammad Yousaf Religious Affairs & Interfaith Harmony, Shaza Fatima Khawaja Information Technology & Telecommunication, Rana Mubashar Iqbal Public Affairs Unit and Syed Mustafa Kamal National Health Services, Regulations & Coordination.\nThe new state ministers included Malik Rasheed Ahmad Khan National Food Security & Research, Abdul Rehman Khan Kanju Power with additional portfolio of Public Affairs Unit, Aqeel Malik Law & Justice, Bilal Azhar Kayani Railways, Kesoo Mal Kheal Das Religious Affairs & Interfaith Harmony, Mohammad Awn Saqlain Overseas Pakistanis & Human Resource Development, Mukhtar Ahmad Malik National Health Services, Regulations & Coordination, Talal Chaudhry Interior & Narcotics Control and Wajiha Qamar Federal Education & Professional Training.\nMeanwhile, according to a separate notification, former Khyber Pakhtunkhwa chief minister Pervez Khattak was appointed an adviser on Interior Affairs while Dr Syed Tauqir Hussain Shah and Muhammad Ali were appointed advisers to the PM’s Office and the Privatization Ministry, respectively.\nThe four SAPMs were assigned their portfolios in a separate notification with Haroon Akhtar for Industries and Production, Huzaifa Rehman for National Heritage and Culture, Mubarak Zeb for Tribal Affairs and Talha Burki for Political Affairs.\nIn an expansion on February 27, 12 federal ministers and nine ministers of state were sworn in by President Asif Ali Zardari.\nIn addition, three advisers and four special assistants to the prime minister (SAPM) were also inducted.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:25:57.333Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/federal-govt-allocates-portfolios-to-newly-inducted-cabinet-members/",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T15:52:00.000Z"
}
