{
  "title": "British High Commission honors young climate storytellers on Commonwealth Day",
  "author": null,
  "content": "ISLAMABAD, Mar 07 (APP): The British High Commission hosted a special ceremony to celebrate young climate storytellers on the occasion of Commonwealth Day 2025.\nWinners of the Art for Earth competition showcased their creative talents through art, film, and storytelling, highlighting the impact of climate change and innovative solutions.\nYoung Pakistanis aged 13 to 24 from across the country were invited to participate, sharing their artistic expressions on how climate change affects their lives and communities. Organized in collaboration with the British Council, the competition received over 550 creative submissions, demonstrating the enthusiasm and commitment of youth toward climate awareness.\nTo honor the winners, the British High Commission held a prestigious award ceremony, featuring an exhibition of the winning entries and discussions on youth-led climate action.\nSpeaking at the event, British High Commissioner to Pakistan, Dr. Jane Marriott CMG OBE, while praising the participants’ creativity said: “I have been truly inspired by the extraordinary creativity of these young individuals. They have highlighted the urgency of climate action in the most innovative ways. Pakistan’s youth are full of energy and ideas, and this competition has shown how powerful their voices can be in shaping the climate conversation.”\nOne of the winners, 20-year-old Rooha Arshad, who won in the Climate and Innovation category, emphasized the importance of individual action:\n“It’s easy to hope that new technology will save the planet, but it’s really up to us. We must recognize our responsibility and use the natural resources we already have to tackle the climate crisis.”\nThe competition winners—Khadija Chaudhry, Rahma Muddassir, Gulshan Fatima, Haider Ali, Umaima Zia, and Rooha Arshad—were recognized for their outstanding work in three categories: Climate and Innovation, Climate and Gender, and Climate in My Community.\nCommonwealth Day, celebrated on March 10 across 56 member states, promotes shared values of unity, sustainability, and peace. This year’s theme, “Together We Thrive,” underscores the importance of global cooperation in addressing environmental and social challenges.\nClimate change remains a top priority for the UK in Pakistan. The British government has already helped 1.5 million people enhance their resilience to climate disasters and aims to support an additional 3 million over the next four years. The UK’s Innovative Climate Finance Programme is set to mobilize £420 million in climate investments, primarily from the private sector.\nThe event reaffirmed the UK’s commitment to climate action and showcased the power of young voices in shaping a sustainable future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:26:23.000Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/british-high-commission-honors-young-climate-storytellers-on-commonwealth-day/",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T15:29:00.000Z"
}
