{
  "title": "NA commemorates International Day for PWDs",
  "link": "https://www.app.com.pk/national/na-commemorates-international-day-for-pwds/",
  "date_published": "2021-12-03T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):National Assembly (NA) of Pakistan on Friday commemorated the International Day of Persons with Disabilities (PWDs) in the Parliament House.\nThe International Day of PWDs 2021 is being celebrated on the global theme “Leadership and participation of Persons with Disabilities toward an inclusive, accessible and sustainable post-COVID-19 world” that focuses on the challenges faced by persons with a disability during the COVID-19 pandemic and to ensure their inclusive, accessible, and sustainable future.\nThis event was aimed to raise awareness regarding our responsibilities towards PWDs and bring positive changes in their lives. Moreover, it was also an opportunity to celebrate their achievements and contributions and highlights the importance of the inclusion of vulnerable segments of the society into the mainstream.\nDuring the event, Speaker National Assembly Asad Qaiser launched accessibility of the Parliament House Building and the accessibility of the National Assembly official website for PWDs besides, unveiling the full version of the Braille Constitution of Pakistan.\nThis initiative of Speaker Asad Qaiser will contribute significantly to alleviate the difficulties being faced by PWDs, which will boost their confidence and encourage them to excel in all walks of life.\nThe commemoration of this day in the Parliament was the result of Special initiatives of Speaker National Assembly for the welfare of differently-disabled people and make them productive citizens of the country.\nSpeaker Asad Qaiser is making considerable efforts for bringing new legislation in order to bring long-term reforms for the wellbeing of PWDs.\nIn a message on the occasion of “International Day of Persons with Disabilities” (PWDs) Speaker NA said, that differently disabled people have a lot of potential and energy to contribute to the progress of the country.\nThey are capable to perform all tasks but they need encouragement and assistance to make them viable and productive part of the society. Facilitating the people with Disabilities has been the priority of incumbent government and it is striving hard to provide equal access of education and health and other basic facilities to them.\nOn the directions of the Speaker, a Special Committee on PWDs has been formulated which is making remarkable progress by suggesting and recommending policy measures in providing fundamental facilities to differently-disabled people.\nThe Committee is working constructively to ensure that every person with a disability shall have an equal opportunity to participate in all spheres of life without any discrimination.\nThe event was also attended by MNA/Champion Commonwealth Parliamentarians with Disabilities Zille Huma and Emerging Leader on Disability Inclusion Ms. Zala Qaiser.\nExecutive Director Special Talent Exchange Program (STEP) Muhammad Atif Sheikh and Country Representative United Nations Population Fund (UNFPA) Dr. Bahktior Kadirov would also address the event. A special documentary regarding initiatives for socio-economic inclusion of PWDs by Speaker National Assembly Asad Qaiser would also be displayed.\nParliamentarians, Intelligentsia, Media Representatives would also participate in the event. The event will be attended by members of Parliament, representatives of charitable and welfare organizations and civil society.",
  "retrievedAt": "2025-08-11T21:40:56.948Z"
}
