{
  "title": "PM praises provinces, districts, polio workers on efforts for eradication of polio",
  "link": "https://www.app.com.pk/national/pm-praises-provinces-districts-polio-workers-on-efforts-for-eradication-of-polio/",
  "date_published": "2021-12-03T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): Prime Minister Imran Khan on Friday highly appreciated the provinces, district administrations as well as the polio workers for the hard work and efforts for the eradication of polio from the country.\n“I highly appreciate the hard work done by Provincial Chief Secretaries and Deputy Commissioners for Polio eradication”, he said while addressing a meeting held here to review arrangements for the upcoming polio eradication campaign.\nThe Prime Minister also appreciated the efforts made by workers of polio eradication teams who reach out to children in far-flung and hard areas of the country.\nHe said that these workers are performing a national service and deserve special appreciation.\nThe Prime Minister directed his Special Assistant on Health Services to come up with a rewards’ plan for best performing polio workers.\nHe emphasized that low-transmission season was a crucial stage and they all have to act against polio with “killer instincts”.\nHe directed the Provincial Chief Secretaries and Deputy Commissioners to sustain the Polio Eradication drive with the same vigor and focus.\nThe Prime Minister directed the district governments to take responsibility to initiate deterrent legal action in cases of harassment or attacks on polio workers.\nHe reiterated upon synergizing routine immunizations with the Anti-Polio campaigns.\nThe Prime Minister also emphasized on maximizing efforts for COVID-19 vaccinations as a proactive measure against the spread of new variant Omicron.\nEarlier, the meeting was informed that Southern Districts of Khyber Pakhtunkhwa, Districts of Balochistan including Quetta, Qila Abdullah & Pishin and Districts of Sindh including Hyderabad and Karachi were most vulnerable for the spread of polio virus through sewage and water.\nIt was also informed that international organizations were acknowledging the effective efforts of the Government of Pakistan against COVID-19 and Polio.\nThe meeting was attended by Special Assistance to PM Dr. Faisal Sultan, Parliamentary Secretary for Health Dr. Nausheen Hamid and senior officials.\nChief Secretaries of Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan and Deputy Commissioners of more than 30 districts attended the meeting via video link.",
  "retrievedAt": "2025-08-11T21:40:57.680Z"
}
