{
  "title": "PM for relocation of industries out of cities; promotion of electric vehicles",
  "link": "https://www.app.com.pk/national/pm-for-relocation-of-industries-out-of-cities-promotion-of-electric-vehicles/",
  "date_published": "2021-12-03T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): Prime Minister Imran Khan Friday directed the federal and provincial governments to get major industrial units like brick kilns and steel furnaces relocated outside the cities with effective restrictions.\nThe prime minister, chairing a meeting on pollution-related issues in the country, also called for incentivizing the use of quality fuel and gradual replacement of vehicles with electric vehicles (EV).\nHe mentioned how developed countries had shifted to modern technology including conversion of public transport to electric vehicles (EV).\nHe directed that the new buses for all metros in the country should be electric vehicles.\nHe said the pollution was a silent killer but environmental protection had never been a priority of the past governments. Now there is no more room for negligence,” he remarked.\nThe prime minister underlined the importance of saving our big cities from pollution as it has a huge social and economic costs.\n“We must incentivise the industry for shifting their units out of the city and the use of modern technology for environment safety,” he added.\nThe prime minister directed the Punjab Government to adopt a comprehensive smog control policy at the earliest.\nHe directed the federal government and provincial governments of Punjab and KP to immediately work on a short, medium and long term comprehensive plan for forward-looking policies with the timelines for implementation.\nEarlier, the prime minister was briefed that vehicles, industrial units, burning of waste material and burning of crops were the major sources of air pollution.\nThe prime minister also stressed the need of dialogue with regional countries to protect the environment through collective efforts.\n“We should also take all steps to increase the green cover of our cities through Miyawaki forest technique,” he added.\nThe prime minister also highlighted the importance of a massive public awareness campaign to bring behavioral change in people for environmental protection.\nThe meeting was attended by SAPM on Climate Change Malik Amin Aslam, Minister of State on Information and Broadcasting Farrukh Habib, KP Chief Minister Mahmood Khan and senior officers concerned. Chief Minister of Punjab Sardar Usman Buzdar joined the meeting via video link.",
  "retrievedAt": "2025-08-11T21:40:54.549Z"
}
