{
  "title": "Disabled persons deserve the right to be mainstreamed in education, jobs: President",
  "link": "https://www.app.com.pk/national/disabled-persons-deserve-the-right-to-be-mainstreamed-in-education-jobs-president/",
  "date_published": "2021-12-03T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): President Dr Arif Alvi on Friday said the persons with disabilities deserved access to all opportunities in society, particularly mainstreaming in education and employment.\nAddressing at the event marking International Day of Persons with Disabilities here at the Aiwan-e-Sadr, the president said offering an inclusive and accommodating environment to such persons was the collective responsibility of the State and society.\nBegum Samina Alvi, representatives of organizations working for disabled persons and and a large number of children with physical and mental impairments attended the event themed ‘Leadership and participation of persons with disabilities towards an inclusive, accessible and sustainable post COVID-19 world’.\nPresident Alvi said persons with disabilities needed utmost care and a welcoming attitude, beginning right from their homes and families to the schools and places of work.\nHe said among the four categories of disabilities – visual, hearing, wheel-chair bound and mental, the persons with either of the first three impairments had the same intellectual capacity as normal people and needed the opportunity to study in the mainstream educational system.\nAt workplace, he said, there was a need to build an effective system to support such employees including fulfillment of job quota, incentives, and special job descriptions as per needs.\nThe president emphasized giving practical skill-set to persons with disabilities to ensure their financial self-reliance.\nThis is not a matter of charity, but the empowerment of persons with disabilities, he said, adding that Pakistan needs to develop an inclusive culture that accommodates such persons in all spheres of\nDr Alvi said around 400,000 disabled persons got themselves registered under Prime Minister Imran Khan’s initiative of socio-welfare assistance for two million such persons, thus needing an effective awareness among the masses.\nHe said the government required the commitment of the society to ensure a better place for persons with disabilities and offer them an environment conducive to their mobility, learning, and work needs.\nLater, President Alvi interacted with the children with disabilities and appreciated their performances including songs, dances, and tableaus presented before the audience.\nFederal Minister for Human Rights Dr Shireen Mazari said the day for persons with disabilities was commemorated the world over including Pakistan calling the need to provide them an enabling environment as equal citizens.\nShe said the government of Pakistan Tehreek-e-Insaf had proudly formulated a legal framework to ensure the rights of persons with disabilities.\nShe mentioned that by next month, a list of departments not fulfilling the job quota of disabled persons would be sent to the Prime Minister Office seeking penalty against them.\nShe said her ministry had launched a special mobile application as a platform for parents of disabled children to get information about centres pertaining to physiotherapy, artificial limbs, and others. Also, a one-window facility has already been established at Chak Shahzad, Islamabad to facilitate disabled persons.\nShe said the Phoenix Braille system as a pilot project had been set up at higher education level as an assistance mode for visually impaired in research and writing. Work is underway to mainstream the children with minor disabilities at public and private schools, she added.\nFor the next census, she mentioned that two questions based on Washington queries had been forwarded to Planning Commission for the better data collection on persons with disabilities.\nSyed Muhammad Ali Shah, head of German non-governmental organization CBM in Pakistan said the organization was contributing to the society in ensuring that persons with disabilities were taken on board as their due right.\nA group of children with disabilities clad in white robes and Rumi caps presented the dance of ‘whirling dervishes’ to the tune of Sufi music. Other children presented a tableau on the country’s folk songs, which was highly applauded.",
  "retrievedAt": "2025-08-11T21:40:51.385Z"
}
