{
  "title": "Committee expresses concerns over biometric verification issues in Ehsaas programmes",
  "link": "https://www.app.com.pk/national/committee-expresses-concerns-over-biometric-verification-issues-in-ehsaas-programmes/",
  "date_published": "2021-12-03T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):The members of the Senate Standing Committee on Poverty Alleviation and Social Protection Friday expressed their concerns over the biometric verification issues which were being faced by the beneficiaries of Ehsaas programmes.\nHowever, the committee was assured that all-out efforts were being made to address the issue and ensure ease of operations.\nIt was revealed that less than seven percent of beneficiaries faced the biometric problem and were given 16 attempts before being referred back. Transactions for such cases were routed through banks. Keeping in view similar issues a long term plan is being formulated.\nDuring the meeting held under the chairmanship of Senator Naseebullah Bazai, the committee was briefed about various programmes being administered under the Ehsaas Emergency Cash Programme and the Benazir Income Support Programme and measures taken to ensure transparency of the programmes.&nbsp;\nIt was stressed that the objective of these programmes was to address on-ground core issues related to human development.&nbsp;  Regarding disbursement of funds; the committee was informed that initially the NFC formula was being used. However, now disbursements are made on account of the poverty index as per data of the National Socio-economic Survey.\nRegarding Federal and Provincial share in the budget, the committee was informed the Federal Government has allocated 35 percent for the programme and 65 percent responsibility is to be shouldered by the provinces.&nbsp;  Regarding filters and the risk of exclusion of the deserving, the committee was informed that since funds were limited, screening was mandatory to ensure that those in most need were not left out.&nbsp;\nFilters have been relaxed for the Ehsaas Rashan Programme for which registrations are currently on-going on the website.&nbsp; The Ehsaas Kafalat Programme of BISP was initiated in 2008.\nThe Committee was informed that currently per beneficiary is being paid Rs 2000 a month.&nbsp;Target is to enhance number of Kafaalat beneficiaries to 8 million by 2022.&nbsp; Meanwhile, Rs1104 billion has been disbursed since the inception of the programme.&nbsp;\nThe Ehsaas Taleemi Wazaif Programme was introduced to encourage enrollment and control dropout rates amongst disadvantaged communities.&nbsp;Children of active Ehsaas Kafaalat Programme beneficiaries are eligible and are given Rs 2500 for boys and Rs 3000 for girls.&nbsp;Disbursement of Rs 19.38 billion to 4.15 million children has been made thus far.\nThe Ehsaas Nashonuma Programme has been introduced to tackle malnutrition in children. All Kafaalat Programme beneficiaries with children from 6 to 23 months are benefitting from unconditional cash transfers.&nbsp;The programme is operational in 14 districts.&nbsp; The Ehsaas Undergraduate Scholarship Programme envisages providing merit and need-based scholarships over 4-5 years of under-graduate education.\nIt comprises tuition fees and stipend to cover living costs.&nbsp;As many as 50 percent of these scholarships are reserved for women. HEC is the executing agency of this programme.&nbsp; The Committee was informed of up gradation of all field offices to Ehsaas One Window Programme to enable delivery of the multiple Ehsaas Programmes through one window approach.\n&nbsp;It is expected that 469 Ehsaas One Window Centers shall be established across the country.&nbsp;The Committee was invited to visit one such Center in Islamabad.&nbsp; Special Assistant to the Prime Minister of Pakistan on Poverty Alleviation and Social Protection, Dr. Sania Nishtar was also present.\nThe meeting was attended by Senator Seeme Ezdi, Senator Keshoo Bai, Senator Molvi Faiz Muhammad and senior officers of the Ministry of Poverty Alleviation and Social Safety Division along with all concerned.",
  "retrievedAt": "2025-08-11T21:40:58.835Z"
}
