{
  "title": "TikTok launches guide to combat misinformation during monsoon floods in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP):TikTok has announced the launch of a new search guide designed to help users in Pakistan access authoritative and up-to-date information during the ongoing monsoon flood season.\nAs part of TikTok’s continued efforts to promote safety and factual awareness on its platform, the guide will provide verified information to counter misinformation trends surrounding natural disasters, said a news release.\nUsers searching for flood-related updates on TikTok will now see a prominent banner urging them to verify information through credible sources.\nThis guide connects users directly with the National Disaster Management Authority (NDMA), from where users in Pakistan can access verified information regarding natural disasters.\nThe guide also connects users to TikTok’s Safety Centre resources. It provides a direct link to TikTok’s Tragic Event Support guide, which offers practical support for individuals affected by distressing incidents.\nThe guide defines what constitutes a tragic event, ranging from natural disasters to personal loss, and provides users with information on seeking mental health support and responsibly sharing or reporting content related to such events.\n“We understand that during times of crisis, access to timely and accurate information is critical,” said Fahad Muhammad Khan Niazi, Head of Public Policy and Government Relations, Pakistan, at TikTok. “By partnering with organisations that work directly with disaster response and making these resources more visible to our community, we aim to support informed decision-making and ensure user safety.”\nThis launch builds on TikTok’s broader goals of elevating credible information and creating a safer digital environment for its community. By integrating these tools directly into the user experience, TikTok continues to empower its community with meaningful support and trustworthy information.\nThe platform remains committed to fostering a space where people can stay informed, care for their well-being, and engage responsibly during moments that matter most.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:19:05.229Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/tiktok-launches-guide-to-combat-misinformation-during-monsoon-floods-in-pakistan/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T13:38:00.000Z"
}
