{
  "title": "Pakistan, China reaffirm parliamentary ties, boost CPEC cooperation at global summit",
  "author": null,
  "content": "GENEVA, Jul 29 (APP):National Assembly Speaker Sardar Ayaz Sadiq and Chairman of China’s National People’s Congress (NPC) Standing Committee Zhao Leji reaffirmed historic bilateral ties, strengthened parliamentary diplomacy, and pledged to deepen cooperation under the China-Pakistan Economic Corridor (CPEC).\nDuring a meeting on the sidelines of the Global Speakers’ Summit in Geneva, organized by the Inter-Parliamentary Union (IPU) in collaboration with the United Nations from July 29 to 31, 2025, Speaker Sardar Ayaz Sadiq stated that the time-tested and deep-rooted ties between Pakistan and China, underscore the historic tradition of close and friendly exchanges between the parliaments of both countries.\nHe also appreciated the pivotal role of Chairman Zhao Leji in promoting sustained parliamentary cooperation and high-level engagements between the National Assembly of Pakistan and the National People’s Congress.\nBoth sides acknowledged the active and constructive contributions of the Pakistan-China Parliamentary Friendship Group in the National Assembly and the NPC in fostering stronger parliamentary linkages and consolidating the bilateral All-Weather Strategic Cooperative Partnership. Furthermore, Speaker Sardar Ayaz Sadiq said that Pakistan-China relations encompass multifaceted collaboration across a wide range of sectors, including defence, finance, trade, investment, and people-to-people contacts. He reiterated Pakistan’s unwavering commitment to the successful implementation of the China-Pakistan Economic Corridor (CPEC), the flagship project of the Belt and Road Initiative (BRI), and expressed Pakistan’s resolve to enhance CPEC cooperation in key priority sectors such as mining, industry, agriculture, information technology, and green energy.\nThe two dignitaries emphasized the importance of coordinated parliamentary diplomacy in promoting peace, development, and multilateral cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:19:53.103Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-china-reaffirm-parliamentary-ties-boost-cpec-cooperation-at-global-summit/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T11:57:00.000Z"
}
