{
  "title": "Chairperson BISP unveils launch of new payment system for beneficiaries",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP):Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid, has announced a landmark initiative to open personal bank accounts for beneficiary women across Pakistan, aimed at ensuring the transparent, efficient, and dignified delivery of financial assistance.\nAddressing senior journalists at the BISP Headquarters, Senator Rubina said that under the pilot phase of the new payment system, being launched on August 13, the bank accounts of beneficiaries are being opened in major cities including Karachi, Lahore, Quetta, Gilgit, Muzaffarabad, and Peshawar.\nThese accounts will allow women to access funds independently, and efforts are underway to introduce digital wallet options in the near future.\nIn response to a question about fraudulent SMS messages targeting BISP beneficiaries, the Chairperson said the organization is actively raising awareness through social media and other platforms. “We are encouraging beneficiaries to report such incidents so that action can be taken against the culprits. We are also in discussions with PTCL, FIA and other stakeholders to take legal and technical measures against these fraudulent platforms,” she added.\nHighlighting BISP’s commitment to long-term empowerment, Senator Rubina recalled that on June 21 — the birth anniversary of Shaheed Mohtarma Benazir Bhutto — President Asif Ali Zardari launched the Benazir Hunarmand Program.\nThis initiative will provide technical and vocational training to BISP beneficiaries and their family members, aligned with international standards, to equip them with market-relevant skills and help them achieve self-reliance.\nShe stressed that Pakistan is rich in human resources, and there is an urgent need to transform this potential into an asset. “We are working with NAVTTC and other partners under the Hunarmand Program.\nGlobally, there is high demand for skilled labor — for instance, Germany alone currently needs 400,000 skilled workers — and many other countries are also seeking qualified human capital.\nThese training courses will be certified to international standards, enabling our people not just to support their families but also to contribute to the national economy through remittances,” she said.\nTo a question, she said “We have launched a system where every family is required to undergo re-certification every three years. If a beneficiary’s circumstances improve, they will graduate from the program and exit after attaining self-sufficiency,” she explained. This system has been in place since June 2025.\nThe Hunarmand Program, she added, also forms a key component of the exit strategy for BISP beneficiaries.\nSenator Rubina acknowledged the support of NAVTTC, provincial TEVTAs, the Ministry of Overseas Pakistanis, and the Friends of BISP platform in implementing this transformative vision. “This program represents the future of Pakistan and offers a pathway to prosperity for countless deserving families,” she said.\nTerming BISP a globally recognized social protection model, she shared that international delegations visited Pakistan last year to study the program, intending to replicate similar systems in their own countries — a source of pride for Pakistan.\nShe reiterated that the program’s hallmark-recognizing the housewife as the head of the household and requiring a valid CNIC for enrollment-reflects President Zardari’s progressive vision that has empowered millions of women and formally included them in national records.\nCurrently, around 10 million families are benefiting from BISP. The Benazir Nashonuma Program addresses the health and nutrition needs of pregnant women and young children, and has contributed to a 6.5 percent reduction in stunting across the country.\nUnder the Benazir Taleemi Wazaif initiative, stipends are being provided from primary to higher secondary school levels, based on 70% attendance. Recently, several brilliant students from Multan — beneficiaries of the program — secured top positions in matriculation exams.\nTo enhance accessibility, Senator Rubina announced that Dynamic Registry Centers have been established across all tehsils to allow eligible families to register on a walk-in basis.\nStrongly refuting claims that BISP encourages dependency, she stated, “This is not charity. It is structured income support aimed at narrowing the gap between income and basic household needs.”\nShe assured that public complaints, including those highlighted through media channels, are taken seriously and addressed promptly.\nShe concluded by emphasizing the need to raise awareness among deserving women regarding their rights and entitlements under the program.\nThe press conference ended with journalists congratulating Senator Rubina Khalid on her third term in the Senate, followed by a cake-cutting ceremony held in her honor.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:18:49.663Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairperson-bisp-unveils-launch-of-new-payment-system-for-beneficiaries/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T14:24:00.000Z"
}
