{
  "title": "NSU hosts book launch ceremony for Author/Publisher Imran Ghaznavi",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP):National Skills University (NSU) hosted a book launch ceremony for author and publisher Imran Ghaznavi’s book titled “Reputation Management and Crisis Communication: A Study of the Corporate Sector” here on Tuesday.\nEsteemed guests included the Advisor to the Prime Minister on Privatization, Muhammad Ali, President of Institute of Cost and Management Accountants of Pakistan (ICMAP) Shehzad Ahmed Malik and renowned economist and public policy expert Dr Vaqar Ahmed, among the others.\nAmbassadors, senior bureaucrats, corporate leaders, regulators, academicians, Faculty members, students and media professionals were also in attendance.\nIn his address, renowned economist and public policy expert Dr Vaqar Ahmed said that the book covers an entire field of knowledge that needs to be taught. He emphasized that the book highlights how credibility carries premium value and pointed out key chapters that explain how crisis communication is practiced and how reputation is managed in the digital age.\n“The book offers many valuable lessons for both the public and corporate sectors,” he added. He congratulated the author, Imran Ghaznavi, for this valuable contribution.\nIn his remarks, Shehzad Ahmed Malik, President, Institute of Cost and Management Accountants of Pakistan (ICMAP) said, “This book is a timely and much-needed contribution by Imran Ghaznavi.” He noted with concern that reputation has become an increasingly intangible yet critical asset in modern times.\nShehzad Ahmed Malik also congratulated Imran Ghaznavi for his meaningful and significant work.\nIn his address, Imran Ghaznavi — Senior Executive Director at OGRA, Corporate and Media Affairs, and the book’s author and publisher — shared that the book offers a practical and comprehensive roadmap for corporate leaders, communication professionals, and decision-makers to master the art and science of managing reputation in a volatile, fast-paced environment.\n“Through my book, I have tried to explain the do’s and don’ts of reputation risk management and crisis communication,” he added.\nImran Ghaznavi expressed his gratitude to the distinguished guests, faculty members, and all attendees for taking the time to grace the event.\nAt the conclusion of the ceremony, Imran Ghaznavi presented copies of his book to all the distinguished guests. The Vice Chancellor of National Skills University, Prof Dr Muhammad Mukhtar, also presented a shield to the Advisor to the Prime Minister on Privatization, Muhammad Ali.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:20:14.552Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nsu-hosts-book-launch-ceremony-for-author-publisher-imran-ghaznavi/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T11:08:00.000Z"
}
