{
  "title": "Miani Hor declared third Marine Protected Area in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP):WWF-Pakistan appreciated the Government of Balochistan for declaring Miani Hor as the third Marine Protected Area (MPA) in Pakistan.\nThe Provincial Cabinet of Balochistan in its meeting held on Tuesday, approved the declaration of Miani Hor as Marine Protected Area along the coast of Balochistan, said a press release issued here.\nPreviously, the Government of Balochistan had declared Astola Island as the first MPA in 2017 and Churna Island as the second Marine Protected Area in 2024, as these are known to be biodiversity hotspots and main coral habitats along the coast of Pakistan. Miani Hor is among the few locations where mangrove forests are thriving. It is the only place in Pakistan that has natural strands of three species of mangroves. It is also considered an important fishing ground where a large number of fishermen are based, and their livelihood is dependent on fishing and ancillary industries.\nMiani Hor is the largest lagoon, which is located in Lasbela District and is one of the important areas known for its diversified marine life. Two ephemeral rivers, Windar and Titian discharge in the area; however, the lagoon is known for its oceanic habitat with extremely fast current. Because of the variety of bird species found in the Maini Hor, it was declared as a Ramsar Site in May 2001. This designation recognizes its importance as a wetland of international significance. The mangrove forest, which is widely spread in the Miani Hor, was declared a Protected Forest by the Government of Balochistan in September 2022. The marine ecosystem and diverse wildlife inhabiting Miani Hor are under serious threat due to many factors, including uncontrolled fishing, hunting of birds, and climate change. WWF-Pakistan believes that the declaration of Miani Hor as an MPA is an important step towards ensuring that the fragile ecosystem of the area is protected.\nWWF-Pakistan appreciated the efforts of the Government of Balochistan and lauded the role of Abdul Fatah Bhangar, Secretary, Forest and Wildlife Department and Sharifuddin Baloch, Chief Conservator, Wildlife, for their proactive role in getting Miani Hor as a MPA.\nPakistan is a signatory to the Convention on Biological Diversity, and according to its Kunming-Montreal Global Biodiversity Framework, it is required that states should declare 30 % of the ocean area as a protected area by 2030, called 30 x 30.  The Declaration of the Miani Hor as an MPA will be an important step to achieve this target.\nCommenting on this declaration, Rab Nawaz, Senior Director, WWF-Pakistan appealed to both federal and maritime provincial governments to take decisive actions to achieve the target of 30 x 30 by following the footsteps of the Government of Balochistan and declaring additional MPAs in Pakistan. Nawaz further said that because of various human activities and climate change, we are losing our marine resources. “This initiative will help reverse the damage caused to the marine ecosystem and will protect the marine life for future generations”, he added\nMuhammad Moazzam Khan, Technical Advisor, WWF-Pakistan, pointed out that Miani Hor is a biodiversity hotspot known for its diversified marine life, including 200 species of fish, 90 species of birds, 3 species of dolphins, as well as many invertebrates and vertebrates. It is an important bird habitat for both migratory and resident birds. Migratory species such as great white pelican, Dalmatian pelican, greater flamingo, Demoiselle and common cranes, great egret, great black-headed gull, shikra, Egyptian vulture, osprey and peregrine falcon are known to be important bird species found in the Miani. The declaration of Miani Hor as an MPA will address the challenge of biodiversity loss and help protect the threatened species reported from this area. Khan appreciated the contribution of the coastal community, IUCN and other stakeholders in their contribution to the declaration of a Marine Protected Area at Miani Hor.\nIn addition to fisheries, ecotourism is getting popular in the Miani Hor area. A large number of people now visit Miani Hor for dolphin watch, picnic, sand-dune safari, bird watching, and sport fishing. Ecotourism activities, which were started by WWF-Pakistan about 20 years back, have now evolved into an alternate source of income for the coastal communities. Khan considers that the declaration of the Maini Hor as MPA will further help in the promotion of ecotourism in the area, which will help in improving the socio-economic condition of coastal communities living around Miani Hor.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:19:29.427Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/miani-hor-declared-third-marine-protected-area-in-pakistan/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T12:58:00.000Z"
}
