{
  "title": "PM Shehbaz lauds Pakistan-Kyrgyzstan accords, progress in cooperation",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP): A high-level delegation from the Kyrgyz Republic, led by Deputy Chairman of the Cabinet of Ministers Edil Baisalov called on Prime Minister Muhammad Shehbaz Sharif here on Tuesday.\nThe delegation is in Pakistan to participate in the 5th Session of the Pakistan-Kyrgyzstan Joint Intergovernmental Commission (IGC), aimed at strengthening bilateral cooperation across multiple sectors, according to a PM Office press release.\nPrime Minister Shehbaz welcomed the delegation and expressed satisfaction over the successful convening of the 5th IGC session.\nHe appreciated the signing of the protocol and several Memoranda of Understanding (MoUs) between the two sides, calling them important steps towards enhancing trade, energy, collaboration, connectivity, and people-to-people exchanges.\nThe prime minister reiterated Pakistan’s strong commitment to implementing the decisions taken during the IGC and stressed the importance of the timely follow-up to translate the agreements into tangible outcomes.\nThe Kyrgyz side appreciated the efforts of the Government of Pakistan in fostering closer bilateral ties and expressed confidence that the outcomes of the IGC would lead to deeper and more result-oriented cooperation.\nBoth sides reaffirmed their resolve to work closely for the mutual benefit of their peoples and to continue engaging at all levels for stronger Pakistan-Kyrgyzstan relations.\nIshtiaq Ahmed, APP’s Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications – Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:20:12.849Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-shehbaz-lauds-pakistan-kyrgyzstan-accords-progress-in-cooperation/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T06:44:00.000Z"
}
