{
  "title": "Pakistan, WHO sign agreement for free Children cancer medicines",
  "author": null,
  "content": "ISLAMABAD, Jul 29 (APP): Pakistan has signed a landmark agreement with the World Health Organization (WHO) to provide free cancer medicines to children across the country.The agreement, formalized through a Letter of Agreement (LoA), marks Pakistan’s inclusion in the Global Platform for Access to Childhood Cancer Medicines (GCCM), a WHO led initiative to expand access to life-saving cancer treatments for children in low- and middle-income countries.\nAddressing the signing ceremony, Federal Minister for Health, Syed Mustafa Kamal also inaugurated the National Cholera Control Plan 2025–2028 on the occasion.\nHe emphasized the urgent need to focus on preventive healthcare to reduce the country’s disease burden.\nThe Minister announced that under this agreement, Pakistan will receive essential cancer medicines every year, benefiting approximately 8,000 children who are diagnosed with cancer annually in the country.\n“The goal is simple but profound to save lives,” said Minister Kamal. “Currently, the survival rate for children with cancer in our region stands at just 30%. Through this agreement, we aim to increase that to 60% by ensuring timely access to quality treatment.”\nHe emphasized that WHO will provide technical and operational support to the initiative, while UNICEF will take on the responsibility of procuring and supplying the medicines to Pakistan.\nThe Minister expressed appreciation for both organizations and all partners involved, including the GCCM, for their support and commitment.\nMinister Kamal also spoke about the broader challenges facing Pakistan’s health system. “This is not just about cancer. Our health system is under pressure.”\nHe said, “Every year, 11,000 women die during pregnancy, 43% of our children suffer from malnutrition, and with a birth rate of 3.6, we are pushing our resources to the brink,” he stated.\nHe underscored that healthcare should not be confined to hospital walls. “Real healthcare begins outside hospitals in clean water, proper sanitation, preventive action, and community awareness.\n“If we continue to focus only on treatment, we will never overcome the burden of disease.”\nThe Minister highlighted the importance of prevention, especially through routine immunization.\nHe urged parents to take ownership of their children’s health by ensuring they are vaccinated against all 12 vaccine-preventable diseases, including polio.\n“Our vaccination workers are going door to door. It’s time for parents to also step forward and actively seek out vaccinators. No effort is too small when it comes to saving lives.”\nReferring to the event as a milestone, the Health Minister concluded, “Today is a big day for Pakistan. We are not just recipients; we are partners in global efforts to ensure that no child suffers or dies from a treatable disease.”\nHe thanked WHO, UNICEF, the GCCM, and other partner organizations. “Our dream is a healthier society, and that begins with the health of our mothers and children.”\n“No child affected by cancer should die due to lack of access to treatment, including quality-assured medicines.”\nWHO will work side by side with the Ministry of Health and partners to save lives and leave no child behind, no matter where they live or who they are,” said WHO Representative in Pakistan Dr Dapeng Luo.\nHe stated that climate change is increasing the risks of floods and other natural disasters that can trigger cholera outbreaks.\nWithout effective prevention, detection and response, cholera can be a major public health threat, particularly for the most vulnerable who have no access to safe water and sanitation.\nHe said, “WHO is proud to continue to partner with Pakistan in this effort to save lives”.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:17:51.507Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistanwho-sign-agreement-for-free-children-cancer-medicines/",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T15:54:00.000Z"
}
