{
  "title": "PM to address UNGA on Sept 22: FO spokesperson",
  "link": "https://www.app.com.pk/national/pm-to-address-unga-on-sept-22-fo-spokesperson/",
  "date_published": "2023-09-14T14:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar will participate in the high-level debate of the 78th session of the United Nations General Assembly (UNGA) in New York from September 18 to 23.\nForeign Office Spokesperson Mumtaz Zahra Baloch, during her weekly press briefing on Thursday, said the prime minister would address the UNGA on September 22.\n“He will outline Pakistan’s perspective on a range of regional and global issues of concern, including the Jammu and Kashmir dispute which is among the longest standing unresolved items on the UN agenda,” she said.\nThe prime minister would also elaborate the significant measures being taken by the caretaker government to consolidate Pakistan’s economic recovery and efforts to mobilise domestic and external investment, she added.\nThe FO spokesperson said the prime minister would also participate in a summit on the Sustainable Development Goals (SDGs) and other high-level meetings organized under the auspice of the UN General Assembly.\n“These will afford valuable platforms to deliberate on effective measures required at the global level for addressing the most pressing economic and development challenges confronting the Global South in the wake of the COVID pandemic, geo-political contestations and climate change.”\nShe highlighted that on the sidelines of the UNGA session, the prime minister would hold bilateral meetings with counterparts from various countries as well as with the heads of international organizations, philanthropic organizations and corporate leaders.\n“He will also avail of the opportunity to engage with other heads of state and government attending the UNGA session during the various activities organized on the sidelines. The prime minister will also hold interactions with the international media.”\nThe spokesperson said Pakistan saw the United Nations as the most representative and inclusive forum of nation-states. The prime minister’s participation in the General Assembly session is a demonstration of Pakistan’s abiding commitment to multilateralism, with the UN playing a pivotal role in international affairs for promoting peace and prosperity worldwide, she added.\nShe said Caretaker Foreign Minister Jalil Abbas Jilani would also accompany the prime minister.\nWith respect to the foreign minister’s visit to the United Kingdom, the spokesperson said the FM was participating in the 10th Commonwealth Youth Ministers Meeting in London.\n“Pakistan is chairing this forum after three decades. Ministers and delegates from 56 Commonwealth nations are participating in this meeting,” she added.\nIn his various interventions, she said, the foreign minister had presented steps taken by Pakistan in youth development through the Prime Minister’s Youth Programme (PYMP), “which prioritizes empowering marginalized youth, including girls, minorities, and those with disabilities”.\nSpeaking about the situation of women in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) where human rights violations continue unabated, she said women in the IIOJK had frequently been targets of violence and aggression as a means to punish their families and communities for standing up against illegal and forcible Indian occupation.\n“Abduction and harassment of young women during the so-called ‘cordon-and-search operations’ has been used as a punitive tool by the Indian occupation forces to punish entire communities.”\nShe demanded that the human rights violations must end so that the women of IIOJK could live in peace and dignity.\nReplying to a question, the spokesperson said the erstwhile princely state of Jammu and Kashmir was an internationally recognized disputed territory whose final disposition was to be made in accordance with the relevant UN Security Council resolutions and aspirations of the Kashmiri people.\n“It is also an established fact that Azad Jammu and Kashmir and Gilgit-Baltistan, shown in the said Indian map are under Pakistan’s control and part of its official political map pending the final disposition of the Jammu and Kashmir dispute.”\nReplying to another query, she maintained that Pakistan had always stated that connectivity projects were critical for peace and prosperity of the region that was why Pakistan had supported the Belt and Road Initiative, of which the China- Pakistan Economic Corridor was the flagship project.\nAbout the Afghan transit trade, she said Pakistan had been implementing in good faith the agreement between Afghanistan and Pakistan. “We have facilitated our landlocked neighbour in their access to the rest of the world in terms of trade and we will continue to do so. We have also said that there have been some concerns of Pakistan regarding misuse of the transit trade agreement on which we will engage with the Afghan authorities to end these practices.”\nReplying to a question regarding US Ambassador in Pakistan Donald Blome’s visit to Gwadar, she said Gwadar was an important project under CPEC. “We consider it the crown jewel of Pakistan-China cooperation under CPEC. We have welcomed international cooperation under CPEC and investments by third parties. We have also welcomed foreign dignitaries and diplomats to visit Gwadar and see for themselves the potential of Gwadar and how it can be a game changer for prosperity in this region.”\nShe said that Pakistan was concerned about the security threat emanating from Afghanistan. “There have been recent incidents including in Chitral on the September 6, as well as the incident on the border on the same day. We believe that such incidents embolden the terrorists and that is why it is important for the Afghan interim authorities to ensure that Afghan territory is not used to threaten Pakistan.\n“With regards to the opening of borders, I must underline that the closure of the border is temporary. And we will make the decision regarding its opening in view of the developments that take place in the coming days.”",
  "retrievedAt": "2025-08-11T09:37:45.547Z"
}
