{
  "title": "Urgent need for responsible waste management in Capital stressed",
  "link": "https://www.app.com.pk/national/urgent-need-for-responsible-waste-management-in-capital-stressed/",
  "date_published": "2023-09-14T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP): The Institute of Urbanism (IoU) in collaboration with the Royal Academy of Engineering (RAE) in a concerted effort to address the pressing issue of open waste burning and its grave consequences on health and environment organized an engaging workshop titled “Let’s Learn Why Not to Burn” at Punjab College here that convened experts and young students to raise awareness about open waste burning hazards.\nCollege Principal, Shahid Islam, in his welcoming remarks, encouraged students to actively engage in learning and appreciated IoU for their dedicated efforts in organizing the workshop. He extended his full cooperation for the cause and emphasized the vital role educational institutions like Punjab College play in shaping responsible citizens who can drive positive change in society.\nThe workshop featured a lineup of distinguished speakers who delivered compelling insights on the topic.\nIn the opening of the workshop, Tayyaba Pervaiz, as a lead of workshop, addressed the students and emphasized the reasons why open waste burning should be discouraged. She explained that this harmful practice was primarily driven by factors such as inadequate waste management infrastructure and strategies, cultural norms, and financial constraints.\nDuring the workshop, Mohsin Ali, Host, further elaborated on the adverse environmental consequences of open waste burning. He emphasized that this practice has detrimental effects on air quality, ecosystems, soil, and underground water sources. Mohsin explained that the emissions from open waste burning, including particulate matter, fumes, and poisonous gases, contaminate the air, contributing to air pollution.\nDr. Ejaz Ahmad, Senior Research Fellow at IoU, set the stage by providing a comprehensive introduction to the workshop. He shed light on the challenges of rapid urbanization, emphasizing the emerging issues of waste management, water scarcity, and urban mobility. Dr. Ahmad underscored that air pollution, largely fueled by waste burning, results in approximately 6.7 million premature deaths worldwide annually, with 135,000 people affected in Lahore alone.\nAyesha Majid, Program Coordinator at IoU, delved into the environmental footprint of open waste burning, offering key facts and statistics. She revealed that globally, approximately 1 billion tons of solid waste are openly burned each year, with 26% burned at residential levels and 15% at dump sites. Ayesha emphasized that open waste burning is responsible for 11% of global black carbon and contributes to 29% of fine particulate matter (PM2.5). Her presentation highlighted the severity of the issue and the global implications of this unsustainable practice.\nDr. Salman Ali, Medical Officer at Capital Hospital Islamabad, provided a crucial perspective on the hazardous impact of open waste burning on health. Dr. Ali explained that air pollution, caused by solid and liquid particles and various gases, leads to a range of health problems, including respiratory issues, heart diseases, fatigue, and even neurological damage. He described how pollutants like carbon monoxide, sulfur dioxide, and nitrogen oxides harm the body, emphasizing the importance of clean air for good health.\nWasi Haider, representing the Net Zero Team at Renewables First, contributed to the discussion by highlighting innovative approaches to waste management and the role of renewable energy in reducing waste-related emissions. He discussed the potential for transitioning away from open waste burning practices by integrating renewable technologies and emphasized the economic and environmental benefits of such a shift.\nThe workshop also featured a thought-provoking fishbowl discussion session moderated by Ali Jabir, a journalist from All Pakistan Press. The session brought together experts and panelists, including Dr. Ejaz Ahmad, Dr. Salman Ali, Wasi Haider, and Adil Nisar, to explore various dimensions of open waste burning, from socio-cultural influences to the role of youth in eliminating the practice, alternative solutions, economic incentives, and the contribution to Pakistan’s net zero waste target.\nAs the workshop concluded, it left a resounding message: the responsibility for responsible waste management rests on the shoulders of all stakeholders, with the youth playing a pivotal role in driving positive change. The event served as a call to action, urging individuals, communities, and policymakers to work together in pursuit of a cleaner, healthier, and more sustainable future for Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:38:28.658Z"
}
