{
  "title": "UN organizes eight of 12 dialogues about sustainable development in Quetta",
  "link": "https://www.app.com.pk/national/un-organizes-eight-of-12-dialogues-about-sustainable-development-in-quetta/",
  "date_published": "2023-09-14T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP): The United Nations and the district administration on Thursday organised the eighth of a series of 12 dialogues on sustainable development in Quetta aiming to bridge gap between people and government.\nIn total, more than 1,000 local leaders living in 12 major cities across six provinces and territories are discussing the development challenges which they face, and how they impede economic and social progress in their districts. The dialogues are being held in the different languages spoken across Pakistan, said a press released issued here.\n“These dialogues bring the United Nations closer to the people and the local governments that we serve, said Julien Harneis, UN Resident Coordinator in Pakistan. “We are actively listening to their concerns and their ideas. They will work together, and with us, on accelerating progress to bridge inequalities and reduce poverty. We will share their suggestions with the federal Government as we focus on returning to sustainable development.”\nIn Quetta, the discussions focused on four topics chosen by the participants ahead of the event: governance, digital transformation, youth employment and water, sanitation and hygiene (WASH).\nNearly 100 local leaders — women and men, including youth — participated together with senior officials from Quetta, the United Nations Resident Coordinator, and other UN staff.\nThe 12 dialogues engage local leaders around development issues such as access to basic social services; gender equality and women’s empowerment; climate change; sustainable, inclusive economic growth and decent work; and basic social services. All are key to Pakistan’s progress towards the achievement of the global Sustainable Development Goals (SDGs).\nSeven SDG dialogues have already taken place in Bahawalpur, Multan and Rawalpindi, Punjab; Hyderabad and Sukkur, Sindh; and in Mardan and Mansehra, Khyber Pakhtunkhwa.\nThe dialogues will help inform discussions ahead of the global SDG Summit which the UN is organizing to accelerate progress towards the SDGs, halfway of the 2030 deadline. The Government of Pakistan will participate in the event in New York on 18 and 19 September 2023.\nThe SDGs, also known as Global Goals, are 17 objectives designed to help bring about peace and prosperity for people all over the world. They are an urgent call for action by all countries to work together towards ending poverty while improving health and education, reducing inequality, spurring economic growth and tackling climate change.",
  "retrievedAt": "2025-08-11T09:37:49.780Z"
}
