{
  "title": "No confirmed coronavirus case reported yet: NIH",
  "link": "https://www.app.com.pk/national/no-confirmed-coronavirus-case-reported-yet-nih/",
  "date_published": "2020-01-27T01:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):National Institute of Health (NIH) on Monday said there is no any case of coronavirus in Pakistan yet declaring one suspected case is admitted in isolation in Multan whose clinical condition is stable and not seems to be a case of coronavirus and his relevant samples have been taken.\nMeanwhile, chairing a meeting Special Assistant to Prime Minister on Health Dr Zafar Mirza said there is no report of any confirmed coronavirus case from any part of the country.\nHe said the reports about cases in Multan are inaccurate and utmost vigilance is being maintained and an emergency operation cell at the Federal Health Ministry is monitoring the situation round the clock.\nHe said as per standard guidelines and procedure any traveler from China having flu-like symptoms has to be isolated and monitored. The patients being referred to have no serious symptoms are responding to treatment and improving.\n“Let me assure the people that the government is closely monitoring the situation and all necessary measures are being taken to screen all travelers from China and providing hospital-care where required.”\nHe said thermos scanners and thermo guns have been provided to the well trained health staff at airports in Karachi, Lahore and Islamabad to screen all passengers.\nSeparately, a special dedicated team is assigned for screening passengers arriving via flights from China. However, China has closed its outbound direct flights to Pakistan due to Chinese spring festival.\nAccording to the current schedule South China Airline flights will resume from January 29, and China Airlines flights will resume from February 3.\nHe said instructions have been given to all major hospitals to make arrangements to receive possible cases and provide them necessary care.\n“We have established contact with all provincial chief ministers, provincial health departments and relevant ministries including interior dealing with Immigration, Aviation Division and National Disaster Management Authority (NDMA) to ensure there is seamless coordination and that our efforts are synergized, timely and effective.”\n“I am personally monitoring the situation and we are meeting every 48 hours with heads of hospitals, health institutions and all relevant departments to review the situation and take necessary measures for optimal level of preparedness and mitigation in the event we have a suspected case. We are establishing a helpline to be functional from Wednesday for information on the disease and to respond to queries.”\nHe said there is absolutely no cause for panic or alarm. People need to take simple precautions for prevention against common flu like covering the nose and mouth while coughing and sneezing, frequent hand washing for 20 seconds with soap, avoiding close contact with sick people, animals, touching eyes, nose and mouth with unwashed hands, he added.\nHe said those who have or a person near them have traveled to or from China, within the last 14 days and developed suggestive symptoms including unexplained fever, cough or breathing difficulty, should seek medical attention.\nHe said coronavirus is a new respiratory virus first identified in Wuhan, Hebei province of China. The facility to confirm the new virus through a laboratory test is only available in a few countries of the world.\nHowever, the National Institute of Health (NIH) in Islamabad is fully equipped to isolate coronavirus and thus the virus can be confirmed by excluding other types of coronavirus.\n“We are in touch with Chinese authorities and kits to test for Novel Coronavirus will be received in a few days.”\nHe said Novel coronavirus (2019-nCoV) with animal origin identified as the cause of this outbreak has to date caused at least 2000 cases and 56 deaths in China.",
  "retrievedAt": "2025-08-11T18:42:08.121Z"
}
