{
  "title": "Science and Technology departments to be restructured soon:Fawad Chaudhry",
  "link": "https://www.app.com.pk/national/science-and-technology-departments-to-be-restructured-soonfawad-chaudhry/",
  "date_published": "2020-01-27T00:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Monday said the process of restructuring of different departments working under his ministry would start soon to improve their working.\n“The process of restructuring of his ministry has been completed and now the focus will be on restructuring the subsidiaries”, the minister revealed during a meeting of National Assembly Standing Committee on Science and Technology held here.\nThe meeting was chaired by Member National Assembly, Sajid Mehdi at the Pakistan Council for Science and Technology (PCST).\nThe meeting discussed the National Institute of Oceanography and Pakistan Standard and Quality Control Authority amendment bill in detail.\nThe committee expressed annoyance over absence of the members who proposed these amendment bills.\nFawad Chaudhry said Members National Assembly Fakhr Imam and Riaz Fatyana proposed more than 300 amendments to ministries’ rules.\nHowever members of the government have not consulted with the relevant ministries before proposing the amendments. How the rules related to the ministries could be formed in the Parliament, the minister questioned.\nThe job of the Parliament is Legislature not rules making. Forming rules was the job of the concerned ministry, he added.\nFederal Secretary Science and Technology, Naseem Nawaz disclosed to standing committee that there was no single laboratory to build solar cells in the country.\nHe told that there was no duty on importing solar panels however duty had been imposed on import of solar cells, he added.\nSolar panels manufactured in Pakistan are expensive.\nHe said that Pakistan did not have quality control system for electronics and could not even check the quality of the refrigerator, Naseem Nawaz said.\n“Pakistan will set up first electronics laboratory in 2024 to check quality of electronics and will lack this ability till the time. There is also dearth of artificial intelligence,” he pointed out.\nThe government departments were reluctant to use products made by the Ministry of Science and Technology, he lamented.\nThe ministry has made street lights for Chashma Barrage which were not utilized by any department.\nHowever, nanotechnology filter developed by the ministry was taken by the UNDP, he added.\nBesides MNAs , a large number of officials attended the meeting.",
  "retrievedAt": "2025-08-11T18:42:09.356Z"
}
