{
  "title": "Govt taking initiatives to bring back industry shifted abroad: Firdous",
  "link": "https://www.app.com.pk/national/govt-taking-initiatives-to-bring-back-industry-shifted-abroad-firdous/",
  "date_published": "2020-01-27T07:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Special Assistant to the Prime Minister on Information and Broadcasting (SAPM) Dr Firdous Ashiq Awan on Monday said Prime Minister Imran Khan was taking initiatives to bring back the industry shifted abroad.\n“The prime minister and his economic team have been taking serious steps to revive the economy. With the restoration of peace, the trust deficit of the business community, which used to be at the mercy of terrorists and extortionists, has been removed.\nThe government is setting up special economic and industrial zones, where all possible facilities will be provided to the industrialists settled abroad,” she added.\nDr Firdous was addressing a press conference here before taking oath of the newly elected office-bearers of the Jhang Press Club  The SAPM said it was the right time to invest in the country as a business-friendly government was in the power. Its initiatives for ease of doing business had been appreciated by the country’s entire trade and industrial community.\nShe said the prime minister’s day-long visit to Karachi today was important, where he was welcomed by Sindh Chief Minister Murad Ali Shah at the airport which was a positive development for strengthening democracy in the country.\n“This is a good omen for the nation that all the political parties will play their role for the development and prosperity of Pakistan while remaining in their constitutional limits.”\nShe said the prime minister met the business community in Karachi, who reposed their complete trust in his government policies. They also expressed their satisfaction on the ease of doing business initiatives taken by his economic team, she added.\nThe prime minister, she said, apprised the businessmen that his recent visit to Davos for addressing the World Economic Forum (WEF) 2020 incurred less expenses as compared to his previous counterparts. “The business community also lauded the prime minister’s stance at the WEF 2020 as his bold economic policies are even acknowledged at the global foras.”\nShe said during his meeting with the Sindh chief minister, the prime minister discussed the development projects in Karachi, for which the Federal Government had already allocated Rs162 billion. The provincial government would hopefully work for the betterment and development of the people with the vision of good governance and a corruption-free Sindh.\nDr Firdous said under the Prime Minister’s Kamyab Jawan Programme, a large number of business loans would be extended to the youth of Sindh, which would not only end their sense of deprivation but help them to play an active in the country’s development also.\nTo a question, the SAPM said the prime minister, being a visionary leader, had been facing the international media skillfully to project Pakistan’s true image, while the past incompetent rulers failed to present the country’s case at such forums in its real perspective.\nLater, the SAPM administered the oath to the newly elected office-bearers of the Jhang Press Club.",
  "retrievedAt": "2025-08-11T18:41:59.340Z"
}
