{
  "title": "Pakistan Post Foundation helps deliver new flagship Ehsaas Kifalat",
  "link": "https://www.app.com.pk/national/pakistan-post-foundation-helps-deliver-new-flagship-ehsaas-kifalat/",
  "date_published": "2020-01-27T00:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Preparations for the new Kifalat Cash-Transfer Programme are underway at the Pakistan Post Foundation, with eligibility letters ready to be delivered to the first wave of beneficiaries across the country.\nThe process of readying the official letters for distribution was inspected during a visit over the weekend by Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr Sania Nishtar and Federal Minister for Communications and Postal Services, Murad Saeed.\nThey saw how the official envelopes were printed, stuffed with letters and sorted into geographical areas, and then handed to the postmen for delivery to those families that needed support the most.\n“The new Kifalat programme will benefit millions of women and families across the country and these letters are now ready to go out to the first wave of beneficiaries,” Dr Nishtar during the visit commented.\n“All parts of the government have a role to play in ending poverty and creating a welfare state, and I was impressed by the dedication of the postal service in this effort.”\nThe Kifalat is a key policy of the Ehsaas poverty alleviation programme, which is working to lift people out of poverty and create a welfare state.\nThe dispatch of letters to eligible households is the second phase of a five-stage process to implement the Kifalat that will include an SMS campaign to identify missing households and NADRA desk registration of any missing households.\nThe first phase, a poverty survey and analysis of the data, is in the process of being completed across the country.\nThe Kifalat will be launched by the prime minister at a ceremony on Friday, January 31.\nIt is an updated and innovative cash-transfer programme that will empower the poorest women, giving many of them their own bank account for the first time and deploying the latest biotechnology to protect them from abuse.\nThe full details of the Kifalat will be announced at the launch on Friday January 31.",
  "retrievedAt": "2025-08-11T18:42:08.991Z"
}
