{
  "title": "Firdous for reinforcing media cooperation with Malaysia",
  "link": "https://www.app.com.pk/national/firdous-for-reinforcing-media-cooperation-with-malaysia/",
  "date_published": "2020-01-27T03:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Monday stressed the need to reinforce Pak-Malaysia cooperation in the field of media.\nAn agreement signed between their state news agencies , APP and Bernama, needed to be invigorated, she stressed during a meeting with Malaysian High Commissioner Ikram Bin Mohammad Ibrahim here.\nThe SAPM also emphasized to fortify collaboration between the state broadcasters of the two countries.\nShe said Malaysia and Pakistan had long enjoyed cordial relations. It was the best time to promote cultural linkages between the two countries, she said, adding the media could be engaged to further encourage people-to-people contacts.\nDr Firdous said Malaysia had always supported Pakistan on various issues, including the Kashmir dispute, at international fora. “We are especially thankful to Malaysia for its support during the recent Kashmir crisis,” she added.\nSge recalling her visit as part of a youth delegation to Malaysia, saying the country had come a long way in achieving remarkable progress in terms of economic progress, industrial growth, women empowerment and youth development.\nShe admired Malaysia’s achievements in the sphere of population control, which was instrumental in its development.\nThe Malaysian high commissioner said they were looking forward to enhance cooperation with Pakistan in the fields of trade, economy and investment. He expressed the hope that PROTON plant in Islamabad would start sale of vehicles later in the year.\nThe project, he said, would bolster cooperation in the areas of manufacturing and automobiles.\nHe said a headway was also envisaged in parliamentary exchanges and youth programmes between Pakistan and Malaysia. He also apprised the SAPM that he had invited the Malaysian Information Minister to visit Lahore to witness its vibrant culture and rich architectural heritage.\nThe high commissioner also extended an invitation to Dr Firdous to visit Malaysia.\nThe meeting was also attended by senior officials of the Ministry of Information and Broadcasting.",
  "retrievedAt": "2025-08-11T18:42:00.548Z"
}
