{
  "title": "Youth advised to come up with business plan for PM Kamyab Jawan loan",
  "link": "https://www.app.com.pk/national/youth-advised-to-come-up-with-business-plan-for-pm-kamyab-jawan-loan/",
  "date_published": "2020-01-27T01:21:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 27 (APP):Advisor to the Prime Minister on Youth Affairs and Chairman of PM’s Youth Programme Usman Dar Monday said that 100,000 youth have applied from Sindh under PM’s Kamyab Jawan Programm.\nThe success/acceptance of the applications ratio is around 15 percent. The reason for non-acceptance is, most of the youth applicants have no viable business plan, Dar said while taking to media here at the Governor House.\nHe said today Prime Minister Imran Khan will distribute cheques among up to 200 successful applicants under PM Youth Programme and then such cheque distribution ceremonies would be held in other areas of the province.\n“Today, it is a start by Prime Minister. In March or April this year, we will move to other districts of Sindh,” he reaffirmed adding that the youth from Sindh would get at least Rs 10 billion under this programme.\nThe advisor assured that this programme being executed on merit, in transparent manner and without any political interference.\nAn application was accepted after verification /interview by third independent party. An educated youth, with a plan to start a business under this programme, would have to come with a seed money/equity of Rupees half million to get Rupees five million concessionary loan, he added.\nHe said after the 18th amendment, it was the duty of the provincial governments to launch youth empowerment programmes. However, Pakistan Tehreek-e-Insaf government in the pursuance of the party manifesto to bring social and economic revolution in the country had come forth with youth empowerment programme titled PM Kamyab Jawan programme, which was aimed at, to create jobs through strengthening cottage industry.\nTill date, he said, 1.75 general stores’ owners had applied for this soft business loan.\nUsman Dar informed the media that in April 2020, second phase of PM Kamyab Jawan Programme would be launched and hoped youth would come up with feasible business plans.\nHe said the prime minister have also recently inaugurated “Hunarmand Pakistan” programme at the cost of Rs 30 billion to create skilled workers base in the country.\nUnder another initiative “Ahsas Programme”, the prime minister wanted to lift the poor class up.\nHe said the PTI government under the leadership of Prime Minister Imran Khan had succeeded to overcome the political and economic crisis, and that now the country was moving towards prosperity.\nTo a media question on reshuffling in Khyber Pakhtoonkhwa, PM’s The advisor said from the day first, Prime Minister Imran Khan had given his clear message that no one could continue in PTI governments at the Centre and in the provinces without showing good performance.\nTo another query, he said there was need for detailed positive debate on merits and demerits of 18th amendment to set a clear future road map of the country.",
  "retrievedAt": "2025-08-11T18:42:04.980Z"
}
