{
  "title": "Universal coverage to revolutionize health sector: PM",
  "link": "https://www.app.com.pk/national/universal-coverage-to-revolutionize-health-sector-pm/",
  "date_published": "2021-04-15T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP): Prime Minister Imran Khan Thursday said the universal health coverage would revolutionize the health sector in the country and protect the poor against economic fallout of contracting a disease.\nSpeaking after launching the Pakistan Medical Commission Online here, he said despite limited resources, Pakistan was moving towards full universal health coverage.\nHe said two provinces had taken the decision – the Khyber Pakhtunkhwa government had given health coverage to all its citizens while Punjab would be providing complete health coverage to the public by the end of current year.\nThe prime minister said now the private sector would establish hospitals in small towns and villages. Earlier, the private sector was not going to far off places as the people lacked buying power but now the poor would have health cards to get medical treatment, he added.\nImran Khan said the poor families did not have protection against disease, and they went below the poverty line and their budget was offset whenever affected by serious illness.\nHealth cards would provide protection to 50 percent of the country’s population against disease, he added.\nHe said the private sector would be given incentives to import duty free medical equipment. The government would sell the land of Evacuee Trust Property Board on concessional rates to make it easy for the private sector to construct hospitals, he added.\nThe prime minister viewed that the role of Pakistan Medical Commission (PMC)would increase as the number of medical colleges would go up in future.\nHe appreciated the PMC for launching its online system for registration of medical colleges and students, and for redressal of public complaints.\n“I congratulate the PMC because today it took a big step for the health sector as the introduction of technology will introduce transparency and meritocracy.”\nImran Khan said transparency and meritocracy would take Pakistan forward in the 21st century. The PMC as a regulator had presented itself before the public and medical students for review, he added.\nHe said unfortunately in the past, the performance of medical colleges and quality of health professionals had gone down as the regulator was not working properly.\nThere was a time when the country’s medical colleges and doctors had acceptability in the world, but later the regulators became negligent and the standards went down, he remarked.\nThe prime minister said it was very important for the regulator to set standards for doctors and medical colleges as one could not take chance on the lives of the patients.\nHe assured of the PMC of the government’s support to ensure its success as it would help the health sector in maintaining standards.\nSpecial Assistant to the Prime Minister on Health Dr Faisal Sultan spoke about the reforms in the health sector.\nHe said, “The modernization of the Pakistan Medical Commission is crucial in improving healthcare delivery in Pakistan. The online system will help our skilled healthcare cadre save precious time in the processing of their licensing and registration applications.”\nThe medical practitioners could now spend more time in treating their patients, he added.\nPMC President Dr Arshad Taqi, while sharing his thoughts, said, “The introduction of technology will increase the efficiency of our systems and decrease the potential for human errors.”\nHe commended his team for working tirelessly to achieve the goal of digitizing the Pakistan Medical Commission.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T20:37:44.887Z"
}
