{
  "title": "Dr Adil Najam for holistic approach to cope with environmental challenges",
  "link": "https://www.app.com.pk/national/dr-adil-najam-for-holistic-approach-to-cope-with-environmental-challenges/",
  "date_published": "2024-01-12T18:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP):WWF President Dr Adil Najam on Friday said that after many decades, faith and its interlinkages with climate and environmental crisis had become a central discussion as “humanity seeks answers to the contemporary challenges”.\nDr Adil Najam said this in a special conversation with SDPI Executive Director, organized by the Sustainable Development Policy Institute (SDPI).\nDuring the conversation, the resurging interest in religions and faith, and their potential linkages with solutions to environmental challenges were discussed.\nEmphasizing the need for holistic approaches, Dr Adil Najam said that modern society for the sake of economic growth and development started to view religion as a barrier in realizing human potential and liberties.\nHe said that when population growth became a major point of discussion in the 1960s and 1970s, religion and faith were pushed back.\nThe World Wildlife Fund (WWF) president said as climate crisis had challenged survival of the planet, the emphasis on circular economy, responsible consumption and production, efficiency of work, and the intricate relationship between individual behaviors and nature had taken center stage. “At the same time, all religions underscore the role of individuals and their free will and their impact on the environment, so not every stimulus we face can be attributed to God’s will,” he added.\nHe said,”While some may argue that any unprecedented climate disaster may be God’s will, there can be no denial that human actions like deforestation have contributed to it, despite religion urging us to protect nature and biodiversity.\n“In times of crisis, humans tend to gravitate towards their beliefs and values for comfort,” he added.\nDr Adil Najam said that to resolve the current challenges the global community needed large scale behavioural change, and “we must explore the potential role that can be played by faith and values irrespective of  the fact if someone is religious or not”.\nHe stressed that behavioural changes “remain the focal point of the answer to climate crisis and irrespective of religious backgrounds behaving responsibly is the solution moving forward”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:34:32.308Z"
}
