{
  "title": "Pakistan to be connected with high-speed ‘optical fiber network soon: MOITT Secretary",
  "link": "https://www.app.com.pk/national/pakistan-to-be-connected-with-high-speed-optical-fiber-network-soon-moitt-secretary/",
  "date_published": "2024-01-12T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP):Ministry of Information Technology and Telecommunication (MoITT) Additional Secretary Aisha Humera Chaudhry Friday said that the government is all set to launch a landmark project ‘optical fibre’ to improve broadband connectivity and to boost deployment of digital infrastructure across the country.\nTalking to PTV news channel, she said that the government and telecom companies would strengthen urban and remote areas with high-speed broadband connectivity, adding, that all available resources and facilities were being provided for the digital gateway initiative.\nShe said the government was striving hard to ensure the availability of affordable high-speed Internet service to the citizens, particularly the students, and for that purpose, it was focusing on laying ‘optical fibre’ across the country.\nShe further mentioned that the Ministry of IT and Telecom is fully cooperating with the telecom industry.\nReplying to a query, she highlighted that said that the provision of broadband services to the residents of the un-served and under-served areas of Pakistan is as much needed as for the big cities.\nBy increasing the optical fibre cable, the connectivity will be faster, and better internet facilities will be provided to the users, she added.\nTo another question about the E-rozgar program, she explained that the government has been setting up 10,000 ‘e-Rozgar centres’ across the country to provide workspace for the country’s budding freelancing community, announced the interim minister for IT and Telecom.\nShe said that Pakistan’s IT experts were giving their services in other 190 countries, adding, that over 1.5 million persons in Pakistan are working as online freelancers, making it the second biggest online workforce in the world.\nThe government will provide interest-free loans to the private sector to convert real estate into co-working spaces i.e. e-Rozgar centres, she added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:35:19.921Z"
}
