{
  "title": "SC adjourns hearing on ECP’s appeal against PTI’s election symbol",
  "link": "https://www.app.com.pk/national/sc-adjourns-hearing-on-ecps-appeal-against-ptis-election-symbol/",
  "date_published": "2024-01-12T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP):The Supreme Court of Pakistan on Friday adjourned hearing till tomorrow on an appeal of Election Commission of Pakistan (ECP) against restoration of PTI’s election symbol ‘cricket bat’.\nA three-member bench headed by Chief Justice of Pakistan Qazi Faez Isa and comprising Justice Muhammad Ali Mazhar and Justice Musarrat Hilali heard the appeal of ECP.\nDuring the course of proceedings, the CJP inquired from the PTI’s lawyer regarding the document of appointment of members of its election commission for intra-party elections.\nPTI’s lawyer Hamid Khan prayed the court to grant time till Monday for case preparation.\nThe court observed that it would have to suspend the high court decision if it adjourned the case till the said date. It was ready to hear the case even during the holidays as elections were getting closer, it added.\nHamid Khan requested the bench to adjourn the case till tomorrow as they received the court notice last day. It would be appropriate if the court first hear the point pertaining to the maintainability of the appeal.\nThe chief justice observed that if a custom collector could file an appeal in the court then why the ECP, which was a constitutional institution, could not do so.\nThe CJP had two responsibilities – one to oversee the affairs of political parties and second to conduct elections transparently, he added.\nJustice Isa said that a constitutional institution would use its powers under the Constitution. There was a difference between the institutions which were set up under the Constitution and law.\nECP’s lawyer Makhdoom Ali Khan said that the decision of Peshawar High Court (PHC) regarding the election symbol could not be maintained as per law.\nHe said that the electoral body had the authority to allot the election symbols to the political parties.\nThe lawyer said that the people who had challenged the intra-party elections of PTI also had been named as respondents in the case.\nThe court adjourned further hearing of the case till Saturday after the ECP’s lawyer concluded his arguments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:34:32.383Z"
}
