{
  "title": "Ashrafi urges private banks to withdraw appeals against FSC’s judgment on usury",
  "link": "https://www.app.com.pk/national/ashrafi-urges-private-banks-to-withdraw-appeals-against-fscs-judgment-on-usury/",
  "date_published": "2022-12-01T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Thursday urged the private banks to withdraw their appeals to annul the judgment of the Federal Shariat Court (FSC) against the usury.\nAddressing a press conference here at Jamia Masjid Mu’aaz bin Jabal, he said the government had taken practical steps by withdrawing appeals of National Bank of Pakistan and State Bank of Pakistan from the apex court in a bid to get rid of the interest-based economic system from the country.\nAshrafi who is also the chairman of Pakistan Ulema Council assured the government all-out support of Ulema and Mashaykh in the implementation of FSC’s decision in letter and spirit.\nHe proposed all the financial institutions to devise a combined strategy to make the country’s economic system free of interest which was totally against the divine commands.\nHe said Pakistan was facing a critical financial crisis and its solution was lying in political stability and improved law and order situation in the country.\nHe urged all the religious and political parties to get together at one platform and help cope with burgeoning polarization, extremism and the new wave of terrorism.\nAshrafi said there was a big hand of the external forces and anti-state elements behind an organized smear campaign against the national security institutions and armed forces. “We must counter the propagandas of enemies against our national defense institutions and Pakistan Army with a pragmatic approach instead of becoming part of it,” he added.\nHe also appealed the Pakistan Tehreek-e-Insaf Chief Imran Khan to come on the table talk to evolve consensus on the Charter of Pakistan for the next 25 years.\nHe said Charter of Pakistan was need of the hour as it would help control increasing violence in the society and improve the ailing economy.\nHe said the way Message of Pakistan was designed to promote religious harmony in the country, there should be long-term policies on country’s social, economic and foreign affairs issues in the shape of Charter of Pakistan and it should be implemented by all the governments to come and national institutions in larger national interest.\nAshrafi emphasized that Pakistan had to go out of the box in the matter of its foreign policy as there was a paradigm shift in the external affairs of the Islamic and Arab world.\nHe informed that on Friday, Ulema and Mashaykh would observe Youm-e-Huramt-e-Sood and they, in their Friday sermons, would highlight how to get rid of usury especially at the individual level.\nHe also urged the government to take stern action against the people who were allegedly involved in interest at the local level.",
  "retrievedAt": "2025-08-11T15:56:36.753Z"
}
