{
  "title": "Provinces should set up separate ministries for population control: Marriyum",
  "link": "https://www.app.com.pk/national/provinces-should-set-up-separate-ministries-for-population-control-marriyum/",
  "date_published": "2022-12-01T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday suggested that provinces should set up separate ministries to control the growing population.\nIn her speech at the 70th anniversary of the establishment of the Population Council, she said the National Emergency Plan will be given soon to address the growing population issue.\nPrime Minister Shahbaz Sharif had called a meeting of the National Task Force next week, she said adding that provinces had representation in the task force.\n“This year, the population of the world has reached 8 billion and that of Pakistan has reached 23 million,” said the minister.\nPakistan’s population, she said, had increased from 30 million to 230 million in 75 years, and by 2030, the population of Pakistan was expected to be 263 million and in 2050, it is expected to reach the figure of 338 million.\nIn terms of population, she said, Pakistan had become the fifth-largest country in the world. The minister said that population growth was as alarming as the destruction caused by climate change. She said Pakistan’s population was growing at a rate of 2 percent per year.\n“When the population increases, problems like education, health, and public services also arise,” she maintained.\nAfter the Eighteenth Amendment, issues like education, health, and public services were the responsibility of the provinces, Maryam Aurangzeb said. To deal with these problems, the issue of increasing population had to be dealt with, the information minister remarked.\nShe said there was a need to create a national narrative on these issues of national importance and all stakeholders should be involved in the formulation of the narrative.\nThere should be an open discussion on such issues at the government level, and everyone has to play a role in finding a solution to them, she said.\nAs a result of a natural calamity of a flood, the nation recently faced great destruction and people of all ages including children and women in Pakistan were severely affected by the devastating floods.\nThe minister said that goals were clearly defined in the declaration adopted by the National Conference held in the Parliament in the past and the declaration was also signed by the provinces.\n“These goals and recommended measures need to be revived. We could achieve the desired goals with policy-making, legislation, and narrative formulation,” Marriyum Aurangzeb said.\nIn the past, the planning department has done a great job and played a key role in creating the public awareness of the issue, she said.\nMinister of Information assured all possible support to the Population Council in creating awareness about digital media and creating a narrative regarding the growing population.",
  "retrievedAt": "2025-08-11T15:56:36.961Z"
}
