{
  "title": "Practical implementation of Loss & Damage Fund a must to cope with climate challenge: PM",
  "link": "https://www.app.com.pk/national/practical-implementation-of-loss-damage-fund-a-must-to-cope-with-climate-challenge-pm/",
  "date_published": "2022-12-01T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 1 (APP): Prime Minister Shehbaz Sharif on Thursday, calling the Loss and Damage Fund the realisation of climate challenge by the global north, said it was however a must to practically implement the commitment as the disaster faced by Pakistan could also hit others in the future.\nThe prime minister, addressing the event “COP27 and Beyond: Pakistan’s Resilience Challenges” told the world that what had happened in Pakistan would not stay in Pakistan which necessitated seriousness towards the challenge of climate change.\n“Our friends in the global north, they should and they have realised the importance of this challenge. And that is why it has made a remarkable agreement at Sharm El-Sheikh. Loss and Damage is now a reality. But then, it’s not about these agreements and understandings. It’s about practical implementation,” the prime minister remarked addressing the event held to acknowledge the ministers, government officers and experts whose efforts led to the agreement on the Loss and Damage Fund.\nHe appreciated the efforts of all those involved for achieving “which was almost impossible.”\nHe said the unprecedented floods in Pakistan had affected 33 million, left 800 dead, and inflicted around $30 billion loss to the country’s agriculture, industry, infrastructure, and livestock.\nHe thanked the donor countries and organisations and local philanthropists for supporting the flood survivors.\nHe also lauded the role of the provincial governments and government institutions for their efforts for relief and rehabilitation of the victims.\nHe said the “Loss and Damage was like a sleeping beauty for the decade” and for the first time, it was articulated by the team led by the ministers for foreign affairs and climate change.\nHe said Pakistan had been seeking justice as it had faced which it had nothing to do with having less than 1% contribution to the carbon emission.\nHe also appreciated the role of diplomats, experts and other ministries including economic affairs, planning, information, and every Pakistani who contributed to making the world realise what happened to Pakistan.\nAddressing the ceremony, Minister of State for Foreign Affairs Hina Rabbani Khar said Loss and Damage Fund was a “landmark event” because it was able to develop something which the developing countries had been pursuing for the last three decades.\nShe said the Fund would support developing countries like Pakistan to rebuild the destriyed infrastructure and achieve resilience.“This is not about only global south alone but rather all climate justice seekers both in north and south,” she remarked.\nShe apprised the gathering of the concerted efforts made by the prime minister, foreign minister and diplomats at COP27 and earlier, as the urgency was felt more after the floods.\nShe said the Fund was considered a major outcome of the COP27 and appreciated the flexibility shown by the developed countries which led to the agreement bringing a win-win situation for all.\nMinister for Climate Change Sherry Rehman, who had been instrumental in the dialogue process at COP27, said resilience was key to a sustainable future and trajectory to growth.\nShe said the concerted public advocacy led to the agreement adding that it was all about climate justice, not charity as the developing countries lacked resources to deal with the climate change-induced disasters.\nShe said the situation would not stabilise unless the climate stress was addressed. She said the resilience was also a race against time, citing the seriousness of the situation caused by climate change in form of artificial lakes and flood-caused destruction.",
  "retrievedAt": "2025-08-11T15:56:33.198Z"
}
