{
  "title": "President calls for following teachings of saints, Sufis",
  "link": "https://www.app.com.pk/national/president-calls-for-following-teachings-of-saints-sufis/",
  "date_published": "2022-03-12T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): President Dr Arif Alvi Saturday called for following the teachings of saints and Sufis who always advocated the cause of humanity and promoted love, brotherhood, mutual respect and unity among Muslims.\nHe said that the saints had rendered great services for the reformation of society by educating and guiding the Muslims about Islamic values and propagating the message of Islam throughout the world.\nThe President made these remarks while talking to the visiting Sajjada Nasheen of Hazrat Abdul Qadir Shah Gillani of Baghdad, Sheikh Syed Khalid Abdul Qadir Mansoor Al-Gillani, who along with the members of his delegation, called on him, at Aiwan-e-Sadr here. Federal Minister for Religious Affairs, Pir Noor-ul-Haq Qadri, the Ambassador of Iraq to Pakistan Hamid Abbas Laftah, and senior officials of the Government attended the meeting.\nWelcoming the delegation, the President highlighted the contributions of Ulema and Sufis in spreading the message of Islam in the world, particularly in Central and South Asia. He added that Hazrat Abdul Qadir Shah Gillani upheld high moral values throughout his life and reformed the society in the light of the Quran and Sunnah during the difficult time of Islamic history. The President further highlighted that today’s society was facing many challenges such as moral degradation, extremism and fake news, and religious leaders needed to address these issues in their sermons and speeches. He informed the delegation that the Government and religious leaders from various schools of thought had been making efforts to promote religious tolerance, mutual respect and inter-faith harmony in the country. He emphasized the need for promoting unity among the Muslim countries to effectively overcome the challenge of Islamophobia.\nThe President lauded the welfare works being undertaken by the Sajjada Nasheen of Hazrat Abdul Qadir Shah Gillani. Later, he hosted a state banquet in honour of the visiting delegation.\nSheikh Syed Khalid Abdul Qadir Mansoor Al-Gillani thanked the President for his hospitality and warm welcome. He also invited the President to visit Baghdad.",
  "retrievedAt": "2025-08-11T14:31:23.716Z"
}
