{
  "title": "BEF establishes 685 community schools in far-flung districts of Balochistan: official",
  "link": "https://www.app.com.pk/national/bef-establishes-685-community-schools-in-far-flung-districts-of-balochistan-official/",
  "date_published": "2023-01-21T14:48:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jan 21 (APP): The Balochistan Education Foundation (BEF) has established 685 community schools at far-flung districts of the province to eliminate illiteracy and bringing a vital change in society.\nTalking to APP here Saturday, an official of Balochistan government said that more than 32000 children were getting free education with stationery and other necessary materials in community schools in far-flung areas of the province.\nThe provincial government has taken steps to increase the education ratio and has planned to enhance the community schools in those areas, where no government schools exist, he said and added that the main aim of community schools is to impart quality education in collaboration with local communities.\nHe underlined the need of community’s involvement in improving education facilities in the province, formation of Parents Teachers School Meeting Committee (PTSMCs) in all schools to enhance the role of communities. “’The community’s involvement is imperative for bringing a change in the society,” he added.\nThe Government of Balochistan has invested time and resources in education sector, he said adding that the provincial government had already introduced reforms in its Education Department. These reforms were aimed to address the challenges of providing improved infrastructure, devolving key responsibilities and plugging the shortage of teachers through merit-based recruitments, he told.\nThe government has established real time monitoring and complaint cells in all district education offices for monitoring the teacher’s attendance. The government has created multiple posts for teachers to fulfill the vacant positions and ensure availability of teachers in every school of the province, he concluded.",
  "retrievedAt": "2025-08-11T05:47:14.201Z"
}
