{
  "title": "PM Youth Program opens online registration for Youth Sports Trials",
  "link": "https://www.app.com.pk/national/pm-youth-program-opens-online-registration-for-youth-sports-trials/",
  "date_published": "2023-01-21T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Prime Minister Youth Program has opened the registration for Sports Trail in Hockey, Cricket and Football under Talent hunt Youth Sports League for men and women to promote healthy physical activities among the youth.\nThe intended participants can register themselves through the online facility till January 30 while the on-the-spot registration facility will also be available for the players who meet the eligibility criteria.\nAccording to the eligibility criteria for participation in the talent hunt, all Pakistani including nationals from Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB) aged between 15-25 years on January 30, 2023, are eligible to participate in the sports league.\nHowever, the departmental players are not eligible to participate in the talent hunt.\nTrials for both men and women players will be conducted in 25 different locations across the country including the federal capital, Punjab, Khyber Pakhtunkhwa, Sindh, Balochistan, AJK, and GB.\nIn Balochistan, the trials will be held at Dera Murad Jamali, Sibbi, Turbat, Khuzdar, Uthal-Hub, Quetta and Loralai, while in Khyber Pakhtunkhwa the locations will be Mardan, Bannu, Swat, Peshawar, and Hazara.\nIn Punjab, the participants can visit Rawalpindi, Sialkot, Faisalabad, Lahore and Bahawalpur/ Multan for participating in the trials.\nIn Sindh, the trails will take place at Hyderabad, Karachi, Sukkur, Larkana and Shaheed Benazirabad however other locations will include Islamabad, Mirpur, Gilgit, Muzaffarabad and Skardu.\nThe provincial and national leagues will be held after the finalization of the teams through conducting trials.\nThe online application must be submitted through the web link: https://pmyp.gov.pk/hec/SportsForm\nThe participants can contact Higher Education Commission Call Centre at UAN: 111-119-432 or 0334-1119432 Web link: https://onlinehelp.hec.gov.pk/ for further information.\nUnder the PM youth sports initiative registration for Table Tennis, Badminton and Squash are also open while the trials’ for these sports will open soon.\nUnder PM Youth program the Talent Hunt Youth Sports League intends to hunt talent in various games including Badminton, Boxing, Cricket, Football, Handball, Hockey, Judo, Squash, Table Tennis, and Volleyball for men and women whereas Weightlifting and Wrestling for men only.\nMoreover, the project provides equal growth opportunities to both males and females and promotes excellence in sports with a view of spotting right talent for right sports to nurture them systematically through coaching and mentor ship.\nPM Youth program under the Talent Hunt Youth Sports League intends to provide unlimited opportunities to the selected players after winning National Leagues in their respective games.\nThe opportunities include provision of coaching and development facility under the patronage of Pakistan Sports Board and award of scholarships for pursuing higher education.\nAfter the trails, the selected players (men and women) will be attached with sports academies (High Performance and Resource Center) to continuously develop their skills, competency and physical fitness that are required to be a professional player.",
  "retrievedAt": "2025-08-11T05:47:18.154Z"
}
