{
  "title": "Realizing youth potential to help Pakistan achieve socio-economic development: Asad Qaisar",
  "link": "https://www.app.com.pk/national/realizing-youth-potential-to-help-pakistan-achieve-socio-economic-development-asad-qaisar/",
  "date_published": "2020-12-15T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): Speaker National Assembly Asad Qaiser has said that 150 million young people are Pakistan’s greatest asset and utilizing this potential appropriately would help achieve socio-economic development of the country.\nHe said that the aforesaid objective could only be realized through providing access to high-quality education and skill development in the country.\nHe expressed these views while addressing the International Virtual Conference on Pakistan-United Kingdom (UK) Education Gateway through video link, Tuesday in Islamabad.\nAddressing the conference, the Speaker said that the Government is fully committed to the cause and aims to generate an educated workforce, build empathy and tolerance and rapidly improve Pakistan’s positioning in the global market.\nHe said that a substantial allocation of Rs.160 million had been made as an investment in our youth’s development through the Knowledge Economy.\nHe commended the tremendous work done by the British High Commission and the British Council Pakistan in collaboration with the Higher Education Commission of Pakistan in building opportunities for the advancement of higher education, research and development.\nAppreciating the launch of GREAT awards and British Council STEM schemes this year, adding to the number of awards for Pakistani students, the Speaker said that it would largely impact the education and skills development in Pakistan.\nHe expressed gratitude towards the joint team executing this brilliant 9- Million-pound project – the British council and the HEC. “Your work deeply impresses me, and I feel proud of the achievements of the Pak-UK Education Gateway and its rapid response to uncertain times of 2020”, he added.\nSharing his work experience with British Council education team while he was Speaker provincial Assembly, the Speaker Asad Qaiser said that the British Council team kept the connection alive and made the KPK government able to scale up the wound full work around schools, skills, universities, governance and capacity building of senior leaders in Khyber Pakhtunkhwa.\nHe said that British Council’s support to skills sector development was a great support for Skill for all, around accreditation of Technical and Vocational Education and Training institutes and apprenticeships in much appreciated.\nHe said that he was sure that these programmes will help create pathways between the higher Education and skills sector and ultimately benefit our young talent which we are proud of.\nThe Speaker said that Pakistani students would greatly benefit by enhanced number of scholarships for Pakistan this year the UK government and British Council. He said that launch of new research links between Pakistan and UK universities was also a commendable effort by the British council.\nHe said that it is in area which is very important in making this world better by involving science and research for solving our problems of today and tomorrow.\nConcluding his address, the Speaker said that he felt proud and optimistic that the upcoming journey of this project and what many feats it will achieve to enable the youth of this country.\nHe extended his unwavering support and I hope to see us all flourish in the outcomes of the Pak-UK Education Gateway.",
  "retrievedAt": "2025-08-11T20:08:43.670Z"
}
