{
  "title": "Dissension among PDM leaders setback of its movement: Gandapur",
  "link": "https://www.app.com.pk/national/dissension-among-pdm-leaders-setback-of-its-movement-gandapur/",
  "date_published": "2020-12-15T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): Minister for Kashmir Affairs and Gilgit Baltistan Ali Amin Khan Gandapur Tuesday said the dissension among PDM leaders for storming of the federal capital speaks volume about failure and setback of their anti-government movement.\nThe leaders of opposition’s Pakistan Democratic Movement (PDM) were shifting dates time and again for staging march towards Islamabad that had exposed them before the nation, he said in a statement issued here.\nThe nation was well aware of the movement’s designs which aimed at saving the corruption of few families that would eventually failed, he said.\nGandapur said PDM was an anti-people and anti-state movement, causing adverse impacts on the economy and development of the country.\nCriticizing on PDM head, the Minister said Jamiat Ulema-e-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman’s lust for power has buried his politics, adding thatPDM\nMaulana’s desire for power will never come true.\nHe said the purpose of Maulana’s politics was to defend the corruption of Nawaz and Zardari.\nGandapur said JUI-F chief should stop defending the corrupt people and give an account of his benami properties and corruption of billions of rupees.\nExpressing resentment over the statement made by Pashtunkhwa Milli Awami Party leader Mahmood Achakzai in a recent PDM public gathering at Lahore, the minister said Achakzai had always spoken against Pakistan and the federation and such statements were tantamount to inciting provincialism and undermining national unity.\nHe said the sacrifices rendered by the people of Punjab in the independence movement were not hidden from anyone and such statements clearly show that the ‘save corruption’ movement has another agenda to weaken the country.\nThe Minister said PDM should not mislead the nation and by showing some courageousness it must submit their resignations to the National Assembly Speaker immediately.\n“Oppositions’ such tactics neither can blackmail Prime Minister Imran Khan nor get National Reconciliation Ordinance (NRO) from him,” he critically remarked.",
  "retrievedAt": "2025-08-11T20:08:43.353Z"
}
