{
  "title": "Farrukh Habib visits Ehsaas Kafalat Registration Centre",
  "link": "https://www.app.com.pk/national/farrukh-habib-visits-ehsaas-kafalat-registration-centre/",
  "date_published": "2022-01-03T10:31:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jan 03 (APP):State Minister for Information and Broadcasting Farrukh Habib visited Ehsaas Kafalat Registration Center, Sports Complex Dijkot near here on Monday.He reviewed the arrangements made for people at the center where he was briefed by Divisional Director Ehsaas Kafalat Registration Center Dr Fayyaz Ahmed.\nFarrukh Habib said that a sum of Rs 250 billion had been allocated for the Ehsaas Kafalat programme and the amount would be distributed among 7 million deserving families at the rate of Rs 12,000 each family.\nHe asked the people to get registration from their nearby NADRA centers for getting benefit from the programme.He said that people could also get registration for Ehsaas Ration Programme bysending their CNIC No at 8171.\nThe state minister said that edible items including wheat flour, ghee and pulses would be provided to the registered people on 30 percent discount from designated merchant stores.\nHe said the government had provided Rs 50 billion under Ehsaas Graduate Scholarship programme.He said that youth were also being provided loans on easy installments to help themstart their own business.\nHe said that 34 programmes were ongoing under Ehsaas Programme, adding that health cards had been launched in Punjab province, for which Rs 400 billion had been allocated.Under the programme, every family in the province could get treatment facilities from a doctor and a hospital of his own choice, he added.\nHe said that inflation had been increased across the world due to coronavirus and Pakistan had also been affected, adding the PTI government launched different programmes of social protection keeping in view the difficulties of the common man.\nThe State Minister said the government was taking measures for the provision of relief to common man and converting the state into ‘Riyasat-e-Madina’ as per the vision of Prime Minister Imran Khan.",
  "retrievedAt": "2025-08-11T14:00:11.432Z"
}
