{
  "title": "Corrupt officials in PR to be shown the door: Swati",
  "link": "https://www.app.com.pk/national/corrupt-officials-in-pr-to-be-shown-the-door-swati/",
  "date_published": "2022-01-03T15:31:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 03 (APP): Federal Minister for Railways, Azam Khan Swati on Monday said that there was zero tolerance for corruption in Pakistan Railways (PR) and such black sheep were unacceptable.\nTalking to media persons after inaugurating AC standard coach attached with Hazara Express he said that a mega operation against financially corrupt officials had been launched in the PR, that had been suffering billions of rupees deficit each year since long.\nThose involved in corrupt practices would be shown the door. “We would not allow black sheep to indulge in loot and plunder of the assets of PR. The profit of PR is increasing while its losses are decreasing due to earnest efforts of my team,“ he said.\nThe minister said he was making efforts to run the railways under an effective, viable and sustainable business plan. “I think it is the only way forward to save this department from sinking further,” Swati said.\nHe congratulated all the staff members, officers and divisional superintendents of Rawalpindi Division for upgrading rack of Hazara Express saying that it was in poor condition.\nHe said, “I am excited to see smile today on the faces of the passengers travelling in Haraza Express.”\nHazara Express was a very profitable train as it was helping to give considerable revenue to PR, he said adding, “We are giving priority to far-flung and backward areas like Hazara division in accordance with the vision of the Prime Minister.”\nHazara Express which runs between Havalian to Karachi had been upgraded to facilitate the passengers, he said.\nOut of 230 coaches that would reach in Pakistan within three to four months, one brand new rack would also be given to facilitate the passengers of Hazara, he informed.\nThe Station Masters of PR had been directed not to sit in offices and remain in the field to facilitate the passengers of the Railways.\nFacilitation Centers would be set up at all railways stations. A special cell would be set up in Railway Ministry which would monitor the performance of the railway officers and the facilities being provided to the passengers across the country, he added.\nThe complaint numbers would be displayed at all the railway stations to facilitate the citizens. A portal to register complaints was also being developed which would be activated within few weeks, he added.\n“We would be accessible to all as we are accountable to the people,“ he said.\nLahore Railway Station would be revamped, he said adding, Railway porters were respectable for Pakistan Railways and efforts would be made to uplift them.\nThe contractor system would be eliminated from Pakistan Railways within few days to provide relief to the porters and they would be provided opportunity to earn their livelihood in respectably way, he added.",
  "retrievedAt": "2025-08-11T14:00:04.484Z"
}
