{
  "title": "Agriculture development vital for poverty alleviation: Sania Nishtar",
  "link": "https://www.app.com.pk/national/agriculture-development-vital-for-poverty-alleviation-sania-nishtar/",
  "date_published": "2022-01-03T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP):Special Assistant to Prime Minister on Poverty Alleviation and Social Protection Dr Sania Nishtar Monday said that agriculture development and food security was imperative for poverty alleviation, economic development  and social prosperity in the country.\nAddressing ginger harvesting workshop, organized by Pakistan Agriculture Research Council (PARC), she said that ginger can emerge as a major crop and play an important role for the farming community by enhancing their farm income and crop profitability.\nShe called upon the public-private sectors, research institutions, innovators and farmers for working together to build agriculture value chains to maximize their income that also help in poverty alleviation, livelihoods creation, economic growth and boosting exports.\nShe also acknowledged the scientists and progressive farmer for this introducing innovation in ginger production in the country and stressed the need for extending research and development results to end farmers to revolutionized agriculture sector in the country.\nSpeaking at the occasion, Dr Ghulam Muhammad Ali Chairman PARC briefed Dr Sania on the success of the ginger cultivation project and its potential to boost Pakistan’s farmer economy.\nHe also apprised her about the variety grown successfully and tested in the field that could yield approximately 8 to 10 tons per acre in these areas.\nDr Ali told that this ginger variety successfully developed and introduced in Pothohar area, adding that PARC was also striving for the development of different crop varieties and it was collecting their germplasm from different countries for adaptability, trial at different locations and management practices.",
  "retrievedAt": "2025-08-11T14:00:01.836Z"
}
