{
  "title": "President emphasizes need for extending internet connectivity across AJK, GB",
  "link": "https://www.app.com.pk/national/president-emphasizes-need-for-extending-internet-connectivity-across-ajk-gb/",
  "date_published": "2022-01-03T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP): President Dr. Arif Alvi emphasized the need for extending robust internet connectivity across Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB) so as to fully cover all population pockets and highways in these areas.\nHe made these remarks while chairing a meeting on extending sustainable robust internet connectivity across Azad Jammu and Kashmir and Gilgit Baltistan at Aiwan-e-Sadr on Monday.\nThe meeting was attended by the Federal Minister for Information Technology (IT) and Telecommunication Syed Amin ul Haq, Chief Minister Gilgit Baltistan, Khalid Khursheed, Minister for IT AJK, Muhammad Iqbal, Secretary IT & Telecom Dr. M. Sohail Rajput, Chairman, Pakistan Telecommunication Authority Maj Gen (R) Amir Azeem Bajwa and Director General Special Communication Organization Maj Gen Shahid Siddique.\nDirector General SCO briefed the meeting about the steps taken by his organization for providing broadband coverage to the citizens of AJK & GB. Addressing the meeting, the President said that the provision of broadband connectivity and internet coverage to Azad Kashmir and Gilgit Baltistan would contribute towards the promotion of e-education and generating job opportunities for the local people.\nHe said that the government strongly believed in the mass adoption of emerging digital technologies and innovative applications to enable cross-sector socio-economic development.\nHe added that Azad Kashmir and Gilgit Baltistan were attractive destinations for tourists and it was the key priority of the government to ensure the availability of robust internet services in these areas. The President appreciated the role of SCO for providing broadband connectivity to the people of AJK & GB.",
  "retrievedAt": "2025-08-11T14:00:08.486Z"
}
