{
  "title": "PMDC drafts new accreditation standards",
  "link": "https://www.app.com.pk/national/pmdc-drafts-new-accreditation-standards/",
  "date_published": "2024-03-14T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Pakistan Medical and Dental Council (PMDC) has prepared new upgraded drafts for accreditation standards.\nIn a statement, the President PM&DC Prof. Dr. Rizwan Taj said that these accreditation standard drafts were prepared for Medical Colleges (Undergraduate), accreditation Standards for Teaching Hospitals (Undergraduate), Guidelines for MBBS Curriculum, Competencies of a Medical Graduate and Medical House Job Competencies, 2024.\nHe said that PM&DC has been actively working on the upgradation of medical and dental standards for the past three months, and these standards will be implemented after the approval of the Academic Board and Council.\nHe said that accreditation standards for medical colleges at the undergraduate level will serve several important purposes, each of which will ultimately benefit both students and the healthcare system.\nHe said that after extensive hard work all these medical dental accreditation standards, rules and regulations have been forwarded Academic Board Committee for deliberation and approval.\nThese accreditation standards will set high standards for the quality of education provided by medical colleges, including faculty qualifications, curriculum content, teaching methods, facilities, and resources.\nThese standards ensure that students receive high-quality education that meets specific quality and rigor standards, protecting them from investing time and money in substandard programs.\nWith these accredited standards, medical colleges will be able to provide students with the knowledge, skills, and experiences necessary for success in their future medical practice.\nHe said that the council has also prepared drafts for accreditation Standards for Dental Colleges for Undergraduate Dental Education, Inspection Proforma for 50 BDS Admissions, accreditation Standards for Dental Clinical Teaching Facilities, Hospital for Undergraduate Dental Education, Competencies of BDS Graduates and Dental Surgeons, Guidelines for BDS Curriculum, 2024.\nHe said that the accreditation standards are crucial in dental education, ensuring that dental colleges maintain high-quality educational programs.\nThese standards will cover faculty qualifications, curriculum content, teaching methods, and clinical training facilities.\nThese will help design curricula that prepare students for future dental careers, developing competencies in areas like patient care, communication, critical thinking, and ethical decision-making.\nHe said that accreditation standards will improve the system of licensure and certification, ensuring graduates meet the necessary educational requirements to practice dentistry safely and competently.\nHe said that the ultimate goal of designing these standards is to produce competent, well-rounded dental professionals who can meet patients’ oral health needs and contribute positively to the dental profession.\nHe said that PM&DC has also devised the drafts of PM&DC Powers and Functions Rules, PM&DC Code of Ethics of Professional Conduct, PM&DC Licensing Regulations, PM&DC National Medical Scholarship Fund and Trust Rules, PM&DC Finance Rules, M&DC Examination Regulations, Amendment to Admissions Regulations, PM&DC Student Registration Regulations, 2024.\nIt is need of time as PM&DC is responsible for regulating medical and dental education, practice, and related matters in Pakistan.\nIts Powers and Functions Rules should ensure medical and dental colleges to adhere specific standards of education, faculty qualifications, infrastructure, and curriculum.\nThe PM&DC Code of Ethics of Professional Conduct promotes professionalism, integrity, and patient-centered care and it was a dire need to prepare an upgraded code of ethics to safeguard the doctors.\nPM&DC Licensing Regulations will improve the process of issuing licenses to practitioners, while the PM&DC Student Registration Regulations will track student progress.\nThe PM&DC National Medical Scholarship Fund and Trust Rules will provide scholarships to deserving medical and dental students, addressing the shortage of healthcare professionals in underserved areas.\nThe PM&DC Finance Rules ensure transparency, accountability, and efficient resource allocation.\nThis will ensure examination regulations establish standards for conducting medical and dental examinations, ensuring fairness, reliability, and validity.\nAmendments to admissions regulations will enable to govern the admission process, preventing malpractices.\nOverall, PM&DC upholds medical and dental education, practice, and governance standards, contributing to safe, effective, and ethical healthcare services.\nHe was determined to uplift the PM&DC and medical and dental education so the health sector of Pakistan may be strengthened.",
  "retrievedAt": "2025-08-11T01:18:48.844Z"
}
