{
  "title": "PM Shehbaz Sharif dedicated to take country forward on path of progress: Qaiser Sheikh",
  "link": "https://www.app.com.pk/national/pm-shahbaz-sharif-dedicated-to-took-country-forward-on-path-of-progress-qaiser-sheikh/",
  "date_published": "2024-03-14T06:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Federal Minister for Maritime Affairs Qaiser Ahmed Sheikh on Thursday reiterated Prime Minister Shehbaz Sharif’s commitment to Pakistan’s rapid development and asked the opposition parties to work with the government to provide relief to the common man.\nTalking to the PTV news channel, the minister stressed that our primary focus is to increase province revenue, business growth, and economy boost and to build confidence for inverters where the opposition’s role is very crucial as its “constructive criticism” will guide the government in framing “prudent policies”.\nHe said that it is our collective responsibility to make decisions in parliament in favor of the common people to bring improvement in national institutions.\nThe minister said that the priority of the government is to get the country out of the current crisis.\nReplying to a question, he emphasized the need for a solid and effective strategy to promote investment in Gwadar, adding, that the government will work to revamp and operationalize the Pakistan National Shipping Line to enable the institution to exclusively handle the state’s exports and imports.\nThe next few months are important for the government where we will take wise decisions to revive the economy, he added.\nHe said the government will work dedicatedly to achieve the goals of sustainable development, adding, that our key priorities are the development of a strategy and to control of leakages in all departments where Prime Minister Mian Muhammad Shehbaz Sharif was taking a personal interest in the matter.\nHe further stated that the government will take all effective measures to deal with inflation and unemployment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:19:29.978Z"
}
