{
  "title": "Health Minister hosts E-Kacheri to address public concerns",
  "link": "https://www.app.com.pk/national/health-minister-hosts-e-kacheri-to-address-public-concerns/",
  "date_published": "2024-03-14T12:49:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 14 (APP): Provincial Minister of Health, Syed Qasim Ali Shah presided over the first E-Kachehri live session on Thursday alongside Health Secretary Mahmood Aslam Wazir through social media website.\nWhile addressing the session, the minister said that engaging with the public through social media platforms is a sign of good governance and it bridges the gap between the government and its public.\nDuring the session, Minister Shah personally responded to queries and concerns raised by the public.\nSeveral key officials including Director General Health Dr. Shaukat Ali, Chief HSRU Dr. Khalil, Director General Drugs Dr. Abbas, Director General IMU Dr. Ijaz, Director Public Health Dr. Arshad Roghani, CEO Sehat Sahulat Program Initiative Dr. Riaz Tanoli, and other relevant stakeholders were also present on the occasion.\nThe session received around fifteen questions regarding health services in Khyber Pakhtunkhwa Medical Teaching Institutions (KP MTIz), most of which were addressed directly by Minister Qasim Ali Shah, while inquiries regarding specific matters were directed to the relevant authorities.\nHealth Secretary Mahmood Aslam Wazir highlighted at the onset of the session that addressing public complaints through social media platforms is an integral part of their professional responsibilities.\nQueries received regarding the Directorate General Health Services amounted to 20, with comprehensive responses provided by Dr. Shaukat Ali during the session.\nSimilarly, 15 questions about the Directorate General of Drugs and Pharmacies services were received, and responses were promptly provided by the relevant quarters.\nIn response to one query, the Project Director Human Capital Investment Program, Dr. Akram Allah disclosed that their project has initiated the Geo Tagging of private clinics under the supervision of the Health Care Commission.\nThe Geo Tagging of approximately 34,000 clinics across the province has already commenced, including nearly 20,000 quack clinics.\nAfter completing the Geo Tagging process province-wide, the Health Care Commission will present its recommendations to the health department for further action.\nImmediate action was taken to address complaints regarding Posting Transfer, Insulin availability, EPI, and other programs. Director General Health highlighted that salaries of employees engaged in projects will be resolved soon as the new government has formed.\nChief Executive Health Card, Dr. Riaz Tanoli, in response to a query, stated that after obtaining approval from the Board of Governors, the empanelment of hospitals in the health card system is expected to commence by late April.",
  "retrievedAt": "2025-08-11T01:18:49.735Z"
}
