{
  "title": "PM reviews five-year roadmap for economic progress",
  "link": "https://www.app.com.pk/national/pm-reviews-five-year-roadmap-for-economic-progress/",
  "date_published": "2024-03-14T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Prime Minister Shehbaz Sharif Thursday chaired a high-level review meeting on a five-year roadmap for economic progress of the country.\nThe five-year roadmap focused on decrease in inflation, poverty alleviation, and provision of employment.\nThe prime minister said consultation should be held on this plan with all stakeholders of different sectors of the economy.\nWithout wasting any time, implementation of projects for the economic stability and progress of the country should be ensured, he added.\nThe prime minister said a schedule of implementation for the projects should be presented, adding steps should be taken on priority basis to speed up progress in the sectors of agriculture, livestock, information technology, foreign investment and small and medium industries.\nHe said the government would reduce its expenditure and he would not allow further waste of money of poor people.\nHe said in the next five years, the country’s economy would be stabilized to put the country on the path of progress.\nThe PM said tax revenue would be increased with digitalization and technology, while the per acre yield in the agriculture sector would also be increased with the use of technology. The loss-making government institutions would be privatized on priority basis, he added.\nThe meeting was informed in detail about the roadmap for economic progress and about proposed measures in important sectors including electricity, agriculture, livestock, exports, small and medium enterprises, taxes, information technology, small and medium enterprises, investment, and privatization.\nFederal ministers Ahsan Iqbal, Muhammad Jehanzeb, Ahad Khan Cheema, Dr Musadiq Malik, Minister of State Shiza Fatima Khawaja, Jehanzeb Khan and high-ranking officers attended the meeting.",
  "retrievedAt": "2025-08-11T01:18:46.277Z"
}
