{
  "title": "PEC unites public and private universities of Southern Punjab for Engineering Education Reforms",
  "author": null,
  "content": "ISLAMABAD, Feb 19 (APP):Chairman Pakistan Engineering Council (PEC), Engr Waseem Nazir has taken a historic step in uniting all 11 public and private universities of Southern Punjab on a single platform for the first time to address key challenges in engineering education.\nAs part of PEC’s nationwide engineering education reforms drive, brainstorming sessions and a consultative workshop were hosted by NFC Multan.\nThe sessions brought together six key stakeholders-students, parents, alumni, faculty, industry and government officials-to engage in meaningful discussions.\nProminent Higher Education Institutions (HEIs) participating in the event included Bahauddin Zakariya University (BZU) Multan, MNS-UET Multan, MNS-University of Agriculture Multan, Khwaja Fareed University of Engineering and Information Technology (KFUEIT) Rahim Yar Khan, Islamia University of Bahawalpur, Institute of Southern Punjab (ISP) Multan and Multan University of Science and Technology, among others.\nThis landmark gathering provided a platform for HEIs to highlight pressing issues and foster dialogue for future reforms.\nAddressing the consultative workshop, the chief guest, Engr. Waseem Nazir emphasized the need for inclusive engagement with all stakeholders to bridge the gap between academia and industry. He announced that by the end of May, all 130 engineering HEIs across Pakistan will be covered through this consultative process, leading to policy recommendations aligned with the evolving demands of the international market.\n“All recommendations will be consolidated and presented at a mega event in Islamabad as part of the final round of discussions,” he stated.\nDuring the workshop, HEI representatives proposed integrating software tools and professional certifications into the engineering curriculum to enhance graduates’ skill sets.\nStakeholders also endorsed PEC’s initiative on Generative AI, recognizing its transformative potential for engineering education and research.\nA key recommendation was the establishment of a Center of Excellence Lab in the region to provide equal access to quality education for students across universities.\nAdditionally, participants suggested conducting a 10-year review of the Outcome-Based Education (OBE) model to evaluate its impact and effectiveness.\nVice Chairman PEC, Dr. Suhail Aftab Qureshi, along with PEC Governing Body Members, also attended the workshop. The Chairman PEC expressed his gratitude to Vice Chancellor NFC, Gen (R) Engr. Moazzam Ejaz, NFC administration and the Focal Person, Engr Muhammad Zeeshan Raza for hosting the sessions. The Vice Chancellor assured full support for PEC’s reform initiatives, reaffirming his commitment to advancing engineering education in Pakistan.\nThis initiative was widely appreciated, as it facilitated direct communication between academia and industry leaders, setting the stage for transformative reforms in engineering education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:53:34.810Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pec-unites-public-and-private-universities-of-southern-punjab-for-engineering-education-reforms/",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T09:28:00.000Z"
}
