{
  "title": "FOSPAH chairperson says anti-harassment law needs inclusion in syllabus for wider awareness",
  "author": null,
  "content": "ISLAMABAD, February 19 (APP): Chairperson Federal Ombudsperson Secretariat for Protection Against Harassment (FOSPAH) Fauzia Viqar on Wednesday expressing commitment to prevent harassment at workplace said the subject should be made part of educational curriculum so as to increase the scope of awareness about it.\nIn an exclusive interview with APP, she said FOSPAH redresses the complaints of harassment on merit and through transparency with the parties provided an equal opportunity to present their case.\nFauzia Viqar said the Cyber ​​Harassment and Online Harassment Act, 2016 is the best law against cyber harassment and online harassment, which provides relief to the complainant men, women and transgenders at their workplaces.\nShe mentioned that FOSPAH was given special powers in 2020 to protect the ownership rights of women in Islamabad, whether in case of inherited or purchased property, jewellery, security bonds, etc.\nThe FOSPAH, she said, received 4,577 complaints since its inception, including 3,692 complaints of harassment and 885 relating to property disputes.\nIn 2024, 90 percent of the complaints lodged with FOSPAH were disposed of, while in 2025, 115 cases have been registered to date, she said.\nFauzia said through anti-harassment law, women needed to raise voice for their rights if faced harassment or denied property rights.\nTerming the anti-harassment law as effective and result-oriented, she said harassment is a criminal offense under the Pakistan Penal Code. The law was created in line with the values ​​and morals of the society, while some loopholes were also rectified in 2024, she added.\nThe FOSPAH chairperson said ombudsperson gained an extended scope after the gender specification was given a legal cover. Also, steps are being taken for procedural improvement.\nShe said with time, awareness has been created about harassment, and even staring or stalking someone also falls under the unpleasant act of harassment.\nShe called the need for raising awareness about harassment at educational institutions by making the subject part of curriculum.\nFauzia Viqar said FOSPAH was working in collaboration with various institutions to conduct awareness campaigns against harassment.\nThrough Pakistan Telecommunication Authority (PTA), she said, FOSPAH’s anti-harassment messages were relayed to millions of cellular phone consumers, and the step received utmost appreciation by the public.\nShe mentioned that the awareness campaigns at public and private organizations, and educational institutions launched through electronic media, radio, television and social media resulted in significant increase in the number of complaints lodged with FOSPAH.\nShe said there were six offices of FOSPAH across the country and in all provinces. In Quetta, an ombudsperson office has recently become operational, while a sub-office has also been established in Multan with an aim to dispense speedy and free-of-cost justice to the victims of harassment at their doorsteps.\nAbout procedure, she said the victims can file a complaint by calling at FOSPAH on helpline number 03444367367 or at the website www.fospah.gov.pk.\nShe said FOSPAH’s experienced team deals the matter with full understanding about the sensitivity of the cases and resolves them in a simplified and straightforward manner. For redressal of property complaints, the focus is laid on alternative dispute resolution mechanisms so as to benefit the parties.\nFauzia Viqar said the Prevention of Electronic Crimes (PECA) Act 2016 is an effective law catering to the complaints of cyber harassment and online harassment. In case of electronic crimes, Federal Investigation Agency (FIA) can be contacted.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:52:43.223Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fospah-chairperson-says-anti-harassment-law-needs-inclusion-in-syllabus-for-wider-awareness/",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T14:21:00.000Z"
}
