{
  "title": "PTI presents ‘message of unity’, warns against toppling KP govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI Chairman Barrister Gohar Ali Khan on Wednesday said that the party was standing together and presenting a “message of unity” amid rumours of rifts while warning the federal government against toppling the party’s Khyber Pakhtunkhwa administration.\n\nBackground briefings revealed a complete lack of trust among PTI leaders, with doubts about each other’s sincerity and intentions, particularly regarding messages from party founder Imran Khan, who has been behind bars since August 2023.\n\nAddressing a press conference in Islamabad and flanked by senior PTI leaders, the party chairman outlined the issues discussed in a high-level meeting and maintained that the PTI would continue efforts to try and free Imran.\n\n“We discussed the aftermath of the reserved seat ruling, which was the first time that the party formed a strategy together,” Gohar said. “It is our decision that we will stand up together for Imran Khan. We have no personal conflict, we are and will remain united and a message of unity needed to be sent in today’s meeting.”\n\nGohar added that the meeting discussed Imran’s plan for the party to launch a protest movement, stating: “Whatever Khan sahib decides, we will execute it.”\n\nGohar said that PTI MNAs, MPAs and senators all attended today’s meeting, which discussed a wide range of issues from the reserved seats verdict and the party’s direction to addressing dialogue with the government.\n\n“Whatever direction will be announced, you will see it in due course.”\n\nDiscussing the letter from jailed PTI leaders suggesting dialogue with the government, Gohar noted that the media would often infer that the government extended offers for talks, which were rejected by the PTI.\n\n“This is incorrect, from the beginning, Khan sahib said that there should be dialogue,” Gohar said. “Even after our mandate was stolen, he said that. You have taken our seats, but you have registered cases against three of our MNAs, yet Khan sahib says that dialogue needs to be meaningful,” the party chairman added.\n\nGohar said that there was no delay on the PTI’s part, but said that the government was “not sincere” since it refused to grant the party access to Imran.\n\nTalking about the reserved seats, he noted that there were 25 seats from KP. “Even if these seats go to the opposition … then they are 35 members short. We will protect the KP government at all costs,” Gohar stated. “Those who want to bring a no-confidence motion do not have the required numbers to move even a resolution.”\n\nPTI KP President Junaid Akbar said that all of the provincial political leadership was also present at the meeting and stressed that within the party, decisions by the founder were respected by all members, with “discord set to one side”.\n\nMeanwhile, KP Chief Minister Ali Amin Gandapur challenged other parties and institutions to topple the PTI’s government in KP.\n\n“If you have it in you, I challenge your strength and I challenge the state … if you are able to topple our government, then I will leave politics,” he stated.\n\nHe criticised the government, saying that it was a “disgraceful stain on the state and its institutions” within the country’s political history, but “they are not ashamed”.\n\n“We are time-tested people who have given sacrifices … So this is a challenge to your powers to try anything only without any conspiracies or unconstitutional ways. But you cannot do it. You cannot topple Khan’s people.”\n\nSpeaking on the Feb 8 elections, PTI Secretary General Barrister Salman Akram Raja said that they would always be remembered as the most “democratic day” in history, along with the “attack on Pakistani people”, referring to the election results.\n\n“We will continue to struggle for the public. We will succeed. Do not think that by stealing seats, suppressing the judiciary, the people will step back. We are with the people.”\n\nHe further said, “We stand with Imran’s struggle for the public. We will continue to struggle for the public.”\n\nMeanwhile, party spokesperson Sheikh Waqqas Akram said the assembled leadership passed a unanimous resolution against the Constitutional Bench’s verdict on reserved seats and stated that the party would work to ensure the release of Imran and other jailed PTI leaders.\n\n“Legal action, peaceful protest and negotiation are steps we are willing to take,” Akram said, quoting the resolution. He too said the party was united under Imran’s leadership and would remain so.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/021903135cc3898.png",
  "retrievedAt": "2025-08-17T19:28:41.885Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921664/pti-presents-message-of-unity-warns-against-toppling-kp-govt",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T14:46:21.000Z"
}
