{
  "title": "Balochistan govt disburses Rs50bn on first day of FY26 - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan government has released Rs50 billion on the very first day of the new financial year for immediately initiating work on projects under the public sector development programme (PSDP).\n\nThe finance department issued a formal notification shortly after midnight on July 1, signalling the official commencement of development activities across the province.\n\nThe release of development funds for the execution of public sector development projects on the very first day of the financial year is rare.\n\nOfficial sources said Chief Minister Sarfraz Bugti has decided to start the work on development projects included in the PSDP and asked the Finance Department to release development funds without any delay.\n\nFinance Minister Shoaib Nosherwani has also indicated in his post-budget press conference that the government would immediately start the work on development projects. The aim is to finish ongoing development schemes on which 80 to 90 per cent work has been completed.\n\nIn the outgoing financial year, the provincial government consistently monitored development schemes through regular review meetings and adopted a result-oriented strategy, which enabled efficient utilisation of resources and timely completion of key public interest projects. Continuing this momentum, the early release of such a large allocation underscored the government’s seriousness in delivering development outcomes without bureaucratic delay.\n\nFinance Department officials said the released funds would be utilised for fast-tracked execution of projects in sectors such as health, education, irrigation, road infrastructure, drinking water, and energy, among others. This is expected to enable public to benefit from development schemes at the earliest.\n\nThe CM Office emphasised that the move is not only indicative of the government’s administrative efficiency but also serves as a model for other provinces, showcasing a new paradigm of integrated planning, execution, and fiscal responsibility in Balochistan.\n\nThe timely disbursement of development funds reaffirms the provincial government’s commitment to improving public welfare, enhancing infrastructure, and achieving broader socio-economic development goals.\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/1413071993b8f57.png?r=130940",
  "retrievedAt": "2025-08-17T19:30:36.022Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921549/balochistan-govt-disburses-rs50bn-on-first-day-of-fy26",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:55:43.000Z"
}
