{
  "title": "Making a misogynist - Pakistan - DAWN.COM",
  "author": null,
  "content": "AS news of Sana Yousaf’s murder by a man she had rejected spread, many noticed disturbing comments among condolences on social media.\n\n“Laugh now. You’ll answer later,” one commented, imagining the inquisition in the grave over the perceived sin of online visibility. “Happy to see these things happening,” read another. Others moralised: “Encou­raging young women to seek attention or expose themselves can have serious negative consequences.”\n\nThat some believe a teen’s online presence justifies murder is horrifying. Worse: it’s not surprising.\n\nSana’s murder is not an isolated tragedy. In April, another student, Eman Afroz, was killed in her hostel. These femicides, and the celebratory social media responses, are symptoms of a deeper crisis, as UN Women warns: the radicalisation of boys and men through the ‘manosphere’, online networks promoting anti-feminist, misogynistic, and often violent ideologies.\n\nFrom Andrew Tate to Jordan Peterson, these men offer a seductive narrative: men are victims of a feminist conspiracy and reclaiming ‘natural dominance’ is the only path forward. This culture, where abuse is normalised and blame shifted to the victim, is not just growing, it’s metastasising.\n\nNews of Pakistan ranking last in the Global Gender Gap Index sparked debate but most of it focused on representation. While uplifting women and girls remains vital, what about the other side of the coin? With 64 per cent of the country under 30, ignoring the narratives our boys are consuming, risks locking an entire generation into a regressive worldview that threatens our collective future.\n\nThis is a global problem. In Latin America, rising femicide is matched by brutal online discourse. In the US, reproductive rights have been rolled back so severely that miscarrying can land women in legal trouble. After Trump won, women’s social media was flooded with ‘your body, my choice’, a subversion of ‘my body, my choice’, which represents bodily autonomy in the context of sexual violence and reproductive rights. The Pakistani version (’mera jism, meri marzi’) has long been targeted with the call for autonomy often reduced to sexual freedom.\n\nThis culture, where abuse is normalised, is metastasising.\n\nSociologists define toxic masculinity as involving socially harmful aspects of hegemonic masculinity that normalise violence, encourage emotional suppression in men leading to depression and substance abuse, and create an unsafe environment for all. Pakistan is not immune. Elements of the manosphere have infiltrated Muslim discourse, often under the guise of traditionalism, perhaps best encapsulated through Tate’s flirtation with Islam.\n\nFigures like Peterson are held up as intellectual authorities, despite openly supporting Israel’s bombing of Gaza. When Peterson urged Netanyahu to “give them hell”, some Muslim fans felt betrayed yet continued to disseminate his messages. This laundering of Western reactionary thought through an Islamic lens is dangerous. It cloaks bigotry in tradition and patriarchy in piety. It makes misogyny seem like religious obligation rather than what it is: a social disease.\n\nWe already see the results. Aurat March is dubbed be-haya by preachers who claim women should remain hidden because the Arabic root of ‘aurat’ means’private part’. Many believe Pakistan’s religious and cultural spaces increasingly echo ideologies of the global far right. When language encodes women’s inferiority as divine will, it becomes near-impossible to challenge.\n\nThis ideology of domination is not limited to gender. It elevates Pu­­tin over Zele­n­sky, Israel over Palestine, stre­ngth over diplo­macy, conquest over compassi­­on. It’s behind the attacks on USAID and the rollback of en­v­ironmental protections. Domestic violence is never just personal. Researchers have found links between domestic abuse and terrorism, between the desire to control women and the broader desire to dominate others. Oppressive regimes — from Hitler’s Germany to Zia’s Pakistan — see controlling women as a foundational pillar.\n\nPakistan is at a crossroads. We cannot ignore this ideological assault on our boys. We must ask: what are they consuming? Who are their role models?\n\nParents, educators and policymakers must prioritise gender literacy, digital literacy, and emotional education. Civil society must push for better online regulation and support. Religious scholars and influencers must confront the misuse of faith to justify hate.\n\nThis is an existential threat. A generation of young men is being taught empathy is weakness, domination is destiny and violence is virtue. We must offer something better. Before more girls are murdered. Before more boys lose their humanity.\n\nThe writer is a consultant at the Ministry of Planning. Her forthcoming book Empathy Industry is under contract with Manchester University Press.\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6864797c9e3d2.jpg",
  "retrievedAt": "2025-08-17T19:29:26.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921587/making-a-misogynist",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:57:03.000Z"
}
