{
  "title": "Inflation slumps to 9-year low at 4.49pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The annual inflation rate dropped sharply to 4.49 per cent during the fiscal year 2024-25 from 23.41pc in the previous year, mainly due to high base effect, a decline in food prices and lower transport costs, the government ann­ounced on Tuesday. This marks the lowest inflation rate since FY16, when it stood at 2.9pc — a nine-year low.\n\nPakistan is currently experiencing disinflation, which reflects a slowdown in the rate of inflation, as opposed to deflation, which indicates a general decline in overall price levels. According to the Pakistan Bureau of Statistics (PBS), average cumulative inflation over the past 53 months has risen by 83pc, significantly affecting retail prices of consumer goods. Despite the recent decline in inflation, the cost of living remains elevated.\n\nThe State Bank of Pakistan has revised its inflation target for FY25 to a range of 5-7pc, down from the government’s initial projection of 12pc. The International Mon­etary Fund has also lowered its inflation forecast for the same period to 9.5pc, compared to its earlier estimate of 12.7pc. For FY26, the government has set an inflation target of 7.5pc.\n\nThe inflation rate in June recorded a growth of 3.2pc, slightly eased from 3.5pc recorded in May. This decline was mainly contributed by a slight decrease in the prices of food items during the month under review.\n\nThe headline inflation, measured by Consumer Price Index (CPI), increased by 0.2pc in June on a month-on-month basis, according to data released by the PBS on Tuesday.\n\nThe annual inflation, however, fell short of the projected targets. Analysts attributed the decline to lower global commodity prices, stable exchange rates, higher base effect and better agricultural outputs.\n\nOver the past 12 months, the average monthly inflation has shown fluctuations.\n\nThe inflation rate in June 2025 was the lowest mainly due to the high base effect from the previous year (June 2024 — 12.6pc).\n\nThe CPI inflation dropped to 9.6pc in August 2024, marking the first single-digit figure in over three years, and the downward trend continued in the following months.\n\nFood inflation for June recorded a positive growth of 4.2pc in urban areas and 2.4pc in rural areas, whereas non-food inflation was 2.2pc in urban areas and 4.7pc in rural areas.\n\nThe food prices rebounded to a positive trend after a decline in four consecutive months.\n\nCore inflation, which excludes volatile food and energy prices, was recorded at 6.9pc in urban areas and 8.6pc in rural areas in May.\n\nIn urban areas, the food items whose prices saw the month-on-month increase in June included tomatoes (57.33pc), potatoes (25.74pc), onions (15.26pc), eggs (8.82pc), gur (2.75pc), rice (1.67pc), wheat flour (1.53pc), sugar (1.52pc), fresh fruits (1.38pc), milk powder (0.78pc), milk fresh (0.40pc) and milk products (0.35pc).\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0117155573ad0f0.jpg?r=171603",
  "retrievedAt": "2025-08-17T19:30:55.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921571/inflation-slumps-to-9-year-low-at-449pc",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:55:30.000Z"
}
