{
  "title": "Ukraine left scrambling after US says halting some arms shipments - World - DAWN.COM",
  "author": null,
  "content": "Ukraine appealed to the United States for clarity on Wednesday after it was caught off guard by a White House announcement that Washington was halting some arms shipments to the war-battered country.\n\nThe Ukrainian defence ministry, which is deeply dependent on US arms, said it had not been notified about the reduction in aid announced one day earlier.\n\nMoscow revelled in the decision, saying it could bring the end of the war closer. Any slowdown in US support could harm Kyiv’s ability to fend off escalating Russian aerial bombardments or frontline gains.\n\nKyiv has long feared halts to US aid after Donald Trump returned to the White House in January, having criticised the tens of billions of dollars in support and weapons sent by his predecessor, Joe Biden.\n\n“It will [be] even more scary, even more painful, and even more civilians will suffer,” Kyiv resident Yevgenia Prysiazhna told AFP, referring to an uptick in overnight drone and missile attacks on Ukraine.\n\n“I really hope that this is a temporary decision,” the communications manager said.\n\nJohn Ginkel, the deputy chief of mission at the US embassy in Kyiv, was summoned by the foreign ministry — a rare diplomatic move usually reserved for foes and rivals, not vital allies — given uncertainty about what the cuts would mean for Kyiv.\n\n“The Ukrainian side stressed that any delay or procrastination in supporting Ukraine’s defence capabilities would only encourage the aggressor to continue the war,” Ukraine’s foreign ministry said.\n\nThe White House had said it was halting some key weapons shipments promised by the previous US administration, without elaborating.\n\nUnder Biden, Washington spearheaded Western support for Ukraine, with Congress having approved more than $100 billion in aid, including $43bn in weaponry.\n\nTrump instead has pushed the two sides into peace talks, including in phone calls with Russian President Vladimir Putin — who rejected calls for a ceasefire and demanded Ukraine cede more territory if it wants Moscow to halt its invasion, launched in 2022.\n\nThe US president refused to announce new packages and Kyiv has been corralling Washington’s European allies to step up support.\n\nKyiv remains “seriously dependent” on US arms supplies, a high-ranking source in the Ukrainian military told AFP.\n\n“Europe is doing its best, but it will be difficult for us without American ammunition,” the source added.\n\nA May report by the Centre for Strategic and International Studies (CSIS) said Europe “had only made limited progress” in strengthening its defence industries.\n\nBut it said that “continued US aid remains extremely important for Ukraine’s long-term effectiveness on the battlefield”.\n\nIn Moscow, the Kremlin said reducing weapons deliveries to Kyiv would help end the conflict.\n\n“The fewer the number of weapons that are delivered to Ukraine, the closer the end of the special military operation,” Kremlin spokesman Dmitry Peskov told reporters in response to a question by AFP, using Russia’s term for its more than three-year offensive.\n\nThe White House told AFP in an email that the decision to reduce shipments was taken following a “review of our nation’s military support and assistance to other countries”.\n\nKyiv said it was caught off guard by the move. The defence ministry said the country had “not received any official notifications” on the issue.\n\n“The path to ending the war lies through consistent and joint pressure on the aggressor, as well as through continued support for Ukraine,” it added.\n\nPolitico and other US media reported that missiles for Patriot air defence systems, precision artillery and Hellfire missiles are among the items being held back.\n\nRussia has ramped up attacks on Ukraine in June, launching nearly twice as many missiles and over 30 per cent more drones than in May, according to an AFP analysis of Ukrainian air force data.\n\nKyiv was in June subjected to at least four fatal attacks that left over 40 dead — and its residents worried that a cessation of US aid would leave the capital even more vulnerable.\n\n“We had gotten used to seeing America as a country of values, a country that defends democracy,” Igor Stambol, a Kyiv resident, told AFP.\n\n“But there is hope that they will remember their values,” the 36-year-old added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/02191328aa72dd0.jpg",
  "retrievedAt": "2025-08-17T19:28:31.639Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921665/ukraine-left-scrambling-after-us-says-halting-some-arms-shipments",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T15:30:03.000Z"
}
