{
  "title": "Pakistan players make strong starts in Asian junior squash - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan players made an impressive start to their campaign at the Asian Junior Individual Squash Championships 2025, securing victories in seven out of nine matches on the opening day of the tournament in Gimcheon, South Korea, on Tuesday.\n\nAccording to the Pakistan Squash Federation (PSF), the national contingent produced dominant performances across various age categories, demonstrating skill and composure against regional counterparts.\n\nIn the boys’ under-19 category, Pakistan’s top seeds advanced with ease. Abdullah Nawaz outplayed Tharul P of Sri Lanka in straight sets 11-5, 11-4, 11-7, while Anas Ali Shah comfortably defeated Indonesia’s Mohammad R 11-3, 11-5, 11-6.\n\nMohammad Umair Arif impressed in the boys’ U-17 division, registering a straight-set victory over Lau P.T. of Hong Kong (11-3, 11-8, 11-9). However, team-mate Yahya Khan fell short in a five-game battle against Malaysia’s Ivan C.J.Y., losing 11-8, 11-5, 6-11, 1-11, 6-11.\n\nThe boys’ U-15 matches saw one-sided wins for Pakistan. Nauman Khan outclassed Aisoon J of Thailand 11-0, 11-0, 11-3, while Ahmad Rayyan Khalil cruised past Lonitha B of Sri Lanka 11-4, 11-0, 11-0.\n\nIn the boys’ U-13 category, Muhammad M went down fighting against Malaysia’s seeded player Mohammad S, losing 13-11, 11-8, 11-9.\n\nOn the girls’ side, Pakistan also enjoyed a successful day. Mehwish Ali swept aside South Korea’s Yeona K 11-0, 11-2, 11-0 in the girls’ U-17, while Sehrish Ali defeated Cao C.I. of Macau 13-11, 11-5, 11-7 in the girls’ U-15 event.\n\nIn the girls’ U-13 category, Mahnoor Ali produced a clinical display to overcome Prinprapha P of Thailand 11-0, 11-1, 11-1, rounding off a strong day for the Pakistan contingent.\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/02122451de7b7e8.jpg",
  "retrievedAt": "2025-08-17T19:30:16.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921492/pakistan-players-make-strong-starts-in-asian-junior-squash",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:55:57.000Z"
}
