{
  "title": "Quad ministers condemn Pahalgam attack without naming Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Quad grouping of the United States, India, Japan and Australia called on Tuesday for the perpetrators of a militant attack that killed 26 in India-occupied Kashmir to be brought to justice without delay.\n\nThe April 22 attack in held Kashmir’s Pahalgam sparked heavy fighting between nuclear-armed India and Pakistan in the latest escalation of a decades-old rivalry as India blamed it on Pakistan, which strongly denied the allegations while calling for a neutral investigation.\n\nThe US State Department issued a joint statement by the foreign ministers of the grouping, who met in Washington, but stopped short of naming Pakistan or blaming Islamabad.\n\n“The Quad unequivocally condemns all acts of terrorism and violent extremism in all its forms and manifestations, including cross-border terrorism,” the ministers said in the statement.\n\nThey called on all members of the United Nations to cooperate actively with “all relevant authorities” in delivering justice to the “perpetrators, organisers, and financiers of this reprehensible act”, without any delay.\n\nIndia is an increasingly important US partner in Washington’s effort to counter China’s rising influence in Asia, while Pakistan is a strong partner in counterterrorism efforts.\n\nOn May 7, Pakistan shot down six Indian jets after they bombed sites across the border that New Delhi alleged were “terrorist infrastructure”, setting off an exchange of attacks between the two countries by fighter jets, missiles, drones and artillery that killed dozens until a ceasefire on May 10.\n\nThe ceasefire was first announced by US President Donald Trump on social media after Washington held talks with both sides, but India has differed with Trump’s claims that it resulted from his intervention and threats to sever trade talks.\n\nIndia’s position has been that New Delhi and Islamabad must resolve their problems directly and with no outside involvement.\n\nOn Monday, India’s foreign minister, Subrahmanyam Jaishankar, restated its position that trade was not a factor in the ceasefire.\n\n“Relationships will never be free of issues,” he said, referring to the United States, adding, “What matters is the ability to deal with it and to keep that trend going in the positive direction.”\n\nLast week, defence ministers attending a Shanghai Cooperation Organisation (SCO) meeting failed to adopt a joint communiqué as New Delhi refused to sign the statement over the exclusion of language referring to the Pahalgam attack.\n\nThe discord was a rare outcome for the 10-member Eurasian bloc that prides itself on consensus-based decision-making.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/02134046c4fb4af.png",
  "retrievedAt": "2025-08-17T19:29:12.713Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921615/quad-ministers-condemn-pahalgam-attack-without-naming-pakistan",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T08:11:25.000Z"
}
