{
  "title": "Two CIA men suspended in Sindh after celebratory firing causes panic among people - Pakistan - DAWN.COM",
  "author": null,
  "content": "THATTA/HYDERABAD: Two trigger happy CIA officials have been suspended for causing panic and fear in localities around their centre in Thatta by resorting to heavy firing.\n\nThey were celebrating grant of bail to their immediate boss in a case pertaining to the manhandling of Mirpur Sakro taluka chairman and a journalist in custody in the last week of April.\n\nAs soon as a Thatta court granted bail to the in-charge of the local CIA Centre, Mumtaz Brohi, his colleagues at the centre resorted to heavy celebratory firing which had caused a great deal of panic and fear among residents of the nearby localities.\n\nSeveral videos of the celebration were posted on social media platforms which went viral and people started condemning the CIA men.\n\nOfficials were rejoicing grant of bail to their in-charge in custodial torture case\n\nTaking notice of the matter, Thatta SSP Dr Imran Khan took action against a couple of the errant CIA men after identifying them with the help of the videos.\n\nThe SSP suspened Inspector Momin Shaikh and his colleague Mukhtiar Kalhoro and instituted an inquiry against them.\n\nThe videos showed them using their official weapons for the celebration while sweets were being distributed among a large group of police and CIA personnel at the CIA Centre.\n\nMumtaz Brohi, said to be well-connected in political quarters, was accused of subjecting Mirpur Sakro taluka chairman Iqbal Ahmed Khaskheli and a journalist, Yousuf Shaheen, at the centre after arresting them on April 26 on the charges of attacking a police station.\n\nOn May 5, Judicial Magistrate-I of Thatta Mohammad Waqas Afzal in his order mentioned that Khaskheli and Shaheen had moved an application seeking an inquiry under the supervision of the National Commission for Human Rights (NCHR) into the alleged torture on them during police remand.\n\nThe judge ordered the FIA to investigate the case under NCHR supervision. Khaskheli was called by police and booked in three cases in row this year, besides other cases filed in 2008, 2011, 2017 and 2024. He told FIA that he was tortured by Mumtaz Brohi and two SHOs. According to Khaskheli, he was arrested along with the journalist on April 26 when they were called for criminal record office (CRO) verification. He said he had attended lawyers’ sit-in in Babarloi, Khairpur, where he had delivered a speech. He alleged that he was beaten black and blue in custody by SHOs of Makli and Mirpur Sakro police stations, besides Inspector Mumtaz Brohi.\n\nSubsequently, the FIA arrested Brohi in line with the court order when he arrived at the FIA office for having his statement recorded following a series of notices. He had failed to appear before FIA investigating officer (IO) Zubair Yusufani in response to two previous notices.\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:29:46.680Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921473/two-cia-men-suspended-in-sindh-after-celebratory-firing-causes-panic-among-people",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:56:15.000Z"
}
