{
  "title": "Jaishankar again disputes Trump’s ‘South Asia’ ceasefire claim - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Indian External Affairs Minister S. Jaishankar, currently in Washington to participate in a Quad meeting, has again publicly challenged US President Donald Trump’s assertions that he brokered a ceasefire between India and Pakistan, following a military escalation between the two nuclear armed neighbours in May this year.\n\nIn an interview with Newsweek, Jaishankar firmly denied Trump’s version of events, saying: “I can tell you that I was in the room when Vice President [JD] Vance spoke to Prime Minister Modi on the night of May 9.”\n\n“There was no linking of trade and ceasefire,” he added.\n\nJaishankar recalled that Vance warned Modi that Pakistan was preparing for a large-scale attack.\n\nTells Newsweek he was ‘in the room’ when Vance spoke to Modi, claims trade was never discussed\n\n“We did not accept certain things,” he said, noting that Modi remained unfazed and signalled that India would respond decisively.\n\nThe next morning, he claimed, US Secretary of State Marco Rubio informed him that Pakistan was ready to talk. Later that day, Pakistan’s Director General of Military Operations, Major General Kashif Abdullah, directly contacted his Indian counterpart to request a ceasefire, the Indian minister asserted.\n\nThe remarks offer the first detailed Indian account of how the standoff ended — a version that contradicts Trump’s narrative. There was no official reaction from Pakistan’s Foreign Office until going to press.\n\nThe US president insists it was his personal intervention — via trade pressure and high-level calls — that prevented a nuclear conflict between the two South Asian neighbors.\n\nIndia has publicly expressed frustration over what it sees as the Trump administration’s increasing tendency to insert itself into India-Pakistan affairs — particularly on the Kashmir issue. Trump’s repeated offers to “mediate” have drawn strong reactions in New Delhi, which has long rejected third-party involvement.\n\nTrump has not only taken credit for defusing the May standoff but also praised Pakistan’s military leadership for its restraint — suggesting their cooperation made a peaceful resolution possible. While this framing may serve Washington’s broader diplomatic aims, it sits uneasily with New Delhi.\n\nIslamabad, by contrast, has welcomed Trump’s acknowledgment of its role in easing the crisis. His remarks crediting an unnamed “quiet but decisive” Pakistani general are widely seen as referring to Field Marshal Asim Munir, the army chief.\n\nThe army chief’s Munir’s recent visit to Washington — which included a White House meeting — marked a significant breakthrough after years of limited military engagement.\n\nFollowing the visit, Secretary Rubio made two phone calls to Prime Minister Shehbaz Sharif, further fuelling speculation about US efforts to play a back-channel role in managing tensions in South Asia.\n\nIn remarks at a separate engagement, Jaishankar declared that India will not “yield to nuclear blackmail” while responding to alleged terrorist attacks, reaffirming New Delhi’s claim that the May 9 strikes inside Pakistan were retaliation for the Pahalgam incident.\n\nLater, at a news briefing in Washington following a Quad meeting, Jaishankar appeared to hurl a veiled warning at Pakistan when he said: “The world must display zero tolerance [towards terrorism]. Victims and perpetrators must never be equated, and India has every right to defend its people against terrorism. And we will exercise that right. We expect our Quad partners to understand and appreciate that.”\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/11211100c66bbfe.png?r=211113",
  "retrievedAt": "2025-08-17T19:30:50.538Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921534/jaishankar-again-disputes-trumps-south-asia-ceasefire-claim",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:55:37.000Z"
}
