{
  "title": "Tariff cut of Rs1.14 fails to satisfy businessmen - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Govt works out power tariff to be Rs31.59/unit compared to Rs32.73/unit last year\n• Industrialists demand end to peak, off-peak charges; decry denial of promised ‘sizeable relief’\n• No change in rates for first two slabs of domestic consumers; relief ranges between 3pc and 10pc depending on usage\n\nISLAMABAD: As the National Electric Power Regulatory Authority (Nepra) decided on Tuesday to reduce the national average power tariff by Rs1.14 per unit, the move was criticised by industrialists and businesspersons from Karachi as being “too minuscule”.\n\nThe decision to reduce the tariff was taken at a public hearing presided over by Nepra members Maqsood Anwar and Rafique Shaikh.\n\nThe government team, led by the Power Division additional secretary, Mehfooz Bhatti, said the regulator had determined national average tariff — excluding all taxes, surcharges and duties — at Rs34 for FY2025-26, down Rs1.50 per unit from Rs35.50 per unit last year.\n\nAfter subsidies and cross-subsidies, the government has worked out the tariff to be Rs31.59 per unit, as compared to Rs32.73 per unit last year, a reduction of Re1.14 per unit.\n\nThe official said the same rate would apply to K-Electric consumers under the government’s uniform tariff policy.\n\nA formal notification of the new tariffs will be issued within this week. The new rates will take effect from July 1.\n\nRushed process\n\nKarachi-based representatives of the FPCCI, Karachi Chamber of Commerce and Industry, Korangi Association of Trade and Industry and Surjani Town businesses criticised the government and the Nepra for rushing through the approval process and not allowing their requests for time to understand and review the government’s petition.\n\nThey said the Power Division filed the petition on June 28. It was approved a day later by the federal cabinet and made public on June 30 for a hearing on July 1.\n\nThey said the process violated the law that provided at least seven days after the publication of petition to hold a public hearing.\n\nPeak, off-peak billing\n\nThe industrialists criticised the government for a nominal reduction of Rs1.14 per unit in the tariff after promising “sizeable relief”.\n\n“Even after the reduction of Rs1.14 per unit, the effective tariff would be about Rs5 per unit higher than last year when the industry paid on average Rs30 per unit”, said one of the businessperson.\n\nThe government team insisted the effective average tariff during the new fiscal year would be around Rs40.43 against Rs47.89 per unit in FY2025 after taking into account all taxes, surcharges, duties and quarterly adjustments and the removal of PTV fee and electricity duty.\n\nThey said the government efforts, coupled with improved exchange rate, helped reduce capacity payments by Rs1.27 per unit on average from 30.88 to Rs29.61 per unit when compared to the outgoing year.\n\nThe average transmission and distribution losses of Discos, they claimed, had dropped to 11.03pc from 11.43pc.\n\nIndustrial consumers also demanded an end to peak and off-peak rates, enabling the industry to operate round-the-clock instead of shutting down during peak hours due to higher rates.\n\nNew tariff\n\nThe Rs1.15 per unit reduction in tariff would apply to consumers in almost all categories, except lifeline domestic consumers.\n\nThere would be no change in electricity rates for first two lifeline slabs of domestic consumers, as they are already over-subsidised.\n\nThe per unit rate for lifeline consumers with up to 50 units per month would remain unchanged at Rs3.95, followed by Rs7.74 for those in 50 to 100 unit monthly consumption. They have to maintain their consumption threshold throughout the year.\n\nFor all other consumers and categories, the government sought a flat Rs1.15 per unit reduction for FY2025-26.\n\nHowever, the relief ranges between 3 to 10pc depending on the users’ respective rates at present.\n\nThe protected consumers in 1 to 100 units would now be charged at Rs10.54 per unit, instead of Rs11.69 at present, showing a reduction of 9.8pc.\n\nThe subsequent slab in the protected category would be charged at Rs13.01 per unit instead of Rs14.16 per unit, down 8pc.\n\nThe non-protected consumers in first 100 units would be charged at Rs23.44 per unit instead of Rs23.59 per unit, down by almost 5pc.\n\nThe reduction in rates for all other categories including commercial, industrial, agriculture and bulk consumers would vary from three to four percent but flat Rs1.15 per unit. The cheapest rate, in these categories, have been provided to the industry whose average rate would now be Rs33.48 per unit instead of Rs44.32 per unit.\n\nCommercial consumers would be provided electricity at an average Rs45.43 per unit instead of Rs46.58 per unit. The average rate of general services would be Rs43.17 per unit instead of Rs44.32 while tariff for bulk consumers would come down to Rs41.76 per unit from Rs42.92 per unit.\n\nHowever, agricultural consumers would get an even cheaper rate of Rs30.75 per unit instead of Rs31.90. The average rate would work out to be around Rs31.60 per unit from about Rs32.75 per unit at present.\n\nPublished in Dawn, July 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:31:03.896Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921573/tariff-cut-of-rs114-fails-to-satisfy-businessmen",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T00:55:30.000Z"
}
