{
  "title": "UPenn bans transgender athletes following swimming furore - World - DAWN.COM",
  "author": null,
  "content": "The University of Pennsylvania has agreed to ban transgender athletes from its women’s sports teams, settling a federal civil rights case stemming from the furore around swimmer Lia Thomas, the US government said on Tuesday.\n\nThe US Department of Education said in a statement that UPenn had entered into a resolution agreement vowing to comply with Title IX, the federal law which prohibits sex-based discrimination in any educational program.\n\nIt follows an investigation by the department’s Office for Civil Rights, which found the university had violated Title IX by allowing transgender swimmer Thomas to compete in women’s competitions in 2021-2022.\n\nUS President Donald Trump, who campaigned on the issue of trans athletes, has worked to prohibit them from competing in girls’ and women’s sports since returning to office.\n\nTrump issued an executive order in February aimed at banning transgender athletes, allowing federal agencies to halt funding to any institution that does not consider birth-assigned genders in determining sex.\n\nUS Secretary of Education Linda McMahon said in a statement on Tuesday that the resolution of the UPenn case marked a “great victory for women and girls … across our nation”.\n\n“The Department commends UPenn for rectifying its past harms against women and girls, and we will continue to fight relentlessly to restore Title IX’s proper application and enforce it to the fullest extent of the law.”\n\nUnder the terms of the settlement, UPenn will restore all individual swimming records and titles to female athletes affected by Thomas’s participation.\n\nThe university will also send a “personalised letter of apology” to each swimmer impacted by the case.\n\nThe college will also be required to issue a public statement specifying it will “not allow males to compete in female athletic programmes” or use Penn Athletics facilities for women, such as locker rooms.\n\nThomas became a lightning rod around the debate of transgender athletes in women’s sports after competing in female collegiate competitions in 2022.\n\nShe had earlier swum on UPenn’s men’s team while undergoing hormone replacement therapy.\n\nHer participation in women’s events sparked widespread outrage, with critics and some fellow swimmers saying she should not have been allowed to compete due to an unfair physiological advantage. Her supporters argued she should be allowed to compete as a woman.\n\nOne of Thomas’s competitors, Riley Gaines, welcomed Tuesday’s announcement.\n\nGaines has been a long-time critic of Thomas’s participation in women’s collegiate swimming, and tied for fifth place with her in the 200-yard freestyle at a national collegiate meeting in 2022.\n\n“It is my hope that today demonstrates to educational institutions that they will no longer be allowed to trample upon women’s civil rights, and renews hope in every female athlete that their country’s highest leadership will not relent until they have the dignity, safety, and fairness they deserve,” Gaines said in a statement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/02125423a58966a.png",
  "retrievedAt": "2025-08-17T19:29:10.764Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921606/upenn-bans-transgender-athletes-following-swimming-furore",
  "dateList": "2025-07-02",
  "date_published": "2025-07-02T07:29:02.000Z"
}
