{
  "title": "President calls for adoption of universal values to promote interfaith harmony, peace",
  "link": "https://www.app.com.pk/national/president-calls-for-adoption-of-universal-values-to-promote-interfaith-harmony-peace/",
  "date_published": "2023-08-11T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP):President Dr Arif Alvi on Friday underscored the need for the world to go back to its universal values to promote interfaith harmony and peace, resolve conflicts, end poverty and oppression, and tackle issues like global warming.\nSpeaking at a ceremony on the occasion of National Minorities Day, he urged the leaders of all religions to work together and spread the message of unity, peace and love for the people.\nThe Ministry of Religious Affairs and Interfaith Harmony observed the day every year on August 11.\nThe president said observation of the day was a pledge that the state would take practical steps to protect and promote the rights of minorities.\nHe appreciated the prime minister of Sweden for showing leadership on the issue of Islamophobia and after the acts of desecration of Holy Quran. He lamented that in many instances religion was being used for vested interests and to exploit people.\nThe president appreciated the government for fulfilling its responsibility to restore religious sites damaged in various incidents in the past.\nHe was of the view that Islam was a religion of community and its basis was to take care of the poor and feed the hungry, and this Islamic tradition was also prevalent in other religions which stressed on alleviating suffering of the poor and needy. Prophet Isa fed the poor and with his miracles restored eyesight and revived health to the diseased, he remarked.\nPresident Alvi said nowadays states were bereft of moral and ethical values and even today they were waging wars and killing humanity.\nHe emphasized that Islam was a forward looking religion as it protected rights of women and gave them inheritance rights way before those rights were accepted by the Western world. Women should be encouraged to enter all walks of life, including the business world and contribute to economic development of the country, he added.\nHe also asked the religious minorities to come forward and apply for jobs according to the quotas prescribed in the Constitution. The government institutions were willing to take affirmative actions to fill jobs as per quotas, he add.\nSimilarly, he said, banks in the past had hired chartered accountants and prepared feasibility studies to facilitate women in getting loans for starting their businesses. Unfortunately not many women sought loans, he said, adding the government and political parties should be more proactive in encouraging women to avail loans offered by the banks.\nHe categorically stated that Islam was against forced conversions or forced marriages. The Pakistani state had a pact with the religious minorities and the Quaid-e-Azam clearly stated that minorities would enjoy complete religious freedom in the new state.\nHe said Islam abhorred killing of people and the Sufis who spread Islam had always advocated values of love for family, neighbours, humanity and all the living world.\nLeaders representing different religions also spoke on the occasion, stressed for forging inter-faith harmony and called for protection of constitutional rights of minorities. They reiterated that religions were all about peace, kindness, tolerance and co-existence.",
  "retrievedAt": "2025-08-11T09:08:51.084Z"
}
