{
  "title": "PM pays tribute to minorities for their contribution in nation-building",
  "link": "https://www.app.com.pk/national/pm-pays-tribute-to-minorities-for-their-contribution-in-nation-building/",
  "date_published": "2023-08-11T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday paid tributes to the minorities for their contribution in nation-building and socio-economic development of the country.\n“On the National Day of Minorities, I join the nation in paying rich tributes to our non-Muslim citizens for their valuable contributions in nation-building and assure them of the government’s consistent and unwavering commitment to protecting their rights,” the prime minister said in a message in connection with the Day.\nHe said today the nation celebrated the role and contributions of the non-Muslim citizens for peace, progress and prosperity of Pakistan on the National Day of Minorities.\n“Our minority communities are part and parcel of the Pakistani nationalism. From the freedom struggle to this day, they have contributed meaningfully to building the country. From defence to education to health to social service, there is no walk of life where our non-Muslim brothers and sisters have not played their role in the socio-economic development of the country,” he added.\nThe Day, he said also drew the attention to Quaid-i-Azam Muhammad Ali Jinnah’s historic speech at the floor of the legislative assembly where he laid down the rules of engagement for the citizens with the newly created state of Pakistan. “The very idea of Pakistan is incomplete without our non-Muslim citizens. The ‘white’ colour of our flag symbolizes their place in the body politic of Pakistan,” he added.\nPM Shehbaz said from Jogendranath Mandal, Pakistan’s first law minister to Dr. Maira Phailbus to Dr Ruth Pfau to Justice Dorab Patel, the list of our Pakistani non-Muslim personalities of eminence was long whose contributions to public service continued to be celebrated.\nHe said interfaith harmony was a marked feature of the national identity. Pakistan is a strong advocate of pluralism, and diversity.\n“Our Constitution guarantees the provision of social, political, religious and economic rights to all citizens without any discrimination of caste, creed and colour,” he said adding “I am happy to state that the empowerment of our minority communities has taken the center-stage of public policy, as successive governments have allocated resources and implemented policies aimed at their mainstreaming and empowerment”.\nThe prime minister urged all segments of society to forge unity in their ranks.\nHe said nothing was more powerful than the spirit of togetherness in a nation, for it powered its imagination and strengthened its resolve to overcome the odds.\n“‘Unity, faith and discipline’, the Quaid’s motto, shows us the way forward to navigate the challenges.” he added.",
  "retrievedAt": "2025-08-11T09:09:05.344Z"
}
