{
  "title": "No restriction on Nawaz Sharif after completing 5-year disqualification: PM",
  "link": "https://www.app.com.pk/national/no-restriction-on-nawaz-sharif-after-completing-5-year-disqualification-pm/",
  "date_published": "2023-08-11T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Prime Minister Shehbaz Sharif on Friday said there was no restriction on Pakistan Muslim League-N supremo Nawaz Sharif to contest the election as he had completed his five-year disqualification period.\n“As far as Nawaz Sharif is concerned, that law is in the field now under which, the maximum disqualification period is five years. There is no restriction on Nawaz Sharif as he has completed his five-year disqualification,” the prime minister said in an interview with a private television channel (Samaa News).\nHe said the new law promulgated by the parliament had overwritten the previous law which the Supreme Court has not yet annulled.\n“Inshallah, I am sure that he will return by next month… He will face the law. The nation will receive him warmly… He will run the election campaign and all of us will be with him,” he stated.\nCommenting about the Supreme Court’s decision on the Supreme Court (Review of Judgments and Orders) Act 2023, the prime minister said the legislature had all the powers of lawmaking.\n“This is the first time in the history. I have not seen it happening anywhere in the world that legislation is stopped in anticipation,” he remarked and said the legislation was the job of parliament, not the supreme court.\nRegarding PTI chief Imran Khan, he said the court would decide his fate as he had no role in that regard.\nHowever, he said the NAB-Niazi nexus victimised him and his family, Nawaz Sharif and his daughter, and sister of Asif Ali Zardari when they were also denied bail.\nContrarily, Imran Khan’s government obtained stay orders in the cases of the BRT, wheat and sugar scandals.\nHe told the interviewer that inflation touched 12.5% during previous government which stood at just 3.5% during Nawaz Sharif’s tenure.\nPrime Minister Shehbaz said his government reduced oil prices based on international rates after regular reviews, but had to increase them due to global market fluctuations.\nHe said the government spent Rs40-50 billion for distributing free flour during Ramazan to support the poor. Additionally, the government provided cross-subsidy to those consuming up to 200 units of electricity per month.\nHowever, he said it was unrealistic to expect economic growth amidst incidents like the one on May 9, which was treason against Pakistan, the Pakistan Army, and the Chief of the Army Staff.”\nTo a question, he said the controversy over the appointment of the army chief was not a positive tradition. In other countries, such appointments are not publicized.\nThe prime minister brushed aside Imran Khan’s claim of any conspiracy by the US in the cipher as that time Pakistan’s ambassador, in the National Security Committee, had explained that there was no conspiracy to topple the government.\nComing to the approval of census, the prime minister said the government convened the meeting of the Council of Common Interests within few days of the completion of census. As per the CCI decision, the election will be held under the new census, he added.\nReiterating his desire for elections as early as possible, the prime minister said Election Commission had the mandate to hold the polls.\nAfter the elections, whatsoever the government is formed, they should put the politics of accusation and mudslinging to rest which also strained the foreign relations, he added.",
  "retrievedAt": "2025-08-11T09:08:48.979Z"
}
