{
  "title": "Tarbela Dam fills to maximum conservation level of 1550 feet",
  "link": "https://www.app.com.pk/national/tarbela-dam-fills-to-maximum-conservation-level-of-1550-feet/",
  "date_published": "2023-08-11T06:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): The mega water reservoir of Tarbela has been filled to its maximum level of 1550 feet above mean sea level, resulting in 5.809 million acre-feet (MAF) of water in the Dam, which is a good omen for agriculture and Hydel power generation in Pakistan in the days to come.\nTarbela Dam is considered an iconic project for the contribution it has been making towards the development of Pakistan by releasing the stored water for agriculture mitigating floods and providing low-cost Hydel electricity to the National Grid.\nTarbela Reservoir has a live water storage capacity of 5.809 MAF. Besides, Tarbela is the biggest electricity generating facility in Pakistan with an installed capacity of 4888 megawatts (MW), which will further increase to 6418 MW after completion of Tarbela 5th Extension Hydropower Project.\nAs per the hydrological data, the river flows, outflows and the reservoir level at Tarbela, Mangla and Chashma along with the water situation at the barrages today is as under: Kabul at Nowshehra: Inflows 40900 cusecs and Outflows 40900 cusecs, Khairabad Bridge: Inflows 222700 cusecs and Outflow 222700, Jhelum at Mangla: Inflows 31500 cusecs and Outflows 10000 cusecs, Chenab at Marala: Inflows 83200 cusecs and Outflows 54300 cusecs.\nBarrages: Jinnah: Inflows 216200 cusecs and Outflows 208200 cusecs, Chashma: Inflows: 228500 cusecs and Outflows 210500 cusecs, Taunsa: Inflows 310900 cusecs and Outflows 293100 cusecs, Guddu: Inflows 277500 cusecs and Outflows 244400 cusecs Sukkur: Inflows 234000 cusecs and Outflows 179500 cusecs Kotri: Inflows 246900 cusecs and Outflows 207500 cusecs Trimmu: Inflows 70800 cusecs and Outflow 62200 cusecs Panjnad: Inflows 69600 cusecs and Outflows 54200 cusecs.\nReservoirs (Level and Storage):\nTarbela: Minimum operating level 1402 feet, present level 1550.00 feet, maximum conservation level 1550 feet, live storage today 5.809 MAF.\nMangla: Minimum operating level 1050 feet, present level 1238.15 feet, maximum conservation level 1242 feet, live storage today 7.050 MAF.\nChashma: Minimum operating level 638.15 feet, present level 644.00 feet, maximum conservation level 649 feet, live storage today 0.100 MAF.\nThe inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6.00 a.m.",
  "retrievedAt": "2025-08-11T09:09:07.750Z"
}
