{
  "title": "ANF seizes 78 kg drugs in eight operations",
  "link": "https://www.app.com.pk/national/anf-seizes-78-kg-drugs-in-eight-operations/",
  "date_published": "2023-08-11T07:57:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 11 (APP): Anti-Narcotics Force (ANF) while conducting eight operations across the country managed to recover over 78 kg drugs and arrested eight accused, said an ANF Headquarters spokesman here on Friday.\nHe said, 5 kg heroin and 6 kg hashish were recovered from secret cavities of a car intercepted near Motorway Toll Plaza Islamabad. Two suspects, residents of Khyber and Peshawar, were arrested during the operation.\nIn an operation, 21 kg heroin was recovered from a house near Masri Khan Chowk Peshawar. During the operation, the accused resident of Peshawar was also arrested.\nThe spokesman said, 300 grams hashish was recovered from the possession of a local drug dealer near Baidri Chowk Mansehra.\nIn fourth operation conducted in Sialkot, heroin was recovered from a parcel booked at a courier office. 5 kg heroin hidden in surgical items was being smuggled to Canada.\nHe informed that in fifth operation, 30 heroin-filled capsules were recovered from the possession of a Sri-Lanka bound passenger arrested at Multan Airport. The accused resident of Lahore was going on Flight No G-9559.\nANF recovered 19.2 kg opium and 20.4 kg hashish from a Honda car intercepted near Gojra Interchange while during the operation, an accused resident of Swat was arrested.\nThe spokesman said that in seventh operation at a courier office at Jinnah International Airport Karachi, 800 grams Ice drug concealed in flag sticks was recovered. The parcel was booked for Qatar.\nIn eighth operation, 4 kg heroin and 1 kg Ice drug were recovered from a bus intercepted near Vinder area in Hub. During the operation, two accused residents of Turbat were also arrested.\nSeparate cases under the Anti-Narcotics Act have been registered against the arrested accused and further investigations are under process.",
  "retrievedAt": "2025-08-11T09:09:05.104Z"
}
