{
  "title": "COVID-19 claims 56 lives, infects 1,165 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-56-lives-infects-1165-more-people/",
  "date_published": "2021-02-17T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): The national tally on Wednesday of total active COVID-19 cases recorded 25,008 with 1,165 more people tested positive for the deadly virus and 1,484 people recovered from the disease during the last 24 hours.\nFifty six corona patients have died during past 24 hours, 48 of them were under treatment in hospital and eight in their respective quarantines and homes on Tuesday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Sindh.\nThe maximum ventilators were occupied in four major areas including Multan 21 percent, Islamabad Capital Territory (ICT) 33 percent, Peshawar 26 percent and Lahore 37percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in Four major areas of Gujrat 61 percent, Peshawar 39 percent, Multan 31 percent, and Lahore 22 percent.\nAround 247 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 33,196 tests were conducted across the country on Tuesday, including 9,504 in Sindh, 10,775 in Punjab, 6,595 in Khyber Pakhtunkhwa (KP), 4,995 in Islamabad Capital Territory (ICT), 597 in Balochistan, 377 in GB, and 353 in AJK.\nAround 528,545 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 565,989 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 9,562, Balochistan 18,954, GB 4,943, ICT 42,921, KP 70,123, Punjab 165,200 and Sindh 254,286.\nAbout 12,436 deaths were recorded in country since the eruption of the contagion. Around 4,244 perished in Sindh among 18 of them died during past 24 hours. 11 of them died in the hospital and seven out of the hospital.\n5,114 in Punjab had died with 30 deaths in past 24 hours. 29 of them died in the hospital and one out of the hospital on Tuesday. 2,007 in KP where seven of them died in hospital on Tuesday, 486 in ICT, 199 in Balochistan, 102 in GB and 284 in AJK among one of them succumbed to the deadly virus in hospital on Tuesday.\nA total of 8,531,218 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,113 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:22:13.735Z"
}
