{
  "title": "President Alvi for digitalization of rare manuscripts at Quaid e Azam Academy",
  "link": "https://www.app.com.pk/national/president-alvi-for-digitalization-of-rare-manuscripts-at-quaid-e-azam-academy/",
  "date_published": "2021-02-17T10:42:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 17 (APP): President Arif Alvi during his visit to the Quaid e Azam Academy here on Wednesday sought digitalization of all its rare manuscripts ensuring easy accessibility of these to the scholars and researchers in the years to come.\nHe on the occasion acknowledged that the center established with the objective to conduct a holistic research on Quaid e Azam and his associates in carving out a separate homeland for the Muslims of Sub-Continent was indeed a significant platform for archiving national history with due focus on research, publication and projection of the cultural, social, political and economic aspects of the history of Pakistan.\nThe President paid glowing tributes to Prof. Sharif ul Mujahid, the first director of the academy followed by other scholars who headed the Quaid e Azam Academy , Karachi in different years and played important role in turning it into a robust research cum publication center since 1976.\nConsequent to a briefing given to him by Mohammad Arif, Secretary, Quaid e Azam Mazar Management Board with additional charge of Director, Quaid e Azam Academy, President Alvi observed that current pace of its research work needed to be expedited.\nHe was informed that besides the post of QAA Director itself (lying vacant since December 2019), no replacement against the positions for two senior research fellows, four research fellows and one librarian could be made , for quite sometime.\nThese were said to be other than certain administrative positions with no personnel to deliver since retirement of the former employees.\nPresident Arif Alvi was further informed that QAA – Karachi has submitted its proposals to the National Heritage and Culture Division, Ministry of Education for establishment of “Heritage Corner”, digitalization of speeches, statements and interviews of Quaid e Azam Muhammad Ali Jinnah as the Governor General, digitalization of books and other relevant material besides production of audible version of the nation’s voice.\nSince its establishment the academy was said to had come forward with 80 different publications in English, Urdu and other regional languages, available for sale on discount.\nT\nhe books and research work, encompassing almost every feature of Quaid e Azam’s life, were said to be also separately focused on Pakistan Movement, Muslim League and associates of Quaid e Azam.\nPresident Arif Alvi prior to his departure from the academy did purchase many of its publications from his own pocket.",
  "retrievedAt": "2025-08-11T20:22:14.279Z"
}
