{
  "title": "India’s BJP-RSS regime practising systemic fascism in IIOJK: Sardar Masood",
  "link": "https://www.app.com.pk/national/indias-bjp-rss-regime-practising-systemic-fascism-in-iiojk-sardar-masood/",
  "date_published": "2021-02-17T14:10:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Feb 17 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Wednesday said that India’s BJP-RSS regime is practising systemic fascism in Indian Occupied Jammu and Kashmir (IIOJK) in violation of the international laws and there are multilateral forums that should hold India accountable instantly.\nIn an article published in monthly Hilal magazine of the armed forces, he pointed out that the crimes being committed by India including ethnic cleansing and genocide of the unarmed Kashmiri people, and illicit change of the demography of the disputed territory are crimes against humanity, AJK President office.\nHe lamented that the occupation authorities have amended land laws to confiscate any part of IIOJK for strategic, commercial and settlement purposes. In many instances, he said, “indigenous Kashmiris’ legitimate businesses have been declared unlawful under a bevvy of dubious new laws and outsourced to non-native, non-resident, nondescript and anonymous operators from India.”\nSardar Masood Khan added that a process has already been started to pilfer 480,000 jobs reserved for the Kashmiris. Besides killings of the youth on daily basis, mostly in staged encounters, thousands of young men are being tortured in concentration camps, he said adding that the Kashmiri people as a nation are facing annihilation in terms of lives and livelihoods.\nHe said that the BJP’s agenda is driven by a doctrine of insatiable hatred against non-Hindus particularly the Muslims.\nSardar Masood Khan maintained that the applicable law comprises the UN Charter, the International Covenants on civil, political, social, economic and cultural rights, the Genocide Convention, the Fourth Geneva Convention and the Statute of International Criminal Court, as well as several treaties and conventions on torture, racism, and discrimination against women. India is liable for all the serious breaches of international law in the light of the plethora of evidence collected by objective sources.\nThe AJK president said that since the occupation of part of the State of Jammu and Kashmir in 1947, successive Indian regimes have been using every trick and stratagem in their repertoire to subjugate the people of Jammu and Kashmir.\nExposing India’s hegemonic designs and its vicious role in the region, the AJK president asserted that India has eagerly offered itself to become part of the US-led Western powers’ game designed to block the strategic and geo-economic rise of China.\n“The world powers very well know well the heinous crimes against humanity being committed by the Indian forces in IIOJ&K but they choose to look the other way because of their perceived material and political interests,” he regretted.",
  "retrievedAt": "2025-08-11T20:22:09.855Z"
}
