{
  "title": "COVID-19 cases declining; all economic activities to be fully restored from March 1, Cabinet told",
  "link": "https://www.app.com.pk/national/covid-19-cases-declining-all-economic-activities-to-be-fully-restored-from-march-1-cabinet-told/",
  "date_published": "2021-02-17T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): The Federal Cabinet, which met here Wednesday with Prime Minister Imran Khan in the chair, was told that with the decline in coronavirus cases, all economic activities in the country would be fully restored from March 1.\nThe cabinet, which was briefed about the situation of coronavirus, was informed that the COVID-19 vaccine was being administered to the frontline workers. Around 50,000 frontline health workers had so far been vaccinated and the process was being further quickened.\nIt was further told that the people with over 65 years of age could get themselves registered on telephone number 1166 for vaccination through National Identity Cards.\nThe meeting was also informed that hurdles in the way of vaccine’s import by the private sector had been removed.\nThe prime minister while inquiring about the progress regarding the delegation of voting right to the overseas Pakistanis and the installation of electronic voting machines, said the present government was committed to make the electoral process fully transparent.\nHe directed the electoral reforms committee to identify, in consultation with the president, all administrative measures and stages required for the installation of electronic voting machines and set timelines in that respect.\nThe prime minister said ensuring the election process fully transparent was the foremost priority of present government.\nAbout the matter of forced missing, the cabinet reiterated that the government fully believed in the transparency and rule of law.\nThe prime minister directed to speed up the process of introducing a law in the Parliament in that respect.\nThe cabinet while taking strict notice of the incidents of sexual crimes, expressed concern on the reports of such incidents and directed to ensure the implementation of laws and steps to check the same.\nThe cabinet, while appreciating the government’s legislation on the inheritance rights of women, also directed to pace up the process of introducing another law for immediate redressal of the issues relating to the properties of overseas Pakistanis.\nThe meeting was briefed about the progress made so far with regard to the retrieval of state lands from Qabza Mafia (land grabbers). It was also briefed about the progress on Islamabad Metro Bus project.\nThe cabinet, in order to check disparity in the salaries of employees of various Federal Government departments and provide relief to the government employees, approved 25% Disparity Reduction Allowance on the basic salary of 2017. The increase would be applicable from BS-1 to BS-19 and to be implemented from March 1, 2021.\nThe cabinet also decided to direct the provincial governments to take measures to check disparity of salaries in their respective departments.\nThe cabinet was told that on the pattern of Khyber Pakhtunkhwa, timescale promotion was being given for BS-1 to BS-16 in the Federal Government.\nIt was further told that the Adhoc Relief Allowance would be merged in the basic salaries of the Federal Government employees and its real beneficiaries would be the pensioners.\nImran Khan while talking about the demand of increase in salaries, said the government was fully cognizant of the difficulties of government employees.\nHe, however, added that it was the maladministration of past and the crucial economic situation, which had caused hardships for the people from across the country, while the COVID-19 pandemic created more economic difficulties.\nThe prime minister said keeping in view the country’s economic difficulties the present government initiated the austerity drive and started it from the PM Office. In order to save the public tax money, all the ministries were directed to ensure reduction in unnecessary expenditures.\nImran Khan directed the Secretary Finance to make public the details of all government institutions running in deficit along with the volume of deficit so that the people could know about the country’s affairs.\nThe people should also be kept informed about the reforms in those institutions and the progress in that respect, he added.\nThe cabinet approved restructuring of the Board of Governors of Pakistan Institute of Management Karachi.\nKeeping in view the needs of Federal Service Tribunal (FST), it also approved the allotment of 400 square yards of land adjoined with the FTS building so that the office of FST could function smoothly.\nThe decisions of the Cabinet Committee on Institutional Reforms taken during its meeting on February 4, 2021 were ratified by the cabinet. The decisions included establishment of offices in five ministries under the Accountant General of Pakistan Revenue.\nThe cabinet, on the recommendation of the Election Commission of Pakistan, approved the placement of Sindh Rangers troops during the bye-election of the National Assembly constituency NA-221 Tharparkar-1.\nThe meeting approved the appointment of Javed Qureshi as Chairperson of the Board of Directors, Sindh Infrastructure Development Company Limited.",
  "retrievedAt": "2025-08-11T20:22:07.035Z"
}
