{
  "title": "Khusro appreciate UN assistance for socio-economic development of Pakistan",
  "link": "https://www.app.com.pk/national/khusro-appreciate-un-assistance-for-socio-economic-development-of-pakistan/",
  "date_published": "2021-02-17T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP):Federal Minister for Economic Affairs, Makhdoom Khusro Bakhtyar on Wednesday appreciated the assistance provided by the United Nations system for the socio-economic development of Pakistan.\nThe UN Resident and Human Coordinator for Pakistan, Mr. Julien Harneis called on the Minister for Economic Affairs, Makhdoom Khusro Bakhtyar, said a press release issued by Ministry of Economic Affairs.\nHe further appreciated the initiatives of different UN Agencies that have been instrumental in supporting Pakistan’s initiatives in achieving the Sustainable Development Goals (SDHs), especially in the areas of climate change, poverty alleviation, education, good governance and health with particular focus on COVID-19 pandemic and locust attack.\nDiscussion was also held on the UN’s role in coordinating and channelizing funding for the Global Humanitarian Response for COVID-19 through multilateral and bilateral sources.\nThe Minister for Economic Affairs appreciated UN’s support towards locust control in South Asia through the FAO Commission for Controlling the Desert Locust in South West-Asia (SWAC).\nThe Resident Coordinator apprised that a strong and empowered Resident Coordinator System would be instrumental in shaping the next five-year Cooperation Framework between the Government and the UN Country Team Pakistan.\nHe offered full support to Pakistan in achieving the targets in line with the priorities of the Government of Pakistan.\nThe Minister for Economic Affairs further requested UN’s assistance in Government’s priority areas such as tourism, low-cost housing, green Pakistan and Ehsaas Programme.\nHe also highlighted the necessity to provide support for accurate capturing of data in all districts including those in areas of Khyber Pakhtunkhwa and Balochistan which ties in with the goal to increase regional connectivity.\nBoth parties expressed their gratitude for the partnership between the Government and the UN Country team in Pakistan and spoke of their expectations in taking this forward to achieve even greater results.",
  "retrievedAt": "2025-08-11T20:22:06.906Z"
}
