{
  "title": "HEC signs ETA with Microsoft to accelerate digital transformation",
  "link": "https://www.app.com.pk/national/hec-signs-eta-with-microsoft-to-accelerate-digital-transformation/",
  "date_published": "2021-02-17T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): Microsoft Pakistan and Higher Education Commission (HEC) has signed an Education Transformation Agreement (ETA) to help academic institutions leverage new technologies in the learning process.\nThe agreement was signed between the HEC, Chairman Dr Tariq Banuri and Mark East, Vice President Education, Microsoft, Europe Middle East Africa and other key executives from both sides at a virtual meeting held on Wednesday, said a press release issued here.\nUnder the ETA framework, Microsoft collaborates with Universities helping them in their digital transformation journey through a strategic technology framework implementation that helps them build a secure and connected campus, promotes teaching and learning activities, creates opportunities for academic research and increases chances of student success through easy access to knowledge and latest tools.\n“There are multiple programs that are part of this framework impacting student and faculties’ academic lifecycle. Programs such as the Student Hackathon, focused Technology boot camps, Imagine Cup and multiple online training sessions for 200+ institutions across the country directly help with technology adoption and help build the workforce for the future,” it added.\nDuring Pandemic, HEC has been providing remote learning solutions to drive continuity for academic activities in universities. To support the same initiative, Microsoft collaborated with HEC to bring more than 100 universities and 500,000 plus students to a digital hub of Microsoft Teams that brings conversations content, assignments, and apps together at one place, letting educators create vibrant learning environments.\nMicrosoft Teams platform also works well with Moodle, which most universities use as their Learning Management System. Microsoft Teams has also recently introduced new features that allow the faculty to take online exams in a secure environment enabling teaching faculty to conduct online assessments and create quizzes with ease to minimize chances of errors.\nThrough this agreement, Microsoft’s cloud computing platform, Azure, will be accessible to the Universities and will provide the ability to transform their IT infrastructure with the latest cloud offerings, manage their cyber security through cloud-native SIEM, build their high performance research clusters that are resilient and scale when needed, host their learning management solutions and innovate their on-premise applications using the platform’s easy-to-use Artificial Intelligence and Machine Learning capabilities.\nMicrosoft will also provide consultancy to universities to adopt Microsoft Dynamics 365 platform for their Finance and Operations and Campus Management solution requirements.\nIt is a robust, feature-rich platform to help universities, colleges, and educational organizations in to moving their core administrative and IT functions to the next generation Microsoft technologies ensuring the best outcomes for students with a 360-degree view of students and activities by providing the right services and support at the right time.\nDr Tariq Banuri, Chairman HEC, shared his thoughts during virtual session “COVID Pandemic has brought many challenges for Educational sector in Pakistan but with the help of Microsoft we have successfully turn them into opportunity and embark on the journey to transform education system through digitalization.\nETA with Microsoft depicts our commitments to gearing towards revolutionizing the learning process with number of initiatives.\nThese interventions will introduce modern technological tools to enhance faculty to student interaction at all level and provide easy access to knowledge. This cooperation has long way to go till the fulfillment of Digital Pakistan vision.”",
  "retrievedAt": "2025-08-11T20:22:11.223Z"
}
