{
  "title": "PML-N AJK not part of PDM: Farooq",
  "link": "https://www.app.com.pk/national/pml-n-ajk-not-part-of-pdm-farooq/",
  "date_published": "2021-02-17T15:57:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 17 (APP): AJK Prime Minister Raja Farooq Haider on Wednesday categorically said the Pakistan Muslim League-Nawaz Azad Jammu & Kashmir Chapter (PML-N AJK) was not part of the Pakistan Democratic Movement (PDM).\nHe refuted the reports about the formation of PDM in AJK, saying the PML-N would contest the AJK Legislative Assembly election due in the mid of the year, independently.\nThe AJK PM, who is also President of PML-N AJK, told a news conference here at the PWD Rest House that the PML-N would not forge an electoral alliance with any other political party.\nHe also contradicted a news report published in a section of press that the government was filing of a writ petition challenging the induction of the sitting acting Chief Justice of AJK Supreme Court Raja Saeed Akram in the High Court.\nHis office was not involved in any such exercise, he added.\nFarooq Haider, however, admitted that due to less number of judges in the AJK superior judiciary, cases were delayed causing delay in the delivery of justice. It was his desire that the vacant positions of judges should be immediately filled.\nTo a question, he said the lent officers should be posted in the state after consultation with the AJK government.\nAs regards the public welfare projects pertaining to the Mirpur city, Farooq Haider said a committee headed by former secretary works Engr Ch. Ameer Afzal had been formed to give an impetus for the resumption and completion of the mega Mirpur Islamgarh bridge and Mirpur city greater water supply and sewerage scheme.\nSimilarly, he added, a proposal for Rs 20 billion project of the supply of gas in the rest parts of Mirpur had been forwarded sent to the Government of Pakistan for formal approval.",
  "retrievedAt": "2025-08-11T20:22:06.853Z"
}
