{
  "title": "Govt attaches prime importance to human security: Dr Nishtar",
  "link": "https://www.app.com.pk/national/govt-attaches-prime-importance-to-human-security-dr-nishtar/",
  "date_published": "2021-03-18T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr Sania Nishtar Thursday said the present government was fully cognizant of the fact that human security and human capital formation have to be squarely positioned in the national agenda.\nTherefore, Prime Minister Imran Khan, in his opening speech, talked about his commitment to welfare of the people, she said while speaking at the concluding day of Islamabad Security Dialogue being held at the National Library of Pakistan.\nDr Nishtar said the Ehsaas programme was conceptualized as a wide ranging welfare programmes under one umbrella.\nAt inception there were 115 elements in Ehsaas and now it stands at 268 with 34 executing agencies, biggest social welfare budget and seven times bound outcomes based goals.\nShe said we had to spend four years in developing the infrastructure, new ministry, mechanism, digital infrastructure which played out during COVID-19 and new governance paradigm to uphold the integrity and transparency in the utilisation of Ehsaas funds.\nShe said huge investment had been made in developing digital and institutional infrastructure for the Ehsaas programme especially during the COVID-19 to response quickly to the needs of those whose livelihoods were affected.\nShe observed that COVID-19 had a huge implication over economic growth and the number of people living in poverty all over the world.\nSpeaking about the seminar, Dr Nishtar stated that the Human Development Report of 1993 coined the concept of human security.\nShe said there was a deep interlinkage between state and human security and several seven dimensions of human security articulated in that report including economic, water, food, energy, individual, community and health security.\nShe said complex interdependencies exist between these seven securities and state security.\nShe said 1993 paradigm of human security needed to be revisited and there would be two things that needed to be added; one was environmental security and other was health security.\nGiving an example, she said water security and energy insecurity could have its implications on overall economic insecurity that cause poverty and deprivation which led to violence and conflict in a society while there was a negative vicious cycle which could play out as a result of this situation.\nToday it was extremely difficult to extricate state security from human security due to the complex interdependencies, she said.\nShe said human security was deeply important in today’s age where technology was defining a future and it was a very well recognized fact that 60 percent of the wealth of any nation was dependent on its human capital as opposed to its physical or natural capital.\nHuman capital was salient for the progress of any nation.\nDr Nishtar congratulated the National Security Division and the collaborating think tank for this wonderful initiative of arranging such an important dialogue.",
  "retrievedAt": "2025-08-11T20:30:39.786Z"
}
