{
  "title": "Pakistan-Turkey agree to access Pakistanis to top Turkish hospitals, doctors",
  "link": "https://www.app.com.pk/national/pakistan-turkey-agree-to-access-pakistanis-to-top-turkish-hospitals-doctors/",
  "date_published": "2021-03-18T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):Riphah Healthcare Services has Signed Memorandum of Understanding (MOU) with Medical Park Group Turkey to access of Pakistanis to the top Turkish hospitals and doctors.\nThe MoU signing ceremony was attended by various notables including Turkish Ambassador to Pakistan Ibrahim Mustafa, Maj General Mohsin Mohammad, IG Hospitals, Medical Directorates, Prof Dr Anis Ahmed , Vice Chancellor Riphah International University), Dr Hakan Ucar ( Cardiologist, Medical Park turkey) and Ms Sema Gun ,Head of Business Development, Medical Park turkey, Dr. Nausheen Hamid, Parliamentary Sectary for the ministry of National Health Services.\nThe purpose of the MOU is to facilitate the transformation of the Healthcare Quality System in Pakistan. Apart from this, the two institutions agreed to initiate medical and paramedical resources exchange program, collaborative research in healthcare systems and access of Pakistanis to the top Turkish hospitals and doctors.\nRiphah Healthcare Services also launched an e-Health system where Pakistani and Turkish doctors will be available for Tele-consultations and checkups.\nSpeaking on the occasion, Asadullah Khan, Executive Director, IIMCT & RHS said that Turkey was like the second home for Pakistan and our ties flew through the hearts of the people of the both countries.\nThis collaboration will boost the Healthcare transformation in both of the countries and open new exciting ways of Research, Quality Assurance and Hospital Management Systems, Khan added.\nHassan Muhammad Khan, Managing Trustee, IIMCT & RHS showed his special gratitude on the MOU between the two leading groups.\nHe further said that the alliance between Riphah and Medical Park would accomplish its target and this would be the largest alliance in the private healthcare sectors.\nHe also shared his vision to start the research initiatives, faculty exchange programs, learning and training programs and added that the collaborations of such kind would\nstrength the relationship between two countries and create fruitful results for the people.\nDr Nausheen Hamid as Chief Guest appreciated the efforts of Riphah Healthcare Services and Medical Park by mentioning that the private sector of both countries was following the footsteps of governments by establishing joint ventures.\nShe added that the relationship of Medical Park Turkey with Riphah would certainly open new horizons for the improvement of the healthcare system in the country.\nIn the end, the Turkish ambassador and the representatives of Medical Park appraised the efforts of the Pakistani counterpart for such warm hospitality during their stay in Pakistan and showed keen interest in working together with the Riphah Healthcare Services and Riphah International University.",
  "retrievedAt": "2025-08-11T20:30:34.484Z"
}
