{
  "title": "PTI government introduces road projects, 300 times more than past regimes: Murad Saeed",
  "link": "https://www.app.com.pk/national/pti-government-introduces-road-projects-300-times-more-than-past-regimes-murad-saeed/",
  "date_published": "2021-03-18T12:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):Federal Minister for Communications and Postal Services Murad Saeed on Thursday said the government has launched different roads projects that 300 times more than the previous governments as former rulers claim, they built many motorways and highways.\nAddressing at National Highways and Motorway Police (NHMP) ceremony titled “Honouring Outstanding Contribution”, he said that a number of road projects were under construction while some of it had already been completed and more to be inaugurated soon.\nHe highly praised the Inspector General NH&MP Syed Kaleem Imam and his whole team for the outstanding performance.\nThe minister appreciated NH&MP for introducing “Mashwara” feature in “Humsafar” Application where people can ask or suggest anything related to Pakistan Motorways and respond quickly to serve the people more effectively.\nMurad Saeed said that people’s proposals would be welcomed through new feature titled “Mashwara”. He said that the government was working to bring further improvement in NHA system. “Modern technologies are being acquired to ensure transparency in different departments” he said.\nThe minister said that NH&MP and Postal Services have achieved all its set targets, adding that e-procurement system was introduced in National Highway Authority to ensure transparency.\nThe minister said the work would be started on Dir-Swat, D.I.Khan-Peshawar and Hyderbad-Sukkar Motorways, adding that an important motorway project Sialkot-Kharian and Kharian-Rawalpindi would be started on 25th May. The minister said that the work would also be started on Balkasar-Mianwali and Muzafarghar- DG Khan roads.\nHe said they have also initiated mega road projects like M-8, Khuzdar-Basima, Ratto Dero, CPEC Western route and Dara Adamkhel project. He said the western route of China Pakistan Economic Corridor (CPEC), after completion, would bring prosperity in the backward areas of South Balochistan.\nThe minister said that Rs 50 billion revenue target was achieved by his ministry. He said provision of free medical facility was the prime responsibility of the state and the government was ensuring it across the country.\nMurad Saeed said the distribution of Sehat Insaf Cards (SIC) to 100 percent population of Khyber Pakhtunkhwa has been completed, adding, the distribution process of the facility was also underway in Punjab, Azad Jammu Kashmir and Gilgit-Baltistan.\nHe said Prime Minister Imran Khan also directed Balochistan government to start Sehat Insaf Card programme, adding that Sindh government should also take the initiative. The minister said 100 percent population of Punjab would be provided universal health insurance by the end of this year. He said that work was also in progress on the digitalization postal services and its logistic services.\nMurad Saeed said Prime Minister Imran Khan’s promise to provide shelter to the homeless has been fulfilled today. He said that more than 1000 flats and 500 houses were completed under Naya Pakistan Housing Project.\nFederal Secretary Communications Zafar Hassan highly praised the five year road map announced by IG NH&MP Syed Kaleem Imam. He said that the ministry also started implementation of e-filing. He assured NH&MP to support them in achieving of set targets for the next five years.\nInspector General NH&MP Syed Kaleem Imam said that they are thankful to Minister and Secretary Communications for encouragement. He said that NH&MP was making efforts to achieve standards and save lives on the roads. He said that “We religiously follow all the programs”. He said that a five years road map plan was developed. He added that roads safety stalls have been set up to reduce accidents and fatalities.\nSyed Kalim Imam said that NH&MP is an icon of excellence, adding that Motorway Police would maintain the standards and keep serving the people despite all challenges and COVID-19 pandemic. He said nearly 600 NH&MP officials affected due to COVID-19.\nEarlier, the minister also distributed appreciation letters among the NH&MP officials for their outstanding contributions.",
  "retrievedAt": "2025-08-11T20:30:40.875Z"
}
