{
  "title": "130 Pakistani Hindus return home after “nightmare” stay in India",
  "link": "https://www.app.com.pk/national/130-hindus-return-home-after-nightmarish-stay-in-india/",
  "date_published": "2021-03-18T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Another 130 Pakistani Hindus have returned to Pakistan from India on Thursday with the shattered dream of starting a new life there, which instead proved a nightmare for them.\nThe Hindus returned to their homeland getting disappointed by the behaviour of the Indian government. Their stay in India became more troublesome due to the COVID-19 lockdown.\nAccording to sources in Immigration Department, some of the returned Hindus had visited India to see their relatives. However, majority of them, hailing from Interior Sindh, went there for permanent stay.\nHowever, they opted to be back to Pakistan owing to bad behaviour of the Indian government. They had to even bear more difficulties during the COVID-19 lockdown.\nThis is not the first time that the Pakistani Hindus have returned to their homeland from India with disappointment. Over 100 Hindus had also returned to Pakistan in the past few months. They were lured to migrate to India, with promises of starting a new life and economic prosperity.\nSimilarly, in November last, a large number of Hindu families returned to Pakistan through Attari-Wagah border getting disappointed by worse living conditions in India.\nPakistan’s High Commission in India is making efforts to bring back the citizens to the country.\nThe returned citizens termed their stay in India as a “nightmare” and expressed their pleasure over their return.\nThe Hindu families who returned earlier, said after a real-life experience they had found “horrific living conditions” in India.\nJesu Mal, son of Radho Kachhi, said that they lived far better life here in Pakistan and also enjoyed much greater financial status. He also expressing his utter dismay over the treatment they faced in India.\n“Neither we got any place to live, nor any employment,” he said. “When we lived in India, we realized, how much better our life was back in Pakistan.”\nRano, son of Ramji, said that they had left Pakistan with dreams of a better future, but they had witnessed nothing but horrific.",
  "retrievedAt": "2025-08-11T20:30:40.063Z"
}
