{
  "title": "Second Int’l Hydropower conference to be held on Wednesday",
  "link": "https://www.app.com.pk/national/second-intl-hydropower-conference-to-be-held-on-wednesday/",
  "date_published": "2022-12-19T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): The second International Hydropower conference will be held here Wednesday on December 21 to discuss more opportunities to produce cheap and clean energy from hydro sector and foster renewable energy resources in mitigating the climate change.\nThe Energy Update in collaboration with Private Power Board (PPIB) and International Hydropower Association (IHA) will organize a daylong conference to be participated by energy expert from within and outside the country.\nChairman organizing committee and President National Forum for Environment and Health (NFEH), M Naeem Qureshi told on Monday that the conference would discuss the progress achieved in Pakistan and adjoining region in hydropower sector so far.\nHe said that the recent climate catastrophe flooding in Pakistan was a wake-up call for all us and the stakeholders to find the sustainable solutions for dams and safe drainages, store torrential monsoon rains for resourceful irrigation and showing high-level of responsibility in managing release of cross border water.\nHe said State Minister Energy Hashim Notezai, Minister Science and Technology Agha Hasan Baloch, Hasan Nasir Jamy, Federal Secretary, Water Resources, MD PPIB Shah Jahan Mirza, Chairman NEPRA Tauseef H. Farooqui, Ch. Arshad, Minister Energy and Water, Azad Jammu and Kashmir, Dr. Munawar Iqbal, DG Hydro PPIB, Mohd Fauzi Bin Shafie, CEO, TNB Remaco Pakistan Pvt Ltd, Senior Advisor CSAIL NA Zuberi,\nEngr. Naeem Khan CEO PEDO, Dr. Tahir Masood, Managing Director, NESPAK, Imran Halim, Chief Engineer, PEDO, Khattar AbdulKhalek, Head of Business Development and Acting GM for Aerodyne KSA, Muhammad Asad Imran, Country Manager, DOLSAR Engineering Pakistan, Fahd Bin Zafar, MM Pakistan (MMP), Sohail Butt, Former DMD, PSO and others would participate and address on this occasion.",
  "retrievedAt": "2025-08-11T16:02:31.411Z"
}
