{
  "title": "Water Resources ministry directed to formulate report featuring measures to deal sedimentation issue at Tarbela dam",
  "link": "https://www.app.com.pk/national/water-resources-ministry-directed-to-formulate-report-featuring-measures-to-deal-sedimentation-issue-at-tarbela-dam/",
  "date_published": "2022-12-19T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): The Senate Standing Committee on Water Resources while discussing sedimentation at Tarbela dam on Monday, directed the Ministry to formulate a detailed report featuring long and short term measures to deal with the issue.\nThe Committee which met with Syed Muhammad Sabir Shah in the Chair, also discussed plot allocation to the affectees of Tarbela dam and encroachment on it.\nDiscussing sedimentation and the measures taken to address it, the members of the Committee were of the view that measures must be taken to allow sediment flow to a certain degree, since this ensures land fertility.\nThe Committee stressed the need for moving closer towards nature and adopting alternative energy solutions crucial for the survival and growth.\nThe Ministry was also asked a detailed briefing on Diamer Basha Dam in next meeting of the Committee. Reviewing details of plot allocation to the affectees of Tarbela Dam, the Committee was informed that the 1744 affectees have been compensated. Some 450 affectees filed writ petitions before Peshawar High Court Abbotabad Bench for allotment of alternate agricultural land and enhancement of compensation against WAPDA, Federal Government, Governments of Punjab and Sindh.\nBased on information provided by 450 affectees, only one affectee was found eligible with respect to allotment of alternate agricultural land as per eligibility criteria of Federal Government policy of 1967-68.\nSince the matter was sub-judice, the Committee stressed the need for the perspective of both parties emphasizing an out of court settlement.\nDiscussing unauthorized occupancy of allotted land to the affectees in Punjab and Sindh, WAPDA was of the view that no such information regarding the issue was available with them as it came under the domain of the provincial governments.\nThe meeting was attended by Senators Sana Jamali, Taj Haider, Gurdeep Singh, Dr. Muhammad Humayun Mohmand, and senior officers from the Ministry of Water Resources, WAPDA, along with all concerned.",
  "retrievedAt": "2025-08-11T16:02:29.811Z"
}
