{
  "title": "Role of space technology inevitable for country’s socio-economic development: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/role-of-space-technology-inevitable-for-countrys-socio-economic-development-ahsan-iqbal/",
  "date_published": "2022-12-19T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Minister for Planning Development and Special Initiatives Ahsan Iqbal on Monday said that the role of Space Technology for a country’s socio-economic development was inevitable while Pakistan had to achieve a lot to compete with the world.\nHe made these remarks while addressing a Seminar titled, “Role of Space Technologies for Sustainable Socio-Economic Development of Pakistan”, jointly organized by the Pakistan Space and Upper Atmosphere Research Commission (SUPARCO) and Ministry of Planning Development & Special Initiatives today.\nThe seminar was attended by the secretary of the Planning Commission, the chief economist, the chairman SUPARCO, and officials from the ministries and divisions.\n“Space Technology has become a centerpiece as every sector whether education, agriculture, health and climate change is linked with it,” said the minister, while addressing the participants of the seminar.\nThe minister further said that huge transformation changes were going on in various fields, particularly in robotics and biotechnology, however, space technology played a key role and Pakistan needed to expedite its effort to compete with the world.\nThe minister also underlined several development projects in which Space technology played a vital role in the saving of cost of the projects.\nDue to political instability in the country, Pakistan could not achieve such targets which other countries had achieved due to their continuity of policies, said the minister, while stressing the ministries and divisions to get benefit from the information being shared by the SUPARCO.\nMeanwhile, Secretary Ministry of Planning Commission Syed Zafar Ali Shah in his remarks held that Space Technology had a key role in the country’s development and it had been placed in SDGs to get the desired results.\n“The ministry always takes the initiatives to bring advanced technology and Geo-Spatial Technology Cell was one of the eh example which was recently established at Planning Ministry,” he added.\nHe also highlighted that this technology helped the government in recent floods, particularly, in Post-Disaster Need Assessment (PDNA).\nSpace technology played a vital role in confronting countless challenges in the fields of climate change, resource monitoring, disaster management, and mitigation of health and education, he said.\nChief Economist, Ministry of Planning Commission Nadeem Javed gave a detailed presentation while highlighting PSDP projects which had a positive impact on space technology.\n“The provision of timely and reliable information through satellite would help in better decision making, ” he remarked.\nChairman SUPARCO Maj Gen Amer Nadeem, in his address, highlighted key initiatives related to agricultural monitoring, disaster management, forest estimation and monitoring, environment and GIS-based governance planning.\nLater, a question and answer session was also held.",
  "retrievedAt": "2025-08-11T16:02:28.309Z"
}
