{
  "title": "Naek lauds Bilawal for taking up Kashmir issue, exposing India’s true face at UNSC",
  "link": "https://www.app.com.pk/national/naek-lauds-bilawal-for-taking-up-kashmir-issue-exposing-indias-true-face-at-unsc/",
  "date_published": "2022-12-19T07:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Foreign Minister Bilawal Bhutto Zardari has done remarkably well in not only bringing Kashmir issue in the global limelight but also rightly exposing to the world the true fascist face of India, said Chairman Senate Standing Committee on Foreign Affairs, Senator Farooq H. Naek.\nAccording to a press release, he said Bilawal has effectively highlighted the hitherto unresolved issue of Indian Illegally Occupied Jammu and Kashmir (IIOJK) by mincing no words in loudly recalling Indian Prime Minister Narendra Modi as ‘The Butcher of Gujrat’ at the UNSC.\nHe said he fully endorsed the foreign minister’s statement wherein he stated that, “He (Narendra Modi) was banned from entering this country (the United States). These are the prime minister and the foreign minister of RSS, which draws inspiration from Hitler’s SS.” The former Senate Chairman also commended the foreign minister on very pertinently reminding the United Nations Security Council (UNSC) to fulfil its obligation vis-à-vis an agenda item that had been left unaddressed – the issue of Jammu and Kashmir.\nSenator Naek said Bilawal Bhutto, while speaking on open debate ‘Maintenance of International Peace and Security – Reformed Multilateralism’ in the UNSC, had dexterously used the forum to urge the United Nations Security Council (UNSC) to implement its resolutions on the Kashmir issue and deliver its commitment to peace in the region and “prove that multilateralism can succeed”.\nHe was also appreciative of the fact how the foreign minister made use of the UN platform to show to the world that India, ‘the so-called biggest democracy and a secular state’, was actually an extremist RSS-led mobocracy following a myopic, intolerant and terror-driven ultra-nationalistic Hindutva philosophy that considered the whole of India as an essentially Hindu state that had no room for religious and ethnic minorities and progressive elements.\nThe Senate Foreign Affairs Committee Chairman also demanded the immediate release of Hurriyat leader Muhammad Yasin Malik and all other Kashmiri leaders and people incarcerated on trumped-up charges. He said Yasin Malik and other political prisoners were victims of draconian Indian Terrorist and Disruptive Activities Act (TADA) was black law that aimed at targeting political opponents.\nIndia’s malfeasant attempts to fallaciously implicate and incarcerate Kashmiri leadership in fabricated cases will neither dampen their (Kashmiris’) morale nor dent their legitimate struggle for the right to self-determination, Senator Naek said.\nThe historic struggle being waged by valiant people of the IIOJK for their rights is indigenous and cannot be hampered by the draconian strong-arm tactics of the Modi-led Indian Government, he said. Senator Naek also urged the international community to take cognizance of India’s atrocities and highhandedness on Muslims in general and Kashmiris in particular and impress upon New Delhi to stop its human rights violations and excesses against minorities, especially Muslims.\nHe also called upon the international community to help Kashmiris exercise their right to self-determination as espoused under the relevant UN Security Council resolutions and as per their own wishes.",
  "retrievedAt": "2025-08-11T16:02:33.200Z"
}
