{
  "title": "President for further cementing Pak-Italy ties",
  "link": "https://www.app.com.pk/national/president-for-further-cementing-pak-italy-ties/",
  "date_published": "2022-12-19T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): President Dr Arif Alvi on Monday stressed bilateral relationship with  Italy in the fields of defence, agriculture, animal husbandry and information technology.\nThe president made these remarks while talking to Pakistan’s Ambassador-designate to Italy, Ali Javed, here at the Aiwan-e-Sadr\nDuring the meeting, the President appreciated the idea of establishing manufacturing units by Pakistani diasporas in the industrial-free zone of Italy for manufacturing and exporting Pakistani goods and products in Italy and rest of the Europe.\nHe said the avenues for exports of human intellect, knowledge and skills online to Italy by our IT professionals and related fields needed to be explored.\nThis way, he said, the human resource would be retained in Pakistan whereas their skills and knowledge could be shared.\nHe said the country needed a skilled workforce for industrial, agricultural and manufacturing development.\nThe president said that the Ambassador and the entire ancillary staff in Italy should focus their energy on resolving the issues and problems faced by the Pakistani diasporas in Italy and provide them with the necessary support, and counselling services online and at their doorsteps.\nThe president advised the ambassador-designate to keep close linkages with the Chambers of Commerce in Pakistan and major industrial and manufacturing entities of Pakistan and explore the possibility of joint ventures with the Italian counterparts.\nHe said that Italian investors must be encouraged to shift their industrial units to Pakistan and benefit from the cost-effective labour, availability of raw materials, and investment-friendly policies in our country.\nThe president said that there was a need to highlight the atrocities being committed perpetually by India in the Indian Illegally Occupied Jammu & Kashmir (IIOJK), and the increasing incidences of intimidation, harassment, and marginalization of minorities, especially Muslims, and the increasing trend of Islamophobia in India, which was putting the life and property of the Muslims of India in great danger.\nThe president said that Pakistan and Italy had a commonality of views on a number of regional and global issues, particularly reforming the UN Security Council and both countries should work closely on all issues of common interest.\nHe said that the Strategic Engagement Plan signed between the two countries in 2013 provided an excellent framework to steer bilateral and multilateral cooperation forward in a holistic and sustained manner and expressed hope that the Ambassador-designate would work towards enhancing these engagements.\nThe president said that Italy was one of the largest trading partners of Pakistan in the EU and among the top ten globally.\nThere is great potential for expanding bilateral trade and investment due to the complementarities between the two countries’ economies, he added.\nHe further said that the existing trade of around US$ 1.3 billion did not represent the true potential on both sides and there was a need to make concerted efforts to increase the volume.\nThe president said that a fairly large number of Pakistanis (approximately 200,000) were living in Italy and contributing towards the socio-economic development of the country and urged that the welfare of these Pakistanis should be the most priority.\nApart from working on traditional economic diplomacy, the ambassador-designate should also look for new avenues of cooperation, especially start-ups, he said.",
  "retrievedAt": "2025-08-11T16:02:30.806Z"
}
