{
  "title": "Ume Hassan, 12 others sent on four-day physical remand - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: An Anti-Terrorism Court (ATC) in Islamabad has sent Ume Hassan, spouse of Lal Masjid cleric, and 12 others on a four-day physical remand in a case related to an armed attack on a government vehicle and staff.\n\nThey, six women and seven men,were arrested on Wednesday night from Madani Mosque in Margalla Town and presented before the court of ATC Judge Tahir Abbas Sipra, where the prosecution sought a five-day physical remand.\n\nA case has been registered against the accused at Shahzad Town Police Station under anti-terrorism provisions.\n\nDuring the hearing, the defence lawyer opposed the remand, arguing that the accused were arrested from the Madani Mosque in Margalla Town and questioned what the police intended to recover from them. Ume Hassan stated that the incident stemmed from a dispute over the mosque and that she had gone to negotiate with the administration before being arrested.\n\nThe police contended that the disputed property was designated for a madressah and that construction work was going on when the accused allegedly attacked officials and took away building materials.\n\nThe prosecution emphasised the need for remand to facilitate the arrest of other suspects linked to the incident.\n\nJudge Sipra, questioning the necessity of remand, remarked: “If they were arrested on the spot, what can be recovered from them?” The police responded that they needed to apprehend additional accomplices. The judge also noted that Ume Hassan had four previous cases against her, to which her lawyer replied that they had only recently been informed and would appear in court accordingly.\n\nExpressing concern over recurring disputes in religious places, the judge remarked, “Why do they fight at mosques, temples, and Imambargahs? When will conflicts at places of worship stop?”\n\nAfter hearing arguments from both sides, the court granted a four-day physical remand of all the accused to the police.\n\nThey were arrested on Wednesday night under several charges including firing at police and CDA staff, making CDA officer and labourer hostage, putting up resistance, damaging official vehicles, etc., police said.\n\nThe case has been registered at Shahzad Town police station under sections 7 and 11(x) of ATA, Section 8 of Peaceful Assembly and Public Order Act 2024, sections 395, 324, 342, 341, 148, 149, 353, 186, and 440 of Pakistan Penal Code, and Section 13 and 20 of Arms Ordinance 1965.\n\nAccording to the FIR, CDA allotted a plot to Madrasa Idara Ashraful Uloom, Murree Road for construction of a seminary. Ume Hassan and 80 men and 40 women, armed with weapons and batons, attacked the labourer and the CDA staff.\n\nAfter getting the information the police reached the spot. Seeing the police contingent the attackers gave provocative speeches besides, putting up stiff resistance against the police and also blocked the roads.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:54:48.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893297",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:49:31.000Z"
}
