{
  "title": "Article 245 does not grant judicial powers to military, Supreme Court CB told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Imran’s lawyer says army needs to specify which constitutional provision allows it to try civilians\n• Says National Assembly resolution not binding; law has to operate on its own terms\n• Justice Hilali wonders why only 105, out of some 5,000 May 9 suspects, were handed over to military\n\nISLAMABAD: The Constitutional Bench hearing cases against the military trials of civilians was told on Thursday that Article 245 of the Constitution, which allows the armed forces to aid civil authorities, does not grant the military judicial powers by replacing civil courts.\n\n“There is nothing stated in Article 245 of the Constitution that the armed forces can exercise judicial powers,” senior counsel Uzair Karamat Bhandari, representing PTI founder Imran Khan, said.\n\nLed by Justice Aminuddin Khan, the seven-member bench was hearing a set of intra-court appeals (ICAs) against the Oct 23, 2023, five-judge order that nullified the military trials of civilians involved in the May 9 violence.\n\nThe counsel cited the 2010 Iftikhar Muhammad Chaudhry case, where it was held that there was no room for any residual or inherent powers, and if any power has to be given to any institution, then it must flow from the text of the Constitution.\n\nIf the armed forces wanted to exercise any judicial power in relation to civilians, they have to point out a provision from the Constitution, Mr Bhandari contended. He said it was akin to parliament imposing property tax, when the matter falls under the domain of the provincial assemblies.\n\nThe counsel cited the 1980 Darvesh Arvi case to explain how amendments to the Pakistan Army Act 1952 through the Defence of Pakistan Ordinance — to punish arson and attacks on government buildings — were declared ultra vires.\n\nThrough this ordinance, the powers of magistrates were vested in captains and other officers of the armed forces, the counsel recalled, adding that civil disturbance, attacks on government buildings and arson broke out in the aftermath of the 1977 general elections. Consequently, the army was called in Karachi, Hyderabad, and Lahore.\n\nDuring the hearing, Mr Bhandari reminded that Article 245 of the Constitution was invoked on May 10, 2023, after the events of May 9, and a subsequent decision was made to hand over the detained suspects to the armed forces for military trials.\n\nThe armed forces were called in aid of the civil power in Khyber Pakhtunkhwa, Islamabad and Punjab, the counsel said, adding that the armed forces could not operate beyond what had been stated in Article 245 – a provision which was very exhaustive and lists what the armed forces can do.\n\nThe counsel also recalled even the National Assembly had passed a resolution, after which Article 245 was invoked, but before that corps and formation commanders’ meetings were also held.\n\nAt this Justice Muhammad Ali Mazhar wondered about the effect of the resolution adopted by the National Assembly to try civilians for May 9 violence. The counsel argued that the NA resolution has no binding effect since the law has to function on its own terms, subject to the Constitution.\n\nThe resolution has a political force and nothing more, he said, emphasising that the F.B. Ali case has already held that Section 2(1)(d)(i) and (ii) of PAA, which allows the trial of civilians under the army act, will not come under the ambit of Article 8(3)a of the Constitution.\n\nThe present bench cannot overrule what has been stated in the F.B. Ali case since no prayers had been made before the court in this regard, he said, adding no reason was given before handing over 105 suspects involved in May 9 cases to the armed forces.\n\nAt this, Justice Jamal Khan Mandokhail observed that F.B. Ali case, which has been endorsed by the Supreme Court in all subsequent judgements, has become something of a problem. The counsel said there was a need to see how Section 2(1)(d)(i) and (ii) fit into the framework of the 1973 Constitution.\n\nHe also pointed out that nobody knows under what principle 105 individuals were tried by military courts while the rest were tried by civilian courts. Justice Aminuddin Khan remarked that the ‘pick and choose’ happens after the registration of the FIR.\n\nAt this, Justice Musarrat Hilali wondered that more than 5,000 people were arrested on May 9-10, and only 105 were sent into the military’s custody despite the fact that those sent to ATC were also accused of attacking military installations. What were the charges levelled against those who were tried by military courts, Justice Hilali observed, while adding that no one understands the F.B. Ali case.\n\nThe counsel argued that an effort should be made to close this path for the future, saying no one knows what charges were brought against those in military trials since the record remained inaccessible. He also referred to his personal experience when he was detained for two hours when he went to get a power of attorney.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:33:19.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893243/article-245-does-not-grant-judicial-powers-to-military-supreme-court-cb-told",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:48:01.000Z"
}
