{
  "title": "Large-Scale Manufacturing production shrinks 1.8pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Large-Scale Manufacturing (LSM) sector contracted 1.87 per cent year-on-year in the first half of 2024-25, the Pakistan Bureau of Statistics data showed on Thursday.\n\nThe big industry production has seen a negative trend since August 2024, except in October, due to domestic and global factors. The LSM grew positively from December 2023 to May 2024 before entering negative territory in June.\n\nOn a YoY basis, LSM dipped 2.65pc in August, followed by a decline of 1.92pc in September. However, it recorded a paltry growth of 0.02pc in October before contracting by 3.81pc in November and 3.73pc in December. The LSM expanded 2.38pc in July 2024.\n\nIn FY24, the LSM sector contracted 0.03pc against a 0.92pc expansion in the preceding year.\n\nThe food group expanded by 0.85pc in 6MFY25 on a year-on-year basis. Wheat and rice milling experienced a rise of 5.74pc, starch and its products 0.27pc, respectively. Wheat and rice milling increased substantially during the period under review, owing primarily to improved crop harvests.\n\nHowever, vegetable ghee production declined by 2.82pc, cooking oil by 0.49pc and tea blended by 5.62pc.\n\nThe textile sector grew 2.14pc in 6MFY24. The cotton yarn production increased by 8.77pc, while the cotton cloth output rose by 0.80pc, accounting for more than 80pc of the textile industry. The primary cause of the rise in production was a slight increase in export unit value in the face of higher external demand for textiles. The exports of garments recorded a growth of 9.53pc on a YoY basis. The surge in garment exports is primarily due to diverting foreign purchasers from Bangladesh to Pakistan.\n\nCoke and Petroleum products recorded a negative growth of 0.33pc in 6MFY24. The petrol production declined by 3.32pc. However, the production of high-speed diesel rose by 3.19pc, kerosene by 17.76pc, followed by lubricating oil by 6.30pc, jute batching oil by 79.27pc and solvent naphtha by 30.98pc. The furnace oil production dipped 4.18pc, LPG 8.76pc and jet fuel oil 13.89pc.\n\nThe automobile sector production surged 50.16pc in 6MFY25, mainly contributed by a growth of 46.82pc in jeeps and cars, followed by LCVs 219.11pc, trucks 112.80pc, and buses 44.31pc. However, the production of diesel engines declined by 9.26pc during the months under review.\n\nIn the last few years, the automotive industry has grappled with many challenges, including a decline in demand, exacerbated by factors such as rising car prices due to inflation and currency fluctuations. Moreover, non-enticing auto financing options offered by banks further dampen consumer interest.\n\nThe production of pharmaceutical products saw a growth of 1.85pc and fertilisers 2.04pc, respectively.\n\nIron and steel production declined 12.04pc in 6MFY24. Billets/ingots, mostly consumed in the construction industry, experienced a 28.70pc decline. Similarly, H/C.R. sheets/strips/coils/plates grew adversely by 2.60pc.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b7f1d3405d2.jpg",
  "retrievedAt": "2025-10-12T01:34:18.173Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893329/large-scale-manufacturing-production-shrinks-18pc",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T03:21:39.000Z"
}
