{
  "title": "When cricket defies logic: Pakistan vs India, or the stories we tell ourselves - Pakistan - DAWN.COM",
  "author": null,
  "content": "My first memory of a cricket match was the 2007 World T20 final between India and Pakistan. I’m sure I’d watched cricket matches before — after all, there must have been the ones that led up to the tournament finale. But I vividly remember Misbah scooping the ball over short-fine-leg with six runs left of four balls.\n\nWhile the ball was in the air, I felt an optimism that only a child who had never watched Pakistan play cricket before could feel; surely, this one would go for six. Where else can a ball flying that high land?\n\nThe answer, as it turned out, was Sreesanth’s hands.\n\nSo, despite having watched cricket matches before, like a duckling to its mother, this 2007 final was the Pakistan cricket that imprinted on me: a purgatory of almost, a refrain of why did he do that? And then, ultimately, there was the matter of playing against India.\n\nThe last time India and Pakistan played a bilateral series against each other was Pakistan’s 2012-13 tour of India. The trailer for the series consisted of prominent Indian players — Mahendra Singh Dhoni, Virat Kohli, Gautam Gambhir — their faces set with a sombre determination, but what really underscored the core of cricketing relations was a single phrase, a plea from their Indian fans: inn se mat haarna (Don’t lose to them).\n\nIronically, Pakistanis’ sentiments toward their team are pretty identical —somehow, equations of victory and loss feel heavier and more significant when it comes to our neighbours across the border.\n\nAnd though the dynamics might have changed since bilateral cricket between the two teams was halted in 2013, it’s certainly not a one-sided sentiment.\n\nOne does not need to probe too deeply to find a nearly inexhaustible archive of Indian media that, in some capacity, references the rivalry. In a scene in Shabash Mithu, the Bollywood biopic for Indian women’s cricket stalwart Mithali Raj, a patron at a bar is grumbling at a bartender to change what’s playing on the television — the group-stage match between Pakistan and India at the 2017 women’s World Cup — and put on something more interesting instead. The bartender obliges.\n\nLater, however, when the match is put back on, and a victorious Indian team is running across the field, the same patron looks on, incredulous as chants of ‘India, India’ rise in the crowded bar. “Pakistan ko haraa diya? (We defeated Pakistan?)” he was bemused.\n\nIn 2015, Star Sports India rolled out the infamous Mauka Mauka advertisement — a plea of a longstanding Pakistani fan looking for a ‘mauka’, a chance to celebrate a World Cup win against India. Every four years, the portrayed fan digs out a box of unlit firecrackers from the cupboard, hoping to light them this time, only to end up burying them deep in the cupboard again.\n\nOf course, the endless referential storytelling that has emerged from the India-Pakistan rivalry is rooted somewhere that precedes and goes far beyond the sport. Cricket has, after all, been used as a tool for diplomacy and relationship-mending between the two states on more than one occasion.\n\nWhile my purpose here is far from tracing the gritty politics of the matter, long-lasting political and ideological tensions between the two nations date right back to the very Partition that birthed them. All that has transpired as a result of these — conflicts, power struggles, maybe even heated exchanges on social media between people with about 10 followers each — has shaped what it means to be a Pakistani or an Indian in relation to what the other is not.\n\nTo some extent, being Pakistani relies on identifying the parts of oneself that one can psychologically and semantically define as ‘not Indian’, and there is enough historical and anecdotal evidence to suggest that the reverse is true as well. All of this is to say that when the political equations between two parties are so dynamic, to say the least, then their overspill into the calculation of cultural output is inevitable — and to say that sport can be cleaved from politics is naive.\n\nThe overlap between nation and tension and a cricket match was strangely, and perhaps unintentionally, scaled in a 33-second ad aired in Pakistan before the India-Pakistan clash in the 2019 World Cup.\n\nIn the ad, a man in an unmarked but blue jersey is made to resemble Indian Air Force pilot Abhinandan Varthaman, whose jet was shot down in Pakistani territory earlier that year. When asked about the specificities of his mission, Abhinandan said, “I’m not supposed to tell you that.”\n\nWhile Abhindandan was returned to India a few days later — after famously having praised the tea that was offered to him — the general circumstances of his capture and release were a source of great friction (more than usual) between the two countries. So when this fictional iteration of Abhinandan, the one in the ad, (who was also sipping a cup of tea) was asked “Toss jeet gaye tou kia karo gey? (What will you do if you win the toss?)” he was similarly concise: “I’m not supposed to tell you that.”\n\nAd-Abhinandan began walking away with the cup of tea, only to be stopped by someone outside the frame, who asked him where he thought he was taking it. The screen went dark subsequently and a message flashed on the screen, a hashtag: #LetsBringTheCupHome.\n\nSo it makes sense, then, why the stakes feel so much higher, overcharged, when it comes to this particular fixture. Cricket finds a way to seep into every little story we tell — the ones not only in the feature films but also in the fleeting ads, on sporting grounds and battlefields alike.\n\nWhen Pakistan emerged as the initially unlikely winners of the 2017 Champions Trophy, a jubilant winning crowd surrounded captain Sarfaraz Ahmed’s home in Karachi in an echoing chant after finally having gotten their chance: “Mauka, mauka!”. The smiling captain, gleaming trophy in his hand, looked on.\n\nOf course, another reason why this sporting equation feels denser than others is because India-Pakistan fixtures have become a novelty. Since the pause in India-Pakistan bilateral cricket, the two only play each other in international tournaments, which has, over time, become somewhat of an annual affair. When something is so rare, it becomes revered — not just by fans, but by the pronged hydra-head of capitalism that controls most of cricket in its many different ways.\n\nThe revenue via advertising, ticket sales and broadcasting at stake during these games is immense, and often the fixture ends up being marketed as the crown jewel of whichever tournament is taking place. Added to this is the layer of administrative tensions between the two cricket boards themselves, the latest of these being the Indian cricket board’s refusal to let the Indian team tour Pakistan, causing a wing of the Champions Trophy 2025 to be shifted to the United Arab Emirates.\n\nA growing culture of parasociality around cricketers in the subcontinent also contributes to the heat that simmers with increasing intensity as an India-Pakistan fixture approaches, with fans going to great lengths to defend their teams and players both in the stands and online.\n\nIn the lead-up to the ongoing tournament, Netflix released a documentary titled The Greatest Rivalry: India vs Pakistan, an exposition on the intricate and complex cricketing relations between the two countries told through the lens of India’s 2004 tour of Pakistan.\n\nAll things considered, the heat and celebrity of the moment sometimes threaten to overshadow the game of cricket itself. But the thing I love the most about cricket is this: once the coin is flipped and the bowler’s run-up is marked, it’s hard to think about anything else.\n\nSo when Fakhar makes a maiden century to help Pakistan over the line in a high-stakes final, or when Kohli is caught out one ball after he was dropped to much despair, there is little that matters outside it.\n\nWhen the waters of the ocean of the blue Ahmedabad crowd are stilled into silence every boundary that a Pakistani batter scores, its rapturous rebirth when Babar’s bails are knocked off is equally intense. When Shaheen is explosive up-front, and Babar and Rizwan drive their way to a flawless, unblemished victory, there is hardly a movie you would want to watch instead.\n\nSo while I know better — that a sport isn’t the beginning or the end of the world, that sometimes the sentiments that drive us while watching sport can be manufactured and contrived, that sometimes it feels like my team enjoys losing so not watching them would save a lot of time and distress — the knowledge doesn’t amount to much.\n\nIn some ways, I am still permanently stuck in the moment where the ball was in the air, during the last delivery of that one final, many years ago, and it feels like it might go for a six. That it doesn’t, doesn’t really matter.\n\nHeader image: Fans wave India’s and Pakistan’s national flags during the Asia Cup 2023 one-day international (ODI) cricket match between India and Pakistan at the Pallekele International Cricket Stadium in Kandy. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2114191493afb10.jpg",
  "retrievedAt": "2025-08-25T19:54:48.367Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892988/when-cricket-defies-logic-pakistan-vs-india-or-the-stories-we-tell-ourselves",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T05:11:37.000Z"
}
