{
  "title": "10 nurses injured as lift collapses at Lahore’s Mayo Hospital - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Some 10 nurses were injured on Thursday, eight of them suffering multiple leg and head fractures, when a lift collapsed at Mayo Hospital.\n\nWhen the lift, installed in the orthopaedic department a year ago, collapsed, the nurses were celebrating their last day of training at a function arranged in the multi-story building.\n\nSources say that two of the nurses suffered deep head injuries, while five others got multiple leg fractures.\n\nThey said when the injured nurses were rushed to the emergency wards, it transpired that the neurosurgeon was absent. At this, the colleagues of the injured nurses protested against the administration of the institute.\n\nEight of them suffer fractures\n\nAn official said that the lift collapsed when its pulleys got loose, resulting in serious injuries to nurses.\n\nThe protesting nurses demanded immediate attention of Chief Minister Maryam Nawaz to the incident occurring in the largest public sector hospital that was already facing administrative and financial problems.\n\nSome senior medical teachers of the hospital blamed an official for the incident, saying that he was a clinician while the post was designated for an officer having administration experience.\n\nThey said the official had failed to ensure implementation of the standard operating procedures (SOPs) as the lift was meant to carry a specific number of persons at a time, but there was no one to guide the nurses in this regard.\n\nA senior doctor alleged there were multiple complaints against the AMS Works when 73 air-conditioners installed in different wards of the hospital were found non-functional last August.In 2019, a teenager had died after being trapped in an elevator in the hospital, after which a four-member inquiry committee was constituted to probe the incident. Sources said the committee only met twice and the case was dumped.\n\nMayo Hospital Chief Operating Officer (COO) Prof Faisal Masood said the unfortunate incident took place at a time when he was invited as chief guest to a function organised in the orthopedic department for the nursing students marking the last day of their training.\n\nHe confirmed that the lift operator was not present there to guide the students with regard to the lift’s capacity.\n\nFive of the students suffered multiple fractures, the COO said, adding that a committee has been constituted to probe the incident and fix responsibility.\n\nTo a question about the alleged appointment of the AMS Works against merit, he didn’t comment.\n\nProf Masood said that the hospital had decided to make it mandatory for the lift operators to sit in the elevator and any violation in this regard would be punished strictly.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:34:33.535Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893353/10-nurses-injured-as-lift-collapses-at-lahores-mayo-hospital",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T03:42:57.000Z"
}
