{
  "title": "Punjab police file three cases under Peca for deepfake content - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Police on Thursday registered three cases under the Prevention of Electronic Crimes Act (Peca) 2025 for allegedly uploading on social media AI-generated deepfake immoral videos and images of Punjab Chief Minister Maryam Nawaz and spreading malicious propaganda against the state institutions.\n\nThe FIRs were registered with the Shahdara, Shahdara Town and Kot Lakhpat police stations mentioning some other charges too, including sections 500, 504 and 505-1 (C) of the Pakistan Penal Code (PPC).\n\nThe section 500 defines the punishment for defamation. It states that a person who defames another can be imprisoned for up to two years, fined, or both.\n\nAccording to the section 504 of the PPC, whoever intentionally insults, and thereby gives provocation to any person, intending or knowing it to be likely that such provocation will cause him to break the public peace, or to commit any other offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\nAI-generated images of CM uploaded on social media\n\nThe section 505-1 (C) of the PPC reads: (1) Whoever makes, publishes, or circulates any statement, rumour or report: (c) with intent to incite, or which is likely to incite, any class or community of persons to commit any offence against any other class or community, shall be punished with imprisonment for a term which may extend to seven years and with fine.\n\nThe Prevention of Electronic Crimes (amendment) Act was passed in January by the parliament.\n\nThe new amendments added section 26 (A) to the cyber crime, which sought to penalise perpetrators of “fake news” online.\n\nIt says anyone who intentionally spreads, displays, or transmits false information likely to cause fear, panic, or unrest in society may face up to three years’ imprisonment, a fine of up to Rs2 million, or both.\n\nA police official said the three cases were registered on the complaints of the local ‘respected citizens and businessmen’ with no arrest of any suspect nominated in the FIRs so far.\n\nIn the FIR registered with the Shahdara Town police, complainant Mohammad Amir alleged that some elements have launched malicious campaigns to defame the state and its institutions through AI- generated images, photos and other AI-created contents.\n\nHe said they were uploading/sharing these hateful contents on social media platforms, causing harm and damage to the reputation of the individuals, particularly, of the state institutions by spreading misinformation.\n\nNominating a suspect Rana Mohammad Dawood, he alleged that the suspect uploaded the AI-generated immoral video of Chief Minister Maryam Nawaz on Facebook with a prime objective of defaming and damaging her reputation.\n\nThe suspect committed serious offences under Peca 2025 and other charges which were liable to be punished, he said.\n\nThe complainant provided a Facebook link and the contents to the police as evidence.\n\nSimilarly, Abdul Raoof alleged in the FIR registered with the Kot Lakphat police that an unknown man uploaded AI-generated fabricated and immoral video clips and photos of Maryam Nawaz on his social media account ‘The Last Hope’.\n\nHe also launched a hateful campaign against the state institutions on the same platform and made them viral with a malicious intent of inciting the public and creating unrest.\n\nIn the FIR registered with Shahdara police, Raza Town resident Khalid Yasin alleged that some elements were spreading fabricated narratives against national security institutions and inciting public unrest.\n\nThey also disseminated fake news and used derogatory remarks against the state and its institutions, he said. There were reports that no arrest was made so far.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:54:48.809Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893349/punjab-police-file-three-cases-under-peca-for-deepfake-content",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T03:40:25.000Z"
}
