{
  "title": "‘Miscreants’, facilitators held in Kurram action - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Drivers stranded during ambush on convoy rescued, food supplies recovered\n• Govt asked to provide relief package for affected population\n• 57 booked for Feb 17 attack on convoy\n\nKURRAM: At least 30 miscreants and facilitators were rounded up during an operation launched by the security forces in Lower Kurram on Thursday, police said.\n\nKohat Regional Police Officer Abbas Majid Marwat, while talking to the media, said a large-scale operation was carried out by the police and security forces in Bagan, Charkhel, Dad Kamar, Mandori, Ochat and adjacent areas.\n\nHe stated that 18 miscreants and 12 facilitators had been arrested so far, adding that all drivers of the convoy stranded in the area had been brought to Thall Fort.\n\nGoods looted from the convoy were also recovered from five houses, which led to the arrest of five suspects, the RPO said.\n\nOn Monday, over 30 trucks carrying food supplies to Kurram were looted while 19 trucks were set on fire after the convoy came under an attack at the Bagan, Charkhel, Ochat and Mandori areas. Several people, including security personnel and drivers, lost their lives in the incident.\n\nThe officer said that militants had also targeted a convoy of Commandant Kurram Militia in Mandori, which resulted in some security personnel being martyred and injured.\n\nHe told the media that house-to-house searches were being carried out while similar operations were going on in the mountainous areas. After the operation, the Kohat-Parachinar Road will be cleared for traffic, he added.\n\nFor the past five months, the closure of roads to Kurram district has caused severe difficulties for the residents, who saw a famine-like scenario in the district if the situation persisted.\n\nA traders’ leader, Haji Imdad, reported that goods collected for the holy month of Ramazan had been looted, creating difficulties for the public in meeting their daily needs. He pointed out that traders faced huge losses while people suffered due to the unavailability of food items.\n\nThe traders appealed to the government to immediately provide an emergency relief package for the 500,000 stranded population. They warned that if timely help was not provided, it could lead to a humanitarian crisis.\n\nMeanwhile, people in Bagan and Mandori areas staged a sit-in on the main road in support of their demands.\n\nTribal leader Haji Karim announced that the protest would continue until the affected people received aid and elements involved in the convoy attacks were arrested.\n\nPDMA District Coordinator Shiraz Badshah said six families had already moved from the area.\n\nAccording to the district administration, the Kohat peace agreement is being implemented, and so far, 194 bunkers have been destroyed in the Kurram district.\n\nCase registered\n\nA first information report was lodged by a police officer at the CTD police station in Kurram against 57 unidentified miscreants for their alleged involvement in the Feb 17 attack on a convoy, which was travelling to Parachinar.\n\nThe suspects were charged under various sections, including 7 and 9 of the ATA and 302 of the PPC. In the incident, five security personnel and one driver were martyred, while two attackers were killed.\n\nAccording to the FIR lodged by SHO Ahmad Shamshad Khan, on Feb 17 a convoy of 63 vehicles loaded with goods left for Parachinar from Thall. When the convoy reached Ochat and Mandori areas in Lower Kurram, militants from the banned Tehreek-i-Taliban Pakistan, including 57 nominated militants and other unknown assailants, attacked the vehicles.\n\nThey looted goods and set fire to 19 vehicles. Nine vehicles reached Parachinar, while 33 others sent back to Thall, most of which had been looted.\n\nAccording to the FIR, the 57 people nominated in the case belong to various areas, including Ghuz Ghari, Pir Qayyum, Sadda, Central Kurram, Bagan, Charkhel, Mandori, Dad Qamar, Makhrani, Badamah, Kocha, Gogani, Durani, Satain, Tizi, Tando, Pushtoni, etc.\n\nEfforts were being made to arrest them.\n\nAmong the suspects, Kazim and others were also named in the FIR related to the Nov 21 attack on a convoy travelling to Parachinar.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:34:19.482Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893250/miscreants-facilitators-held-in-kurram-action",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:47:55.000Z"
}
