{
  "title": "PTI leadership meets CJP, urges him to prevent ‘court packing’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI leaders said they met Chief Justice of Pakistan (CJP) Yahya Afridi on Friday and urged the top justice to sort out issues in the judiciary and not to pack the Supreme Court (SC) with judges.\n\nAfter the arrival of new eight Supreme Court judges, CJP Afridi on Monday had reshuff­led several committ­ees which had been constituted to distribute different responsibilities among judges of the top court.\n\nThe process of the new judges’ appointment was one fraught with controversy as four apex court justices had urged CJP Afridi earlier this month to hold off on the new appointments until challenges to the 26th Constitutional Amendment were resolved, in particular pointing to the possibility of a public perception of court-packing being generated. The PTI had also previously urged CJP Afridi to postpone the process.\n\nHowever, defending the judicial appointments, CJP Afridi had rejected accusations of court-packing, arguing that SC judges were now hearing between 30 and 40 cases a day, significantly more than the previous workload of 12 cases per day.\n\nAddressing a press conference with other PTI leaders in Islamabad about today’s meeting with the top judge, Latif Khosa said the delegation told the CJP to “get his house in order”.\n\n“Judges of the Supreme Court are repeatedly writing that first the [petitions against] the 26th amendment should be decided and until then don’t do any court-packing. We used this word of court-packing that this is happening which coming generations of ours will suffer the results of this so that is why we said first please sorten out your house.”\n\nKhosa referred to the representation and petition from five Islamabad High Court judges concerning the seniority row in the high court and called on the CJP to give due attention to the matter.\n\n“The people are awaiting injustice. A regime based on heresy and disbelief might be able to continue but one based on injustice cannot.”\n\nLeader of the Opposition in the National Assembly Omar Ayub said he had received a call for a meeting from the CJP’s office after which he took permission from party founder Imran Khan.\n\nHe said Imran had instructed him to specifically raise the matter of the military court trials with the CJP.\n\nElaborating on the points discussed with the top judge, Ayub said the issues of Imran and his spouse Bushra Bibi’s court dates, lack of access of PTI leaders, lawyers and relatives to the couple and the treatment being meted out to the former prime minister in prison were raised,\n\nAyub mentioned that the status of other incarcerated PTI leaders and workers, missing persons and abducted party supporters were also discussed with CJP Afridi.\n\nThe opposition leader said the precarious situation in Balochistan, the lack of rule of law in the country and the economic conditions also came under discussion with the top judge.\n\nAyub said the PTI delegation also followed up on Imran’s letter to CJP Afridi, who said that it was sent to the Constitutional Bench, and told the top judge that the party did not accept the 26th constitutional amendment and that commissions should be set up to look into the PTI founder’s letter.\n\nThe opposition leader also mentioned various other issues about the party such as the lack of implementation for its incarcerated lawmakers’ production orders, alleged threats to party lawyers, fabricated cases and more.\n\nPTI interim Chairman Barrister Gohar Ali Khan said a seven-member delegation met CJP Afridi at the top judge’s request for consultation on the upcoming meeting of the National Judicial Policymaking Committee.\n\nGohar said the party told the CJP that court orders were being flouted with a lack of implementation on any apex court verdicts in the PTI’s favour.\n\n“He reassured us that he would definitely take measures to find solutions to all of this and make sure to find solutions to the PTI’s issues and problems,” Gohar added.\n\nPTI Secretary General Salman Akram Raja said the party laid before the CJP that the implementation of the law and Constitution in the country had practically ceased and that it was the judiciary’s responsibility to issue orders upholding the rule of law and the Constitution.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2119412432667a0.jpg",
  "retrievedAt": "2025-08-25T19:54:42.514Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893398/pti-leadership-meets-cjp-urges-him-to-prevent-court-packing",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T13:31:41.000Z"
}
