{
  "title": "Africa’s first G20 moot opens with call for ‘cooperation’ - World - DAWN.COM",
  "author": null,
  "content": "JOHANNESBURG: South Afri­ca’s President Cyril Ramaphosa opened on Thursday a Group of 20 foreign ministers meeting with a call for “cooperation” amid geopolitical tensions and “rising intolerance”.\n\nTop diplomats from the world’s largest economies gathered in Johannesburg for the two-day talks held for the first time in Africa and overshadowed by the absence of US Secretary of State Marco Rubio.\n\n“It is critical that the principles of the UN Charter, multilateralism and international law should remain at the centre of all our endeavours. It should be the glue that keeps us together,” Ramaphosa said.\n\n“Geopolitical tensions, rising intolerance, conflict and war, climate change, pandemics and energy and food insecurity threaten an already fragile global coexistence,” Ramaphosa said.\n\nAbsence of the US secretary of state ‘not a train smash’, says Ramaphosa\n\nThe G20, a grouping of 19 countries as well as the European Union and the African Union, is deeply divided on key issues from Russia’s war in Ukraine to climate change. World leaders have also been split on how to respond to the dramatic policy shifts from Washington since the return of US President Donald Trump.\n\n“As the G20 we must continue to advocate for diplomatic solutions to conflicts,” Ramaphosa said.\n\n“I think it is important that we should remember that cooperation is our greatest strength,” he added. “Let us seek to find common ground through constructive engagement.” A curtain-raiser to the G20 summit in November, the meeting was attended by top diplomats including Russian Foreign Minister Sergei Lavrov, his Chinese and Indian counterparts as well as European envoys like France’s Jean-Noel Barrot and Britain’s David Lammy.\n\nBut the group’s richest member, the United States, was only represented by the deputy chief of mission at the American embassy in Pretoria after Rubio skipped the meeting amid disputes with the host nation over several policy issues.\n\n“My job is to advance America’s national interests, not waste taxpayer money or coddle anti-Americanism,” Rubio said, announcing his decision to not travel to South Africa for the meeting. Ramaphosa said Rubio’s absence was not a “train smash” and did not amount to a boycott since the United States was represented.\n\nHe hoped the diplomatic process would “iron out wrinkles that may have appeared in our relationship”, he told reporters.\n\nPretoria has in particular come under fire from Washington for leading a case at the International Court of Justice accusing Israel of “genocidal” acts in its Gaza offensive, which Israel has denied.\n\nUS Secretary of Treasury Scott Bessent announced on Thursday that he would also not attend the G20 meeting of finance ministers and central bank governors in Cape Town next week.\n\n‘Africa must be heard’\n\nThe first G20 presidency by an African nation was an opportunity for the continent to be “heard on critical global issues, like sustainable development, the digital economy and the shift toward green energy”, Ramaphosa said in his opening address.\n\nSouth Africa’s priorities included finding ways to scale up resilience to climate disasters and improving “debt sustainability” for developing countries.\n\nIt also wanted to mobilise finance for a “just energy transition” in which countries most responsible for climate change support those least responsible, he said. But in a sign of the tensions within the grouping, the planned family photograph was cancelled as several countries did not wish to appear next to Lavrov, members of a delegation said.\n\nSouth Africa has been criticised for its ties with Russia, including not condemning its 2022 invasion of Ukraine.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b7d50901724.gif",
  "retrievedAt": "2025-10-12T01:33:33.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893272/africas-first-g20-moot-opens-with-call-for-cooperation",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:48:29.000Z"
}
