{
  "title": "New Delhi says it is looking into ‘deeply troubling’ information about USAID activities in India - World - DAWN.COM",
  "author": null,
  "content": "Indian authorities are looking into “deeply troubling” information about US governmental activity in the country, New Delhi said on Friday, after American President Donald Trump suggested that a US government agency had spent money trying to influence Indian elections.\n\nThe Indian foreign ministry comment comes two days after Trump cited information released by DOGE, the department led by Elon Musk, showing that the United States Agency for International Development (USAID) had spent $21 million on “voter turnout” in India.\n\n“We have seen information put out by the US administration regarding certain USAID activities and funding. These are obviously very deeply troubling. This has led to concerns about foreign interference in India’s internal affairs,” foreign ministry spokesperson Randhir Jaiswal told a weekly news briefing when asked about USAID’s activities in India.\n\nJaiswal said the “relevant department and agencies” were looking into the matter.\n\nUSAID did not immediately respond to an emailed request for comment.\n\nOn February 16, DOGE published on X a list of funds that USAID, which Trump has put a freeze on, had disbursed, including $21 million for voter turnout in India.\n\n“What do we need to spend $21 million for voter turnout in India for? Wow, $21 million. I guess they were trying to get somebody else elected,” Trump said at an event in Miami.\n\nHis comment and DOGE’s disclosures have caused a political storm in India, with Prime Minister Narendra Modi’s Bharatiya Janata Party and the opposition Congress accusing each other of benefiting from foreign funds.\n\nOn Friday, The Indian Express newspaper reported, citing documents it had accessed, that the $21 million Trump referred to was disbursed to neighbouring Bangladesh, not India.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/21181442529d75e.jpg",
  "retrievedAt": "2025-08-25T19:54:42.459Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893409/new-delhi-says-it-is-looking-into-deeply-troubling-information-about-usaid-activities-in-india",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T13:19:17.000Z"
}
