{
  "title": "Pakistan face India in Champions Trophy clash with no room for error - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan face arch-rivals India in a Champions Trophy blockbuster on Sunday in front of a sell-out Dubai crowd knowing that another defeat will virtually end their title defence.\n\nThe neighbours only meet in multi-nation events because of political tensions and the match is taking place in Dubai after India refused to travel to tournament hosts Pakistan.\n\nIn front of what is expected to be a full house at the 25,000-capacity Dubai International Stadium, and with hundreds of millions more watching glued to their televisions, Pakistan are under pressure.\n\nMohammad Rizwan’s side were well beaten by New Zealand by 60 runs in the opening game of the ODI competition in Karachi and realistically need to beat favourites India to stay in the hunt for a semi-final spot in the eight-nation tournament.\n\nNew Zealand top Group A ahead of India — who beat Bangladesh on Thursday by six wickets — on a better run-rate. Pakistan are fourth and bottom of the group.\n\nThe top two teams from each of the two groups make the semi-finals.\n\n“If we want to win against the great teams of the world and be one of the great teams of the world we will have to bring consistency,” Pakistan batsman Salman Ali Agha said.\n\n“We can’t play well in one game and bad in another.”\n\nPakistan chased down a record 353 against South Africa last week in a tri-nation tournament at home but in the final crashed to 242 all out in a defeat to New Zealand.\n\nThey suffered a big blow in the loss on Wednesday when their premier batsman Fakhar Zaman suffered a muscle injury. He has been ruled out of the tournament.\n\nImam-ul-Haq came in as a replacement for a team that hammered India in the final of the previous Champions Trophy, in 2017.\n\nThat was India’s last defeat to Pakistan in an ODI match and Rohit Sharma’s men have since won five of the last six games against their greatest rivals, with one rained off.\n\nThey last met in a one-day game at the 2023 World Cup in Ahmedabad, with hosts India winning by seven wickets.\n\nAnother loss and an early exit for the hosts would take the gloss off the tournament, Pakistan’s first ICC event since co-hosting the 1996 World Cup with India and Sri Lanka.\n\nIn contrast, India lived up to their favourites tag against Bangladesh, chasing down a tricky 229 with 21 balls to spare in Dubai.\n\nIn-form Shubman Gill hit an unbeaten 101 for his second successive ODI century after pace spearhead Mohammed Shami returned bowling figures of 5-53.\n\nVictory for India would put them on the cusp of the last four.\n\n“After winning there is no point in having a mindset,” a confident-looking Shami said in response to a question on facing Pakistan next.\n\n“You should stay in the same frame (habit) when you win a match and when you perform well. I don’t think you need to think too much about the ICC tournament or any international match.”\n\nFellow pace bowler Harshit Rana claimed three wickets in his team’s win and exuded the same confidence.\n\n“It’s great to perform ahead of the Pakistan match and hopefully I can take this momentum forward,” said Rana. “But the Pakistan match is just another game for us.”\n\nDeteriorating political ties have meant the bitter rivals have not played a bilateral cricket series for over a decade.\n\nIndia last visited Pakistan in 2008, for the Asia Cup.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/211307293d9d10b.png",
  "retrievedAt": "2025-08-25T19:54:43.604Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893381/pakistan-face-india-in-champions-trophy-clash-with-no-room-for-error",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T08:08:14.000Z"
}
