{
  "title": "Two cops martyred in Quetta attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Two police personnel were martyred and four armed attackers were killed in a heavy gun battle during an attack on a police post in the Shaban area of Quetta late on Thursday night.\n\nAccording to officials, a group of armed men launched an assault on a joint post of police and forest guards in Shaban, located about 20km northeast of Quetta. The police and forest guards immediately retaliated, leading to an intense exchange of fire.\n\nThe gunfight resulted in the martyrdom of two policemen and injuries to two others, including a police constable and a forest guard. “Our two personnel were martyred,” a senior police officer told Dawn, adding that Counter Terrorism Department (CTD) personnel and Frontier Corps (FC) troops reached the site and launched a counter-attack against the assailants.\n\n“In the counter-attack by CTD, four armed attackers were killed,” DIG Quetta Atizaz Goraya said, adding that four bodies were recovered from the area. He noted that the operation against the attackers continued late into the night. The martyred policemen were identified as Shamsul Islam and Muhammad Ramzan.\n\nMeanwhile, a powerful explosion occurred on Qambrani Road in Sikanderabad, on the outskirts of Quetta, late on Thursday night.\n\n“A man was reportedly carrying a bomb to plant it at an undisclosed location, but it exploded prematurely, killing him on the spot,” a senior police officer told Dawn.\n\nThe body of the suspect was shifted to the Civil Hospital and further investigation is underway.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:55:17.534Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893257/two-cops-martyred-in-quetta-attack",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:48:08.000Z"
}
