{
  "title": "Enforcement of strict traffic laws sought in Khi to control mishaps involving heavy vehicles - Pakistan - DAWN.COM",
  "author": null,
  "content": "• City Council members call for implementation of ban on daytime movement of dumper trucks\n• In first 40 days of this year, over 100 people have died in road tragedies, meeting told\n• Council approves committee to plan action against encroachments in the city\n\nKARACHI: In a rare show of unity up to the hilt, the Karachi Metropolitan Corporation’s City Council on Thursday expressed grave concern over the heavy vehicles-related road tragedies and prolonged frequent traffic jams across the city and called upon the city administration and traffic police to ensure strict implementation of traffic regulations and the notified timings for dumper trucks’ operation.\n\nMembers from both sides of the aisle in an otherwise calm and thoughtful house strongly condemned the alarming increase in the accidents involving heavy vehicles, saying that dumper drivers were fearlessly and shamelessly violating their operational hours from 10pm to 6am.\n\nAmong the 15 resolutions approved by the house, two highlighted concerns over such traffic accidents. They were tabled by Pakistan Peoples Party’s Karamullah Waqasi and Jamaat-i-Islami’s Hafiz Mubashir-ul-Haq and Junaid Makati.\n\nThrough the resolutions, the City Council demanded strict legal action against drivers involved in such accidents, a complete ban on heavy traffic movement during daytime, and strict enforcement of traffic laws.\n\nThe resolution tabled by the JI members also called for proper implementation of the regulation of heavy traffic’s movement and designated stops for public transport, including rickshaws.\n\nIt also demanded the preparation of management plan in areas with the coordination of the UC chairman concerned.\n\nThe meeting was informed that in the past year, nearly 8,000 citizens were injured and 773 people lost their lives in traffic accidents while in the first 40 days of this year, more than 100 deaths have already occurred.\n\nDuring the discussion, Parliamentary Leader of the Pakistan Muslim League-N Feroze Khan also demanded immediate release of the Mohajir Qaumi Movement Chairman Afaq Ahmed.\n\nThe general meeting of the KMC Council was held in the Council Hall of KMC headquarters, under the chairmanship of Mayor Barrister Murtaza Wahab. Deputy Mayor Salman Abdullah Murad and Municipal Commissioner Afzal Zaidi, were also present alongside the mayor.\n\nAnti-encroachment operation\n\nThe City Council also unanimo­usly expressed grave concern over the mushroom growth of soft and permanent encroachments acr­oss the city and approved the constitution of a committee for del­i­beration on the course of act­ion against encroachments, especially on streets and footpaths.\n\nAddressing the City Council, Opposition Leader Advocate Saifuddin also urged the members of the both sides to keep the house atmosphere congenial.\n\nHe said that opposition never wanted to create a ruckus in the house. “But when our demands are not accepted and our point of view is not heard, then all this happens,” he added.\n\nThe mayor responded in a reciprocal manner, telling the opposition leader that all issues should be resolved jointly, but added that one hand alone did not make the clap.\n\nThe opposition leader said that all 246 UC chairmen should be given both powers and funds.\n\nHe also criticised the federal government to give uplift funds to the MNAs from Karachi and said it was open interference in the local government system. “All the funds being given to MNAs from the federal government should be transferred down to the UC and town levels,” he demanded.\n\nHe also advised the mayor to run the house the way former Mayor Naimatullah Khan had done.\n\nOther resolutions\n\nA resolution proposed that KMC-managed slaughterhouses be renovated and operated under a public-private partnership (PPP) model. This resolution was sent to the committee for further review.\n\nOne resolution suggested that parks be managed under a rental-based PPP model to improve maintenance and facilities. This resolution was also sent to the committee for further review.\n\nAnother resolution called for extending zoo, Safari Park, and stall contracts from one year to at least five years. This was referred to the committee, with a directive to submit a report within 30 days.\n\nA separate resolution, proposing an increase in various veterinary services contracts, was also tabled and approved.\n\nThe merger of KMC’s accommodation department with the property department was also suggested in the resolution.\n\nA resolution by PPP’s Mirza Maqbool Ahmed and Dil Muhammad congratulated PPP Chairman Bilawal Bhutto Zardari, Chief Minister Murad Ali Shah, and Mayor Karachi Murtaza Wahab on the completion of Bhutto Highway Phase 1.\n\nCondolence resolutions\n\nJaman Darwan, Mumtaz Ahmad Tanoli, and Munir Khattak passed resolutions mourning the passing of former federal minister and PPP CEC member Yousuf Talpur.\n\nAnother resolution expressed sorrow over the death of renowned poet, writer, and intellectual Dr Zulfiqar Siyal.\n\nGulfam Ahmed Hashmi and Tahir Pervez presented a resolution mourning the death of UC-5 Orangi Town chairman Malik Muhammad Akhtar’s mother.\n\nMore than 27 members from the two sides of the aisle participated in the discussion in the first meeting of the City Council in the current year.\n\nLater, the meeting was adjourned to a date later to be announced by the KMC.\n\nPublished in Dawn, February 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b7cd8bbabbc.gif",
  "retrievedAt": "2025-10-12T01:33:49.352Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893239/enforcement-of-strict-traffic-laws-sought-in-khi-to-control-mishaps-involving-heavy-vehicles",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T01:49:15.000Z"
}
