{
  "title": "Federal judge blocks Trump asylum ban at Mexico border - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A federal judge has blocked US President Donald Trump’s asylum ban at the Mexico border, saying that he exceeded his authority when he issued a proclamation dec­laring illegal immigration an emergency and setting aside existing legal processes.\n\nUS District Judge Randolph Moss said in a 128-page opinion that Trump’s Jan 20 proclamation blocking all migrants “engaged in the invasion across the southern border” from claiming asylum or other humanitarian protections went beyond his executive power.\n\nThe American Civil Liberties Union brought the challenge to Trump’s asylum ban in February on behalf of three advocacy groups and migrants denied access to asylum, arguing the broad ban violated US laws and international treaties. Moss said he would stay the effective date of a related order for 14 days to allow the Trump administration to appeal.\n\nThe decision applies to migrants who were subject to Trump’s ban or could be in the future, part of a certified class in the litigation. Such class certifications remain unaffected by last week’s Supreme Court decision reining in nationwide injunctions.\n\nMoss ruled that neither federal immigration law nor the US Constitution gave Trump the authority to disregard existing laws and regulations governing the asylum process even if stopping illegal immigration presented “enormous challenges.”\n\n“Nothing in the [Immig­ration and Nationality Act] or the Constitution grants the President or his delegees the sweeping authority asserted in the Proclamation and implementing guidance,” wrote Moss, an appointee of former President Barack Obama. “An appeal to necessity cannot fill that void.”\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/67940a71bdfde.jpg",
  "retrievedAt": "2025-08-17T19:38:41.977Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921736/federal-judge-blocks-trump-asylum-ban-at-mexico-border",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:05.000Z"
}
