{
  "title": "Peshawar police on high alert ahead of Ashura - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: As Ashura is just around the corner, the police have been put on high alert in Peshawar, with vehicles being strictly checked at the city’s all entry and exit points.\n\nCapital City Police Officer Qasim Ali Khan examined security armaments for Muharram processions during a visit to the command and control centre here on Wednesday, according to a statement from the city police.\n\nOfficials informed him that all routes for Muharram processions in the capital city were being strictly monitored.\n\nThey said that there was a high alert across the entire district for the month of Muharram, with strict monitoring of all entry and exit routes being carried out and special security checkpoints established.\n\n“Not only are all procession routes and places of worship being monitored through CCTV cameras but drone cameras are also used for the purpose,” the statement read.\n\nAlso, the police carried out a flag march in the city.\n\nLed by SSP (operations) Masood Ahmad, the exercise was carried out from the Malik Saad Shaheed Flyover to the police headquarters through Khyber Road, cantonment area, Aman Chowk, Saddar Road, Stadium Road, Press Club Road and Haji Camp Road.\n\nArmoured personnel carriers, police patrolling forces, traffic police, bomb disposal unit, Special Combat Unit and ladies police were also part of the flag march.\n\nMeanwhile, Chief Traffic Officer Haroon Rasheed visited procession routes and the command and control centre and reviewed arrangements made by the traffic police for smooth flow of traffic during Muharram.\n\nSeparately, representatives of different religious groups, including non-Muslims, on Wednesday announced to collectively work for maintenance of durable peace and strengthening interfaith harmony in the provincial metropolis.\n\nAddressing a joint news conference at the Peshawar Press Club, religious representatives, led by Qari Ruhullah Mandi, chairman Pakistan Council of World Religions-Faith Friends, through a resolution promised to speed up work for interfaith harmony.\n\nProminent among other speakers included Bishop Humphrey Sarfraz Peter, Hafiz Abdul Ghafoor, Allah Fakhrul Hassan Kararvi, Haroon Sarbdial, Akhunzada Muzaffar Ali, Maqsood Ahmad Salfi, Mufti Atteequllah, Syed Jamaat Ali Shah and others.\n\nThey emphasised the importance of maintaining peace and harmony during the holy month, calling it a national, religious, and moral duty.\n\nThe speakers stressed the need for maintaining peace and harmony during the month, and appealed to the people to promote mutual tolerance and brotherhood.\n\nThey emphasised the importance of responsible behaviour on social media, avoiding content that may hurt the sentiments of other sects or communities.\n\nThey also appealed to the media to promote peace, tolerance, and harmony, and to avoid sensationalism or provocative reporting.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/26210324c7aa40d.jpg?r=210358",
  "retrievedAt": "2025-08-17T19:36:47.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921693/peshawar-police-on-high-alert-ahead-of-ashura",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:48.000Z"
}
