{
  "title": "India heightens security as Hindu pilgrimage begins near Pahalgam - World - DAWN.COM",
  "author": null,
  "content": "Hindus began a vast month-long pilgrimage in India-occupied Kashmir (IoK) on Thursday, with many of the faithful starting from near the site where a deadly April attack triggered conflict with Pakistan.\n\nLast year, half a million devotees took part in the Amarnath pilgrimage to a sacred ice pillar located in a cave in the forested Himalayan hills above the town of Pahalgam.\n\nIndia has ramped up security for the event, deploying 45,000 troops with high-tech surveillance tools overseeing the gruelling trek to reach the high-altitude cave, dedicated to the Hindu deity of destruction Shiva.\n\n“We have multi-layered and in-depth security arrangements so that we can make the pilgrimage safe and smooth for the devotees,” said VK Birdi, police chief for the Muslim-majority territory.\n\nPahalgam is the site where gunmen on April 22 killed 26 mostly Hindu tourists. New Delhi blamed the attack on Pakistan, which strongly denied the allegations while calling for a neutral investigation, triggering a series of tit-for-tat diplomatic measures that escalated into a four-day conflict.\n\nOn May 7, Pakistan shot down six Indian jets after they bombed sites across the border, setting off an exchange of attacks between the two countries by fighter jets, missiles, drones and artillery that killed dozens until a ceasefire on May 10.\n\nIt was the worst standoff by the nuclear-armed nations since 1999, with more than 70 people killed in missile, drone and artillery fire on both sides.\n\nBut pilgrim Muneshwar Das Shashtri, who travelled from Uttar Pradesh state, told AFP that “there is no fear of any kind”.\n\n“Our army is standing guard everywhere. No one can raise a finger towards us,” he said.\n\nAt Pahalgam, soldiers have turned a tented base camp into a fortress encircled by razor wire.\n\nTroops in newly deployed armoured cars, or from gun positions behind sandbags, keep a close watch — efforts boosted by facial recognition cameras.\n\n“High-quality surveillance cameras have been installed at all major points along the route,” said Manoj Sinha, the Indian-appointed top administrator for occupied Jammu and Kashmir.\n\nAll pilgrims must be registered and travel in guarded vehicle convoys, until they start out to walk.\n\nCamouflaged bunkers have been erected in the forests along the route, where dozens of makeshift kitchens provide free food.\n\nElectronic radio cards pinpoint their location.\n\nPilgrims can take several days to reach the cave, perched at 3,900 metres high, around 30 kilometres uphill from the last easily motorable track.\n\n“Whatever the attack that was carried out here, I am not afraid. I have come to get a glimpse of baba (the ice formation)” said Ujwal Yadav, aged 29, from India’s Uttar Pradesh state, undertaking his first pilgrimage to the shrine.\n\n“Such are the security arrangements here that no one can be hurt.”\n\nSinha has said that “public confidence is returning”, but admits that pilgrim registration had dipped by 10 per cent this year.\n\nOnce a modest, little-known ritual, attended by only a few thousand mainly local devotees, the pilgrimage has grown since the Kashmiris’ uprising erupted in 1989.\n\nIndia’s government has since heavily promoted the annual event, which runs until August 9.\n\nThose fighting against India’s occupation of Kashmir have said the pilgrimage is not a target, but have warned they would act if it was used to assert Hindu dominance.\n\nIn 2017, suspected militants attacked a pilgrim bus, killing 11 people.\n\nThe gunmen who carried out the April 22 killings remain at large, despite the manhunt by security forces in IoK, where India has half a million soldiers permanently deployed.\n\nOn June 22, India’s National Investigation Agency claimed two men had been arrested from the Pahalgam area, who they said had allegedly “provided food, shelter and logistical support” to the gunmen.\n\nIndian police have issued wanted notices for three of the gunmen, two of whom they claimed were Pakistani citizens.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/031218094170193.jpg",
  "retrievedAt": "2025-08-17T19:34:38.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921830/india-heightens-security-as-hindu-pilgrimage-begins-near-pahalgam",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T07:19:33.000Z"
}
