{
  "title": "Capital police increase vigilance, intelligence-based operations under Muharram security plan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The capital police have heightened vigilance and intelligence operations in and around Islamabad to closely monitor the activities of militant sectarian organisations, Dawn has learnt from police sources.\n\nSeveral instructions have been issued to relevant police units under the Muharram security plan, including the directive that “activities of militant sectarian organisations should be kept under close watch.”\n\nAdditionally, the units have been instructed to take “action against harbourers of sectarian proclaimed offenders,” and to specifically monitor individuals with any connection to banned organisations or those listed in the 4th Schedule.\n\nIt was further directed that no one, regardless of their status within a sect, shall be allowed to spread hate speech, sources said.\n\nAll religious sermons must be recorded verbatim for immediate communication and scrutiny. Officials have been instructed that cases should be registered under relevant laws against those involved, and arrests must be made for further legal action.\n\nArrangements must be made to record video footage of major processions, they were told.\n\nMoreover, it has been ordered that miscreants should be isolated and appropriate legal action taken immediately.\n\n“If trouble breaks out at any point along the procession route or elsewhere, it will be the responsibility of the senior-most police officer present to ensure that the situation is immediately brought under control. Every officer in charge of a procession must handle the situation with the police force available to him,” officials were told.\n\nIf the officer finds that additional force is needed, he or she must immediately contact the SDPO to requisition further personnel and equipment.\n\n“Tear gas should only be used under extreme circumstances to disperse an unlawful assembly. Use of force must be avoided to the maximum extent possible.”\n\nOfficials have been further told that during any law and order situation, action must be taken in accordance with Section 3 of the Protection of Pakistan Act, 2014.\n\n“No police officer should, under any circumstances, express views or make remarks on religious matters that could hurt the sentiments of any sect. Every police officer must remain composed and exhibit discipline and courtesy when dealing with the public.”\n\nPolice officials in plain clothes will be deployed by supervising officers to stay alert to the situation. Policemen on duty must carry and display their service cards.\n\nWith the assistance of the CDA, trees and bushes should be trimmed, and overhanging wires along procession routes must be removed.\n\nMeetings must be held with procession and Majalis organisers to ensure the installation of walkthrough gates, to be hired through private security companies.\n\nOrganisers will also be responsible for arranging rented metal detectors for security purposes.\n\nWith the assistance of the traffic police, vehicles will not be allowed inside or near the procession areas. In coordination with the Water and Power Development Authority, alternate arrangements must be made for electric supply and lighting.\n\n“CCTV systems with monitoring capabilities must be installed at venues and along routes by the procession/Majalis organisers. These areas must be searched by the organisers under the supervision of police and magistrates.”\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/01105036711b93f.jpg?r=105109",
  "retrievedAt": "2025-08-17T19:37:00.458Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921705/capital-police-increase-vigilance-intelligence-based-operations-under-muharram-security-plan",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:40.000Z"
}
