{
  "title": "PDMA warns of flash floods across KP as more rains expected - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa Provincial Disaster Management Authority (PDMA) on Wednesday warned district administrations across the province about the possibility of flash floods, urban flooding and landslides due to a new spell of monsoon rains from July 5 to 11.\n\nIn an advisory issued to the deputy commissioners across the province, the PDMA quoted the Pakistan Meteorological Department as revealing that moist currents are penetrating into most parts of the region and likely to intensify in the next couple of days.\n\n“A westerly wave is also expected to approach on July 5 evening and night. Under the influence of the new weather system, showers along with thunderstorm, lightning and gusty winds, with isolated and scattered heavy rainfalls, are expected in Haripur, Abbottabad, Mansehra, Chitral, Dir, Swat, Buner, Malakand, Battagram, Shangla, Kohistan, Kolai-Pallas, Torghar, Peshawar, Mardan, Swabi, Nowshera, Charsadda, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Kohat, Hangu, Bannu, Karak, Lakki Marwat, Dera Ismail Khan, Tank and North and South Waziristan from July 5 to 11 with occasional gaps,” it said.\n\nThe PDMA warned that heavy to very heavy rains could generate flash floods in nullahs and streams of Galiyat, Mansehra, Kohistan, Kolai-Palas, Abbottabad, Buner, Bajaur, Battagram, Buner, Hangu, Torghar, Haripur, Karak, Chitral, Dir, Swat, Shangla, Khyber, Kohat, Nowshera, Swabi, Mardan, Peshawar, Shangla, Kurram, Lakki Marwat, Malakand, Mansehra, Mohmand, Orakzai, Dera Ismail Khan, Bannu and Tank during the forecast period.\n\nUrges authorities to take measures to minimise damage\n\nIt also said that urban flooding was very likely to happen in low-lying areas of Mardan, Nowshera, Peshawar, Kohat and Dera Ismail Khan, while there’s a likelihood of riverine flooding in Chitral, Swat, Panjkora and Kabul rivers.\n\nAccording to the PDMA, landslides may cause roads closure in the vulnerable hilly areas of Abbottabad, Battagram, Buner, Chitral, Dir, Khyber, Kohistan, Kolai-Pallas Kohistan, Kurram, Malakand, Mansehra, Mohmand, Orakzai, Shangla, Swat, Torghar and North Waziristan districts.\n\nAlso, heavy rainfall and windstorms and lightning could damage weak structures like mud houses, electric poles, billboards, vehicles and solar panels during the period.\n\nThe PDMA urged deputy commissioners of all districts to take all precautionary measures against downpours and floods to minimise damage to public life and property and livestock.\n\nIt also asked authorities to assess and plan deployment of additional resources and exercise control over traffic leading to and in the vicinity of vulnerable and tourist areas and securing by physical means and keeping people away from loose structures such as buildings under construction, advertisement hoardings, electric poles and solar panels to prevent damages and save lives.\n\nIn the advisory, the PDMA said authorities should keep monitoring rivers, streams, local and rainfed nullahs, ensure drainage systems are clear from obstacles to facilitate the efficient flow of water and minimise the risk of urban flooding, coordinate with relevant municipal administrations to ensure mitigation and preparedness measures for landslides and urban flooding, and secure or remove billboards and hoardings in view of wind, dust, thunder and hailstorms.\n\nIt urged farmers to take all necessary measures to prevent damage to their crops.\n\nThe PDMA said cattle and sheep herders should undertake necessary mitigating and precautionary measures to protect their livestock from wind, dust, thunder and hailstorms.\n\nIt said that people travelling on provincial and national highways in at-risk and affected areas should be forewarned of adverse conditions and detoured to safe waiting areas under guidance of authorities, national highway and motorway police, law-enforcement agencies.\n\nThe PDMA asked people to seek shelter in safe areas such as sturdy buildings or underground structures during wind, dust, thunder and hailstorms and avoid objects that posed a risk of failing or being struck by lightning.\n\nIt stressed the need for the availability of emergency services personnel and equipment in areas at high risk of urban and flash flooding and landslides, immediate stocking of basic commodities like medicines in regions that are likely to be cut off from other regions during landslides.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/301442197e000c4.jpg?r=144305",
  "retrievedAt": "2025-08-17T19:36:45.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921697/pdma-warns-of-flash-floods-across-kp-as-more-rains-expected",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:48.000Z"
}
