{
  "title": "Shrinking space for advocacy irks HRCP - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Claims its members face arbitrary harassment, intimidation and obstruction of its work\n• Minister says govt committed to protecting human rights; insists commission must follow SOPs\n\nLAHORE: The Human Rights Commission of Pakistan (HRCP), the country’s leading human rights watchdog, has expressed deep concern over the steadily shrinking space for human rights advocacy in the country.\n\nIn a statement issued on Wednesday, the HRCP said it had faced a series of arbitrary, illegal, and unjustified actions over the past few months, which have impeded the organisation’s ability to carry out its mandate.\n\nIt added that HRCP’s work is based on the rights of all citizens and persons, as enshrined in the Constitution and Pakistan’s international commitments and obligations.\n\n“We note with disappointment that persons claiming to represent the security apparatus have obstructed the organisation of HRCP events by informing either the venue or our staff that a no-objection certificate (NOC) was required for indoor meetings, although this is not a legal requirement.\n\n“Two recent examples include a high-level consultation in Islamabad on regions facing militancy and terrorism and their impact on human rights, and a roundtable in Gilgit on local communities’ right to natural resources. Ironically, both the relevant legislators and officials from government departments had confirmed their participation on both occasions,” it added.\n\nThe statement said: “There have also been incidents across the country where our members and staff faced harassment and intimidation. For the first time in HRCP’s decades-long history, its chairperson was taken in for questioning by the police in Karachi. We have reason to believe that other actions are not merely coincidental.\n\n“These include an attempt to seal our office premises in Lahore in 2024, the removal of the office’s electricity meter, and a bank’s refusal to release our funds, citing a State Bank of Pakistan directive — the existence of which was categorically denied by the latter in writing when asked by a court.”\n\nThe HRCP urged the authorities to respect the fundamental freedoms of association, assembly, and expression, and to ensure that human rights defenders can operate without fear of reprisal or undue interference.\n\n“Civil society organisations such as HRCP are essential if Pakistan wishes to develop into a state that upholds the rights of all its citizens and remains responsible for their well-being. More broadly, human rights work helps create a more tolerant and inclusive society — something that Pakistan is in dire need of at present,” the statement concluded.\n\nHRCP Chairperson Asad Iqbal Butt told Dawn that some months ago, a police contingent, including lady police officers, arrived at his residence and took him to the local police station. He said he was threatened and asked irrelevant questions about his family. A large number of lawyers and journalists gathered outside the police station, and he was released after being held for a few hours.\n\nHRCP Secretary General Harris Khalique said the organisation’s credibility comes from its independence, responsible behaviour, courage, and impartiality. “Muzzling our voice will be as big a loss for the country as ours,” he added.\n\nFounding member Hina Jillani told Dawn that the state’s actions against the commission were short-sighted and could not silence the voice of civil society. “We constructively gave recommendations to the state about rule of law, democracy, and the situation of human rights in the country, and it was their right to do so.”\n\nShe said the state had made some matters sensitive on its own due to its short-sightedness and urged the authorities to widen their perspective and listen attentively to the voices raised in HRCP’s consultative meetings.\n\nFormer chairperson and current council member Zohra Yusuf pointed to the broader issue of democratic backsliding in the country and the disregard for the rule of law by the very institutions meant to uphold it. She expressed dismay over the lodging of various FIRs as well as threats and intimidation faced by HRCP members and office bearers.\n\nSOPs for holding events\n\nMeanwhile, Minister of State for Interior Talal Chaudhry told Dawn that the government is pursuing legislation in support of human rights and would ensure the rights of all citizens.\n\nHe said that HRCP must also adhere to standard operating procedures (SOPs) set for holding any event. “Everyone has to intimate the administration and seek an NOC for holding any religious event, human rights consultation, or any other gathering to ensure security,” he said.\n\nMr Chaudhry maintained that obtaining an NOC from the administration is a legal requirement for holding events and HRCP should comply with it. “National and foreign delegates were invited to HRCP events, and the state needs to be informed to provide better security,” he added.\n\nHe further stated that the government is committed to upholding the human rights of all citizens and, if other departments are approaching the HRCP, the organisation must fulfil all legal requirements.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:38:17.020Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921746/shrinking-space-for-advocacy-irks-hrcp",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:11.000Z"
}
