{
  "title": "Assistant commissioner among five martyred in Bajaur blast - Pakistan - DAWN.COM",
  "author": null,
  "content": "• 17 others, including police personnel, injured in IED explosion\n• Officials targeted en route from Nawagai to Khar after conducting anti-encroachment drive\n\nBAJAUR: An assistant commissioner and a tehsildar were among five people martyred, while 17 others, including several police personnel, sustained injuries when a roadside bomb explosion struck an official vehicle in Bajaur’s Sadiqabad area on Wednesday afternoon.\n\nDistrict Police Officer Waqas Rafique said it was an Improvised Explosive Device (IED) explosion and said the bomb was planted on a motorcycle parked alongside the road.\n\nFour people, including Nawagi subdivision assistant commissioner (AC) Faisal Ismail, Nawagi tehsildar Abdul Wakeel Khan, policeman Zahid Khan and a passerby, Fazal Manan, died at the scene, while 18 others were injured when the IED went off, District Police PRO Israr Khan told Dawn.\n\nOne of the wounded policemen, identified as ASI Noor Hake­em, passed away while being shifted to hospital in Peshawar.\n\nSources told Dawn that AC Ismail and his team were returning to the Civil Colony Khar after conducting an anti-encroachment drive in Nawagai bazaar, when their official vehicle was targeted.\n\nResidents, police and rescue officials told Dawn that the incident occurred on the Bajaur-Pesh­awar highway in Sadiqabad market, about 5km from district headquarters Khar, around 1:45pm.\n\nRescue 1122 workers alongside locals from nearby areas rushed to the scene and began efforts to transport the injured to the District Headquarters Hospital in Khar where emergency was already declared.\n\nThe DPO along with a team of senior police officials visited the spot and collected evidence to be used for investigation.\n\nNews of the blast spread quickly across the district, especially in Khar tehsil, prompting scores of people from all walks of life to rush to the Khar DHQ Hospital to donate blood for the injured.\n\nAccording to the updated data shared by Rescue 1122 and the medical superintendent of the Khar DHQ hospital, four policemen identified as constable Ayaz Khan, constable Muhammad Zameen, constable Saidur Rehman and Fazal Haq were among 17 people wounded in the blast.\n\nThe reports stated that five injured individuals, including three policemen, were referred to various hospitals in Peshawar due to their critical condition, while the others remained under treatment at the DHQ hospital.\n\nThe bodies of all five victims were dispatched to their native areas after their combined official funeral prayers held at the police line late on Wednesday evening.\n\nThe body of assistant commissioner Faisal Ismail was sent to his native Wadigram area of Swat district.\n\nBoth the outlawed TTP and the IS-Khorasan militant group claimed responsibility for the attack on social media.\n\nThe incident also drew condemnation from President Asif Ali Zardari, PM Shehbaz Sharif, NA Speaker Ayaz Sadiq, PPP chairman Bilawal Bhutto-Zardari, KP CM Ali Amin Gandapur, and Barrister Mohammad Ali Saif, among several others.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/03185526b4332f9.jpg",
  "retrievedAt": "2025-08-17T19:38:49.567Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921762/assistant-commissioner-among-five-martyred-in-bajaur-blast",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:46:58.000Z"
}
