{
  "title": "Industry protests furnace oil tax hike - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A day after the Finance Act 2025-26 came into effect, the oil industry has urged the government to withdraw the petroleum levy (PL) and climate support levy (CSL) totalling Rs84,742 per tonne on furnace oil (FO), warning that the move threatens industrial activity and economic stability.\n\nIn a letter to the Special Investment Facilitation Council (SIFC), the Oil Companies Advisory Council (OCAC) — representing over three dozen oil marketing firms and refineries — protested the imposition of a PL of Rs82,077 and a CSL of Rs2,665 per tonne, introduced to secure a $1.3bn resilience support facility from the International Monetary Fund.\n\nThe OCAC said the levies, implemented without prior consultation, pose a serious threat to the business environment and contradict the government’s stated commitment to supporting domestic manufacturing.\n\nIt warned that the new charges would increase FO prices by nearly 80pc, rendering the fuel unaffordable for key industries such as cement, textiles, glass, shipping, tyres, foundries, and general trade.\n\nOCAC warns Rs84,742 per tonne carbon and climate levies will trigger industrial shutdowns, refinery losses\n\n“FO is a deregulated product governed by market forces,” the OCAC stated, adding that the heavy taxation would lead to a collapse in domestic demand and force industrial units to partially or completely shut down, particularly in sectors without viable fuel alternatives.\n\nThe council also cautioned that the measure could reduce overall sales tax revenues rather than boost government income, as expected. Additionally, local refineries would be forced to export FO at financial losses, further weakening the sector’s already fragile position.\n\nThe OCAC said the levies would undermine recent agreements with independent power producers (IPPs) by raising fuel costs and pushing these plants down the merit order. This, it argued, would render them inactive and increase capacity payments — ultimately burdening public finances without any offsetting benefits.\n\nWhile acknowledging SIFC’s earlier support in securing interim relief via recovery of inadmissible general sales tax (GST) through the Inland Freight Equalisation Margin (IFEM), the OCAC said that arrangement was a temporary fix. It called for a sustainable solution, including restoring the taxable status of currently exempt petroleum products — namely motor spirit (MS), high-speed diesel (HSD), kerosene, and light diesel oil (LDO).\n\nThe council requested the SIFC’s continued intervention to reverse the levies on furnace oil, ensure policy consistency, and protect the viability of critical industrial sectors.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:36:05.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921786/industry-protests-furnace-oil-tax-hike",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T04:01:39.000Z"
}
