{
  "title": "Aurangzeb flags low SME financing - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Finance Minister Muhammad Aurangzeb has underscored the importance of small and medium enterprises (SMEs) to Pakistan’s economy — contributing around 40 per cent to GDP, 25pc to exports and nearly 78pc of non-agricultural employment — while noting that their access to formal finance remains disproportionately low, with only a small share of private-sector lending directed towards them.\n\nThe minister stated this while participating in a high-level panel discussion titled ‘Scaling up SME Finance’ hosted at the International Business Forum, held on the sidelines of the Fourth International Conference on Financing for Development (FfD4) in Seville, Spain.\n\nMr Aurangzeb highlighted that Pakistan has adopted a whole-of-government approach to address these challenges and unlock the full potential of the SME sector.\n\n“As part of its strategic vision, the government aims to raise SME financing to 17 per cent of total private-sector credit by 2028. This target is designed to bring Pakistan more in line with comparable South Asian economies such as Bangladesh and India, and with global emerging market benchmarks,” he said.\n\nHe noted that the government is actively working through the central bank to encourage commercial banks to expand their SME lending portfolios.\n\nThis expansion is expected to enhance the contribution of SMEs to GDP, exports, employment, youth and women’s digital empowerment, and overall financial inclusion—laying the foundation for sustained and inclusive economic growth.\n\nClimate financing\n\nMeanwhile, addressing a high-level roundtable on ‘Swapping out Debt for Development’, Mr Aurangzeb emphasised that Pakistan’s finance and climate change ministries are working closely to align their decisions for the best possible outcomes for the population, which is increasingly burdened by economic and climate-related pressures.\n\nThe roundtable, organised by advisory firm Tabadlab, saw discussion on how debt-for-climate swaps can help countries like Pakistan tackle the twin challenges of debt and climate vulnerability, while aligning with Sustainable Development Goals and the Paris Agreement. Such mechanisms may offer critical pathways for creating fiscal space while advancing environmental objectives, a statement issued after the event said.\n\nWith input from APP\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6866002831f49.jpg",
  "retrievedAt": "2025-08-17T19:36:04.107Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921785/aurangzeb-flags-low-sme-financing",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T03:59:54.000Z"
}
