{
  "title": "Govt slammed for loadshedding, rising consumer burden - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Standing Committee on Power expressed serious concern on Wednesday over persistent load-shedding despite a surplus of electricity, rising circular debt, and its continued financial burden on consumers.\n\nPresiding over the meeting, Senator Mohsin Aziz criticised the absence of Power Minister Sardar Awais Leghari, who was expected to respond to queries, particularly regarding independent power producers (IPPs) and their controversial contracts, which he described as unjust to the public.\n\nSenator Shibli Faraz accused the Power Division of failing to address the ballooning circular debt and shifting the cost of inefficiency onto consumers. He said project costs were often inflated to benefit IPPs and lamented the lack of transparency. “The Power Division consistently avoids disclosing facts,” he said, as quoted in a statement from the Senate Secretariat.\n\nSenator Aziz said the division’s continued deflection of responsibility to a Task Force was unacceptable, especially since the Task Force itself operates under the Power Division and remains answerable to it.\n\nSenate panel demands accountability over circular debt and inflated IPP returns\n\nSecretary Power Division Dr Fakhr-e-Alam Irfan informed the committee that repayment of circular debt had been linked to the debt servicing surcharge and assured that no additional burden would be passed on to consumers. He added that subsidies were being curtailed to help control debt accumulation.\n\nSenator Aziz questioned why IPPs were granted excessively high returns and why no effort had been made to recover excess payments. He also demanded an explanation for the continued load-shedding despite the availability of surplus power.\n\nThe Secretary replied that outages were being carried out in areas with high electricity theft. He said overall losses had declined and efficiency had improved, with efforts underway to deploy theft-detection technology at the transformer level.\n\nSenator Ponjo Bheel raised concerns about prolonged outages in Tharparkar, Matiari, and Umerkot, where load-shedding reportedly lasted up to 14 hours a day. He said residents in these areas were paying their bills yet remained without power. He also alleged corruption by local officials who took bribes for illegal connections and disconnected meters only to restore supply in exchange for further payments.\n\nFollowing deliberations, the committee expressed displeasure over the Power Division’s failure to address key questions and directed that detailed responses be submitted in the next meeting.\n\nSenator Haji Hidayatullah highlighted a billing issue in Peshawar, where a property that had been previously declared clear of dues by Pesco was later billed Rs 2.3 million. He alleged that Pesco officials offered to “settle” the bill for Rs300,000 in return for clearing it.\n\nThe Power Division secretary assured the committee the matter would be investigated.\n\nK-Electric officials informed the committee that of their 2,100 feeders, load-shedding did not occur on 70pc, while 30pc faced outages due to high theft rates. They also noted that consumer bills were being broken into instalments to ease payment burdens.\n\nThe committee chairman proposed reviewing the strict electricity slab system and suggested switching to an annual average-based billing structure. The Secretary added that 58pc of consumers fell under the “protected” category, paying Rs10 per unit. He also highlighted the launch of a scheme that allows consumers to submit meter readings via a mobile app, with 500,000 downloads and 250,000 registrations to date.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/06/291039483babc33.jpg?r=103952",
  "retrievedAt": "2025-08-17T19:35:48.416Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921788/govt-slammed-for-loadshedding-rising-consumer-burden",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T04:03:45.000Z"
}
