{
  "title": "Probe ordered into ‘abduction, forced conversion’ of Hindu girl in Badin - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD/ KARACHI: The Sindh Human Rights Commission (SHRC) has taken a notice of a case involving the alleged abduction, child marriage, and forced conversion of a 15-year-old Hindu girl in Matli in the Badin district.\n\nAccording to reports circulating on social media, a ninth-grade student was allegedly abducted at gunpoint near Notkani Chowk in Matli. A complaint filed by her uncle, Majno Maharaj, at the Matli police station alleges that two armed men — Maqsood Dars and Manzoor Dars — forcibly entered the family’s home and abducted the girl, Shahneela, while two unidentified men waited outside in a white vehicle used for the abduction.\n\nThe victim’s family has expressed the fear that the girl is at imminent risk of being forcibly married to someone and converted — both of which are violations of the country’s law.\n\nThe suspect’s family has allegedly refused to return the girl despite the family’s appeals, it was stated.\n\nSHRC urges law enforcers to ensure safety and recovery of 15-year-old\n\nThe SHRC has cited several legal provisions that criminalise the actions allegedly taken by the suspects.\n\nIt stated that Sections 365-B, 364-A, and 506 of the Pakistan Penal Code (PPC) prohibit abduction, forced marriage, and threats. Article 20 of the Constitution of Pakistan guarantees religious freedom, rendering forced conversions unconstitutional.\n\nThe Sindh Child Marriage Restraint Act, 2013 and its associated Rules (2016) empower law enforcers to intervene in such cases, it said.\n\nSpecifically, Rule 8 mandates the rescue and recovery of child victims while Rule 9 authorises search warrants for missing children, it added.\n\nRule 10 provides for the temporary custody of rescued minors. Section 49 of the Criminal Procedure Code (CrPC) allows police to act pre-emptively in cognizable offenses.\n\nExpressing grave concern, the SHRC highlighted the increasing number of cases involving child marriages and forced conversions among Hindu minorities in Sindh.\n\nThe commission described these incidents as serious violations of child rights, minority protections, and constitutional guarantees.\n\nUnder its powers vested by Section 4 (i) (ii) of the Sindh Protection of Human Rights Act, 2011, the SHRC has directed the authorities concerned to conduct a thorough investigation and submit a report through a competent officer before the Commission by July 7, 2025, at 11am.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/241216392dde239.jpg?r=121717",
  "retrievedAt": "2025-08-17T19:36:57.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921711/probe-ordered-into-abduction-forced-conversion-of-hindu-girl-in-badin",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:32.000Z"
}
