{
  "title": "Iran diplomat says open to talks if US rules out military action - World - DAWN.COM",
  "author": null,
  "content": "A senior Iranian diplomat said on Thursday his country remains open to diplomacy provided the United States offers guarantees it will not resort to military action against the Islamic Republic.\n\nThe remarks came as US news website Axios, citing two unidentified sources, reported that White House Middle East envoy Steve Witkoff was planning to meet Iran’s foreign minister and chief negotiator, Abbas Araghchi, in Oslo next week.\n\nNeither Tehran nor Washington confirmed the Axios report, which said a final date for the talks has yet to be set.\n\n“We are for diplomacy,” Iran’s deputy foreign minister, Majid Takht-Ravanchi told NBC News, adding that the US should “convince us that they are not going to use military force while we are negotiating”.\n\n“That is an essential element for our leadership to be in a position to decide about the future round of talks,” he added.\n\nTehran and Washington had held five rounds of nuclear talks since April 12 and were set to hold a new round two days before Israel launched a bombing campaign against Iran on June 13.\n\nThe Israeli strikes targeted Iranian nuclear sites and killed several senior military officials and nuclear scientists.\n\nOn June 22, the US launched unprecedented strikes of its own on Iranian nuclear facilities at Fordow, Isfahan and Natanz.\n\nMore than 900 people were killed in Iran during the conflict, according to the judiciary.\n\nThe Israeli attacks drew waves of retaliatory drone and missile fire, killing 28 people in Israel, according to authorities.\n\nA ceasefire between Iran and Israel was agreed on June 24.\n\nDuring the nuclear talks, which were stalled because of the fighting, Iran and the US had been at sharp odds over Iran’s uranium enrichment, which Tehran considers a “non-negotiable” right and which Washington has called a “red line”.\n\nIran has insisted on its right to enrich uranium even after the 12-day war with Israel.\n\n“Our policy has not changed on enrichment,” Takht-Ravanchi told NBC News.\n\n“Iran has every right to do enrichment within its territory. The only thing that we have to observe is not to go for militarisation. “\n\nAt the same time, Iran affirmed its commitment to the nuclear Non-Proliferation Treaty (NPT), as it accused Germany of “malice” over its criticism of Tehran’s decision to suspend cooperation with the UN nuclear watchdog.\n\n“Iran remains committed to the NPT and its Safeguards Agreement,” Foreign Minister Abbas Araghchi said in a post on X.\n\n“The explicit German support for the bombing of Iran has obliterated the notion that the German regime harbours anything but malice towards Iranians,” he added in response to a German foreign office post criticising the move.\n\nOn Wednesday, Iran officially suspended its cooperation with the International Atomic Energy Agency, citing the agency’s failure to condemn Israeli and US strikes on Iranian nuclear sites.\n\nIn a post on X, Germany’s foreign office called on Iran to “reverse this decision,” saying it sends a “devastating message”.\n\n“It eliminates any possibility of international oversight of the Iranian nuclear programme, which is crucial for a diplomatic solution,” it added.\n\nAraghchi lambasted what he called Germany’s “explicit support for Israel’s unlawful attack on Iran” on June 13, killing top Iranian military commanders and nuclear scientists.\n\nOn June 17, German Chancellor Friedrich Merz said Israel was doing the “dirty work … for all of us” by targeting Iran’s nuclear infrastructure.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:33:43.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921880/iran-diplomat-says-open-to-talks-if-us-rules-out-military-action",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T14:23:58.000Z"
}
