{
  "title": "IHC overturns 10-year sentences of 4 PTI workers in May 9 riots case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad High Court (IHC) on Thursday acquitted four PTI members who had been convicted on charges of attacking a police station during the violent May 9 riots.\n\nOn May 9, 2023, PTI supporters, protesting the party founder Imran Khan’s arrest, staged violent protests throughout the country, vandalising military installations and state-owned buildings, while also attacking the Lahore corps commander’s residence. Following the riots, thousands of protesters, including party leaders, were arrested.\n\nAn Anti-Terrorism Court in Islamabad had sentenced PTI MNA Abdul Latif and 11 other party members were convicted under various charges on May 30 for attacking the Ramna police station in Islamabad.\n\nFollowing the verdict, the police took the four of the convicted members present in the court, namely Mira Khan, Muhammad Akram, Shahzeb, and Sohail Khan, into custody.\n\nDuring today’s hearing, Justice Azam Khan and Justice Khadim Soomro acquitted the four convicts after the prosecution was unable to prove their presence at the scene of the protest based on the witnesses’ accounts.\n\nThe convicts had been charged under Pakistan Penal Code (PPC) Sections 148 (rioting, armed with deadly weapon), 149 (unlawful assembly), 186 (obstructing official duty), 188 (disobeying order of a public servant), 324 (attempted mu­r­der), 353 (assault on public servants), 436 (arson) and 440 (misch­ief); Sect­ion 144 of CrPC; and Sec­tion 7 of the Anti Terro­rism Act (ATA), 1997.\n\nThey were sentenced to 10 years imprisonment under Section 7 ATA, five years under Section 324 of PPC, four under Section 436, two each under sections 353 and 148.\n\nAdditionally, the convicts were sentenced to four years in prison and fined Rs40,000 for burning a motorcycle under Section 426 (punishment for mischief); and a separate sentence of four years in prison and a fine of Rs40,000 under Section 440 (mischief committed after preparation made for causing death or hurt) for vandalising a police station.\n\nA sentence of three-month imprisonment was imposed for interfering in the work of the police under Section 186 (obstructing public servant in discharge of public functions), one month for violating Section 144 (joining unlawful assembly armed with a deadly weapon), and two years for committing a crime in a group under Section 149 (every member of unlawful assembly guilty of an offence committed in prosecution of common object).\n\nThe sentences were to run concurrently.\n\nPTI lawyer Babar Awan argued that out of the nine prosecution witnesses, only one witness — Assistant Sub-Inspector Muhammad Sharif — was able to identify the accused.\n\nHe said, “While it was alleged that the protesters had resorted to firing, no one was injured. The crime must be punished, but the system should not be made into a joke.”\n\nJustice Soomro asked the prosecutor, Nasir Shah, to present the evidence. Shah said that the evidence had been collected but sought more time to present it before the court.\n\nThe bench said that if more time was required, then it should have been informed in advance, since now it had heard all the arguments.\n\nIt further said that no one was injured, adding that the prosecution should prove the presence of the accused at the scene.\n\nThe judges said that the witnesses’ statements did not include any mention that the accused were present at the scene. They questioned whether the court would now hand down sentences based on an identity parade.\n\nMeanwhile, the prosecutor said, “What could be a greater act of terrorism than an attack on a police station?”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:34:05.964Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921863/ihc-overturns-10-year-sentences-of-4-pti-workers-in-may-9-riots-case",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T13:14:53.000Z"
}
