{
  "title": "At least 4 dead, 30 missing after ferry sinks on way to Indonesia’s Bali - World - DAWN.COM",
  "author": null,
  "content": "At least four people were dead and dozens unaccounted for Thursday after a ferry sank in rough seas on its way to Indonesian resort island Bali, according to rescue authorities who said 31 survivors had been plucked from the water so far.\n\nRescuers were racing to find 30 people still missing at sea after the vessel carrying 65 passengers and crew sank before midnight on Wednesday as it sailed to the popular holiday destination from Indonesia’s main island Java.\n\n“The ferry tilted and immediately sank,” survivor Eka Toniansyah told reporters at a Bali hospital.\n\n“Most of the passengers were from Indonesia. I was with my father. My father is dead.”\n\nIndonesia’s national search and rescue agency chief Mohammad Syafii told a news conference on Thursday that 31 survivors had been found.\n\n“Four people died, so 30 people are still being searched for,” he said, adding the national agency sent a helicopter to help the effort.\n\nPresident Prabowo Subianto, who was on a trip to Saudi Arabia, ordered an immediate emergency response, cabinet secretary Teddy Indra Wijaya said in a statement on Thursday, adding the cause of the accident was “bad weather”.\n\nJava-based Surabaya search and rescue agency head Nanang Sigit, who had earlier put the total number of missing at 38, said efforts to reach the doomed vessel were initially hampered by adverse weather conditions.\n\nWaves as high as 2.5 metres with “strong winds and strong currents” had affected the rescue operation, he said, adding conditions have since improved.\n\nA rescue team of at least 54 personnel including from the navy and police were dispatched along with inflatable rescue boats, he said, while a bigger vessel was later sent from Surabaya city to assist the search efforts.\n\nNanang said rescuers would follow currents and expand the search area if there were still unaccounted for people by the end of the day.\n\n“For today’s search, we are still focusing on search above the water where initial victims were found,” the Surabaya search and rescue chief said.\n\nThe ferry’s manifest showed 53 passengers and 12 crew members, he said, but rescuers were still assessing if there were more people onboard than the manifest showed.\n\nIt is common in Indonesia for the actual number of passengers on a boat to differ from the manifest.\n\nThe ferry crossing from Ketapang port in Java’s Banyuwangi regency to Bali’s Gilimanuk port — one of the busiest in Indonesia — is around 5 kilometres as the crow flies and takes around one hour.\n\nIt is often used by people crossing between the islands by car.\n\nFour of the known survivors saved themselves by using the ferry’s lifeboat and were found in the water early Thursday, the Surabaya rescue agency said.\n\nIt said the ferry was also transporting 22 vehicles, including 14 trucks. It was unclear if any foreigners were onboard when the ferry sank.\n\nMarine accidents are a regular occurrence in Indonesia, a Southeast Asian archipelago of around 17,000 islands, in part due to lax safety standards and sometimes due to bad weather.\n\nIn March, a boat carrying 16 people capsized in rough waters off Bali, killing an Australian woman and injuring at least one other person.\n\nA ferry carrying more than 800 people ran aground in shallow waters off East Nusa Tenggara province in 2022 and remained stuck for two days before being dislodged with no one hurt.\n\nAnd in 2018, more than 150 people drowned when a ferry sank in one of the world’s deepest lakes on Sumatra island.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/03105702d7b356b.png",
  "retrievedAt": "2025-08-17T19:35:16.819Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921803/at-least-4-dead-30-missing-after-ferry-sinks-on-way-to-indonesias-bali",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T06:14:38.000Z"
}
