{
  "title": "PM arrives in Azerbaijan to attend 17th ECO Summit - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif arrived in Azerbaijan on Thursday to participate in the 17th Summit of the Economic Cooperation Organisation (ECO).\n\nThe summit is set to run from July 3–4 in Khankendi, convening ECO heads of states/governments, ministers, ECO observers, special guests from non-ECO countries and heads of international organisations to achieve development and prosperity through fragile economic integration.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Information Minister Attaullah Tarar and Special Assistant Tariq Fatemi are accompanying the prime minister during the two-day visit.\n\nThe delegation arrived in the city of Shusha for a two-day visit, where it was received by Azerbaijan’s Minister for Culture Adil Karimli, at Fuzuli Airport.\n\nPakistan’s Ambassador to Azerbaijan Qasim Mohiuddin and other senior diplomatic and government officials were also present to welcome the delegation.\n\nIn a statement ahead of the visit, the Foreign Office had said the prime minister would “share Pakistan’s perspective on key regional and global challenges, reaffirm Pakistan’s commitment to the ECO Vision 2025, and advocate for enhanced intra-regional trade, transport connectivity, energy cooperation, and sustainable development”.\n\nHe will also hold bilateral meetings with other ECO leaders on the sidelines of the summit to discuss matters of mutual interest, the statement added.\n\nThe theme of the summit is ‘New ECO Vision for a Sustainable and Climate Resilient Future’.\n\nAccording to a statement by ECO, the summit will convene ECO heads of states/governments, ministers, observers, special guests from non-ECO countries and heads of international organisations to achieve development and prosperity through fragile economic integration.\n\nThe summit will feature a “dynamic and inclusive ECO Week”, held from July 1–4 across multiple cities in Azerbaijan. The ECO week will include a series of thematic forums aimed at advancing youth engagement, gender inclusion and economic connectivity within the region.\n\nThe 16th ECO summit was held from November 9, 2023, in Tashkent, Uzbekistan and attended by then-caretaker prime minister Anwarul Haq Kakar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/021848027e1778c.jpg?r=184945",
  "retrievedAt": "2025-08-17T19:33:56.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921869/pm-arrives-in-azerbaijan-to-attend-17th-eco-summit",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T13:21:19.000Z"
}
