{
  "title": "Pakistan’s participation in hockey tournaments hosted by India undecided: PSB - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Sports Board said on Thursday that the hockey team’s participation in the 2025 Men’s Hockey Asia Cup and the Federation of International Hockey (FIH) Junior Men’s Cup — both hosted by India — remained unconfirmed.\n\nEarlier today, Indian media outlets reported that Pakistan had been cleared to take part in both events, scheduled from August 27 to September 7, and from November 28 to December 10, respectively.\n\nIn exclusive comments to Dawn.com, Pakistan Sports Board spokesperson Khurram Shahzad said that the Pakistan Hockey Federation (PHF) issued a request about whether or not the national hockey team can travel to India to play in the Asia Cup, amid spiking tensions between the two nations.\n\n“On June 19, the Pakistan Sports Board sent this request to the Ministry of Inter-Provincial Coordination, which forwarded it to the Ministry of Interior and the Ministry of Foreign Affairs for a final decision,” Shahzad said.\n\n“However, no decision has been taken on this yet.”\n\nShahzad noted in his comments that the Asia Cup is a qualifying event for the 2026 Hockey World Cup.\n\nAccording to The Times of India, the Indian interior and foreign ministries have cleared Pakistan’s participation in the tournaments, with the visa process underway.\n\nThe outlet reported that the choice to allow Pakistan to take part was “part of the Indian government’s efforts to keep politics and sports aside”, in keeping with the Olympic Charter.\n\nHowever, The Times of India noted that if Pakistan had been disallowed from the tournament, India would face sanctions from the International Olympic Committee. Additionally, it reported that the decision meant that Pakistani athletes in other sports would be able to compete in India.\n\nPolitical tensions between the two nations have cast a shadow over bilateral sporting events.\n\nIndia will host the women’s 50-over World Cup this year, but Pakistan will play all their matches in Sri Lanka under an arrangement made by the International Cricket Council.\n\nIndia refused to travel to Pakistan for the Champions Trophy this year and played all their matches, including the March 9 final, in Dubai.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/03193200e18fbe0.jpg",
  "retrievedAt": "2025-08-17T19:34:11.649Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921867/pakistans-participation-in-hockey-tournaments-hosted-by-india-undecided-psb",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T14:03:33.000Z"
}
