{
  "title": "Sajid Khan vows to represent Pakistan in white-ball cricket - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Having performed impressively in Test cricket during the past few years, Pakistan off-spinner Sajid Khan vows to play white-ball cricket for the country.\n\nThe 31-year-old Sajid, who made his Test debut in 2021 at Harare, played match-winning roles in a number of Tests but has not featured in One-day Internationals and T20 Internationals.\n\n“I am trying to play T20I and One-day International cricket for Pakistan and league cricket, too. I am working on it. Insha Allah I will play white-ball cricket for Pakistan,” Sajid said while talking to reporters during the Skill Development camp, which is in progress at the LCCA ground, on Wednesday. The camp has been arranged for players’ white-ball cricket skills.\n\nSurprisingly, Sajid, who has played 12 Test matches so far in which he claimed 59 wickets at an average of 27.28, has not received regular chances in five-day format.\n\nDespite performing well for Pakistan in 2021 and 2022, Sajid was ignored by the national selectors. He staged a comeback in January 2024 to play one Test against Australia at Sydney. But again he was not overlooked for the home series against Bangladesh in the home series held in August 2024. The hosts faced an emba­rrassing 2-0 sweep in this series.\n\nThe off-spinner was again not selected for the first home Test against England in October 2024 which Pakistan lost. That defeat triggered severe criticism as Pakistan had earlier lost the home Test series to Bangladesh, too.\n\nAaqib Javed brought in the national selection committee which recalled Sajid for the remaining two Tests against England. Pakistan in a brilliant comeback won the next two Tests on spin-friendly tracks to take the series as Sajid excelled to take grab 19 wickets in the two Tests.\n\nTo one’s utter astonishment, he was again ignored for the away two-Test series against South Africa where Pakistan lost both the Tests. The resolute cricketer was yet again brought back for the two-Test rubber against West Indies held in Multan earlier this year when he took 15 wickets. Pakistan drew this series 1-1.\n\nSajid signalled his added role in white-ball games ahead.\n\n“Next year, two more teams are being included in the league [PSL]. You may see me in that league,” he said.\n\n“This Skill Development camp is also meant for white-ball cricket and I am attending it because the management considered me for this format too.”\n\nThe player continued, “My first-class cricket also started with white-ball cricket and I was declared the best player of the final in the last national one-day championship.”\n\nSajid said he wanted to represent the country in all formats.\n\n“Yes it is a great honour for any cricketer to represent his country in Test cricket. [However] every player also wants to play all formats [in international cricket] and I am trying for it,” he said adding that Test cricket was a game of pressure particularly against stronger sides like England, Australia and South Africa.\n\nSajid said that getting a chance to play Test cricket was way too different from playing first-class games.\n\n“In Test cricket, you share dressing room with star players, you have better trainers, and a better diet which help you a lot to bring improvement in the skillset,” he underlined.\n\nWhile regretting that Pakis­tan were playing relatively less number of Test matches, Sajid said it was good for the country that several Tests in the ongoing World Test Championship (WTC) cycle would be held on Pakistan’s home soil.\n\n“Taking the advantage of this, we can make the WTC final,” he hoped.\n\n“Being a player it is my desire that Pakistan reach the top in Test cricket, whether or not I remain part of the team.”\n\nSajid, who played for Somerset in the past, said that currently he was in talks with a couple of English counties, and would sign a contract with one of them soon.\n\nPublished in Dawn, July 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/03120948d877949.png",
  "retrievedAt": "2025-08-17T19:37:35.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921720/sajid-khan-vows-to-represent-pakistan-in-white-ball-cricket",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T00:47:20.000Z"
}
