{
  "title": "‘Kamyab Kissan’ reflects PTI govt’s farmer-friendly policies.: Ch Sarwar",
  "link": "https://www.app.com.pk/national/kamyab-kissan-reflects-pti-govts-farmer-friendly-policies-ch-sarwar/",
  "date_published": "2021-01-29T09:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 29 (APP):Governor Punjab Chaudhry Mohammad Sarwar has said the “Kamyab Kissan” initiative is a reflection of farmer-friendly policies of the government in line with the vision of Prime Minister Imran Khan.\nDuring a meeting with renowned industrialist, Khwaja Jalal-ud-Din Rumi at the Governor’s House here on Friday, he said the Pakistan Tehreek-e-Insaf (PTI) government was ensuring the provision of various facilities like modern tractors to farmers, adding that country’s economic success lies in strengthening the agriculture sector.\nThe governor said the past governments paid lip service only regarding empowering farmers, but the the PTI government was taking practical steps for prosperity of farmers.\n“The nation hails Prime Minister Imran Khan, and his entire team deserves appreciation for launching Kamyab Kissan project under the umbrella of Kaamyab Jawan Programme,” he said.\nCh Sarwar said Prime Minister Imran Khan had formed a committee of the Federal and Punjab government departments to boost cotton production in the province, adding that he, alongside Chief Minister Punjab Sardar Usman Buzdar, will head the committee.\nThe Punjab governor further said the corrupt elements had also been exploiting farmers economically, adding that corruption was the root-cause of all problems and the government was committed to eradicating corruption from the country.\nHailing the prime minister as a great leader, he said Imran Khan saved the country from economic bankruptcy and the government was taking practical steps to strengthen all sectors.\nCh Mohammad Sarwar said those who were conspiring to stop the country from moving forward would not succeed. He said despite serious economic challenges, the government was striving to provide basic facilities to the common man.\nHe, in the meeting during which issues related to farmers’ welfare and importance of research, came under discussion, appreciated services of Jalaluddin Rumi in the industrial sector.",
  "retrievedAt": "2025-08-11T20:17:41.888Z"
}
