{
  "title": "Sahiwal emerging as another trade hub: CM",
  "link": "https://www.app.com.pk/national/sahiwal-emerging-as-another-trade-hub-cm/",
  "date_published": "2021-01-29T14:06:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 29 (APP): Punjab Chief Minister Sardar Usman Buzdar on Friday said that the fertile lands of Sahiwal region had rapidly emerged as another trade hub as it had great potential of becoming agro-based industries.\nThis was stated by him while addressing a ceremony, held to inaugurate mega development projects in Sahiwal.\nGiving details of the development work, the CM said that peripheral areas of Harappa and Chichawatni would also enjoy the fruits of development as a Rs 2 billion package had been announced for each area.\nHe said the development package included projects of water supply, underpass and roads’ construction, wildlife park, tehsil sports complex, grounds, sewerage and provision of health and educational facilities, said a handout issued here.\nThe chief minister emphasised that cities were being transformed to enjoy modern facilities, adding that provision of modern municipal services was being started in Sahiwal with a cost of Rs18 billion under the Punjab Intermediate Cities Improvement Investment Programmer. The government also saved Rs 110 million through open international tendering, he added.\nSahiwal will emerge as the engine of growth as a waste management academy and waste segregation plant had been inaugurated in the city along with the start of Ehsaas Programme, Hunarmand Nojawan Programme and Punjab Rozgar Scheme.\nMeanwhile, it has also been planned to provide the best municipal services in seven other cities, he said. The foundation stone of 120-bed Sahiwal institute of cardiology has been laid along with upgradation of a teaching hospital. Also, a universal healthcare programme was going to be started as well to give free treatment facilities to 120 million people of the province, added Usman Buzdar.\nThe CM termed the incumbent government farmer-friendly which had started devising agricultural policy way back in 2019 and added that important agricultural projects had been started during the last two years with an amount of 90.70 billion rupees. Regrettably, Sahiwal, which is called the hub of livestock, was ignored in the past and nobody gave attention for devising provincial livestock policy, he added.\nThe credit goes to the PTI government to prepare and launch the first livestock policy of the province before the upcoming budget. The government will also maintain liaison with the parliamentarians and other stakeholders for completion of development projects and the goal of composite development will be achieved under the leadership of PM Imran Khan, concluded the CM.",
  "retrievedAt": "2025-08-11T20:17:40.422Z"
}
