{
  "title": "Govt willing to provide relief to teachers facing repatriation: Senate told",
  "link": "https://www.app.com.pk/national/govt-willing-to-provide-relief-to-teachers-facing-repatriation-senate-told/",
  "date_published": "2021-01-29T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP): Minister of State for Parliamentary Affairs Ali Muhammad Khan on Friday said that government was willing to provide relief to the teachers working on deputation and now facing repatriation due to completion of their five-year period.\nHe was responding to a calling attention notice, moved by Senator Mushahid Hussain Sayed about repatriation of 200 teachers by the Federal Directorate of Education (FDE), who were on deputation under the wedlock policy of the government.\nMushahid told that repatriation of teachers on deputation would affect the families as they were working in Islamabad for many years.\nThe minister said that those who brought NOC from the parent departments were not repatriated.\nHe said that government had no issue with the teachers, if they bring NOC from parent provincial departments.\nAli Muhammad Khan said that most of the teachers; male and female came on deputation from provincial departments to FDE.\nHe said that an action was taken in 2019 to repatriate the teachers working for the last many years in Islamabad even after completing five years deputation.\nThe minister said that provincial education departments had written many letters asking for repatriation of teachers to parent departments. He said that as per the law, the deputation period expired after five years of time.\nResponding to another calling attention notice moved by Senator Ayesha Raza Farooq to draw attention of the Minister for National Health Services, Regulations and Coordination, towards the COVID-19 vaccination plan of the government to ensure early and equitable access to the vaccine, the minister said the government was working to ensure availability of the vaccines, adding that top most priority for vaccination would be frontline health workers\nDuring the first phase of the COVID-19 pandemic, there was shortage of masks and other many facilities, but today Pakistan was exporting masks and other related equipments.\nAli Muhammad Khan said that COVID-19 vaccines’ first consignment would arrive by Sunday from China. He said that government had made efforts to timely acquire vaccines.\nThe minister said that vaccination would be carried through immunization programme.\nChairman Senate Muhammad Sadiq Sanjrani disposed off the calling attention notice and referred the issue to the concerned committee.\nLeader of the House in the Senate Dr. Shahzad Waseem said that from next week vaccination would be started and health workers would be administered the doses. He said that the methodology would be transparently implemented.\nLeader of the House said that many vaccination centers were being established for the purpose. He said that Covid-19 was tackled sincerely and timely steps were taken from the very start by the government.\nSpeaking about teachers, Dr. Shahzad Waseem said that government was fully aware and understood the problems of the teachers working on deputation.\nHe said that he talked with the federal minister for education in this regard and the minister assured that his ministry would resolve this issue.\nLeader of the Opposition Senator Raja Zafar ul Haq said that teachers issue should be resolved with consensus in coordination with all stakeholders.\nHe said that this issue should be sent to concerned committee, adding that repatriation of teachers to provincial departments would disturb families.\nSenator Khushbakht Shujaat said that Covid-19 vaccine was very important issue, adding that there should be a proper mechanism to ensure vaccination and provision of vaccines.",
  "retrievedAt": "2025-08-11T20:17:44.455Z"
}
