{
  "title": "PM directs strict action against land grabbers to stop exploitation of poor",
  "link": "https://www.app.com.pk/national/ptis-mnas-party-members-from-sahiwal-call-on-pm/",
  "date_published": "2021-01-29T10:16:00.000Z",
  "source": "APP",
  "content": "SAHIWAL, Jan 29 (APP): Prime Minister Imran Khan on Friday directed strict action against the mafia involved in illegal occupation of land, so as to stop exploitation of the poor and weaker sections of society.\nThe Prime Minister issued directives to the local administration to hold Open Kutchery (forums) every month for resolution of issues on priority basis.\nThe Prime Minister stated this while holding a meeting with parliamentarians and members from Pakistan Tehreek-e-Insaf, belonging to Sahiwal division during his visit to the city.\nThose who met the Prime Minister included Rai Muhammad Murtaza Iqbal, Syed Samsam Ali Bukhari, Malik Hauman Ahmed Langrial, Chaudhry Muhammad Nauraiz Shakoor, Sheikh Muhammad Chauhan, Malik Faisal Jalal Dhakoo, Mehr Irshad Hussain Kathia, Waheed Asghar Dogar Syed Muhammad Muzaffar Shah Khagga, Rai Hassan Nawaz Khan, Faizullah Kamoka, Shakil Ahmed Niazi, Rana Aftab Ahmed, Nabeela Awan, Dr Mazhar Shirazi and Waseem Ramay.\nGovernor Punjab Chaudhry Muhammad Sarwar and Chief Minister Sardar Usman Bazdar were also present in the meeting. The meeting also discussed several issues including political matters, public welfare, development projects relating to health, education and agricultural sector.\nPrime Minister Imran Khan regretted that in the past, developed funds were diverted to few cities of Punjab only, ignoring the entire province. He recalled that the government faced fiscal deficit when came to power, however said, the prudent policies led to improvement in economy. The parliamentarians presented proposals to the Prime Minister regarding relief for farmers keeping in view of the agricultural importance of Sahiwal.\nThey also apprised the Prime Minister about the issue of land grabbing and the action taken against the persons involved.",
  "retrievedAt": "2025-08-11T20:17:40.854Z"
}
