{
  "title": "PM Imran Khan hails CM Buzdar for bringing land-mafia to book",
  "link": "https://www.app.com.pk/national/pm-imran-khan-hails-cm-buzdar-for-bringing-land-mafia-to-book/",
  "date_published": "2021-01-29T17:13:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 29 (APP): Prime Minister Imran Khan has hailed Chief Minister Punjab Sardar Usman Buzdar for bringing the land-mafia to the book and getting the government lands worth billions of rupees vacated from the illegal occupants.\nAddressing a cheque distribution under Ehsaas programme and provision of tractors under Kamyab Jawan programme ceremony in Sahiwal on Friday, he said he was pleased to see how the ‘palaces of land-mafia’ were demolished, adding that land-mafia (‘qabza groups’) was a curse and enemy of the state.\n“I congratulate Chief Minister Punjab Usman Buzdar, and his team including Chief Secretary Punjab and Inspector General of Police (IGP) Punjab for taking the powerful land grabbers to task”, the premier started his address with these words.\nHailing the Chief Minister Punjab, PM Imran Khan said Usman Buzdar was not as outspoken as former Chief Minister Shehbaz Sharif, did not spend billion of rupees of public money on self-projection and moved in a convoy of 40 government vehicles but he had done a true service to the people by nabbing the land-grabbers.\nThe Premier said the land-mafia usurped land of poor people and properties of the overseas Pakistanis, adding that the most powerful land-mafia of Lahore was backed by a former prime minister and his family and CM Buzdar had shown people the change with his commendable action against the land-grabbers.\n“This is the real change (‘tabdeeli’) when big dacoits are taken to task and brought to justice,” he said, adding that only those nations prospered that upheld the rule of law.\nGovernor Punjab Chaudhry Mohammad Sarwar, MNAs, provincial minister, PM’s Adviser on Climate Change Malik Amin Aslam, Adviser to PM on Youth Affairs Usman Dar, PM’s Special Assistant on Social Welfare, PTI leadership were present on the occasion.",
  "retrievedAt": "2025-08-11T20:17:38.311Z"
}
