{
  "title": "Mirpur earthquake affectees protests for early payment of compensatory relief",
  "link": "https://www.app.com.pk/national/mirpur-earthquake-affectees-protests-for-early-payment-of-compensatory-relief/",
  "date_published": "2021-01-29T13:36:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK), Jan 29 (APP): A large number of people from various segments of local civil society staged protest demonstration in front of the Divisional Commissioner’s office in Mirpur Azad Jammu Kashmir on Friday to press the Azad Jammu and Kashmir (AJK) government for early acceptance of their long standing demands including the early payment of compensatory relief to affectees of September 24,2019 earthquake that jolted Mirpur city and its various adjoining areas.\nThe demonstration was led by Jamaat-e-Islami Pakistan (AJK Chapter) Central Vice President Zulqarnain Butt, Chaudhry Shakoor, Asif Butt, Ch. Meherban, Khawaja Shehzad Lone, Sheikh Rasheed and other elders of the civil society.\nSpeakers on this occasion bitterly criticized the PML-N led AJK government for, what they called, deliberately ignoring agonies of the earthquake-hit local population who are waiting for the already-committed compensatory relief for the reconstruction, repair and rehabilitation of their affected properties badly damaged in the catastrophe.\nThey underlined that the extremely damaged structures of the earthquake hit buildings in Mirpur could result in major incidents of sudden collapse if they were left without repair and reconstruction.\nThe speakers also called for providing the job opportunities to the unemployed educated youth belonging to Mirpur district under the determined district wise quota for the AJK government jobs in the public sector institutions purely on merit instead of defying the set rules about the inductions against vacant posts in the government functionaries without any regional or tribal prejudice.\nThe demonstrating people were carrying placards and banners inscribed with slogans in support of their demands. The rally later dispersed peacefully.",
  "retrievedAt": "2025-08-11T20:17:41.120Z"
}
