{
  "title": "Afridi urges political parties to supplement govt’s offensive on Kashmir",
  "link": "https://www.app.com.pk/national/afridi-urges-political-parties-to-supplement-govts-offensive-on-kashmir/",
  "date_published": "2021-01-29T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Kashmir Committee Chairman Shehryar Khan Afridi Friday urged all political parties to join hands with Kashmir Committee to supplement the government’s offensive on Kashmir dispute.\nHe expressed these views while addressing the participants of a seminar titled ‘Kashmir back to the international spotlight: What next’ here under the auspices of Kashmir Institute of International Relations (KIIR).\nThe event was presided by Azad Jammu Kashmir President Sardar Masood Khan. Chairman of KIIR Altaf Wani was also present on the occasion.\n“We need to emphasise on present and future strategies to raise Kashmir dispute at all the international forums. The world needs to hold India’s Hindutva regime accountable for genocide of Kashmiris,” he said.\nAfridi said that Kashmir Committee was working to evolve strategy to counter Indian bids to silence and sensor pro-Kashmiri voices on digital arena and the political parties should join forces to develop a holistic strategy to expose the Kashmiri genocide agenda of Modi regime in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“We need to ensure that all irritants are removed so as access to information on Kashmir must be accessible to every youth of Pakistan and Kashmir on digital space,” he said.\nMoreover, Shehryar Afridi said the academia role needs to be showcased for effective narrative building on Kashmir through better research and protection of archives.\nHe underlined the need to raise and expose the violations of human rights, child and women rights being committed by occupational forces in IIOJK.\nAfridi said that since India under its genocide plan was trying to damage and destroy Kashmiri culture and heritage, we are working on securing, safeguarding and projecting the culture and heritage of Kashmir.\nHe said that Pakistan was working to use modern media tools to expose Indian atrocities being committed by colonial regime in IIOJK.",
  "retrievedAt": "2025-08-11T20:17:43.921Z"
}
