{
  "title": "PM Shehbaz thanks Trump’s ‘leadership, proactive role’ in securing full, immediate ceasefire - Pakistan - DAWN.COM",
  "author": null,
  "content": "In a breakthrough moment amid military escalation between India and Pakistan, both nations have agreed to a ceasefire pushed by United States President Donald Trump, with Prime Minister Shehbaz Sharif and politicians hailing the move.\n\nThe intense military exchange began in the early hours of Saturday after India attacked Pakistani airbases. Soon afterwards, Pakistan launched its retaliatory operation, Bunyan-um-Marsoos, which came to an end on Saturday afternoon when both nations agreed to a full ceasefire, effective 4:30 PKT.\n\nThe ceasefire was announced by US President Trump in a post on his social media platform Truth Social.\n\n“After a long night of talks mediated by the United States, I am pleased to announce that India and Pakistan have agreed to a full and immediate ceasefire,” Trump wrote, congratulating both nations and praising them for “using common sense and great intelligence”.\n\nForeign Minister Ishaq Dar took to X to announce the ceasefire “with immediate effect” at 5:08pm, writing “Pakistan has always strived for peace and security in the region, without compromising on its sovereignty and territorial integrity.”\n\nHis counterpart, Indian Foreign Minister Subhramanyam Jaishankar wrote on X that both countries “worked out an understanding on [the] stoppage of firing and military action”.\n\n“India has consistently maintained a firm and uncompromising stance against terrorism in all its forms and manifestations. It will continue to do so,” he added.\n\nIndia’s Foreign Secretary Shri Vikram Misri said a ceasefire was established between the two neighbours at 5pm IST (4:30pm PKT), adding during a press briefing that the military operations chiefs of both nations agreed “that both sides would stop all firing and military action on land, air and sea with effect”.\n\n“Instructions have been given on both sides to give effect to this understanding,” Misri said, adding that the Directors General of Military Operations would “talk again on 12th of May at 1200 hours (11:30am PKT)”.\n\nPM Shehbaz thanked Trump for his “leadership and proactive role” in helping Pakistan and India achieve peace in the region.\n\n“Pakistan appreciates the US for facilitating this outcome, which we have accepted in the interest of regional peace and stability,” PM Shehbaz said in a post on X.\n\n“We also thank Vice President JD Vance and Secretary of State Marco Rubio for their valuable contributions to peace in South Asia,” the premier said, adding that the country believed the step marked a new beginning in resolving issues that have plagued the region and hindered its journey toward peace, prosperity and stability.\n\nPPP Chairman Bilawal Bhutto Zardari said that Pakistan has consistently pursued dialogue and diplomacy as the “only viable path to peace”.\n\n“War, violence and aggression are never the answer,” the Bhutto scion wrote on X. “Now that both India and Pakistan have agreed to a ceasefire and dialogue, we welcome this as a victory for diplomacy.”\n\nBilawal appreciated the role of the US, Saudi Arabia and all countries “involved in achieving this historic milestone”.\n\n“As a Pakistani, I could not be more proud of our people, our army and especially our Air Force. Pakistan Zindabad.”\n\nAt around 3:30am on Saturday, Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry said that India targeted the Pakistan Air Force’s (PAF) Nur Khan (Chaklala, Rawalpindi), Murid (Chakwal) and Rafiqui (Shorkot in Jhang district) air bases, adding that all PAF assets remained safe.\n\nAddressing a press conference, he said that India was “pushing the whole region towards a dangerous war with its madness, aggression and deceit”. The DG ISPR also said that India had fired missiles at Afghanistan and used drones to conduct attacks as well.\n\nThe military spokesperson said that “the majority” of Indian missiles fired at PAF airbases were intercepted by the armed forces’ air defence systems. He noted that the few Indian missiles that were not intercepted and “sneaked in” had “not been able to cause any damage” to PAF’s flying assets, as per the initial damage assessment reports.\n\nThe DG ISPR said that the air defence systems of the armed forces were able to “successfully prevent the desired objectives of India”.\n\nHe added the missiles and drone attacks by India on Afghanistan shortly after attacks on the territory of Indian Punjab were “part of a larger sinister plan to push the region and beyond into havoc”.\n\nLt Gen Chaudhry said that the PAF had the electronic signatures of all Indian missiles, including “from where they were initiated and what was targeted”.\n\nThe military’s spokesperson assured the nation that the armed forces were “vigilant and thwarting all these cowardly acts of aggression by Indians”.\n\n“These blatant acts of aggression by India actually reflect the paranoia within Indian mindset which continues to grow after failure of each of these acts and the paranoia continues to also grow once it realises that they cannot break the resolve and will of the people of Pakistan which actually strengthens and further grows with each such cowardly act.”\n\nHe further said that the “growing frustration and paranoia” of the Indians would be “further compounded”.\n\nAt 4:38am, state-run PTV News said that the Pakistani military had launched its counter-attack against Indian aggression.\n\nAt 5:52am, PTV News and Radio Pakistan announced that the Pakistani military had destroyed a site storing Brahmos missiles in India’s Beas region as part of the retaliatory operation called ‘Bunyan-um-Marsoos’.\n\nIn a statement, the broadcasters reported that attacks were ongoing at more places in India and that airbases in Udhampur and Pathankot were also destroyed.\n\nFederal Minister for Communications Abdul Aleem Khan also confirmed that Operation Bunyan-um-Marsoos was launched against the “enemy”.\n\n“Long live Pakistan — May Allah protect our falcons,” the minister said in a post on X.\n\nPPP Senator Sherry Rehman said that Pakistan responded with precision and strategic integrity by targeting only Indian military targets.\n\n“In tonight’s unprovoked attack by India once again, civilian populations have been indiscriminately attacked in Pakistan,” Rehman said. “This is the clear difference.”\n\nAt 6:13am, PTV News said in a video update that a storage site of Brahmos missiles was destroyed.\n\nAt 6:50am IST (6:20am PKT), The Times of India reported that explosion-like sounds were heard in Punjab’s Pathankot district early on Saturday morning,\n\n“The blasts, reported around 5am, however, have not yet been officially acknowledged by authorities. A blackout was enforced in Pathankot on Friday night, with officials urging residents to remain indoors as a precautionary measure,” it said.\n\nPTV News said at 6:29am that Pakistani drones were active in the skies above India’s capital New Delhi. Soon after, the government said on X that Pakistan had targeted key Indian military installations in a “befitting response” as part of ‘Bunyan-um-Marsoos’.\n\n“These actions are being carried out in response to India’s initial attack, which was an assault on our homeland, people and sovereignty,” the statement said, referring to Indian missile strikes against the three PAF bases.\n\nPTV News further reported at 7:13am that hypersonic missiles launched by a PAF JF-17 Thunder destroyed an Indian S-400 system in Adampur. It added that the S-400 air defence system is worth approximately $1.5 billion.\n\nPTV News also said that most Indian websites, including the BJP’s official website and the Border Security Forces (BSF), were hacked as Pakistan’s counterattack continued.\n\nOther hacked websites included the Crime Research Investigation Agency, the Mahanagar Telecommunication Company Limited, the Bharat Earth Movers Limited, All India Naval Technical Supervisory Staff Association, Hindustan Aeronautics Limited, Unique Identification Authority of India.\n\n“Data leaked sites include Indian Air Force, Maharashtra Election Commission and others,” the statement added. “In addition, more than 2,500 surveillance cameras have also been hacked.”\n\nDeputy Prime Minister Ishaq Dar spoke to Geo News around 7am and said that Pakistan was operating on the defensive and had no choice but to retaliate to India’s military actions.\n\n“The tamasha (circus) that India has done in the past three days, we will not let India claim hegemony. The Pakistan Armed Forces and government are determined that this will not happen.\n\n“This operation that we started today, it will all end in some way. It all depends on what India wants,” he said.\n\n“Pakistan had no choice, so our civil military leadership made the decision following the attack on Nur Khan Air Base. No more patience. We are just giving them a response.\n\n“We’ve exhibited a lot of patience so far. There is a threshold which we cannot go beyond, especially when it comes to hypocrisy and double standards,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1018553348fe2c9.png",
  "retrievedAt": "2025-08-23T08:22:32.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909993/pm-shehbaz-thanks-trumps-leadership-proactive-role-in-securing-full-immediate-ceasefire",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T04:23:18.000Z"
}
