{
  "title": "‘India’s irresponsible jingoism threatens one-fifth of the world’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• FO slams New Delhi’s war hysteria, says Pakistan still considers Indus treaty in force\n• Saudi minister arrives in Islamabad with message of concern, calls for de-escalation\n\nISLAMABAD: South Asia — home to nearly one-fifth of the world’s population — can ill-afford the irresponsible actions like the ones being carried out by India, Pakistan’s Foreign Office said on Friday.\n\nAt the weekly press briefing, FO spokesperson Shafqat Ali Khan said: “It is most unfortunate that India’s reckless conduct has brought the two nuclear-armed states closer to a major conflict.”\n\nHis remarks came ahead of a meeting between Saudi Minister of State for Foreign Affairs Adel Al-Jubeir and PM Shehbaz Sharif and other top state functionaries. The Saudi official had travelled to Pakistan on Friday after completing an official visit to India.\n\nAccording to the Prime Minister’s Office (PMO), Riyadh’s emissary “expressed heartfelt condolences over the loss of precious civilian lives”.\n\nHe said the kingdom was deeply concerned about the current situation in South Asia, and reiterated his country’s call for de-escalation, as well as peaceful resolution of all outstanding disputes between Pakistan and India, in accordance with international law and the UN Security Council’s relevant resolutions, the PMO said.\n\nWhile discussing the prevailing situation in South Asia, the PM strongly condemned India’s missile and drone strikes against Pakistan that had resulted in the martyrdom of scores of innocent civilians, including women and children, as well as damage to civilian infrastructures.\n\nHe stressed that India’s unprovoked and unjustified acts of aggression had violated Pakistan’s sovereignty and territorial integrity, and seriously endangered regional peace and stability.\n\nEarlier, Deputy Prime Minister Ishaq Dar received Adel Al-Jubeir at the Ministry of Foreign Affairs and exchanged views on the evolving regional situation.\n\nFO briefing\n\nEarlier, at the weekly briefing, the FO spokesperson said that in the wake of the Pahalgam attack, the Indian leadership has “once again used the bogey of terrorism to advance its sham narrative of victimhood, jeopardising regional peace.”\n\n“India’s jingoism and war hysteria should be a source of serious concern for the world,” he added.\n\nThe spokesperson reiterated that Pakistan rejected any attempt to link it to the attack in Pahalgam.\n\nHe noted that a number of countries and international organisations had called on both countries to exercise restraint over the past two weeks, and it was “highly deplorable that India did not pay heed to these calls”.\n\n“The international community should hold India accountable for its irresponsible, unlawful and belligerent conduct,” he said.\n\n“The assertion that Pakistan escalated the situation through the Pahalgam attack of April 22 is totally absurd. To date, India has not been able to produce any credible and verifiable evidence of Pakistan’s involvement in the attack.\n\n“To the contrary, the acts of aggression committed by its armed forces had the approval and support of its entire government,” he said. “Thus, it is India that has escalated the situation by violating Pakistan’s sovereignty and killing civilians.”\n\nHe said that “the Pakistani forces did not attack Pahalgam, but the Indian forces did attack multiple locations in Pakistan,” adding that Pakistan reserves the right to take all measures in its self-defence as enshrined in Article 51 of the UN Charter.\n\nThe spokesperson noted that on April 26, Prime Minister Shehbaz Sharif had called for a “neutral and transparent” investigation into the Pahalgam attack, yet “India chose the path of belligerence and aggression.”\n\nThe FO spokesperson also said Indian claims of targeting terrorists or terrorist infrastructure “are blatantly false [and] it is a matter of record that Indian strikes resulted in the martyrdom of civilians, including women and children.”\n\nMr Khan said “the current Indian dispensation is bent upon weaponising water; holding in abeyance of IWT is unilateral and illegal.\n\n“Pakistan is an agrarian economy. Millions of people are dependent on the water being regulated by the treaty. The Indian decision is equivalent to an attack on the people of Pakistan and the economy.\n\n“For Pakistan, the Indian announcement is of no legal consequence. The treaty remains enforced and fully binding on the parties,” he said.\n\nPublished in Dawn, May 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681e98c662043.jpg",
  "retrievedAt": "2025-08-23T08:22:29.368Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909891",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T00:49:17.000Z"
}
