{
  "title": "Development spending flat despite high revenues - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Friday conceded before the parliament that the development spending had flattened despite over 47 per cent increase in revenue growth, 37pc cut in subsidies and 170pc higher cash surpluses provided by four provinces.\n\nIn its mid-year budget review report to the parliament as required under section 34(1) of the Public Finance Management Act 2019, the Ministry of Finance (MoF) said the above consolidation helped contain fiscal deficit at 1.9pc of GDP in July-December 2024 against 2.5pc last year and put primary surplus — the gap between total revenue and total expenditure minus debt servicing — at a comfortable 2.3pc of GDP against 1.4pc surplus last year.\n\nThe report said the Public Sector Development Programme (PSDP) consumed Rs261bn in first six months of current year compared to Rs255bn a year ago. The four provinces provided Rs775bn cash surplus in the first half compared to Rs289bn last year.\n\nIt said that due to sound macroeconomic management, effective inflation control measures, and enhanced fiscal and external account stability, the first half witnessed positive developments in key macroeconomic indicators. CPI Inflation substantially declined to 7.2pc from 28.8pc last year. This allowed a shift in monetary policy direction and the benchmark interest rate was reduced by a cumulative 1,000 basis points to 12pc by January.\n\nPSDP releases stand at Rs261bn in 1HFY25 against Rs255bn in first six months of last year\n\nOn the external side, the current account posted a surplus of $1.2bn against the deficit of $1.4bn last year. The foreign direct investment (FDI) significantly improved, rising by 20pc, while remittances surged by an impressive 32.8pc. Foreign exchange reserves stood at $16.1bn as of December 20, 2024.\n\nOn the fiscal side, prudent fiscal management led to substantial increase in revenue collection. Net revenue receipts have improved by 47pc against corresponding period last year, with an increase of 82pc in non-tax revenue and 25.9pc in tax revenue, although significantly behind target.\n\nExpenditures of the federal government grew by 22.2pc to Rs8.2tr as against Rs6.71tr last year, primarily due to debt servicing which consumed 65pc of total current expenditure. Expenditure on running of civil government was at 40pc of the budget estimates. Similarly, defence expenditure also remained at 42pc of the FY25 budget allocation. The government did not extend any supplementary grants during the period and unforeseen requirements were addressed through re-appropriations and technical supplementary grants.\n\nDuring July-December 2024-25, non-tax revenue collection remained well above the budget target, with 74pc of the target achieved in the first half as 82pc increase was witnessed compared to corresponding period of last fiscal year, mainly because of a record Rs2.5tr profit from the State Bank of Pakistan (SBP) —almost 160pc higher than last year’s Rs972bn and Rs550bn in petroleum levy compared to last year Rs472bn.\n\nPublished in Dawn, May 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:03:44.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909927/development-spending-flat-despite-high-revenues",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T00:55:43.000Z"
}
