{
  "title": "Railways sells 1,360 condemned wagons to Karachi steels mills - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Railways (PR) has finally sold its 1,360 condemned goods wagons to Peoples Steel Mills Karachi—a state owned entity — under a government-to-government agreement.\n\nAfter finalisation of the deal, the mill has started cutting the wagons into pieces at the railways site, Marshalling Yard Pipri, Gaddar Pathak, spread over 18,000 acres near Karachi. The site is also commonly known as the railways rolling stock graveyard, Dawn has learnt.\n\n“It is the best deal ever finalised with the Peoples Steel Mills (Pakistan Steel Mills) in Karachi. The weight of each wagon is approximately 10 tonnes,” a senior official source in the railways told Dawn.\n\nAccording to him, before entering the agreement, the railways tried hard to sell such a huge rolling stock through open auction.\n\nBut the bidders, besides offering low rates, used to impose various conditions on the department such as delivering/shifting the condemned wagons at the bidders’ sites in pieces, weight of wagons after cutting etc. But this all was not acceptable to the railways.\n\n“We wanted to sell wagons on a ‘as is and where is’ basis, including weight of wagons without cutting. We also wanted that whosoever procures our rolling stock should shift the entire stock to the place on its own instead of pressing us to do that. Therefore, we found the Peoples Steel Mills’ offer suitable as it accepted all our conditions,” the official explained.\n\nTo a question, he said the firm first quoted the Rs113 per kg rate that was rejected by the PR. Later, the firm increased the rate suited to the railways.\n\nHe added that the money liable to be paid by the railways to the company in terms of supplies to the PR’s owned RAILCOP company and the future supply of parts, raw material etc would be adjusted.\n\n“We used to buy various parts such as spring steel, clips, kamani clampsetc from this steel mills. Likewise, we also buy some raw material that is used by railways to manufacture various parts at its workshops,” the official maintained.\n\nRailways Chief Executive Officer Amir Ali Baloch confirmed the development, revealing that the Peoples Steel Mill had started cutting wagons into pieces and lifting the material from the site.\n\n“The company has also started providing us with raw material for our own production of various parts at our workshops, factories etc,” he added.\n\nPublished in Dawn, May 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681ea168a2cca.gif",
  "retrievedAt": "2025-08-23T08:22:36.393Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909925/railways-sells-1360-condemned-wagons-to-karachi-steels-mills",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T00:51:35.000Z"
}
