{
  "title": "World community hails ceasefire decision between Pakistan and India - Pakistan - DAWN.COM",
  "author": null,
  "content": "The international community on Saturday welcomed the decision by Pakistan and India to enforce a “full and immediate ceasefire” following days of deadly jet fighter, missile, drone, and artillery strikes.\n\nThe escalation began following the April 22 attack in Indian-occupied Kashmir’s Pahalgam, which killed 26 people. India, without investigation or evidence, implied “cross-border linkages” of the att­a­­­c­kers. Pakistan has firmly rejected the claim and called for a neutral probe.\n\nFollowing the allegations, India launched a series of missile strikes on Pakistan, resulting in civilian casualties. According to the Inter-Services Public Relations (ISPR), 24 impacts were recorded across six locations, leaving 33 Pakistani civilians dead and 76 injured. In response, Pakistan’s military shot down five Indian jets and destroyed brigade headquarters and multiple checkposts along the Line of Control.\n\nOn Saturday morning, India targeted several Pakistani airbases, prompting a swift military response from Pakistan under the retaliatory campaign codenamed Operation Bunyan-um-Marsoos.\n\nIn a breakthrough moment today, the two countries agreed to a ceasefire pushed by US President Donald Trump, with global leaders hailing the move.\n\nUN Secretary-General Antonio Guterres welcomed the ceasefire announcement, calling it a “positive step that should lead to peace,” his spokesperson Stephane Dujarri quoted him as saying.\n\nGuterres “hopes the agreement will contribute to lasting peace and foster an environment conducive to addressing broader, longstanding issues between the two countries”, the spokesperson said in a statement.\n\nForeign Minister Ishaq Dar said Chinese Foreign Minister Wang Yi phoned him and acknowledged Pakistan’s restraint and appreciated its responsible approach under challenging circumstances.\n\nThe Chinese foreign minister reaffirmed that China, as Pakistan’s All-Weather Strategic Cooperative Partner and ironclad friend, will continue to stand firmly by Pakistan in upholding its sovereignty, territorial integrity, and national independence.\n\n“Both leaders emphasised the importance of close communication and agreed to maintain ongoing coordination in the days ahead,” the foreign office said in a post on X.\n\nTurkiye called on both countries to “make maximum use” of the cessation in hostilities to establish dialogue, according to a statement from the Turkish foreign ministry.\n\n“We welcome the declaration of a ceasefire between Pakistan and India. We call on the parties to make maximum use of the opportunity provided by the ceasefire to establish a direct and healthy dialogue,” the statement read.\n\nSaudi Arabia’s Minister of State for Foreign Affairs Adel Aljubeir also welcomed the ceasefire between the two countries, according to a post by the Foreign Office (FO) on X.\n\nUK Foreign Secretary David Lammy wrote on X, adding that de-escalation was in “everybody’s interest”.\n\n“Today’s ceasefire between India and Pakistan is hugely welcome. I urge both parties to sustain this. De-escalation is in everybody’s interest,” he wrote.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/10225726a7e7a69.jpg",
  "retrievedAt": "2025-08-23T08:22:27.504Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910113/world-community-hails-ceasefire-decision-between-pakistan-and-india",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T18:23:08.000Z"
}
