{
  "title": "India must rethink - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE April 22 Pahalgam incident has evoked a hysterical reaction from India, which has attacked Pakistani and Azad Kashmir cities killing innocent civilians, including children, and damaging the Neelum-Jhelum hydel works. Within five minutes of the Pahalgam attack, Indian media started pointing fingers at Pakistan alleging it had enabled the terrorist attack. Two weeks later, India attacked without providing a shred of evidence of Pakistan’s alleged involvement. The purpose of this article is to urge Indian policymakers to avoid prolonging their actions as the political, social and economic costs for their own country are substantial, and instead, examine their policy stance dispassionately.\n\nIndia ranks fifth among global economies and has an impressive record of rapid economic growth, which has lifted several hundred million out of poverty. It is one of the world’s leading exporters of IT and IT-enabled services, and aspires to become a developed economy by 2047, with the size of its economy projected to range between $23-35 trillion. This requires an uninterrupted and continuously upward moving growth curve. India is also working hard to become a permanent member of the UN Security Council and is among a group of developing countries leading the movement towards a multipolar world with the expanding role of BRICS.\n\nGiven this wide range of ambitions, any attempt to disrupt regional peace through kinetic or non-kinetic actions will derail it from its chosen path. Peaceful and cordial relations with neighbouring countries, on the other hand, would enhance the prospects of attaining these ambitions.\n\nThere have been past instances, such as in the 2001-02 stand-off, when Indian policymakers made sensible decisions and withdrew from the path of prolonged confrontation. The Indian troops were mobilised in large numbers in 2001-02 along the Pakistan border and as Zahid Hussain recently noted “there was an imminent threat of a full-fledged war between the two countries, but sanity prevailed. Not only was war prevented, but a more substantive peace process between India and Pakistan was also witnessed”.\n\nThe economic costs of military adventures, along with at least six other channels, can adversely affect the trajectory of India’s path towards prosperity and influence as a regional power. Elevated risk perception, trade routes and supply chain disruptions and uncertainty about the future would activate the channels highlighted below.\n\nAny attempt by India to disrupt regional peace will derail it from its chosen path.\n\nCost of military adventures: Foreign affairs forums on the economic impacts of a full-scale India-Pakistan war estimate the daily cost of mobilising operations could reach $670 million with broader economic losses potentially reaching $17.8 billion, which is equivalent to a 20 per cent GDP contraction over four weeks of conflict. According to Antonis Bhardwaj, a short-term conventional India-Pakistan war could cost between INR14.6bn and INR50bn a day in direct military expenses. A prolonged conflict, accounting for broader macroeconomic impacts could lead to economic losses exceeding $17.8bn daily.\n\nGlobal capability centres: 1,800 offshore corporate offices owned by hundreds of foreign-based MNCs operate in India; they generated earnings of $65bn in 2024. During the last few years, over 150 GCCs have provided back-office, legal, accounting, engineering, design, product development, consulting and architect services, and they act as R&D centres. Many other corporations are thinking of following suit. The principals of existing and planned centres may have second thoughts if political tensions or cross-border incursions continue from time to time.\n\nTourism: India receives 10m tourists every year recording a growth rate of 20pc, contributing $30bn in foreign exchange earnings. The tourist industry has a high multiplier effect on local economies and is a source of significant employment in hospitality, transport, entertainment, handicraft and many other ancillary services. Empirical evidence shows that there is a drop in tourist visits even if there is a semblance of disturbance or violence or threat in the host country. Thus this 20pc annual growth in tourism may be lost.\n\nFinancial markets: External capital flows, FDI, foreign portfolio investment, external commercial borrowings, nonresident Indian deposits and workers’ remittances have contributed to the build-up of large foreign exchange reserves and financed the large excess of capital flows over and above those required to finance the current account deficit. Foreign investors own about $800bn worth of Indian stocks — roughly 16pc of India’s market cap. Foreign funds are not insensitive to the larger political and economic ecosystem. Financial markets would experience capital flight. Moody’s analytics estimates that potential foreign investment outflows of $10-15bn would take place within the first month of conflict.\n\nDefence spending: India has allocated $78.7bn in the FY25 budget for defence. Many voices are pleading to further increase the allocations to modernise and upgrade equipment. An increased threat perception of incursions, war or skirmishes across the LOC or international borders may, in fact, result in larger budgetary allocations for defence. In a country where 800m people still receive subsidised food ration it would be unfortunate if the resources are diverted from welfare to military goods.\n\nForeign direct investment: India is one of the major recipients of FDI with a cumulative amount of $1.05tr. These flows have increased 20 times from FY01 to FY24 from $237m in 1990 to $71bn 2024. The RBI Bulletin has observed that India is poised to benefit from supply chain realignments, diversified FDI sources and engagement with global investors seeking resilience and scale, given its already established trade linkages. These linkages and realignments would be at risk of rupture if confidence in the economy falters as a result of worsening cross-border skirmishes.\n\nIndus Waters Treaty: The IWT’s unilateral abeyance is hardly justifiable on moral and legal grounds. Given the growing hazards of climate change the two countries along with China and Bangladesh should negotiate an arrangement where food security, water availability and the energy needs of the lower riparian countries are ensured. A potential humanitarian crisis — for which India would be blamed — should be avoided.\n\nMany neutral observers have opined that given Pakistan’s struggle to put the economy on track, its fight against TTP and BLA terrorism and its banning of the Lashkar-i-Taiba and other extremist groups and prosecution of their leaders, it is highly implausible that it would indulge in proxy wars.\n\nThe writer is the author of Development Pathways: India, Pakistan and Bangladesh 1947-2022.\n\nPublished in Dawn, May 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681eabe64ebd0.jpg",
  "retrievedAt": "2025-08-23T08:22:32.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909971/india-must-rethink",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T01:31:03.000Z"
}
