{
  "title": "Why Modi keeps pushing India to the brink of war with Pakistan - Prism - DAWN.COM",
  "author": null,
  "content": "Around two months before his latest derangement, India’s Narendra Modi paid tribute to his RSS inspiration, Veer Savarkar. As the founding father of Hindutva, Savarkar’s ideas have long informed Modi’s actions.\n\nAnd those ideas are pretty basic. “India should follow the German example to solve the Muslim problem,” Savarkar said in 1938, “…Germany has every right to resort to Nazism and Italy to fascism — and events have justified those -isms.”\n\nGiven such events reduced Europe to the bloodlands of World War II, Modi now wishes the same for South Asia: Pakistan and India have been closest to war in half a century; fighter jets tango overhead; and a new generation wakes up to the sirens their grandparents once had to.\n\nBut we’re here now, and it mostly has to do with Delhi’s own neuroses: the rabid base, the status anxiety, and an occupation that refuses to resolve itself. Modi’s annexation drive in Kashmir was demographic change 101; the “Muslim problem”, to quote Savarkar, would be resolved, even if India had to shred its own supreme law to do it.\n\nBut no one asked Kashmir’s sons and daughters. The Pahalgam attack wasn’t a cause; it was a reply — one that came on the heels of mass murder and repression.\n\nEven here, however, Pakistan’s response was to condemn it, call for a neutral probe, and talk up peace. India’s response was to try and choke the water supply to an entire civilian population, fire missiles at a three-year-old girl, and name its operation after the hair choices of married Hindu women.\n\nBecause Modi takes the same policy decision each time there’s a Kashmir crisis: to externalise it to Pakistan, and then scream revenge. For Uri in 2016, for Pulwama in 2019, for Pahalgam today. The evidence provided — for an accusation that could lead to nuclear war and the end of the world: none yet.\n\nInstead, the prime minister has again rushed to the border on fumes: at the close of India’s saffron decade, Modi has fed off his manic base, and his base has fed off him — peace is political suicide. Every election demands a war, and every corpse is campaign fodder.\n\nMore the pity for his Western allies, long banking on India as the region’s net security provider. But while the ’20s may vary from century to century, a Nazi is still a Nazi.\n\nAnd no Nazi ever stopped his ingress without a punch to the face: courtesy the excellent Pakistan Air Force doing its job, and only its job (other services take a hint), five planes were shot out of the sky in the middle of their bombing run. CNN, Reuters, and French intelligence would also confirm the first-ever demise of a prize Rafale, India’s shiny new toy.\n\nHence, also, the second problem: in the same way that Modi’s revenge in 2019 climaxed with wing commander Abhinandan getting checked for microchips on his return from Wagah, the 2025 remix saw Pakistani pilots use Chinese tech to down million-dollar death machines. As Western defence contractors looked on aghast, the global war economy changed overnight.\n\nOf course, much of this is the world the West has made for us: amid the rivers of blood in Gaza, amid the collapse of the post-1945 world order, amid free reign to genocidairres in Tel Aviv and to brutes in Moscow. Asked about the Pak-India conflict, vice president JD Vance shrugged, “None of our business”.\n\nSo be it: Pakistan would have to stand up to bullies on its own. Now it has — Modi’s war kicked off with the IAF losing five warplanes, all to self-defence. Before Pakistan could even mention retaliating, Operation Sindoor had become Operation Duckshoot.\n\nNone of this was meant to happen: the lotus boys have been trying for escalation for some time now — a goofy theory they’ve borrowed from fellow dimestore Nazis in Israel. Borders, balance, proportion, none of it means anything. All international law is to be discarded, while targets are to be inflicted with shock-and-awe violence.\n\nJust that it hasn’t worked there, and it especially isn’t working here. As one US defence czar put it, “Anyone who thinks they can control escalation through the use of nuclear weapons is literally playing with fire.”\n\nBut the lesson of Modi’s entire public life has been that playing with fire benefits his politics — from the inferno of Gujarat in 2002 to Muslim massacres in Delhi in 2020. Where this throughline stops is Pakistan: at the Muslims that got away, and learned to shoot back.\n\nRepelled at the outset, Delhi has tried sating its far-right hordes in other ways. It switched to suicide drones swarming Pakistan’s cities. It tried to change the subject online, by unleashing its IT zombies. (The usual Hindutva triple feature followed: fake news, rape threats, and pornography.)\n\nYet headlines across the world carried on: this jet, that jet, Dassault stocks versus Chengdu’s. Even The Economist, an otherwise reliable Pakistan-basher, pointed to the conflict’s core cause: “India needs to end its self-defeating repression of the part of Kashmir it controls.”\n\nIndia’s legacy media didn’t fare much better. After destroying Karachi port — if entirely on the Internet — war hawk Barkha Dutt took cover in a blacked out hotel, where she told us the “moonless night did not even allow for a sliver of light” — nor, perhaps, a sliver of integrity. By the time morning broke, the only thing India had managed to end was Fawad Khan’s Instagram.\n\nIf there was a story in all this, it was, as always, Pakistanis themselves. Facing neo-fascists next door and indifference abroad, they responded with memes and jokes. When force was called for, they mostly urged it in defensive terms. They called out their own state for its censorship, for its unrepresentativeness, for its tone-deaf ministers, yet rallied behind the white and green. They mourned seven-year-old Irtiza Abbas Turi, while refusing to mirror Hindutva’s poisonous demonisation of children. And they refused to part with their humanity, wishing for peace from start to end.\n\nThey still do.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/10015607963abe0.gif",
  "retrievedAt": "2025-08-23T08:22:46.503Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909740/why-modi-keeps-pushing-india-to-the-brink-of-war-with-pakistan",
  "dateList": "2025-05-10",
  "date_published": "2025-05-09T23:28:52.000Z"
}
