{
  "title": "Justice Ayesha Malik piqued by failure to upload dissenting order - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Writes to CJP, faults IT dept for not publishing verdict on SC’s website\n• Says ECP acted like contesting party against PTI in reserved seats case\n\nISLAMABAD: The ongoing rift within the Supreme Court deepened on Friday as Justice Ayesha A. Malik formally complained to Chief Justice of Pakistan (CJP) Yahya Afridi about the non-publication of her dissenting order in the reserved seats case.\n\nJustice Malik, along with Justice Aqeel Ahmed Abbasi, had earlier dismissed a set of review petitions filed by the PML-N, PPP and the Election Commission of Pakistan (ECP). They stated that written reasons would be released shortly. However, while the orders were issued on Thursday, they were not uploaded to the Supreme Court’s website.\n\nIn a single-page complaint to the CJP, Justice Malik expressed concern that her dissenting order, issued at 3:11pm on Thursday, had not been uploaded until Friday morning despite repeated instructions to the Supreme Court’s IT department.\n\nJustice Malik said she had been informed that the department was unable to do so. “This lack of compliance by the IT Department is unacceptable,” she said. “I, therefore, formally request that the order be uploaded on the Supreme Court’s website immediately without any further delay.”\n\nShe also enclosed the copy of her order and forwarded the copies of the letter to all judges of the Supreme Court along with the copy of the order by Justice Aqeel Ahmed Abbasi to bring to their attention this dereliction of duty on the part of the IT Department, on a matter that should and was ordinarily attended to in a routine manner.\n\nShe described the delay as a failure in a routine task that had become “a matter of unexplained difficulties”.\n\nJudgement\n\nMeanwhile, in her dissenting judgement, Justice Malik while rejecting the review petitions observed that the ECP and other petitioners could not reargue the case under the review jurisdiction.\n\nWhat is more alarming is the fact that the ECP has failed to implement the July 12 judgement in the reserved seats case. This option is not available to the ECP, which is legally and constitutionally bound to implement the judgement and by the interpretation given to the Constitution by the Supreme Court in the reserved seats case.\n\nCompliance with the detailed judgement is not a matter of discretion but of constitutional fidelity, Justice Malik emphasised, adding that in a democracy, judgements that seek to safeguard electoral fairness, political representation and institutional accountability must be given full effect.\n\n“To disregard such a decision would not only undermine the authority of the Supreme Court but also erode the foundational values of democracy itself,” the judgement said. She cited the Adil Khan Bazai case in which the order observed that the ECP demonstrated a leaning in favour of a political party and the government, which totally negates its constitutional duty.\n\n“The independence of the ECP is fundamental to the election process, which is the very foundation of democracy, and the ECP should not become subservient to political influences; rather, it must remain an impartial custodian of democracy,” Justice Malik emphasised.\n\nShe also criticised the ECP for acting like a contesting party against the Sunni Ittehad Council and PTI in the reserved seats case, observing that its role in filing the review petition reflected political motives.\n\nJustice Malik also questioned the formation of the current 11-member Constitutional Bench, noting that five of the original 13 judges, including herself, were not reappointed to hear the review petitions.\n\nShe highlighted concerns over the implementation of Article 191A, introduced via the 26th Constitutional Amend­ment, which requires the Judicial Commission of Pakistan (JCP) to nominate judges for constitutional benches.\n\nShe noted that the amendment also restructured Article 175A, effectively giving political parties greater influence in the JCP’s composition. The independence of the judiciary must be safeguarded, and JCP members must act with fairness and transparency, she stressed.\n\nThe dissenting judgement argued that the bench hearing the review petitions should include all available members of the original majority, including its author, to maintain legitimacy and public confidence in the judicial process.\n\n“In our opinion, the committee should have requisitioned JCP for nominations of these judges for the purposes of the review petitions because the function of this committee is not merely procedural or ministerial, rather it carries substantive constitutional weight,” the order emphasised.\n\n“The legitimacy of a bench lies not only in the process of nomination, but equally in the manner of its constitution.”\n\nPublished in Dawn, May 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:22:31.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909890/justice-malik-piqued-by-failure-to-upload-dissenting-order",
  "dateList": "2025-05-10",
  "date_published": "2025-05-10T00:49:17.000Z"
}
