{
  "title": "Ambassador of Vietnam wishes for continuing friendship, cooperation with Pakistan",
  "link": "https://www.app.com.pk/national/ambassador-of-vietnam-wishes-for-continuing-friendship-cooperation-with-pakistan/",
  "date_published": "2024-08-31T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):The Ambassador of Vietnam to Pakistan, Pham Anh Tuan, during the celebration of the 79th anniversary of Viet Nam National Day, wished for the friendship and cooperation between Viet Nam and Pakistan with a continuation to flourish it in the future.\nOn September 2nd, 1945, President Ho Chi Minh, the great leader of Viet Nam, read out the immortal Declaration of Independence, giving birth to a new Viet Nam – the Democratic Republic of Viet Nam, which is now the Socialist Republic of Viet Nam, he said.\nThe Ambassador of Vietnam to Pakistan, Pham Anh Tuan expressed these views while addressing 79th anniversary of Viet Nam National Day here in Vietnam embassy.\nHe said at that very moment, Vietnam was named on the world map and the country has entered a new era – the era of national independence, the era the Vietnamese people became the real masters of their country, society and their own destinies.\nThe envoy said that over the past 79 years, the people of Vietnam have devoted their lives, efforts and wisdom towards national independence, freedom and happiness for all the people of Vietnam.\nOn this occasion, “I believe that the potential of development between Vietnam and Pakistan remains high, and the Embassy of Vietnam in Pakistan will continue to work closely with Pakistani friends to expand this relationship,” he said.\nIt has now been 52 years since the day Vietnam and Pakistan established the diplomatic relation.\nThe Ambassador said that over the past 52 years, the friendship and cooperation between the two countries has been developed in multi-faceted factors such as politics, economic cooperation, trading relations. We also share a common interest in developing our countries and integrating into the regions and the world for the benefit of our people.\nNowadays, bilateral trade relations between the two countries emerges as one of the most outstanding fields of the cooperation and the two-way trade volume between Viet Nam and Pakistan reached $ 705 million in 2023 and within the first six months of 2024, this volume is approximately 402 million, an increase of 28% compared to the same period last year.\nIt is expected to reach $ 900 million in 2024.\nHe said that beside this, the number of delegation exchanges for business and visits has been increasing year by year and the two countries have signed a number of treaties and agreements, which create legal framework for further promoting the cooperation for mutual interest.\n“Our cooperative mechanism includes the Joint Intergovernmental Committee, Trade Commission, and Bilateral Political Consultation between the two Ministries of Foreign Affairs. In order to raise the trading relation, I suggest the two sides may coordinate to hold the activities of promotion of trade and investment such as trade fairs, exhibition, forum, exploration.”\n“We welcome and will do the utmost to create favorable conditions for all businessmen of Pakistan doing business with Vietnam, especially in the fields of cotton, production of pharmaceutical, surgical instruments and information technology which are the strengths of Pakistan,” he said.\nThe Vietnam has strengths in exporting tea, rubber, pepper, dry nuts, textile products, chemical that the Pakistan may be interested in.\nThe Ambassador said that in trade and investment, Vietnam has cooperation with 220 countries and territories and Vietnam is an active member of nearly 70 international and regional organizations such as the UN, WTO, ASEAN, APEC just to mention a few. Vietnam has been proactively integrating itself into the global economy and at the same time expanding international cooperation in many areas.\nIn 2023, Vietnam’s GDP was $ 430 billion, GDP growth rate increased 5.8 %; Income per Capital gained 4300 USD and in the Agricultural Industry, Vietnam has become the largest exporter of pepper and cashew nut in the world, and the second largest exporter of rice with more than 7.1 million tons of rice valued at about $4 billion.\nThe Ambassador said that Vietnam is known as a developing economy, a country with stable political environment, colorful culture, and friendly people. We would like to be friends with all countries and peoples who love peace, freedom and friendship. We seek to resolve disputes between countries by negotiation and by international law.\nHe said that from a once impoverished and backward country, Vietnam has risen out of socio-economic crisis to become a middle-income developing one.\nThe lives of the people have improved greatly, its socio-political situation has stabilized; its independence, sovereignty, unity and territorial integrity have been maintained; its external relations have been expanded and Vietnam’s prestige and position have been enhanced in the international arena, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:10:45.052Z"
}
