{
  "title": "Indian-origin fake CIA agent Gaurav Srivastava under fire on defrauding Congressmen, traders",
  "link": "https://www.app.com.pk/national/indian-origin-fake-cia-agent-gaurav-srivastava-under-fire-on-defrauding-congressmen-traders/",
  "date_published": "2024-08-31T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The Federal Bureau of Investigation (FBI) agents in Los Angeles are investigating a fake spy Gaurav Srivastava, who is facing criminal allegations of wire fraud, money laundering, and falsely representing himself as a US federal official and US citizen, the Wall Street Journal (WSJ) has revealed.\nIn a comprehensive investigation, senior WSJ reporter Joe Wallace wrote in its sensational article “A Fake Spy, Russian Oil and $1 Million Funneled to Democrats” that Gaurav Srivastava, an Indian businessman now infamous for his ‘fake CIA agent’ scam, is under scrutiny for hijacking the US system and posing a threat to the US national security through his fraudulent activity undertaken over several years.\nInformed by legal documents, financial records, interviews and recordings, the WSJ’s story paints a picture of a college dropout who blagged his way into the upper echelons of Washington’s political scene through a combination of bare-faced lies and stolen money.\nSrivastava, who met President Joe Biden and allegedly donated more than $1 million to the Democrats, all while claiming to be a clandestine operative of the CIA, is increasingly viewed as a national security threat in the US. Moreover, a political storm is brewing on Capitol Hill as Republicans and others seek to understand how a green-card holder, born in Lucknow, India, can buy unchecked access into the highest echelons of the Democratic Party.\nThose conned by Srivastava – or ‘Mr G’, as he liked to be known – include General Wesley Clark, the former Supreme Allied Commander of NATO; the Atlantic Council thinktank; several Democratic fundraising committees; multiple Senators and Congressmen, including Senator Mark Warner and Representative Patrick Ryan; a Geneva-based commodities trader; several African leaders; and the President of Indonesia. Many of these individuals stepped away from Srivastava of their own accord after questioning his integrity, while others dropped him after the exposé on him.\nThe scam was originally reported in October 2023 by former Pulitzer Prize-winning journalist Bradley Hope in his investigative outlet, Project Brazen. Srivastava has repeatedly attempted to have all reporting of his activities removed from the public domain, including through a deceitful lawsuit against several publications in Pakistan and India and through fraudulently-made attempts to have articles de-listed from Google under US copyright laws.  This involved pasting the article’s text into a blog post on hosting sites Tumblr or Medium and then back-dating the posts, making them appear to have been published earlier than the original article that exposed the Indian conman. Srivastava then used aliases or fake names to file a copyright complaint to Google to de-index the articles.\nThe WSJ reported how Srivastava sought to build a business that could profit from the close connections between commodities, intelligence and security. Targeting developing countries and war zones, largely in Africa, on the one hand, Srivastava approached leaders and powerful intermediaries claiming to be a non-official cover (NOC) operative of the CIA who could support the development of their links to the US Government. Surrounding himself with powerful figures, including General Clark – who was in fact a paid-for consultant – the WSJ described how Srivastava built a picture of legitimacy that fooled leaders from Libya, where he had dealings with Russia-backed General Haftar, to Sudan, where he worked for General Mohammed Hamdan Dagalo – known as Hemedti – who is now facing allegations of war crimes.\nAt the same time as he was claiming to be a CIA agent in Africa, Srivastava was presenting himself in Washington DC as a well-connected American citizen who “hinted at some kind of relationship with the US Government” that could not be disclosed, according to Gen. Clark speaking to the WSJ. Political donations helped open doors, and a major donation of $1 million to the Atlantic Council for a food security event in fall 2023 lent him legitimacy. On 2nd March 2024, Politico revealed that the Atlantic Council has confirmed it has terminated its relationship with Gaurav Srivastava, his wife Sharon and their fake charitable organisation “The Gaurav & Sharon Srivastava Family Foundation” after the think tank found that Srivastavas had lied to the council to secure their partnership.\nThe scam began to unravel after Niels Troost, a trader that Srivastava was attempting to scam, grew suspicious. Troost found a trail of fraud allegations against him in the US and India, where his family business, the New Delhi-based Veecon Group, has a string of failed deals in the entertainment and security sectors.\nSrivastava had been introduced to Troost in early 2022 by a mutual business associate as someone who could help Troost to counter threats from another business counterpart. The introducer vouched for Mr G’s CIA credentials, according to Troost and an affidavit, and Srivastava set to work trying to gain Troost’s confidence.\nIn time and after appearing to resolve Troost’s initial issue, Srivastava claimed that he could get Troost permission from the US Government to trade Russian oil “as part of a CIA-approved program”, according to the WSJ. This would supposedly allow Washington to keep track of oil flows out of Russia, while at the same time providing a vehicle for Srivastava to sell commodities he received for his alleged CIA-backed security work in Africa.\nAfter an apparent “interrogation” of Troost in Geneva by a French financier, Nicolas Bravard, who Srivastava allegedly said was a “friend of the FBI”, Mr G then inducted Troost into his claimed “program” in Bali, confiding that he “was with the CIA”, according to Troost speaking to the WSJ.\nClaiming to act with the direct support of CIA Director William ‘Bill’ Burns, Srivastava persuaded Troost to part with 50% of his company and, with the help of US law firm Baker Hostetler, a sale was agreed in July 2023. The WSJ reported how Srivastava claimed not to be able to own the shares directly – “because Russia and other countries wouldn’t do business with a US agent” – so Bravard would act as his proxy.\nThe WSJ article described how in the subsequent months Srivastava drew money out of Troost’s company, Paramount Energy & Commodities, and used it to fund political donations in the US, the establishment of a new office, and even the purchase of a $24.5 million villa in the exclusive Los Angeles neighbourhood of Pacific Palisades. The nature of this purchase – where an Indonesian company was apparently persuaded under false pretences into providing funds to Srivastava – appears to be central to the wire fraud claims against Srivastava.\nAs suspicions grew at Paramount about Srivastava’s claims, the funds dried up. At this point in early 2023, Srivastava appeared to grow desperate, according to the WSJ. Citing recordings of phone calls, emails and messages, Srivastava and his associates pressured Troost to transfer ownership of Paramount to the US as soon as possible, with Srivastava making increasingly outrageous claims to try to win Troost’s trust. The desperate assertions reportedly included statements that he was “one of 30 such top-secret agents working for the US” alongside fabled financier Warren Buffett who “ran the CIA’s pension plan”. Buffett denied any connection to Srivastava and the CIA.\nSo important was his ‘program’, Mr G claimed, that CIA Director William Burns “yelled at him” to get the transfer done. According to another recording reported in the WSJ, Srivastava then betrayed his intellectual shortcomings by saying that Burns could act however he liked: “It is in the United States government charter which was written in the Declaration of Independence. It’s there. He can do whatever he wants. It’s part of our Constitution.” Ironically, Srivastava’s lawyers admit that, despite the recording, their client never had a call with William Burns and said the claim “is a fabrication” – although they decline to say who fabricated the story.\nSoon after this, in May 2023 Troost rescinded all agreements with Srivastava and his proxies on account of this deception. All those who have dealt with Srivastava appear to have cut ties with him while raising serious issues about his integrity. The only exceptions to this appear to be a former CIA officer, John Maguire, who was previously involved in another con attempt in the US, and Mr G’s law firm, Orrick Herrington & Sutcliffe, whose partner Charles Adams, a former US Ambassador to Finland and major fundraiser for the Democratic Party, called questions from the WSJ “bullshit” and told one of the world’s most authoritative and respected publications “we won’t acknowledge your existence.”\nRecently, two separate cases were lodged against Gaurav and his wife Sharon Srivastava in California for fraud and fraudulent misrepresentations, amongst other causes of action. Similarly, a former landlord of the couple, the former head of ABC Entertainment, Stephen McPherson, filed a lawsuit against Srivastava after the Indian businessman refused to move out of his $12 million Santa Monica home following the expiry of the six-month lease. Referring to Srivastava as a “fat, schlubby, disgruntled guy”, McPherson claimed that Srivastava lied to police about his missing furniture and wine collection and failed to pay an additional five months’ rent.\nWriting in the WSJ, Wallace wrote: “Srivastava’s story—part Austin Powers, part James Bond—shows the ease with which someone with money and moxie can access Washington’s most influential people.”\nTroost told the Journal he feels “burned but takes solace in believing he wasn’t alone. ‘It wasn’t just me. The entire political system fell for his story,’ he added”.\nDespite the array of allegations and evidence of criminal activity against him, Srivastava and his lawyers deny all claims against him.",
  "retrievedAt": "2025-08-11T05:10:26.663Z"
}
