{
  "title": "ED Bangkok Chamber of Commerce called on Governor KP, discusses Gandhara civilization heritage",
  "link": "https://www.app.com.pk/national/ed-bangkok-chamber-of-commerce-called-on-governor-kp-discusses-gandhara-civilization-heritage/",
  "date_published": "2024-08-31T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Executive Director of the Bangkok Chamber of Commerce, Pakistani-born Sohail Kauser on Saturday called on Governor Khyber Pakhtunkhwa (KP), Faisal Karim Kundi and discussed the exchange of delegations to enhance cultural and commercial ties between Pakistan and Thailand.\nDuring the meeting, the governor provided a detailed briefing about the significant Gandhara civilization heritage present in Khyber Pakhtunkhwa. He emphasized that this civilization is not only an important part of Pakistani but also a global cultural heritage.\nGovernor Kundi highlighted that Peshawar, Swat, and Dera Ismail Khan in KP, are among the centres of the country’s ancient civilizations. He stressed the importance of promoting religious tourism in the province to showcase its vibrant heritage to the world and said that it is a key priority for him.\nThe discussion also covered the province’s ancient cultural heritage and historical sites, with a particular focus on the remnants of the Gandhara civilization associated with Buddhism.\nGovernor Kundi pointed out that KP has numerous sites of significant religious importance for Buddhists.\nBoth parties discussed the exchange of delegations between the two countries, especially at the provincial level, to enhance cultural and commercial ties between Pakistan and Thailand.\nThe governor proposed that religious leaders from Thailand visit Peshawar to explore Buddhist historical sites and Gandhara relics, and that businessmen also visit for potential investments.\nSohail Kauser agreed with the governor’s points and praised his insights, stating that such measures would strengthen relations between the two countries and promote cultural ties. He emphasized that there is substantial interest among the Thai public in Khyber Pakhtunkhwa’s cultural heritage and that such exchanges could boost tourism between the two nations.\nThis meeting is seen as a significant step towards reinforcing cooperation and cultural connections. Kauser also extended an invitation to Governor Kundi to visit Thailand.",
  "retrievedAt": "2025-08-11T05:10:25.111Z"
}
