{
  "title": "President pays tribute to Syed Ali Shah Geelani on his 3rd death anniversary",
  "link": "https://www.app.com.pk/national/president-pays-tribute-to-syed-ali-shah-geelani-on-his-3rd-death-anniversary/",
  "date_published": "2024-08-31T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):President Asif Ali Zardari on Saturday paid tribute to heroic struggle of iconic Kashmiri leader Syed Ali Shah Geelani for the rights of the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) on his third death anniversary.\nIn a message, the president pointed out that Syed Ali Geelani was a beacon of hope and resistance, inspiring countless Kashmiris to stand firm in their quest for self-determination. “His tireless efforts and sacrifices for the just cause of the Kashmiri people will forever be etched in our hearts and minds.”\nHe said Syed Ali Shah Geelani was a great leader and his commitment to the right to self-determination for the people of Jammu and Kashmir was unyielding.\nDespite being subjected to house arrests and incarcerations by the Indian Occupation Forces, the president said that he continued to raise his voice for the people of IIOJK. “His personal hardships, including years of confinement, could not break his spirit or deter him from his mission.”\nPresident Zardari added that “Geelani Sahib remained focused on the ultimate goal, and never allowed the attention of the Kashmiri people to be diverted from the pursuit of their fundamental right to self-determination. The legacy of Syed Ali Shah Geelani is a powerful driving force that continues to inspire the people of IIOJK. His leadership and unwavering stance against oppression have left a lasting impression on the people of IIOJK”.\n“Today, we reaffirm the resolve to not let the sacrifices of Syed Ali Shah Geelani and countless others go in vain. We will continue to advocate for the realization of the people of IIOJK’s right to self-determination as enshrined in the relevant United Nations Security Council resolutions. I assure my Kashmiri brothers and sisters that Pakistan will continue to provide moral, diplomatic, and political support for their just cause,” the president added.\n“As we remember Syed Ali Shah Geelani, we must learn from his exemplary courage and unwavering commitment to freedom and justice. May Allah Almighty shower His blessings on Syed Ali Shah Geelani. Ameen!”, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:10:44.089Z"
}
