{
  "title": "UNGA adopts Pakistan-backed Moroccan resolution condemning attacks against religious symbols, holy books",
  "link": "https://www.app.com.pk/national/unga-adopts-pakistan-backed-moroccan-resolution-condemning-attacks-against-religious-symbols-holy-books-2/",
  "date_published": "2023-07-28T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP): The UN General Assembly Tuesday adopted, by consensus,  a Moroccan resolution, co-sponsored by Pakistan,  calling for countering hate speech, and strongly deploring attacks against places of worship, religious symbols, and holy books.\nThe resolution, entitled: ‘Promoting interreligious and intercultural dialogue and tolerance in countering hate speech’,  won the approval of the 193-member Assembly amid growing acts of desecration of the holy Quran.\nDiplomats said that Pakistan led the efforts, along with Malaysia and Egypt, to work toward the resolution of the language aimed at upholding the sanctity of religious sites, symbols, and holy books.\nThe paragraph reads: “Strongly deploring all acts of violence against persons on the basis of their religion or belief, as well as any such acts directed against their religious symbols, holy books, homes, businesses, properties, schools, cultural centers or places of worship, as well as all attacks on and in religious places, sites and shrines in violation of international law,”\nSpain submitted an amendment asking for the last words of that paragraph  “in violation of international law” to be deleted.\nSpeaking on behalf of the European Union, the Spanish delegate emphasized that although such actions are deeply offensive and disrespectful, they do not constitute a violation of international law, and thus proposed the elimination of the reference to “in violation of international law”.\nBut the amendment to change the phrasing was defeated. It secured only 44 votes in favour,  with 62 voting against. There were  24 abstentions.\nUnder the terms of the resolution, the General Assembly urged member states to engage with all relevant stakeholders to promote interreligious and intercultural dialogue and respect and acceptance of differences, among other things, to reject the spread of hate speech that constitutes incitement to discrimination, hostility, and violence.\nIt further called on Member States and social media companies to counter hate speech and address its increasing spread, enable research into measures to reduce it, and promote users’ access to effective reporting channels.\nThe Assembly also voiced deep concern over the rise in instances of discrimination, intolerance, and violence,\nregardless of the actors, including cases motivated by Islamophobia, on a proposal put forward by Pakistan,\nand backed by Egypt, Jordan, and Saudi Arabia, according to the diplomats.\nPakistan’s delegate, Bilal Chaudhry, expressing his “profound satisfaction” over the adoption of the resolution, said the text resonated with the resolution on religious hatred, presented by Pakistan on behalf of the Organization of Islamic Cooperation, recently adopted at the Human Rights Council in Geneva.\nThat landmark resolution condemned “all advocacy and manifestations of religious hatred, including recent public and premeditated acts that have desecrated the Quran” and called for countries to adopt laws enabling them to bring to justice those responsible for such acts, he pointed out.\n“Islamophobia is on the rise, with the repeated incidents of desecration of the Holy Quran. These acts are not just a provocation to the feelings of more than two billion Muslims in the world, but a step to sabotage interfaith harmony and peace,” the Pakistani delegate added.\n“Such incidents are also a manifestation of racial hatred and xenophobia, and absence of preventive legal deterrence, inaction, and shying away from speaking out encourages further incitement to hatred and violence,” Chaudhry said.\n“The text does not seek to curtail the right to free speech, but tries to underline the special duties and responsibilities of the international community to safeguard interfaith peace and harmony,” he concluded.",
  "retrievedAt": "2025-08-11T09:00:46.937Z"
}
