{
  "title": "Disasters loom over South Asia as hotter monsoon forecast - World - DAWN.COM",
  "author": null,
  "content": "KATHMANDU: Communities across Asia’s Himalayan Hindukush region face heightened disaster risks this monsoon season with temperatures and rainfall expected to exceed normal levels, experts warned on Thursday.\n\nTemperatures are expected to be up to two degrees Celsius hotter than average across the region, with forecasts for above-average rains, according to a monsoon outlook released by Kathmandu-based International Centre for Integrated Mountain Development on Wednesday.\n\n“Rising temperatures and more extreme rain raise the risk of water-induced disasters such as floods, landslides, and debris flows, and have longer-term impacts on glaciers, snow reserves, and permafrost,” Arun Bhakta Shrestha, a senior adviser at ICIMOD, said.\n\nThe summer monsoon, which brings South Asia 70-80 percent of its annual rainfall, is vital for agriculture and therefore for the livelihoods of millions of farmers and for food security in a region that is home to around two billion people.\n\nExtreme heat causes more deaths than floods and hurricanes, says report\n\nHowever, it also brings destruction through landslides and floods every year. Melting glaciers add to the volume of water, while unregulated construction in flood-prone areas exacerbates the damage.\n\n“What we have seen over the years are also cascading disasters where, for example, heavy rainfall can lead to landslides, and landslides can actually block rivers. We need to be aware about such possibilities,” Saswata Sanyal, manager of ICIMOD’s Disaster Risk Reduction work, said.\n\nLast year’s monsoon season brought devastating landslides and floods across South Asia and killed hundreds of people, including more than 300 in Nepal.\n\nThis year, Nepal has set up a monsoon response command post, led by its National Disaster Risk Reduction and Management Authority.\n\n“We are coordinating to stay prepared and to share data and alerts up to the local level for early response. Our security forces are on standby for rescue efforts,” said agency spokesman.\n\nWeather-related disasters are common during the monsoon season from June to September but experts say climate change, coupled with urbanisation, is increasing their frequency and severity.\n\nThe UN’s World Meteorological Organisation said last year that increasingly intense floods and droughts are a “distress signal” of what is to come as climate change makes the planet’s water cycle ever more unpredictable.\n\nHeat kills more people\n\nThe deadly effects of extreme heat are a growing risk to people, reinsurance giant Swiss Re said on Thursday, adding that heat killed more people than earthquakes, floods and hurricanes combined.\n\n“Up to half a million people globally succumb to the effects of extreme heat each year,” it said in its annual SONAR report on risks to the global economy and the insurance industry.\n\n“Heat-related risks extend to wildfires, healthcare systems, infrastructure and agriculture,” it added, noting that the World Meteorological Organisation had reported that 2024 was the hottest year on record.\n\n“There is clear evidence that extreme heat events are happening with greater severity, frequency and duration,” the company said in a statement announcing its report.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684b62838a87d.gif",
  "retrievedAt": "2025-08-20T03:55:41.703Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916820/disasters-loom-over-south-asia-as-hotter-monsoon-forecast",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:34:11.000Z"
}
