{
  "title": "Two brothers among four gunned down in Shikarpur tribal feud - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Three members of the Sundrani community, along with their driver, were gunned down in an attack on their car near Shadi Khan village in Shikarpur district on Thursday.\n\nThe bereaved family has claimed that the assailants belong to the Brohi tribe with whom they have an old enmity. Our men were waylaid while they were returning from a court after attending the hearing of the dispute-related case, the family added.\n\nOfficials at the Karan police station and locals said that unknown assailants riding several motorcycles fired a volley of shots on the car carrying the four men. Noor Mohammad and Nizam Ahmed, sons of Lal Mohammad Sundrani, and Adam Fatah Mohammad Sundrani along with their driver Rasool Bakhsh Marfani, died on the spot, they said.\n\nFresh killings mark resurgence of hostility which had claimed six lives until Sept 2024 settlement, arranged by a Jirga\n\nThe armed men attacked the car as soon as it reached near Achhi Masjid, next to the Garhi Yasin Toll Plaza, not away from their Shadi Khan village, along the Shikarpur-Larkana section of the Indus Highway, according to locals.\n\nThe assailants sped away without being intercepted by police or local people.\n\nThe bodies were transported to the Shikarpur RBUT Civil Hospital by police for a postmortem examination and then handed over to the heirs, the police said.\n\nSoon after the incident, a strong police contingent was sent to the site and the area was cordoned off. A police team was chasing the culprits into the nearby villages when last reports came in at about midnight.\n\nExpressing their shock and anger over the incident, a number of Sundrani community members led by relatives of the victims took the bodies to the nearby section of the highway to hold a protest.\n\nRaising slogans against police and demanding justice, they placed the bodies in the middle of the road causing suspension of vehicular traffic for quite some time.\n\nThey demanded immediate arrest of the killers.\n\nShikarpur SSP Shahzaib Chachar has asked the DSPs of City and Garhi Yasin for a detailed report on the incident. The SSP has also formed special police teams to track down the culprits. Raids were conducted at different places but none of the killers could be traced out till late in the evening.\n\nThe old enmity had already claimed six lives, including that of a Brohi elder, until a Jirga (tribal court) settled the dispute on Sept 19 last year. The Jirga had fixed Rs5m fine / compensation against the murder of the elder and Rs2.5m against each of the other men killed in the attacks and counter-attacks.\n\nHowever, the Thursday attack claimed lives of another three Sundranis and their driver signaling resurgence of the violent attacks.\n\nCM takes notice\n\nChief Minister Syed Murad Ali Shah has taken serious notice of the Shikarpur incident and sought its immediate report from the inspector general of police (IGP).\n\nA statement issued from CM House in Karachi on Thursday said that the chief minister has also ordered immediate arrest of the culprits. He expressed his profound sympathies with the bereaved families.\n\nThe CM declared that there would be no compromise on law and order, and called for stern action against enemies of peace, the statement added.\n\nMeanwhile, Interior Minister Ziaul Hassan Lanjar has also taken immediate notice of the Shikarpur incident and asked the SSP to provide him with all details without delay.\n\nAn expert police officer should be tasked with the arrest the killers, Lanjar told the SSP, adding that strict action against the culprits must be ensured.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:55:30.039Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916770/two-brothers-among-four-gunned-down-in-shikarpur-tribal-feud",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:34:17.000Z"
}
