{
  "title": "Lahore High Court restores ombudsperson for workplace harassment - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court has declared null and void the Punjab caretaker government’s decision to remove Nabila Hakim Ali Khan from her position as Ombudsperson for Protection against Harassment of Women at the Workplace, restoring her to office with immediate effect.\n\nJustice Raheel Kamran issued a detailed 21-page judgement on a writ petition filed by Ms Khan, who had challenged her de-notification on Aug 4, 2023, on the grounds of lack of legal authority, procedural impropriety, and infringement of her guaranteed tenure.\n\nThe petitioner was appointed for a fixed term of four years under the amended Protection against Harassment of Women at the Workplace (Amendment) Act, 2022.\n\nThe judge held that no removal is permissible during the tenure except for proven misconduct or incapacity, and even then, only after due process, which was entirely absent in this case.\n\nThe judge observed that the caretaker government lacked the authority to remove the ombudsperson, terming the act outside its limited constitutional and statutory functions.\n\nJustice Kamran noted that caretaker setups are designed to ensure electoral neutrality and cannot take policy-level or structural decisions that impact statutory bodies. He said the Election Commission of Pakistan (ECP) had directed the caretaker government to ensure removal of all politically appointed institutional heads.\n\nHowever, the judge found the ECP overstepped its authority, as it had no power to direct the termination of a statutory office-holder unless there was compelling evidence that the official could influence electoral outcomes — a criterion that was not met in the petitioner’s case.\n\nThe judge also criticised the absence of any inquiry or due process in the petitioner’s removal.\n\nHe said despite objections raised later by the provincial government about the petitioner’s qualifications and prior political affiliations, no formal hearing or notice was given to her before de-notification.\n\n“Even if an elected government intended to take any action based on such objections, it would be required to act while following the principles of natural justice, ensuring fairness and due process for the petitioner,” the judge noted.\n\nRecognising the constitutional role of the ECP in conducting free and fair elections, Justice Kamran found that its 2023 directive — used by the caretaker government to justify the de-notification of the petitioner — did not authorise the removal of statutory office holders unless there was a demonstrated risk of election interference.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:55:55.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916865/lahore-high-court-restores-ombudsperson-for-workplace-harassment",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:48.000Z"
}
