{
  "title": "PTI accuses govt of ‘fabricating’ economic data - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PTI on Thursday accused the government of sharing “fabricated and misleading” data in the Economic Survey of Pakistan, which was “nothing more than a smokescreen designed to conceal its economic failures”.\n\nOn the other hand, PTI’s National Assembly Opposition Leader Omar Ayub said they will keep on protesting against the government’s policies in parliament.\n\nAddressing a press conference alongside PTI lawmakers in the federal capital, its spokesperson Sheikh Waqqas Akram said that the situation on the ground painted a much bleaker picture — over 3 million educated and skilled young Pakistanis have been forced to leave the country in search of better opportunities abroad.\n\nThis alarming brain drain, he emphasised, was a direct result of the growing hopelessness, economic mismanagement, and lack of prospects under the current regime.\n\nSpokesperson says finance minister lacks ‘empathy’, ‘vision’ to fix ailing economy\n\nHe said that the ‘exodus of talent’ was not just a statistic — it was a national tragedy. “Our brightest minds are giving up on their homeland because the government has failed to provide them with a future here,” he added.\n\nMr Akram lambasted the current regime’s economic policies. He criticised the finance minister, dismissing him as an “imported figure” with no real stake in Pakistan’s future. He added that the minister lacked both empathy and vision to address the country’s struggling economy.\n\nHe further stated that large-scale industries have been in decline for three consecutive years, with skilled labour continuing to flee the country due to an unsupportive business environment. He rejected the projected growth figures for large-scale manufacturing in the upcoming fiscal year, calling them nothing more than “fabricated data and wishful propaganda”.\n\nHe revealed a troubling statistic, as the number of tractors sold — an essential indicator of agricultural health — plummeted from 38,000 to just 24,000. This sharp decline, he said, was a clear sign of the agricultural sector’s collapse.\n\nHe stressed that while nearly 70pc of Pakistan’s population relied on agriculture for their livelihood, the regime has failed to release any credible unemployment data, further exposing a disconnect from the harsh realities faced by ordinary citizens.\n\nOn the occasion, MNA Usama Ahmed Mela noted that even countries like Bangladesh — despite enduring a bloody revolution — managed to achieve 4pc economic growth.\n\nMeanwhile, Omar Ayub said the PTI will continue to protest against the economic policies of the government in parliament during the budget session as well as in the committees. It may be noted that the finance minister delivered the budget speech amid sloganeering by the PTI. He also alleged that the numbers provided by the FBR were fabricated.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:33:59.841Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916850/pti-accuses-govt-of-fabricating-economic-data",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:48.000Z"
}
