{
  "title": "Who was Hossein Salami, the revolutionary guards chief killed in Israeli attacks - World - DAWN.COM",
  "author": null,
  "content": "Israeli strikes on Iran, targeting the country’s nuclear facilities, have claimed the life of the chief of Iran’s Islamic Revolutionary Guards Corps (IRGC), Major General Hossein Salami, including two other commanders.\n\nAccording to a statement by the IRGC, its top commander, Hossein Salami, was killed in the Israeli strikes after the unit’s headquarters were hit in Tehran.\n\nIsraeli Prime Minister Benjamin Netanhyu in a video message said, “Moments ago Israel launched Operation Rising Lion, a targeted military operation to roll back the Iranian threat to Israel’s very survival. This operation will continue for as many days as it takes to remove this threat.”\n\nIran’s Supreme Leader, Ayatollah Ali Khamenei, has vowed that Israel would receive “a bitter fate for itself”.\n\nAccording to a CNN report, Hossein Salami, born in 1960 as per a United States sanctions docket, was one of the most powerful men in Iran, overseeing its most potent military arm and reporting directly to its Supreme Leader, Ayatollah Ali Khamenei.\n\n“Salami first joined the Revolutionary Guards — a powerful branch of the Iranian armed forces — in 1980 during the Iran-Iraq war and became deputy commander in 2009, then commander a decade later,” per a report by the BBC.\n\nThe Revolutionary Guards is one of the country’s most powerful military and political groups. He was known to have a hardline stance against Iran’s rival countries like Israel and the United States.\n\nSalami had been sanctioned by the UN Security Council and the US for his involvement in Iran’s nuclear and military programmes since 2000s, the report added.\n\nThe top commander had previously warned Iran’s rivals, including Israel and US, that Tehran would “open the gates of hell” if attacked, the report said.\n\nJust a day before the strikes, Salami had said that Iran was “fully ready for any scenarios, situations, and circumstances”, the report quoted him as saying.\n\n“The enemy thinks it can fight Iran the same way it fights defenceless Palestinians who are under an Israeli siege.”\n\n“We are war-tested and experienced.”\n\nSalami and other senior officers of the Revolutionary Guards routinely advise Iran’s supreme leader, the BBC reported.\n\nAccording to the CNN: “Salami was at the helm of the IRGC when Iran launched hundreds of drones and missiles at Israel in April and October last year, in the first direct strikes by Iran on Israeli territory.”\n\nThe attacks were launched by Iran in retaliation to the assassination of Hamas leader Ismail Haniyeh in Tehran, Hezbollah leader Hassan Nasrallah, and IRGC general Abbas Nilforoushan.\n\nAccording to CNN security analyst Beth Sanner, “removing Salami is akin to taking out the US chairman of the joint chiefs of staff”.\n\n“You can imagine what Americans would do,” CNN quoted her as saying.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/13133606451a2f7.jpg",
  "retrievedAt": "2025-08-20T03:55:27.290Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916918/who-was-hossein-salami-the-revolutionary-guards-chief-killed-in-israeli-attacks",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T08:47:54.000Z"
}
