{
  "title": "Delay in installing new air conditioners in trains: Minister gets ACs of top Railways officials switched off - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Expressing displeasure over the `poor’ performance of some officials in installing new AC units in express trains, Minister for Railways Hanif Abbasi banned on Thursday the use of air-conditioners by all officials of the PR headquarters, including the office of the Chief Executive Officer (CEO).\n\nThe move was described as inhumane by senior officers who said delay in execution of any official work / assignment is a part of the service. “If anything wrong has happened, the minister should order an inquiry to fix responsibility instead of getting the ACs switched off,” deplored an official. “It is ridiculous,” he said, terming the cancellation of the public holiday on Saturday by the minister as unjustified.\n\nTo a question, he said the number of ACs switched off at the PR headquarters was 70 or so.\n\nDefending his decision, Mr Abbasi said officials responsible for the delay in installing new ACs in trains must feel the plight of passengers who have paid for AC coaches.\n\n“The department was supposed to receive as many as 100 AC units by June 10. But they received only four units. The officers concerned must have placed supply orders with four and five firms to get all units in time. But they gave order to only one vendor,” he said, adding the order with the sole vendor was also placed late.\n\nThe minister said the order must have placed the order before the start of summer.\n\nHe said the ACs installed in the offices of divisional headquarters in seven divisions would also be switched off under a phased manner if the passenger complaints related to poor working of AC units persist.\n\nAbbasi said he didn’t spend time with his family during Eid holidays. I started my journey on third day of Eid from Rawalpindi. I reached Okara to condole death of a railway official in the partial collapse of the Khanewal station bridge. Afterword, he said he inspected the Okara station to check facilities there. On the public demand, he contacted the DG passports to establish a passport office in Okara.\n\nHe said at Khanewal passengers complained about non-operational AC. “This forced me to take action that I finally did.“To a question, the minister said he would protect rights of passengers by all means. To another question, he said he was personally monitoring various inquiries.\n\nMr Abbasi said Rs26 billion had been allocated in the federal budget for railways’ ongoing projects under the Public Sector Development Programme (PSDP). “Though I am not satisfied with this allocation, it will help us complete ongoing development schemes.”\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:33:39.623Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916815/delay-in-installing-new-air-conditioners-in-trains-minister-gets-acs-of-top-railways-officials-switched-off",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:34:23.000Z"
}
