{
  "title": "Four undertrial prisoners sentenced to death for raping fellow jail inmate - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: An Additional District and Sessions Judge (ADSJ) sentenced to death four under-trial prisoners for sodomy and murder of fellow inmate in Adiala jail on New Year’s night of 2024.\n\nADSJ Afshah Ijaz Suri, in a detailed judgment, found Mohammad Waqas, Asif Khan, Naqash Raza (alias Aamir Raza), and Bilal Hussain guilty on two counts:\n\nSodomy u/s 375(A) PPC: Each convict was sentenced to death and fined Rs200,000. Additionally, each was ordered to pay Rs500,000 in compensation to Sabieel’s legal heirs.\n\nMurder u/s 302(b) PPC (Common Intention): Each convict was sentenced to death (“Tazeer”).\n\nThe sentences of death are subject to mandatory confirmation by the Lahore High Court.\n\nThe convicts, who were present in police custody, were ordered to be sent to Adiala Jail. They have seven days to appeal the verdict in higher court.\n\nThe incident occurred on the night of January 1, 2024, within the supposedly secure confines of the Aids patient ward in Adiala Jail’s New Cell #2 (Chakki #10).\n\nAccording to the FIR lodged by jail superintendent, fellow prisoners raised an alarm about Sabieel’s health around midnight. A dispenser examined him, finding severe breathing difficulties, and administered medicine.\n\nHowever, Sabieel was found unconscious the next morning and pronounced dead at the jail hospital. Suspicious torture marks were discovered around his neck. The subsequent investigation, based on statements from other inmates, revealed a horrifying sequence: Sabieel’s limbs were tied, he was subjected to sodomy by the four accused, and then strangled to death with a piece of cloth. Witnesses specifically alleged Waqas pressed his foot on Sabieel’s throat and chest.\n\nThe incident triggered immediate action against jail staff. Seven officials, including Assistant Superintendent Operations Ulfat Hussain and several warders, were suspended.\n\nThe case underscored the chronic and dangerous overcrowding plaguing Adiala Jail. Designed for 2,200 inmates, it currently houses over 7,000 prisoners. Sabieel and his attackers were among nine prisoners confined within a single cell in the specialized AIDS ward at the time of the attack. The Punjab government has since approved the construction of a new district jail, with work reportedly begun and funds allocated.\n\nJudge Suri ordered the confiscation of case property in favour of the state (to be destroyed after appeal periods) and the return of Sabieel’s last-worn clothes to his legal heirs.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:55:29.042Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916861/four-undertrial-prisoners-sentenced-to-death-for-raping-fellow-jail-inmate",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:35:16.000Z"
}
