{
  "title": "Pakistan’s cities sizzle under extreme hot weather: PMD - Pakistan - DAWN.COM",
  "author": null,
  "content": "The country experienced extremely hot and dry weather on Friday with the perceived or ‘Feels Like’ temperature crossing 50 degrees Celsius in four cities.\n\nCities in Punjab recorded reported high temperature exceeding 40°C amid no let-up in the extreme heatwave that has engulfed the country since last week. The heatwave could subside as the Met Office has forecast gusty winds and rain in the northern and central parts of the country from Friday (today) to Monday.\n\nAccording to the Pakistan Meteorological Department, the highest current temperature was recorded in Sibbi at 47°C with extremely hot and dry weather and humidity levels of seven per cent.\n\nKarachi recorded a temperature of 39°C at 2pm with a humidity level of 48pc. However, the perceived temperature was recorded at 50.4°C. The Met Office heat index warns of danger with probable risk of heatstroke, cramps, and exhaustion at temperatures from 41-54°C.\n\nThe temperature in Bahawalpur was recorded as 46°C, but the perceived temperature reached 55.8°C — the highest in the country. The heat index warns of “extreme danger” with imminent risk of heatstroke at temperatures above 54°C.\n\nCities recorded the following current temperatures: Faisalabad (46°C), Sargodha (46°C), Dera Ismail Khan (45°C), Multan (45°C), Lahore (44°C), Sialkot (43°C), Islamabad (43°C), Rawalpindi (42°C), Peshawar (41°C), Muzaffarabad (40°C), Quetta (35°C) and Gilgit (30°C).\n\nHowever, the perceived temperature in Sialkot and Lahore was 51.4°C and 51.1°C, respectively. Other cities also reported hot weather with the ‘Feel likes’ temperature in DI Khan at 49.6°C, 48.4°C in Faisalabad and Sargodha, Multan with 47.9°C, Islamabad with 44.4°C and Rawalpindi with 41.2°C.\n\nSeveral parts of Pakistan are currently experiencing an intense spell of extreme heat, with temperatures soaring well above normal across many regions. The extreme weather pattern highlights the global impact of climate change with continued rises in temperatures to record levels.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:55:24.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916931/pakistans-cities-sizzle-under-extreme-hot-weather-pmd",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T12:32:46.000Z"
}
