{
  "title": "Air India flight faces ‘worst aviation disaster in a decade’ - World - DAWN.COM",
  "author": null,
  "content": "• Over 200 killed as London-bound plane crashes in Ahmedabad seconds after takeoff\n• Scores dead and injured on the ground as debris falls on medical college hostel\n• UK resident Ramesh Viswashkumar said to be sole survivor\n• Britain, US sending investigation teams; Boeing shares tumble\n\nAHMEDABAD: More than 200 people were killed when an Air India plane bound for London with 242 people on board crashed shortly after takeoff, authorities said on Thursday, in what is said to be the world’s worst aviation disaster in a decade.\n\nOnly one person is known to have survived, as the plane came down in a residential area, crashing onto a medical college hostel just outside the airport at lunchtime.\n\nThe passengers included 169 Indian nationals, 53 British, seven Portuguese, and a Canadian. Two pilots and 10 cabin crew were also aboard, according to AFP.\n\nAccording to air traffic control at Ahmedabad Airport, Air India’s flight 171 — bound for London Gatwick airport — departed at 1:39 pm local time (0809 GMT) from runway 23. It gave a Mayday call, signalling an emergency, but thereafter there was no response from the aircraft.\n\nFootage of the crash showed the plane taking off over a residential area and then disappearing from view, before a huge ball of fire and smoke is seen rising into the sky from beyond the houses.\n\nAnother video circulating on social media showed an aircraft rapidly losing altitude — with its nose up — before it hit a building and exploded into an orange ball of fire.\n\nIndia’s CNN News-18 said the plane crashed on top of the dining area of state-run B.J. Medical College hostel, killing many medical students as well.\n\n‘Sole survivor’\n\nCity police chief G.S. Malik told Reuters that 204 bodies had been recovered from the crash site. Vidhi Chaudhary, another senior police officer, said they had found one survivor, who was in seat 11A.\n\nIndian media identified the fortunate man as UK resident Ramesh Viswashkumar.\n\n“Thirty seconds after takeoff, there was a loud noise and then the plane crashed,” the 40-year-old told the Hindustan Times.\n\n“It all happened so quickly,” he told the paper from his hospital bed.\n\nPolice chief Malik said the bodies recovered could include both passengers and people killed on the ground.\n\n“When I got up, there were bodies all around me. I was scared. I stood up and ran. There were pieces of the plane all around me,” he said.\n\n“Someone grabbed hold of me and put me in an ambulance and brought me to the hospital.”\n\nHe said that his brother Ajay was seated in a different row on the plane. “He was travelling with me and I cant find him anymore. Please help me find him, he said.\n\nAccording to the BBC, Vishwash has a wife and child and has lived in the UK for many years. His relatives, who had gathered at the family home in Leicester, said they were awaiting more information.\n\nFederal minister C.R. Patil said the dead included Vijay Rupani, a former chief minister of Gujarat state.\n\nThe Indian aviation minister’s office said PM Narendra Modi, whose home state is Gujarat, had told it to ensure all support was extended to the rescue efforts.\n\nAhmedabad Airport, which suspended all flight operations after the crash, said it was operational again but with limited flights. The airport is operated by India’s Adani Group conglomerate.\n\nThe last fatal plane crash in India, the world’s third largest aviation market and its fastest growing, was in 2020 and involved Air India Express, the airline’s low-cost arm.\n\nTata will provide Rs10 million ($117,000) to the families of each of the dead, cover all medical expenses of those injured and help rebuild the hostel of the medical college, chairman N. Chandrasekaran said.\n\nFirst Dreamliner crash\n\nAviation tracking site Flightradar24 said the plane was a Boeing 787-8 Dreamliner, one of the most modern passenger aircraft in service.\n\nIt was the first crash for the Dreamliner, which began flying commercially in 2011, according to the Aviation Safety Network database. The plane that crashed on Thursday flew for the first time in 2013 and was delivered to Air India in January 2014, Flightradar24 said.\n\nInvestigators with the US National Transportation Safety Board will travel to assist Indian counterparts probing the brutal Air India crash, the agency announced Thursday.\n\n“The NTSB will be leading a team of US investigators travelling to India to assist… with (the) investigation into the crash of an Air India Boeing 787 in Ahmedabad, India,” the agency said on X, adding that under international protocols, “all information on the investigation will be provided by the Government of India.”\n\nThe UK’s Air Accidents Investigation Branch (AAIB) says it has “formally offered its assistance” to the Aircraft Accident Investigation Bureau in India.\n\nIt adds that the UK AAIB will have expert status in the Indian investigation because UK citizens were on board the plane.\n\nBoeing said it was aware of initial reports and was working to gather more information. Boeing shares fell 5pc as the crash posed a major setback for the planemaker as its new CEO looks to rebuild trust following a series of safety and production challenges.\n\nAircraft engine-maker GE Aerospace said that it would put a team together to go to India and analyse cockpit data, CNBC TV18 reported.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684b6fc27ea1f.gif",
  "retrievedAt": "2025-10-12T03:34:00.496Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916894/air-india-flight-faces-worst-aviation-disaster-in-a-decade",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:32.000Z"
}
