{
  "title": "PM thanks UAE for role in defusing tensions with India - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Thursday thanked the leadership of the United Arab Emirates (UAE) for its “constructive role” in helping defuse tensions during the recent conflict between Pakistan and India.\n\nDuring a meeting with UAE President and Ruler of Abu Dhabi Sheikh Mohamed bin Zayed Al Nahyan, PM Shehbaz appreciated the Gulf state’s consistent efforts in promoting peace, dialogue and stability in the region.\n\nThe high-level engagement took place as part of the prime minister’s day-long official visit to Abu Dhabi, aimed at reaffirming Pakistan’s gratitude to friendly nations that supported Islamabad’s position during its recent standoff with New Delhi.\n\nTensions flared following what Islamabad termed a “false flag operation” by India in the mountainous resort town of Pahalgam. In the wake of the incident, both countries carried out missile and air strikes. According to Pakistan’s military, India lost six aircraft in the exchange, including a Rafale fighter jet.\n\nAccording to the Prime Minister’s Office, both sides expressed satisfaction over the positive trajectory of bilateral ties and ongoing engagements at all levels. The leaders agreed to maintain close coordination and continue working together to advance shared goals of regional peace and prosperity.\n\nThe meeting underscored the deep-rooted, brotherly relations between Pakistan and the UAE, built on mutual trust, shared values and a history of close cooperation.\n\nThe two leaders discussed a wide range of bilateral, reg­i­o­nal and global issues of mutual interest, and reaffirmed their commitment to further enhancing collaboration in key areas. Prime Minister Shehbaz reiterated his earlier invitation to the UAE president to visit Pakistan.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Chief of the Army Staff Field Marshal Syed Asim Munir, Interior Minister Mohsin Naqvi, Information Minister Ataullah Tarar, and Special Assistant to the Prime Minister Tariq Fatemi were also present at the meeting.\n\nEarlier, Prime Minister Shehbaz was warmly received at Abu Dhabi’s Al Bateen Airport by Sheikh Tahnoun bin Zayed Al Nahyan, the UAE’s national security adviser and brother of the president. He also accompanied the prime minister to the Presidential Palace.\n\nSecretary General of the UAE Supreme National Security Council Ali Ahmed Al Shamsi, Pakistan’s Ambassador to the UAE Faisal Niaz Tirmizi, and Pakistani diplomatic staff were also present at the airport to receive the prime minister.\n\nLondon Tech Week\n\nLater in the day, PM Shehbaz addressed Pakistan’s participation at London Tech Week 2025 held in Abu Dhabi, where he highlighted the country’s commitment to transitioning into a knowledge-based economy.\n\nSpeaking at the global platform, the premier said Pakistan’s dedication to digital transformation, technological innovation and youth empowerment remained unwavering.\n\nThe prime minister congratulated all stakeholders on Pakistan’s impactful presence at London Tech Week 2025.\n\n“This positions Pakistan as a forward-looking country that is harnessing technology, innovation and youth potential to engage with the world,” he said. “Our presence at such an important platform reflects our growing digital footprint and global ambition.”\n\nPrime Minister Shehbaz returned to Pakistan on Thursday evening after concluding his official visit to the United Arab Emirates.\n\nPM’s notice\n\nIn a separate development, PM Shehbaz has taken notice of a more than five-fold increase in the salaries of the National Assembly speaker and Senate chairman and sought a report from the Ministry of Parliamentary Affairs.\n\nSources said the prime minister’s action came in the wake of widespread public criticism over the increase in the salaries of the custodians of the two houses from Rs205,000 to Rs1.3 million a month.\n\nThe decision has drawn criticism from within the ruling PML-N, as two party stalwarts — Defence Minister Khawaja Asif and Khawaja Saad Rafique — publicly criticised the move.\n\nHowever, during the post-budget press conference on Wednesday, Finance Minister Muhammad Aurangzeb defended the steep hikes — some as large as 550 per cent — in the salaries of the speaker, deputy speaker, members of parliament, and ministers.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/13111114ee706cf.jpg",
  "retrievedAt": "2025-10-12T03:34:01.232Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916897/pm-thanks-uae-for-role-in-defusing-tensions-with-india",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:32.000Z"
}
