{
  "title": "Automobile sales flourish in May - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sales of cars, sport utility vehicles, pickups and vans clocked in at 14,762 units in May, reflecting a rise of 35 per cent year-on-year and 39pc month-on-month.\n\nThis takes 11MFY25 sales to 126,226 units, showing a 39pc increase over 90,545 units in the same period last year, Myesha Sohail of Topline Securities said, quoting data released by the Pakistan Automotive Manufacturers Association (PAMA).\n\nThe MoM rise was mainly due to a lower base as April saw road closure in Sindh (due to strikes over canal issues), which delayed deliveries and thus lower sales, she said, adding that the YoY growth is supported by a more stable macroeconomic environment, lowering interest rates, easing inflation, and improving consumer sentiment.\n\nSazgar Engineering posted the highest MoM growth of 67pc and an 18pc YoY rise to 919 units in May, mainly due to low sales in April.\n\nThe launch of the new facelift of Haval also supported higher sales. In 11MFY25, total sales surged 111pc YoY to 9,495 units, up from 4,503 units in 11MFY24.\n\nEasing inflation and low interest rate to improve consumer sentiment\n\nIndus Motor Company (IMC) sold 4,828 units in May, up 48pc MoM and 136pc YoY which is highest monthly sales in nearly three years, she said, adding that the 11MFY25 sales soared to 29,706 units, showing a jump of 67pc in the same period last fiscal.\n\nHonda Atlas Cars Ltd (HACL) saw a 69pc YoY and 17pc MoM rise to 2,005 units in May, while its 11MFY25 sales rose by 36pc to 16,488 units compared to the same period last fiscal.\n\nMyesha said Pak Suzuki Motor Company Ltd (PSMCL) sold 5,519 units in May, showing a fall of 8pc YoY and a rise of 38pc MoM, while its July-May FY25 sales surged by 25pc to 59,468 units versus the same period last year.\n\nHyundai Nishat saw a 58pc YoY and 45pc MoM rise in its May sales of 1,307 units, while 11MFY25 sales stood at 9,497 units, up by 22pc over the same period last fiscal.\n\nShe said the two- and three-wheeler sales increased by 26pc YoY and 11pc MoM, totalling 150,175 units in May, which was a three-year high. This takes 11MFY25 sales to 1.4m units, showing a 30pc YoY rise.\n\nDue to weak farm economics, the total tractor industry recorded sales of 2,184 units in May, posting a 29pc YoY fall but showed 36pc MoM rise. Total tractor sales fell by 30pc to 27,016 units in 11MFY25 as compared to the same period last fiscal, she said.\n\nTruck and bus sales in May were up 147pc YoY and 17pc MoM to 610 units, thus taking 11MFY25 sales to 4,495 units, up by 92pc rise from 2,345 units in 11MFY24.\n\nAuto parts maker and exporter Mashood Ali Khan said that despite government initiatives to promote agriculture, the tractor industry continues to face challenges due to additional taxes imposed in the last budget, which have affected tractor parts manufacturers to date.\n\nHe said concerns arise with the upcoming budget’s proposal to increase the sales tax on small cars, which may negatively impact the performance and affordability of this segment for the middle class.\n\nHowever, a further decrease in interest rates to single digits could boost car sales volumes, he said, adding that scaling up financing options could further support the industry.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684b64592782a.gif",
  "retrievedAt": "2025-10-12T03:34:03.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916830/automobile-sales-flourish-in-may",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:55.000Z"
}
