{
  "title": "Wildfire destroys pine nut, olive trees in Balochistan’s Sherani - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: A wildfire that broke out in the forest of Shin Ghar in Sherani district could not be brought under control despite the passage of three days, destroying pine nut and olive trees and threatening the livelihood of local residents.\n\nOfficials in Zhob confirmed the outbreak of the massive fire in the mountainous area of Mraghbal Tora Morgah, saying that reports of the fire were received on Tuesday evening. As of Thursday, the blaze had continued for the third consecutive day.\n\nWhile the cause of the fire remains unknown, efforts are underway to control it and save the valuable forests of pine nuts and olives, which are the sole sources of livelihood for the local population.\n\n“We are making all-out efforts to control the fire along with local people, FC and Levies personnel,” a senior official of the Sherani district administration told Dawn, adding that strong winds blowing through the mountainous terrain were hampering their efforts.\n\nAuthorities fail to bring inferno under control despite passage of three days\n\nThe Provincial Disaster Management Authority (PDMA) said that a rescue team was being dispatched from Quetta to the fire-affected area of Sherani to conduct operations alongside FC and Levies personnel.\n\nA local journalist from Zhob reported that residents, equipped with sticks and tree branches, were battling the massive fire but facing serious challenges in containing it. “Aerial water spray through helicopters is immediately needed to control the fire, which will engulf more areas if aerial support is not provided right away,” he told Dawn over the phone.\n\nUnited Business Group Balochistan Vice Chairman Asfandyar Khan Mandokhail said the fire had swept through forests of pine nut (chilghoza) and olive trees located between the tribal areas of Sherani and Hariphal. He added that hundreds of families, who depend on harvesting pine nuts and olives for their livelihood, expressed concern over the authorities’ failure to dispatch helicopters for firefighting operations.\n\nHe recalled that a similar wildfire broke out three years ago in the pine nut and olive forests of the mountainous areas of Zhob and Sherani districts, which caused significant losses to the local population. That fire was eventually brought under control through aerial firefighting sorties provided by the Iranian government.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:55:54.719Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916858/wildfire-destroys-pine-nut-olive-trees-in-balochistans-sherani",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:33:48.000Z"
}
