{
  "title": "Migrants hid in wardrobes amid Northern Ireland unrest - World - DAWN.COM",
  "author": null,
  "content": "BALLYMENA: Foreign nationals hid in wardrobes and attics to escape a wave of unrest which has rocked a Northern Ireland town, police said on Thursday, calling for the protests to end and warning rioters they would face arrest.\n\n“Stop this violence,” said Northern Ireland police chief Jon Boutcher. “We will come after you. We will arrest you. We will prosecute you successfully.” He was speaking after three nights of unrest in the town of Ballymena, some 30 miles northwest of Belfast.\n\nThe clashes erupted on Monday night after two teenagers were arrested for the alleged attempted rape of a young girl at the weekend. Police have not confirmed the ethnicity of the teenagers, who remain in custody and had asked for a Romanian interpreter in court.\n\nAfter another barrage of petrol bombs, bricks and bottles, the crowds eventually dispersed on Wednesday without a repeat of the chaotic scenes seen on Monday and Tuesday when houses and businesses in areas where Romanian families live were torched.\n\nA total of 13 people have now been arrested, and 41 police officers injured, though most of the injuries are not severe. Three teenage boys aged 15, 17 and 18 were due to appear in court on Thursday having been charged with rioting, said police.\n\nBoutcher described the riots as “wanton, disgraceful criminal behaviour that is absolutely race motivated”, speaking at a news conference on Thursday. Police had helped evacuate foreign national families hiding in attics and wardrobes in their homes “even though they had done nothing wrong”, he said.\n\n“They are not criminals. They contribute positively to society here and are well integrated,” he added.\n\nClonavon Road, where most of the riots happened in a neighbourhood known for having a large population of eastern Europeans, was almost deserted on Thursday.\n\nMany of the houses were damaged, and British, English or Northern Irish flags hung from most windows, reporters saw. Some had signs saying they were Filipino residents.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/1310293366c9267.jpg",
  "retrievedAt": "2025-08-20T03:55:41.679Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916818/migrants-hid-in-wardrobes-amid-northern-ireland-unrest",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:34:11.000Z"
}
