{
  "title": "Only in Sindh, issuance of PRCs and domiciles not linked to Nadra - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Supreme Court issues notices to Sindh govt, DCs on MQM-P leader’s appeal against grant of permanent residence certificates, domiciles to non-residents of Karachi\n• Judges stress need of using advanced technology to curb fake documents\n• Nadra chief told to send officer to assist court\n\nKARACHI: The Supreme Court was on Thursday informed that except for Sindh, issuance of domiciles and permanent residence certificates (PRCs) in Punjab, Khyber Pakhtunkhwa and Balochistan was linked to the system of the National Database and Registration Authority (Nadra).\n\nThe PRC and domicile are required for getting admission into professional colleges and universities as well as government jobs.\n\nThe information was provided by Muttahida Qaumi Movement-Pakistan MNA Khawaja Izharul Hasan before a three-judge SC bench hearing his appeal against the dismissal of his petition by the Sindh High Court regarding alleged issuance of Karachi domiciles and PRCs to the people who do not live in the metropolis.\n\nWhen the bench comprising Justice Mohammad Ali Mazhar, Justice Syed Hasan Azhar Rizvi and Justice Aqeel Ahmed Abbasi took up the matter on Thursday, appellant Khwaja Izhar, several deputy commissioners (DCs) and an additional advocate general were in attendance.\n\nThe provincial law officer pleaded for more time to file comments on behalf of the Sindh government and DCs.\n\nThe appellant submitted that he was pursuing this matter for the past several years and expressed the hope that the same would be decided expeditiously.\n\nHe submitted that issuance of domiciles and PRCs in other three provinces were linked with Nadra while in Sindh the same were being processed by DCs.\n\nThe bench asked the officials whether there was any mechanism / network available at the offices of DCs to carry out an inquiry before issuing such documents and as to how a DC can determine if a citizen already held a domicile and PRC of another district.\n\nThe judges also remarked as to how a citizen could obtain such documents from another district without surrendering the old ones.\n\nOne of the DCs present in court submitted that the staff at DC offices examined educational certificates of applicants, computerised national identity cards (CNICs) of their parents, residential addressees, etc.\n\nThe bench observed that advanced technology may be used in order to curtail issuance of fake domiciles and PRCs.\n\nIt directed the Sindh government and DCs to file replies and also issued a notice to the Nadra chairman, directing him to send an officer well conversant with the subject matter at the next hearing to assist the court.\n\nThe judges remarked that they were willing to issue an order on the matter after hearing and examining the comments of Nadra and other respondents.\n\nThe MQM-P leader approached the Supreme Court after the Sindh High Court had dismissed his petition against issuance of domiciles and PRCs to non-residents of Karachi.\n\nThe appellant submitted that he had challenged the SHC’s order, which stated that the chief secretary had already constituted a Divisional Scrutiny Committee and Sindh PRC and Domicile Appellate Committee at the provincial capital to decide applications about violation of relevant laws.\n\nHe argued that as per a 2020 notification, an additional chief secretary had constituted a committee with certain terms of reference asking it to complete its task within 30 days.\n\nHowever, no substantial inquiry was conducted within 30 days, rather after lapse of two years and 10 months, the committee submitted a report only for four districts and the said report was not considered by the SHC while dismissing the constitutional petition, he added.\n\nEarlier in May 2019, Khawaja Izhar, along with other party leaders, had petitioned the SHC and submitted that the domicile/PRCs were being issued to the applicants allegedly without following the codal requirements, without examining the oral or documentary evidence and verification of the certificate of birth either of the applicant or any of his/her parents or grandparents, as the case may be.\n\nCiting the chief secretary, commissioner of Karachi, deputy commissioners and others as respondents, the petitioners had also maintained that non-residents managed to obtain government jobs and admissions to professional universities on the basis of such fake domiciles and PRCs of urban quota, depriving the citizen of Karachi of getting government jobs and admissions to professional colleges and universities.\n\nIn May 2023, the SHC had dismissed the petition mainly on the ground that the committees had already been constituted for deciding the applications received from aggrieved persons against issuance of PRC and Domicile violating the Sindh PRC Rules, 1971, Pakistan Citizenship Act, 1951 and Pakistan Citizenship Rules, 1952 and the same were also functional and aggrieved people may approach them for redressal of their grievances.\n\nPublished in Dawn, June 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:33:40.635Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916776/only-in-sindh-issuance-of-prcs-and-domiciles-not-linked-to-nadra",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T00:34:17.000Z"
}
