{
  "title": "Feb 8 election to bring political stability: PM",
  "link": "https://www.app.com.pk/national/feb-8-election-to-bring-political-stability-pm/",
  "date_published": "2024-01-26T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar Friday said that the general election on February 8 would bring political stability in the country.\nThe prime minister, in an interview with a private television channel, said after the elections, the new government would work to achieve political and economic stability.\nHe said his government successfully achieved most of the targets set by it and a white paper would be issued to enlist those successes.\n“The biggest challenges were economic issues,” he said, adding the next government would have to work with the International Monetary Fund and bring reforms in the taxation system to take the economy forward.\nHe said the government carried forward the process of privatisation of state-owned entities, including Pakistan International Airlines (PIA). The process of privatisation was almost complete, he added.\nThe prime minister said the Special Investment Facilitation Council (SIFC) led the effort to sign $ 25 billion worth of memorandums of understanding with the United Arab Emirates and Qatar. The SIFC was formed by the previous government after enactment of a law in the Parliament, he recalled.\nHe said the social media would be regulated and some people would have to stop the wrong use of the medium.\nThe previous governments worked to control negative aspects of the social media and in future a “national firewall” through use of technology would be created to subdue the negative tendencies, he noted.\nHe said May 9 was an attack on the concept of the State of Pakistan and from the very start he was very critical of the elements involved in the incidents.\nHowever, the whole of Pakistan Tehreek-e-Insaf could not be kept away from Pakistani politics, he said, adding only some specific people of the PTI were involved in the incidents of May 9.\nHe clarified that his government did not target any political party. He remarked that undermining social order created anarchy which was not acceptable in any society.\n“Social order is the guarantor of political order,” he added.\nPM Kakar said the political parties needed to democratise themselves and decrease influence of individuals.\nThe Supreme Court’s decision on the intra-party elections of PTI was a welcome step and would increase the opportunities for politicians from the middle class to make a mark on the political landscape, he opined.\nHe said veteran politician Maulana Fazlur Rehman undertook a private visit to Afghanistan and the State of Pakistan was not involved in it, however, the Foreign Office did brief him on the situation in the neighbouring country.\nHe said the citizens of neighbouring, countries including Afghanistan had to observe immigration laws of Pakistan as was done all over the world.\nHe said Iran’s attack on Pakistani soil was absolutely wrong and Pakistan responded appropriately to the aggression. “We were shocked by the attack of Iran. We were not expecting this.”\nBoth sides had agreed to the need for de-escalation, he added.",
  "retrievedAt": "2025-08-10T23:56:07.382Z"
}
