{
  "title": "Wafaqi Mohtasib trems inquiry report on delay in issuance of Passport as unsatisfactory",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-trems-inquiry-report-on-delay-in-issuance-of-passport-as-unsatisfactory/",
  "date_published": "2024-01-26T08:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Wafaqi Mohtasib Ejaz Ahmed Qureshi has expressed his dissatisfaction over the inquiry report submitted by the Passport Office in compliance of his earlier directions in response to a large number of complaints regarding inordinate delay in the issuance of passports, said in a press release issued here on Friday.\nTerming the report as unsatisfactory and lacking in substance, he directed the senior officials concerned of the Passport Office to address the issue expeditiously. The people pay for provision of these services directly to the Passport Office but unfortunately, they are not getting what they have expected in return, he observed and added, the exhaustion of lamination paper, ink etc were petty issues and the Passport Office should have foreseen its precise requirements much earlier to cater to the needs of growing number of passport seekers.\nIt may be recalled that taking suo motto notice of very large number of complaints against delay in issuance of passports, an Inspection Team of the Wafaqi Mohtasib Secretariat had visited the Passport Office, Islamabad on the directions of the Wafaqi Mohtasib to ascertain the causes of the delay and breakdown of efficient delivery of services in the Passport Office.\nHeaded by the Senior Advisor, the Team discussed in detail the entire process of issuing passports with the officials besides interviewing a large number of people, who had come to collect their passports in the Passport Offices located in the Federal Capital. The people informed the Inspection Team that they had been visiting the Passport Office for the last couple of months and many of them had complained that their visas expired during the process.",
  "retrievedAt": "2025-08-10T23:57:04.978Z"
}
