{
  "title": "City witnesses sunny Friday",
  "link": "https://www.app.com.pk/national/city-witnesses-sunny-friday/",
  "date_published": "2024-01-26T09:47:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 26 (APP):The city witnessed a sunny day on Friday as maximum temperature settled a notch above at 13 degrees Celsius, after a month-long severe cold and foggy weather conditions across Punjab.\n“The skies are expected to remain clear on Saturday as well, and the maximum and minimum temperatures will hover around 13 and 9 degrees Celsius,” said the Pakistan Meteorological Department (PMD).\nFriday’s minimum temperature was 9 degrees – average for this time of the year while the maximum humidity was recorded at 69 per cent. Blanketed by fog, Lahore and plains of Punjab remained in the grip of cold wave during last 30 days, and hardly saw any sunshine with experts predicting the prevailing weather conditions to persist during the next some days.\nBiting cold and incessant fog disturbed routine life by disrupting road, rail and air traffic and fog forced closure of portions of motorways besides affecting normal vehicular movement on other inter and intra city roads including National Highways.\nAccording to a daily weather report issued by the PMD, dense fog is likely to continue in plain areas of Punjab, Khyber-Pakhtunkhwa and upper Sindh. Due to continuously low daytime temperatures, very cold weather is likely to prevail in fog affected areas. Citizens are advised to be extra cautious.\n“Mainly cold weather is expected in most areas of the country including the city; however, light rain (light snowfall over mountains) is expected at isolated places in Kashmir, Gilgit-Baltistan and upper Khyber Pakhtunkhwa during evening/night.\n“Dense fog/smog is likely to persist in plain areas of Punjab, Khyber-Pakhtunkhwa and upper Sindh. Very cold weather is likely in aforesaid areas due to dense fog,” it added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:57:13.142Z"
}
