{
  "title": "Pakistan welcomes provisional measures by ICJ in Gaza",
  "link": "https://www.app.com.pk/national/pakistan-welcomes-provisional-measures-by-icj-in-gaza/",
  "date_published": "2024-01-26T17:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Pakistan Friday welcomed the provisional measures ordered by the International Court of Justice (ICJ), whereby it had concluded that, prima facie, it had the jurisdiction to entertain the case against Israel and that South Africa’s claims of genocide were “plausible”.\nThe Foreign Office in a statement said that the ICJ had ordered Israel to urgently undertake a series of measures in relation to Palestinians in Gaza to prevent the commission of acts prohibited by the Genocide Convention, including killing members of the group; causing serious bodily or mental harm to members of the group; deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part; and imposing measures intended to prevent births within the group.\nThe court also ordered Israel to take immediate and effective measures to enable the provision of urgently needed basic services and humanitarian assistance to address the adverse conditions of life faced by Palestinians in the Gaza Strip.\nThe implementation of the provisional measures required an immediate and unconditional ceasefire to bring about an end to the suffering faced by the people of Gaza.\nSince 7th October 2023, Israel had engaged in military aggression and criminal actions against the Palestinian people.\n“We consider the ICJ’s ruling timely and a significant milestone in the pursuit of justice for the Palestinian people and international accountability of Israel,” the Foreign Office said.\nPakistan called for the full and effective implementation of the ICJ’s decision so that basic human rights, dignity and identity of Palestinian people as a distinct group were upheld and protected, as stipulated by the United Nations Charter, relevant UN resolutions, and international law.\n“Pakistan reaffirms its unwavering support to the Palestinian people in their just and legitimate struggle for the realization of their inalienable right to self-determination.”\nWith a similar spirit, “Pakistan has supported the application filed by South Africa before the ICJ against Israel under the 1948 Genocide Convention, in follow up to which the Court today announced the provisional measures,” it added.",
  "retrievedAt": "2025-08-10T23:56:12.307Z"
}
