{
  "title": "NDMA organizes two-day workshop on Resilient Urban Planning",
  "link": "https://www.app.com.pk/national/ndma-organizes-two-day-workshop-on-resilient-urban-planning/",
  "date_published": "2024-01-26T10:07:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 26 (APP): The National Disaster Management Authority (NDMA) has conducted a two-day workshop on “Resilient Urban Planning in Climate Extremes” at Karachi NDMA’s National Institute of Disaster Management (NIDM), in collaboration with the Provincial Disaster Management Authority (PDMA) Sindh and UN-HABITAT.\nThe two-day workshop on comprehensive “Resilient Urban Planning in Climate Extremes” was held from January 23-24, a news release said.\nThe event witnessed active participation from a diverse range of stakeholders, bringing together key players in disaster management and urban planning.\nChief Coordinator NIDM, Tanveer Piracha inaugurated the workshop and briefed about proactive disaster management in Pakistan.\nThe workshop served as a collaborative platform, engaging participants from federal and provincial government departments, UN agencies, International NGOs, national humanitarian organizations, disaster management authorities, Rescue 1122, as well as representatives from academia, and civil society organizations.\nThe primary objective of the workshop was to enhance the understanding of resilient urban planning strategies in the face of climate extremes. Attendees had the opportunity to share insights, best practices, and lessons learned from their respective domains.\nThe collaborative nature of the event fostered valuable discussions and laid the groundwork for future initiatives aimed at building resilient urban landscapes.\nKey topics covered during the workshop included risk-sensitive spatial planning, climate change adaptation measures, community participation, and the integration of technology in urban planning to mitigate the impact of climate-related challenges.\nThe event underscored the importance of a multi-stakeholder approach in addressing the complexities of urban resilience.\nThe interactive intellectual discourse among the participants will contribute to informing decision-making processes and the development of more effective policies for sustainable urban development.\nAs the threat of climate extremes continues to grow, the NDMA and PDMA Sindh reaffirmed their commitment to fostering collaboration and knowledge exchange. The successful participation of a wide array of stakeholders highlights the collective dedication to creating urban environments that can withstand the challenges posed by climate change.\nThe closing ceremony was attended by Imdad ullah Siddiqui, the Director Operations PDMA Sindh who applauded the NDMA’s endeavor towards building sustainable communications through knowledge sharing and building capacities of the stakeholders.",
  "retrievedAt": "2025-08-10T23:56:55.823Z"
}
