{
  "title": "‘PM’s Hunarmand Pakistan Programme’ launched in Punjab",
  "link": "https://www.app.com.pk/national/pms-hunarmand-pakistan-programme-launched-in-punjab/",
  "date_published": "2020-02-21T03:30:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 21 (APP):Federal Minister for Education and Professional Training, Shafqat Mehmood on Friday inaugurated ‘Prime Minister’s Hunarmand Pakistan Programme’–skills for all, in Punjab under the umbrella of ‘Kamyab Jawan Programme’.\nThe programme would impart high-tech skill-based courses to enable young people of the province become functional for local as well international potential markets.\nThe project would be executed jointly by the Information Technology University (ITU) and National Vocational and Technical Training Commission (NVTTC).\nAddressing the inaugural ceremony at ITU here, Federal Minister Shafqat Mehmood said that in accordance with the vision of Prime Minister Imran Khan the programme would train youth as per need of the country at various levels.\nHe said the courses being offered included Data Science, Cyber Security, Cloud Computing, Game Development etc which were in wide demand by local and world markets. He said more such initiatives were in pipeline such as establishing upto 100 incubation centers at the universities,national accreditation center to monitor, evaluate and promote skilled based education in the universities and technical institutes etc.\nShafqat Mehmood said that education, as well as skills were vital in order to compete in the world, adding, economy can benefit from the large population of youth in the country.\nHowever,the minister regretted that education system of the country was producing degree holders but those degrees were not compatible with market needs. “Today the youth have degrees but do not have jobs”, he said.\nHunarmand Programme is just a beginning as the scope of such programmes would be expanded due to overwhelming interest shown by youth, Shafqat said. He also encouraged young women to join this programme and become a part mainstream economy of the country.",
  "retrievedAt": "2025-08-11T18:50:17.155Z"
}
