{
  "title": "British parliament delegation concerned over human rights violations in IOK",
  "link": "https://www.app.com.pk/national/british-parliament-delegation-concerned-over-human-rights-violations-in-iok/",
  "date_published": "2020-02-21T04:05:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 21 (APP):A six-member British Parliament delegation called on Governor Punjab Chaudhry Mohammad Sarwar and discussed human rights violations in the Indian Occupied Kashmir besides controversial Citizenship (Amendment) Act 2019 during a meeting at the Governor’s House here on Friday.\nThe British Parliament members assured to raise an effective voice in the British Parliament against human rights violations in occupied Kashmir.\n“The sad happenings in IOK are alarming for the entire world community while India’s Citizenship Act is denial of basic human rights”, the British lawmakers opined.\nThe delegation included British Members Parliament Debbie Abrahams, Mark Eastwood, Sara Britcliffe, Lord Qurban, Judi Kumenense, Tahir Ali, Imran Hussain, Councilor and Member National Executive Committee Labour Party Yasmin Dar, Raja Najabat Hussain and others.\nGovernor Punjab Chaudhry Mohammad Sarwar said India had become a den of extremism and for how long the world would keep mum, adding that the world community’s silence over Indian atrocities was not be less than an offense to humanity.\nSarwar said, “Narendra Modi is making every rogue of RSS as ‘Modi’. Human rights violations and carnage continue uninterrupted in the occupied Kashmir, which has been turned into world’s biggest jail due to curfew imposed for the last 200 days”.\nTerming resolution of Kashmir issue a pre-requisite of peace in the region, he said Pakistan under the leadership of Prime Minister Imran Khan supported peace.\nGovernor Punjab Chaudhry Mohammad Sarwar thanked the visiting British Parliament members raising voice for Kashmiris, adding that denying the British MPs a visit to the occupied Kashmir was a shameful act of the Indian government.\nThe Governor Punjab said the time had come that the United Nations (UN) and all other international organizations played their role in lifting of curfew in occupied Kashmir and resolving Kashmir issue in accordance with UN resolutions, instead of becoming silent spectators.",
  "retrievedAt": "2025-08-11T18:50:11.552Z"
}
