{
  "title": "PM optimistic about peace, stability in Afghanistan; says things moving in right direction",
  "link": "https://www.app.com.pk/national/pm-optimistic-about-peace-stability-in-afghanistan-says-things-moving-in-right-direction/",
  "date_published": "2020-02-21T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):Prime Minister Imran Khan on Friday expressed his optimism about peace and stability in Afghanistan through a possible agreement between the United States and Taliban, saying for the first time things were moving in the right direction.\n“…It is for the first time things moving in the right direction, the Americans wanting peace and dialogue with Taliban and the Taliban are now sitting with the Americans. The next phase would be ceasefire and then possibly an agreement,” Imran Khan said in an interview with VRT, a Belgian broadcaster.\nThe prime minister said since his government came to power, he had left no stone unturned so that there would be peace in Afghanistan, and fortunately things were moving in the right direction.\nHe, however, added that it was not going to be so easy because there had been 19 years of conflict.\nTo a question about the fight against terrorism, he mentioned that 70,000 Pakistanis lost their lives during 10 to 12 years period.\nHe credited Pakistan’s security forces, especially the intelligence agencies for controlling the insurgency.\n“And I am very happy to say that my first year as prime minister, 2019 was the safest year in Pakistan since 9/11,” the prime minister maintained.\nImran Khan also gave a historical perspective of how Pakistan and Afghanistan had to face the brunt of terrorism and extremism when the United States left them alone after the defeat of Soviet Union in late ’80s and then again during the US-led war against terrorism after 9/11.\nIn response to a question about Kashmir, he said the problem in India right now was that they had an extremist ideology of RSS (Rashtriya Swayamsevak Sangh), inspired by the Nazis in ’30s.\n“The founding fathers of the RSS, which is now ruling India, were inspired by Hitler…the racist Arian philosophy of Hitler. That’s why they have put eight million Kashmiris, who are Muslims, in an open prison,” he remarked.\nThe prime minister said he did not see much hope from “this (Modi) government” in India, but he did see that in future an Indian government and a strong leadership would want “this (Kashmir) problem” to be resolved.\nHe said the issue Kashmir, on which Pakistan and India had fought three wars, remained a biggest hurdle in the way of relations between the two South Asian nations.\nSince the two countries faced common challenges, the best way to reduce poverty and achieve prosperity was to resolve their issues and promote bilateral trade, he added.\nThe prime minister, however, regretted that India was denying the Kashmiris their just right of self-determination in line with the UN resolutions as well as the promises made by Indian leaders, including Jawaharlal Nehru.\nHe also mentioned the August 5, 2019 unilateral Indian action of annexing the Occupied Jammu and Kashmir, putting the Kashmiri leaders and youth behind bars, and keeping the eight million Kashmiris under siege.\nImran Khan said every problem had a solution and if there was a strong and clear-headed leadership, the problems (issue of Kashmir) could be resolved.\nAbout Pakistan’s economic situation, he said 2019 was a very difficult year for Pakistan. “But now fortunately we have brought the current account deficit down by 75 percent in one year, which was tough but good and I expect this year 2020 where Pakistan’s economy will show signs of recovery,” he added.\nTo a question about tourism, he said his government had opened up Pakistan and people from 70 countries could get visa at the airport. “We have opened up all our areas and now with 2019 being the safest year, our tourism doubled on one year,” he added.\nImran Khan said Pakistan probably offered the most unique tourism in the world because of its diversity. “Pakistan is undiscovered… Lot of hospitality here and now with peace and security in the country, we expect the level of tourism in Pakistan will grow quantumly,” he maintained.\nOn the issue of climate change, he said the present government had set targets of ten billion trees plantation in Pakistan, which would really improve environment, forest cover and bring back the wild life.\nHe, however, pointed out that Pakistan was also likely to be affected by the climate change more than other countries because it depended on rivers and 80 percent of water in rivers came from glaciers. “Because of the global warming, these glaciers are melting fast and that is a big worry for us,” he maintained.\nTo a question about cricket and his political career, the prime minister said he had more fans than anyone in Pakistan, for which he had great love.\n“…I could have spent the rest of my life actually just talking about cricket and living a very well life. But how much social work I would have done? I could never have helped so many people as you can in a government and build a welfare state,” he maintained To another question, he said, “As human beings all we have is the ability to struggle.\nWhether we succeed or not is not in our hands. It is in Almighty’s hands. So I don’t fear death, I don’t fear failure. All I know that I will try my best and once I try my best, I leave it to the Almighty. So whatever is His decision, I will accept it as a will of God.”",
  "retrievedAt": "2025-08-11T18:50:23.867Z"
}
