{
  "title": "Economic system based on values vital to remove economic disparity: AJK president",
  "link": "https://www.app.com.pk/national/economic-system-based-on-values-vital-to-remove-economic-disparity-ajk-president/",
  "date_published": "2020-02-21T04:15:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 21 (APP):The Azad Jammu and Kashmir President Sardar Masood Khan has said that the golden economic principles set by Islam 1,400 years ago, were a source of economic prosperity in this world as well as the source of salvation in the world hereafter.\n“The secret of equal distribution of resources and wealth lies in the enforcement of Zakat system in letter and spirit,” he added.\nHe was addressing the concluding session of two-day divine economics conference held at the State’s capital town on Friday under the auspices of Economics Department of Azad Jammu and Kashmir University.\nThe president said Islam has prohibited usury because of its exploitative aspect, and instead, it ordered for introduction of Zakat and charity because it promotes love and fraternity between the rich and the poor segments of the society.\nMasood said the Islamic order is based on the principles of accountability, and when all the individuals adopt this principle, socioeconomic injustice and difference between the rich and the poor vanishes automatically.\n“Awareness is taking place in the Muslim societies, and the people are once again turning to the socio-economic principles of Islam,” he said adding that at present more than 300 banks are doing interest-free business.\nThe AJK president said the concept of Hilal and Zabeeha ordained by Islam, is now getting popularity in Western societies also, and a multi-billion dollar market of Hilal food and Hilal meat has come into being in the world.\n“This is the second largest market after interest-free banking,” he said and added the concept of “not for profit” for public welfare and the social services currently in vogue in the West, was first of all introduced by Islam.\nThe conference was also addressing by Vice Chancellor of Azad Jammu and Kashmir University Dr Kalim Abbasi, Director Economic Development Syed Nisar Hussain Hamdani and others, while economists and social scientists from all across the country attended the conference.",
  "retrievedAt": "2025-08-11T18:50:11.583Z"
}
