{
  "title": "‘Ehsaas’ programme to benefit 1.4m people, more initiatives on cards: Sania Nishtar",
  "link": "https://www.app.com.pk/national/ehsaas-programme-to-benefit-1-4m-people-more-initiatives-on-cards-sania-nishtar/",
  "date_published": "2020-02-21T03:19:00.000Z",
  "source": "APP",
  "content": "LAYYAH, Feb 21 (APP):Special Assistant to Prime Minister on Social Protection and Poverty Alleviation, Dr Sania Nishtar, said that ‘Ehsaas Amdan’ Support Programme would directly benefit to 1.4 million people at 375 Union Councils across the country and promised more programmes under Ehsaas umbrella to benefit a larger population.\nWhile addressing the inaugural ceremony of Ehsaas Amdan Programme at Layyah on Friday, Dr Sania Nishtar said that Ehsaas Amdan programme was being launched to enhance the income of people from weaker segments of society.\nShe said that list of 23 districts was presented to Prime Minister Imran Khan and he decided to launch this programme from Layyah district.\nDr Sania said that the government would provide assets to people through this programme which would help enhance their income and improve their living standards on sustainable basis.\nShe informed that motorcycle-rickshaws, cattle heads, machines and shop items were being provided and added that each deserving person was getting assets worth Rs 60,000 free of cost.\nShe said that the 60 percent assets were being provided to women under the programme and added that technical training would also be provided to people in case of their willingness.\nMs Nishtar said that Rs 15 billion was set total budget for the programme which would be expanded in future.\nShe informed that more programmes would be introduced in next four months. She said that Ehsaas Amdan programme was not just one programme adding that Rs 2000 per month would be offered to poor and deserving women through the “Kifalat” initiative.\nShe said that scholarships would be offered to 50,000 students annually under the undergraduate scholarship programme.\nShe said that interest-free loans were also being given to 80,000 people under Ehsaas programme every month.\nShe said, beneficiaries of Ehsaas programme informed her that earlier they were earning only 100 to 150 per day but support under ‘Ehsaas’ increased their daily income to Rs 800-1000 per day.\nA beneficiary Kalsoom Bibi said that she had set-up a small shop in her home and was earning only Rs 100 daily which was insufficient for her kids to get education. She added that after getting shop items through this programme, her daily income would witness sizable increase.\nAnother beneficiary Muhammad Rafiq said, he used to sell cooked rice near educational institutions but daily earning was meagre.\nHe added that he hoped his per day income would rise up to Rs 1000 after getting handcart, rice and ghee he received through this programme.",
  "retrievedAt": "2025-08-11T18:50:17.367Z"
}
