{
  "title": "Govt to announce Hajj policy for private organizers soon: Federal Minister",
  "link": "https://www.app.com.pk/national/govt-to-announce-hajj-policy-for-private-organizers-soon-federal-minister/",
  "date_published": "2020-02-21T03:27:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 21 (APP):Federal Minister for Religious Affairs and Interfaith Harmony Pir Noor-ul-Haq Qadri has said that Hajj policy for the private organizers would be announced soon.\nSpeaking at the Lahore Chamber of Commerce & Industry (LCCI), he said that Hajj was a religious obligation, adding that the prime objective of the ministry was to provide the best services to the pilgrims.\nFederal Minister said that the government considered the private sector as its partner,\nadding private sector tour operators should try to set up Hajj programs and services as\nbeing offered by the other Islamic countries.\nThe minister said that Pakistan had a huge share in the business activity associated to Hajj. The government was also trying to provide at least for 3 year long-term Hajj policy for Private Sector instead of a single year policy, he said.\nThe Minister said that representatives of the chambers of commerce would also be taken on-board in the process of policy making for tour operators regarding Hajj operation.\nHe said that Lahore contributes a major part of the country’s economy, adding that “Lahore\nhas the potential to become the hub of economic activities not only in the country but in the region.”\nLCCI President Irfan Iqbal Sheikh hoped that Ministry of Religious Affairs would ensure\nuniformity in Hajj fares for public and private operators so that every aspirant can perform\nhis religious obligation.\nHe said that private Hajj scheme policy should be announced at the earliest.\nHe said that immediate announcement of policy would help organizers to do timely agreements in Mecca and Madina before the Hajj operation would be started.\nIrfan Iqbal Sheikh suggested that currency exchange rate should be fixed for private Hajj schemes to avoid changes in Hajj package.\nLCCI Senior Vice President Ali Hussam Asghar and Vice President Mian Zahid Jawaid Ahmad\nalso spoke on the occasion.\nConvener Standing Committee on Hajj and Umrah Tour Operators Jawaid Akhtar, Former Senior Vice President Amjad Ali Jawa, Executive Committee members Haji Asif Saher, Zeeshan Sohail Malik, Sheikh Sajjad Afzal and Haris Attique were present at the occasion.",
  "retrievedAt": "2025-08-11T18:50:14.250Z"
}
