{
  "title": "SBP governor briefs President Alvi on steps for differently abled persons",
  "link": "https://www.app.com.pk/national/sbp-governor-briefs-president-alvi-on-steps-for-differently-abled-persons/",
  "date_published": "2020-02-21T12:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 21 (APP):President Dr Arif Alvi on Friday chaired a discussion here on financial inclusion of differently abled persons and called for concerted efforts to facilitate economic empowerment of the focused groups.\nFirst Lady Samina Alvi also accompanied the president.\nThe event was hosted by SBP Governor Raza Baqir, who shared details of the regulatory instructions for the banks by the central bank and its own initiatives to address the problems facing by different categories of differently abled persons and their progress since 2018, an SBP statement said.\nThe dialogue was attended by senior officials of State Bank of Pakistan (SBP), presidents and chief executive officers of other banks, and representatives of Network of Organizations Working for People with Disabilities, Pakistan (NOWPDP).\nThe SBP governor welcomed the president and gave a detailed presentation on the two types of interventions by done the central bank for the differently abled persons. Those included initiatives taken by the SBP to facilitate the differently abled persons for accessing banking premises and services and, providing access to finance through various SBP refinance schemes.\nHe informed the president that for facilitating the people facing challenges related to upper and lower limbs, the State Bank had taken many initiatives, which included providing preferential treatment / out of queue assistance; construction of ramps at the entrance of existing branches and ATM cabins to allow easy access to special persons and wheelchair users; relaxation in the requirement of biometric verification for account opening; and facilitation desks for special persons at SBP main building and its offices countrywide.\nRegarding the steps taken by SBP to facilitate persons with visual impairment, the governor briefed about the special features of currency notes such as size, lines and dots; installation of Talking ATMs; provision of ATM/Debit and Internet banking facilities; and countrywide awareness sessions on features of currency notes.\nReferring to the second type of SBP interventions, Dr Baqir apprised the president about two credit schemes supported by the SBP for the financial inclusion of differently abled persons.\nThe first was Small Enterprise Financing and Credit Guarantee Scheme, which was available to differently abled persons holding computerized national identity cards (CNIC) with a special logo/symbol for setting up new business enterprises or for expansion of existing ones at a subsidized financing rate of 5% per annum for the tenor of five years, including grace period of up to six months.\nThe second SBP scheme was Financing Facility of Low Cost Housing for Special Segments including differently abled persons that provides subsidized loans to widows, children of Shaheed, transgender, special persons and persons in the areas severely affected by war against terrorism. Under the scheme, special segments can avail subsidized financing at 5% per annum, for the tenor of 12.5 years including grace period of up to 6 months.\nInformation about these schemes is available SBP website (http://www.sbp.org.pk/Incen-others/sme-7.asp and http://www.sbp.org.pk/Incen-others/Low.asp).\nLater on, the president made a detailed visit of the SBP Museum, along with the First Lady, and took interest in the precious stock of different showed items, including long range of coins starting from stone age, historical pictures and paintings including those Pakistan movement.",
  "retrievedAt": "2025-08-11T18:50:21.425Z"
}
