{
  "article_id": "2025-03-27_cbc27c01d94aeb0314928a8439394071",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-to-address-youth-ulema-convention-on-friday/",
    "retrieved_at": "2025-08-27T14:03:01.937Z"
  },
  "metadata": {
    "title": "PM to address youth, ulema convention on Friday",
    "author": null,
    "date_published": "2025-03-27T15:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 325,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 27 (APP): The dignified ceremony of \"Rab e Zuljalal ka Ehsaan - Pakistan\" and National Youth and Ulema Convention under Ministry of Information and Broadcasting will be held on Friday at Jinnah Convention Center, Islamabad. The event is organized in connection with Juma Tul Wida, especially 27th night of Ramazanul Mubarak. Pakistan was created on Laylat al-Qadr, Juma Tul Wida during Ramazanul Mubarak 1366 Hijri, August 14, 1947. Prime Minister Muhammad Shehbaz Sharif will attend the event as the chief guest and will address youth. He will highlight the role of youth in the progress of Pakistan, government's reform measures for youth and the future strategy. He will express his views on the basic ideology for the creation of Pakistan and on the country's importance in terms of its geography, defence and economy. He will highlight the fact that Pakistan came into being as an Islamic ideological state on 27 Ramazanul Mubarak (Shaab-e-Qadr) and it was based on the principle of \"Pakistan ka matlab kia? La ilaha illallah\". Pakistan has a unique status at the international level as it is the only Islamic nuclear power in the world. Pakistan's armed forces are not only the strongest military power in the Islamic world but also, in terms of professional capability, the best army in the world. The National Youth Convention will encourage youth to play an important role in national progress. Youth and people from all schools of thought will attend the ceremony. The participants will be informed about the government's different ongoing projects for education, employment, digital economy and business. Pakistan's geographical location makes it an important country at the international level. According to experts, Pakistan's position in South Asia allows it to play a critical role in the future international economic and geopolitical scenario. The convention will not only encourage youth to take part in national progress but will help them in becoming at par with the demands of the modern world.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}