{
  "article_id": "2025-03-27_fecbb0fff301f71a427001c2398aa709",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-education-ministry-partner-to-modernize-schools-boost-vocational-training/",
    "retrieved_at": "2025-08-27T14:03:22.876Z"
  },
  "metadata": {
    "title": "CDA, education ministry partner to modernize schools, boost vocational training",
    "author": null,
    "date_published": "2025-03-27T16:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 27 (APP):The Capital Development Authority (CDA) and the Ministry of Federal Education & Professional Training signed three key agreements on Thursday to revolutionize education, enhance vocational training, and promote environmental sustainability in Islamabad. The signing ceremony, attended by CDA Chairman Muhammad Ali Randhawa and Federal Education Secretary Mohyuddin Ahmad Wani, marked the launch of ambitious programs aimed at modernizing schools, empowering youth with job-ready skills, and engaging students in large-scale tree plantation drives. Under the first agreement, CDA Model School will be transformed into a modern educational hub equipped with an IT Park, Robotics Lab, and AI Room, Google Classroom, integration for digital learning ,upgraded classrooms, a modern library, and sports facilities. An on-site dispensary and a dedicated Cultural room to promote arts and heritage The second initiative focuses on providing skill development programs for youth (ages 18-45) living near Margalla Hills National Park. Trainees will learn, stitching, electrical work, plumbing, and IT skills, hands-on training through e-Rozgar labs, and job placement support from CDA upon completion. The third agreement introduces a massive tree plantation drive involving schools and colleges. Key features include, free saplings, tools, and technical support from CDA. The students will earn extra marks and certificates for participation long term maintenance plans to ensure sustainability. CDA Chairman Muhammad Ali Randhawa stated, \"These initiatives reflect our commitment to a modern, skilled, and eco-friendly Islamabad. By upgrading schools, empowering youth, and promoting green practices, we are building a brighter future for the capital.\" Federal Education Secretary Mohyuddin Ahmad Wani added, \"This partnership aligns with our mission to create a progressive education system that prepares students for 21st-century challenges, including climate change.\" The programs are set to roll out in the coming months, with CDA and the Education Ministry working closely to ensure successful implementation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}