{
  "title": "Defence Day reminds us of unprecedented courage of armed forces: President",
  "link": "https://www.app.com.pk/national/defence-day-reminds-us-of-unprecedented-courage-of-armed-forces-president/",
  "date_published": "2022-09-05T19:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): President Dr Arif Alvi Monday said the Defence and Martyrs Day of Pakistan reminded of the unprecedented courage and matchless valour displayed by the jawans and officers of our Armed Forces who have support and backing of the entire nation.In a message on the occasion of Defence and Martyrs Day on September 6, 2022, he said, “On this day, 57 years ago, we thwarted the evil design of the enemy and defeated it on all fronts. In that testing time, not only the Armed Forces of Pakistan fought fearlessly on ground, in air and in waters, but each and every citizen came out to defend and safeguard the motherland. 6th September, therefore, stands out in history as symbol of unwavering national resolve, absolute patriotism, profound professionalism and supreme sacrifice.”“It is the milestone that generations look upon to reinforce their resolve for keeping the defence of homeland dearer than their own lives. I salute the Martyrs who laid down their lives while fighting for the safety and security of motherland; I salute the families of the Shuhada for setting great example of sacrificing their loved ones; and I also salute the valiant Ghazis who heroically fought while defending every inch of our territory.”He said the nation as a whole and the jawans and officers of our Armed Forces have displayed the same ‘Spirit of September’, courage and commitment in all testing times – be it a war imposed by the enemy or a situation emerged out of a national calamity. Our success in the two decades long war against terror and the Pakistan Armed Forces’ contribution in peace missions worldwide is a matter of great pride which is also rightly acknowledged by the international community.\n“Pakistan is committed to peace and will continue to follow its policy of peaceful coexistence. At the same time, I must emphasize that our desire for peace must not be misconstrued as our weakness. We are well aware of our national as well as international obligations,” he added.He called upon India to abide by its international obligation of protecting human rights especially towards resolving the longstanding issue of Kashmir by following the UN Security Council Resolutions. Kashmir is the unfinished agenda of 1947 Partition.“It has to be resolved to mitigate the sufferings of Kashmiri people and to ensure lasting peace in the region. Being the supreme commander of the Armed Forces of Pakistan, it is a matter of great pride and satisfaction for me that the nation has complete confidence and trust in the capability, commitment, professionalism and combat readiness of our civil and armed forces as well as the security agencies to meet any kind of eventuality and face any kind of challenge at the external or internal front. I commend their role in national development and saving precious lives during floods or other natural disasters.”“I once again salute the valiant sons and daughters of soil who sacrificed their lives while defending the motherland. Let us make a resolve that while keeping alive the same ‘Spirit of September’ in our hearts, we shall continue to play our roles towards safeguarding the country as well as securing a prosperous future of the nation,” the President added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:32:08.203Z"
}
