{
  "title": "President rejects State Life’s appeals, directs to compensate families of policyholders",
  "link": "https://www.app.com.pk/national/president-rejects-state-lifes-appeals-directs-to-compensate-families-of-policyholders/",
  "date_published": "2022-09-06T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 6 (APP): President Dr. Arif Alvi while rejecting four similar representations preferred by State Life Insurance Corporation of Pakistan (SLICP) against the decisions of the Wafaqi Mohtasib, on Tuesday directed SLICP to pay Rs 1.78 million to the family members of the policyholders.\nHe said that by denying rightful dues to the claimants SLICP has committed maladministration.\nThe President disregarded the arguments of SLICP and said that SLICP had failed to prove the existence of alleged pre-insurance ailments with irrefutable evidence at the time of approving the life insurance policies to deceased policyholders.\nHe said that while filing appeals, the SLICP did not factor in the reports of its own Field Officers who had declared the insured persons as completely healthy.\nHe further observed that the denial of life insurance claims without irrefutable evidence was highly unjustified and reflected maladministration on the part of the SLICP.\nThe President held that in all four cases, no clinical investigation or diagnostic assessment had been produced by SLICP to corroborate that the deceased policyholders were in fact patients of different diseases.\nHe rejected all four representations and directed SLICP to report compliance to the Mohtasib within 30 days.\nAs per details, the complainants (Mst Irshad Bibi, Mst Samreen Aasima, Mr Muahammad Awais and Mr Muhammad Ismail) had approached SLICP for the payment of the sum assured as per the insurance policies.\nSLICP refused to pay the claims by alleging that the deceased policyholders had pre-insurance ailments, such as TB, Cystic Bronchiectasis, kidney disease or lung disease, which they willfully kept secret at the time of obtaining the policies.\nFeeling aggrieved, the complainants separately approached the Wafaqi Mohtasib to seek compensation, which passed the orders in their favour. Later, SLICP filed representations against the decisions of the Mohtasib with the President, which were also rejected.",
  "retrievedAt": "2025-08-11T15:31:58.745Z"
}
