{
  "title": "PM eulogizes armed forces, nation for carrying forward 1965 war legacy by defeating terrorism",
  "link": "https://www.app.com.pk/national/pm-eulogizes-armed-forces-nation-for-carrying-forward-1965-war-legacy-by-defeating-terrorism/",
  "date_published": "2022-09-05T19:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): Prime Minister Muhammad Shehbaz Sharif has said that it is a matter of great pride that the valiant armed forces and the brave Pakistani nation have carried forward the proud legacy of the 1965 war by successfully defeating the monsters of terrorism and extremism in their two-decade-old struggle.\n“Hats off also to the heroes and ghazis, the men and women in uniform, the personnel of police and other law enforcement and intelligence agencies, who are vigilantly safeguarding the frontiers of the motherland from the external and internal threats in harsh weathers and hostile environments,” the prime minister said in a message on “Defence and Martyrs Day of Pakistan” being observed on Tuesday.\nToday, he said, the nation was paying its rich tributes to the brave sons of the soil, especially the worthy martyrs who laid down their lives while fearlessly and bravely fighting against the enemy, who was much bigger in numerical strength.\n“We owe great respect to the parents and families of Shuhada who courageously bore the loss of their near and dear ones,” he added.\nWhile they were celebrating the Diamond Jubilee of Pakistan’s Independence this year, the prime minister said his message on the day to the sons and daughters of soil was to keep the flame and the spirit of September 6 alive in their hearts.\n“I call upon the nation to forge unity in their ranks, for no conspiracy and challenge can succeed if the people are united in their resolve to protect their freedom and defeat such nefarious elements,” he added.\nHe said the best tribute to the sacrifices of their martyrs was to rebuild Pakistan in line with the vision of the founding fathers.\n“A country that is strong economically, stable politically and harmonious socially can better defend itself, and promote and safeguard its vital foreign policy objectives. This is what the coalition government is aiming to achieve,” he added.\nThe prime minister said the 6th of September was remembered as a symbol of courage, display of unmatched resilience and the spirit of supreme sacrifice by the valiant sons of the soil.\nOn this day, 57 years ago, the brave armed forces of Pakistan proved to the world that they were ever ready to defend every inch of the motherland, no matter what the cost, he added.\nThe entire Pakistani nation, the prime minister said, while displaying unprecedented unity and resolute strength, came forward for the support of their armed forces.\nThe show of unprecedented unity and solidarity of the nation galvanized the officers and jawans, pilots and sailors in their fight to secure the motherland against the Indian aggression, he added.\n“On this occasion today, I congratulate the military leadership on successfully bringing Operation Raddul Fasaad to its logical conclusion. I also commend the role of the security forces, especially the army and navy personnel in saving the lives of thousands of people during recent floods in Balochistan, Sindh, Khyber Pakhtunkhwa and Southern Punjab,” the prime minister said.\nHe said Pakistan’s armed forces’ role in maintaining peace in various countries under the United Nations banner was also being acknowledged worldwide. It showed their commitment to the establishment of sustainable peace, particularly in the region.\n“This commitment is the hallmark of our foreign policy. However, with the desire for durable peace, Pakistan cannot remain oblivious to the need for the strengthening of our defence and the procurement of modern-day equipment despite the difficult economic situation,” he added.\nThe Indian Illegally Occupied Jammu and Kashmir was a flashpoint between the two nuclear powers of South Asia, the prime minister said, adding the sooner it was resolved according to the UN resolutions, the better it was for the regional peace and development.\n“I urge the international community to bring their influence to bear upon New Delhi to reverse the actions it took with respect to IIOJ&K on August 5, 2019. The ball to create a conducive environment for the resolution of the meaningful talks with Pakistan is in India’s court,” he added.",
  "retrievedAt": "2025-08-11T15:32:09.981Z"
}
