{
  "title": "9 UAE charity organisations join volunteering initiative to support flood-hit Pakistan",
  "link": "https://www.app.com.pk/national/9-uae-charity-organisations-join-volunteering-initiative-to-support-flood-hit-pakistan/",
  "date_published": "2022-09-06T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): Another nine local humanitarian organisations from the United Arab Emirates have joined the “We Stand Together” volunteering initiative launched to pack and deliver thousands of emergency relief kits to the flood-stricken people of Pakistan.\nThe initiative was launched by the Emirates Red Crescent Authority, Dubai Cares, and Sharjah Charity Association.\nAmong the organizations which joined the initiative included Khalifa Bin Zayed Al Nahyan Foundation, Mohammed Bin Rashid Al Maktoum Humanitarian and Charity Establishment, The Big Heart Foundation, Dar Al Ber, International Humanitarian City, UAE Water Aid Foundation (Suqia UAE), Sharjah Charity House, International Charity Organisation and Emirates Charitable Association.\nThe community volunteering event will take place simultaneously on Saturday, September 10, 2022 at 9:00 am across three locations in the UAE.\nThe citizens, expatriates, families, children, seniors and people of determination have been encouraged to sign up for the volunteering initiative on https://volunteers.ae/ as soon as possible and gather at their preferred venue before the assembly of the relief kits gets underway.\nThe children will also have the opportunity to write and draw positive messages, which will be placed inside the relief boxes to show solidarity with the people of Pakistan and offer a sense of hope during this time of crisis.\nThe relief kits will include food supplies such as flour, rice, lentils, and oil among other non-perishable items, while the hygiene kit will include essential toiletries for women and children such as diapers, sanitary napkins, and soaps to list a few.\nHamoud Abdullah Al Junaibi, Secretary-General of the Emirates Red Crescent, said, “This initiative reflects the solidarity of the UAE leadership and people with those affected by the torrential rains and floods in Pakistan and reinforces its leading role in reducing the humanitarian repercussions of natural disasters on the lives of victims and affected people.”\nAl Junaibi said that the ERC will spare no effort to enhance the “We Stand Together” initiative and will work in coordination with its partner organisations.\nDr. Tariq Al Gurg, Chief Executive Officer and Vice-Chairman of Dubai Cares, said, “With the deteriorating situation in Pakistan, the lives of millions in the country are at stake. Our joint volunteering initiative with other humanitarian organisations, to deliver relief kits, aims to provide yet another opportunity to the entire UAE community to stand in solidarity with the families of those who have lost everything to this natural catastrophe.\nAbdullah Sultan Bin Khadim, Chief Executive Officer of Sharjah Charity International, said, “The UAE has always been a pioneer in supporting the affected peoples. With all our hearts and with all means of support, we affirm our stand by Pakistan in its affliction as a result of severe floods.”",
  "retrievedAt": "2025-08-11T15:31:55.328Z"
}
