{
  "title": "Govt ‘actively engaged’ with UK to get PIA ban lifted: Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Deputy Prime Minister and For­eign Minister Ishaq Dar said on Saturday that the Ministry of Foreign Affairs is “actively engaged” with UK authorities to secure the lifting of a ban on Pakistan International Airlines (PIA) flights.\n\nHe said this during a meeting with the airline’s chief executive, Air Vice Marshal Amir Hayat, who requested fresh diplomatic support to remove the long-running flight ban.\n\nMr Hayat appreciated the foreign minister’s continued support in helping to remove the ban on PIA flights to various countries.\n\nHe noted that compliance work begun under the Pakistan Democratic Movement (PDM) coalition government of 2022-23 enabled both PIA and the Civil Aviation Aut­hority (CAA) to satisfy Inte­rnational Civil Avia­tion Organisation aud­itors, paving the way for the European Union Aviation Safety Agency (EASA) to lift its own suspension in November 2024.\n\nFlights to the UK and Europe were halted in June 2020 after then aviation minister told parliament that roughly one-third of the country’s com­m­ercial pilots held “dubious” licences — a statement made in the aftermath of the May 22, 2020, crash of Flight PK8303 in Karachi, which claimed 97 lives.\n\nThe UK Civil Aviation Authority suspended PIA’s operating permit on June 30 that year, mirroring EASA’s action a day earlier.\n\nRegulators cited systemic failures in licensing oversight and airline safety management. The grounding deprived PIA of one of its most lucrative long-haul markets and cost nearly 40 billion a year in lost revenue, according to government records presented in parliament.\n\nAfter three years of remedial work — ranging from re-validation of pilot credentials to overhauling safety protocols — EASA reinstated PIA’s Third-Country Operator authorisation on Nov 29, 2024.\n\nEarlier this year, the carrier resumed flights to Paris and plans to add further European destinations this summer.\n\nPower sector meeting\n\nIn a separate development, Mr Dar reaffirmed the government’s commitment to making balanced decisions that uphold financial discipline without imposing an undue burden on the public.\n\nMr Dar chaired a high-level meeting to review matters related to the power sector. The meeting was attended by the ministers for power and petroleum, Special Assistant to the Prime Minister Tariq Bajwa, and senior officials, according to a press release issued by the Deputy Prime Minister’s Office.\n\nDiscussions centred on key aspects of the power sector, with a focus on ensuring financial sustainability and consumer protection.\n\nPublished in Dawn, June 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:49:02.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920888/govt-actively-engaged-with-uk-to-get-pia-ban-lifted-dar",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T01:24:08.000Z"
}
