{
  "title": "Strike shuts down Bangladesh’s biggest port - World - DAWN.COM",
  "author": null,
  "content": "Operations at Bangladesh’s biggest port were suspended on Sunday as a strike by customs officials brought shipping activity to a halt.\n\nThe shutdown at Chittagong Port is part of an ongoing dispute between tax authority employees and the government, which is trying to overhaul the body.\n\n“The port typically handles around 7,000 to 8,000 containers daily … But since this morning, there has been no movement in offloading or onboarding of goods,” said Mohammed Omar Faruq, secretary of the Chittagong Port Authority.\n\n“This is having a huge impact on the country’s economic situation,” he told AFP.\n\nBangladesh is the world’s second-largest garment manufacturer, while textile and garment production accounts for about 80 per cent of the country’s exports.\n\nMahmud Hasan Khan, president of the Bangladesh Garment Manufacturers and Exporters Association, said the halt in port operations would cost the industry $222 million.\n\n“The cost of recovery will be staggering — beyond comprehension — and many factories risk going bankrupt,” he told AFP.\n\nStaff at the National Board of Revenue (NBR) have been striking on and off for weeks over plans to split the authority into two separate bodies.\n\nBangladesh’s interim leader, Nobel Peace Prize laureate Muhammad Yunus, urged them to end the walkout.\n\n“We hope NBR’s staff will report back to work, setting aside their unlawful programme that goes against the national interest of the country,” his office said in a statement. “Otherwise, for the sake of the people of this country and safeguarding the economy, the government will be left with no option but to act firmly.”\n\nNBR staff were prevented from entering their offices on Sunday after a government order sought to stop them from protesting within their building premises.\n\nMeanwhile, 13 business chambers held a press conference on Saturday, urging the government to resolve the issue as soon as possible.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2920205119a74a3.jpg",
  "retrievedAt": "2025-08-20T04:31:36.615Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921023/strike-shuts-down-bangladeshs-biggest-port",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T15:23:40.000Z"
}
