{
  "title": "PSX hits record high as Mideast ceasefire drives relief rally - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) closed the outgoing week on a bullish note, with the benchmark KSE-100 index surging 3.6 per cent week-on-week to settle at an all-time high of 124,379.06 points.\n\nThe rally was driven by investor optimism following a ceasefire agreement between Iran and Israel, which eased geopolitical concerns and spurred aggressive pre-fiscal year-end buying.\n\nAccording to Topline Securities Ltd, the KSE-100 gained 4,355.83 points or 3.63pc during the week, supported by expectations of foreign inflows and reduced regional tensions. The market witnessed a sharp turnaround mid-week, with the index recording its second-largest single-day gain of 6,079 points (5.23pc day-on-day) after news of the ceasefire broke.\n\nA major positive development came in the form of China’s reported willingness to reschedule $1.8bn in debt for two years. Meanwhile, the government raised Rs323bn in the latest T-bill auction out of a total participation of Rs2,299bn, with yields declining by 5-9 basis points. However, the State Bank of Pakistan’s (SBP) foreign exchange reserves fell sharply by over $2.6bn to $9.06bn for the week ended June 20, owing to large external debt repayments. The central bank expects a $3bn inflow next week, which could help bolster reserves.\n\nKSE-100 index ends week with a gain of 4,356 points, or 3.6pc\n\nThe rupee depreciated marginally, losing Rs0.02 to close at 283.72 against the US dollar. Trading activity slowed, with average daily volume down 14.4pc week-on-week to 736m shares, although traded value jumped 40.8pc to $110.4m.\n\nArif Habib Ltd noted that the market opened cautiously amid heightened Middle East tensions but turned decisively positive following the ceasefire, restoring investor confidence. The SBP raised Rs345bn in another T-bill auction against a target of Rs650bn, while also raising Rs251.5bn through GoP Ijara Sukuk, surpassing the Rs175bn target. Power generation rose 1pc year-on-year in May to 12,755 GWh, while Roshan Digital Account (RDA) inflows reached $10.4bn by the same month.\n\nSector-wise, key contributors to the index’s gains included commercial banks (1,120 points), cement (691 points), fertiliser (629 points), exploration and production (577 points), and glass and ceramics (146 points). On the downside, the miscellaneous sector (84 points), leasing (0.2 points), textile weaving (0.1 points), and sugar (0.1 points) posted minor negative contributions.\n\nAmong individual scrips, major gainers included Lucky Cement (382 points), Fauji Fertiliser (357 points), UBL (319 points), Meezan Bank (316 points), and OGDC (192 points). Detractors included Pakistan Services Ltd (133 points), Packages Ltd (96 points), International Steels (7 points), Colgate-Palmolive (6 points), and SNGPL (5 points).\n\nForeign investors turned net sellers, offloading $11.78m worth of equities compared to net buying of $0.46m in the previous week. The heaviest selling was seen in exploration and production ($2.4m) and fast-moving consumer goods ($2.2m). On the domestic front, mutual funds ($14.8m) and insurance companies ($6.15m) were prominent buyers.\n\nAccording to AKD Securities, despite a decline in average daily volume, investor sentiment remained upbeat, bolstered by the federal budget approval for 2025-26 and the SBP’s assurance of achieving its $14bn reserves target, supported by expected inflows of $3.6bn.\n\nAdditional supportive data inclu­ded a 25pc year-on-year increase in consumer confidence in the fourth quarter of CY2025—the highest since 2022 — and a 14pc month-on-month rise in RDA inflows in May. Power generation also edged higher due to lower electricity tariffs.\n\nThe PSX is expected to maintain its bullish trajectory heading into the new fiscal year, underpinned by easing inflation expectations and strong corporate earnings. The consumer price index (CPI) for FY2026 is projected to decline to 4.4pc year-on-year, down slightly from 4.5pc in FY25, which may create room for monetary easing.\n\nThe KSE-100 index is trading at a forward price-to-earnings ratio of 6.4x for 2025, compared to its 10-year average of 8.0x, while offering a dividend yield of around 8.4pc — well above the historical average of 6.5pc.\n\nPublished in Dawn, June 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:31:58.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920878/psx-hits-record-high-as-mideast-ceasefire-drives-relief-rally",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T01:24:25.000Z"
}
