{
  "title": "At least 8 dead, 13 injured in rain-related incidents across Punjab, Sindh, and GB officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least eight more people were killed and 13 injured on Sunday in separate rain-related incidents across Karachi, some areas of Punjab, and Gilgit Baltistan, according to rescue officials.\n\nMonsoon rains, which fall across the region from June to September every year, continue to lash many parts of the country, prompting authorities to release an urban flooding warning for several cities. According to rescue officials, at least 32 people have been killed across four provinces over the last two days as heavy rains triggered flash floods and damaged houses. Meanwhile, some people lost their lives due to electrocution.\n\nOn Sunday, Rescue 1122 issued a statement outlining more deaths and injuries in Lahore as a result of rain-related incidents.\n\n“Rescue 1122 received 10 emergency calls about collapsing walls in different parts of the city,” the statement read. “One woman was killed and 10 others were seriously injured. They were moved to different hospitals and received medical aid in Rescue Emergency ambulances.”\n\nThe statement added that there were also reports of falling trees across Lahore due to strong winds and rain, however, there were no fatalities or injuries.\n\n“Rescue 1122 staff are present at the highways and are removing fallen trees from the roads,” the statement added.\n\nHowever, in a separate report, Rescue 1122 said that a billboard fell due to the intense rain and wind and fell on a motorcyclist and his family in Lahore.\n\nAccording to Rescue 1122, the 50-year-old motorcyclist was killed, while his 35-year-old wife and child were injured, bringing the overall death toll to eight. The injured were transported to Jinnah Hospital.\n\nIn Karachi, two people, including the younger brother of former lawmaker and PPP Karachi leader Javed Nagori, were electrocuted in rain-related incidents, according to officials and relatives.\n\nCity Senior Superintendent of Police (SSP) Arif Aziz told Dawn.com that Abdullah Anwar, 41, was sitting at a meeting place in Khadda Market near Sumair Arcade in Lyari, where an electric wire had fallen.\n\nHe said Anwar attempted to plug something into a rainwater-drenched wall socket when he suffered an electric shock and died. The SSP said the victim was dead with the wire in his hand when the police arrived.\n\nThe body was moved to the Civil Hospital Karachi, where doctors confirmed the cause of death as an electric shock, said police surgeon Dr Summaiya Syed.\n\nNagori, while speaking briefly to Dawn.com, confirmed that the victim was his younger brother.\n\nIn another incident, a young man was electrocuted in the metropolis’ Clifton area. Boat Basin Police Station House Officer Malik Riaz Niazi said the man, in his early 30s, was passing by the Parklane Hospital when he apparently touched a wet electric pole and suffered an electric shock.\n\nThe body was moved to the Jinnah Postgraduate Medical Centre (JPMC) for legal formalities, where his identity could not be ascertained immediately.\n\nEarlier in the day, rescue official Sherbaz Khan confirmed to Dawn.com that two sisters died after being swept away by flood waters in the Kargah Nala of Gilgit Baltistan.\n\nMeanwhile, in Punjab’s Sharifpura, two people were killed and one injured when the roof of a mud house collapsed. The bodies and the injured were shifted to Services Hospital, according to Rescue 1122.\n\nHeavy rains were recorded in various districts of Punjab over the past 24 hours, according to Irfan Ali Kathia, Director General of the Provincial Disaster Management Authority (PDMA).\n\nLahore Airport recorded 65 mm of rain, while 32mm was recorded in Chakwal and 14mm in Dera Ghazi Khan 14. Rain was also recorded in Attock, Noorpur, Thal, Narowal, Kasur, Jhang, Toba, Tek Singh, Bhakkar and Khanewal.\n\n“This spell of monsoon rain will likely continue until July 1,” Kathia was quoted as saying.\n\n“Monsoon rains are also expected across most districts of Punjab in the next 24 hours,” he said.\n\nThe DG urged citizens to take precautionary measures and stay in safe places during thunderstorms.\n\n“Keep the speed of the vehicle slow and maintain a reasonable distance. In case of emergency, contact PDMA helpline 1129.”\n\nPunjab Chief Minister Maryam Nawaz directed the Water and Sewage Authority (Wasa) to remain on full alert in Lahore as heavy rains and strong winds began in various parts of the city.\n\nRain was recorded in Lakshmi Chowk, Qurtaba Chowk, Mazang, Data Nagar, Islampura, Shahdara, Ek Moria, Bhati Gate, Baghbanpura and Gulshan Ravi.\n\nThe Punjab CM directed senior Wasa officials to keep all main highways and underpasses clear, with pumps and staff ready at all underpasses.\n\nInstructions were issued to keep all generators on standby with their fuel supply ensured, while field teams were instructed to remain active.\n\nIt was recommended that disposal stations be run on generators in areas with power outages, with the pumps of all disposal stations being kept clean and operational.\n\nAll town directors were directed to maintain complete monitoring of their towns.\n\nThe GB Disaster Management Authority issued a warning of increased risk of glacial lake outburst floods (GLOF) and flash floods.\n\n“Due to intense heat and the western weather system, the ice in the glaciers of GB is melting rapidly, resulting in an increased risk of glacial floods and flash floods.\n\n“This situation can pose a serious threat to communication roads, bridges, agricultural lands and human life and property,” the alert said.\n\nThe public and tourists were requested to ensure their safety and avoid unnecessary travel in extreme or uncertain weather conditions.\n\nThey were also advised to avoid going near rivers, streams and other waterways, and avoid bathing or washing clothes in streams since the water flow can reach dangerous levels.\n\n“The public is urged to avoid staying unnecessarily on glaciers, river banks or bridges, cross floodwaters on foot or any vehicle, and remember the instructions issued by rescue agencies.”\n\nThe district administration reiterated in its alert that natural disasters can strike at any time, and necessary precautions should be undertaken. “In case of any emergency, immediately contact the district control room at 920724-05811.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/06/29192128735e5c4.jpg",
  "retrievedAt": "2025-08-20T04:31:40.452Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921009/at-least-8-dead-13-injured-in-rain-related-incidents-across-punjab-sindh-and-gb-officials",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T11:09:25.000Z"
}
