{
  "title": "71 killed in Israeli strike on Tehran’s Evin prison: Iranian judiciary spokesperson - World - DAWN.COM",
  "author": null,
  "content": "Israel’s attack on the Evin prison in Iran’s capital, Tehran on June 23 killed 71 people, Iranian judiciary spokesperson Asghar Jahangir said on Sunday.\n\nAt the end of an air war with Iran, Israel struck Tehran’s jail for political prisoners, in a demonstration that it was expanding its targets beyond military, civilian and nuclear sites to aim at symbols of Iran’s ruling system. According to Iranian health ministry figures, 610 people were killed on the Iranian side in the 12-day war, 13 of them children and 49 women, before a ceasefire went into effect last week.\n\n“In the attack on Evin prison, 71 people were martyred, including administrative staff, youth doing their military service, detainees, family members of detainees who were visiting them and neighbours who lived in the prison’s vicinity,” Jahangir said in remarks carried on the judiciary’s news outlet Mizan.\n\nJahangir had previously said that part of Evin prison’s administrative building had been damaged in the attack, and people were killed and injured. The judiciary added that the remaining detainees had been transferred to other prisons in Tehran province.\n\nEvin prison holds a number of foreign nationals, including two French citizens detained for three years.\n\n“The strike targeting Evin prison in Tehran, put our citizens Cecile Kohler and Jacques Paris in danger. It is unacceptable,” France’s Foreign Minister Jean-Noel Barrot had said on social media X after the attack.\n\nAdditional input from AFP.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:31:42.133Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920986/71-killed-in-israeli-strike-on-tehrans-evin-prison-iranian-judiciary-spokesperson",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T07:03:03.000Z"
}
