{
  "title": "16 years on, Sammi Deen Baloch awaits father’s return - Pakistan - DAWN.COM",
  "author": null,
  "content": "Activists and civil society members gathered at the Karachi Press Club on Sunday to mark 16 years since the disappearance of Dr Deen Mohammad Baloch, as his daughter Sammi Baloch, still holding on to hope, vowed her faith in his return would never fade.\n\nOn June 28, 2009, Deen Mohammad Baloch was reported missing after he was allegedly picked up by unknown men from the hospital where he worked in Balochistan’s Khuzdar district. A father of three, Dr Deen was one of the many Baloch people who have gone missing in the province — an issue that remains largely unaddressed, despite persistent pleas of their families, who still long for their loved ones to return, uncertain whether they are dead or alive.\n\nAccording to the Commission of Inquiry on Enforced Disappearances (COIOED) — a governmental body set up in 2011 to trace missing persons — the total number of missing persons cases received up to December 2024 was 10,467, while 8,216 cases were disposed of, with a total of 6,599 people traced so far.\n\n“In these 16 years, I have tried everything — protested on the streets since I was a child, endured violence at the hands of police, pleaded in front of courts, spent time in jail — just to find where my father is,” said Sammi, a social rights activist.\n\nAddressing the audience at the gathering, Sammi, who was 10 when her father went missing, said: “I am still the same Sammi I was when my father was taken away, a grieving daughter who has been longing for her father’s return for 16 years now.\n\n“Today, I find myself in the same position I was 16 years ago — restless, uncertain and stuck in a cycle of never-ending wait.”\n\nSpeaking of her years-long struggle, she said, “My slogans, my hope and the tears in my eyes have not changed over these years, but instead of justice, all I ever received from the state was deafening silence”.\n\nAnd yet she remained hopeful of her father’s return, “My voice may get drowned out in the hubris, but my hope for my father’s return will never waver,” she said.\n\nSpeaking to Dawn.com, Sammi expressed despair about the future, alleging that “state repression of Baloch activists had intensified in recent months.”\n\n“We don’t know when we might be picked up, jailed, or have a case filed against us.”\n\nIn March, Sammi was detained during a protest at the Karachi Press Club calling for the release of Baloch Yakjehti Committee (BYC) leaders arrested in Quetta, including group leader Mahrang Baloch. BYC is a Baloch rights advocacy group working since 2018.\n\nSpeaking at the event, veteran journalist Mazhar Abbas raised alarm that the “space for political dialogue on the issue was rapidly closing”.\n\n“A political matter should only be resolved through political means,” Abbas said, adding that sweeping issues under the carpet was “going to make matters worse”.\n\nJournalist Wasatullah Khan cautioned that by doing nothing, “we are leaving the course of events to time itself.”\n\nHuman Rights Commission of Pakistan (HRCP) President Asad Butt questioned how, in 16 years, the state had been unable to tell whether Dr Deen Mohammad is alive.\n\nButt urged people to stand with the Baloch cause, stating that the even if one person was missing, it raised serious questions about the entire justice system, adding that “remaining silent in the face of such injustice is a cruelty in itself”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2922400887b07ee.jpg",
  "retrievedAt": "2025-08-20T04:31:36.700Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921031/16-years-on-sammi-deen-baloch-awaits-fathers-return",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T18:23:23.000Z"
}
