{
  "title": "Experts warn of surge in water, vector-borne diseases - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: As the first spell of monsoon rains makes its strong presence felt, health experts have raised the alarm over a potential surge in waterborne and vector-borne diseases, given the poor state of the city’s sanitation, drainage and waste disposal systems.\n\nThey warned that the wet season could spell disaster for public health if the authorities failed to take immediate preventive measures and citizens continued to show negligence.\n\n“There is a dire need for both collective and individual action right now. The first step is to prevent the accumulation of rainwater in lanes and streets, as stagnant water provides ideal breeding grounds for mosquitoes. This is crucial if we want to make a real difference this year,” said Dr Altaf Hussain Khatri, a senior general physician practising in the old city area.\n\nAccording to him, while cases of waterborne and vector-borne diseases occur throughout the year, their frequency and severity increase significantly during the monsoon season.\n\n“For instance, malaria cases are seen in large numbers across the province throughout the year. Some malaria parasites remain dormant in the liver. They can reactivate later, causing a new infection,” he explained, adding that water contamination that occurred due to leakage of lines was also a major hazard in this season.\n\nNeed stressed for preventing accumulation of rainwater to curb breeding of mosquitoes\n\n“Water contamination leads to break out of several diseases, including skin conditions, which have already been on the rise recently due to persistent heat.”\n\nDr Abdul Ghafoor Shoro, another senior general physician who runs clinics in Keamari and F.B. Area, expressed concern over waterborne diseases, especially typhoid, cholera, hepatitis, and gastroenteritis, which see a sharp increase during and after the monsoon season.\n\n“Typhoid spreads through contaminated food and water, often leading to high fever, fatigue, and gastrointestinal issues. The rise of multi-drug resistant typhoid is particularly worrying. Cholera, a severe diarrhoeal infection caused by contaminated food or water, leads to rapid dehydration and can be fatal if not treated promptly,” he warned.\n\nHe further noted that stomach infections causing vomiting and diarrhoea are particularly dangerous for children and the elderly due to the heightened risk of dehydration.\n\nPMA advises people to exercise caution\n\nThe Pakistan Medical Association (PMA), in a press statement, advised the public to use clean drinking water, practise strict hygiene and consume only home-cooked food.\n\n“Eliminate all stagnant water sources around homes and neighbourhoods. This includes regularly emptying and cleaning water containers, flower pots, discarded tyres, and blocked drains. Use mosquito nets, repellents, and coils, particularly during dawn and dusk.\n\n“Wear full-sleeved clothing to minimise exposed skin. Do not self-medicate if you experience symptoms like fever, diarrhoea, vomiting, body aches, or skin rashes. Visit a qualified doctor or the nearest healthcare facility immediately for proper diagnosis and treatment. Early diagnosis and treatment can be life-saving,” the statement advised.\n\nThe association also called on municipal authorities to take urgent steps to improve sanitation, ensure a clean water supply and launch fumigation drives in high-risk areas.\n\n“The health and well-being of citizens is paramount. We urge everyone to take this advisory seriously and adopt these preventive measures to safeguard themselves and their families from the looming health threats of the monsoon season. A collective effort is essential to prevent widespread outbreaks,” it added.\n\nPublished in Dawn, June 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:48:42.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920834/experts-warn-of-surge-in-water-vector-borne-diseases",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T01:24:50.000Z"
}
