{
  "title": "Efforts on to increase annual remittance to $50bn within five years - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Efforts have been started to encourage overseas Pakistanis to remit funds through official channels and increase annual remittance volume to $50 billion within five years.\n\nAccording to a statement, Chief Executive Officer of UK-based ACE Money Transfer Rashid Ashraf conducted a series of strategic meetings in Islamabad with Finance Minister Mohammad Aurangzeb and other senior government officials to discuss collaborative efforts aimed at strengthening Pakistan’s financial infrastructure and enhancing formal remittance inflows.\n\nA key focus of discussion was the development of structured incentive programmes to encourage overseas Pakistanis to remit funds through official channels and increase annual remittance volume to $50 billion within five years.\n\nIn a separate engagement with Information Minister Attaullah Tarar, the dialogue centered on strengthening public awareness around the significance of legal remittances.\n\nFurther consultations were held with Federal Minister for Overseas Pakistanis and Human Resource Development Salik Hussain and Parliamentary Secretary Ihsanul Haq Bajwa.\n\nThe discussions highlighted the role of overseas communities as key contributors to national development.\n\nTopics included formalising undocumented migration and money transfer channels, enhancing the arrival experience at ports of entry, and introducing state-led recognition initiatives for overseas Pakistanis who make significant contributions in their respective fields.\n\nPublished in Dawn, June 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:31:44.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920934/efforts-on-to-increase-annual-remittance-to-50bn-within-five-years",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T03:56:56.000Z"
}
