{
  "title": "PML-N leader questions Trump’s eligibility for Nobel Peace Prize - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Slams US, Israel over Iran attack, calls for stronger Muslim unity • Says global institutions like UN and ICJ have lost their effectiveness\n\nISLAMABAD: PML-N leader Lt Gen (Retd) Abdul Qayyum has questioned US President Donald Trump’s eligibility for the Nobel Peace Prize in light of his administration’s actions.\n\nIn an interview with a Bangladeshi media outlet, Gen Qayyum, who is also the president of the Pakistan Ex-Servicemen Society (PESS), said the recent US attack on Iran was a clear breach of international law.\n\nHe noted that America’s actions have severely damaged its global credibility. “Acting at Israel’s behest, the US operation has proven that there is currently no effective international law in place.”\n\nSpeaking about Israel’s objectives in attacking Iran, he pointed out that former US president Bill Clinton recently remarked that Prime Minister Netanyahu’s primary aim is to prolong his political rule.\n\nHis second aim, he said, was to drag the US into this war, a strategic blunder made by President Trump under the influence of Jewish lobbies embedded in powerful US institutions. The third objective is for Israel to dominate its neighbouring Arab countries and establish a Greater Israel.\n\nInstitutions become ineffective\n\nHe regretted that institutions like the United Nations and the International Court of Justice have become ineffective. “This will strengthen the global standing of powers like China and Russia, while countries like Israel, India, and the United States — who are blatantly violating international laws and conventions — will face diplomatic isolation”, he noted.\n\nAnswering a question, he said regions like Kashmir, Palestine, Ukraine, Taiwan, and the South China Sea were hotspots involving nuclear-armed countries and unresolved conflicts.\n\nThe PML-N leader said Pakistan holds a strategically vital position in the region, which the US acknowledges. He also said Pakistan has long been contributing significantly to UN peacekeeping missions. He stressed that Pakistan acted with restraint in avoiding a nuclear war with India.\n\nWhen asked whether Pakistan had any role in the attack on Iran, Gen Qayyum strongly denied the allegation, calling it false propaganda spread by anti-Pakistan elements.\n\n“Pakistan firmly stands by its brotherly neighbour Iran during these difficult times because Iran is in the right, and war has been imposed on it by Israel.”\n\nPublished in Dawn, June 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:48:45.058Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920874/pml-n-leader-questions-trumps-eligibility-for-nobel-peace-prize",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T01:24:19.000Z"
}
