{
  "title": "Pakistan thrash South Korea 91-6 at Asian Youth Netball Championship - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan thrashed hosts South Korea 91-6 at the Asian Youth Netball Championship on Sunday to mark their third consecutive win of the tournament.\n\nThe green shirts had a strong first quarter to lead 23-2 and extended their lead to 45-3 by halftime.\n\nThe score was 70-4 in the third quarter, and the women managed to end the game 91-6 to sit at the top of the rankings of Pool B.\n\nAccording to details, Leya Raza Shah, Alisha Naveed, Haleema, Sarina Hussain, Jasmine Farooq, Farah Rasheed , Amani, Parisa , Sumayya Ahmed and Alina were recognised as outstanding players in the match.\n\nSenior officials of the Pakistan Netball Federation congratulated the team on their victory.\n\nPakistan now faces Japan on Monday and the Maldives a day later.\n\nIn a post on Instagram, the netball federation extended its gratitude to coach Amanda Newton “for her exceptional coaching, technical expertise, and unwavering dedication to the Pakistan Youth Girls Netball Team.”\n\n“Under her guidance, our team has shown incredible skill and determination, leading to continuous victories at the Asian Youth Netball Championship 2025 in Jeonju, Korea (June 27 - July 4).\n\n“Your passion and commitment have inspired our players to reach new heights. Thank you for believing in Team Pakistan!”\n\nPakistan opened the tournament with a strong 71-15 over Saudi Arabia on Friday, followed by a 56-32 victory over Chinese Taipei on Saturday.\n\nThe tournament is taking place from June 27 to July 4 at the Jeonju Hwasan Gymnasium in South Korea.\n\nEleven teams are participating in the championship and are divided into two groups.\n\nGroup A: Malaysia, Singapore, Sri Lanka, Hong Kong and India\n\nGroup-B: Chinese Taipei, Japan, Korea, Pakistan, Maldives and Saudi Arabia .",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2914241855acc3e.png",
  "retrievedAt": "2025-08-20T04:31:42.349Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921003/pakistan-thrash-south-korea-91-6-at-asian-youth-netball-championship",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T09:29:50.000Z"
}
