{
  "title": "Trump blasts ‘communist’ winner of New York mayoral Democratic primary - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump branded the winner of New York City’s mayoral Democratic primary a “pure communist” in remarks that aired Sunday, an epithet the progressive candidate dismissed as political theatrics.\n\nZohran Mamdani’s shock win last week against a scandal-scarred political heavyweight resonated as a thunderclap within the party, and drew the ire of Trump and his collaborators, who accused Mamdani of being a radical extremist.\n\nThe Republican’s aggressive criticism of the self-described democratic socialist is sure to ramp up over the coming months as Trump’s party seeks to push Democrats away from the political centre and frame them as too radical to win major US elections.\n\n“He’s pure communist” and a “radical leftist … lunatic,” Trump fumed on Fox News talk show ‘Sunday Morning Futures with Maria Bartiromo’. “I think it’s very bad for New York,” added Trump, who grew up in the city and built his sprawling real estate business there.\n\n“If he does get in, I’m going to be president and he is going to have to do the right thing [or] they’re not getting any money” from the federal government.\n\nTrump’s White House has repeatedly threatened to curb funding for Democratic-led US cities if they oppose his policies, including cutting off money to so-called sanctuary cities, which limit their cooperation with immigration authorities.\n\nMamdani also took to the talk shows on Sunday, asserting he would “absolutely” maintain New York’s status as a sanctuary city so that “New Yorkers can get out of the shadows and into the full life of the city that they belong to.”\n\nAsked directly on NBC’s ‘Meet the Press’ whether he is a communist, Mamdani — a 33-year-old immigrant aiming to become New York’s first Muslim mayor — responded, “No, I am not.\n\n“And I have already had to start to get used to the fact that the president will talk about how I look, how I sound, where I’m from, who I am, ultimately because he wants to distract from what I’m fighting for,” Mamdani said.\n\n“I’m fighting for the very working people that he ran a campaign to empower, that he has since then betrayed.”\n\nThe Ugandan-born state assemblyman had trailed former governor Andrew Cuomo in polls but surged on a message of lower rents, free daycare and buses, and other populist ideas in the notoriously expensive metropolis.\n\nAlthough registered Democrats outnumber Republicans three to one in New York, victory for Mamdani in November is not assured.\n\nCurrent Mayor Eric Adams is a Democrat but is campaigning for re-election as an independent, while Cuomo may also run unaffiliated.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/29234745c9b3382.jpg",
  "retrievedAt": "2025-08-20T04:31:38.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921038/trump-blasts-communist-winner-of-new-york-mayoral-democratic-primary",
  "dateList": "2025-06-29",
  "date_published": "2025-06-29T18:48:57.000Z"
}
