{
  "title": "PM’s smart lockdown policy helps contain COVID-19 spread: Tania Aidrus",
  "link": "https://www.app.com.pk/national/pms-smart-lockdown-policy-helps-contain-covid-19-spread-tania-aidrus/",
  "date_published": "2020-07-26T06:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Special Assistant to the Prime Minister (SAPM) on Digital Pakistan Tania Aidrus Sunday said Prime Minister Imran Khan’s smart lockdown policy had helped in curtailing the spread of coronavirus (COVID-19) in the country.\nAddressing a press conference along with Minister for Information and Broadcasting Senator Shibli Faraz and Focal person to PM on COVID-19 Dr Faisal Sultan, she said Pakistan was not in a position to afford a complete lockdown policy due to its negative impact on the country’s economy and life of common man.\n“From the beginning, the PM focused on adopting a policy, which should not only help control the COVID-19 but also avoid negative impact on economy and life of common man,” she added.\nShe said soon after the surfacing of COVID-19, the government had decided to take decision keeping in view the difficulties of general public.\nTania Aidrus said the government had taken difficult decisions in the best interest of the country, adding the performance of the government could be judged as now the COVID-19 cases were decreasing in the country.\nThe SAPM said a long term system to deal with COVID-19 had been put in place for the benefit of the country.\n“It was the prime objective of the government that a system should be put in place which had long-term benefit and it can be used in future as well to deal with any outbreak,” she added.\nShe said the government had focused on long- term, and sustainable policy to handle the deadly coronavirus, adding National Command and Operation Centre was established to take decisions by taking along all stakeholders including provinces to deal with COVID-19 in an effective way.\nThe federal, provincial governments and army had taken collective decisions to deal with the deadly coronavirus in the country at the NCOC forum.\n“The federal and provincial governments and armed forces took collective decisions and introduced a targeted trace, testing and quarantine strategy,” she added.\nShe said one third COVID-19 tests were being conducted under this strategy.\nShe said the NCOC had helped in collecting accurate data of COVID-19 patients to take effective decisions to prevent the spread of coronavirus.\nShe said the number of deaths due to COVID-19 and daily cases of coronavirus had also decreased.\nTania Aidrus said the helpline established by the government on coronavirus had received thousands of calls.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:43.345Z"
}
