{
  "title": "Mirza urges citizens to follow COVID-19 SOPs vigorously during Eid",
  "link": "https://www.app.com.pk/national/mirza-urges-citizens-to-follow-covid-19-sops-vigorously-during-eid/",
  "date_published": "2020-07-26T06:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Special Assistant to the Prime Minister on National Health Services, Dr Zafar Mirza on Sunday advised the citizens to strictly follow social distancing and other precautionary measures to stop increasing local transmission of COVID-19 in the country during Eid-ul-Adha.\nIn a media briefing at the National Command and Operation Centre (NCOC), Dr Mirza said that the objective behind these SOPs was to avoid spread of person-to-person transmission of COVID-19 to general public, the buyers and sellers of animals during Eid-ul-Adha.\nHe added the SOPs were related with the social distancing, preventive measures during slaughtering of animals and during Eid prayers on the occasion of Eid-ul-Adha.\nHe said that public should only undertake minimal necessary travel during Eid holidays as it is likely to fall in the peak period of pandemic in Pakistan while social visits at Eid and general family get togethers should be avoided.\nHe appealed citizens to follow all SOPs during these days and support the efforts of government in its fight against COVID-19. He added due to government’s effective strategy the cases of corona were decreasing and the situation was gradually improving in the country.\nHe however said that still there were threats of spread of the disease and asked the citizens to continue implementing protective measures as per directions to stem the increase in coronavirus cases.\nHe said that the steps taken by Pakistan to control the pandemic had been highly appreciated globally as a reduction of 80% cases had been reported. He added the government had contacted religious scholars to convince people in Eid days about preventive measures.\nHe said that the government had already made a strategy to manage the situation during Eid-ul-Adha. He added in order to create awareness in public about preventive measures, the government had tried its level best to publicly share all SOPs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:58.914Z"
}
