{
  "title": "August 5-Black Day; Preparations afoot by Pak-Kashmir diaspora to register world-wide anti-India protests",
  "link": "https://www.app.com.pk/national/august-5-black-day-preparations-afoot-by-pak-kashmir-diaspora-to-register-world-wide-anti-india-protests/",
  "date_published": "2020-07-26T06:53:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 26 (APP):Pakistani and Kashmiri diaspora community, living in various parts of the world have started brisk preparations to observe black day on August 05 with mass anti-India protest rallies and demonstrations to express severe indignation against the first anniversary of the bleak day of August 05 last year when Delhi had performed sinister act scrapping special status of the internationally-acknowledged dispute state of Indian occupied Jammu Kashmir.\nOverseas Pakistani / Kashmiri Diaspora community settled the world over including in various Europe countries, will observe black day on August 05 to mark protest Indian sinister act of this day last year – scrapping special status of the world-recognized disputed Jammu & Kashmir state, with massive world-wide anti-India protest demonstrations, organizers said on Sunday.\n“The mass anti-India black-day protest followed by severe indignation against the oppressive fascist New Delhi rule all over Europe, UK and Scotland would mostly be comprising protest to be staged in front of the Indian High Commissions and consulates in major cities on August 05”, announced Raja Sikander Khan, Chairman Global Pakistan Kashmir Supreme Council (GPKSC), the UK-based Kashmiris International rights outfit representing the Diaspora community announced in a statement released to media on Sunday.\nHighlighting the salient features of the day long August 05 world wide protest program, Raja Sikander Khan said that the unanimous decision to this effect was taken after a thorough telephonic conference among the seasoned leaders of the Pakistan, Kashmiri Diaspora community including President Tehreek-e-Kashmir UK Raja Fahim Kayani, President Tehreek-e-Kashmir Scotland Baillie Muhammad Hanif Raja MBE.\nIt was unanimously decided and agreed by the community leaders that President Tehreek e Kashmir UK Raja Fahim Kayani will organize the Black day protests outside all the Indian Embassies consulates across all the major cities of UK & Europe. Chairman Global Pakistan Kashmir Supreme Council Raja Sikander Khan will manage holding of the Black Day protest outside the Indian High Commission London and Bailli Muhammad Hanif Raja MBE (Member of British Empire) will organize the seminars following by anti-India protest rallies in different cities of Scotland.\nSikander Khan continued that the day of 5th August, 2019 stands as the bleak day for Jammu Kashmir people in the history of the disputed Jammu & Kashmir State as India, at the gun point, deprived the state of its special status scrapping concerned article 370 of her (India) own constitution.\nHe said that this bleak day, will be marked as black day every year in future by the Jammu Kashmir state people at both sides of the LoC besides rest of the world – as on 5th August last year the fascist BJP-led India with the hardliner Prime Minister Narendra Modi revoked article 370 & 35A by stab the special status of the world-acknowledged disputed Indian Occupied Jammu & Kashmiri state against the aspirations of the people of the State.\nHe underlined that the oppressor Indian ruler also forcibly attempted to launch of Jammu & Kashmir reorganization act 2019 with its ulterior motives to bring out demographic changes in the Muslim-Majority disputed Jammu Kashmir state through continual coercive tactics imposing strict lock-down followed by indefinite curfew in the bleeding vale of in Indian Occupied Jammu & Kashmir, he added.\nLamenting over the continual ugly conditions of the curfew-riddled locked-down Indian occupied valley of Kashmir, the GPKSC Chairman said that the people of the freedom-loving Indian Occupied Jammu & Kashmir were still deprived of the necessities of life including edibles and other essentials including the their due internet and in phones services, which were disconnected for the past one year since day bleak day of August 05 last year.\nRaja Sikander Khan further said that the scheduled August 05 Black Day anti-India protest demonstrations in almost all major cities of Europe, UK and Scotland, will also apprise the external world to the reality that while the world remained tackling the COVID-19 crises but India very shamelessly resorted to increased atrocities, torture and other human rights violations against the innocent people of Indian Occupied jammu & Kashmir.\nHe added that the scheduled August 05 black day programs by the overseas Pakistanis and Kashmiris the world over would lead to pressurize the fascist BJP-led Indian rule to immediately lift the curfew & lockdown like indefinite restrictions in the bleeding valley of Kashmir besides to revert back the article 370 & 35A for restoring the special status of the disputed State – ensuring early grant of the fundamental right to self determination to the people of Jammu & Kashmir under the spirit of international norms and commitments including the UN resolutions on the issue.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:55.116Z"
}
