{
  "title": "Ministry of Maritime Affairs transforming Pakistan into a maritime nation: Ali Zaidi",
  "link": "https://www.app.com.pk/national/ministry-of-maritime-affairs-transforming-pakistan-into-a-maritime-nation-ali-zaidi/",
  "date_published": "2020-07-26T05:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Federal Minister for Maritime Affairs Ali Haider Zaidi has said that his ministry transforming Pakistan into a maritime nation.\nSharing accomplishments by Ministry of Maritime Affairs during last two years, he said that “we are destined for so much more progress in this Ministry” adding that “we will make our voters and whole Pakistan proud”.\nAccording to Ministry of Maritime Affairs as a first step a public whatsapp number and an email address were set up so all those connected with Maritime sector could directly reach out to the minister to report irregularities or offer suggestions.\nPakistan National Shipping Corporation (PNSC) under the current regime added two LR1 Tankers taking the total strength of the fleet to 11 vessels. ERP solutions were acquired and PNSC will be fully digitized by November 2020.\nLoans worth Rs. 4.7 billion have been repaid. The famous historical Rally building and Muhammadi House both in Karachi the financial hub of Pakistan are in the process of total restoration to reflect their past glory.\nFollowing, the Prime Minister Imran Khan austerity campaign, 29 vehicles were also auctioned. At Karachi Port Trust construction of new boat basin jetty finished in early 2020.\nBidding for Dry Bulk Terminal has been initiated. 11 companies have been shortlisted a lot of them are internationally terminal operators. An amount of Rs. 2.2 billion in liquidated damages have been recovered. Through competitive bidding high reputable audit firms were hired. The first ever store audit has been completed and the first ever KPT hospital audit is underway. Furthermore, the financial audit of the entire organization (KPT) is ongoing from 2010 onwards.\nPort Qasim Authority (PQA) recorded its highest ever revenue in the last 2 years. For the first time PQA started night navigation for large vessels in early 2019. The first financial audit since 2008 is being conducted. During the COVID-19 crisis, when most of the regional ports have short down. PQA handled a record 270 vessels in March and April 2020.\nFollowing the Prime Minuster Initiative of Green Year Pakistan, plantation of over 1 million mangroves is underway. A detail study of the new master plan for the port has completed.\nThis will attract an inbound investment of up to 1.6 billion dollars by developing new terminals. Plan has also been finalized to uplift the entire infrastructure of PQA and its industrial area.\nThis include up-gradation of the roads, laying of sewerage line, water distribution channels and power supply, residential accommodation for PQA employees, Primary and Secondary School, State of the Art Sports Complex with a cricket ground fit to first class matches at an approximate combine cost of Rs. 3 billion.\nGawadar Port Authority (GDA) the gateway to CPEC has started handling the Afghan Transit Trade. The Project of East Bay Expressway which was delayed for various reasons as now scheduled to be completed by the April 2021.Tax incentive for the GDA Free Zone which was stuck for 7 years have been approved. Korangi Fisheries Harbour Auhtority (KFHA) has secured funding for refurbishment and up-gradation of the entire operational infrastructure.\nNew initiative by Ministry of Maritime Affairs under the current regime Ministry has set new precedents and as led the way on many first in Pakistan as per International Labour Organization (ILO) Convention Machine readable SID card are now being issued to seafarers. Most of their issues have been addressed. A new manning company under the PNSC has been set up that will facilitate the employment of seafarers on international shipping lines. Ministry devised a comprehensive Shipping Policy in 2019 aimed at attracting the private sector to participate in the shipping.\nUnder the Policy shipping companies was registering their vessels in Pakistan gain major financial concessions. They will also be exempted customs duty. A fishery development Commisioner was appointed through advertisment after 11 years. For the first time Pakistan was also awarded the chairmanship of INFOFISH a project of the FAO and the leading force of the marketing support for fish producers and exporters in Asia Pacific. For the first time Minister for Maritime Affairs addressed the IMO Regulatory body of the United Nations. A meeting of the IOTC workshop of the Hongkong Convention held in Pakistan for the first time. The Ministry of Maritime Affairs also achived E-Office Level 4+ in Noveber 2019. The Ministry is bear heading the concept of Blue Economy of Pakistan. Blue Economy has defined as sustainable commercial growth improving livelihood and creating jobs. While preserving and protecting the health of Oceanic Ecosystem.",
  "retrievedAt": "2025-08-11T19:32:43.287Z"
}
