{
  "title": "137,189 petroleum sector complaints resolved in 20 months",
  "link": "https://www.app.com.pk/national/137189-petroleum-sector-complaints-resolved-in-20-months/",
  "date_published": "2020-07-26T00:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP):The Petroleum Division (PD) and its attached departments have so far resolved around 137,189 complaints, out of 142,883 received at the Pakistan Citizens Portal, launched by the Prime Minister in October 2018 for prompt redressal of grievances against the public sector organizations.\n“The grievances have been resolved without any delay to the entire satisfaction of complainants,” a senior official privy to petroleum sector developments told APP.\nGiving break-up, the official said, as many as 852 complaints were related to the Petroleum Division, out of which 773 had been resolved, one was under process and 78 were filed recently[new].\nSui Southern Gas Company (SSGC) received around 13,031 complaints of different nature through the portal and resolved 9,371 instantly, while 2,793 were under process and 867 were new. Similarly, Sui Northern Gas Pipelines Limited (SNGPL) resolved 125,509 complaints, out of total 127,393. As many as 108 complaints were pending with the SNGPL and it received 1,776 more complaints recently.\nOil and Gas Development Company Limited (OGDCL) received 962 complaints, out of which it resolved 908, two were pending and 52 were new. Around 239 complaints were related to Pakistan\nMinerals Development Corporation (PMDC), who settled 238 while one was yet under process. Pakistan Petroleum Limited (PPL) resolved 76 complaints, out of total 79, while one was pending and two new ones were being evaluated.\nPakistan State Oil (PSO) faced 327 complaints and redressed 314, while it was looking into 13 newly filed grievances. The official said the Petroleum Division had also refurbished the mechanism of the public complaint resolution especially for the gas sector amidst the challenging times of coronavirus pandemic. He said both the SNGPL and SSGC were redressing public grievances through e-kutcheris and online services.",
  "retrievedAt": "2025-08-11T19:32:50.052Z"
}
