{
  "article_id": "2025-06-08_8c3bf86373795e3af9da5274e22373f2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cdas-zero-waste-operation-in-full-swing-over-1362-tons-of-waste-disposed-efficiently/",
    "retrieved_at": "2025-08-27T10:54:38.051Z"
  },
  "metadata": {
    "title": "CDA’s Zero-Waste Operation in full swing, over 1,362 tons of waste disposed efficiently",
    "author": null,
    "date_published": "2025-06-08T13:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 643,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 8 (APP): As Muslims across the globe observe Eid-ul-Azha with religious fervor, the Capital Development Authority (CDA) is executing a large-scale sanitation operation in Islamabad to ensure a clean and hygienic environment during the festive period. On the directions of Federal Minister for Interior Mohsin Naqvi, CDA under the supervision of Muhammad Ali Randhawa Chairman CDA and Chief Commissioner Islamabad successfully conducting Zero Waste operation during three days of Eid ul Adha in Capital. CDA in line with the leadership of Mohsin Naqvi Federal Minister for Interior and supervision of its Chairman, Muhammad Ali Randhawa is committed to ensuring cleanliness, beautification and development of the federal capital Islamabad by utilizing all its resources thus making Islamabad a model capital of the world. Official CDA figures revealed that approximately 1,362.386 tons of offal and animal waste were collected and safely disposed of on the first day of Eid. Across Islamabad, over 81,000 animals-including 47,000 small and more than 33,000 large-were sacrificed on the first day alone. To tackle the massive waste volume, over 2,500 sanitation workers, supervisors, and officers were deployed across all sectors on an emergency basis. The operation utilized more than 250 vehicles and heavy machinery, ensuring efficient and hygienic collection and disposal of remains. The CDA spokesman stated that the operation was underway across all five zones of Islamabad, supported by a strong deployment of over 2,500 sanitation workers, supervisors, and officers. \"These teams are working on an emergency basis throughout the city, supported by a fleet of more than 250 vehicles and heavy machinery,\" he added. He informed that to safely and responsibly manage the massive volume of animal remains, the CDA has prepared over 107 disposal pits at 55 designated sites, adhering strictly to hygiene protocols. All offal and remains were being collected in biodegradable plastic bags and buried according to environmental and health safety standards. \"In rural areas of Islamabad, the cleanup effort continues through local Union Councils, also following the directives of the CDA Chairman. Assistant Commissioners have been directed to remain in close coordination with private and cooperative housing society managements to ensure comprehensive coverage of sanitation services,\" the spokesman added. The CDA spokesman stated that drone surveillance technology was utilized to monitor sanitation progress across various sectors. Additionally, rose water, phenyl, and lime sprays were applied in key collection and sacrifice areas to control odor and uphold hygienic conditions. The spokesman further told that CDA has launched a public awareness campaign, urging citizens to avoid sacrificing animals in undesignated locations, and instead, use official sacrificial sites. \"Residents are requested to place animal offal in biodegradable bags near their homes for timely collection,\" he urged. CDA has activated a dedicated helpline (1334) to assist citizens, along with landlines (051- 9213908, 051- 9203216, 051-9211555). Residents can also submit complaints and pickup requests via WhatsApp/SMS at 0335-5001213 for swift resolution. The spokesman mentioned that strict instructions have been issued advising citizens not to dispose of animal remains in drains, forests, garbage bins, or skips, as such actions pose health and environmental hazards. Meanwhile, in an official statement, Chairman Muhammad Ali Randhawa emphasized that public cooperation was essential for maintaining a clean and disease-free environment. He reaffirmed that the cleanliness action plan would remain in effect through the third day of Eid, ensuring sustained efforts to keep Islamabad clean. The extensive sanitation drive has drawn praise from the public, with many citizens expressing satisfaction over the prompt removal of animal remains and the overall cleanliness of the city and commending the CDA for its swift and efficient management during the festive days. They said, \"CDA's performance during the Eid days is exemplary, particularly during the challenging days of mass animal sacrifice.\" \"We are grateful to CDA for their proactive role and effective plan of offal disposal and cleanliness of city, the festivities became more special,\" they added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}