{
  "article_id": "2025-06-08_f053b8ca4fa3a0df6928bdaa947d93d2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/telephone-call-between-prime-minister-and-president-of-kazakhstan/",
    "retrieved_at": "2025-08-27T10:54:38.849Z"
  },
  "metadata": {
    "title": "Telephone call between Prime Minister and President of Kazakhstan",
    "author": null,
    "date_published": "2025-06-08T13:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Jun 08 (APP): Prime Minister Shehbaz Sharif held a warm and friendly telephonic conversation with President of the Republic of Kazakhstan Mr Kassym-Jomart Tokayev, earlier today and conveyed Eid ul Adha greetings to him as well as the brotherly people of Kazakhstan. During their conversation, the two leaders reviewed the current state of bilateral relations and exchanged views on the various upcoming engagements. While expressing their satisfaction on the positive momentum in bilateral ties, the both sides reaffirmed their commitment to expanding cooperation between the two countries to its full potential. The recent Pakistan-India crisis was also discussed and the prime minister briefed the Kazakh President on Pakistan's efforts for maintaining peace and security in the region. The prime minister said that he was looking forward to the Kazakh President's visit to Pakistan later this year, during which a number of important agreements and MoUs would be signed between both sides. The Kazakh President thanked the prime minister for the Eid telephone call and expressed warm wishes for the people of Pakistan and said that he would visit Pakistan towards the end of the year and his visit would be preceded by the visit of the Kazakh Foreign Minister. The both leaders are also expected to meet during the upcoming the ECO and SCO Summits.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}