{
  "title": "Massive forestation crucial to save future generations: PM",
  "link": "https://www.app.com.pk/national/massive-forestation-crucial-to-save-future-generations-pm/",
  "date_published": "2022-02-22T07:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Prime Minister Imran Khan on Tuesday urged citizens to plant at least five trees per family and join the government’s efforts in securing a protected environment for future generations.\nAddressing here at the launch of nationwide Spring Tree Plantation campaign, the prime minister said owing to Pakistan’s vulnerability to climate change, massive forestation was crucial to save the country.\nThe tree plantation event coincided with the World Scouts Day as the government decided to register the young force with the Ten Billion Tree Tsunami project to carry out plantation at a wider scale.\nAround 750,000 scouts of Pakistan Boy Scouts Association will join the drive to achieve the target of planting 540 million trees this season.\nThe prime minister said the purpose of choosing the Scouts Day for launch of plantation campaign was to encourage the youth to take responsibility in protecting their environment.\nHe said a highly climate-vulnerable Pakistan could not cope with climate risks, particularly floods, desertification and heatwaves, which had become increasingly frequent due to global warming and reduced tree cover.\nHe said Pakistan was blessed with immense natural resources, adding that it was the responsibility of every citizen to contribute towards protecting the environment through plantation.\nHe said planting at least five trees per family would go a long way in making Pakistan clean and green.\nHe mentioned that Ten Billion Tree project acclaimed international recognition, including by the World Economic Forum and the British prime minister who acknowledged Pakistan as a leader in combating climate change.\n“Our future is linked with a green Pakistan and we all need to join hands in achieving this goal,” he said.\nImran Khan said Pakistan’s twelve unique climatic zones provided a favourable ground for tree plantation of all species.\nHe mentioned that the current season would witness the target accomplishment of planting 540 million trees.\nSpecial Assistant to Adviser on Climate Change Malik Amin Aslam said Pakistan’s successful tree plantation model was inspiring several countries and mentioned that recently a Memorandum of Understanding was signed with Saudi Arabia in this regard.\nAccording to the MoU, he said, Pakistan will present a plantation model to the Kingdom based on the suggestions of its own experts.\nHe said the German Minister for Environment had stated that his government intended to inject 20 million Euros to the Ten Billion Tree Tsunami project.\nEarlier, the prime minister planted a sapling to mark the launch of Spring Tree Plantation campaign.\nMinister for Climate Change Zartaj Gul, Federal Minister for Education Shafqat Mahmood and a large number of scouts attended the event.",
  "retrievedAt": "2025-08-11T14:23:23.846Z"
}
