{
  "title": "Pakistan prefers trade ties over joining regional blocs: PM",
  "link": "https://www.app.com.pk/national/pakistan-prefers-trade-ties-over-joining-regional-blocs-pm/",
  "date_published": "2022-02-22T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Prime Minister Imran Khan on Tuesday said Pakistan did not want to become part of a particular bloc in the region but instead desired trading relations with all countries including Russia.\nIn an interview with host Oksana Boyko of Russia Television ahead of his visit to Moscow, he said Pakistan suffered in the past because of the politics of the blocs and did not want to repeat the mistake.\nThe prime minister said the last thing Pakistan wanted was the world to be divided into blocs.\nHe said cooperation among regional powers including Russia, China, and even the United States could be in the interest of mankind.\nKhan said Pakistan wanted to strengthen bilateral relations with Russia and looked forward to his visit to Moscow.\nThe prime minister said Pakistan was a gas deficient country and pointed out that North-South Gas Pipeline suffered delay because of the U.S. sanctions on the Russian company.\nHe said Pakistan was negotiating for the construction of the pipeline and also eyed buying the cheapest gas from the neighboring Iran after lifting of the U.S. sanctions.\nImran Khan hoped for peaceful resolution of the Ukraine issue, emphasizing that military options could not prove as the right solution to conflicts.\n“I am not a believer of military solutions but dialogues,” he said, adding that the same solution in Afghanistan for decades could not save the people of the country from suffering.\nHe said conflicts could have disastrous consequences on the people of poor countries, who already faced poverty in the wake of COVID-19 pandemic.\nOn ties with India, he said his government reached out to the government of India after the assumption of power in order to resolve the outstanding dispute of Jammu and Kashmir.\nHowever, he regretted that India was following a racist and supremacist ideology inspired by Nazism and denied resolving the issue of Kashmir.\nImran Khan termed climate change and illicit flow of money from poor to developed countries as the two major challenges faced by the world.\nHe mentioned that the plunder of the developing world continued as 1.5 trillion dollars every year was transferred illegally to offshore companies led to severe consequences globally including rising hunger and poverty.\nThe ruling elite of the world, he said, affected the process of accountability.\n“The only way to remove the imbalance is to make laws to check drug money,” he said.\nAsked how would he like to be remembered, he said he wanted to be the one who made a big change in the lives of the common people by bringing them out of poverty, ensuring rule of law, and building a humane socio-welfare society.",
  "retrievedAt": "2025-08-11T14:23:23.163Z"
}
