{
  "title": "India poised to disturb regional peace; doesn’t want SAARC to function: President",
  "link": "https://www.app.com.pk/national/india-poised-to-disturb-regional-peace-doesnt-want-saarc-to-function-president/",
  "date_published": "2022-02-22T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): President Dr Arif Alvi Tuesday said that being a belligerent neighbour, India bent upon to disturb regional peace, and did not want South Asian Association for Regional Cooperation (SAARC) to function owing to her hegemonic designs.\nThe president, in a meeting with the Commander of the Sri Lankan Navy, Vice Admiral Nishantha Ulugetenne, who called on him, highlighted the brutalities being committed by India against the people of Indian Illegally Occupied Jammu & Kashmir.\nHe informed that the persecution of minorities in India was a matter of serious concern and, unfortunately, the Indian government tended to ignore it.\nThe president said that Pakistan highly valued its relations with Sri Lanka and wanted to further improve bilateral cooperation with Sri Lanka in all areas of mutual interests.\nHe emphasized the need for increasing cooperation in the areas of tourism, culture, and defence between the two brotherly countries.\nWelcoming the Commander of the Sri Lankan Navy, the president stated that Pakistan and Sri Lanka enjoyed excellent relations, which needed to be further strengthened for the advantages of the two countries.\nHe mentioned that both countries had great potential to promote cultural cooperation and religious tourism as Pakistan had many Buddhist sites and Buddhists monks from Sri Lanka needed to be encouraged to visit the religious sites.\nWhile condemning the Sialkot incident, the president expressed grief over the unfortunate occurrence in which a Sri Lankan national was brutally killed. He said that the government took prompt action against the accused involved in the incident.\nThe president highlighted the importance of China Pakistan Economic Corridor and Gwadar Port which would promote regional connectivity as well as enhance trade and economic cooperation between Pakistan and Central Asian States, besides bringing economic prosperity to the region.\nVice Admiral Nishantha Ulugetenne thanked the Government of Pakistan for supporting Sri Lanka during difficult times.\nHe also appreciated the action taken by the government against the accused involved in the gruesome murder of Sri Lankan national.\nHe underlined the need for further increasing bilateral cooperation between the two countries.",
  "retrievedAt": "2025-08-11T14:23:19.894Z"
}
