{
  "title": "Govt unveils roadmap for 7th digital population and housing census",
  "link": "https://www.app.com.pk/national/govt-unveils-roadmap-for-7th-digital-population-and-housing-census/",
  "date_published": "2022-02-22T08:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP):Unveiling the roadmap for the 7th digital population and housing census, Minister for Planning, Development and Special Initiatives Asad Umar Tuesday said the final results of the 7th digital population and housing census would be announced by December 2022 and the new elections would be based on the fresh census results.\nHe said that in May-June this year, the government would conduct a pilot test of the census to test the whole process for risk management and disaster recovery, and for successful conduct of digital census.\nIn September-December, he said the main field work would be held while in November post sampling enumeration would be done.Talking to media here before inaugurating National Census Coordination Center (N3C) at the Pakistan Bureau of Statistics (PBS), Asad Umar said for first time in history, the government was going to hold digital census by utilizing modern technology to save time and ensure transparency and data accuracy.\nHe said during current year’s budget, an amount of Rs 5 billion was allocated for the census while the remaining budget would be allocated in the upcoming fiscal year.\nThe minister added that around Rs 10 billion would be spent on the procurement of software and hardware for conducing digital census.Chief Statistician PBS, Dr Naeem Zafar briefing on the planning, and operation of the upcoming digital census, said the N3C setup would be headed by the Deputy Chairman Planning Commission with provincial/regional representatives and law enforcement agencies.\nHe said the Census Support Centers were being established in all 614 Tehsils of the country to conduct first ever digital census smoothly and to avoid complications.\nThe dedicated support centers at Tehsil levels would ensure 24/7 availability of system and the end-user and field enumerator support. The census support centers would be equipped with online monitoring dashboards and would also act as control room and complaint inquiry office.\nBriefing on the road map for the 7th population and housing census, the Chief Statistician said the exercise of appointment of staff would be held in March 2022 while training of field staff for pilot would be done from April 15, 2022 to April 30, 2022.\nSimilarly the pilot census (2000 blocks approximately), would be held from May 15 to June 15 while enumeration work (first step-self enumeration) would be done from July 15 to Jul 30 2022.\nHouse listing operation (first block) would be held from August 01 to August 03 and the operation for second block would be held from 16th to 18th of August.\nFace to face interview in first block would be held from 4th to 15th of August and the interviews for second block would be held from 19th to 31st August, 2022.\nData processing and summary results would be finalized in September-October and the post enumeration survey would be held in November.\nThe PBS would hand over the summary results to the Election Commission of Pakistan on December 31, 2022.The data cleansing, imputation rules and detailed results would be announced in January-February 2023.\nPlanning Minister Asad Umar said in today’s era of modern technology it was vital to hold the census more often compared to the past when the census used to be held with a huge gap of 15 to 18 years.\nHe regretted that one of the most important activity which was the basic pillar of the country’s planning and development was not given due importance in the past.\nHe said without a transparent and timely conduct of population census, the resources’ distribution among various areas of the country would not be ensured.\nHe said in order to make this exercise successful, the coordination of the provinces was a must.\nHe also asked the PBS management to share each and every thing about the 7th population census with the media to ensure transparency and to identify any drawbacks.\nTo a question, the minister said that the digital system would be completely secured as it would not be internet-based and to further ensure the security, all relevant stakeholders including IT ministry, NTC, NRTG had been taken on board.\nHe said the final results of the census would be announced in December this year, so the government would have 6-7 months more to complete the process of delimitation.\nHe said it was the requirement of the constitution of Pakistan to hold the election on the basis of latest population and housing census.\nTo a question with respect to the opposition’s call of long march and no confidence vote in the parliament, the minister said the government did not take the opposition’ such calls as serious because it had already given multiple dates but failed in their designs and this time the same would happen.",
  "retrievedAt": "2025-08-11T14:23:23.403Z"
}
