{
  "title": "SC asks NAB to preserve, digitize its record",
  "link": "https://www.app.com.pk/national/sc-asks-nab-to-preserve-digitize-its-record/",
  "date_published": "2022-10-18T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP):The Supreme Court on Tuesday continued hearing of Pakistan Tehreek-e-insaf (PTI) Chairman Imran Khan’s petition against amendments in the National Accountability Bureau (NAB) Ordinance.\nA three-member SC bench comprising Chief Justice of Pakistan Umar Ata Bandial, Justice Ijaz Ul Ahsan and Justice Syed Mansoor Ali Shah heard the case.\nDuring the course of proceedings, the Supreme Court ordered the NAB to preserve and digitize the records including details of references returned after the amendment.\nThe Chief Justice remarked that the court believed that every responsible should be held accountable, but here everyone was still looking for criteria to test the NAB law. It had been published in newspapers and other circles that there should not be NAB prosecution on certain sections including the business community, he added.\nHe said that politicians had been declared corrupt since 1947 and the Supreme Court’s action was to balance this process but this debate should be held in the parliament. Even in 1947 there was an accountability law, he added.\nJustice Mansoor Ali Shah remarked that how could the court design a law and send it to the Parliament. He asked why and how the court could interfere in the affairs of the parliament.\nHe asked how could the Supreme Court determine that what should be the NAB law? The council argued that the NAB law was malicious, how could the court design a law for the parliament, he asked.\nPTI lawyer Khawaja Haris, while continuing the arguments, said that major cases including the rental power case were dropped, the financial benefit of the third party was taken out of NAB’s reach through the recent amendments. The Supreme Court in the past had been designing laws for the parliament, he added.\nMakhdoom Ali Khan said that NAB was not submitting all the records as it was only submitting the decisions of the accountability courts to the Supreme Court.\nJustice Ijaz-ul-Ahsan inquired that if the Chairman NAB did not send the returned reference anywhere, then would the matter be over. There may be a need to amend the NAB law, he added.\nThe PTI counsel said that references were not being filed anywhere else. The prosecutor NAB said committees had been formed in every region.\nThe Supreme Court ordered that references, records, evidence, information, documents should be preserved, a list of everything should be compiled and preserved.\nSubsequently, hearing of the case was adjourned till Wednesday.",
  "retrievedAt": "2025-08-11T15:44:57.315Z"
}
