{
  "title": "Investment on human capital inevitable for a successful, prosperous Pakistan: President",
  "link": "https://www.app.com.pk/national/investment-on-human-capital-inevitable-for-a-successful-prosperous-pakistan-president/",
  "date_published": "2022-10-18T16:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): President Dr Arif Alvi on Tuesday said that the investment on human resource was inevitable to accomplish the forefathers’ vision for a successful and prosperous Pakistan, by exploiting the immense potential in the fields engineering and technology.\nThe president, addressing the distribution ceremony of Pakistan Engineering Council’s Engineers’ Excellence Awards 2020 and 2021, said some impregnable powers were emerging in the world by combinedly using engineering and the artificial intelligence.\nHe said it was the responsibility of the institutions like Pakistan Engineering Council to create an atmosphere of excellence. At a time when huge quantum of information and teaching material was available in the cloud technology, the countries like Pakistan had no excuse to miss the bandwagon.\nHe questioned as how long Pakistan would continue to bank on others’ consultancy for development projects and emphasized the need for producing quality human resources in all required fields.\nThe president said through brain drain, Pakistan had suffered a lot and called for the an atmosphere to persuade the skilled workforce to serve in the country out of no compulsion.\nHe said to their credit, Pakistani engineers had the development of Middle East and upkeeping of Harmain Sharifain, therefore it was essential to look into the factors which led to missing the targets.\nHe said it were the Pakistani engineers and scientists who made the country achieve the nuclear capability within the span of few years.\nThe president, who earlier distributed excellence awards among prominent engineers, urged the Pakistan Engineering Council to make efforts for making the country achieve self-sufficiency in modern technology like chip manufacturing to protect the country against cyber attacks.\nHe said being a precious asset, the engineers should play their role to build a generation which should have the global recognition for their success and credibility.\nHe said Pakistan should also tap the potential of youth bulge which otherwise could become a burden.\nThe president also appreciated PEC for its several initiatives, which included entrepreneurship, training of engineers, development of matchmaking portal, development of green energy building code, upgradation of PEC’s bidding documents and re-activation of Pakistan Institute of Cost and Contracts for enhancing the role of engineers in the socio-economic development of the country.\nEarlier, Chairman of Pakistan Engineering Council Najeeb Haroon said the being a powerhouse of professionals and a think tank, the Council was determined to promote real professionalism and discourage pseudo-intellectualism.\nHe said the PEC had got the distinction of getting membership from different reputed international bodies like Washington Accord.\nHe said Pakistani engineers had been contributing to the country’s socio-economic development by rendering their services in the fields of nuclear, construction, irrigation and others. Following the destruction of dams by the floods, the Pakistani engineers launched their study on the subject to recommend the measures to avert the recurrence.\nHaroon said the PEC had launched paid internship for the engineering graduates and also announced to fund the start-up projects by the students.\nConvener of the Awards Committee Engineer Niaz Ahmed Akhtar said the nominees for the award were selected from seven different fields in order to recognise their services for the country.",
  "retrievedAt": "2025-08-11T15:44:58.455Z"
}
