{
  "title": "Pak HC Australia, Squash ACT launch Jansher Khan Canberra Open",
  "link": "https://www.app.com.pk/national/pak-hc-australia-squash-act-launch-jansher-khan-canberra-open/",
  "date_published": "2022-10-18T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): The inaugural Jansher Khan Canberra Open 2022 – a USD $20K Professional Squash Association (PSA) event, will be held at Woden Squash Centre, Canberra, Australia from October 18-22.\nTo officially commence the Jansher Khan Canberra Open, an inaugural ceremony was held at the High Commission for Pakistan, Canberra.\nThe event will see 24 top rating professional squash players from all over the world.\nJansher Khan Canberra Open is named after the legendary Pakistani squash player.\nDuring his career, Jansher Khan won the World Open a record eight times, and the British Open a record six times. He is a winner of World Super Series and a Guinness World Records holder. Jansher Khan was also known as “the fastest man in squash”.\nSpeaking on the occasion, High Commissioner Zahid Hafeez Chaudhri thanked the organizers, sponsors and the players taking part in the Tournament.\nThe High Commissioner highlighted the glorious history of domination by Pakistani players in the field of Squash.\nHe said that the journey began with Hashim Khan who was the first Pakistani to win the British Open in 1951 and Pakistan reached its peak in the 1980s and 1990s during the reigns of Jahangir Khan and Jansher Khan.\nBetween 1950 and 1997, he said, Pakistan amassed over 30 British Open titles, 14 World Open titles and many more Professional Squash Association (PSA) professional titles.\nThe High Commissioner expressed the hope that Pakistan will regain its lost glory in Squash.\nPresident of Squash ACT Michael Nuttall appreciated the High Commission for the excellent initiative to promote Squash.\nThe event was attended by officials from Squash ACT, sponsors, event volunteers, international players, and media persons.",
  "retrievedAt": "2025-08-11T15:45:10.310Z"
}
