{
  "title": "Early diagnosis of breast cancer to reduce mortality rate in women: Samina Alvi",
  "link": "https://www.app.com.pk/national/early-diagnosis-of-breast-cancer-to-reduce-mortality-rate-in-women-samina-alvi/",
  "date_published": "2022-10-18T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): First Lady Begum Samina Alvi on Tuesday stressed upon a robust awareness campaign about breast cancer to reduce the mortality rate in women and highlighted the vital aspects of timely screening, precautionary measures and treatment.\nAddressing a ceremony held in a local hotel, the first lady said that the fatal disease was fast spreading and urged the educated women, media, educational institutions, public and private entities to fully support the awareness drive.\nThe event was attended by a large number of medical experts, ambassadors and people belonging to different sections of society.\nBegum Alvi regretted that due to the delayed diagnosis of breast cancer, numerous lives were lost whereas it was prevalent in a large number of women which was a matter of grave concern.\nThe awareness campaign was being run to save the women from the fatal disease which would help reduce its spread, she added.\nShe further observed that the families of the women breast cancer patients had to suffer as the treatment was also very expensive.\nExpressing her satisfaction over the outcome of the awareness campaign, Begum Alvi lauded the efforts made by all the stakeholders in this regard and said the outcome was encouraging. Media also played a vital role in the drive, she added.\nBegum Alvi opined that early diagnosis of the diseases increased chances of survival, thus reducing the loss of lives across the country, adding that it was the onus of society to fulfill its responsibility in this regard by raising awareness among the masses. The family of the breast cancer patient should also lend support to the sufferer.\nThe first lady said that they had been running the awareness campaign for the last four years and unfortunately, not only women were diagnosed as carriers of this disease, but also it was being detected in men and young girls.\nShe underlined the need for taking of practical steps for the provision of free mammography facility in the hospitals and the affordable treatment costs, adding that different hospitals in the backward areas of the country had started free of cost mammography facilities to women, while others had been providing treatment at concessional rates.\nBegum Alvi noted that there was a dearth of health facilities as the cost of the treatment of cancer was high, adding that according to a report of Shaukat Khanum Hospital, the number of cancer patients diagnosed with the first stage had increased.\nShe said last year, Khyber Teaching Hospital in Khyber Pakhtunkhwa had arranged a free medical camp in which thousands of women were screened and 16 women were diagnosed with the disease.\nAppreciating of the role of media in creating awareness, she said that it was effectively conveying the message at the national and international levels.\nBegum Alvi said that womenfolk were an important segment of society, therefore, she had always emphasized upon their health, education, empowerment and inheritance rights.\nBesides, she said that differently-abled people deserved their due attention as they were also an important part of society and stressed that they should work collectively to empower them.\nThe first lady also highlighted the importance of mental health and expressed concerns over its increase in society and population.\nOn the occasion, she also thanked the organizers of the ‘Raabta’ for arranging a penal discussion over the creation of cancer awareness.",
  "retrievedAt": "2025-08-11T15:45:01.852Z"
}
