{
  "title": "Ashrafi for underdeveloped countries support to meet climate change challenges",
  "link": "https://www.app.com.pk/national/ashrafi-for-underdeveloped-countries-support-to-meet-climate-change-challenges/",
  "date_published": "2022-10-18T16:22:00.000Z",
  "source": "APP",
  "content": "CAIRO, Oct 18 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday said the developed and financially influential countries should support the underdeveloped countries with less resources in order to cope with the challenges arising from the climate change.\nTalking to the media following the ‘World Fatwa Conference’ in Cairo, Egypt, Ashrafi said it was high time to recognize the reality of climate change, as flash floods in Pakistan have inundated 70 percent area of the country, which has caused more than $30 billion loss to the national economy.\nAshrafi who is also the chairman of Pakistan Ulema Council, said Islam stressed to take advantage from conventional knowledge and use of modern sciences for water conservation and tree planting were the commandments of Islam.\nHe said the debates and discussions between Islamic scholars on the conventional issues was a very important step for resolving the problems of the present age.\nAshrafi said the Islamic scholars had invited the leaders of all the religions to move forward to resolve the conventional problems of the world.\nThe Makkah Declaration was result of the continued efforts on part of the Muslim World League and similarly, the ‘Charter of Akhuwat-e-Insania’ by Sheikh Al-Azhar, and ‘Paigham-e-Pakistan’ by Ulema and Mashaykh of Pakistan for promoting unity and consensus in view of interfaith dialogue, he maintained.\nHe said Islam was guarantor of survival and security of the humanity, and it taught us the promotion of peace, affection, and tolerance. In this scenario, it was necessary that the leadership of all religions and religious sects should raise awareness about challenges of the climate change, he added.\nHe also informed that Prime Minister Muhammad Shehbaz Sharif would participate in the conference in Sharm-Al-Sheikh and shed the light on the losses incurred by the recent monsoon rains and flash floods in Pakistan.\n“Pakistan alone cannot deal with the catastrophic situation caused by floods in the country,” he said urging international organizations and Islamic world to cooperate with Pakistan in this trying time.\n“We are grateful for the cooperation of the international bodies and Islamic world, but it is not sufficient enough to cope with the calamity,” he said adding the problems were increasing many folds with every passing day as mercury was dropping and people were forced to live under the open sky in the winter season.\nSeeking world community’s help to meet this national disaster, Ashrafi informed that the flood-affected people of Pakistan were also facing water related diseases.\nThe World Fatwa Conference, titled ‘Fatwa and Sustainable Development Goals’ was held under the aegis of Egypt’s Dar-Al-Ifta in Cairo, and attended by the delegates of more than 100 countries from all over the world including Mufti-e-Azam Egypt and Mufti-e-Azam Palestine.",
  "retrievedAt": "2025-08-11T15:44:58.710Z"
}
