{
  "title": "Fazl to chair JUI-F CEC’s meeting on Wednesday",
  "link": "https://www.app.com.pk/national/fazl-to-chair-jui-f-cecs-meeting-on-wednesday/",
  "date_published": "2022-10-18T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP):Jamait Ulema-e-Islam-Fazl (JUI-F) Chief Maulana Fazl-ur-Rehman is going to chair an important meeting of his party’s Central Executive Committee (CEC) on Wednesday, October 19, in the federal capital.\nIn an exclusive talk with APP, JUI-F Spokesperson Muhammad Aslam Ghauri told that the arrangements of meeting had been finalized and the CEC members had started reaching Islamabad to attend it.\nHe said besides reviewing performance of the federal ministers belonging to the JUI-F, the future strategy would be devised keeping in view the recent results of bye-elections, held on various seats of national and provincial assemblies across the country in the meeting.\nThe flood situation would also be the focal agenda of the meeting as well, he maintained.\nCriticizing Pakistan Tehreek-e-Insaf (PTI)’s rallies, he said Imran Khan should avoid making comparison with the JUI-F rallies adding that the JUI-F had held more than a dozen million marches and neither damaged a single flowerpot nor occurred any untoward incident.\nAslam Ghauri said the participants of JUI-F rallies stayed for 15 days in the federal capital but with discipline and restraint while the unruly mob of PTI attacked on national institutions including Parliament House, Pakistan Television headquarters and other buildings.\nHe said the PTI chief wanted to disintegrate the federating units and create chaos in the country in the lust of power. The government would establish the writ of state at all costs to get rid of this mischief.\nHe said the Punjab and Khyber Pakhtunkhwa governments had fully used public resources in the bye-elections.\nImran Khan should accept the decision of Election Commission in the prohibited foreign funding case instead of blowing his own trumpet for the bye-elections achievements, he maintained.\nHe also proposed that the PTI chief should go to the Parliament and discuss the issues in the larger interests of public and country.\nHe was of the view that Imran Khan was a man of double standards as he was least bothered to go in the parliament but taking part in the bye-elections.\nThe JUI-F spokesperson said this was the only party which had sunk economy of the country during its regime and being in opposition, he had wasted millions of rupees and precious time of the public in the bye-elections.",
  "retrievedAt": "2025-08-11T15:45:05.345Z"
}
