{
  "title": "PM for constituting expert committee on climate change",
  "link": "https://www.app.com.pk/national/pm-for-constituting-expert-committee-on-climate-change/",
  "date_published": "2022-10-18T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Prime Minister Muhammad Shehbaz Sharif Tuesday directed to constitute an Expert Committee on Climate Change which would be advising the federal government with regard to strategies on the issues related to various aspects of climate change such as climate finance, adaptation, and loss and damage assessment.\nThe Prime Minister, who was chairing the first meeting of Pakistan Climate Change Council (PCCC) here, commended the initiative of the Ministry of Climate Change with regard to the constitution of the Climate Change Council and praised the Minister for Climate Change for pleading the case of Pakistan with regard to climate change, globally.\nHe said that climate change induced devastating floods had caused havoc across the country, especially in the provinces of Sindh and Balochistan.\nDespite having less than 1 percent share in the global carbon emission, Pakistan was one of the ten countries most affected by climate change, he underlined, a press release issued by the PM Media Wing here said.\nThe Prime Minister urged the need to improve risk mapping, capacity building to access climate finance as well as loss and damage assessment ability.\nHe emphasized on including risk mitigation and adaptation in disaster management strategies to reduce damages in the future.\nThe Prime Minister also stressed on the need of better coordination among the federating units on environment issues as environment was a devolved subject after the 18th Constitutional Amendment.\nThe meeting was briefed that this year, Pakistan suffered overwhelming events like severe drought (that dried the delta area of Sindh province), forest fires, heat waves, glacier melting with three times than the average rate, glacial outbreak floods followed by heavy monsoon rains, were induced by climate change.\nIt was informed that the World Bank had estimated Pakistan’s recent flood losses at US $ 40 billion.\nPakistan faced 152 extreme events related to climate change in the last two decades and there was 300 percent increase in Glacial Lake Outburst Floods (GLOF), the meeting was told.\nIt was further briefed that high intensity heatwave persistence had increased to 41 days per year and Pakistan had hottest cities in the world for straight three years with temperature rising as high as 53.7 degree celsius.\nThe participants were further briefed that the upcoming 27th Conference of Parties (COP) under the United Nations, to be held in Egypt in November 2022, would provide Pakistan with an opportunity to present its stance on vulnerability with regard to effects of climate change, water scarcity, food security, sea level rise and increase in climate induced migration.\nThe meeting was apprised that being a chair of Group 77 countries, Pakistan would also be pleading the case of the member countries with regard to the effects of Climate Change.\nThe participants of the meeting while appreciating the initiative of the federal government emphasized on the need of devising a National Adaptation Plan and strict implementation of the existing environment laws to mitigate the effects of climate change.\nThe PCCC was constituted under Pakistan Climate Change Act, 2017. The current PCCC was notified on 29th August 2022. The Council is headed by the Prime Minister with 26 official and 20 non-official members.\nThe function of the council is to advise and coordinate on Pakistan’s international commitments on climate change and environment issues, mainstreaming climate change concerns into decision making and implementation of comprehensive adaptation and mitigation policies.\nThe meeting was attended by Minister for Climate Change Ms. Sherry Rehman, Minister for Information and Broadcasting Ms. Marriyum Aurangzeb, Minister for Water Resources Syed Khursheed Shah , Minister for Power Engineer Khurram Dastgir, Prime Minister of Azad Jammu and Kashmir Sardar Tanveer Ilyas , Provincial Ministers and officials from Gilgit Baltistan, Azad Jammu and Kashmir, environmental experts, lawyers, environmental journalists and members from the civil society.",
  "retrievedAt": "2025-08-11T15:45:01.851Z"
}
