{
  "article_id": "2025-04-28_a81f32a48701e677a0764cc292fb4219",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-achieve-4-billion-in-it-exports-shaza/",
    "retrieved_at": "2025-08-27T14:59:00.068Z"
  },
  "metadata": {
    "title": "Pakistan to achieve $4 billion in IT exports: Shaza",
    "author": null,
    "date_published": "2025-04-28T08:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 457,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 28 (APP):Federal Minister for Information Technology and Telecommunications, Shaza Fatima Khawaja, said on Monday that Pakistan is expected to reach $4 billion in IT exports during the current fiscal year (July 2024 to June 2025). While briefing foreign media about the upcoming Foreign Direct Investment (FDI) Digital Forum, scheduled for April 29-30, she said that Pakistan's IT exports were $3.2 billion last year and are projected to grow by 27% to hit $4 billion this year. \"We are working to speed up our efforts and aim to achieve the $4 billion target within the current financial year,\" she added. She further said the Prime Minister had set an ambitious goal of reaching $25 billion in IT exports over the next four years. The minister said the ministry is aiming for $15 billion from direct IT export services and IT products, while targeting an additional $10 billion in economic impact through the government's National Digitalisation Program. Talking about the FDI Digital Forum, she shared that more than 400 delegates and 30 local and international investors are expected to participate. She also mentioned that around 10 ministers from different countries would attend the event. \"This is an opportunity for the world to see Pakistan as a new hub for technology and innovation,\" she said. She added that the forum would include high-level meetings, policy discussions, and networking sessions to promote international cooperation in technology and digital investment. Shaza Fatima highlighted that the forum is an important step towards making Pakistan a regional center for technology. \"This event is not just a gathering; it shows Pakistan's commitment to joining the global digital economy,\" she stated. The forum is being organized in partnership with the Digital Cooperation Organization (DCO), led by Saudi Arabia. Member countries of DCO, along with representatives from other nations, will attend, making it a truly global platform for digital investment discussions. \"The main aim is to present Pakistan as a strong candidate for digital foreign direct investment,\" she emphasized. She noted that Pakistan's young and skilled population-with more than 150 million people under the age of 35, is a major advantage in attracting international investors. \"Our talent in cybersecurity, fintech, and emerging technologies is growing fast. Several Pakistani startups are close to achieving unicorn status,\" she added. Shaza Fatima also highlighted the government's strong support for entrepreneurship and innovation, mentioning initiatives like the National Incubation Centers and Special Technology Zones. These offer benefits such as 10-year tax exemptions and easy profit repatriation for investors. She further said that although Pakistan is the third-largest freelancing economy in the world, it still faces challenges due to the lack of smooth international payment gateways. She pointed out that this gap creates a major opportunity for foreign fintech companies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}