{
  "article_id": "2025-04-28_2fac285dd2f4ffb52f77cbdf294e900f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-condemns-banning-of-pakistani-media-journalists-youtube-channels-in-india/",
    "retrieved_at": "2025-08-27T14:57:00.002Z"
  },
  "metadata": {
    "title": "Tarar condemns banning of Pakistani media & journalists’ YouTube channels in India",
    "author": null,
    "date_published": "2025-04-28T18:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 28 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Monday condemned the Indian move to ban YouTube channels of Pakistani media, journalists and anchorpersons in India following the Pahalgam incident. The minister contacted the heads of various Pakistani media organizations, journalists, and anchorpersons following the Indian illegal action to ban their YouTube channels in its country, said a news statement. During the telephone calls, Tarar paid tribute to the Pakistani media for effectively defending the national narrative and logically presenting Pakistan's stance to the world against Indian propaganda. He said the Indian government imposed such restrictions to hide its embarrassment and humiliation at the global level. \"Such actions neither suppress the facts, nor can Pakistan's position be hidden from the world,\" the minister said while highlighting the failure of India's narrative on global stage. He praised the Pakistani media for playing an exemplary role in the current situation by demonstrating professionalism, responsibility, and patriotism. He lauded them for effectively countering Indian propaganda and clearly presenting Pakistan's viewpoint to the international community. The minister said the Government of Pakistan would continue to provide its full support for media organizations and journalists contributing to upholding national dignity and promoting the national narrative. \"The government encourages every voice that promotes of the country's integrity, dignity, and national narrative,\" he remarked. He stressed that the Indian government's decision to restrict Pakistani TV channels and YouTube platforms is a blatant violation of international principles of journalism. Tarar announced that the Government of Pakistan would raise this issue on relevant international forums to inform the world about India's restrictive measures. He noted that the Pakistani media prioritized national interests, keeping the sensitivity of the situation in mind, and set an example of highly balanced and responsible reporting. The services of Pakistani media and journalists would be remembered forever, he added. APP/nvd",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}