{
  "article_id": "2025-04-28_27730b03d578c0a9758aed03cf6ea7ae",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/standing-committee-directs-urgent-reforms-in-pbm-operations-amid-concerns-over-service/",
    "retrieved_at": "2025-08-27T14:58:09.840Z"
  },
  "metadata": {
    "title": "Standing Committee directs urgent reforms in PBM operations amid concerns over service",
    "author": null,
    "date_published": "2025-04-28T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 487,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 28 (APP): The National Assembly's Standing Committee on Poverty Alleviation and Social Safety has directed Pakistan Bait-ul-Mal (PBM) to urgently revise its child labor stipend structure, accelerate the operationalization of Benazir Income Support Programme (BISP) centers, and address critical service delivery gaps, as part of a wide-ranging review of welfare initiatives. The Committee meeting, held at the PBM headquarters was presided over by Mir Ghulam Ali Talpur. The meeting assessed the implementation status of previous directives and expressed profound dissatisfaction over prolonged delays, especially the failure to operationalize BISP centers in Malam Bot Tehsil and other marginalized regions near the Pak-Afghan border in Khyber Pakhtunkhwa. BISP officials informed the Committee that their governing board has remained defunct since February 2025, stalling the establishment of new centers in 180 tehsils nationwide. The Secretary of the Poverty Alleviation and Social Safety Division added that key approvals have been pending at the Prime Minister's Office since March 2025, further hampering progress. Responding to inquiries regarding internal promotions, PBM representatives clarified that such processes have been suspended under the federal government's ongoing rightsizing policy. The Committee received a comprehensive briefing on PBM's extensive welfare mandate, encompassing healthcare, education, women empowerment, child welfare, elder care, and disability support. It was noted that financial aid eligibility remains strictly limited to individuals earning below the minimum wage threshold of Rs. 37,000 per month, excluding all public-sector employees. Key highlights included PBM's disbursement of up to Rs. 1 million for oncology treatments and Rs. 2.15 million for cochlear implants, cumulatively spending over Rs. 15 billion over the past 15 years. Educational scholarships are provided through university nominations, with funds transferred directly to institutions. The Committee directed PBM to submit a detailed list of all beneficiary universities. In vocational training, PBM collaborates with NAVTTC to offer six-month courses across 15 trades, with a special focus on women, while child protection initiatives include 160 schools for child laborers and 46 Sweet Homes for orphans, extending support through tertiary education. The Committee also voiced serious concerns over the inadequacy of the Rs. 50 daily stipend for children enrolled in PBM schools, directing an immediate survey to align stipends with inflation and international child protection standards, particularly in light of Pakistan's GSP Plus obligations. Other discussions revolved around university-wise scholarship distribution, data-sharing with federal entities, accreditation for the proposed Nursing Training Institute, and PBM's limited presence in certain districts like Bajaur and Chitral. Members appreciated PBM's efforts to improve efficiency through in-house production of school uniforms and acknowledged progress on planned initiatives, including the Nursing Training Institute and a Regional Blood Centre. The session concluded with comprehensive directives for PBM to enhance service delivery, finalize pending proposals with robust data support, and expand outreach efforts before the next Committee meeting. The meeting was attended by committee members Mir Ghulam Ali Talpur, Ahmad Ateeq Anwer, Mir Khan Muhammad Jamali, Mohammad Ilyas Choudhary, Aasia Ishaque Siddiqui, Malik Sohail Khan",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}