{
  "article_id": "2025-04-28_22c0bf148189a3897e952ebc31a45c49",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pahalgam-attack-shatters-indian-govts-claims-of-bringing-peace-development-in-iiojk-experts/",
    "retrieved_at": "2025-08-27T14:58:37.450Z"
  },
  "metadata": {
    "title": "Pahalgam attack shatters Indian Govt’s claims of bringing peace & development in IIOJ&K: Experts",
    "author": null,
    "date_published": "2025-04-28T08:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 882,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "PESHAWAR, Apr 28 (APP):The recent deadly attack on tourists in Pahalgam at Indian Illegally Occupied Jammu and Kashmir (IIOJ&K), has badly exposed the hollowness of the Modi regime's long-standing narrative of peace and development in the Occupied Kashmir where life has become a nightmare for oppressed Kashmiris. The attack, widely suspected to be orchestrated under suspicious circumstances by RAW in a bid to malign Pakistan, has testfied India's state-sponsored terrorism and intelligence failure. Critics claimed that the Indian Research and Analysis Wing (RAW) could be behind the incident, describing it as part of a larger false flag operation at Pehalgam to deflect global attention from attrocities and human rights abuses at IIOJ&K and declared it a nefarious plot to malign Pakistan. Former Interior Minister and Chairman of the Qaumi Watan Party, Aftab Ahmad Khan Sherpao, strongly condemned India's accusation against Pakistan and criticized the fascist Modi government for immediately blaming Pakistan without any credible investigation or evidence. \"No responsible nation could make allegations against other without completing an impartial probe and presenting irrefutable proof,\" Sherpao told media at Charsadda district. He highlighted the deteriorating security situation in IIOJ&K since the revocation of the region's limited autonomy on August 5, 2019 by India. \"Instead of fostering peace and development, the unilateral abrogation of Article 370 and the imposition of direct rule from New Delhi has only deepened alienation among Kashmiris besides endorsed India is invader ',\" he said. According to Aftab Sherpao, the Pahalgam attack has strongly reflected not just a collapse of law and order at IIOJ&K but a significant failure of India's intelligence apparatus. The timing of the attack has also raised eyebrows internationally, coinciding with the visit of U.S. Vice President JD Vance to India. Security analysts questioned whether the incident was politically motivated, pointing to the lack of transparency regarding casualties, forensic evidence, or details of the assailants. \"If it was truly a terror attack, where is the evidence where are the bodies of the attackers, their weapons, communication records, or surveillance footage?\" asked Brigadier Retd Mehmood Shah, former Secretary Law and Order of erstwhileFata. He warned that India's attempts to suspend or manipulate the Indus Waters Treaty in the wake of heightened tensions would be a grave violation of international law. \"The World Bank and other international bodies are custodians of this treaty. Any move to unilaterally alter it will be met with firm resistance,\" he cautioned, vowing that Pakistan would not allow even a single drop of its rightful share of water to be compromised. Emphasized Pakistan's military preparedness, he declared that the country's armed forces are fully capable of responding to any foreign aggression. \"Pakistan has repeatedly foiled India's nefarious designs in the past, and the nation stands resolutely behind its defenders,\" he reiterated. Aftab Sherpao lauded Pakistan's National Security Council for its firm and measured response to India's baseless allegations, calling it timely and responsible. Linking the Pahalgam incident and the recent attack on the Jafar Express, Sherpao suggested that India is actively trying to sabotage Pakistan's strategic initiatives, particularly the China-Pakistan Economic Corridor (CPEC). \"India views projects like Gwadar Port and CPEC as threats and is determined to obstruct their progress by creating regional instability,\" he claimed. He said arrest of Kalbushan Yadev magfied India's involvement in terrorism in Pakistan. Manzoorul Haq, former Ambassador said that Indian government was disheartened after seeing muted international reaction after the Pahalgam incident. Despite implications of Pahalgam for regional stability, he said that Indian security establishment was unnerved after noting a lack of strong condemnation or solidarity from international community as well as global players besides human rights international organizations. In deep frustration, he said that Indian occupation forces have started demolishing the houses of innocent Kashmiris in IIOJK in what is being widely seen as a form of collective punishment against the entire Kashmiri community. The blowing of houses of innocent Kashmiris through explosives and bombs by Indian Occupied soldiers was highly condemnable, urging international community to take notice of it. Hussain Khateeb, leader of All Parties Hurriyat Conference (Geelani Group) strongly condemned the accusations of fascist Modi Govt after Pehalgam incident against Pakistan. He claimed that India has made communication and media blackouts after Pehalgam incident at IIOJ&K to deprive people of truth. The gruesome violation of human rights including forced disappearance of over 8,000 innocent Kashmiris, 8,652 unmarked mass graves and imposition of longest curfew on some 10 million unarmed Kashmiris in IIOJK exposed Modi Govt involvement in state terrorism, he claimed. Citing reports, he said that around 162,000 cases of arbitrary arrests and torture, over 25,000 pellet guns injuries, 11,250 women raped, 23,000 women widowed and over 108,000 children orphaned since 1989 in IIOJK. The excessive use of snipers and cluster ammunitions by India to target innocent Kashmiris, using children and women as human shields by Indian army during encounters and making them sleep at military camps by forcing them to dig out minefields and tying youth on military jeeps at IIOJK have further testified Indian forces direct involvement in war crimes and genocide of Kashmiris. The experts said the road to peace in South Asia is passing through Kashmir and urged the international community to take notice of India's provocative illegal actions, state terrorism and ensure that peace and justice prevail in IIOJ&K.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}