{
  "article_id": "2025-04-28_b0e398ccb3d9fb3de04a77aa10797683",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-police-academy-upgradation-project-initiated-after-31-years-mohsin-naqv/",
    "retrieved_at": "2025-08-27T14:57:27.948Z"
  },
  "metadata": {
    "title": "National Police Academy Upgradation Project initiated after 31 Years: Mohsin Naqv",
    "author": null,
    "date_published": "2025-04-28T14:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 333,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 28 (APP): After 31 years, the upgradation project of the National Police Academy has been initiated. Construction and renovation work for new classrooms and residential blocks for trainee officers has been started. Federal Interior Minister Mohsin Naqvi visited the National Police Academy and inspected the construction work. Interior Minister reviewed the newly constructed classrooms and residential block. He instructed the completion of the upgradation project within six months maintaining high-quality standards. For the upgradation, the Interior Minister handed over a cheque worth 250 million rupees to the Commandant of the Academy on behalf of the National Police Foundation. Moreover, Interior Minister Mohsin Naqvi chaired a high-level meeting regarding the restructuring of the National Police Academy. He emphasized that all necessary arrangements for issuing master's degrees to trainee officers should be completed promptly, adding that establishing the National Police University is the ultimate goal. He said that restructuring the National Police Academy is a priority, and as it plays a crucial role in improving the country's policing system. He stated that the goal is to elevate NPA to an international standard institution. Minister of State for Interior Tallal Chaudhry, Secretary Interior, Commandant National Police Academy, DG FIA, Chairman CDA, IG Islamabad Police, and other concerned officers were present at the meeting. Minister of State for Interior Tallal Chaudhry stated that the academy should be capable of attracting officers from abroad for training, and courses on IT and cybercrime should be made an essential part of the training programs according to modern requirements. During the meeting, progress on the upgradation plan of the National Police Academy based on modern lines were reviewed. Commandant National Police Academy Muhammad Idrees Ahmad briefed the meeting on the master plan for restructuring the NPA. It was informed that the phased implementation of the restructuring project of the National Police Academy has begun as per the Interior Minister's directives. Furthermore, the best police officers from all four provinces are being appointed as Course Commandants and Assistant Course Commandants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}