{
  "article_id": "2025-04-28_61370d08d2453ae4a901f953cb5de589",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/indian-propaganda-about-release-of-additional-water-in-jhelum-river-exposed/",
    "retrieved_at": "2025-08-27T14:59:06.851Z"
  },
  "metadata": {
    "title": "Indian propaganda about release of additional water in Jhelum River exposed",
    "author": null,
    "date_published": "2025-04-28T07:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 243,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 28 (APP):Indian propaganda about release of additional water into the Jhelum River has been exposed. Sources said that India will make an effort to validate its announcement of the unilateral suspension of the Indus Waters Treaty. Such attempt by India is nothing more than to be fooling its own people, they said. Earlier, the sources said India tried to create the impression of a flood situation by releasing additional water into the Jhelum River. As a result, 22,000 cusecs water passed through Domel ( Muzaffarabad). Following the unilateral suspension of the Indus Waters Treaty, Ministry of Water Resources and WAPDA are monitoring western rivers. India does not have the capacity to block or significantly alter the flow of the river,\" the sources remarked. They said that there is no threat to Pakistan's water needs from India. Currently, India has a total storage capacity of only 0.624 million acre-feet (MAF) on the western rivers while Mangla Reservoir in Pakistan alone has a storage capacity of 7.35 (MAF). Therefore, no significant or permanent disruption is expected in Pakistan's water supply, the Experts said. The Ministry of Water Resources and WAPDA are continuously monitoring the situation and issuing timely updates. At present, there is no immediate threat to Pakistan's water security or supply, they added. However, they said that keeping in view climate change, there is dire need to construct water reservoirs on fast-track. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/04/WhatsApp-Video-2025-04-28-at-11.37.50-AM.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}