{
  "title": "Marri terms SCO international forum for poverty alleviation as a great effort",
  "link": "https://www.app.com.pk/national/marri-terms-sco-international-forum-for-poverty-alleviation-as-a-great-effort/",
  "date_published": "2022-05-26T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):Minister for Poverty Alleviation and Social Safety, Shazia Marri Thursday said that the international forum under the auspices of Shanghai Cooperation Organization (SCO) for poverty alleviation is a great effort to increase inter-state cooperation to share experiences for eradicating poverty.\nIn her keynote address during a webinar of delegates of SCO member countries ‘Pooling Efforts and Developing Collaborative Approaches Toward Poverty Reduction in the SCO Area’, Shazia Marri said the government, under the Poverty Alleviation and Social Safety Division spearheads one of the largest social safety initiatives in the world.\nLauded across the world by agencies such as the UN, the Ministry’s social safety initiative aims to create a welfare state by countering elite capture and leveraging 21st century tools and approaches, such as the use of data and technology to create precision safety nets; promoting financial inclusion and access to digital services; supporting the economic empowerment of women; focusing on human capital formation; overcoming financial barriers to accessing health and education; tackling malnutrition in all its forms, and employing multi-sectoral and multi-stakeholder approaches to develop solutions at scale.\nShazia Marri said that the ministry functions through ancillary organizations, Benazir Income Support Program (BISP), Pakistan Bait-ul-Mal (PBM) and Pakistan Poverty Alleviation Fund (PPAF).  BISP has a long-term objective of meeting the targets of Sustainable Development Goals (SDGs) to eradicate extreme and chronic poverty, and empowerment of women, she added.\nWith continuous improvement in its design and programme implementation, BISP has now transformed into a premier social protection institution in Pakistan which is regularly providing support to over eight million poorest of the poor families through its unconditional cash transfer (UCT) and multi-sectoral focused conditional cash transfer (CCT) programmes, she said.\nThe delegates were apprised that Benazir Undergraduate Scholarship program is the largest ever need and merit-based program for students from low-income backgrounds.  The program is providing 200,000 scholarships worth Rs. 24 billion over 4 years.  Pakistan Bait ul Mal (PBM) is running 51 orphanages, one Old Home dedicated for senior citizens and around 160 Women Empowerment Centers for providing vocational training for women, orphans and underprivileged girls in order to facilitate their skills development.\nThe Rs 42.65 billion program, being run by Pakistan Poverty Alleviation Fund (PPAF), is providing interest free loans to 160 districts across the country in order to facilitate graduation out of poverty.  Shazia Marri welcomed the SCO member countries’ delegates for embarking upon learning more about Pakistan’s efforts and achievements to fight the challenge of poverty and share their experiences and best practices with us to further improve our programs for social protection of our vulnerable communities.\nOlga Batalina, first Deputy Minister of Labour and Social Protection of the Russian Federation, Ashurboy Solehzoda, first Deputy Minister of Economic Development and Trade of the Republic of Tajikistan , Li Xin, Deputy Director-General of IPRCC in China, Mirzohid Ubaydullaev, Deputy Minister of Economic Development and Poverty Reduction of the Republic of Uzbekistan, Nurdoolot Bazarbaev,\nDeputy Minister of Labour, Social Security and Migration of the Kyrgyz Republic, Nataliya Belonosova, head of the Department of Labor Statistics and Living Standards of the Statistics Committee of the Republic of Kazakhstan, Tatiana Brantsevich, Deputy Minister of Economy of the Republic of Belarus and Pramod Anand, senior consultant of NITI Aayog of the Government of India, were the delegates who participated in the virtual session.",
  "retrievedAt": "2025-08-11T14:58:12.500Z"
}
