{
  "title": "Govt announces Rs 30 per liter increase in POL prices",
  "link": "https://www.app.com.pk/national/govt-announces-rs-30-per-liter-increase-in-pol-prices/",
  "date_published": "2022-05-26T17:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP): Minister for Finance and Revenue Miftah Ismail Thursday announced to increase in the prices of petroleum products by Rs 30 per liter saying that the government had to take the tough decision only in the larger national interest of Pakistan.\n“We understand that with this decision, our political capital would go down and we also know that our government will have to face tough criticism but national interests are more important compared to our political gains,” Miftah Ismail said while talking to a hurriedly called press conference here.\nHe said the government had decided to raise the prices of the major petroleum products including Petrol, High-Speed Diesel, Light Speed Diesel, and Kerosene Oil by Rs 30 per liter.\nThe new prices of petrol would be Rs 179.86 per liter, that of High-Speed Diesel (HSD), Rs 174.15, Kerosene Oil Rs 155.56 perlite, and Light Diesel Oil (LDO) Rs 148.31. The new prices would be implemented from May 27 (12:00 am), he added.\nHe said despite this increase, the government still had to bear the loss of Rs 56.71 per liter on HSD, Rs 37.84 on LDO, Rs 21.83 on Kerosene Oil, and Rs 17.02 on Petrol.\nThe finance minister added that the government had also decided to protect the poor people by announcing a targeted subsidy that would be announced by the Prime Minister soon.\nThe government still had enough time of 14 months which is enough time to improve the country’s economy.\nHe said the decision would also help stabilize the Pakistani Rupee and the Current Account Balance would also be maintained.\nHe said when the Imran Khan’s government announced to fix the prices of petroleum products until June 30, the international price of crude oil was $90 while now it was $117 per barrel.\nHe said the current government had to bear the loss of over Rs 110 billion per month in terms of subsidy on petroleum products which was three times more than the expenditures needed to run the civil government for one month.\nHe said the rich people who were using more fuel were enjoying more subsidies which were unjustified.\nSimilarly, he said an average industrialist was getting a monthly subsidy of around Rs 1.2 million to supply his or her goods.\nHe said the International Monetary Fund had also linked its program with Pakistan with removing the subsidy, therefore “we had no option but to partially remove the subsidy”.",
  "retrievedAt": "2025-08-11T14:58:12.488Z"
}
