{
  "title": "Yasin punished to give political advantage to criminal Modi: Mushaal",
  "link": "https://www.app.com.pk/national/yasin-punished-to-give-political-advantage-to-criminal-modi-mushaal/",
  "date_published": "2022-05-26T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP): Mushaal Hussein Mullick, wife of jailed Kashmiri Hurriyat leader Yasin Malik said that undoubtedly, the hypocritical and barbaric Indian authorities have influenced the court decision against Yasin; but she added that they cannot suppress the voice of prison of conscious.\nAddressing a press conference here on Thursday, Mushaal, who is also Chairperson of the Peace and Culture Organization, said that the Indian court gave a verdict of life imprisonment to her husband to give political advantage to fascist Narendra Modi, who is known as the world worst criminal Prime Minister.\nShe said that India must end these war crimes and politics of hatred and intolerance in Indian Illegally Occupied Jammu and Kashmir (IIOJK). “Now I look upon the international bodies UN, UNHCR and world powers to take notice of this war crime and save the life of a warrior of his motherland and to stop this grave injustice against Yasin,” she added.\n“They can give all the verdicts they want. It won’t stop us from fighting for our freedom. I will continue this struggle till my last breath and then my daughter will continue this fight. And we will fight for generations till we are given our rights,” she vowed.\n“Raziyah Sultana misses her Papa, as she saw him over 8 years ago when she was a baby,” she added.\nMushaal said that the courts have given the decision to imprison my Yasin for life. The courts can take the ultimate decision to satisfy the collective conscious of the society even if there is no evidence against the accused. And same has happened in India, as nothing else can be expected from them, she maintained.\nShe said that India was playing dirty and unlawful game and violating fundamental rights of Kashmir nation but ironically the international community and human rights activists observed criminal silence.\nMushaal demanded that human right violations in IIOJK should be stopped, lift the brutal military siege, and let the Kashmiri people exercise their right to self-determination in accordance with their aspirations and relevant United Nations Security Council resolutions.",
  "retrievedAt": "2025-08-11T14:58:16.311Z"
}
