{
  "title": "India, Pakistan clash at UN after Pakistani envoy censures New Delhi’s repression in Kashmir",
  "link": "https://www.app.com.pk/national/india-pakistan-clash-at-un-after-pakistani-envoy-censures-new-delhis-repression-in-kashmir-2/",
  "date_published": "2022-05-26T11:07:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, May 26 (APP):Representatives of India and Pakistan got into a fresh verbal duel in the UN Security Council on Wednesday,  after Pakistani Ambassador Munir Akram castigated New Delhi’s continued oppression in occupied Kashmir, as he drew attention to the life sentence awarded to Kashmiri leader Yasin Malik by an Indian court on fake terrorism charges,\nThe Indian representative, Vidisha Maitra, reacted to the Pakistani envoy’s pointed words, claiming that Jammu and Kashmir was an integral part of India and asked Pakistan to stop “state terrorism”.\nQasim Aziz Butt, who represented Pakistan, rejected India’s claim about Jammu and Kashmir being its integral part, saying it was a disputed territory, per all United Nations maps and official documents.\nResolution 47 (1948), noting the desire of India and Pakistan, states that the question should be decided through the democratic method, a free, impartial plebiscite, a call reiterated in resolution 91 (1951) and 122 (1957), among other resolutions of the United Nations Commission for India and Pakistan, notably those of August 1948 and January 1949.\nIndia, he said, accepted this decision and is bound to comply with it, in line with Article 25 of the Charter of the United Nations.\nButt said only an occupier would oppose implementation of Security Council resolutions that promise self-determination to the people of the disputed Jammu and Kashmir. If India had any respect for international humanitarian law, it would withdraw its troops and allow the Kashmiris to freely decide their future, per the Council’s resolutions.\nThe Pakistani representative accused India of being one of the world’s largest purveyors of State terrorism, notably against each of its neighbours, including Pakistan. At home, State-directed terrorism is being unleashed against all minorities.\nUnder the “RSS BJP Government”, actions are guided by a supremacist ideology that has fomented Islamophobia in political discourse.\n“In today’s incredibly intolerant and fading India, 200 million Muslim minority faces frequent lynching by ‘cow vigilantes’; pogroms by RSS thugs, with official complicity; discriminatory citizenship laws to expel Muslims; and a concerted campaign to destroy mosques and the rich Muslim heritage of India,” Butt said.\n“With such horrendous track record on democracy, rule of law and human rights, India surely does not deserve a place at this very Council, and in the wider law-abiding world community.”",
  "retrievedAt": "2025-08-11T14:58:17.708Z"
}
