{
  "title": "PBM making all out efforts for social protection of marginalized segments of society: Shahadat",
  "link": "https://www.app.com.pk/national/pbm-making-all-out-efforts-for-social-protection-of-marginalized-segments-of-society-shahadat-2/",
  "date_published": "2023-01-13T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): Minister of State for Law and Justice Shahadat Awan on Friday said Pakistan Bait-ul-Mal (PBM) was making all-out efforts for the social protection of marginalized segments of the society by utilizing all available resources.\nResponding to a question raised by Senator Fawzia Arshad, the minister said Women Empowerment Centres (WECs) were making poor widows and orphan girls self-reliant, improving their living standards and providing them financial security.\nHe said the WECs were inculcating traditional and non-traditional skills based on the market needs/demands through various training programs. The PBM had established 163 WECs so far throughout the country in a phased manner, he added.\nShahadat said the PBM initiative Schools For Rehabilitation of Child Labor (SRCLs) had been established to pull out the children from labor and to educate them, in line with the United Nations and other International Labor Organization‘s Conventions. 159 SRCLs were functional all over the country so far, he added.\nHe said the children involved in child labor were enrolled in these schools and free education was being imparted up to the primary level. They were provided free of charge books, stationery, uniform/shoes, and Rs10 daily stipend/parents subsistence allowance of Rs 300 per month, he maintained.\nShahadat informed that at present, 17,589 children were enrolled in these schools and 47,441 students had been passed out since the inception of this project.\nHe said a person who has a monthly income of up to Rs 30,000 would be treated as poor and eligible for receiving financial assistance under Individual Financial Assistance Medical.\nThe PBM also provided financial assistance to the individual destitute for the provision of Hearing Aids, Artificial Limbs, Education, General, Sewing machines, and Wheel Chairs, he added.\nHe said it had established 51 orphanages titled as ‘Sweet Home’ throughout the country since 2009. The objectives of its establishment were to develop a modern approach towards the welfare of orphans, to provide modern education, and impetus to participate in the mainstream of life with pride and dignity.\nSpecial individual attention was given on the physical, mental, and psychological condition of each child, and a clean and hygienic environment was provided to these sweet angels, he said adding the children were admitted to the renowned and well-reputed schools of the city for formal education from Class-1 to Class-10.\nHe said each center accommodated 100 orphan children and the age limit for enrolment was 4 to 6 years.The state minister said a ‘Old Home’ was established in Lahore in 2014 and serving senior citizens of Pakistan. At present, 29 residents were provided with well-furnished accommodation, food, clothing, and medical facilities in this center, he added.\nHe said the main goal of this program was to provide care, love, hope, and security in the 3rd phase of life to the un-cared senior citizens.\nHe said the PBM had established a state-of-the-art Pakistan Thalassemia Centre (PTC)here at F-9 Park, Islamabad. In this center, needy and deserving thalassemia patients were being provided free-of-charge blood transfusion services and medicines.\nShahadat said the federal government initiated the Panna Gah and “Roti Sab Kay Liye” program in the year 2020 to ameliorate the sufferings of the poor masses. During this period, 8,142,167 people benefited from the project, he maintained.",
  "retrievedAt": "2025-08-11T05:43:54.462Z"
}
