{
  "title": "SIFC to ensure ‘ease of doing business’ for domestic & foreign investors : COAS",
  "link": "https://www.app.com.pk/national/sifc-to-ensure-ease-of-doing-business-for-domestic-foreign-investors-coas/",
  "date_published": "2023-08-01T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Chief of Army Staff (COAS), General Syed Asim Munir on Tuesday said the Pakistan government, along with state institutions, had ensured the establishment of Special Investment Facilitation Council (SIFC), in order to bring the stakeholders at one platform.\nAddressing the Pakistan Mineral Summit, he said it had laid down new rules for ‘ease of doing business’ for domestic and foreign investors in the country.\n“We will ensure an investor-friendly system that avoids unnecessary delays and provides easy terms and conditions for business. There are vast mining opportunities in our country which will be realized through joint efforts,” he added.\nThe Army Chief thanked the foreign delegates and investors for participating in the moot, which was the first such event in the country. He also thanked Barrick Gold Corporation CEO and President Mark Bristow and Saudi Mining Minister Engineer Khalid bin Saleh Al Madifar and other investors.\nHe stressed persistence for staying on the path of peace and prosperity and said the mineral-related projects were the stepping stone, which would eventually lead towards the development of the masses.\nReferring to natural resources of the country, he said: “Just look at your country, from the snow-capped mountains to the vastness of the deserts, from the coastline to the plains. What else is not there in this land?”He said : “In Surah Rahman, Allah the Exalted has said: And which of the favors of your Lord will you deny?”\nThe Army Chief noted : “If the nation has profound commitment, then the sky is the limit and its vastness awaits us.”He specifically referred to the Holy Qur’an: “Allah helps those who help themselves”.\nHe also read Allama Iqbal’s poem that underlined the need for an individual to remain steadfast in hard times and strengthen its faith in Allah Almighty to achieve his or her destination.\n“It is our social responsibility to play our collective role in the country’s economy. We must never lose hope. Our land is endowed with many minerals and to fully utilize this potential, we invite foreign investors to play their role in discovering the hidden treasures of Pakistan,” he said.\nThe Army Chief emphasized on optimism and full faith in Allah Almighty. He recited verses 155 and 156 of Surah Al-Baqarah of the Holy Quran : “And We will certainly test you with fear and hunger and lives and wealth and fruits. When any trouble befalls them, they say; Indeed, we are from Allah and to Him we must return.”",
  "retrievedAt": "2025-08-11T09:02:43.095Z"
}
