{
  "title": "SIFC to ensure immediate, uninterrupted execution of foreign investment projects: PM",
  "link": "https://www.app.com.pk/national/sifc-to-ensure-immediate-uninterrupted-execution-of-foreign-investment-projects-pm/",
  "date_published": "2023-08-01T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Prime Minister Shehbaz Sharif on Tuesday said that the Special Investment Facilitation Council (SIFC) would ensure the immediate and uninterrupted completion of the projects of foreign investment in Pakistan.\nThe prime minister, in a meeting with a Saudi delegation led by Saudi Deputy Minister for Mining, Industries and Minerals Khaled bin Saleh Al-Mudaifer, said there existed immense investment opportunities in Pakistan, particularly in the mining sector.\nWelcoming the delegation, the prime minister said Pakistan was thankful to the Saudi government and people for supporting Pakistan in every need of the hour.\n“Pakistan is your second home. The brotherly relations between Pakistan and Saudi Arabia were of special significance. The whole Pakistani nation was grateful to Saudi King Salman and Crown Prince Mohammed bin Salman for supporting Pakistan in every difficult time,” he remarked.\nThe prime minister assured the delegation that not only the interim government but also the next elected government would keep on facilitating the investors.\nHe said the solar power project of 10,000 megawatts announced by the government was also a good opportunity for investment.\nThe Saudi minister said that the establishment of SIFC was a positive message to foreign investors in Pakistan. Saudi Arabi was keen to invest in the vast opportunities of investment in the mining sector of Pakistan, he added.\nThe Saudi minister appreciated the prime minister for the pro-investor measures particularly the establishment of the SIFC as it would lead to economic development.\nCalling Pakistan his second home, the Saudi minister assured that Saudi Arabia would continue to support Pakistan.\nFederal Minister Engineer Khurram Dastgir, Minister of State for Petroleum Musaddik Malik, Special Assistant to PM Tasnim Ahmed Qureshi and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T09:02:40.215Z"
}
