{
  "title": "President emphasises exploring new trade opportunities with Malaysia",
  "link": "https://www.app.com.pk/national/president-emphasises-exploring-new-trade-opportunities-with-malaysia/",
  "date_published": "2023-08-01T10:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): President Dr Arif Alvi on Tuesday said that Pakistan greatly valued its historical and brotherly ties with Malaysia and wanted to further improve bilateral cooperation in the areas of trade, economy, education, and culture.\nThe president expressed these views while talking to Pakistan’s High Commissioner-designate to Malaysia, Syed Ahsan Raza Shah, who called on him, at Aiwan-e-Sadr here.\nTalking to the high commissioner, the president emphasized the need for further improving trade, investment, and economic relations with Malaysia by fostering linkages with the Malaysian business community and chambers of commerce.\nHe said that bilateral trade between the two countries had witnessed a substantial increase during the last years, however, efforts should be made to further enhance Pakistan’s exports to Malaysia through value-added products.\nHe highlighted the need to explore new opportunities for trade and economic cooperation with Malaysia, adding that Malaysian entrepreneurs should benefit from the investment-friendly policies of Pakistan.\nPresident Alvi asked the high commissioner to work for the facilitation and welfare of the Pakistani workforce in Malaysia, besides making efforts to further strengthen and diversify Pakistan-Malaysia bilateral relations.\nHe also underscored the need to highlight the human rights abuses and the atrocities being committed by India in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) as well as the mistreatment of minorities in India.\nThe president thanked the Government of Malaysia for supporting Pakistan’s efforts in implementing the recommendations of the Financial Action Task Force.\nHe also asked the envoy to convey his best wishes to the government and people of Malaysia.\nThe president congratulated the high commissioner on his appointment and wished him a successful tenure in Malaysia.",
  "retrievedAt": "2025-08-11T09:02:48.290Z"
}
