{
  "title": "At OIC CFM meeting, FM Bilawal condemns desecration of Quran, Islamophobic acts",
  "link": "https://www.app.com.pk/national/at-oic-cfm-meeting-fm-bilawal-condemns-desecration-of-quran-islamophobic-acts/",
  "date_published": "2023-07-31T19:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): Minister for Foreign Affairs Bilawal Bhutto Zardari Monday condemned, in the strongest terms, the Islamophobic and hateful acts of desecration of the Holy Quran, which manifested religious hatred and intolerance.\nThe minister was speaking at the 18th Extraordinary Meeting of the Council of Foreign Ministers (CFM) of the Organization of Islamic Cooperation (OIC) held in a virtual format.\nThe Extraordinary CFM was convened to debate the recurring incidents of the desecration of the Holy Quran, which has hurt the sentiments of Muslims across the world.\nAddressing the CFM, he underscored that these acts, and the permission to carry them out, did not constitute freedom of expression.\nThe Foreign Minister reaffirmed Pakistan’s commitment to work closely with OIC member countries especially in Jeddah, Geneva, and New York to highlight concerns about the willful acts of the burning and desecration of the Holy Quran. He welcomed the adoption of resolutions in the UN Human Rights Council & the UN General Assembly advocating inter religious dialogue and shunning religious hatred. He also called for promoting inter-faith harmony and peaceful co-existence.\nThe Foreign Minister reiterated his proposal, made earlier this year on the occasion of the International Day to Combat Islamophobia, for an Action Plan which would inter alia include the appointment of a UN Special Envoy to combat Islamophobia and the establishment of judicial mechanisms to hold the perpetrators accountable.\nThe Extraordinary CFM adopted a comprehensive resolution expressing grave concern over increasing incidents of intolerance, discrimination and rising Islamophobia. It reaffirmed the importance of the 8-point action plan unanimously agreed upon by UN Human Rights Council to counter incitement to hatred, discrimination, stigmatization and violence based on religion and belief. It also called on all governments to fully implement the existing legal and administrative framework or adopt new legislation to protect all individuals against hatred and violence based on religion and belief.",
  "retrievedAt": "2025-08-11T09:02:48.258Z"
}
