{
  "title": "SC to announce decision about full court bench on Wednesday",
  "link": "https://www.app.com.pk/national/sc-to-announce-decision-about-full-court-bench-on-wednesday/",
  "date_published": "2023-08-01T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): The Supreme Court (SC) Tuesday decided to announce its verdict on Wednesday of the petitions seeking formation of a full court bench to hear cases pertaining to trial of alleged civilian accused of May 9 incidents by military courts.\nA six-member bench headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz ul Ahsan, Justice Munib Akhtar, Justice Yahya Afridi, Justice Mazahar Ali Akbar Naqvi and Justice Ayesha Malik heard the petitions.\nDuring the course of proceedings, the chief justice observed that the bench members would have consultation on the matter and then apprise the respondents about their decision. However, the Supreme Court Bar Association and PTI chairman’s counsel Aitzaz Ahsan and other petitioners opposed the formation of a full court bench.\nAttorney General for Pakistan (AGP) Mansoor Usman Awan submitted the list of 102 accused who were in the custody of army. The accused were arrested on the basis of evidence and CCTV footage.\nThe footage of individuals involved in violence on May 9 were also run by news channels, he said, adding that the court should view that only 102 persons, who were accused of attacks on military installations, were arrested.\nJustice Naqvi remarked that pick and choose was not allowed in the law, asking that why the other persons had been released. The AGP said that no pick and choose policy had been adopted in that regard.\nThe CJP questioned whether there were direct evidence regarding the involvement of the arrested 102 persons in attacks on the military installations. The AGP replied that there were solid proofs against them, who were arrested after collecting evidence of indulging in riots, vandalism and violence.\nThe chief justice remarked that an independent institution should determine that the arrests were made on the basis of solid proofs. Justice Ayesha Malik observed that it had also to be viewed that whether the permission was sought from the magistrate concerned for handing over the custody of civilians to a commanding officer.\nJustice Mazahar Naqvi said that the prosecution had the only proof of CCTV footage to run the trial of accused. He asked whether there were other proofs as well of the accused’s involvement in the May 9 incidents.\nThe AGP said that he would produce all the evidence before the bench. Seven of the arrested persons were involved in the attack on the General Headquarters, three involved in attack on the Army Institute Rawalpindi, and 27 in the attack on the Core Commander House, Lahore. Four accused were involved in the attack on Multan Garrison and 10 in the attack on Gujranwala Garrison.\nEight accused were arrested for attack on a sensitive office in Faisalabad, five for attack on the PAF Base Mianwali and 14 for attacking military installations in Chakdara. Seven arrested accused attacked the Punjab Regiment Center, Mardan, while three were held for attacks in Abbottabad and ten for Bannu Garrison attack, he added.\nMeanwhile, petitioner Karamat Ali’s Lawyer Faisal Saddiqui Advocate said that the decisions of full court benches had been accepted by all respondents in the past. The cases pertaining to the military courts were heard by benches with at least nine members in the past, and the objections of the respondents in the instant case would also end with formation of a full court bench, he said, adding the full court bench’s formation would not affect the proceedings at the current stage.\nThe lawyer said that the AGP had assured the court that no trial of any accused would be started in the military courts during hearing in the top court. If some judges expressed their excuse from hearing the case then the full court bench could be made comprising the remaining judges, he added.\nJustice Naqvi remarked that the petitioner was demanding formation of a full court bench at the time when he had already given his arguments. Lawyer Faisal Saddiqui, however, prayed the court to accept their request in that regard.",
  "retrievedAt": "2025-08-11T09:02:44.597Z"
}
