{
  "title": "268 Fresh Covid-19 cases reported: NIH",
  "link": "https://www.app.com.pk/national/268-fresh-covid-19-cases-reported-nih/",
  "date_published": "2022-06-23T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Health officials on Thursday said that 268 new Coronavirus cases were reported throughout the country during the last 24 hours.\nAs per data shared by the National Institute of Health (NIH), the case positivity ratio is 2.14 percent while 75 patients were in critical condition.\nOne death was reported from the Coronavirus while 12,513 Covid-19 tests were conducted across the country.\nMeanwhile, a meeting was held in this regard which was chaired by Minister for National Health Services, Regulations, and Coordination, Abdul Qadir Patel on the current situation of COVID-19, at NCOC, National Institutes of Health (NIH) Islamabad.\nRepresentatives from the Ministry of Interior, NDMA, DRAP, and local administration attended the meeting while provincial representatives participated virtually.\nNational Coordinator, Maj. Gen. Aamer Ikram gave an overview regarding the current situation of COVID-19 and vaccination status in the country.\nThe Health Minister highly appreciated the efforts of all stakeholders, healthcare staff, vaccination teams, and administration working across Pakistan despite multiple challenges.\nHe was highly pleased with the vaccination state in the country as overall 85% eligible population is fully vaccinated and 93% is partially vaccinated. Furthermore, it is encouraging to see that 100% eligible population in Sindh is fully vaccinated.\nHe advised all provinces and regions to administer booster doses on a priority basis to further improve protection against COVID-19 transmission.\nThe minister said that keeping in view the current COVID-19 situation, the positivity is less than 2% which is credited to our healthcare system and stakeholders, but remain alert and vigilant about the situation.\nHe said that in view of the global pandemic situation the Central Health Establishment (CHE) should stringently monitor the health status of incoming passengers at points of entry. He added that CHE will be strengthened to enhance its functionality.\nNon-pharmaceutical interventions (NPIs) and other measures to curb the spread of the virus were discussed in detail.\nThe Minister emphasized the importance of precautions including social distancing and mask-wearing, especially in crowded places.\nThe Minister also highlighted the need to strictly follow the guidelines for the management of markets for Eid-ul-Adha.",
  "retrievedAt": "2025-08-11T15:08:28.345Z"
}
