{
  "title": "Coalition government committed to bringing country out of economic challenges: PM",
  "link": "https://www.app.com.pk/national/coalition-government-committed-to-bringing-country-out-of-economic-challenges-pm/",
  "date_published": "2022-06-23T11:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 23 (APP): Prime Minister Shehbaz Sharif on Thursday said the government was committed to bringing the country out of its difficult situation and vowed to prioritize the steps aimed at the nation’s prosperity and development.\nAddressing the Senators of the Pakistan Muslim League (Nawaz), the prime minister said though the country could still face the difficult times ahead due to the inherited inefficiency of the previous government, however, the coalition government would brave every challenge effectively.\nPM Sharif said the coalition government was unanimous that the 14 months would be used for reformation and improvement of the country by keeping the country ahead of political interests.\nHe pointed out that the government of Pakistan Tehreek-e-Insaf had struck a deal with International Monetary Fund (IMF) to pass on the change in fuel prices and had accepted to raise Rs 30 petrol levy and sales tax of 17 percent.\nHowever, he said, the deal was quashed and the previous government had suddenly reduced the prices this March at a time when the petrol prices skyrocketed globally.\nThis abnormal imbalance left the country in a difficult economic situation, he said.\nHe said his government would keep the nation onboard regarding difficult economic decisions and would not deceive them, unlike the PTI government.\nShehbaz Sharif said the government’s deal on conditions with IMF had been finalized, however, said the positive results in the shape of development would take some time.\nHe stressed the need for strengthening the national economy by taking effective steps.\nThe prime minister said the PTI government had no empathy for the common man as it ended several projects of Pakistan Muslim League-N tenure that were aimed at public welfare.\nHe said the forefathers of the sub-continent had rendered immense sacrifices to establish a separate homeland to lead a comfortable life.\nHowever, he said during 73 years, all governments including civil and military, could not help this dream get materialized.\nPM Sharif said China, Saudi Arabia, UAE, and Qatar always supported Pakistan in difficult times besides siding at the diplomatic level.\nHe mentioned that the recent $2.3 billion loan from China was a respite in the current trying times.\nFor the first time in history, he said a genuine tax was imposed on the net income of affluent persons to provide relief to poor who were the real builders of Pakistan.\nAlso, to reduce the burden on poor, Rs 2,000 stipend was announced to provide them relief, he added.\nHe termed it a political and religious obligation of the rich to accommodate the deserving people and contribute to the prosperity of nation.\nHe said in next few days, he would address the nation to take them onboard regarding the steps taken by the government to improve the economic situation.\nThe prime minister regretted that several welfare projects launched by PM Nawaz Sharif were stopped by the PTI government.\nHe mentioned that the laptop scheme was accused as a “political bribe”, but the time showed that it became a source of online connectivity for students during COVID-19 pandemic.\nHe said Pakistan did not need a “Naya Pakistan”, but the Pakistan of Quaid-e-Azam Muhammad Ali Jinnah.\nSharif said the PTI government with its negative approach inflicted damage to the ties with other countries, however, the present government was taking steps to mend them for the benefit of the nation.",
  "retrievedAt": "2025-08-11T15:08:24.303Z"
}
