{
  "title": "Home built, influence-free economic model only solution to combat economic challenges: Sherry",
  "link": "https://www.app.com.pk/national/home-built-influence-free-economic-model-only-solution-to-combat-economic-challenges-sherry/",
  "date_published": "2022-06-23T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): The Minister for Climate Change Senator Sherry Rehman Thursday called for introducing home built economic model, which should be free from influence of international financial institutions to achieve sustainable and exclusive growth for social prosperity of the country.\nParticipating in the federal budget 2022-23 debate in Senate, she said that due to mismanagement and bad governance of former government, the country reached to the verge of default and the incumbent government decided to protect and safeguard the state as well as its interests.\nShe said that it was difficult for every political government to take tough and unpopular decisions and damage its image besides losing its political capital.\nUnlike the previous government, which used to say that the increasing prices of daily commodities was not a matter of its concern, she said that the incumbent collation government was very much aware about the hardships being faced by the common man in the country due to rising inflation, increasing POL prices and hours long power outage.\nDespite these challenging conditions, the incumbent government decided to sacrifice its political interest on the supreme national interest and decided to correct the economic direction of the country.\nShe admitted that it was eventually a budget of International Monetary Fund as last regime (PTI) had agreed tough conditions with the lender and its was international obligation to honor the national commitments.\nShe told the Upper House of the Parliament that last government had not only taken highest loans in Pakistan’s history but also dishonored the international agreements and commitments.\nShe said that last government despite agreement with IMF started Rs500 billion unfunded subsidy program, besides freezing the POL prices when it was increasing in all international markets.\nDue to such acts, she said the country entered into diplomatic and economic isolation as all international partners and friendly countries were angry with Pakistan.\nThe Senator was optimistic that hard decisions in larger national interest would soon start bearing results and nation would see signs of recovery.\nShe said the incumbent collation government would ensure uplift of under privileged segments of the society and utilize all available resources for them.\nSenator Mushtaq Ahmad of Jamaat-e-Islami urged the House to restore six national assembly seats of erstwhile Federally Administered Tribal Areas that was abolished due to its merger into Khyber Pakhtunkhwa province.",
  "retrievedAt": "2025-08-11T15:08:23.007Z"
}
