{
  "title": "Two day moot on “Reporting on conflict” to commence on Saturday",
  "link": "https://www.app.com.pk/national/two-day-moot-on-reporting-on-conflict-to-commence-on-saturday/",
  "date_published": "2022-06-23T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): The Centre of Excellence in Journalism at the Institute of Business Administration will be hosting a two-day conference on “Conflict and Peace in the Digital Age” starting on June 25 and 26th.\nThere will be seven panels spread over two days where industry experts will talk about media laws and regulations, reporting from conflict zones and the need for journalism among other topics, said a news release received here on Thursday.\nThe conference is a part of the Peace Journalism program, held by the CEJ in collaboration with the US Consulate. The program includes online workshops on peace and conflict reporting, mobile journalism, data journalism, social media and photojournalism. The program also offers mentorship with senior journalists.\nTalking about the program, CEJ-IBA Director Amber Rahim Shamsi said: “Conflict has traditionally fueled journalism, but social media has turbo-charged political polarization, and disinformation and misinformation. The CEJ-IBA is honored to host leading journalists, political figures, creators from film and music, budding satirists and commentators on the pressing issues plaguing the media industry in the digital age, and to celebrate the young journalists from across Pakistan who participated in the CEJ-IBA’s peace journalism workshops.”\nIBA’s Executive Director, Professor Dr. S. Akbar Zaidi said that he was delighted to be part of this conference which brings together Pakistan’s best and bravest journalists talking peace and about the challenges they face in an age of growing conflict, from those related to control and regulations, to outright intimidation and threats.\nFor the last eight years CEJ-IBA has been training and facilitating journalists’ networks to improve the quality of conflict and peace reporting. Over 2,000 journalists across Pakistan have published articles and stories with the combination of knowledge and skills imparted through these workshops.\nThe CEJ-IBA is celebrating the work of the journalists who participated in these trainings through a conference acknowledging the progress these individuals made, as well as collectively as an industry reflecting on the threats to responsible journalism in the digital age.",
  "retrievedAt": "2025-08-11T15:08:20.352Z"
}
