{
  "title": "Pakistan, Türkiye agreed for coordination to stop human trafficking",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-agreed-for-coordination-to-stop-human-trafficking/",
  "date_published": "2022-06-23T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Pakistan and Türkiye Thursday agreed to improve coordination in preventing illegal immigration and human trafficking from Pakistan to Türkiye and taking action against those involved in such heinous act.\nInterior Minister Rana Sanaullah held a conference call with his Turkish counterpart Suleyman Soylu. They discussed the matter to further boost the relations between the two countries and other issues of mutual interest.\nThe ministers said that Preventing illegal immigration and human trafficking is our common goal. They also discussed a proposal to set up a hotline between FIA and Turkish immigration agency to end human trafficking.\nDuring conversation, Turkish Interior Minister Suleyman Soylu congratulates Rana Sanaullah on assuming office of Interior Minister.\nRana Sanaullah said Türkiye was our best friend and brotherly Islamic country. Türkiye had always helped Pakistan in its most difficult situations, he added.\nThe interior minister said the two countries had excellent economic, cultural and business relations. He further said the recent visit of Prime Minister Shehbaz Sharif and his delegation to Türkiye would have far-reaching consequences.\nPrime Minister Shahbaz Sharif and his delegation were grateful to Turkish President Tayyip Erdogan and the government for their excellent hospitality, he said.\nInterior Minister Rana Sanaullah said Pakistan acknowledged Türkiye ‘s clear stance on human rights violations in Indian Illegally Occupied Kashmir.\nTurkish Interior Minister Suleyman said President Recep Tayyip Erdogan and Prime Minister Shehbaz Sharif had a very useful meeting during the recent visit. This visit would further expand and strengthen the bilateral relations, he maintained.\nRelations between Pakistan and Türkiye were based on mutual love, brotherhood and trust, Turkish Interior Minister said. He also lauded Pakistan’s efforts to end illegal immigration and human trafficking.\nHe said that better institutional coordination between the two countries will make it possible to prevent this illegal activity.\nRana Sanaullah invited his Turkish counterpart to visit Pakistan. Turkish Interior Minister Suleyman accepted the invitation and thanked Interior Minister Rana Sanaullah.",
  "retrievedAt": "2025-08-11T15:08:15.106Z"
}
