{
  "title": "ADB appoints Warren Evans as special senior advisor for climate change",
  "link": "https://www.app.com.pk/national/adb-appoints-warren-evans-as-special-senior-advisor-for-climate-change/",
  "date_published": "2022-06-23T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):The Asian Development Bank (ADB) Thursday announced the appointment of Warren Evans as Special Senior Advisor (Climate Change), the Office of the President of the bank.\nEvans will function as a climate envoy and provide broad oversight and guidance for ADB’s climate operations, including optimizing climate finance scale and impact, mobilizing new and additional technical and financial resources, strengthening ADB’s external climate partnerships.\nEngagement with international climate agreements and initiatives, and reinforcing capacity development for climate change operations would also be included in his functions, said a press release issued by the ADB.\nHe will also drive ADB’s strong commitment to action on climate change. In the past 12 months, ADB has raised its ambition to deliver climate finance to its DMCs to $100 billion from 2019–2030, adopted a new energy policy that formalized ADB’s practice of not financing new coal-fired power and heating plants, and committed to aligning its operations with the goals of the Paris Agreement.\nThese actions support ADB’s corporate target of ensuring that at least 75% of the total number of its operations will support climate action by 2030.\nEvans has more than 40 years of sustainable development and climate change experience with various multilateral development banks, private organizations, and other international organizations.\nA national of the United States, he holds a doctorate in cleaner production and climate change policy from Erasmus University Rotterdam in the Netherlands, a master’s in environmental health engineering from the University of Kansas in the United States, and a bachelor’s in ecology from Kansas State University.",
  "retrievedAt": "2025-08-11T15:08:21.165Z"
}
