{
  "title": "Detailed study carried out to address transport woes of Karachi: NA told",
  "link": "https://www.app.com.pk/national/detailed-study-carried-out-to-address-transport-woes-of-karachi-na-told/",
  "date_published": "2020-01-15T05:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Minister for Maritime Affairs Ali Zaidi Wednesday informed the National Assembly that a detailed study had been carried out to address the transport woes of Karachi.\nResponding to a calling attention notice regarding delay in construction of 45 kilometre bridge to connect Karachi port with Port Qasim, he said improving the transport infrastructure had also been made part of Karachi package.\nThe minister said that maritime advisory council had been established and notified to strengthen the maritime sector. He said that the members of the council were working without any financial benefit.\nHe said that the council had been established as per the vision of the Prime Minister to improve the performance of the ministries.\nResponding to another question, he said a hospital was working at Karachi Port Trust (KPT), while a plan was underway to set up a maternity home in the area.\nWhile responding to points of order of members, Minister for Aviation Ghulam Sarwar Khan said that a request would be made to prime minister to give compensation to people affected by the rain and snowfall in Azad Jammu Kashmir and Balochistan province.\nHe said that comprehensive survey would be conducted to assess the damage being done by the rain and snowfall.\nSarwar Khan said that keeping in view the tragedy, prime minister had undertaken visit of affected areas in Azad Jammu and Kashmir and Neelum valley.\nThe minister said that NDMA and PDMA had been activated to help the affected people in the rain hit areas.\nMinister of State for Climate Change Zartaj Gul said the National Disaster Management Authority (NDMA) would be upgraded as per requirements. She said provision of air ambulance and helicopter for affected areas was under consideration.\nShe said that District Disaster Management Authority (DDMA) was available at every district and these were doing their best to clean the roads and gear up relief activities.\nThe minister said compensation package would be announced for the victims of the areas.",
  "retrievedAt": "2025-08-11T18:37:31.843Z"
}
