{
  "title": "KPITB re-launches ‘Safe Women’ App with enhanced features",
  "link": "https://www.app.com.pk/national/kpitb-re-launches-safe-women-app-with-enhanced-features/",
  "date_published": "2020-01-14T23:16:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 15 (APP):Khyber Pakhtunkhwa Information Technology Board (KPITB) on Wednesday arranged a demonstration of an upgraded ‘Safe Women’ mobile phone application developed for female commuters of Pink Sakura Buses.\nFollowing procurement of Pink Sakura buses in Mardan and Abbottabad, the app has been upgraded to allow commuters to connect with their family and friends while travelling through live location sharing feature.\nSafe Women is an initiative of the KPITB for the ‘Sakura Bus Project’ of KP Government with financial support from the Government of Japan and technical support from UN Women Pakistan and UNOPS.\nAdvisor to Chief Minister on Information Technology Mr. Ziaullah Bangash, female members of provincial assembly, representatives from Trans Peshawar – Sakura Bus Operating Company, KPCSW officials, and UN Women and UNOPS representatives were present during the demo.\n“Through this Safety App, women and girls can share their live location with trusted contacts, give distress signals to family and friends, call police emergency numbers, rate the safety level of the location and check the live location of the buses,” shared Managing Director KPITB Dr. Shahbaz Khan while giving the demo.\nAdvisor to Chief Minister on Information Technology Ziaullah Bangash applauded UN Women’s efforts for working towards creating a safe working environment for the women of Khyber Pakhtunkhwa and expressed his desire for expanding the scale of the Safe Women App across the Province.\nMember of Provincial Assembly and General Secretary of the Women Parliamentary Caucus Ayesha Bano, said that information technology could play a great role in ensuring safety of vulnerable population and that Safe Women App would enable the users to stay connected with their families and feel safe during their travel time.\nMember Provincial Assembly from Mardan Sajida Hanif, said that safety measures for female commuters when they leave their homes are important and will boost their family’s confidence about their safety.\nHead of Sub Office UN Women KP Zainab Qaiser Khan, said: “UN Women Pakistan, as the specialized agency for promoting gender equality and the empowerment of women, has worked together with KPITB on this mobile application to facilitate female commuters on Pink Sakura buses in two cities of Khyber Pakhtunkhwa.\nShe said that women’s safety in public places is very important for their wellbeing as well as economic empowerment and expressed UN Women’s commitment to continue working with the government and other stakeholders for enhancing women’s safety in public spaces and creating an enabling environment for them to unleash their full potential.\nIt is worth mentioning that under this project, UNOPS Pakistan procured 14 buses and constructed 31 pre-fabricated bus stops, fitted with solar panels to provide a constant source of illumination. The bus route was developed in collaboration with the Transport and Planning Engineering Unit (TPU) to ensure the bus route covers educational institutions and main activity centres. The bus service aims to increase women’s mobility and enable women to have greater access to employment and education opportunities.",
  "retrievedAt": "2025-08-11T18:37:46.130Z"
}
