{
  "title": "Rescue, relief operation continues in full swing for snow-rain hit Victims: NDMA",
  "link": "https://www.app.com.pk/national/rescue-relief-operation-continues-in-full-swing-for-snow-rain-hit-victims-ndma/",
  "date_published": "2020-01-15T00:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):National Disaster Management Authority (NDMA) with the coordinated efforts of Provincial Disaster Management (PDMA) and other concerned functionaries were fully active and continuing operation to rescue precious lives and properties of Balochistan and other snow-rain hit areas.\nA spokesperson NDMA Brigadier Waseem Uddin talking to a private news channel said, NDMA is providing all necessary assistance to the victims of snow-rain hit victims in Balochistan and Neelum Valley and utilizing all possible resources in this regard.\nAccording to the NDMA official, rains in Balochistan have claimed 20 lives and 35 homes have damaged.\nThe departments concerned including Rescue 1122, Health, Revenue, Police, Livestock and others to remain alert during this period, he said.\nOn the directives of the Prime Minister, NDMA is providing every possible assistance and coordinating rescue and relief operations with the PDMA to ensure maximum life saving response.\nTeams of the NDMA and other relevant departments have been carrying out relief operation in the affected areas. The affected families are being provided food, blankets, medicine, he added.\n“We will not let the affected people alone in their hard time”, he assured.\nHe lauded the efforts of PDMA, adding, PDMA with the help of the army and other forces was making all-out successful efforts to provide relief goods, including food items, drinking water and tents, to the affected people.\nHe further said more quantities of medicine, edibles and other necessary items had been dispatched to the rain-hit Balochistan area.\nDue to snow on roads heavy machinery are being utilized to restore communication in villages to help in the rehabilitation process in Balochistan and Neelum Valley, he added.\nHe urged all stakeholders to play their effective role.\nHe also advised people, particularly tourists, to avoid unnecessary travel in snowbound and landslide-prone areas during the prevailing weather conditions.",
  "retrievedAt": "2025-08-11T18:37:34.859Z"
}
