{
  "title": "PTI to allay allies’ misgivings: Governor Punjab",
  "link": "https://www.app.com.pk/national/pti-to-allay-allies-misgivings-governor-punjab/",
  "date_published": "2020-01-14T23:16:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 15 (APP):Governor Punjab Chaudhry Mohammad Sarwar on Wednesday said there was no danger of political allies parting ways with government as their misgivings would be allayed.\nTalking to a delegation led by Pakistan Tehreek-e-Insaf (PTI) Central Member Shaukat Basra at the Governor’s House here, he said the opposition would be disappointed if it dreamt of an “in-house change” in the center or the province, adding the opposition should patiently wait for the general election 2023.\nGovernor Punjab said differences among the political allies was a common thing in a coalition government and difference of opinion was the beauty of democracy.\nThe Governor reiterated PTI government’s commitment to pursue its principled stance of elimination of corruption and transparent accountability.\nHe said the year 2020 would also prove to be the year of employment for the youth, adding that under the leadership of Prime Minister Imran Khan, the government was advancing successfully in every field including economic sector.\nSarwar said people had given mandate to the PTI for five years and the government would complete its constitutional and democratic tenure.\nGovernor Sarwar said PTI government would materialize all the promises made with the nation, adding that federal cabinet’s decision regarding recruitment on 129,000 sanctioned posts in ministries and divisions was highly commendable and current year would also prove to be a year of employments.\nHe said federal and Punjab governments were taking historic measures for overseas Pakistanis, adding the problems faced by the expatriates were being resolved in the shortest possible time.\nGovernor Punjab said overseas Pakistanis remitted US $ 22 billion in the year 2019, which was the highest figure during the last six years. It was also manifestation of Pakistani diaspora’s confidence in the sincere leadership and policies of present government, he added.\nChaudhry Sarwar said the foreign remittances target of US $ 24 billion would also be achieved in current fiscal year 2019-20.",
  "retrievedAt": "2025-08-11T18:37:46.920Z"
}
