{
  "title": "Four more youth empowerment initiatives on the cards: Usman Dar",
  "link": "https://www.app.com.pk/national/four-more-youth-empowerment-initiatives-on-the-cards-usman-dar/",
  "date_published": "2020-01-15T05:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar on Wednesday hinted at the launching four more projects of youth empowerment under Kamyab Jawan Programme during the current year.\nHighlighting Pakistan Tehreek-e-Insaf government’s initiatives for youth empowerment at the ‘Youth-Led Policy Forum 2020’, he elaborated that it would formally launch the projects to create extensive job opportunities during its five-year tenure.\nHe said : “Currently, another four programmes are in pipeline. We are planning to launch one new programme after every 8 to 10 weeks … the next programme is ‘Kamyab Jawan Start-up Pakistan’.”\nUsman Dar said ‘Kamyab Jawan Start-up Pakistan’ would provide a platform for the emerging and talented youth, ready to enter in the country’s job market, where they could get entrepreneurship skills along with financial assistance for transforming their start-up ideas into reality.\n“If you see, Amazon and Alibaba, in today’s world all those were start-up and have turned around the world economy. Prime Minister Imran Khan and my government believe that if one start-up in Pakistan is launched properly, it can turn around the entire country’s economy.” he said announcing to launch PM Innovation Lead Competition programme, under the start-up Pakistan in upcoming days.\nTop ten start-ups of Prime Minister Innovation Lead Competition would be extended technical and financial support by the government, he added.\nUsman Dar said Green Youth Movement was also on the cards and the youth would be sensitized in public and private sector universities, adding they would be engaged to promote environment-friendly culture across the country under the vision of Prime Minister Imran Khan.\nHe said one-year job exposure, directly from industries, would be given to thousands of students, graduated annually from different universities, under National Internship Programme which was almost in the launching process.\nThe SAPM said his department along with the health ministry, had worked out a programme to impart paid professional training to nursing staff to equip them with improved skills so that they could serve the suffering humanity in a more efficient manner.\n“Kamyab Jawan Sehatmand Programme’ has been designed on the pattern under which women and minorities’ socio-economic well-being would be ensured,” he added.\nUsman said the government had recently launched the largest skill development programme (Hunarmand Pakistan) in the history of the country. The initiative was aimed at imparting high technology trainings to the youth like artificial intelligence, robotics and many others, he added.\n“Unlike the past, all the youth empowerment programmes are not politically motivated and being launched after holding consultation with international and national youth experts”, he said.\nHe said all the programmes had been worked out by the National Skills Strategy Task Force, formed by the prime minister, after thorough consultation.\n“Each and every programme has well-thought process behind it,” he said and expressed the optimism that the initiative would have great impact on empowering the youth and in job creation.",
  "retrievedAt": "2025-08-11T18:37:31.192Z"
}
