{
  "title": "100 died, 90 injured in heavy snowfall, avalanches: NDMA",
  "link": "https://www.app.com.pk/national/100-died-90-injured-in-heavy-snowfall-avalanches-ndma/",
  "date_published": "2020-01-14T23:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):As many as 100 people have died, 90 injured and 213 houses damaged in the country’s avalanche and heavy snowfall hit areas of Balochistan, Khyber Pakhtunkhwa (KP), Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB).\nNational Disaster Management Authority (NDMA) in its recent situation report received here on Wednesday said in the wake of expediting rescue and relief activities in the heavy snowfall and rain affected areas of Azad Jammu and Kashmir (AJK) three more helicopters loaded with relief items had left for Neelum Valley.\nEarlier, the relief goods and rations were being provided to the victim through helicopters yesterday evening. However, today three more helicopters were leaving for Neelum valley containing dry rations, tents, blankets, medicines and other relief supplies for the affected people.\nAs per the Prime Minister’s instructions, all possible resources would be provided for the rehabilitation of the victims, said the NDMA spokesperson.\nIt may be mentioned here that the death toll and damages occurred due to heavy rains and snowfall on 13th to 14th January, 2020 that triggered avalanches in areas of Neelum District.\nThe snow avalanches plagued the villages of Surgan, Kel, Lawat, Chaknat and some other places in Neelum District where as many as 67 dead, 53 injured, 198 houses damaged including 22 shops, a mosque and 12 vehicles were reported to be damaged due to the avalanches, it added.\nBesides, Pakistan Army’s Urban Search and Rescue (USAR) team comprising of five members was dispatched to AJK affected areas for search and rescue operations, the NDMA report said.\nProvincial Disaster Management Authority (PDMA) Balochistan informed a total of 20 people perished including 12 females, 7 children and a male in various districts of the province where 23 people were stated to be injured as 13 males and 10 children were injured in the districts of Quetta, Pishin, Zhob, Kech, Killa Abdullah and Mastung.\n“In district Kech, 499 Boundary walls of various houses got completely alongwith 148 mud houses completely damaged and 341 got partially damaged and a bridge was also smashed in the district. A water supply mainly dam also got damaged in district Killa Abdullah.\nMoreover, 22 mud houses were completely dasmaged in district Kalat with 51 partally damaged whereas livestock losses reported 20 goats and 9 sheep perished due to heavy snowfall in the area.",
  "retrievedAt": "2025-08-11T18:37:43.415Z"
}
