{
  "title": "Construction sector to accelerate economic activities, create job opportunities: PM",
  "link": "https://www.app.com.pk/national/construction-sector-to-accelerate-economic-activities-create-job-opportunities-pm/",
  "date_published": "2020-01-15T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Prime Minister Imran Khan Wednesday said promotion of construction industry was top most priority of the government as this sector would accelerate economic activities and also create jobs opportunities for the people.\nChairing a meeting about promotion of construction sector, the prime minister said that the government was aware of the problems being faces by the people due to fiscal difficulties and all possible efforts were afoot to accelerate economic and business activities in the country.\nHe said that more than forty industries were attached with the construction industry and the promotion of this sector would accelerate economic and business activities in the country.\nThe prime minister directed that the Competitive Commission of Pakistan should play an active role to end the tendencies of making of cartels and to stop unrealistic increase in prices of raw materials related to the construction industry.\nThe prime minister said in-principle decision had been taken to give the status of industry to the construction sector and directed to take immediate steps to ensure its implementation.\nHe said after getting the status of industry, the construction sector would also get all those facilities which were offered to other industries.\nAdvisor on Finance Dr Abdul Hafeez Shaikh while informing the prime minister about the progress of government efforts regarding promotion of construction sector said sufficient progress had been made to address related problems of the sector after meetings with Association of Builders and Developers (ABAD) and other related people.\nThe meeting was told that consensus had been made about future policy regarding fixed income tax while the government had already made its policy about construction of the high-rise buildings and which was also endorsed by the Cabinet in its meeting yesterday.\nAbout the valuation table, the meeting was told that the Federal Board of Revenue (FBR) would appoint regional valuation committee next week in which representatives of ABAD and real estate would be included.\nThese committees would also decide about categories of the areas.\nThe prime minister directed advisor on finance to request the superior judiciary to constitute special bench for quick disposing of pending cases regarding real estate and construction sectors.\nThe prime minister was agreed to a proposal to promote the system of compliance regime instead of No Objection Certificates (NOCs).\nTo a proposal about provision of the state land for construction purposes, the prime minister said it was an important part of the government policy to utilize the properties of government departments for construction purposes especially for low-income people.\nPrime Minister Imran Khan also agreed with a proposal to include the representatives of ABAD in regulatory bodies related to the construction and it would be started from the Capital Development Authority (CDA) in the federal capital.\nAdvisor on Finance informed the meeting that the government in the first phase had allocated Rs 25 billion to Pakistan Housing Authority for promoting the construction sector.\nThe meeting was attended by Advisor on Finance Dr Abdul Hafiz Shaikh, Chairman Naya Pakistan Housing Authority Lt Gen (retd) Anwar Ali Haider, representative of Association of Builders and Developers (ABAD) Muhammad Hassan Bakhshi and senior officials.",
  "retrievedAt": "2025-08-11T18:37:29.923Z"
}
