{
  "title": "India to face valiant nation if attack AJK: AJK President:",
  "link": "https://www.app.com.pk/national/india-to-face-valiant-nation-if-attack-ajk-ajk-president/",
  "date_published": "2020-01-14T23:17:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 15 (APP):Azad Jammu Kashmir President, Sardar Masood Khan Wednesday warned that if India dared to attack the liberated territory, it would have to face the valiant youth of the Azad Jammu Kashmir.\n“If India succeeded to usurp Kashmir, the Pakistan’s very existence will also be in jeopardy,” said the President. He urged 130 million Pakistani youth to rise up in support of their Kashmiri brothers and sisters to create awareness about Kashmir struggle and expose India through social media.\nHe was addressing as the chief guest at the concluding session of one-day volunteer peace conference organized by Kashmir Youth Alliance in the State’s metropolis.\nThe conference was also attended by minister of state for parliamentary affairs Ali Mohammad Khan, former AJK Prime Minister Sardar Attique Ahmed Khan, chairman AJK Legislative Assembly’s public accounts committee Abdur Rashid Turabi, Dr. Mujahid Gilani and other speakers.\nWhile describing the youth as the future of the country, Sardar Masood Khan said that struggle for the freedom of Kashmir and to counter threats from India is the foremost obligation of the youth.\n“India wants to not only stabilize its occupation of Kashmir and suppress the voice of Kashmiri people but also to eliminate Pakistan as well as the Muslims living in India,” he said adding that if India succeeded in Kashmir, survival of Pakistan as well as the Muslims of entire South Asia would be at stake.\nHe recollected that Indian Prime Minister Narendra Modi was publicly saying that he would use nuclear bomb against Pakistan while his defense Minister Rajnath Singh and Army Chief Gen. Manoj Mukund Naravane were threatening to invade Azad Kashmir. He warned that the Indian Army might kill the defenseless people, but it lacked skills and capability to fight a regular professional army.\nThe AJK president said that not Pakistan nor the Kashmiri people, but the man sitting at prime minister’s house in New Delhi was the real enemy of India because Narendra Modi was poised to disintegrate India.\nWhile stressing the need of unity and cohesion among the people of Pakistan and Azad Kashmir, Srdar Masood Khan said that we cannot afford political differences when India was busy in war preparations, and the RSS ringleader is imparting armed training to 400,000 young boys and girls, to prepare them for war.\nHe said that through numerous rumors and propaganda blitz, India wanted to weaken our unity.\n“The youth must not pay heed to rumors, and side by side with struggling for the freedom of Kashmir, they should make Pakistan one of the strongest states of the world,” he added.\nIn his address, Minister of State Ali Mohammad Khan said that if India committed aggression, this region would be turned into the graveyard of Indian Army.\nAddressing the conference, Jamaate Islami leader Abdur Rashid Turabi said that Kashmir liberation movement was the continuation of Pakistan movement.\nHe maintained that after August 5, India had thought that it will crush the struggle of Kashmiri people, but the Kashmiris through their will and determination have shattered hopes of the Indian rulers.",
  "retrievedAt": "2025-08-11T18:37:43.955Z"
}
