{
  "title": "Gilani assures maximum relief to flood-hit people",
  "author": null,
  "content": "MULTAN, Sep 02 (APP):Chairman Senate Syed Yusuf Raza Gilani on Tuesday assured that all flood victims would be provided equal relief and facilities without any discrimination, as he visited various flood relief camps established in the region.\nDuring his visit, Gilani toured relief camps including those set up at Shershah Girls High School and Government High School Bach, where he inspected facilities and interacted with displaced families. At the medical camp in Shershah, he inquired about the availability and quality of medicines being provided to flood-affected individuals. He also reviewed the condition of the Shershah embankment.\nBriefing him at the Government High School Bach camp, Assistant Commissioner Arif Iqbal outlined the relief arrangements in place.\nChairman Gilani met with flood victims, listened to their concerns, and assured them of the government’s full support. Speaking to media, he acknowledged the large-scale displacement caused by the floods, with many families forced to leave behind their homes and livestock.\n“Our effort is to ensure the uninterrupted provision of food, medical care, and essential facilities,” he said. “Any complaints will be addressed on priority.”\nHe praised the local administration for its swift evacuation efforts, and also commended the media for playing a vital role in guiding the public during the crisis.\nAccompanied by MNA Abdul Qadir Gilani, local leaders, and officials, the Senate Chairman reaffirmed the government’s commitment to stand by flood-affected communities. MNA Qadir Gilani added, “As long as people remain in camps, their needs—especially those of children, women, and the elderly—will be fully taken care of.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:48:47.133Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-assures-maximum-relief-to-flood-hit-people/",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T12:55:00.000Z"
}
