{
  "title": "Pakistan’s name to remain alive, eternal: Hanif Abbasi",
  "author": null,
  "content": "ISLAMABAD, Sep 02 (APP):Federal Minister for Railways Hanif Abbasi on Tuesday said that the name of Pakistan would remain alive and eternal, crediting the nation’s survival and defense to the sacrifices of the armed forces and martyrs.\nAddressing the National Assembly, he said Pakistan’s defense was acknowledged worldwide. “The powerful is not the one who captures others’ land but the one who protects his own honor, life, property, and country,” he said.\nHe paid rich tribute to the collective sacrifices of the armed forces and the people for the protection of the motherland.\nExpressing deep sorrow over the recent floods, he sympathized with the victims, saying a home lost to natural disasters meant the loss of years of hard work and left behind indescribable pain. He stressed that the entire House must feel the suffering of those affected.\nThe minister regretted that some politicians sought fame by blaming the bureaucracy and state institutions. “If this is all they have to say, they should leave the government benches and sit in the opposition, because such language does not suit the treasury benches,” he added.\nHighlighting Rawalpindi’s development, Abbasi said the Punjab government had improved hospitals, educational institutions, sanitation, drainage, and transport systems, all of which stood as evidence of public service.\nHe added that blaming the entire bureaucracy was unfair, noting that the obsession with going viral in politics had become a “disease.”\nHe criticized the opposition for failing to play its role responsibly, accusing it of acting under the influence of the PTI founder.\n“The government carries the real responsibility of delivering according to public expectations. Alhamdulillah, today Pakistan’s economy and defense are in strong hands,” he asserted.\nAbbasi praised Prime Minister Shehbaz Sharif’s foreign policy, saying that in 77 years, Pakistan had never received the level of global recognition it was now witnessing. “This foreign policy is presenting Pakistan to the world as a victor,” he said.\nReferring to a recent tragedy in Rawalpindi, he said a retired colonel and his daughter had lost their lives in a flood wave, yet some elements mocked the incident on social media. He urged steps to curb such indecency and ridicule online.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:50:04.677Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistans-name-to-remain-alive-eternal-hanif-abbasi/",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T08:42:00.000Z"
}
