{
  "title": "PM Shehbaz, President Putin share desire to bolster Pak-Russia bilateral cooperation",
  "author": null,
  "content": "ISLAMABAD, Sept 02 (APP): Prime Minister Muhammad Shehbaz Sharif and President of the Russian Federation Vladimir Putin on Tuesday agreed to further enhance the bilateral ties and cooperation between the two countries in diverse fields.\nPrior to their meeting held in Beijing, China and broadcast on the national Tv channels, the prime minister appreciated the leadership of President Putin for making sincere efforts to promote bilateral relations with Pakistan.\nHe observed that after their meeting in Astana during SCO Summit, they had agreed to work closely to bolster the bilateral cooperation.\nHe expressed the confidence that together, both countries would make further efforts to promote the bilateral ties and cooperation particularly in commerce and trade.\nLast year, Pak-Russia bilateral trade witnessed a spike as Pakistan imported oil from Russia which led to increase in the trade volume, he added.\nThe prime minister addressing the Russian president said “Relations between the two countries have improved in the last many years due to your personal commitment and interest.”\nHe expressed the resolve that Pakistan was also keen to further strengthen the bilateral relations which were moving in the right direction.\nPrime Minister Shehbaz Sharif further said that after their meeting in Astana, both countries witnessed a flurry of delegations’ visits at the higher level, adding they also signed protocols to promote agriculture, iron, steel, energy and transport sectors.\nThe prime minister also underlined the significance of the trade corridor form Belarus, Russia, Kazakhstan, Uzbekistan, Afghanistan and Pakistan which would give a spur to the regional connectivity and prosperity.\nExpressing his satisfaction, he said both sides were keenly committed to building their relations.\nThe prime minister also expressed gratitude to the Russian president for supporting Pakistan which was viewed as ‘a balancing act in the region.’\nHe said Pakistan respected Russian Federation’s ties with India but they also wanted to build very strong relations with his country which would be supplementary and complimentary.\nHe expressed that these beneficial ties would add to the progress and prosperity of the region and assured President Putin to work closely in this context as he had found him ‘a dynamic leader’.\nThe prime minister responding to the Russian President’s invitation to attend SCO Heads of Government Summit in November, replied that he was looking forward to visit the country.\nPresident Vladimir Putin, expressing his views, said that they had held a meeting about one year ago, on the sidelines of SCO in Astana.\nHe said “Pakistan has always been their traditional partner and remains as such in Asia and they cherish these ties” adding both sides had agreed to intensify their bilateral relations.\nThe president noted that their bilateral trade required to be enhanced and in this regard, he stressed for taking steps to address the issue.\nHe also expressed his grief and sincere condolences to the people and the government of Pakistan on the losses suffered from catastrophes and natural disasters including the recent flooding.\nPresident Putin expressed the optimism that under Prime Minister Sharif’s leadership, Pakistan would overcome such challenges.\nHe also opined that the two countries kept cooperating at the inter-parliamentary levels, adding “Pakistan is a non-permanent member of the United Nations Security Council and both countries were keeping contacts within the framework of the United Nations which is an important platform.”\nHe invited the prime minister to SCO Summit in Russia during November.\nMembers of the delegations from both countries were also present.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:48:49.205Z",
  "source": "APP",
  "link": "https://www.app.com.pk/global/pm-shehbaz-president-putin-share-desire-to-bolster-pak-russia-bilateral-cooperation/",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T12:26:00.000Z"
}
