{
  "title": "150,000 young cricketers shine in PM’s Talent Hunt",
  "author": null,
  "content": "ISLAMABAD, Sep 02 (APP):The Prime Minister’s Youth Programme (PMYP), in collaboration with Lahore Qalandars, has achieved a remarkable milestone in its Cricket Talent Hunt Trials, with over 150,000 young cricketers showcasing their talent across the country.\nThis initiative aims to discover and groom rising cricket stars, providing them with expert coaching and nationwide exposure.\nAccording to official sources, the trials, which are being held in major cities, have attracted a massive response from young cricket enthusiasts aged 15 to 25.\nThe program offers a golden opportunity for talented youngsters to shine on a national platform and potentially launch their cricketing careers.\nParticipants will have the chance to receive professional coaching, training, and exposure to local and international selectors and media.\nThe Prime Minister’s Youth Programme is committed to promoting youth development through sports and skill development.\nThis initiative is part of the program’s overall strategy to create opportunities for young individuals to engage in sports, receive scholarships, learn digital skills, and create employment.\nThe success of the PM’s Cricket Talent Hunt Trials is a testament to the program’s potential to identify and nurture young talent in Pakistan.\nWith its focus on merit-based selection, transparency, and inclusivity, the program is poised to make a significant impact on the country’s cricketing landscape.\nAs the trials continue, young cricketers are eager to showcase their skills and take the first step towards a successful cricketing career.\nThe PM’s Cricket Talent Hunt Program is an excellent opportunity for aspiring cricketers to achieve their dreams and make a name for themselves in the world of cricket.\nThe program’s collaboration with Lahore Qalandars, a leading franchise in the Pakistan Super League, ensures that the selected cricketers will receive top-notch training and exposure.\nThis partnership is expected to elevate the standards of cricket in Pakistan and provide a platform for young cricketers to showcase their talent to a global audience.\nThe Prime Minister’s Youth Programme has been instrumental in promoting youth development and empowerment in Pakistan. The Cricket Talent Hunt Trials are a significant step towards identifying and nurturing young talent in the country.                                    With its commitment to merit-based selection and transparency, the program is expected to produce a new generation of cricket stars who will make Pakistan proud on the international stage.\nThe PM’s Cricket Talent Hunt Program is a dream come true for many aspiring cricketers, and the response has been overwhelming. With its focus on youth development and sports promotion, the program is set to make a lasting impact on Pakistan’s cricketing landscape.\nNotably, the trials in Gilgit-Baltistan, Azad Jammu and Kashmir (AJK), and Khyber Pakhtunkhwa (KPK) were temporarily suspended due to flood, but they are expected to resume soon.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:49:37.486Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/150000-young-cricketers-shine-in-pms-talent-hunt/",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T10:06:00.000Z"
}
