{
  "title": "Flood risk eased as Chenab river flow cut by 300,000 cusecs at Trimmu",
  "author": null,
  "content": "ISLAMABAD, Sep 02 (APP):Authorities have successfully reduced the Chenab River’s flow from 885,000 cusecs to 550,000 cusecs following the breaching of two embankments and the controlled reduction has allowed the diminished flow to safely pass through Head Trimmu alleviating concerns of potential flooding downstream.\nAccording to a report issued by the National Emergency Operations Center (NEOC), a flow of 550,000 cusecs passed through Trimmu in the Chenab River on September 1 and is now moving towards Panjnad. As the Panjnad Headworks has a capacity of 650,000 cusecs, no further embankment breaches are expected along the river’s course.\nThe flood is expected to reach Panjnad on September 3 with a flow ranging between 570,000 and 600,000 cusecs, while on the morning of September 5, an additional 80,000 to 100,000 cusecs from the Sutlej River is projected to merge at Panjnad.\nFollowing the convergence of floodwaters from all three rivers, the flow at Panjnad is expected to rise to between 650,000 and 700,000 cusecs. This flood wave is projected to reach Guddu Barrage by the afternoon of September 6, carrying an anticipated volume of 450,000 to 500,000 cusecs.\nAt Kot Mithan, the flood wave is expected to merge with the flow of the Indus River. As part of the planned measures, the Indus flow will be regulated at Taunsa to restrict the wave to approximately 200,000 cusecs. Based on current projections, the combined major flood could reach between 650,000 and 700,000 cusecs at Guddu Headworks.\nThe wave will continue its course through Sukkur and Kotri barrages before eventually flowing into the sea between September 12 and 13.\nAn NDMA spokesperson stated that, acting on the prime minister’s directives, the Authority is overseeing all rescue and relief operations in flood-affected areas. The National Emergencies Operation Center is fully operational round the clock, while NDMA continues to coordinate closely with both civil and military institutions to ensure a unified and effective response.\nAn NDMA spokesman urged residents living along riverbanks and waterways to immediately relocate to safer areas, warning of potential inundation risks. People in vulnerable zones are advised to cooperate fully with authorities during evacuation efforts and adhere strictly to official instructions when returning from temporary camps.\nThe spokesman emphasized the importance of following local administration guidelines and contacting emergency teams when necessary.\nAuthorities have also cautioned against unnecessary travel in flood-affected regions. Citizens are encouraged to keep emergency kits stocked with water, food, and essential medicines, secure important documents, and use the NDMA Disaster Alert app for timely updates and guidance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:47:58.501Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/flood-risk-eased-as-chenab-river-flow-cut-by-300000-cusecs-at-trimmu/",
  "dateList": "2025-09-02",
  "date_published": "2025-09-02T18:37:00.000Z"
}
