{
  "title": "Parliamentary procedures strictly followed in ECP appointments: NA Secretariat",
  "author": null,
  "content": "ISLAMABAD, Jun 15 (APP):The National Assembly Secretariat has clarified that the appointment process for the Chief Election Commissioner (CEC) and two Election Commission of Pakistan (ECP) members is being conducted in accordance with constitutional and parliamentary procedures.\nA National Assembly spokesman, responding to media reports, stated that Speaker National Assembly Sardar Ayaz Sadiq has sent a letter addressing the recent correspondence from Opposition Leader Omar Ayub.\nAccording to the spokesperson of the National Assembly, the  constitutional and legal procedures for the formation of the parliamentary committee are being followed in letter and spirit. It was clarified  that the first step in this  process is mutual consultation between the Prime Minister and the Leader of the Opposition.\nThe spokesperson further stated that the speaker also referred to the letter dated 16 May 2025, sent by Prime Minister Shehbaz Sharif to the Opposition Leader, in which the Prime Minister written for initiatiom of consultations regarding the nominations.The Speaker National Assembly  also written  that if the Prime Minister and the Leader of the Opposition fail to reach an agreement on the names of the Chief Election Commissioner or members, then the matter will be referred to the Speaker under Article 213(2A) of the Constitution, so that the process for forming the parliamentary committee can be carried forward.\nThe spokesperson added that the Prime Minister will formally write to the Speaker to seek nominations for committee members from all parliamentary leaders. After this, the Speaker will issue letters to all parliamentary leaders and request them to submit names.\nIt has been clarified that the composition of the  Parliamentary committee will be based on the proportional representation of each party currently present in the National Assembly, ensuring the formation of the committee is completely constitutional and fair.\nThe spokesperson further stated  that the parliamentary committee can only be constituted when names of members are received from both the government and the opposition. If there is delay or non-cooperation from either side, the formation of the committee will not be possible.\nThe spokesperson also stated  that Opposition Leader Omar Ayub Khan had demanded in his letter the immediate formation of a parliamentary committee for the appointment of the Chief Election Commissioner and two Election Commission members.\nThe full text of the Speaker’s reply has also been issued to media.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:09:43.075Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentary-procedures-strictly-followed-in-ecp-appointments-na-secretariat/",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T16:39:00.000Z"
}
