{
  "title": "SSP Shoaib vows zero tolerance for crime in Islamabad",
  "author": null,
  "content": "ISLAMABAD, Jun 15 (APP): Senior Superintendent of Police (SSP) Operations Islamabad, Muhammad Shoaib Khan, chaired an important meeting regarding crime prevention and directed a strict crackdown on hardened criminals, members of active gangs, and proclaimed offenders.\nAn official told APP that SSP Shoaib instructed officers to closely monitor habitual offenders, enhance the effectiveness of police patrolling, and ensure the arrest of suspects and recovery of stolen items in cases of robbery, theft, and motorcycle and car lifting. He emphasized that all available resources should be utilized to curb criminal activities and that the arrest of individuals involved in serious crimes must be prioritized.\nSSP Shoaib also stressed that arrested individuals must be challaned with solid evidence to ensure strict legal action and successful convictions. He directed officers to take indiscriminate action against land grabbers, drug peddlers, and those possessing illegal weapons. He urged unwavering efforts in the arrest of absconders and the completion of investigations based purely on merit.\nSSP Shoaib further stated that effective handling of public complaints at the police station level must be ensured and that officers should prioritize resolving citizens’ issues. He warned that corruption, misconduct, and misuse of authority would not be tolerated, and any complaints in this regard would be dealt with strictly.\nSSP Shoaib concluded that all officers must maintain exemplary discipline and performance, adding that the protection of citizens’ lives and property remains the top priority of the Islamabad Police. Any negligence in this regard will not be accepted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:10:09.610Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ssp-shoaib-vows-zero-tolerance-for-crime-in-islamabad/",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T09:58:00.000Z"
}
