{
  "title": "Major funds approved for Rwp development projects, water schemes; Engr Qamar ul Islam",
  "author": null,
  "content": "RAWALPINDI, Jun 15 (APP): Chairman District Coordination Committee, Engineer Qamar ul Islam Raja MNA, announced the approval of major development funds worth billions of rupees by the Punjab Government in its annual development plan for various projects across Rawalpindi district, including NA-53 constituency. The Budget 2025-26 will be presented on Monday (16th June) in the Punjab Assembly.\nTalking exclusively to APP here on Sunday, Raja Qamar ul Islam confirmed that the long-pending amount of Rs.9.0 billion has also been fixed for the Rawalpindi Ring Road project, which will be immediately released to accelerate regional development.\nHe informed that approvals include Rs. 21.0 crore for Jorian Hospital and Rs. 11.0 crore for Pothohar Town Rawat Hospital to complete pending work.\nFor infrastructure development, Rs. 2.3 billion was approved for dualization of Gorakhpur-Khasala Khurad Road and Rs. 1.7 billion for Tulsah Morr Adiala Road Underpass to reduce travel time between Adiala Road and Chontra areas.\n“We are implementing a network of development projects across NA-53 to provide better facilities to residents”, he said while highlighting the mega road network initiatives.\n“The approval of Rs. 3.5 billion for Khawaja Corporation Flyover and underpass will significantly improve connectivity”, he added.\nQamar highlighted that allocation of Rs. 1.8 billion to revive the Mujahid Dam project following Mohota Dam’s completion has also been approved and added in the development plan, with efforts underway to secure additional funds for its completion by fiscal year 2025-26. Rs. 15.0 crore approved for feasibility studies to utilize Swaan River water for Rawat and Chontra areas.\nRoad infrastructure projects include Rs. 2.0 crore for Choora Sharif to Malukal Road, Rs.15.0 crore for Dhok Budhal to Sukho Road linking Rawat directly with Chakwal Road.\nTo expedite water supply schemes, Rs.1.0 crore has been allocated for designing supply systems from Dhoke Chuh Dam, avoiding construction delays. Other water initiatives include Rs. 6.0 crore for Mohri Ghazan, Lakhan and Dhamial supply schemes, Rs. 7.0 crore for Dhoke Budhal water scheme restoration and drainage, Rs. 2.8 crore for Malukal water scheme rehabilitation Rs. 1.5 crore for drainage in Jorian and UC Dhamial.\n“Water supply remains our top priority,” said Qamar-ul-Islam, confirming that ongoing work on streets, education, health, electricity and gas utilities would maintain current momentum, with several projects nearing completion in coming months.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:09:22.582Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/major-funds-approved-for-rwp-development-projects-water-schemes-engr-qamar-ul-islam/",
  "dateList": "2025-06-15",
  "date_published": "2025-06-15T13:45:00.000Z"
}
