{
  "title": "ISSI hosts roundtable on Pakistan-US relations with CSIS delegation",
  "link": "https://www.app.com.pk/national/issi-hosts-roundtable-on-pakistan-us-relations-with-csis-delegation/",
  "date_published": "2024-11-22T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP):The Centre for Strategic Perspectives at the Institute of Strategic Studies Islamabad (ISSI) hosted a roundtable discussion on “Pakistan-U.S. Relations,” with delegation from Centre for Strategic and International Studies (CSIS), comprising Senior Vice President Daniel Runde and Senior Associate Ambassador Robin Raphel.\nThe event was attended by practitioners, academics, think-tank experts and researchers, said a press release issued here on Friday.\nIn his welcome remarks, DG ISSI Ambassador Sohail Mahmood emphasized the significance of CSIS as a renowned U.S. think-tank, particularly in shaping the discourse and influencing U.S. policy. He noted that the timing of the visit was crucial, as it coincided with the conclusion of the U.S. Presidential and Congressional elections and the time of Cabinet formation before the new Administration takes office in January 2025.\nWith global attention focused on what Trump would mean for America and the rest of the world, Ambassador Sohail Mahmood dilated on the historically cyclical pattern of Pakistan-U.S. relations — alternating between engagement and estrangement. He emphasized the need for long-term sustainability and stability, including through efforts to broaden the relationship’s scope that would benefit both nations. He also highlighted the vital importance of economic relations with the U.S. for Pakistan, suggesting that besides the traditional areas of bilateral trade and investment attention should be focused on new areas of cooperation such as energy, IT, and climate change. These were vital for evolving a more rounded relationship beyond the historical focus on security and strategic events.\nAmbassador Sohail Mahmood further highlighted the often adverse effect of the situation in Afghanistan and the U.S-India strategic partnership on the trajectory of Pakistan-U.S relations. He called for evaluating the future prospects in the context of a multi-polarizing world, the U.S-China competition, and key regional developments. Lastly, he underlined the need to enhance think-tank engagement between Pakistan and the U.S, observing that the current discourse largely reflected ‘minimalism’ and that there was a need for greater imagination and ambition in charting the future course.\nDuring the interactive discussion, the participants assessed the prospects beyond the current status of Pakistan-U.S relations and identified new areas and possible anchors for the future. Pakistan’s substantial economic potential, if fully realized, could positively affect the future trajectory. Participants emphasized that the U.S needs to expand its engagement with Pakistan beyond a security-centric approach to encourage a more comprehensive and mutually-beneficial partnership. Pakistan’s strategic importance was acknowledged, given its demography, strategic location, natural resources, nuclear capabilities, and pivotal role in the Islamic world and the Global South.\nThe participants also identified various areas for enhanced bilateral collaboration–including trade, IT, education, energy cooperation, agriculture, water management, health, and climate change.\nThe dialogue reaffirmed Pakistan’s commitment to pursuing multi-dimensional foreign policy, with due importance accorded to a stable and cooperative relationship with the U.S.\nAmbassador Khalid Mahmood, Chairman, BoG, ISSI, closed the roundtable by presenting the Institute’s souvenirs to the guest speakers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:33:05.162Z"
}
