{
  "title": "HEC, Coursera launch 3rd Phase of Digital Learning, Skills Enrichment",
  "link": "https://www.app.com.pk/national/hec-coursera-launch-3rd-phase-of-digital-learning-skills-enrichment/",
  "date_published": "2024-11-22T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP):Higher Education Commission (HEC) in collaboration with Coursera launched the Digital Learning and Skills Enrichment Initiative (DLSEI) 3.0 on Friday to provide 100,000 students and faculty across universities in Pakistan an access to digital learning opportunities.\nIn the third phase of DLSEI, HEC will sponsor skill development opportunities for Pakistan’s youth by offering free access to over 12,000 online courses and numerous guided projects on Coursera.\nThe registration is open for university students and faculty members of all public and private sector higher education institutions through https://eservices.hec.gov.pk.\nHEC launched DLSEI in 2018 in partnership with Coursera and the previous two phases of the programme upskilled over 45,000 young people through deep-skills specialised certifications from internationally recognised institutions, in addition to completion of more than 267,000 courses and above 200 universities gaining access to Coursera library.\nAddressing the launch ceremony, Chairman HEC Dr. Mukhtar Ahmed shed light on the significance of HEC-Coursera partnership and underlined that the objective of bilateral partnership is to ensure maximum utilisation of the opportunity to provide Pakistani youth with online certifications and courses for skill development.\nHighlighting the background of DLSEI, he hoped that the partnership will further strengthen by following a building-blocks-mechanism to gradually build upon their achievements.\nHe urged the universities, faculty and students to adopt the Coursera courses and take full advantage of the opportunity.\nSpeaking on the occasion, Director of International Governments at Coursera Mr. Matt Klein said Coursera is honoured to partner with HEC to equip the next generation of talent in Pakistan with the skills and credentials needed to unlock their full earning potential in the digital economy.\nHe said it is gratifying to see that HEC, Pakistan is responding to the pressing trends by improving access to job-relevant education and skilling to deliver better outcomes for the country’s youth.\nThe Director underlined the nationwide impact of DLESI.\nHe informed the audience that 99 percent of DLSEI beneficiaries found Coursera helpful in understanding concepts and improving skills in their studies.\nHe said 93 percent found Coursera helpful academically, while 64 percent employees received recognition or advancement due to the courses with 47 freelancers having increased earnings through Coursera courses.\nHe appreciated HEC for its incredible and impressive strategy for execution of DLSEI.\nIn his welcome remarks, Member IT HEC Dr. Jamil Ahmad underlined HEC’s efforts to provide high-tech facilities in universities and engage with top technology companies to skill up the country’s youth. He said the faculty and students can gain certifications and improve their skills in high-demand areas through foundational and advanced professional and specialisation courses from top global universities.\nHe appreciated Chairman HEC for taking keen interest in efforts for technological enablement of the country’s youth.\nDLSEI is a flagship programme jointly launched by HEC and Coursera to enhance digital literacy and skill development for university students and faculty.\nThis initiative focuses on equipping learners with cutting-edge skills in diverse fields, fostering innovation, and aligning Pakistan’s education system with global standards.\nCoursera is a global online learning platform with a mission to provide universal access to world-class learning. Coursera partners with more than 300 leading universities and companies to bring flexible, affordable, job-relevant online learning to individuals and organisations worldwide.\nIt offers a range of learning opportunities, from hands-on projects and courses to job-ready certificates and degree programmes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:32:26.770Z"
}
