{
  "title": "Court issues non-bailable arrest warrants against Bushra Bibi over consecutive absence",
  "link": "https://www.app.com.pk/national/court-issues-non-bailable-arrest-warrants-against-bushra-bibi-over-consecutive-absence/",
  "date_published": "2024-11-22T11:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP):An Accountability Court (AC) on Friday issued non-bailable arrest warrants against Bushra Bibi in 190 million pound reference.\nThe court directed the authorities to present Bushra Bibi after arresting her on November 26. It also issued show-cause notice to the guarantor of Bushra Bibi over her continuous disappearance.\nAn Accountability Court Judge Nasir Javed Rana heard the case against PTI founder and his wife. Bushra Bibi had been skipping appearances in last eight hearings and she also didn’t attend today’s proceeding.\nBushra Bibi’s counsel lawyer submitted one-time exemption from appearance request on medical grounds which was not accepted by the trial court. The court said that the medical report of the accused was of Lady Reading Hospital Peshawar and attestation was from Islamabad.\nHowever, NAB raised objections against the medical report and said that the notarized documents were issued in Islamabad, not in Peshawar.\nDespite the absence of Bushra Bibi, PTI founder Imran Khan appeared in court but failed to submit his statement under section 342 of the Criminal Procedure Code.\nIt may be mentioned here that the £190 million case pertains to allegations of financial misconduct and corruption. Bushra Bibi and Imran Khan have both faced accusations related to illicit financial dealings, with the National Accountability Bureau continuing its investigation into their actions during Imran Khan’s tenure as prime minister.\nNAB has repeatedly raised concerns over Bushra Bibi’s non-cooperation in the case, as she has been absent from eight hearings of the £190 million reference.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:33:17.982Z"
}
