{
  "title": "Bushra’s allegations against Saudi Arabia nothing but failed attempt to save PTI’s diminishing politics: Asif",
  "link": "https://www.app.com.pk/national/bushras-allegations-against-saudi-arabia-nothing-but-failed-attempt-to-save-ptis-diminishing-politics-asif/",
  "date_published": "2024-11-22T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): Minister for Defence Khawaja Muhammad Asif on Friday said Bushra Bibi’s allegations leveled against Saudi Arabia were nothing but a failed attempt to save the PTI’s diminishing politics, terming them ‘regrettable’ and dirty acts.’\nAddressing a press conference here, the minister said Pakistan has a historical, religious and economic relations with Saudi Arabia adding that she always helped Pakistan in difficult times.\nOver 2.8 million Pakistanis are working in Saudi Arabia who send billions of dollars remittances to Pakistan every year, he added.\nThe minister said, “Our cordial and friendly relationship with Saudi Arabia should not affect due to someone’s personal political gains. Such a controversial statement is an effort to save PTI’s sinking ship,” he added.\nHe said, “There is a conflict between the sisters-in-law; the family [PTI founder’s] is embroiled in a dispute over inheritance”. Bushra Bibi has claimed the political inheritance of founder of PTI. Our politics has never witnessed such a low, he said, adding Bibi has started her projection and the people would realize the reality shortly, he added.\nThe minister said that the founder of PTI was accused of taking a gift, selling it, depositing a small amount with Toshakhana and keeping the rest for himself.\nRegarding law and order in Khyber Pakhtunkhwa (KPK), he said that there was a poor security situation in the province. “Even yesterday, there was bloodshed in Khyber Pakhtunkhwa, yet the chief minister attacks the federal government or Punjab every other day,” he remarked.\nHe said that the CM KPK did not make any efforts to curb terrorism in the province. Regarding the current political situation in the Centre, he said that the November 24 protest call would be a “third attack”.\nKhawaja Asif said that the PTI founder had been talking about negotiations with the establishment until a few days ago, but changed his statement to the claims of having contact with politicians. He denied any such contact and said “We are not engaged in any negotiations”.\nAbout the PTI’s protest on November 24, the minister said that the court has a clear order and the government would enforce it.\nTo another question, he said anti-China Pakistan Economic Corridor (CPEC) forces were targeting Chinese people who were working for the development and prosperity of Pakistan.",
  "retrievedAt": "2025-08-10T15:32:54.587Z"
}
