{
  "title": "National Action Plan for Health Security launched",
  "link": "https://www.app.com.pk/national/national-action-plan-for-health-security-launched/",
  "date_published": "2024-11-21T19:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): The government has launched a new costed National Action Plan for Health Security (2024-28) to help strengthen the capacity of national and provincial health systems.\nThe plan will effectively prevent, detect and respond to evolving public health emergencies.\nThis comprehensive five-year roadmap was presented to stakeholders at an event led by the Ministry of National Health Services, Regulations and Coordination.\nCoordinator to the Prime Minister on Health, Dr Malik Mukhtar Ahmad, said, “Operational plans under the National Action Plan for Health Security (2024-28) will help the federal and provincial governments to prioritise interventions and decisions for improved technical capacities in tackling emergencies and disasters.”\nHe said “The plan vows to strengthen health security in Pakistan by integrating human, animal, and environmental health through the One Health approach.”\n“Today’s event has presented a combined national action for Pakistan to enhance preparedness and combat threats emerging from pandemics.”\nDeputy British High Commissioner to Pakistan, Andrew Dalgleish, said, “The National Action Plan for Health Security (2024-28) recognises the need for improved health security in Pakistan, while also strengthening primary health services, emergency coordination, disease surveillance and response systems.”\n” I’m proud that the UK is playing such an active role in supporting Pakistan build a resilient health system.”\nThe action plan, developed with support from the UK’s Evidence for Health (E4H) Programme, contains inputs from the government officials and other stakeholders compiled through an extensive consultation process.\nLed by the Ministry of National Health Services, Regulations and Coordination and the National Institute of Health, the updated National Action Plan for Health Security (2024-28) builds on findings from the second Joint External Evaluation conducted for Pakistan in 2023.\nThe plan also emphasises on the establishment of an International Health Regulations (IHR) monitoring mechanism to ensure better governance for health security in the country.\nFederal Health Secretary, Nadeem Mahbub said, “The event emphasises the need for synchronised efforts between federal and provincial stakeholders.”\nHe said, “This comprehensive approach is necessary to address both immediate and long-term public health risks for Pakistan.”\nWHO Representative said, “WHO lauds the development of Pakistan’s National Action Plan for Health Security (2024-28), which focuses a comprehensive One Health approach to strengthen preparedness and response to health emergencies.”\nHe said, “WHO remains committed to assisting Pakistan in aligning its priorities with International Health Regulations.”",
  "retrievedAt": "2025-08-10T15:33:36.639Z"
}
