{
  "title": "Malaysian Air Force Chief calls on Zaheer Ahmed Baber Sidhu",
  "link": "https://www.app.com.pk/national/malaysian-air-force-chief-calls-on-zaheer-ahmed-baber-sidhu/",
  "date_published": "2024-11-22T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): During his first-ever visit to Pakistan, General Tan Sri Dato’ Sri Mohd Asghar Khan bin Goriman Khan, Chief of the Royal Malaysian Air Force called on Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Air Staff, Pakistan Air Force on Friday at Air Headquarters.\nThe meeting focused on matters of mutual interest, military cooperation, joint training and collaboration in the industrial domain, said a news release issued by Inter Services Public Relations (ISPR).\nOn his arrival, a smartly turned-out contingent of Pakistan Air Force presented Guard of Honour to General Tan Sri Dato’ Sri Mohd Asghar Khan bin Goriman Khan.\nDuring the meeting, Chief of the Air Staff highlighted the robust bilateral defence ties that exist between Pakistan and Malaysia.\nHe conveyed his warm wishes to Chief of the Royal Malaysian Air Force on his maiden visit to Pakistan and highlighted the importance of collaboration in training, joint exercises and technology sharing.\nThe Air Chief also reaffirmed his commitment to enhancing military partnership between the two Air Forces through joint training initiatives, particularly within the realm of air power. These initiatives will encompass provisioning of both basic and tactical level training for personnel of the Malaysian Air Force.\nThe Chief of the Royal Malaysian Air Force lauded Pakistan Air Force’s achievements through indigenization and technological advancements.\nThe visiting dignitary expressed his keen desire to further consolidate the existing bilateral ties through enhanced collaboration in training, maintenance and operational excellence.\nGeneral Tan Sri Dato’ Sri Mohd Asghar Khan bin Goriman Khan expressed his deep admiration for the state of the art technological ecosystem witnessed by him during his visit to National Aerospace Science & Technology Park Silicon.\nHe also appreciated the innovative projects, cutting-edge technologies and indigenously developed systems displayed at PAF NASTP pavilion during the ongoing International Defence Exhibition IDEAS-2024.\nLater, the dignitary visited various installations and technological infrastructure established at Air Headquarters, Islamabad including National ISR & Integrated Air Operations Centre and PAF Cyber Command, where he was briefed about the operational capabilities of Pakistan Air Force.\nThe meeting between Chief of the Air Staff, Pakistan Air Force and Chief of the Royal Malaysian Air Force signifies a resolute commitment to reinforce military partnership, fostering collaboration and promoting robust relations between the two countries.",
  "retrievedAt": "2025-08-10T15:32:40.453Z"
}
