{
  "title": "COAS visits Peshawar, briefed on prevailing security situation, ongoing counter terrorism operations",
  "link": "https://www.app.com.pk/national/coas-visits-peshawar-briefed-on-prevailing-security-situation-ongoing-counter-terrorism-operations/",
  "date_published": "2024-11-22T11:31:00.000Z",
  "source": "APP",
  "content": "Rawalpindi, Nov 22 (APP):General Syed Asim Munir, NI(M), Chief of Army Staff (COAS) on Friday visited Peshawar, as a follow up of the National Apex Committee meeting held on November 19 and prelude to Provincial Apex Committee meeting to be held soon.\nThe COAS was provided a comprehensive briefing on the prevailing security situation and the progress of ongoing counter-terrorism operations in the region, said an Inter Services Public Relations (ISPR) news. Chief Minister KPK and field commanders were also present at the occasion.\nPaying profound tribute to the Shuhada and Ghazis, the COAS emphasized the unparalleled sacrifices being rendered for the defense of the motherland.\nHe remarked that these sacrifices served as a cornerstone of national resilience, inspiring and unwavering dedication of the armed forces and of law enforcement agencies.\nThe COAS commended the high morale, operational readiness, and unyielding commitment of the troops in effectively countering all forms of threats.\nHe reiterated the Army’s firm resolve to dismantle hostile terrorist networks and eradicate the illegal spectrum undermining national security.\nHighlighting the collective determination of the nation and its security forces to combat terrorism, the COAS stressed that thwarting the nefarious designs of inimical elements remained a top priority.\n“Through synchronized and robust operations, Pakistan Army in collaboration with Law Enforcement Agencies (LEAs) will relentlessly hunt down the enemies of peace to ensure lasting stability and security,” he assured.\nEarlier, upon his arrival, the COAS was received by the Corps Commander Peshawar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:33:18.845Z"
}
