{
  "title": "Global moot urges for collective action to mitigate climate change",
  "link": "https://www.app.com.pk/national/global-moot-urges-for-collective-action-to-mitigate-climate-change/",
  "date_published": "2024-11-22T08:48:00.000Z",
  "source": "APP",
  "content": "MIRPUR  ( AJK): Nov 22 (APP):A global conference of experts titled ‘Empowering Communities: The Case for Locally Led Adaptation in Climate Resilience’, hosted in Azerbaijan’s Baku city, emphasized the urgent need for collective action against climate change to mitigate the impacts of disasters.\nChairman Pakistan Red Crescent Society (PRCS), Sardar Shahid Ahmed Laghari, addressed a distinguished forum at a special event hosted in the Pakistan Pavilion during the 29th Conference of the Parties (COP29) in Baku, Azerbaijan, says a message reaching and released to the media here on Friday.\nThe event saw the participation of prominent figures, including Romina Khurshid Alam, Coordinator to the Prime Minister on Climate Change and Environmental Coordination, Senator Samina Mumtaz Zehri, representatives from the German Red Cross, the International Federation of Red Cross and Red Crescent Societies (IFRC), national societies, and other key humanitarian stakeholders.\nA thought-provoking panel discussion featured distinguished speakers, including Member Managing Board Jamaican Red Cross Audrey Mullings, Ms. Ninni Ikkala Nyman, and Manzoor Ali from IFRC, Head of Delegation German Red Cross in Pakistan Asif Aman, and PRCS Deputy Director Climate Change Sajjad Ali, who focused on the significance of locally driven adaptation strategies.\nChairman of PRCS Sardar Shahid Ahmed Laghari was the keynote speaker of this exclusive session.\nIn his remarks, Chairman Sardar Shahid Ahmed Laghari underscored PRCS’s extensive humanitarian work in Pakistan, especially during the 2022 monsoon floods.\nHe gave the details regarding the organization’s ongoing recovery programs and proactive measures to tackle climate challenges, reaffirming PRCS’s dedication to easing the hardships of vulnerable communities.\nHe emphasized the critical role of community-led adaptation, advocating for building local capacities and learning from grassroots experiences to enhance disaster response and recovery. Highlighting Gilgit-Baltistan as a case in point, he addressed the threats posed by glacier melting and glacial lake outburst floods (GLOF) in the region.\nA documentary showcasing PRCS’s humanitarian initiatives and climate adaptation efforts provided attendees with an in-depth understanding of the organization’s work.\nChairman Laghari also acknowledged the support extended by partner organizations including IFRC, ICRC, Norwegian Red Cross, Turkish Red Crescent, German Red Cross, Kuwait Red Crescent, Saudi Red Crescent, Qatar Red Crescent, Egypt Red Crescent, Iran Red Crescent, and the King Salman Humanitarian Aid and Relief Center.\nAs a gesture of appreciation, Chairman Laghari presented souvenirs crafted from recyclable materials in Pakistan to Romina Khurshid Alam, Senator Samina Mumtaz Zehri, the panelists, and other distinguished guests of the event, symbolizing PRCS’s commitment to sustainability and community-driven innovation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:33:45.855Z"
}
