{
  "title": "FM calls for immediate cessation of human rights violation in IIOJK",
  "link": "https://www.app.com.pk/national/fm-calls-for-immediate-cessation-of-human-rights-violation-in-iiojk/",
  "date_published": "2024-01-05T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):Caretaker Foreign Minister Jalil Abbas Jilani on Friday called upon the international community, especially the United Nations, to live up to their promises and take necessary measures to enable the people of Jammu and Kashmir to exercise the right of self-determination as enshrined in the United Nations Security Council resolutions.\n“It must also call for an immediate cessation of human rights violations, and the restoration of the rights and fundamental freedoms of the Kashmiri people,” he said in his message on the occasion of Right to Self-Determination Day.\nFM Jilani said the fifth of January is annually observed as the Right to Self-Determination Day for the people of Jammu and Kashmir. On this day in 1949, the United Nations Commission for India and Pakistan (UNCIP) adopted a resolution that guarantees a free and fair plebiscite in Jammu and Kashmir, to enable the Kashmiri people to realize their right to self-determination.\nHe highlighted that the right to self-determination is a fundamental principle of international law. Every year, the UN General Assembly adopts a resolution that reaffirms the legal right of people to decide their own destiny. It expresses unequivocal support for the realization of the right to self-determination for people under foreign occupation. Regrettably, the Kashmiri people have not been able to exercise this inalienable right.\nHe said India is taking a number of steps to consolidate its occupation of the Indian Illegally Occupied Jammu and Kashmir (IIOJK), which is an internationally-recognized disputed territory.\n“Following its illegal and unilateral actions of 5 August 2019, India’s efforts have been aimed at engineering demographic and political changes so that the Kashmiris are reduced to a disempowered community in their own land. The Indian Supreme Court’s recent verdict is yet another manifestation of India’s desire to undermine the right to self-determination of the Kashmiri people,” he added.\nIndia is also subjecting the Kashmiri people to systematic human rights violations. It has created an environment of fear to crush dissent in IIOJK.\n“For its part, Pakistan will continue to extend its unstinted moral, political and diplomatic support to the struggle of the people of Jammu and Kashmir for the realization of their right to self-determination in accordance with the relevant UN Security Council resolutions,” the foreign minister added.",
  "retrievedAt": "2025-08-10T23:24:59.067Z"
}
