{
  "title": "Jamal Shah directs to accelerate conservation work during Rawat Fort visit",
  "link": "https://www.app.com.pk/national/jamal-shah-directs-to-accelerate-conservation-work-during-rawat-fort-visit/",
  "date_published": "2024-01-05T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 05 (APP): Caretaker Minister for Culture and National Heritage Jamal Shah on Friday directed the concerned quarters to complete the preservation work on Rawat Fort.\nDuring his visit to the Fort to oversee the preservation work of Pakistan’s cultural heritage, he emphasized for expediting the conservation work to safeguard this historic site.\nThe minister was accompanied by officials from the National Heritage and Culture Division.\nDuring the visit, the minister and Secretary Humaira Ahmad were briefed by senior officials from the Department of Archeology and Museum (DOAM) about the ongoing project aimed at preserving, restoring and developing Rawat Fort.\nExpressing the vital importance of this endeavor, Jamal Shah highlighted the project’s core objectives, emphasizing the fusion of scientific and traditional techniques to preserve and showcase the country’s rich cultural legacy.\n“The efforts put into preserving Rawat Fort will not only halt its decay but will also secure its heritage for generations to come, while boosting tourism both nationally and regionally,” the minister remarked. He also emphasized the inclusive aspect of the project, noting that the archaeological excavation, conservation, and restoration works would generate employment opportunities in the local area.\nRawat Fort, an ancient Sarai located along the G.T Road, has historical significance dating back to the Sultanate period in the early 15th century A.D. Associated with tales of Mahmud of Ghazna’s son Masud and the valiant Ghakhar Chief Sarang Khan, the fortress holds a rich tapestry of narratives within its walls.\nPresently, the Fort exhibits two gateways on its northern and eastern sides, a three-domed Mosque in the Western Wing’s heart, and an octagonal single-domed Mausoleum in the North-Western corner. Scattered graves within its precinct tell tales of bygone eras.\nThe majestic rows of identical living cells line the quadrangular inner face of the defense walls, overlooking the courtyard, showcasing the fort’s historical architectural marvels.\nThe minister’s visit to Rawat Fort signifies the government’s unwavering commitment to safeguarding Pakistan’s cultural heritage, ensuring that these iconic sites endure as enduring testaments to the nation’s history and identity.",
  "retrievedAt": "2025-08-10T23:24:19.464Z"
}
