{
  "title": "President to forward Imran Khan’s letter to PM, CJP seeking judicial commission on alleged regime change conspiracy",
  "link": "https://www.app.com.pk/national/president-to-forward-imran-khans-letter-to-pm-cjp-seeking-judicial-commission-on-alleged-regime-change-conspiracy/",
  "date_published": "2022-05-10T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): President Dr Arif Alvi on Tuesday said he would forward the letter of former prime minister Imran Khan to Prime Minister Shehbaz Sharif and Chief Justice of Pakistan (CJP) Umer Ata Bandial seeking formation of a judicial commission by the latter to probe alleged regime change conspiracy.\nIn reply to a letter of Imran Khan, the president informed him about sending his (Khan’s) letter to PM Sharif and CJP Bandial “with the request that the latter may constitute an empowered judicial commission to conduct open hearings in this regard”.\nImran Khan had earlier written a letter to President Alvi and CJP Bandial requesting a public inquiry and the formation of a judicial commission respectively to probe the “threat letter”, which he claimed was an evidence of a “conspiracy” to topple his government.\nThe president called for a thorough probe and investigations into the alleged regime change conspiracy by recording circumstantial evidence to reach a logical conclusion and provide clarity to the people of Pakistan.\nHe wrote that he had read the copy of the cypher sent by the then ambassador of Pakistan to the United States, containing an official summary of a meeting held at the Pakistan embassy with Donald Lu, US Assistant Secretary of State along with another US official, and other diplomats of the Pakistan mission.\nHe added that the report in the cypher included some statements made by Mr Lu in quotes specifically mentioning a ‘No Confidence Motion’ against the prime minister, and also mentioned ‘forgiveness’ if it succeeded, and dire consequences if the said motion failed.\nPresident Alvi also referred to the two meetings of the National Security Committee that had endorsed that the statements of Mr Lu amounted to unacceptable and blatant interference in the internal affairs of Pakistan and the government of Pakistan had rightly issued a demarche.\nHe underscored that threats could both be covert and overt and in this particular case, it was clearly communicated in undiplomatic language.\nHe noted that the former prime minister had raised serious issues of possible covert reactions and ramifications of the threat.\nIn his letter, the president continued that he was of the belief that for a sovereign nation like Pakistan and its people whose dignity had been deeply hurt, there was a need to carry out an in-depth analysis and investigation in order to inquire the possible conspiracy.\nThe president also highlighted that in the history of Pakistan, people had alleged and strongly believed in “many obvious, but unfortunately the unproven conspiracies”.\nIn this regard, he cited the examples of the murder of the first prime minister of Pakistan Shaheed Liaquat Ali Khan in Rawalpindi, the Agartala Conspiracy case, PM Zulfiqar Ali Bhutto’s public waving of a letter and allegation of a conspiracy against him, President Ziaul Haq’s plane crash, Ojheri disaster, Abbottabad Conspiracy case, and several others that remained inconclusive.\nThe president said that sometimes top-secret archives that were declassified after decades, or revelations by informed people, or documents that had emerged in ‘leaks’, did provide a ‘smoking gun’ kind of link to events and conspiracies on the world stage.\nHe regretted that it happened much later, after the destinies of those countries had been significantly damaged by such illegal interventions.\nThe president emphasized that proving a ‘smoking gun’ had been identified ‘in the hand of a conspirator’, or finding a possible money trail or identifying meetings where people had been motivated towards covert action or where people had been bought and sold, would be a vigorous exercise.\nHe stated that even recorded circumstantial evidence could lead the way towards some conclusions and provide closure to the people of Pakistan who deserved clarity.",
  "retrievedAt": "2025-08-11T14:51:33.598Z"
}
