{
  "title": "Minister Asad Mahmood visits NHA HQs; briefed on various projects",
  "link": "https://www.app.com.pk/national/minister-asad-mahmood-visits-nha-hqs-briefed-on-various-projects-2/",
  "date_published": "2022-05-10T15:11:00.000Z",
  "source": "APP",
  "content": "The minister expressed these views while talking to NHA officials during his first visit to the National Highway Authority headquarters.\nMinister said that highways were playing very important rule in promotion of industries, trade, agriculture and tourism.\nHe said that maximum construction projects should be completed on public-private partnership with a view to self-reliance, adding that obstacles in the construction process will be removed on priority basis. He said that wide and attractive highways are the first impression of any nation.\nChairman NHA gave a comprehensive briefing to the federal minister on the status of ongoing as well as future development projects across the country.\nThe minister was informed that due to limited resources, NHA moving towards financial self-reliance through public- private partnership and Built-Operate-Transfer (BOT).\nEarlier, when he reached NHA headquarters, Federal Secretary Communications Zafar Hassan, Chairman NHA Capt (retd) Muhammad Khurram Agha and Inspector General of National Highways and Motorways Police Khalid Mahmood received the visiting guest.\nGiving a detailed briefing on all the ongoing construction projects across the country, Chairman NHA said, that fourteen and a half thousand kilometers of highways and motorways of Pakistan are under the control of NHA, while strategic roads are in addition to them, i.e., Gilgit-Skardu Road, Kohala-Muzaffarabad and Muzaffarabad-Choti Roads.\nThe Chairman NHA also apprised the Federal Minister regarding National Highways, Motorways, Major Tunnels, Flyovers, Underpasses and other construction works and the overall performance of NHA Engineers and Architects.\nHe also gave a detailed briefing regarding the CPEC projects. On this occasion, he was also briefed about the ongoing construction projects of NHA in Dera Ismail Khan constituency of Federal Minister for Communications Asad Mahmood. Dera Ismail Khan holds a unique position in terms of motorway alignment.\nThe Chairman NHA also apprised the Federal Minister about the ongoing construction projects in Balochistan, Sindh, Punjab and Khyber Pakhtunkhwa.On the occasion, Asim Amin, Member Planning NHA, Ikram Saqlain Haider General Manager Planning and General Manager NHA KPK assisted the Chairman NHA.\nExpressing keen interest in the overall performance of the NHA, Federal Minister for Communications Asad Mahmood said that highways play a vital role in stabilizing the economy of the country.\nDuring his visit, Federal Minister for Communications Asad Mahmood also reviewed the Intelligent Transport System (ITS) set up in the National Highway Authority.\nIn addition to monitoring of highways and motorways, toll plazas, weigh stations and camera systems are also being monitored.",
  "retrievedAt": "2025-08-11T14:51:22.792Z"
}
