{
  "title": "Loadshedding being faced in areas with less dues recovery: Khurram",
  "link": "https://www.app.com.pk/national/loadshedding-being-faced-in-areas-with-less-dues-recovery-khurram/",
  "date_published": "2022-05-10T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Power Engineer Khurram Dastgir Khan on Tuesday said power loadshedding was being observed only in those feeders that were facing more losses with less recovery of the dues.\nAddressing a press conference along with Minister for Information and Broadcasting Marriyum Aurangzeb after the cabinet meeting, he said Prime Minister Shehbaz Sharif had directed to prepare a new policy to produce more electricity and boost the performance of energy sector in next 10 years.\nOn the PM’s directive, he said, the loadshedding timings would be balanced in rural and urban areas, which was though a big challenge, but “we will achieve this task”.\nThe production of electricity in the country had reached 22,634 mega watts, and loadshedding was being managed at those feeders having more losses, he added.Additional resources were needed to control the loadshedding, the minister said.\nThe poor performance of the PTI regime had also affected the energy sector, which was also the main cause of loadshedding, he added.\nTo a question, the minister said as per the Constitution, the president was bound to follow the advice of prime minister. The PM’s powers were clearly mentioned in the Constitution.\nHe said the last Pakistan Muslim League-Nawaz government had produced more electricity than demand, but due to the mismanagement and inefficiency of the PTI regime, the menace of power outages again surfaced.\nAll-out efforts were being made to clear the outstanding dues of the energy sector till June 30, he added.\nKhurram said the distribution companies had been asked to increase their collection of dues.\nMinister for Law Azam Nazir Tarar said the cabinet expressed its reservations over the recent decisions of President Dr Arif Alvi and Punjab Governor Omar Sarfraz Cheema.\nHe said the cabinet approved the advice of PM Shehbaz Sharif for the removal of Omer Sarfaraz Cheema from the governor’s office and vowed that no violation of the Constitution would be tolerated in that regard.\nHe said the cabinet was of the opinion that subversion of Constitution had become habit of some persons occupying constitutional posts.",
  "retrievedAt": "2025-08-11T14:51:17.744Z"
}
