{
  "title": "SC continues hearing of presidential reference seeking interpretation of Article 63-A",
  "link": "https://www.app.com.pk/national/sc-continues-hearing-of-presidential-reference-seeking-interpretation-of-article-63-a/",
  "date_published": "2022-05-10T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): The Supreme Court on Tuesday continued hearing of the presidential reference seeking its opinion on Article 63-A of the Constitution.\nA five-member larger SC bench headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz Ul Ahsan, Justice Muneeb Akhtar, Justice Mazhar Alam Khan Miankhel and Justice Jamal Khan Mandokhel heard the reference.\nDuring the course of proceedings, Pakistan Tehreek-e-Insaf’s (PTI) counsel Dr Babar Awan, while continuing his arguments, said those who defaulted on the payment of their utility bills were also not eligible to become a member of the parliament. If the time period was not determined then the disqualification would be for life, he added.\nJustice Jamal Khan Mandokhail asked whether the lawmakers would continue to remain disqualified if they paid their outstanding utility bills before the next election.\nJustice Ijaz Ul Ahsan said the lawmakers’ disqualification would end once the outstanding dues were paid. Only disqualification under Article 62(1)(f) was for whole life.\nHe said the disqualification would remain in place until the declaration was cancelled by the court. Disqualification for the non-payment of utility bills could not be for life, he added.\nBabar Awan said it was an affront to Article 63-A if a lawmaker was de-seated and then returned to the parliament within 15 days to perhaps become a minister.\nJustice Mandokhail said there was a need to carry out law reforms. The door of repentance was always open, he added.\nHe asked the counsel to read Article 63(1)(g) of the Constitution. Addressing Babar Awan, Justice Miankhel said that he was asking the court to declare dissident lawmakers disqualified for life. Babar Awan replied that it was a serious crime.\nJustice Miankhel said the violation of Article 63(1)(g) was a more serious crime as it concerned the ridiculing of the judiciary and the army as well as the Ideology of Pakistan.\nJustice Muneeb asked as to how Article 63-A was related to Article 62(1)(f).\nBabar Awan responded that his argument was that Article 63-A itself disqualified the dissident lawmakers for life. He asked whether the 26 lawmakers should be allowed to abandon the party. In that way, the majority party would become a minority, he added.\nJustice Ahsan asked Babar Awan that he (Babar) wanted the interpretation of Article 63-A to be so rigid that no lawmaker could defect.\nBabar Awan said the unanimously passed 18th Amendment launched a surgical strike against the cancer of defection.\nHe said that the apex court had unlimited powers to pass rulings that cemented law. The court had granted General Pervez Musharraf the power to amend the Constitution, he added.\nJustice Mandokhel said some believed the judiciary should be independent while others viewed it to be subservient to the Constitution. The Parliament, the judiciary and the executive should all be subservient, he added.\nAwan replied that only the judiciary must ensure all legislative branches were subservient to the Constitution.\nAs Babar Awan concluded his arguments, Pakistan Muslim League-Quaid (PML-Q) lawyer Azhar Siddique started to plead the case.\nJustice Mandokhel asked the PML-Q counsel whether independent legislators accepted a party’s every decision.\nSiddique replied that independent parliamentarians took an oath to accept all the conditions before joining the party. The dissident members had taken an oath on the Holy Qur’an. Those were the bitter realities and he did not want to go into them, he added.\nJustice Mandokhel said Article 63-A provided a forum for action against deviant members. Azhar Siddique said that such members could not vote.\nJustice Mandokhail said the punishment under Article 63-A was the termination of the party’s membership of the dissident.\nHe asked the PML-Q counsel if he wanted to increase the punishment of the member.\nAzhar responded that increasing the punishment was not his case. He said that Article 63-A presented a protective wall against the no-confidence motion.\nJustice Mandokhail responded that if the dissident members’ votes were not counted, them how they could be punished.\nJustice Ijaz observed that the practice of buying and selling lawmakers should come to an end.\nAzhar Siddique also referred to the Charter of Democracy – a 36-point document signed by the PPP and the PML-N to promote democracy.\nTo this, Justice Mandokhail observed that had it been agreed upon unanimously, it would have been a part of the Constitution.\nHe said no one had barred the party leaders from punishing defecting members. The leader was only required to specify that the member had defected, he added.\nAzhar Siddique said there would be departmental action against the perpetrators of corruption, including military action.\nThe chief justice asked the counsel under which laws would dissident lawmakers have their votes discounted.\nJustice Mandokhel said when two members of the PML-Q voted against the party, the party chief exercised his authority and did not take any action.\nSiddique responded that if defection was permitted, then Article 63-A was unnecessary.\nJustice Mandokhail said the deviation from party policy could also be in the interest of the country.\nThe case was adjourned till Wednesday.",
  "retrievedAt": "2025-08-11T14:51:23.886Z"
}
