{
  "title": "ECP finalizes arrangements for holding cantonment board elections on Sunday",
  "link": "https://www.app.com.pk/national/ecp-finalizes-arrangements-for-holding-cantonment-board-elections-on-sunday/",
  "date_published": "2021-09-11T18:17:00.000Z",
  "source": "APP",
  "content": "The ECP has already published lists of all polling stations while polling staff was also appointed by the Returning Officers. The polling would start from 8 am and continue till 5 pm.\nPolice would be deployed at polling stations whereas Rangers would perform their duties outside the polling stations for ensuring smooth conduct of polling. The commission also approved the installation of CCTV cameras in the most sensitive polling stations.\nPresiding officers would announce the results immediately after completion of counting whereas returning officers would announce the unofficial results after completion of the results of each ward. The ECP has directed polling agents to get copy of the results from their respective presiding officer.\nThe ECP has set up five complaint centres at various areas. One centre has been established at federal capital four centres at four provincial capitals aimed at registering complaints relating to the polls.\nThe complainants could contact Islamabad complaint centre on phone numbers 051-9204402; 051-9204403 for registering election related complaints. The complaints could also fax their complaints on phone number 051-9204404.\nThe complaint relating to Punjab province can be lodged by dialing phone numbers 042-99212620; 042-99212209 and Fax no 042-99211020.\nIn Sindh, the provincial complaint centre could be approached on 021-99204170; Fax 042-99206645 for lodging complaints. In Khyber Pakhtunkhwa, the complainants can contact phone no 091-9222540 for registering their complaints and sending through Fax no 091-9210923.In Balochistan, the complaint centre can be approached on phone no 081-9201392; Fax 081-9202317. ECP in its code of conduct for coverage at the polling station and announcement of results, has asked media to refrain from airing any unofficial result of cantonment board elections for at least one hour after the voting process was over at polling stations. The election supervisory body has asked broadcasters to avoid airing any final formal, definite election result of a polling station until one hour was passed after the close of polls.\n“The broadcasters will air only with a clear disclaimer that they are unofficial, incomplete and fractional results which should not be taken as a final result until the returning Officer has announced the results of ward,” it added.\nOnly the accredited media persons would be allowed to enter a polling station along with the camera for making footage of the voting process or counting process only for onetime.However, they cannot make footage of the screened off compartment to maintain the ballot’s secrecy. The code of conduct has bared media from broadcasting or publishing any content which could adversely affect public opinion against a particular party or candidate.\nThe media organizations should avoid disseminating information about a party or a candidate which is not supported by cogent evidence and not to air or publish any news related to a candidate without ascertaining its veracity. Media should ensure balanced coverage of the election campaign of all contesting parties and must avoid airing or publishing opponents’ remarks about personal life of any candidate.\n“If a candidate makes allegations against another candidate, media should try to seek comments from both sides before broadcasting or publishing such allegations,” the code adds.\nSimilarly, wild allegations and statements which may harm national solidarity or create law and order shall be strictly avoided. The media was barred from airing or publishing any violence inciting contents.\nMeanwhile, Pemra has been asked to monitor the coverage given to parties through public and private radio and TV channels.\nThe regulatory authority would be required as per the code to obtain transmission certificates, details of payments made by the candidates or parties for campaign.",
  "retrievedAt": "2025-08-11T21:12:39.247Z"
}
