{
  "title": "NAC to synergize agriculture education, research: Fakhar Imam",
  "link": "https://www.app.com.pk/national/nac-to-synergize-agriculture-education-research-fakhar-imam/",
  "date_published": "2021-09-11T16:29:00.000Z",
  "source": "APP",
  "content": "Chairing a meeting at the University of Agriculture Faisalabad (UAF) he said that increment in per acre production, value addition, empowering small farmers, tangible research in agriculture and rural development were prerequisite for the uplift of the country and food security. He said the government had mapped out comprehensive five policies on five major crops in order to boost up per acre productivity, ensure food security and agriculture development. He said this year, per acre wheat production had boosted up which was stagnant for the last ten years, resulting in the significant increase of 2.2 million ton in the national wheat production.He said that it was increased by 1.5 ton per acre.\nTalking about the cotton, he said that production of cotton in Punjab was touching 4.5m bales at an increase of approximately 8.5 percent from last year. Overall cotton production was likely to reach 8.46 million bales.\nHe said that the attack of white-fly , pinball worm and CLCV remained significant which had adversely affected the production of cotton. He said that provision of certified seed, value addition and mechanization were major challenges and agriculture experts should play their pivotal role to overcome these challenges. He said that the government has disbursed Rs 4 billion credit to the small farmers, having less than 12 acre, which was the 90 percent of the farming community.\nFederal Minister for National Food Security and Research Syed Fakhar Imam said the provision of quality education and health facilities at rural level will lower down burden in the cities and ensure rural development.\nTalking about fruits, he said that country was producing excellent fruit but its export was negligible. He said that the value addition and the adaptation of the international standard were prerequisite to earn the foreign exchange. He said that it was matter of grave concern that we import edible oil and pulses worth billions of the rupees instead of the producing at the domestic level.\nTalking about research, he said that the spending on research and development remained minimum. He said that agriculture council must be set up to analyze the demand and supply of agricultural students in the country.\nHe said that under cultivation land in the country was 50 million hectare out of which 32 million was the irrigated. He said that we had ignored the agriculture sector for the last 25 years that was a matter of serious concern.\nSyed Fakhar Imam said that agriculture sector was a powerful sector that was employing 43 percent of labour force. He said that neighboring countries were progressing with a large pace whereas we were far-lagging behind in modern agriculture practices.\nHe said that no nation can make the development in the modern era without investing on Human Resource (HR)development. He said, “We need to learn from the other nations experiences.”\nThe modern seed technology will not only reduce the production cost but also make the crop profitable. This will enable both the farmers and the country to move towards prosperity. He said that we had been ahead of China and Korea five decades ago, but now we were far lagging behind. The both countries invested on education and learn from other nations experiences.\nHe called for curriculum reforms in the agriculture and reverse engineering. UAF Vice Chancellor Prof Dr Iqrar Ahmad Khan said that FSc Agriculture should be revived that will help produce the dedicated agriculturists. He said that agriculture as a subject must be revived at the school level. He said that the blend of corn and wheat be introduced to cope with increasing malnutrition issue. He said that with the help of KOICA Pak Korea Nutrition Center had been established at the UAF to fight with challenge.\nHe said that UAF was making all out efforts of the farming community, agriculture and rural development with help of trained manpower, research and outreach.\nPro-Vice Chancellor Prof Dr Anas Sarwar said that the quality milk producing center must be set up.All deans gave the presentations on the occasion.",
  "retrievedAt": "2025-08-11T21:12:39.287Z"
}
