{
  "title": "Senate passes bill amending Pakistan Army Act, 1952, to strengthen national security",
  "link": "https://www.app.com.pk/national/senate-passes-bill-amending-pakistan-army-act-1952-to-strengthen-national-security/",
  "date_published": "2023-07-27T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): The Senate on Thursday passed The Pakistan Army (Amendment) Bill, 2023, which proposes stringent penalties for unauthorized disclosure of classified data pertaining to the country’s security or the Pakistan Army in a significant move to safeguard sensitive information related to national security.\nThe bill, moved by Defence Minister Khawaja Muhammad Asif, is aimed at strengthening the existing legislation for protect vital information critical to the safety and interests of Pakistan and its armed forces.\nAccording to the key highlights of The Pakistan Army (Amendment) Bill, 2023,  the bill proposes the addition of Section 26-A to the Pakistan Army Act, which criminalizes the unauthorized disclosure of information acquired in an official capacity that could be prejudicial to Pakistan’s security or the armed forces. Anyone found guilty under this section faces rigorous imprisonment for up to five years.\nThe bill makes it clear that if someone discloses sensitive information after obtaining prior approval from the Chief of Army Staff (COAS) or any officer duly empowered by him, such disclosure shall not be considered unauthorized.\nThe proposed amendments specify that cases of unauthorized disclosure shall be dealt with under Section 59 (civil offences) of the Army Act read with the Official Secrets Act 1923, reinforcing the legal framework to prosecute offenders effectively.\nThe bill introduces Section 26-B, which prohibits any person subject to the Army Act from engaging in political activities for a period of two years after their retirement, release, resignation, discharge, removal, or dismissal from service. Furthermore, individuals who have been involved in sensitive duties are barred from participating in any form of political activity for five years after their exit from service.\nViolation of the aforementioned political activity restrictions, upon conviction by the court constituted under the Army Act, could lead to rigorous imprisonment for up to two years.\nThe bill proposes the introduction of Sections 55-A, 55-B, and 55-C to tackle issues related to conflict of interest, electronic crimes aimed at undermining the armed forces, and defamation. Individuals subject to the Army Act in the past five years are prohibited from entering into employment, consultation, or other engagements with entities having a conflict of interest with the activities of the Pakistan Army or its affiliates.\nCommitting offenses under the Prevention of Electronic Crimes Act (PECA), 2016, with malicious intent against the armed forces may result in punishment as prescribed in the PECA law.\nAdditionally, the act criminalizes attempts to ridicule, scandalize, or bring hatred towards the armed forces, subjecting the offenders to imprisonment or fines.\nThe proposed amendments introduce Section 176-AA, granting the COAS the authority to issue instructions for the implementation of the Act and its rules and regulations. The COAS also has the option to delegate powers and functions to subordinate officers or authorities under Section 176-C.\nTo ensure the effectiveness, Section 176-E establishes that the provisions of the Act shall have precedence over any other inconsistent laws, rules, or regulations in force.\nThe passing of this bill by the Senate marked a crucial step towards enhancing national security measures and ensuring the protection of classified information. The amended Pakistan Army Act, 1952, provided a robust legal framework to safeguard the interests and security of Pakistan and its armed forces while upholding the principles of transparency and accountability. The bill would now proceed to the President for approval before becoming law.",
  "retrievedAt": "2025-08-11T09:00:31.249Z"
}
