{
  "title": "Pakistani oil companies collaborate with Saudi Aramco for $10 Bln Greenfield Refinery Project",
  "link": "https://www.app.com.pk/national/pakistani-oil-companies-collaborate-with-saudi-aramco-for-10-bln-greenfield-refinery-project/",
  "date_published": "2023-07-27T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): In a historic collaboration, four leading Pakistani state-owned companies would join hands for Greenfield Refinery project at the strategic Gwadar Port in Pakistan.\nThe Memorandum of Understanding (MoU) signing ceremony took place at the head office of Oil and Gas Development Company Limited (OGDCL) on Thursday, a news release said.\nThe Pakistani state-owned entities, Oil and Gas Development Company Limited (OGDCL), Pakistan State Oil (PSO), Pakistan Petroleum Limited (PPL), and Government Holdings Private Limited (GHPL), will collaborate through a joint investment strategy. The project will have significant foreign investment from world-class oil and gas giants through equity participation.\nThe project envisions setting up an integrated refinery petrochemical complex with crude oil processing capacity of minimum 300,000 barrels per day (BPD) along with petrochemical facility in Pakistan. The integrated refinery petrochemical complex shall comprise of various components such as marine infrastructure, petrochemical complex, storage for crude oil and refines utilities, pipeline connectivity etc.\nSecretary Petroleum Captain (R) Muhammad Mahmood in his opening remarks shared salient aspects of the Green Field Refinery Policy and underscored the commitment of the Petroleum Division towards the development and growth of the Petroleum Sector.\nMinister of State for Petroleum Divison, Doctor Musadik Masood Malik shared details of the project and its benefits to national economy by way of economic growth, foreign exchange savings, energy security, employment opportunities and social uplift.",
  "retrievedAt": "2025-08-11T09:00:20.881Z"
}
