{
  "title": "Pakistan to continue diplomatic, moral support to Kashmiris",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-diplomatic-moral-support-to-kashmiris/",
  "date_published": "2023-07-27T15:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP):Pakistan will continue to extend political, diplomatic and moral support to Kashmiri brothers and sisters for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the United Nations Security Council resolutions.\nAddressing the weekly press briefing here on Thursday, the Foreign Office Spokesperson said, “Pakistan strongly condemns the provocative statement made by Indian Defence Minister on July 26, 2023 in Ladakh, boasting India’s readiness to cross the Line of Control. These unwarranted and totally unacceptable remarks reflect India’s hostility against its neighbours, Pakistan in particular.”\n“Pakistan is fully capable of defending itself against any aggression as demonstrated in its forceful response to India’s misadventure in February 2019,” she stressed.\n“This is not the first time that India’s political leaders and senior military officers have made such highly irresponsible and delusional remarks about Azad Jammu and Kashmir and Gilgit-Baltistan. They routinely engage in jingoistic rhetoric for political ends by stoking hyper-nationalism and anti-Pakistan sentiment. This practice of dragging Pakistan into Indian political discourse must end.”\n“These highly irresponsible statements also constitute a threat to regional peace and security and aim to destabilize the strategic environment in South Asia. While fully prepared to respond to India’s provocations and irresponsible behaviour, Pakistan will continue to act responsibly and contribute to all efforts for promoting peace, security and stability in the region,” she added.\nThe Spokesperson said, Jammu and Kashmir was an internationally-recognized disputed territory.\n“India’s claims on Azad Jammu and Kashmir and Gilgit-Baltistan are founded in fantasy. Neither history and international law, nor morality and the situation on ground can validate India’s illusions. It should, therefore, direct its attention to full implementation of the relevant UNSC resolutions which stipulate that the final disposition of the territory will be made in accordance with the will of the people expressed through the democratic method of a free and impartial plebiscite conducted under the auspices of the United Nations,” she added.\nShe said Pakistan strongly condemned the desecration of the Holy Quran and dishonoring of the Pakistani flag in front of the Embassy of Pakistan in Copenhagen, Denmark. “A strong protest has been lodged with the Government of Denmark. We expect the Danish authorities to take all measures necessary to stop such acts of hatred and incitement.”\n“The intent of such evil acts is to insult two billion Muslims around the world and create friction amongst communities, cultures, and countries. These acts, by any definition, do not constitute freedom of expression. Nor can the permission to carry out provocative acts of religious hatred be justified under the pretext of freedom of expression, opinion and protest. As the UN High Commissioner for Human Rights has said, speech and inflammatory acts against Muslims are offensive, irresponsible and wrong,” she continued.\nShe said, “Pakistan has always maintained that freedom of expression comes with responsibilities. It is the responsibility of national governments, regional organizations and the international community at large to call out, condemn and proactively prevent the vile acts of Islamophobia and religious hatred. As urged by the UN Human Rights Council, the relevant countries must address, prevent and prosecute such acts of religious hatred. The international community must raise its collective voice against Islamophobia and work together to promote inter-faith harmony and peaceful co-existence.”",
  "retrievedAt": "2025-08-11T09:00:15.105Z"
}
