{
  "title": "MDCAT to be held simultaneously at all centers",
  "link": "https://www.app.com.pk/national/mdcat-to-be-held-simultaneously-at-all-centers/",
  "date_published": "2023-07-27T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): The MDCAT-2023 examination will be conducted nationally and internationally on August 27, 2023 (Sunday), through admitting universities of all provinces, Islamabad and Gilgit-Baltistan.\nAccording to the In-charge Examinations Pakistan Medical & Dental Council (PMDC), the paper-based exam will be conducted simultaneously at all centres and venues.\nThe MDCAT result 2023 of one province will be valid for the entire country.\nCandidates have been directed to choose to conduct university through which he or she wants to appear for MDCAT-2023.\nThe editing option will only be open for a limited period of 48 hours from 6th and 7th August 2023.\nThe candidates have also been advised that they can make the changes on the mentioned dates accordingly.\nThis option will be provided across the country and will be available for one time only.\nThe details of the universities and their venues are as: Balochistan, Bolan University of Medical and Health Sciences, Quetta (venue Quetta).\nSindh, Jinnah Sindh Medical University, Karachi (venues included Karachi, Hyderabad, Shaheed Benazirabad and Larkana).\nKhyber Pakhtunkhwa, Khyber Medical University, Peshawar (venues included Peshawar, Mardan, Swat, Kohat, Bannu, D.I. Khan, Abbottabad, Swabi and Malakand.\nIslamabad Capital Territory, Shaheed Zulfiqar All Bhutto Medical University, Islamabad with the venue of Islamabad.\nAzad Jammu and Kashmir, Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad, Muzaffarabad, Mirpur, Rawalakot, Rawalpindi.\nGilgit Baltistan, Shaheed Zulfiqar All Bhutto Medical University, Islamabad, Gilgit\nInternational venues included Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad (Riyadh, and Dubai).\nPunjab, University of Health Sciences, Lahore (venues included Lahore, Gujranwala, Sialkot, Faisalabad, Multan, Bahawalpur, D.G. Khan, Sahiwal, Rawalpindi, Sargodha, and Gujrat.",
  "retrievedAt": "2025-08-11T09:00:27.821Z"
}
