{
  "title": "Gwadar sea port to be developed as one of the best in world: PM",
  "link": "https://www.app.com.pk/national/gwadar-sea-port-to-be-developed-as-one-of-the-best-in-world-pm/",
  "date_published": "2023-07-27T12:35:00.000Z",
  "source": "APP",
  "content": "GWADAR, Jul 27 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday reiterated the government’s resolve to develop the Gwadar Sea Port as one of the best in the world.\nHe said the fate of the people of Balochistan especially of Gwadar would be changed through the ongoing development operation in across the province.\nAddressing a laptop and cheques’ distribution ceremony here, he said when Nawaz Sharif was elected prime minister for the third time in 2013, he planned and launched multiple projects in power, infrastructure and other sectors in Gwadar.\nHowever, he deplored that when he visited as prime minster last year here, he was shocked to note that, the previous government had abandoned work on all ongoing projects in the city.\nHe said despite 15 months of challenging time, the coalition government managed to lay foundation of development and prosperity in the country especially in Balochistan.\nBalochistan, he said was rich in huge minerals and other natural resources which needed to be explored and the fruits of the development of the area would be given to the local people.\nThe local people must enjoy all the basic facilities in all sectors including health and education.\nHe said the draft of the Gwadar port was one the deepest among the world’s top ports, however dredging of the port which was a continuous process to prevent accumulating silt, was not ensured by the previous government.\nNow he informed that the current government initiated the dredging process which would be completed by February next year.\nHe said in five years from 2017 to 2022, only 100,000 tons of goods could arrive here while goods of over 600,000 tons arrived here at the Gwadar Port during the 15 months of the incumbent government.\nThe prime minister announced that the laptop quota for Balochistan had now been increased to 14% against the 6% population share of the province.\nHe also directed the relevant authorities to further increase the laptop quota to 18% for next fiscal year.\nPM Shehbaz said default risk for Pakistan had been averted due to support from the brotherly countries like China, Saudi Arabia and UAE.\nYesterday, he said China Exim bank had rolled over loan of another $2.4 billion for next two years.\nHe made it clear that all the support from the friendly countries was totally unconditional as no country had not placed any condition in return to the loan relief.\nHe also directed the relevant authorities to put the security of the foreigners on top priority.\nMinister for Maritime Affairs Syed Faisal Sabzwari said the under the leadership of Prime Minister Shehbaz Sharif, numerous welfare and development projects were being launched for uplift of the people of the province.\nFor the social uplift of the poor fishermen, he said the prime minister had distributed cheques to 3,250 small fishermen amounting to Rs 250,000 per head.\nSpecial Assistant to Prime Minister on Youth Affaris Shaza Fatima Khawaja said over one million laptops had been delivered since the launch of the laptop scheme by Shehbaz Sharif as Chief Minister Punjab.\nShe said as per new laptop quota, some 14000 talented students of Balochistan would receive laptops this year.\nFederal Ministers Ahsan Iqbal, Khawaja Saad Rafique, Governor Balochistan, provincial ministers and top government officials were also present on the occasion.",
  "retrievedAt": "2025-08-11T09:00:25.193Z"
}
