{
  "title": "Key findings on DMPA-SC self injection disseminated",
  "link": "https://www.app.com.pk/national/key-findings-on-dmpa-sc-self-injection-disseminated/",
  "date_published": "2023-07-27T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): A national dissemination event of key findings on a national policy landscape analysis on DMPA-SC as self-injection in Pakistan was held here on Thursday.\nThe event was attended by national and provincial family planning partners including government representatives including departments of health and family planning, development partners and family planning private sector organizations.\nThe event organized by RIZ Consulting and Jhpiego shared crucial insights and recommendations on DMPA-SC as self-injection in Pakistan.\nSecretary National Health Services Regulations and Coordination, Iftikhar Ali Shallwani, acknowledged the monumental efforts of RIZ Consulting, Jhpiego and the Bill and Melinda Gates Foundation in advancing family planning initiatives in Pakistan.\nHe reaffirmed the Pakistan and specifically the federal Government’s commitment to addressing population growth and promoting family planning, aiming for a healthier and empowered future while highlighting some of the potential challenges.\nHe mentioned capacity building of health providers, commodity security and the behaviour change communication will be some of the critical areas which need to be addressed while developing the strategy.\nThe Secretary expressed heartfelt gratitude to donor agencies for their support and sought continued partnership from RIZ Consulting, Jhpiego, and other partners to further expand the implementation of DMPA-SC self-injection in Pakistan.\nDuring the event, the introduction and scaling up of DMPA-SC, particularly in Sindh province, were recognized as a pivotal game-changer in family planning methods, contributing to controlling population growth and optimizing the use of available resources.\nHe reiterated the unwavering commitment of the Government of Pakistan and its partners to achieving Sustainable Development Goals, promoting gender equality, and prioritizing the reproductive health and well-being.",
  "retrievedAt": "2025-08-11T09:00:28.640Z"
}
