{
  "title": "AJK minister announces up to 35 % raise in govt employees’ salaries",
  "link": "https://www.app.com.pk/national/ajk-minister-announces-up-to-35-raise-in-govt-employees-salaries/",
  "date_published": "2023-07-27T16:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): Azad Jammu and Kashmir (AJK) government Thursday announced raise in salaries of the government employees up to 35 per cent at par with the Federal Government decision.\nAddressing a press conference, the AJK Finance Minister Col Waqar Noor (retd) said a 30 per cent raise was given to those above 17 grade whereas employees from grade one to 16 will receive a 35 per cent hike in salaries. However 17.5 in pension was also increased.\nFlanked by other cabinet members, the minister stated that the pay increase would have a financial impact of 16 billion rupees.\nNevertheless, he assured that the government was determined to leave no stone unturned in ensuring relief to the employees.\n“We are in contact with the federal government, and we are hopeful that they will bear the financial burden of the pay raise.,” he added.\nDivulging details about the availability of flour in AJK, he mentioned that flour was currently available in the market, and no decision had been made yet regarding a price increase.\nHe further explained that a 15kg sack of flour was currently priced at Rs. 1550 in AJK, while the same quantity of flour was being sold for Rs. 3000 in other cities of Pakistan.\nThe AJK government had successfully recovered 200 government vehicles which were being used by unauthorized people, he apprised the media and added that tangible actions would be taken to establish the writ of the state.\nHe stated that during the previous regime, the expense of the Prime Minister’s house was 12.5 million rupees, but under the current administration, it has been significantly reduced to just 1.2 million rupees.\n“The health budget for hospitals, police stations and road repairment has been increased and the government also buying ten more cranes for the development projects,” he added.\nHe mentioned that the AJK government was being facing numerous challenges due to financial constraints. The government’s expenditure amounts to 190 billion rupees, while the state’s revenue stands at only 166 billion rupees.\nDespite these challenges, the current government in AJK is making every effort to provide maximum relief and support to the people.",
  "retrievedAt": "2025-08-11T09:00:22.982Z"
}
