{
  "title": "Senate passes ‘The Defence Housing Authority Islamabad (Amendment) Bill, 2023’ to enhance governance, security",
  "link": "https://www.app.com.pk/national/senate-passes-the-defence-housing-authority-islamabad-amendment-bill-2023-to-enhance-governance-security/",
  "date_published": "2023-07-27T17:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): The Senate on Thursday voted in favour of ‘The Defence Housing Authority Islamabad (Amendment) Bill, 2023’, presented by Defense Minister Khawaja Muhammad Asif during the parliamentary session.\nThe bill aimed to introduce essential amendments to the existing Defence Housing Authority Islamabad Act, 2013, with the primary objective of enhancing governance, clarifying provisions, and ensuring the security and welfare of the community.\nOne of the key aspects addressed in the bill is the modification of certain definitions in the original Act.\nThe Defence Housing Authority (DHA) Islamabad, established through the DHA Islamabad Act 2013, had some definitions missing or inadequate. To rectify this, the bill proposes appropriate definitions to enhance understanding and provide better clarity.\nThe amendment also seeks to streamline the process of appointing co-opted members of the executive board. Previously, the power to appoint co-opted members solely rested with the government, making it a lengthy and cumbersome exercise.\nHowever, the proposed amendment aims to transfer this authority to the governing body, thereby ensuring the participation of residents in the decision-making process through a more accessible approach.\nAddressing security concerns within the specified area under DHA Islamabad’s jurisdiction is another significant aspect of the amendment bill. The current Act lacks a clear mechanism for arranging security, which has raised security threats for the allottees of the authority.\nTo mitigate this ambiguity, the bill proposes the inclusion of a well-defined security mechanism to safeguard the interests and safety of the residents.\nOne noteworthy aspect of the DHA Islamabad is its commendable provision of services and quality development in its housing schemes over time, all without relying on any budgetary allocation from the government. Instead, the authority funds these services from its own resources.\nHowever, the absence of a clear provision for imposing necessary changes and fees in the Act has been a challenge. The amendment bill addresses this concern by granting the authority the necessary power for imposing changes and fees to ensure the continued provision of excellent services.\nTo enable smoother functioning and governance, the bill also seeks to empower the DHA Islamabad with the authority to make regulations and bye-laws. This provision will enhance the authority’s operational efficiency and facilitate better decision-making processes.\nThe proposed amendments, if fully implemented, will serve the primary purpose and objective of the DHA, ensuring the welfare and interest of the community while efficiently managing the authority’s functions.\nThe bill’s passage in the Senate marked a significant step towards achieving these vital objectives.\nWith the bill now approved by the Senate, it will proceed to the next stage of the legislative process before becoming law.\nThe government officials and stakeholders involved are optimistic that the amendments will lead to improved governance, enhanced security, and the overall betterment of the community served by the DHA Islamabad.",
  "retrievedAt": "2025-08-11T09:00:17.794Z"
}
