{
  "title": "Pakistan strongly condemns abhorrent Islamophobic acts in Denmark",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-abhorrent-islamophobic-acts-in-denmark/",
  "date_published": "2023-07-27T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): Pakistan on Thursday strongly condemned the desecration of the Holy Quran and dishonouring of the Pakistani flag in  Copenhagen and said it had lodged a strong protest with the Government of Denmark to stop such acts of hatred and incitement.\n“We expect the Danish authorities to take all measures necessary to stop such acts of hatred and incitement,” a foreign office spokesperson said in a statement.\nThe intent of such evil acts is to insult two billion Muslims around the world and create friction amongst communities, cultures, and countries. These acts, by any definition, do not constitute freedom of expression. Nor can the permission to carry out provocative acts of religious hatred be justified under the pretext of freedom of expression, opinion and protest. As the UN High Commissioner for Human Rights has said, “speech and inflammatory acts against Muslims are offensive, irresponsible and wrong” the statement added.\nPakistan has always maintained that freedom of expression comes with responsibilities. It is the responsibility of national governments, regional organizations and the international community at large to call out, condemn and proactively prevent the vile acts of Islamophobia and religious hatred. As urged by the UN Human Rights Council, the relevant countries must address, prevent and prosecute such acts of religious hatred. The international community must raise its collective voice against Islamophobia and work together to promote inter-faith harmony and peaceful co-existence, it further added.\nPakistan, for its part, would continue to raise the question of Islamophobia at the international level. This issue was a key point of telephone conversations of Foreign Minister Bilawal Bhutto Zardari with his counterparts from Iran, Saudi Arabia, and Turkiye and with Secretary General of OIC and the UN Secretary General. Issues pertaining to these recurrent acts of Islamophobia were being discussed at the OIC Headquarters in Jeddah and the Human Rights Council in Geneva, the statement concluded.",
  "retrievedAt": "2025-08-11T09:00:36.425Z"
}
