{
  "title": "Balochistan’s development at par with other provinces inevitable: PM",
  "link": "https://www.app.com.pk/national/balochistans-development-at-par-with-other-provinces-inevitable-pm/",
  "date_published": "2023-07-27T12:56:00.000Z",
  "source": "APP",
  "content": "GWADAR, July 27 (APP): Prime Minister Shehbaz Sharif on Thursday said that the development of Balochistan at par with other provinces was inevitable, which faced “criminal negligence” during the previous government.\nThe prime minister, during a visit here, inaugurated multiple development projects which, he said, were conceived during Nawaz Sharif’s tenure but were put to the backburners.\nHe told the newsmen that he had inaugurated a clean drinking water project, also launched by Nawaz Sharif in 2015 but faced an unnecessary delay since then.\nSimilarly, the dredging of Gwadar Port was planned in 2015 but could not be completed despite the fact it had reduced the port’s depth to impact the movement of heavy ships. However, the incumbent government executed the project on a war-footing basis and was set to complete by early 2024.\nThe prime minister said during the last five years, cargo weighing 100,000 tons could be brought to the Gwadar Port comparing 600,000 during the last 14 months of the current government which benefited the locals including laborers, transporters, cold storage owners and others.\nHe said not only Pakistan, but other countries in the region will also benefit from the development of Gwadar Port.\nHe said the projects like Gwadar Export Zones also faced neglect in the past and an impression was created that Baloch locals were being neglected in the process which was not true.\nThe prime minister told the newsmen that his government had completed a project of 100MW power transmission line from Iran to ease the lives of locals. Similarly, a Panjgur-Khuzdar transmission line has also been completed.\nHe said all of the said projects were conceived during Nawaz Sharif’s tenure and funds were also allocated but “criminal negligence” was shown by the previous government.\nHe said the process of disbursing cash assistance worth Rs250,000 each among 3,000 fishermen of Gwadar had been started.\nSimilarly, he said the laptops were distributed among the top-performing students of public universities, which the previous government failed to do so, despite it being a tool for progress in the modern era.\nHe said the incumbent government allocated billions of rupees for the laptops scheme across.\nHe said instead of a 6% allocated share of the laptop scheme for Balochistan, the federal government gave away the machines with a ratio of 14%, and the quota had further been increased to 18% for fiscal 2023-24.\nHe said the federal cabinet had green-signalled a 300MW coal power project for Gwadar and NEPRA had also approved the tariff.\nThe prime minister thanked Chinese President Xi Jinping for a rollover of a $2.4 billion loan for two years by EXIM Bank and overall support in the form of the China-Pakistan Economic Corridor.",
  "retrievedAt": "2025-08-11T09:00:27.485Z"
}
