{
  "title": "Citizens urged to exercise caution as NDMA forecasts heavy rain, winds in next 12–24 Hours",
  "author": null,
  "content": "ISLAMABAD, Jul 23 (APP): The National Disaster Management Authority (NDMA) Wednesday advised the public to remain alert, with heavy rainfall and strong winds expected across parts of Punjab and Khyber Pakhtunkhwa over the next 12 to 24 hours.\nCitizens are strongly advised in a weather advisory to stay informed about evolving weather conditions and to strictly follow instructions issued by local authorities to ensure safety.\nAccording to a weather advisory, heavy rainfall accompanied by strong winds is expected across multiple areas of Khyber Pakhtunkhwa over the next 12 to 24 hours. Affected regions include Chitral, Dir, Swat, Kalam, Mansehra, Battagram, Abbottabad, Haripur, Swabi, Mardan, Peshawar, Charsadda, Kohat, Hangu, and their surrounding vicinities.\nIntermittent heavy rainfall is expected over the next 12 to 24 hours in Islamabad and several districts across Punjab, including Rawalpindi, Jhelum, Chakwal, Talagang, Mandi Bahauddin, Gujrat, Gujranwala, Narowal, Hafizabad, Chiniot, Lahore, Sialkot, Sargodha, Faisalabad, Kasur, Okara, Sahiwal, Pakpattan, and nearby areas, according to the latest weather advisory.\nThe latest weather advisory has cautioned that during the forecasted rain and wind spell, there is a potential risk of tree falls, power outages, damage to vulnerable structures, and traffic accidents due to reduced visibility.\nThe National Disaster Management Authority (NDMA) has urged residents in vulnerable areas to exercise caution. The public is advised to stay away from trees, billboards, and unstable structures; park vehicles in secure locations; and avoid unnecessary travel during rainfall to reduce risk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:59:05.136Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/citizens-urged-to-exercise-caution-as-ndma-forecasts-heavy-rain-winds-in-next-12-24-hours/",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T14:06:00.000Z"
}
