{
  "title": "Heavy rains, flash floods,urban flooding likely as widespread weather system grips Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jul 23 (APP): The Pakistan Meteorological Department (PMD) issued a warning for widespread rain-wind/thundershowers across the country on Wednesday, with the possibility of heavy to very heavy falls in various regions, triggering concerns over flash floods, urban flooding, and landslides.\nAccording to the latest forecast, rain-wind/thundershower is expected in Kashmir, Khyber Pakhtunkhwa, Islamabad, Punjab, Gilgit-Baltistan, and northeast Balochistan. Southern parts of the country will remain mostly hot and humid.\nThe Met Office has warned of potentially hazardous conditions tonight and throughout Wednesday. Heavy rains may generate flash floods in local streams and nullahs in Chitral, Dir, Swat, Shangla, Mansehra, Kohistan, Abbottabad, Buner, Charsadda, Nowshera, Swabi, Mardan, Murree, Galliyat, Islamabad/Rawalpindi, hill torrents of Dera Ghazi Khan, northeast Punjab, and Kashmir.\nUrban flooding is feared in low-lying areas of Islamabad, Rawalpindi, Gujranwala, Lahore, Sialkot, Sargodha, Faisalabad, Okara, Nowshera, and Peshawar due to heavy downpours. Landslides and mudslides may cause road blockages in the vulnerable hilly areas of Khyber Pakhtunkhwa, Murree, Galliyat, Kashmir, and Gilgit-Baltistan. Strong windstorms and lightning may damage weak structures such as rooftops and walls of kacha houses, electric poles, billboards, vehicles, and solar panels.\nIn Islamabad, partly cloudy weather with rain-wind/thundershower is expected, with chances of heavyfalls. In Khyber Pakhtunkhwa, rain-wind/thundershower is expected in Chitral, Dir, Swat, Kohistan, Battagram, Mansehra, Abbottabad, Buner, Shangla, Swat, Malakand, Peshawar, Nowshera, Swabi, Bajaur, Mardan, Kurram, Khyber, Orakzai, Hangu, Kohat, Bannu, Karak, Dera Ismail Khan and Waziristan. Heavyfalls are likely in the upper districts.\nIn Punjab, rain-wind/thundershower is expected in Rawalpindi, Murree, Galiyat, Chakwal, Attock, Sargodha, Khushab, Mianwali, Jhelum, Gujranwala, Gujrat, Sialkot, Narowal, Mandi Bahauddin, Hafizabad, Lahore, Sheikhupura and Shakargarh.\nIsolated rain-wind/thundershower is also likely in Kasur, Jhang, Toba Tek Singh, Multan, Khanewal, Faisalabad, Layyah, Bhakkar, Dera Ghazi Khan, Sahiwal, Kot Addu, Taunsa Sharif and surrounding areas.\nIn Sindh, mainly hot and humid weather will persist in most parts, with partly cloudy conditions and chances of light rain or drizzle in coastal areas. In Balochistan, hot and humid weather is expected in most districts, while isolated rain-wind/thundershowers are likely in Barkhan, Kohlu, Musakhel, Loralai, Zhob, Kalat, Khuzdar, Lasbella and nearby areas. In Kashmir and Gilgit-Baltistan, partly cloudy weather with rain-thundershower is expected, along with heavyfalls in some areas of Kashmir.\nDuring the past 24 hours, rain-wind/thundershower with isolated heavy falls occurred in Islamabad, Upper Punjab, Kashmir, Upper Khyber Pakhtunkhwa, Gilgit-Baltistan, and Kalat, while hot and humid conditions prevailed elsewhere.\nThe significant rainfall was recorded in various locations including Islamabad: Saidpur (101), Golra (78), Bokra (68), Zero Point (35), Airport (24).\nIn Rawalpindi, the recorded rainfall was Katcheri (85), Gawalmandi (55), Chaklala (46), Shamsabad and Pirwadhai (32), New Kattarian (27).\nNarowal received 69 mm, Murree 42 mm, Jhelum 40 mm, Mangla 31 mm, Faisalabad 12 mm, Sialkot (City 3, Airport 2), and Gujrat 1 mm. In Kashmir: Muzaffarabad Airport (79), City (71), Kotli (64), Garhi Dupatta (38), Rawalakot (13). In Khyber Pakhtunkhwa: Balakot (47), Takht Bai (37), Saidu Sharif (34), Kakul (28), Malam Jabba (18), Dir Lower (19), Upper (4), Pattan (2). Kalat in Balochistan recorded 28 mm. In Gilgit-Baltistan, Gilgit received 1 mm.\nThe highest maximum temperatures recorded today were 46 C in Nokkundi, 45 C in Dalbandin, and 44 C in Dadu.\nThe authorities have urged the public to remain alert and avoid unnecessary travel in vulnerable areas.\nRescue and emergency services are on high alert, and citizens are advised to follow official guidelines during the forecast period.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:57:57.869Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/heavy-rains-flash-floodsurban-flooding-likely-as-widespread-weather-system-grips-pakistan/",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T18:09:00.000Z"
}
