{
  "title": "Egypt envoy proposes, Pak- Egyptian bilateral PTA",
  "author": null,
  "content": "ISLAMABAD, Jul 23 (APP): Dr. Ihab Mohamed Abdelhamid Hassa, Ambassador of Egypt to Pakistan on Wednesday proposed the establishment of a Preferential Trade Agreement (PTA) between Pakistan and Egypt to facilitate smoother trade relations.\nRana Ihsaan Afzal Khan, Coordinator to the Prime Minister on Commerce, held a meeting with the Ambassador of Egypt to discuss avenues for enhancing bilateral trade between Pakistan and Egypt, said a press release issued here on Wednesday.\nThe Ambassador observed that despite the two countries collectively representing a significant share of the global Muslim population, the existing trade volume remained low.\nHe emphasized the need to strengthen trade relations and apprised that he had already met with chairmen of various chambers of commerce in Pakistan to explore possible collaborations.\nTo institutionalize cooperation, the Ambassador recommended signing a Memorandum of Understanding (MoU) between the Federation of Pakistan Chambers of Commerce and Industry (FPCCI) and its Egyptian counterpart, as well as the formation of an Egypt-Pakistan Business Council focusing on sectors including spices, pharmaceuticals, surgical instruments, and food products.\nThe Ambassador recommended signing a Memorandum of Understanding between Pakistan Ministry of Commerce and its Egyptian counterpart, along with the formation of an Egypt-Pakistan Business Council focusing on key sectors including spices, pharmaceuticals, surgical instruments and food products.\nThe Coordinator to the Prime Minister on Commerce assured that the Ministry of Commerce would extend full support for these initiatives and facilitate measures aimed at enhancing trade linkages between the two countries.\nThe meeting reaffirmed the Ministry of Commerce’s commitment to fostering stronger trade relations with Egypt and underscored its resolve to create an enabling environment for exporters and investors.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:59:17.775Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/egypt-envoy-proposes-pak-egyptian-bilateral-pta/",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T13:04:00.000Z"
}
