{
  "title": "Every person should get basic know-how of first aid, CPR to save lives: President",
  "link": "https://www.app.com.pk/national/every-person-should-get-basic-know-how-of-first-aid-cpr-to-save-lives-president/",
  "date_published": "2023-10-25T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): President Dr Arif Alvi on Wednesday said every person needs to get basic knowledge about first aid and CPR (cardiopulmonary resuscitation) to cope with situations in medical emergencies, thus saving lives.\nAddressing the 12th All Pakistan Camp of Pakistan Girl Guides Association (PGGA) here at its National Headquarters, he said emergency aid on disaster management, first aid, and CPR could increase the survival rate of a person.\nThe president stressed that the message of the emergency response plan, which was an integral part of girl guiding, needed to be spread at the levels of schools and colleges.\nPresident Alvi said by being able to provide basic aid, one could stabilize a patient or injured person in case of accidents, earthquakes, or other medical emergencies such as cardiac arrest, until the medical services arrive.\nHe lauded the vision of the girl guides for positively contributing to society by being ready to offer help to others.\nHe advised them to also play their role in creating awareness among communities on breast cancer, mainstreaming persons with disabilities, environmental protection, and physical and mental well-being.\nHe expressed satisfaction that the Pakistan Girl Guides Association was focusing on the character-building of girls to become useful members of society. However, he pointed out that the number of 140,000 girl guides across the country needed to be increased to expand its scope.\nTerming women as a strong anchor in a family stressed that educated and healthy women not only raised good generations but also played a vital role in the progress of the country.\nHe called upon the girl guides to also attain financial empowerment and mentioned that information technology had opened doors of opportunities to earn money through online businesses.\nHe mentioned that the Chief Guide of PGGA, Begum Samina Alvi who remained active in championing women’s empowerment could not attend the event due to her twice knee-replacement surgery.\nNational Commissioner Pakistan Girl Guides Association Maria Maud Sabri said the Girl Guide programme laid stress on community development projects by giving girls the opportunity to learn about health, nutrition, environment, and economic empowerment through different practical activities.\nThe volunteer movement, she said, was started in 1947 on the desire of the country’s founder Quaid-e-Azam Muhammad Ali Jinnah with his sister Fatima Jinnah as its patron.\nShe mentioned that seven branches of PGGA in four provinces besides others in AJK, GB, and ICT were functioning actively.\nAround 265 girl guides from the four provinces of the country, Islamabad, Azad Jammu and Kashmir, and Gilgit-Baltistan along with senior guides attended the event.",
  "retrievedAt": "2025-08-11T10:14:36.563Z"
}
