{
  "title": "IIOJ&K reels under ‘forced silence’ after India’s controversial actions of August 5",
  "link": "https://www.app.com.pk/national/iiojk-reels-under-forced-silence-after-indias-controversial-actions-of-august-5/",
  "date_published": "2023-10-25T08:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Miseries of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJ&K) have exacerbated manifold due to the unprecedented ferocity of the fascist Indian government especially after the revocation of Kashmir’s special status on August 5, 2019.\nThis relentless suppression and its grave consequences have unfolded largely under an unnoticed ‘forced silence,’ painting a grim picture of the ongoing turmoil in the territory, which India invaded on October 27, 1947.\n“Forced silence, a neglected dimension of the post-August 2019 developments, is the biggest danger Kashmiris have been facing right now,” according a latest report released by the Kashmir Institute of International Relations (KIIR).\nWhile the indigenous population continued to live under heavy surveillance, it reported that phone-cracking tools and techniques used by India’s law enforcers were increasingly raising privacy concerns.\n“Cell phones are being taped by the agencies and every individual’s actions and activities are being monitored. The majority of Kashmiris are smeared and censored as “rabid fanatics” by the Hindu supremacist regime that takes pride and derives pleasure in caging, humiliating and torturing Kashmiris.”\nThe report revealed that people were not allowed to express themselves, besides journalists, civil society activists and even ordinary netizens were taken to custody for merely expressing their opinions on social media.\nIt added the mainstream media, which had been denied editorial voices, was not allowed to report facts on ground.\n“A fake narrative is being promoted under the supervision of government vigilantes who continue to monitor the media. Under this censorship regime, ordinary citizens’ Twitter, Facebook and Instagram accounts are being persistently censored by the government since August 2019 to ensure that there is no voice contrary to its claims.”\nIn a further escalation of war on Kashmiri dissent, the report said Indian authorities suspended the passports of up to 200 Kashmiris, including students, lawyers and journalists. “Those targeted received notices that their passports had been “impounded” allegedly because they were deemed a “national security threat.”\nOn the other hand, it said a huge number of Kashmiri detainees who were arrested before and after August 2019 continued to languish in jails thousands of miles away from their homes. “The top tier leadership of All Parties Hurriyat Conference (APHC) along with prominent human rights defenders of the region, civil society activists and even journalists were booked under the Public Safety Act, UAPA, and other draconian laws.\nThis witch-hunt against the Kashmiris and massive crackdown on voices critical of the Indian state and its military had prompted sixteen human rights organizations of international repute to call on Indian authorities to immediately end reprisals against the civil society activists and human rights defenders in Kashmir.",
  "retrievedAt": "2025-08-11T10:14:38.182Z"
}
