{
  "title": "Pakistan has great potentials in solar, wind energy: Muhammad Ali",
  "link": "https://www.app.com.pk/national/pakistan-has-great-potentials-in-solar-wind-energy-muhammad-ali/",
  "date_published": "2023-10-25T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):Caretaker Minister for Energy Muhammad Ali on Wednesday said that Pakistan had a great potential in solar and wind energy that could reap further benefits.\nAddressing an  event of “40 Years of Friendship-Past, Present and Future between Republic of Korea and Pakistan” as chief guest here, he said Pakistan was going towards digital metering and transmission sector was going through major revamp to attract tremendous investments in the future.\n“Pakistan is offering a great opportunity in exploration front and will be looking at gas pipelines and storage facilities,” he said.\nHe mentioned that exploration in Pakistan could be a keen interest of Korea.\nHe expressed his gratitude to the Embassy of Republic of Korea and the Institute of Strategic Studies Islamabad (ISSI).\nThe minister said that the remarkable journey of diplomatic collaboration between the two countries that was formally established on November 7, 1983 had touched every facet of the society.\nHe highlighted the key projects in the energy sector done with the collaboration of South Korea.\nMuhammad Ali said that 215 MW Asrit-Kedam Hydropower Project on the Swat River in Khyber Pakhtunkhwa (KPK) expected to be commissioned in 2028, was being developed by the Korea South-East Power.\nFurther appreciating the collaboration in energy sector, he highlighted the establishment of Mira Power Limited, a subsidiary of Korea Energy (KOEN), to oversee the design, construction, operation and maintenance of 102MW Gulpur Hydropower plant.\nHe said the partnership between the two countries was beyond diplomacy as in 2019 South Korea signed a framework agreement with Pakistan to provide $500 million in Economic Development Cooperation Fund loans for infrastructure development.\nThe minister said that around 30 Korean companies were currently operating in Pakistan and participating in human, financial and infrastructure development.\nIn education sector, he appreciated the Memorandum of Understanding (MoU) signed in 2022 between Duksung Women University in Seoul, South Korea and the University of Agriculture Faisalabad.\nHe said that he looked forward to the future collaboration in sustainable energy solutions, research, innovation, and human resource development.\nThe minister said that the 40 years of relations were only the beginning of what future hold and he looked forward to new initiatives on the horizon and a commitment to more sustainable solutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:14:45.770Z"
}
