{
  "article_id": "2025-05-19_c86edaa556fc7e9862f91b5737870d91",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/maulana-fazlur-rehman-urges-national-unity/",
    "retrieved_at": "2025-08-27T15:36:58.913Z"
  },
  "metadata": {
    "title": "Maulana Fazlur Rehman urges national unity",
    "author": null,
    "date_published": "2025-05-19T17:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 246,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 19 (APP): Chief of Jamiat Ulema-i-Islam (JUI-F), Maulana Fazlur Rehman on Monday called for unity and vigilance in the face of ongoing tensions with India, while lauding the Pakistan Armed Forces for their effective response to recent provocations. Speaking on the floor of the National Assembly, he cautioned that India, under internal and external pressure, may resort to further provocations. \"India's government has lost credibility both at home and abroad. Indian Prime Minister Narendra Modi is increasingly isolated, while the Indian public, opposition, and minorities are distancing themselves from his government,\" he added. Highlighting Pakistan's time-tested relationship with China, the JUI-F chief said the two countries have shared 77 years of strong diplomatic, economic, and now defense ties. \"Our friendship with China has moved beyond diplomacy-it now includes strategic defense cooperation, especially at a time when Western powers, including Israel, are supporting India with advanced technology,\" he added. He said that despite India's reliance on Western defense systems, the results have been underwhelming. \"Their own parliamentarians are questioning their defense capabilities. In contrast, Pakistan's alliance with China has proven effective, neutralizing Indian aggression.\" He said, \"Without any investigation, India shifted the blame for its internal security lapses onto Pakistan, launching attacks near our border and even targeting religious institutions, including mosques and innocent people,\" he said. Calling for responsible political discourse, he said that while criticism of government policies is part of democratic practice, the current regional situation demands unity and a strategic approach.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}