{
  "article_id": "2025-05-19_940cbb7b7a5a686464d1e98656f1f9f5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/exhibition-moment-in-time-concludes-with-resounding-success-at-pnca/",
    "retrieved_at": "2025-08-27T15:36:58.906Z"
  },
  "metadata": {
    "title": "Exhibition “Moment in Time” concludes with resounding success at PNCA",
    "author": null,
    "date_published": "2025-05-19T17:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 449,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 19 (APP): The Pakistan National Council of the Arts (PNCA), in collaboration with ForArtSake, concluded the powerful art exhibition \"A Moment in Time\" to great acclaim, drawing art lovers, critics, and students into a compelling visual narrative that captured emotion, history, and the human experience. The exhibition brought together three of Pakistan's most distinguished artists: Jimmy Engineer, Amna Ismail Pataudi, and Dr. Rahat Naveed Masud. Curated by Amna I. Pataudi and Dr. Rahat Naveed Masud, the exhibition presented a rich tapestry of personal and collective memory. Each artist, with their unique voice and vision, contributed works that stirred profound emotional responses and initiated thoughtful dialogue. Renowned artist and social worker Jimmy Engineer exhibited pieces from his celebrated Partition series, evoking deep reflections on historical trauma and its echoes in contemporary times. His canvases, layered with emotion and detail, offered a sobering reminder of resilience amid adversity. Amna Ismail Pataudi showcased hauntingly beautiful works that merged empathy with technical brilliance. Her paintings captured the heart-wrenching tragedy of the Army Public School attack, the humanitarian crisis in Gaza, and the suffering in Indian Illegally occupied Jammu and Kashmir. Her landscapes and portraits conveyed a sense of quiet strength and deep compassion. Dr. Rahat Naveed Masud's section featured a rare collection of self-portraits - an area she has explored more extensively than any other artist in Pakistan. Each painting represented a fragment of her life, rendered with subtlety and emotional clarity. Her work invited viewers to reflect on identity, time, and the intimate journey of self-exploration. The exhibition was inaugurated by distinguished guests Mr. Jamal Shah and Mr. Uxi Mufti, who praised the artists and curators for their ability to communicate complex social realities through art. Mr. Shah noted that the exhibition brought together diverse artistic perspectives that sparked meaningful conversations, while Mr. Mufti commended the vivid use of colour and the timely relevance of the artworks. The exhibition attracted a wide spectrum of visitors, including students from Fatima Jinnah Women University, art collectors, cultural commentators, and members of the general public. Audiences engaged deeply with the artists and their work, voicing appreciation for the opportunity to experience such a meaningful artistic dialogue. Director General PNCA, M. Ayoub Jamali, expressed his gratitude to the artists and reaffirmed PNCA's commitment to supporting creative collaborations. \"ForArtSake has been a trusted partner, and we welcome future projects that continue to push the boundaries of artistic expression,\" he said. The artists' presence and their engaging discussions added another layer of depth to the exhibition, allowing visitors to connect with the creative process behind the works. \"A Moment in Time\" resonated far beyond the gallery walls, creating a lasting impression on all who experienced it.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}