{
  "article_id": "2025-05-19_bb7b7b93407b5a5807e36b8b9633b7e1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-dar-arrives-in-beijing-on-3-day-official-visit/",
    "retrieved_at": "2025-08-27T15:38:15.733Z"
  },
  "metadata": {
    "title": "DPM Dar arrives in Beijing on 3-day official visit",
    "author": null,
    "date_published": "2025-05-19T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 231,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "BEIJING, May 19 (APP): Deputy Prime Minister/Foreign Minister (DPM/FM), Senator Mohammad Ishaq Dar on Monday arrived in Beijing on a three-day official visit from May 19-21. He was received at the airport by senior Chinese officials and Ambassador of Pakistan to China, Khalil Hashmi, a DPM Office's news release said. In Beijing, Ishaq Dar will hold comprehensive discussions with Chinese Foreign Minister Wang Yi, and other senior Chinese leaders, including key members of Chinese Communist Party, according to a Foreign Office press release. The meetings will focus on current regional developments and multiple dimensions of Pakistan-China relations. The visit is a part of high-level exchanges between Pakistan and China, and a reaffirmation of the All-Weather Strategic Cooperative Partnership between the two brotherly countries. Prior to his departure, DPM Dar told the media that China was a major trading partner of Pakistan and that both countries enjoyed an iron-clad close relationship. He said that during the last three weeks, he had two telephonic interactions with FM Wang Yi, who had also invited him to visit China. Dar said that his meetings with the Chinese leadership would mark discussions on political, local, regional and global issues, besides recent tensions between Pakistan and India. To a question, he referred to his telephonic interactions with many counterparts worldwide, saying that Pakistan had already exposed the Indian blame-game against Pakistan, including attack on any nuclear installation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}