{
  "article_id": "2025-05-19_be0aed83ab0084713684fd1b846d65ef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-participates-in-78th-world-health-assembly/",
    "retrieved_at": "2025-08-27T15:38:16.964Z"
  },
  "metadata": {
    "title": "Pakistan participates in 78th World Health Assembly",
    "author": null,
    "date_published": "2025-05-19T14:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 19 (APP): Pakistan is actively participating in the 78th World Health Assembly currently being held in Geneva, where global health leaders have gathered. The world leaders will deliberate on pressing issues such as pandemic preparedness, universal health coverage, and the increasing burden of non-communicable diseases. Federal Minister for Health, Syed Mustafa Kamal, is leading the Pakistani delegation at this high-level international forum. He is scheduled to address the Assembly, where he will highlight Pakistanas achievements in the health sector, share ongoing challenges, and present the countryas roadmap for future progressaparticularly emphasizing efforts to eradicate polio. In his upcoming address, Minister Kamal will outline the initiatives Pakistan has undertaken to strengthen its healthcare system and improve its capacity for disease prevention and response. He is also expected to call for continued international collaboration and technical assistance, stressing their importance in achieving better health outcomes for Pakistanas population. A spokesperson of the Ministry of Health affirmed Pakistanas commitment to working closely with international partners to support global health objectives and promote health equity. The World Health Assembly is the decision-making body of the World Health Organization and is attended by delegations from all WHO member states.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}