{
  "article_id": "2025-05-19_b1dbacf91853bdb029946f089ab0b24c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-denounces-indian-medias-false-claims-of-shaheen-missile-use-in-operation-bunyanum-marsoos/",
    "retrieved_at": "2025-08-27T15:38:43.503Z"
  },
  "metadata": {
    "title": "Pakistan denounces Indian media’s false claims of Shaheen Missile use in Operation Bunyanum Marsoos",
    "author": null,
    "date_published": "2025-05-19T11:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 330,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 19 (APP): The Ministry of Foreign Affairs on Monday categorically rejected baseless and misleading claims, propagated by segments of Indian media, alleging use of Pakistan's Shaheen missile during Operation Bunyanum Marsoos (BM). In an official statement, Foreign Office Spokesperson Shafqat Ali Khan condemned the allegations as \"unfounded\" and part of a broader campaign of disinformation. He noted that the claims gained traction after Indian Army's official Twitter account shared a video purporting to show Pakistan's use of Shaheen missile - an assertion that was quickly debunked and led to the post being deleted. However, by then, various Indian media outlets had already circulated the narrative without verification, he added. \"The Indian Army has offered no clarification or retraction following the removal of its erroneous post. This silence raises serious questions about the credibility and intent behind such disinformation,\" he remarked. He said that spread of such false narratives, apparently aimed at distracting from India's setbacks in Operation Sindoor and from Pakistan's conventional military successes. \"Rather than acknowledging the ground realities, India seems intent on manufacturing stories to deflect attention and mislead public and international observers,\" the spokesperson said. He further highlighted that detailed information on the weaponry used by Pakistan in Operation BM was publicly released in the Inter-Services Public Relations (ISPR) statement on 12 May 2025. According to the ISPR, the Pakistan Armed Forces deployed precision-guided Fatah series missiles (F1 and F2), advanced long-range loitering munitions, and highly accurate long-range artillery - none of which included Shaheen missile. \"These details are available in the public domain, and any credible analysis should reference them, rather than rely on speculative and inflammatory reports,\" he said. Calling for responsible journalism and institutional accountability, he warned that the dissemination of unverified and provocative content endangered regional peace and reflected poorly on the professionalism of state institutions. The Ministry reiterated Pakistan's commitment to regional stability and transparency while urging the Indian side to refrain from narratives that undermined dialogue and mutual trust.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}