{
  "title": "Centers of Excellence to be established at National Skills University, PITHM: Madad Ali Sindhi",
  "link": "https://www.app.com.pk/national/centers-of-excellence-to-be-established-at-national-skills-university-pithm-madad-ali-sindhi/",
  "date_published": "2023-10-31T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 31 (APP): Federal Education and Professional Training Madad Ali Sindhi on Tuesday announced the establishment of Centers of Excellence at National Skills University and Pakistan Institute of Tourism and Hotel Management (PITHM) with the support of Finland.\nThe minister was speaking with the Ambassador of Finland to Pakistan Hannu Ripatti, along with a delegation, in a meeting held here.\nMadad Ali Sindhi welcomed the delegation and said that the exchange of expertise and knowledge regarding Vocational and Technical Training between the two countries can upgrade existing institutions in Pakistan.\nThe minister and the ambassador agreed in principle to establish a center of excellence at National Skills University which will focus on the Hotel and Restaurant Industry in addition with Construction, IT, Teachers Training and Engineering Studies with the help of the Turku Municipality of Finland.\nSimilarly, a centre of excellence will be established at the Pakistan Institute of Tourism and Hotel Management in collaboration with the Turku Municipality of Finland.\nThe minister said that in the field of Non-Formal Education, National Skills University (NSU), Islamabad is providing Technical Skills to the Pakistani youth, which can be enhanced to be a Skill Learning Centre for current and aspiring Pakistani youth to work abroad.\nThe Ambassador of Finland to Pakistan, Hannu Ripatti informed the minister about the ongoing collaboration between the government of Finland and Pakistan and stated that they are already providing vocational training at NUTECH and NUST.\nThe ambassador told the minister that two Finnish universities are already providing technical and human expertise to these institutions. He informed the minister that approximately 500 people were already under training.\nHe informed the minister that with the help of the government of Finland NUTECH has already expanded its one-year diploma course to 3-year course in the field of hotel and restaurant management.\nMadad Ali Sindhi praised the literacy rate of Finland and the high quality of education that their public sector provides to its entire population.\nMadad Ali Sindhi raised the pressing concern of Out of out-of-school children in Pakistan.\nHe said that it is of utmost importance and that it is one of the biggest challenges that Pakistan faces today.\nThe Ambassador of Finland shared the experience of Finland and apprised the minister about the policies adopted by the government of Finland to overcome these problems.\nBoth dignitaries agreed to work together on enhancing cooperation in the field of education.\nMadad Ali Sindhi said that our goal is to lay the foundation in such a way that it can push future governments to perform at the same level of commitment and devotion to serve the people of our country.",
  "retrievedAt": "2025-08-11T10:19:12.839Z"
}
