{
  "title": "Entire Pakistani nation stands united on Palestine issue: Solangi",
  "link": "https://www.app.com.pk/national/entire-pakistani-nation-stands-united-on-palestine-issue-solangi/",
  "date_published": "2023-10-31T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 31 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Tuesday said that the entire Pakistani nation stood united on the issue of Palestine.\n“There is no division on this (Palestine) issue. From Senator Mushtaq Ahmed to Senator Mushahid Hussain Sayed, we all are united. Let me reiterate here that the winding up speech will be made by the foreign minister or any other minister assigned by the prime minister,” he said while taking part in the debate on Palestine issue in the Senate.\nThe minister said the Upper House of Parliament, with its honourable members including Senator Raza Rabbani who had drafted the landmark 18th Constitutional Amendment, had raised its voice in favour of Palestine and its people.\nSince the establishment of Pakistan, its every head of state and government – from Quaid-e-Azam Muhammad Ali Jinnah to the incumbent Caretaker Prime Minister Anwaar-ul-Haq Kakar – had expressed solidarity with the Palestinian people, he added.\nSolangi recalled that at the age of 22, he was for the first time arrested for standing up and collecting donations for Palestinian brethren after the massacre of Palestinian women and children in Lebanon by Israel.\nThe minister said the Pakistani nation had unshakable faith that the struggle and voice of the Palestinian people could never be suppressed.\nHe said PM Kakar had telephoned Palestinian President Mahmood Abbas to express solidarity with the people of Palestine.\nHe said the speech of Pakistan’s Permanent Representative to the United Nations, Munir Akram, had perturbed the Zionists. Pakistan had always raised its voice for the right of self-determination of the people of Palestine and would continue to do so, he vowed.\nPakistan firmly stood by its principled stance regarding the independence of Palestine, he said.\nSolangi said Pakistan was among few countries which did not have diplomatic relations with Israel. “ Even we have diplomatic relations with the countries, we fought wars with but not with Israel.”",
  "retrievedAt": "2025-08-11T10:19:11.360Z"
}
