{
  "title": "Asian Taekwondo Open C’ship kicks off from Wednesday",
  "link": "https://www.app.com.pk/national/asian-taekwondo-open-cship-kicks-off-from-wednesday/",
  "date_published": "2023-10-31T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 31 (APP):The Combaxx 5th Asian Taekwondo Open Championship for Senior Poomsae and Kyurogi is all set to commence at the Pakistan Sports Complex on November 1.\nThis prestigious event, organized by the Pakistan Taekwondo Federation (PTF), will run until November 5, featuring the participation of 27 countries vying for the coveted top honors.\nA remarkable 27 countries, in addition to 26 regional and provisional teams, have registered to compete in this mega event, underscoring the global significance of this championship.\nThe PTF had the privilege of hosting four Asian Taekwondo Union Courses from October 27 to 31, held at Hamidi and Rodham Halls.\nThis event marks a historic moment for Pakistan, as it welcomes the first-ever participation of Prof. Kyu Seok Lee, President of the Asian Taekwondo Union (ATU), in the country’s taekwondo history. The opening ceremony is scheduled for November 2, with the grand closing ceremony set to take place on November 5.\nTop taekwondo athletes from around the world will showcase their skills in the senior category competitions of Kyorugi and Poomsae at the Liaquat Gymnasium. It’s worth mentioning that the PTF also successfully organized the 4th Asian Open in Pakistan last year, contributing to the promotion of a positive image of Pakistan through sports.\nThe participation of 27 countries, including Afghanistan, Bahrain, Brazil, Egypt, Germany, Great Britain, Indonesia, Iran, Iraq, Jordan, Kazakhstan, Kuwait, Luxembourg, Montenegro, Nepal, Netherlands, Oman, Palestine, Republic of Korea, Saudi Arabia, Serbia, Türkiye, UAE, Uzbekistan, and The Humanitarian Foundation (THF), promises to make this extravaganza a spectacular showcase of taekwondo excellence and global unity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:19:39.739Z"
}
