{
  "title": "Pakistan, Bangladesh team up to boost cricket, umpiring and youth development",
  "author": null,
  "content": "ISLAMABAD, Jul 24 (APP): Interior Minister and PCB Chairman Mohsin Naqvi met with Bangladesh’s Minister for Youth and Sports, Local Government and Rural Development, Asif Mahmood, in Dhaka on Thursday for a friendly and forward-looking discussion. The two leaders talked about working together to promote cricket, train umpires and create more opportunities for young people in both countries.\nThe talks resulted in a broad agreement to strengthen bilateral cooperation in sports—particularly cricket—and the development of umpiring and youth engagement programs.\nDuring the meeting, the two sides agreed to sign a formal memorandum of understanding between the PCB and the Bangladesh Cricket Board (BCB) to promote cricket and institutionalize training programs. Minister Naqvi invited Bangladeshi umpires to Pakistan for professional training, underscoring Pakistan’s willingness to share technical expertise and resources for regional sporting development.\nA special focus was placed on enhancing women’s cricket, with both ministers agreeing to develop joint initiatives aimed at nurturing female athletes across both countries.\nIn addition to sports, the agenda extended to youth skill-building, employment generation, and educational cooperation. Discussions included scholarship opportunities, higher education exchange programs, and experience-sharing in educational reforms. The ministers also explored collaboration in renewable energy—particularly solar energy innovation—marking a growing interest in sustainable technology exchanges.\nMinister Naqvi also introduced Pakistan’s secure identity infrastructure, highlighting the success and technological advancement of NADRA (National Database and Registration Authority). Minister Mahmood expressed strong interest in Pakistan’s identity management systems and welcomed an invitation for a Bangladeshi delegation to visit NADRA. A high-level Bangladeshi delegation is expected to visit Pakistan in the near future to pursue this collaboration further.\nEmphasizing the demographic parallels between the two nations, Minister Naqvi stated that youth make up the majority of both populations. “By investing in sports, skills, and education, we can create lasting opportunities for our young people,” he said.\nThe meeting signaled a shared commitment to deepening multifaceted ties between Pakistan and Bangladesh, particularly in sports diplomacy and youth development.\nAlso present at the meeting were Secretary of Bangladesh’s Ministry of Youth and Sports, Mahboob Alam; Secretary for Local Government, Rezaul Maqsood; Charge d’Affaires of the Pakistani High Commission, Muhammad Wasif; Pakistan cricket team’s Head Coach Mike Hesson; Team Manager Naveed Akram Cheema; and senior officials from both sides.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:03:08.320Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-bangladesh-team-up-to-boost-cricket-umpiring-and-youth-development/",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T10:07:00.000Z"
}
