{
  "title": "Pakistan, Indonesia pledge stronger cultural and heritage ties amid deepening bilateral friendship",
  "author": null,
  "content": "ISLAMABAD, Jul 24 (APP):In a significant step towards deepening cultural cooperation, Pakistan and Indonesia have reaffirmed their resolve to strengthen bilateral ties through heritage preservation, cultural diplomacy, and people-to-people exchanges.\nThe commitment came during a meeting between Mr. Rahmat Hindiarta, Minister Counsellor for Public Diplomacy at the Indonesian Embassy, and Federal Minister for National Heritage and Culture Division, Aurangzeb Khan Khichi, where both sides celebrated their shared civilizational legacy and explored new avenues of collaboration rooted in spiritual and historical commonalities.\nDuring the meeting, both sides underscored the time-honored relationship between the two nations, built on mutual respect, shared values, and a rich cultural past.\nA key focus was placed on collaborative efforts to preserve ancient Buddhist sites — a historical and spiritual link connecting both countries.\nMr. Rahmat highlighted Indonesia’s deeply rooted Buddhist heritage, particularly in regions like Bali, which are renowned for their ancient temples and cultural continuity. Reflecting on his travels to Punjab and Sindh, he expressed admiration for the hospitality and openness of the Pakistani people, particularly their reverence for Sufi traditions.\n“The message of love and harmony I encountered at Sufi shrines resonates with our own cultural and spiritual values,” he said.\nHe also praised Multani mangoes for their exceptional flavor, calling them “a true treasure of taste.”\nHe emphasized the importance of enhanced people-to-people ties and proposed cultural collaborations through joint festivals, tourism, and institutional linkages.\nCultural diplomacy, he stressed, must progress alongside economic cooperation to benefit future generations.\nThe Federal Minister for National Heritage and Culture warmly welcomed the suggestions and recalled Indonesia’s unwavering support for Pakistan during the 1965 war with India.\nHe described Indonesia as a brotherly Muslim nation with which Pakistan shares deep spiritual, cultural, and historical ties.\nHe announced the establishment of a Buddha Heritage Centre in Islamabad aimed at showcasing Pakistan’s ancient Buddhist legacy and promoting religious tourism.\nHe also shared that measures are being taken to simplify visa procedures to facilitate visits by international scholars and pilgrims.\nProposing collaborative visits to key heritage sites such as Taxila, Takht Bahi, and Shah Allah Ditta, the Federal Minister noted their strong civilizational links with Indonesia’s Buddhist past.\nHe also mentioned that Pakistan has signed cultural Memorandums of Understanding (MoUs) with around 90 countries and expressed readiness to begin a similar framework with Indonesia.\nBoth sides agreed to initiate work on new MoUs focused on cultural exchange, joint heritage preservation, and institutional cooperation.\nAn invitation was extended to the Indonesian Embassy to participate in the upcoming Lok Virsa Folk Festival in November.\nThe Federal Minister encouraged Indonesia to showcase its traditional music, dance, and crafts, and offered the use of the Pakistan National Council of the Arts (PNCA) as a platform for Indonesian artists and performers.\nIn response to a request for increased tourism collaboration, the Federal Minister assured full support in facilitating travel and exploration of Pakistan’s Buddhist heritage by Indonesian tourists and scholars. It was also agreed to designate focal persons from both sides to collect and archive rare photographs and documents that reflect the longstanding cultural ties between the two nations.\nHe appreciated the Indonesian Embassy’s initiative to establish an “Indonesian Corner” at the National Library of Pakistan, calling it a meaningful step toward fostering greater cultural understanding.\nConcluding the meeting, the Federal Minister reiterated Pakistan’s commitment to protecting the cultural and religious heritage of all communities and emphasized that minorities enjoy equal rights and constitutional protection.\nHe expressed confidence that under the current leadership, Pakistan is moving toward greater cultural openness, stability, and development.\nThe meeting concluded with the exchange of cultural books and traditional gifts as tokens of friendship. Also present on the occasion was Mr. Usman Shah, CEO of Niftysphere Institute of Arts and Design, who expressed his support for future creative collaborations between artists from both countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:03:36.298Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-indonesia-pledge-stronger-cultural-and-heritage-ties-amid-deepening-bilateral-friendship/",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T09:54:00.000Z"
}
