{
  "title": "Excise deptt cracks down: 158 vehicles fines over Rs 9.5 mln",
  "author": null,
  "content": "ISLAMABAD, Jul 24 (APP):The Excise and Taxation Department of Islamabad has stepped up its drive against tinted windows, unauthorized number plates, and unregistered vehicles, aiming to enforce road safety and vehicle compliance across the Federal Capital.\nTalking to APP, Director Excise, Bilal Azam said that as many as five checkpoints were set up across Islamabad where teams conducted inspections throughout the day.\nHe said that the operations were carried out in key areas including Zero Point, Faizabad, F-7, F-6, and G-14. A total of 158 vehicles were fined for violations. These included the use of tinted windows and non-standard number plates.\nBilal Azam said heavy fines were imposed, and Rs 904,000 was collected in token tax recovery during the operations. Vehicles with decorative or colored glass and fancy plates had their registrations suspended on the spot. These registrations will only be restored once the vehicle owners remove the tinted windows or unauthorized plates and pay the applicable fines.\nHe warned that the vehicles found using colored glass or plates that do not comply with the prescribed format of the Excise Department will not be allowed to operate on the roads until they meet all legal requirements.\nBilal Azam, Director Excise Islamabad, appealed to residents of the capital to deposit their token taxes on time and remove any non-compliant number plates. He urged citizens to use only department-approved number plates to avoid penalties and legal action.\nThe director also stated that the enforcement operation is being carried out on a daily basis and will continue without interruption.\nThe ongoing drive reflects the department’s efforts to ensure that all vehicles in Islamabad meet legal standards for registration, identification, and roadworthiness.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:03:44.170Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/excise-deptt-cracks-down-158-vehicles-fines-over-rs-9-5-mln/",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T09:33:00.000Z"
}
