{
  "title": "Pakistan require special financial assistance to cope with climate change: PM",
  "author": null,
  "content": "ISLAMABAD, Apr 22 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday emphasized that Pakistan and other countries affected by the climate change, require special financial assistance from international financial institutions to address the challenges posed by climate change.\nTalking to Secretary General International Trade Union Confederation (ITUC) Luc Triangle here at the PM House, the prime minister said that Pakistan was among the countries most affected by the climate change. “The 2022 floods alone caused losses amounting to $30 billion.”\nHe noted that due to these climate-related challenges, workers and laborers in Pakistan had faced significant employment difficulties and suffered losses.\nHe said the government was ensuring that efforts for climate adaptation and mitigation in vulnerable communities also protect the livelihoods of economically disadvantaged groups.\nThe prime minister appreciated the efforts of the International Trade Union Confederation for advocating workers’ rights at global level.\nHe emphasized that Pakistan, in collaboration with the International Labour Organization, was working towards the protection of the rights of laborers and workers.\nThe government is expanding the scope of Employees Old-Age Benefit and Worker Welfare Fund so that maximum number of employees and workers can benefit from them, the prime minister remarked.\nFurthermore, the prime minister pointed out that the National Vocational Technical Training Commission at the federal level and Vocational Training Institute at the provincial level, were organizing several training programme to equip the youth with the market relevant skills.\nThe ITUC Secretary General Luc Triangle commended Pakistan’s commitment to democratic values and appreciated the measures taken to improve the welfare of workers and laborers in the country.\nThe meeting was also attended by ITUC Regional Secretary General Shoya Yoshida, federal ministers Azam Nazeer Tarar, Ahad Khan Cheema, Chaudhry Salik Hussain, Minister of State Aun Chaudhry, Special Assistant Tariq Fatemi, and other senior officials.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:46:49.720Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-require-special-financial-assistance-to-cope-with-climate-change-pm/",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T07:12:00.000Z"
}
