{
  "title": "Pakistan committed to religious freedom, minority rights; says minister at Holi celebration",
  "author": null,
  "content": "ISLAMABAD, Apr 22 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Tuesday reaffirmed Pakistan’s commitment to religious freedom and minority rights.\nAddressing a ceremony celebrating the Hindu festival of Holi at the National Library of Pakistan, Sardar Yousaf said the Ministry of Religious Affairs and Interfaith Harmony celebrates various religious festivals every year to promote unity among diverse communities.\n“The Constitution of Pakistan guarantees religious freedom to followers of all faiths,” he stated, emphasizing that Quaid-e-Azam Muhammad Ali Jinnah ensured minority rights by including the white color in Pakistan’s national flag.\nHighlighting the spirit of togetherness, he added, “We are all Pakistanis and equally share each other’s joys and sorrows.” Stressing that all religions advocate for humanity, Sardar Yousaf mentioned that such celebrations were endorsed by former Prime Minister Muhammad Nawaz Sharif to foster harmony.\nHe said Prime Minister Muhammad Shehbaz Sharif has directed the celebration of religious festivals of all communities with due respect. “Seats have been reserved for non-Muslim communities in the Senate, National Assembly, and Provincial Assemblies, and they can also contest general elections,” he noted.\nThe minister underscored that protecting the rights of all Pakistani citizens is a national responsibility. He highlighted that minority students are awarded scholarships, and funds are allocated for their education and health. Furthermore, a five percent quota has been reserved for minorities in government jobs, he added.\nCalling for peace and tolerance in society, Sardar Yousaf stressed that religious harmony is essential for national unity. “The Shehbaz Sharif government has conveyed a clear message that the world must stand against injustice wherever it occurs,” he remarked.\n“Religion teaches humanity and tolerance,” he said, urging everyone to contribute to creating a society where all citizens live in happiness. He also announced that the ministry would soon celebrate Easter and Nowruz festivals as part of its interfaith initiatives.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:44:46.037Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-religious-freedom-minority-rights-says-minister-at-holi-celebration/",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T17:45:00.000Z"
}
