{
  "title": "International Earth Day highlights individual power to protect  planet",
  "author": null,
  "content": "ISLAMABAD, Apr 22 (APP):International Earth Day observed on Tuesday, with this year’s theme, “Our Power, Our Planet,” focusing on the role of individuals in safeguarding the environment and the need for collective action to ensure sustainability.\nThe theme underscores the idea that every person has the ability to contribute to environmental protection and urges communities worldwide to take meaningful steps toward a greener future.\n“This Earth Day, we recognize that the power to protect our planet lies in the hands of people everywhere,” stated Umar Bilal, an ecologist adding “Small actions, when multiplied, can lead to transformative change.”\nEarth Day, first celebrated in 1970, has grown into a global movement promoting environmental awareness and policy changes.\nThis year’s campaign encourages reducing plastic use, conserving water, planting trees, and supporting renewable energy initiatives.\n“Sustainability is not just a goal but a shared responsibility,” said CDA DG Environment Nazia Abrar while talking to APP.\nBy working together, she said we can address climate change, preserve biodiversity, and create a healthier planet for future generations.\nEvents such as community clean-ups, educational workshops, and advocacy campaigns are being held worldwide to mark the occasion.\nCitizens, organizations, and governments are being called upon to take immediate and long-term actions to combat environmental degradation.\nAs the world faces escalating climate challenges, Earth Day 2025 serves as a reminder that individual and collective efforts are crucial in shaping a sustainable future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:46:56.422Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/international-earth-day-highlights-individual-power-to-protect-planet/",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T08:07:00.000Z"
}
