{
  "title": "Number of coronavirus infection testing labs to reach 32: PM told",
  "link": "https://www.app.com.pk/national/number-of-coronavirus-infection-testing-labs-to-reach-32-pm-told/",
  "date_published": "2020-03-31T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP):National Disaster Management Authority (NDMA) Chairman Lt Gen Muhammad Afzal on Tuesday apprised Prime Minister Imran Khan that presently, 20 coronavirus testing laboratories were fully functional in the country whereas 12 more would be established soon to meet the target of total 32 laboratories.\nAbout the availability of testing kits, the prime minister was briefed that the first consignment of 57,000 kits was imported from China, followed by another of 30,000, while 192,000 more would reach Pakistan by Wednesday taking the total number of available kits to 280,000.\nThe prime minister was chairing a review meeting over the coronavirus control, diagnosing facilities, continuity of industrial process under the current situation, the government’s economic package, supply and distribution of essential items, steps in the agriculture sector and implementation of National Coordination Committee’s decisions.\nThe meeting was attended by Minister for Economic Affairs Hamad Azhar, Minister for National Food Security Makhdoom Khusru Bakhtiar, Minister for Planning Asad Umar, Advisor on Finance Dr Abdul Hafeez Shaikh, Special Assistant on Information and Broadcasting Dr Firdous Ashiq Awan, Special Assistant on Health Dr Zafar Mirza, Special Assistant Dr Moeed Yousaf, Focal Person over Corona Dr Faisal Sultan and others, PM Office Media Wing in a press release said.\nThe NDMA chairman gave a detailed briefing over the establishment of laboratories to diagnose the coronavirus infection, availability of testing kits and other issues.\nThe prime minister was told that till March 14, the country had 14 laboratories but their numbers had been increased. A detailed briefing was also given over the availability of testing kits, ventilators and other health related equipment in different provinces.\nThe meeting decided that besides the public hospitals, it would be binding upon the private sector run hospitals to allocate beds and facilities for the coronavirus infection patients under a special ratio.\nThe prime minister said they were also closely reviewing other countries’ experiences with regard to the coronavirus testing and measures to control its spread.\nHe also directed for expediting coordination and compiling of data process regarding infected patients, health facilities in hospitals, testing kits, and availability of ventilators in all the provinces of the country.\nThe NDMA chairman also apprised the prime minister about the details for conducting disinfectant spray in those cities which could face the coronavirus threat.\nMinister for Economic Affairs Hamad Azhar briefed the prime minister in detail about the steps taken to ensure continuity of essential industries.\nAdvisor on Finance Dr Abdul Hafeez Shaikh briefed the prime minister about the implementation process of Rs1,200 billion economic package as announced by the government.\nThe proposals for the improvement of the agriculture sector were also submitted and it was apprised that as result of the government’s decision over GIDC, prices of fertilizers had been reduced by upto Rs 400. In this regard further measures also came under consideration.\nSpecial Assistant Dr Moeed Yousaf gave a briefing over the implementation of NCC’s decisions.\nAddressing the meeting, the prime minister said the public should be kept abreast of every aspect during the current situation, so that no misunderstanding or ambiguity could be created.\nHe observed that creation of a well-coordinated network comprising district administration, political leadership and volunteers was to provide relief to the public through the length and breadth of the country.\nThe prime minister also stressed that the provision of relief should be ensured on the basis of merit and in that connection, no discrimination or surfacing of any complaint would be tolerated.",
  "retrievedAt": "2025-08-11T19:01:36.452Z"
}
