{
  "title": "Efforts being made to ensure corona-free ‘Panah Gahs’",
  "link": "https://www.app.com.pk/national/efforts-being-made-to-ensure-corona-free-panah-gahs/",
  "date_published": "2020-03-31T01:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP):Prime Minister’s Focal Person Naseem ur Rehman Tuesday said concentrated efforts were being made to prevent the outbreak of Coronavirus at the ‘Panah Gahs’ of twin cities of Rawalpindi and Islamabad which serve food to some 2,500 poor and gave overnight stay to 500 daily.\n“In a quick response to the Coronavirus threat, a comprehensive campaign has been launched in Rawalpindi and Islamabad to ensure hygienic environment at the shelter homes which have become an ultimate destination for the people affected by the virtual lockdown in the cities,” the focal person told APP on Wednesday.\nUnder the drive title ‘Help Keep Panahgahs Clean’, he said the shelter homes’ management was mobilizing its resources in terms of human and kinds to make sure neat and tidy environment at those places in wake of the looming threat of COVID-19.\nNaseem said out-reach teams had been formed under the drive which held face to face interaction with the shelter homes beneficiaries who were more vulnerable to contract the virus due to their minimal exposure to print and electronic media.\n“The teams, comprising volunteers, have been giving practical demonstration to the visitors at Panahgahs about mask wearing, personal hygiene and use of soap and sanitizers,” he added.\nThe main focus was to ensure uninterrupted supply of essential items like water, soaps, sanitizers and masks at the facilities so that the desired results could be achieved, the focal person said.\nHe said the campaign had been receiving positive response from philanthropists, affluent people and volunteers. Recently, the Pakistan Tehreek-e-Insaf Women Wing Islamabad had made generous donation of products like soaps and sanitizers, he added.\nNaseem said hand-washing booths were being installed in collaboration with Strengthening Participatory Organization.\n“This is a timely help that inspires the Panagah team to hasten its efforts for promoting targeted hygienic practices to keep the residents safe from contracting Coronavirus,” he remarked.\nBefore formal launch of the campaign, he said the sanitization of all the shelter homes in the federal capital had also been done to disinfect the facilities. Up-gradation of screening arrangements was also in process, while washable masks were also being provided to every resident of shelter homes, he added.\nThe focal person said the national and local donors were also being reached out to solicit their support for such a humanitarian cause.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:41.350Z"
}
