{
  "title": "CM directs to release all citizens violating section 144 during coronavirus pandemic",
  "link": "https://www.app.com.pk/national/cm-directs-to-release-all-citizens-violating-section-144-during-coronavirus-pandemic/",
  "date_published": "2020-03-30T23:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 31 (APP):Punjab Chief Minister Sardar Usman Buzdar on Tuesday directed to release all the citizens arrested for violating Section 144 during coronavirus pandemic.\nPresiding over a meeting of the cabinet committee on coronavirus at Civil Secretariat here, he said that the Punjab Isaaf Imdad Programme had been started from today. The applicants would apply online/SMS and Rs 4000 would be paid to the needy family after verification. Meanwhile, cement factories had been exempted from the imposed restrictions due to coronavirus, he added.\nThe chief minister stated that Rs10 billion had been earmarked for providing a grant to 25 lakh families under Punjab Insaaf Imdad Programme. It was not required to visit any office for seeking aid and there would be no governmental interference to ensure complete transparency, he maintained. He said the local government department would conduct antiseptic spray in seminaries and mosques. However, people should avoid going outside unnecessarily. The 100-bed field hospital at Expo Centre would be made functional tomorrow, he added.\nThe chief minister told that the total number of confirmed coronavirus patients in Punjab was 662 and the situation was under control. The government would provide resources to medical researchers for the preparation of coronavirus vaccine and the SOPs of home-based quarantine would also be issued after consultation with the doctors coming from China.\nThe CM informed that district-level committees were being formed for the provision of PPEs in hospitals and quarantine centres. These committees would be comprised of Deputy Commissioners and other officials, he added. Around 1200 tests were being conducted daily in Punjab and the capacity of conducting 5000 to 7000 coronavirus tests would be achieved after the establishment of BSL-3 level labs at divisional level, he added. The government appreciated all those performing duties for overcoming coronavirus pandemic, he said.\nTo a question, he said that campaign was underway to deal with the hoarders. An emergency plan had been devised to deal with any untoward situation and supply of essentials would not be affected. He disclosed that the Punjab government initially contacted Dr Tahir Shamsi for consultations about the treatment of coronavirus. The experts were researching at the University of Health Sciences and Pakistan would surely succeed in preparing vaccine, he added.\nHe said that more than 10,000 recruitments would be immediately made in police and approved vacant posts would be filled in phases. Similarly, Rs 250 million would be provided to police for investigation and operational matters, adding that 500 single cabin pickups would be purchased for police and Rs 755.7 million would be provided in the next budget for procurement of additional 182 vehicles, he added. The under-construction building of police stations would be got completed and new buildings of 101 police stations would also be constructed after the transfer of government lands. He also assured that police khidmat centres would be made commensurate with the latest needs and steps would be taken to make police a public-friendly institution.\nProvincial ministers Raja Basharat, Dr Yasmin Rashid, Mian Aslam Iqbal, Fayyaz-ul-Hassan Chohan, Chief Secretary, IG Police and relevant secretaries attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:34.613Z"
}
