{
  "title": "Govt trying to reschedule loans from IMF, WB , ADB: FM Qureshi",
  "link": "https://www.app.com.pk/national/govt-trying-to-reschedule-loans-from-imf-wb-adb-fm-qureshi/",
  "date_published": "2020-03-31T01:44:00.000Z",
  "source": "APP",
  "content": "MULTAN , Mar 31 (APP):Foreign Minister Makhdoom Shah Mehmood Qureshi said on Tuesday that government was trying to get loans rescheduled from International Monetary Fund (IMF), World Bank (WB) and Asian Development Bank (ADB) to deal coronavirus pandemic effectively.\n“The rescheduled amounts will be spent on health issues emerged from coronavirus” he expressed these views in a meeting at Circuit House, here.\nThe foreign minister observed that the incumbent government was carefully monitoring coronavirus trends at international level.\nThe government had constituted two sub committees, he said and added “I am leading one sub-committee which is working on maintaining and promoting contacts at international level to deal coronavirus related issues “.\nThe other committee headed by Asad Umar was focusing on lockdown situation and supply of food chain in the country, he said.\nShah Mehmood Qureshi informed that the government was in contact with European Union, G-77 and G-20 countries, adding the government was also contacting Pakistanis in abroad.\nTo a question, the foreign minister observed that Pakistan was playing its role for lifting of international restrictions on Iran.\nIran could not purchase even ventilators despite it had money to buy them, he added.\nQureshi stated that immense preparation was required for complete lockdown in the country.\nIn China, about 60 million people underwent complete lockdown in Wuhan province, he said adding during this period, they (Chinese) mobilised over 45,000 workers for online supply of food items at people houses.\nHe pointed out the government had to distribute meal at doorstep of the masses during complete lockdown in the country.\nAbout Tiger Force, he observed, first meeting regarding Corona Relief Tiger Force, would be held in Multan. Proper coordination could guaranteed success behind constitution of the Tiger Force, he added.\nQureshi said every union council was comprised of six wards and the Tiger Force would be made in every ward.\nThe youngsters of the Tiger Force would register names of labourers, ID card number, phone number and address, he added.\nHe urged local parliamentarians and district administration to extend maximum cooperation for success of the revolutionary programme of Prime Minister Imran Khan , which aimed at maximum help towards the poor.\nQureshi said that the incumbent government gave relief package of Rs 1200 billions, which was historic and the best in recent critical scenario.\nThe government was well aware of wheat season, he said adding It would surely facilitate wheat reaping and other operations including wheat procurement.\nThe foreign minister stated that the pandemic could be dealt effectively by forging unity.\nHe lamented that opposition was busy in political point scoring only.\nOn this occasion, Provincial Minister Dr Akhtar Malik, local parliamentarians and officials of district administration were also present.\nThe foreign minister expressed his concern that the people of Indian Occupied Kashmir (IOK), who had been siege and lockdown imposed by the occupation forces for the last eight months, had also no access to the medical facilities amid the coronavirus outbreak.\nThe Pakistanis, who had felt the brunt of lockdown for a few weeks, could imagine the situation in the IOK where the people were without medical facilities for months, he added.\nQureshi said he had contacted foreign ministers of Italy, Spain, France, Germany, the United Kingdom, SAARC countries and others, and urged them to use their influence on India to end the lockdown of IOK and ensure relief and medical supplies there as two Kashmiris had died of the coronavirus.\nHe said he had discussed the measures taken by the federal government and its National Coordination Committee to combat the coronavirus in a meeting with the elected representatives and local administration here. Ways to ensure transparency in the prime minister’s Rs 1,200 billion relief package and the Punjab government’s initiative of providing assistance to 2.5 million families, also came under discussion so that help could reach the deserving and needy.\nThe foreign minister lauded doctors and paramedical staff for fighting on the front lines against the pandemic and added that during his visit to China he had first sought supply of personal protective equipment (PPEs) for the safety of doctors and paramedical staff.\nHe lauded the Pakistani media for the role in creating awareness among the people on new coronavirus and how to be keep themselves safe.\nEarlier, during his visit to the quarantine area, the minister addressed the inmates. He said the government was making all-out efforts to provide them all necessary facilities and the best treatment.\nHe lauded the courage and patience of Zaireen (pilgrims) at the quarantine area and said that those tested negative in the wake of tests scheduled on April 3 would be allowed to go home.\nHe also lauded the local administration and employees of different departments performing duty at the quarantine area.",
  "retrievedAt": "2025-08-11T19:01:42.459Z"
}
