{
  "title": "Addressing media industry’s issues Govt priority: Firdous",
  "link": "https://www.app.com.pk/national/addressing-media-industrys-issues-govt-priority-firdous/",
  "date_published": "2020-03-31T05:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan has said that addressing issues related to the media industry was top priority of the government.\nShe was talking to a delegation of All Pakistan Newspapers Society, Council of Pakistan Newspapers Editors and Pakistan Broadcasters Association here late night.\nPakistan Tehreek-e-Insaf government firmly believed in the fundamental democratic right of freedom of expression and it would continue to provide all possible facilities for the promotion of free and responsible journalism, she said.\nThe SAPM said that freedom of media and democracy were interlinked.\nThe delegation discussed a special relief package for the media in the context of the problems being faced by the media industry and the challenge of coronavirus with the Special Assistant.\nFirdous said that Prime Minister Imran Khan has issued clear instructions for payment of outstanding dues of media houses. She said steps were being taken to ensure that there should be no delay in this regard.\nAppreciating the media’s performance at this time of pandemic, she said journalists and media workers were playing a role in the fight against Coronavirus.\nThe well-being of journalists and media workers was one of our priorities, she emphasised. A separate meeting will be convened to address the issues of newspaper hawkers, she added.\nThe SAPM appreciated Secretary Information Akbar Durrani for running the affairs of the ministry in a smooth and professional manner.\nKhushnood Ali Khan, Mehtab Khan, Sarfar KHAN Niazi, Duraid Khan, Mohsin Bilal Khan, Khawar Ghumman, Akhtar Waqar Azeem and Tikka Khan attended the meeting.\nPrincipal Information Officer Tahir Hassan was also present on the occasion.",
  "retrievedAt": "2025-08-11T19:01:37.930Z"
}
