{
  "title": "International Rural Women Day celebrated",
  "link": "https://www.app.com.pk/national/international-rural-women-day-celebrated/",
  "date_published": "2023-10-15T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): The speakers and the participants at the 16th Annual Rural Women Conference on the International Rural Women Day here Sunday urged the government to devise effective mechanisms involving communities, while taking into account innovative solutions utilizing digital technologies.\n15 October is celebrated as International Rural Women Day every year according to the UN General Assembly’s resolution A/RES/62/136 of 18 December 2007. Through the resolution, the member states recognized the significance of the role that is played by the rural women admitting their contributions in enhancing agricultural and rural development, improving food security and end poverty.\nCulminating on Tuesday, 17th October, the Conference will hold award distribution ceremony by celebrating the successes of the rural women who are participating actively in the three-day conference representing 150 plus districts of the country.\nPODA’s 3-day conference is a regular feature in Islamabad since 2008. The theme of the ongoing conference is “Stop Child Marriages for Sustainable Development, Climate and Democracy”.\n“Due to lack of official identity (ID), girls are deprived of their fundamental human rights including right to legal identity, citizenship, education, marriage, reproductive health, inheritance, government assistance, services and lead a dignified life as these are the rights enshrined in the Constitution of Pakistan,” said Sameena Nazir who is a Founder and President of PODA.\nBirth registration helps to decreasing the risks of child marriage, child labor and children being treated as adults in the criminal justice system, she said.\n“This very basic human right will provide a strong foundation for achieving gender equality and empower women and girls, Gender equality is goal 5 of SDGs which is translated into all SDGs,” she explained.\nAfter the inaugural plenary, the day’s proceedings were focused on the rights of girl-child and registration issues linked with an alarming neglect to register birth of girl children.\nThe PDHS survey of Pakistan identifies that here 42% children under the age of five are not registered. However, in newly merged districts of FATA, the birth registration rate is far low.\nAccording to UNICEF it was 1% in 2017 in former agencies. Being a signatory to the Convention on the Rights of the Child, Government of Pakistan is committed to provide children their basic rights to survival, development, protection and participation.\nThe speakers included Leher Mirza, Sudi Kohli from Sindh, Sofia Javed from Khyber pakhtunkhaw, women boxer Sughra Rahman from Sahiwal, Dr. Yasmin Gul from Swat, Shahida Wafa Alvi from Muzafargarh, writer and journalist and Sadaf Raza from Justuju Foundation Sindh and Fareeha Ammar from UN Women. Darakhshan Saleh from Sindh Commission on Status of Women, MPA of PML-NMs. Kanwal Liaqat from Lahore and Ms. Sabeen Rizvi, PML-N MNA and General Secretary Parliamentarian’s Forum, PML-N also spoke on the occasion.\nMs. Raina who represented transgender community said that government institutions should come forward to ensure hundred percent birth registration. It should not be left to the will of the families and others, she explained.",
  "retrievedAt": "2025-08-11T10:05:22.716Z"
}
