{
  "title": "Aneeq eulogizes late senior journalist Zahid Malik’s services for Islam, Pakistan",
  "link": "https://www.app.com.pk/national/aneeq-eulogizes-late-senior-journalist-zahid-maliks-services-for-islam-pakistan/",
  "date_published": "2023-10-15T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): Caretaker Minister for Religious Affairs and Interfaith Harmony, Aneeq Ahmed, paying glowing tributes to the late senior journalist Zahid Malik, who served as Pakistan Observer Editor-in-Chief, termed him a true son of the soil and eulogized his services for Islam and Pakistan.\nExpressing these views in a recent meeting with Pakistan Observer Chairman Faisal Zahid Malik, who called on him at his office, Minister Aneeq said his books ‘Mazameen-e-Quran’ and ‘Mazameen-e-Hadith’ were particularly two masterpieces. “Through these two books, Zahid Malik has done a subject-wise compilation of various topics in the light of Quran and Hadith, which indeed is a great service and helps the readers greatly in learning them.”\nFaisal expressed gratitude to the Minister Aneeq for attributing beautiful words for his late father Zahid Malik besides appreciating the steps being taken by the religious affairs ministry and wishing him success in his future endeavours.\nIn addition, Minister Aneeq said Pakistan’s new Hajj Policy 2024 envisaged a number of pilgrim-friendly features such as option for shorter stay, QR code, mobile phone SIM with video call options for 45 days etc. He said the Hajj Policy was in the final stage and would be presented before the federal cabinet soon.\n“Caretaker Prime Minister Anwaar-ul-Haq Kakar has been personally monitoring the contours of the Hajj Policy 2024 and has instructed to make it easier and more helpful for the pilgrims,” he said adding, “We are engaged with the Saudi government on a number of issues such as the number of pilgrims in the next year, the Saudi government’s decision to reduce the number of companies from over 900 to merely 46 and we hope to get a favourable answer soon.”\nThe federal minister, about the QR code and shorter stay option, said that every pilgrim would be given two suitcases which could be located through the QR codes in case they were lost. He said there was a proposal to reduce the duration of the Hajj journey from 45 days to 18 to 20 days from the next Hajj season. A pilgrim would be free to choose either he/she wanted a 45-day or 18 to 20 days stay in Saudi Arabia, he added.\nThe minister made it clear that the pilgrims would have both options but the expenses would remain same. He also mentioned that the government would provide mobile SIM for 45 days which could also be used for video calls.",
  "retrievedAt": "2025-08-11T10:05:21.538Z"
}
