{
  "title": "PUC repose full confidence in Ashrafi as chairman",
  "link": "https://www.app.com.pk/national/puc-repose-full-confidence-in-ashrafi-as-chairman/",
  "date_published": "2022-11-16T14:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): The Central Executive and Advisory Body of Pakistan Ulema Council (PUC) on Wednesday re-elected Hafiz Muhammad Tahir Mahmood Ashrafi as chairman and Maulana Asad Zakaria Qasmi as its central secretary general.\nThe body also decided to organize the council in all areas across the country and ‘Pakistan Stability Conferences’ and seminars all over the country.\nThe meeting was attended by the Ulema, Mashaykh and important office bearers of the council from all over the country.\nAshrafi who is also the Prime Minister’s Special Representative for Interfaith Harmony and Middle East, in a joint declaration said the prevailing circumstances and situation required that political and religious parties should adopt an attitude of understanding and harmony for the economic stability in the country, and continue efforts for the elimination of interest-based economic system, extremism, and terrorism.\nHe said there should be reforms in the justice and electoral system to bring Pakistan at par with advanced countries.He proposed that Pakistan Tehreek-i-Insaf (PTI) and the government should start meaningful dialogues and PTI leadership should return to the parliament.\nHe said the malicious campaign against the Pakistan’s security forces and officials should be stopped immediately. “The new Chief of Army Staff would be appointed in accordance with the Constitution and law,” he added.\nHe said in case of Arshad Sharif’s murder, attack on Imran Khan and illicit video-tape incident of Azam Swati, blaming the national security forces without any investigation and evidence was not right.\nAshrafi appealed the Supreme Court to constitute a judicial inquiry commission in the following cases as requested by the prime minister.\nBesides announcing to establish a committee to liaison with international organizations and religious leaders, he said the PUC fully agreed with the declaration of conferences called by Darul Ifta regarding environmental and climate change challenges.\nHe said the PUC strongly supported the establishment of R20 by the Muslim World League (MWL) and efforts on interfaith and intersect dialogue on peace and global issues. The meeting also expressed satisfaction on the recent visit of MWL Secretary General Dr. Muhammad bin Abdulkarim Al-Issa to Pakistan, he added.\nHe also also decided to cooperate with the International Interfaith Harmony Council to play a more effective and vibrant role with regard to interfaith and intersect harmony, minorities, women’s issues and their respective rights.\nAshrafi said the PUC in view of the conference held in Sharm El-Sheikh with cooperation of Egypt and Saudi Arabia lauded the efforts of Saudi Arabia’s Prime Minister and Crown Prince Muhammad bin Salman for Middle East Green Initiative.\nHe was of the view that all religious scholars should also play their role on the issues of climate change and increasing challenges of poverty in the world.\nHe said the PUC expressed gratitude to the King of Bahrain and head of the Bahrain Islamic Council, Sheikh Al-Azhar Ahmed Tayyib and Pope Francis, besides fully endorsing the declaration of interfaith conference organized under the aegis of Bahrain Dialogue Forum in Manama.\nHe further said in view of the global situation, the PUC had decided to hold ‘World Peace Conference’ in Islamabad in March 2023, in which Imam-e-Kaaba, Sheikh Al-Azhar, Pope Francis, Bishop of Canterbury and MWL Secretary General Dr. Muhammad bin Abdulkarim Al-Issa would be invited.",
  "retrievedAt": "2025-08-11T15:53:18.612Z"
}
