{
  "title": "Atta Tarar unveils facts behind rare watch-set gift sold out by Imran Khan",
  "link": "https://www.app.com.pk/national/atta-tarar-unveils-facts-behind-rare-watch-set-gift-sold-out-by-imran-khan/",
  "date_published": "2022-11-16T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): Special Assistant to the Prime Minister (SAPM) Attaullah Tarar on Wednesday unveiled the facts behind a rare and priceless watch-set gift, containing pen and cufflinks embodied with 12.24 karat diamonds, which was handed over to former prime minister Imran Khan by the Saudi Crown Prince but the PTI chairman sold it out in a ‘criminal way’ without realizing ‘importance and uniqueness of the gift.\n“It is the only watch got prepared by the Saudi Crown Prince for gifting to Pakistan, so its price can’t be matched with other ones. Its unique dial is of Khana Ka’aba (Baitullah Sharif) shape,” he said while showing documentary evidence of the gift’s details and the price evaluation.\nHe said as per rules, any gift received from abroad was first deposited in the ‘Toshakhana’ and later on another procedure of market evaluation was carried out if the recipient wanted to keep it. “But nothing such thing happened in this case.”\nHowever, he said, as per the market evaluation that had been carried out in a thorough professional and technical way, its price stood at around $12 million, almost Rs 1.7 billion at that time and now Rs 2 billion.\nHe said Imran Khan bought the watch set at Rs 20 million only, without adopting the laid down procedure.\n“And now, he (Imran) has confessed to committing two crimes which are buying and selling it.”\nHe regretted that the unique gift was not meant to sell in the open market as it was given as a gesture of great love and respect to Pakistan.\nHe demanded Imran Khan to tender his resignation from the chairmanship of Pakistan Tehreek-e-Insaf as he had been declared a certified thief after selling the “made to order” watch in the market.\nHe believed that the gift given by the Crown Prince of Saudi Arabia to Imran Khan was for the people of Pakistan.\nTarar hinted that the government would start criminal proceedings against Imran Khan in the Toshakhana case as per the order of Pakistan’s Election Commission of Pakistan.\nHe said that the government will also issue a red warrant for the return of Farah Gogi from the UAE.\nAbout the Daily Mail case, he said, that the trial of the case would start next year.\nTo a question, he said that the provision of security to Imran Khan during the long march was the responsibility of the Punjab government.\nHe said that FIR should be registered against Chief Minister Punjab Pervaiz Elahi for the security lapse.",
  "retrievedAt": "2025-08-11T15:53:23.297Z"
}
