{
  "title": "Pakistan’s first energy booster juice of fresh fruits launched to improve immunity",
  "link": "https://www.app.com.pk/national/pakistans-first-energy-booster-juice-of-fresh-fruits-launched-to-improve-immunity/",
  "date_published": "2022-11-16T09:22:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 16 (APP):Iftekhar Ahmed and Company, one of Pakistan’s leading exporter of fresh fruits and value-added products, has announced launching of country’s first instant energy booster juice prepared from pure pulp of apple, beetroot and carrot to make human immune strong by providing rich nutrition along with the elimination of toxins from the body.\n“The energy drink has been introduced under the brand of `Fruit Nation’ with title `ABC Juice’ to promote health and nutrition by providing premium quality juices, nectar, fruit drinks and food products,” Waheed Ahmed, Director Iftekhar Ahmad & Company (IAC) informed here Wednesday.\nTalking to APP, Waheed Ahmad who is also patron in chief of Pakistan Fruits and Vegetable Importers and Exporters Association (PFVA), said that IAC is among the 200 companies in the world that has supply of fresh fruits and vegetables from its own gardens, state of the art processing, facility and food and beverages consumer products.\n“The IAC has been in the business for 62 years and made an investment of US dollar 10 million to export  company’s brands to more than 25 countries besides manufacturing and exporting mango pulp, apple concentrate and other fruit pulp,” Waheed apprised APP.\nHe said that some specific juices and nectars introduced under the Fruit Nation brand were free from sugar and artificial food colors, while natural food colors had been used in other juices, nectars and fruit drinks.\nAll juices, nectars and fruit drinks are made from natural sweeteners and locally grown fruit pulp and no preservatives are used to ensure health of the consumers. All the flavors are developed as a result of intensive research on taste and quality in the company’s own state-of-the-art R&D laboratory.\nWaheed Ahmed said that in the next four years, Fruit Nation would be among the top five brands in the country and was enthusiastically working to achieve this goal.\nWaheed Ahmed informed that despite the Coivid-19 pandemic and tough economic conditions in the country, Iftekhar Ahmed & Company had invested 10 million dollars in the food and beverages sector fulfilling its deep commitment to the motherland.\nAn additional 15 million dollars will be invested in the next four years to include Fruit Nation and Lush brand among the top five brands of Pakistan, after which IAC’s new investment in Pakistan’s food and beverage sector will reach 25 million dollars. This is in addition to the investment of $15-20 million for pulping, concentrate, cold storage and other infrastructure, he went on to say, he added.\n“Fruit Nation products are available in more than 30 cities of the country and soon ABC Energy boosters will be available in major cities and international market to help people get their immune system stronger to cope with corona related illnesses and other diseases threatening public health,” Waheed claimed.",
  "retrievedAt": "2025-08-11T15:53:24.572Z"
}
