{
  "title": "Islamabad police introduces e-health system for its personnel",
  "link": "https://www.app.com.pk/national/islamabad-police-introduces-e-health-system-for-its-personnel/",
  "date_published": "2022-11-16T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP):Islamabad police have introduced a ‘capital police e-health system’ for the provision of outstanding health facilities to the personnel of the force and to ensure their fitness by reducing health-related risks.\nThis initiative has been taken following the directions of Inspector General of Police (IGP) Islamabad Dr. Akbar Nasir Khan who has committed to ensuring welfare steps for the cops of the force including the provision of health facilities to them.\nThe incumbent chief of Islamabad police has implemented a number of welfare initiatives including an increase in salaries as well as perks and privileges for the personnel. The initiative of improved health facilities for the personnel would boost the morale of the force which would ultimately improve the performance.\nThis system is being initiated from police lines headquarters in Islamabad and a database of all the people living in police lines headquarters will be compiled. This data would also categorize those living legally or illegally on these premises.\nA health card system would be introduced for the serving cops while medical tests would be conducted and medicines to be provided through a telehealth system as per international standards.\nAccording to the system, medical tests of police personnel would be mandatory every year and the concerned doctor will suggest the medicines and medical rests for the officials. As per the recommendation of the medical staff, the duties would be assigned to the policemen.\nIGP Islamabad said that personnel of the force have risks of diseases like heart attack, blood pressure, mental stress due to old age, and tough duties, and this system will help to improve their health facility and mitigate such risks.\nHe further stated that this system was the need of the hour which would help to ensure timely medical checkup and treatments to the officials.\nIslamabad police chief Dr. Akbar Nasir Khan said that the pilot project of the system has been started under the supervision of DIG Headquarters and it would be made fully operational by December 31, 2022.",
  "retrievedAt": "2025-08-11T15:53:24.674Z"
}
