{
  "title": "Imran’s tenure a PM dark chapter of Pakistan media history: Marriyum",
  "link": "https://www.app.com.pk/national/imrans-tenure-as-pm-dark-chapter-of-pakistan-media-history-marriyum/",
  "date_published": "2022-08-18T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Terming PTI Chairman Imran Khan’s tenure as prime minister as a dark chapter for media in Pakistan, Minister for Information and Broadcasting Marriyum Aurangzeb said on Thursday that the media organizations and journalists should recall the anti-media track record of the PTI regime before attending\nhis media seminar.In a statement, she said that the enemy of media (Imran Khan) who was what she called “economic murderer” of the media should feel ashamed on conducting the media seminar.\nImran Khan indulged in media enmity while sitting in the Prime Minister’s chair.She said that Imran Khan was a liar, corrupt, foreign agent, media enemy and a hypocrite and the media had to decide whether to attend the seminar of a person who used the National Accountability Bureau as a tool to suppress media freedom.\n“The media has to decide whether or not to attend the media seminar of the founder of Pakistan Media Regulatory Authority, which was established by the previous government to control the media.\nShe urged Imran to stop the farce of the media seminar as during his four years rule the media’s voice was muzzled and Mir Shakeel-ur-Rehman was arrested by NAB to weaken the national media.\n“PFUJ, CPNE and PBA will have to decide whether to attend the “media weakening seminar”, he media has to decide whether to go to the media seminar of the persons who strangulated journalism, during whose tenure firing was done on journalists, the one who imposed unprecedented restrictions on media.\nThe minister said that the media will have to decide whether to participate in the seminar of the person who had been given the title of “media predator by international organizations”.\nThe media will have to decide whether to believe the specter of their freedom and job-snapping seminar or not.\nCPNE’s 2020 report, International Media Watch and Reporters Without Borders (RSF) 2021 reports were testimony to Imran Khan’s media hostility, Maryam Aurangzeb said.\nShe pointed out that International Media Watch had called Imran Khan a fascist and in four years of Imran Khan rule, the ribs of journalists were broken, they were kidnapped, the freedom of the media was crushed and the parliament was locked.\nShe said that Imran Khan who controlled media through NAB also mademedia workers jobless.The media has to decide whether to attend the seminar of the person who had snatched the pen from the journalists, ordered the removal of anchor persons from the screen, she maintained.",
  "retrievedAt": "2025-08-11T15:25:30.379Z"
}
