{
  "title": "Political parties asked to share miseries of flood affectees",
  "link": "https://www.app.com.pk/national/political-parties-asked-to-share-miseries-of-flood-affectees/",
  "date_published": "2022-08-18T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Federal Minister for Climate Change Sherry Rehman on Thursday said that flash floods in the country swept away hundreds of houses, left families homeless, death toll increases, whereas people were facing shortage of medical supplies and food.\nTaking the floor of the Senate, she said at a time when the country was facing natural calamities, the political parties instead of doing politics should come forward and share grief of flood victims.\nCriticizing Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan, she said the former prime minister’s ‘misrule’ had created an ‘economic tsunami’ in the country.\nShe said in democratic society peaceful protest was the right of every citizen, but the law should not be taken into hands.\nThe PTI always demonstrated non-democratic attitude towards the leadership of Pakistan Muslim League Nawaz (PML-N) and Pakistan Peoples Party (PPP). “Our leaders had faced exile, but never uttered a single word against the state institutions, as PPP believes in the politics of principles,” she maintained.\nShe said Imran Khan’s double standard has exposed to the nation as his party had hired a firm in the US to improve its image in the United States.\nThe PTI chief and his party have been running a systematic campaign on the narrative that the US backed “local abettors” toppled his government through a conspiracy, and installed an administration of its choice, she added. “Now he [Imran] was lobbying to win US trust for his party in Pakistan,” she remarked.\nCommenting on the off air of a private channel, she said fair trial was right of everyone but legitimate rights should not be compromised, adding that Journalist’s issues should be resolved on priority whether it was related to wage or others.",
  "retrievedAt": "2025-08-11T15:25:29.548Z"
}
