{
  "title": "Pakistan desires enhanced engagement with DCO in digital economy: FM",
  "link": "https://www.app.com.pk/national/pakistan-desires-enhanced-engagement-with-dco-in-digital-economy-fm/",
  "date_published": "2022-08-18T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Foreign Minister Bilawal Bhutto Zardari on Thursday expressed Pakistan’s desire to further enhance its engagement with the Digital Cooperation Organization (DCO) in the realms of digital economy, trade and investment.\nThe Foreign Minister expressed the desire during his video call with Secretary General of DCO, Ms. Deemah Al Yahya.\nHe commended the Kingdom of Saudi Arabia for its initiative to form this new organization (DCO) that Pakistan joined as a founding member.\nReaffirming Pakistan’s commitment to its partnership with DCO, the Foreign Minister called for renewed efforts to achieve the shared goal of digital transformation and promoting joint initiatives to leverage the full potential of Information Communication Technologies (ICTs) for socio-economic development, a press release issued here by the Ministry of Foreign Affairs said.\nNoting that Pakistan had a large pool of skilled Information Technology (IT) professionals, he underscored that Pakistan looked forward to exchanging best practices in the areas of entrepreneurship and innovation, and to explore investment opportunities through the DCO platform inter alia aimed at employment generation for the country’s youth.\nSecretary General Deemah Al Yahya briefed the Foreign Minister on the strategic vision and ongoing programmes of DCO.\nShe also highlighted the vast opportunities for collaboration with Pakistan and expressed the desire to further strengthen the Organization’s ongoing partnership with Pakistan.\nDCO was established in November 2020 by 5 founding member states, including Saudi Arabia and Pakistan, to drive greater collaboration and cooperation across entrepreneurship, innovation, business growth and employment in a shared digital economy.\nMs. Deemah Al Yahya was appointed as DCO’s first Secretary General for a term of four years in April 2021.",
  "retrievedAt": "2025-08-11T15:25:20.091Z"
}
