{
  "title": "Country, media freed from ‘foreign agent’ Imran Khan’s clutches: Marriyum",
  "link": "https://www.app.com.pk/national/fia-should-arrest-imran-khan-like-pml-n-leaders-on-mere-allegations-marriyum/",
  "date_published": "2022-08-18T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday said the country and media had been freed from the clutches of “foreign agent” Imran Khan who imposed worst restrictions on media during his four-year “fascist rule”.\n“A person (Imran), who was declared as the “Predator for Press Freedom”, has no right to lecture others on media freedom and freedom of expression,” the minister said while addressing a news conference.\nAs regards the address of Imran Khan to a seminar on the press freedom, the minister said inviting a person, who had gagged the media during his four-year rule, was a “ridiculous step”.\nShe was surprised to see that some responsible journalists were listening to Imran Khan’s address attentively, she added.\nMarriyum recalled that when Imran Khan was the prime minister journalists were killed and their ribs were broken, state institutions were influenced to put Mir Shakeel ur Rehman behind jail, and the media faced the worst fascism.\nThe oppression of Imran Khan against the media was also highlighted by the Pakistan Federal Union of Journalists, the Council of Pakistan Newspaper Editors, the Pakistan Broadcasters Association and the International Watchdog, she added.\nImran Khan enacted the black law to curtail media freedom, she said, adding it was his tenure when the PTI’s trolls, its rented spokespersons and even the then information minister campaigned against the media.\nShe said Mattiullah Jan was abducted, Absar Alam was shot, Nusrat Javed attacked, malicious drives launched against Asma Shirazi and Ghareeda Farooqi on the social media, and news programmes of Amber Shamsi, Talat Hussain, Dr Danish, Najam Sethi and Hamid Mir were off aired on his (Imran) directives.\nThe media persons, she stressed, would have to decide whether such a person (Imran) should be supported or invited to a seminar on press freedom.\nThe minister said Imran Khan had stated that he did not have any fear of the media, but his actions during the four-year rule completely negated his claims.\nShe said the Federal Investigation Agency (FIA) should arrest Imran Khan like that of the Pakistan Muslim League-Nawaz leaders who were apprehended on the basis of mere accusations.\n“If the FIA can arrest Shehbaz Sharif, Maryam Nawaz, Suleman Shehbaz, Hamza Shehbaz, Ahsan Iqbal, Shahid Khaqan Abbasi, Miftah Ismail and others on the basis of allegations, then why not Imran Khan, who used the prohibited funding against the national interest, should be let scot free,” the minister added.\nMarriyum said a person (Imran Khan), who refused to appear before the FIA in connection with the prohibited funding, should be in jail.\nShe also asked all those, who had opened fake accounts for receiving the prohibited funding, to appear before the FIA, otherwise, they should be ready for strict action.\nThe prohibited funding case, she said, would be taken to its logical end and its all details would be made public so that the people should know how Imran Khan had misled them through “lies and deception”.\n“The probe in the PTI’s prohibited funding is underway and the FIA has unearthed a big account, whose details will be shared with the public tomorrow,” she remarked.\nThe minister said the Election Commission of Pakistan had declared the PTI a foreign-aided party as it used some 351 accounts for receiving the prohibited funding.\nShe alleged that Imran Khan also used the funds, collected from abroad in the name of Shaukat Khanam Hospital and flood victims, for creating chaos and anarchy in the country.\nMarriyum regretted that the “transgressor of the constitution” refused to appear before the FIA, contravening his own so-called stance that the powerful should not be above the law.\nOn the contrary, she added, Nawaz Sharif along with his daughter had regularly appeared before the court when he was the prime minister.\nShe said Imran Khan did all in his power to oppress his political opponents, including Nawaz Sharif, Maryam Nawaz and Shehbaz Sharif who were kept in death cells and denied medical treatment and hygienic food.\nImran Khan created a hurdle in the grant of parole to Nawaz Sharif when his wife died, while his spokespersons ridiculed the ailment of his wife, she said, recalling how Shahbaz Gill parroted lies when Kalsoom Nawaz was in the hospital.\nShe said Imran Khan locked up Rana Sanaullah in a small cell where cockroaches and ants were released.\nMarriyum said Imran Khan blackmailed the then NAB chairman through a video clip to force him to lodge corruption cases against the PML-N leadership. “He used all the state power to prove them (PML-N leaders) corrupt, but not a single evidence could be produced in the court.”\nShe asked Imran Khan why he had failed to prove the corruption of even a single penny against the PML-N leaders, including Nawaz Sharif, Shehbaz Sharif and others despite having all the powers. “He closed all the inquires initiated against him and his party leaders by blackmailing the then NAB chairman, but failed to prove a single case against the PML-N leadership.”\nThe minister said the nation had to understand how Imran Khan misled the nation on his corruption in different scandals including Malam Jabba, BRT Peshawar and others.\nShe said he did not even spare the Tosha Khana, which he had plundered mercilessly and sold its gifts after revising its policy. He even said that he forgot to declare those gifts in his asset declaration statement.\nMarriyum said the frontperson of Imran Khan, Farah Gogi, looted Punjab and took money from the public officials for their transfers and postings, and that too on the whims of the PTI chief.\nAs regards Shehbaz Gill’s arrest, she said he was nabbed by the Islamabad Capital Territory (ICT) Police for giving a seditious statement on a private channel. Imran Khan even tried to influence the Inspector General Prisons of Punjab to shift Gill from Adiala Jail to a hospital in Rawalpindi.\nHe tried to pit the police of one province against the other, she added.\nShe said Imran Khan had stopped building a narrative over the regime change conspiracy as his party had been exposed after hiring the services of a private firm in the United States for its image building.\nTo a query, she said the FIA was probing the illegal award of the contract to the ARY Sports Channel by the former information minister of PTI.\nShe said he did not even spare the Tosha Khana, which he had plundered merc",
  "retrievedAt": "2025-08-11T15:25:16.515Z"
}
