{
  "title": "Pak-Saudi Arabia agree to improve coordination to deal with common challenges",
  "link": "https://www.app.com.pk/national/pak-saudi-arabia-agree-to-improve-coordination-to-deal-with-common-challenges/",
  "date_published": "2022-08-18T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Pakistan and Saudi Arabia on Thursday agreed to further improve the coordination between the interior ministries of both the countries to deal with common challenges.\nThe agreement reached at the meeting held at Jeddah between Interior Minister Rana Sanaullah and his Saudi counterpart party, said a statement issued here. Earlier, Saudi Deputy Interior Minister Dr. Nasir bin Abdul Aziz Dawood received Rana Sanaullah upon his arrival at the Ministry, it further said. Pakistani Ambassador to Saudi Arabia Aamir Khurram Rathore and Consul General Khalid Majeed were also present in the meeting.\nMatters of mutual interests including Pak-Saudi bilateral relations came under discussion during the meeting. Interior minister congratulated his counterpart for making the best arrangements for Hajj 2022. The minister congratulated and thanked the Saudi government for the successful implementation of the Road to Makkah project for Pakistani pilgrims.\nHe stressed the need to improve the communication between the Interior Ministries of both the countries. Security cooperation between Pakistan and Saudi Arabia would further be enhanced, he added. He said Pakistan and Saudi Arabia would jointly face all internal and regional security challenges. Pak-Saudi relations were historical, long-standing and and fraternal, he added.\nSanaullah said the Pakistani people have special devotion and love for the custodian of two holy mosques.  Saudi Arabia has always provided generous help and assistance to Pakistan in the most difficult situations, he added.  He congratulated the Saudi government and the custodian of  the mosques for making the best arrangements for the Hajj.  He said over 80,000 Pakistani Hujjaj performed hajj this year and availed the Road to Makkah facility.",
  "retrievedAt": "2025-08-11T15:25:28.021Z"
}
