{
  "title": "Ranjha sees Imran’s disqualification in Toshakhana reference",
  "link": "https://www.app.com.pk/national/ranjha-sees-imrans-disqualification-in-toshakhana-reference/",
  "date_published": "2022-08-18T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Pakistan Tehreek-e-Insaf (PTI) chairman Imran Khan was going to be disqualified in the Toshakhana reference as he has not declared million of rupee assets, the amount he received from the sale of state gifts, said PML-N leader Mohsin Shahnawaz Ranjha on Thursday.\nTalking to the media here at Islamabad outside ECP premises, he said according to the relevant law, the decision of the case against Imran Khan in the Election Commission was to be announced within 30 days.\nThe Election Commission has the power to send the matter to NAB or to take a decision on its own, he added.\nHe said the entire nation and PTI workers will witness Imran’s disqualification on technical grounds.\nHe also added that Imran Khan had not mentioned the amount received by him after selling toshakhana gifts in his tax returns.\n“Imran Khan did not even leave the tea-set of the Prime Minister’s house and he cites examples of Hazrat Umar (RA) sans following teachings of Islam,” he said, challenging Imran to drag him in the court if he was lying.\nHe said the cases of PML-N supremo Nawaz Sharif and the former president Asif Ali Zardari were different from this case, as they had declared their respective gifts in assets declaration.\nNawaz Sharif would soon return to Pakistan and take part in the elections as the nation direly needed a genuine leadership, he added.\nEveryone including Nawaz Sharif should be provided a level playing field, he asserted.\nHe said the general elections without Nawaz Sharif would not be considered as transparent.\nMeanwhile, the ECP adjourned the hearing of Toshakhana reference filed against the PTI chairman Imran Khan till August 22.\nA five-member ECP bench headed by Chief Election Commissioner Sikandar Sultan Raja comprising Nisar Durrani, Justice(Retd) Ikramullah Khan, Shah Mohammad Jatoi, and Babar Bharwana heard the case.\nECP ordered petitioner Ali Gohar Khan, Mohsin Nawaz Ranjha of the PML-N, and five others to share the copy of reference with the PTI lawyer.\nImran’s lawyer Barrister Gohar argued that his client was not a member of the National Assembly, therefore, the Election Commission of Pakistan (ECP) cannot send a notice to him.\nOn which the Chief Election Commissioner (CEC) remarked that the National Assembly Secretariat had not sent the resignation to the commission and therefore Imran Khan was still the MNA.\nCEC ordered PTI chairman Imran Khan’s counsel to provide the record in the Toshakhana reference.",
  "retrievedAt": "2025-08-11T15:25:19.980Z"
}
