{
  "title": "Pakistan to ensure foolproof security of Chinese workers: Rashid",
  "link": "https://www.app.com.pk/national/pakistan-to-ensure-foolproof-security-of-chinese-workers-rashid/",
  "date_published": "2021-07-17T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP): Minister for Interior Sheikh Rashid Ahmed on Saturday said Pakistan would provide foolproof security to Chinese working on different projects and directives had been issued to all the law enforcement agencies in that regard.\nChina was Pakistan’s closest friend and the coward acts like the Dasu Hydropower bus incident would not affect the two countries’ friendship, he said while addressing here a press conference.\nHe said China’s Minister for Public Security Zhao Kezhi had over half an hour telephonic conversation with him, during which he was informed of the progress made in the investigation into the bus incident.\nThe Chinese minister, he said, contacted him on the instructions of President Xi Jinping. He was apprised of the sentiments of government and the people of Pakistan over the incident, and also the instructions of Prime Minister Imran Khan to the authorities regarding beefing up the security of Chinese nationals in Pakistan.\nThe prime minister, he said, had directed Foreign Minister Shah Mahmood Qureshi to visit China, and asked him (Sheikh Rashid) to ensure more security to the Chinese nationals and the Interior Ministry had issued directives to the law enforcement agencies accordingly.\nHe said both the sides expressed the optimism that no power on earth could make their relations sour as the two countries were iron brothers and time-tested friends.\nHe said that a 15-member team from China had arrived in Pakistan yesterday, which along with the Additional Secretary and officials of security institutions was now at the site of bus incident to carry out investigations.\nThe minister said the Government of Pakistan assured that the enemies of Pak-China friendship and China Pakistan Economic Corridor (CPEC) would never be forgiven, and would given exemplary punishment.\nThe investigation into the bus incident was underway while the wounded persons were being provided the best treatment, he added.\nThe culprits involved in Lahore incident had been arrested and those behind the Dasu bus incident would also be exposed, the minister said.\nAs regards Afghanistan, the interior minister said the Foreign Ministry would give a better briefing on the Afghan policy. Pakistan wished peace in Afghanistan as its own peace was linked with that of the neighbouring country.\nHe said the border management was the responsibility of the Interior Ministry. Pakistan was keeping a vigilant eye on the situation across the border. “We’ll never allow use of our land against anyone and someone else use of its land against us,” he said, adding no superpower could ignore Pakistan due to its geographical importance.\nAfghanistan had border with the Central Asian states and today the situation was totally different from the past when Afghan border was linked with Russia, he added.\nHe said India always tried to avail any opportunity to create unrest in Pakistan, but the latter was strong enough thwart the enemy’s nefarious designs.\nRegarding issuance of fake passports and identity cards, Sheikh Rashid eight accused had been arrested, while 19 others served show cause notices. Instructions had been issued to expel the holders of fake identity cards from the country, he added.\nThe minister said he would visit Azad Jammu and Kashmir along with Prime Minister Imran Khan and hoped that the Pakistan Tehreek-e-Insaf would form government there. Rangers and civil armed forces would perform security duties during the AJK polls and additional forces might be provided on request, he added.\nHe said online visa service initiative had ended corruption on that count.",
  "retrievedAt": "2025-08-11T20:58:51.038Z"
}
