{
  "title": "Opposition failed to mislead masses: state minister",
  "link": "https://www.app.com.pk/national/opposition-failed-to-mislead-mass-state-minister/",
  "date_published": "2021-07-17T12:35:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jul 17 (APP): Minister of State for Information and Broadcasting Farrukh Habib has said that the opposition has failed to mislead masses on the issue of increase in petroleum prices, as people are well aware of the fact that the increase was a result of oil price-hike in the international market.\nTalking to the media at Circuit House here on Saturday, he challenged the opposition to prove that the government had increased its levies on petroleum prices.\nHe said that it was the practice of previous rulers to enhance the levies with the increase of petrol prices at the international level, but the elected government of Prime Minister Imran Khan had rather cut the levies to zero in order to facilitate masses.\nHe said that a summary to increase petrol price by Rs 11 per litre was presented, but the government approved only an increase of Rs 5, though the price of oil had jumped from $34 per barrel to $70-75 per barrel in the international market.\nAbout a remark of Maryam Nawaz, he said that she was a certified liar. She had claimed that she had no property in London and Pakistan, but it was proved later that she had properties not only in Pakistan but also in London.\nHe said Maryam Nawaz had been afflicted by Imran-phobia and she used prime minister’s name for 25 times in her single speech in Kashmir. Maryam was claiming that she was a daughter of Kashmir. It was just a gimmick to win over the sympathies of Kashmiri people.\nHe said that her father also used that tactics for political gains, but continued to ignore Hurriyat leadership and had a meeting with Indian Prime Minister Modi.\nFollowing in the footsteps of her father, she had never highlighted the miseries of Kashmiris, who were facing curfew-like situation neither she condemned Modi, who changed the status of Kashmir. She is also shy of condemning RSS because it would be tantamount to stopping the inflow of Indian gifts in the form of “sarhis” and mangoes.\nHe said that Nawaz Sharif had inked an agreement with the Indian prime minister in 2017, in which the Kashmir issue was intentionally ignored whereas in all past negotiations, Kashmir always remained on top of the agenda.\nHe said that Nawaz Sharif had become Altaf-2 to condemn the national security institutions. Nawaz Sharif was not expelled by the institutions but he himself opted to be an absconder.\nOn other hand, Prime Minister Imran Khan, responding to a question to Indian journalist, fully exposed the RSS ideology, which was the main hurdle in restoring normality in the region, Farrukh Habib said, adding that PM Imran Khan also highlighted Indian aggression and now as a result of his outspoken strategy, the Western media was also exposing Indian atrocities and aggression regarding the minorities in India.\nHe said that Prime Minister Imran Khan also highlighted Kashmir issue whereas Maryam was only making feverish efforts to get NRO.\nHe said that it is a hard reality that Prime Minister Imran Khan had put the economy on right track while the opposition propaganda was yet meant to sabotage his sincere efforts. The cries of opposition were clearly indicating that they were facing defeat in elections in Kashmir, he added.\nResponding to a question, he said that Shehbaz Sharif was standing alone now as his niece was heading towards the opposite direction and infighting had started to become the opposition leader.\nAbout inflation, he said that the government had tried to rationalise prices in Utility Stores Corporation. He said that in January 2020 the prices were fixed 15-20% less than the market rates and now this difference had become 50%, which necessitated immediate rationalisation.\nHe said that Prime Minister Imran Khan would launch Kamyab Pakistan package by end of this month. The basic objective of the project was to lift 4 to 6 million people out of poverty. In this connection, a package of Rs 1600 billion had also been approved by the ECC (Economic Coordination Committee).\nHe said that the government had acquired the data of Ehsaas programme under which interest-free loans would be provided to the youth to start their own business with Rs 500,000 each. Similarly, loan of Rs 2 million would be given for the construction of house, while the farmers would also be facilitated with free loans through Kissan Cards.\nHe said that there were 4,000 Utility Stores outlets with 900 franchises across the country and the government had doled out a subsidy of Rs 25 billion during the last calendar year. This amount jumped to Rs 30 billion if we continued the subsidy by June 2021.\nHe said that the government was fully aware of financial miseries of the poor segments of society and in this connection, targeted subsidy would be offered so that the tax money should be distributed among the needy and deserving segments.\nFor this purpose, the Utility Stores branches would be computerized by Sept 2021, he added.About Faisalabad, he said that sewerage system had become obsolete and the government had allocated Rs 4 billion for up-gradation of sewer system.\nHe said that the Water and Sanitation Agency (WASA) had already replaced and improved sewer lines with Rs 300-350 million while disposal stations would also be up-graded for smooth discharge of rainwater.",
  "retrievedAt": "2025-08-11T20:58:52.787Z"
}
