{
  "title": "Politics should not be mixed with sports: Attaullah Tarar",
  "author": null,
  "content": "ISLAMABAD, Apr 07 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Monday underlined the need to keep politics separate from sports for the betterment of both the fields, highlighting the government’s commitment to youth development and sports promotion nationwide.\n“Politics should be kept out of sports and sports out of politics; this is better for both the sports and politics,” the minister said while speaking as the chief guest on the occasion of a friendly cricket match between the Rawalpindi-Islamabad Sports Journalists Association (RISJA) XI and a UK Media team at the National Cricket Ground here.\nCongratulating the match organizers, Tarar welcomed such initiatives, noting that increased sports activities foster positive societal attitudes. “Healthy activities are crucial to promote games, cricket, and sportsman spirit,” he added.\nThe minister highlighted the government’s extensive efforts in sports promotion, calling it a “top priority” to encourage positive engagement among young people.\nHe noted the continuity of youth-centric programs during the tenures of the Pakistan Muslim League-Nawaz (PML-N) tenures, saying “the Prime Minister’s Youth Program, started during the era of PML-N Quaid Nawaz Sharif, is being carried forward by Prime Minister Shehbaz Sharif.”\nTarar said the Talent Hunt Program, initiated during the previous PML-N government, continued to receive support. He urged collaboration between political parties, the private sector, and the public sector to enhance talent discovery for sports advancement.\nHighlighting recent successes, he cited Javelin thrower Arshad Nadeem, who made his mark globally, as an example of talent emerging from initiatives like the Youth Festival.\n“We have abundant talent,” Tarar said, adding that more talent hunt programs and youth festivals will be organized to discover athletes like Nadeem and help sports like hockey regain their lost status.\nTo a query, he said planning for an international-standard cricket stadium in Islamabad is underway.\nTarar also spoke on the revival of departmental sports, noting their importance in nurturing talent. In the past, the discontinuation of departmental sports left many players unemployed, he recalled.\n“When our hockey team returned after an impressive performance in the Asia Cup, the Prime Minister restarted this system,” the minister noted.\nHe added that instructions were given to ensure the system benefits past players as well, recognizing that departmental sports produced great players.\nAs regards the Pakistan Television (PTV), the minister said the national TV cricket team selection was purely based on merit, mentioning Shamyl Hussain’s outstanding performance. “For the first time, no ‘parchi’ (chit) was used for inclusion in the team.”\nHe also noted that PTV’s financial condition is better than many private channels and that the state broadcaster had aired the Champions Trophy and World Cup live.\nTarar said the Pakistan Super League (PSL) brings global players to the country, offering the nation a chance to watch exciting and competitive cricket.\nHe expressed confidence that the PSL would be a victory for Pakistan and cricket.\nResponding to a query about the national team’s performance, the minister acknowledged that wins and losses are part of sports.\n“The Pakistan cricket team possesses a lot of talent,” asking the nation to remain hopeful for improvement as the Pakistan cricket team has achieved great feats in the past.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:15:24.570Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/politics-should-not-be-mixed-with-sports-attaullah-tarar/",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T14:29:00.000Z"
}
