{
  "title": "PM reiterates pledge of health facilities for all",
  "author": null,
  "content": "ISLAMABAD, Apr 06 (APP):On the occasion of World Health Day, Prime Minister Shehbaz Sharif reiterated the national pledge to ensure health facilities and welfare and well being of every citizen.\nIn a message on the World Health Day celebrated on April 7, he said this year’s theme “Healthy Beginnings, Hopeful Futures” put the spotlight on the importance of health of new born babies.\nHe said health of mothers and children, healthy families and stable communities were the basis of a hopeful nation and a guarantee for a bright future for all.\nPakistan had made considerable progress in ensuring good health of mother and child, he said adding however, still there was a long journey to undertake. “We have to stabilize our system of health in a way that can effectively cope with the medical and different social factors which affect maternity and health of new born babies,” he remarked.\nHe said, “Our government is determined to utilize modern technology in the sector of health and forge strong partnerships in order to improve the facilities of public health.”\n“We are desirous of filling gaps which are a hurdle in the provision of health services especially in the less developed and far flung areas. We want to fill the gaps through use of digital health tools, data based policy making and effective inclusion of community,” he continued.\nThe prime minister said, “While celebrating the World Health Day 2025, let us reiterate the need for a coordinated and multi sectoral approach for health. This approach should include coordinated and practical steps in healthcare, education, nutrition, environment and management.”\n“We have to include in our priorities preventive healthcare, universal health coverage, improvement in mental health and end of inequality in health,” he noted.\nHe said, “Our goal should be to ensure quality health facilities for every person, trained medical personnel, safe medical treatment and timely provision of essential medicines without any financial obstacle wherever and whenever these are needed.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:13.071Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-reiterates-pledge-of-health-facilities-for-all/",
  "dateList": "2025-04-07",
  "date_published": "2025-04-06T19:03:00.000Z"
}
