{
  "title": "Maritime, energy sectors’ reforms to boost trade, unlock Pakistan’s potential: PM",
  "author": null,
  "content": "ISLAMABAD, Apr 07 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said that the reforms in maritime and energy sectors would boost trade, reduce costs, and unlock Pakistan’s economic potential.\nThe prime minister, chairing a high-level meeting to review progress on the government’s wide-ranging reforms in the maritime sector, emphasized that comprehensive efforts were underway to transform Pakistan’s port infrastructure, streamline customs operations, and strengthen the country’s maritime economy for long-term national benefit.\nHe hailed the task force on maritime reforms for its diligent work and praised their efforts in preparing a comprehensive set of recommendations that aim to end decades-long stagnation in the sector.\n“Pakistan has been blessed with a long coastline and vast maritime resources. With the right reforms, we can unlock immense economic potential and bring our ports to global competitive standards,” Prime Minister Shehbaz said.\nHe noted that reduction in electricity tariff of almost Rs. 7.5 per unit was a direct result of the focused work of a dedicated task force on reforms in energy sector.\nHe emphasized that the same results-driven model was now being applied to the maritime sector.\n“This electricity tariff reduction is a major relief not only for households but also for all sectors like agriculture, commerce, trade, and industry. It will bring down the cost of production, improve local manufacturing, generate employment, and enhance exports,” he stated.\nHe said that structural reforms remained central to the government’s economic strategy, which had already stabilized Pakistan’s macroeconomic indicators.\nThe prime minister also highlighted the opportunity presented by the recent drop in global oil prices, and assured that the government was working to harness its long-term benefits for Pakistan’s economy.\nThe meeting reviewed a detailed presentation on the roadmap for maritime sector reforms.\nThe participants of the meeting were briefed on introduction of the Pakistan Maritime Port Act, unifying regulations across all ports, creation of a national dredging plan, including the formation of a National Dredging Company to serve ports across the country.\nThe forum also discussed modernization of the Pakistan National Shipping Corporation (PNSC) with a 25-year rehabilitation plan and inclusion of the private sector through public-private partnerships. It was informed that a hazardous waste disposal plant was set up in Gadani to manage chemical and industrial waste.\nThe prime minister instructed the authorities concerned to accelerate installation of modern scanning systems at all ports, and expedite customs clearance procedures, particularly in red and yellow channels.\nHe also directed that a plan be developed to quickly auction long-held containers to free up port space and improve efficiency.\nThe taskforce also briefed on conducting financial, HR, and performance audits at national ports, enhancing training and human resource development at Karachi Port Trust, and reviewing trade tariffs to boost the competitiveness of Pakistani ports.\nThe prime minister acknowledged the dedication of the maritime task force and other stakeholders involved in crafting the reform agenda.\nHe reaffirmed that maritime resources were key to global trade and Pakistan’s economic future, adding that timely action was essential to remain competitive in an evolving global market.\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, Chief of Army Staff General Syed Asim Munir, federal ministers Khawaja Muhammad Asif, Ahsan Iqbal, Azam Nazir Tarar, Ahad Khan Cheema, Junaid Anwar, Advisor to the PM Syed Tauqeer Shah, the Governor of the State Bank, and other senior officials from relevant ministries and institutions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:15:24.814Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/maritime-energy-sectors-reforms-to-boost-trade-unlock-pakistans-potential-pm/",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T14:23:00.000Z"
}
