{
  "title": "Strengthening  federating units crucial for stronger federation: Tarar",
  "author": null,
  "content": "ISLAMABAD, Apr 07 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Monday that strengthening the federating units is crucial for a stronger federation and called for consensus on all the national issues.\nSpeaking on the floor of the National Assembly, the minister said all political parties, regardless of their positions in the House, had played a pivotal role in fortifying democracy and the federation through decades of sacrifice and struggle.\nHe said,“Political differences and criticism are part of democratic discourse but the sacrifices made by political leaders and parties for democracy remain unparalleled. We are committed to democratic norms and do not believe in bulldozing opinions.”\nReferring to the 1991 Water Accord, he said the agreement, signed by all provinces, laid the foundation for the establishment of the Indus River System Authority (IRSA) under the IRSA Act of 1992 during the tenure of former Prime\nMinister Nawaz Sharif. “The Constitution, the law, and a regulatory system are all in place to ensure fair water distribution,” he added.\nAddressing concerns raised by lawmakers from Sindh, the minister said that technical issues require technical solutions and must be approached through dialogue and mutual understanding. “We are democratic people and believe in consensus-building. We respect all provinces equally—Punjab, Sindh, Balochistan, Khyber Pakhtunkhwa, Gilgit-Baltistan, and Azad Kashmir,” he said.\nCriticizing the opposition leader, he said, “The Leader of the Opposition has proven through his conduct that he is not worthy of that position.”\n“His behavior has shown that he is not fit for the role,” he said, accusing opposition members of undermining the sanctity of the House and lacking seriousness on public issues, particularly those concerning Khyber Pakhtunkhwa and Sindh.\nHe criticized the opposition for misusing impartiality and generosity extended by the Speaker of the National Assembly.\n“Despite being granted the floor—five of their members were allowed to speak—they failed to address national concerns with the gravity they deserve,” he said.\nThe minister also condemned the use of inappropriate language by some opposition members, calling it a violation of parliamentary decorum. “We strongly denounce the disrespectful remarks made by certain members, which were an affront to the dignity of this House,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:15:21.456Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/strengthening-federating-units-crucial-for-stronger-federation-tarar/",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T16:35:00.000Z"
}
