{
  "title": "Mohsin Naqvi arrives at D-Chowk early morning to boost morale of police, FC personnel",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-arrives-at-d-chowk-early-morning-to-boost-morale-of-police-fc-personnel/",
  "date_published": "2024-10-05T07:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): Interior Minister Mohsin Naqvi made an early morning visit to D-Chowk to uplift the spirits of police and Frontier Corps (FC) personnel stationed in the area for the security of Red Zone and to stop the mobsters from storming highly sensitive areas.\nNaqvi expressed his admiration for the officers’ dedication and commitment to maintaining law and order in the capital.\n“Well done! Great job! The nation is proud of you,” Naqvi told the personnel, praising their relentless service.\nThe minister personally met with officers on duty, recognizing their efforts and high morale despite the challenges they faced.\nNaqvi also met with female police officers, acknowledging their hard work and dedication to their duties. He commended them for their role in maintaining public safety and security.\nIn his remarks, Minister Naqvi paid tribute to the officers for their tireless efforts in protecting citizens’ lives and property, noting their around-the-clock service.\n“The morale of Islamabad Police and FC personnel is very high,” he observed, adding that the teams remain vigilant and ready to respond to any situation.\n“I commend all the officers carrying out their duties,” said Naqvi, emphasizing their crucial role in ensuring the rule of law. “The guardians of the law have ensured its enforcement, and you all deserve congratulations.”\nThe interior minister reassured the officers that their service is valued by the nation, stating, “You are fulfilling a national duty with dedication. We are all with you.”\nInspector General of Islamabad Police, Ali Nasir Rizvi, accompanied Minister Naqvi during the visit, further demonstrating the government’s support for the officers serving in critical roles across the capital.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:50:51.859Z"
}
