{
  "title": "Mohsin Naqvi pays glowing tribute to Martyr Lieutenant Colonel Muhammad Ali Shehwat, five soldiers in North Waziristan",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-pays-glowing-tribute-to-martyr-lieutenant-colonel-muhammad-ali-shehwat-five-soldiers-in-north-waziristan/",
  "date_published": "2024-10-05T07:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): Interior Minister Mohsin Naqvi has paid heartfelt tributes to Lieutenant Colonel Muhammad Ali Shehwat and five soldiers who were martyred while bravely confronting the terrorist group Khawarij in the Spin Wam area of North Waziristan on Saturday.\nIn a statement, Naqvi honoured their courage and sacrifice, commending them for laying down their lives in defence of the nation.\n“Martyr Lieutenant Colonel Muhammad Ali Shehwat and five soldiers sacrificed their lives for the secure future of the nation,” Naqvi remarked, acknowledging their ultimate sacrifice in the face of adversity.\nThe soldiers were engaged in a fierce battle with Khawarij militants, known for their brutal tactics when they were martyred.\nNaqvi emphasized that the entire nation stands indebted to these heroes.\n“The nation will always remember the great sacrifices of Martyr Lieutenant Colonel Muhammad Ali Shehwat and other martyrs,” he said, ensuring their legacy will remain etched in the hearts of the Pakistani people.\nThe interior minister also praised the valour and effectiveness of the martyred soldiers in combating terrorism.\n“Martyr Lieutenant Colonel Muhammad Ali Shehwat and other martyrs thwarted the evil plans of the terrorists from Khawarij and sent six Khawarij terrorists to hell,” he declared, highlighting their success in eliminating key terrorist operatives.\nNaqvi reiterated that these fallen soldiers had made the ultimate sacrifice to defend the homeland and crush the terrorists. “The martyrs gave their lives and brought the terrorists of Khawarij to a disgraceful end,” he added.\nIn addition to paying tribute, Mohsin Naqvi expressed his deepest sympathies to the families of the martyrs, offering his condolences and acknowledging their immense loss.\n“All our sympathies are with the families of the martyrs,” he stated, affirming that the government and the people of Pakistan stand in solidarity with the bereaved families.\nThe martyrdom of these brave soldiers serves as a sombre reminder of the ongoing sacrifices made by Pakistan’s armed forces in the fight against terrorism.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:50:53.138Z"
}
