{
  "title": "Khawaja Asif slams PTI for prioritising power over national interests",
  "link": "https://www.app.com.pk/national/khawaja-asif-slams-pti-for-prioritising-power-over-national-interests/",
  "date_published": "2024-10-05T14:30:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Oct 05 (APP):Federal Minister for Defence Khawaja Muhammad Asif strongly criticised Pakistan Tehreek-e-Insaf (PTI) leaders on Saturday, asserting that their desire for power had eclipsed their commitment to the nation.\nAddressing a press conference at his residence in Sialkot Cantonment area, he asserted that the loyalty of PTI and its leader, Imran Khan, lies solely in maintaining authority rather than serving Pakistan’s interests. He said the pattern of behaviour from the PTI was continuing since 2014 when their protests had delayed the visit of the Chinese President and initiation of the China-Pakistan Economic Corridor (CPEC). He said similar behaviour was being shown by the PTI leaders today, when the Shanghai Cooperation Organisation (SCO) summit was round the corner, and the party was all out to undermine Pakistan’s international standing.\nThe defence minister raised concerns about the involvement of armed groups, including hundreds of Afghans, during PTI’s protests. He accused the PTI of hindering Pakistan’s development through their demonstrations, stating, “PTI’s protests have always sought to obstruct Pakistan’s progress.” He raised an alarm at the identification of some protestors as potentially linked to a banned militant group.\nKhawaja Asif said that the PTI was using the public resources to carry out its protests, led by Khyber-Pakhtunkhwa (KP) Chief Minister Ali Amin Gandapur. He referenced historical precedents, reminding the public of PTI’s past actions that delayed international visits and engagements, stating, “Political tensions have always existed, but no party has ever compromised their identity as Pakistanis like the PTI has.”\nThe minister pointed out the stark contrast between PTI’s actions and the sacrifices of Pakistani soldiers, noting that while many have fallen in defence of the nation, the PTI has not paid tribute to these martyrs nor addressed significant international issues such as the Palestinians’ cause. He also linked PTI’s current unrest to fears over improving economic indicators in Pakistan, suggesting that the PTI leadership was anxious about legal troubles and was trying to create chaos in response to the government’s successes. He asserted that the prime minister has effectively presented issues like Kashmir and Palestine on the international platforms, which he believes has unsettled the PTI.\nHe called for accountability for the PTI actions and highlighted the necessity of exposing their alleged connections with foreign elements that did not align with Pakistan’s interests.\nTo a question, he said that the PTI seeks to create chaos and violence. He praised the Punjab police for their resilience in handling the situation, stressing that the armed groups being brought in did not represent the values of Pakistan.\nTo another query, he remarked that the KP chief minister had crossed all limits, making it impossible to rule out any response. The PTI had already exploited the province and was now wasting resources in their assaults, which he labeled as acts against the nation.\nMPAs Muhammad Manshaullah Butt, Chaudhry Faisal Ikram, Shakeela Arthur, PML-N President Sialkot City Muhammad Rafiq Mughal, General Secretary Women’s Wing  Nasrat Jamshed were present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:51:08.706Z"
}
