{
  "title": "10 terrorists killed as security forces thwart attack on checkpost in KP’s Jandola: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces killed 10 terrorists on Thursday who attempted to attack a checkpost in Khyber Pakhtunkhwa’s Jandola area, according to the military’s media wing.\n\nA statement from the Inter-Services Public Relations (ISPR) said the attempt occurred in the Jandola area situated “on the seam of South Waziristan and Tank districts”.\n\nIt added that the attempt to enter the checkpost was “effectively thwarted” by troops, forcing the terrorists to ram an explosive-laden vehicle into the perimeter wall.\n\nThe ISPR said security forces “fought bravely, effectively engaged the assailant and after an intense fire exchange”, all 10 terrorists, including a suicide bomber, were “sent to hell”, outside the post’s perimeter wall.\n\nIt added that a sanitisation operation was being conducted to eliminate any other terrorists found in the area. “Security forces of Pakistan are determined to wipe out the menace of terrorism from the country,” the ISPR said.\n\nInterior Minister Mohsin Naqvi paid tribute to security forces for repelling the attack.\n\n“I salute the security forces for foiling the attack,” he said and commended them for bringing 10 terrorists to “an exemplary end”.\n\n“The nation is proud of the professional capabilities of the security forces and stands by them” in their efforts to eliminate terrorists, Naqvi added.\n\nLast week, security personnel killed three terrorists in an intelligence-based operation in KP’s Tank district.\n\nEarlier this month, 16 terrorists were killed while five soldiers were martyred as security forces responded to a terrorist attack on the Bannu Cantonment in KP’s namesake district.\n\nTe­r­rorists had rammed two exp­losives-laden vehicles into the perimeter of the Bannu Cantonment in an attempt to enter the high-security zone. Thirteen civilians lost their lives, while another 32 were injured as a result of a mosque and a residential building suffering “severe destruction” due to the suicide blasts, causing the perimeter wall to partially collapse.\n\nFebruary saw a marginal increase in terrorist attacks but a sharp surge in civilian casualties, according to a report published by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (PICSS).\n\nAccording to PICSS, the country witnessed 79 terrorist attacks last month, resulting in the deaths of 55 civilians and 47 security personnel, while 45 civilians and 81 security personnel were injured. Security forces, meanwhile, intensified counter-terrorism operations, eliminating 156 terrorists, injuring 20, and arresting 66, it said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:09:08.488Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897661/10-terrorists-killed-as-security-forces-thwart-attack-on-checkpost-in-kps-jandola-ispr",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T12:21:46.000Z"
}
