{
  "title": "Sara Sharif case: Court upholds jail terms for relatives of slain British-Pakistani girl - World - DAWN.COM",
  "author": null,
  "content": "A British court on Thursday upheld lengthy jail terms handed to the parents and uncle imprisoned for killing a British-Pakistani girl, after subjecting her to years of abuse.\n\nThe trial of Urfan Sharif and Beinash Batool caused waves of revulsion in the UK as the horrific abuse suffered by the 10-year-old girl was revealed in a London court. There was anger too at how the bright, bubbly youngster had been failed by all the authorities supposed to be in charge of her care.\n\nUrfan, 43, Beinash, 30 and the girl’s uncle, 29-year-old Faisal Malik, all lost appeal bids to reduce their sentences today.\n\nThe court also refused a plea by the solicitor general’s office to impose a stiffer whole life sentence on Urfan.\n\nSara’s father was sentenced in December to 40 years in prison for her murder, while her stepmother was ordered to remain in jail for at least 33 years. Her uncle was sentenced to 16 years after being found guilty of causing or allowing her death.\n\nSara’s body was found in bed at the family home in August 2023 covered in bites and bruises with broken bones and burns inflicted by an electric iron and boiling water.\n\nSeeking to reduce Sharif’s term, lawyer Naeem Majid Mian argued that although Sara’s treatment had been “horrendous”, it did not merit his 40-year sentence.\n\n“There was no intention to kill … and [the death] was not premeditated,” he added.\n\nBut documents submitted to the court on behalf of the solicitor general, one of the government’s top legal officers, called for Sharif to have an indefinite sentence imposed.\n\n“It is submitted that the judge was wrong not to impose a whole life order on the offender,” said lawyer Tom Little in a text submission.\n\nA lawyer for Sara’s stepmother also told the court that her sentence of 33 years was too long and did not “justly reflect her role”.\n\nDismissing Sharif’s appeal, Lady Chief Justice Sue Carr, the highest-ranking judge in England and Wales, said: “We can see no arguable basis to challenge the conclusion of the trial judge.”\n\nPassing sentence in December after the trial, Judge John Cavanagh said Sara had been subjected to “acts of extreme cruelty” but that Urfan and Batool had not shown “a shred of remorse”.\n\nThey had treated Sara as “worthless” and as “a skivvy”, because she was a girl. And because she was not Batool’s natural child, the stepmother had failed to protect her, he said. “This poor child was battered with great force again and again.”\n\nSara’s father, 43, was sentenced to 40 years in prison, while her stepmother, 30, was ordered to remain in jail for at least 33 years.\n\nBoth were appealing their terms at the Royal Courts of Justice, along with Sara’s uncle, Faisal Malik, 29, who lived with the family and was sentenced to 16 years after being found guilty of causing or allowing her death.\n\nSolicitor General Lucy Rigby appealed the sentence imposed on Urfan, maintaining it was “unduly lenient”.\n\nA post-mortem examination of Sara’s body revealed she had 71 fresh injuries and at least 25 broken bones.\n\nShe had been beaten with a metal pole and cricket bat and “trussed up” with a “grotesque combination of parcel tape, a rope and a plastic bag” over her head.\n\nA hole was cut in the bag so she could breathe, and she was left to soil herself in nappies as she was prevented from using the bathroom.\n\nPolice called the case “one of the most difficult and distressing” that they had ever had to deal with.\n\nThe day after Sara died, the three adults fled their home in Woking, southwest of London, and flew to Pakistan with five other children.\n\nHer father, a taxi-driver, left behind a handwritten note saying he had not meant to kill his daughter. After a month on the run, the three returned to the UK and were arrested after landing. The five other children remain in Pakistan.\n\nThere has been anger in the UK that Sara’s brutal treatment was missed by social services after her father withdrew her from school four months before she died.\n\nUrfan and his first wife, Olga, were well-known to social services.\n\nIn 2019, a judge decided to award the care of Sara and her older brother to Urfan, despite his history of abuse.\n\nThe school had raised the alarm about Sara’s case three times, notably after she arrived in class wearing a hijab she used to try to cover marks on her body that she refused to explain.\n\nSince December, the government has moved to tighten up the rules on home-schooling.\n\nSara’s body was repatriated to Poland, where her mother is from, and where a funeral was organised.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/13122316808624e.png",
  "retrievedAt": "2025-08-25T15:09:08.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897635/sara-sharif-case-court-upholds-jail-terms-for-relatives-of-slain-british-pakistani-girl",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T07:23:40.000Z"
}
