{
  "title": "Deadline for appointing new CEC passes with no sign of action by govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The constitutional deadline for the appointment of new chief election commis­sioner and two Election Com­mission of Pakistan members exp­ired on Wednesday, with no action from the government in sight.\n\nThe five-year terms of Chief Election Commissioner (CEC) Sikandar Sultan Raja, Sin­dh Member Nisar Durrani and Baloch­istan Member Shah Muhammad Jatoi ended on Jan 26, but they will continue to indefinitely hold the offices by virtue of a controversial amendment made in the Constitution in October last year.\n\nThe 26th Amendment allowed the CEC and the members to continue till their successors come in. As per Article 215(4) of the Constitution, the appointment of the CEC and members must be completed within 45 days. This deadline expired on March 12, yet no concrete steps have been taken.\n\nThe parliamentary committee, which is essential for finalising the appointments, has not been formed despite an earlier anno­uncement by the speaker of the National Assembly.\n\nSikandar Raja’s five-year term ended on Jan 26, but he will continue to hold office indefinitely due to a ‘disputed’ constitutional amendment\n\nThe government has remained silent on the matter, and no progress has been made towards formation of the parliamentary committee requ­ired for these appointments.\n\nThe appointment process requ­ires consultation between the prime minister and the leader of opposition, who must agree on nominees for the three vacant positions.\n\nIf a consensus is reached, the proposed names are sent to the parliamentary committee for approval. In case of disagreement, each side submits three names per position, and the committee makes the final decision.\n\nThe breakdown of opposition representation incl­udes three members from PML-N, one from PPP, and one from MQM, while PTI will have five members, and JUI-F one. However, the committee is yet to be formed, causing further delays in the appointment process.\n\nAmid this deadlock, informed sources said PTI has begun consultations on approaching the courts over the delay. The PTI has also sought nominations from other opposition parties and plans to propose names accordingly.\n\nSources said discussions were underway in the government circles over the reappointment of Sikandar Sultan Raja as the CEC.\n\nThe Constitution is silent on whether a sitting CEC can be reappointed. However, under Article 216(2) of the Constitution, the CEC and members of the ECP hold a profitable position for two years after completing their term.\n\nIf the government moves forward with Mr Raja’s reappointment, a legal debate is expected to arise.\n\nCriteria for appointments\n\nFormer Supreme Court judges, technocrats and bureaucrats below the age of 68 are eligible for consideration for the post of CEC, while retired high court judges, bureaucrats and technocrats below the age of 65 are eligible to become the Election Commission members.\n\nMr Raja’s term is characterised by controversies. He is often criticised by the opposition for his failure to hold timely general elections, denying PTI its iconic poll symbol of ‘bat’ and playing key role in alleged manipulation of election results.\n\nDistrust in him had been expressed long before the delayed general elections 2024. In July 2022 the Punjab Assembly passed a resolution expressing doubts over the neutrality of the ECP.\n\nThe resolution called for Mr Raja and the other commission members to resign, demanding an unbiased and reliable electoral body to guarantee free and fair elections.\n\nIn December 2023, the PTI challenged the appointment of bureaucrats as returning officers and district returning officers, arguing that such appointments could result in biased and unfair decisions.\n\nInitially, the Lahore High Court suspended the ECP’s decision, but the Supreme Court, later, overturned this ruling, allowing the appointments to proceed. Afterwards, several PTI leaders had their nomination papers rejected, which led the party to accuse the ECP of pre-poll rigging.\n\nThe present ECP also comes under fire over its not implementing the Supreme Court’s judgment on reserved seats and failure to hold Senate elections in Khyber Pakhtunkhwa.\n\nA day earlier, Leader of the Opposition in the Senate Shibli Faraz had called for trial of the CEC and ECP members under Article 6 of the Constitution.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:55:35.542Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897583/deadline-for-appointing-new-cec-passes-with-no-sign-of-action-by-govt",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:22.000Z"
}
