{
  "title": "ICC thanks Pakistan for ‘successfully hosting’ Champions Trophy - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: The International Cricket Council (ICC) on Wednesday thanked the Pakistan Cricket Board (PCB) for “successfully hosting” the recently concluded ICC Champions Trophy.\n\nIn a press release, the global governing body of the sport also thanked the Emirates Cricket Board (ECB) for the staging of India’s matches of the tournament.\n\nIndia played their matches in Dubai after the country’s government refused to send its team to Pakistan, the original hosts of the tournament. Playing all their five matches — including a semi-final and the final — at the venue, Rohit Sharma’s men claimed the Champions Trophy title for the third time after defeating New Zealand by four wickets on Sunday.\n\nThe event, which took place from February 19 to March 9, saw Pakistan host their first global cricket tournament since 1996. The tournament was hosted across four venues: Karachi, Lahore and Rawalpindi in Pakistan and Dubai in the United Arab Emirates.\n\n“We would like to thank and congratulate the Pakistan Cricket Board for successfully hosting the ICC Men’s Champions Trophy 2025,” ICC chief executive Geoff Allardice said.\n\n“As this was the first global multi-team cricket event played in the country since 1996, this event was of huge significance for the PCB, and all those involved in renovating the stadiums, preparing the playing surfaces, delivering the matches and hosting the teams and visitors should be very proud of their efforts.”\n\nThe ICC statement comes two days after the PCB launched a formal protest, seeking from the former a public apology for its “blatant disregard for Pakistan’s role as the host nation”.\n\nIn its complaint, the PCB had called out the ICC for not including the board’s chief operating officer — also the Champions Trophy’s tourament director — in the post-match ceremony of the final.\n\nIn the PCB’s viewm the incident was one of ICC’s “repeated blunders”, which included the absence of Pakistan’s name in the Champions Trophy’s official logo on the live feed of the group stage match between India and Bangladesh, as well as a part of the Indian national anthem being played in the Gaddafi Stadium ahead of the Australia-England game.\n\nThe ICC is yet to respond to the PCB’s grievances, despite the body’s credibility under the radar.\n\n“The ICC’s repeated blunders, double standards, and selective governance have cast serious doubts over its credibility,” a PCB spokesperson told Dawn on Monday. “By sidelining the host nation at its own tournament, the governing body has once again shown a troubling lack of neutrality and fairness.”\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:09:25.228Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897555/icc-thanks-pakistan-for-successfully-hosting-champions-trophy",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:44.000Z"
}
