{
  "title": "US urges Russia to agree upon Ukraine truce ‘unconditionally’ - World - DAWN.COM",
  "author": null,
  "content": "SHANNON/PARIS: The United States said on Wednesday it was asking Russia to “unconditionally” agree to a month-long ceasefire in Ukraine, a day after US and Ukrainian officials agreed to put the plan to Moscow.\n\nUkrainian President Volodymyr Zelensky said Kyiv had shown it was ready to embrace the deal to halt the fighting and that the United States had indicated it would issue a “strong” response if the Kremlin refused. Tens of thousands have been killed in the three-year war that has raged since Russia’s February 2022 invasion. The joint US-Ukrainian proposal marks the latest in a series of rapid developments in the search for a truce.\n\nIt comes less than two weeks after US President Donald Trump kicked Zelensky out of the White House and then halted all military aid and intelligence sharing with Kyiv. The US restarted supplies after Ukraine agreed to the truce proposal at talks in Saudi Arabia on Tuesday.\n\nSecretary of State Marco Rubio said the United States was now seeking Moscow’s full agreement to the proposal, without attaching any of its own demands. “That’s what we want to know — if they’re prepared to do it unconditionally,” Rubio said. “If the response is, ‘yes’, then we know we’ve made real progress, and there’s a real chance of peace. If their response is ‘no’, it would be highly unfortunate, and it’ll make their intentions clear.”\n\nZelensky expects ‘strong’ action from US if Russia refuses truce\n\nFrench Defence Minister Seba­stien Lecornu said on Wednes­day that about 15 countries had expressed interest in discussing a new security architecture for Ukraine. He was speaking after a meeting in Paris with the defence ministers of Britain, Germany, Italy and Poland.\n\n‘No trust’\n\nIn its first comments on the idea, the Kremlin said it was waiting for further information. But the Russian foreign ministry earlier this month said a temporary ceasefire was “unacceptable”. In Kyiv, Zelensky said the United States would pile pressure on Moscow if it did not accept the idea. “I understand that we can count on strong steps. I don’t know the details yet but we are talking about sanctions and strengthening Ukraine,” Zelensky told reporters.\n\n“Everything depends on whether Russia wants a ceasefire and silence, or it wants to continue killing people,” the Ukrainian leader added. But he said there was no faith among Ukrainians when it came to the idea of a truce with Russia. “I have emphasised this many times, none of us trust the Russians.”\n\nThe offer comes at a difficult moment on the battlefield for Ukraine. It is losing ground in the east and south of the country, where officials said eight people were killed on Wednesday. Even if Russian President Vladimir Putin agrees to a ceasefire, much remains uncertain in negotiations. Ukraine has pressed for security guarantees, but Trump has ruled out Nato membership.\n\nKremlin spokesman Dmitry Peskov said he assumed Rubio and National Security Adviser Michael Waltz would “inform” Moscow “on the negotiations that took place and the understandings reached”.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d20d423e94e.jpg",
  "retrievedAt": "2025-08-25T15:09:24.556Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897579/us-urges-russia-to-agree-upon-ukraine-truce-unconditionally",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:59.000Z"
}
