{
  "title": "Attack on Jaffar Express cannot dampen nation’s morale: railways minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Railways Minister Hanif Abbasi on Wednesday strongly condemned the terrorist attack on innocent passengers of Jaffar Express in Bolan and termed it a cowardly act.\n\nIn a statement, the minister said that the attack cannot dampen our morale as the nation is united to defeat such elements.\n\nHe said that Pakistani forces and security agencies were protecting every inch of the country including Balochistan.\n\nHe said the brave people of Balochistan would not bow down to such elements.\n\n“We are grateful to the security agencies and the Balochistan government for their cooperation and prompt response to the cowardly act. The terrorists will be brought to justice and no criminal will be spared,” he said.\n\nTehreek-i-Nifaz Fiqh-i-Jafaria (TNFJ) Chief Allama Agha Syed Hussain Muqaddasi strongly condemned the terrorist attack on Jaffar Express in Bolan where innocent passengers were taken hostage. He said India and its agents were behind the attack.\n\nIn a statement issued from the headquarters of Maktab-i-Tashayyu Ali Masjid, he emphasised that the entire nation stands behind the Pakistan Armed Forces in their mission to bring terrorists to their logical end.\n\nHe asserted that “only a decisive response, akin to ‘Zarb-i-Haider’, can send the pawns of foreign powers to hell”. Agha Muqaddasi urged the military leadership to set aside any compromises and take strict action against banned terrorist organisations.\n\nHe appealed to all political and religious leaders, as well as the general public, to exhibit unity and solidarity in this challenging time.\n\nHe stressed that regardless of affiliations, everyone must stand with the defenders of the homeland against its enemies.\n\nHe called on the government to prioritise the safe release of the hostages and ensure the protection of national interests.\n\nFurthermore, the TNFJ chief urged the people to offer special prayers during this holy month of Ramazan for the success of the motherland in overcoming these challenges.\n\nBusiness leaders denounce attack\n\nIslamabad Chamber of Commerce and Industry (ICCI) leaders also condemned the terrorist attack on the Jaffar Express and praised the security forces for their effective response in rescuing the passengers.\n\nIn a statement, union leaders of ICCI commended the bravery and dedication of the security personnel, stating that their courageous efforts ensured the safety of innocent passengers.\n\nThey denounced the attack as a cowardly and inhuman act, emphasising that such elements are enemies of Pakistan’s peace, progress and development.\n\nThey stressed that those responsible deserve no leniency.\n\nThey also extended heartfelt prayers for the swift recovery of those injured in the attack. Despite the challenging terrain, they acknowledged the “unwavering morale of the security forces, who effectively countered the terrorists through their prompt action”.\n\nThe ICCI leaders including President Nasir Mansoor Quresh, Senior Vice President Abdul Rehman Siddiqui and Vice President Nasir Mehmood Chaudhry expressed deep concern over the tragic incident.\n\nAny conspiracy aimed at destabilising the country will be thwarted and the entire nation stands united in solidarity with its security forces to ensure peace and stability, they said.\n\nAwam Pakistan Party leader Chaudhry Inam Zafar also condemned the terrorist attack on the Jaffar Express.\n\n“I commend the security forces for their effective action. The role of the Pakistan Army has always been exemplary. The development and progress of Pakistan is a credit to the services of the Pakistani Armed Forces,” he said in a statement.\n\nChaudhry said: “No matter how many anti-national acts terrorists carry out, failure is their destiny. Pakistan’s forces are considered among the best forces in the world.”\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:09:10.882Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897501/attack-on-jaffar-express-cannot-dampen-nations-morale-railways-minister",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:49:37.000Z"
}
