{
  "title": "Muslim students pin hopes on US courts to halt deportations - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Many Muslim students in the US, especially those involved in last year’s pro-Palestinian protests, are increasingly worried about the Trump administration’s efforts to deport foreign nationals linked to such demonstrations.\n\nThese students are now hoping that the US judicial system will protect them from potential deportations as part of the administration’s broader crackdown on political activism. Their hopes were strengthened this week when a federal judge temporarily halted the deportation of Mahmoud Khalil, a Columbia University graduate and prominent pro-Palestinian activist detained by US Immigration and Customs Enforcement (ICE).\n\nUS District Judge Jesse M. Furman issued an order forbidding the government from deporting Khalil before a hearing scheduled for Wednesday. “To preserve the court’s jurisdiction pending a ruling on the petition, petitioner shall not be removed from the United States unless and until the court orders otherwise,” said Judge Furman, an appointee of former President Obama.\n\nKhalil, a green card holder, was arrested as part of a federal effort to target foreign nationals involved in protests for Palestine.\n\nBroader crackdown on students protesting against Israel instils fear among many\n\nTazeen, a student, discussing the issue in a small group at the Turkish Diyanet Centre in Maryland, summed up the collective sentiment of fear and uncertainty. “Afraid they are, but they hope that the American judicial system will rescue them,” she said.\n\nThe Diyanet Centre, which hosts one of North America’s largest mosques and offers free iftar, has become a key space for informal social gatherings. Although no one in this small group of students outside the mosque’s cafeteria admitted to receiving deportation notices, many were aware of others in similar situations.\n\n“People are afraid,” said Yunus, who preferred not to give his full name. “Nobody wants to be deported. We hope the courts will help us.”\n\nAshraf, another student, said the First Amendment of the US Constitution “guarantees freedom of speech. We know our courts take this very seriously”.\n\nBut the looming fear has led many students to remain silent about their participation in protests, despite the widespread support they received during and after the demonstrations.\n\nIn response to the Trump administration’s policies, students have begun organising. On Tuesday, dozens of Chicago varsity students and faculty rallied in support of Khalil, joining protests in New York. “We don’t want our friends and colleagues to be deported,” said Prof Callie Maidhof.\n\nAn online petition seeking Khalil’s release garnered 500,000 signatures, urging both US agencies and universities to intervene.\n\nHowever, the Trump administration has launched a “Task Force to Combat Anti-Semitism”, which has visited varsities such as Columbia, George Washington, and Harvard. Also, the administration has introduced an ‘AI-fuelled Catch and Revoke’ initiative aimed at canceling the visas of foreign nationals believed to support Hamas.\n\nTrump publicly endorsed ICE’s actions, referring to Khalil as a “radical foreign pro-Hamas student” and warning similar actions against other protesting students. “We know there are more students at Columbia and other universities who have engaged in pro-terrorist, anti-Semitic, anti-American activity,” Trump said, adding that the administration would not tolerate it.\n\nSecretary of State Marco Rubio announced plans to revoke visas or green cards for those supporting Hamas, leading to their deportation.\n\nMeanwhile, the Council on American-Islamic Relations (CAIR) in a report showed a record number of anti-Muslim and anti-Arab incidents in 2024. The group received 8,658 complaints, a 7.4pc increase from the previous year, marking the highest number of incidents since CAIR began compiling data in 1996.\n\nAt the University of Connecticut, students and staff voiced their opposition to proposed hate-speech legislation during a public hearing.\n\nReem Saood, a member of the university’s Muslim Student Association, warned the bill could lead to increased surveillance of students and further tensions with law enforcement. “This bill will create a culture of fear, intimidation, and censorship,” she said.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d20975eded9.jpg",
  "retrievedAt": "2025-10-12T01:55:32.796Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897560/muslim-students-pin-hopes-on-us-courts-to-halt-deportations",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:10.000Z"
}
