{
  "title": "RLNG prices raised for March - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With system losses stubborn at a record 16.16 per cent, the Oil and Gas Regulatory Authority (Ogra) on Wednesday notified almost half a per cent increase in the price of Regasified Liquefied Natural Gas (RLNG) for sale to consumers by the two Sui gas companies for the current month. This is on top of about 2pc increase in RLNG sale price last month.\n\nKarachi-based Sui Southern Gas Company Ltd (SSGCL) serves consumers in Sindh and Balochistan, and Ogra approved an increase in its system losses from 13 to 16.16pc. On the other hand, Lahore-based Sui Northern Gas Pipeline Ltd (SNGPL) provides gas to consumers in Punjab and Khyber Pakhtun­khwa, and its system losses stood at 8.6pc compared to 8pc earlier.\n\nAccording to notification, the RLNG’s sale price for SNGPL at the transmission stage had been increased by 0.36pc to $12 per million British thermal unit (mmBtu) for March against $11.96 per mmBtu in February. The sale price at the distribution stage for SNGPL was jacked up by 0.37pc to $12.95 per mmBtu for the current month against $12.90 for February.\n\nOn the other hand, the RLNG sale price for SSGCL increased at the transmission stage by 0.41pc $10.69 per mmBtu for March from $10.64 per mmBtu last month. The sale price at the distribution stage for the company was also raised by 0.42pc to $12.726 per mmBtu for the current month against $12.67 per mmBtu in February. The significant difference between the transmission and distribution of about $2 (about Rs560) per mmBtu is mainly because of high losses at the distribution stage.\n\nThe overall increase in absolute terms for SSGC’s transmission price amount­­ed to $0.044 and $0.053 per unit at distribution point. The increase in RLNG price for SNGPL at transmission was reported at $0.43 and $0.047 for distribution.\n\nIronically, the RLNG distribution prices for SSGCL and SNGPL are $12.72 and $12.95 per mmBtu, almost $3.94 and $3.72 per mmBtu higher than the Pakistan State Oil’s $8.96 average delivered price ex-ship.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:55:56.363Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897564/rlng-prices-raised-for-march",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:32.000Z"
}
