{
  "title": "Oman offered Gwadar, Karachi ports use for access to Central Asia - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan has offered Oman the use of Gwadar and Karachi ports for greater access to emerging markets in Central Asia.\n\nThe offer was made during a high-level meeting between Commerce Minister Jam Kamal and his Omani counterpart, Qais Al Yousif in Muscat this week.\n\nAn official announcement issued by the commerce ministry in Islamabad said the two sides discussed strategies to enhance bilateral trade and investment. There was also consensus on the need to improve transportation links and to utilise Pakistan as a trade route to Central Asian countries.\n\nThe Pakistani delegation highlighted the potential of Gwadar and Karachi ports as vital hubs for regional trade, offering Oman greater access to emerging markets. The meeting focused on sector-specific cooperation in textiles, small and medium enterprises (SMEs), agriculture, food security, and manufacturing.\n\nJam Kamal holds talks with Omani counterpart; Islamabad invites Muscat to explore investment opportunities\n\nThe two ministers emphasised the importance of industrial collaboration, joint ventures, and agricultural trade to ensure a sustainable supply chain.\n\nPakistan invited Oman to explore investment opportunities in its industrial and manufacturing sectors.\n\nCommerce Minister Jam Kamal shed light on Pakistan’s industrial expertise and business competitiveness. “Oman can benefit from Pakistan’s expertise, knowhow, and industrial and commercial prowess to achieve the economic diversification goals outlined in Vision 2040, its long-term plan for development and reforms.”\n\nJam Kamal reiterated Pakistan’s commitment to expanding economic cooperation with Oman.\n\nQais Al Yousif acknowledged Pakistan’s strategic significance in regional trade, highlighting that “historical ties and geographic proximity render Pakistan the most effective trade route to Central Asian states”.\n\nHe expressed Oman’s interest in strengthening its economic partnership with Pakistan and expanding trade and investment opportunities in key sectors.\n\nThe two ministers reaffirmed their dedication to working together on economic initiatives, expanding trade, and strengthening investment ties.\n\nThe meeting concluded with iteration of a shared vision to explore new opportunities for mutual growth.\n\nThe Omani delegation included Saleh Said Misan, Ibtisam Ahmed Al Farougi, Rashid Said Rashdi, Khalid Ali Al Habsi and Suhaib Amir Al Sawafi.\n\nThe Pakistani delegation comprised Ambassador Syed Naveed Safdar Bokhari, Ishrat Bhatti and Talha Khan.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/13095921c6b79b0.jpg",
  "retrievedAt": "2025-08-25T15:09:41.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897559/oman-offered-gwadar-karachi-ports-use-for-access-to-central-asia",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:48:10.000Z"
}
