{
  "title": "‘Face to face with death’: Jaffar Express survivors recall two days of horror - Pakistan - DAWN.COM",
  "author": null,
  "content": "In the dead of the night, Muhammad Numan saw a chance. The three armed men guarding his bogie were in a deep sleep. Quickly, he put together an escape plan. “It’s a gamble of life and death … it is now or never,” he convinced fellow passengers.\n\nAnd so the 30-year-old, along with over a dozen others aboard the Jaffar Express, snuck outside the train and into the wilderness of the surrounding mountains. Behind them, they could hear the commotion. Shots rang out in all directions. But they didn’t look back. “We walked for four hours and stopped only when we reached a Frontier Corps checkpoint,” said Numan.\n\nOn March 11, terrorists affiliated with the outlawed Balochistan Liberation Army (BLA) attacked the Jaffar Express near the Mashkaf Tunnel, about 157 kilometres from Quetta, and took around 440 passengers hostage. The hijacking was a first-of-its-kind — while terrorists have bombed train tracks and attempted to derail trains before, they have never attempted to take an entire train and its occupants hostage.\n\nSubsequently, the military began a recovery operation which culminated last night. In a press release, the military’s media wing said all the hostages had been rescued while 33 terrorists involved in the attack were killed.\n\nAccording to Inter Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry, the operation was conducted by the army, air force, FC and the Special Services Group. He added that 21 passengers were killed before the clearance operation began while four FC personnel were martyred.\n\nNuman was among the fortunate passengers who came out unharmed from the hijacking. But most of his friends did not. “About 20 of us were working in Afghanistan for the past several months and decided to return home [to Gujranwala and Lahore] for a few weeks,” he told Dawn.com.\n\nUnfortunately, only three of them remained alive — others have either been killed or remain missing. Some of them were even murdered in front of Numan’s eyes. “After the train jolted to a stop, firing ensued. The terrorists then entered the bogies and began checking everyone’s identity cards.”\n\n“They threatened to kill us all if the government refused to fulfil their demands,” he recalled. “They [the terrorists] were a big group, they had even taken positions in the mountains.”\n\nMuhammad Naveed, another passenger who managed to escape, said the terrorists asked them to come out of the train one by one. “They separated women and asked them to leave. They also spared elders.\n\n“They asked us to come outside, saying we will not be harmed. When around 185 people came outside, they chose people and shot them down.”\n\nArslan Yousaf, one of the passengers who was escorted by security forces, recalled that the terrorists were armed with rocket launchers, guns, and other weapons. They grouped the passengers on the basis of their region of origin, he said.\n\n“Sometimes, they took soldiers … and executed them,” he said, referring to passengers from the Pakistan Army and other security forces who were travelling on the train. “Other times, they targeted specific individuals. If they had a grudge against someone, they shot him on the spot.”\n\nMuhammad Ashraf, 75, who was travelling to Lahore on the Jaffar Express, told Dawn.com that all the passengers were in a state of panic. “Some of us lay on the floor face down.”\n\n“They killed at least 10 people within one hour which included three Railway Police personnel and as many police commandos. Their weapons were taken away by the terrorists,” he recalled. Ashraf added that he was only allowed to go due to his old age.\n\n“I left on foot and reached the Paneer station after three hours after which FC personnel took me and other passengers to Mach in a relief train,” he said. They returned to Quetta last night.\n\n“I saw qiyamat and death very closely but it was God who saved me and many other passengers despite the fact that they wanted to kill everyone,” Ashraf added.\n\nBabar Masih, a 38-year-old Christian labourer, underwent a similar experience. He and his family walked for hours through rugged mountains to reach a train that could take them to a makeshift hospital on a railway platform.\n\n“Our women pleaded with them and they spared us,” he said. “They told us to get out and not look back. As we ran, I noticed many others running alongside us.”\n\nAt the Quetta railway station last night, the platforms were crowded with family members eagerly waiting for their loved ones. All the rescued hostages were being brought back.\n\nAbdul Rauf, 30, was among those waiting. His eyes were darting from the tracks to the freight trains, searching for a familiar face. He had spent the last two days at the station. “I bid farewell to my father on Tuesday … he was going to Multan to attend the funeral of a nephew,” he said.\n\n“In the last few hours, I have asked everyone about my father but didn’t get any information despite the passage of 36 hours,” he said, adding that his father was not on the list of passengers who were to return that night.\n\n“Where are the authorities? Who will listen to the aggrieved families waiting for information on the whereabouts of their beloved,” he lamented. “We have served all our lives for this country, why is this happening to us?”\n\nAdditional input from AFP and Reuters\n\nHeader image: Train passengers sit in a bus after being freed by armed terrorists who ambushed the train in the remote mountainous area of southwestern Balochistan province, in Mach, on March 13, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/1312595029b1f6f.jpg",
  "retrievedAt": "2025-08-25T15:09:07.147Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897633/face-to-face-with-death-jaffar-express-survivors-recall-two-days-of-horror",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T08:24:31.000Z"
}
