{
  "title": "Govt maintains eerie silence in NA over train hijacking - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Omar Ayub attributes attack to ‘incompetence, gross intelligence failure’\n• MNAs irked by ministers’ absence\n\nISLAMABAD: The coalition government on Wednesday maintained an uncanny silence in the National Assembly over the hijacking of the Jaffar Express in Balochistan, despite scathing criticism from Opposition Leader Omar Ayub Khan, who slammed the handling of the attack that shook the nation.\n\nSurprisingly, no one from the federal cabinet bothered to give a policy statement on the incident, even though several key ministers, including Defence Minister Khawaja Asif, newly-inducted Minister of State for Interior Talal Chaudhry and Law Minister Azam Nazeer Tarar, were seen in the house during the opposition leader’s nearly two-hour-long speech.\n\nThe opposition leader’s speech formally opened the debate on the March 10 address of President Asif Zardari to the joint sitting of parliament.\n\nAt the outset, the opposition leader asked the chair to suspend the normal business of the house to allow the members to hold a debate on the Jaffar Express incident, but PPP’s Abdul Qadir Patel, who was presiding over the sitting in the absence of the speaker and the deputy speaker, ignored his call.\n\nHis announcement of the Question Hour prompted a noisy protest by the opposition lawmakers, belonging to the PTI.\n\nAfter raising slogans for a few minutes, the opposition members staged a walkout, leaving behind MNA from Khyber Iqbal Khan to point out the quorum. Mr Patel, however, declared the house in order after a headcount and allowed the members to ask supplementary questions. The PTI lawmakers returned to the house after the completion of the Question Hour.\n\nOpposition leader’s speech\n\nFinally, taking the floor to initiate traditional debate on the presidential address, Omar Ayub slammed the chair for not allowing a debate on the Bolan incident. “Balochistan is burning and the government is doing business as usual,” said Mr Khan. While pointing towards some of the treasury members who were busy in chit-chat, the opposition leader said that this showed the “seriousness” on the part of the government to deal with terrorism.\n\nInterestingly, Mr Khan started his speech with criticism of the government for its handling of the latest terror attack in Balochistan. He then consumed most of his time in highlighting the alleged political victimisation of the opposition members and incarcerated PTI’s founding chairman, Imran Khan. His speech ended with his party’s demand regarding the formation of the judicial commission on the May 9 and Nov 26 incidents, in which a number of PTI activists allegedly became victims of state oppression.\n\nHe also called for releasing the reports of Hamoodur Rehman Commission on the 1971 tragedy, Abbot­tabad Commission and on the attacks on Salala checkpoint and the Army Public School attack in Peshawar.\n\nThe opposition leader termed the attack on Jaffar Express “a gross intelligence failure”, questioning how dozens of terrorists managed to gather in broad daylight to carry out such a heinous act without getting noticed by the intelligence agencies. He said it was the soldiers and officers of the armed forces who were suffering the most due to such failures. On the other hand, he said, the police and all types of forces with riot gear would reach the location even if there were five PTI members present.\n\nStating that there were 13 intelligence agencies operating in the country, Mr Khan alleged that the focus of all these agencies was on targeting the opposition. He alleged that the Balochistan government was only interested in taking action against opposition leaders, like Mahmood Achakzai, Akhtar Mengal and Mahrang Baloch, whereas it was unable to locate and find terrorists. He claimed that there were 37 districts in Balochistan that had become “no-go areas”. Mr Khan then criticised the government’s economic policies and challenged its claim regarding the reduction in price hikes and inflation.\n\nMinisters absent from house\n\nEarlier, during the Question Hour, the government faced the wrath of the opposition as well as coalition partners over the absence of the ministers from the proceedings. The issue was raised by PPP’s Naveed Qamar and then a number of other lawmakers, who resented the absence of the ministers despite recent inductions in the federal cabinet. Mr Patel deferred the questions related to the energy division due to the absence of the minister.\n\nAt one point, Noor Alam Khan of the JUI-F asked the PPP to consider joining the opposition as it was not getting any positive response from the PML-N on any issue, including the canals on the River Indus. Mr Patel responded that the PPP could consider it.\n\nHe later adjourned the sitting till Thursday morning (today).\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/13082159475e207.jpg",
  "retrievedAt": "2025-10-12T01:56:20.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897590/govt-maintains-eerie-silence-in-na-over-train-hijacking",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:47:45.000Z"
}
