{
  "title": "Gandapur boasts about KP’s Rs150bn fiscal surplus - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur has said the province’s financial position has improved since he assumed office a year ago, with a surplus of Rs150 billion.\n\nDuring a late night cabinet meeting here, the chief minister said his government faced serious financial issues during early days and had funds just to cover 15 days of employee salaries, but the situation was different now as it increased revenue without imposing any new taxes, according to an official statement from the Chief Minister’s Secretariat.\n\nThe meeting was attended by cabinet members, chief secretary, additional chief secretary, senior member board of revenue, administrative secretaries, and the provincial advocate general.\n\nThe chief minister said the province’s current account posted Rs150 billion surplus.\n\nCabinet okays bill for judicial officers welfare fund\n\nHe said without imposing any new taxes, the province had increased its income by 50 per cent, while all allocated funds were released for the annual development schemes.\n\nMr Gandapur said his government had cleared all frozen funds as well.\n\nHe pointed out that the health card scheme was halted but his government not only restarted it.\n\nThe chief minister said despite the widening of its coverage, the scheme saved Rs900 million just within a month.\n\nHe said that his liabilities valuing Rs87 billion were cleared and KP became the first province to have established a debt retirement fund and reserved Rs30 billion for it.\n\n“As far as new schemes, the first-ever provincial transmission line was taken up at a cost of Rs18 billion to provide cheap electricity to the industrial units,” he said.\n\nThe cabinet approved a draft bill for establishing the Khyber Pakhtunkhwa Judicial Officers Welfare Fund aimed at supporting judicial officers in health emergencies, accidents, natural disasters and post-retirement needs.\n\nIt also accorded approval to a special grant of Rs667.5 million as payment for 150 kanals of land to Peshawar Development Authority for building the Khyber Pakhtunkhwa Judicial Academy in Regi Model Town, Peshawar.\n\nRelaxing the ban on purchase of vehicles, the cabinet approved a Rs9.93 million additional grant for Peshawar High Court for buying vehicles for the official use of judges. It approved posts of various cadres at the ombudsman secretariat.\n\nThe chief minister ordered speedy work on the establishment of a car park near the buildings of the Peshawar High Court and district courts.\n\nThe cabinet approved the draft amendment to Sections 2 and 3 (sub-sections 1-4) of the KP (Appointment, Deputation, Posting/Transfer of Teachers, Instructors and Doctors) Regulatory Act, 2011.The amendment substituted the words “union council” with “educational cluster” in the Act.\n\nIt approved the draft notification for establishing the Water and Sanitation Services Company in Haripur and a non-ADP scheme of Rs310.696 million for construction of an auditorium at the Abbottabad Public School, Abbottabad.\n\nThe cabinet approved release of Rs3.3 million for the Institute of Management Sciences as financial assistance for four students whose startup “Eagle Tasker” was chosen for the global finale for Hult Prize competition in the US.\n\nThe participants also allowed the unfreezing of the ADP scheme, titled Establishment of Boys Campus of Model Institute Zamungkor in Peshawar. The scheme is aimed at extension of the institute with a cost of Rs492.76 million. Zamungkor was established in line with the Child Protection and Welfare Act, 2010, in 2016 to cater to the needs of vulnerable and destitute children.\n\nAlso, the cabinet approved an annual sustenance fund of Rs10 million for Umeed Special Education School for the current financial year. Currently, 150 students across five categories of disabilities are enrolled in the school.\n\nThe cabinet also accorded approval to Rs3.1 million funding for such an education institution of Aisha Foundation as well as the provision of Rs68.51 million funds to enable the province’s sports contingent to participate in the 35th National Games in Karachi.\n\nThe participants granted ex-post facto sanction for the selection of a cellular company as centralised bank services provider for disbursement of Ramzan Package to each of the 1,016,394 deserving people across the province.\n\nPublished in Dawn, March 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/131050173391e13.png",
  "retrievedAt": "2025-08-25T15:09:10.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897521/gandapur-boasts-about-kps-rs150bn-fiscal-surplus",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T00:49:46.000Z"
}
