{
  "title": "Opposition to be responded in same way: Gill",
  "link": "https://www.app.com.pk/national/opposition-to-be-responded-in-same-way-gill/",
  "date_published": "2022-01-24T16:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):Special Assistant to the Prime Minister on Political Communication Dr Shahbaz Gill on Monday said, the government would respond to the opposition in the same way they respond to the government.\nAddressing a press conference, he said they would accept Shahbaz Sharif as a leader of the opposition if he succeeds to get acquittal from the court of law in the cases against him.\nHe said that Prime Minister Imran Khan was not only the most popular but also only national leader.\nGill said, the courts had already declared the PML-N vice-president as a forger, thief and cunning woman. She submitted fake documents in the court, he added.\nHe said PML-N leader preferred to meet Indian businessman Jindal while refused to meet the leadership of Hurriyat Conference whereas Prime Minister Imran Khan raised the Kashmir issue at all international fora.\nHe said followers and leaders of PML-N always used indecent and derogatory languages.\nHowever, he said, he did not want to use abusive language against PML-N females except they were forgers.\nGill said that the opposition parties leveled allegations against each other and even threw pictures of their opponents through helicopter.\nHe said PM established Namal and Qadir Universities in the country. 90 per cent and 100 per cent education was being provided free of cost in Namal and 100 Qadir Universities receptively, he added.\nHe said Imran khan has also set up three cancer hospitals in the country where maximum patients were getting free treatment.\nHe said that Maryam Aurangzeb had spent the funds of Minister of Information and PID on her house and she should also be held accountable for that.\nHe said that the top courts of the country have declared Maryam Safdar a deceiver, forgers and culprit. “Qataris are your ATMs and the apartments are also given by them,” he said.\nGill said PTI inherited weak and fragile economy when came into power after general elections 2018.\nHowever, the government emerged successfully from the effects of Corona pandemic, he added.\nThe international financial institutions have also admitted that Pakistan’s economy has shown remarkable growth during the last fiscal year.\nHe said Sharif family used accounts of their employees for money laundering and transaction of Rs 16 billion was carried from their accounts.",
  "retrievedAt": "2025-08-11T14:10:31.546Z"
}
