{
  "title": "Educational institutions should focus on skill development of youth: President",
  "link": "https://www.app.com.pk/national/educational-institutions-focus-on-youths-skill-development-president/",
  "date_published": "2022-01-24T11:33:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 24 (APP): President Dr. Arif Alvi on Monday directed all the educational institutions to focus on skill development of youth so as to put them on the path of development.\nHe expressed these views while addressing the 19th Convocation of the Iqra University (IU) held here at the main campus of the university.\nHe said that the main components of education must be the promotion of logical thinking and communication skills to polish the talent of the young generation as of total population of 64% is younger than 30 years.\nAppreciating the performance of Iqra University, he said that as many as 36,000 students were graduating from the university, but, “here, I am asking the university to increase the number of graduates which might require more investment”.\nAs 80% of the knowledge of dentistry is available online and it is being taught virtually, he said that such a model could be adapted for other subjects to impart education to the youth.\nRealizing the significance of technology, he maintained that within the next 10 years, a lot of things would be transformed as newspapers would be replaced and the virtual world would emerge. Being chancellor of more than 40 universities, he said that we had met the officials of HEC and Universities and discussed such things in the meetings.\nCongratulating to graduating students, he said that the students are elites because you have got the education but a lot of people could not so far.\n“You are graduated and you have to think of those people who could not get the education and you have to do something for them,” the president said.\nWe need such people in million and the world needs such people in million, he reiterated, adding that the virtual education system could be helpful in this regard, he observed. The government has launched various programs like Ehsas for uplifting the poor people living in the country, he said.",
  "retrievedAt": "2025-08-11T14:10:44.217Z"
}
