{
  "title": "Dr. Shireen Mazari launches Human Rights Complaint Cell",
  "link": "https://www.app.com.pk/national/dr-shireen-mazari-launches-human-rights-complaint-cell/",
  "date_published": "2022-01-24T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):Federal Minister for Human Rights Dr. Shireen Mazari launched the Human Rights Complaint Cell on Monday in a meeting held here at Ministry of Human Rights. Joint Secretary Ministry of Human Rights, all Directors Generals and senior officers of the Ministry attended the meeting.\nWhereas regional Directors Human Rights from Quetta, Lahore, Peshawar and Karachi participated in the meeting via Zoom link.\nHuman Rights Complaint Cell has been established under the Ministry of Human Rights for receiving, sifting, segregating and forwarding of complaints both at federal and provincial levels. At regional levels, ministry will be looking after the process of registration of complaints through its Directorate of Human Rights existing in provincial capitals.\nWith the help of this Cell, the Ministry would refer complaints after their registration to concerned department/agency at any level and would be getting a regular feedback for their timely redressal.\nA dedicated team of the Cell will maintain proper data on all kinds of complaints received. Apart from this, human rights violations have been categorized to ensure apposite scrutiny and strong coordination among the departments.\nIn the meeting, DG Human Rights briefed the participants about the Cell that how it has been established after multiple rounds of consultation at provincial and federal levels. It will be operated under a well devised system generating an automated database on registration as well as tracking of complaints. He told that a special code will be allotted to every application/complaint that may be registered through any channel including written application sent through post, email or recorded on assigned telephone numbers.\nAfter registration, ministry would perpetually monitor and take follow-up on all complaints.Speaking on the occasion, the Federal Minister lauded the system and congratulated the whole team for successfully making it happen.\nShe said that she would personally get weekly and monthly progress report of this cell and advised all regional heads to keenly look into the cases of human rights violation in their respective area especially those reported on print, electronic and digital media.\nShe also enquired about few cases of Quetta from Director Human Rights, Quetta region and urged him to check their current status from police department.",
  "retrievedAt": "2025-08-11T14:10:40.800Z"
}
