{
  "title": "Attacking courts, part of Sharif family’s doctrine: Farrukh",
  "link": "https://www.app.com.pk/national/attacking-courts-part-of-sharif-familys-doctrine-farrukh/",
  "date_published": "2022-01-24T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Monday criticized the Sharif family for maligning  the judiciary when ever it gets unfavorable decision from the court.\n“It is doctrine of the Sharif family to attack the courts when they give decisions against them. The whole nation knows as to who attacked the building apex court in the past,” he said in reaction to the news conference of Pakistan Muslim League-Nawaz (PML-N) Information Secretary Marriyum Aurangzeb.\nIn a statement, he said the PML-N leaders were disturbed over the government’s accountability drive as it was the first time in the history that those who used to siphon off public money in the past were being held accountable.\nHe said the Sharif family promoted corruption by setting new records in their governmental tenures. The family currently was at large and living abroad after looting the national exchequer.\nSubmission of Qatari letter and fake trust deeds to the court as evidence by the Sharif family to prove their innocence exposed the reality of Nawaz Sharif and his daughter Maryam Nawaz, he said, asking them to explain their relation with Masroor Anwar who sent money in the accounts of Shahbaz Sharif from 2008 to 2017.\nMajor transactions were made through the account of ‘Maqsood Peon’ who was another character which should be explained by the Sharif family, he questioned.\nHe said Shahbaz Sharif, who pretended to be an honest person, was facing a case in Federal Investigation Agency (FIA) pertaining to illegal baking transactions.\nThe minister said the law would take its course and those who laundered money through fake accounts would be penalized as per law.\nHe criticized the leaders of PML-N for using inappropriate language in a news conference and said they had no worth and just doing this after getting instructions from their top leadership.",
  "retrievedAt": "2025-08-11T14:10:37.538Z"
}
