{
  "title": "Cabinet approves tax exemption on profits gained through Euro, Sukuk, Panda Bonds",
  "link": "https://www.app.com.pk/national/cabinet-approves-tax-exemption-on-profits-gained-through-euro-sukuk-panda-bonds/",
  "date_published": "2021-01-19T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): The Federal Cabinet, under the second schedule of the Income Tax Ordinance 2001, Tuesday approved tax exemption on the profits gained through Euro Bonds, dealings in International Sukuk issued under the government’s medium-term notes and Panda Bonds, issued in the Chinese market.\nThe cabinet, which met here with Prime Minister Imran Khan in the chair, also gave a go-ahead to the Ministry of National Health Services and Regulation to directly make a five-year agreement with the National Database and Registration Authority (NADRA) for data verification of Sehat Sahulat Programme.\nThe cabinet, which was given a briefing on the issue of Broadsheet, a UK asset recovery firm, decided to constitute a committee to be headed by a retired judge of the Supreme Court or High Court to investigate the matter.\nThe meeting was briefed in detail about the measures taken during the last six months with respect to civil service reforms. It was told that civil reforms had been done in the decades’ old rules in line with the current era requirements, transparency, performance, and accountability.\nIt was further told that the civil service reforms had been done keeping in view the timelines and results, and identifying the complications of previous rules relating to discipline, performance, promotions, retirement and other issues.\nAbout amendments in PPRA (Public Procurement Regulatory Authority) Rules, the cabinet was told that besides detailed explanation of the rules, quality, facilitation of public and private sectors and high international standards had been taken care of in the amendments.\nThe prime minister while appreciating the measures taken regarding the civil service reforms and amendments in the PPRA Rules, said the ministries and divisions, in line with the reforms, should take steps regarding the improved performance of the ministries and further ensuring the ‘ease of doing business’.\nThe cabinet, under the Public Sector Companies (Corporate Governance) Rules 2013, approved the appointment of Ali Mehdi as Chief Executive Officer (CEO) of Pakistan Development Fund Limited.\nIt also approved six months extension in the implementation of the Pakistan Essential Services (Maintenance) Act 1952 on all levels of employment under the administrative control of Pakistan Petroleum Limited.\nThe cabinet approved the grant of financial award for the members of the core committee constituted under the Power Division for their services towards saving the country from big financial loss in the light of investigations in the Rental Power Project.\nIt also approved the nomination of members of the Karachi Dock Labour Board under the Ministry of Maritime Affairs.\nThe constitution of the Board of Directors of the National Transmission and Dispatch Company under the Power Division was also approved by the cabinet.\nThe meeting endorsed, in the light of few directions, the decisions taken by the Cabinet Committee for Law Cases during its meeting held on January 7, 2021; by Cabinet Committee for Energy during its meetings held on January 7 & 14, 2021; and by Cabinet Committee for Institutional Reforms during its meeting held on December 31, 2020.\nMinister for Planning Asad Umar briefing the cabinet about the effects of COVID-19 pandemic in the country with reference to the recent survey of the Federal Bureau of Statistics (FBS) said that around 20 million people had lost their incomes to the large extent in April last year.\nThe meeting was told that it was the government’s prudent strategy, adoption of smart lockdown policy instead of complete lockdown and the decision making in construction and manufacturing sectors which led to revival of the incomes of 20 million people.\nAsad Umar further told the cabinet that owing to the timely decisions of the prime minister the employment of around 95% of the people restored, with subsequent opening of transport sector.\nThe meeting was told that during the lockdown 80% people were employed in construction followed by 72% in manufacturing and 67% in transport sectors. Due to coronavirus, 47% population had spent their savings whereas 30% people had started taking loans.\nThe cabinet was told that in order to mitigate the sufferings of common people, the prime minister not only adopted a balanced strategy but also gave a historic stimulus economic package.\nSimilarly, the timely and transparent distribution of cash grants among the deserving under the Ehsaas Programme, timely decision making regarding educational institutions and the best coordination of National Command and Control Center (NCOC) not only helped change the situation soon, but other countries of the world also appreciated the country’s successful strategy.\nMinister for Planning told the cabinet that the country’s Large Scale Manufacturing (LSM) registered a 12 years high 14.5% growth in November 2020.\nHe further said that even before the recent data of FBS, the prime minister keeping in view of the hardships of the poor and weaker segments of society made timely decisions, which was bringing positive socioeconomic results.\nMinister for Finance Dr Abdul Hafeez Sheikh while presenting a comparative study of the negative economic effects of coronavirus on the country and other nations told the meeting that Pakistan registered negative 0.5 % growth in GDP (Gross Domestic Product) during the previous fiscal as against the negative growths recorded by US 4.3%, Sri Lanka 4.6%, Iran 5%, India10.2% and Turkey 5.5 percent.\nPrime Minister Imran Khan appreciated the timely and transparent distribution of cash grants among the deserving in coronavirus situation under the NCOC, Finance Ministry and Ehsaas Programme.\nHe said the government keeping in view hardships of the poor and most affected segments adopted a balanced strategy of lockdown with focus on the poor and daily wage earners. If the government would have gone for a complete lockdown in the country, it could bring disastrous results, he remarked.\nThe prime minister further said that his government soon after coming into power had to take tough economic decisions which affected the life of common man.\nHe, however, added that as the people supported them, the data based on a recent survey by FBS was reflective of the fact that the government’s strategy regarding COVID-19 not only remained successful but the wheels of economic also continued to move.\n“Thanks to Allah Almighty that coronavirus cases are on the decline and pressure on hospitals has reduced,” he added.\nThe prime minister said the NCOC model remained very successful as well as successful implementation of effective strategy due to consultation of all the stakeholders.\nHe further said that Pakistan was the first country in world which thought about the negative effects of coronavirus on the poor people and took timely decisions whereas poverty in India due to coronavirus pandemic increased.\nThe prime minister specially appreciated the timely and transparent measures taken by the NCOC, Ehsaas and Ministry of Finance.",
  "retrievedAt": "2025-08-11T20:15:18.035Z"
}
