{
  "title": "State institutions are independent under PTI: Governor Punjab",
  "link": "https://www.app.com.pk/national/state-institutions-are-independent-under-pti-governor-punjab/",
  "date_published": "2021-01-19T16:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 19 (APP): Governor Punjab Chaudhry Mohammad Sarwar on Tuesday said that all state institutions were independent under the Pakistan Tehreek-e-Insaf (PTI) government, adding that the era of handling institutions with remote control was over.\nTalking to the media on the sidelines of inaugural ceremony of the Journal of Pakistan Society of Internal Medicine at Governor’s House here, he said the opposition parties in the PDM wanted to get decisions of their choice from the state institutions, adding that they must understand that their regimes were over when state institutions were maneuvered by these corrupt politicians.\nGovernor Punjab Chaudhry Mohammad Sarwar said the government was committed to purging institutions of political interference once and for all.\nTo a query, he said the PDM protest outside Election Commission of Pakistan (ECP) was aimed at getting personal political gains, adding that the opposition could not pressurize the government through such tactics.\nResponding to a question about opposition’s protest he said that the opposition hoped to overthrow elected PTI government through protests but all its hopes would be dashed to the ground, adding that the opposition would have to wait for the general elections in 2023.\nAbout the opposition, Sarwar said to keep the political atmosphere hot was a matter of survival for the opposition parties as they had lost confidence of the public through their acts of corruption.\nHe said the PTI government under Prime Minister Imran Khan, was resolute to purge the country of corruption.\n“The government is taking the country forward while the opposition pulling it back to economic degradation and instability”, he responded.\nAddressing the ceremony, Governor Punjab Chaudhry Mohammad Sarwar said that the universities should partner with the industry to provide employment to the youth and strengthen country’s economy.\nHe reiterated that the government believed in merit and political interference had been completely eliminated in the universities.\nSarwar said healthcare facilities provided by the medical universities to the public through telemedicine centers were commendable.\nProf. Dr Javed Akram, speaking on the occasion, said at present only 113 scientific journals were being published in Pakistan while 395 scientific journals were published in the United Kingdom (UK).\nHe said in the field of medicine, only 3 Pakistani journals had an impact factor, adding that for the first time under the auspices of the University of Health Sciences (UHS), a masters degree program in medical journalism was being launched.\nDr Sumia Iqtdar gave a briefing on the initiatives taken by the Pakistan Society of Internal Medicine.\nProvincial Minister for Higher Education Yasir Sarfraz Humayun, Secretary Health Capt. (R) Usman, Vice Chancellor UHS Prof. Dr. Javed Akram, VC King Edward Medical University (KEMU) Prof. Khalid Masood Gondal, Prof. Aziz-ur-Rehman and others were also present on the occasion.\nEarlier, PTI MNA Sadaqat Abbasi called on Governor Punjab Chaudhry Mohammad Sarwar and discussed political situation in the country.",
  "retrievedAt": "2025-08-11T20:15:18.610Z"
}
