{
  "title": "Fawad says Sharifs artfully plundered public money, made assets abroad",
  "link": "https://www.app.com.pk/national/fawad-says-sharifs-artfully-plundered-public-money-made-assets-abroad/",
  "date_published": "2021-01-19T18:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Federal Minister for Science and Technology Chaudhry Fawad Hussain Tuesday said the way the Sharif family had plundered the national exchequer and stashed the looted money abroad reflected their artistic instinct.\nThe Sharifs adopted new ways of corruption and artfully looted the national wealth, which were not exercised anywhere else in the world and “they should be appreciated” for that, he said satirically.\nHe was addressing a news conference here along with Federal Minister for Information and Broadcasting Shibli Faraz and Federal Minister for Human Rights Dr Shireen Mazari.\nRead Original Broadsheet Case Documents\nFawad said there was a small public presence at the PDM’s protest today, but PML-N leader Maryam Nawaz confidently pretended that it was a huge gathering. With the same confidence, she had earlier told a lie claiming that she did not have any property even in Pakistan what to talk about London.\nIt was Maryam Nawaz, who had submitted forged documents in Calibri Font before the Supreme Court, he said. It all showed how confidently they spoke lies, he added.\nCriticizing the speech of Maulana Fazlur Rahman at today’s protest, Fawad said the Maulana was in fact suffering from anxiety for being isolated. “He was under the delusion that the people of Pakistan would swear allegiance to him as a caliph but it did not happen.”\nThe Maulana, he said, should now better abandon all his activities and better consult some doctor for mental stress. “We have also allowed Cannabidiol (CBD) in Pakistan and if he can feel better by using it,” he remarked.\nThe minister said it was the decision Prime Minister Imran Khan and his government that no one would be given any NRO (National Reconciliation Ordinance) for their wrongdoings.\nIt was the responsibility of National Accountability Bureau (NAB) to take all the corruption cases against the Sharif family to their logical conclusion at the earliest, he stressed.\nAs regards the Broadsheet, Fawad said in 1999, when Pervez Musharraf had imposed marshal law in the country after dethroning Nawaz Sharif government, two persons Ghazanfar Sadiq Ali and Tariq Fawad Malik met the then NAB chairman General Amjad and extended an offer on behalf of a company ‘Trouvons’ to trace the hidden assets of Pakistani nationals in different countries against 20 percent share of the value of the unearthed properties.\nThey also gave the brochure of their company to the NAB chairman, with all the details of its working and units, he added.\nGeneral Amjad, Fawad said, visited Trouvons’ office in Colorado, United States, in April 2000, where he was given a briefing about the company. As per his instructions, then NAB’s Prosecutor General Farooq Azam prepared a legal contract after which an asset recovery agreement was signed between that company and NAB on June 20, 2000.\nHe clarified that misleading information was being spread in different sections of media about the Broadsheet and IRA. The two firms were constituted by the Trouvons company to find the assets built through corruption money.\nThe Broadsheet was given the task to look into such properties in Asia, the United Kingdom and Europe while IRA was supposed to work elsewhere in the world, he added.\nBroadsheet, he said, hired a professional financial company Metrix, which had a team of experts in accountancy, forensic etc for investigation.\nFawad said Joe Forbes, an official of Metrix, and Mr Biden, another expert of recovering assets made through corrupt means, visited Pakistan in the year 2001 and met the NAB chairman. The NAB officials gave them a list of 200 Pakistani nationals for tracing their assets abroad, which did not include the name of Ishaq Dar.\nIt was later revealed that Ishaq Dar’s name was not included in the list as he was helping NAB at that time.\nHe said in February 2001, Nawaz Sharif got an NRO from General Pervez Musharraf and consequently he went to Saudi Arabia along with his family.\nThe Broadsheet, he added, in a letter to NAB expressed its apprehensions about its share of the value of properties which it had already identified.\nMeanwhile, Khalid Maqbool assumed the charge as NAB chairman who asked the Broadsheet to keep the process on hold, he added.\nHe said Mr Biden visited Pakistan in May 2001 and gave a briefing to NAB authorities on five high profile cases, which was not considered as satisfactory.\nThe minister said on October 28, 2003, NAB issued a notice to the Broadsheet and\nIRA of ending its agreement.\nSince NAB had terminated the agreement unilaterally, the Broadsheet served a notice to it, he added.\nThe country had to pay around 1500 million dollars to the company, which approached an arbitration court in London, that gave a decision against NAB.\nHe said the Panama Papers issue was at its peak in the year 2016 but there was no news about that decision in Pakistan. “Neither the then Attorney General informed the (Panama Papers) Joint Investigation Team nor the embassies.”\nHe said a three-member committee was constituted, which identified 76 assets of the Sharif family in the UK, Saudi Arabia and United Arab Emirates, but no case was pursued despite the availability of evidence in two to three properties.\nThe committee, in its findings, pointed out that commission of 160 million dollars was given to the Sharif family for the Lahore-Islamabad Motorway project, but it was ignored due to lack of evidence, he added.\nFawad recalled that 20 years ago, Shehbaz Sharif had returned 7.34 million dollars to NAB, which was latter given back to him on the directives of Supreme Court chief justice Iftikhar Chaudhry.",
  "retrievedAt": "2025-08-11T20:15:15.515Z"
}
