{
  "title": "Pakistan, Afghanistan discuss trade, security",
  "author": null,
  "content": "ISLAMABAD, Jul 07 (APP): The inaugural round of the Additional Secretary-Level Mechanism between the Foreign Ministries of Pakistan and Afghanistan was held here on Monday pursuant to decisions reached during the visit of the Deputy Prime Minister/Foreign Minister of Pakistan to Kabul, Afghanistan, on April 19, 2025.\nPakistan side was led by Additional Secretary (Afghanistan & West Asia), Ambassador Syed Ali Asad Gillani, while the Afghan side was led by Director General, First Political Division at the Ministry of Foreign Affairs of Afghanistan, Mufti Noor Ahmad Noor.\nDiscussions covered key areas of bilateral interest, including trade and transit cooperation, security, and connectivity.\nBoth sides recognized terrorism as a serious threat to regional peace and security. The Pakistani side emphasized the need for concrete actions against terrorist groups operating on Afghan soil, noting that such groups undermine Pakistan’s security and hinder regional development.\nThe two sides exchanged views on deepening trade and transit cooperation. They reviewed the implementation status of measures announced during the visit of Deputy Prime Minister/Foreign Minister of Pakistan to Kabul for facilitating Afghan transit trade, including the removal of a 10% processing fee, provision of an insurance guarantee, reduction in scanning and examination, and operationalisation of the track and trace system.\nThey underlined the importance of enhanced regional connectivity as a catalyst for sustainable growth and shared prosperity. Noting the strategic significance of the Uzbekistan-Afghanistan-Pakistan Railway in that regard, they agreed to make concerted efforts towards the early finalisation of the Framework Agreement.\nThe two sides also discussed matters related to the repatriation of Afghan nationals. Pakistan side shared an overview of its efforts to facilitate documented travel from Afghanistan, notably through the issuance of over 500,000 visas since January 2024 to date across a range of categories such as medical, tourist, business, and study. Both sides agreed to work together to further strengthen the legal movement of individuals across borders.\nBoth sides reaffirmed their support for sustained engagement to address mutual challenges. They recognised lasting security as a cornerstone, for both the region’s optimal development as well as for further advancement of bilateral relations.\nThey decided to convene the next round of the Additional Secretary talks at mutually convenient dates.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:18:46.822Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-afghanistan-discuss-trade-security/",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T17:12:00.000Z"
}
