{
  "title": "ECP slams efforts to tarnish image, reiterates neutrality, vows unwavering constitutional adherence",
  "author": null,
  "content": "ISLAMABAD, Jul 7 (APP):The Election Commission of Pakistan (ECP) has strongly rebutted recent baseless allegations, reaffirming that the Chief Election Commissioner (CEC) and Members of the Commission remain committed to upholding the Constitution and law without yielding to personal interests or external pressures.\nIn an official statement, the Election Commission of Pakistan (ECP) spokesman has expressed concern over ongoing attempts by certain individuals and groups to malign the Commission, including the Chief Election Commissioner (CEC) and its Members, through unfounded accusations.\nThe ECP clarified that such allegations are baseless and aimed at spreading misinformation, reaffirming its unwavering commitment to impartiality and constitutional conduct.\nThe Election Commission remains resolute in its independence, stating it neither yields to coercion nor succumbs to undue influence. Clarifying recent claims, the Commission noted that comments about a meeting between the Chief Election Commissioner and the Speaker of the Punjab Assembly are factually incorrect. It emphasized that such engagements are routine and fall well within the norms of constitutional and administrative responsibilities.\nThe spokesperson stated that the Chief Election Commissioner has previously met with former President Arif Alvi on several occasions to discuss issues like Electronic Voting Machines (EVMs) and Internet Voting—topics that extended beyond the President’s constitutional mandate.\nAdditionally, the CEC held official meetings, upon request, with various Pakistan Tehreek-e-Insaf (PTI) leaders, including Vice Chairman Shah Mehmood Qureshi, former General Secretary Asad Umar, Pervez Khattak, and Khyber Pakhtunkhwa Chief Minister Mahmood Khan.\nSimilarly, the spokesperson added that the CEC also held official meetings with former Punjab Chief Minister Usman Buzdar at the Chief Minister’s office. Such interactions, the spokesperson emphasized, are standard practice, as Members of the Election Commission regularly engage with Chief Ministers and senior officials in the course of their duties.\nIt is important, the statement noted, to view these engagements in the appropriate context and not misrepresent them for political motives or propaganda.\nThe spokesperson further clarified that no official from the Election Commission has ever engaged with any individual or political figure in a personal or unofficial capacity. All interactions with political leaders and parties have strictly adhered to official protocols and fall well within the Commission’s legal and regulatory framework—a practice consistently followed over time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:18:19.739Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ecp-slams-efforts-to-tarnish-image-reiterates-neutrality-vows-unwavering-constitutional-adherence/",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T12:57:00.000Z"
}
