{
  "article_id": "2025-10-16_4ab23ddec371a1eb6f6e5abc064769cd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/student-council-formed-at-imcg-i-10-4/",
    "retrieved_at": "2025-10-17T00:09:13.146Z"
  },
  "metadata": {
    "title": "Student Council formed at IMCG I-10/4",
    "author": null,
    "date_published": "2025-10-16T14:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP):The Islamabad Model College for Girls (IMCG) I-10/4 held a solemn Investiture Ceremony to induct the newly elected Student Council for the academic session 2025-26. The event marked the democratic transition of leadership among students, aimed at nurturing responsibility, confidence, and teamwork. Parliamentary Secretary at the Ministry of Federal Education and Professional Training and President of the Women Wing, PML-N, federal capital, Farah Naaz Akbar was chief guest on the occasion. Principal, Professor Fatima Mobin presided over the ceremony, which took place in the college premises. Ms. Faiza Alvi preesented a brief overview of the council's role in fostering leadership and organizing inter-class and inter-collegiate activities. In a symbolic gesture of leadership continuity, the former President handed over the ceremonial candle to the newly elected President. Ms. Farah Naaz Akbar administered the oath to the new office-bearers, including President Mahnoor Abbasi, Vice President Aliza Shahid, General Secretary Abeera Ahsan, and Treasurer Mahnoor Javed, along with Head Girls, Class Representatives, and Secretaries of various societies-Hadiqa Chaudhry (English), Areesha Usman (Urdu), Malaika (Islamiat), Haida (Computer), Ayesha (Singing), and Hamna (Science). Addressing the gathering, Ms. Akbar praised the democratic spirit of the student elections and urged students to embrace challenges with determination. \"Never be disheartened by limitations or difficulties. Work hard with sincerity, and success will follow,\" she said, drawing warm applause from the audience. Principal Prof. Fatima Mobin presented the college insignia to the Chief Guest and lauded the efforts of the Student Council In-Charge and organizing team for hosting an inspiring and disciplined event. The ceremony concluded with the National Anthem, echoing the spirit of pride and unity among students and faculty alike.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}