{
  "article_id": "2025-10-16_306b58af84107c15940068270b461fe9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-cabinet-highly-praises-pms-speech-at-gaza-peace-summit/",
    "retrieved_at": "2025-10-17T00:06:53.134Z"
  },
  "metadata": {
    "title": "Federal cabinet highly praises PM’s speech at Gaza Peace Summit",
    "author": null,
    "date_published": "2025-10-16T21:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP): The members of the federal cabinet Thursday highly praised speech of Prime Minister Muhammad Shehbaz Sharif delivered at the Gaza Peace Summit held in Sharm El-Sheikh, Egypt. The Prime Minister chaired the federal cabinet meeting. The federal cabinet paid tribute to the Prime Minister for his very important role in the Gaza Peace Agreement. The members of the federal cabinet applauded the Prime Minister by thumping of desk. Thanking members of the federal cabinet, the Prime Minister said that Allah Almighty gave immense respect to Pakistan in Sharm El-Sheikh, adding Pakistan played a very crucial role in the Gaza Peace Agreement. He said that after Marka-e-Haq, the world started seeing Pakistan as a very important country. He said, \"We cannot thank Allah Almighty enough for granting Pakistan honour and respect all over the world. During the meeting, the federal cabinet ratified the decisions taken in the meeting of the Cabinet Committee on Legislation (CCLC) on September 23, 2025. Amendments to schedule E (E) of the Trade Organization Rules, 2013 were ratified. Under these amendments, there will be no increase in the license grant fee and license renewal fee of women's chambers of commerce and industry across Pakistan. In addition, amendments to the Inter-Board Coordination Commission Act 2023 were also ratified. Under these amendments, it has been directed to ensure 33 percent representation of women members in education boards across Pakistan. Furthermore, amendments to the Jammu and Kashmir (Administration of Property) Ordinance 1961, Karachi Port Trust Act 1986, Gwadar Port Authority Ordinance 2002 and Port Qasim Act 1973 were also ratified in order to bring them in line with the SOEs Act 2023. The federal cabinet also ratified the decisions taken by the Cabinet Committee on Legislation in its meeting held on October 8, 2025. Pakistan Digital Authority (Management and Utilization of Digital Nation Fund) Rules, 2025 were ratified. Amendments were ratified in the Governing Council of Pakistan Bureau of Statistics. The cabinet also ratified the decisions taken in the meeting of the Cabinet Committee on Legislation on October 10, 2025. Amendments to the Armed Forces Nursing Services Rules, 1969 were ratified. In addition, the Civil Unmanned Aircraft Rules, 2025 and amendments to the Passport Amendment Rules, 2021 were also ratified.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}