{
  "article_id": "2025-10-16_ab086a235cbf506c9f9be8ff3632c635",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-committee-on-economic-affairs-division-reviews-development-projects-flood-relief-efforts/",
    "retrieved_at": "2025-10-17T00:07:14.802Z"
  },
  "metadata": {
    "title": "NA committee on Economic Affairs Division reviews development projects, flood relief efforts",
    "author": null,
    "date_published": "2025-10-16T22:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 664,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP):The National Assembly Standing Committee on Economic Affairs Division on Thursday met under the Convenorship of Member National Assembly (MNA) Dr Mirza Ikhtiar Baig to discuss important matters related to development projects, and flood relief efforts. The Committee was presented with a stark contrast in financing options: a highly concessional loan from the Korean Exim Bank at 0.1% for fifty years, alongside a proposal from the Islamic Development Bank at 6% for twenty years, said a news release. The body unanimously condemned the 6% offer as financially reckless, demanding to know how such a high-cost option could be seriously considered when a vastly superior alternative was available. The Committee expressed deep concerns that unregulated construction along riverbanks had significantly worsened the destruction caused by the recent floods. The Committee emphasized the need for effective policy measures and practical actions to prevent such construction in the future, in order to reduce the risk of similar damage during future flood events. The Committee was briefed on the current status of study conducted by Karachi Port Trust regarding the Lyari Elevated Freight Corridor, a vital project intended to resolve the severe traffic congestion constricting the Karachi Port Trust by providing a direct 24/7 highway link. While the project is essential to unlock the portas full capacity and boost national trade, the Committee was informed that a recent study has declared the original 23.5 km plan with a dramatic cost escalation from an initial USD 288 million to a staggering USD 1.085 billion. The Committee emphasized that the NHAas cost estimation is more reasonable and its proposal should be seriously considered. Despite the projectas cost ranging from Rs. 68 to 100 billion, members challenged the perception of its non-viability. They argued that given the massive economic impact of a fully functional KPT enabled by the (Lyari Elevated Freight Corridor) LEFC the projectas strategic value justifies its funding through either the Public Sector Development Programme (PSDP) or a Public-Private Partnership (PPP). The Committee members emphasized the need for the Karachi Port Trust (KPT) and the National Highway Authority (NHA) to hold joint discussions to develop a practical and sustainable solution to the traffic management issues and Lyari Elevated Freight Corridor (LEFC) project. Furthermore, the Committee highlighted the importance of including the LEFC project in the Public Sector Development Programme (PSDP) and added that the committee will make efforts to take up the matter with the Minister for Communications to ensure the projectas consideration and approval under the PSDP. The Committee was apprised of the overall situation and relief efforts in response to the recent floods across Pakistan. The NDMA informed the Committee that a total of 1,037 deaths and 1,067 injuries had been reported nationwide, while damage to houses and livestock reached 22,841 cases. Rescue and evacuation operations conducted up to 30th September covered approximately 3,029,091 people. In terms of relief assistance, the Committee was informed that federal support, including NDMA stocks and the Prime Ministeras relief package, amounted to 2,595 tons items. National resources contributed by NGOs, INGOs, and industry collectively provided 14,325 tons of relief items, while the Provincial Disaster Management Authorities (PDMAs) utilized 3,124 tons from their own stocks. Additionally, the Pakistan Army, Air Force (PAF), and Navy (PN) collectively contributed 619 tons of relief materials. The NDMA further informed the Committee that the Prime Minister has approved an Ex-Gratia Assistance of Rs. 2 million for the next of kin (NoKs) of each deceased person during the Monsoon 2025 floods. The provinces and PDMAs are currently in the process of preparing and submitting cases for the disbursement of the approved assistance. The meeting was attended by MNAas including Ammar Ahmad Khan Leghari, Ms. Saba Sadiq, Pir Syed Fazal Ali Shah Jillani, Pir Ameer Ali Shah Jillani, Muhammad Khan Daha, Ms. Huma Akhtar Chughtai, Ms. Akhtar Bibi, Syeda Shehla Raza, Muhammad Jawed Hanif Khan, Ms. Neelam,A Sadiq Iftikhar. The meeting was also attended by Secretary EAD, officials of the ministryA and other officers concerned.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}