{
  "article_id": "2025-10-16_65941745af2d6b6da80a2187556b15a3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-wants-permanent-end-of-terrorism-originating-from-afghanistan-pm/",
    "retrieved_at": "2025-10-17T00:07:41.522Z"
  },
  "metadata": {
    "title": "Pakistan wants permanent end of terrorism originating from Afghanistan: PM",
    "author": null,
    "date_published": "2025-10-16T18:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 656,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP): Prime Minister Muhammad Shehbaz Sharif Thursday said Pakistan wanted a permanent resolution of the issue of terrorism originating from Afghanistan to maintain peace between the countries. Speaking at the start of the federal cabinet meeting here, he said people of Afghanistan were brothers and sisters of Pakistanis and both countries shared a border of 2000 kilometres. Pakistan hosted four million Afghans for decades and sincerely did whatever it could for them within its limited resources, he added. He said but unfortunately terrorists who were operating from across Afghanistan were given free hand by the Afghan government and they carried out acts of terrorism, martyring Pakistani army officers and Jawans, law enforcement and police officials and citizens. He said Pakistan's Deputy Prime Minister and Defence Minister went to Kabul multiple times to talk to the Afghan government to resolve issues, adding, Pakistan and Afghanistan were neighbours for all times to come and they have to resolve their issues with mutual consultation to maintain peace and start new era of progress. Despite all the efforts made by Pakistan, the terrorists continued attacks on the Pakistani soil on the instigation of India, he remarked, adding, when the Afghan Foreign Minister Muttaqi was in Delhi, the terrorists kept attacking. As Pakistan's patience ran out, its armed forces forcefully responded to the aggression from Afghanistan, under the leadership of Field Marshal Syed Asim Munir, the Prime Minister told. He said Pakistan on Wednesday agreed to a temporary ceasefire of 48 hours on a request made by the Afghan government. If Afghanistan accepted Pakistan's just conditions then Pakistan was ready to resolve issues on a sustainable basis, so now the ball was in the court of Afghan government, he added. He mentioned that Qatar was seriously trying to resolve the issue between Pakistan and Afghanistan. The Prime Minister said in Sharm El Sheikh he met Amir of Qatar who said that he wanted to play his role to mediate between Pakistan and Afghanistan. He said Afghanistan should not allow use of its territory for terrorism and Fitna al-Khawarij should be eliminated. The Prime Minister said he offered funerals of the army men who were martyred while fighting terrorism, adding the fathers and mothers of the martyrs told him that they were proud of their sons who laid down their lives in defence of the country and asked him to wipe out terrorism. He recalled that terrorism was eliminated from the country in 2018 but the menace resurfaced when the previous government allowed thousands of terrorists to come back to the country. Talking about Palestine, he said 74000 women, children, elders and youths were martyred in Gaza and even schools and hospitals were not spared. He commended the US President Donald Trump and Islamic countries particularly Saudi Arabia, Turkiye, Qatar, United Arab Emirates, Jordan, Egypt and Indonesia for playing their role for achieving ceasefire in Gaza and stopping the horrific bloodshed. The people of Gaza had celebrated the ceasefire, he noted. He criticized the elements who did politics on the issue of Gaza and said they were not able to stop the bloodshed but only did politics. He stated in the next phases, steps should be taken for establishment of a state of Palestine and grant of rights to the Palestinians according to the United Nations resolutions. He praised the ministers for the staff level agreement with International Monetary Fund (IMF). He said it should be Pakistan's last programme with the IMF as the country should be financially independent to achieve its status as an economically strong country in the world. He urged that everyone should strive hard for progress of the country and for achievements in fields such as science and technology. Pakistan should be developed as a country envisioned by Quaid-e-Azam Muhammad Ali Jinnah, he said adding tens of thousands of people sacrificed their lives at the time of independence for the dream of a better country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}