{
  "article_id": "2025-10-16_8addf2714858d9b377de0595e0de4d89",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-commitment-to-universal-health-coverage/",
    "retrieved_at": "2025-10-17T00:07:45.146Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms commitment to Universal Health Coverage",
    "author": null,
    "date_published": "2025-10-16T17:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 399,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP): Federal Minister for Health, Syed Mustafa Kamal has reaffirmed Pakistan's unwavering commitment to universal health coverage (UHC), regional solidarity and multilateral cooperation. Addressing the 72nd session of the World Health Organization (WHO) Eastern Mediterranean Regional Committee, held in Cairo, Egypt, the minister emphasized that Pakistan strongly aligns with this year's theme - \"Together for a Healthy Future: Action, Access and Equity\" - reflecting the government's dedication to translating commitments into tangible actions that improve people's health and well-being. Speaking at the high-level regional health forum, while highlighting Pakistan's progress in strengthening its health system, the minister noted that the country has developed and begun implementing the Essential Package of Health Services (EPHS) at the primary health care and community levels under the National Health Support Programme. These efforts, he said, have resulted in a steady rise in Pakistan's Universal Health Coverage Index, which has improved from 40 in 2015 to 54 in 2024. The minister underscored Pakistan's enhanced preparedness and response capacity through increased domestic investment and partner support, including a recent USD 18 million grant from the Pandemic Fund to operationalize the National Action Plan for Health Security (2024-2028). Reaffirming the government's steadfast resolve to eradicate poliovirus, the minister stated that despite recent case detections, Pakistan remains determined to eliminate the virus through aggressive vaccination campaigns targeting 45 million children, strengthened surveillance systems, and synchronized cross-border efforts. He acknowledged the vital role of Global Polio Eradication Initiative (GPEI) partners and expressed gratitude to Saudi Arabia, the United Arab Emirates, and Qatar for their continuous support. Addressing future priorities, the minister shared that the Government of Pakistan is in the process of finalizing the National Health and Population Policy 2026-2035, which envisions ensuring access to essential healthcare for every citizen and promoting overall well-being through improved health, nutrition, and population balance. The policy also emphasizes self-reliance in vaccine production, integration of digital technologies such as telemedicine, and the introduction of \"One Patient, One ID\" for efficient data management and universal medical records. Calling for stronger regional cooperation, Minister Kamal urged member states to foster collective action in innovation sharing, cross-border disease surveillance, and emergency response mechanisms, adding that the WHO should continue to play its leadership role in providing technical assistance and coordination support. He reiterated Pakistan's vision of a healthier, equitable, and resilient future for all, underpinned by solidarity, shared learning, and regional unity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}