{
  "article_id": "2025-10-16_44be4b13ac48e2132166f19e9a595e92",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/russian-envoy-stresses-strengthening-people-to-people-ties-with-pakistan/",
    "retrieved_at": "2025-10-17T00:08:48.188Z"
  },
  "metadata": {
    "title": "Russian envoy stresses strengthening people-to-people ties with Pakistan",
    "author": null,
    "date_published": "2025-10-16T16:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 608,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP): Russian Ambassador to Pakistan, Albert P. Khorev, on Thursday emphasized the importance and timeliness of the Eurasia Chapter by highlighting Russia's pivotal role in shaping a new era of bilateral relations with Pakistan - focusing on science, culture, trade, and people-to-people ties. Addressing a seminar titled \"Exploring New Horizons in the Non-Traditional Security Domain\" at the launch of the Eurasia Chapter of the Consortium for Asia-Pacific and Eurasian Studies (CAPES), he discussed the formation of the Eurasia Economic Union (EAEU) and the 2015 Eurasia Partnership Initiative launched by President Vladimir Putin. Moreover, he pointed out the triad of regional organizations Association of South East Asian Nations (ASEAN), Shanghai Cooperation Organisation (SCO), Eurasia Economic Union (EAEU), as sustained platforms for production and consumption. The event was participated by ambassadors of Russia and Belarus, diplomats from Azerbaijan and a wide array of Pakistani and Russian academics, policy experts and researchers, to explore collaborative frameworks for non-traditional security issues. President of CAPES, Dr. Khuram Iqbal offered welcoming remarks, emphasizing the successful development of CAPS and its evolution into CAPES, the Consortium for Asia Pacific and Eurasian Studies. He pointed out the importance of Eurasia, situated at the crossroads of global connectivity. He also discussed that the challenges faced by Eurasian countries in non-traditional ways cannot be solved alone and require cross-border partnerships. Dr. Faisal Javed, Senior Vice President of CAPES, congratulated everyone on the milestone of launching the Eurasian Chapter. He emphasized Pakistan's role as a bridge to Eurasia. He noted that the ancient Silk Road was not only a trade route but also a hub of ideas, culture, and civilizations. He addressed the lagging trade volume between Pakistan and the Central Asian Republics, which needs to be boosted through P2P, B2B, and G2G engagement. Taimur Fahad of the Institute of Strategic Studies, Islamabad, stressed the urgency of addressing non-traditional security challenges - from pandemics to infrastructure resilience - through enhanced Russia-Pakistan connectivity. Russia and Pakistan have reaffirmed their relationship and are dedicated to exploring new opportunities in the digital world, academic partnerships, and trade growth. He suggested several policy ideas, including emphasizing institutional dialogues, creating non-traditional working groups, Eurasia fellowships, and an annual food and climate security forum. Dr. Shabbir Ahmed, Director of the CARS Area Study Centre at the University of Peshawar, discussed the potential for connecting Eurasia's heartland, island, and Rimland not as battle zones but as centers of trade, transport, logistics, and economic corridors. This will shape the future of the Eurasian continent as a mutually beneficial situation. Dr. Roxolana Zigon, founder of the Diplomatic School and an expert in geopolitics, challenged the myth that Russian relationships are driven solely by strategic interests rather than mutual respect and reliance. She highlighted this in educational programs, such as language courses, IT technologies, and soft power initiatives. She proposed a special presidential program between Russia and Pakistan. Professor Dr. Najam Abbas, a member of European societies for Central Asia studies, highlighted that any nation's soft power is driven by cultural experts and educational outreach. It is important that linkages are converted into lasting leverage, which is extended, enhanced, and enriched through ever-expanding connectivity. Dr. Farhat Asif, chairperson of the Diplomatic Insight Group, discussed the TAPI initiative and electricity projects between Pakistan and Central Asia. She highlighted the importance of traveling and meeting people to better understand them, both locally and regionally. She suggested that trade chambers should update their data to develop more effective policies. Moderated by Gul-i-Ayesha Bhatti, Eurasia Chapter Coordinator, the session concluded with a strong call to action for sustainable collaboration in education, energy, and culture - reinforcing people-centric and institutional partnerships.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}