{
  "article_id": "2025-10-16_234c67af6f27c5ebdb71de5be62a70e9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/photography-captures-priceless-moments-preserves-them-forever-aurangzeb-khichi/",
    "retrieved_at": "2025-10-17T00:07:44.067Z"
  },
  "metadata": {
    "title": "Photography captures priceless moments, preserves them forever: Aurangzeb Khichi",
    "author": null,
    "date_published": "2025-10-16T17:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 317,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP): Federal Minister for National Heritage and Culture Division, Aurangzeb Khan Khichi Thursday emphasized that art and culture serve as powerful mediums to connect people, preserve memories and project a nation's creative spirit to the world. The minister was speaking while inaugurating the Second ICC-IC International Photography Exhibition and Competition 2025 at the Pakistan National Council of the Arts (PNCA) in recognition of the role of visual arts in cultural expression. Speaking on the occasion, Mr. Khichi said that photography is an art that captures priceless moments of life and preserves them forever. He added that such artistic expressions not only nurture creativity but also help portray Pakistan's positive and progressive image globally. Organized by the Islamabad Camera Club (ICC) in collaboration with the Islamabad Club (IC) and supported by PNCA, the exhibition features creative works from 64 photographers, including several international participants. A total of 97 photographs have been displayed, showcasing a rich diversity of themes and artistic interpretations that celebrate photography as a universal language. The minister appreciated the participation of both senior and emerging photographers, assuring that the Ministry and its affiliated institutions will continue to support initiatives that promote art, culture, and innovation in the country. He also thanked the foreign participants and announced plans to expand the photography exhibition on a larger scale in the coming years. \"Events like this build cultural bridges and highlight Pakistan's dynamic creative potential,\" he said. A panel of judges-Shaikh Faisal Azeem, Khawar Saleem, and Nayyer Raza-evaluated the entries and selected winners for medals, cash prizes, and Certificates of Merit, which were presented by the Federal Minister. PNCA provided the exhibition hall along with curatorial and technical support, ensuring a professional and well-curated display of artworks. The exhibition will remain open to the public until October 26, offering visitors an opportunity to experience the creativity and photographic excellence of artists from Pakistan and abroad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}