{
  "article_id": "2025-10-16_7b9539e3aec84551e7e574a15232584d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/naqvi-expresses-grief-over-demise-of-mian-amer-mahmoods-sister/",
    "retrieved_at": "2025-10-17T00:08:53.216Z"
  },
  "metadata": {
    "title": "Naqvi expresses grief over demise of Mian Amer Mahmood’s Sister",
    "author": null,
    "date_published": "2025-10-16T15:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 209,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP):Federal Interior Minister Mohsin Naqvi has expressed profound sorrow and grief over the demise of the sister of Mian Amer Mahmood, Chairman of the Punjab Group and Dunya News Network. In his condolence message, Minister Naqvi conveyed his heartfelt sympathies to Mian Amer Mahmood and the bereaved family, sharing in their grief during this difficult time. He prayed that Allah Almighty grant the departed soul eternal peace and elevate her ranks in the hereafter. The Interior Minister also prayed for strength and patience for the mourning family, acknowledging the deep sense of loss that accompanies the passing of a loved one. \"May Allah Almighty bless the departed soul with a place in His infinite mercy and grant the family courage and patience to bear this irreparable loss. Ameen,\" Naqvi said in his message. Mian Amer Mahmood, a prominent media and education sector figure in Pakistan, serves as the Chairman of the Punjab Group of Colleges, University of Central Punjab, and Dunya News Network. The passing of his sister has been widely mourned across journalistic, educational, and social circles. Leaders from various walks of life have extended condolences to the Mahmood family, praying for the departed soul and expressing solidarity with them in their time of grief.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}