{
  "article_id": "2025-10-16_0709c13d0ab7db5d0bbf0f5486028514",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/telenor-sweeps-three-top-honours-at-best-place-to-work-awards-2025/",
    "retrieved_at": "2025-10-17T00:07:41.688Z"
  },
  "metadata": {
    "title": "Telenor sweeps three top honours at best place to Work Awards 2025",
    "author": null,
    "date_published": "2025-10-16T19:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 328,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP):Telenor Pakistan has been recognized with three prestigious accolades at the Best Place to Work Pakistan Awards Gala 2025, organized by Engage a consulting and the Pakistan Society of Human Resource Management (PSHRM). The company was honored as the Best in Industry Award Winner 2025 in the Telecom Sector, the Best Place to Work Award 2025 in the large company category, and the coveted Best of the Best Company 2025 Award, said a news release. The Best Place to Work Pakistan Study & Awards is the country's largest HR recognition platform, celebrating organisations that are redefining employee engagement, promoting inclusive cultures, and leading with purpose. This year marked a record-breaking participation, with over 260 company nominations received and more than 155 companies participating from across Pakistan - the highest since the initiative began in 2008. Telenor Pakistan's consistent focus on employee well-being, diversity, and sustainability continues to set new benchmarks in corporate excellence. The company's inclusive culture, flexible work practices, and initiatives to empower women and persons with disabilities have been instrumental in shaping its strong employer brand. Beyond workplace culture, Telenor Pakistan is driving positive environmental and social impact. By 2024, the company achieved a 23% reduction in emissions through renewable energy investments and its AI-based energy analytics platform, Thunder, which has saved over 12 GWh of energy and reduced its carbon footprint by 70 kilotons. Commenting on the awards, Areej Khan, Chief People Officer at Telenor Pakistan, said, \"These awards reaffirm our belief that a people-first culture drives innovation, growth, and sustainable success. At Telenor Pakistan, we are proud to create an inclusive environment where every individual is empowered to learn, lead, and make a meaningful impact.\" Telenor Pakistan has been a consistent winner at PSHRM's awards, having previously secured the Best Place to Work in Telecom award in 2019-its fourth consecutive win at the time. The 2025 recognition cements Telenor Pakistan's position as a leading employer of choice in Pakistan's corporate sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}