{
  "article_id": "2025-10-16_665153ea6eba72b00fb55dd4e28f286b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/287817-children-vaccinated-as-polio-drive-completes-4th-day-in-ict/",
    "retrieved_at": "2025-10-17T00:07:14.803Z"
  },
  "metadata": {
    "title": "287,817 children vaccinated as polio drive completes 4th day in ICT",
    "author": null,
    "date_published": "2025-10-16T22:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 389,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 16 (APP):As Islamabad's anti-polio campaign completed its fourth day, health teams successfully administered vaccines to 287,817 children across the city. The ongoing drive aims to reach 461,125 children in total, with officials intensifying efforts to cover remaining households and resolve refusal cases. The fourth day of the anti-polio campaign in Islamabad concluded with steady progress toward the set target. A daily review meeting, chaired by Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon, evaluated the campaign's field performance and overall progress. During the briefing, officials reported that 287,817 children had been administered polio drops so far. The total target for the campaign stands at 461,125 children, leaving thousands still to be vaccinated in the coming days. The briefing further revealed that teams faced 15,841 refusal cases, all of which were addressed on the spot through effective community engagement and awareness efforts. The DC directed health teams to ensure complete coverage and to adopt stronger follow-up measures in areas where resistance persists. \"Ensuring that every child receives polio drops is a collective responsibility,\" said DC Irfan Nawaz Memon, emphasizing the importance of community participation. He commended the continuous efforts of vaccination teams and noted that the number of refusal cases had significantly declined due to their persistent outreach work. The DC also instructed officials to strengthen awareness campaigns at the community level to encourage greater cooperation from parents and guardians. He highlighted that timely coordination among field teams and community leaders was essential for eliminating polio from the region. Health officials reiterated their commitment to reaching every household and reaffirmed that no child would be left unvaccinated during the campaign. They also appreciated the cooperation of local residents and volunteers who supported the vaccination teams in door-to-door efforts. The Islamabad administration continues to monitor field operations closely, with special attention to high-risk areas. Teams have been deployed across urban and rural zones, ensuring the inclusion of all children under five years of age. As the drive enters its final phase, authorities aim to sustain the momentum built over the past four days. The administration remains focused on achieving full coverage and preventing any gaps that could hinder the eradication of polio in the capital. Through coordinated efforts, public engagement, and consistent monitoring, Islamabad's health department continues its campaign to secure a polio-free future for every child in the city.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}