{
  "title": "Saifullah urges PDM to show solidarity with Kashmiris rather staging political show",
  "link": "https://www.app.com.pk/national/saifullah-urges-pdm-to-show-solidarity-with-kashmiris-rather-staging-political-show/",
  "date_published": "2021-01-27T03:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Pakistan Tehreek-e-Insaf (PTI) Chief Organizer Saifullah Khan Nyazee Wednesday said February 5 was observed as ‘Kashmir Solidarity Day’ to express solidarity with Kashmiri brethren and criticized Pakistan Democratic Movement (PDM) for planning to stage a political show on the same day instead of expressing unity and spirit with the national cause.\nSpeaking here at special session with the beat reporters, the PTI chief organizer termed it against the norms to organize political rally on Kashmir Day.\nThe PTI chief organizer said that Kashmir was very important issue which should be resolved as per aspiration of Kashmiri people and resolutions, lingering on the United Nations agenda for the last seven decades.\nPTI Central Information Secretary Ahmad Jawad, Central Secretary Finance Siraj Ahmad, Central Additional Secretary Dr. Abdul Hassan Ansari were also present on the occasion.\nThe chief organizer of PTI while replying to different questions also highlighted the recent initiatives taken by the incumbent government and said the economic stability and price control were among the top most priorities of the PTI government.\nHe said it was the pro-active and wise policies of Prime Minister Imran Khan, due to which economic growth was showing positive indicators as first quarter of current fiscal year witnessed a reasonable growth.\nAnswering a question, he said that supply and demand system was being strengthened with the objectives to stabilize prices of essential commodities.\nNyazee criticized the previous regimes of PML-N and PPP for damaging the system and defaming the national institutions.\nHe also held these parties responsible for damaging the national economy due to which the PTI government took some brave decisions to put it on right track.\nShedding light on forthcoming Azad Jammu Kashmir (AJK) elections, Nyazee said his party would award tickets to only those candidates who would have good repute.\nHe claimed that his party would emerge as victorious with thumping majority during these elections in AJK.\nHe said that candidates of other parties were joining PTI in AJK, claiming that Sardar Faheem Rabani of PPP has announced joining his party.\nReplying to a question, he said that PTI was working on the automation of party system. Nyazee said that though government was always in an advantageous position to manipulate but PTI prefers sanctity of voting over winning elections.",
  "retrievedAt": "2025-08-11T20:17:20.464Z"
}
