{
  "title": "AJK President lauds online education system in AJK Varsities",
  "link": "https://www.app.com.pk/national/ajk-president-lauds-online-education-system-in-ajk-varsities/",
  "date_published": "2021-01-27T09:09:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 27 (APP):AJK President Sardar Masood Khan has said that despite the outbreak of coronavirus, 400 teachers of Azad Jammu and Kashmir University have set a shining example by imparting distance education to more than 9,000 students through the online system.\nHe said this while addressing the 48th meeting of the Syndicate of the University of Azad Jammu and Kashmir at Kashmir House Islamabad on Wednesday. “After the outbreak of the coronavirus, the biggest challenge for us was to keep the process of education going in a manner that did not endanger the lives of students, teachers and the public,” he said.\nOur universities met this challenge and, realizing the new situation in a timely manner, launched an online education program that saved the lives of students and teachers on the one hand and saved students precious time on the other.\nAppreciating the efforts of the University of Azad Jammu and Kashmir in this regard, the President expressed the hope that the management of the university would continue to work hard in the future to spread the light of knowledge in the liberated state and introduce new sciences and technologies to the students.\nAddressing the syndicate meeting, Azad Jammu and Kashmir University Vice-Chancellor Prof Dr Muhammad Kaleem Abbasi said that all the undergraduate students of the semester starting from Fall 2020 are being imparted education through the online system while on-campus education of post graduates, M.Phil and for PhD students has been restored.\nFrom February 1, 2020-21, education will also be resumed within the university for those students who require a physical presence in laboratories or classes for practical training.\n“Despite online education, there has been no negative change in the indicators of improvement in the quality of education at the university, which is very gratifying for us,” he said.\nHe said that the University of AJK has so far taken Fall 2019 exam under the online system and besides completing one semester of students through online education, Spring 2020 semester has been successfully continued. He said that despite the deadly corona, the credit for this success of the Varsity and Kashmir goes to the teachers, students, deans, heads of departments, IT staff and the management of the university.\nHe said that all the credit for introducing uniform the online system in other universities in AJK including University of Azad Kashmir goes to the Chancellor and President Sardar Masood Khan who held regular meetings with the Vice-Chancellors and other administrative officers.",
  "retrievedAt": "2025-08-11T20:17:17.880Z"
}
