{
  "article_id": "2025-06-02_8cfec35ac5181aae88c86a4db59ad425",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-cautions-public-as-stormy-weather-looms-over-northern-pakistan/",
    "retrieved_at": "2025-08-27T10:42:32.169Z"
  },
  "metadata": {
    "title": "NDMA cautions public as stormy weather looms over Northern Pakistan",
    "author": null,
    "date_published": "2025-06-02T17:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 362,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 02 (APP): The National Disaster Management Authority (NDMA) on Monday advised residents in northern Pakistan to stay cautious and avoid unnecessary travel, as rain, windstorms, and thunderstorms are expected in Islamabad, Rawalpindi, the Potohar region, Northeastern Punjab, Khyber Pakhtunkhwa, Gilgit-Baltistan and Azad Jammu and Kashmir from June 2 to 7. The National Emergencies Operation Centre (NEOC) of the NDMA, in a weather alert, urged all provincial and district authorities to ensure emergency preparedness, remain vigilant, and coordinate with local response units for timely action. Advisory urged residents in vulnerable areas-especially hilly and flood-prone regions-to take precautions. People are advised to secure weak structures, trees, power lines, and solar panels, and to park vehicles in safe, covered locations. Farmers should protect standing crops from possible hailstorms and strong winds, while travelers and tourists are advised to exercise caution during outdoor or mountain activities. However, the advisory stated that most parts of the country, including Punjab, Sindh, and Balochistan, are expected to experience hot and dry weather throughout the week. In Punjab, hot and dry conditions will prevail in most areas. Isolated rain, thunderstorm, windstorm, and duststorm may occur in Southern and Northeastern Punjab, including Rawalpindi, Attock, Chakwal, Jhelum, Lahore, Gujranwala, Sialkot, Multan, Bahawalpur, Dera Ghazi Khan, and the Pothohar region from June 2 to 5. In Balochistan, hot and dry weather is expected in most areas, including Quetta, Turbat, Gwadar, Khuzdar, and Zhob. Similarly, most parts of Sindh, including Karachi, Hyderabad, Sukkur, Larkana, and Mirpurkhas, will remain hot and dry. Khyber Pakhtunkhwa (KP) will also experience hot and dry weather, but isolated rain, windstorm, and thunderstorm are likely in northern areas such as Chitral, Dir, Swat, Kohistan, Shangla, Malakand, Abbottabad, and Kurram from June 2 to 6. In Gilgit-Baltistan (GB) and Azad Jammu & Kashmir (AJK), partly cloudy weather with chances of isolated rain, windstorm, and thunderstorm is expected in Gilgit, Skardu, Hunza, Muzaffarabad, Mirpur, and surrounding areas from June 2 to 5, continuing till June 7. The Authority said it will continue to monitor the evolving situation and provide timely updates. To stay informed about the latest weather updates before traveling, download and use the \"Pak NDMA Disaster Alert\" App.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}