{
  "article_id": "2025-06-02_e4d348ff2676c7f5f7ec65d30eb3b4a0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-committee-urges-immediate-appointment-of-womens-commission-chairpersons/",
    "retrieved_at": "2025-08-27T10:42:53.842Z"
  },
  "metadata": {
    "title": "NA committee urges immediate appointment of women’s commission chairpersons",
    "author": null,
    "date_published": "2025-06-02T18:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 02 (APP): The National Assembly Special Committee on Gender Mainstreaming, led by Chairperson Dr. Nafisa Shah, has called for the immediate appointment of Chairpersons for the National Commission on the Status of Women (NCSW) and Provincial Commissions on the Status of Women. The committee expressed serious concerns over the delayed appointments, emphasizing the need for prompt action to address gender disparities in Pakistan. In a meeting held on Monday, the committee urged the Federal and Provincial governments to appoint Chairpersons without further delay, ensuring these bodies can effectively promote women's rights and gender equality. The Director General Health briefed the committee on Maternal and Child Health statistics, highlighting,Maternal Mortality Ratio (MMR): 186 deaths per 100,000 live births (PMMS 2019), improved from 276/100,000 live births (PDHS 2006-07),Infant Mortality Rate (IMR): 62/1,000 live births (PDHS 2017-18), reduced from 74/1,000 live births (PDHS 2012-13),Under-five mortality rate: 42/1,000 live births (PDHS 2017-18), reduced from 89/1,000 live births (PDHS 2012-13). The committee expressed concern over Pakistan's ranking as third globally in newborn deaths in the region and decided to continue discussions on Maternal and Child Health in the next meeting, inviting UNICEF for further deliberations. The meeting was attended by several MNAs and Senators, including Khawaja Izhar Ul Hassan, Munaza Hassan, Shaista Pervaiz, Shahida Rehmani, Sher Ali Arbab, Shahida Begum, Rubina Qaim Khani, Saadia Abbasi, and Fawzia Arshad, along with officials from concerned ministries and divisions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}