{
  "title": "Upholding the Constitution vital for political stability, citizen rights: President",
  "link": "https://www.app.com.pk/national/upholding-of-constitution-vital-for-political-stability-citizen-rights-president/",
  "date_published": "2023-05-08T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP):President Dr Arif Alvi on Monday said upholding the country’s Constitution was the responsibility of all segments of society because the document not only guaranteed political stability but also ensured the citizens’ fundamental rights.\n“In addition to the administrative authority, it is the duty of the State and its organs to bring improvement to the society through a system based on welfare,” he said in his address at a ceremony to recognize public contribution towards social welfare, held here at Aiwan-e-Sadr.\nThe event, organized by Network for Human and Social Development (NHSD), acknowledged the services of departments and individuals in the field of humanitarian service and philanthropy.\nPresident Alvi stressed that the Constitution vested its power in citizens which led to realizing a welfare State with a political system based on social justice.\nHe said supremacy of the Constitution was vital as its pillars set out the goals for basic rights in various areas including education, health, employment, and social and economic justice.\n“A Constitution does not belong to a politician or an institution, but to every individual of the country,” he said.\nThe president emphasized the importance of social welfare and philanthropy to address the problems amid the growing population, particularly in the shape of poverty, illiteracy, and unemployment.\nAs per UNICEF data, he said the 27 million out-of-school children of Pakistan were a serious challenge that required urgent steps for their inclusion in the educational and skill-set system.\nAlso, the country’s 10 percent population of persons with disabilities needs mainstreaming, he added.\nPresident Alvi highlighted the importance of adopting a preventive approach to health rather than a curative one to cope with the costly treatment of several diseases including Hepatitis, AIDS, and communicable ailments.\nHe said national progress was linked with the implementation of the system of social caring and improving the lives of the people.\nPresident NHSD Amir Ikram Ameen said his organization was serving vulnerable communities of Pakistan through disaster management and mitigating disaster risk through poverty alleviation and ensuring educational and health facilities to women and children in remote villages.\nVice Chairman Standing Committee Akhuwat Foundation Badar Haroon said the welfare organization in 20 years empowered the people through microfinance loans worth Rs 200 billion with a 99.9 percent return rate.\nHe mentioned that 2,000 transgenders above 50 years of age were registered with Akhuwat Foundation, which was catering to their medical facilities in a respectable way.\nChief Executive Office ACT International Syed Mubashir Ali Shah Banoori said the organization in close coordination with government departments rolled out several projects during the recent flood emergency by providing the affected communities with food and shelter. Also, the provision of seeds, fertilizers, livelihood training, and restoration of agriculture at large is also being carried out, he added.\nPresident Alvi on the occasion gave away acknowledgement shields to organizations and individuals who contributed towards social welfare in their respective areas.",
  "retrievedAt": "2025-08-11T08:27:40.994Z"
}
