{
  "title": "Parliamentarians optimistic about getting IMF bailout package",
  "link": "https://www.app.com.pk/national/parliamentarians-optimistic-about-getting-imf-bailout-package/",
  "date_published": "2023-05-08T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP): The members of the Parliament on Monday expressed their optimism in the wake of the government’s efforts for clinching the International Monetary Fund’s (IMF) bailout after meeting all its preconditions.\nParliamentary Secretary for Railways Kiran Imran Dar of the Pakistan Muslim League-Nawaz (PML-N), while talking to APP outside the Parliament House, said the government was diligently working on securing the IMF bailout package to pull out the country of the economic crisis.\nThough Pakistan had successfully met all the preconditions, but the delay was on the part of the Fund, she added.\nKiran Dar said the coalition government was unable to extend fuel subsidies to the poor masses bearing the burden of the economic crunch due to the IMF.\nMember of the National Assembly Dr Qadir Khan Mandokhail of the Pakistan Peoples Party Parliamentarians (PPPP) said the coalition government would present the budget and manage the financial crisis with the support of China, which was an all-weather friend of Pakistan.\nThe neighbouring country, he said, had already provided billions of dollars for the China-Pakistan Economic Corridor (CPEC) project, which was halted by the last Pakistan Tehreek-e-Insaf (PTI) government.\nPTI Chairman Imran Khan should tell the nation why he had stopped work on the CPEC projects, which was a guarantee for the prosperous future of the country, he added.\nForeign Minister Bilawal Bhutto Zardari had made effective diplomacy to improve the country’s image among the comity of nations that also helped revive the CPEC initiative which was introduced by former President Asif Ali Zardari, Mandokhel said.\nMNA Seema Mohiuddin Jameeli of the PML-N said the IMF was delaying the bailout package due to the ill-conceived policies and decisions of the PTI regime.\nShe added that the coalition government in limited time made great efforts to resolve the economic crisis perpetrated by the PTI government.\nParliamentary Secretary for Power Division Rana Iradat Sharif Khan said the government’s negotiations with the IMF were underway that would bear fruits and the bailout deal would be materialised.\nHe was optimistic that all the preconditions set by the IMF were already met by the country.\nSenator Bahramand Khan Tungi of the PPPP opined that the coalition government’s negotiations with the IMF were underway. He added that unlike the PTI chairman the PPPP and coalition government believed that it was necessary to reach the IMF for the betterment of the people.\n“The coalition government after tedious efforts is resolving the economic issues created by the previous PTI regime and repaid billions of dollars loans taken by them.”\nTungi said PPP Chairman and Foreign Minister Bilawal Bhutto Zardari’s role in improving the country’s image was very significant.\nMNA Sardar Talib Hassan Nakai of the PTI said the government had been unable to handle the economic crisis whereas the debate in the Parliament was also not conforming with the prevailing economic mess.\nHe urged the government to adopt a prudent approach for handle the political crisis that aggravated the economic issues.\nParliamentary Secretary for Climate Change and Environmental Coordination Naz Baloch said the coalition parties were aware of the PTI’s failed policies as it had increased the country’s loans from Rs 24,000 billion to Rs 55,000 billion.\nShe said it was not possible but difficult to overcome the economic crisis. The Finance Minister had already assured the Parliament of taking public-friendly decisions in the coming days after the materialisation of the IMF bailout deal.",
  "retrievedAt": "2025-08-11T08:27:30.090Z"
}
