{
  "title": "All have to work hard for poverty alleviation, unemployment elimination: Shehbaz",
  "link": "https://www.app.com.pk/national/all-have-to-work-hard-for-poverty-alleviation-unemployment-elimination-shehbaz/",
  "date_published": "2022-04-13T17:18:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 13 (APP):Prime Minister Shehbaz Sharif on Wednesday said all had to work hard for the development of all the provinces, poverty alleviation, and to eliminate unemployment.\nThe prime minister was chairing a high-level meeting here to discuss Public Sector Development Programme (PSDP)-related development projects in Sindh and outstanding issues between the federal and provincial governments, according to a statement issued by the Sindh chief minister’s spokesperson.\nThe meeting was attended by Sindh Chief Minister Syed Murad Ali Shah and his cabinet members, Khalid Maqbool Siddiqui, Khuwaja Izhar and Kanwar Naveed of Muttahida Qaumi Movement-Pakistan, Khakan Abbasi, Ahsan Iqbal, Mariam Aurangzeb and Miftah Ismail of Pakistan Muslim League-Nawaz, Akram Durani and Maulana Assad Mahmood of Jamiat Ulema-e-Islam-Fazl. The chairmen of Water and Power Development Authority and National Disaster Management Authority, besides a number of federal secretaries were also present.\nShehbaz Sharif, who was on a day-long maiden visit to the Sindh metropolis after taking charge of the office, issued directives for early completion of K-IV bulk water project, construction of all the roads of the city’s industrial areas, and financially support to the provincial government in the procurement of buses for BRT projects.\nThe prime minister was told that in 2016, the Karachi Circular Railway (KCR) project was recommended by the 6th Joint Coordination Committee (JCC) for inclusion in the China Pakistan Economic Corridor (CPEC) projects. The project was approved by ECNEC at a cost of Rs 207.546 billion in 2017 under CPEC funding. Now the project has been revised by ECNEC in 2022 for Rs.181 billion to be taken up under PPP (Private-Public Partnership) mode.\nAt this, Shehbaz Sharif said under the PPP mode the project would be delayed, and decided to include it in the CPEC projects.\nAt the outset of the meeting, the Sindh chief minister welcomed the PM, said in 2015 then prime minister Nawaz Sharif had chaired a meeting at the CM House in 2015.\n“Your this meeting with the participation of all the partners will prove to be beneficial for the people of Pakistan, particularly of Sindh,” he added.\nThe chief minister, P&D chairman and provincial ministers briefed the prime minister about different projects and issues.\nThe prime minister informed that the augmentation works of K-IV would cost Rs 52.34 billion. The augmentation works include connectivity of the outlet of reservoirs being developed under the Greater Bulk Water Supply Scheme (phase-I 260 MIGD) to the main KWSB system in the city.\nUnder other works, it was told that the Pipri system of 65 MIGD was being developed to improve water supply in Districts Malir and Korangi and Cantonment areas. Water supply in Districts South and Central, and some areas of District West was also being improved at 130 MIGD.\nThe Hub System (65 MIGD) was also being upgraded to improve water supply in District West, North Karachi, Surjani, North Nazimabad & SITE areas.\nThe chief minister requested the prime minister to finance Rs10 billion for K-IV augmentation works because the funds committed by donor agencies would flow in January 2023. At this, the prime minister said that his government would support the Sindh government to complete augmentation works well in time.\nPM Shehbaz Sharif was told that 260 MGD K-IV, Phase-I costing Rs.126.4 billion had been approved and was being executed by WAPDA with the federal government’s funding.\nThe lining of Kalri Baghar Feeder Phase-I for improvement of KB Feeder System and extension of Keenjhar Lake would cost Rs.35.536 billion and Rs.75.564 billion respectively.\nThe chief minister requested that the PM to direct NEPRA to approve tariff rates for K-IV. He also requested that all the required funds of K-IV be made available so that it could be completed in time.\nThe prime minister vowed to provide all the required funds in time and directed the WAPDA chairman to start work on war footings to provide water to the city.\nShehbaz Sharif was told that KTP was announced in 2020 with an outlay of Rs1.17 billion for various projects in the areas of water supply, sewerage treatment management, internal roads and mass transit in Karachi.\nThe share of provincial government was Rs 686 billion whereas federal PSDP share was Rs487 billion, the chief minister said and added the total cost of public private partnership projects, at an advanced stage, was Rs176.9 billion and total viable gap fund/equity for the projects was Rs32 billion every year.\nThe chief minister requested the prime minister to issue necessary directives for issuance of sovereign guarantee/VGF for mega PPP projects and allocate Rs10 billion per year to finance provincial government’s annual obligation of Rs 32 billion.\nAt this, the prime minister assured the chief minister that the federal government would support the Sindh government.\nShehbaz Sharif was further told that the Sindh Infrastructure Development Co. Limited (SIDCL) was a public sector development company established under the Companies Act 2017 for execution of schemes by the federal government in Karachi. Under the company, 10 schemes of Rs.47.913 billion with an allocated of Rs.10.297 billion in PSDP 2021-2022 were in progress.\nThe chief minister requested the prime minister to abolish SIDCL and all its assets and schemes may be transferred to the Sindh government for execution.\nThe prime minister asked the chief minister to send him a proposal so that necessary action could be taken.\nThe chief minister told the prime minister that the Hyderabad-Sukkur Motorway project was approved by ECNEC in 2022 at a cost of Rs.165.7 billion under PPP. He added that the project envisaged construction of 306 km long, 6 lane wide, access controlled fenced motorway. The scope of work included one main bridge, 165 sub-ways, 123 cattle creeps, 30 kms service roads on either side, 10 service areas and 12 rest areas.\nThe prime minister said that he would include the project in CPEC.\nMurad Ali Shah said the Jamshoro-Sehwan Road project was approved in 2017 for Rs.14 billion. The Sindh government provided Rs7 billion in 2017 as its 50 percent share but the work had not been completed. At this the prime minister directed the National Highway Authority (NHA) to complete the project at the earliest.\nPM Shehbaz Sharif was told that total CDL outstanding as of June 30, 2021 against the Sindh government was Rs.28.162 billion. Since 1973-74, Sindh had paid Rs.159.101 billion against an outstanding CDL of Rs.72.653 billion. The interest rate of CDL was 6.8 percent to 17.71 percent. The New RBOD loan (1994-2020) was Rs.17.505 billion. The Sindh Government approached the Finance Division to exclude proposed debt service charges from 2011-2021 but it had differed only Rs.7 billion for next two years. The chief minister requested the prime minister to write off loan amount of Rs.17.505 billion and interest payment of Rs.12.027 billion and refund of deductions already made.\nThe prime minister asked the chief minister to file a proposed request with him so that action could be taken accordingly.\nThe meeting was told that after devolution, in July 2011, the three hospitals- Jinnah Post Graduate Medical Center Karachi, National Institute of Cardiovascular Diseases Karachi and National Institute of Child Health Karachi were transferred to the Sindh government.\nIn 2011, some JPMC employees belonging to other provinces went to the Sindh HighCourt on the plea that they want to go back to the Federation. In 2016, the Sindh High Court gave its decision against the devolution.\nThe Sindh government filed an appeal in the Supreme Court against the high court judgment. In February 2019, the Supreme Court upheld the decision of the High Court and decided that these three devolved institutes / hospitals be transferred to the federal government with the directions to reimburse all the expenses the Sindh government had incurred on these institutes since 2011, that come to Rs 110 billion.\nThe Sindh government had filed a review appeal in the Supreme Court in 2019, which was sub judice.\nThe prime minister decided that the federal and provincial government ministers should sit together to hand over the control of the hospitals to the Sindh government and agreed that the provincial government was running these hospitals properly.",
  "retrievedAt": "2025-08-11T14:41:58.440Z"
}
