{
  "title": "Probe into Opposition Leader’s ‘breach of privilege’ allegation directed",
  "link": "https://www.app.com.pk/national/probe-into-opposition-leaders-breach-of-privilege-allegation-directed/",
  "date_published": "2024-03-13T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): Deputy Speaker, National Assembly Ghulam Mustafa Shah on Wednesday while exercising his powers directed to initiate a probe into the allegations leveled by the Opposition Leader pertaining to the breach of privilege of the members of the House committed by the Islamabad Capital Territory Police.\nThe Deputy Speaker while chairing the National Assembly initiated the proceedings by administering oath to the new members of the House including Dr Ramesh Kumar Vankwani of Pakistan Peoples Party Parliamentarians (PPPP) and Tamkeen Akhtar Niazi of Pakistan Muslim League-Nawaz (PML-N).\nFateha prayer was also offered for the 14 drowned sailors of fishing village Ibrahim Haideri in Karachi who perished while fishing in deep waters. Martyrs of Multan, Quetta, Peshawar and Rawalpindi blasts and others died at different places and late brother of senior MNA, Ghaus Muhammad were also remembered in Fateha prayer led by MNA Ali Muhammad Khan.\nOpposition Leader, Omar Ayub Khan while addressing the floor said the Pakistan Tehreek-e-Insaf (PTI) and Sunni Ittehad Council members of the National Assembly (MNAs) were barred from entering the Parliament by the ICT Police which was a sheer violation of the Parliament’s privilege.\nHe urged the Deputy Speaker NA to exercise his powers to restore the privilege of the Parliament and should take an immediate action against the police officers and its top leadership for taking illegitimate action against the elected members of the House.\nThe Deputy Speaker announced that the Sergeant at Arms would be given the inquiry of the incident and would take action\nin the light of that report whereas a time of three days would be given to complete the report.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:17:27.563Z"
}
