{
  "title": "Chief Minister KP holds meeting over law, order",
  "link": "https://www.app.com.pk/national/chief-minister-kp-holds-meeting-over-law-order/",
  "date_published": "2024-03-13T10:24:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 13 (APP):Chief Minister Khyber Pakhtunkhwa Ali Amin Khan Ghandapur Wednesday presided over the important meeting related to law and order here with all concerned authorities including Chief Secretary and Inspector General of Police.\nThe chief minister was briefed by the officials of the security forces on the overall law and order situation in the province with challenges, future action plans, and other matters on behalf of the concerned authorities were also discussed.\nThe decision was taken to release a fund of three billion rupees for the purchase of armored vehicles, weapons and other modern equipment for the police.\nChief minister announced to inclusion of the heirs of police martyrs in the Ramadan package. He said that Rs 10,000 will be given to the heirs of police martyrs under the Ramadan package of the provincial government.\nChief Minister Ali Amin Ghandapur has also taken noted decisions for the children of police martyrs and directed the concerned authorities to fix a one-time quota for the recruitment of children of all martyrs under the Shahada Quota.\nA case should be prepared for the approval of the Cabinet for this purpose, the chief minister directed the meeting.\nIt is worth mentioning here that by setting a one-time quota, all the children of martyrs waiting for recruitment under the martyr quota will be able to be recruited simultaneously.\nChildren of police martyrs have been waiting for recruitment for many years due to the low quota of martyrs, the meeting was told. Work should be done to start the Safe City project in all the divisional headquarters of the province, the Chief Minister directed.\nThe meeting also deliberated on issues related to the establishment of a security division within the police for the security of important personalities and installations. The instructions of the Chief Minister to the concerned authorities to formulate a workable policy regarding providing security to important persons.\nLaw and order is the top priority of the provincial government, the Chief Minister Khyber Pakhtunkhwa Ali Amin Ghandapur said. There will be no compromise on law and order, he added.\nHe said that the police will be strengthened to deal with any situation, the chief minister said adding that for this purpose, the financial resources required by the police will be provided on a priority basis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:18:12.833Z"
}
