{
  "title": "Local govt minister pledges to make ‘Clean Punjab’ campaign mass movement",
  "link": "https://www.app.com.pk/national/local-govt-minister-pledges-to-make-clean-punjab-campaign-mass-movement/",
  "date_published": "2024-03-13T10:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 13 (APP):Minister for Local Government and Community Development (LG&CD) Punjab Zeeshan Rafique has pledged to ensured cleaning of drains every week at village level and to increase the number of cleaning staff, saying that ‘Clean Punjab’ [Suthra Punjab] campaign will be turned into a mass movement with the help of people.\nHe said for provision of better civic facilities, an effective sanitation model was being developed in villages. While presiding over a meeting on ‘Suthra Punjab’ campaign at the Civil Secretariat, he said cleanliness campaign was going on vigorously across the province. “On the directions of Chief Minister Maryam Nawaz Sharif, provision of necessary machinery was being ensured,” he added.\nSecretary Local Bodies Punjab Shakeel Ahmed Mian, Commissioner Lahore Muhammad Ali Randhawa also participated in the meeting, while chief officers of major municipal corporations across Punjab joined through video-link. Measures related to special focus on villages under the ‘Suthra Punjab’ campaign were also reviewed.\nThe provincial minister said that instead of the number of villages in the union councils, manpower should be provided in proportion to the population. He emphasised that ‘Suthra Punjab’ campaign was the flagship project of the provincial government. It was also necessary to involve the elected representatives of each area. He said that committees should be formed to represent citizens so that cleaning measures could be made long lasting. Zeeshan Rafique said that every district administration should organise a special lecture on cleanliness in educational institutions to increase awareness among the youth.\n“Cleanliness mechanism can become effective only with full participation of public,” he noted. The local government minister expressed his determination that the chief minister’s vision will be carried forward ‘with integrity and hard work. He said that garbage was being collected during house-to-house campaign both in villages and towns.\nSecretary LG&CD Shakeel Ahmed Mian said the ‘Suthra Punjab’ campaign was a revolutionary programme. “Municipal staff should work day and night to achieve the goals,” he said. He told the meeting that monitoring of the ‘Clean Punjab’ campaign was being ensured at the provincial level. He said that more attention was needed to dispose of garbage than to collect it. “This aspect should never be neglected,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:17:57.227Z"
}
