{
  "title": "IHC suspends PEMRA’s notification for banning live telecast of Imran’s speech",
  "link": "https://www.app.com.pk/national/ihc-suspends-pemras-notification-for-banning-live-telecast-of-imrans-speech/",
  "date_published": "2022-08-29T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The Islamabad High Court (IHC) on Monday suspended a notification of the Pakistan Electronic Media Regulatory Authority (PEMRA ) banning the live telecast of speech of PTI Chairman Imran Khan and sought comments from the respondents.\nChief Justice Athar Minallah heard the case filed by Pakistan Tehreek e Insaf (PTI) chief challenging PEMRA’s notification.\nThe court asked the petitioner’s lawyer whether he was defending the remarks of Imran Khan about the judges, saying it did not expect such a statement from the PTI leader.\nThe chief justice observed that a woman judge was given threats that she would not be spared. Whether the PTI chairman had given such instructions to his followers, he questioned.\nTorture on anyone was unacceptable but threatening a judge was a bigger crime, he remarked. It had even made the fair trial of Shahbaz Gill as disputed, he added.\nBarrister Ali Nawaz said Imran Khan had been served a show-cause notice and a first information report (FIR) was also registered against him.\nHe observed that according to PEMRA, the news channel had not adopted the time delay policy in the live telecast of Imran’s speech.\nAt this, the chief justice remarked that then the action should have been taken against the TV channels for not following the law.\nHe said torture was part of the police culture in Pakistan but no government had even taken it as an issue. The situation would have been different if those in government spoke in the same way they used to while in opposition, he added.\nThe chief justice remarked that every political party had its social media cell, and no party leader ever stopped his followers from ‘negative acts’.\nHe said the contempt of court proceedings would continue if objectionable remarks were made by the petitioner, however, the speech of anyone could not be banned on basis of that.\nImran Khan, in his petition, stated that he had given the statement regarding the torture on Shahbaz Gill and demanded to take legal action against the responsible. But his speech was perceived as ‘hate speech’ after being twisted, he added.\nHe prayed the court to set aside the notification of PEMRA.\nThe petitioner’s lawyer Barrister Ali Zafar pleaded that Imran Khan wanted to start the fund raising campaign for the flood affectees through the telethon service. He also read out the transcript of Imran Khan’s speech before the court.\nAfter listening to the arguments, the court summoned a senior official of PEMRA and sought clarification on the notification till September 5. The court remarked that PEMRA had apparently misused its powers by imposing ban on telecasting of Imran Khan’s speech.",
  "retrievedAt": "2025-08-11T15:29:00.050Z"
}
