{
  "title": "Power supply being restored in flood-ravaged Balochistan on PM direction",
  "link": "https://www.app.com.pk/national/power-supply-being-restored-in-flood-ravaged-balochistan-on-pm-direction/",
  "date_published": "2022-08-29T16:02:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 29 (APP): Additional Federal Secretary for Energy Power Division and Managing Director Power Planning and Monitoring Shakeel Qadir Monday said that as per Prime Minister Shehbaz Sharif’s directives, uninterrupted power supply may be ensured to all flood-hit areas of Balochistan in the shortest possible time.\nHe expressed these views while presiding over a high-level meeting at the Quetta Electric Supply Company headquarters regarding the electricity situation in Balochistan province.\nThe meeting was attended by QESCO Chief Executive Officer Abdul Karim Jamali, National Transmission and Dispatch Company Deputy Managing Director Manzoor Ahmed, Chief Engineers QESCO and other concerned officers.\nAddressing the meeting, Additional Federal Secretary for Energy Power Division and Managing Director Power Planning and Monitoring Shakeel Qadir said that in this hour of difficulty, giving relief to the consumers of all the affected districts was their first priority and in this regard, QESCO must restore electricity to all affected areas as soon as possible by using all available resources.\nHe said that the completion of the repair and rehabilitation of the fallen towers of the 132KV Sibi – Quetta and 220KV Dadu-Khuzdar transmission lines will provide relief to all the affected districts of the province.\nShakeel Qadir directed the officials of QESCO and NTDC to complete the repair and restoration work as soon as possible.\nFederal Additional Secretary, however lauded the efforts of QESCO as saying the restoration of electricity to the provincial capital Quetta in the shortest time is an exemplary achievement assuring ministry of Energy’s full support and cooperation.\nEarlier, Chief Executive Officer QESCO Engineer Abdul Karim Jamali, while giving a briefing on the situation after the rains and floods, said that due to the recent monsoon rains and floods, 10 towers of 220kv of NTDC fell near Bibi Nani bridge in Bolan area, while 3 towers of 132kv fell in Peer Ghaib area due to which the power supply to different districts of the province was suspended.\n“Power supply to many calamity-stricken areas have been restored,” he said, adding that efforts are afoot to restore the electricity in other areas badly affected by the rains and flood.",
  "retrievedAt": "2025-08-11T15:28:57.613Z"
}
