{
  "title": "President receives credentials from envoys-designate of Germany, Spain, Belgium, Libya, Kenya & Ethiopia",
  "link": "https://www.app.com.pk/national/president-receives-credentials-from-enviys-designate-of-germany-spain-belgium-libya-kenya-ethiopia/",
  "date_published": "2022-08-29T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The ambassadors-designate of Germany, Spain, Belgium, Libya, Kenya, and Ethiopia presented their credentials to President Dr Arif Alvi at a ceremony held here at Aiwan-e-Sadr on Monday.\nAmbassador of Germany, Alfred Grannas; Ambassador of Spain, Jose Antonia de Ory Peral; Ambassador of Belgium, Charles Delogne; Ambassador of Libya, Moamer Z. O. Abdalmotlab; Ambassador of Kenya, Mary Nyambura Kamau, and the Ambassador of Ethiopia, Jemal Beker Abdula, made separate calls on the President.\nTalking to the German Ambassador, the president said that Germany was one of the largest foreign direct investors in Pakistan.\nHe said that German firms with expertise in wind and solar energy as well as in hydel power projects could take advantage of new sets of incentives offered by Pakistan in these sectors.\nThe president encouraged German investors to invest in Pakistan’s Special Economic Zones (SEZs) under China Pakistan Economic Corridor (CPEC).\nHe said that keeping in view the huge potential of business, trade and investment between the two countries, the existing level of bilateral trade needed to be substantially improved.\nHe stressed the need for bilateral cooperation between the two countries to mitigate the negative fallout of climate change and global warming against the backdrop of devastating floods in Pakistan.\nTalking to the Ambassador of Spain, the President expressed the need to further expand bilateral relations in the economic, trade, investment and tourism sectors.\nHe appreciated the Spanish support to Pakistan on GSP Plus Scheme and hoped that this support will continue in future as well.\nHe stressed the need for the early finalization of an agreement on defence cooperation between the two countries.\nTalking to the Belgian Ambassador, the President stressed the need to substantially increase the volume of bilateral trade from its exiting volume of US$ 1.35 billion by increasing the pace of exchanges of business delegations, participating in trade fairs and launching joint ventures as well as forging meaningful cooperation in agriculture, port handling and dredging, and science and technology.\nTo the Ambassador of Libya, the President stressed the need for expanding the scope of trade ties and exploring new avenues of economic cooperation between the two countries.\nHe expressed the hope that the new ambassador, appointed after a gap of 11 years, would work towards further deepening the relationship between the two brotherly nations.\nTalking to the Kenyan Ambassador, the president said that Pakistan accorded utmost importance to the economic and trade ties with Kenya.\nHe also expressed satisfaction over the existing level of bilateral cooperation and coordination in the areas of trade, economy, defence and border management.\nDuring his discussion with the Ethiopian ambassador, the President appreciated the decision of Ethiopian leadership to open a diplomatic mission in Islamabad, and expressed the hope that it would improve bilateral relations, enhance mutual exchanges, and would open a new era of friendship and cooperation between the two brotherly countries.\nHe also welcomed the increasing cooperation between the two countries in the aviation sector and the commencement of two weekly direct flights reconnecting Karachi with Africa through Addis Ababa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:29:06.748Z"
}
