{
  "title": "Pakistan to never step back its stance on Kashmir: Ijaz Shah",
  "link": "https://www.app.com.pk/national/pakistan-to-never-step-back-its-stance-on-kashmir-ijaz-shah/",
  "date_published": "2020-02-06T00:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP):Minister for Interior Brig (r) Ijaz Ahmad Shah has said that Pakistan would not step back its stance on Kashmir as it was not an internal matter of India but a disputed territory and there have been United Nations resolutions pertaining to the issue.\n“The abrogation of article 370 and 35 A have not only deprived Kashmiris of their identity but has also made the matter controversial on International lines,” he said while addressing a National Seminar on “Decoding Hindu Mindset and India’s Strategic Motives” at National Defence University here, a press release said.\nThe Minister reinforced the point that Kashmir issue has affected us over the years and must be addressed at all fora, unless a sustainable solution is achieved.\nFor years, we have fought and then made peace; but the recent decision taken by the Indian government after August 5 last year that revoked the Special Status of Jammu and Kashmir by abrogating Article 370 of the Indian constitution has not only undermined humanity but has also brought International attention to the Kashmir dispute once again, he maintained.\nHe stressed upon the point that “India’s justification of revocation that it will enable the people of Kashmir to access the government programs that include the right to education and right to information, gets nullified by the forced cutting of communication lines and imposition of curfew in the valley.\nIjaz Shah explained how over the years, the Hindutva mindset has worked on forming grounds where they could negate the idea of Muslim dominated Jammu and Kashmir, but again, I reinforce, it was not about the religion or any set of beliefs, it was about the people of Kashmir being denied their right to self-determination.\nThe Hindutva movement that primarily reinforces the concept of Hindu Nationalism and is being closely followed by the current Indian government; has stated that Jammu and Kashmir is an integral part of India.\nHe said that “the Modi’s government has a history of stoking tensions between Hindus and Muslims, with its political rule now focused on “Hindutva” which translates as “Hindu-ness” and reframes Hinduism as an identity rather than a theology or religion. Modi has fostered Hindu nationalism through anti-Islamic rhetoric, from false accusations to lynching over consuming beef. Clearly, these are tactics designed to expand the notion of Hindutva and further isolate the Muslim population within India, targeting Kashmir is a crucial part of this strategy.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:45:21.724Z"
}
