{
  "title": "World Pulses Day to be marked on Feb 10",
  "link": "https://www.app.com.pk/national/world-pulses-day-to-be-marked-on-feb-10/",
  "date_published": "2020-02-06T02:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP):Like other parts of the globe World Pulses Day will be marked on Feb 10 across the globe including Pakistan to raise awareness about the benefits of pulses like chickpeas, dry beans, lentils and dry peas for people and for the planet.\nPulses Sustainable food for a sustainable future World Pulses Day is a designated United Nations global event to recognize the importance of pulses (chickpeas, dry beans, lentils, dry peas and lupins among others) as a global food. It has been proclaimed on February 10 of each year since 2019 by the General Assembly of the United Nations on December 20, 2018.\nThis celebration is a recognition of the decisive role that pulses can play in achieving the comprehensive, far-reaching and people-centred set of universal and transformative goals and targets of the United Nations’ 2030 Agenda for Sustainable Development, a plan of action that seeks to strengthen universal peace.\nPulses, also known as legumes, are the edible seeds of leguminous plants cultivated for food. Dried beans, lentils and peas are the most commonly known and consumed types of pulses.\nStaples dishes and cuisines from across the world feature pulses, from hummus in the Mediterranean (chick peas), to a traditional full English breakfast (baked navy beans) to Indian dal (peas or lentils).\nPulses do not include crops that are harvested green (e.g. green peas, green beans)—these are classified as vegetable crops. Also excluded are those crops used mainly for oil extraction (e.g. soybean and groundnuts) and leguminous crops that are used exclusively for sowing purposes (e.g. seeds of clover and alfalfa).\nThey are packed with nutrients and have a high protein content, making them an ideal source of protein particularly in regions where meat and dairy are not physically or economically accessible. Pulses are low in fat and rich in soluble fiber, which can lower cholesterol and help in the control of blood sugar. Because of these qualities they are recommended by health organizations for the management of non-communicable diseases like diabetes and heart conditions. Pulses have also been shown to help combat obesity.",
  "retrievedAt": "2025-08-11T18:45:20.548Z"
}
