{
  "title": "Speaker NA gives ruling to forward 50 Private Members’ bills to Legislative Council",
  "link": "https://www.app.com.pk/national/speaker-na-gives-ruling-to-forward-50-private-members-bills-to-legislative-council/",
  "date_published": "2020-02-06T04:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP):Speaker National Assembly Asad Qaisar on Thursday gave a ruling to forward 50 Private Members’ Bills to the Legislative Council that seek parliamentary review of the rules of different departments.\nThese bills were sponsored by three PTI lawmakers including MNAs Amjad Ali Khan, Riaz Fatyana and Syed Fakhar Imam. There had been mixed response in the House by the lawmakers on these proposed legislation, following which the Chair gave a ruling to refer all these bills to the Legislative Council for further consideration.\nThese bills mainly seek parliamentary review of the rules of various departments.\nIt may be mention that rules of both the National Assembly and the Senate provide\nthat delegated legislation may be examined by the Committees concerned.\nAccording to the statement of objects and reasons of these bills, “ Subject to the Constitution, primarily Majlis-e-Shoora (Parliament) has exclusive power to make\nrules with respect to any matter in the Federal Legislative List.\nFrequently, enactments empower the Government or specified bodies or office-holders to make rules to carry out the purposes thereof popularly known as delegated, secondary, or subordinate legislation.\nRules of both the National Assembly and the Senate provide that delegated legislation, may be examined by the Committees concerned. But practically, no effective parliamentary oversight has been made.\nFurther, in the prevalent legal system, it is also a departure from the principle of separation of powers that laws should be made by the elected representatives of the people in Parliament and not by the executive Government.\nIn parliamentary democracies, the principle has been largely preserved through an effective system of parliamentary control of executive law-making, by enacting the provision that copies of all subordinate legislations be laid before each House of the Parliament within prescribed sitting days, thereof otherwise they cease to have effect.\nAlthough under the Constitution, the Cabinet was collectively responsible to the Senate and the National Assembly, yet under the Rules of Business, 1973, the Minister-in-Charge was responsible for policy concerning his Division and the business of the Division was ordinarily disposed of by, or under his authority, as he assumed primary responsibility for the disposal of business pertaining to his portfolio.\nTherefore it was necessary that all rules including previously published, made after the prorogation of the last session, shall be laid before both Houses as soon as possible after the commencement of a session.\nAnd then it thereby shall stand referred to the Standing Committee concerned with the subject matter of the rules. The proposed amendments would achieve objective of valuable participation of the people in rules making process, meaningful exercise of authority by the Minister-in-Charge to assume primary responsibility for the disposal of business pertaining to his portfolio including rule making and efficient/effective parliamentary oversight relating to delegated legislation”.",
  "retrievedAt": "2025-08-11T18:45:12.977Z"
}
