{
  "title": "Media has important role in further strengthening brotherly ties with Saudi Arabia : Firdous",
  "link": "https://www.app.com.pk/national/media-has-important-role-in-further-strengthening-brotherly-ties-with-saudi-arabia-firdous/",
  "date_published": "2020-02-06T01:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan said on Thursday that Pakistan and Saudi Arabia enjoyed fraternal relations based on shared religious and cultural values and the media had an important role in further strengthening the brotherly ties.\nSpeaking as chief guest at a function here to mark second anniversary of the launch of Pakistan edition of leading Saudi newspaper Arab News, she said the media had played an active role in promotion of people-to-people and inter-state ties, and Arab News was playing its role in that regard in an effective manner.\nShe said Arab News was reflection of contemporary social, cultural and Islamic values of the Middle East. The launch of Arab News edition in Pakistan would prove to be a torch bearer of media development on Pakistan and hopefully the Pakistani media outlets would also replicate the latest technology being used by Arab News.\nShe said the visit of Saudi Crown Prince Muhammad bin Salman to Pakistan and Prime Minister Imran Khan to Saudi Arabia had proved milestones in further cementing ties of the two brotherly nations.\nShe said the hearts of Pakistanis and Saudis beat in union and they shared views.\nSouth East Asia Bureau Chief of Arab News Baker Atyani said Pakistan had moved towards peace and now news items were about business, democracy its diverse culture and religious tolerance , rather than terrorism as was the case few years ago.\nForeign Office Spokesperson Ayesha Farooqui while congratulating the Arab News over second anniversary of Pakistan edition launch, said the media had a role in strengthening Pak-Saudi ties based on shared religion and cultural values.",
  "retrievedAt": "2025-08-11T18:45:20.303Z"
}
