{
  "title": "PM warns Modi any further misadventure to be last one",
  "link": "https://www.app.com.pk/national/pm-warns-modi-any-further-misadventure-to-be-last-one/",
  "date_published": "2020-02-06T06:17:00.000Z",
  "source": "APP",
  "content": "MIRPUR, Feb 6 (APP):Prime Minister Imran Khan on Thursday, expressing Pakistan’s firm resolve to never leave Kashmiris alone, warned Indian prime minister Narendra\nModi that any further misadventure, would be the last one.\nAddressing a large public rally held in solidarity with people of Indian Occupied Jammu and Kashmir who faced continuous detention for last 185 days, the prime minister said Indian Prime Minister Narendra Modi, in his arrogance, made a blunder by taking illegal step on August 5 and unilaterally revoking the special status of Jammu and Kashmir.\nThe rally gathered men, women and even children who raised slogans against India’s atrocities in IOJ&K and waved flags of Kashmir and Pakistan as a symbol of unity.\nImran Khan said Pakistan would never leave Kashmiris alone, vowing that he, himself, would always fight the case as their ambassador.\nHe said Pakistan was a peaceful country, but never feared of fighting oppression if enforced on it.\nHe rebuffed the statement of Indian Prime Minister who claimed of having capability to conquer Pakistan in 11 days, saying he must read the history where tyrants met a disastrous fate.\nImran Khan said Pakistan was capable of winning tough wars including the fight against terrorism with its battle-hardened armed forces, which always fought with passion and faith in Allah Almighty.\nHe said whenever people in Indian Occupied Kashmir needed help, entire Pakistan would be ready to support them.\nThe prime minister said his visit to Mirpur had great significance in expressing solidarity with eight million people of Indian Occupied Jammu and Kashmir and giving them a message that not only the people of AJK, but entire Pakistan stood with their brethren\nin IOJ&K.\nHe mentioned that Almighty Allah in the Holy Quran says that with every difficulty\ncomes ease and said he had high hopes that Kashmiris would soon see a dawn of\npeace.\nImran Khan regretted that previous government put the issue of Kashmir on\nback-burner, however his government in six months internationalized the\ndispute by drawing world’s attention on India’s persistent human right abuses.\nHe said Kashmir issue was discussed thrice in the United Nations during this\ntime, which was unprecedented in the country’s history.\nThe prime minister recalled that Modi ‘in fact martyred’ Pakistan’s trees in last\nFebruary as contrary to his claim of targeting 300 people and downing two aircraft.\nHe said on the other hand, Pakistan as a goodwill gesture returned the captured\nIndian fighter pilot in an effort for peace in region, which Modi ungratefully dubbed\nas a step done out of fear.\nImran Khan said he apprised several world leaders he met at World Economic\nForum and other fora about the gravity of Kashmir issue, where the people suffered\nthe racist ideology of Narendra Modi.\nHe said the world was demanding lifting of curfew and resumption of internet and communication blockade, adding the day it was done, a mass of Kashmiri people\nwould voice out their concerns.\nThe prime minister said the situation in Indian Occupied Kashmir was against the\nethics and morality of human rights.\nForeign Minister Shah Mehmood Qureshi said waving of Pakistan’s flags in Mirpur rally gave a loud and clear message to Indian prime minister Narendra Modi that every Pakistani citizen would always stand with their Kashmiri brethren.\nHe said Kashmiris did not accept the unilateral action of India of revoking special\nstatus of Jammu and Kashmir as their resolve could not be deterred by illegal use\nof force by Indian security forces.\nHe said Pakistan would never leave their Kashmiri brethren alone.\nMinister for Kashmir Affairs Ali Amin Gandapur said Pakistan would continue to\nsupport Kashmiris in their just demand of right to self-determination. He said India\nshould realize that passion of Kashmiris, would ultimately win over abuse of its\nmight.\nAJK Prime Minster Farooq Haider said plebiscite was the only solution to resolve\nthe dispute of Jammu and Kashmir, adding the people of AJK had full confidence in\nPrime Minister Imran Khan who fought the case of Kashmiris at United Nations\nGeneral Assembly in New York.\nFormer AJK Prime Minister and PTI leader Barrister Sultan Mehmood said Prime Minister Imran Khan had strongly advocated the Kashmir cause at international forums and lauded that he allocated one day each, for Muzaffarabad and Mirpur, to join people, expressing solidarity with their brethren in IOJK.\nSpecial Assistant to PM on Information and Broadcasting Dr Firdous Ashiq Awan, Chairman Kashmir Committee Syed Fakhar Imam and Kashmiri leaders attended the event.",
  "retrievedAt": "2025-08-11T18:45:12.962Z"
}
