{
  "title": "Azam Tarar refers matter of delayed payments to land affectees to committee",
  "author": null,
  "content": "ISLAMABAD, Sep 29 (APP):Federal Minister for Law and Justice Azam Nazeer Tarar, on Monday, expressed concern over the prolonged delays in compensation payments to land-affected individuals in various Islamabad sectors and called for an immediate resolution under constitutional guarantees.\nDuring a calling attention notice in the National Assembly, Tarar acknowledged that while procedural delays are often inevitable in larger processes, the pace of action regarding compensation in sectors like C-15, C-13, C-14, and others is unacceptably slow.\nCiting a report, he informed members in Sarai Kharbuza, Sector C-15, that compensation has been disbursed to 504 affectedees, though outstanding payments worth Rs 156.78 million are yet to be cleared. Similarly, in Dhoke Baba Ashraf, only 97 of 287 affected individuals have been paid, leaving a balance of Rs 41.62 million in pending dues.\nIn Dharek Mori, Sector E-12, a majority of 919 out of 968 affected have received their compensation, with 49 cases still pending. In the Bhakkar area, 583 out of 585 cases have been settled, with only two individuals yet to be paid. Bhakkar Fateh Bakhsh has reported full compensation, with all 372 affected persons having received their payments.\nIn Sector E-12’s Bhakar Akku locality, 304 of the 323 affectedees have been compensated, while 19 are still waiting.\nMeanwhile, in Bara Dari, 54 of 91 individuals have been paid, with 37 cases pending. In Bara Dari Part-II, 23 out of 32 have received payments, leaving 9 cases unresolved.\nHe informed that a total of 3361 out of 3,611 land affectedees across various sectors have received compensation, while 250 cases remain unpaid.\nLaw Minister informed that in H-16 Mouza Noon, Sheikhupur, Jhangi Sayedan, out of 4,138 affectedees, only 1,936 have received compensation so far, 310 are partially paid, with 1,892 cases still awaiting disbursement.\nSenator Tarar also referenced the land-sharing formula applicable in sectors C-13, C-14, and C-15, where four kanals of acquired land are compensated with one kanal of developed plot. However, he admitted that delays have occurred due to various legal reasons.\n“The Constitution guarantees protection of property rights,” he emphasized. “If the state acquires land, the affected citizens must be compensated adequately and promptly. I assure the House that payments will be made in accordance with the law, and the Capital Development Authority (CDA) will play its role responsibly.”\n“If deemed appropriate,” he suggested, “this matter may be referred to the Standing Committee on Interior for further deliberation and public hearing.”\nLater, the Speaker referred this matter to the Interior Standing Committee, to allow for in-depth review and public consultation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:35:59.114Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/azam-tarar-refers-matter-of-delayed-payments-to-land-affectees-to-committee/",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T22:17:00.000Z"
}
