{
  "title": "Cabinet approved policy to bring jobs and opportunities for youth: Rana Mashhood",
  "author": null,
  "content": "ISLAMABAD, Sep 29 (APP): Prime Minister Shehbaz Sharif, through his directives, has led the federal cabinet to approve the National Youth Employment Policy, which was formally announced today in Lahore by Chairman Prime Minister’s Youth Programme (PMYP) Rana Mashhood Ahmad Khan.\nHe explained that this landmark initiative aims to create jobs, empower young people, and shape Pakistan’s economic future through targeted reforms and sectoral growth.\nRana Mashhood said the approval of the policy marks a historic step towards addressing unemployment, underemployment, and the skills gap in the country.\nHe emphasized that the framework is not just a policy document but a comprehensive roadmap to transform Pakistan’s large youth population into an economic asset.\nThe policy, he noted, seeks to tackle challenges such as the lack of career pathways, limited access to finance, gender disparities, and weak linkages between industry and academia. “It is a commitment by the government to equip our youth with the tools they need to compete in a fast-changing global economy,” he said.\nSharing the key targets, Rana Mashhood stated that by 2030, women’s participation in the labour force will be raised to 35 percent.\nHe added that the number of young people currently out of education, employment, and training would be reduced to less than half, helping Pakistan achieve a stronger and more inclusive labour market.\nHe further explained that new businesses, entrepreneurship, and small firms are expected to grow by 10 percent annually under this policy.\nTen strategic sectors have been identified for targeted development. These include agriculture and food production, e-commerce, health, housing, information technology, logistics, manufacturing and mechanical engineering, mines and minerals, overseas employment, and tourism.\nRana Mashhood underlined that the policy is closely aligned with Pakistan’s Vision 2030 and the Sustainable Development Goals (SDGs).\nHe said the government is committed to bridging the gap between education and industry needs, creating an enabling environment for startups, and promoting women and youth in both traditional and emerging sectors.\nHe also highlighted that several flagship programmes will play a pivotal role in meeting the objectives of the policy. These include the Prime Minister’s Youth Business and Agriculture Loan Scheme, the Prime Minister’s Youth Skills Development Programme, the National Internship Programme, the National Apprenticeship Programme, and the Lady Health Workers Programme.\nAnswering media questions, Rana Mashhood said the implementation framework includes measurable indicators, provincial coordination, and strong public-private partnerships.\nHe assured that transparency and monitoring mechanisms will be enforced, while civil society and development partners will also play a role in oversight.\n“This policy will serve as a social contract between the government and the youth of Pakistan,” Rana Mashhood concluded, reaffirming that youth empowerment remains a top priority for Prime Minister Shehbaz Sharif.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:37:37.978Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cabinet-approved-policy-to-bring-jobs-and-opportunities-for-youth-rana-mashhood/",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T16:02:00.000Z"
}
