{
  "title": "Kamal announces complete digitalization of PNC",
  "author": null,
  "content": "ISLAMABAD, Sep 29 (APP):Federal Minister for Health, Syed Mustafa Kamal, has announced the complete digitalization of the Pakistan Nursing Council (PNC) to enhance efficiency, transparency, and merit-based practices in its operations.\nChairing a high-level meeting on the affairs of the Council, also attended by the Federal Health Secretary and Additional Secretary, the Minister said that all functions of the PNC will soon be computerized to minimize human intervention and eliminate inefficiencies.\n“We will restore the lost credibility of the nursing profession and transform the Pakistan Nursing Council into a modern, effective, and internationally recognized institution,” said Mustafa Kamal.\nHighlighting the critical role of nurses in Pakistan’s healthcare system, the minister pointed out the acute shortage of nursing professionals in the country.\nPakistan faces a shortfall of nearly 900,000 nurses, while the global shortage stands at around 2.5 million. He reaffirmed the government’s commitment to strengthen the sector through comprehensive reforms, robust policies, and modern digital systems.\nMustafa Kamal stressed that nursing is one of the most vital pillars of the health sector, adding that bold initiatives are underway to bring the profession in line with international standards.\n“We will modernize the nursing sector, ensure merit-based practices, and introduce effective reforms so that Pakistan’s nursing workforce can meet both national and international demands,” he noted.\nThe minister concluded by reiterating that reforms in the nursing sector will continue with a strong emphasis on transparency, modernization, and capacity-building to uplift the profession and ensure quality healthcare delivery across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:37:35.257Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kamal-announces-complete-digitalization-of-pnc/",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T17:02:00.000Z"
}
