{
  "title": "People living along Pak-Afghan border can play vital role for regional peace: Speakers",
  "link": "https://www.app.com.pk/national/people-living-along-pak-afghan-border-can-play-vital-for-regional-peace-speakers/",
  "date_published": "2020-10-18T11:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Speakers at an online conference organized by the Department of Political Science (PSUP) of the University of Peshawar and the Hanns Seidel Foundation (HSF) Pakistan said the people living along the both sides of Pak-Afghan border could play a vital role for regional peace because of long history of relations based on same religion, culture and ethnicity.\nAddressing the 9th International Conference on ‘The Dynamics of Change in the Pakistan-Afghanistan Region: Politics, (Dis) Integration and Reformation in the Borderland, chief guest Prof Dr Ijaz Khan Khattak of Quaid-i-Azam University said that the people residing along across the Pak-Afghan border had a long history of interaction, besides deep-rooted economic, social and political relations.\nHe said there was a potential for the borderlands to become a source of peace for the region and friendship between Afghanistan and Pakistan by enhancing the cooperation among their people along the border because they belonged to same ethnicity, culture and religion.\nResident Representative of the Foundation in Pakistan Dr Steffen Kudella said:\n“Borders separate us, but that does not mean that we are not connected with our neighbours. Today, we are even more connected than ever due to digital change.”\nDr Steffen Kudella said,”Democracy requires those who vote to be prepared to choose wisely. Political wisdom, therefore, is the precondition of any successful democracy, and political wisdom depends on education.”\nThe conference was attended online by a large number of people, including faculty members and students of universities, besids national and international experts.\nDr Steffen Kudella also inaugurated a digital studio at PSUP, which has scheduled to host International Summer School on the same topic.",
  "retrievedAt": "2025-08-11T19:55:03.868Z"
}
