{
  "title": "Opposition unites to avoid accountability, says Info Minister to PTV National",
  "link": "https://www.app.com.pk/national/opposition-unites-to-avoid-accountability-says-info-minister-to-ptv-national/",
  "date_published": "2020-10-18T18:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 18 (APP): Minister for Information Senator Shibli Faraz Sunday said, the government and opposition were parts of the democratic system and the role of opposition is to point out mistakes of the government for rectification.\n“But unfortunately in our country the opposition was busy in the defense of their corruption”, he said adding “In past two parties had an unwritten agreement of coming into power turn-by-turn, and now they united only to avoid accountability”. He was talking in a PTV National program here on Sunday.\nHe said the politicians of the past extended their business during their regimes and that was why millions of rupees were recovered from the accounts of their servants.\nHe said the pandemic of coronavirus affected the economies worldwide and we too bore the brunt of the virus however Prime Minister Imran wanted to put minimum burden on the poor and bring prices of commodities to a minimum level.\nEarlier, the Federal Information Minister paid a detailed visit to the Pakistan Television Center, Peshawar.\nHe was received by General Manager, Aurangzeb Afridi on arrival. The staff of PTV National presented traditional shawl and Chitrali Cap to the Information Minister.\nTalking to the heads of different departments of PTV, the Minister said, PTV was an important part of the Information Ministry and the government was taking cogent steps for the revival of its past glory.\nHe said no government paid heed towards the development of PTV in the past adding that there was a lot of space for improvement in its performance.\nTo achieve this objective, he said the process of reforms has started under which provision of digital platform to PTV will be ensured. He said on management level efforts were on to acquire necessary machinery and gadgets for PTV.\n“We are trying to make the PTV a self-sustainable department and the days of progress of PTV and Radio Pakistan are nearer”.\nLater, the Minister went to Radio Pakistan Peshawar and visited different sections. The Station Director briefed the Minster on working and performance of different sections of the station.\nThe Minister in his brief talk there said senior artists should be provided Sehet Cards adding that there was a need of compiling data of senior artists who served the nation with their talent.\nHe said these artists gave their best time to radio. Once the data was compiled, the Information Ministry should be informed about the financial condition of these artists.\nRadio Pakistan, he said was moving forwards towards modernization and digitalization.\nThe Radio was an important source of delivering information regarding policies of the government.\nHe added that in the past no attention was paid towards making these institutions financially sound that was why the institutions became financially weakened.\nHowever, he said reforms were underway to bring the institutions on strong financial footings.",
  "retrievedAt": "2025-08-11T19:55:01.517Z"
}
