{
  "title": "PML-N leadership starts to criticize national institutions; when it failed to secure an NRO",
  "link": "https://www.app.com.pk/national/pml-n-leadership-starts-to-criticize-national-institutions-when-it-failed-to-secure-an-nro/",
  "date_published": "2020-10-18T18:22:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 18 (APP): Federal Minister for Planning Development & Special Initiatives, Asad Umar said PML-N leadership started to malign the national institutions because it could not succeed to get an NRO to save their looted money.\nHe expressed such views while addressing press conference here at his residence on Sunday.\nHe was flanked by Federal Minister for Maritime Affairs, Syed Ali Haider Zaidi.\nAsad Umar said that Former premier Nawaz Sharif also sent an envoy twice to secure an NRO for himself and her daughter, now he was criticizing national institutions.\nThis did not happen a decade or months back but it happened a few weeks ago, he added.\nLashing out at PML-N leadership, the minister said PML-N leader Nawaz Sharif was selling narratives of India but Indian narratives can not sell anymore neither in Pakistan, nor across the world.\nNawaz Sharif was dishonest and absconder and wanted in Pakistan, he added, saying his politics based on hypocrisy. He has nothing to do with politics or democracy but to save his corruption.\nSitting in London, he is talking about the role of institutions and he did not forget what he has done, he said adding he supported dictator and secured Chief Minister-ship or ministry in past.\nDuring Junejo regime, he was standing with dictator not with Junejo, the minister said adding IJI was formed and elections were rigged where he became successful in becoming chief Minister of Punjab.\nNawaz Sharif was talking about judiciary but he himself attacked Supreme Court of Pakistan and then chief justice of Supreme Court of Pakistan.\nThe verdict of panama case was written by judges of Supreme Court, he added.\nPTI leader said that former premier criticized national institutions openly but he has never raised his voice against Modi and his government for committing the heinous crime against Muslim in India.\nWhy Indian Prime Minister, Modi visited the house former premier of Pakistan as Modi oversaw the massacre of Muslims in Indian Gujarat, he asked.\nAsad Umar urged the oppositions not to drag country’s institutions into politics.\nCriticizing Pakistan People Party (PPP) leadership, the minister said that this was same party and leaders who was talking about the implementations of SOPs to contain the COVID-19 in the country. Now same party and its leadership were violating SOPs by organizing the jalsa in the country.\nCriticizing PPP leadership, he said PPP leadership was appreciating the projects in Lahore but it did not launch single project to provide facility of bus service in the Sindh province.\nApart from this, there is not law and order in the province, the minister added, saying provincial government could not provide the basic facilities to people here.\nNo democracy can prevail without accountability, he said PPP leadership was using all machinery to win elections in the province, the federal minister said.\nReply to a question, Asad Umar said foreign elements were working in the country to sabotage CPEC and the democracy.",
  "retrievedAt": "2025-08-11T19:55:01.533Z"
}
