{
  "article_id": "2025-10-11_6f2da48867a7f7d5464c65823c0b378d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cjp-visits-upper-chitral-extends-judicial-outreach/",
    "retrieved_at": "2025-10-12T00:04:12.389Z"
  },
  "metadata": {
    "title": "CJP visits Upper Chitral, extends judicial outreach",
    "author": null,
    "date_published": "2025-10-11T15:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 442,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 11 (APP):Reaffirming judiciary's commitment to extending access to justice across Pakistan's most remote regions, the Chief Justice of Pakistan undertook a landmark visit to - the farthest district of Khyber Pakhtunkhwa Province. Speaking to the Judicial Officers and Members of the Bar at Booni, his lordship observed that Booni -being the terminal judicial post serving the people of this remote region- was chosen in view of a discernible disconnect between the underserved population of Pakistan's farthest areas and the Access to Justice Development Fund, which warranted immediate attention. Engaging with Judicial Officers and Bar Associations of Upper and Lower Chitral, the Chief Justice commended their dedication under challenging circumstances and emphasized that the Bench and Bar are equal partners in upholding the rule of law. He underscored integrity, mutual respect, and accountability as essential pillars of judicial independence and assured full institutional support for strengthening the district judiciary, being the main facet of justice system. Highlighting ongoing reforms, the Chief Justice announced that over Rs. 3.3 billion have been allocated out of relevant window of the Access to Justice Development Fund and grants from Federal Government to upgrade court infrastructure and public facilities by August 2026. It was informed that at the completion of these locally customized projects, all districts and tehsils will have solar-powered courts, e-libraries, water filtration plants, women facilitation centers, and legal aid for unrepresented litigants, funded through the Access to Justice Development Fund. These reforms are being implemented through the National Judicial (Policy Making) Committee (NJPMC), comprising all Chief Justices of the High Courts, it was added. The Chief Justice underscored that measures are underway to set in place systems for performance evaluation of judges based on Rule of Law indicators, standardized recruitment and training systems, formation of District Judiciary Policy Forums, uniform service structures, and digital transformation of courts in collaboration with the Ministry of Information Technology. International partnerships are also progressing, with MoUs being finalized with the Supreme People's Court of China and the Constitutional Court of Turkiye to enhance judicial cooperation. Reaffirming his commitment to judicial independence, the Chief Justice reiterated that every judicial officer will be fully supported in the discharge of his duties in accordance with law and protected from undue influence. A mechanism for institutional response to such influences has been notified, it was added. Besides witnessing the inauguration of video link facility extended by Peshawar High Court at Booni, he attended the historic Langlands School and College and appreciated its enduring role in education and community service. The visit signifies the institution's resolve to bring justice closer to citizens, ensuring equitable access and institutional presence across Pakistan's farthest districts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}