{
  "title": "Pakistan to ensure security of Chinese personnel, projects: FO Spokesperson",
  "author": null,
  "content": "ISLAMABAD, Feb 06 (APP):Pakistan reaffirmed that ensuring the safety and security of Chinese personnel, projects and institutions in Pakistan was the foremost responsibility of the Pakistani government as China’s All-weather Strategic Cooperative partner and the host country.\nIn a statement during his weekly press briefing, the Foreign Office Spokesperson said on Thursday that during the visit of President Asif Ali Zardari to China, Pakistan reiterated its strongest condemnation of the terrorist attacks in Pakistan involving Chinese personnel.\nPresident Asif Ali Zardari is currently on a state visit to China scheduled from 4-8 February 2025.\nDuring the visit, he said President Zardari held talks with President Xi Jinping in a warm and friendly atmosphere. They had an in-depth exchange of views on China-Pakistan relations and on the international and regional issues of mutual interests. Li Qiang, Premier of the State Council of the People’s Republic of China, and Zhao Leiji, Chairman of the Standing Committee of the National People’s Congress, met with President Zardari respectively.\nThe Pakistani side highly commended and expressed strong support for the Global Development Initiative, the Global Security Initiative, and the Global Civilization Initiative put forth by President Xi Jinping. The two sides agreed to step up international cooperation in this regard.\n“The Pakistani side reaffirmed its firm commitment to the one-China principle. It is of the view that Taiwan is an inalienable part of the territory of the People’s Republic of China and the Taiwan question is the core of China’s core interests. Pakistan will also firmly support China on issues related to Xinjiang, Xizang, Hong Kong and the South China Sea,” he added.\nThe Spokesperson said the Pakistan side spoke highly of the Belt and Road Initiative put forth by President Xi Jinping. The two sides agreed to promote the implementation of the eight major steps on high-quality Belt and Road cooperation in Pakistan and jointly build a growth corridor, a livelihood-enhancing corridor, an innovation corridor, a green corridor and an open corridor, to create an upgraded version of CPEC, in line with Pakistan’s 5Es framework.\nThe two sides agreed to strengthen cooperation in industrialization, development of export oriented industries, agriculture cooperation, alleviation of power shortages, and communication technologies, healthcare, education, climate response, disaster prevention and alleviation, he continued.\nHe said the two sides underscored that the strategic defense and security cooperation between China and Pakistan played an irreplaceable and critical role in maintaining peace, stability and strategic balance in the region. The two sides believe that a peaceful and prosperous South Asia is in the common interest of all parties and reaffirmed the importance of maintaining peace and stability in South Asia and the need for resolution of all outstanding disputes, and their opposition to any unilateral action.\nThe two sides agreed to maintain close communication and coordination on the issue of Afghanistan, and resolved to play a constructive role in helping Afghanistan achieve stable development and integrate into the international community. The two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude, he remarked.\nThe two sides welcomed the ceasefire agreement in Gaza, and hoped that the agreement will be implemented effectively, leading to a full and permanent ceasefire in Gaza, he told.\nHe said, “Pakistan condemns Israel’s undue restrictions impeding the flow of aid, shelters and necessary medical equipment to the territory, in violation of the ceasefire deal. As per the agreement 60,000 trailers and 200,000 tents were supposed to enter Gaza and the deal also required Israel to allow equipment to help clear the rubble to reach Gaza. Amidst dire humanitarian needs, Israel’s undue restrictions are an outright violation of the ceasefire agreement, and it will have dangerous and unprecedented implications for the entire region.”\n“We call on the international community to break its silence on the blatant violation of the ceasefire agreement by Israel and its continuous atrocities committed against the innocent Palestinians. The international community must step up and ensure that the ceasefire agreement is honored in letter and spirit. We also urge the international community to hold Israel accountable for its war crimes and crimes against humanity,” he added.\nHe said, “We call for enhanced, unhindered humanitarian assistance to those in urgent need; opening of all access points of supply to Gaza; and for allowing all UN and international agencies, including UNRWA to operate fully in Gaza. We also reaffirm our unconditional support for the right to self-determination of the Palestinian people and for the creation of a Palestinian state with Al-Quds Al-Sharif as its capital.”\nHe said the government and people of Pakistan on Wednesday observed the ‘Kashmir Solidarity Day’, and expressed their resolve to stand with the Kashmiri people in their just struggle for the realization of their right to self-determination.\nAhead of the Kashmir Solidarity Day, a briefing was organized for Islamabad-based diplomats to apprise them of the situation in IIOJK.\nThe officers and staff members of the Ministry, led by the Foreign Secretary, participated in the ‘Solidarity Day Walk’ held on the Constitution Avenue, he informed.\nHe said a wide range of other activities, including seminars, webinars, public rallies and photo exhibitions were organized across the country, and at Pakistan’s diplomatic missions around the world. These activities were aimed at expressing solidarity with the Kashmiri people and highlighted the human rights violations in IIOJK.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:27:14.360Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-ensure-security-of-chinese-personnel-projects-fo-spokesperson/",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T16:08:00.000Z"
}
