{
  "title": "Senate body reviews WAPDA audit inquiries",
  "author": null,
  "content": "ISLAMABAD, Feb 6 (APP): The Senate Standing Committee on Water Resources, led by Senator Shahadat Awan, convened Thursday to receive a comprehensive briefing concerning the inquiries conducted by the ministry upon the recommendations of the Departmental Accounts Committee and Public Accounts Committee in the audit paras of WAPDA.\nThe officials informed that 56 inquiries were conducted on the recommendations of the Public Accounts Committee (PAC), of which 43 are completed, 10 are in progress, and the remaining three are being investigated by NAB. Additionally, 381 inquiries were initiated upon the recommendations of the Departmental Accounts Committee (DAC), of which 308 are completed and 67 are pending, said a press release.\nSenator Shahadat Awan stated that 187 audit paras are pending, with some having been pending since 1985, and surprisingly, the ministry didn’t have any records in some cases. Secretary Water Resources apprised that the inquiry on all the audit paras will be conducted in chronological order; however, priority is given to foreign-aided projects.\nAfter detailed deliberation, the Committee recommended that the ministry provide the details of cases pending before the courts. The Committee also recommended providing the details of individuals against whom responsibilities have been fixed upon the conclusion of inquiries.\nIn attendance Senators Saadia Abbas, Mohammad Humayun Mohmand, Faisal Saleem Rehman, Secretary Water Resources Syed Ali Murtaza, Chairman WAPDA Lt. General (Retd) Sajjad Ghani along with other senior officials of relevant departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:27:19.329Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-body-reviews-wapda-audit-inquiries/",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T14:57:00.000Z"
}
