{
  "title": "28 bottle water brands unsafe for consumption: PCRWR’s report",
  "author": null,
  "content": "ISLAMABAD, Feb 06 (APP): The Government of Pakistan has directed Pakistan Council of Research in Water Resources (PCRWR) for quarterly monitoring of bottled/mineral water brands and publicize the results for awareness of public health.\nFor the 4th quarter of year 2024 (October to December), 176 samples of mineral/bottled water brands were collected from 20 cities, said a press release issued here on Thursday.\nThe comparison of test results with the bottled water quality standards of Pakistan Standards & Quality Control Authority (PSQCA) has revealed that 28 brands were unsafe for human consumption due to microbiological or chemical contamination.\nTen brands (Miran Drinking Water, Pak Aqua, Jel Bottled Water, Neo, Aab-e-Dubai, Eltsen, Pure Water, Aqua Health, Oslo, More Plus) were found to be unsafe due to presence of higher levels of sodium, five brands (One Pure Drinking Water, Indus, Premium Safa Purified Water, Orwell, Natural Pure Life) was found to be unsafe due to presence of higher levels of arsenic, while, one brand (Hunza Utter Water) were found unsafe due to presence of high level of Potassium than the permissible limit. Sixteen brands (SS Water, Sip Sip premium drinking water, Miran Drinking Water, D-Nova, Sky Rain, Neo, Pure Water, Dream Pure, Aqua Sharav Pure Drinking Water, Marvi, Ice Well, Akb Sky, Karakorum Spring Water, More Plus, Essentia, Life Inn) were found contaminated with bacteria and thus were unsafe for drinking purpose. General public is encouraged to look at the detailed report to know about the status of water quality of bottled water brands they consume.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:26:22.877Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/28-bottle-water-brands-unsafe-for-consumption-pcrwrs-report/",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T10:58:00.000Z"
}
