{
  "title": "Pakistan, UAE agree to boost cooperation between state news agencies",
  "link": "https://www.app.com.pk/national/pakistan-uae-agree-to-boost-cooperation-between-state-news-agencies/",
  "date_published": "2021-05-26T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):Pakistan and the United Arab Emirates (UAE) on Wednesday agreed to enhance cooperation of their official news agencies for free flow of information between the two countries.\nThe agreement was reached during a meeting between Minister of State for Information and Broadcasting Farrukh Habib, and UAE’s Ambassador to Pakistan Hamad Obaid Ibrahim Al-Zaabi , said a news release.\nBoth the dignitaries were of the view that the increase in cooperation of the Associated Press of Pakistan (APP) and Emirates News Agency (WAM) would be a leap forward in the free flow of information between the two countries.\nThe UAE ambassador was called on Farrukh Habib here at his office.\nDuring the meeting, they discussed matters of mutual interests, including media cooperation, tourism, trade and climate changes.\nThe need for exploiting the vast potential of bilateral trade between the two countries was also underlined during the meeting.\nFarrukh appreciated the UAE ambassador’s visit to Faisalabad for exploring its potential in textile and garment industry, and apprised him that “Pakistan’s agricultural and textile products are the best in the world.”\nThe market for the products might be explored by the Pakistani businessmen in the Middle-East, he added.\nThe minister of state informed the ambassador of the economic turnaround in Pakistan, especially in times of the coronavirus pandemic.\n“Our foreign reserves, exports and remittances have touched high levels,” he said, adding the overseas Pakistanis had deposited one billion dollars in the Roshan Digital Bank accounts, which showed that they had trust in the steps taken by Prime Minister Imran Khan led government.\nThe minister also apprised the ambassador of various step taken by the Pakistan Government for social welfare and protection of its people.\nAs regards cooperation on the climate changes, he said ‘Green Diplomacy’ would venture new avenues of promoting bilateral relations between the countries. Both the UAE and Pakistan enjoyed cordial relations, which were based on mutual trust, he added.\nHe remarked that the UAE was like another home to Pakistanis as currently around 1.5 million Pakistanis worked there.\nAmbassador Alzaabi appreciated the contribution of Pakistani workers in the development of UAE.\nHe told the minister of state that participation in his country’s Expo 2020 would provide an opportunity to the Pakistani businessmen to develop their businesses, and connect them with the business community around the world.\nPakistan and the UAE were celebrating 50th anniversary of their relations, he noted.\nFarrukh Habib expressed his pleasure over completion of the milestone in the relationship of both brotherly countries. “This anniversary will be fully celebrated by both the countries,” he added.\nHe extended his best wishes to Crown Prince of Abu-Dhabi Sheikh Muhammad Bin Zayed bin Sultan Al Nahyan.\nFarrukh Habib emphasized on stronger people-to-people contacts, frequent mutual visits by the media delegations, and civil society members between the two countries.",
  "retrievedAt": "2025-08-11T20:46:05.384Z"
}
