{
  "title": "Provision of equal opportunities to poor, rich govt’s foremost priority: PM",
  "link": "https://www.app.com.pk/national/provision-of-equal-opportunities-to-poor-rich-govts-foremost-priority-pm/",
  "date_published": "2021-05-26T15:57:00.000Z",
  "source": "APP",
  "content": "LAYYAH, May 26 (APP): Prime Minister Imran Khan on Wednesday said that the provision of equal opportunities to the rich and poor alike and steering the people out of poverty was the foremost priority of the present government.\nHe regretted that the previous governments except some districts of Punjab continued to neglect other areas, adding, however the present government was giving special priority to equitable distribution of development projects.\nThe Prime Minister expressed these views during a meeting with the Members of National and Provincial Assemblies belonging to South Punjab and the office bearers of Pakistan Tehik-e-Insaf (PTI) here.\nSpecial Assistants to PM Dr. Faisal Sultan, Malik Amir Dogar, Dr. Shehbaz Gill, Chief Minister Punjab Sardar Usman Buzdar, Special Assistant to CM Dr. Firdous Ashiq Awan MNAs Amir Mehmood Kayani, Abdul Majeed Khan Niazi, Niaz Ahmad Jhakar, MPAs Rafaqat Gilani, Tahir Randhawa, Shahbuddin Sehr, Malik Ahmad Ali Aulakh and PTI office bearers were present in the meeting.\nDuring the meeting, the elected members apprised the Prime Minister of the problems of their respective constituencies and the measures taken by the federal and provincial governments in that respect.\nBesides, they also appreciated the Prime Minister for giving special attention to South Punjab and initiating historic development work in the region to address the deprivation of South Punjab.\nThe Prime Minister was told that farmers’ community was prospering due to record wheat production and the better rate of return their received for their agricultural produce. Besides the provision of direct subsidy to small growers through Kissan Card had also started bringing positive results, he was told.\nChief Minister Punjab Usman Buzdar told the Prime Minister that an amount of Rs. 30 million had been allocated for the promotion of tourism in the area especially for Thal Jeep Rally.\nFor the provision of modern educational facilities in Layyah, he said, six new colleges and one university were being established. Besides a new rescue system was also being launched, which would ensure the provision of timely emergency medical care to the population of surrounding areas, he added.\nThe Prime Minister while seeking from Members of National and Provincial Assemblies the details of projects relating to the supply of clean drinking water, supply of electricity and the aversion of land erosion by river in the area issued directions for ensuring the completion of projects as early as possible.",
  "retrievedAt": "2025-08-11T20:46:04.539Z"
}
