{
  "title": "Fawad for Pak-Egypt-Saudi joint venture in film making related spheres",
  "link": "https://www.app.com.pk/national/fawad-for-pak-egypt-saudi-joint-venture-in-film-making-related-spheres/",
  "date_published": "2021-05-26T18:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP): Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain Wednesday proposed joint venture and cooperation of Egypt, Saudi Arabia and Pakistan in the field of film production.\nTalking to Egyptian Ambassador Tarek Dahrough, he said the enhanced cooperation in the arena of films and joint productions would not only help reinforce cultural bonds but also prove instrumental in further cementing brotherly relations, according to a news release.\nThe minister proposed a virtual meeting between the film producers associations of Pakistan and Egypt to discuss collaboration in the field of feature films. He expressed the desire for facilities for Arabic dubbing of Pakistani programmes. They also discussed possibilities for exchange of Tele Plays between the two countries.\nThe minister informed the ambassador that the Ministry of Information and Broadcasting was finalizing the draft memorandum of understanding (MoU) between Pakistan and Egypt envisaging cooperation in the fields of radio and TV.\nIt would pave the way for programme exchanges and facilitate exchange of visits by technical experts and artists of the two countries, he said. Both sides agreed that for further discourse on media cooperation, the information minister’s phone contacts with Egyptian counterpart, Director High Council of Media, Egypt would be arranged.\nThe minister also apprised the ambassador regarding the government’s initiative to establish the media university for imparting education and training in the faculties of film, media and performing arts.\nThe ambassador welcomed the idea of information minister regarding joint venture engaging Pakistan, Saudi Arabia and Egypt in the area of films. He also agreed to extend cooperation for joint religious programmes as recommended by the minister. For that Egyptian scholars already working in Pakistan would be engaged.\nThe Egyptian envoy said he was eagerly looking forward to the possible signing of the MoU on TV-radio cooperation between the two countries.",
  "retrievedAt": "2025-08-11T20:46:03.888Z"
}
