{
  "title": "Wafaqi Mohtasib disposes of 193,028 complaints in 2023",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-disposes-of-193028-complaints-in-2023/",
  "date_published": "2024-03-25T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 25 (APP): Wafaqi Mohtasib of Pakistan has processed a record 194,099 complaints against the maladministration of government departments in 2023, which is 18% higher than the previous year.\nOut of these, 193,028 complaints were disposed of which is 22% higher than the year 2022.\nThis was reported by Wafaqi Mohtasib Ejaz Ahmad Qureshi who called on President Asif Ali Zardari on Monday and presented the annual report of the Federal Ombudsman at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nThe mohtasib briefed the president about the performance and initiatives taken by the federal ombudsman.\nHe said that the ombudsman was providing speedy and free-of-cost justice to the complainants against the maladministration of various government departments.\nHe informed that 49,190 complaints were received online in 2023, which was an increase of 47% from last year adding that 22,321 complaints were received through the mobile app, showing an increase of 21% as compared to the year 2022.\nHe said the ombudsman was using the latest technology to help in the speedy redressal of cases and to enhance its outreach to the people in remote areas of the country.\nThe mohtasib highlighted that the opening of new regional offices, holding of Khuli Katcheries, launching of the Informal Resolution of Disputes mechanism, and visits of mohtasib’s inspection teams had helped in addressing complaints, besides leading to an increase in the registration of complaints.\nHe further said that the office of Overseas Pakistanis in the Wafaqi Mohtasib Secretariat had processed a record 202,367 complaints received through Pakistan Missions abroad, and one window facilitation desks at all international airports of the country.\nThe president appreciated the performance of the mohtasib and urged the need to take further steps to enhance its outreach so that the maximum number of people could benefit of its services.",
  "retrievedAt": "2025-08-11T01:33:30.064Z"
}
