{
  "title": "PM directs swift action against tax defaulters, evaders",
  "link": "https://www.app.com.pk/national/pm-directs-swift-action-against-tax-defaulters-evaders/",
  "date_published": "2024-03-25T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 25 (APP):  Prime Minister Muhammad Shehbaz Sharif on Monday directed initiation of action on emergency basis against tax defaulters and evaders.\nThe prime minister directed for constitution of a committee to identify the hurdles and responsible in the track and trace system. The committee would identify the hurdles and people involved in tax theft within seven days.\nThe prime minister chaired a meeting regarding implementation of Track and Trace System in Islamabad, PM Office Media Wing said in a press release.\nThe committee would be tasked to submit future proposals over enforcement of automatic tax system in factories and industries.\nThe meeting was attended by federal ministers including Muhammad Aurangzeb, Ahad Khan Cheema, Deputy Chairman Planning Commission Jehanzaib Khan, Chairman FBR Malik Amjad Zubair Tiwana and other senior officials.\nThe prime minister questioned as to why the system was still inactive?\nHe observe that this system should have been made functional in tobacco, sugar, cement and fertilizer industries in the last two years, adding that the system should be placed in other important sectors of economy.\nHe said that all the legal impediments in the enforcement of track and trace system should be removed.\nThe prime minister directed that system should be enforced at all the production lines of cement factories, besides he summoned a comprehensive plan over digital strategy and automated track and trace system.\nHe further directed that all those factories that resisted implementation of track and trace system should be immediately sealed.\nHe opined that besides revenues, the said system could also be utilized for counterfeit and substandard products.\nThe prime minister asked for discarding the fake and unregistered cigarettes.\nThe country was facing economic issues and mafia with their connivance had been inflicting damages to the national kitty, he added.\nThe prime minister also asked for seeking help of the international institutions in the track and trace system.\nThe meeting was apprised in details about the hurdles in the automated enactment of the track and trace system in cement, sugar, fertilizer and tobacco sectors.\nThe meeting was told that in 14 tobacco factories, the system was fully functional whereas 12 others had been sealed for non compliance.\nThe system was fully functional in fertilizers industry while it was facing problems in sugar and cement factories due to some technical issues which were being addressed.\nThe meeting was further apprised that for control of smuggling, raids were being conducted on godowns throughout the country.\nThe prime minister directed that the law enforcement agencies should assist FBR.",
  "retrievedAt": "2025-08-11T01:33:04.689Z"
}
