{
  "title": "Drum beating tradition in Sehri still alive in capital city",
  "link": "https://www.app.com.pk/national/drum-beating-tradition-in-sehri-still-alive-in-capital-city/",
  "date_published": "2024-03-25T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 25 (APP):The centuries old tradition of a Drum beater waking up people for Sehri remains alive even in the federal capital of Islamabad.\nFor centuries, the majority people would wake up to the loud drumbeats in the wee hours heralding the beginning of Sehri time during Ramazan. However, with modern technology, this tradition has declined but still kept alive by drum beaters like Faqeer Hussain. Faqeer Hussain still beats the drum at Sehri and wakes up the people in sector G-7, Islamabad.\nTalking to APP he said “I feel very happy to wake the people up. I never enjoyed any other event like this and feel that I am doing a religious activity. “I don’t perform this duty for the sake of cash but I do it only for the hereafter,” he added.\n“It’s not that the people of my area do not have modern equipment, they do have, but they want to keep this custom alive,” he added.\nThe drum beaters visit various streets, usually around 3 to 4 AM. Most of the time, he calls out loudly, “Utho rozay daro” and makes sure that the thunderous beat of his drum along with his slogans is loud enough to wake up the residents of a particular locality.\nThose who perform this duty during the Ramazan, go from house to house to receive their reward at the end of the holy month. The locals give cash, clothes and rations of their free will, which helps them celebrate Eidul Fitr better.\nProf. Chaudhry Rasheed Sal told APP that due to the use of advanced technology, the tradition of waking people up at sehri has changed as the majority of people now use alarms and digital clocks to wake up for Sehri.\nHowever, he said that keeping alive, centuries-old traditions are a very positive activity and should be encouraged, adding that all these traditions make our country more beautiful. He said that even though people had modern devices to help them wake up, they wanted to keep the tradition alive and encouraged the ‘dhol wala’.\nIn some areas, Qawwali performers are also seen in action visits from one street to another soon after Iftar or before Iftar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:33:56.718Z"
}
