{
  "title": "Marriyum Aurangzeb elected as PML-N Information Secretary",
  "link": "https://www.app.com.pk/national/marriyum-aurangzeb-elected-as-pml-n-information-secretary/",
  "date_published": "2023-06-16T16:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP):The General Council meeting of Pakistan Muslim League-Nawaz (PML-N) on Friday elected Marriyum Aurangzeb as Information Secretary of the party for four years (2023-27).\nThe Council elected the PML-N’s cabinet during the meeting which was presided over by the party Quaid Muhammad Nawaz Sharif, and Prime Minister Shehbaz Sharif, who was also elected as the PML-N President unopposed.\nMaryam Nawaz was elected as Chief Organizer of the party, while Minister for Planning, Development and Special Initiatives Ahsan Iqbal as General Secretary and Special Assistant to the PM Attaullah Tarar as Deputy Secretary General.\nAddressing the meeting, Marriyum Aurangzeb, who is also Federal Minister for Information and Broadcasting, expressed gratitude to the party leaders and workers for reposing confidence in her.\n“It is a matter of pride for me to be elected as Secretary Information of the PML-N,” the minister said, reiterating the party’s resolve for steering the country out of crises.\nThe PML-N was committed to chart the country on path of progress and development under the leadership of its Quaid Muhammad Nawaz Sharif, she added.\nThe newly-elected Information Secretary also presented multiple resolutions in the General Council meeting which reposed complete confidence in the leadership of Nawaz Sharif, paid tribute to the services rendered by PML-N President Shehbaz Sharif for the country and condemned the May 9 incidents of attacking, vandalizing and burning sensitive installations and martyrs’ memorials by the Pakistan Tehreek-e-Insaf (PTI) workers.\nThe resolutions also paid homage to the sacrifices rendered by the Kashmiris for their liberation from Indian yoke, and also to the martyrs of Pakistan who sacrificed their lives for protecting the motherland.\nThe first resolution stated that the PML-N General Council meeting paid tribute to the courage and vision of its leader Muhammad Nawaz Sharif who faced the worst form of oppression and political victimisation with steadfastness, patience and bravery.\nIt further stated that Nawaz Sharif’s resolve never dampened by personal traumas he had experienced during the journey. He always gave preference to interests of Pakistan and its people over his personal difficulties.\nThe resolution noted that Nawaz Sharif had not only averted conspiracies against the country through his policies but also steered Pakistan out of crises rendering sacrifices.\nThe meeting unanimously approved another resolution to commend the role of Maryam Nawaz who fought oppression during the four years of previous government courageously.\nAnother resolution, presented by the Information Secretary and adopted by the Council, also paid homage to Prime Minister Shehbaz Sharif for his political role in protecting the national interests.\nIt noted that Shehbaz Sharif, after coming into the power in April 2022, sacrificed his politics in a bid to save the state and took decisions which were not only aimed at stabilizing the economy, but also safeguarding the national interests.\nIt stated that the General Council meeting paid tribute to Prime Minister Shehbaz Sharif not only for extraordinary services he rendered for the nation in the most difficult times, but also advancing Nawaz Sharif’s vision for leading the country to progress, development and prosperity, curbing inflation and uplifting the living standards of all strata of society on equal basis.\nThe resolution said as Leader of the Opposition, Shehbaz Sharif performed extraordinarily and stood vindicated after facing the worst form of oppression. He endured hardships of prisons and went through the mental agony of media trial.\nAfter coming into the power, PM Shehbaz Sharif strove for progress and development of the country continuing his legacy to serve the masses like that of the previous government tenure of PML-N when he exhibited exceptional performance as Punjab chief minister.\nPolitical and economic stability returned to the country due to such efforts of PM Shehbaz Sharif, the resolution added.\nIt also paid tribute to the party leaders and workers who had expressed unprecedented loyalty to the party in face of oppression during trying time.\nIt said the party leadership, including Quaid Muhammad Nawaz Sharif, Shehbaz Sharif, Maryam Nawaz and Hamza Shehbaz acknowledged unmatched commitment of the leaders and workers to the party.\nThe resolution said the party leadership was proud of the workers for remaining committed to the party’s ideology and manifesto in difficult times.\n“With the grace of the Almighty and this spirit, we will steer Pakistan out of difficulties and put it on the path of development,” it added.\nMaryam Aurangzeb, reiterating the party’s historic, traditional and unshakeable commitment to the Kashmir cause, also presented a resolution which expressed solidarity with the brave people of Indian Illegally Occupied Jammu and Kashmir.\nThe General Council, in the resolution adopted unanimously, fully supported the struggle of Kashmiris for their just right to self-determination as per the resolutions of the United Nations, and also paid homage to them for their sacrifices in that regard.\nMarriyum Aurangzeb also presented a resolution during the meeting to condemn the May 9 tragedy, which was also unanimously approved.\nIt said the General Council meeting of PML-N strongly condemned the tragedy of May 9 and demanded that the heinous elements who had planned and facilitated the conspiracy which was aimed at dividing the national institutions, and creating a wedge between the people and the army, should be punished sternly in accordance with the law so that no one could dare to plan or execute such a nefarious plot in future.\nThe meeting expressed solidarity with the families of the martyrs and paid homage to those who laid down their lives for the defence, security and safety of the country.\nIt noted that a person had launched mob attacks on military installations just like that of an enemy and resorted to desecrating national monuments and memorials of national heroes, besides burning the building of Radio Pakistan, mosques, ambulances, schools and other properties to cover up his corruption, loot and plunder.\nThe meeting declared that those who ran malicious campaigns against the institutions and the country at home and abroad should be dealt with iron hands and in accordance with law.\nIt demanded that the propaganda on human rights, being pursued by those who were involved in the May 9 tragedy, should be rejected at all forums.\nThe PML-N General Council also approved a resolution which paid tribute to the people of Pakistan for vehemently condemning the May 9 tragedy. It also acknowledged that the people were not misled despite difficult conditions and intense propaganda and showed unprecedented solidarity with the Constitution and law, democracy, martyrs, Ghazis and institutions.\nThe meeting also rejected the elements who hatched the conspiracy to spread chaos and anarchy which would not augur well for Pakistan’s stability, and rule of law.",
  "retrievedAt": "2025-08-11T08:44:01.006Z"
}
