{
  "title": "Nawaz Sharif to lead PML-N’s election campaign: Maryam",
  "link": "https://www.app.com.pk/national/nawaz-sharif-to-lead-pml-ns-election-campaign-maryam/",
  "date_published": "2023-06-16T18:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP):Pakistan Muslim League-Nawaz (PML-N) Senior Vice President Maryam Nawaz Sharif Friday said PML-N Quaid Nawaz Sharif would personally lead the party’s campaign for election which were expected during the current year.\nAddressing the PML-N’s General Council meeting here, she said,”We will take part in the election with full force.”\nShe congratulated Prime Minister Shehbaz Sharif for his election as PML-N President unopposed, saying he had never taken any decision without the consent of his elder brother Nawaz Sharif.\nShe commended Shehbaz Sharif for saving the country from economic collapse which was on the verge of default when he took over as prime minister in 2022.\nMaryam, who was elected as PML-N’s Senior Vice President and Chief Organizer in the intra-party elections, said the PML-N was the only party that followed the principles of Quaid-e-Azam Muhammad Ali Jinnah, and also the only custodian of his legacy and principles.\nShe said it was Nawaz Sharif who had made the PML-N a popular political party because of his vision of a developed Pakistan. Whether it was the China-Pakistan Economic Corridor (CPEC), the title of Asian Tiger, or socio-economic development, all were accomplished by the PML-N and\nNawaz Sharif, she added.\nAll the development carried out in Pakistan was only during the years when the PML-N was in power, she said.\nMaryam said Nawaz Sharif was removed from government but he never asked his supporters or instigated youth to take to streets, set houses on fire or vandalize public and private property. At the same time, he never abandoned moral values despite facing revenge, cruelty, and discrimination, and even did not name those who had mistreated him.\nLikewise, his party leaders never made a hue and cry despite facing hardships, she added, lauding the party workers and ticket holders for their unwavering support to Nawaz Sharif through thick and thin.\nMaryam said Nawaz Sharif had never sought any assistance or favourable statements from abroad, including the US or the UK for regaining power. He never made any such appeal, rather he always sought justice from the Almighty.\nShe said the PML-N leadership never compromised on national interests and cited the example of nuclear tests when Nawaz Sharif (as prime minister) did not pay heed to any “threats or offers”  while making Pakistan an atomic power.\nThe PML-N Chief Organizer said Nawaz Sharif, Shehbaz Sharif, Hamza Shehbaz, and other PML-N leaders were imprisoned, but they never quit the party or politics.\n“The party’s biggest asset is Nawaz Sharif being its leader as he is the mainstay of its existence,” she added. He faced every challenge, and even went to the Adiala Jail with his daughter, but did not put his workers in trouble, she recalled.\nOn the other hand, she said, “Qasim and Suleman are enjoying their lives abroad, while the children of Pakistan Tehreek-e-Insaf (PTI) workers are left in jails by their leader to rue.”\nThe PTI chairman stated that Pakistan was not safe for his sons, she said, asking whether he had the same feelings for the children of his party workers.\nShe said Nawaz Sharif had never asked anyone to save his daughter, rather he had never prioritized his daughter’s safety over that of his workers.\nShe stated that the May 9 riots and subsequent developments showed the difference between the PML-N and the PTI as the latter faded into oblivion.\nMaryam said the martyrs belonged to the entire nation, but it was the PTI chief, who had done politicking on the Lasbela helicopter crash. It was her belief that such elements met their logical fate.\nShe urged PML-N Secretary General Ahsan Iqbal to initiate a talent hunt programme for taking the talented individuals into the party fold. A merit-based mechanism should be adopted to appoint individuals to party positions based on their qualifications and performance, she stressed.\n“Rana Sanaullah and Ameer Muqam are active leaders, and I request the other party presidents from other regions to emulate them and promote the party in their respective regions,” she added\nShe mentioned that Sanaullah had entrusted the charge of party’s various wings, including religious, minority, and labor, to her and she wanted to expand them.\n“The PML-N was the past, is the present, and will be the future of Pakistan.”\nShe welcomed the youth joining the PML-N. “We don’t want to see 60% of the country’s population (youth) holding petrol bombs. Instead, we will provide them with education and training in the fields of science and IT.”",
  "retrievedAt": "2025-08-11T08:43:53.914Z"
}
