{
  "title": "PDMA working in Sindh for rehabilitation of flood-affected people: Aisha",
  "link": "https://www.app.com.pk/national/pdma-working-in-sindh-for-rehabilitation-of-flood-affected-people-aisha/",
  "date_published": "2023-06-16T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Minister of State for Finance and Revenue Dr Aisha Ghaus Pasha on Friday said the Provincial Disaster Management Authority (PDMA) was working in collaboration with all stakeholders for early rehabilitation of the flood-affected areas of Sindh.\nResponding to concerns of PPPP Lawmaker Syed Ghulam Mustafa Shah about financial assistance of the flood-affected people during the National Assembly debate on budget 2023-24, the minister said the federal government in collaboration with the Sindh government would further deliberate on the matters related to the relief and rehabilitation of the people affected by heavy floods and rains last year.\nSyed Ghulam Mustafa Shah urged the federal government to fulfill the commitment of Rs 100 billion financial assistance made to mitigate sufferings of the flood-affected people of the province.\nEarlier participating in the budget debate, Romina Khurshid Alam of Pakistan Muslim League-Nawaz (PML-N) condemned the incidents of May 9 and stressed the need for strict action against those involved in the vandalism of military installations and memorials of martyrs.\nShe said martyrs and ghazis of the country were heroes of the nation and their services could never be forgotten, calling for giving due attention to the wellbeing of the ghazis especially those who suffered injuries and disabilities.\nShe said the incumbent government presented the budget amid severe financial constraints and tried to give maximum relief to the common man especially the federal government employees both serving and retired.\nThe PML-N MNA said the government was moving with a forward-looking approach and allocated sufficient funds to speed up development activities and meet the economic growth targets set for the upcoming fiscal year.\nShe also talked about the adverse effects of the climate-changing patterns that caused widespread destruction in the form of heavy floods and rains in 2022, highlighting the importance of taking required measures at national and international to tackle the confronted challenge.\nThe lawmaker voice to promote renewable energy in the country so that the needs of the consumers could be fulfilled efficiently and reduce the oil import bill.\nShe was of the view to introduce modern technologies and techniques in the agriculture sector to ensure food security, which was considered the backbone of the national economy.Romina Khurshid asked for imparting skill-based and market-oriented education, enabling them to become useful citizens of the country.\nShe said there was a need to give attention to population control what the lawmaker called ‘one of the major confronted challenges,’ keeping in view the available resources.\nShahida Rehman of Pakistan Peoples Party Parliamentarians (PPPP) said her party emerged victorious, being the single largest party, in the election of Karachi Mayor.\nShe thanked the party allies including the PML-N and JUI-F for supporting the PPPP candidate in winning the Karachi mayor slot.\nShe said the PTI members had distanced themselves from their leadership after the incidents of May 9, and disagreed to vote in favour of the JI candidate.",
  "retrievedAt": "2025-08-11T08:43:50.247Z"
}
