{
  "title": "Bilawal emphasises imaginative, multidimensional foreign policy for Pakistan",
  "link": "https://www.app.com.pk/national/bilawal-emphasises-imaginative-multidimensional-foreign-policy-for-pakistan/",
  "date_published": "2023-06-16T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Minister for Foreign Affairs Bilawal Bhutto Zardari on Friday emphasised that Pakistan’s foreign policy must be imaginative and multidimensional considering the rapidly transforming geopolitical landscaping across the globe.\nThe foreign minister, addressing a ceremony to observe the 50th Foundation Day of the Institute of Strategic Studies Islamabad here, said after assuming office in April last year, the country faced serious challenges on the diplomatic fronts.\nHowever, the government pursued a foreign policy aimed at addressing the national challenges, improving access to goods and services, preserving sovereign decision making and promoting multilateralism and international law.\nHe said addressing the country’s domestic issues required quick rebuilding of ties, restoring trust with key capitals, and reinvigorating extensive engagement with traditional partners.\nThe foreign minister said that Pakistan was committed to forging good relations with all major powers, which beyond US and China, also include Europe, Russia, Japan and ASEAN.\nHe said Pakistan reinforced and deepened the partnership with Saudi Arabia, UAE, Turkiye, Iran and Qatar, besides seeing a positive trend in the Pakistan-Africa linkages.\nHe told the gathering of ambassadors, think tanks, researchers and educationists that Pakistan always opposed the bloc politics and advocated cooperation as a main driver of international relations.\nHe said the Pak-China Strategic Partnership had been enduring and beneficial over several decades. He said Pakistan was fully committed to the success of the China-Pakistan Economic Corridor. The extension of the CPEC to Afghanistan and to the West would further advance the agenda of connectivity and economic integration.\nComing to the Pak-US ties, the foreign minister said the pro-active outreach resulted in the engagement of high-level visits from both sides and hoped that the de-hyphenisation would further strengthen the bilateral relations.\nWith Russia, he said Pakistan continued to build relations based on trust as there was so much potential to realise across multiple sectors. He said as a friend of Russia and Ukraine, Pakistan desired a peaceful end to the ongoing crisis.\nHe said the ties with India were marked by mistrust primarily due to the unilateral and illegal Indian actions of August 5, 2019 in Indian Illegally Occupied Jammu and Kashmir. He said Pakistan was committed to having good neighborly relations with India based on mutual respect and sovereign equality.\nForeign Minister Bilawal said that in order to move forward, India would have to remove the obstacles hindering peace and reverse the unilateral actions of August 5.\nRecalling his recent visit to India to attend the meeting of the SCO’s Council of Foreign Ministers, Bilawal said the meeting of the heads of state was about to happen soon. Pakistan was in the process of deciding the prime minister’s participation physically or virtually. But prior to that, India converted the whole meeting into a virtual format.\nHe said Pakistan had been active at the regional and international fora and participation in the SCO, despite bilateral issues, signaled Pakistan’s commitment to the SCO.\nRegarding Afghanistan, the foreign minister urged the international community for adopting a pragmatic approach and continue to provide assistance to prevent any humanitarian disaster and help rebuild its economy. Similarly, he also urged the Taliban authorities to come up to the expectations of the global community and show respect for human rights.\nThe foreign minister, who also cut the cake to mark the 50th Foundation Day, lauded the role of ISSI and hoped that the Institute would continue to thrive, adapt and continue to be at the forefront of strategic research.\nEarlier, Director General of ISSI Sohail Mahmood gave a historic overview of the ISSI since its inception in 1973 to today.\nHe said to its credit, the ISSI had several publications including its flagship journal. The Institute had provided a platform for public discourse which was also addressed by international figures like Nelson Mandela.\nSohail Mahmood said that through its landmark research works being carried out at its five centers, the ISSI strived for reducing the gap between academics and practitioners.\nHe said the Institute had signed around 70 protocols with global think tanks.\nHe said being a pivotal state, Pakistan had an important role to play in the region. He called for the fulfillment of Quaid’s words of “peace within and peace without” which required political stability as a prerequisite.\nLater, the ISSI director general and others presented an ISSI memento to the foreign minister who also gave away commendation certificates among the research teams.",
  "retrievedAt": "2025-08-11T08:43:44.832Z"
}
