{
  "title": "AJK PM advices bureaucracy to treat masses with best attitude solving their problems instantly",
  "link": "https://www.app.com.pk/national/ajk-pm-advices-bureaucracy-to-treat-masses-with-best-attitude-solving-their-problems-instantly/",
  "date_published": "2023-06-16T18:06:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 16 (APP) :: Azad Jammu and Kashmir Prime Minister Chaudhry Anwar ul Haq has said that the officers should use all the resources for the betterment of the people, treat them with the best attitude, and solve their problems immediately.\nIn his policy statement issued here on Friday, the AJK premier said that we will uproot the outdated and corrupt system.\nThe system has to be changed according to the expectations of the people, all the officers should consider their services as public servants, and people-friendly behavior, and by simplifying the most difficult processes, the problems of the people should be solved at their doorsteps.\nHe said,” There should not be any negligence in the execution of official matters. The system of making rounds in the offices by the common man should end now,”.\n“We are all servants of the people. Everyone has to work with honesty and integrity according to their position. Our government has trashed retaliatory exchanges and actions. For us, what is most respectable is what works best for the people,” he said.\nHe further said,” We want the strength of the institutions, the state will be strengthened by the strength of the institutions, where there is a complaint against someone, we will take action keeping the facts in front.\nHe said that whoever takes the path of good for the people, Allah opens the path of development for him, so the state machinery has to serve the people under the missionary spirit and create convenience for the people.\nHe said that there should be facilities for the public from the office of the Deputy Commissioners to the SSPs office, these offices should resolve the complaints of the people in their respective areas. Grievances of the people should be consolidated.",
  "retrievedAt": "2025-08-11T08:43:55.009Z"
}
