{
  "title": "Israeli troops open fire during envoys’ tour to West Bank - World - DAWN.COM",
  "author": null,
  "content": "• EU demands action against those responsible for the incident\n• Italy summons Israeli envoy\n• Germany condemns shooting\n• Pope asks Israel to allow aid in Gaza\n• Turkiye seeks probe\n\nJERUSALEM: The Israeli military said that it fired shots near an international diplomatic delegation which it claimed “deviated” from an approved route in the occupied West Bank on Wednesday.\n\nDiplomatic sources said European Union diplomats were part of the delegation.\n\nThe Israeli military ass­e­rted “the delegation deviated from the app­roved route and entered an area where they were not authorised to be” and that soldiers fired “warning shots to distance them away”. No injuries or damage were reported, the military said.\n\nThe EU’s foreign policy chief, Kaja Kallas, said she had heard about the incident which happened on a visit by international diplomats organised by the Palestinian Authority.\n\n“We definitely call on Israel to investigate this incident and also held these accountable who are responsible for this and any threats on diplomats’ lives,” she said.\n\nThe Spanish Foreign Ministry said a Spaniard was among the group of diplomats, who was unhurt.\n\n“We are in contact with other affected countries to jointly coordinate a response to what happened, which we strongly condemn,” it said in a statement.\n\nThe Palestinian Auth­ority’s Foreign Ministry said the delegation was undertaking an official mission to observe and assess the humanitarian situation and document the ongoing violations perpetrated by Israel.\n\nFootage on Israeli television showed individuals running to vehicles with diplomatic licence plates as shots were heard in the distance.\n\nThe Israeli military has killed dozens of Pales­tinians and destroyed many homes in the occupied West Bank since it launched an operation in January in the city of Jenin to root out Palestinian fighters. A video released by the Palestinian foreign ministry showed two men in Israeli army uniform pointing guns at a group of people from behind metal gates.\n\nA European diplomat present during the visit said he heard repeated shots coming from inside Jenin refugee camp.\n\nItaly summons envoy\n\nItaly’s Foreign Minister Antonio Tajani summoned the Israeli ambassador on Wednesday, after shots were fired during international diplomats’ visit to the West Bank city of Jenin.\n\nTajani said on X he had instructed his ministry to “summon the Israeli Ambassador to Rome to obtain official clarifications on what happened in Jenin”.\n\nGermany condemns Israeli shooting\n\nGermany “strongly condemned” on Wednes­day what Israel claimed were “warning shots” fired during a visit by foreign diplomats, including one from Germany, to the occupied West Bank.\n\n“The Israeli government must promptly inv­es­tigate the circumsta­nces,” a foreign ministry spokeswoman said, adding that Foreign Minister Johann Wadephul would raise the “unprovoked shooting” with his Israeli counterpart.\n\n“The independent ob­ser­­ver role of diplomats on the ground is indispensable and in no way poses a threat to Israeli security interests,” the spokeswoman added.\n\nTurkiye demands inquiry\n\nTurkiye demanded an immediate investigation on Wednesday over the shots fired during a visit by foreign diplomats to the occupied West Bank.\n\nThis attack must be investigated without delay and the perpetrators must be held accountable,“ the foreign ministry said in a statement.\n\nPope asks Israel to allow aid in Gaza\n\nPope Leo XIV on Wednesday appealed for Israel to allow humanitarian aid to enter Gaza, calling the situation in the Palestinian enclave “yet more worrying and saddening”.\n\n“I renew my fervent appeal to allow for the entry of fair humanitarian help and to bring to an end the hostilities, the devastating price of which is paid by children, the elderly and the sick,” the new pope said during his first weekly general audience in St. Peter’s Square.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682e67cc88834.jpg",
  "retrievedAt": "2025-10-12T03:12:12.301Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912479/israeli-troops-open-fire-during-envoys-tour-to-west-bank",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:05.000Z"
}
