{
  "title": "For talks with India, PM Shehbaz sees Saudi Arabia as neutral venue - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Observes things are calming down following contacts between DGMOs; NSA to lead Pakistan side during dialogue\n• Says Nawaz was consulted before army chief’s elevation to field marshal\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Wednesday said Saudi Arabia could be the “neutral” venue for much-needed talks between Pakistan and India on critical issues.\n\nThe premier also said that he had consulted PML-N President Nawaz Sharif on his decision to elevate Chief of Army Staff Gen Syed Asim Munir to field marshal.\n\nTalking to a group of TV anchors at the PM House, he said that Kashmir, water, trade and terrorism will be the key points during the dialogue with India.\n\nIn response to a question if there was a possibility of a third venue for talks in light of the mediation offered by US President Donald Trump, the premier ruled out the possibility of China as a neutral venue, saying India would never agree to that.\n\nHowever, a participant told Dawn, the PM expressed the hope that Saudi Arabia could be the third country where both sides could agree to hold the negotiations.\n\nWhen it was pointed out that India intends to hold dialogue on terrorism while Pakistan wants to focus on Kashmir, the PM reiterated: “Kashmir, water, trade and terrorism will be the key points during Pakistan-India talks.”\n\nRegarding the appointment of COAS Gen Munir as field marshal, PM Shehbaz said: “It was my own decision to make the army chief a field marshal.”\n\nResponding to a question that Nawaz Sharif had always remained opposed to giving extension to the army chief’s term in office, PM Shehbaz said he took his elder brother into confidence before taking any decision and likewise the COAS was made field marshal after consultation with the ruling party president.\n\n“I always consult Nawaz Sharif before taking any key decision and that also happened in case of [elevation of] Gen Asim Munir,” he added.\n\nIn reply to a question that the PTI-led KP government needs to be supported in its efforts for eradicating terrorism, the prime minister said Centre was already helping the province in this regard as over Rs600 billion had been released to the KP government under the Public Sector Development Programme.\n\nHe said that situation between Pakistan and India was de-escalating after the DGMOs of the two sides made contacts with each other.\n\nHe said if talks were held between the two arch rivals, the National Secur­ity Adviser will lead Paki­stan’s side in the process.\n\nMeeting on housing\n\nPresiding over a meeting on the low-cost housing, the prime minister said that affordable projects would not only make residential units accessible to the common man but would also boost national economy and create jobs.\n\nHe said the relevant task force, in collaboration with the ministry of fina­n­ce and banks, should soon submit recommendations for financing low-cost hou­s­ing projects, which should be included in the upcoming budget proposals.\n\nHe observed that sustainable growth of economy was closely linked with the development of the construction sector.\n\nMinisters Ahsan Iqbal, Riaz Hussain Pirzada, Ahad Khan Cheema, Muh­a­mmad Aurangzeb, and Ali Pervaiz Malik, the FBR chairman and other senior officials attended the mee­t­ing, the PM Office Media Wing said in a press release.\n\nThe meeting was infor­med that the Condominium Act 2025 and amendments to the Foreclosure Law were in their final stages and after their approval it would become easier to obtain loans for the construction and ownership of homes under the low-cost housing schemes.\n\nThe task force briefed the meeting on the progress in initiating construction projects, particularly low-cost housing schemes.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:12:45.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912538/for-talks-with-india-pm-shehbaz-sees-saudi-arabia-as-neutral-venue",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:41:59.000Z"
}
