{
  "title": "PPP, PML-N lawyer insists judges who dismissed review still count in CB - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Senior counsel Makh­do­­om Ali Khan argued before the Supreme Court on Wednesday that the current Constitutional Bench hearing review petitions regarding the reserved seats judgement should be considered a 13-judge bench, despite two judges having already dismissed the petitions at an earlier stage.\n\nAppearing on behalf of PML-N and PPP women candidates affected by the July 12, 2024, judgement, the counsel maintained that the participation of Justices Ayesha A. Malik and Aqeel Ahmed Abbasi — who had dismissed the review petitions on the first day of hearings — had already constituted their contribution to the case.\n\nResponding to objections raised by the Sunni Ittehad Council (SIC), Mr Khan argued that since neither of the two judges had recused themselves, their exclusion from the Constitutional Bench was improper, and thus the bench should be treated as a 13-member panel, not 11.\n\nThe counsel also opposed the objections taken by the SIC against the composition of the 11-judge Constitutional Bench, as well as a request to postpone the hearing on\n\nOpposes SIC objections to bench’s composition, requests postponement of hearing\n\nthe reserved seat case until the 26th Amendment to the Constitution was decided first, in addition to the live streaming of the present hearing.\n\nHe argued that if SIC’s request was accepted and the two judges who dismissed the review petitions were brought back to the bench, it would then be contrary to the earlier jurisprudence settled in the 2022 Punjab Assembly dissolution matter, in which the 4-3 controversy had erupted.\n\nThe counsel reminded that the Constitutional Bench’s May 6 order, in which the matter was referred back to the committee under Article 191A of the Constitution for the reconstitution of the present bench, was also signed by all 13 judges. On that day, no objection regarding the composition of the bench was made, the counsel said, adding that the two judges could have recused themselves on the first day of the hearing.\n\nHowever, Justice Aminuddin Khan noted that the two judges had not been excluded by the Constitutional Bench itself, but had stepped back voluntarily.\n\nMakhdoom Ali Khan responded that he would not comment on the internal arrangement but emphasised that since they had already delivered a decision, it would be inappropriate for them to continue on the bench. He questioned whether his arguments would be directed at persuading judges who had already ruled on the matter or convincing the remaining majority.\n\nTo substantiate his point, the counsel also cited the note of Justice Yahya Afridi in the Punjab election case, in which the judge observed that since he had expressed his final decision, it would be improper for him to sit on the bench.\n\nAt this, Justice Musarrat Hilali wondered whether the two judges who rejected the review petition in the first instance could order the 11 judges not to count their opinions in the final judgement.\n\nThe counsel then cited the 2017 Panama judgement, in which two judges had disqualified the then prime minister Nawaz Sharif while the other three judges referred the matter to the then chief justice to form a joint investigation team.\n\nWhen the three-judge implementation bench finally arrived at the conclusion to disqualify the prime minister, all the initial five judges signed the final order of the court, the counsel said.\n\nReferring to a question posed by Justice Jamal Khan Mandokhail, whether the review petition was filed under the Supreme Court Rules, Makhdoom Ali Khan explained that the Peshawar High Court had dismissed the case regarding the reserved seats on March 14, 2024, whereas the Supreme Court’s short order came on July 12, 2024. The detailed judgement was released on Sept 23, 2024, while the 26th Amendment to the Constitution came on Oct 21, 2024.\n\nThe review petitions against the July 12 judgement were filed on July 18, 2024, when the 26th Amendment was not in existence. Therefore, the review petitions were filed under Article 188 of the Constitution as well as the applicable Supreme Court Rules 1980.\n\nAt this, Justice Jamal Khan Mandokhail reminded that since the rules, which were supposed to be framed by the committee under Article 191A of the Constitution, had still not been chalked out, the court rules would still apply.\n\nHowever, the counsel explained that the rules would be applied so long as they were not in conflict with Article 191A. Besides, these rules did not stand at a higher status than Section 2 of the Practice and Procedure Act 2013 or the constitutional provision (Article 191A), he said.\n\nHe said Article 191A stipulates that all pending matters involving constitutional interpretation must be handled by the Constitutional Bench, and therefore, standard court rules cannot override statutory or constitutional provisions.\n\nJustice Mandokhail, however, contended that political cases like Panama, the Punjab election, or cases like disqualification for life will continue to be filed before the court, but “we have to decide the matter for the benefit of ordinary people by securing their rights”.\n\nThe counsel argued that until such time the committee frames rules under Article 191A, the Constitutional Bench has to obey the statute and the Constitution.\n\nJustice Mandokhail acknowledged that the counsel had adequately addressed the point.\n\nEarlier, Hamid Khan, on behalf of the SIC, pleaded his point on the live streaming of the present hearing and the postponement of further hearing until challenges to the 26th Amendment were decided first by the Constitutional Bench.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:23:05.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912531/ppp-pml-n-lawyer-insists-judges-who-dismissed-review-still-count-in-cb",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:11.000Z"
}
