{
  "title": "Govt sets up digital assets authority as per FATF requirement - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Wednesday announced establishing a Pakistan Digital Assets Authority (PDAA) to regulate and accelerate the Virtual Asset Economy comp­liant with the Fina­ncial Action Task Force (FATF) safeguards.\n\nIn a statement, the Ministry of Finance said it was initiating a comprehensive strategy to regulate digital assets and accelerate the growth of Pakistan’s virtual asset economy. On the recommendations of the Pak­istan Cryptocurrency Cou­ncil (PCC), a dedicated body, ‘Pakistan Digital Assets Authority’, would regulate blockchain-based financial infrastructure to ensure the FATF-comp­liant innovation, economic inclusion, and responsible adoption of digital assets, it said.\n\n“Pakistan must regulate not just to catch up — but to lead. With the PDAA, we are creating a future-ready framework that protects consumers, invites global investment, and puts Pakistan at the forefront of financial innovation,” said Finance Minister and PCC Chairman Muhammad Aurangzeb.\n\nHe said PDAA would serve as a specialised regulatory body with a clear mandate to oversee licensing, compliance, and innovation within the digital asset ecosystem. It will regulate exchanges, custodians, wallets, tokenised platforms, stablecoins, and DeFi applications — all under a single, agile framework.\n\nThe strategic decision aligns Pakistan with other forward-thinking economies such as the UAE, Japan, Singapore and Hong Kong — all of which have established digital assets regulators to foster innovation while ensuring compliance with global financial norms.\n\nThe PDAA is expected to regulate more than $25 billion informal crypto market, enable tokenisation of national assets and government debt, provide legal clarity to global and local investors and facilitate monetisation of Pakistan’s surplus electricity through regulated Bitcoin mining.\n\nThe Authority is also expected to empower the youth and startups to build blockchain-based solutions at scale. With the proposed PDAA, Pakistan is signalling its intent to become a competitive player in the global digital economy, inviting responsible innovation and building trust with investors, entrepreneurs, and international partners.\n\n“This is not just about crypto — it’s about rewriting our financial future, expanding access, and creating new export channels through tokenisation, digital finance, and Web3 innovation,” said Bilal Bin Saqib, CEO of Pakistan Crypto Council — a body created a couple of months ago to guide cryptocurrency business in the country.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:23:10.652Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912539/govt-sets-up-digital-assets-authority-as-per-fatf-requirement",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:41:58.000Z"
}
