{
  "title": "Land Reforms Act sails through Gilgit-Baltistan Assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Opposition terms bill an attempt to deprive local people of their land, mountains, pastures and natural resources\n• CM says act formulated in consultation with all stakeholders\n\nGILGIT: The much-awaited Gilgit-Baltistan Land Reforms Act, 2025 has finally sailed through the Gilgit-Baltistan Assembly, with a majority vote on Wednesday.\n\nOpposition members in the assembly opposed the act, describing it as an attempt to deprive local people of their common lands, mountains, pastures and natural resources.\n\nGB Land Reforms Act, 2025 was moved by Chief Minister Haji Gulbar Khan in the assembly session, chaired by Speaker Nazir Ahmed, on Monday.\n\nAfter a two-day-long debate on various clauses of the act by the opposition members, GB Assembly members finally passed it with a majority vote as opposition members abstained from voting.\n\nSpeaking on the occasion, CM Khan said the GB government has formulated GB Land Reforms Act 2025 for the first time, in consultation with public representatives, lawyers, experts, civil society members, stakeholders to protect land ownership of local people. He added that under “Khalisa Sarkar”, the barren lands in the region were not protected.\n\nThe chief minister said the assembly abolished the black law and introduced an act that would protect the ownership of local people of their lands, pastures, mountains and other natural resources. He said the act’s draft was also formulated during the PML-N and PTI terms, but the proposed bills couldn’t be tabled in the assembly.\n\nHe called it a success of the present GB government to pass the law after taking all the stakeholders into confidence.\n\nPPP’s GB chapter president and member of GB Assembly Amjad Hussain, who introduced the bill, said it was a historic day as locals had been given ownership rights.\n\nHe said that under the “Khalisa Sarkar 1979” law, lands of GB were declared as state land. “After the GB Land Reforms Act 2025, the region’s people have been declared owners of the land,” he said.\n\nAccording to the bill, “common land” refers to all lands, including forests, rivers, lakes, streams, rivers, glaciers, lakes, and such land will have ownership of local people.\n\nThe land cannot be allocated as property to any one individual or family and is indispensable for the collective use of the local community or environmental protection.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:23:10.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912478/land-reforms-act-sails-through-gilgit-baltistan-assembly",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:05.000Z"
}
