{
  "title": "Lawmakers slam India for ‘sponsoring terror’ in Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Lawmakers on Wednesday poured scorn on India for spewing terrorism in Pakistan as they condemned the attack on a bus carrying innocent students of the Army Public School in Khuzdar.\n\nDuring a discussion in the National Assembly, they noted that India was behind the rising tide of terrorism in the country, and the cowardly attack on schoolchildren was also sponsored by New Delhi.\n\nInformation Minister Attaullah Tarar said that Indian proxies operating in the country will be dealt with an iron hand, and they were bound to be defeated.\n\nStrongly condemning the attack on the school bus, he said investigation into the incident was being carried out and those behind it will be brought to justice.\n\nBus attack condemned; Tarar says ‘Indian proxies’ will be defeated\n\nThe minister said this cowardly attack was carried out after the enemy faced a humiliating defeat at the hands of armed forces in the conventional warfare.\n\n“They lack the courage to face us openly and are funding terrorist outfits being used as proxies,” he said.\n\nFormer prime minister Raja Parvaiz Ashraf said that like other sabotage acts, India was also involved in the heinous act of terror attack on a bus carrying children of Army Public School in Khuzdar.\n\nHe said that India after suffering humiliating defeat in the recent conventional war, has now resorted to coward acts of targeting innocent schoolchildren. The international community, he said, should support Pakistan at a time when India’s policy of state-sponsored terrorism has become a threat to peace in the region and the world as well.\n\nMinister for Board of Investment Qaiser Ahmed Sheikh said the nation was proud of its armed forces for delivering a robust response to the Indian aggression. He said that although India claims to be a victim of terrorism, the fact was that it was itself involved in sponsoring terrorism in Pakistan and target killings in other parts of the world.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:23:09.301Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912533/lawmakers-slam-india-for-sponsoring-terror-in-pakistan",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:11.000Z"
}
