{
  "title": "PM vows strong action against perpetrators after school bus blast in Khuzdar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Three students, two soldiers martyred; eight critical among 43 injured in Khuzdar\n• Shehbaz reaches Quetta, asks world to confront use of terrorism as a foreign policy tool\n• Army sees India’s hand in attack, says Delhi using ‘proxies’ to foment terrorism in Pakistan\n• Bombing draws across-the-board condemnation, including from US and China\n\nQUETTA/KHUZDAR: At least six people, including three students, lost their lives and over 40 others — mostly students — sustained injuries after a bomb targeted a school bus in Khuzdar on Wedn­esday, prompting the prime minister to visit Quetta to take stock of the security situation amid across-the-board condemnations.\n\nThe condition of at least a dozen is said to be serious due to critical injuries, officials said, adding that at least 15 girl students are among the injured. The incident occurred near Zero Point in Khuzdar on the Quetta-Karachi highway when the bus was on its way to drop the students at the Army Public School in Khuzdar Cantonment.\n\n“It was a suicide attack through which the Army Public School bus was targeted at Zero Point in Khuzdar,” a senior police officer confirmed. Deputy Commissioner Yasar Iqbal Dashti also confirmed the explosion as a suicide attack.\n\nA senior official in the Khuzdar administration told Dawn that about 49 people, including over 40 students, were on the bus when a powerful explosion took place next to it, which completely destr­oyed the vehicle.\n\nThree girls who perished in the incident were identified as Ayesha Saleem (class 10), Hafsa Kausar (class 7), and Sania Somroo (class 6). “They were martyred on the spot,” an official said, adding that two of the three other deceased were identified as Muhammad Iqbal, driver, and Sepoy Qadeer.\n\nAccording to the officials, some of the victims who received serious injuries were shifted to the Combined Military Hospital (CMH) in Quetta.\n\nNo one had claimed responsibility for the attack till the filing of this report.\n\nThe attack on school bus prompted Prime Minister Shehbaz Sharif and his cabinet members to rush to Quetta where they received a security briefing. Later, a statement issued by the PM Office quoted him as saying, “Pakistan’s security forces and law enforcement agencies will relentlessly pursue all those involved in this barbaric act.\n\n“The architects, abettors, and enablers of this crime will be held accountable and brought to justice and the truth about India’s cunning role, a real perpetrator of terrorism but feigns as a victim, stands exposed before the world.”\n\nThe statement detailed the incident, claiming the act was carried out by “state-sponsored proxies of India (Fitna al Hindustan)” and added that “dastardly terrorist incidents” were being orchestrated through proxies in Balochistan and Khyber Pakhtunkhwa, “deliberately targeting civilians in a futile attempt to destabilise Pakistan”.\n\nDefence Minister Khawaja Asif, Interior Minister Mohsin Naqvi, Information Minister Attaullah Tarar, and Field Marshal Syed Asim Munir, along with the prime minister also visited the injured victims.\n\n‘Instruments of its state policy’\n\nEarlier, the PM was briefed by the Balochistan chief minister and the Quetta corps commander about the attack, which claimed the lives of three children and two soldiers and left 43 others, including 39 children, injured. The condition of eight students was described as critical.\n\nThe premier said the terrorist groups — masquerading under ethnic pretences — were not only being exploited by India as instruments of its state policy, but also a stain on the honour and values of the Baloch and Pashtun people, who have long rejected violence and extremism.\n\nIndia’s reliance on such morally indefensible tactics, particularly the deliberate targeting of children, demands urgent attention from the international community, he said, adding that the use of terrorism as a tool of foreign policy must be unequivocally condemned and confronted.\n\nPM Shehbaz and COAS Asim Munir highlighted that it’s time that the nation displays a very strong resolve similar to the one shown recently against the aggression by India, to bring the fight against foreign-sponsored terrorism to its logical and decisive end.\n\nBugti presser\n\nBalochistan CM Sarfraz Bugti, in a press conference, accused India of targeting innocent children following its “political defeat” on May 9 and 10 He claimed that intelligence reports had warned of India-sponsored attacks in Balochistan. “We never imagined children would be targeted. Ajit Doval’s ideology has sunk to such disgraceful levels,” he said.\n\nHe claimed that while ‘hundreds of terrorists’ were killed or arrested last year, legal loopholes had led to their release. A new anti-terrorism law was being formulated, which would include provisions for establishing detention centres to address the issue of missing persons. He also urged Afghanistan’s interim government to honour its Doha Agreement commitments and ensure its soil is not used for cross-border terrorism.\n\n‘Most heinous and cowardly’ attack\n\nIn a statement following the blast, the Inter-Services Public Relations said that “after having miserably failed in the battlefield, through these most heinous and cowardly such like acts, Indian proxies have been unleashed to spread terror and unrest in Balochistan and Khyber Pakhtunkhwa”.\n\nThe ISPR said, “Indian terror proxies are being employed as a state tool by India to foment terrorism in Pakistan against soft targets such as innocent children and civilians”\n\nIt noted that India had “failed” in Pakistan’s Operation Bunyanum Marsoos during the recent conflict, and its [proxies] were “being hunted [down] by military and law enforcement agencies”.\n\n“Use of terrorism as a state policy by [the] Indian political government is abhorrent and reflective of their low morality and disregard of [sic] basic human norms,” the ISPR said.\n\n“Planners, abettors and executors of this cowardly Indian sponsored attack will be hunted down and brought to justice and [the] heinous face of India will be exposed in front of the entire world,” the military media wing said.\n\nCondemnation\n\nPresident Asif Ali Zardari termed the attack a “heinous and inhumane crime” and vowed to expose this “India-backed terrorism” at an international level. “These terrorists do not want to see Balochistan developed,” he said in a statement.\n\nPM Shehbaz condemned the attack as a cowardly act. “The attack on innocent children in a school bus by terrorists working under Indian patronage is a clear proof of their hostility towards education in Balochistan,” he said in a statement.\n\nPPP Chairman Bilawal Bhutto-Zardari described the attack as ‘a despicable and inhuman act, beneath all moral and human values’. “This cowardice against our children is an attack on the soul of Pakistan. Innocent lives, full of dreams, extinguished in an instant. We share in the grief of the bereaved families,” he wrote on X, vowing that Pakistan would bring all those responsible to light and justice.\n\nThe US embassy in Islamabad said it stood with Pakistan in condemning the “brutal” and “unconscionable” attack. “The murder of innocent children is beyond comprehension. We grieve with the families who lost loved ones, and our thoughts are with those recovering. No child should ever fear going to school. We stand with those in Pakistan working to end this violence,” it said.\n\nThe Chinese embassy said it was saddened to hear about the attack. “China firmly opposes all forms of terrorism. We strongly condemn this terrorist attack, extend our deep condolences to the victims and sincere sympathies to the bereaved families, and wish the injured an early recovery,” it added.\n\nUnicef also released a statement, extending condolences to the families, adding that it stood in solidarity with all those affected.\n\nWith input from APP\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682e79c54b7f9.jpg",
  "retrievedAt": "2025-10-12T03:12:31.460Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912542/pm-vows-strong-action-against-perpetrators-after-school-bus-blast-in-khuzdar",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:41:58.000Z"
}
