{
  "title": "SC Constitutional Bench member decries ‘embarrassing’ plea targeting IHC judges - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Regrets how CJP could mark cases to a judge mentioned in petition\n• Observes it is embarrassing for judges to bracket them for deciding in favour of a political party\n\nISLAMABAD: Justice Shahid Bilal Hassan on Wednesday took exception to uncharitable pleadings on behalf of PTI chairman Imran Khan in which disparaging remarks were made against certain judges of the Islamabad High Court (IHC).\n\n“This is embarrassing even for judges to bracket them for deciding in favour of a political party,” Justice Hassan regretted, adding how the Chief Justice of Pakistan could mark cases to the judge mentioned in the petition after reading such remarks in the plea.\n\nJustice Hassan was a member of the five-judge Constitutional Bench that had taken up a joint petition filed by five IHC judges — Justices Mohsin Akhtar Kaya­­ni, Tariq Mehmood Jahangiri, Babar Sat­tar, Sardar Ejaz Ishaq Khan and Saman Rafat Imtiaz — pleading that three transferred judges should not be treated as IHC judges until they take a fresh oath under Article 194, read in conjunction with Schedule III of the Constitution.\n\nIn the petition, PTI founder Imran Khan had contended that the five IHC judges were punished because they decided false cases on merit registered and filed against the petitioner without fear or favour.\n\n“Moreover, former IHC chief justice Aamir Farooq, who now was rewarded by appointing him as judge of the Supreme Court, was repeatedly asked to recuse himself from petitioner’s cases, but he refused to do so.”\n\n“And when IHC judges made a representation to former IHC CJ, the same were dismissed forthwith, issuing a fresh seniority list in which the senior puisine judge of IHC was demoted from his position while a freshly transferred judge was put in the senior most position,” the petition had contended.\n\nThe petition went on to state that a few days later former IHC CJ was appointed to the apex court and hence rewarded for damaging petitioner’s case, life and liberty, whereas the judges who stood up against the illegal and undue external pressures were punished by having their seniority disturbed. The entire debacle clearly showed lack of good faith, which is a dagger in the heart of Pakistan’s stability, the petition had regretted.\n\nWhile pointing towards Advocate Idrees Asharaf, Justice Hassan today observed that the counsel had filed two petitions on behalf of Advocate Raja Muqsid and PTI founder Imran Khan and wondered whether any political party or a politician could ever claim such a stance in his petition.\n\nThe counsel, however, explained that the petition, to which Justice Hassan was referring to, in fact was originally filed by PTI leader Shoaib Shaheen. The counsel made it clear that the points he highlighted in the petition he filed was based on legal plain stating that his aim in fact was for the enforcement of law and the Constitution.\n\nHowever, Justice Hassan regretted that such a petition should be dismissed by imposing a heavy cost as a punishment, also stating that the system should be allowed to work.\n\nEarlier, senior counsel Faisal Siddiqi on behalf of former presidents of the Islamabad High Court Bar Association contended that the central issue in the present dispute revolves around the seniority of IHC judges and if CB settles the matter then other issues regarding the transfer of judges to IHC as well as taking of oath before entering IHC will become merely an academic exercise.\n\nThe counsel urged CB to interpret Article 200 of the Constitution under which the judges were transferred to IHC in a way that the matter should not become a case of judges versus judges rather it should enhance the concept of comity among judges and reduces the conflict.\n\nThe counsel was of the view the seniority of the judges who were transferred should start from the bottom of the seniority list of IHC though they could retain seniority in their parent high court from where they have been transferred.\n\nThe record showed that the seniority issue was kept hidden from the chief justices at the time of seeking consultation with them, adding the seniority conflict among the judges was created by the executive when they have no power to disturb the seniority. This is where the malice comes, the counsel argued. The case will now be taken up again on Friday.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:23:09.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912537/sc-constitutional-bench-member-decries-embarrassing-plea-targeting-ihc-judges",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:11.000Z"
}
