{
  "title": "Six injured in ‘sewer line’ explosion in Satellite Town - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Six people were injured after a sewer pipeline exploded due to gas accumulation on Wednesday morning, leaving behind a big crater on the road that connects the Holy Family Hospital Road with Phagwari Road.\n\nDue to the incident, a traffic jam was witnessed on the slip roads, which created problems for the residents, while the site was cordoned off by the authorities. According to the district administration officials, gas accumulated in the pipeline caused the explosion. They said that the Water and Sanitation Agency (Wasa), the Sui Northern Gas Pipelines Limited (SNGPL) and the Rawalpindi Municipal Corporation (RMC) officials were informed about the incident and asked to check the reason behind it.\n\nDistrict Emergency Officer Sibghatullah told Dawn that Rescue 1122 received a call about the explosion in the sewer line and rushed to the site. He said that two people were injured in the first gas explosion and four people were injured in the second explosion. He said the injured were moved to Holy Family Hospital, where their condition was termed stable.\n\nMeanwhile, the Sui Northern Gas Pipelines Limited officials checked the area and said the sewer pipeline exploded because there was no gas leakage in the SNGPL pipelines. “It is strange that the two explosions occurred on a road which was reconstructed last year. We suspect that the civic agency possibly used substandard material,” said Muhammad Fareed, a shopkeeper.\n\nA resident Nasir Ali hoped that the relevant department would fill the ditch soon because it was causing problems for the people, especially the schoolchildren. He said that the civic bodies needed to excavate the entire portion to check the status of the utility lines.\n\nWasa Managing Director Saleem Ashraf told Dawn the explosion did not occur in Wasa’s sewer line. He said that the drain was not a part of Wasa’s designated tributaries of Leh Nullah scheduled for one-time cleaning. He said that twin explosions occurred in front of Sunrise Bakery, E-Block, Satellite Town. The affected drain had no ventilating opening or manholes except for a single grating in front of the bakery, leading to gas accumulation.\n\nHe said that the explosion caused significant damage, such as the dismantling of the inlet gratings, damage to the concrete slabs, and displacement of the asphaltic layer on the adjacent road.\n\nHe advised the Rawalpindi Municipal Corporation to remodel the drain to ensure proper gas ventilation and install manholes (ventilating openings) at regular intervals, not more than 20 metres apart, to mitigate the possible gas build-up.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682e6f79e1f46.jpg",
  "retrievedAt": "2025-10-12T03:11:51.938Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912514/six-injured-in-sewer-line-explosion-in-satellite-town",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:59.000Z"
}
