{
  "title": "Karachi mayor visits facility recycling plastic, making manhole covers - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: City Mayor Murtaza Wahab on Wednesday vowed that transforming garbage into reusable commodity was a critical part of his administration’s vision to eliminate waste and improve sanitation conditions on a large scale in the metropolis.\n\nHe expressed this resolve during a visit to the Material Recovery Facility in District South, alongside Sindh Solid Waste Management Board (SSWMB) managing director Tariq Ali Nizamani.\n\nThe facility is part of a growing initiative to recycle plastic and other waste materials in order to reduce environmental burden on the city.\n\nDuring the visit, Mayor Wahab appreciated the efforts being made to separate re-useable waste from garbage and extract useful materials for recycling.\n\nVows to turn garbage into reusable commodity to eliminate waste\n\nHe specifically commended the innovative step of producing manhole from extracted materials. “These initiatives are vital for creating a cleaner Karachi. Expanding such projects will not only reduce waste reaching landfills but also convert it into durable, usable products,” he said.\n\nTurkish company’s director Ziauddin, and General Manager Warasat Waris on this occasion briefed the mayor about the operations.\n\nThey explained that household and apartment waste from the Clifton area was brought to the plant, where it was sorted into various categories, including plastic, cardboard, and wrappers. These materials are then bundled and processed for further use, significantly reducing the volume of waste transported to landfill sites.\n\nThe most noteworthy innovation discussed during the visit was the use of recycled plastic to manufacture heavy-duty manhole covers for sewerage systems. The company officials informed the mayor that these covers were not only durable but also cost-effective and environmentally friendly. He added that the project was currently in its developmental phase, with plans to broaden its scope in the near future by producing other items from recycled waste.\n\nMayor Wahab expressed optimism that with continuous efforts and public-private cooperation, Karachi would soon witness a marked improvement in cleanliness and environmental health.\n\nHe assured full support for expanding such recycling projects citywide.\n\nMayor Wahab reaffirmed the city administration’s commitment to sustainable waste solutions and appreciating the contributions of the SSWMB and the Turkish company in transforming Karachi’s waste into valuable resources.\n\nWashing of vehicles\n\nThe Karachi Metropolitan Corporation (KMC) has launched an extensive campaign against violations of municipal laws.\n\n“The initiative targets illegal garbage dumping, washing of vehicles on roads and in front of commercial areas, and unauthorised encroachments,” said the statement.\n\nThe Enforcement and Implementation Department has already initiated operations in Gulshan-i-Iqbal, District Korangi, Nazimabad, and several other key localities. Heavy fines have been imposed and strict warnings issued to shopkeepers and commercial entities, it added.\n\nThe City Council, it said, has passed a resolution under Chapter 15, Section 132, and Schedule VI of the Sindh Local Government Act 2013.\n\nThe resolution allows penalties on individuals and businesses washing vehicles on roads outside shopping malls, plazas, offices, and commercial/industrial centres, as well as those using water board supply lines in nurseries.\n\n“It has been observed that excessive water usage for vehicle washing at various public points — including bus, van, and coach terminals — not only leads to unclean roads, but also causes significant road damage. The KMC invests substantial funds annually for the maintenance and repair of such roads,” added the statement.\n\nAdditionally, illegal encroachments in different parts of the city disrupt traffic flow and create obstacles for pedestrians. “The KMC is committed to restoring order in the city by taking strict action against all municipal law violators,” it said.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:12:19.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912497/karachi-mayor-visits-facility-recycling-plastic-making-manhole-covers",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:42.000Z"
}
