{
  "title": "HBL Pakistan Super League: Clinical Gladiators down United to make final - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Quetta Gla­dia­tors sealed a spot in the HBL Pakistan Super League (PSL) with a clinical 30-run victory over Islamabad United in the Qualifier here at the Gadd­afi Stadium on Wednesday, thanks to brilliant contributions by Dinesh Chandi­mal, Faheem Ashraf and Usman Tariq.\n\nIt was a statement win for Gladiators, who came into the match against the defending champions as the league stage’s table toppers and the Saud Shakeel-led side hardly felt the heat of the big occasion.\n\nAfter having posted 209-5, thanks to what proved to be a match-winning partnership between Chandimal and Faheem, Gladiators never really let United get away with the game as Usman took three wickets.\n\nChasing the big total, United — who will now face the winners of the first Eliminator between Karachi Kings and Lahore Qalandars — scampered on their way to 45-1 in the powerplay, with opener Alex Hales playing Faheem’s pace onto his stumps early in the innings.\n\nThe incoming Rassie van der Dussen responded to the slow start when he lifted two towering sixes over Faheem’s head in the seventh over. The South African went after pacer Mohammad Wasim Jr for two cracking boundaries in the ninth, but was undone by a deadly yorker.\n\nGladiators were 94-2 by the halfway stage after Salman Ali Agha and Sahibzada Farhan hit a four and a six respectively in the 10th over. Right after bringing up his half century in 33 balls, Farhan holed Usman Tariq’s spin out to Khawaja Nafay at square-leg.\n\nAs pressure increased over United, captain Shadab, who had slog-swept Usman for a six over midwicket, was stunned by a one-handed catch by his counterpart Saud, who jumped into the air to intercept the ball after Shadab had cut spinner Abrar Ahmed.\n\nFaheem then returned to bamboozle the incoming James Neesham with an outswinger that chipped the bail off the stump before the Salman counterattacked with two boundaries as United reeled at 143-5.\n\nBut they got deeper in trouble when Mohammad Amir bounced out Imad Wasim.\n\nA ramp shot by Salman off Mohammad Wasim suggested the batter could take the match till the end, but Usman’s return in the 18th saw him perish, with Naseem Shah following him back to the pavilion on the very next ball, virtually ending the proceedings before Amir and Wasim took the last two wickets.\n\nEarlier, Chandimal and Faheem led Gladiators’ fightback after a difficult start. Getting together when Gladiators were reeling at 111-5 by the 12th over, the duo went on to play together until the penultimate ball of the innings, combining for 95 off 40 balls with Chandimal staying unbeaten at 49 off 29 (four fours and three sixes) while Faheem added 45 off 23 (four fours and three sixes).\n\nGladiators were effective with the bat in the powerplay, getting 68 off it but also losing three wickets; those of Saud and in-form batters Rilee Rossouw and Hasan Nawaz.\n\nThe fall of three wickets early into the innings did seem to play on the minds of Allen and Avishka Fernando; the Quetta batters present on the crease, with only 28 runs coming across the next four overs, also thanks to some tight bowling by spinner Imad and Neesham.\n\nWith Gladiators at 98-3 at the halfway stage, Fernando took on Imad in the 11th over, driving down the ground for four before slogging past midwicket for six, only to see Allen (41 off 27, seven fours) get caught in the same area two balls later.\n\nThe introduction of Shadab’s leg-spin in the next over brought about Fernando’s ouster as well, the right-hander getting trapped in front after adding 32 off 21 (two fours and a six).\n\nShadab’s return in the 14th over saw Dinesh Chandimal punishing the bowler for pitching it in the right-hander’s slot by two hits for sixes straight down the ground.\n\nChandimal cut Imad with prowess for a boundary and played a similar shot off Neesham for four more to bring up 150 for Gladiators by the 16th over.\n\nAs Quetta amped things up, Faheem bludgeoned Salman for a four before smashing his yorker for a straight six before Chandimal dispatched two fours and a six off Neesham.\n\nFaheem took on Naseem in the next over, pulling for six and placing the ball past cover and backward point for fours. The left-hander dragged a slower one over the leg-side for another six before holing one out to Shadab in the final over, but by then Gladiators had enough on the board to eventually take the match.\n\nScoreboard\n\nQUETTA GLADIATORS:\n\nSaud Shakeel c Naseem b Dwarshuis 12\n\nFinn Allen c Farhan b Imad 41\n\nRilee Rossouw c Ghazi b Dwarshuis 16\n\nHasan Nawaz c Shadab b Irshad 6\n\nAvishka Fernando lbw b Shadab 32\n\nDinesh Chandimal not out 48\n\nFaheem Ashraf c Shadab b Irshad 45\n\nMohammad Wasim not out 1\n\nEXTRAS (LB-3, W-5) 8\n\nTOTAL (for six wickets, 20 overs) 209\n\nDID NOT BAT: Mohammad Amir, Usman Tariq, Abrar Ahmed\n\nFALL OF WICKETS: 1-14 (Saud), 2-58 (Rossouw), 3-68 (Hasan), 4-111 (Allen), 5-113 (Fernando), 6-208 (Faheem)\n\nBOWLING: Naseem 4-0-50-0, Dwarshuis 2-0-31-2 (3w), Irshad 4-0-34-2 (2w), Imad 4-0-36-1, Neesham 4-0-36-0, Shadab 2-0-19-1\n\nISLAMABAD UNITED:\n\nSahibzada Farhan c sub (Khawaja) b Usman 52\n\nAlex Hales b Faheem 0\n\nRassie van der Dussen b Wasim 35\n\nSalman Ali Agha c Allen b Usman 44\n\nShadab Khan c Saud b Abrar 16\n\nJames Neesham b Faheem 1\n\nImad Wasim c Faheem b Amir 5\n\nBen Dwarshius not out 9\n\nNaseem Shah c Allen b Usman 0\n\nGhazi Ghouri c sub (Khawaja) b Amir 4\n\nSalman Irshad c Hasan b Wasim 2\n\nEXTRAS (LB-4, W-7) 11\n\nTOTAL (all out, 19.4 overs) 179\n\nFALL OF WICKETS: 1-8 (Hales), 2-79 (van der Dussen), 3-101 (Farhan), 4-124 (Shadab), 5-131 (Neesham), 6-150 (Imad), 7-168 (Salman), 8-168 (Naseem)\n\nBOWLING: Amir 4-0-31-2, Faheem 3-0-33-2 (1w), Abrar 4-0-27-1, Wasim 3.4-0-38-2 (3w), Usman 4-0-32-3 (3w), Saud 1-0-14-0\n\nRESULT: Quetta Gladiators won by 30 runs.\n\nPLAYER-OF-THE-MATCH: Faheem Ashraf\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682e754c1952d.jpg",
  "retrievedAt": "2025-08-23T14:22:52.629Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912526/hbl-pakistan-super-league-clinical-gladiators-down-united-to-make-final",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:25.000Z"
}
