{
  "title": "Pakistan’s new climate minister on water, justice and a warming world - Pakistan - DAWN.COM",
  "author": null,
  "content": "In sweltering Karachi, as tensions with India simmer over the Indus Waters Treaty, Musadik Masood Malik sips an Americano. Recently appointed as Pakistan’s federal minister for climate change and environmental coordination, Malik left his previous post overseeing the Ministry for Water Resources and Petroleum to take on what he describes as an urgent and daunting role. In one of his first interviews since the March 2025 reshuffle, he speaks exclusively to Dialogue Earth.\n\nMalik leans forward to list what he sees as Pakistan’s most pressing environmental threats: “Air pollution and its economic toll on the people of Pakistan. Water pollution and access. And solid waste [management], whether methane or carbon dioxide. These are the three major challenges we face,” he says.\n\nBut it’s Pakistan’s melting glaciers that concern him most. Before arriving in Karachi, one of Senator Malik’s first official visits was to Gilgit-Baltistan, Pakistan’s northernmost region and home to some of the world’s largest glacial reserves outside the polar zones. He was there to see the initiatives taking place under a United Nations project which aims to reduce the risk of glacial lake outburst flooding (GLOF). The numbers, he says, speak for themselves: Pakistan is home to more than 13,000 glaciers, putting it on the frontlines of a warming world.\n\n“As the population has increased, communities no longer live where their forefathers used to live. What if they’re in the path of these hazards?” he says.\n\nSome 2,000 km from Gilgit-Baltistan, the minister faces an entirely different set of climate challenges in Karachi, Pakistan’s largest city and financial powerhouse. Chief among them is bridging the political gaps between the federation and the provinces, as well as navigating competing interprovincial interests.\n\nDespite diplomatic pressure from India to block financial assistance, the International Monetary Fund (IMF) this month approved a new loan for Pakistan. In a statement, the IMF confirmed it had accepted the Pakistani government’s request for an arrangement under the Resilience and Sustainability Facility (RSF), unlocking USD 1.4 billion to help the country respond to climate-related challenges.\n\nWhile the funding represents a significant boost, Malik remains sceptical. “We still haven’t gotten over a lot of what happened during the 2022 floods. Commitments are made and they are not fulfilled,” he says. “Pledges were made for the Loss and Damage Fund, but was money put in that fund? Look at the quantum of commitments and then look at the drawdown, and the actual funding that has come about.”\n\nHe questions the entire global response mechanism: “Is it just the theatre of disaster, where we all get together and speak fantastic English and make great speeches?”\n\nRecently, Pakistan urged relevant parties to expedite disbursements from the Loss and Damage Fund, as it continues to bear the brunt of extreme weather events and slow-onset climate impacts. “I don’t feel cynical,” says Malik. “What I’m doing right now is lobbying. And not just lobbying for Pakistan — though that is my first and foremost duty and responsibility. But I’m lobbying for the vulnerable; I’m lobbying for climate justice.”\n\nThe minister has been vocal at recent international forums, rallying for climate justice and the rights of developing countries, including at the Geneva climate summit, calling out what he sees as inequities in the global climate finance architecture. He criticises the disproportionate benefits going to a handful of countries. “What about the rest of the world?” he adds. “What about Pakistan?”\n\nDomestically, one of the most heated environmental debates involves the controversial six canals project, in the Cholistan desert in southern Punjab. Water is a deeply political issue in Pakistan, where provinces have long contested their share of the Indus River system, which sustains the country’s agriculture-dependent economy. In this context, the six canals project, seen by some as a plan that would potentially reduce the water flow toward downstream Sindh province, has triggered fierce opposition. Sindh has expressed fears of reduced flows and decried a lack of consultation.\n\nMalik defends the idea as potentially beneficial but stresses that trust and transparency between provinces are key. “The possible solution to protect the water rights for each province is to ensure a water telemetry system [to monitor usage] at every interdimensional junction so that every drop of water that flows is accounted for,” he says. Once that system is in place, he adds, provinces can be assured they are receiving their fair share of water “through science and technology and not through human intervention”.\n\nHowever, public protests and rising interprovincial tensions have led authorities to pause the project until a consensus is reached. “We don’t want to do anything without the consent of provinces, and provinces should be consulted,” he says.\n\nMalik reiterates his commitment to transparency and accountability in water governance moving forward. “There will be no unilateralism,” he says, adding that a robust telemetry system will ensure real-time water monitoring and equitable distribution.\n\nThe federal minister also stresses the importance of water productivity, an idea he believes is not given enough attention in Pakistan. “A 3 per cent improvement in water-use productivity for agriculture produces the same yield as 3 million acre-feet of flood irrigation,” he says. In other words: more crop per drop. The focus, he argues, should shift from expanding irrigation infrastructure to using existing water more efficiently.\n\nWhen asked about the political flashpoint surrounding dam-building in Pakistan, Malik responds with a grin and a pun: “I’m not going to name the dam because I’d be damned if I did.”\n\nDespite a recently announced ceasefire following renewed tensions and conflict between India and Pakistan, the future of the Indus Waters Treaty remains precarious. Following the Pahalgam attack in Indian-administered Kashmir, India announced a unilateral suspension of the Indus Waters Treaty — a move Pakistan has strongly rebuked. “If there is a disagreement, the first step is bilateral discussion among the Indus commissioners. If that doesn’t work, there are secondary mechanisms — neutral technical experts can be consulted,” he notes. “The last resort is the court of arbitration. And this has been working in this treaty. And if this treaty has no value, then no treaty in the world has value.”\n\nMalik claims India has violated the treaty multiple times. “It is one of the binding conditions of the treaty that commissioners have to meet periodically. India has already violated this. They also do not share enough information or data that helps ascertain the water flow in this bilateral system,” he says. He adds that India’s calls to renegotiate the treaty’s terms predate the attack in Pahalgam. “This raises suspicions — was Pahalgam used as an excuse to violate the treaty?” he asks.\n\nFrom regional tensions to global inaction, Malik circles back to the human cost of climate change — particularly for Pakistan’s most vulnerable. “We lose [access to] schools and health centres. Our girls and our women get affected disproportionately by these devastations,” he says.\n\nThen, in a quieter moment, the minister reflects on a more innocent past. “When I was growing up, we would catch fireflies in our garden, put them in bottles and take them in dark rooms, but then we’d come out in the garden and let them loose, lest they die. We’d chase butterflies in the evenings. Where are the butterflies and fireflies? Who’s chasing them? Where are the green parrots and the bulbuls? Have you seen them recently?” He does not expect an answer.\n\nFor Malik, the aesthetic and cultural loss, triggered by a warming world, is just as profound as the physical damage. The minister laments the loss of poetry and folk songs that once paid homage to Pakistan’s natural world. “Floods and climate-induced disasters do not only cause material losses,” he says. “They also rob us of our culture.”\n\nThis article was originally published by Dialogue Earth and has been republished with permission.\n\nHeader image: Local sheep herders walk along the Shandur Pass in northern Pakistan. — Jackie Ellis/Alamy",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/22190831f8e948b.jpg",
  "retrievedAt": "2025-08-23T14:22:29.488Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912625/pakistans-new-climate-minister-on-water-justice-and-a-warming-world",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T15:38:17.000Z"
}
