{
  "title": "Key Bangladesh party protests against govt - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladesh’s key political party held large-scale protests against the interim government for the first time on Wednesday, as political rows spill onto the streets, including demands for an election date.\n\nThousands of supporters of the powerful Bangladesh Nationalist Party (BNP) rallied in Dhaka, shutting down central streets, demanding their candidate be installed as the capital’s mayor.\n\nThe protests are significant in that they pitted the BNP, seen as the frontrunners in highly anticipated elections, against the caretaker government.\n\nThe interim government led by Nobel Peace Prize winner Muhammad Yunus took over following a mass uprising in August 2024 that toppled then prime minister Sheikh Hasina. No date has been set for elections but Yunus has promised polls will be held by June 2026 at the latest.\n\nBut the BNP’s would-be mayor Ishraque Hossain has not taken up his post, with city authorities run instead by a government-appointed administrator.\n\nBNP supporters have padlocked the gates of the mayoral office for the past week suspending civic services, demanding Hossain take up the post — pointing out that this has already happened in the country’s second city Chittagong.\n\n“The government is not understanding the language of the people,” said protester Rawshan Ara, 43, adding that she and fellow BNP loyalists would escalate protests if Hossain does not become mayor.\n\nSenior BNP leader Salahuddin Ahmed said protests had, so far, been led by local activists — but warned that the wider party would back the demonstrations if the government did not take action.\n\nPublished in Dawn, May 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/22101225af9e0f2.jpg",
  "retrievedAt": "2025-08-23T14:22:51.163Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912466/key-bangladesh-party-protests-against-govt",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T01:42:34.000Z"
}
