{
  "title": "6.1-magnitude quake hits off Greek island of Crete: USGS - World - DAWN.COM",
  "author": null,
  "content": "A 6.1-magnitude earthquake rattled the Greek island of Crete on Thursday, the US Geological Survey said, with no major damage immediately reported.\n\nThe strong quake struck 82 kilometres (51 miles) northeast of Crete’s capital Heraklion at 3:19am GMT (8:19am PKT) at a depth of 68 kilometres (42 miles), the USGS said.\n\nAFP journalists said it was felt as far away as Athens and Egypt.\n\nGreek state television ERT said many residents in the Cretan regions of Rethymno and Lasithi were woken by the quake just after 6:00am (11am PKT) and quickly exited their homes as a precaution.\n\nLocal media showed supermarket items strewn on floors, and reported minor rockslides on rural roads.\n\nThe tremor “occurred at a great depth and there is no particular reason for residents to worry,” Athanassios Ganas, general director of Research at the Geodynamics Institute of the National Observatory of Athens, told ERT.\n\nState news agency ANA said fire department units in Crete had been placed on general alert, with vehicles patrolling to assess the situation.\n\nThe mayor of Heraklion, Alexis Kalokerinos, told ERT that there were no particular problems in the city and that closing schools would not be necessary.\n\nThe quake struck just over a week after a 6.1-magnitude tremor hit near the island of Kasos east of Crete, and was felt in the outlying area.\n\nThe region, popular with tourists, has been hit with multiple tremors in recent months, prompting schools in Santorini and neighbouring islands to temporarily close.\n\nThousands of earthquakes, mainly of low magnitude, have been recorded since January between the islands of Santorini, Amorgos, Ios and Anafi in the Cyclades group southeast of the Greek mainland.\n\nThey have not caused casualties or significant damage.\n\nLocated where the African and Anatolian tectonic plates converge, the Aegean Sea is often hit by quakes.\n\nBut the region had not experienced a phenomenon of such magnitude since records began in 1964, experts say.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:22:37.604Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912580/61-magnitude-quake-hits-off-greek-island-of-crete-usgs",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T07:05:23.000Z"
}
