{
  "title": "Leaders, military’s top brass call for national unity, justice in Independence Day messages - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari and Prime Minister Shehbaz Sharif have called for rising beyond divisions and standing united for a Pakistan that is built on justice, equality, and service to all, as the nation celebrates Pakistan’s 79th Independence Day today.\n\nThey said the day served as a reminder of courage, unity, and sacrifices that led to the creation of Pakistan and paid homage to founding father Quaid-i-Azam Muhammad Ali Jinnah and the workers of the Pakistan Movement for their struggle and sacrifices.\n\nIn his message on the occasion, President Zardari emphasised that the nation had “reaffirmed its strength, resolve, and unity in the face of external aggression”.\n\n“Our success in Marka-i-Haq and Operation Bunyan-um-Marsoos is a landmark moment in our history,” he said. “It was a demonstration of unshakable national will, professional excellence, and united purpose.”\n\nIn July, Planning Minister Ahsan Iqbal said this year’s Independence Day would be marked as “Marka-i-Haq” (Battle of Truth). The term is used by the state for the conflict with India from the April 22 Pahalgam attack to the end of Operation Bunyanum Marsoos with a ceasefire on May 10.\n\nThe clash began after India blamed Pakistan for the attack without evidence, leading to air strikes and a week of missile exchanges stretched until a US-brokered ceasefire.\n\nThe day dawned with a 31-gun salute in Islamabad and 21-gun salutes at the provincial headquarters, Radio Pakistan reported.\n\nSpecial prayers were offered in mosques for peace, solidarity and prosperity of the country. Various renowned buildings across the country have also been decorated with the national flag and lights as the nation celebrates Independence Day with fervour.\n\nThe main flag hosting ceremony was held at the Pakistan Monument in the federal capital, where PM Shehbaz unfurled the national flag.\n\nSenate Chairman Yousaf Raza Gilani, National Assembly Speaker Ayaz Sadiq, cabinet members, parliamentarians and school students were present on the occasion, according to Radio Pakistan.\n\nA flag-hoisting ceremony was also held at the Supreme Court, where Chief Justice of Pakistan Justice Yahya Afridi unfurled the national flag.\n\nIn his message, President Zardari noted that “faced with unjustified Indian aggression, Pakistan responded with clarity, courage and restraint.\n\n“The world witnessed a nation that is peace-loving, but fully capable of defending its sovereignty and territorial integrity.”\n\n“Today, the world sees Pakistan as a country that seeks peace but does not bow to coercion.\n\n“But this moment is about more than military success. It is a reminder of what we can achieve when we are united, focused, and committed to a common goal,” the president said.\n\nHe asserted that this victory gave the people of Pakistan a sense of renewed confidence. It has lifted the morale of the people, restored faith in our institutions, and enhanced Pakistan’s stature on the global stage, he added.\n\nPresident Zardari urged the nation to channel this spirit into economic revival, educational reform, technological advancement, institutional development, and environmental resilience.\n\n“The same discipline, courage, and clarity that led to our recent success against India can lead us toward victory in eradicating poverty, creating opportunities for our people, and building a just and inclusive society.”\n\nHe also expressed solidarity with the people of India-occupied Kashmir, saying that “their courage and struggle for justice and their right to self-determination remain close to our hearts.\n\n“Pakistan will continue to extend its unwavering diplomatic, moral, and political support until their right to self-determination is realised.”\n\nIn his message, PM Shehbaz paid tribute to Jinnah and national poet Allama Muhammad Iqbal, who along with other resolute leaders and workers of the Independence Movement, united the nation under one vision, one mission and one goal.\n\n“Their relentless efforts changed the course of the history with the establishment of an independent, ideological state, thus realising a seemingly impossible dream into a reality,” he said in a statement.\n\n“The past 78 years tell a tale of resilience, strong faith and a hope of a bright future when as a nation, we braved several difficult challenges”, he stated. “Despite this, Pakistan achieved a series of milestones of success and achievements in every field.”\n\nHe also paid tribute to the martyrs who sacrificed their lives for the sake of Pakistan’s freedom, saying Marka-i-Haq was not just a military conquest, but also the victory of validation of the Two-Nation Theory.\n\n“Pakistan’s historic victory in Marka-i-Haq during the four-day war imposed by India has not only reinforced the sanctity of our freedom, but has also instilled a renewed sense of ambition and national spirit in the hearts of our people, magnifying the pride and fervour of this Independence Day.”\n\nHe continued: “With the blessings of Almighty Allah, our brave armed forces revived their past glory and shattered the false pride of enemy by acting as a Bunyanum Marsoos — a solid fortified wall.\n\n“The military capability, valour and faith of our brave soldiers and air warriors forced the enemy to kneel down. We pay tribute to the martyrs who sacrificed their lives for the sake of our freedom and offer prayers for the elevation of their ranks in eternal life.”\n\nWhile expressing his resolve to protect Pakistan’s sovereignty, PM Shehbaz said: “We reiterate our belief in the principles of peaceful coexistence and resolving the regional and global issues through dialogue and diplomacy.”\n\nHe said India needs to demonstrate the same will for the resolution of all disputes, including the Jammu and Kashmir dispute.\n\nPM Shehbaz also highlighted the government’s initiatives for the welfare of the common people, such as a reduction in electricity prices. “The government is utilising all resources to make the country effectively meet the economic, industrial technological demands of the present era.”\n\nHe called for demonstrating the spirit of Marka-i-Haq and Pakistan Movement for a strong and stable economy, which is inevitable for an impregnable national defence and sovereignty.\n\nIslamabad\n\nThe armed forces are showcasing defence equipment at Shakarparian Parade Ground.\n\nThe exhibition, which opened in the morning, featured various weapons, aircraft, tanks and other military equipment used during Marka-i-Haq, Radio Pakistan reported.\n\nThe display included artillery, rocket launchers, military vehicles and armoured carriers. Radars that played an important role during the May conflict were also showcased.\n\nThe Pakistan Air Force was also set to perform a fly-past and para-jumping demonstration.\n\nSindh\n\nIn Karachi, a change of guard ceremony was held at Quaid-i-Azam Mazar, where smartly tuned-out cadets of the Pakistan Naval Academy (PNA) assumed the duties of ceremonial guards at the mausoleum, the Associated Press of Pakistan reported.\n\nSindh Chief Minister Murad Ali Shah paid tribute to Quaid-i-Azam and called for unity against terrorism, poverty and ignorance. Governor Kamran Khan Tessori and members of the provincial cabinet were also present.\n\nThe Pakistan Navy’s ceremonial guard comprised two contingents — one of sailors and the other of cadets from the PNA. The sailors’ platoon was led by Lieutenant Ali Hassan, while the cadets’ platoon was commanded by Chief Cadet Captain Muhammad Zain.\n\nPNA Commandant Commodore Tassawar Iqbal attended the event as the chief guest, while the parade commander duties were performed by Lt Commander Samiullah.\n\nPakistan Navy guards presented a national salute to Jinnah, after which the chief guest inspected the newly deployed guards. Commodore Iqbal then laid a floral wreath at the mausoleum, offered fateha and recorded his remarks in the visitors’ book.\n\nIn a statement on X, Tessori said: “This day reminds us of unity, sacrifice and renewed resolve. This year, the joy of freedom has increased manifold after defeating India decisively in the battle of truth on May 10.”\n\nPunjab\n\nPunjab Chief Minister Maryam Nawaz, in a statement, expressed her gratitude to God for “providing the chance to live a dignified life on a free land”.\n\n“Pakistan is a bright lamp whose light is shining on the world. Pakistan is our pride and glory; we are nothing without Pakistan,” Maryam said.\n\nThe chief minister urged people to hold themselves “accountable”, saying: “Pakistan gave us respect and independence. What did we give back to the country?”\n\nA flag-hoisting ceremony was held at the Directorate General of Public Relations office in Lahore, attended by the office’s Director General Ghulam Sagheer Shahid.\n\nPunjab Minister for Minorities Affairs Ramesh Singh Arora also raised the national flag at a separate event at his department. He also planted a sapling and cut a cake with the participants to celebrate the day, APP reported.\n\nA change of guard ceremony was held at Allama Iqbal’s mausoleum, where Acting Punjab Governor Malik Muhammad Ahmad Khan laid a wreath on the poet’s grave.\n\nBadshahi Masjid Khateeb Maulana Abdul Khabeer Azad also offered prayers for the country’s peace, stability and development, APP reported.\n\nKhyber Pakhtunkhwa\n\nA flag-hoisting ceremony was also held at Governor House in Peshawar, where Khyber Pakhtunkhwa Governor Faisal Karim Kundi raised the national flag and cut a cake.\n\nThe event was attended by the Consul Generals of the United States, Iran and Afghanistan in Peshawar, along with the Governor’s House staff and other distinguished guests, according to APP.\n\nThe ceremony commenced with the national anthem, followed by a salute presented by the police.\n\n“In Marka-i-Haq, Pakistan not only shattered India’s arrogance but also defended its borders and independence with full strength,” Governor Kundi was quoted as saying.\n\nThe governor highlighted that the people of KP, along with the entire nation, were celebrating the joy of freedom and sovereignty, standing firmly alongside the armed forces for the dignity and independence of the country.\n\nAt the Dera Ismail Khan Police Lines, KP CM Ali Amin Gandapur hoisted the national flag, planted a sapling and paid respects at the Martyrs’ Memorial, a post on his X account said.\n\nSenior officials from the divisional and district administration, along with police, political and social figures, students, and a large number of the public attended the ceremony.\n\n“At the conclusion of the event, special prayers were offered for peace, security, and prosperity in the country,” the post added.\n\nBalochistan\n\nBalochistan CM Sarfraz Bugti, in a post on X, said: “On this joyous Independence Day, every heart in Balochistan beats with love for Pakistan.”\n\n“This sacred land is fragrant with the blood of those martyrs who sacrificed their everything to keep our flag flying high,” the chief minister said, pledging to “never back down from laying down our lives in defence of our motherland”.\n\n“Pakistan is our pride, our identity, and the symbol of our existence. We will never allow any harm to come to this land,” Bugti vowed.\n\nSpeaking at a flag-hoisting ceremony on the lawns of Balochistan Assembly, Bugti stressed that this year’s celebration carried “exceptional significance, as the nation has defeated an adversary stronger than an enemy steeped in arrogance and pride”, APP reported.\n\n“Our brave armed forces have achieved a victory that fills every Pakistani with pride,” said CM Bugti, extending heartfelt gratitude to the armed forces, particularly the army chief, as well as PM Shehbaz and President Zardari.\n\nThe Balochistan CM also announced a cash prize of Rs500,000 for the schoolchildren who performed during the celebration. He also met with provincial ministers, legislators, religious leaders and citizens from various walks of life, extending Independence Day greetings.\n\n“From Gwadar to Zhob, the people celebrated Independence Day with unmatched enthusiasm. This is the spirit of a vibrant nation,” the chief minister asserted.\n\nHe underscored the cultural richness of Balochistan’s diverse communities, which include Baloch, Pashtun, Hazara, and others, while condemning the actions of terrorist groups that violate tribal and societal values.\n\n“Targeting innocent women, children, and travellers is not just terrorism; it’s a betrayal of our traditions,” APP quoted him as saying.\n\nAzad Jammu and Kashmir\n\nThe University of Azad Jammu and Kashmir (UAJK) celebrated Pakistan’s Independence Day with patriotic fervour, holding a series of events that reflected the institution’s deep commitment to national unity and the Kashmir cause, APP reported.\n\nThe national and state flags were raised at the Administration Block by Registrar Prof Dr Saadat Hanif Dar, Controller of Examinations Prof Dr Wajid Aziz Lone, and Finance Director Prof Dr Muhammad Basharat.\n\nFaculty members, administrative staff and university employees gathered to mark the historic occasion, offering special prayers for the stability, peace, and prosperity of Pakistan and the early freedom of those in India-occupied Kashmir (IoK). The programme featured speeches, patriotic songs and a cake-cutting ceremony.\n\nAdditional Chief Secretary (General) Midhat Shehzad, who attended as the chief guest, said that true appreciation of freedom comes from contrasting life in AJK with that in IoK, terming freedom a great blessing from Allah Almighty that must be honoured with gratitude and responsibility.\n\nMeritorious Prof Dr Syed Nadeem Haider Bukhari, dean of the Faculty of Humanities and Social Sciences, underscored that no blessing was greater than freedom for humankind.\n\nHe called for recognising those who work quietly for the nation’s defence, progress and development, and paid tribute to the valiant armed forces. Bukhari observed that while India “faltered in war, global politics and regional power dynamics, Pakistan continues to stand firm”, APP stated.\n\nThe military top brass congratulated the nation on Independence Day as they vowed to safeguard Pakistan’s sovereignty and unity, according to a statement by Inter-Services Public Relations (ISPR).\n\nChief of Army Staff Field Marshal Syed Asim Munir, Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza, Chief of the Naval Staff Admiral Naveed Ashraf, Air Chief Marshal Zaheer Ahmad Babar Sidhu extended “heartfelt felicitations to the nation on the auspicious occasion” of Independence Day, “marking the triumph of unity, resilience, and an unwavering commitment to a shared vision for a brighter future”.\n\n“As guardians of national security, we reaffirm our unwavering resolve to safeguard Pakistan’s sovereignty and territorial integrity, uphold the Constitution, and protect the values that define our national identity,” the statement said.\n\n“The unbreakable bond between the armed forces and the people is the cornerstone of our collective strength.”\n\nThe military top brass paid homage to the founding fathers and honoured their “indomitable spirit, resolute determination, and unparalleled sacrifices”, which paved the way for independence“. “Their courage, foresight, and unshakeable faith in the cause of freedom remain an enduring beacon of guidance,” it highlighted.\n\nThe armed forces also paid solemn tribute to the “visionaries, statesmen, and soldiers who laid our nation’s foundations, cherishing their legacy with deep reverence and gratitude”.\n\n“On this Independence Day, let us renew our resolve to strive for peace, progress, and unity, upholding the ideals of Faith, Unity, and Discipline to realise the dream of a resilient, prosperous, and progressive Pakistan.”\n\nDeputy PM Ishaq Dar, in a pre-recorded message, highlighted the importance of truth, justice and dignity in international engagements, in view of Pakistan’s intensified diplomacy in the wake of the May conflict.\n\nCelebrating Marka-i-Haq, Dar said: “We are reminded that freedom is preserved not only by defending our borders but also by upholding the principles of truth, justice and dignity in our international engagements.\n\n“Our foreign policy will continue to project Pakistan as a responsible, peace-loving nation — ready to build partnerships, resolve disputes through dialogue and play an active role in shaping a stable and prosperous region,” the foreign minister asserted.\n\nHe lauded the resolve of the armed forces and the people who “stood together to safeguard our sovereignty”. “This collective resilience reflects not only formidable military readiness but also a principled foreign policy that has earned widespread international support,” Dar noted.\n\n“I pay tribute to the immortal sacrifices made by our forebears, affirming that Pakistan was born out of their indomitable spirit and devotion to truth. I reaffirm that our nation cannot be defeated as long as we stand united,” he stated.\n\nThe deputy PM reiterated that Pakistan remained “steadfast in its commitment to a diplomatic approach grounded in mutual respect, regional tranquillity and peace”.\n\n“Today, we renew our dedication to fortify Pakistan’s global standing, advance our strategic and economic interests, and foster a peaceful neighbourhood.”\n\nHe urged all citizens to “remain united, protect democratic values and collectively contribute to building a strong, dignified, and prosperous Pakistan — for today and times to come”.\n\nMeanwhile, leaders from various countries also felicitated Pakistan on its Independence Day.\n\nUnited States Secretary of State Marco Rubio said in a statement: “On behalf of the United States, I extend our warm congratulations to the people of Pakistan as they celebrate their Independence Day on August 14.”\n\nHe added that the US “deeply appreciates Pakistan’s engagement on counterterrorism and trade”.\n\n“We look forward to exploring new areas of economic cooperation, including critical minerals and hydrocarbons, and fostering dynamic business partnerships which will promote a prosperous future for Americans and Pakistanis,” Rubio said, building upon the two countries’ intensified economic and military in recent weeks.\n\nRussian Embassy in Pakistan hailed the country’s “significant progress in many areas”, while the Chinese embassy wished for the “ironclad friendship” between the two nations to grow stronger.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/14095154cdcdd5b.jpg",
  "retrievedAt": "2025-08-23T14:23:27.667Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930816/leaders-militarys-top-brass-call-for-national-unity-justice-in-independence-day-messages",
  "dateList": "2025-05-22",
  "date_published": "2025-08-14T04:35:54.000Z"
}
