{
  "title": "Iran says will hold US responsible for any Israeli attack on its nuclear sites - World - DAWN.COM",
  "author": null,
  "content": "Foreign Minister Abbas Araghchi said Iran would hold the United States responsible for any Israeli attack on its nuclear facilities, after US media reported that Israel was preparing for a strike.\n\nThe report came even as Iran and the United States were set to meet in Rome on Friday for a fifth round of Omani-mediated nuclear talks.\n\n“We believe that in the event of any attack on the nuclear facilities of the Islamic Republic of Iran by the Zionist regime (Israel), the US government will also be involved and bear legal responsibility,” Araghchi said in a letter to the United Nations published on Thursday.\n\n“Iran strongly warns against any adventurism by the Zionist regime and will respond decisively to any threat or unlawful act by this regime,” Araghchi added.\n\nOn Tuesday, CNN reported that Israel was making preparations to strike Iranian nuclear facilities.\n\nThe nuclear talks, which began on April 12, are the highest-level contact between the long-time foes since the United States in 2018 pulled out of a landmark deal between Iran and world powers, during President Donald Trump’s first term in office.\n\nIsrael, Iran’s sworn enemy, has been threatening to use force against Iranian nuclear sites since the talks began.\n\nOn Thursday, Ali Mohammad Naini, the spokesman for Iran’s Islamic Revolutionary Guard Corps, warned of a “devastating” response in case of an Israeli attack.\n\n“If the delusional Zionist regime commits a foolish act and launches an attack, it will definitely receive a devastating and decisive response in its small and vulnerable geography,” said Naini, according to the ISNA news agency.\n\nAlso on Thursday, a group of demonstrators gathered near the Fordow nuclear enrichment plant south of Tehran to voice their support for the country’s nuclear activities.\n\nThe crowd waved Iranian flags and chanted slogans such as “nuclear energy is our inalienable right” and “no compromise, no surrender, only confrontation with America”.\n\nIran does not recognise Israel and generally refers to it as the “Zionist regime”, and the two countries have fought a shadow war for years.\n\nThe two foes traded direct attacks last year for the first time, against the backdrop of soaring regional tensions triggered by the Gaza conflict.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/2220024382ca58f.jpg",
  "retrievedAt": "2025-08-23T14:22:31.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912630/iran-says-will-hold-us-responsible-for-any-israeli-attack-on-its-nuclear-sites",
  "dateList": "2025-05-22",
  "date_published": "2025-05-22T15:52:22.000Z"
}
