{
  "title": "COVID-19 claims 37, infects 1,050 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-37-infects-1050-more-people/",
  "date_published": "2021-06-20T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): The national tally on Sunday of total active COVID-19 cases was recorded 33,972 with 1,050 more people tested positive for the deadly virus and 1,282 people recovered from the disease during the last 24 hours.\nThirty-seven corona patients have died during past 24 hours, 33 of whom were under treatment in the hospitals and four out of the hospitals had perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in the Punjab followed by Sindh.\nOut of the total 37 deaths occurred in the last 24 hours 17 of them had died who were under treatment on ventilators.\nThere were 2,296 Covid infected patients under treatment in critical care among four of them admitted in various Covid dedicated healthcare facilities in past 24 hours.\nThe National Covid positivity ratio during past 24 hours was recorded 2.55 percent.\nIt may be mentioned here that the Covid positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major areas including Islamabad 24 percent, Lahore 21 percent, Bahawalpur 26 percent and Multan 37 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gilgit 48 percent, Abbottabad 27 percent, Karachi 24 percent and Muzaffarabad 22 percent.\nAround 292 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB).\nSome 41,065 tests were conducted across the country on Saturday, including 10,825 in Sindh, 17,025 in Punjab, 9,222 in Khyber Pakhtunkhwa (KP), 2,443 in Islamabad Capital Territory (ICT), 693 in Balochistan, 385 in GB, and 472 in AJK.\nAround 892,319 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 948,268 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 19,934, Balochistan 26,585, GB 5,803, ICT 82,344, KP 136,973, Punjab 344,970 and Sindh 331,659.\nAbout 21,977 deaths were recorded in country since the eruption of the contagion. Around 5,327 have perished in Sindh among 11 of them died in hospitals and two out of the hospitals on Saturday.\n10,633 in Punjab had died with 18 deaths occurred in past 24 hours. 16 of them died in the hospitals and two out of the hospitals.\n4,262 in KP where five of them died in hospitals on Saturday, 775 in ICT, 301 in Balochistan among one of them died in the hospital on Saturday, 108 in GB and 571 in AJK succumbed to the deadly virus.\nA total of 14,113,670 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 2,591 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:52:07.109Z"
}
