{
  "title": "FM Qureshi leaves for Pakistan after concluding his visit to Turkey",
  "link": "https://www.app.com.pk/national/fm-qureshi-leaves-for-pakistan-after-concluding-his-visit-to-turkey/",
  "date_published": "2021-06-20T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 20 (APP):  Foreign Minister Makhdoom Shah Mahmood Qureshi Sunday left Turkey after concluding his successful three-day official visit to the host country.\nThe foreign minister participated in the Antalya Diplomacy Forum (ADF) on the invitation of his Turkish counterpart.\nAt the Istanbul airport, he was seen off by Pakistan ambassador in Turkey Muhammad Syrus Sajjad Qazi and other senior officials.\nDuring his stay in Turkey, the foreign minister held a number of meetings with the foreign ministers of different countries.\nOn the sidelines of the forum, foreign minister Qureshi held meetings with the European Union high representative, foreign ministers of Uzbekistan, Kyrgyzstan, Iran, Malaysia, Kuwait, Iraq, Qatar, Afghanistan, Turkey, the President-elect of Kosovo Republic and the secretary general of Organization of Islamic Cooperation (OIC). He also met Abdullah Abdullah, chairman Afghan Reconciliation Council  and former foreign minister Salahuddin Rabbani.\nDuring these meetings, the foreign minister discussed the bilateral ties and exchanged views on significant regional and global issues.\nForeign minister Qureshi also participated in a high-level panel discussion on ‘Regional Cooperation in Asia’ along with the foreign ministers of Kyrgyzstan, Malaysia, Tajikistan and Uzbekistan in Antalya Diplomacy Forum.\nIn his address, he highlighted the challenges being faced by Asia in form of unresolved disputes, tensions induced from within and without, renewed arms race, containment policies, unilateralism, poverty, COVID-19 and climate change. The foreign minister called for a renewed focus by Asian countries on geo-economics.\nHis remarks at the forum were highly appreciated by the participating counterparts.\nThe foreign minister also talked to the local and international media on different important regional and global issues and highlighted Pakistan’s view point.\nIt is expected that foreign minister’s visit to Turkey would prove fruitful for taking the Afghan peace process forward, besides strengthening of regional and economic cooperation.",
  "retrievedAt": "2025-08-11T20:52:04.891Z"
}
