{
  "title": "Fawad terms Dubai Expo an opportunity to unveil hidden treasures of Pakistan before the world",
  "link": "https://www.app.com.pk/national/fawad-terms-dubai-expo-an-opportunity-to-unveil-hidden-treasures-of-pakistan-before-the-world/",
  "date_published": "2021-06-20T16:05:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 20 (APP): Federal Minister for Information and Broadcasting, Chaudhry Fawad Hussain has termed Expo 2020 Dubai as an auspicious opportunity to unveil the hidden treasures of Pakistan before the world.\nSpeaking as a chief guest at media unveiling of Pakistan Pavilion at Expo 2020 Dubai here Sunday, the Federal Minister said, Pakistan is a land of immense opportunities with vast potential of promoting tourism, investment, agriculture, trade and industry.\nThe Expo 2020 will be held in Dubai from October 1, 2021 to March 31, 2022 under the theme of “Connecting minds, Creating the future” and around 190 countries will participate in the Expo to showcase their strongest potential to the world.\nPM Imran Khan led PTI government considers Pakistan as an emerging brand and taking concerted measures to highlight Pakistan’s soft and positive image across the world, he said adding that the Expo Dubai 2020 would provide the country an opportunity to brand the positive sides of the motherland.\nChaudhry Fawad said that in the past, the menace of terrorism and extremism were associated with Pakistan but now, with dedicated and focused initiatives of PTI government, Pakistan was emerging at global level as a country exporting modern technological products.\n“At the advent of the first wave of COVID-19, Pakistan was totally dependent over import to meet its requirements for prevention, detection and treatment of the contagion but due to untiring efforts of government, now we are exporters of COVID related materials,” he maintained.\nHe assured extensive cooperation of the Ministry of Information and Broadcasting to make the Pakistan Pavilion at Dubai Expo a success and said that such international events bring the countries together to brand their products and services to attract the potential buyers.\nUAE is the second home to Pakistanis and it is expected that a large number of expatriates would visit the Expo while thousands of visitor from across the world will be there to explore the hidden treasures of Pakistan, Fawad said.\nThe Minister said that instead of relying on national exchequer, the Ministry of Commerce and its partners for the pavilion had collected over Rs. one billion which was a clear manifestation of overwhelming confidence of the people, particularly of business community on PTI government.\n“Tourism is flourishing in Pakistan as the beautiful landscapes of the country were attracting not only inland tourist but foreigners as well,” he said and pointed out that to cater the needs of increasing number of tourists, the basic infrastructure should be improved and expanded accordingly.\nThe Federal Minister appreciated attractive design and logo of Pakistan Pavilion saying that it would be the largest pavilion of the Expo Dubai that would present enchanting glances of Pakistan to the world.\nHe invited businessmen, entrepreneurs, IT professionals and artists to come forward and showcase their ideas at the Expo to brand Pakistan as a hidden treasure.\nEarlier, Advisor to Prime Minister on Commerce and Investment, Abdur Razaq Dawood, highlighted the main features of the pavilion and said that Pakistan Pavilion with its prime location in the Expo and attractive designs, structures and digital presentation would attract the visitors from all around the world.\n“We are going to project a progressive, tolerant, diversified and beautiful Pakistan that offers vast opportunities in various fields,” he said and added that such international events were not merely focusing on projection of products but their main purpose was to project the country.\nChief Executive Officer of Trade Development Authority of Pakistan, Arif Ahmed Khan in his welcome note, informed that the Expo would continue for six months and participation of at least 25 million people from across the globe was expected in the event.\nThe Pakistan Pavilion, under the theme “The Hidden Treasure” with an attractive and inviting facade and an immerse walk through experience inside will showcase the country’s vast opportunities in tourism, commerce and investment to the millions of expected audience.\nShahid Abdullah and Noor jahan Bilgrami, shared details about the inner journey of the Pavilion and informed that Pavilion would be divided into eight spaces encompassing archaeological treasures, tourist and religious sites, handicrafts, natural resources, music, art, food, culture, modern industry and business and employment opportunities.\nThe Pavilion would offer virtual experience of Pakistan’s breathtaking landscapes, cultural and religious diversity, rich artisan traditions and strong economic potential, they said adding that through the six months there would be many cultural events and business seminars held in multipurpose halls of the pavilion.\nAt the occasion, Pakistan Pavilion and its logo for Expo 2020 Dubai were unveiled before the media.\nOfficials of TDAP, trustees from Patrons of Expo 2020 and advisory committee were also present at the occasion.",
  "retrievedAt": "2025-08-11T20:52:04.902Z"
}
