{
  "title": "Peaceful Afghan settlement to pave way for refugees’ repatriation: Qureshi",
  "link": "https://www.app.com.pk/national/peaceful-afghan-settlement-to-pave-way-for-refugees-repatriation-qureshi/",
  "date_published": "2021-06-20T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): As the international community observed World Refugee Day Sunday, Pakistan reiterated its call for greater global responsibility-sharing, redoubling of efforts for durable solutions, and an early peaceful political settlement in Afghanistan.\nForeign Minister Shah Mahmood Qureshi, in his message on the international day, said the peaceful political settlement in Afghanistan could pave the way for dignified, time-bound and well-resourced repatriation of Afghan refugees supported by the international community.\nHe said for over four decades, Pakistan has led by example in refugee protection and had been one of the world’s largest refugee hosting countries. Pakistan still hosts around three million Afghans providing them necessary protection, he added.\nHe said the people of Pakistan had demonstrated exemplary values of generosity, solidarity and compassion towards the refugees in the country, showcased in Pakistan’s inclusive policies on public health, education and livelihoods, including during the on-going COVID-19 response.\n“The people of Pakistan have contributed more than their fair share of shouldering an international responsibility by hosting millions of refugees. Pakistan has also been playing a key role in facilitating sustainable peace in Afghanistan,” the foreign minister remarked.\nHe said this year, the Day was being observed in the backdrop of unprecedented public health and socio-economic challenges posed by the COVID-19 pandemic. These challenges have exacerbated the vulnerabilities of those displaced by violence and conflicts, he added.\nQureshi said the Day served as an opportunity to take stock of the drivers of conflicts and reminds us to enhance investments in peace, conflict prevention and conflict resolution.\nHe said it was also an occasion to reiterate our common resolve for refugee protection, to match the generosity and share the responsibility shouldered by large refugee hosting countries.\nForeign Minister Qureshis said the pre-pandemic and COVID-compounded socio-economic and health challenges especially for developing countries that hosted millions of refugees necessitated global political and financial support to meet the needs of host communities and large refugee populations.\nOn this Day, he said Pakistan paid special tribute to the UNHCR for its commendable work with respect to advocacy, leadership and support to the refugees and host communities throughout the world, especially amidst the on-going pandemic.",
  "retrievedAt": "2025-08-11T20:52:08.832Z"
}
