{
  "title": "Global pandemic hits world economies, Pakistan no exception: PM",
  "link": "https://www.app.com.pk/national/global-pandemic-hits-world-economies-pakistan-no-exception-pm/",
  "date_published": "2022-01-23T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP): Prime Minister Imran Khan Sunday said that the global inflation and price hike of commodities triggered by sharp disruption in the supply and demand chain, due to Covid 19 pandemic, had affected all the countries of the world alike including Pakistan.\nIn a fifth session of “Aap Ka Wazir Azam Aap Key Sath’ programme, the prime minister said that post-Covid scenario sent the prices of vital commodities skyrocketing and Pakistan was not the only country in the world to bear the brunt of imported global price hike.\nAccording to PM Office Media Wing, the prime minister had held four such like live Tv sessions with the public last year. About 86 questions, 74 on telephone calls and 12 others via social media, were responded by the prime minister during these sessions.\nThe callers had raised different issues pertaining to corruption, land grabbing, inflation, coronavirus, Riyasat-i-Madina, etc., besides giving certain suggestions.\nThe highest participation in these sessions was made by the callers from Punjab province followed by Islamabad Capital Territory, Sindh and KPK. About 11 percent among these participants were overseas Pakistanis.\nMajor redressal of the public grievances included inheritance share of land as raised by a resident of Kohat, improvement of traffic system in Lahore, construction of RHC at a land donated by a resident of Sarai Alamgir for which the government of Punjab had allocated Rs30 million for the proposed scheme, waterlogging issue due to Gojra main drain in Faisalabad, stone crushing pollution issue at Ghora Gali, etc road, corruption in the utility store, passport issue at Pakistan embassy in Germany and initiation of criminal proceedings related to encroached land of an overseas Pakistani.\nIssuance of prompt directions and resolution of their grievances by the prime minister had been widely appreciated by the participants who had also expressed their acknowledgment and gratitude to the prime minister.",
  "retrievedAt": "2025-08-11T14:10:20.910Z"
}
