{
  "title": "Kashmir Press Club closure in Srinagar latest blow to media freedom in IIOJK",
  "link": "https://www.app.com.pk/national/kashmir-press-club-closure-in-srinagar-latest-blow-to-media-freedom-in-iiojk/",
  "date_published": "2022-01-23T16:29:00.000Z",
  "source": "APP",
  "content": "NEW DELHI Jan 23, (APP):  In Indian Illegally Occupied Jammu and Kashmir (IIOJK), a region mostly off-limits to foreign reporters and rife with communications blackouts and curfews, local journalists remained one of the few reliable sources of information, even as they operated under difficult conditions.\nAccording to an article of the Washington Post, this week, the Indian-run administration shut down the Kashmir Press Club in Srinagar, which had emerged in recent years both as a space for journalists to work and for them to express solidarity with colleagues facing pressure from the government.\nThe closure signals the dismal state of press freedom in Kashmir, journalists say.\n“It amounts to stifling the voice of journalists in the region,” said Ishfaq Tantry, a journalist and the general secretary of the club’s governing body, who called the government action “illegal.” The Editors Guild of India called the shutdown the “worst kind of state heavy-handedness” against independent media.\nA spokesman for the local administration did not respond to requests for comment.\nThe crackdown on local media is the latest restriction in the conflict-torn region, which has been roiled by increasing tensions since Prime Minister Narendra Modi’s government revoked its autonomy and statehood in August 2019. Elections to the legislative assembly have not been held since, and top political leaders are frequently detained. Groups working on human rights issues have been raided and activists jailed under stringent anti-terrorism laws.\nMany news outlets in India considered critical of the government face pressure from authorities, media watchdog bodies say, but journalists in Kashmir work in a far-more restrictive environment and face intimidation and harassment by police and security forces.\nIn the heart of Srinagar, the largest city in the region, a silver lock hung on the large black gate of the club this week. Journalists in city expressed dismay at the sudden move.\n“As a female journalist, [the club] was one of the few secure places where I could work and file stories without fear,” said freelance reporter Quratulain Rehbar, who writes for online news outlets.\nPeerzada Ashiq, a correspondent with the Hindu newspaper, said he drew a “sense of security” from the club. “Now, there is no cushion left to fall back on,” he said.\nNazir Masoodi, a journalist with New Delhi Television, wrote in a post that “the last bastion of free space in the Valley is gone.”\nIndia has a tense relationship with majority-Muslim Kashmir, where it has faced an armed insurgency for more than three decades. The region has been a flash point between archrivals India and Pakistan since the partition of the subcontinent in 1947 that created the two countries. They have previously gone to war over the region.\nThe pressure and scrutiny of the media in Kashmir mounted in the aftermath of the 2019 decision to revoke the region’s special status, which had given it certain autonomous powers, such as the right to make its own laws. Thousands of troops were flown in, and mobile and Internet services were cut off.\nForeign correspondents are not allowed to visit Kashmir without permission from the Ministry of Home Affairs in Delhi, and permission is rarely granted. Ashiq and Rehbar are among those who have been questioned by the police over their news reporting, and some others face investigation under anti-terrorism laws.\nIn a recent article, Rehbar described her interrogation as a “nightmare.”\n“They asked me, ‘What is your ideology? Who do you write for? How much do you earn? How many brothers do you have? Has anyone gone to Pakistan? What’s your Facebook ID?’ ” she wrote.\nIn 2020, the government issued new guidelines for the media, giving itself broad powers to determine whether news is false or prejudiced against India’s national interest.\nIndia’s Internet shutdown in Kashmir is the longest ever in a democracy.\nAlthough critics say successive governments have tried to control the media in Kashmir, this moment is different.\n“There is an attempt to wipe out any trace of independent press and turn whatever exists into a PR vehicle,” said Anuradha Bhasin, the executive editor of the Kashmir Times, one of the oldest dailies in the region. “That is extremely frightening.”\nThe newspaper was evicted from its government-allotted office space in 2020. Bhasin described the move as retaliation for her petition to the top court challenging the government’s Internet ban in Kashmir. That challenge paved the way for a relaxing of some restrictions.\nLocals have accused security forces of staging fake gunfights, using civilians as human shields, to cover up extrajudicial killings.\nReporting on these contentious encounters has landed journalists in jail. Sajad Gul, a 26-year-old journalism student writing for a local website, was arrested in early January, according to his family. That week, Gul had uploaded a video to Twitter showing a militant’s family shouting slogans critical of India. In a statement, the police said the video was “objectionable” and accused Gul of routinely spreading “false narratives” to provoke violence.\nLast week, after a court granted him bail, the police detained him under the Public Safety Act, which permits lengthy detentions. Critics call the law draconian. “I don’t understand much [about journalism], but I know he was just trying to tell stories,” said his brother, Zahoor Ahmed Dar. “I don’t think that is a crime in this",
  "retrievedAt": "2025-08-11T14:10:20.910Z"
}
