{
  "title": "Digital expert warns against misinformation, urges citizens to rely on official sources",
  "author": null,
  "content": "ISLAMABAD, May 9 (APP):Digital rights expert Nighat Dad advised citizens to be cautious of misinformation and rely on verified statements from government officials, encouraging people not to share unverified messages in groups as authorities closely monitor online activity.\nTalking to a private news channel expert stresses public awareness for the importance of responsible online behaviour, encouraging citizens to think critically about the content they consume and share.\nBy adopting a cautious approach, individuals can play a crucial role in mitigating the spread of false information, she added.\nNighat Dad pointed out that misinformation often spreads rapidly at night, when fact-checking and verification mechanisms may be less active.\nShe emphasized the need for citizens to remain vigilant and cautious, even in the evening hours to avoid spreading false information.\nDad recommends cross-checking information with trusted sources before passing it on to others, refraining from sharing suspicious or unverified content and being mindful of the potential impact of online actions.\nDigital rights expert asked to rely on official statements and verified platforms of government institutions and government officials to ensure accuracy and authenticity.\nShe emphasized for checking government websites, social media handles and official announcements to stay informed.\nShe emphasizes the importance of verifying information through official channels to maintain trust and credibility in the digital space.\nNighat Dad also highlighted that fake news is a significant issue in geopolitical contexts, where misinformation can have far-reaching consequences.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:18:12.486Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/digital-expert-warns-against-misinformation-urges-citizens-to-rely-on-official-sources/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T06:52:00.000Z"
}
