{
  "title": "SC dismisses PPP candidate’s election petition on technical grounds",
  "author": null,
  "content": "ISLAMABAD, May 09 (APP):The Supreme Court (SC) of Pakistan on Friday dismissed an election petition filed by Pakistan People’s Party (PPP) candidate Sardar Noor Ahmad Bangulzai against Jamiat Ulema-e-Islam’s (JUI) winning candidate Nawab Aslam Raisani from PB-37 (Mastung), citing technical shortcomings.\nA three-member bench, headed by Justice Shahid Waheed, heard the appeal challenging the election tribunal’s decision. During the proceedings, Advocate Wasim Sajjad argued that the tribunal’s order pertained to the PB-37 constituency, where the number of rejected votes was unusually high — enough to potentially alter the outcome of the election. He added that the Election Commission had denied the request for a recount.\nJustice Aamir Farooq remarked that the matter before the court was of a different nature, stating that the petition had been declared inadmissible because the submitted affidavit was not properly attested.\nWasim Sajjad contended that the affidavit had been attested by an Oath Commissioner. However, Justice Shahid Waheed noted that the affidavit lacked the official seal required under procedure, and that witness statements were also improperly submitted. He further stated that several Supreme Court precedents establish that improperly attested affidavits render election petitions inadmissible.\nWhen Sajjad argued that an affidavit, by nature, is a verified document, Justice Waheed replied that verification must follow due process and identity verification requires documentation like a national ID card. He emphasized that the petition failed to comply with established procedural rules.\nSajjad questioned why the court was focusing on technicalities and insisted that the petition simply requested a recount. However, Justice Waheed reiterated that the appeal was being dismissed due to its technical deficiencies.\nConsequently, the Supreme Court declared the election petition regarding PB-37 (Mastung) inadmissible. It is worth noting that Sardar Noor Ahmad Bangulzai of the PPP had approached the Supreme Court, alleging electoral fraud and seeking a recount.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:17:29.214Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-dismisses-ppp-candidates-election-petition-on-technical-grounds/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T12:00:00.000Z"
}
