{
  "title": "Bilawal meets PPP leaders from South Punjab, KPK",
  "author": null,
  "content": "ISLAMABAD, May 09 (APP):Leaders of the Pakistan Peoples Party (PPP) from South Punjab and Khyber Pakhtunkhwa called on PPP Chairman Bilawal Bhutto Zardari at Zardari House Islamabad on Friday  and conveyed to him the public sentiments regarding Indian aggression.\nBilawal Bhutto said that the people of Pakistan, rising above political, social, and provincial differences are united to confront Indian aggression.\nHe said that the nation stands firmly with the brave soldiers of the army, navy, and air force defending the country on the front lines.\nBilawal Bhutto emphasized that this is the time to set aside all differences and send a message of unity to the world.\nHe condemned the Indian government’s move to ban Pakistan’s social media accounts and media houses in an attempt to hide the truth saying that blocking all possible means to prevent Indian citizens from accessing the truth is a desperate and cowardly act that reflects the Indian government’s panic.\nThe PPP Chairman urged Pakistani youth to use social media to counter Indian media disinformation and bring the truth to the world.\nHe said that it is the time for every citizen to contribute to the defense of Pakistan according to their abilities.\nBilawal Bhutto instructed the PPP Khyber Pakhtunkhwa chapter to organize a rally in Peshawar on May 26 against Indian aggression.\nHe met with PPP Khyber Pakhtunkhwa General Secretary Shazi Khan, Deputy General Secretary Abrar Saeed, and President Hazara Division, Malik Farooq. Others who met him included District President Abbottabad, Syed Saleem Shah, District President Haripur Jehanzaib Khan, and District President Rawalpindi Iftikhar Shehzada.\nNational Assembly member Qasim Gilani, former National Assembly member Raza Rabbani Khar, PPP ticket holder from PP-215 Shakeel Labar, Moosa Labar, and Mian Khalid Hameed also held meetings with the Chairman.\nSecretary General PPP, Humayun Khan and Secretary General, PPP Parliamentarians Nayyar Hussain Bukhari were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:16:45.400Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/bilawal-meets-ppp-leaders-from-south-punjab-kpk/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T17:27:00.000Z"
}
