{
  "title": "India cannot act as judge, jury, & executioner: DG ISPR",
  "author": null,
  "content": "ISLAMABAD, May 09 (APP): Director General of Inter-Services Public Relations (DG ISPR), Lt Gen Ahmed Sharif Chaudhry said on Friday that India could not act as the judge, jury, and executioner in a case involving two states.\nIn an interview with TRT World, the DG ISPR said India has a habit of blaming Pakistan for terror incidents without evidence and using such claims for its internal political gains. He said this practice must stop.\nHe added that when the recent terror incident occurred, Pakistan responded logically by offering to conduct an independent and neutral investigation instead of exchanging blame. Pakistan firmly rejects the accusations and demands credible evidence to be shared with a neutral body, he added.\nHe said India ignored this offer and instead attacked six locations in Pakistan, including mosques and places of worship.\nThese attacks targeted innocent civilians—children, women, and the elderly—without any proof of who was responsible.\nAnswering a question, he said that Indian forces have been shelling across the Line of Control (LoC), often targeting civilians deliberately. In response, Pakistan is only engaging Indian military check posts that are firing across the border, using small arms.\nHe clearly said, “Pakistan is not using drones or launching any rocket attacks, absolutely not.”\nHe also said that India has created a false media narrative, claiming that Pakistan launched drone strikes and aircraft attacks across the border. He said this is entirely made up.\n“In modern warfare, everything leaves an electronic trace,” he explained. “If Pakistan had launched missile attacks, there would be clear evidence.”\nHe said Indian media was spreading false stories, including claims of downing Pakistani aircraft and capturing pilots, none of which is true. “India has taken control of international media and digital platforms, creating a non-stop stream of made-up stories. To us, it’s becoming laughable,” he added.\n“As I said earlier, when Pakistan takes action, the world will know. We don’t need Indian media to announce it.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:16:47.461Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/india-cannot-act-as-judge-jury-executioner-dg-ispr/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T15:03:00.000Z"
}
