{
  "title": "India supporting terrorism in Pakistan: DG ISPR",
  "author": null,
  "content": "RAWALPINDI, May 09 (APP): Director General Inter-Services Public Relations (DG ISPR) Lt Gen Ahmed Sharif Chaudhry on Friday accused India of actively supporting terrorism inside Pakistan.\nSpeaking to foreign journalists alongside Director General Public Relations (DGPR) of the Pakistan Air Force (PAF) Air Vice Marshal Aurangzeb Ahmed and Deputy Chief of the Naval Staff Operations Rear Admiral Raja Rab Nawaz, he said, “India is directly involved in terrorism in Pakistan.”\nHe also presented video evidence showing Indian government representatives supporting anti-Pakistan terrorist activities.\n“There are people in India who fund, train, and supply weapons to terrorists operating in Pakistan,” he added.\nThe DG ISPR said that several terrorists captured in Pakistan confessed to receiving funding, training, and support from Indian intelligence agencies.\nHe added that an audio tape revealed Indian officers admitting they had been operating a terror network in Lahore and Balochistan for years.\nHe said terrorist camps were running in India, adding that they were confessing that they were sponsoring terrorists in Balochistan. “India is involved in terrorism not only in Pakistan but also in Canada,” he added.\nHe said that New Delhi was supporting different terrorist groups in Pakistan, including “Fitna al Khawarij.” “The time has come to question the Indian government,” he added.\nThe DG ISPR further said that one of the objectives of the Pahalgam attack and the subsequent Indian actions is to divert Pakistan’s armed forces and security agencies’ attention from anti-terror operations in the country.\nHe said, “Government of Pakistan, its armed forces and security forces are on a daily basis, tightening the noose around India-sponsored terrorism. One of the objectives is to distract and divert the security agencies and armed forces from these counter-terrorist operations.”\nHe shared a video interview of a man from Balochistan who admitted to receiving support from India. Another clip featured a spokesperson of the banned Baloch Liberation Army (BLA) giving a live interview to Indian media during an attack on the Jaffer Express. “Indian media aired this interview and glorified the act of a terrorist group,” he said.\nDG ISPR questioned why Indian media was the first to broadcast the video of the Jaffer Express bombing, asking, “Where did the video come from, and who aired it first? It was India.”\nHe explained that the attack happened around 1 p.m., and the footage was broadcast almost immediately, proving a link between the terrorists and Indian media.\nWhile briefing on the Pahalgam incident, he said India accused Pakistan of involvement without presenting any solid proof.\nProviding details of the way the Indian media blamed Pakistan shortly after the Pahalgam attack on April 22 without any evidence, the DG ISPR maintained that India had adopted a similar stance in the past as well. “Is this the first time India is doing this? There is a history to it,” he said.\n“How did the Indian government jump to the conclusion regarding who the attackers were within 10 minutes of the incident? When you don’t have any evidence, what do you do? You open up the military front.”\nHe went on to say that India was shifting the blame for the attack on Pakistan to divert attention from its internal problems. He said that India launched attacks on Pakistan and targeting civilians, including women and children.\n“The attack ended at 2:20 p.m., and by 2:30 p.m., the FIR was already filed. That means within 10 minutes, police investigated and concluded Pakistan was involved. This is not humanly possible,” he said.\nHe added that Indian social media accounts started blaming Pakistan by 3:00 p.m., even though no evidence had been presented. “Where is the proof? Where did they get it so fast?” he asked.\nThe DG ISPR said that India has “no evidence” for its allegations of Pakistan’s involvement in the Pahalgam attack.\n“You just concoct stories. I think the time has come to ask the real and bitter questions that Indian government needs to stop living in cinema and theatrics.”\nHe said Indian forces had carried out attacks across the Line of Control (LoC), especially targeting residential areas and mosques at night. “This reflects the extremist mindset of the Modi-led government,” he added.\nHe also played videos of Indian citizens and politicians questioning their government’s narrative and security failures in Indian Illegally Occupied Jammu and Kashmir (IIOJK). Even their own people are raising questions, but the government has no answers, he added.\nDG ISPR said India has a history of blaming Pakistan for attacks to serve political purposes. “They use terror incidents for domestic political gains and then kill innocent Kashmiris and Muslims, labelling them as terrorists.”\nHe also played an interview of a former Indian governor of IIOJK, who blamed the Indian government for orchestrating the Pulwama incident.\n“India must stop blaming Pakistan without proof,” the DG ISPR said. “If there is any real evidence, bring it before an independent, neutral commission for investigation. No country has the right to be the judge, jury, and executioner.”\nHe also revealed that two days after the Pahalgam incident, Indian media falsely reported that two Pakistani terrorists were killed during an infiltration attempt. “They were over 50-year-old civilians from a divided village in Azad Kashmir. Fake weapons were planted to present them as terrorists.”\n“These kinds of fake encounters happen regularly. India murders innocent people and labels them as terrorists while the world watches,” he added.\nLt Gen Chaudhry said India banned thousands of social media accounts, including those based in Pakistan, to control the narrative and prevent people from hearing the truth.\nThe DG ISPR has said that the military has neutralised 77 Israeli drones sent by India so far. “We are taking each one of them out. Not one of them has been able to go back to India, and not one of them will be able to go back.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:16:25.572Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/india-supporting-terrorism-in-pakistan-dg-ispr/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T17:15:00.000Z"
}
