{
  "title": "Lawmakers condemn Indian aggression, reaffirm support for armed forces",
  "author": null,
  "content": "ISLAMABAD, May 09 (APP):The legislators in the National Assembly on Friday paid tributes to armed forces, especially Pakistan Air Force (PAF) for giving swift and decisive response to Indian aggression.\nSpeaking in the House, they strongly condemned the cowardly attack by India, calling it a shameful act and Pakistan is fully prepared to respond to any aggression with full force.\nInitiating the debate, Pakistan People’s Party Parliamentarians (PPPP) lawmaker Sadiq Ali Memon strongly condemned the recent Indian military attacks carried out under the cover of darkness and called it a provocative act aimed at destabilizing regional peace.\nHe paid tribute to the Pakistan armed forces, particularly PAF for their swift and effective response including the successful downing of a modern Indian Rafale fighter jet and drones.\nMemon said Pahalgam incident is a “false flag operation” designed to malign Pakistan without presenting any credible evidence by Modi-led Indian government.\nHe said Pakistan’s armed forces are highly professional and fully prepared to counter any hostile actions and always ready to defend the nation against external threats.\nMemon said India is sponsoring terrorism within Pakistan and committing gross human rights violations, including acts of genocide, in Indian-Illegally Occupied Jammu & Kashmir.\nMuttahida Qaumi Movement-Pakistan (MQM-P) leader Sanjay Perwani has condemned India’s attack against innocent civilians and mosques inside Pakistan under the cover of darkness.\nHe said that India is responsible for spreading violence and unrest in the region.\nSanjay Perwani said minorities in India continue to face increasing atrocities under the Modi-led government.\nOn the other hand, minorities in Pakistan enjoying complete freedom and living with dignity and without fear, he added.\nHe advocates for peace in the region and added that this desire should not be mistaken for weakness.\nHe reaffirmed the unwavering support of Pakistan’s minority communities for the armed forces, adding that minorities including Hindus, Christians and others stand firmly with their armed forces.\nPTI legislator Shahid Ahmed Khattak stressed the need of national unity and cohesion during this challenging time, and condemned the coward enemy’s aggression, targeting civilians and places of worship.\nHe said that unity among the people and unwavering support for the armed forces are essential to effectively counter any aggression.\nKhattak said the India is a terrorist state which is carrying out widespread atrocities in Kashmir.\nJamiat-i-Ulema Islam-Fazl (JUI-F) MNA Maulana Misbah uddin said India has never accepted the existence of Pakistan and consistently trying to inflict harm to us.\nHe condemned the latest wave of cowardly attacks, targeting of innocent civilians and places of worship.\nThe lawmaker praised the swift and courageous response of the armed forces, reaffirming the nation’s collective resolve in the face of such provocations.\nMisbah uddin said that Pakistan seeks peace and does not desire war; however, if war is imposed upon the nation, it will respond with full force and unwavering determination.\nExpressing unwavering solidarity with the armed forces, he vowed that every drop of Pakistani blood spilled would be avenged.\nPTI senior leader Asad Qaiser said that throughout history, whenever Pakistan has faced external threats, the nation has always come together in unity.\nHe said the leadership and workers of Pakistan Tehreek-e-Insaf (PTI) stand firmly with the country’s valiant armed forces.\nAsad Qaiser also noted that lawmakers across party lines have demonstrated solidarity by unanimously passing a resolution in the National Assembly.\nPPP lawmaker Haji Rasool Bux Chandio condemned India’s illegal aggression, targeting civilians and mosques inside Pakistan and said these acts are clear violations of international law.\nHe said that Pakistan’s armed forces have delivered a powerful and decisive response, forcing the adversary into retreat and leaving them in a state of concealment.\n“The arrogance of India had been shattered by the Pakistan army. From now on, they will think a hundred times before taking next step,” he said.\nPTI leader Sana Ullah Khan Mastikhel strongly condemned the Indian aggression and also criticized India’s repeated use of false flag operations, pointing in particular to the intelligence failure in Pahalgam.\nHe said that despite the presence of over 700,000 Indian troops in Kashmir, the incident was a clear result of their own security failures.\nMastikhel said Pakistan is victim of terrorism, also highlighted the immense sacrifices rendered by Pakistan in the fight against terrorism, with over 80,000 lives lost.\nPaying tribute to Pakistan’s armed forces, Mastikhel praised their prompt and effective response to Indian provocations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:17:47.328Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/lawmakers-condemn-indian-aggression-reaffirm-support-for-armed-forces/",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T10:56:00.000Z"
}
