{
  "title": "NA approves motion to hold Constitution’s golden jubilee celebrations at Assembly Hall",
  "link": "https://www.app.com.pk/national/na-approves-motion-to-hold-constitutions-golden-jubilee-celebrations-at-assembly-hall/",
  "date_published": "2023-04-07T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP): The National Assembly on Friday unanimously approved the motion to allow the use of the chamber of the National Assembly to hold the golden jubilee celebrations of the Constitution of Pakistan 1973.\nSpeaker, National Assembly, Raja Pervez Ashraf during the 51st session of the lower house after concluding the question hour session apprised the House that 10th April was a historic day as the first Islamic, Federal and Parliamentary Constitution of Pakistan of 1973 was unanimously passed by this August House.\nHe added that a special parliamentary committee constituted under the chairmanship of Senator Mian Raza Rabbani prepared an elaborate and well-planned programme to mark one-month-long celebrations across the country. The golden jubilee celebrations will commence from April 10 at the Parliament House.\nRaja Pervez said constitutional leaders from all the provinces, vice-chancellors of the universities, political workers and activists, students, members of civil society and other stakeholders would attend the event.\n“All the members from the opposition and treasury benches should ensure their presence on this occasion to transfer this legacy and apprise the youth the next generation of our country on the significance of the Constitution,” the National Assembly Speaker said.\nHe requested the Minister for Parliamentary Affairs, Murtaza Javed Abbasi to move the motion intended to allow the National Assembly chamber for holding the event.\nThe Minister started reading out the motion loud, “Under rule 288 of the Rules of the Procedure and conduct of the business in the National Assembly, 2007 that the requirement of rule 290 of the said rules be dispensed within order to the use of chamber of National Assembly on April 10 to commemorate the golden jubilee of the constitution of Pakistan 1973 after sitting of National Assembly and before the commencement of the joint sitting on that day.”\nThe Speaker put the motion to the House for its consent which was adopted unanimously.",
  "retrievedAt": "2025-08-11T08:14:16.372Z"
}
