{
  "title": "Speaker sends issue declaring IK more popular than Quaid to Privilege Committee",
  "link": "https://www.app.com.pk/national/speaker-sends-issue-declaring-ik-more-popular-than-quaid-to-privilege-committee/",
  "date_published": "2023-04-07T10:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP):Speaker, National Assembly Raja Pervez Asharf on Friday sent an issue declaring Imran Khan more popular than Quaid-e-Azam Muhammad Ali Jinnah to the Committee of Rules of Procedure and Privileges.\nOn a point of order, Member National Assembly (MNA) Sheikh Rohale Asghar said that a media person in a vlog mentioned Orya Maqbool Jan’s comparison of the great leader and founder of the nation Quaid-e-Azam Muhammad Ali Jinnah with Imran Khan which was unjustified and deplorable.\n“Quaid-e-Azam Muhammad Ali Jinnah is the undisputed personality of the nation. No one can be matched with Quaid-e-Azam Muhammad Ali Jinnah who despite illness and various challenges had made an independent homeland for the Muslims of the subcontinent,” he added.\nHe said, “It is a wake up for all, the person who remembered the Quaid like this must be dealt with iron hands”.\nThe MNA said, “How Orya Maqbool Jan can dare to make a comparison of Quaid-e-Azam Muhammad Ali Jinnah with a person who is trying to destroy Pakistan?”\nHe suggested that the privilege committee should call him (Orya Maqbool Jan) and give him an exemplary punishment so no one can in future dare say such words about the father of the nation.\nThe speaker said that the sentiments expressed by MNA Sheikh Rohale Asghar were also shared by the 220 million people as Orya Maqbool has hurt the sentiments of the whole nation, adding, “This is a very serious issue, I hereby refer the matter to the privilege committee.”\nMNA Saira Bano also endorsed the issue raised by Sheikh Rohale Asghar and said that respect for Quaid-e-Azam must be ensured.\nShe also urged the Speaker to call ANP Senator Haji Hedayatullah who also passed disrespectful remarks for Mr Jinnah. However, the Speaker requested the MNA that the Lower House was responsible for its own matters and therefore, it should not meddle into the matters of the Upper House which was a separate part of the Parliament.",
  "retrievedAt": "2025-08-11T08:14:22.052Z"
}
