{
  "title": "Mockery of Constitution, law must come to an end: Marriyum",
  "link": "https://www.app.com.pk/national/mockery-of-constitution-law-must-come-to-an-end-marriyum/",
  "date_published": "2023-04-07T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 07 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Friday said there should be an end to the mockery of Constitution and law for charting the country on path of progress and development.\nAddressing a news conference, the minister said Justice Athar Minallah’s decision had left “no doubt over the credibility of the verdict of the three-member bench of Supreme Court in a case related to delay in the Punjab elections”.\n“Today Justice Athar Minallah of the Supreme Court gives a major decision which not only raises a question over the proceedings of the court in the suo motu case for delay in Punjab elections, but also categorically states that he had not distanced, recused and disassociated from the bench,” she said while citing various parts of his dissenting note.\nShe said Justice Athar Minallah had not only expressed disagreement with his brother judges but also dismissed the petition by declaring it inadmissible.\nMarriyum said the three-member bench was constituted on a petition which was dismissed by the majority of judges. “Why the bench was formed on the petition which was dismissed and how can a decision be given on a petition which does not exist?” she asked.\nThe minister said not only the major political parties called for a full court bench on the Punjab polls’ issue, but it was also the opinion of four SC judges, who stated that the case had become “controversial” and it was imperative to form the full court bench in order to maintain people’s trust in the courts.\nShe said political parties did not run away from the election but “the decisions which are imposed to solidify a political ideology and usher in a constitutional crisis cannot be accepted”.\n“How can the chief justice form another bench to hear a petition which was dismissed by majority of the judges of earlier bench?” she questioned.\nMarriyum asked as to why the major political parties were not heard by the court, while Asad Umar was called to get a briefing on economy.\nShe said the counsel for 13 parties were not given an audience by the apex court and even their attendances were not marked. It was injustice, “which is unacceptable”, she remarked.\nThe minister said the dissenting note of Justice Minallah had completed the decision given by the other three judges for dismissing the petition on Punjab polls. “If the Constitution calls for holding election in Punjab within 90 days then why it is silent in the case of Khyber Pakhtunkhwa.”\nShe said the Parliament termed the decision “an interference into its affairs”, while Justice Minallah stated that suo motu notice should be taken by keeping intention of a petition in mind. In the instant case, the petitioner was “a foreign agent, a thief of wrist watches and a person who did not even declare his own daughter”.\nMarriyum said the decision of the three-member bench was “unconstitutional and against the law”. How people could accept a decision which was unacceptable to the senior judges, she remarked.\nTo a question, the minister said Imran Khan had staged a drama over the cipher to create political and economic instability in the country. How the letter of Imran Khan (for disqualifying his party legislators) could be accepted while the same was rejected in case of Chaudhry Shujaat Hussain, she added.\nShe regretted that Nawaz Sharif was disqualified by the court in 2017 by borrowing a definition from the Black’s Law dictionary.\nShe said the politicians were blamed for the problems faced by the country, but conspiracies were hatched against them when they made efforts to rectify the situation. The mockery of the Constitution and law must now come to an end, she added.\nThe minister said elections should be held across the country simultaneously.She said the Pakistan Tehreek-e-Insaf leaders had nothing to do with the country and elections as “this group of platters” was bent upon spreading chaos and anarchy.\nTo a query, she said the PTI government’s wrong policies revived terrorism which was wiped out from the country under the leadership of Nawaz Sharif who united the nation against the scourge and worked out a National Action Plan for the purpose.\nShe regretted that the PTI government failed to upgrade the Counter-Terrorism Department in Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T08:14:11.205Z"
}
