{
  "title": "Extremist Hindutva ideology raises ugly head as militants set on fire house of Salman Khurshid",
  "link": "https://www.app.com.pk/national/extremist-hindutva-ideology-raises-ugly-head-as-militants-set-on-fire-house-of-salman-khurshid/",
  "date_published": "2021-11-16T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): The extremist Hindutva ideology raised its ugly head again as Hindu militants attacked and set fire to the home of a former Indian foreign minister, police said, in the latest incident of religious violence that critics say has been inflamed under Prime Minister Narendra Modi.\nSalman Khurshid, a Muslim from the main opposition Congress party, published a book last month in which he compared the kind of Hindu nationalism that has flourished under Modi to extremist Islamic groups like ISIS.\nPolice said a mob of around 20 people from a hardline local Hindu group massed outside Khurshid’s house near the northern city of Nainital on Monday.\nAccording to the Turkish news media, the Hindu mob attacked and set fire to the home of Muslim former Indian FM Salman Khurshid.\n“Critics say religious violence has increased since Modi’s Hindu nationalist party came to power in 2014,” TRT said.\nVisuals shared by Mr Khurshid on Facebook show tall flames, charred doors, and shattered window panes at his Nainital home. Two men are seen trying to douse the fire by throwing water.\nSharing the visuals, the Congress leader said in a post, “I hoped to open these doors to my friends who have left this calling card. Am I still wrong to say this cannot be Hinduism?”\nThe Times of India reported that the group had set fire to an effigy of Khurshid, fired shots and threatened the daughter-in-law of the caretaker with a gun.\nKhurshid, who served as foreign minister from 2012-14, was away with his family at the time of the incident but posted images of the aftermath of the attack on social media.\n“Shame is too ineffective a word,” Khurshid, 68, said on social media.\nActivists say that religious minorities in Hindu-majority India have faced increased levels of discrimination and violence since Modi’s Hindu nationalist Bharatiya Janata Party (BJP) came to power in 2014.\nIn 2020, the US Commission on International Religious Freedom listed India as a “country of particular concern” for the first time since 2004.\nThe Hindutva – an extremist ideology – has made life miserable for the minorities in India particularly Muslims who on daily basis are facing torture, harassment and different forms of discrimination.\nFor decades the Hindutva ideology had spread its tentacles in foreign countries. As far back as 2002, British Channel 4 News telecast an alarming report about rising of Hindutva in Britain. The below Channel 4 News report led to a Hindutva charity losing its registration. However, a further Charity Commission investigation in India was blocked by the Foreign & Commonwealth Office at the time.",
  "retrievedAt": "2025-08-11T21:36:46.853Z"
}
