{
  "title": "Govt committed to provide relief to people: Ali Muhammad",
  "link": "https://www.app.com.pk/national/govt-committed-to-provide-relief-to-people-ali-muhammad/",
  "date_published": "2021-11-16T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP):Minister of State for Parliamentary Affairs, Ali Muhammad Khan on Tuesday said that the government was making all-out efforts to provide relief to the people.\nWhile responding to a question in the Senate, the minister said that Pakistan Tehreek-e-Insaf (PTI) government had launched different projects to provide relief to the poorest of the poor.  He was responding to a question of Senator Afnan Ullah Khan on status of BISP, Ehsaas Emergency Cash program and other social welfare projects.\nHe said the government never denied the fact that the surveys conducted by the past regimes were 100 percent wrong.  All the governments try to provide relief to the poor but, there were some reservations as there were some issues and the workers of the political parties were provided benefits, he added.\nAli Muhammad informed that further survey work was being completed and the government wanted to include all poorest of the poor to provide relief and financial assistance. He informed that the government had launched a project worth Rs 120 billion to provide subsidized essential food items including wheat flour, ghee and pulses to the citizens.\nAli Muhammad said that due to solid steps taken by the government, poverty was reducing in the country, adding, there was misconception about poverty. He also admitted that inflation had increased in the country.\nThe Minister said, the government had also launched ‘Kamyab Pakistan Programme’ which is a mega project worth Rs 1600 billion. It is a brain child of the Prime Minister, to provide interest free loans to male and female unemployed youngsters to start their own businesses, he added.\nUnder the programme, the youngsters were being provided Rs 500,000 to 10 million interest free loans to start new businesses, he said.\nThis programme would help eliminate poverty and unemployment in the country, he added. The Minister of State said, such projects would not only help make the citizens self-sufficient but, they would also employ other unemployed persons.\nSpecial Assistant to the Prime Minister on Youth Affairs, Usman Dar and Senator, Dr. Sania Nashtar were supervising the projects to make the youngsters self-sufficient and make them useful citizens of the country, he added.\nAli Muhammad said that the government had also launched some other projects for deserving and poor people as poorest of the poor people need attention of the government not only in developing countries rather in developed nations.",
  "retrievedAt": "2025-08-11T21:36:41.394Z"
}
