{
  "title": "S.M. Hali’s Tormented Truth objective, honest analysis of 1971 War: Gen Ehsan",
  "link": "https://www.app.com.pk/national/s-m-halis-tormented-truth-objective-honest-analysis-of-1971-war-gen-ehsan/",
  "date_published": "2021-11-16T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP):Former Chairman Joint Chiefs of Staff (CJCSC) Lieutenant General (R) Ehsan Ul Haq on Tuesday paid tributes to Group Captain (R) Sultan Mehmood Hali for his objective and honest analysis of the history of fall of Dhaka in his book Tormented Truth 1971 & Beyond.\nAddressing the Book launching ceremony of S.M. Hali’s Tormented Truth 1971 & Beyond organised by Institute of Strategic Studies Islamabad (ISSI) as chief guest said it was a brilliant effort by the author and a good initiative to write on the subject which was misrepresented and false quoted by the country enemies.\nGeneral (R) Ehsan said it was a challenging task and the most readable and knowledgeable book which was a myth buster for the readers misguided through propaganda and fabricated facts.He added that this knowledge should be passed on further to coming generations. The perilous Indian existential threat to Pakistan was still prevailing after 1971, he added.\n“We will have to keep on reinforcing our counter narrative with factual information to keep our youth and intellectuals abreast with the reality and truth for impartial discourse and analysis,” the former CJCSC said.\nHe mentioned that the separation of East Pakistan could have never succeeded despite all machinations of India but it only got happened due to huge physical distance of West Pakistan.Director India Study Centre (ISC) of the Institute Brigadier (R) Dr Saif ur Rehman Malik delivered the welcome note and briefed the participants the Centre was established in 2020 to carry out study of multiple aspects of India and develop policy guidelines.\nHe said the Centre was launching the third book from its platform and congratulated S.M. Hali who had contributed 13 books and the famous national song ‘Shaheed ki Jo maout ha wo qaum ki Hayat ha’ (the death of a martyr instills life into a nation).\nSpeaking on the occasion, DG ISSI Ambassador (R) Aizaz Ahmed Chaudhry said this subject had not really been written much and every Pakistani felt the painful impacts of the event of 1971.\nHe said Prime Minister Sheikh Haseena Wajid had used some of the historical facts to target Jamaat e Islami leadership in Bangladesh. She also stated erroneous facts at the UN to blame Pakistan Army for killing innocent people and raping women in larger number during the conflict which were wrong when researched and thoroughly found out, he regretted.\n“Bangladesh is a reality and we should accept and respect it as a state. S.M. Hali has made another effort to bring honest scholarship before the readers to bring genuine facts,” he said while appreciating the author.\nA short video pictorial was also presented giving the Book’s brief overview.Author of the Book, Group Captain (R) S.M. Hali said he was indebted to Allah Almighty for touching the subject like 1971 and would keep it to his readers to decide the title’s aptness. He added that for him and many Pakistanis had felt East Pakistan Separation as tormented.\nHali thanked all peers for supporting and expressing solidarity with him and also Army Institute of Military History who also supported in this cause.\nHe told APP that during the past 50 years India and other country enemies had generated plethora of false information on the matter of 1971 War and considered it his responsibility to write an objective and thoroughly genuine account of the history behind the tragedy.\n“I realised that truth has to be revealed for objective historical picture of the events.We want to forgive and forget and want to be friends with Bangladesh but history needs to be corrected,” he said.\nLet us move forward with peace and forget the fenzy that cost to much lives with the message of friendship,” he concluded.\nFormer Senator Javed Jabbar also extended his felicitations to the author and said Sultan Mehmood Hali was a wonderful writer and intellectual and also a prolific writer.\nHowever, the title of his book was so apt as 1971 forever would be a source of stirring memory, he added.\n“He has made a very extensive and research based work. It is a welcome addition to all the previous works written on the topic,” he said.\nJabbar said that the tragedy of 1971 led to the creation of Bangladesh but it did not reject the Muslim nationalism in South Asia as Bengali’s emerged as a proud Muslim state.",
  "retrievedAt": "2025-08-11T21:36:49.484Z"
}
