{
  "title": "AJK PM urges world to end silence over plight of innocent Kashmiris in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-pm-urges-world-to-end-silence-over-plight-of-innocent-kashmiris-in-iiojk/",
  "date_published": "2021-11-16T14:39:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK), Nov 16 (APP):Azad Jammu and Kashmir Prime Minister Sardar Abdul Qayyum Niazi on Tuesday said India was violating the political and religious rights of Kashmiris besides committing massive human rights abuses in IIOJK blatantly defying Global norms and commitments in the Internationally acknowledged disputed territory.\nThe Prime Minister expressed these views while talking to Chairman Kashmir Committee Shehryar Afridi who called on him at Jammu and Kashmir House in the federal metropolis.  Niazi said Central Jamae Maosque in occupied Srinagar was constantly lying closed for a long and the cowardly Indian army was terrorizing the Kashmiris.\nHe said the Prime Minister of Pakistan Imran Khan has projected Kashmir issue effectively in its true perspective internationally and has also mobilized the Islamic Ummah  for resolving the Kashmir dispute to establish lasting and durable peace in the region.\nNiazi said  more than  one hundred  youths were martyred  by the Indian forces while  many innocent civilians had gone missing during the so-called search operations conducted by the Indian army.   He said India was constantly violating human rights in occupied Kashmir and  attempts were  being made to promote Hindutva on which the United Nations and human rights organizations were observing silence, which they should immediately end.\nHe said Indian forces had intensified the reign of terror in occupied Kashmir  to crush the indigenous freedom movement launched by the people of occupied Kashmir for attaining their fundamental right to self determination.  He said India was engaged to reduce the Muslim population in  occupied Kashmir while the  Hurriyat leaders had been put behind the bar  and all atrocities were being perpetrated to suppress their voices.\nThe Prime Minister Sardar Abdul Qayyum Niazi said freedom movement was enlightened by the blood of martyrs which no power of the world could suppress. The Chairman of the Kashmir Committee Shehryar Afridi reiterated his commitment that Pakistan would continue to provide political, moral and diplomatic support to Kashmiris in attaining their right to self determination.\nUnder the leadership of Prime Minister  of Pakistan Imran Khan, they would continue to highlight the case of Kashmir at every international  forum. He highly commended the supreme sacrifices offered by the Kashmiri people for the liberation of occupied Kashmir.  He expressed hope that long night of terror and repressions would soon end and Kashmiri would ultimately get their fundamental right to self determination.",
  "retrievedAt": "2025-08-11T21:36:47.046Z"
}
