{
  "title": "Pakistan, China to explore avenues of collaboration in poverty alleviation",
  "link": "https://www.app.com.pk/national/pakistan-china-to-explore-avenues-of-collaboration-in-poverty-alleviation/",
  "date_published": "2021-11-16T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): Chinese Ambassador to Pakistan, Mr. Nong Rong  in a meeting with the Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar held here Tuesday explored avenues of collaboration in poverty alleviation.\nOn the Cooperation for Poverty Alleviation in the field of commerce, the Poverty Alleviation and Social Safety Division (PASSD) of the Government of Pakistan and Ministry of Commerce of China are entering a memorandum of understanding (MoU).\nThe MoU has been approved by the Federal Cabinet on October 27, 2021 and will be inked soon between China and Pakistan. The meeting discussed the implementation arrangements of the MoU.\nChina and Pakistan are all-weather strategic partners. Under the MoU, both the countries will enhance cooperation and exchange of experience, especially in the context of poverty reduction, through leveraging potential for commerce. The Chinese side is led by Ministry of Commerce and Pakistan’s side by PASSD.\nThe Chinese side will take advantages of commerce in connecting urban and rural areas, linking home and abroad, matching production and marketing, focus on the exchange of experience on developing poverty alleviation industries, creating employment opportunities, promoting the domestic and foreign trade in poverty-stricken areas, and thus helping to eradicate poverty in the strategy of precise poverty alleviation and eradication, to help Pakistan expand its vision and innovate its method for poverty alleviation, promote better economic and social development in Pakistan.\nBoth countries will also establish a communication mechanism to exchange poverty alleviation experience in the field of commerce under the framework of China Pakistan Joint Economic and Trade Committee. Also, regular exchanges will be organized on the implementation mechanism, management mode and main effectiveness of commerce-based poverty alleviation to promote programmatic cooperation.\nDr. Sania appreciated great achievements and experience of China in poverty alleviation. “Poverty Alleviation is the priority of the government of Pakistan. This MOU will enable Pakistan to learn from China’s experience in poverty alleviation and to disseminate lessons from Ehsaas, which is a multisectoral programme for alleviating poverty”, said Dr. Sania.\nThe Chinese Ambassador was accompanied by Guwen Liang, the Second Secretary; Fengguanlei; and Chenyongpei from Commercial section. Muhammad Ali Shahzada; Secretary PASSD, Saman Muneeb, Director CPEC, Ministry of Foreign Affairs also joined the meeting.",
  "retrievedAt": "2025-08-11T21:36:42.579Z"
}
