{
  "title": "Roshan Digital Account attracts $9.5bn - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The inflows through Roshan Digital Account (RDA) reached $9.564 billion, most of which were utilised domestically.\n\nThe State Bank’s latest update showed that the RDA gross inflows reached $9.564bn as of Jan 31.\n\nOut of the total received deposits, $1.711bn had been repatriated, while $6.052bn was utilised locally. With this, net repatriatable liability remained at $1.8bn.\n\nPakistan launched RDA in 2020 after outflows of over $4bn from the treasury bills and Pakistan Investment Bonds (PIBs) due to the outbreak of Covid-19. However, it could not replace the early investment in the domestic bonds and the size of inflows remained small.\n\nBankers and experts believe that overseas Pakistanis investing in different categories of state-backed securities have been facing a trust deficit as the government could not end the political uncertainty persistent for the last three years to bring economic stability.\n\nPakistan’s need for dollars is much greater than the inflows coming through the RDA. Despite the record remittances, the debt servicing of foreign loans is still the biggest problem. The market sources said that the key objective of President Zardari’s recent visit to China aimed at securing a debt rollover.\n\nNo breakup was available, but the market sources said that by the end of June 2025, about $9bn in Chinese debt would mature.\n\nThe country’s reserves are insufficient to repay this debt, and even partial use of SBP’s current forex holdings could destabilise the exchange rate.\n\nRevised buyback rules\n\nThe State Bank of Pakistan (SBP) issued revised rules on Tuesday for the buyback of government securities, which will supersede the earlier instructions.\n\nAccording to a new circular, the State Bank will conduct auctions for the “buyback” of government securities, including MTBs and PIBs (zero coupon, fixed and floater) on behalf of the Government of Pakistan.\n\nThe SBP will announce the details, such as security, target amount, auction schedule, etc., and auction results for the buyback of government securities on SBP pages at Refinitiv and Bloomberg and the SBP website, said the circular.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:31:59.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891419/roshan-digital-account-attracts-95bn",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:51:47.000Z"
}
