{
  "title": "Trump fires USAID inspector general: reports - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump has fired the independent inspector general for the US Agency for International Development (USAID), US media outlets reported on Wednesday.\n\nPaul Martin’s dismissal came a day after his office issued a report critical of the Trump administration’s efforts to dismantle the agency, the Washington Post, CNN and others reported.\n\nThey cited a two-sentence email from the White House sent on Tuesday to Martin telling him his position was “terminated, effective immediately”, but with no explanation of the reasons for the decision.\n\nHis office’s report had warned that more than $489 million in food assistance was at risk of spoilage or potential diversion after the Trump administration implemented an aid freeze and stop-work order.\n\nThe report said it had long “identified significant challenges and offered recommendations to improve Agency programming to prevent fraud, waste, and abuse”.\n\n“However, recent widespread staffing reductions across the Agency…coupled with uncertainty about the scope of foreign assistance waivers and permissible communications with implementers, has degraded USAID’s ability to distribute and safeguard taxpayer-funded humanitarian assistance.”\n\nTrump had already fired 18 inspectors general, who are independent watchdogs of the federal government, but Martin — appointed by Trump’s predecessor Joe Biden — had remained in place.\n\nTrump, who began his second term last month, has launched a crusade led by his top donor Elon Musk, the world’s richest man, to downsize or dismantle swaths of the US government.\n\nThe most concentrated fire has been on USAID, the primary organisation for distributing US humanitarian aid around the world with health and emergency programs in around 120 countries.\n\nUSAID manages a budget of $42.8 billion — representing 42 per cent of humanitarian aid disbursed worldwide.\n\nIt was seen as a vital source of soft power for the United States in its struggle for influence with rivals including China.\n\nThe Trump administration has frozen foreign aid, ordered thousands of internationally based staff to return to the United States, and begun slashing the USAID headcount of 10,000 employees to around only 300.\n\nLabor unions are challenging the legality of the onslaught. A federal judge ordered a pause on Friday to the administration’s plan to put 2,200 USAID workers on paid leave by the weekend.\n\nDemocrats say it would be unconstitutional for Trump to shut down government agencies without the legislature’s approval.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1215194717adbaf.jpg",
  "retrievedAt": "2025-08-25T19:31:32.879Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891496/trump-fires-usaid-inspector-general-reports",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T10:21:38.000Z"
}
