{
  "title": "IMF chief meets PM Shehbaz, pledges support for govt’s actions - Pakistan - DAWN.COM",
  "author": null,
  "content": "The International Monetary Fund (IMF) Managing Director Kristalina Georgieva has met Prime Minister Shehbaz Sharif during his visit to the United Arab Emirates and assured him of the lender’s support for the government’s decisive actions regarding the programme, according to a statement released on Wednesday.\n\nIn a post on X, she said, “Wonderful to meet Prime Minister @CMShehbaz and his team.”\n\n“I am encouraged by their strong commitment to Pakistan’s IMF-supported reforms and support their decisive actions to pave the way to higher growth and more jobs for Pakistan’s youthful population.”\n\nThese comments come amid the IMF team’s visit to the country for a week-long scrutiny of the judicial and regulatory system as part of the ongoing $7 billion Extended Fund Facility (EFF) to address governance and corruption vulnerabilities.\n\nAccording to a statement from the Prime Minister’s Office (PMO), the premier held a meeting with the IMF chief on the sidelines of the World Governments Summit (WGS) 2025 in Dubai, where both sides discussed Pakistan’s ongoing IMF programme and the macroeconomic stability achieved through the government’s comprehensive reform agenda.\n\nFurthermore, the meeting focused on Pakistan’s commitment to implementing structural reforms and maintaining fiscal discipline, “which had been instrumental in restoring economic stability and would be critical in driving sustainable growth”.\n\nThe prime minister talked about the progress made under the programme, attributing the economic progress to the bailout deal.\n\nFurthermore, he reaffirmed the government’s resolve to sustain reforms, particularly in tax reforms, energy sector efficiency, and private sector development.\n\nThe IMF chief commended the country’s efforts “in effectively implementing the IMF-supported programme, highlighting the country’s improving economic performance with rising growth and declining inflation,” per the statement.\n\nShe recognised that Pakistan was “on the path to growth and has undergone economic recovery”, further reiterating the IMF’s support for its reform agenda.\n\nThe premier was in the UAE alongside Foreign Minister Ishaq Dar on a two-day visit at the invitation of President Sheikh Mohamed bin Zayed Al Nahyan to participate in the World Governments Summit (WGS).\n\nSpeaking at a conference organised by the Securities and Exchange Commission of Pakistan (SECP), Finance Minister Muhammad Aurangzeb said that the IMF chief was “full of praises” regarding the prime minister’s leadership and commitment to the reform-based programme.\n\nHe highlighted the focus on structural reforms on the taxation side, energy side, state-owned entities (SOEs) reforms, and public finance in terms of right-sizing the federal government and pension reforms.\n\n“That’s what the managing director, Kristalina, was full of praise for yesterday,” he said. “For the prime minister and the leadership he has shown and the conviction that he has shown.\n\n“And the commitment the country has shown in terms of this reform-based programme, for which we are well underway in that programme,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/12113449a03576e.jpg",
  "retrievedAt": "2025-10-12T01:23:18.613Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891469/imf-chief-meets-pm-shehbaz-pledges-support-for-govts-actions",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T06:33:23.000Z"
}
