{
  "title": "Dozen died in Bangladesh detention after revolution: rights group - World - DAWN.COM",
  "author": null,
  "content": "At least a dozen people died in detention in Bangladesh since last year’s revolution, including by torture and gunshot wounds, a rights group said Wednesday.\n\nOdhikar, one of the South Asian nation’s largest human rights organisations, demanded justice from the interim government that took over after the student-led revolution that toppled former prime minister Sheikh Hasina.\n\n“The interim government should not let these crimes go unpunished,” Odhikar director ASM Nasiruddin Elan told AFP. “Those involved in extrajudicial killings must be brought to justice.”\n\nOdhikar detailed in a report how security forces during Hasina’s 15-year-long autocratic rule engaged in widespread killings to bolster her power — and accused the same agencies of continuing to commit human rights violations since she fled.\n\nHasina escaped into exile to neighbouring India on August 5, capping an uprising in which the United Nations says more than 1,400 people could have been killed, and has since defied an arrest warrant to face trial for crimes against humanity.\n\nSince she left, Bangladeshi security forces have carried out sweeping arrests against supporters of Hasina’s Awami League party and loyalists of what they dub her “fascist” ex-government.\n\nOdhikar detailed 12 deaths that took place between August 9 and December 31, 2024.\n\nBangladesh’s security forces are “investigating all the cases”, Sami-Ud-Dowla Chowdhury, the armed forces’ public relations director, told AFP.\n\n“Even the friends of the fascist regime have a right to justice,” Elan said. “Extrajudicial killings must be prevented at any cost”.\n\nThree of them were in police custody, and the others were under the control of other security units, including the armed forces and much-feared paramilitary Rapid Action Battalion (RAB).\n\nAt least seven victims died after torture, and four had gunshot wounds, according to Odhikar.\n\nAnother person was beaten and later pushed off a bridge by the police, it added.\n\nAmong the cases was the death of 18-year-old Elahi Sikdar from the city of Gopalganj, who was arrested for allegedly attacking soldiers. His injured corpse was later recovered from a hospital.\n\nHis brother Kudrat Sikdar said that, like many families of the dead, they would not be filing a case. “We have accepted his death as destiny,” Kudrat Sikdar said.\n\nIn response to the report, Bangladesh police spokesperson Inamul Haque Sagar told AFP that officers had been ordered to “refrain from activities beyond their jurisdiction”.\n\nThe armed forces were granted judicial powers enforcement activities like the police — including making arrests — after the revolution.\n\nArmy chief Waker-Uz-Zaman said he worried about that role being extended.\n\n“The more our people stay in the field, the more there is the fear that they will face unlawful activities,” he told the Prothom Alo newspaper.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:23:19.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891486/dozen-died-in-bangladesh-detention-after-revolution-rights-group",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T08:23:00.000Z"
}
