{
  "title": "Judges’ transfer does not reset their rank, IHC CJ rules - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice Aamer Farooq of the Islam­abad High Court (IHC) has justified lowering the ranks of judges in the revised seniority list, while relying upon previous judgements, including one handed down by the Indian Supreme Court, that distinguished transfers from appointments.\n\nA day earlier, Justice Farooq rejected the representation filed by five judges — Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat Imtiaz — challenging the revised seniority list following the recent transfer of three judges to the court.\n\nThe decision was issued after a detailed examination of constitutional provisions and judicial precedents regarding the transfer and seniority of judges.\n\nThe issue arose after the Ministry of Law and Justice issued a notification on Feb 1, transferring three sitting judges — Justice Sardar Muham­mad Sarfraz Dogar, Justice Khadim Hussain Soomro and Justice Muham­mad Asif — from their respective high courts to the Islamabad High Court.\n\nJustice Dogar was transferred from the Lahore High Court, Justice Soomro from the Sindh High Court, and Justice Asif from the Balochistan High Court. The controversy centred around the alteration of the seniority list following these transfers.\n\nThe five IHC judges had filed a representation, contending that under the Constitution, a high court judge must take a new oath upon transfer to a different high court, which should affect their seniority ranking.\n\nThe IHC chief justice responded to the representation with a detailed ruling. His judgement referenced several key legal principles, particularly constitutional articles concerning the transfer of judges and the distinction between transfers and fresh appointments.\n\nThe chief justice cited Article 200 of the Constitution, which allows the president of Pakistan to transfer a judge from one high court to another, provided the transfer is made with the consent of the judge and after consultation with the chief justice of Pakistan and the chief justices of the involved high courts.\n\nThe chief justice emphasised that while the transfer is constitutionally valid, it does not imply a fresh appointment or a change in the seniority of the judge in the receiving court.\n\nThe ruling noted that the Constitution does not require a judge to take a new oath upon transfer from one high court to another. Once a judge has taken the oath of office in their original high court, that oath continues to apply upon transfer. Therefore, the seniority that the judge held in their previous high court should carry over to the new high court, without resetting their position in the seniority list.\n\nFurthermore, the chief justice referenced past judgements, including a key ruling from the Indian Supreme Court, which distinguished between the transfer and appointment of judges. The ruling in the Indian case reinforced the notion that a transfer does not constitute a fresh appointment and that the judge’s original seniority is maintained even when they are reassigned to a different high court.\n\nThe chief justice elaborated that the Constitution’s framework, particularly Articles 194 and 200, does not specify any requirement for a fresh oath or a reassignment of seniority. He pointed out that if the intention had been to reset the seniority of transferred judges, the Constitution would have explicitly stated such a provision.\n\nHe also emphasised that once a judge has been appointed and sworn in, their tenure continues until the age of retirement or until they are removed, elevated to the Supreme Court or pass away.\n\nThe ruling was clear in asserting that the transfer is a procedural matter that does not alter the fundamental status or seniority of the judge. As such, the revised seniority list, which placed the judges lower in rank, was justified according to constitutional provisions.\n\nIn light of the constitutional provisions and legal precedents, the IHC chief justice ruled that the representation challenging the altered seniority list should be rejected. The seniority list, as revised to reflect the transfer of the three judges, was upheld. The IHC registrar was instructed to forward copies of the ruling to the judges concerned.\n\nIn addition to the seniority dispute, Justice Babar Sattar also wrote to the IHC chief justice, questioning the legality of the Feb 3 seniority list and the inclusion of transferred judges in administrative and departmental promotion committees.\n\nJustice Sattar specifically objected to Justice Soomro’s appointment to the Administration Committee, arguing that under Rule 2 of the Islamabad Judicial Service Rules, which were adopted from the Punjab Judicial Service Rules, only the two most senior judges could be part of the committee.\n\nHe contended that the IHC CJ had exercised undue discretion by including Justice Soomro, who ranks ninth on the IHC seniority list.\n\nHowever, a copy of Rule 2, available with Dawn, states: “The Administration Committee shall consist of seven judges. The Chief Justice and the Senior Puisne Judge shall be ex-officio members and the Chief Justice shall annually nominate the other five members of the Committee.”\n\nA former judge of the high court explains that the chief justice and the senior puisne judge could not be replaced from the Administration Committee in the light of this rule. However, it is the discretion of the chief justice to nominate any judge of the high court in the committee every year.\n\nHe, however, said that perhaps the controversy over Justice Soomro’s appointment to the committee is owing to the comprehension of the Punjab Judicial Service Rules.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:32:17.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891349/judges-transfer-does-not-reset-their-rank-ihc-cj-rules",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:26:50.000Z"
}
