{
  "title": "Reshuffled Australia look to fine-tune for Champions Trophy in Sri Lanka ODIs - Sport - DAWN.COM",
  "author": null,
  "content": "COLOMBO: After sweeping The test series in Sri Lanka, an injury-depleted Australia will look to carry the momentum into ODI matches against the South Asians and build confidence ahead of the Champions Trophy.\n\nWith the Sri Lanka tour following a long, attritional home summer, Australia’s Champions Trophy roster will have a different look to the peerless squad that took a record-extending sixth World Cup title at the 2023 tournament in India.\n\nRegular captain Pat Cummins, fellow quick Josh Hazlewood and all-rounder Mitch Marsh have been ruled out with injuries, while Marcus Stoinis was a late withdrawal last week after his surprise retirement from ODIs.\n\nSelectors responded by calling up a small army of reserves for the Sri Lanka series, adding fast bowlers Sean Abbott, Spencer Johnson and Ben Dwarshuis along with legspinner Tanveer Sangha, spin-bowling all-rounder Cooper Connolly and batter Jake Fraser-McGurk.\n\nSelectors have yet to decide on Cummins’ replacement as captain, though coach Andrew McDonald confirmed it will be either Steve Smith, who led the test side in Cummins’s absence, or Travis Head.\n\nOther selections remain up in the air even if fresh faces in the bowling are guaranteed.\n\nThe international ambitions of Australia’s reserve quicks have long been thwarted by the durability and consistency of the front-line trio of Cummins, Hazlewood and Starc.\n\nHowever, at least two of Abbott, Johnson and Dwarshuis are expected to be included in the Champions Trophy, joining pacers Mitchell Starc and Nathan Ellis for the tournament co-hosted by Pakistan and the United Arab Emirates.\n\nWith Starc almost certain to be rested for Wednesday’s ODI due to the quick turnaround from the second Test, fellow left-armers Johnson and Dwarshuis may hope for a last chance to impress selectors in his place.\n\nThe hard-hitting Fraser-McGurk is in line to replace Marsh at number three in the batting order, while Connolly may be retained in the Champions Trophy squad as a replacement for Stoinis even if he lacks the all-rounder’s seam bowling.\n\nSelectors want all of Australia’s test players included in the ODI squad to play at least one of the Colombo matches to get into the rhythm of the shorter format, even if the venue’s spin-friendly conditions may be quite different to those in Pakistan.\n\nAustralia open their Champions Trophy campaign against England in Lahore on Feb. 22, with their other group matches against South Africa and Afghanistan also in Pakistan.\n\nCaptain Smith admitted on Tuesday the Champions Trophy would be on Australia’s minds when they play Sri Lanka.\n\n“I’d be lying if I said the Champions Trophy wasn’t at the forefront of our minds — it’s a massive ICC tournament for us,” Smith told reporters. “While our focus is firmly on finishing this series on a strong note, there is no denying that the Champions Trophy is looming large. We want to make sure we carry good form into that competition.”\n\nBoth ODIs will be played as day games, a rarity in modern cricket.\n\nThe floodlights in Colombo’sR. Premadasa Stadium are out of action as part of renovations ahead of the 2026 T20 World Cup, which will be co-hosted with India.\n\n“Day games are quite different,” Smith said, adding he couldn’t remember his last ODI day match. “But whatever the conditions, it’s going to be warm out there, and we’re looking forward to the challenge”.\n\nBefore coming to Sri Lanka, Australia held a training camp in Dubai to prepare for “challenging wickets” in Sri Lanka, said Smith.\n\n“The batters found methods to succeed in these conditions, the spinners worked on varying their pace, and the seamers fine-tuned their reverse swing,” he said. “We hope to bring all that into this series and finish well.”\n\nSri Lanka did not qualify for the Champions Trophy after a dismal ninth-place finish at the World Cup in India in 2023.\n\n“It’s disappointing, no doubt about it — but there’s nothing that we can do about it now,” Sri Lanka’s stand-in captain Charith Asalanka said. “What’s important is that we make sure this never happens again”.\n\nAsalanka said the team wanted to focus on their successes — including beating India in 2024 in the first ODI in 27 years.\n\n“We need to build on that momentum,” Asalanka added.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67abf7382b29a.gif",
  "retrievedAt": "2025-08-25T19:32:14.323Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891387/reshuffled-australia-look-to-fine-tune-for-champions-trophy-in-sri-lanka-odis",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:27:07.000Z"
}
