{
  "title": "Three held for ‘torturing’ minor housemaid - Newspaper - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A minor house maid was shifted to hospital in a critical after she was allegedly tortured and ill-treated by her employers, husband and wife.\n\nPolice have taken the couple and the woman, who brought the girl to the hospital, into custody and started an investigation.\n\nA team from the Child Protection Bureau Rawalpindi also reached the hospital.\n\nThe incident came to light after the victim was shifted to hospital from the Asghar Mall Scheme area of Bani police station, Rawalpindi, after her condition deteriorated.\n\nThe victim was shifted to the hospital by the woman who used to teach Quran to children at home. CPO Rawalpindi Khalid Hamdani directed the police to take legal action against the accused.\n\nPolice said Iqra, a 12-year-old girl, was shifted to the hospital in an unconscious condition. Later, doctors informed the police about the torture marks found on the girl’s body, on which CPO Rawalpindi Khalid Hamdani sent a police team to the hospital to investigate.\n\nWhen the woman who shifted the girl to the hospital was questioned, she said that she teaches Holy Quran to children and said that the girl was working at Mian Rashid’s house, and that she had brought her to the hospital out of humanity as she could not see her condition.\n\nPolice said when the incident came to light, the husband and wife involved in the violence were taken into custody and are being interrogated.\n\nAccording to initial investigations, the incident of violence seems to have happened a few days ago. The condition of the girl is critical and she is undergoing treatment.\n\nThe police said that the victim’s father died about a month ago, due to which her mother was in seclusion (Iddat).\n\nCPO Rawalpindi Khalid Hamdani said that violence against children is not tolerable under any circumstances.\n\nWhen the medical report is received, a case of violence against the accused will be registered on the police complaint and those involved in the violence against the innocent girl will be brought to justice.\n\nMeanwhile, Chairperson Child Protection Bureau Sara Ahmed also took notice of the incident of violence against the minor domestic worker, and a team of Child Protection Bureau Rawalpindi led by District Officer Child Protection Bureau Rao Khalil Ahmed reached the hospital and obtained information about the girl.\n\nChairperson Sara Ahmed said that the incident of violence against the minor domestic worker is very sad. The girl is undergoing treatment at Holy Family Hospital.\n\nSara Ahmed said that the minor had been subjected to violence by the owners for about 12 days. There are signs of violence on the girl’s body.\n\nSaira Ahmed further said that the domestic worker will be taken into protective custody by the Child Protection Bureau and all possible assistance will be provided to her.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:31:32.611Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891333",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:27:26.000Z"
}
