{
  "title": "Balochistan CM orders registration of all mines in province - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Mir Sarfraz Bugti has ordered the registration of all coal and other mines in the province to ensure transparency and legal status of mines in the province.\n\nPresiding over a meeting of the mines and mineral department, here on Tuesday, the chief minister reviewed the overall performance of the department and discussed improving security arrangements in the mining areas of the province where many tragic incidents had taken place over the last few months claiming several precious lives.\n\nThe chief minister also directed that royalty rates of the mining sector should be revised and the income coming from the mines royalty would be spent on the development of the mining areas.\n\n“The government expenditures in these areas are more than income,” Mr Bugti said and asked Inspector General of Police Moazzam Jah Ansari to recruit 200 policemen on pure merit. He also ordered that policemen of Loralai should be deployed in Duki.\n\nFirst batch of skilled youth to be sent to Saudi Arabia next week\n\n“The coordination between police, FC and Levies is necessary for restoring peace and order in Duki mines field area,” he said.\n\nYouth skill development\n\nThe chief minister also presided over another meeting to finalise arrangements for sending 2,375 skilled youth abroad for employment by June this year under the Chief Minister’s Youth Skill Development Programme.\n\nThe programme is meant to send skilled youth of Balochistan abroad for employment and under this programme the first batch of 24 skilled youth will be sent to Saudi Arabia next week.\n\nUnder the skill development programme, 30,000 youth of Balochistan would be trained in different modern skills in the next five years and they will be sent abroad for employment.\n\nThe chief minister directed officials concerned to ensure that visa and passport processes for all the skilled youth of Balochistan are made easier and faster by coordinating with the ministry of foreign affairs and the ministry of interior.\n\nHe also ordered that pre-employment medical tests of selected candidates be conducted in government-approved diagnostic laboratories to ensure transparency and efficiency.\n\nHe also ordered that equal number of the youth should be selected from all districts of the province.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:31:46.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891425/balochistan-cm-orders-registration-of-all-mines-in-province",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:58:29.000Z"
}
