{
  "title": "Punjab Cabinet approves review of defamation law - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab Cabinet on Tuesday approved review of the Punjab Defamation (Tribunal) Rules 2024.\n\n“Chief Minister Maryam Nawaz who presided over the 23rd provincial cabinet meeting directed Minister for Information and Culture Azma Bokhari to review the Punjab Defamation (Tribunal) Rules 2024,” a government official said after the meeting.\n\nThe cabinet stressed promotion of industrialisation in Punjab and approved ‘zero time to start policy’ for special economic zones, industrial estates and small industrial estates.\n\n“Investors should come, set up industries and start work. We want to provide the industrialists all kinds of facilities in Punjab for doing business. They may set up as many industries as they can, they will be given NOCs immediately,” she said.\n\nThe cabinet approved free travel facility for differently-abled people and senior citizens in the mass transit system and agreed on the proposal to introduce a special student travel card for students.\n\nA fund of Rs580m was approved for the “Cryoablation” machine, an alternative to chemotherapy for cancer patients. Funds were also approved to make special education centres of excellence across Punjab. Approval was also granted to recruit 5,960 police constables. Restrictions were relaxed for 127 recruitments in the Mass Transit Authority along with 87 posts approved for recruitment in the Child Protection and Welfare Bureau.\n\nGives nod to free travel for senior citizens and differently-abled, 1,000 free tractors to farmers, hiring of 5,960 constables\n\nWhile the age limit for filling up vacant posts of doctors in basic and clinical sciences was approved to be enhanced up to 65 years. Approval was given for recruitment of 25 posts in the ICT of Specialised Healthcare and Medical Education and staff in four Daanish Schools in Taunsa and Mankera.\n\nA supplementary grant was approved for recruitment on vacant posts in the forest department and a decision was made to recruit 500 posts under the Traffic Management Plan in Murree. Amendment to the Motor Vehicle Ordinance 1965 was approved for the implementation of the Axle Load Management System in Punjab.\n\nA sum of Rs30bn was approved for the Negahban Ramadan Package, which would benefit 30m people. An ATM card for Negahban Ramadan Package would be introduced in Punjab from the next year.\n\nThe meeting approved provision of 1,000 free tractors to wheat farmers in place of land levelers, replacement of 353 vehicles of Rescue 1122 in Punjab in a phased manner, Punjab Special Planning Act 2024, qualification criteria for the VCs of technological universities, reconstitution of the Punjab Cooperative Bank Limited and legislation for the establishment of ‘Punjab Energy Efficiency and Conservation Agency’ besides the draft of the Punjab Local Government Act 2024.\n\nApproval was given for the dissolution of the task force and establishment of a ministerial committee to review delimitation of divisions, districts and tehsils. An amount of Rs309m was approved for construction and renovation of the metro corridor of the Lahore Metrobus System.\n\nThe meeting approved a grant for the operationalisation of the pilot project of electric buses, ‘e-credit scheme’ of the Chief Minister Punjab Livestock Card, establishment of a special centre for robotic artificial limbs from South Korea and amendments to the Drug Act 1976, 2022.\n\nThe meeting approved reconstitution of the board of directors of the Punjab Transport Company, appointment of the chairperson of the Child Protection and Welfare Bureau, the reconstitution of the Punjab Zakat & Ushr Council, filling of vacant post of the information commissioner of Punjab and formation of a new board of directors of the Punjab Mineral Company.\n\nA grant from South Korea was approved for a flood water storage project in Multan, transfer of Punjab Saaf Pani Company assets to Punjab Saaf Pani Authority.\n\nThe cabinet decided to establish a committee for auctioning precious metals on the banks of the Indus river and approved 40 litres of petrol allowance for process servers and bailiffs of the district judiciary of Punjab, establishment of smart police stations in various districts, purchase of laptops under CM Punjab Laptop Programme, grant worth Rs1bn for Lahore Metropolitan Corporation, funds for Kashmir Solidarity Day and grant of assistance for UET Lahore.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:32:13.421Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891367/punjab-cabinet-approves-review-of-defamation-law",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:27:19.000Z"
}
