{
  "title": "Musk aide given payment system access by mistake: US official - World - DAWN.COM",
  "author": null,
  "content": "An Elon Musk aide was mistakenly given clearance to make changes to the US Treasury Department’s highly sensitive payments system containing millions of Americans’ personal information, a department official said on Tuesday.\n\nThe admission came in a sworn statement to a federal judge amid heated criticism that the 25-year-old employee of billionaire Musk had editing rights to a system that handles trillions of dollars in government payments.\n\nThe employee, Marko Elez — who had no federal government status — resigned Friday after being linked to a racist social media account, only for Musk to announce that he was being reinstated.\n\nPresident Donald Trump has tasked Musk with taking an axe to government spending as the leader of a new agency called the Department of Government Efficiency, or Doge.\n\nThe sworn statement, seen by AFP, says that Elez was supposed to gain read-only access to the system, under the supervision of the Bureau of the Fiscal Service, the Treasury Department section that manages payments and collections.\n\n“On the morning of February 6, it was discovered that Mr Elez’s database access to SPS on February 5 had mistakenly been configured with read/write permissions instead of read-only,” said the statement from Joseph Gioeli, an official from the payments section.\n\nSPS stands for Secure Payment System.\n\nAn initial investigation showed all of Elez’s interactions with the SPS system occurred within a supervised session and that “no unauthorised actions had taken place”, the official added.\n\nElez gained access through a Treasury Department laptop computer, triggering an uproar among critics of the Trump administration and worries about the safety of Americans’ personal data.\n\nDoge has no statutory standing in the federal government — which would require authorisation from Congress — and neither Musk nor his aides are civil servants or federal employees.\n\nElez was one of two Doge workers who gained access to the sensitive Treasury payments system.\n\nA confidential internal assessment reported by US media warned the Treasury Department that this access represented an “unprecedented insider threat risk”.\n\nBefore he resigned, a court order forced Elez back to read-only permission for the payments system as Democratic lawmakers and citizen advocacy groups warned about the dangers to national security and the economy because of the data he could access.\n\nAnother member of the Doge team, Thomas Krause, also submitted a sworn statement to the same judge on Tuesday, stating that he was employed by the Treasury on January 23 as an unpaid “Senior Advisor for Technology and Modernisation”.\n\nHe was later delegated the duties of “Fiscal Assistant Secretary”, but said, “I have not yet assumed the duties.”\n\nKrause is listed in the Treasury Department’s organisational chart under this title.\n\n“Although I coordinate with officials at USDS/Doge, provide them with regular updates on the team’s progress, and receive high-level policy direction from them, I am not an employee of USDS/Doge,” he said in his statement, adding that the department’s team within the Treasury consisted of himself and Elez.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/121404421f54f13.jpg",
  "retrievedAt": "2025-08-25T19:31:29.850Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891488/musk-aide-given-payment-system-access-by-mistake-us-official",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T11:00:08.000Z"
}
