{
  "title": "Judiciary — an apologia - Newspaper - DAWN.COM",
  "author": null,
  "content": "OUR constitutional journey is no different from our political odyssey, except that the former is recorded more in the annals of betrayals, compromises, and transgressions, and the latter as tales of tragedies, perfidies, and failures.\n\nNo wonder, the greatest national irony continues to rest in the never-ending zero sum game that is played by institutional leaderships to undermine each other in their quest to consolidate personal, partisan, and institutional power and authority, and, thus, keep the politico-constitutional order fragile and in a state of flux.\n\nThe asymmetry recently imposed upon the judiciary by an overbearing executive in the name of parliamentary supremacy is only the latest episode in the saga of the power game that goes on unabated at the cost of citizens’ democratic rights and liberties.\n\nInterestingly, there is a pervasive view that the judiciary is responsible for the tragic fate that has befallen it. It locates the judiciary’s ‘comeuppance’ in its three ‘original sins’ — inefficiency, disunity, and overreach. Though it is difficult to debunk these allegations given the empirical evidence substantiating most of them, it is important to understand why the judiciary is what it is and has been for so many decades.\n\nInefficiency: a large body of statistical evidence — the number, duration, and cost of litigation — gives much credence to this damning view. A related question as to why the judiciary has not reformed itself by at least overhauling its procedural laws and case management to expedite and economise the processes, is also valid.\n\nBut it must also be reckoned that legal or judicial reforms cannot be effected administratively or by tweaking procedures alone. It requires a new vision and an all-embracing institutional effort to rehash the entire legal system forged on a robust constitutional democracy. But the requisite vision and the commitment to rehauling the system are missing due to various reasons, including powerful interests which are invested in, and benefiting from, the existing corroded legal machinery. No wonder, there has been only a selective rewriting of the laws.\n\nFor instance, the recent ‘reforms’ in the accountability, anti-terrorism, and regulatory laws were hastily enacted to serve powerful interests: politicians, bureaucrats and the security establishment. Hence, there is no independent forum to hold political and public-office holders accountable for their culpabilities, nor are there any checks on the actions of the security and intelligence agencies.\n\nThere is a strong view that the judiciary is responsible for the tragic fate that has befallen it.\n\nDisunity: It isn’t wrong to suggest that the judiciary — presently and previously — has remained a house ‘divided against itself’. Most of its senior leadership has failed to instil a sense of collegiality or institutional consensus on critical constitutional questions. And its internal ‘disarray’ and jurisprudential dissonance have largely incited extraneous elements to intrude into, if not control, its space — literally and metaphorically.\n\nBut then, which judiciary has not seen such trying times in its formative phases? Haven’t the oldest constitutional democracies — the English and American — faced internal division driven by institutional conflict, personal belief and ambition? Closer to home, hasn’t the Indian judiciary shown subjective weaknesses and jurisprudential anomalies to appease governments?\n\nAs a matter of fact, historically only a few bold and selfless jurists have held the fort. In that respect, we are no less lucky to have a few judges who have stood against dictators — military and civilian — in defence of the Constitution and democracy, regardless of whether they succeeded or not. Paradoxically, in many instances, internal dissension has proven helpful in containing an ambitious chief justice from misusing his powers or influencing the fate of a critical matter by forming benches of ‘like-minded’ judges.\n\nSo, let’s not appraise the judiciary in terms of the unity of thought or closeness of ranks. What is needed is to protect it from the external hands — visible and invisible — which are fatal to its credibility and image.\n\nOverreach: Admittedly, our constitutional annals are tainted with varying spells of ‘judicial activism’. Judges have at times shown a tendency to overreach, administratively and judicially. No wonder ‘overreach’ is being cited as the prime reason for bringing in the 26th Amendment to defang and divide the judiciary. But the popular concept of ‘overreach’ is misplaced.\n\nJudicial overreach is not reflected simply in the narcissistic or overzealous desire of a chief justice to give himself a larger-than-life role in the polity, or more specifically, in dictating bureaucrats, summoning prime ministers, or freezing the government machinery. Such overreach may be harmful, but is transitional. The more lethal and lasting kind is demonstrated by some weak or ambitious judges when they allow themselves to be prodded (read: dictated) by extraneous forces — civil and military. It is this brand of ‘overreach’ that has come in handy for the powers that be to dismiss elected governments, justify takeovers, crucify politicians, and, above all, undermine the Constitution.\n\nJudicial overreach is, thus, not merely a subjective aberration limited to judges. It is a symptom of a deeper politico-constitutional malaise, which is rooted in the collective failure of our political and judicial leadership to save constitutional democracy, and thereby each other, from the recurrent onslaughts of undemocratic forces. Nor is this overreach essentially judicial. It is multilateral.\n\nOther institutions too have overstepped their bounds, if not smothered the judiciary, whether of their own accord or in collusion with the security establishment. And the resulting uneven spread of institutional power has invariably brought the judiciary to face critical dilemmas: how to enforce the foundational principle of the constitutional law — ‘equality before the law’ — in dealing with powerful forces, political and/or institutional?\n\nAnd how to abide by the oath to ‘preserve, protect and defend the Constitution’ that itself is rigged against the basic requisites of parliamentary democracy, ie, the separation of power, and judicial independence?\n\nSadly, the judiciary yet again faces these primordial dilemmas when the constitutional balance has been drastically tilted against it. And it stands deplorably bereft of its natural allies — a democratic government and parliament. A besieged judiciary has historically relied only on its moral authority. This raises the key question: would it?\n\nThe writer is a lawyer.\n\nshahabusto@hotmail.com\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67abfbeeca0c9.png",
  "retrievedAt": "2025-10-12T01:24:14.387Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891410",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:42:01.000Z"
}
