{
  "title": "Crackdown against LPG safety violations - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Oil and Gas Regulatory Authority (Ogra) on Tuesday announced that it had launched a crackdown against theft of gas, illegal decanting and mixing of carbon dioxide (CO2) with Liquefied Petroleum Gas (LPG) in three provinces — Punjab, Sindh and Khyber Pakhtunkhwa.\n\nIn a statement, Ogra said it had taken serious notice of the violation of safety standards in the operations of LPG and had moved different teams to visit identified areas and take action under the rules against such practices, including illegal decanting, theft of gas and mixing CO2 with LPG.\n\nIt said the CO2 mixing with LPG had been traced in various locations of Sindh province, especially at Khairpur, Ghotki, Pano Aqil and Ranipur. In addition, substandard cylinders were manufactured in different places in Gujranwala.\n\nThe teams were also dispatched to Multan and Dera Ghazi Khan, where fire incidents had occurred in LPG plants recently, causing considerable losses to the exchequer and public lives.\n\nIn coordination with local administrations, Ogra’s LPG and enforcement teams raided four sites in Sindh, discovered illegal mixing of CO2 with LPG, sealed all the sites immediately, and lodged FIRs against the concerned individuals.\n\nThe teams have also prepared reports on the negligence of local handlers, causing blasts in Multan and Dera Ghazi Khan, and have sealed three illegal manufacturing sites of sub-standard LPG cylinders in Gujranwala.\n\nIt said the teams visited the LPG sites at Thehri Pass Khairpur, Shah Hussain Bypass Khairpur, and National Highway Ranipur and spotted an illegal site at Ghotki where theft of gas, illegal decanting and mixing of CO2 was being done. The sites have been sealed, and FIRs have been registered against those involved. The unlawful manufacturing sites at Gujranwala were also apprehended, and FIRs were registered against the culprits, it said.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/10104908453e87a.jpg?r=105234",
  "retrievedAt": "2025-08-25T19:31:58.145Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891416/crackdown-against-lpg-safety-violations",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:51:47.000Z"
}
