{
  "title": "AJK PM announces exam fee exemption for orphan students - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Azad Jammu and Kashmir (AJK) Prime Minister Chaudhry Anwarul Haq on Tuesday announced that all orphan students studying in schools and colleges across the state would be exempt from registration and examination fees of the AJK Board of Intermediate and Secondary Education (AJKBISE).\n\nHe made this announcement while addressing the annual medal and award distribution ceremony of the AJKBISE in Mirpur as the chief guest.\n\nIn the future, no student from Poonch or Muzaffarabad division would have to travel to Mirpur for paper marking. Students would be able to view their marked papers on LCD screens available at the board’s regional offices in Rawalakot and Muzaffarabad, the prime minister declared.\n\nIf an appeal for paper marking revealed an error made by the board or the examiner, the board would refund the rechecking fee along with an elevenfold penalty to the student at their home, he added, amid a round of applause from the audience.\n\nThe prime minister pointed out that since a clear law existed regarding paper marking, no teacher could refuse the duty assigned by the board.\n\nIf any teacher does so, the secretaries of schools and colleges should take disciplinary action against them.\n\n“We need educational reforms and innovation. We cannot progress by maintaining the status quo. Our children must receive quality education to compete globally,” he said.\n\nHe said the dignity of the state could not come from extravagant vehicles and artificial grandeur but from ensuring the protection and self-respect of its citizens.\n\nThe AJK premier maintained that the freedoms and positions being enjoyed by people in the liberated territory today were the result of the sacrifices made by their ancestors and the people of Indian-occupied Kashmir.\n\n“On the other side of the Line of Control, such ceremonies are unimaginable. Over there, children stand over the dead bodies of their parents, and the scenes are heart-wrenching. The level of fear, oppression, and brutality in Indian-occupied Kashmir has reached such an extent that human emotions are being extinguished,” he said.\n\nReiterating his standpoint, he said time had come to move beyond political, diplomatic, and moral support, and take concrete actions for freedom.\n\n“This is no longer a time for rhetoric—it’s a time for real sacrifices. We must be ready to offer our necks rather than just pointing fingers. There is no room for an apologetic approach now.”\n\nHe reiterated that the Pakistan Army was the protective force, and its sacrifices ensured continued freedom and peaceful lives in AJK.\n\nResponding to comments from a woman in the audience, the prime minister acknowledged the need for comprehensive reforms in the education sector.\n\nHe invited intellectuals from across AJK to submit suggestions, and promised to bring them to the cabinet and the assembly for legislative action.\n\n“All of this is possible if we have the passion to work. Today, our real competition is with technology—the more we master it, the more prosperous we will become.”\n\nEarlier, the prime minister distributed medals, awards, and prizes among students who secured top positions in the 2023-24 secondary and intermediate examinations.\n\nHe also announced cash prizes of Rs 25,000, Rs 22,000, and Rs 20,000 for students securing first, second, and third positions, respectively.\n\nAdditionally, he approved bonuses for the AJKBISE employees and announced a grant for installing a tube well to resolve the board’s water supply issues.\n\nThe ceremony was also addressed by several others, including minister for elementary and secondary education Deewan Ali Chughtai and AJKBISE chairman Prof Dr Nazar Hussain Chaudhry.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:23:50.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891338/ajk-pm-announces-exam-fee-exemption-for-orphan-students",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:27:26.000Z"
}
