{
  "title": "Jordan opposes Trump plan to take over Gaza - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Jordan’s King Abdullah II told Donald Trump on Tuesday that his country would take in some 2,000 sick children from Gaza, but pushed back against the US president’s plan to take over the Palestinian territory and send its population into exile.\n\n“I reiterated Jordan’s steadfast position against the displacement of Palestinians in Gaza and the West Bank. This is the unified Arab position.\n\n“Rebuilding Gaza without displacing the Palestinians and addressing the dire humanitarian situation should be the priority for all,” Abdullah said on social media after the talks.\n\nHowever, he told Trump that Egypt was working on a plan for how countries in the region could “work” with Trump on the proposal.\n\nThe Jordanian monarch also appeared to offer a sweetener to Trump, who had just the day before the visit floated the possibility of halting US aid to Jordan if it did not take refugees.\n\n“One of the things that we can do right away is take 2,000 children, cancer children who are in a very ill state. That is possible,” King Abdullah said as Trump welcomed him and Crown Prince Hussein in the Oval Office.\n\nTrump replied that it was “really a beautiful gesture” and said he didn’t know about it before the Jordanian monarch’s arrival at the White House.\n\nThe US leader stunned the world when he announced a proposal last week for the United States to “take over” Gaza, envisioning rebuilding the devastated territory into the “Riviera of the Middle East”, but only after resettling Palestinians elsewhere, with no plan for them ever to return.\n\nAbdullah urged patience and said that Egypt was coming up with a response and that Arab nations would then discuss it at talks in Riyadh.\n\n“Let’s wait until the Egyptians can come and present it to the president and not get ahead of ourselves,” Abdullah said.\n\nTrump retreated from his previous talk of an aid halt to Jordan and Egypt, saying: “I don’t have to threaten that. I do believe we’re above that.”\n\n`Tough guy’\n\nTrump, however, kept pushing his plan to “own” Gaza despite the fact that it is home to more than two million Palestinians, saying that it would be held under “US authority”.\n\n“We don’t have to buy. We’re going to have Gaza,” the president said.\n\n“We’re going to take it, we’re going to hold it, we’re going to cherish it.”\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ac045db45c5.gif",
  "retrievedAt": "2025-08-25T19:31:44.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891434/jordan-opposes-trump-plan-to-take-over-gaza",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T02:24:27.000Z"
}
