{
  "title": "Senate rights panel concerned by ‘alarming rise’ in violence against children - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Human rights body calls for concrete strategy to combat such crime\n• Legislation regarding children, differently abled rights deferred\n• Sindh police chief says 289 kidnapping cases reported last year, 269 children recovered\n\nISLAMABAD: A parliamentary body on Tuesday focused on key legislative and administrative matters concerning children’s rights, the protection of persons with disabilities, safeguarding minorities, and measures to prevent crimes against children.\n\nThe Senate Functional Committee on Human Rights convened at the Parliament House with Senator Samina Mumtaz Zehri in the chair. The meeting conducted a detailed review of the National Commission on the Rights of Child (NCRC), its performance, functions, and actions to curb crimes against children.\n\nLegislation concerning the rights of children and persons with disabilities was deferred till the next meeting. Senator Dr Zarqa Taimur Sohrwardy, attending online, requested time to consult with the NCRC chairperson before updating the committee. In response, Chairperson Senator Samina Mumtaz Zehri postponed both bills to the next session.\n\nThe committee also reviewed the National Commission for Minorities Bill 2025. The secretary of the Ministry of Human Rights, Allah Dino Khowaja, briefed the committee, highlighting that Pakistan had signed international conventions and that the bill had already been passed by the National Assembly.\n\nThe committee examined various clauses of the bill in detail, with the members agreeing that input from the minority representatives in both the National Assembly and Senate should be included. To address this, Chairperson Samina Zehri formed a subcommittee headed by Senator Syed Ali Zafar, with Senators Tahir Khalil and Ponjo Bheel as its members. This subcommittee will conduct a detailed review and submit a report within 60 days. The non-Muslim minority members from both houses of parliament would be invited to participate in the discussions.\n\nThe committee expressed concern over an uptick in the cases of child abduction, murder, and trafficking across the country. The chairperson highlighted the alarming rise in child kidnappings, rape, and trafficking incidents, urging relevant authorities to formulate a concrete strategy to combat such crimes.\n\nSindh IG Ghulam Nabi informed the committee that at least 289 kidnapping cases were reported in 2024. 269 children have been recovered and 66 cases have been formally charged, he said, adding that investigations in 66 cases were still pending, while 64 cases were currently under trial. Regarding runaway children, 266 cases were reported, while the police have made recoveries in 239 cases, he said, adding that 57 cases were under inquiry while 55 cases were pending in the courts. He acknowledged discrepancies in data across various institutions and emphasised that cases under the Zainab Alert Bill should be concluded within three months.\n\nThe Sindh police chief said 37 children were murdered in Karachi in 2024, with 22 cases resulting in formal charges. He stated that Sindh had the highest conviction rate of 25 per cent. Additionally, 209 cases of child abuse were recorded, involving 117 boys and 96 girls.\n\nThe committee also addressed concerns regarding the abduction case of Beea Kumari, which had drawn international criticism. The ministry’s secretary stated that they remained in constant communication with the Sindh police regarding the case, acknowledging the damage it had caused to Pakistan’s global reputation.\n\nChairperson Zehri raised concerns over police conduct, stating, “People hesitate to report cases due to the unfriendly attitude of the police. Law enforcement must improve their behaviour to encourage crime reporting.”\n\nThe committee also expressed alarm over the increasing trend of child trafficking. The police officials explained that in several cases, children were not actually kidnapped but reported missing, often leading to “unnecessary public panic” due to media coverage. However, they assured the committee that law enforcement agencies were utilising all available resources to address the issue.\n\nOfficials highlighted that in the 1980s, kidnapping-for-ransom cases were prevalent, but advancements in technology had helped track criminals more effectively. Due to improved strategies, the number of kidnapping-for-ransom cases had significantly declined.\n\nChairperson Zehri emphasised the urgency of addressing the rising number of rape cases in Punjab, noting disturbing incidents, including “a 26-day-old baby being sold by a gang”. She warned that such cases were not just domestic issues but involved international trafficking networks. The committee, however, expressed dissatisfaction over the absence of Punjab’s IG at the meeting.\n\nThe Rawalpindi RPO provided statistics on child abductions in Punjab, revealing 2,339 cases were reported in 2022 and they rose to 2,448 cases in 2023. The committee was frustrated with the Punjab police’s failure to provide updated data on these crimes.\n\nSenator Ali Zafar questioned the Federal Investigation Agency (FIA) about its actions against child trafficking. The FIA officials reported one cross-border child trafficking case in 2023.\n\nIn light of an increase in violence against children, Senator Zehri stressed the need for collaboration between all relevant institutions to curb child abduction, abuse, and trafficking. She noted that women and children remained highly vulnerable to such crimes, demanding strict law enforcement and public awareness campaigns.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:32:12.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891342/senate-rights-panel-concerned-by-alarming-rise-in-violence-against-children",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:27:26.000Z"
}
