{
  "title": "US funding freeze ‘bombshell’ for humanitarian sector - World - DAWN.COM",
  "author": null,
  "content": "PARIS: US President Donald Trump’s order to suspend most foreign aid has sent shock waves through the humanitarian sector, threatening to trigger mass layoffs at many NGOs and possibly destroy others altogether.\n\nLess than a week after he returned to power, the US Agency for International Development told NGOs they would have to cease operations immediately because the new administration had frozen USAID’s budgets.\n\nThe US president has ordered a 90-day review of USAID, which runs health and emergency programmes in around 120 countries, including the world’s poorest.\n\nHowever, the Trump administration has issued waivers for some “life-saving” aid, while the freeze included exceptions to funding for Israel and Egypt.\n\nUSAID manages a budget of $42.8bn, just under half of all aid disbursed worldwide\n\nBut confusion reigns over how those waivers will be implemented and the uncertainty has already taken its toll.\n\nThe order to stop work immediately hit “like a bombshell”, said a source at an NGO in Kenya.\n\nHe asked to remain anonymous out of fear his charity could be punished by the Trump administration.\n\n“It threw people into panic mode,” the aid worker said of the freeze, pointing out that the lack of notice meant staff had no time to adapt.\n\nThey were instantly put on compulsory unpaid leave and the organisation was no longer able to pay their rents or salaries, he said.\n\n“What’s that going to mean for people who have children?” he asked, aghast.\n\nImpossible to compensate\n\nAccording to aid network ALNAP, more than 630,000 people were employed in the aid sector in 2020, more than 90 percent of them local staff.\n\nFor many locals, the US freeze spells unemployment in countries with fragile economies where finding another job is almost impossible.\n\nExpatriates working for aid agencies also face disruption.\n\n“We notified everyone on US budgets that they had been suspended temporarily,” said a source at the European headquarters of an NGO mostly financed by US funds.\n\nThe consequence for expatriates, she said on condition of anonymity, is that “they put you on a plane and you go back home”.\n\nExcept, she added, “you don’t necessarily have a home” because many expat aid workers go from mission to mission, with no home base in their country of origin.\n\nUSAID manages a budget of $42.8 billion, representing 42 per cent of humanitarian aid disbursed worldwide.\n\nNGOs will have to “lay off employees in proportion to their dependence on US funds”, she said.\n\n“If an NGO depends 60 per cent on USAID, it will have to lay off 60 per cent of its employees. If it depends 40 per cent, it will lay off 40 per cent.” It would be “impossible to compensate for the loss of US funds”, she said.\n\nThe Norwegian Refugee Council, one of the world’s largest aid agencies, said on Monday it was forced to abruptly suspend US-funded “urgent humanitarian work for hundreds of thousands of people in nearly 20 countries affected by wars, disasters and displacement”.\n\nJust under 20 per cent — $150 million — of its funding came from the United States last year, providing vital support for 1.6 million people.\n\nWhile the initial US funding freeze was set to last 90 days, the administration has already begun slashing USAID’s workforce, and many in the aid sector fear a drastic long-term drop in US support. Trump and Musk have publicly vowed to shutter USAID for good.\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:23:16.651Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891343/us-funding-freeze-bombshell-for-humanitarian-sector",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:26:56.000Z"
}
