{
  "title": "Land corruption inflicts Rs3tr loss in Karachi alone, says NAB chief - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Expressing serious concerns about realty fraudulent practices across Sindh, National Accountability Bureau (NAB) Chairman retired Lt Gen Nazir Ahmed Butt has disclosed that in Karachi alone documents for 7,500 acres have been falsified leading to corruption amounting to Rs3,000 billion, according to a press release of the Association of Builders and Developers (ABAD) on Tuesday.\n\n“If we open these files, it will cause a great upheaval,” the NAB chief remarked.\n\nHe regretted that for the past 40 years, the Lyari Development Authority (LDA), Karachi Development Authority (KDA), and Malir Development Authority (MDA) have failed to hand over possession to their allottees.\n\nDuring a visit to ABAD on Monday, he said if the association provides solid evidence, action will be taken against those responsible.\n\nABAD seeks land grant policy, third party record digitisation in Sindh\n\nHe emphasised his awareness of the builders’ and developers’ issues and affirmed NAB’s support, urging ABAD to consider the bureau as their ally.\n\nABAD chief Muhammad Hassan Bakhshi highlighted that in the past five years, 85,000 buildings have been constructed illegally in Karachi. He criticised the\n\nSindh government for selling land to favourites instead of conducting transparent auctions and called for a land grant policy.\n\nThe NAB chairman acknowledged the numerous problems faced by builders in Karachi and assured that NAB stands with them.\n\nHe mentioned that reforms have been made in NAB’s laws and that the system has been updated to determine which cases should now be filed.\n\nHe urged ABAD to provide evidence of the 85,000 illegal buildings in Karachi so that they can either be demolished or regularised based on ABAD’s recommendations.\n\nHe revealed that in the past eight months, NAB has recovered 1.8 million acres of agricultural land in Sindh, valued at Rs4,000bn, and handed it over to the Revenue Department.\n\nMr Butt noted that previously, anyone could file a complaint against anyone, but after assuming office, reforms have reduced the volume of complaints from 4,500 to 150-200. Approximately 21,000 complaints filed before 2022 have been dismissed.\n\nHe assured that if any NAB officer unlawfully harasses someone, strict action will be taken upon receiving a complaint. He acknowledged being aware of all the issues faced by builders.\n\nThe NAB chairman pointed out the lack of a proper record-keeping system for land in Sindh, with various land departments operating without interlinking.\n\nHe announced that significant action will soon be taken regarding land records in Sindh. He instructed the NAB Director-General to report on overseeing Karachi’s master plan.\n\nHe also mentioned establishing a regional NAB office in Gwadar to address ongoing land corruption there, with cases involving land worth approximately Rs3,000bn.\n\nABAD’s Patron-in-Chief Mohsin Sheikhani proposed that land transactions be subject to verification by NAB. He advocated for the digitisation of land records in Sindh to eliminate corruption, pointing out that the manipulation of land records has become widespread.\n\nHe suggested that third-party services be employed for digitisation, as corrupt institutions are digitising their records themselves\n\nPublished in Dawn, February 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:24:15.698Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891415/land-corruption-inflicts-rs3tr-loss-in-karachi-alone-says-nab-chief",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T01:51:47.000Z"
}
