{
  "title": "ANP leader Maulana Khan Zeb, cop gunned down in KP’s Bajaur: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Awami National Party (ANP) politician Maulana Khan Zeb and a policeman were shot dead on Thursday by unidentified suspects in Khyber Pakhtunkhwa’s Bajaur district, according to the police.\n\nBajaur District Police Officer (DPO) Waqas Rafiq told Dawn.com that the politician was shot dead in Shindai Mor while campaigning for the July 13 peace parade, adding that a policeman was also killed in the attack.\n\n“Three other people were injured in the shooting,” DPO Rafiq said. “This was a targeted killing carried out by unidentified shooters on motorcycles.”\n\nDPO Rafiq added that evidence had been collected from the crime scene.\n\nKhan Zeb was a member of the ANP’s central cabinet and held the office of secretary of ulema affairs, according to the party website.\n\nANP President Senator Aimal Wali Khan issued a statement condemning the killing, stating that the party would file a first information report against the state.\n\n“State institutions are complicit in this incident because they have maintained criminal silence,” the ANP chief was quoted as saying. “After consulting with Khan Zeb’s elder brother, Sheikh Jahanzada, an FIR for the killing will be registered against the state.”\n\nIn a post on X, Wali Khan posted photos of himself and Khan Zeb with the caption “devastated”.\n\nMeanwhile, ANP KP President Mian Ifitkhar Hussain strongly condemned the incident and declared three days of mourning in a statement shared on X.\n\n“This attack is not only an attack on the Awami National Party but also on the Pashtun consciousness and peace,” Hussain was quoted as saying.\n\nAccording to the statement, Hussain announced that the ANP’s KP chapter would observe three days of mourning, suspend all activities, and hoist black flags alongside party flags.\n\nThe statement added that Hussain was leaving for Bajaur and urged the party to maintain “morale, unity, and organisational discipline”.\n\nSimilarly, the office of KP Chief Minister Ali Amin Gandapur issued a statement condemning the incident and vowed to bring the suspects to justice.\n\nAccording to the statement, the CM condemned the shooting and ordered the relevant authorities to investigate the incident and promptly arrest the shooters.\n\n“Those involved in the incident will not be able to escape the grip of the law,” Gandapur was quoted as saying.\n\nThe Human Rights Commission of Pakistan (HRCP) issued a statement condemning the killing, hailing Khan Zeb as “a leading peace campaigner and political leader of the ANP”.\n\n“We demand a swift and impartial inquiry into this tragic incident,” the rights body wrote in a statement on X.\n\n“The federal and provincial governments must ensure that normalcy returns to the terror-stricken districts of the province and that people who have suffered for decades can lead their lives peacefully and without fear.”\n\nPoliticians in KP have been targeted in attacks in the past.\n\nThis year, the home of Bajaur MNA Mubarak Zeb Khan was attacked twice, with an improvised explosive device exploding outside his house in May and suspects launching a rocket at the residence in June.\n\nHe was not home during the IED attack and was unharmed in the second incident.\n\nMeanwhile, in March, the brother of former Jamaat-i-Islami (JI) senator Mushtaq Ahmad Khan was shot dead in KP’s Swabi.\n\nThe former senator confirmed on social media that his elder brother, Shakeel Ahmad Khan, was shot dead in front of his house by unidentified gunmen in the village of Ahad Khan in Swabi.\n\n“He was brutally killed in front of his home in an innocent village,” Mushtaq wrote. “My brother was very dear to me, he was my greatest help. It (his murder) is the greatest atrocity.”\n\nAdditional reporting by Zahid Imdad",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/10171556d1ea756.jpg",
  "retrievedAt": "2025-08-17T20:06:38.084Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923308/anp-leader-maulana-khan-zeb-cop-gunned-down-in-kps-bajaur-police",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T12:10:13.000Z"
}
