{
  "title": "British F-35 fighter stranded in Indian state of Kerala may fly home after nearly a month: report - World - DAWN.COM",
  "author": null,
  "content": "A British F-35B fighter jet stranded at an Indian airport for nearly a month, sparking memes and cartoons on social media, is expected to fly back home as early as next week, The Associated Press reported on Thursday, quoting Indian officials.\n\nThe Royal Navy aircraft was forced to make an emergency landing at Thiruvananthapuram International Airport on June 14 in the state capital and has been grounded ever since, despite efforts to repair it. The Indian Air Force said last month it would help in the repair and return of the jet, which made an emergency landing when it was flying over the Arabian Sea off Kerala’s coast.\n\nA British High Commission spokesperson had told Reuters the United Kingdom had accepted an offer to move the aircraft to the maintenance, repair and overhaul facility at the airport.\n\nAP reported today that officials said engineers hoped to repair the plane in the next few days before it could fly back to the UK “sometime next week”.\n\nThe British High Commission confirmed to the outlet that a British engineering team was deployed to “assess and repair” the aircraft.\n\n“There has been speculation in India that if the engineers fail to rectify the aircraft, it could be partially dismantled and transported in a cargo plane,” the report said, adding, however, that the UK’s Ministry of Defence “dismissed the speculation” in an emailed statement.\n\nEarlier this month, the UK’s Minister for the Armed Forces Luke Pollard said in parliament that a Royal Air Force crew were in Thiruvananthapuram and working with Indian counterparts.\n\nMeanwhile, Kerala’s tourism board had taken advantage of the aircraft’s presence, posting an AI-generated image of the plane with coconut trees in the background on July 2. The post was captioned “Kerala, the destination you’ll never want to leave.”\n\n“This was part of our tourism campaign. It has been one of the most innovative and eye-catching ones … It’s all in good humour and creativity,” Biju K, Kerala’s tourism secretary, had told Reuters.\n\nIn the viral social media post, originally created by entertainment website The Fauxy, the jet can be seen giving the state of Kerala five golden stars, calling it “an amazing place”.\n\n“I don’t want to leave. Definitely recommend,” the image quotes the jet as saying.\n\n“Though tourism is under the government, it has moved out of government space in promoting the destination,” said Roy Mathew, director of Stark Communications, the tourism department’s brand promotion agency.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1020323940b7c41.jpg",
  "retrievedAt": "2025-08-17T20:06:08.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923331/british-f-35-fighter-stranded-in-indian-state-of-kerala-may-fly-home-after-nearly-a-month-report",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T16:29:10.000Z"
}
