{
  "title": "Indian school principal, staff arrested after girls stripped for menstruation check - World - DAWN.COM",
  "author": null,
  "content": "The principal and attendant of a school in India’s Maharashtra state were arrested, while four teachers and two trustees were taken into custody for allegedly stripping around 10 girls to check if they were menstruating, Indian Express reported on Thursday.\n\nIn a statement released on Wednesday, police said that school staff informed the teachers and principal of bloodstains in the toilets. To find who was responsible, girls of classes 5-10 were called into the convention hall, where they were shown photos of bloodstains in the toilet and on the tiles.\n\nThe students were then asked to reveal who was on their periods. The teachers took down details, including thumb impressions, of the girls who raised their hands, and took the rest of the girls to washrooms where they were stripped and checked by attendants, the statement added.\n\nAccording to Thane rural police personnel, the accused principal asked the daughter of one of the complainant parents why she was using a sanitary pad when she was not menstruating, accusing the girl of lying and forcefully taking her thumb impression.\n\nThe police said that action was taken against the school management and administration after several parents protested at the school on Wednesday, seeking “stringent action” against the management and teachers after the girls came home crying and told them about the experience.\n\n“The act by the accused amounts to mental harassment to the girls,” one of the mothers was quoted as saying in her complaint.\n\nAccording to Indian Express, the police said that one of the parents registered a case against the school principal, four teachers, the attendant and two trustees.\n\nAll the accused were booked under sections 74 (assault or use of criminal force to woman with intent to outrage her modesty) and 76 (assault or use of criminal force to woman with intent to disrobe) of India’s criminal code, as well as relevant sections of the Protection of Children from Sexual Offences Act.\n\nMaharashtra Chief Minister Devendra Fadnavis has issued directives for strict action against those responsible, Water Minister Girish Mahajan told the state’s legislative assembly, according to Hindustan Times.\n\nA senior police officer said that the arrested — both women — will be produced before the court on Thursday, the report added.\n\nPolice were identifying witnesses and gathering more evidence from the students.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:06:44.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923295/indian-school-principal-staff-arrested-after-girls-stripped-for-menstruation-check",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T11:13:05.000Z"
}
