{
  "title": "Road collision kills 5 in KP’s Dera Ismail Khan: Rescue 1122 - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least five people were killed in a collision between a car and a truck on Chashma Road in Khyber Pakhtunkhwa’s Dera Ismail Khan district on Thursday morning, Rescue 1122 said.\n\nRescue 1122 Spokesperson for DI Khan Aizaz Mehmood told Dawn.com, “The collision took place near the Jholy Hotel within the limits of the Khari Khaisoor police station.\n\n“A family was heading towards DI Khan when their car collided with a truck that was on its way to Punjab.”\n\nHe said the Rescue 1122 team had “reached the scene soon after the incident, where it found all five people in the car dead”.\n\n“The bodies have been taken to the Paharpur Tehsil Headquarters Hospital, while the heirs of the deceased are being contacted to claim the bodies,” Mehmood said.\n\nThe deceased were identified as Rawda Munir, Muhammad Mutasim, Muhammad Talha, Muhammad Tufail and the driver Wasimullah. All were residents of DI Khan’s Zafar Abad Colony, he said.\n\nMeanwhile, DI Khan police spokesperson Yaqoob Khan said that an investigation into the incident is underway.\n\nRescue 1122 in June said that as many as 55 people were killed in a range of incidents over the Eid-ul-Azha holidays across KP. According to Rescue 1122 Director General Shah Fahad, 349 of the incidents reported were traffic accidents.\n\nTwo people were killed in separate traffic accidents in parts of DI Khan in June, both by speeding vehicles.\n\nAlso in DI Khan, five members of a family were killed and several others were injured in a road accident in May when a speeding dumper loaded with gas cylinders collided with a car on the Dera-Zhob highway near Sur Dagar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/10123416885350d.png",
  "retrievedAt": "2025-08-17T20:06:43.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923273/road-collision-kills-5-in-kps-dera-ismail-khan-rescue-1122",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T10:42:44.000Z"
}
