{
  "title": "Four killed, 15 missing after Houthis sink Greek ship in Red Sea - World - DAWN.COM",
  "author": null,
  "content": "ATHENS: Rescuers pulled six crew members alive from the Red Sea on Wednesday and 15 were still missing from the second of two ships sunk in recent days in attacks claimed by Yemen’s Iran-aligned Houthi militia after months of calm.\n\nFour of the 25 people aboard the Eternity C cargo ship were killed before the rest of the crew abandoned the vessel, which sank on Wednesday morning after being attacked on Monday and Tuesday, sources at security companies involved in a rescue operation said.\n\nThe six seafarers who were rescued had spent more than 24 hours in the water, they said. The Houthis said on Wednesday they had sunk the Eternity C.\n\n“The Yemeni Navy responded to rescue a number of the ship’s crew, provide them with medical care, and transport them to a safe location,” the group’s military spokesperson said in a televised address.\n\nLeading shipping industry associations call for maintaining robust support in protecting vital sea lanes\n\nThe Houthis claimed responsibility for a similar attack on Sunday targeting another ship, the Magic Seas. All crew from the Magic Seas were rescued before it sank.\n\nThe attacks on the two ships revive a campaign by the Iran-aligned fighters, who had attacked more than 100 ships from November 2023 to December 2024 in what they said was solidarity with the Palestinians, before a lull in their campaign earlier this year.\n\n“These vessels have been attacked with callous disregard for the lives of innocent civilian seafarers and as an inevitable but terrible consequence, seafarers have been killed,” leading shipping industry associations said in a joint statement on Wednesday.\n\n“This tragedy illuminates the need for nations to maintain robust support in protecting shipping and vital sea lanes.”\n\nRescue search\n\nBoth of the ships that were attacked flew Liberia flags and were operated by Greek firms. Some of the sister vessels in each of their wider fleets had made calls to Israeli ports in the past year, shipping data analysis showed.\n\n“We will continue to search for the remaining crew until the last light,” said an official at Greece-based maritime risk management firm Diaplous. The EU’s Aspides naval mission, which protects Red Sea shipping, confirmed in a statement that six people had been pulled from the sea.\n\nThe Red Sea, which passes Yemen’s coast, has long been a critical waterway for the world’s oil and commodities. Traffic has dropped since the Iran-aligned Houthi militia began targeting ships in November 2023 in what the group said was solidarity with Palestinians against Israel in the Gaza war.\n\nThe number of daily sailings through the narrow Bab al-Mandab strait, at the southern tip of the Red Sea and a gateway to the Gulf of Aden, numbered 30 vessels on July 8, from 34 ships on July 6 and 43 on July 1, according to data from maritime data group Lloyds List Intelligence.\n\nOil prices rose on Wednesday, maintaining their highest levels since June 23, also due to the recent attacks on ships in the Red Sea.\n\nSpeed boats\n\nEternity C was first attacked on Monday afternoon with sea drones and rocket-propelled grenades fired from speed boats by suspected Yemen-based Houthi militants, maritime security sources said. Lifeboats were destroyed during the raid. By Tuesday morning, the vessel was adrift and listing.\n\nTwo security sources said that the vessel was hit again with sea drones on Tuesday, forcing the crew and armed guards to abandon it. The Houthis stayed with the vessel until the early hours of Wednesday, one of the sources said.\n\nThere were fears that some of the crew who jumped into the water may have been kidnapped by Houthis, the source added. Skiffs were in the area as the rescue efforts were underway. The crew comprised 21 Filipinos and one Russian. Three armed guards were also on board, including one Greek and one Indian, who was one of those rescued.\n\nThe vessel’s operator, Cosmoship Management, has not responded to requests for confirmation of casualties or injuries. If confirmed, the four reported deaths would be the first fatalities from attacks on shipping in the Red Sea since June 2024.\n\nGreece has been in talks with Saudi Arabia, a key player in the region, over the latest incident, according to sources.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686eef9133624.jpg",
  "retrievedAt": "2025-08-17T20:08:08.180Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923153/four-killed-15-missing-after-houthis-sink-greek-ship-in-red-sea",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T02:38:51.000Z"
}
