{
  "title": "Actor Humaira Asghar may have died months ago: Karachi police - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Model and actor Humaira Asghar Ali, whose partially decomposed body was found a day earlier in her rented DHA apartment, may have died several months ago, police said on Wednesday.\n\nThe 32-year-old actor was found dead when police, accompanied by a bailiff, broke open the door of her fourth-floor apartment in Ittehad Commercial, Phase VI.\n\nDIG-South Syed Asad Raza told Dawn that police surgeon Summaiya Syed along with SSP-South Mahzoor Ali visited her flat and they suspected that she might have died around six months ago.\n\nElaborating, he said that the date of expiry of the bread and packaged milk kept in the refrigerator was September 2024.\n\nSimilarly, two SIMs in her cell phone were dead /inactive since September 2024 as per the call data record obtained by investigators. Besides, he said that power supply to her flat was disconnected in October 2024 reportedly by the KE ostensibly over non-payment of dues.\n\nThe police said the adjacent flat was empty during the period in which she was believed to have died.\n\nFamily refuses to take body\n\nThe DIG said that her family lived in Lahore and when the police approached them they, particularly her father, refused to take the body for burial.\n\nLater, he said, the deceased’s brother-in-law approached the police and he was expected to arrive here on Thursday (today) to meet with the police.\n\nAs people learned that her father refused to take the body, prominent showbiz personalities approached the police, expressing their willingness to perform the last rites and arrange the burial, the DIG said.\n\n“We shall hand them the body in case the family refuses,” he added.\n\nHe said that the cause of the death could be ascertained only after receiving chemical examiner’s report.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/686dae85decae.gif",
  "retrievedAt": "2025-08-17T20:07:50.807Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923110/actor-humaira-asghar-may-have-died-months-ago-karachi-police",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T02:39:12.000Z"
}
