{
  "title": "Police arrest 8 SBCA officials, owner in Lyari building collapse case - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least eight officials of the Sindh Building Control Authority (SBCA) were arrested on Thursday along with the owner of a building that recently collapsed in Karachi’s Lyari, claiming 27 lives.\n\nThe five-storey building on Fida Husain Shaikha Road in Lea Market collapsed on Friday morning, with the rescue operations concluding on Sunday. The building had already been declared uninhabitable by authorities due to its dilapidated structure, with the SBCA saying it had issued multiple prior notices to residents to vacate the structure since 2023.\n\nSouth Deputy Inspector General of Police Syed Asad Raza told Dawn.com that the arrests were made today after a first information report (FIR) was registered a day ago.\n\n“Nine officials and the present owner of the building were nominated in the FIR registered on a complaint of an official of the local government department. However, eight directors and deputy directors were arrested but one official was not arrested as he was sick,” he said. adding that the owner was arrested as well.\n\nThe provincial government had suspended SBCA Director General Ishaque Khuhro and announced strict action against all those responsible for the incident on Monday. Sindh Senior Minister Sharjeel Inam Memon said a fact-finding committee had been formed to present a report on the incident, adding that the Sindh chief minister ordered the home minister to immediately register an FIR.\n\nThe FIR was registered at the Baghdadi Police Station on the complaint of Hamadullah, a section officer of the Sindh Local Government and Housing Town Planning Department, under Sections 34 (common intention), 217 (public servant disobeying direction of law with intent to save person from punishment or property from forfeiture), 218 (public servant framing incorrect record or writing intent to save person from punishment or property from forfeiture), 288 (negligent conduct with respect to pulling down or repairing buildings), 322 (punishment for qatl-bis-sabab), 337-Ai (whoever, by doing any act with the intention of thereby causing hurt to any person, or with the knowledge that he is likely thereby to cause hurt to any person causes shajjah-i-khafifah) and 427 (mischief causing damage amounting to Rs50) of the Pakistan Penal Code.\n\nThe FIR said the building, spread over 527.3 square yards, was constructed in 1986. Its owner constructed the five-storey plus ground floor building in two portions, and for a considerable period, both portions (buildings) were in dilapidated condition and were unlivable. It added that one building with 20 apartments collapsed on July 4 due to the “criminal negligence” of the SBCA officials and the owner.\n\nThe FIR said the SBCA officials were aware of the dilapidated condition of the building over the years till the collapse. It added that the officials “completely failed” to perform their official duty and “committed negligence and carelessness”.\n\nThe FIR further said that the officials “deliberately” did not mention in the official record that the building was dilapidated. It also added that the present owner of the building and other unknown owners also knew that it was not livable for humans. Despite this, the owners gave several flats on rent to members of the Hindu community and committed negligence.\n\nThe complainant said he wanted legal proceedings against the SBCA officials and owners of the building.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/071409496ddc8bf.jpg?r=141626",
  "retrievedAt": "2025-08-17T20:06:18.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923330/police-arrest-8-sbca-officials-owner-in-lyari-building-collapse-case",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T16:16:05.000Z"
}
