{
  "title": "Lahore Police arrest suspect in ‘horrific’ animal torture case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Punjab Police on Thursday arrested a suspect allegedly involved in “horrific” animal torture being committed in Lahore and put a stop to the activity.\n\nLahore’s JFK Animal Rescue and Shelter said it received reports about an “extremely horrific situation after an Instagram influencer was seen posting torturing and killing animals, including bunnies and cats”.\n\nThe organisation said it immediately contacted the police, who reached the location to find dead bodies of animals and blood, with the suspect found “laughing” when approached. The shelter said it would register a case against her and the animals were moved to shelters by the Police Animal Rescue Centre (PARC).\n\nVisuals shared by the shelter showed cats, rabbits and birds of prey in captivity at the site.\n\nLahore Assistant Superintendent of Police (ASP) Syeda Shehrbano Naqvi addressed the incident in a video, saying: “We just came back from a case where a girl … was torturing animals and she had rabbits, some exotic animals, cats and a lot of other stuff.”\n\nShe said the suspect had been posting graphic imagery of animal cruelty and violence on social media. The policewoman urged the public not to gift pets to someone suffering from mental issues.\n\n“Please, start talking about animal cruelty because animal cruelty leads to us being cruel towards children [and] us being cruel towards vulnerable communities.”\n\nShe told Dawn.com the suspect was arrested and admitted to a mental healthcare facility.\n\nASP Naqvi said a case was registered on PARC’s complaint at Defence B Police Station under Pakistan Penal Code Section 289 (negligent conduct with respect to animal), Section 3 (penalty for cruelty to animals and for sale of animals killed with unnecessary cruelty) of the Prevention of Cruelty to Animals Act, 1890, and Sections 10A (cruelty to animal prohibited), 12 (certificate of lawful possession) and 15 (restriction on dealings in animals, trophies or meat) of the Punjab Wildlife (Protection, Preservation, Conservation, and Management) Act, 1974.\n\nThe reason given by the ASP for the FIR was “cruelty towards animals after caging them and then killing animals and posting videos/pictures of the graphic content on Instagram and other social media platforms.”\n\nPARC was established as a pioneering institution in Lahore in 2023, making significant strides over the past year in rescuing and protecting animals from abuse, neglect and abandonment.\n\nSince its inception, PARC has safely relocated 1,130 animals to protection centres where they received proper care and treatment. These efforts have played a vital role in reducing animal suffering in urban settings. It generated a detailed report on animal abuse and the protection of animal rights in May, saying it had rescued 1,379 animals, 50 of them from extreme cruelty, in two years.\n\nPakistan has almost no animal welfare policy or service in place. The most prominent law for animal protection, the Prevention of Cruelty to Animals Act (1890) — which dates back to the colonial era — is limited in scope and lacks understanding of animal welfare in today’s context.\n\nThe federal government did pass a law in 2018, increasing the fines for animal cruelty. It increased the maximum fine to Rs100,000 for animal cruelty, which had remained at the Rs50 level since the law was first passed in 1890, for first-time offenders. The minimum fine was raised to Rs10,000. There was a similar increase in fines for other offences against animals.\n\nHowever, the law is only applicable in the federal capital, and does not extend to the rest of Pakistan. This is because animal welfare became a provincial subject after the 18th Amendment, and provinces are required to enact their own laws.\n\nThat is yet to happen, resulting in punishment for offences against animals in the rest of Pakistan staying the same as they were under the 1890 law.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/101830580b51005.jpg",
  "retrievedAt": "2025-08-17T20:06:25.656Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923321/lahore-police-arrest-suspect-in-horrific-animal-torture-case",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T13:49:51.000Z"
}
