{
  "title": "87 online scam suspects on physical remand in Faisalabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: Faisalabad Special Court Judge Malik Muhammad Ashfaq on Wednesday allowed a five-day physical remand of 87 suspects, including 18 women, allegedly involved in various cybercrimes, and sent 62 others to district jail on 14-day judicial remand, on the request of the National Cybercrime Investigation Agency (NCCIA).\n\nTotal 149 suspects, including 48 Chinese and other foreign and Pakistani nationals, were arrested on Tuesday last by an NCCIA team in a raid on a factory at Chak 54 RB, Sirohli, reportedly owned by Faisalabad Electric Supply Company (Fesco) Board of Directors former chairman Malik Tehseen Awan.\n\nThe suspects were presented in the court amid tight security.\n\nThe court accepting the NCCIA request allowed a five-day physical remand of 87 suspects to the agency for their interrogation regarding the online scam, depriving people of millions of rupees through various Ponzi schemes.\n\n62 others sent on 14-day judicial remand to dist jail\n\nThe court sent 62 other suspects on a 14-day judicial remand.\n\nThe prime suspect, Mr Awan, allegedly managed to escape during the NCCIA raid on his factory from where the network was being run. He was booked in seven FIRs by the agency.\n\nMeanwhile, Faisalabad NCCIA head has written to the director if Integrated Border Management System of National Response Centre For Cybercrimes for placement of Mr Awan’s name on the Provisional National Identification List (passport control list).\n\nThe director says that efforts are being made to arrest the prime suspect who has gone in hiding.\n\nARRESTED: An FIA team on Wednesday arrested a man for defrauding people on the pretext of sending them to the Kingdom of Saudi Arabia (KSA) for employment.\n\nAs per the FIA officials, the suspect,Farrukh Nazir Nakodria, was arrested in a raid on a premises atChak 126/15-L, Mianchannu.\n\nThe officials say the suspect had escaped to the KSA after extorting millions of rupees from people.\n\nWORKSHOP: The younger generation must be equipped with artistic skills that provide them with a unique viewpoint to observe the world minutely and depict the real issues and beauty, compelling them to think out of the box.\n\nFaculty of Arts and Humanities Dean, University of Faisalabad (UAF), Dr Shazia Ramzan said this while addressing a painting workshop arranged by the Department of Art and Design.\n\nDr Kiran Khalid urged the students to develop creativity, adding that art exhibition were the need of the hour to hone their skills.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0909510234a9e28.png?r=095112",
  "retrievedAt": "2025-08-17T20:07:06.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923236/87-online-scam-suspects-on-physical-remand-in-faisalabad",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T04:02:59.000Z"
}
