{
  "title": "Pakistan eyes $1 billion valuation in Roosevelt Hotel redevelopment plan, source says - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan is seeking a valuation of at least $1 billion for the Roosevelt Hotel it owns in New York and is ready to part with a minority stake in the prime Manhattan property as it scouts for a redevelopment partner, a senior government official said.\n\nNamed after former US President Theodore Roosevelt, the century-old property in midtown Manhattan is seen as one of Pakistan’s most valuable foreign assets, which it acquired in 2000. Faced with mounting losses, the over 1,000-room hotel was shut in 2020, and has also operated briefly as a migrant shelter.\n\nAs part of its $7bn IMF-backed privatisation push, the government approved a “transaction structure for the Roosevelt Hotel” on Tuesday, saying it won’t do an outright sale but has decided to adopt a joint venture model to maximise long-term value. It gave no further details.\n\nThe senior official said the government will retain ownership in the project through an equity partnership, but declined to disclose the size of the stake being offered to any potential JV partner.\n\nThe official declined to be named since the process is confidential. JLL, or Jones Lang LaSalle, will run the process and the government is eyeing a valuation of over $1bn for the 42,000 square feet property it hopes could be redeveloped for residential-cum-office use, the official said.\n\n“It is among the best pieces of land in NY real estate … The process begins immediately and is expected to be completed in the next six to nine months,” said the official.\n\nThe Privatisation Ministry and state-owned Pakistan International Airlines (PIA), which owns the hotel through its investment arm, did not respond to requests for comments, and neither did JLL.\n\nPakistan this week also approved four parties to bid for a stake in debt-ridden PIA.\n\nThe hotel is located near marquee New York destinations such as Grand Central Terminal, Times Square, and Fifth Avenue, placing it in one of Manhattan’s most valuable commercial zones.\n\nThe government is estimating the redevelopment will take 4–5 years, the official said, adding the “interest level is extremely high”.\n\nIn June, the government said it expects $100 million in the initial payment from the joint-venture partnership by June 2026.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/10150214ac2d153.jpg",
  "retrievedAt": "2025-08-17T20:06:43.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923293/pakistan-eyes-1-billion-valuation-in-roosevelt-hotel-redevelopment-plan-source-says",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T10:57:53.000Z"
}
