{
  "title": "Plea for free number plates with Ajrak design filed in SHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A petition was filed in the Sindh High Court (SHC) on Wednesday, seeking directives for provincial authorities to issue new Ajrak-designed vehicle registration number plates to citizens free of cost.\n\nThe petitioner also requested the SHC to restrain the respondents from seizing vehicles and imposing hefty fines during the ongoing crackdown on old number plates.\n\nCiting the secretary excise & taxation department, deputy director motor vehicle registration wing and deputy inspector general of traffic police as respondents, Faizan Hussain petitioned the SHC and submitted that he was a social worker and chairman of Karachi Nojawan Party and Nojawan Foundation.\n\nHe said that thousands of helpless individuals had been deprived of their legal and constitutional rights due to the influence of powerful individuals and the harsh attitude of the authorities. Citizens, he argued, were being forced to purchase expensive new number plates and were facing harassment.\n\nHe further submitted that the excise and taxation department had ordered the replacement of the old yellow number plates on all private and commercial vehicles with newly designed plates featuring the Ajrak pattern and set a deadline of May 3.\n\nThe petitioner maintained that vehicles were being seized and heavy fines imposed for failing to replace the number plates, despite the fact that the old registration plates had also been issued by the government for a fee. He argued that there was no legal justification for penalising citizens or depriving them of the right to use their vehicles.\n\nHe contended that if a new policy for number plates had been introduced, the plates should be issued free of cost, as citizens had already paid fees for registration. He claimed that the respondents’ actions were in violation of principles of natural justice and constitutional provisions.\n\nThe petitioner also alleged that the issuance of new number plates had turned into a commercial activity which was causing hardship and financial strain on citizens. Despite collecting significant fees, the authorities had failed to issue the new plates in a timely manner, forcing many people to wait for months.\n\nHe further claimed that the official plates were not being issued through proper channels but were instead being produced by unauthorised individuals operating roadside stalls, who were minting money from citizens illegally.\n\nAccording to the petitioner, the respondents were charging Rs500–700 for motorcycles, Rs1,500–2,000 for private vehicles, and Rs2,000–3,000 for commercial vehicles. He argued that such costs were financially burdensome, especially for people already struggling to afford petrol, food, school fees and other basic necessities.\n\nHe also alleged that in addition to the fixed fees, officials were demanding bribes and harassing citizens during the ongoing crackdown, including seizing vehicles and imposing excessive fines without justification.\n\nThe petitioner argued that these actions, particularly by traffic police, were illegal, amounted to abuse of power and were creating fear and harassment among law-abiding citizens, including himself.\n\nHe urged the court to direct the respondents to act in accordance with the law, refrain from harassing citizens, issue the Ajrak-designed number plates free of cost and facilitate the public by extending the deadline.\n\nThe petitioner also pleaded to restrain the respondents from seizing the vehicles and imposing hefty fines upon the owners/drivers of such vehicles.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/686451e50a1fa.gif",
  "retrievedAt": "2025-08-17T20:07:50.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923112/plea-for-free-number-plates-with-ajrak-design-filed-in-shc",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T02:39:12.000Z"
}
