{
  "title": "Fatigued Afghan taxi drivers take novel approach to staying cool - World - DAWN.COM",
  "author": null,
  "content": "Afghan taxi drivers have cobbled together a creative solution to spare them and their passengers from the sweltering heat.\n\nIn southern Afghanistan’s Kandahar city, where temperatures easily exceed 40 degrees Celsius, blue taxis can be spotted with an air conditioning (AC) unit strapped to the roof with an exhaust hose delivering the cool air through the passenger window.\n\n“It started getting extremely hot three or four years ago. These cars’ AC systems didn’t work and repairs were too expensive. So I went to a technician, [and] had a custom cooler made,” said driver Gul Mohammad.\n\nThe 32-year-old spent 3,000 Afghanis ($43) for the system, which he connects to his taxi’s battery and regularly refills with water.\n\n“This works better than [built-in] AC. ACs only cool the front — this cooler spreads air throughout,” said fellow driver Abdul Bari.\n\nOther devices are connected to solar panels, also mounted on the taxi’s roof.\n\nAfghanistan, one of the poorest countries in the world, is also one of the most vulnerable to the effects of climate change. It is particularly affected by heat waves and is suffering from increased drought.\n\nMurtaza, a 21-year-old technician, said that demand from taxi drivers has been growing over the past two or three years.\n\n“Many cars weren’t equipped with air conditioning anyway, which is why we’re installing these,” he told AFP in his small shop in central Kandahar.\n\nAfghan cities are often saturated with ageing vehicles, which are enjoying a last-ditch life after being transferred from neighbouring countries.\n\n“When there’s no cooler, it becomes very difficult,” said Norullah, a 19-year-old passenger who did not provide a last name, his face inches from the blast of cold air. “These drivers are helping solve the problem, and that’s great.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1019193032c4e23.jpg",
  "retrievedAt": "2025-08-17T20:06:16.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923328/fatigued-afghan-taxi-drivers-take-novel-approach-to-staying-cool",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T14:26:46.000Z"
}
