{
  "title": "Fact check: Supreme Court has not declared ban on 27 YouTube channels unconstitutional - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from users on social media platforms X and Facebook on Wednesday claimed that the Supreme Court had declared an Islamabad court’s ban on 27 YouTube channels unconstitutional. However, no such development has occurred.\n\nIt emerged on Tuesday that an Islamabad court last month ordered YouTube to block 27 channels for disseminating “fake, misleading, and defamatory” content against the government and armed forces.\n\nAmong the 27 sanctioned accounts — run by journalists, political commentators and social media in­­fluencers in Pakistan and overseas — are those of the PTI, Matiuallah Jan, Wajahat Khan, Ahmad Noorani and Asad Ali Toor, Imran Riaz, Orya Maqbool, Sabir Shakir, and Moeed Pirzada.\n\nOn Wednesday, former anchorperson Sabir Shakir said in a post on X: “Supreme Court declares ban on 27 YouTube channels unconstitutional.”\n\nThe post was seen by more than 39,000 people.\n\nThe same claim was shared by several other X users as can be seen here, here, here and here.\n\nThe claim also circulated on Facebook, as can be seen here, here, here and here.\n\nA fact-check was initiated to determine the veracity of the claim due to keen public interest in the matter related to the ban on 27 YouTube channels.\n\nObserving the press statement in Shakir’s post showed that it was of the Supreme Court Bar Association (SCBA) of Pakistan, not the Supreme Court itself.\n\nFurther investigation through a keyword search led to a post on X dated July 9 by journalist Hasnaat Malik, a senior reporter covering Supreme Court affairs. He shared the press statement, with the caption: “Supreme Court Bar Association President Mian Rauf Atta has said that the judicial magistrate’s order regarding the closure of 27 YouTube channels is a violation of several constitutional provisions.”\n\nThe same SCBA statement was also shared by Toor on X.\n\nThe SCBA is an independent body established in 1989, comprising lawyers who practice before the Supreme Court. Formed under the Legal Practitioners and Bar Councils Act, 1973, and operating under the Pakistan Bar Council, the SCBA works to uphold the rule of law and protect the interests of the legal profession and the public. It is important to note that SCBA is not part of the Supreme Court and functions independently.\n\nA keyword search to corroborate the alleged development yielded no news reports confirming that the Supreme Court declared the ban unconstitutional or took any action in the matter.\n\nThe same was confirmed by Dawn correspondent Umer Mehtab, who covers Supreme Court reporting, that the apex court was not involved in the matter.\n\nHe further said that any appeal against the Islamabad court’s order would first have to go and be processed in the high court. Any appeal against a lower court’s order cannot bypass the high court to go directly to the Supreme Court.\n\nTherefore, the fact-check determined that the claim that the Supreme Court has declared the ban on 27 YouTube channels unconstitutional is false. No such development has occurred and so far only the SCBA, an independent body from the Supreme Court, has criticised the blocking order.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0918480773594ae.jpg?r=185007",
  "retrievedAt": "2025-08-17T20:06:10.483Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923287/fact-check-supreme-court-has-not-declared-ban-on-27-youtube-channels-unconstitutional",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T17:38:40.000Z"
}
