{
  "title": "Investments rise in data and AI, outpacing physical assets: UN - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: The purchase of physical assets was eclipsed last year by a surge in investment in intangible items like software, data and AI, the UN said on Wednesday, describing a “fundamental shift in how economies grow and compete”.\n\nInvestment in intellectual property-backed assets grew three times faster in 2024 than investments in physical objects like machinery and buildings, which have been hit by high interest rates and a subdued economic recovery, the United Nations’ World Intellectual Property Organisation (WIPO) said in a fresh report.\n\nThe report, which was co-published with Italy’s Luiss Business School, showed that intangible investment across 27 high- and middle-income economies grew about three percent in real terms last year, reaching $7.6 trillion, up from $7.4 trillion a year earlier. “We’re witnessing a fundamental shift in how economies grow and compete,” WIPO chief Daren Tang said in a statement.\n\n“While businesses have slowed down investing in factories and equipment during uncertain times, they’re doubling down on intangible assets,” he said, stressing that “this trend has profound implications for policymakers”.\n\nSweden emerges as world’s most intangible-asset-intensive economy\n\n“Countries that understand and nurture intangible investment will be better positioned to grow and thrive in a global economy increasingly driven by technological, digital and cultural innovation.” In 2024, the United States led in absolute levels of intangible asset purchases, investing nearly double what runners-up France, Germany, Japan and Britain pumped into such assets, WIPO said.\n\nSweden, meanwhile, remained the world’s most intangible-asset-intensive economy, with such investments accounting for 16pc of the country’s gross domestic product.\n\nThe United States, France and Finland followed, each with an intensity of 15pc of GDP. India’s intangible investment intensity of nearly 10pc put it ahead of several European Union economies and of Japan, WIPO said.\n\nThe report indicated that investment in intangible assets has shown sustained and resilient growth even during periods of crisis, swelling at a compound annual rate of around four percent between 2008 and 2024.\n\nThat compares to just one percent for tangible asset investments, WIPO said. Software and databases account for the fastest growing types of intangible asset investments, growing by more than seven percent annually between 2013 and 2022, the report showed. At the same time, it highlighted that such investments coincided with and were likely driven by the current artificial intelligence boom.\n\nAI has already been driving investments in tangible infrastructure, including chips, servers and data centres, and the report suggested it had begun boosting more intangible investments in things like data sets needed to train AI systems.\n\n“People think that we are already in the middle of the AI (boom), but we are actually just at the beginning,” Sacha Wunsch-Vincent, head of WIPO’s department for economics and data analytics.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/682e7ebb12ab4.jpg",
  "retrievedAt": "2025-08-17T20:08:15.388Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923157/investments-rise-in-data-and-ai-outpacing-physical-assets-un",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T02:38:51.000Z"
}
