{
  "title": "June was hottest on record in western Europe - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Western Europe sweltered through its hottest June on record last month, as “extreme” temperatures blasted the region in punishing back-to-back heatwaves, the EU climate monitor Copernicus said on Wednesday.\n\nGlobally, this past June was the third warmest on record, continuing a blistering heat streak in recent years as the planet warms as a result of humanity’s emissions of greenhouse gases.\n\nThe previous hottest June was in 2024 and the second hottest was in 2023, the Copernicus Climate Change Service (C3S) said. Sweltering extremes were particularly pronounced in Europe, which is warming several times faster than the global average.\n\nMillions of people were exposed to high heat stress across parts of the continent as daily average temperatures in western Europe climbed to levels rarely seen before — and never so early in the summer.\n\nSeveral countries recorded surface temperatures above 40 degrees Celsius, with heat of up to 46C in Spain and Portugal, Copernicus said. Samantha Burgess, the EU monitor’s Strategic Lead for Climate, said the impact of the heatwaves in Europe was “exceptional”, intensified by record sea surface temperatures in the western Mediterranean — which hit an all-time daily maximum in June.\n\n“In a warming world, heatwaves are likely to become more frequent, more intense and impact more people across Europe,” she said. The two heatwaves — from June 17 to 22, and again from June 30 to July 2 — were linked to heat domes trapping warm air over affected regions, prolonging the stifling weather, and worsening pollution and wildfire conditions.\n\nPortugal, Spain, France, Italy, and much of the Balkans saw some of the hottest “feels-like” temperatures, which measure the impact on the human body by taking into account factors like humidity. Maximum feels-like temperatures north of Lisbon hit 48C, around 7C above average and associated with “extreme heat stress”, said Copernicus.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0221305958cbc1d.jpg?r=214959",
  "retrievedAt": "2025-08-17T20:08:17.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923162/june-was-hottest-on-record-in-western-europe",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T02:38:51.000Z"
}
