{
  "title": "Govt hints at denying entry to PTI founder’s sons if they come to ‘spread discord’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Minister of State for Law and Justice Barrister Aqeel Malik on Wednesday warned that the government could deny entry to the sons of PTI founder Imran Khan if they travelled to Pakistan and “spread discord”.\n\nImran’s sons — Suleman Khan (28) and Kasim Khan (26) — had called attention to their father’s incarceration in a rare public appearance in May. Imran, imprisoned since August 2023, is serving a sentence at the Adiala Jail in the £190 million corruption case and also faces pending trials under the Anti-Terrorism Act related to the May 9, 2023 protests. It was the first time the two had publicly talked about their father’s incarceration.\n\nOn Monday, Kasim uploaded a post on X calling for his father’s release, saying that the PTI founder had been imprisoned for 700 days and cut off from his family and even his personal physician.\n\nImran’s sister Aleema Khan told reporters a day ago outside Adiala Jail that the two would join an upcoming PTI protest movement. She claimed that the sons would go to the United States to present their father’s case before coming to Pakistan to join the movement.\n\nAddressing the matter on Geo News programme ‘Capital Talk’, Malik said the government had no issue with Kasim and Suleiman entering Pakistan, provided they do not engage in protests or political activity.\n\nMalik noted that, being British nationals, Kasim and Suleiman could not legally participate in Pakistani political activity. He alleged that the boys are “coming to spread discord and there is no permission for this”.\n\n“If they intend to get a visa to visit Pakistan, the concerned authorities in the interior ministry will look at their purpose of visit … But their aunt (Aleema) said … that they are coming to join the PTI movement,” the minister asserted.\n\n“We have no issue with them coming here, but we have an issue with them participating in political activity as foreign nationals.”\n\nHe further said: “I do not believe that they will actually come here … If they had any family values, they would have come to see their father earlier.”\n\nMalik said the PTI needed to “perform a political stunt” and the party, Aleema and Imran were “using these boys as trump cards”. “This is their last option,” he added.\n\nOn a different note, Minister of State for Interior Talal Chaudhry said while talking to reporters earlier today: “His children should come and get to know what their father has done with the country. It is a very good thing but they won’t come.”\n\nHowever, Prime Minister’s Adviser on Political Affairs Rana Sanaullah stated in an interview on the ARY News show ‘Khabar’ a day ago that the sons could face arrest.\n\n“Their coming here [will achieve nothing] except difficulties for them and then the UK Embassy will have to get them released and take them back.”\n\nQuestioned if he meant they could be arrested upon participation in the PTI protest, Sanaullah said: “Why won’t they be arrested? If they come here to lead a violent movement, then what will be the consequence of that?”\n\nAsked about his supposing the movement to be violent, he said the PTI could no longer be trusted after the events of its past protests.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:09:06.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923089/govt-hints-at-denying-entry-to-pti-founders-sons-if-they-come-to-spread-discord",
  "dateList": "2025-07-10",
  "date_published": "2025-07-09T19:17:24.000Z"
}
