{
  "title": "Punjab CM launches mobile Montessori schools - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz on Wednesday announced the launch of ‘On-Wheel Montessori Schools’ initiative and the province’s first-ever school transport service for public schools.\n\nShe made the announcements during a high-level meeting held to review the performance and future plans of the School Education Department (SED).\n\nThe CM also introduced two new recognition programmes — the ‘School of the Month’ award and the ‘Teacher of the Month’ award.\n\nShe directed officials to start work on the mobile Montessori school project and expand the Nawaz Sharif Centers of Excellence programme from currently serving 240 students to 1,500 students.\n\nProvincial Minister for School Education Rana Sikandar Hayat presented achievements under the public-private partnership model. He said that enrollment at outsourced schools had increased by 99pc and teaching staff had increased by 114pc. He said the programme had created employment opportunities for over 60,000 educated youth while adding 1.3 million new students to the system in just 16 months. Infrastructure improvements included renovation of 5,018 classrooms, roof repairs of 2,887 rooms and conversion of more than 50 schools to solar energy, he added.\n\nThe meeting also approved expansion of the ‘School Meal Program’ to include Dera Ghazi Khan, Layyah, Lodhran, Bhakkar, Mianwali and Bahawalnagar districts, with plans to supplement milk with energy bars and biscuits. The meeting had also set targets of construction of 10,000 early-childhood education classrooms, 6,000 STEM labs across the province, and 400 new toilet blocks in girls’ schools.\n\nThe minister said that digital initiatives had also progressed with Google training programmes for teachers and students underway, and an English proficiency drive aiming to bring 300,000 students to IELTS Standard-4 conversational level within six months.\n\nThe CM emphasised that public schools must surpass private sector standards and directed for enhanced teacher training and standardised school entrance process province-wide.\n\nPublished in Dawn, July 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2023/02/63fe835795779.gif",
  "retrievedAt": "2025-08-17T20:07:05.427Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923238/punjab-cm-launches-mobile-montessori-schools",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T04:04:16.000Z"
}
