{
  "title": "Iran threats in UK ‘significantly increased’: intelligence watchdog - World - DAWN.COM",
  "author": null,
  "content": "A United Kingdom parliamentary committee on Thursday blamed Iran for at least 15 attempts to kill or kidnap British-based individuals since 2022, saying the threat from Iran had “significantly increased”.\n\nLondon’s response has been too focused on “crisis management”, said parliament’s intelligence and security committee, with concerns over Iran’s nuclear programme dominating their attention too much.\n\nTehran swiftly issued a “categorical rejection of the unfounded, politically motivated and hostile allegations”.\n\nThe committee’s claims were “baseless, irresponsible, and reflective of a broader pattern of distortion intended to malign Iran’s legitimate regional and national interests”, said its London embassy.\n\nThe report comes after growing alarm in Britain at alleged Iranian targeting of dissidents, media organisations and journalists in the UK, including accusations of physical attacks.\n\nIran in March became the first country to be placed on an enhanced tier of the Foreign Influence Registration Scheme, which aims to boost Britain’s national security against covert foreign influences.\n\nIt requires all persons working inside the country for Iran, its intelligence services or the Revolutionary Guard to register on a new list or face jail.\n\n“Iran poses a wide-ranging, persistent and unpredictable threat to the UK, UK nationals, and UK interests,” Kevan Jones, chairman of the watchdog committee, said in the report’s conclusions.\n\n“Iran has a high appetite for risk when conducting offensive activity and its intelligence services are ferociously well-resourced with significant areas of asymmetric strength.”\n\nJones said it bolstered this through proxy groups, “including criminal networks, militant and terrorist organisations, and private cyber actors” to allow for deniability.\n\nHis committee’s report said that while Iran’s UK activity “appears to be less strategic and on a smaller scale than Russia and China”, it “should not be underestimated”.\n\nThe physical threat posed had “significantly increased” in pace and volume, and was “focused acutely on dissidents and other opponents of the regime” as well as Jewish and Israeli interests in the UK, it said.\n\n“The Iranian Intelligence Services have shown that they are willing and able — often through third-party agents — to attempt assassination within the UK and kidnap from the UK,” the report said.\n\n“There have been at least 15 attempts at murder or kidnap against British nationals or UK-based individuals since the beginning of 2022.”\n\nSimilarly, security minister Dan Jarvis said in March that Britain’s MI5 domestic intelligence service had tallied 20 Iran-backed plots “presenting potentially lethal threats to British citizens and UK residents”.\n\nThe watchdog committee took evidence for two years from August 2021 for its report, a period which saw Tehran implicated in a plot to kill two London-based Iran International television anchors.\n\nIn March last year, one of the Persian-language outlet’s journalists was stabbed outside his London home. Two Romanian men have been charged in relation to the attack and face extradition to the UK to stand trial.\n\nThe counter-terrorism unit of London’s Metropolitan Police led the investigation. Iran’s charge d’affaires in the UK has said that the Tehran authorities “deny any link” to the incident.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/082234547cc77ec.jpg?r=230001",
  "retrievedAt": "2025-08-17T20:06:09.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923338/iran-threats-in-uk-significantly-increased-intelligence-watchdog",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T17:20:09.000Z"
}
