{
  "title": "President Zardari visits Kashgar Free Trade Zone",
  "author": null,
  "content": "KASHGAR, Sep 20 (APP):President Asif Ali Zardari Saturday visited the Kashgar Free Trade Zone, the only facility of its kind in southern Xinjiang and an important hub for trade and logistics in the region.\nThe President was received by Yao Ning, CPC Party Secretary of Kashgar, and was briefed on the zone’s growth since its establishment in 2015.\nSpread over 3.56 square kilometres, the zone brings together bonded warehousing, logistics, processing, customs clearance, and air freight services. It has trade links with 118 countries, with exports ranging from electric vehicles and batteries to solar cells, high-tech goods, and auto parts.\nPresident Zardari was informed that the zone is connected by road, rail and air to both Asia and Europe, with its own international airport. It is linked with Sost port in Gilgit-Baltistan, just 400 kilometres away, and with Gwadar port at a distance of 2,000 kilometres. The zone handles both imports and exports through these routes.\nThe President also visited stalls and kiosks representing various countries, including Central Asian states, European countries, South Korea, and Japan.\nOfficials further briefed the President on the digital trade centre established in 2024, now home to more than 5,400 companies, and the cross-border e-commerce exhibition centre showcasing duty-free products from across Central Asia, Europe, and beyond.\nPresident Zardari was also updated on the “Two Countries, Twin Parks” initiative, including an authorised Uzbekistan industrial park that enables warehouse-to-warehouse delivery within 72 hours, and a Kyrgyzstan-backed park under development for automotive assembly and LED production.\nSenator Saleem Mandviwalla, Sindh Minister Syed Nasir Hussain Shah, along with the Pakistani ambassador to China and the Chinese Ambassador to Pakistan, accompanied the President during the visit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-20T18:36:36.909Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-zardari-visits-kashgar-free-trade-zone/",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T17:49:00.000Z"
}
