{
  "title": "No political future of PML-N, PPP: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/no-political-future-of-pml-n-ppp-sheikh-rashid/",
  "date_published": "2020-03-12T01:27:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 12 (APP):Minister for Railways Sheikh Rashid Ahmed Thursday said that politics of Pakistan Muslim League Nawaz (PML-N) would be obscured if Shahbaz Sharif failed to come back Pakistan.\nHe said this while speaking as Chief guest at the Oath taking ceremony of students council of Government Post Graduate college for women her at 6th road.\nThe minister said there was no future of Pakistan People Party (PPP) and PML-N in the politics of Pakistan and expressed hope that Imran Khan would bring the country out of crises, it had inherited.\n“Shehbaz Sharif should be ashamed of himself and now should return home on the advice of his party,” he said.\nSheikh said the probe was underway against those who created the artificial crises of sugar and flour in the country, adding, the prime minister would soon take the decision to bring the prices of gas and electricity down.\nThe minister said that women education was vital for the development of any nation and two more universities including Information technology university and Railway university were being set up to make the girls of this region more empowered.\nThe minister said “our future is linked with the educated mothers and if we do not educate women, our future will be dark as an educated mother can bring up their children in a better way.”\n“You are the guarantee of the bright future of Pakistan and you will make the country great and greater. It’s our job to provide the best resources and we will continue doing this job,” he asked the students.\n“When the first Fatima Jinnah Women University was built, it was posed who would study in it. But today, girls from all provinces including Gilgit-Baltistan are getting education there,” he remarked.\nSheikh said the government was determined to provide best health facilities to the residents of city, adding, the construction work of 440-beds hospital was underway which would be completed in 2021. Rashid said that 14 operation theaters would be set up in the hospital including a hostel for working staff.\nLater, the minister administered oath to the newly elected body of students council.",
  "retrievedAt": "2025-08-11T18:56:42.080Z"
}
