{
  "title": "Pakistan, Sweden discuss multiple bilateral ties in 16th round of political consultations",
  "link": "https://www.app.com.pk/national/pakistan-sweden-discuss-multiple-bilateral-ties-in-16th-round-of-political-consultations/",
  "date_published": "2020-03-12T01:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):The 16th round of Pakistan-Sweden Bilateral Political Consultations was held here Thursday wherein the two sides discussed the entire range of bilateral relations, including political, economic, trade, investment and education.\nMinistry of Foreign Affairs Special Secretary (Europe) Dr Aman Rashid and Head of the Department for Asia and the Pacific from the Swedish Ministry of Foreign Affairs Cecilia Ruthstrom-Ruin led their respective delegations, a Foreign Office press release said.\nThe special secretary briefed the Swedish side on progress made by Pakistan in stabilizing the economy and ease of doing business.\nHe highlighted the investment friendly policies of the government and opportunities in the information technology, enhancing water and waste management, tourism and hospitality sectors and hoped that Swedish companies would take advantage by investing in these sectors.\nThe two sides exchanged views on important regional and international issues of mutual interest.\nThe Swedish side was briefed on India’s illegal and unilateral actions of August 05, 2019 in Indian occupied Jammu and Kashmir and its continued violations of human rights.\nThe Pakistan side emphasized that the international community should take cognizance of the ongoing grave human rights violations against the innocent Kashmiri people and take appropriate measures to redress the situation.\nThe Swedish side was also briefed on Pakistan’s steadfast support for peace and reconciliation in Afghanistan.\nIt was emphasized that a politically negotiated settlement, led and owned by the Afghans, was the only viable way forward.\nThe Swedish side appreciated Pakistan’s positive contribution to the Afghan peace process.\nCecilia Ruthstrom-Ruin briefed on its relations with the EU and the Nordic region. The two sides expressed satisfaction at the level of cooperation at the international fora, including at the UN, and agreed to continue supporting each other.\nThe next round of Pakistan-Sweden Bilateral Political Consultations would be held in Stockholm on mutually agreed dates.",
  "retrievedAt": "2025-08-11T18:56:37.992Z"
}
