{
  "title": "Panagah program shows PM’s sincerity to provide shelter to shelter less: PM Focal Person",
  "link": "https://www.app.com.pk/national/panagah-program-shows-pms-sincerity-to-provide-shelter-to-shelter-less-pm-focal-person/",
  "date_published": "2020-03-11T22:09:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 12 (APP):The Prime Minister’s Focal Person for Panagahs (shelter homes), Naseemur Rehman here Thursday said the Panagahs programme showed the prime minister’s sincerity and strong commitment to provide shelter to homeless people in a safe and secure environment.\n“There is no shortage of funds for this programme and sufficient resources were available to fulfill requirements of Panagahs. It is apolitical programme and the shelter-less people irrespective of their political affiliations can take advantage of it.”\nTalking to media persons after visiting shelter home here at Pajjagai Road, Naseemur Rehman said this pro-poor initiative of prime minister was a landmark programme in social sector, which provide the much needed relief to thousands of passengers, homeless and shelter less people in the country since its inception.\nHe said Pakistan was facing challenges of climate change and the extreme weather conditions have necessitated this programme to provide relief to marginalized people of the society.\nHe said around 50 shelter homes have been established in the country including five in Peshawar from where 500,000 shelter less people benefited since its establishment. This programme was being extended to other districts of Khyber Pakthunkhwa.\nNaseemur Rehman said free transport, food, blankets, accommodation and clean drinking water was being provided to the beneficiaries at Panagahs.\nHe said a comprehensive mechanism has been put in place for monitoring of cleanliness, accommodation, transport and food services besides attendance of staff.\nThe focal person said that Panagahs would be constructed near districts headquarters hospitals for quick emergency medical services to poor people in future.\nHe said there were about 119 public sector universities in Pakistan and the Government was planning to involve the universities students in this noble cause under the network of social responsibility. He said Pakistan was the only country where people generously contribute in charity funds.\nNaseem who has vast experiences of working with foreign and national relief organizations in social sectors programme has expressed complete satisfaction over the arrangements made at the Pajjagai shelter home.\nEarlier, he held a detailed round of the shelter homes and mixed up with people and inquired about the facility being provided to them.",
  "retrievedAt": "2025-08-11T18:56:43.724Z"
}
