{
  "title": "Pakistan welcomes bridging of differences by Saudi Arabia, Iran: PM",
  "link": "https://www.app.com.pk/national/pakistan-welcomes-bridging-of-differences-by-saudi-arabia-iran-pm/",
  "date_published": "2023-04-17T17:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP): Prime Minister Shehbaz Sharif on Monday said bridging of differences between Saudi Arabia and Iran was a remarkable achievement and the positive development was seen by Pakistan with happiness and hope.\nSpeaking at an Iftar dinner hosted by him in honour of ambassadors of Islamic countries here, he said, “Because of the blessings of Ramazan, Saudi Arabia and Iran have bridged their differences and this is a remarkable achievement.”\n“We are all happy about this positive development and the follow-up has been extremely speedy. It is a great pleasure to witness meetings of foreign ministers, and delegations visiting Riyadh and Tehran.”\n“This development is seen by Pakistan as a message of great happiness and hope. I am sure this progress will multiply in many ways in the future,” he added.\nTalking about the Palestine issue, he said hundreds of people were killed in Palestine in the last many months in naked aggression.\nThe Prime Minister of Palestine and some of his cabinet members had made statements saying the violence against the Palestinians was increasing, he continued.\nPM Shehbaz Sharif said the world had witnessed a rough period and one could see what happened in global markets. Prices of oil and other items had gone beyond the reach of developing countries including Pakistan, he noted.\nHe said Pakistan suffered unprecedented floods because of climate change and then there was a massive earthquake in Turkey and Syria.\nThe PM said the Pakistani government was grateful to Islamic countries, including Saudi Arabia, United Arab Emirates, Qatar, Kuwait and Malaysia for their very valuable and timely assistance for the flood affectees.\nEvery Muslim country came to help Pakistan during a difficult period and “we will remember your support for all times to come”, he remarked.\nThe prime minister said the occupation forces in Palestine had shown disdain and crossed red lines without any qualms.\nHe said Ramazan was a holy month which emphasized upon restraint, empathy, kindness, self introspection, generosity and effort to bridge differences.",
  "retrievedAt": "2025-08-11T08:19:22.617Z"
}
