{
  "title": "PM reviews measures to stop smuggling of sugar, wheat, urea",
  "link": "https://www.app.com.pk/national/pm-reviews-measures-to-stop-smuggling-of-sugar-wheat-urea/",
  "date_published": "2023-04-17T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Prime Minister Shehbaz Sharif Monday reviewed measures for the stoppage of smuggling of sugar, wheat, flour, and urea from the country and sought a comprehensive strategy to overcome the problem for the long term.\nChairing a high-level meeting, he said the smuggling of essential items outside the country, was not acceptable in any way. He directed that an immediate operation should be launched against the persons involved in the heinous activity of smuggling.Smuggling was a menace for any society and in the present economic situation, Pakistan could not bear smuggling in any way, he added.\nHe expressed displeasure at the slow pace of work regarding the end of smuggling and asked for an increase in check posts in the border districts of Khyber Pakhtunkhwa and Balochistan.\nHe ordered immediate action against warehouses involved in hoarding and smuggling and said honest reputable officers should be posted at the international border.\nHe stressed that no pressure should be entertained while removing corrupt officers involved in smuggling and draft legislation for stoppage of smuggling should be presented as soon as possible.\nHe said anti-smuggling courts should be immediately made effective and functional and number of these courts should be increased.He said the number of highly reputable judges and prosecutors should be increased in the anti-smuggling courts.\nThe prime minister said exemplary punishment should be given to those who were causing loss of billions of dollars to the country.\nHe directed that the chief secretary should provide figures of demand for these items in the border districts of provinces so that supply in these districts should not exceed more than a set limit.\nHe said the sugar and urea confiscated during the operation against smuggling should be sold in the bazaar according to the price fixed by the government.\nDuring the meeting, Federal Board of Revenue (FBR), Interior Ministry and law enforcement institutions briefed the prime minister about the measures taken to stop intra-provincial and out-of-country smuggling.\nThe meeting was informed that a countrywide operation was continuing against the smuggling of urea fertilizer and sugar. FBR and the law enforcement institutions on Sunday seized 49 trucks while Frontier Corps also foiled attempts to smuggle thousands of tonnes of urea and sugar and confiscated the commodities.\nIt was informed that joint patrolling teams were being set up to stop cross-border smuggling and on the reports of intelligence agencies four joint patrolling checkpoints were established in Balochistan where law enforcement institutions and FBR would work together.It was told that the government had declared wheat, flour, sugar and urea as “items”.\nThe prime minister directed that SUPARCO should provide real-time satellite imagery of the country’s borders and data of movement in order to put a stop to smuggling.\nIt was further informed that warehouses in the border districts were being identified and dealers and their facilitators were being located with the help of a track and trace system after the seizure of goods during failed attempts of smuggling.\nThe meeting was also apprised of a list comprising names of officers involved in the facilitation of smuggling. The representatives of intelligence agencies told that not only smuggled goods and smuggling routes were identified but the persons involved in such activities were also pinpointed and action was being taken against them.\nIt was told that 740 warehouses used for hoarding, were being identified in the border districts across the country. In the last four days the law enforcement agencies confiscated 2800 metric tonnes of sugar and 1400 metric tonnes of urea during numerous raids.\nThe PM instructed Chief Secretary Punjab to supply the sugar seized during the recent failed attempts of smuggling, to the shopkeepers . It should be ensured that sugar should be sold at the government’s fixed rate of Rs 95 per kilo.\nHe directed Federal Minister for Food Security to call a meeting of the Sugar Advisory Board to determine the support price of sugarcane crop. He said all these measures should be strictly implemented and a report along a long-term strategy should be presented in the next two days.\nFederal Ministers Rana Sanaullah Khan, Makhdoom Murtaza Mehmood, Tariq Bashir Cheema, Special Assistant to Prime Minister Ahad Cheema, senior officers of relevant institutions and law enforcement agencies, attended the meeting. Chief Secretaries of four provinces participated in the meeting through video link.",
  "retrievedAt": "2025-08-11T08:19:28.033Z"
}
