{
  "title": "President calls for comprehensive plan to address health, education issues",
  "link": "https://www.app.com.pk/national/president-calls-for-comprehensive-plan-to-address-health-education-issues/",
  "date_published": "2023-04-17T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP): President Dr Arif Alvi on Monday underscored the need for devising a comprehensive strategy to address the challenges being faced by the country in the health and education sectors.\nThe president, during a presentation by UNICEF on its initiatives in Pakistan, expressed concern over the alarming number of out of school children.\nHe said that over 23 million children were out of school and urged the need for thinking out of box solutions to enrol them.\nThe Country Representative of UNICEF, Abdullah Abdulaziz Fadil briefed the meeting about the role and achievements made by UNICEF in the health and education sectors of Pakistan.\nThe president stated that educating these children was really a major challenge that could not be addressed only with present bricks and mortar system but it required the use of digital and online learning methods.\nThe UNICEF country representative apprised the meeting of the impacts of floods on children and the support extended by UNICEF to the children of flood-affected areas.\nHe said that 134,779 children with severe malnutrition had been enrolled for treatment, besides immunising 1,194,940 children against measles.\nIt was told that UNICEF established 1,232 temporary learning centres and helped 180,889 children to continue their learning in a safe and protected environment through various modalities.\nHe highlighted that 1,195,088 people had been provided access to safe drinking water.\nHe also shared UNICEF’s Five Years Program (2023-27) to help strengthen the education and health sectors of Pakistan.\nThe meeting was informed that UNICEF had included mental health and disability in its programs.\nAbdullah Abdulaziz Fadil said that 40% children in Pakistan under age of five years were suffering from stunting and, if this issue was addressed, it could help increase the country’s GDP considerably.\nPresident Alvi said that mental health, malnutrition and disability were the major health problems that needed urgent attention and prompt decisions on the part of the government to address these issues.\nHe emphasized the need for focusing on preventive aspect of the diseases which was not only cost effective but would also help reduce disease burden.\nThe president highly appreciated the contribution made by UNICEF towards the health and education sectors of Pakistan.\nThe meeting was attended by Hamish Young, Chief polio UNICEF, Ellen Van Kalmthout, Chief Education, Haile Gashaw, Chief WASH and others.",
  "retrievedAt": "2025-08-11T08:19:32.858Z"
}
