{
  "title": "Enthralling speeches at ‘All Pakistan Declamation Contest’ highlight Constitution as embodiment of People’s Rights",
  "link": "https://www.app.com.pk/national/enthralling-speeches-at-all-pakistan-declamation-contest-highlight-constitution-as-embodiment-of-peoples-rights/",
  "date_published": "2023-04-17T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP): The National Assembly in close cooperation of the Pakistan Institute of Parliamentary Services (PIPS) on Monday held an enthralling ‘Final Round of All Pakistan Declamation Contest’ to commemorate the Golden Jubilee of the Constitution of Pakistan (1973-2023)here at PIPS auditorium.\nNational Assembly Speaker and PIPS BoG President Raja Pervaiz Ashraf graced the occasion as the chief guest in a closely competitive contest which together packed auditorium with galaxy of over 160 participants.\nThe event brought together the faculty members and students from different Schools from all the four provinces, including students from Government Girls High School, Quetta; Islamabad Model School for Girls, Islamabad; Islamia College, Peshawar; Government High School, Dinah, Haripur; Ittehadul Madaris, Rawalpindi; Board of Islamic Education Jamia Muhammadia Shikarpuri Gate, Bahawalpur; Lahore School System; Lawrence College Murree; Karachi Public School; International Islamic University, Islamabad School; Peshawar Model School; The City School, E-11 and H-12 Campus Islamabad; Government Girls High School, Johal Memorial Rawalpindi; Government Girls Comprehensive Higher Secondary School; Government Boys Secondary School, Kal Board, Karachi and DHA Phase 7 Karachi.\nThe event began with recitation of verses from the Holy Quran, followed by the National Anthem of Pakistan. On behalf of the Parliament, Raja Pervaiz Ashraf welcomed all the participants and students for attending the declamation contest celebrating the Golden Jubilee of the Constitution of Pakistan. Members of the National Assembly Asiya Azeem and Shahida Rehmani as well as Senator Farhatullah Babar also present on the occasion.\nAsiya Azeem who was also the Convener of the National Assembly Sub-Ccommittee on holding ‘All Pakistan Declamation Contest’ on the auspices occasion to celebrate the Golden Jubilee of the Constitution of Pakistan, congratulated the 21 finalists from inter board competitions on the imperative theme ‘My Constitution Protector of My Rights’.\nShe appreciated the tireless efforts and spiritually motivational speeches of the contestants of the declamation.\nMuhammad Rashid Mafzool Zaka, founding Member and Director General of PIPS welcomed the participants and presented an overview of the rules for speech contest.\nIn total 21 students orators from all the Schools presented their speeches. They expressed that our constitution provides a pool of freedoms and fundamental rights to its citizens and gives the message of sympathy.\nThe participants expressed that the Constitution of Pakistan unanimously recognizes Allah the Almighty as the sovereign of Pakistan and that the Holy Quran and Sunnah of the Holy Prophet (Peace Be Upon Him) be encouraged and practised in the country.\nThey reiterated that the constitution is the supreme law of the country which encourages fraternity, democracy, federalism and social justice as underline principles of the State of Pakistan.\nThe participants recognised that the Constitution and laws are important to cater for the changing circumstances we face overtime since the human evolution process is constant and perpetual.They said the laws have been there in existence since human existence. The Almighty Creator issued laws for humans from the time they have ever come into existence.\nThey said in our country the parliament is solely responsible to make laws for its people. “Our constitution captures the injunctions and laws of Islam to be implemented and practice in the country.”\nThey said, “Our constitution gives rights and protects women, children, disabled, and vulnerable. Our constitution is a body of fundamental rights according to which the state, its institutions and judiciary are to be governed. It paves the way to a sense of equality, freedom of movement, freedom of trade, freedom of speech, freedom of assembly, freedom to practice any religion, right of education and compulsory education to children in the country.”\nThey reiterated that the constitution will not protect us if we do not protect our constitution and in order to protect our freedoms we must equally protect our constitution. Article 9 ensures every citizen has the right to live with dignity, Article 11 prohibits any kind of forced labour, Article 23 ensures women are given equal protection and rights.\nIn his closing remarks at the seminar on Commonwealth Day, National Assembly Speaker Raja Pervaiz Ashraf appreciated the national spirit of unity as highlighted by all student-orators in their speeches and said it proves that our future is protected and are in safe hands.\nHe said the Constitution was conceived on 10th April 1973 and that there also had been constitutions adopted prior to it but they did not suffice mainly due to one the reasons being the week democratic system in the country.\nHe said back in the days merely 80,000 people were allowed to vote comprising 40,000 each from the east and west Pakistan and the rest of the 9 crore population were ignored and disallowed from voting. The later adult franchise was introduced by the then Prime Minister Zulfiqar Ali Bhutto, giving right to everyone to vote and the entire population were asked to vote and be part of the democratic process in choosing their rightful candidatures to represent them in the parliament.He said that our constitution today binds 23 crore people together. It was made with all consensuses as it had to withstand till the end of days till Pakistan remains.\nThe speaker said respecting our Constitution is also respecting its people. He also reiterated that the Parliament is the mother of all institutions which produces and regulates all institutions through laws and amendments.Chaudhary Azeem, Chief Judge of the declamation contest, announced the results of the student’s orators. He wished that students that come first be given the opportunity to deliver a speech in the hall of the National Assembly.\nFirst prize was given Mariha Masoof from Government Girls High School, Quetta, Second prize went to Haider Ali from Lawrence College Murree, the third price to Saleha from Islamabad Model School for Girls and two consolation prices were given to Shahzad Noor from City School Capita; Campus Islamabad and Zainab Hussain from International Islamic university Islamabad School.\nIn the end, National Assembly Speaker, Raja Pervaiz Ashraf distributed the Certificates to the orator students which attended the declamation, and upon announcement of winners of the contest, shields were distributed among the winner orators.\nThe group photo was taken with all the participants and session concluded with the slogan Pakistan Zindabad.",
  "retrievedAt": "2025-08-11T08:19:28.336Z"
}
