{
  "title": "Dialogue among political parties better for supremacy of Constitution, democracy: Gillani",
  "link": "https://www.app.com.pk/national/dialogue-among-political-parties-better-for-supremacy-of-constitution-democracy-gillani/",
  "date_published": "2023-04-17T17:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Pakistan Peoples Party’s (PPP) senior leader Syed Yusuf Raza Gillani on Monday said dialogue among all the political parties would be better for the supremacy of the Constitution and democracy.\nTalking to media persons here, he said on the instructions of PPP Chairman Bilawal Bhutto Zardari and former president Asif Ali Zardari, the PPP delegation had today approached the Awami National Party (ANP) for dialogue.\nHe said the ANP had always rendered sacrifices for the restoration of democracy and rule of law in the country.\nHe said the basic purpose of the Constitution was that all institutions would exercise their powers within their constitutional domain.\n“The PPP wants to make a conducive environment for dialogue among the political parties as all the problems being faced by the county will be addressed through the dialogue process,” he added.\nGillani said the masses were looking to the political parties in the current political and economic situation.\nHe added that there was no concept of economic stability sans political equilibrium in the country and therefore, it was the best strategy to hold dialogue with the political parties especially those who were allies of the government.\nANP Secretary General Mian Iftikhar Hussain said he was thankful to the PPP delegation led by Syed Yusuf Raza Gillani for approaching them for the dialogue. It was a good step by the PPP and all the political parties should follow it as the country could no more afford unrest and chaos.\nHe said the political parties would have to join hands for the supremacy of the Parliament and to ensure that all institutions work in their domain.\nIt all required a democratic environment, for which dialogue was mandatory, he added, recalling,” Our dialogue efforts (when the ANP was leading government in Khyber Pakhtunkhwa) had created awareness among the masses that terrorists had only objective to kill people and were not ready for talks.”\nMian Iftikhar said the unanimously approved Constitution of 1973 was the outcome of dialogue and consensus between the opposition leader, Khan Abdul Wali Khan and the Leader of the House in National Assembly Zulfikar Ali Bhutto.\n“Politicians need to end the ambience of uncertainty and for this, they should sit and work together for the supremacy of the Constitution, Parliament and other institutions,” he added.\nHe said the ANP was going to hold an all parties’ conference (APC) in the Federal Capital on May 3, while the PPP had decided to build consensus among the coalition parties prior to holding dialogue with the Pakistan Tehreek-e-Insaf which was a positive step.\nThe PTI among all other political parties would be invited to attend the APC, he added.\nResponding to a query, Yusuf Raza Gillani said the media should not heed any hearsay regarding the dialogue process, which was initiated by approaching the coalition parties first. They would now approach the leadership of the Balochistan National Party (BNP), and then Pakistan Muslim League-Nawaz, Muttahida Qaumi Movement-Pakistan, Balochistan Awami Party and others, he added.\nLater, the PPP delegation met the Pakistan Muslim League-Nawaz (PML-N) leadership.\nSpeaking on the occasion, Yusuf Raza Gillani said Asif Ali Zardari in his address at the National Assembly said, “We are for dialogue and political parties never shy away from dialogue as politicians make bridges and do not wage wars.”\nHe said their delegation met with the PML-N leaders that included Interior Minister Rana Sanaullah, former NA Speaker Ayaz Sadiq and Khawaja Saad Rafique who attended the meeting via video link.\nHe said they presented their point of view that there was a huge depression in the country, which had badly affected the masses. At the time, the clash of institutions should not have occurred as it was not favourable for the country.\nGillani recalled Shaheed Mohtarma Benazir Bhutto and Muhammad Nawaz Sharif had bitter relations, but despite that, they both signed the Charter of Democracy (COD) in the larger national interest.\nThe two political forces under the COD made the constitutional amendment and then President Asif Ali Zardari under that legislation delegated all his powers to the Parliament, he added.\n“We, all the political parties, worked for the supremacy of the Parliament. All parties unitedly made the constitutional amendment and established a parliamentary form of government after the formation of the government.\n“After the COD, the PPP and the PML-N have never any conflict on the transfer of power,” he added.\nGillani underlined that after completing its last government term, the PPP smoothly performed the process of transfer of power.\nDuring the meeting, he said, the PML-N reiterated that they would make all-out efforts for the betterment of Pakistan, the supremacy of the Constitution and rule of law, democracy and the interest of the people.\n“We don’t want to end the path of dialogue. We are so far approaching our coalition partners and after consensus, we will proceed to other political parties,” he ended.\nReplying to media queries, he said the Constitution emphasized trichotomy of power and if all institutions exercised powers within their constitutional limits then there would be no conflict.",
  "retrievedAt": "2025-08-11T08:19:22.609Z"
}
