{
  "title": "‘Political terrorist’ Imran symbol of country’s degradation: Marriyum",
  "link": "https://www.app.com.pk/national/political-terrorist-imran-symbol-of-countrys-degradation-marriyum/",
  "date_published": "2022-12-11T15:21:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 11 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb, while terming PTI chairman Imran Khan ‘a political terrorist’ said he was a symbol of the country’s degradation.\nAddressing the Muslim League-Nawaz workers’ convention here, the minister said all the allegations levelled by the ‘Toshakhana thief’ against the PML-N leadership proved wrong.\nShe said it was ironic that a person, who did not start a single development project when in power, was blaming those who brought investments worth billions of rupees to the country.\nThe minister said the Daily Mail’s apology to Prime Minister Shehbaz Sharif was actually an apology to the 220 million people of Pakistan. Imran Khan, in animosity of Shehbaz Sharif, used David Rose to publish a baseless news story against the PM, she added.\nShe said that in 2016 when Nawaz Sharif was holding office, Pakistan’s GDP growth rate was 6.2 percent whereas inflation was only 2.3 percent. During Nawaz’s era, she added, the IMF programme was rolled back, CPEC projects were started, employment opportunities were provided to the youth, and 14,000 megawatts of electricity were added to the national grid.\nThe minister said at that time, a conspirator, incompetent, inefficient and ‘Toshkhana thief’ was waiting for the finger of the umpire and holding sit-ins.\nShe said Nawaz Sharif made the country a nuclear power but Imran Khan ruined the development process.\nMarriyum said Nawaz Sharif, in his tenure, eradicated the scourge of terrorism, but when Imran Khan came to power, terrorism rose its head again.\nShe said ‘the Toshakhana thief’ alleged that the PML-N leadership was involved in money laundering, but he could not give any evidence in the courts of Pakistan and the United Kingdom. On the contrary, he himself was caught doing money laundering. Marriyum Aurangzeb asked when will Imran Khan give an account of his theft?\nImran Khan made the country’s treasury a “retail shop” during his time, whereas Prime Minister Shehbaz Sharif was striving for the betterment of the people.\nShe congratulated Prime Minister Shehbaz Sharif, Interior Minister Rana Sanaullah, and Federal Minister Ahsan Iqbal for emerging victorious in the court cases.\nShe said Hanif Abbasi was sentenced to 25-years imprisonment in Imran’s tenure but he stood firm and even now standing firm like a lion. Imran took false oaths and put a heroin case on Rana Sanaullah, who stood strong like a rock and still standing like a lion with Nawaz Sharif.\nShe said Imran embezzled the BRT money and abused the Chief Election Commissioner when it decided the case against him on merit.\nHe used to offer an extension to the army chief in closed rooms but campaigned against the martyrs outside.\nImran Khan, she said, appointed an incompetent and inefficient person as the chief minister of Punjab who damaged the province.\nTaking a jibe at the PTI chairman, she said, after 4 years in power, Imran claimed that he had no power, whereas he had Farah Gogi and Pinki with him. She said Imran Khan even sold a gifted watch carrying the image of the Holy Kaaba.\nShe said, in Imran Khan’s era, Nawaz Sharif used to come to courts along with his daughter and presented documents from the past 40 years in accountability courts to clear his name.\nShe said when Imran Khan was asked to answer for his wrongdoings, he got worried and appeared in public on the wheelchair.\nDuring the address, the slogans in favour of the PML-N leadership were raised by the party workers, who came in large numbers to attend the rally.",
  "retrievedAt": "2025-08-11T15:59:59.926Z"
}
