{
  "title": "ACP holds Eco Hike to celebrate International Mountain Day",
  "link": "https://www.app.com.pk/national/acp-holds-eco-hike-to-celebrate-international-mountain-day-2/",
  "date_published": "2022-12-11T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP): Alpine Club of Pakistan (ACP) on Sunday organized Eco Hike on Trail-5 of Margalla Hills Islamabad to celebrate International Mountain Day.\nA large number of youth from different alpine adventure clubs and educational institutions took part in the hike.\nAbu Zafar Sadiq, the president of ACP briefed the participants about the importance of mountains. Referring towards the theme of this year’s International Mountain Day (IMD) ‘Women move mountains’, he noted that women play a key role in mountains’ environmental protection and social and economic development.\nThey are often the primary managers of mountain resources, guardians of biodiversity, keepers of traditional knowledge, custodians of local culture, and experts in traditional medicine. “There is a need for empowering Pakistani women of remote regions as their livings are dependent upon mountains,” he said.\n“Our youth should engage themselves in outdoor healthy activities, especially in hilly areas of Pakistan,” he added.\nKarrar Haidri, Secretary ACP on the occasion said that rural mountain women were vital to biodiversity, conservation, water and food security.\n“Steps should be taken for their protection and empowerment because they are a vital part of the earth’s ecosystem and biodiversity,” he said.\nThe increasing attention to the importance of mountains led the UN to declare 2002 the UN International Year of Mountains. The first international day was celebrated for the first time the following year, in 2003.\nIts roots date back to 1992, when the document, “Managing Fragile Ecosystems: Sustainable Mountain Development”, was adopted as part of the action plan Agenda 21 of the Conference on Environment and Development.\nMost recently, the UN proclaimed 2022 the International Year of Sustainable Mountain Development.",
  "retrievedAt": "2025-08-11T15:59:59.900Z"
}
