{
  "title": "Rain/thunder likely at isolated places of various provinces: PMD",
  "link": "https://www.app.com.pk/national/rain-thunder-likely-at-isolated-places-of-various-provinces-pmd/",
  "date_published": "2022-12-11T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP):Pakistan Meteorological Department (PMD) has forecast rain/thunder with snow over the hills for isolated places in Potohar region, upper Khyber Pakhtunkhwa, north Balochistan, Gilgit Baltistan and Kashmir during the next 24 hours.\nCloudy weather is expected in most upper parts of the country.\nFoggy conditions are likely to prevail over plain areas of Punjab and upper Sindh during morning hours.In Islamabad, partly cloudy weather with rain/thunder is expected during the next 24 hours.\nIn Khyber Pakhtunkhwa, cloudy weather is expected in most districts of the province. However, rain/thunder with snow over the hills is likely at isolated places in Chitral, Dir, Kohistan, Swat, Buner, Abbottabad, Mansehra, Peshawar, Kohat, Kurram and Waziristan.\nIn Punjab, cold weather is expected in southern districts of the province.\nHowever, partly cloudy weather with rain/thunder is expected in Potohar region while rain/snowfall is expected in Murree, Galiyat and surroundings.\nFog is likely to occur over Okara, Sahiwal, Bahawalpur, Bahawalnagar and Multan during night and morning hours.In Balochistan, cold and dry weather is expected in most districts of the province. Partly cloudy weather with chances of rain with light snow over the hills is expected in Zhob, Chaman, Qilla Abdullah, Pishin, Quetta, Ziarat and Surroundings.In Sindh, cold and dry weather is expected in most districts of the province. Shallow fog is likely to occur over Sukkur, Larkana and surroundings.\nIn Kashmir/Gilgit Baltistan, cloudy weather with rain /thunder (snow over the hills) is expected.During the last 24 hours, cold and dry weather prevailed over most parts of the country, while very cold in Gilgit-Baltistan and north Balochistan during night and morning hours. However, rain was recorded in Dir and Gwadar.The rainfall recordes was Dir 06 mm and Gwadar 04 mm.\nThe lowest minimum temepratures recordes were Leh -10 C, Kalam -06, Gupis, Skardu, Kalat, Ziarat -03 and Malam Jabba -02 C.",
  "retrievedAt": "2025-08-11T15:59:59.953Z"
}
