{
  "title": "Will put in our sweat and blood to make Pakistan great country by following Chinese model: PM",
  "link": "https://www.app.com.pk/national/will-put-in-our-sweat-and-blood-to-make-pakistan-great-by-following-chinese-model-pm/",
  "date_published": "2024-06-06T10:29:00.000Z",
  "source": "APP",
  "content": "BEIJING, Jun 6 (APP): Prime Minister Shehbaz Sharif on Thursday reiterated his resolve to make Pakistan a great nation and regain its position by following the Chinese development model through utmost hard work and a sharp focus on industrial and agricultural progress.\n“If we follow the Chinese model, I have no doubt, Pakistan will regain its position in the comity of nations and will be respected like our Chinese brothers are done by friends and foes… We will follow your model, work hard untiringly, put in our sweat and blood, and make Pakistan a great country,” the prime minister said addressing the 4th Pakistan-China Friendship and Business Reception here.\nHe told the gathering of Pakistani and Chinese business leaders that Pakistan would follow Chinese President Xi Jinping’s vision to focus on progress and prosperity by avoiding conflicts and cited immense Chinese progress and projects like the Belt and Road Initiative, China-Pakistan Economic Corridor, Global Development Initiative (GDI) and the Global Security Initiative (GSI).\nThe prime minister who is in China on a five-day official visit, advised the Pakistani people against being dejected or losing hope rather than standing up and accepting the challenge to reach the level of Chinese progress within a few years or decades.\nHe said the China-Pakistan friendship had no parallel in the world which remained unshakeable and unreachable even during the storms, wars, and earthquakes.\nRecalling the Chinese journey of swift development to become the second biggest economic and military power under President Xi’s vision, Prime Minister Shehbaz said it was achieved only through hard work and untiring efforts.\n“All Pakistanis will also have to pass through this thorny process. There is no other way to earn respect in the world,” he remarked.\nHe said having come into being two years after Pakistan, China took its trade to trillions of dollars while Pakisan’s hovered around $30-40 billion in terms of exports. Besides, China has excelled in information technology and artificial intelligence. He also referred to the “wonderful” bilateral cooperation in space program as Pakistan recently sent a lunar satellite and a space satellite recently with Chinese collaboration.\nReferring to the sad and gruesome attack by TTP killing five Chinese workers in Becham in April, Prime Minister Shehbaz condemned the incident and conveyed his deepest condolence to the families of those who were killed.\nHe said the incident which sent a shockwave across Pakistan was the nefarious plot of enemies of China-Pakistan friendship and CPEC as well as those who did not want to see bilateral ties rising to the apex of glory.\n“I want to make a solemn pledge that whatever is humanly possible, we will put in all measures and arrangements to protect the lives of every Chinese citizen in Punjab, Sindh, Balochistan, KP, GB and AJK. I want to make a solemn commitment that the security of Chinese nationals will be more than that of my own and my children,” he assured.",
  "retrievedAt": "2025-08-11T03:01:35.925Z"
}
