{
  "title": "PIC orders to disclose private hospital’s negligence inquiry report",
  "link": "https://www.app.com.pk/national/pic-orders-to-disclose-private-hospitals-negligence-inquiry-report/",
  "date_published": "2024-06-06T07:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 6 (APP):The Pakistan Information Commission (PIC) on Thursday has ordered to public inquiry report concerning the alleged negligence and mistreatment of doctors at a renowned private medical hospital Rawalpindi, which purportedly led to the death of 26-year-old Zahoor Ahmed’s son.\nThis directive comes after the Islamabad Healthcare Regulatory Authority (IHRA) withheld the information, citing confidentiality under the Right of Access to Information Act, 2017.\nAccording to details, Zahoor Ahmed, a resident of Gujjar Khan, Rawalpindi, filed a complaint with IHRA in July 2021, accusing the hospital’s doctors of negligence resulting in his son’s death.\nA citizen Nadeem Umer filed an information request to the IHRA on February 14, 2024, seeking the current status and a copy of the inquiry report.\nUmer’s request was denied by the public body, leading him to appeal to the PIC.\nUpon receiving the appeal, the Commission issued a notice to the IHRA.\nThe IHRA, represented by a law officer, maintained that the information was confidential and exempt from disclosure under section 7(h) of the Right of Access to Information Act, 2017, which pertains to personal treatment records.\nHowever, the Commission disagreed with this exemption claim while citing section 5 of the Right of Access to Information Act, 2017,highlighted that inquiry and investigative reports, once finalized, must be proactively published by public bodies.\nThe Commission asserted that the inquiry into the death of Zahoor Ahmed’s son should be made accessible to ensure transparency and accountability.\nThe Commission’s ruling emphasized the importance of handling matters related to public health and safety with utmost care and diligence. Recognizing the case’s significance, the Commission ordered the Chief Executive Officer of IHRA to provide certified copies of the inquiry report to both the appellant and the Commission within ten days.\nThe next hearing is scheduled for June 16, 2024, to review the compliance and implementation of the Commission’s order.\nThis decision underscores the Commission’s commitment to upholding transparency and ensuring that public bodies are held accountable, particularly in cases involving public health and safety.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:02:21.978Z"
}
