{
  "title": "Govt raises wheat procurement target by 40 per cent this year: Tarar",
  "link": "https://www.app.com.pk/national/govt-raises-wheat-procurement-target-by-40-per-cent-this-year-tarar/",
  "date_published": "2024-06-06T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP): Minister for Law and Justice Azam Nazeer Tarar Thursday informed the National Assembly that the federal government has raised the wheat procurement target by 40 per cent this year to address the challenges faced by farmers.\nDuring the Question Hour in the National Assembly, the minister said that the investigations into the wheat import scandal are underway and those found guilty will be held accountable.\nAccording to the Ministry of National Food Security, the minister informed that the Pakistan Agricultural Storage and Services Corporation Ltd. (PASSCO) had procured 1.8 million metric tons of wheat as of June 2, 2024.\nHe said the original procurement target was 1.3 million metric tons, which was increased to 1.8 million metric tons.\nThe minister said that Prime Minister Muhammad Shehbaz Sharif took serious notice of the situation, prompting a 35 to 40 per cent increase in the target, adding that the global decline in wheat prices has affected the open market. “The government is taking several steps to support the farmers for the next planting season and is coordinating with the provinces,” the minister added.\nAzam Nazeer acknowledged complaints about wheat procurement and said that the prime minister directed the Federal Investigation Agency (FIA) to register FIRs against those involved.\nThe minister said the crash in the global wheat market led to domestic prices falling to between Rs 2,800 and Rs 3,200 per mound. The government prioritised providing sacks to small farmers, he added.\nHe said that the State Bank was asked for additional funds, resulting in Rs 2,250 billion loans for the agriculture sector and provinces have also been urged to play their role to facilitate the farmers.\nAzam Nazeer said that agriculture contributes up to 23 per cent of GDP, making it a crucial sector. The National Seed Development Regulatory Authority has been established, a seed procurement tracking system has been introduced and both central and provincial budgets will reflect subsidies for the agricultural sector, he maintained.\nLater, the minister also laid the Election (Amendment) Ordinance 2024 and the National Accountability (Amendment) Ordinance 2024.",
  "retrievedAt": "2025-08-11T03:00:47.422Z"
}
