{
  "title": "Wrote a new chapter of Pak-China cooperation in Shenzhen; will reciprocate model in Pakistan: Dar",
  "link": "https://www.app.com.pk/national/wrote-a-new-chapter-of-pak-china-cooperation-in-shenzhen-will-reciprocate-model-in-pakistan-dar/",
  "date_published": "2024-06-06T09:10:00.000Z",
  "source": "APP",
  "content": "BEIJING, Jun 6 (APP): Deputy Prime Minister and Foreign Minister Ishaq Dar on Thursday said that by holding the Pakistan-China Business Forum in Shenzhen, the government had written a new chapter of bilateral cooperation and in the coming months, the model would be reciprocated by inviting Chinese companies to Pakistan.\nThe deputy prime minister, in his address at the 4th Pakistan-China Friendship and Business event here, said that the hugely attended Business Forum aimed at tangible, targeted, substantive and result-oriented economic cooperation with a focus on attracting and facilitating Chinese investments in 13 export-oriented sectors inside Pakistan.\nHe told the gathering that Pakistan’s Ambassador in China Ambassador Khalil Hashmi and his team successfully mobilized over 400 Chinese businesspersons and entrepreneurs who came together to network with around 120 Pakistani counterparts on a scale that was unprecedented.\n“I am confident they have started a new journey of win-win partnership and joint cooperation. In the months ahead, we will reciprocate this model further and invite Chinese companies to Pakistan,” the deputy prime minister remarked.\nCalling the Friendship and Business event a “cherished tradition” and the “essence of friendship and mutual respect”, Dar said that over the years, the platform had played a pivotal role in bringing together leaders, policymakers, business executives, and entrepreneurs from both countries.\nHe said the gathering was aimed at engaging to further strengthen our iron-clad and space-partners friendship. It sets the tone for our future interactions, providing a foundation for deeper economic ties and stronger cultural connections, he added.\nHe said in the local context, the forum served as a testament to China’s dedication to fostering international partnerships. It is a symbol of how traditions and cultural exchanges can be harnessed to promote understanding, peace, prosperity and development.\nDar said that currently, the world was at the cusp of a new era, witnessing profound and fast-paced changes which would, as before, test the resilience of China-Pakistan iron-clad friendship.\n“Our partnership has already risen to a strategic level, encompassing economy, trade, social and defence sectors. We wholeheartedly support President Xi’s Global Development Initiative (GDI), Global Civilization Initiative (GCI) and Global Security Initiative (GSI). I would like to reaffirm that Pakistan has been, is, and will always be China’s trusted friend and partner,” the deputy prime minister reiterated.\nHe particularly appreciated the Chinese People’s Association for Friendship with Foreign Countries (CPAFFC); China-Pakistan Friendship Association (CPFA); China International Cultural Communication Centre (CICCC); and all other supporting units – JDB group and Anhua County Yuntiange tea Co., Ltd.\nHe also lauded Pakistan’s Ambassador Khalil Hashmi and his team and particularly expressed gratitude to Ambassador Sha Zukang for his steadfast and longstanding support to Pakistan.",
  "retrievedAt": "2025-08-11T03:01:56.315Z"
}
