{
  "title": "SC reserves verdict in appeals against  NAB law amendments termination",
  "link": "https://www.app.com.pk/national/sc-reserves-verdict-in-appeals-against-nab-law-amendments-termination/",
  "date_published": "2024-06-06T18:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP): The Supreme Court on Thursday reserved its judgment in intra-court appeals of the Federal Government against termination of amendments in the National Accountability Bureau (NAB) law.\nWhile reserving the verdict, Chief Justice of Pakistan Qazi Faez Esa observed that any respondent willing to submit a written response might do so within a week.\nThe five-member larger bench headed by the CJP and comprising Justice Amin ud Din Khan, Justice Jamal Khan Mandokhail, Justice Athar Minallah and Justice Hassan Azhar Rizvi Chief Justice of Pakistan Qazi Faez Isa heard the appeals and reserved the verdict after all sides concluded their arguments.\nThe Pakistan Tehreek-e-Insaf’s (PTI) founder, who appeared before the court through video link from the Adiala Jail Rawalpindi, also presented his arguments.\nDuring the course of proceedings, the chief justice asked the PTI founder’s counsel Khawaja Haris to complete his arguments and he could also file the remaining one in writing.\nThe CJP observed that it was beyond understanding as to why only politicians were kept in the jurisdiction of NAB.\nHe said that the legislation done by the Parliament could not be suspended. Justice should not only be done, but also seen to be done.\nHe said that the case against the Practice and Procedure Act should have been fixed earlier for hearing, and asked after the Act how the bench was formed for hearing the appeals against the NAB law amendments. Why no attempt was made to again fix the already pending petition with the Islamabad High Court (IHC).\nAddressing Advocate Khawaja Haris, Justice Minallah said he had the amendment of Section 19A5 and termination of Section 14 of the NAB law.\nKhawaja Haris replied that he had also challenged the retrospective application of the amendments in Section 2, besides amendments in sections 4, 16, 21G and 25D.\nJustice Minallah observed that if the NAB law amendments were nullified, then his client (PTI founder) would be in trouble as he was currently under the investigation of NAB.\nThe PTI founder might be asked to prove his assets under the old law, he said adding that he (Khawaja Haris) was creating difficulties for public representatives.\nJustice Minallah questioned how the fundamental rights were affected by the amendments, as through them NAB’s draconian powers had been withdrawn.\nThe CJP observed that why Khawaja Haris’s client continued to give tax amnesty when he had such a strict stance on accountability. There was no tax amnesty in Britain, which had been a democracy for years.\nHe noted that the Election Commission of Pakistan (ECP) sought statements of assets (of legislators), questioning as to why the details of income tax were not asked.\nHe asked the lawyer that he would have to inform the court what was unconstitutional in the amendments.\nThe chief justice said that Makhdoom Ali Khan, counsel for Federal Government, had submitted the details mentioning that the then government had amended the NAB law in 2019.\nHe observed the amendments according to the PTI founder’s lawyer were wrong as the same were carried out by the then government in 2019, and the same would be right if done by the PTI government.\nEarlier, Farouk H Naek said that he would file the written arguments.\nAfter hearing the arguments, the bench, subsequently, reserved its judgment.",
  "retrievedAt": "2025-08-11T03:02:25.236Z"
}
