{
  "title": "Cypher audio-leaks expose criminal conspiracy of previous govt, former PM: Cabinet",
  "link": "https://www.app.com.pk/national/cypher-audio-leaks-expose-criminal-conspiracy-of-previous-govt-former-pm-cabinet/",
  "date_published": "2022-09-30T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 30 (APP): The federal cabinet on Friday held detailed deliberations on the issue of audio-leaks and endorsed the decision of National Security Committee (NSC) to investigate the matter thoroughly.\nThe federal cabinet meeting, held here with Prime Minister Muhammad Shehbaz Sharif in chair, however, expressed its strong concern over the fact that continuous surfacing of the audios of former PM, ex-Principal Secretary to PM and other people about the diplomatic cypher had exposed the criminal conspiracy of the previous government and former Prime Minister Imran Niazi, a press release issued by the PM Media Wing here said.\nThe meeting noted that vital national interests were damaged by giving concocted meaning to a diplomatic cypher for political gains and it [the cypher] was stolen after “fraud, forgery and fabrication”.\nIt was strong violation of the constitutional oath, other related laws and regulations particularly the official secret. It was the act of unpardonable crimes against the state through which political interests were given priority over the vital national interests.\nTherefore, it was necessary under the constitution, law and rules to investigate the issue in detail and those found responsible be given severe punishment in accordance with the law.\nThe cabinet was given a briefing on the issue of diplomatic cypher, during which it was revealed that the copy of diplomatic cypher in question was missing from the PM House Record.\nThe meeting was told that though entry of the receipt of cypher sent to former prime minister was found in the record, but its copy, which is considered as the property of PM House as per law, was missing from the record.\nThe meeting, which termed the stealing of diplomatic cypher from the record as a serious matter, after detailed consultation constituted a special Cabinet Committee, which will determine legal action against all the involved characters including the former prime minister, ex-Principal Secretary to PM and senior former ministers.\nBesides the representatives of the government’s allied parties, the Cabinet Committee will comprise the Ministers for Foreign Affairs, Interior and the Law and Justice.\nThe cabinet strongly condemned the maltreatment of Minister for Information and Broadcasting Marriyum Aurangzeb on a London road by the workers of Pakistan Tehrik-e-Insaf (PTI) including the harassment, threatening, chasing and abusing.\nIt was stated in the meeting that such a negative behavior was not allowed even against the men in Islam, Western civilization, law and political culture, let alone the women. “It is just hooliganism, which cannot be permitted by any society.”\nThe meeting appreciating exemplary tolerance of Marriyum Aurangzeb lauded his spirit, courage and bravery and expressed complete solidarity with her.\nIt was noted in the meeting that PTI and its leadership was used to not only mistreating its political rivals especially the women, but also always adopted a condemnable attitude against female journalists.\nBesides, the meeting noted that PTI and its Chairman’s attitude against women have generally been biased, partial and insulting, which is strongly condemnable. All Pakistanis including every segment of the society should condemn this unacceptable attitude.\nThe federal cabinet, on the recommendation of Ministry of Law and Justice, approved the filing of Explanatory Presidential Reference on the advice of the Prime Minister with reference to the Supreme Court’s previous decision regarding the construction of Reko-diq project of the Federal and Balochistan governments.\nBesides, the reference will also seek explanation about the approval of Foreign Investment (Protection & Promotion), Bill 2022.\nThe cabinet, on the recommendation of Interior Ministry, approved the new Standard Operating Procedure (SOP-2022) for the inclusion or exclusion of names in the Exit Control List (ECL).\nUnder the new SOP-2022, the process of inclusion or exclusion of names in the ECO has been made easy and transparent.\nBesides, the cabinet also approved the inclusion of 12 names in the ECL and exclusion of 3 names from the list.",
  "retrievedAt": "2025-08-11T15:39:40.392Z"
}
