{
  "title": "Ashrafi for celebrating Rabi-ul-Awwal as month of ‘Paigham-e-Rehmatul-lil-Alameen’",
  "link": "https://www.app.com.pk/national/ashrafi-for-celebrating-rabi-ul-awwal-as-month-of-paigham-e-rehmatul-lil-alameen/",
  "date_published": "2022-09-30T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Friday said Rabi-ul-Awwal was being celebrated as month of the ‘Paigham-e-Rehmatul-lil-Alameen’ throughout the country.\nAddressing a Sirat-un-Nabi Conference on Friday, Ashrafi who is also the chairman of Pakistan Ulema Council said peace, affection and tolerance was the message of Holy Prophet Muhammad (Peace Be Upon Him) and it was the responsibility of every Muslim to spread this noble message across the world.\nAssuring the rights of minorities living in Pakistan, he said Holy Prophet Muhammad (Peace Be Upon Him) had made Muslims the protectors of the rights of non-Muslims at all levels.\nHe said the Prophet of Allah Almighty had given women the right to education and it was Sunnah of the Holy Prophet (Peace Be Upon Him) to seek the daughter’s consent before her marriage. There was no concept of forced marriage and forcefully conversion to religion in Islam, he added.\nAshrafi said the Holy Prophet (Peace Be Upon Him) had always sympathized with those who kept enmity against him as extremist attitudes are creating problems for Islam and Muslims all over the world.\n“Islam is spread all over the world through best moral values, that is why; even the enemies of the Holy Prophet (Peace Be Upon Him) used to call him Sadiq and Ameen (Truthful and Honest),” he added.\nHe said today making false statements against one another were causing death and destruction in the society.\nHe said in the month of Rabi-ul-Awwal, ‘Paigham-e-Rehmatul-lil- Alameen’ conferences, seminars and congregations would be held under the aegis of Pakistan Ulema Council across the country.\nMeanwhile, talking to media after the conference, he said the ongoing political turmoil in the country could be settled down by reconciliation.\nAudio or video leaks were not in the interest of the nation any way, he said adding the country and nation were being harmed by stubbornness and obstinacy.\nAshrafi lamented that currently, one third area of the country were inundated by floods but the entire political leadership and media were engaged in audio and video leaks.\nIn response to a question, he said Muslim World League was a global organization of Muslim Ulema and religious scholars adding its secretary general was expected to arrive in Pakistan in the next month.\nSaudi Arabia, the United Arab Emirates and other Islamic countries had been supporting the flood victims, for which we were grateful to them, he added.\nHe strongly condemned the explosion in the Kabul educational institution saying that the killing of innocent people was not acceptable under any circumstances.\nAppreciating the way prime minister had raised his voice in the United Nations against the elements spreading terrorism and extremism, he expressed the hope that the entire Islamic and world leaderships would pay attention on it.",
  "retrievedAt": "2025-08-11T15:39:39.680Z"
}
