{
  "title": "Pakistan urges mobilization of world support for crises-hit developing countries to fight poverty, hunger",
  "link": "https://www.app.com.pk/national/pakistan-urges-mobilization-of-world-support-for-crises-hit-developing-countries-to-fight-poverty-hunger/",
  "date_published": "2022-09-30T07:42:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Sep 30 (APP)::Pakistan has called for the mobilization of all possible resources to help developing countries eradicate poverty and hunger and achieve the Sustainable Development Goals (SDGs) to offset the devastating impact of the increase in food, fuel prices and the decline in economic growth on the large segment of the world’s population.\nSpeaking for the Group of 77 (developing countries), Ambassador Munir Akram said the international community and institutions should revitalize global development cooperation and invest in sustained growth for reducing inequalities and enhancing the well-being of all.\nThe Pakistani envoy was addressing the UN General Assembly’s Third Committee (Social, Humanitarian and Cultural), which  opened its seventy-seventh session Thursday, with the lingering impact of the COVID-19 pandemic, a resurgence of conflicts and the climate emergency driving its general discussion.\nPakistan is the current chairman of G-77 and China, which now has 134 members and is the United Nations’ biggest intergovernmental group of emerging countries.\nThe developing countries need financial support of at least $3.3 to $ 4.5 trillion per year to achieve SDGs within the given timeline, Ambassador Akram said, adding that resources must be mobilized from all possible sources: fulfillment of the 0.7 percent ODA (Official Development target; redistribution of the $650 billion new SDRs (Special Drawing Rights); and concessional finance from the multilateral institutions and development banks.\nAt the same time, he said, there is a need to take coherent and coordinated actions and innovative measures to promote vaccine equity, build better health systems and improve early warning and monitoring systems for pandemic preparedness at the global, regional and national levels\nExpressing concern over the lack of satisfactory progress on social development, t he G77 chairman said conflicts, volatile financial markets, high rates of unemployment, humanitarian emergencies, corruption and climate change, to name a few, impede the progress in the fulfilment of social objectives.\nIn this context, Ambassador Akram reaffirmed that international development cooperation — especially North–South cooperation — remains a fundamental catalyst to sustainable development.\nExpressing support for developing countries in implementing their social development agenda, he called on States to invest in family-oriented programmes for fighting poverty and inequality, promoting the empowerment of women and girls and advancing intergenerational solidarity.\nThe Group of 77, he said, recognizes the valuable contribution of older persons to the development of societies, and therefore calls for action to address protection gaps, and ensure the full realization of all human rights and fundamental freedoms for older persons.",
  "retrievedAt": "2025-08-11T15:39:34.710Z"
}
