{
  "title": "Ambassador of Indonesia assures support to NA’s proposal for creation of global climate fund",
  "link": "https://www.app.com.pk/national/ambassador-of-indonesia-assures-support-to-nas-proposal-for-creation-of-global-climate-fund/",
  "date_published": "2022-09-30T13:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Ambassador of Indonesia to Pakistan Adam Mulawarman Tugio called on Speaker National Assembly Raja Pervez Ashraf and assured support to the National Assembly proposal for the creation of a global climate fund to combat climate catastrophe.\n1. Ambassador of Indonesia to Pak H.E Mr. Adam Mulawarman Tugio called on Speaker National Assembly Raja Pervez Ashraf @RPAPPP Discussed about maximizing gains by further solidifying bilateral mechanism & pal. Coop., & support for NA's proposal reg. climate fund@IndonesiainIsb pic.twitter.com/xXu2C6sLNT\n— National Assembly of  (@NAofPakistan) September 30, 2022\nDuring the meeting, matters about solidifying bilateral relations, parliamentary cooperation and support for National Assembly’s proposal regarding the climate fund came under discussion in the meeting.\nSpeaker remarked that Pakistanis have a special affection for Indonesia and its people not only for being a Muslim country but also for shared culture, religious values, and the support extended by them during the Indo-Pakistani War of 1965 said a news release.\nWhile discussing the recent flood and its aftermath, Speaker highlighted that Pakistan witnessed unprecedented challenges and in this backdrop, National Assembly has moved an emergency agenda item for the 145th Inter-Parliamentary Union (IPU) in Rwanda being held from October for the creation of a global fund to combat climate fallout in Pakistan.\nHe added that a letter and resolution on the same had been sent to the Speaker of the People’s Representative Council of Indonesia with a request to support Pakistan’s stance at the conference.\nHe expressed gratitude to the government and the people of Indonesia for extending relief assistance to flood affectees in Pakistan.\nThe Indonesian Ambassador agreed that climate change was a global issue that required global efforts and attention. He condoled massive losses due to devastating floods and expressed solidarity with the flood affectees.\nOwing to the extent of climatic fallout in Pakistan, he assured to convey Speaker’s message to the Indonesian leadership to support Pakistan’s National Assembly’s call for the creation of a global climate fund to build back better in a climate-resilient manner.\nThe meeting ended with a pledge to increase bilateral engagements in all spheres and to extend support to each other at regional and international fora.",
  "retrievedAt": "2025-08-11T15:39:30.926Z"
}
