{
  "title": "IHC orders inquiry into arrest of Irfan Siddiqui & other journalists’ cases",
  "link": "https://www.app.com.pk/national/ihc-orders-inquiry-into-arrest-of-irfan-siddiqui-other-journalists-cases/",
  "date_published": "2022-09-30T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): The Islamabad High Court (IHC) on Friday directed an inquiry into the arrest of senior journalist Irfan Siddiqui in 2019, and kidnapping and violence against three others in different incidents and sought its report by October 24.\nThe other journalists included Absar Alam, Matiullah Jan and Asad Toor, who were shot at, kidnapped and beaten up respectively.\nChief Justice Athar Minallah heard the case regarding the arrest of Pakistan Tehreek-e-Insaf leader Shireen Mazari.\nAdditional Attorney General Munawar Dogal requested the court to grant some time for submission of the inquiry report about Ms Mazari’s arrest. The report would be presented to the federal cabinet soon.\nAt the outset of hearing, the chief justice remarked that Madam Mazari’s arrest was not only the one case. Who was  arrested under the Tenancy Act, he asked. On this, Imaan Mazari Advocate said that the senior journalist and columnist Irfan Siddiqui was arrested under the law.\nThe court ordered that the arrest of Irfan Siddiqui and the kidnapping, shooting and violent act against other journalists including Matiullah Jan, Absar Alam and Asad Toor respectively should also be probed. It ordered the commission already investigating Shireen Mazari’s arrest case, to probe the journalists cases also and submit its report till next date.\nFormer adviser to the prime minister and Senator Irfan Siddiqui was arrested by a heavy police contingent from his residence in Islamabad at midnight on July 27, 2019. Siddiqui, who was 75 at that time, was neither allowed to take medicines with him nor change his dress, while his wife and daughter were also injured during the raid.\nIrfan Siddiqui was sent to jail on a 14-day remand, where he was kept in the cell in ‘Kasuri Chaki’ meant for terrorists. He was even kept without food and water for several hours.\nSenior journalist Absar Alam was shot at in Islamabad on April 20, 2021  while walking on road. Similarly, journalist Matiullah Jan was abducted on July 21, 2020, in front of his daughter’s school in Sector G-6 Islamabad, and was found on a roadside in Fetah Jang after 12 hours later.\nOn May 25, 2021, some unknown persons entered the house of journalist Asad Ali Toor and severely tortured him.",
  "retrievedAt": "2025-08-11T15:39:40.365Z"
}
