{
  "article_id": "2025-09-30_8c239243a21fd718420f59579f53432a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/education-minister-terms-psl-standardization-historic-milestone/",
    "retrieved_at": "2025-10-11T23:40:24.953Z"
  },
  "metadata": {
    "title": "Education minister terms PSL standardization historic milestone",
    "author": null,
    "date_published": "2025-09-30T17:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 333,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 30 (APP):Federal Minister for Federal Education and Professional Training, Dr Khalid Maqbool Siddiqui, on Tuesday described the standardization of Pakistan Sign Language (PSL) as a historic milestone for the full recognition and inclusion of Deaf Pakistanis in national life. Addressing the National Consultation on the Standardization of PSL, the Minister welcomed provincial representatives, academia, civil society, UNICEF officials, media, and members of the Deaf community, said a press release. He said that sign language was not merely a tool of communication but a \"language of rights, culture and identity.\" Dr. Siddiqui noted that the lack of a standardized PSL had long restricted access to education, employment, justice and public services for Deaf citizens. The consultation, he added, would lay the foundation for a national framework to develop unified curricula, certify interpreters, ensure consistent use across schools, media and government institutions, affirming the cultural and linguistic identity of the deaf community. The Minister commended UNICEF, Deaf leaders, and the Ministry team for their collaborative role in shaping the initiative. He also highlighted the ongoing reforms at the Directorate General of Special Education (DGSE), which came under the Ministry's administrative control in July 2024. Under the leadership of Federal Secretary Nadeem Mahbub and Director General Asif Iqbal Asif, he said, the DGSE was undergoing a transformation in service delivery for children with disabilities. Calling PSL standardization the flagship reform, Dr Siddiqui announced the formation of a National PSL Task Force to implement recommendations with clear timelines, interpreter training, and digital resources. He reaffirmed the government's resolve to integrate PSL into curricula, media and public services. \"This consultation is more than a policy dialogue-it is a collective pledge to build a Pakistan where every child, every citizen, hearing or Deaf, has a language, a voice, and a future full of possibility,\" he said. The Minister expressed gratitude to UNICEF, provincial governments, the Deaf community, and DGSE officials for their commitment, vowing that PSL would become a bridge to equality and dignity for all citizens.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}