{
  "article_id": "2025-09-30_8f2689b155f5898f50f8a6964234e8e9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/u-s-blasts-heinous-terrorist-attack-in-quetta-vows-unwavering-support-for-pakistans-anti-terror-fight/",
    "retrieved_at": "2025-10-11T23:40:09.026Z"
  },
  "metadata": {
    "title": "U.S Blasts “Heinous Terrorist Attack” in Quetta, Vows Unwavering Support for Pakistan’s Anti-Terror Fight",
    "author": null,
    "date_published": "2025-09-30T18:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 335,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 30 (APP):In the wake of a deadly terrorist assault near the Frontier Corps (FC) headquarters in Quetta, which left numerous people dead and many others wounded, the United States has issued a strong condemnation, labeling the strike as a \"heinous\" act of violence. A statement released by the U.S Embassy in Islamabad on Tuesday underscored Washington's outrage at the brutality of the incident, while expressing heartfelt sympathies for the victims' families. \"We extend our deepest condolences to the families of the victims and wish a swift recovery to those injured,\" the statement read. The assault, which shook the provincial capital of Balochistan, has once again highlighted the relentless threat of militancy in the region, where both civilians and security forces remain frequent targets of extremist groups. No group has yet claimed responsibility for the carnage, though security officials suspect involvement of outfits with long-standing insurgent networks in the province. The United States emphasized that it \"stands in solidarity with Pakistan in its fight against terrorism\" and reaffirmed its support for efforts aimed at ensuring peace and stability in Balochistan and the wider nation. \"We remain committed to supporting Pakistan's efforts to bring its people lives free from violence and fear,\" the statement added. Pakistan, battling an uptick in violent attacks over the past year, has intensified operations against militants. Authorities say the strike near the FC headquarters represents not just an assault on state institutions but also a direct attempt to destabilize the region. Local hospitals reported being overwhelmed by casualties as emergency workers rushed victims from the blast site. Witnesses described scenes of chaos, with shattered vehicles, heavy gunfire, and plumes of smoke filling the air in Quetta's heavily guarded area. Prime Minister and senior military officials have vowed to retaliate against those behind the massacre, calling the attack a \"cowardly attempt to undermine national security.\" The U.S. condemnation comes at a sensitive time, as Islamabad grapples with rising security challenges while also seeking closer cooperation with international allies to combat extremism.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}