{
  "article_id": "2025-09-30_58310b1581fbec4c7f1e80e1970b98d9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-sets-aside-ihc-order-against-justice-jahangiri-allows-appeal/",
    "retrieved_at": "2025-10-11T23:41:47.984Z"
  },
  "metadata": {
    "title": "SC sets aside IHC order against Justice Jahangiri, allows appeal",
    "author": null,
    "date_published": "2025-09-30T13:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 30 (APP):The Supreme Court on Tuesday nullified the Islamabad High Court's September 16 order barring Justice Tariq Mehmood Jahangiri from performing judicial functions, allowing his appeal against the directive. A five-member constitutional bench, headed by Justice Aminuddin Khan and comprising Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Hassan Azhar Rizvi, and Justice Shahid Bilal Hassan, heard the case. During the hearing, Attorney General for Pakistan Mansoor Usman Awan argued that no judge could be restrained from judicial work through an interim order. Petitioner Mian Daud, when asked for his stance, agreed that such an order could not be defended. Justice Jamal Khan Mandokhail remarked that only the Supreme Judicial Council could remove a judge, while Justice Muhammad Ali Mazhar clarified that the apex court was not addressing whether a writ against a judge was maintainable but only the question of whether an interim order could suspend a judge's functions. Counsel for Justice Jahangiri, Munir A. Malik, argued that action against a judge could only proceed through the Supreme Judicial Council. The bench, in its written order, noted that both the Attorney General and the petitioner had stated a judge could not be restrained from performing judicial duties, and therefore the IHC order was set aside. The court directed the Islamabad High Court to first decide on the pending objections regarding the maintainability of the petition filed against Justice Jahangiri. Justice Jahangiri had personally challenged the IHC order before the Supreme Court on September 19, requesting that it be declared void and suspended. Earlier, on September 16, an IHC division bench comprising Chief Justice Sardar Sarfraz Dogar and Justice Muhammad Azam Khan had restrained him from performing judicial functions on a petition filed by Advocate Mian Daud.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}