{
  "title": "Popular folk singer Attaullah Esakhelvi turns 72",
  "link": "https://www.app.com.pk/national/popular-folk-singer-attaullah-esakhelvi-turns-72/",
  "date_published": "2023-08-19T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Popular singer and folk icon Attaullah Khan Esakhelvi turned 72 on Saturday.\nBorn on August 19, 1951, in Esakhel, district Mianwali Attaullah developed an interest in music as a child, but music was strictly forbidden in his home.\nDisillusioned by ban on singing, he left home and continued his training and performed at local villages where his songs were recorded on audio cassettes by his fans.\nIn 1972, Esakhelvi was invited to perform on Radio Pakistan, Bahawalpur and performed on the television show Neelam Ghar in 1973.\nLater he was invited by a music company in Faisalabad to record folk songs in its studio and recorded four albums in one recording session. The albums were released at the end of 1977 and became national bestsellers.\nIn 1980, Esakhelvi performed in the United Kingdom for the first time. It was also his first concert abroad.\nHis albums were eventually released in the UK under various labels. Since then he has never seen back and has recorded more than 50,000 songs in seven languages.\nAtaullah’s name entered the Guinness Book of World Records in 1994 for the highest number of audio albums released.\nMost of his songs had lyrics in easy diction on themes like death, sorrow, pain, deception and love.\nSome of the popular tracks from his hit albums include ‘O Dil Torr Ke Hansti Ho Mera’ are “Tujhe Bhulana To Chaha”, “Mujhko Ye Teri Bewafai Maar Dalegi”, “Bedardi Se Pyar Ka Sahara Na Mila”, “Acha sila diya tune mere pyar ka” and “Mujhko Dafna Kar Woh Jab Wapis Jayenge.”\nThe songs “Pyar naal na sahi, ghusse naal vekh leya kar”, ‘Qameez tedi kali”, “Mahi Wasse Mera”, “Ni Oontaan Wale Tur Jaan Gei” and “Raataan”, “Petal Barayae Sona Banrsan Amlan Naal”, Sachi dash we dhola kal kion nahi aaya”, Kal O kaun si tere naal” are some of Attaullah’s smash hit songs.\nFor his lyrics, he selects poetry by Farooq Rokhri, Malik Sona Khan, Munawar Ali Malik, Farooq Rokhri, and several little-known poets from Mianwali District.\nThe Government of Pakistan awarded him the Pride of Performance Award in 1991. On March 23, 2019, he was awarded Sitara e Imtiaz by the President of Pakistan.\nHe also received a lifetime achievement award from Queen Elizabeth II of Great Britain.",
  "retrievedAt": "2025-08-11T09:13:40.164Z"
}
