{
  "title": "Severe Covid may cause long-term innate immune system changes: Study",
  "link": "https://www.app.com.pk/national/severe-covid-may-cause-long-term-innate-immune-system-changes-study/",
  "date_published": "2023-08-19T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Severe Covid-19 may cause long-lasting alterations to the innate immune system, the first line of defence against pathogens, according to a small study.\nThese changes may help explain why the disease can damage so many different organs and why some people with long Covid have high levels of inflammation throughout the body.\nThe study, published online in the journal Cell, examined immune cells and molecules in blood samples from 38 people recovering from severe Covid and other severe illnesses, as well as from 19 healthy people.\nNotably, researchers led by Steven Z. Josefowicz, from the Weill Cornell Medicine in New York City in the US, established a new technique for collecting, concentrating and characterising very rare blood-forming stem cells that circulate in the blood, eliminating the need to extract such cells from bone marrow, Medical Dailly reported.\nIn these rare stem cells — the parents of immune-system cells — taken from people recovering from Covid, the scientists identified changes in the instructions for which genes got turned on or off.\nThese changes were passed down to daughter cells, leading them to boost production of immune cells called monocytes. In the monocytes from people recovering from severe Covid, the changes in gene expression led the cells to pump out greater amounts of molecules called inflammatory cytokines than monocytes from people who were healthy or had non-Covid illnesses.\nThe researchers observed these changes as much as a year after the participants came down with Covid. Due to the small number of study participants, the scientists could not establish a direct association between the cellular and molecular changes and health outcomes.\nThe investigators suspected that an inflammatory cytokine called IL-6 might play a role in establishing the changes in gene-expression instructions. They tested their hypothesis both in mice with Covid-like disease and in people with Covid.\nIn these experiments, some of the subjects received antibodies at the early stage of illness that prevented IL-6 from binding to cells. During recovery, these mice and people had lower levels of altered stem cell gene-expression instructions, monocyte production and inflammatory cytokine production than subjects that didn’t receive the antibody. In addition, the lungs and brains of mice that received the antibodies had fewer monocyte-derived cells and less organ damage.\nThese findings suggest that SARS-CoV-2 can cause changes in gene expression that ultimately boost the production of inflammatory cytokines, and one type of those cytokines perpetuates the process by inducing these changes in stem cells even after the illness is over.\nIn addition, the findings suggest that early-acting IL-6 is likely a major driver of long-term inflammation in people with severe Covid. These findings shed light on the pathogenesis of SARS-CoV-2 infection and may provide new leads for therapies.\nThe results also underscore the importance of staying up to date with recommended Covid vaccines, which are proven to protect against serious illness, hospitalisation and death.",
  "retrievedAt": "2025-08-11T09:13:41.369Z"
}
