{
  "title": "Minister leads crucial discussion on Hajj 2024, long-term policy implementation",
  "link": "https://www.app.com.pk/national/minister-leads-crucial-discussion-on-hajj-2024-long-term-policy-implementation/",
  "date_published": "2023-08-19T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Caretaker Minister for Religious Affairs and Interfaith Harmony Aneeq Ahmed on Saturday chaired a high-profile meeting centring on accelerating the application process for Hajj 2024 and delving into the comprehensive implementation of a long-term Hajj policy.\nReligious Affairs Secretary Aftab Akbar Durrani, Additional Secretary, Joint Secretary for Hajj, and Director General Hajj were present in this inclusive meeting.\nMinister Aneeq emphasized the significance of learning from past Hajj arrangements to pave the way for further enhancements. He underscored the importance of swift approval of the Hajj policy, highlighting its potential to optimize the overall arrangements.\nDuring the meeting, it was affirmed that a comprehensive strategy would be implemented, catering to both short-term and long-term Hajj policy preparations.\nThe briefing’s notable highlight pertained to the allocation of surplus funds from Hajj expenses back to the revered pilgrims as an unprecedented sum of Rs12 billion was restituted to the pilgrims, marking the first instance of such an extensive refund in history.\nThe minister was told that despite encountering formidable challenges posed by adverse weather conditions, the arrangements for Hajj 2023 stood as a model of excellence in all aspects.\nAs the discussion drew to a close, a resolute commitment was made to expedite the processing of Hajj 2024 applications, ensuring a seamless process for aspiring pilgrims. Additionally, a progressive proposal garnered attention, focusing on the collection of funds for future pilgrims through convenient installments as this forward-looking approach would facilitate the financial aspect of the pilgrimage for years to come.",
  "retrievedAt": "2025-08-11T09:13:33.079Z"
}
