{
  "title": "Journalists vow to become voice of Kashmiris",
  "link": "https://www.app.com.pk/national/journalists-vow-to-become-voice-of-kashmiris/",
  "date_published": "2023-06-27T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP):Senior Kashmiri journalists here on Tuesday vowed to become the voice of Kashmiris at a time when the media in Indian Illegally Occupied Jammu and Kashmir (IIOJK) was totally chocked by Indian government and was not allowed to report ground realities.\nSpeaking at a conference, while pointing out various shortcomings in structuring appropriate narratives on Kashmir, particularly after August 5, 2019, they desired the national media to play proactive role in highlighting Kashmir issue keeping in view the changing global realities and trends.\nThe conference titled “Pleading the case of Kashmir in Changing Global Realities: Challenges and Opportunities” was organized by Institute of Dialogue, Development and Diplomatic Studies (IDDDS) in collaboration with Riphah International University (RIU).\nThe conference was aimed at bringing the Kashmir issue in limelight keeping in view the changing regional and global situations.\nSpeaking on the occasion, Director Riphah Institute of Public Policy, Dr. Rashid Aftab highlighted the need for adapting new trends to make media coverage of Kashmir productive. He said the institute would continue to organize such conference and seminars to formulate comprehensive strategies to promote cause of Kashmir.\nOn the occasion, Executive Director, IDDDS, Dr. Waleed Rasool said the dynamics of Kashmir changed in post 5th August 2019 when India took the unilateral action to scrap special status of IIOJK and divided the whole state in two separate union territories under direct control of New Delhi.\nHe said, media in IIOJK was the first casualty of this onslaught adding foreign media was left with no option but to leave Kashmir whereas the local media was put under total censorship. He said, it was now responsibility of national media of Pakistan to work proactively to highlight Kashmir issue.\nSpeaking on the occasion, columnist and faculty member, Riphah International University, Awais Wasi, who was moderating the conference, said suggestions put forward by journalists in this conference would be properly documented and forwarded to concerned quarters for decisions and policy making.\nHe highlighted the importance of capacity-building of journalists to help them work more effectively in their domains and make their coverage more comprehensive and dynamic.\nSpeaking on the occasion, Senior Journalist, Dr. Ashaf said that the national media could not build narrative properly after August 5, 2019 and urged Kashmiri journalists to fulfill their responsibility and play their role in highlighting Kashmiri issue internationally. He said, media should be proactive in such sensitive matters.\nSenior Journalists, Abid Abbasi highlighted the importance of media policy, saying that there was not any such policy available particularly to deal with August 5, 2019 issue. Another senior Journalist, Ch. Mudassir said that economic independence of journalists was imperative to help them work freely whereas a senior journalist Kasif Mir said that efforts should be made to reach international audience.\nSenior journalists Shahbaz Ahmad, Arshad Ghazi, Shahzad Rathoor, Maqsood Muntazir, Naeem-ul-Asad, Amir Butt Shaukat Ahmed, Latif Dar and Javed Mir also spoke on the occasion. They said, media, particularly Kashmiri journalists should carry forward the case of Kashmir, use all social media platforms and adapt new trends and techniques to promote cause of Kashmiris.",
  "retrievedAt": "2025-08-11T08:48:28.978Z"
}
