{
  "title": "Burhan Wani to be remembered on his 6th martyrdom anniversary",
  "link": "https://www.app.com.pk/national/burhan-wani-to-be-remembered-on-his-6th-martyrdom-anniversary/",
  "date_published": "2022-07-07T12:10:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 07 (APP):Mass public rallies across Azad Jammu Kashmir (AJK) and in various parts of Indian Illegally Occupied Jammu and Kashmir (IIOJK) on Friday will resolve to continue the mission of Shaheed-e-Hurriyat Kashmir Burhan Muzaffar Wani till the liberation of the occupied Kashmir from the Indian bondage.\nKashmiris living at both sides of the line of control (AJK and IIOJK) and rest of the world are all set to pay glorious tributes to the young martyred hero of the Kashmir freedom struggle  Burhan Muzaffar Wani and his companions on his 6th martyrdom anniversary falling on July 8,  with the renewal of the pledge to continue the mission of the young martyred Kashmiri till its accomplishment through the liberation of the motherland from the  forced and unlawful Indian occupation.\nIn Azad Jammu & Kashmir, mass public rallies and demonstrations besides special prayers for shaheed Wani and other martyrs in all ten district and tehsil headquarters will be held on this day.\nIn IIOJK there will be complete shutdown strike across the occupied valley to mark  the day followed by anti India and pro~freedom rallies and demonstrations.\nSpeakers will pay rich tributes to shaheed Burhan Wani for bringing the Kashmir freedom struggle in IIOJK to the decisive stage by giving the supreme sacrifice of his precious life.\nA large number of people from all segments of the civil society including traders, political, social and human rights activists, lawyers, journalists, teachers, students and private and government servants will stage a rally which will be culminated at the site of its beginning after going through various roads.\nA 22-year-old Shaheed Burhan Muzaffar Wani  had secured the great honour to  infuse a new spirit and more vigor among the Kashmiri youth to perpetuate the\n75-year-old Kashmir freedom movement through persuading the Kashmiri youth  for  the freedom struggle through the social media besides, to apprise the external world of  the exceptional importance of the Kashmiris indigenous struggle for  freedom of the motherland from Indian yoke.\nHe was gunned down by the Indian occupational forces in  Bamdoora Kukernaag area of IIOJK on July 8 in 2016,  in a fake encounter.\nIndia’s forced and unlawful occupation of IIOJK had never been welcomed by the people, which is why waves after waves of freedom movement have been generated in IIOJK.\nIt may be recalled that Burhan Wani was seen as the main draw for many young and educated boys in IIOJK turning into freedom fighters few months before his martyrdom at the hands of the Indian occupational forces.\nHe featured in videos and photos posing with weapons and taunting the Indian occupational security forces, which were circulated on Facebook and WhatsApp in an attempt to recruit young Kashmiri generation in the freedom struggle.\nShaheed Wani was stated to be an expert in using social media and delivered strong speeches. He was from a well-off family in Tral in south IIOJK, not far from the place of his martyrdom along with two of his comrades at the hands of the Indian occupying forces.\nOne of his brothers was martyred by the Indian Army in 2015 when he allegedly attempted to meet Burhan in the thick Tral forests.\nThe valiant son of the soil – Burhan Wani had become a big security threat for India and her occupational forces in IIOJK as he built a large following among freedom-monger young Kashmiris.",
  "retrievedAt": "2025-08-11T15:13:00.907Z"
}
