{
  "title": "Sherry briefs Kerry on climate change impacts over Pakistan",
  "link": "https://www.app.com.pk/national/sherry-briefs-kerry-on-climate-change-impacts-over-pakistan/",
  "date_published": "2022-07-07T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP): Federal Minister for Climate Change Senator Sherry Rehman briefed the United States Special Presidential Envoy for Climate, John Kerry about the hazardous impacts of climate change faced by Pakistan during a telephonic conversation on Thursday.\nUS Envoy Kerry during his telephonic call congratulated Sherry Rehman on assumption of her office and expressed the desire to continue working together for tackling climate change issues, said a news release.\nThe minister underscored that Pakistan was consistently placed in the top ten ‘most vulnerable’ countries in the world impacted by climate change which has now become an existential threat to the country.\nSherry apprised Senator Kerry about Pakistan’s accelerated vulnerability to the climate crisis, saying that despite producing less than one percent of GHG emissions Pakistan was now the ground zero of a global climate catastrophe. The country was lurching from unprecedented heat waves, to critical glacial melt, drought one month and flooding in another. While high climate ambition commitments are important, including NDCs that include an enormous energy transition, Pakistan is facing down the costs of global warming at 9.1 % of its GDP, which is the highest in the region as identified by a recent UN-ESCAP 2022 report. The time to intervene is now, as water scarcity by 2025 is also a looming crisis if current trajectories continue.\nApprising Mr. Kerry on the NDCs, the minister remarked, “with the current global energy crisis, and the disruption in supply chains caused by the Ukraine war, including the invisible costs of the pandemic to climate vulnerable countries, energy transitions are facing an uncertain timeline, so technical and financial assistance is the need of the hour.\nThey discussed a need for just energy transition from fossil fuels to renewable energy and committed to a renewed working partnership between PAK-US. Furthermore, they talked about Pakistan’s commitment to a Global Methane Pledge, and suggested cooperation on the path forward.\nRehman appreciated the Biden administration’s commitments to global climate goals and thanked Senator Kerry for his strong personal leadership of these most defining challenges for the 21st century.",
  "retrievedAt": "2025-08-11T15:12:58.092Z"
}
