{
  "title": "Resistance Day on Friday to remember tech-savvy Kashmir movement icon on his 6th anniversary",
  "link": "https://www.app.com.pk/national/resistance-day-on-friday-to-remember-tech-savvy-kashmir-movement-icon-on-his-6th-anniversary/",
  "date_published": "2022-07-07T09:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP):Six years after Indian forces martyred tech-savvy young icon of Kashmir freedom struggle, Burhan Muzaffar Wani, many things have changed, but normalcy seems to be far off dream for Kashmiris as Indian forces continued unabated state terrorism to suppress peaceful resistance movement.\nThe cricket-lover Wani and his fellows were extra-judicially martyred by Indian forces on July 8, 2016. Representing his generation, the martyred youth rekindled the freedom struggle and defeated the fictitious Indian narrative about Kashmiris’ indigenous freedom struggle. India had been striving hard for many years to equalize the struggle with terrorism, however Wani frustrated these designs by sacrificing his life for the cause.\nEvery year, the Indian authorities impose strict restrictions to prevent people from commemorating the day and pay tribute to the martyred leader. However, despite restraints, people reach Tral (home town of the deceased leader) to pay homage to him.\nKashmiris are observing Martyrs Week from July 8 to July 13. Every year on July 8, Burhan Wani’s martyrdom anniversary is observed as ‘Resistance Day’ while July 13 as Kashmir Martyrs’ Day in memory of 22 people who fell to the bullets of Maharaja’s troops in Srinagar in 1931.\nThe Resistance Day would be commemorated to pay tribute to Wani and his fellows in particular and all martyrs in general; reiterate commitment for continuing freedom struggle; and remind the world of its promises made to Kashmiris.\n“The purpose to observe Martyrs Week is to pay tribute to martyrs and reiterate commitment to continue their mission for freedom of Kashmir,” Sheikh Abdul Mateen, Secretary General APHC told APP.\nWani, who belonged to a highly-educated Kashmiri family Tral, started longing form freedom after witnessing the deadly summer agitation of 2010 in which 130 civilians were brutally gunned down by Indian forces. His brother and a friend were also beaten and humiliated for no reason by Indian forces in Tral.\nThe martyrdom of his brother in 2015 strengthened his resolve to fight the Indian occupation and entice Kashmiri youth through the social networking media. He was not alone in this, rather dozens of educated youth belonging to well-off families, who had been witnessing the oppression and Indian state terrorism, joined him to fight against Indian occupation. Wani was exceptionally active on social media, and did not hide his identity behind a mask.\nFollowing the sayings of martyred leader, Syed Ali Shah Gilani “Shuhada Kay Waris Zinda Hay” (The heirs of martyrs are alive), Kashmiris are determined to render sacrifices for continuation of martyrs mission for freedom struggle.\n“We are proud of our youth who have always been at the forefront of resistance struggle” said incarcerated APHC Leader, Nayeem Ahmed Khan in his message from Tihar Jail while recalling Martyr Wani.\nHe said it was time to remember the selfless services of all those brave-hearts whose sacrifices brought Kashmir at the center stage at world level.  “Our nation has an enviable history of fighting against oppressors and usurpers”, and the Indian rulers knew well that Kashmiris could not be conquered by force.\nAPHC Vice Chairman Ghulam Ahmad Gulzar in his message from Central Jail Srinagar described Shaheed Burhan Wani as real hero and symbol of resistance whereas General Secretary Molvi Bashir Ahmad Irfani said it was moral responsibility of Kashmiris to protect the sacrifices of Burhan Wani and other martyrs.\nThe APHC AJK Chapter is holding a solidarity rally on Friday to commemorate the day and pay tributes to the martyrs. Protest rallies are also scheduled at Muzaffarabad and other parts of Azad Jammu and Kashmir. Kashmiris living abroad would also hold seminars, conferences and rallies to pay tribute to the martyred leader and remind the world of its commitments made to Kashmiris for providing them right to plebiscite to decide their future.\nIndian forces have martyred 96,089 Kashmiris since 1989 which include 7,244 custodial killings. The authorities arrested 164,931 civilians and destroyed or arsoned 110,484 structures. During this period 22,946 women were widowed, 107,866 orphaned and 11,255 women were gang-raped or molested, according to data compiled by Kashmir Media Service (KMS).\nKashmiris are waiting for last over 7 decades to exercise their UN-Mandated plebiscite to decide about their future. However, Indian obduracy is the only hurdle to let them exercise this right. Consequently, not only Kashmiris but people of whole South Asian Region are exposed to nuclear war threat and are facing challenges like underdevelopment and poverty. We hope sanity prevails over India to let Kashmiris exercise their right. This would not only have positive impact on the lives of Kashmiris, but would be more beneficial for the whole sub-continent in terms of peace and prosperity.\n(Report by M. Ashraf Wani)",
  "retrievedAt": "2025-08-11T15:13:03.222Z"
}
