{
  "title": "IPRI launches “Readers Lounge” to enable easy knowledge access",
  "link": "https://www.app.com.pk/national/ipri-launches-readers-lounge-to-enable-easy-knowledge-access/",
  "date_published": "2022-07-07T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP): The Islamabad Policy Research Institute (IPRI) on Thursday launched its most modern digital library named as “Readers Lounge” to enable easy knowledge access to researchers, scholars and students at a single click online.\nA launching ceremony was organised here at the Jinnah Hall of IPRI which is a dedicated library of the Institute where senior Defence Analyst Professor Dr Rifaat Hussain was the chief guest on occasion.\nIn his welcome remarks, President IPRI Ambassador Dr Raza Muhammad said the skills of knowledge learning namely reading and writing have been bestowed upon mankind by the Almighty. Emphasising the need of modern learning skills, he said the study of religious knowledge and teachings of the Holy Prophet (PBUH) indicated the emphasis laid on education and learning.\nRaza said the initiative of the digital library has been taken to bring the heaps of books at a single platform accessible from anywhere in the world.\n“Dr Hussain Nadim has been the key person to make this effort to digitize the books come true. We have connected our library with the National Archives of Pakistan which is a knowledge hub but was an inaccessible platform to everyone,” he said.\nThe President IPRI underlined that a great effort has been done to provide library access to the students of far-flung areas, adding, “initially the library will be free for six months to everyone.”\nExecutive Director Communications and Reforms IPRI Dr Hussain Nadim said the endeavour was initiated back in February 2021 and took a year to achieve its successful execution.\nNadim added that the IPRI took digital transformation steps in September 2021 whereas the institution existed since 1999 but the new thing was it’s new look and accessibility to the masses.\n“IPRI is a larger think tank on all social media platforms across Asia. It has 4,000 subscribers on WhatsApp whereas it has presence on all major social media platforms expect TikTok. It has 3.5 million views on social media mostly from India, US and Middle East,” he said.\nThe team at IPRI had developed a digital infrastructure which would give propitious results in the future. “The research material is useless until it’s made comprehensible and easily consumable. Our info-graphics have gone famous mostly made on Afghanistan which are equally beneficial for CSS aspirants to prepare for competitive exams,” he highlighted.\nHe added that the initiative helped taking IPRI to the palms and cellphones of the people which was the vision agreed by the former National Security Adviser (NSA) Dr Moeed Yusuf.\nThe digital library has been developed by small team at IPRI at a ten times lesser cost of the market value. He extended his gratitude to former NSA Dr Moeed Yusuf who supported the project during his tenure and provided the required vision for implementation.\nThe administration of IPRI also supported for digital transformation of the library where Director Research and Analysis Brigadier (R) Raashid Wali Janjua also provided great contributions alongwith Coordinator Administration and Finance Brigadier (R) Naveed Ali.\nHe added the scholarly and intellectual articles of JSTOR was made accessible whereas based on the transformation vision of IPRI the digital library was the last component. “The Reader’s Lounge idea has started from the idea that the students of farflung and less developed areas had no access to library”.\nThe difference between an online library and a digital library was that the latter was evolving, interactive and a smart library that aided its users, he said.\nHe also presented a demonstration of the digital Readers Lounge which was a separate website that contains almost 3,500 books of IPRI and a plethora of other books of renowned authors. It had also interacted IPRI journals and policy papers in it.\nHe added that it also includes historic images provided by the National Archives of Pakistan that in itself were having a story which was powerful for the researchers.\nThere were also audio voices of foreign affairs magazines and other journals alongwith audio and videos provided by the National Archives of Pakistan, he added.\nThe international newspapers like the Guardian, the New York Times and others were available for free with the purpose to aid researchers.\nDr Nadim shared that the messages received by the students of rural and less developed areas after the launch of the library were heartening.\n“We want to reach out public, students and universities to create an ecosystem of research through this library,” he added.\nThrough this example, he said IPRI tried to show that there were four things to transform any public institution that were intention to reform, ability for the vision to be big, freedom to act, and continuity in the process.\nThe President of Pakistan, he said provided his full support for this project, adding, “the new messiah is technology and digitization that can transform any public sector department of Pakistan as the entire library has been created by two people from the technical side.”\nChief Guest Dr Rifaat Hussain said the digital platforms were pivotal and very important as the example of IPRI was evident that lead to a remarkable institution.\n“There are couple of risks when the data is ditigized like hacking. The second risk is that the digitization is alright but how computer literacy to be increased where people spend less than seven rupees per capita to buy books in Pakistan,” he said.\nHe remarked that Dr Hussain Nadim made a very important point that Pakistan has a huge environment of qualitative research which should be capitalised.\nHe lauded the efforts and success of IPRI to establish a digital library and said, “We should give opportunities for the youth to progress and excel in their field.”",
  "retrievedAt": "2025-08-11T15:13:03.787Z"
}
