{
  "title": "PM for live telecast of Parliament’s Standing Committees’ proceedings",
  "link": "https://www.app.com.pk/national/pm-for-live-telecast-of-parliaments-standing-committees-proceedings/",
  "date_published": "2022-07-07T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 7 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday decided to telecast live the proceedings of Parliament’s Standing Committees, an essential and vital part of the Parliament.\nThe Prime Minister, in this respect, has written a formal letter to Speaker National Assembly Raja Pervaiz Ashraf.\nHe said that since the government of Prime Minister Nawaz Sharif, in the past, had taken a revolutionary step of launching PTV Parliament, second phase of that process, which had been halted by the previous government during the last four years, should be initiated at the earliest.\nThe Prime Minister, in his letter to the Speaker National Assembly, said that an appropriate procedure and parameters for live telecast of the meetings of Standing Committees should be finalized.\nHe further said that former Speaker National Assembly Ayaz Sadiq in coordination with Mohtarma Marriyum Aurangzeb had started the process of telecasting the Parliament’s Proceedings for general public in a very appreciable manner.\nThat step was much appreciated and welcomed by masses, journalists and people from other segments of life, the Prime Minister added.\nHe said that Raja Pervaiz Ashraf being a political worker and an important leader of the party, which had achieved the distinction of making the constitution, was well aware of the importance of constitution and Parliament.\nThe Prime Minister said that he has directed Minister for Information and Broadcasting Mohtarma Marriyum Aurangzeb to speed up the process of the live telecast under the guidance of Speaker National Assembly.\n“I hope that this joint effort will bring further respect to the Parliament,” he said, adding, that masses especially the youth will get awareness about constitution, their rights, the importance of parliament and its performance in democratic system.\nThe Prime Minister directed the Ministry of Information and Broadcasting to ensure implementation of second phase of the project in coordination with Speaker National Assembly on urgent basis.\nMeanwhile, the Prime Minister in a tweet posted on his social media account said, it was important to engage the people in the parliamentary proceedings.\n“They should know how parliament works and what their representatives are doing,” he added.",
  "retrievedAt": "2025-08-11T15:12:58.217Z"
}
