{
  "title": "Rehman Malik asks FATF president to remove Pakistan’s name from grey list",
  "link": "https://www.app.com.pk/national/rehman-malik-asks-fatf-president-to-remove-pakistans-name-from-grey-list/",
  "date_published": "2021-01-25T17:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Senate Standing Committee on Interior Chairman Senator Abdul Rehman Malik has asked the Financial Action Task Force (FATF) to remove Pakistan’s name from its grey list after unearthing of Indian propaganda campaign.\nIn a letter written to FATF President Dr Marcus Pleyer on Monday, he pleaded removing the name of Pakistan from its grey list after unearthing of a 15-year-long Indian disinformation campaign organised by EU Disinfo Lab, a European non governmental organisation.\nHe thanked FATF for giving a relief of five months to Pakistan for submission of response on FATF observations and requested to either permanently remove the name of Pakistan from the grey list or extend further grace period in wake of coronavirus outbreak to enable the country to exercise our full potential against the pandemic.\nHe expressed that the COVID19 pandemic has already damaged Pakistani economy tremendously and the restrictions imposed because of FATA grey list are further hampering our economy.\nHe said the United Nations report on terrorism has warned that there are a significant number of ISIS terrorists in two states of India, namely Kerala and Karnataka and proven facts that India is financing and supporting terrorism, yet FATF so far has initiated no action while merely based on propaganda Pakistan is placed in grey list.\nRehman Malik, in his letter to FATF president, wrote, “FATF’s restrictions are negatively impacting the lives of ordinary people of Pakistan, I once again request you to please dismiss the complaint against Pakistan as it was manoeuvred by India for its political vendetta against Pakistan, which has now been fully exposed by Disinfolab EU as to how India made fake, baseless and venomous propaganda to harm the reputation of Pakistan.”\nThe background work of Indian propaganda based on criminal activities of Indian government stands fully exposed which you may like to refer and peruse on the Disnfolab official website, he added.\nHe said he hopes the FATF in its upcoming meeting will examine the Indian misconduct and he also hopeful that the complainant country the USA will also reconsider to withdraw this complaint as Pakistan has been falsely framed into money laundering without evidence and basis.\n“The criminal forgery by India against Pakistan regarding its alleged involvement in money laundering needs your impartial review to decide to withdraw Pakistan from the Grey List”, he added.\nRehman Malik elaborated that the disclosures made by DisinfoLab have now made it clear that Pakistan is made a victim of a hybrid war launched by India for the sake of its political vendetta against my country.\nHe wrote rather, Pakistan has made significant contributions towards achieving world peace by participating in United States (US) war on terror and fight against money laundering.\nEven though, Pakistan is suffering heavily for having committed no alleged crime but for helping the international community.\nHe added the people of Pakistan are rightly upset to note that despite losing seventy thousand innocent lives, fighting for the US war on terror and against money laundering, instead of appreciating its contribution to the world peace, the international community including the FATF are treating Pakistan unkindly and unjustly.\nAt the end, Rehman Malik, in view of the above mentioned real hard facts and heavy economic sufferings, pleaded to take the name of Pakistan out of the grey list of FATF, as continuously keeping the nation on the grey list, without any cogent reasons as it was manoeuvred by India, will further cause irreversible loss to our economy and reputation.\nResponding to a question about Broadsheet scandal, Rehman Malik said Broadsheet scandal has landed the country in an embarrassing situation, exposing inability (of past rulers) to handle the issues going on in foreign courts.\nInstead of hunting stolen money by some Pakistanis, Broadsheet, unfortunately, hunted Pakistan itself and now Pakistan has been forced to pay Broadsheet instead of getting the assets recovered, he added.\nHe said the Broadsheet owners/claimants deserve to be in jail rather than being the beneficiary of $28 million from our national exchequer and our government must move a case for criminal proceedings against them.",
  "retrievedAt": "2025-08-11T20:16:43.211Z"
}
