{
  "title": "PPP, PML-N have trapped in foreign funding case: Faisal Javed",
  "link": "https://www.app.com.pk/national/ppp-pml-n-have-trapped-in-foreign-funding-case-faisal-javed/",
  "date_published": "2021-01-25T16:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Senate Standing Committee on Information and Broadcasting Chairman Senator Faisal Javed Khan Monday said Pakistan Peoples Party (PPP) and Pakistan Muslim League –Nawaz (PML-N), which were trying to trap Pakistan Tehreek-e-Insaf (PTI) in the foreign funding case, had got themselves trapped in the case.\nTalking to media here at the Parliament Press Briefing Room, he said the opposition parties had not submitted details of foreign funding to the Election Commission of Pakistan, while the PTI had provided the record of 40,000 donors, besides audited accounts.\nHe said Nawaz Sharif also received funding from Osama Bin Laden for contesting elections.\nFaisal Javed said opposition’s resignations from assemblies were become anecdotes.\nHe said public rejected opposition’s call for protest, adding opposition just needed one thing that was National Reconciliation Ordinance.\nHe said opposition demanded amendments to 34 of the 38 clauses of the National Accountability Bureau related legislation and demanded the removal of the cases against their leaderships. He said opposition’s politics had come to an end.\nFaisal Javed said Prime Minister Imran Khan had not to construct palace or do business like previous rulers, adding that he was making efforts only for the progress and prosperity of the country.\nHe said The Pakistan Electronic Media Regulatory Authority (PEMRA) (Amendment) Bill, 2020 was aimed at protecting employment of media persons.\nHe said the bill was unanimously passed by the committee after detailed discussion.\nThe bill was nothing to do with freedom of the press rather it was only related with the media workers employment, he added.\nHe said the committee had also taken on board all stakeholders about the bill. He said opposition opposed the bill for the second time in the house.\nHe said the PPP was making big claims but it was proved today that they were not with media persons at all. He announced that the bill would be again introduced in the house.\nHe said this bill was nothing to do with politics but an effort to protect media persons.\nSpeaking on the occasion, Parliamentary Reporters Association President Behzad Saleemi also expressed displeasure over the opposition’s non serious behaviour regarding the job security of media persons bill.",
  "retrievedAt": "2025-08-11T20:16:31.956Z"
}
