{
  "title": "India achieves ‘historic’ space docking mission - World - DAWN.COM",
  "author": null,
  "content": "India docked two satellites in space Thursday, a key milestone for the country’s dreams of a space station and manned Moon mission, the space agency said.\n\nThe satellites, weighing 220 kilograms each, blasted off in December on a single rocket from India’s Sriharikota launch site. Later they separated.\n\nThe two satellites were manoeuvred back together on Thursday in a “precision” process resulting in a “successful spacecraft capture”, the Indian Space Research Organisation (ISRO) said, calling it a “historic moment”.\n\nIndia became the fourth country to achieve the feat — dubbed as SpaDeX, or Space Docking Experiment — after Russia, the United States and China.\n\nThe aim of the mission was to “develop and demonstrate the technology needed for rendezvous, docking, and undocking of two small spacecraft”, ISRO said.\n\nPrime Minister Narendra Modi congratulated Indian scientists for the successful docking.\n\n“It is a significant stepping stone for India’s ambitious space missions in the years to come,” he said on social media.\n\nTwo earlier docking attempts by ISRO were postponed due to technical issues.\n\nISRO said the technology is “essential” for India’s Moon mission, and comes after Modi announced plans last year to send a manned mission to the Moon by 2040.\n\nThe world’s most populous nation has flexed its spacefaring ambitions in the last decade with its space programme growing considerably, matching the achievements of established powers at a much cheaper price tag.\n\nIt became just the fourth nation to land an unmanned craft on the Moon in August 2023.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/161338245764300.jpg",
  "retrievedAt": "2025-08-26T07:43:39.313Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885632/india-achieves-historic-space-docking-mission",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T10:38:25.000Z"
}
