{
  "title": "Grand jirga vows to work for peace in GB - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: The particip­a­nts of a grand jirga on We­­dnesday discussed issues related to law and order, development, hea­lth and education in Gilgit-Baltis­tan and vowed to work for peace in the region.\n\nThe jirga held in Chilas was attended by Chief Minister Haji Gulbar Khan, GB Force Co­­mman­der Maj Gen Imtiaz Hus­s­ain Gillani, members of the Gil­git-Baltistan Assembly, secretaries, district officers, religious sch­­olars, and a large number of local community elders and students.\n\nThe participants agreed to work towards maintaining law and order, fostering development in the area and actively contributing to these goals.\n\nSpeaking on the occasion, Maj Gen Gillani highlighted that the attendance of senior civil and military officials at the jirga demonstrated their accountability to the public.\n\nHe assured that Pakistan Army would play its full role in addressing the region’s issues and continue to support relevant institutions to ensure their resolution.\n\nHe emphasised the im­­p­ortance of local communi­­ty involvement in the reg­ion’s development, encouraging collaboration betw­een the community and institutions.\n\nTo achieve this, he suggested introducing community-based systems to empower people to contribute actively to development initiatives.\n\nReligious scholars and community leaders expr­essed their full support for Pakistan Army in maintaining peace and promoting development in the region.\n\nLater, Maj Gen Gillani visited the Vocational Tra­ining Centre in Chilas and met the youth hailing from different areas of Diamer.\n\nHe encouraged them to play an active role in fostering peace and development in Gilgit-Baltistan and Pakistan, urging them to use modern technology and social media positively.\n\nThe students appreciated Pak­istan Army’s effo­rts in ensuring peace and development in the region.\n\nPublished in Dawn, January 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67883e5173ff9.jpg",
  "retrievedAt": "2025-08-26T07:44:10.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885516/grand-jirga-vows-to-work-for-peace-in-gb",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T02:01:35.000Z"
}
