{
  "title": "PTI wants new chief election commissioner as govt insists on status quo - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While the government has already legislated thro­ugh the 26th amen­dment to keep the serving Chief Election Commissioner (CEC) Sikandar Sultan Raja till the appointment of next CEC, the PTI has app­roached National Assembly Speaker Ayaz Sadiq to initiate the process for appointment of new CEC as the incumbent’s tenure will end in 10 days.\n\nIn a letter to the National Assembly speaker, Leader of the Opposition Omar Ayub Khan has demanded formation of a parliamentary committee for appointing the next CEC.\n\n“In accordance with the Article 215(1) of the Constitution of the Islamic Republic of Pakistan, the tenure of the incumbent CEC Sikandar Sultan Raja is set to expire on Jan 26, 2025.\n\n“In pursuant of Article 213 (2A) and (2B) of the Constitution of the Islamic Republic of Pakistan, it is kindly requested to constitute the Parliamentary Committee on the appointment of the CEC at your earliest convenience to facilitate this important constitutional requirement. This will ensure a smooth and timely appointment as mandated by the Constitution,” he stated.\n\nOn the other hand, PTI chief whip in the assembly Malik Mohammad Amir Dogar, while speaking on the floor of the house on Wednesday, said the Election Commission of Pakistan remained the most controversial institution in country’s history.\n\nAyub writes to NA speaker as Raja’s tenure ends in 10 days\n\nThe five-year term of CEC and two members of the ECP will end on Jan 26, but they will indefinitely continue to hold their offices under the controversial legislation.\n\nUnder the 26th Amendment, the tenure of CEC and two members, namely Nisar Ahmad Durrani (Sindh) and Shah Muhammad Jatoi (Balochistan), will be automatically extended until the posts are filled under a procedure that may take months.\n\nThe tenure of the commissoin members from Sindh and Balochistan will end on Jan 26.\n\nUnder the 26th Amendment, they will continue to work even after the completion of their term, as Article 215 of the Constitution allows them to remain in their offices until the appointment of a new CEC and members is made.\n\nThe notification for the appointment of Sultan Sikandar Raja was issued on Jan 25, 2020, but he took the oath of his office on Jan 27, 2020.\n\nUnder Article 215, it is mandatory to appoint a new CEC or members of the commission within 45 days after the expiry of their term.\n\nThe procedure for appointing the CEC and members of the commission is explained in Article 213 under which the prime minister and the opposition leader will send three names to the president by consensus.\n\nIf there is no agreement on the names between the two, then the prime minister and the leader of the opposition will send their respective names to a parliamentary committee. After this, the NA speaker will form a 12-member parliamentary committee, which will send one name from among these to the president for approval.\n\nPublished in Dawn, January 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:44:11.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885519/pti-wants-new-chief-election-commissioner-as-govt-insists-on-status-quo",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T02:01:07.000Z"
}
