{
  "title": "Now what? - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT is now clear even to Israel’s apologists that Israel’s war has not been undertaken against Hamas but for the creation of the ‘Greater Israel’ project. Gaza is now non-existent, except for its brave inhabitants.\n\nThe population of the West Bank is under pressure to leave. Lebanon has been silenced and is compromised for the time being, but Hezbollah is still alive and well. The monarchy in Jordan is a part of the American-European alignment.\n\nMeanwhile, Syria’s defence arsenal has been bombed out of existence; the country has been partially occupied as well. Once again, Israel has emerged as the major Middle Eastern power. It controls the area ‘from the river to the sea’ just as Moses had gifted to the Israelites, and it has been acquired through violence.\n\nThe Israeli success has been made possible by its US-supplied air force which has remained intact and cannot be challenged by any other air force in the region. The inaction of the United Nations in the face of the Israeli genocide has been made possible by support for Israel at the UN Security Council by the American and European powers that have also provided the state with arsenal, spare parts, and finances, in violation of international law.\n\nThe US alone has committed billions of dollars to Israel for defence equipment on an annual basis. According to one study, in the first year of the war in Gaza, the US spent at least 17.9bn in military assistance for Israel. In addition, the genocide has led to questions about the US role in the Sudan famine and America’s illegal war in Iraq and Syria.\n\nA ‘Greater Israel’ will consist of a population which is solidly against Israel.\n\nHowever, the genocide has changed many other things. International law, covenants, and institutions no longer have the legitimacy that they once enjoyed. Secularism and human rights, which are the foundation of international law, have been violated, leading to a serious division in the world on a North-South basis.\n\nIt is obvious that the white world is in no position to provide leadership to the world at large. It is also obvious that antisemitism and Holocaust laws protecting the Jews and Israel against critical speech or actions are in the process of becoming myths, and are already subjects of ridicule, or at least a source of amusement for the people. It is obvious that the Western media can no longer be believed; its pro-white biases are very clear. Many allege that it is bribed to lie while its correspondents invent stories that favour the positions taken by the US and Europe. It is also obvious that Muslim countries are more interested in protecting their own national interest rather than supporting the concept of a larger Islamic world.\n\nIt is obvious to the citizens of the West that elections in the US as well as European policies are governed by large global corporations controlled by pro-Israel elements and that US policy is determined by the state of Israel. In the West, especially in America, there is public anger that the tax dollars paid by the citizens are used as economic aid for Israel and to fund arms supplies to it.\n\nIt is also clear that the majority of the youth in the North are solidly behind the anti-genocide movement; this is more than apparent in the huge demonstrations held by young people on the streets and university campuses in cities across the US and in European capitals.\n\nSuch demonstrations appear to have few parallels in the history of the West. The youth are also angry that the values they have been taught in schools and universities can no longer serve as a guide for them. There is a search for an alternative to what has been destroyed. The older generation of politicians, on the other hand, is doing everything possible to maintain the status quo with the help of the media.\n\nFor the West, the purpose of the genocidal war is the creation of a ’Greater Israel, which can control the Middle East and the immense resources that it contains.\n\nHowever, a ‘Greater Israel’ will consist of a population in which the majority is solidly against Israel and the policies of the West, and in search of an alternative global order. It would also be a state surrounded by Arab states and an angry young generation, which has seen murder and has been humiliated and tortured. It has also witnessed the destruction of its education and medical infrastructure. The question is, can such a situation last? And if it cannot then what will replace it? And what will be the replacement process given the actors involved in this complex drama?\n\nThe writer is an architect.\n\narifhasan37@gmail.com\n\nwww.arifhasan.org\n\nPublished in Dawn, January 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67887afb8810e.jpg",
  "retrievedAt": "2025-08-26T07:43:43.165Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885569/now-what",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T03:22:00.000Z"
}
