{
  "title": "Integrated system at Torkham to enhance trade with Afghanistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The adviser to chief minister on finance and inter-provincial coordination, Muzzamil Aslam, was told during a briefing on Wednesday that Integrated Transit Trade Management System (ITTMS) would be made operational at Torkham within two to three months to enhance bilateral trade between Pakistan and Afghanistan.\n\nHe was given a detailed briefing by relevant authorities at Michni checkpost during his daylong visit to the border crossing. He was told that with the activation of the ITTMS, cross-border vehicular movement would be increased from about 600 to 2,000 and would also reduce traffic congestion at the border crossing point.\n\nHe was told that efforts were also under way to install more electronic scanners at the custom terminal to reduce load on the existing one scanner each for export and import terminals.\n\nThe adviser on finance was informed that a mechanism would soon be devised to expedite custom clearance of fruits, vegetables and other perishable items.\n\nCM’s aide orders setting up of market at border point\n\nHe directed authorities concerned to explore ways and means to establish a market at the border point to facilitate local traders and provide business opportunities to more entrepreneurs.\n\nHe said that Torkham border could also be developed as a tourist spot as it had attracted a large number of foreigners in the past.\n\nHOSPITAL: The adviser to chief minister on health, Ihtisham Ali detected gross irregularities in health delivery system during his visit to district headquarters hospital Landi Kotal on Tuesday evening.\n\nPatients, their attendants and paramedic staff at out-patient department, emergency unit and general wards put before him a heap of complaints regarding lack of facilities and non-committal attitude of the medical superintendent of the hospital.\n\nThey told him that they were not provided with free medicines from the hospital medical store. Checking medical store at the OPD, he could found only dyclo (diclofenae sodium) injections with no other lifesaving drugs and necessary surgical instruments.\n\nHe was informed that nine specialist doctors had long gone on leave due to lack of facilities and unbearable attitude of the hospital’s medical superintendent. He found most of the hospital wards empty during his visit.\n\nHe expressed his utter displeasure over the absence of medical superintendent during his visit and directed relevant officials to initiate an enquiry into all the irregularities and discrepancies he personally witnessed during his visit.\n\nDr Jamshed Sherani, the medicial superintendent of the hospital, could not be approached for his reaction on Wednesday despite repeated efforts by this scribe though he was present at his office till late in the day.\n\nPublished in Dawn, January 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:43:56.878Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885471/integrated-system-at-torkham-to-enhance-trade-with-afghanistan",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T02:02:25.000Z"
}
