{
  "title": "Two ward boys arrested for ‘raping’ female patient in Mardan - Pakistan - DAWN.COM",
  "author": null,
  "content": "MARDAN: The administration of Mardan Medical Complex hospital (medical teaching institution) has suspended two class-IV employees of the health facility over their alleged involvement in rape of a mentally-ill female patient.\n\nThe officials of Dubai Adda police post said here on Wednesday that a resident identified as Liaqat Ali of the relevant area registered a report of his missing 32-year-old sister.\n\nThey, however, said that the complainant along with his sister visited the police post a few days back and registered a statement with them that his sister who was mentally unstable was allegedly raped by two class-IV employees of Mardan Medical Complex hospital.\n\nThe hospital was located within the limits of Sheikh Maltoon police station that was why the officials formally registered FIR against two hospital ward boys.\n\nThe police said that one of the accused had been arrested while the other was still at large. The officials said the rape incident took place in the first week of this month. They added that the female patient remained missing for a few days.\n\nAs per the FIR and preliminary investigations, it was revealed that the female patient had developed friendly relations with one of the accused, who posed to her as a doctor.\n\nThe police said the female patient came to hospital on a phone call of the accused, who kept her in a room located near the hospital gate for several days. The accused also informed the second accused and both of them raped the woman time and again.\n\nThe police also said that the absconding accused also allegedly kept the female patient at an unknown place for several days.\n\nPublished in Dawn, January 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:43:57.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885474/two-ward-boys-arrested-for-raping-female-patient-in-mardan",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T02:02:25.000Z"
}
