{
  "title": "Pakistan desires to play ‘70’s instrumental role’ in bringing U.S., China closer: PM",
  "link": "https://www.app.com.pk/national/pakistan-desires-to-play-70s-instrumental-role-in-bringing-u-s-china-closer-pm-2/",
  "date_published": "2022-02-08T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):Prime Minister Imran Khan has said that Pakistan has good relationships with both China and the United States and wants to play the same ‘instrumental role of the 70s’ which had brought the two countries closer.\n“We have a good relationship with the U.S. and also an iron-brother relationship with China. We want to play the role of 1970 when Pakistan was instrumental in getting the United States and China together,” he said in an exclusive interview with Liu Xin of CGTN’s The Point.\nThe prime minister was referring to the historic breakthrough in China-U.S. relations in 1971 which was made possible due to the pivotal role played by Pakistan, which also enjoyed the trust of both countries.\n“The famous visit of Dr. Henry Kissinger (the U.S. State Secretary) was organized by Pakistan, so we hope to play that [same] role,” he said.\nReplying to a question, he said the world cannot afford another cold war between China and the U.S.\n“The world should not go through the situation where it is divided into two camps and it does not benefit anyone,” he said. “I hope that this does not escalate into another cold war where we have to choose sides.”\nImran Khan said his priority in Pakistan was the uplift of 220 million people which was also linked with peace and stability.\n“I will get my people out of poverty if we have economic well-being, which comes with stability and peace,” he said. “So, if you have conflicts, the first thing that gets affected is the economy and that is what we don’t want.”\nTaking about the impact of Pakistan-China ‘all-weather strategic ties’ on the region particularly Afghanistan, he said there was a consensus between Pakistan and China on how the two sides could cooperate in bringing stability and prosperity.\nHe mentioned that no other country than Pakistan had suffered in view of the Afghan conflict for 40 years, adding that for the first time, there was an opportunity of restoring peace in the war-torn country.\nHe said as Afghanistan faced a humanitarian crisis due to the freezing of foreign aid, Pakistan, China, and other European states agreed that “somehow likes and dislikes of the Taliban government should be set aside and the only thing in minds should be the 40 million people of Afghanistan – half of them in a very precarious position of food insecurity”.\nThe prime minister termed as “unique” the relationship between Pakistan and China that had passed through the test of time.\nWhen asked about the China Pakistan Economic Corridor (CPEC) bringing a direct investment of over $25 billion along with job creation in the past eight years, he said the project was significant for the economy and development of Pakistan.\nImran Khan said the Chinese investment for connectivity and power generation came at a very crucial time in Pakistan when the country faced economic problems following the war against terrorism.\nHe mentioned that Pakistan suffered immensely while fighting terrorism in the shape of almost 80,000 casualties and over $100 billion loss to the economy.\nAlso, he said, previous tenures of the “two very corrupt governments caused the financial crisis”.\n“China came in at the most difficult time for us, which is also one of the reasons why there is such a love here for the people of China,” he said.\nKhan said CPEC was entering the second stage of investment in industrial zones, information technology and agriculture.\nHe said Pakistan, being an agricultural country needed investment and productivity in agriculture, adding that already Memorandum of Understanding had been signed with China.\nOn areas of future cooperation, he said the emphasis of his government was on geo-economics rather than the earlier geo-strategic concept and thus looked towards China as a role model of development.\nHe said Pakistan’s almost over 20 percent population lived below the poverty line, adding that the Chinese model of poverty alleviation through wealth creation was an inspiration to be followed.\nOn Chinese cooperation during COVID-19, the prime minister said China helped Pakistan soon after the breakout of the virus by providing assistance and vaccines.\n“We learned a lot from China because as the pandemic spread, we immediately had very close contacts,” he said.\nImran Khan wished the people of China a Happy lunar Chinese new year of Tiger, terming it his favourite animal, and extended wishes for peace and prosperity.",
  "retrievedAt": "2025-08-11T14:16:55.324Z"
}
