{
  "title": "Govt. to distribute health cards in Sindh province soon: Senate told",
  "link": "https://www.app.com.pk/national/govt-to-distribute-health-cards-in-sindh-province-soon-senate-told/",
  "date_published": "2022-02-08T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan Tuesday informed the Senate that the Pakistan Tehreek-e-Insaf government would distribute health cards in all the districts of Sindh province soon.\nOn a point of order, he said the government had already distributed health cards among the people in Tharparkar that would not only make life easier for ordinary citizens but also improve the health care system of the country. He said the federal government was also planning to distribute health cards in Hyderabad and Larkana at the earliest.\nHe said the health cards introduced by the government would help people in small towns and villages who mostly visit public hospitals in their respective districts which have already limited resources. He said the entire population in all districts of Punjab would be given health cards.\n“The health cards will be distributed in all districts of Punjab by March 31, 2022.” “We are giving health cards to the people at their doorstep”, adding, “Through Naya Pakistan Qaumi Sehat Card, we are providing top quality medical services to people” He said that the provision of universal health insurance was turning the dream of Prime Minister Imran Khan into reality, adding, “We salute Prime Minister Imran Khan for this great service to humanity and health is their foremost priority”.&nbsp; He said health cards had also been distributed among the people of Khyber Pakhtunkhwa.\nThe minister termed Prime Minister Imran Khan’s visit to China successful and said that it was unfortunate some elements were pursuing the narrative of India on the visit of Imran Khan.  He said that the relationship between Pakistan and China will further strengthen.\nHe said this relationship is higher than the Himalayas and deeper than the seas. He asked these elements to keep Pakistan’s interest supreme and not follow the narrative of India.\nHe said that Prime Minister Imran Khan is also scheduled to undertake a visit to Russia and some other important countries. The minister said that during the recent OIC meeting held in Pakistan, Prime Minister had highlighted the issue of Kashmir and Palestine. Criticizing the opposition parties, he said, that leadership of the opposition parties failed to deliver and address the issue of the public.\nHe said that leadership of opposition parties is in a panic as they believed if Imran Khan completed his tenure the politics of these parties will be finished.\nThe minister said that leadership of the opposition parties is united to save the loot and plunder they made during their governments. He said that all the institutions were running in loss during the PML-N and PPP governments.\nCriticizing Maulana Fazal ur Rehman, he said he had failed to highlight the Kashmir issue, while Shahryar Khan Afridi had effectively rose the Kashmir issue at all the international forums.\n&nbsp;He said Prime Minister Imran Khan had also rose the Islamophobia issue at all the international forums. He said that despite all the criticism against the current government, even the World Bank had acknowledged 5.37 percent economic growth in the country.\nSenator Faisal Javed said that Prime Minister Imran Khan will never give NRO to the opposition.\nHe said that Prime Minister Imran Khan would soon start public meetings.&nbsp;\nHe hoped that the fruits of the effective policies introduced for the welfare of the people would reach the public.",
  "retrievedAt": "2025-08-11T14:16:53.651Z"
}
