{
  "title": "CCECC: Improving people’s well-being with key infrastructure projects in Pakistan",
  "link": "https://www.app.com.pk/national/ccecc-improving-peoples-well-being-with-key-infrastructure-projects-in-pakistan/",
  "date_published": "2022-02-08T12:31:00.000Z",
  "source": "APP",
  "content": "BEIJING, Feb.8 (APP): The China Civil Engineering Construction Corporation (CCECC) in the past seven year has undertaken several key infrastructure projects in Pakistan that have improved the well-being of its people.\nThe company, in a statement, said it signed a contract agreement with WAPDA (Water and Power Development Authority) for the relocation of Karakoram Highway (KKH-01) and the construction of Right Bank Access Road (RAR-01) within the framework of the Dasu Hydropower Project.\nDespite delays caused by security issues, social problems and natural disasters, the company expressed its determination to deliver the RAR-01 during the current month, which would be the first project to be completed within the framework of Dasu Hydropower Project, according to the statement published in China Daily on Tuesday.\nThe CCECC said, “As for KKH-01, the project’s importance cannot be overemphasized as it will be the only road that connects the Sino-Pakistan Friendship Highway within Dasu area after the Dasu Dam is in service.\n“To ensure safe and efficient operation of Sino-Pakistan Friendship Highway and timely delivery of the Dasu Hydropower Project, the CCECC proposed optimization of design by introducing several bridges and tunnels to the original design.\n“We are committed to delivering this critical highway within three years after the new design is approved,” the company said.\nWorking with two local JV partners, it said, it was executing the project of re-construction and up-gradation of Main Runway at Allama Iqbal International Airport in Lahore. “The main runway is designed with the highest civil aviation standard. With 3.35km length, 56cm thickness and Grade 4F PQC, it can accommodate Airbus A380 carriers after completion.\n“As one of the national priority projects launched by the Pakistani Government, the aforesaid project is under direct monitoring of the Office of Prime Minister Imran Khan.\n“Amid the challenges of Covid-19, the Chinese company and Pakistan Civil Aviation Authority (PCAA) have reached PQC casting completion with excellent quality in December 2021. The project team is committed to working day and night to ensure delivery of the project in March 2022.\n“Allama Iqbal International Airport is one of the busiest airports in Pakistan. The airport after upgradation will further expand Pakistan’s external connection window, promote local employment and boost regional development.\n“Apart from transport infrastructures, the company is also committed to building healthcare facilities that will benefit ordinary Pakistani people the most. The Pakistani Government is establishing hospitals and schools in various cities across the country and CCECC is helping realize it.\n“The CCECC-lead JV team in collaboration with the Infrastructure Development Authority of Punjab (IDAP) is establishing mother and child hospitals and nursing schools in Attock and Layyah.\n“On November 6, 2021, Prime Minister Imran Khan hosted the groundbreaking ceremony in Attock. Both projects are currently under construction at full capacity.\n“The CCECC will ensure their timely completion in 2023 so that mothers and children in the region can receive better health care as early as possible.\n“As a renowned international corporation, CCECC not only strives to provide excellent engineering services for different employers in Pakistan, but also focuses on fulfilling its corporate social responsibilities.”\nThe CCECC said it employed mostly local people to run business in Pakistan. The average number of local employees was around 600 every year, with over 3,000 employees at peak construction seasons.\n“The average ratio of Chinese and Pakistani employees is about 1:10 according to different types of work, which creates a lot of employment for the locals. We also hold practical training courses on different projects to help transfer new construction technologies to the locals and improve their working skills,” the company said.\nIt said,”Dasu region in the Khyber Pakhtunkhwa province of Pakistan is known for its steep cliffs with weathered rocks, which leads to rockfalls and mudslides causing loss of many lives every year.”\nSince 2015, the CCECC said, it had always taken the initiatives to mobilize its staff and heavy-duty equipment to assist local government and communities in removing rocks fallen on the Karakoram Highway and rescuing cars plunged into ravines and the Indus river. “Our efforts are much appreciated by the locals, who usually call us ‘rue China brothers’.”\n“021 marks the 70th anniversary of the establishment of diplomatic relations between Pakistan and China. Both governments vowed to further strengthen ties between the two countries.\n“CCECC as a state-own Chinese company, always stands committed to working at its best capacity to improve the well-being of the people of Pakistan and promote Pak-China friendship.\n“We firmly believe that the two brotherly countries will build a shared and prosperous future together,” it concluded.",
  "retrievedAt": "2025-08-11T14:17:05.551Z"
}
