{
  "title": "Strong Pakistan guarantor of Kashmir’s independence from Indian occupation: President AJK",
  "link": "https://www.app.com.pk/national/strong-pakistan-guarantor-of-kashmirs-independence-from-indian-occupation-president-ajk/",
  "date_published": "2022-02-08T09:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):President Azad Jammu and Kashmir Barrister Sultan Mehmood Chaudhry Tuesday said that strong Pakistan from every aspects was the guarantor of Kashmir’s independence from illegal Indian occupation.\n“Pakistan would raise the issue of Kashmir in a full and effective manner at the Organization of Islamic Countries (OIC) Foreign Ministers’ meeting here next month”, he said in an exclusive interview with the national news agency APP.\nHe said”Atrocities on unarmed civilians in Occupied Kashmir is a disgrace on the face of India. Due to the Hindutva, India has been exposed all over the world.\nThey have taken heinous measures aimed at suppressing the ongoing people’s struggle for self-determination in Indian Illegally occupied Jammu and Kashmir and changing the proportion of the Muslim population in occupied valley.”\nThe President of Azad Jammu and Kashmir expressed that India has imprisoned the entire leadership of Hurriyat Conference in the occupied territories and unfortunately great leaders of Kashmir freedom campaign including Syed Ali Gilani and Muhammad Ashraf Sahrai were martyred in custody of Indian forces.\nBarrister Sultan Mehmood Chaudhry said that the Government of Pakistan and Prime Minister Imran Khan had strongly reacted to the Indian government’s August 5 move.  Kashmir issue will be raised at every forum of the world.   He said that Prime Minister Imran Khan had raised the issue of Kashmir during his address to the UN General Assembly and during his visits to foreign countries.\nBarrister Sultan Mehmood Chaudhry said that India has increased oppression and barbarism in occupied Kashmir valley.   The President said that after the decision of the All Parties Conference and consultation with the Kashmiri leaders, a big rally is being organized in the federal capital Islamabad on February 24 to highlight the Kashmir issue at the international level.\nHe said”The rally will be taken out from National Press Club to D-Chowk, Islamabad in which a large number of Kashmiris including leaders of religious and political parties of Azad Jammu and Kashmir besides leaders of Hurriyat Conference will participate.\nThe rally will end at D-Chowk where Kashmiri leaders will address the participants and highlight Kashmir issue, exposing India’s worst state terrorism in occupied Kashmir.\nThe rally will be attended by people from different walks of life.”  Barrister Sultan Mehmood Chaudhry said that after India’s illegal move on August 5, due to the efforts of the Foreign Office, the Kashmir issue was discussed three times in the UN Security Council and the UN Secretary General said that the Security Council  Resolutions are still in effect.\nOn October 26, a briefing on Kashmir was held in the British Parliament in which 45 members of Parliament were present who assured that they would urge the British Prime Minister and Foreign Secretary to use their influence to resolve the Kashmir issue.\nThe President of Azad Jammu and Kashmir said that the Indian government has been working to change the proportion of Muslim population in Occupied Kashmir and has so far issued local domiciles to millions of Hindus.\nAfter the abrogation of Kashmir demographic status,Modi’s regime wanted to appoint a Hindu Chief Minister in the valley.\nHe said that due to Kashmiri migrants, the Kashmir issue is being highlighted at the international level. The All Parties Conference has also decided to hold International Kashmir Conferences in Brussels or London besides Islamabad and Muzaffarabad.\nTo a question, the president said that minorities including Muslims are not safe in India and now there is talk of independence in different provinces, minorities of India are fighting for their rights and Modi is trying to suppress them.\nHe said that Pakistan had raised the issue of Kashmir in OIC meetings and other international forums in the past and it would take up the issue of Kashmir in full at the meeting of Foreign Ministers of Islamic countries in Islamabad in March this year.\nSince the Government of Pakistan has played its role at the international level, it was expected that it would continue to play its role.\nThe president also appreciated the digital campaigns being launched across the globe who played a significant role in highlighting the issue of Kashmir and mobilizing youth.",
  "retrievedAt": "2025-08-11T14:16:54.047Z"
}
