{
  "title": "Steps afoot to promote professional education for socio-economic development: President",
  "link": "https://www.app.com.pk/national/steps-afoot-to-promote-professional-education-for-socio-economic-development-president/",
  "date_published": "2022-02-08T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): President Dr Arif Alvi Tuesday said that steps were being taken to promote professional and skill-based education in the country that would help provide employment to youth as well as put the country on the path to socio-economic development.\nHighlighting the importance of higher education, the president said the government was focusing on educational development and had announced 50,000 scholarships to encourage deserving students to get higher education.\nHe made these remarks while talking to a delegation of Professional Education Foundation (PEF), led by its Chairman Hafeez-ul-Haq that called on him at the Aiwan-e-Sadr.\nTalking to the delegation, the president said that it was his key priority to facilitate and encourage the differently-abled students to continue their studies and empower them financially.\nIn order to support and encourage persons with disabilities, he added that Higher Education Commission had formulated a policy that exempted the students with disabilities from tuition and hostel fees.\nThe president also underlined the need for increasing the virtual component of education which was cost-effective and easily accessible.\nThe chairman PEF briefed the president about the contribution of the Foundation in the promotion of professional education.\nHe informed that PEF offered scholarships and interest-free loans to those brilliant students who had obtained admissions in professional colleges/universities on merit but could not afford to pay their fees.\nHe said that 1700 students had done their graduation with the financial support of PEF.\nThe chairman further informed that the Foundation had paid the education cost of 1900 students in 2020-21 who were studying in the medical, engineering and other professional colleges/universities.\nThe president appreciated the efforts and contribution of PEF which had been doing a splendid job by supporting the deserving students to continue their education.",
  "retrievedAt": "2025-08-11T14:17:08.248Z"
}
