{
  "title": "NA body slams weak emission controls, seeks four-week air quality plan",
  "author": null,
  "content": "ISLAMABAD, Oct 22 (APP):The National Assembly’s Standing Committee on Climate Change and Environmental Coordination has expressed strong concern over country’s outdated vehicle emission standards and lack of enforcement, directing the Ministry of Climate Change to submit a comprehensive air quality improvement plan within four weeks.\n\nChaired by MNA Munaza Hassan, the committee met at Parliament House on Wednesday to review emission testing mechanisms and their role in improving air quality.\n\nDuring the briefing, officials from the Chief Commissioner’s Office informed the committee that Pak-EPA lacks both financial and technical capacity to effectively monitor and control vehicular emissions.\n\nThe committee was told that while the Capital Development Authority (CDA) had financed five new testing units, two of the current devices in use were borrowed from the Punjab EPA.\n\nThe country’s vehicle emission standards, the committee noted, remain stuck at Euro-II levels, far below modern international benchmarks such as Euro-V and Euro-VI.\n\nChairperson Munaza Hassan observed that “there is no mechanism in place to check emissions or enforce compliance,” calling for a time-bound action plan to strengthen monitoring and enforcement.\n\nExperts invited to the session highlighted that targeted interventions could reduce air pollution by up to 30 per cent.\n\nThey proposed measures such as staggered school and office timings, upgrading road infrastructure, promoting catalytic converters for older vehicles, and mandating emission tests during vehicle transfers.\n\nThey also suggested incentivising retrofitting and accelerating the transition to Euro-V compliant fuels.\n\nThe committee further urged the government to allocate greater funding for climate action and ensure that environmental priorities are reflected in in government’s foreign policy and international engagements.\n\nConcluding the meeting, Munaza Hassan said: “We should at least try to make Islamabad a model city,” underscoring the need for stronger coordination among government agencies to address deteriorating air quality.\n\nThe meeting was attended by MNAs Tahira Aurangzeb, Shaista Khan, Shaista Pervaiz, Syeda Shehla Raza, Mussarat Rafique Mahesar, Dr Shazia Sobia Aslam Soomro, Tamkeen Niazi, and Shahida Rahmani, along with experts Dr Faheem Khokhar and Dr Aazir Khan.\n\nOfficials from the Ministry of Climate Change, the Islamabad Capital Territory (ICT) Administration, and the Pakistan Environmental Protection Agency (Pak-EPA), alongside climate experts were in attendance.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/499929910_1107963231374156_2928732568346272046_n.jpg",
  "retrievedAt": "2025-10-23T00:16:51.497Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-body-slams-weak-emission-controls-seeks-four-week-air-quality-plan/",
  "dateList": "2025-10-23",
  "date_published": "2025-10-22T17:44:00.000Z"
}
