{
  "title": "Senate Chairman Gillani issues production order for Senator Ejaz Chaudhry - Pakistan - DAWN.COM",
  "author": null,
  "content": "Senate Chairman Yousaf Raza Gillani on Monday issued a production order for PTI Senator Ejaz Chaudhry, who has been incarcerated for 18 months, so that he can attend the Senate session tomorrow.\n\nThis is not the first production order issued for the senator, who is imprisoned at Lahore’s Kot Lakhpat Jail. In March last year, he was due to be produced in the Senate, but was unable to attend the session.\n\nIn November, Chaudhry was among 21 other PTI figures formally indicted by a Lahore Anti-Terrorism Court (ATC) in cases related to the countrywide riots on May 9, 2023, registered at the Racecourse and Sarwar Road police stations.\n\nChaudhry said that despite being a member of the Senate, he was not allowed to attend sessions parliamentary sessions. “No hardship has been able to break us and nor will it. The state oppression will end,” he added.\n\nAccording to the production order — a copy of which is available with Dawn.com — the request to produce Chaudhry was made by Opposition Leader in the Senate Shibli Faraz.\n\n“The Honourable Chairman Senate considers necessary the presence of Senator Ejaz Ahmad Chaudhry during the sittings of the 345th session of the Senate of Pakistan,” the order read.\n\n“The Honourable Chairman Senate has been pleased to summon Senator Ejaz Ahmad Chaudhary to attend the sittings of the said session at the Parliament House.”\n\nThe order, addressed to the secretary of the interior minister among others, directed them to “produce Senator Ejaz Ahmad Chaudhary at the commencement of each sitting of the said session”, stating that Chaudhry would be returned to their custody upon the conclusion of the sitting.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:39:01.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884929/senate-chairman-gillani-issues-production-order-for-senator-ejaz-chaudhry",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T11:47:49.000Z"
}
