{
  "title": "Verdict in Imran, Bushra’s £190m Al-Qadir Trust case postponed for 3rd time - Pakistan - DAWN.COM",
  "author": null,
  "content": "The verdict in the £190m Al-Qadir Trust case against former premier Imran Khan and his spouse Bushra Bibi — expected to be announced today (Monday) — has been postponed for the third time.\n\nJudge Nasir Javed Rana cited the reason for the delay as Imran and Bushra’s failure to appear before his accountability court at the Adiala Jail. The decision — already postponed twice on Dec 23, 2024 and Jan 6, 2025 — will now be announced on January 17 (Friday).\n\nThe couple was indicted in the case on Feb 27, 2024, shortly after the general elections.\n\nThe case alleges that Imran and Bushra Bibi obtained billions of rupees and land worth hundreds of kanals from Bahria Town Ltd for legalising Rs50 billion that was identified and returned to the country by the United Kingdom during the previous PTI government.\n\nThe judge was expected to deliver the verdict in a makeshift courtroom at Adiala Jail, where hearings of the case have continued over the past year.\n\n“Bushra Bibi had knowledge of the verdict being announced but she did not appear before the court,” Judge Rana said. “The PTI founder was sent a message twice but he also did not appear in court yet.”\n\nThe judge also said he was present in the court since 8:30am but “neither the suspects nor their lawyers appeared”. “The decision — fully ready and signed — is present with me today,” he asserted.\n\n“The suspects were also given numerous chances during the trial,” Judge Rana added. According to the court, Imran told jail officials that he would not appear in court until his lawyers and family members arrived there.\n\nAccording to a Dawn.com correspondent present at Adiala, the verdict was set to be announced at 11am. However, its adjournment was confirmed at around 10:30am.\n\nThe correspondent added that Bushra arrived at Adiala Jail shortly after 11am but did not enter the jail and departed from there after finding out about the postponement.\n\nAhead of the hearing today, Imran’s sisters Aleema, Noreen and Uzma Khan reached Adiala to attend the proceedings. PTI Secretary General Barrister Salman Akram Raja was also present.\n\nFrom the National Accou­n­t­a­bility Bureau (NAB), prosecutor general Sardar Muzaffar Abbasi, prosecutor Chaudhry Nazar and members of the bureau’s legal team — namely Irfan Ahmed, Sohail Arif, and Owais Arshad — had reached the jail.\n\nSecurity was on high alert at Gate 5 of Adiala Jail, with additional police contingents deployed outside its premises. Troops of the Elite Force, along with policewomen, were also stationed.\n\nOn December 23 — the original date the verdict was supposed to be announced — an Islamabad accountability court postponed its verdict in the case until Jan 6 due to winter vacations.\n\nThen, on January 6, the decision could not be pronounced as Judge Rana was on leave.\n\nReacting to the development, PTI Chairman Gohar Ali Khan asserted that the postponement was “not the outcome of any deal”.\n\n“Attempts are being made to give the impression that a deal is being done. There is no deal.\n\n“The trial court’s attitude towards us (PTI) has been unjust,” Gohar, flanked by Raja, told reporters outside Adiala.\n\nThe PTI chairman said that before they entered the Adiala jail for the verdict today, the judge had already decided to postpone the hearing until January 17.\n\nRaja, referring to the ongoing talks between the PTI and the government to cool political temperatures, clarified that while they were continuing, it was incorrect if anyone wanted to imply that the decision was delayed because of those.\n\n“We will not enter into any deal,” the PTI leader asserted.\n\nGohar stated, “Imran has said that the Al-Qadir Trust case decision should be announced. We can see it written on the walls that we have been repeatedly wronged.\n\n“We were ready for the verdict to come out today,” he said, adding that the judge delayed the decision at his own discretion. The PTI chairman reiterated that Bushra was accused in the case to “pressure Imran”.\n\nMeanwhile, Imran’s sister Aleema claimed the verdict was to be announced at 10:30am, adding that she reached there on time.\n\n“Some were told that the decision would be announced at 11am,” she said while speaking to reporters outside Adiala.\n\nAleema added that Imran had been waiting for the verdict in the case for about a month as he wanted to appeal the case in a high court. “I think the government is under a lot of pressure because the entire world is watching,” she said.\n\nPML-N Senator Irfan Siddiqui stated that talks between the government and the PTI and judicial matters were two separate domains, calling for them to not be mixed, the Associated Press of Pakistan reported.\n\nSpeaking to Geo News today before the verdict was postponed, Siddiqui said that the judiciary operates independently within its jurisdiction and the government has nothing to do with the cases against Imran.\n\nThe PML-N leader asserted that the government has no involvement in cases like the £190m case or others, but judicial decisions could still influence the dialogue process.\n\n“If the decision goes against PTI, it will inevitably impact the mood and sentiments of PTI members, particularly the negotiation committee, and could affect their spirit regarding the dialogue,” he said.\n\nResponding to a question about the verdict in the Al-Qadir Trust case, the spokesperson for the government’s dialogue committee stressed that it had no connection to the dialogue process and that the government was not using it to exert pressure.\n\nSiddiqui further explained that the purpose of seeking PTI’s demands in writing was to assess their nature thoroughly, as verbal and written demands could lead the process in different directions.\n\nA day ago, senior PTI leader Asad Qaiser had claimed that the verdict was “pre-determined and is also in the knowledge of the government”, calling it a “murder of justice”.\n\nSpeaking to DawnNews programme “Doosra Rukh”, he had termed the case “an action of political vendetta”.\n\nPTI central information secretary Sheikh Waqqas Akram had termed the matter a “clear case of acquittal” as the prosecution couldn’t prove any wrongdoing against the duo.\n\nAkram said that Al-Qadir Trust was a university, which was providing education to the students. The land transferred to Al-Qadir Trust was not private property of Imran, his wife or any other one, rather the entire land was registered in the name of the trust, he said.\n\nHe said that the PTI had not attached any expectation to “Washington and Trump administration” for the ex-premier’s release.\n\nMeanwhile, Defence Minister Khawaja Asif had hoped that “justice will prevail”. Speaking to reporters in Sialkot, he had maintained that the US had not asked the Pakistan government to give relief to Imran, or anyone else.\n\nIn December 2023, the National Accou­n­t­a­bility Bureau (NAB) had filed a corruption reference against Imran and seven others, including his wife, in connection with the Al-Qadir University Trust.\n\nThe reference filed by NAB alleged that Imran, who is currently in jail, played a “pivotal role in the illicit transfer of funds meant for the state of Pakistan into an account designated for the payment of land by Bahria Town, Karachi”. It also claimed that despite being given multiple opportunities to justify and provide information, the accused deliberately, with mala fide intention, refused to give information on one pretext or another.\n\nProperty tycoon Malik Riaz Hussain and his son Ahmed Ali Riaz, Mirza Shehzad Akbar, and Zulfi Buk­hari are also among the suspects in this reference, but instead of joining the investigation and subsequent court proceedings, they absconded and were subsequently dec­lared proclaimed offenders (PO).\n\nFarhat Shahzadi, a close friend of Imran’s spouse, and Ziaul Mustafa Nasim, a legal expert for the PTI government’s Assets Recovery Unit, were also declared POs. Subsequently, the properties of all six accused had been frozen.\n\nAs per the reference, Riaz’s son transferred 240 kanals of land to Shahzadi, while Bukhari received land under a trust, which NAB argued did not exist at the time of the transfer.\n\nThe prosecution further alleged that a trust was created only after the adjustment of £190m, raising doubts about its legitimacy and purpose.\n\nIn July 2024, Pervez Khattak, a key PTI leader back then who parted ways with the party in 2023 following the May 9 riots, testified before a court that he was a participant in the December 2019 meeting, where then-accountability adviser Mirza Shahzad Akbar produced a confidential deed in a sealed envelope for cabinet approval.\n\nHe said when he inquired about the document, Akbar said that it was an agreement of the Pakistani government with UK’s National Crime Agency for the refund of crime proceeds.\n\nDays later, Azam Khan, Imran’s then-principal secretary, also testified that Akbar brought a note to seek the ex-PM’s appro­val to present the confidential deed in the cabinet meeting.\n\nZubaida Jalal, the minister of defence production in the PTI-led government, testified before a court that ministers were “kept in the dark” on the transfer of “crime proceeds” to Malik Riaz.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:39:06.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884897/verdict-in-imran-bushras-ps190m-al-qadir-trust-case-postponed-for-3rd-time",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T05:42:13.000Z"
}
