{
  "title": "CORPORATE WINDOW: Pakistan’s e-commerce at crossroads - Newspaper - DAWN.COM",
  "author": null,
  "content": "In recent years, Pakistan’s e-commerce industry has emerged as a beacon of opportunity. Fuelled by growing internet penetration and a predominantly young, tech-savvy population, the sector generated $5.2 billion in revenue in 2023. The new 2024 Pakistan E-commerce Industry Report predicts this figure will rise to $6.7 billion by 2029, with a compound annual growth rate of 5.92 per cent.\n\nYet, despite these promising numbers, Pakistan’s e-commerce landscape remains in its infancy, particularly when compared to its regional counterparts. To truly harness its potential, the country must address systemic challenges and establish a regulatory framework that ensures fair competition while fostering innovation and inclusivity.\n\nE-commerce has democratised business opportunities in Pakistan. Platforms enable individuals to start businesses with little to no upfront capital. This is particularly transformative for remote areas where traditional retail infrastructure is lacking.\n\nLocal artisans and small manufacturers now have year-round access to nationwide markets, significantly boosting their income. Women, too, have emerged as secondary contributors to household incomes, while students leverage these platforms to earn supplemental income amid soaring inflation.\n\nE-commerce could be an over $6bn industry by 2029 if the government decided to set protective policies in place to ensure a level playing field for businesses\n\nFurthermore, e-commerce has catalysed ancillary industries. Increased demand for local goods has stimulated manufacturing, while logistics companies have expanded to meet the needs of online retailers. The result? Job creation across the value chain, from delivery personnel to warehouse workers, underscoring the sector’s role in economic activity.\n\nFrom the consumer’s perspective, e-commerce has been a boon. With millions of products available at their fingertips, buyers enjoy the convenience of exploring options, comparing prices, and maximising savings. However, this convenience often comes at a hidden cost to the broader ecosystem.\n\nThe entry of certain e-commerce giants operating from overseas presents challenges to the sustainability of local businesses. Platforms like Temu, while appealing to consumers with economical prices, often rely on unfair competitive strategies, such as predatory pricing or leveraging global scale to undercut local sellers.\n\nThese practices risk creating an uneven playing field, making it difficult for local players who have invested heavily in infrastructure and logistics to compete. Additionally, their return policies, hindered by the lack of on-ground operations, can lead to delays and logistical issues, potentially impacting consumer trust — a key driver of e-commerce growth.\n\nPakistan’s e-commerce policy, last updated in 2019, was a commendable first step. It aimed to simplify taxation, improve logistics, and support local entrepreneurs. However, the industry has evolved rapidly since then, especially after Covid-19, and the policy framework has failed to keep pace. Regulatory gaps allow certain players to operate unchecked. Without updated policies, the potential for long-term harm to consumers and the economy looms large.\n\nIt is important to prioritise a level playing field that protects the interests of local businesses and consumers alike. Drawing inspiration from regional successes can provide a roadmap. Initiatives like Malaysia’s ‘Shop Malaysia Online’ campaign and Indonesia’s ‘Proud of Indonesian Products’ movement have effectively widened the reach of micro, small, and medium enterprises (MSMEs). India’s partnership with Amazon to enhance export capacity underscores the importance of leveraging global platforms to boost local industries.\n\nFor Pakistan to unlock its e-commerce potential, a multi-faceted approach is essential. It is important to update the e-commerce policy to reflect current market realities. This includes stricter regulations to curb anti-competitive practices and ensure that international players contribute positively to the local economy. Incentives for local sellers, such as tax relief and capacity-building programs, should also be prioritised.\n\nA robust digital payment infrastructure is the backbone of e-commerce. Addressing consumer concerns about fraud and security will increase trust and drive higher adoption rates. Currently, only 18pc of Pakistanis have ever made online purchases according to a report by the Pakistan Software Export Board, highlighting a significant untapped market.\n\nLocal sellers and small businesses should be supported through targeted initiatives. For example, government-backed programs could help MSMEs digitise their operations and expand their reach, as seen in Malaysia and Singapore. These efforts would not only strengthen the domestic market but also position Pakistani businesses for export opportunities.\n\nCompetition is vital for innovation and consumer choice. However, unchecked dominance by a few players risks monopolising the market. Regulatory mechanisms should ensure fair competition, particularly for platforms that have faced backlash internationally for anti-competitive practices.\n\nFor instance, Indonesia recently ordered the removal of Temu from app stores, citing the need to protect small and medium-sized merchants. Similarly, Vietnam suspended the operations of Temu and fast-fashion retail Shein for failing to meet government registration deadlines, a move aimed at curbing deep discounting practices.\n\nThe future of e-commerce in Pakistan lies in fostering an ecosystem that benefits all stakeholders. This means prioritising local sellers, investing in digital infrastructure, and creating policies that balance consumer benefits with long-term economic sustainability. With thoughtful intervention, e-commerce can become a cornerstone of Pakistan’s economy, driving job creation.\n\nThe writer is a fellow of the Chartered Institute of Management Accountants and treasurer of the ICMA, Pakistan\n\nPublished in Dawn, The Business and Finance Weekly, January 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6783ea3cac18d.gif",
  "retrievedAt": "2025-08-26T07:39:04.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884748",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T01:18:36.000Z"
}
