{
  "title": "Return of the fossil fuels - Business - DAWN.COM",
  "author": null,
  "content": "The reality is grim. Green energy is in retreat. The battle against climate change, which has put the oil and gas industry on the defensive for some time now, is weakening. The changing political map of the world, taking a right tilt all around — from the Americas to Europe — is helping industries wriggle out of the situation.\n\nThe changing political map has pushed the climate battle on a back burner, making net-zero targets a more difficult task to achieve in most parts of the world. China is among the few bright stars still shining on the green initiative horizon.\n\nThe re-entry of President-elect Donald Trump into the White House on Jan 20 will be a big boon to the fossil fuel industry. During the campaign, Mr Trump has explicitly said he would pull the US out of the Paris Climate Accord — the global treaty on climate change — as he did during his first tenure.\n\nTrump allies have also suggested exiting the United Nations Framework Convention on Climate Change. The incoming administration may also end US collaboration on key international initiatives, such as those addressing deforestation.\n\nCountries in the Global North veer away from climate action towards fossil fuels as major political shifts take place\n\nFurthermore, the people entrusted with the energy portfolio in Trump’s incoming administration are well-established protagonists of fossil fuels. In contrast to the climate-focused Biden administration, Mr Trump’s cabinet picks are known to be downplaying the dangers of climate change. They are poised to roll back regulations that favour electric vehicles and fuel-efficient hybrids and approve Gulf Coast projects to liquefy and ship natural gas abroad, reported Ella Nilsen of CNN.\n\nNorth Dakota Governor Doug Burgum, the new energy czar of the incoming administration and Mr Trump’s pick for Interior Secretary, and Chris Wright, a Colorado-based natural gas fracking CEO and the new Energy Secretary, are staunch fossil fuel advocates.\n\nHowever, complicating the overall picture will be Elon Musk, Tesla CEO and one of Trump’s closest advisors, despite the president-elect’s apparent disdain for electric vehicles. How his presence will impact the energy policy of the incoming administration remains a mystery.\n\nThough Mr Wright acknowledges that the planet is warming, he has inaccurately said it is a modest and distant threat. Scientists have questioned this conclusion, saying that he has denied the well-established connection between climate change and extreme weather, besides wrongly claiming that hurricanes, droughts, and floods are not becoming more intense.\n\nDespite Mr Trump’s love for fossil fuels, the fast-changing global energy landscape will present a real challenge to his energy policy. The incoming administration will be needed to meet the rising electricity demand — as artificial intelligence, data centres, and energy manufacturing facilities come online.\n\nThis means that energy from all sources — besides fossil fuel — will be needed to meet the growing demand. Incentives for other energy resources thus cannot be completely off the table. Pakistan also needs to be aware of the rise in electricity demand if it wants to follow global trends.\n\nAlthough energy from other sources besides fossil fuels may help lower the US deviation from its current emission targets, it would still be significant.\n\nAn analytical piece by the website Carbon Brief done before Joe Biden dropped out of the presidential race said that a second Trump presidency means four billion metric tonnes of carbon dioxide emissions could be added to the atmosphere by 2030 over what could have been expected from a second Biden term. It projected emissions under Trump dropping by 28 per cent below the peak. That’s far short of the 50pc target that Biden had set at the beginning of his term.\n\nThe bias against the green revolution is not limited to the US. In next-door Canada, Prime Minister Justin Trudeau has bowed out of the Liberals’ leadership, and the federal elections are expected soon. Most analysts agree that the conservative leader Pierre Poilievre could well be the next prime minister of Canada. And the induction of a Poilievre-led conservative government would mean a reversal of the ‘climate-friendly’ policies of the outgoing government.\n\nCarbon tax, introduced by the Trudeau government, could be an issue under the hammer in the upcoming elections. Under the carbon tax regime, the government has been setting a price that emitters are required to pay for each tonne of greenhouse gas emissions.\n\nMr Poilievre completely disapproves and is committed to axing the carbon tax. There is also a possibility that Ottawa, under a conservative government, will back off from the net-zero targets that the Trudeau government has set.\n\nNorway, a leader in renewable energy, is also doubling down on exploiting its fossil fuel resources. With elections approaching and the far-right Progress Party emerging as the largest in opinion polls, Norway continues to invest heavily in oil and gas production, raising concerns about its climate commitments.\n\nIn the United Kingdom, BP — once committed to increasing its renewable energy capacity 20-fold to 50GW — recently spun off its offshore wind projects into a joint venture with Japan’s JERA. Similarly, Shell has stopped investing in new wind energy projects. These moves, highlighted in a Dec 27 editorial of Oilprice.com, illustrate how major oil companies are stepping back from renewable energy commitments.\n\nIn 2024, oil majors maintained their focus on shareholder returns, and their higher borrowing in 2024-2025 dictates that they cut low-margin liabilities to benefit the high-yield oil and gas projects.\n\nPakistan is one of the hardest-hit countries facing the impact of climate change. The changing weather trends, extraordinary monsoon rainfall, rapid melting of glaciers, and glacier lake outburst floods are all manifestations of the problems faced by Pakistan.\n\nGlobal warming is largely to be blamed for this. If it is not controlled, South Asia and especially Pakistan will be faced with disaster after disaster. The new leaders on the world stage are shying away from this stark reality. This is a recipe for disaster for all.\n\nPublished in Dawn, The Business and Finance Weekly, January 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:49:18.591Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884742/return-of-the-fossil-fuels",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T01:18:37.000Z"
}
