{
  "title": "Govt deploys intel officers to combat power theft in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Almost six months after the federal cabinet’s decision, the government has begun inducting officers from intelligence, investigation and law enforcement agencies into Sindh’s ever-bleeding power distribution companies (Discos) to curb power theft, improve recoveries and enhance operational efficiency.\n\nIn a notification issued on the weekend, the power division constituted a Disco Support Unit (DSU) for Sukkur Electric Power Company (Sepco) — the first such initiative in Sindh — after prolonged political and bureaucratic resistance. The unit would remain in place for two years.\n\nThe notification said that Sepco’s CEO and Sector Commander of civil armed forces would be the director and co-director of the DSU, respectively. Grade 18 and 19 officers from the Federal Investigation Agency, Military Inte­lligence and Inter-Services Intelligence and Grade 18 nominees of commissioner and deputy inspector general (DIG) would be members of the DSU.\n\nIn addition, the DSUs have been empowered to co-opt administrative and police officers in Grade 18 from each division or ranges in the Sukkur service jurisdiction with clearance from relevant commissioners or DIGs.\n\nThe federal cabinet approved the creation of DSUs in all the Discos in July last year, starting with Multan and Sukkur, and then gradually moving to other electricity companies to assist the power division in its campaign against power theft and poor recoveries.\n\nA senior government official told Dawn that DSU in Multan was activated almost a month after the cabinet decision but could not be operationalised for Sukkur due to multiple challenges.\n\nHe said the experience in DSU Multan was generally encouraging, notwithstanding some complaints. The model was thus replicated one after the other in Lahore and Quetta electric supply companies as well.\n\n“After a lot of background engagements, we have been able to secure support for the creation of a DSU in Sepco as well,” the official said.\n\nThe DSU Sukkur has been assigned five major targets. These include expediting recoveries and anti-power theft plans, reduction of non-technical losses through administrative interventions, supporting improvement and implementing technical solutions, addressing administrative shortfalls by establishing an interface with law enforcement agencies and civil administration and recommending laying off underperforming officials and officers on intelligence-based evidence. The DSU would report directly to the federal power secretary.\n\nIronically, the National Electric Power Regulatory Authority (Nepra), in its latest State of Industry Report released last week, pointed out that despite tariff increases and theft control efforts, the amount of power companies’ receivables had gone past Rs2.3 trillion last fiscal year. It said the actual defaulted amounts crossed Rs900bn and the power sector circular debt surged to almost Rs2.4tr by the end of June 2024.\n\n“The distribution and supply segments have also not shown any improvement over the last year; rather, there has been a noticeable decline in electricity sales growth during FY2023-24. Higher-than-allowed T&D (transmission and distribution) losses and less recovery ratio by Discos have worsened the circular debt crisis,” Nepra’s report said.\n\nOn the other hand, Power Minister Awais Leghari said last week that the governance reforms in the power sector were paying dividends.\n\nHe said boards of eight out of 10 Discos were changed with no political interference, which resulted in their losses going down to Rs170bn in July-November against Rs223bn a year ago. “Had the remaining two boards changed, the loss would have gone further down to Rs140bn as these two companies actually added Rs30bn more than last year,” he said.\n\nThe power division told the federal cabinet in July last year that efficient management in Discos had always been a challenge, and various models experimented with in the past for bringing improvement did not entail any worthwhile results, leading to ever-rising circular debt and receivables, making the power sector unsustainable.\n\nThe DSUs were thus proposed to address rampant mismanagement that had become a constant source of bleeding for the national exchequer. The members of the DSU, besides their own emoluments, are also offered a certain percentage of recoveries and loss reduction as a reward.\n\nPublished in Dawn, January 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:49:03.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884769/govt-deploys-intel-officers-to-combat-power-theft-in-sindh",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T01:18:16.000Z"
}
