{
  "title": "Demolition of bunkers underway in Kurram as peace deal implementation begins: Barrister Saif - Pakistan - DAWN.COM",
  "author": null,
  "content": "Adviser to the Khyber Pakhtunkhwa Chief Minister on Information Barrister Mohammad Ali Saif said on Monday that under the peace agreement, the demolition of bunkers has begun in Kurram district.\n\nOn Sunday, the Kurram district commissioner said that the process of demolishing bunkers in Lower Kurram was scheduled to begin.\n\nOn December 20, the Khyber Pakhtunkhwa apex committee decided to dismantle all bunkers in the Kurram District in a bid to restore peace in the area, where weeks-long deadly tribal clashes resulted in a law and order situation.\n\nDecades-old land disputes claimed over 130 lives since November, with road blockades causing food and medicine shortages. A peace agreement was signed on January 1, but the route connecting Parachinar remained blocked. On January 4, a government convoy was attacked near Bagan, injuring Kurram’s deputy commissioner and leaving the convoy stranded.\n\n“After the peace agreement on the instructions of KP Chief Minister Ali Amin Gandapur, the demolition of bunkers has begun in the Kurram district,” Barrister Saif said in a statement from his office today.\n\nHe added that two bunkers had been demolished by security forces “under the supervision of the grand peace jirga and local peace committees”.\n\n“Jannat Khan Morcha (Khar Kalay) and Jalandhar Morcha (Balish Khel) were demolished today,” Barrister Saif specified.\n\nBarrister Said added that Kohat Commissioner Moatasim Ballah had “taken the local population into confidence to demolish the bunkers. “In light of the apex committee’s decision and the peace agreement, the bunkers will be demolished,” he said.\n\n“Destroying the bunkers is essential to achieve peace in the area,” Saif added.\n\nMeanwhile, an additional 12 trucks carrying relief goods reached Kurram district on Saturday from Thall, Assistant Commissioner Mannan Khan said. Seven trucks had reached Tari Mangal, four had reached Boshra, and one had reached Ghozgarhy.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:39:00.511Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884946/demolition-of-bunkers-underway-in-kurram-as-peace-deal-implementation-begins-barrister-saif",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T16:44:28.000Z"
}
