{
  "title": "Have tensions with Pakistan pushed Kabul closer to India? - Pakistan - DAWN.COM",
  "author": null,
  "content": "WHEN India pulled out its diplomats from Afghanistan in 2021, very few pundits would’ve wagered that ties between the two nations could ever be re-established as long as the Taliban held sway in Kabul.\n\nNew Delhi’s relations with the Afghan Taliban have been adversarial since the 1990s, mainly due to the latter’s closeness to Pakistan, at the time.\n\nDuring the first Taliban regime, from 1996 to 2001, India actually sheltered and supported the Northern Alliance of Mohammad Najibullah and Ahmad Shah Massoud in their efforts to oust the Taliban from power.\n\nThen, under the Nato presence in Afghanistan from 2001 to 2021, New Delhi doubled down on its anti-Taliban policies, making the gap between the two capitals seem unbridgeable.\n\nThroughout these decades, it continued to label the Afghan Taliban ‘terrorists’, denying their political credentials and even opposing any notion of peace talks, even as the US was trying to engage them in Doha, ahead of its botched withdrawal.\n\nIn recent months, people-to-people relations and trade & transit between Pakistan and Afghanistan have been squeezed. This has generated resentment in the hearts of the Taliban regime, which is now looking for other players to help reduce their economic reliance on Pakistan\n\nFollowing the Doha deal of 2020, many analysts were of the view that India had painted itself into a corner; its position had become untenable, and, when it came to Afghanistan, it had lost relevance for some time to come.\n\nJust before the Taliban takeover, India was among the countries whose diplomats abandoned their missions and unceremoniously evacuated from Kabul airport. Though it restored certain lower diplomatic echelons in 2022 and subsequently provided some humanitarian assistance, it was still difficult to imagine India and the ‘Islamic Emirate 2.0’ moving closer to each other.\n\nThere was too large an ideological divide, too bitter a past — not to mention the whole of Pakistani territory — standing between them.\n\nFast-forward a few years, and things seem altogether different. Today, Islamabad finds itself in a tricky situation, with the prospect of being potentially sandwiched between two hostile neighbours looking ever more tangible.\n\nMisri-Muttaqi meeting\n\nLast week’s meeting between Indian Foreign Secretary Vikram Misri and Afghanistan’s Interim Foreign Minister Amir Khan Muttaqi was a major development, signalling India’s willingness to capitalise on the opportunity offered by Pakistan’s off-handish treatment of its Western neighbour.\n\nEarlier, it was JP Singh, a joint secretary of the Pakistan-Afghanistan-Iran division at India’s external affairs ministry, who met Afghan acting defence minister Mullah Mohammad Yaqoob — the son of Taliban founder Mullah Omar — for the first time in Kabul, on Nov 6.\n\n“The recent meeting … is a notable development in view of the future implications for the regional scene. In my view, Pakistan should not be swayed by Afghanistan-India contacts as this is the sovereign right of [both] countries to have the relations of their choice,” Mansoor Ahmad Khan, Pakistan’s former ambassador to Afghanistan, told Dawn.\n\n“For Pakistan, it is important to work out its relations with Afghanistan based on the natural positive leverages the two neighbours and their peoples have with each other,” he said.\n\nThis, it seems, is easier said than done.\n\nDespite its misgivings with the regime in Kabul, and the waning of its once-famous ‘rapport’ with the group — given that a number of senior Taliban figures are closely linked to religious seminaries in Khyber Pakhtunkhwa — Pakistan has continued to press for continued engagement with the regime in Kabul following the events of August 15, 2021.\n\nDuring his tenure as foreign minister, Bilawal Bhutto-Zardari had continuously argued against isolating the Afghan Taliban. As recently as Sept last year, Pakistan’s UN envoy Munir Akram told the UN General Assembly that regardless the mistakes made by the Kabul regime, Afghanistan’s internal and external problems could be solved only through engagement and joint measures.\n\nBut at the same time, events unfolding along the Durand Line seemed to drown out these saner voices. Showdowns between border security personnel and attempted incursions that were repulsed by Pakistani security forces, were not uncommon.\n\nIn one particularly sharp disagreement over travel document requirements, the Torkham and Chaman crossings remained shut for several days, causing great discontent on both sides. Most of Afghanistan’s land trade — as well as its port access — comes through Pakistan, so any closures are bound hurt Kabul, economically.\n\nThen there is the thorny issue of repatriation: nearly half a million ‘unregistered’ Afghan refugees were forced to return to their country — whether they liked it or not — by Nov 2023. A second round of repatriation is set to begin soon, which may target up to a million more people.\n\nHowever, the Kabul regime is not happy with this influx of more mouths to feed, struggling as it is to make ends meet for the existing populace.\n\nThe final straw, as it were, came in the form of overtly hostile language emanating from Islamabad, and cross-border strikes.\n\nIn the past three years, Pakistan has twice carried out air strikes against supposed hideouts of the outlawed Tehreek-i-Taliban Pakistan (TTP) on Afghan soil. It has also been sticking to the mantra that the Afghan leadership needs to rein in these elements and not allow them to use Afghan territory as a launching pad for actions against Pakistan.\n\nThe latest round of strikes — though not officially acknowledged as such by the Pakistan military or Foreign Office — came on the same day as Pakistan’s Special Representative Mohammad Sadiq was holding talks with senior Afghan officials, such as the deputy prime minister, to find ways to improve relations.\n\nAlthough there were conflicting reports on the targets — Pakistani sources insisted they were TTP militants, Afghan officials claimed them to be “refugees from Waziristan” — the net effect was not a positive one for the fresh efforts towards reconciliation.\n\nMiscalculations and misgivings\n\nWhile it would be speculative to say that such ‘miscalculations’ left the door ajar for India to elbow its way into the equation, they definitely didn’t help Pakistan’s cause.\n\nIn recent months, Pakistan and Afghanistan have had very little formal state-to-state engagement, and there is a dearth of credible channels of communication to talk about sensitive issues, such as cross-border militancy by TTP and the Baloch separatist groups who are increasing their footprint, presumably with the support of safe havens across the border.\n\nAs a result, people-to-people relations and trade and transit has been squeezed. This has generated a deep resentment towards Islamabad in the hearts of the Taliban regime, which is actively looking for other players to help reduce its economic reliance on Pakistan.\n\nThis is where India may try to get its foot in the door, and attempt to regain the space it previously lost in Afghanistan by deepening its strategic footprint through economic assistance, reconstruction and development projects, and relief work.\n\nIn this garb, India will not surely spare any investment against Pakistan, even if it involves support for TTP and BLA militants.\n\nIn addition, India’s strategic partnership with the US and its opposition to China means that it will only be too happy to counter Bejing’s regional connectivity efforts, such as the Belt and Road Initiative, as well as the China-Pakistan Economic Corridor (CPEC).\n\nBy asserting itself in Kabul, it could be dreaming of displacing Pakistan as the dominant partner in Afghan transit and connectivity projects, while also threatening the potential for CPEC’s extension to Afghanistan and onward connectivity with Central Asia.\n\nFor former ambassador Mansoor Ahmad Khan, the Misri-Muttaqi meeting in Dubai isn’t that alarming. He says it would be a bigger worry for him if relations between Pakistan and Afghanistan continue to remain strained, despite the shared bonds between the two countries.\n\nThese tensions, he says, have escalated due to economic actions, including border closures, trade restrictions, and airstrikes on Afghan territory. These have strained ties without prioritising trust-building mechanisms or exploring diplomatic avenues rooted in dialogue and comprehensive policy reassessment.\n\nAccording to Professor Ubaidullah Burhani, a California-based Afghan analyst, the relationship between Afghanistan and Pakistan is among the most intricate in South Asia, characterized by a blend of cooperation and tension driven by interconnected geographical, historical, and political factors.\n\n“Pakistan has played a pivotal role in Afghan affairs, aiming to secure its strategic interests through support for the Taliban to ensure a friendly government, counterbalance Indian influence, and protect its borders. However, policies such as supporting internal factions and direct interference in Afghan affairs have undermined mutual trust and deepened political divides,” he told Dawn.\n\n“In response, Afghanistan has sought to strengthen ties with other countries, notably India and Iran, to advance its security and economic objectives,” he further said.\n\nIn his view, India was leveraging this dynamic to expand its regional influence and counter Pakistan’s position, and that these developments only served to underscore the critical role of Pak-Afghan relations in shaping the stability of South Asia as a whole.\n\nPublished in Dawn, January 13th, 2025\n\nHeader image: India’s Foreign Secretary Vikram Misri meeting acting Taliban Foreign Minister Amir Khan Muttaqi in Dubai on Jan 8, 2025. — X/@HafizZiaAhmad",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/13121441c7eaa51.jpg",
  "retrievedAt": "2025-10-12T00:49:46.499Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884774/have-tensions-with-pakistan-pushed-kabul-closer-to-india",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T01:18:29.000Z"
}
