{
  "title": "Cyprus orders probe into Pakistani man’s murder - World - DAWN.COM",
  "author": null,
  "content": "NICOSIA: Cyprus’ chief prosecutor appointed an independent investigator on Sunday to oversee a criminal probe into the killing of a Pakistani man in police shooting.\n\nPakistan’s Foreign Office told Dawn that the ambassador to Cyprus, based in Beirut, was in touch with Cypriot officials over the matter.\n\nThe move comes a day after authorities said the Pakistani national was fatally shot with a police service weapon.\n\nThe announcement by Attorney General George L. Savvides about the independent investigator’s appointment followed a post-mortem exam that contradicted an initial forensic analysis. He said the decision followed a briefing by the police chief regarding the ongoing inquiry into the incident. He said he had appointed an independent “criminal investigator in relation to the circumstances of the death of a young man from Pakistan”.\n\n“Senior counsel of the Republic, Ninos Kekkos, will lead the investigations being conducted by the police.”\n\nAccording to the autopsy, a bullet wound was found on the right side of the man’s back. Police found the 24-year-old’s body in a field in a suburb of the capital Nicosia on Jan 6, a national holiday. Several days later, police alleged officers had fired shots during an attempt to intercept suspects, saying the death could be connected.\n\nLocal news website Phileleftheros reported on Sunday that three police officers were being questioned over the shooting, which happened in a different place from where the body was found.\n\nPhileleftheros reported that police had said shots were fired at the tyres of a vehicle believed to be involved in illicit migrant smuggling near the line that divides the island.\n\nPublished in Dawn, January 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/09105131812bb74.jpg?r=105625",
  "retrievedAt": "2025-08-26T07:39:45.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884765/cyprus-orders-probe-into-pakistani-mans-murder",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T01:18:22.000Z"
}
