{
  "title": "Rise in terrorism linked to Nato’s leftover weapons, says ex-caretaker PM Kakar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Former caretaker prime minister and Senator Anwarul Haq Kakar on Monday attributed the rise in terrorism to the abundance of Nato weapons left behind in Afghanistan after the US-led mission withdrew in 2021.\n\nPakistan, particularly Balochistan and Khyber Pakhtunkhwa, saw a sharp uptick in terrorism-related incidents in 2024. Terror attacks have increased since the banned Tehreek-i-Taliban Pakistan (TTP) broke a fragile ceasefire agreement with the government in 2022, vowing to target security forces and other law enforcement agencies (LEAs).\n\nMaking the remarks at a security event hosted in Islamabad, the former caretaker PM attributed the rise in terrorism to terrorists taking possession of Nato’s leftover weapons and gadgets. “We cannot afford to leave this region like the Americans left Afghanistan,” Kakar was quoted as saying.\n\nHe was the chief guest at the event attended by diplomats, think tank representatives, and policy experts.\n\nAccording to the press release issued by the Pakistan Institute for Conflict and Security Studies (PICSS), Pakistan’s Comprehensive National Security Profile 2024, a detailed report analysing Pakistan’s security landscape, was launched at the Institute of Regional Studies in Islamabad.\n\n“If it takes a century to fight terrorism, Pakistan will do so. This is not just a battle against militants, it’s a fight for regional stability,” Kakar said, according to the press release.\n\nHe continued, “In 2014, terrorism wasn’t defeated — it merely relocated to Afghanistan. When the environment became conducive, militants struck back. We must discourage the phenomenon of rationalising terrorism under any pretext.”\n\nThe press release added that Ambassador Jauhar Saleem, President of the Institute of Regional Studies, highlighted the collective nature of the challenge, remarking, “Terrorism is a shared threat, and Pakistan should not be left alone to bear the burden. Winning the fight against terrorism requires winning hearts and minds.”\n\nPICSS Managing Director Abdullah Khan focused on the strategies employed by militant groups.\n\n“Despite differing ideologies and goals, terrorist groups operating in Khyber Pakhtunkhwa and Balochistan are employing similar tactics, such as showing territorial control through public displays,” the press release quoted him as saying.\n\n“This raises the question of whether these groups share a common handler. Additionally, their media wings have grown increasingly sophisticated, enhancing their ability to spread propaganda,” he noted.\n\nGul Dad, Director of Research at PICSS, shed light on security challenges along Pakistan’s western borders with Iran and Afghanistan.\n\n“The entire western frontier is now under threat from various terrorist groups,” he said, according to the release. “Moreover, these militants are attempting to reestablish their presence in urban centres of Punjab and Sindh, which poses a significant danger to national security.”\n\nPresident of the Islamabad Chamber of Commerce and Industry Nasir Qureshi emphasised the importance of data-driven insights. “Reports like Pakistan’s Comprehensive National Security Profile 2024 are invaluable for the business community,” he said according to the release. “They help us strategise and plan in an uncertain security environment.”\n\nThe event concluded with a discussion about Pakistan’s counter-terrorism strategies and the importance of international collaboration to combat terrorism.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/13221704e430d3e.jpg",
  "retrievedAt": "2025-08-26T07:39:00.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884953/rise-in-terrorism-linked-to-natos-leftover-weapons-says-ex-caretaker-pm-kakar",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T17:40:50.000Z"
}
