{
  "title": "Strict action to be taken against corona SOPs violators: Dr Firdous",
  "link": "https://www.app.com.pk/national/strict-action-to-be-taken-against-corona-sops-violators-dr-firdous/",
  "date_published": "2020-12-07T18:36:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 07 (APP): Special Assistant to Punjab Chief Minister on Information Dr Firdous Ashiq Awan on Monday said the apex committee meeting chaired by Punjab Chief Minister Sardar Usman Buzdar had decided to take all necessary steps to control second wave of COVID-19.\nAddressing a press conference here at Directorate of General Public Relations, she said that numbers of corona patients were increasing day by day in Punjab.\nThe government would utilize all resources for the treatment of corona patients whereas military and civil administration would jointly strive for saving people from coronavirus, she added.\nShe said that steps were being taken at every level to stop the spread of coronavirus and strict action would be taken against the SOPs violators.\nDr Firdous Ashiq Awan said the government had decided to establish “situation room” for ensuring corona SOPs.\nPrime Minister Imran Khan was not in favor of complete lockdown but in case of any emergency situation, the government would be left with no option but a complete lockdown, she added.\nShe further said that unemployed leaders of immature opposition were responsible for spreading corona.\nThe SACM said, “The decision to implement complete lockdown in Sindh and instigating people to take part in meetings in Punjab shows the hypocrisy of PPP.”\nShe said the Pakistan Democratic Movement (PDM) faced bitter defeat in Multan and it would face the same fate in Lahore.\nShe said those who were chanting hollow slogans today had emptied the national exchequer in the past and such element could not hoodwink the nation any more as their incompetency and corrupt faces had been exposed to public.\nShe said the government was not going anywhere and was least bothered about the threats by Maryam Safdar.\nShe said that Sharif family was not on one page and there was a clear difference in the narrative of Shehbaz Sharif and Maryam Safdar.",
  "retrievedAt": "2025-08-11T20:06:24.948Z"
}
