{
  "title": "Ongoing accountability process to reach to its logical end: Firdous Ashiq",
  "link": "https://www.app.com.pk/national/ongoing-accountability-process-to-reach-to-its-logical-end-firdous-ashiq/",
  "date_published": "2020-12-07T11:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP):Special Assistant to the Chief Minister on Information Dr Firdous Ashiq Awan Monday expressed her confidence that her government under the leadership of Prime Minister Imran Khan would continue the accountability process and it will reach its logical conclusion.\nTalking to a private news channel, she suggested the opposition parties choose a constitutional and legal way to topple the government by submitting a no-confidence motion in the national and provincial assemblies and not hold public meetings in the wake of the second wave of coronavirus.\nShe criticized that PTI government was not afraid of any movement by the opposition and selfish opposition parties were trying to topple the elected state government but all their attempts would not succeed.\nShe said Pakistan Tehreek-e-Insaf led government would complete its constitutional tenure and it would win the next general elections of 2023 with thumping majority on basis of its five years performance.\nReplying to a question, the corrupt opposition was fighting for personal agenda and the PDM did not have any interest to address the problems of poor people.\nTo another query, Awan further criticized that Pakistan Muslim League-N was just using all negative tactics to make their dark future into bright but their all lies were already exposed before the public.\nShe said some political parties were using their workers as ‘cannon fodder’ to hide their misdeeds, adding,\nthe only way forward for the PML-N party was to give up corruption and stay in politics of the people.\nShe said Prime Minister Imran Khan had moved the country on the path of development and he (PM) had played a leading role to improve the national economy.",
  "retrievedAt": "2025-08-11T20:06:30.386Z"
}
