{
  "title": "New year starts with great zeal and enthusiastic resolution",
  "link": "https://www.app.com.pk/national/new-year-starts-with-great-zeal-and-enthusiastic-resolution/",
  "date_published": "2023-01-01T09:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 1 (APP): As the year 2022 departed and a new year of 2023 begins, the people of the twin cities of Rawalpindi and Islamabad have welcomed the new year with great zeal, new hopes and enthusiasm.\nThe residents specially youngsters are excited for the new year making commitments and resolutions to adopt a healthy lifestyle, read more and concentrate on studies or professions in the days to come.\nThe new year brings new hopes and motivations, it’s like a new beginning for us and we all friends are very much excited and enthusiastic about our new year resolutions and making commitments to follow our resolutions throughout the year, said Shiza Ali, a student of BS, while talking to APP.\nShe told that out of so many plans for the new year, she had decided that during this year, she would be more regular in her prayers and would further concentrate on her studies to ensure a good percentage in exams.\nShe said that she also made resolution to start regular exercise, avoid fast food and adopt healthy lifestyle to improve her physical and mental health.\nShahid Saleem, another university student said that I am much excited about the new year as this year I have decided to start my professional life along with my studies to support my parents\nHe said that every year we made so many resolutions out of which we only can follow few. We should make practical resolutions and then work hard to fulfill those commitments for positive change in our lives.\nSalman Karim, a youngster said that this year, he made only one resolution that he will reduce his screen time and ensure to spend more and more time with his family which was more important but being neglected due to excessive use of mobile phone and social media. “I also have decided to start some physical game this year to improve my health and stamina”, she added\nShazia Khan, a house wife while sharing her views said that the new year was a great opportunity to make positive changes in her life and thinking. New year is like a new start which give us a chance learn from our past mistakes and make new beginning with optimistic mind, she said and added that for the new year, she had decided to spare some time for social work and would start teaching some street children living near our area to make my positive contribution towards building a healthy society.",
  "retrievedAt": "2025-08-11T05:39:11.002Z"
}
