{
  "title": "FM Bilawal says making efforts to further broaden ties with friendly countries",
  "link": "https://www.app.com.pk/national/fm-bilawal-says-making-efforts-to-further-broaden-ties-with-friendly-countries/",
  "date_published": "2023-01-01T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 01 (APP): Foreign Minister Bilawal Bhutto Zardari on Sunday said that the coalition government was making efforts to broaden Pakistan’s ties with the friendly countries, besides forging beneficial relations with other countries for the benefits of the people of Pakistan.\nIn a video message on the advent of new year, the foreign minister said that the government had focused to enhance its relationship with the old friends and forge new ties with others.\nHe said “Whenever any allegations were levelled against Pakistan, they befittingly responded to them. In the UN, the Indian side was made to face the reality.”\nThe foreign minister said they knew how to represent Pakistan and defend it.\nThe prime minister had undertaken different foreign visits to increase country’s outreach in the world, he said, adding Pakistan chaired the G77 and succeeded in the inclusion of ‘loss and damage’ fund in the COP 27 agenda for the developing countries. It was not only a big achievement for Pakistan, but also for the developing world and those championing for the cause of climate.\nHighlighting the efforts of the ministry of foreign affairs, the foreign minister said due to their efforts, Pakistan successfully met the action plans of Financial Action Task Force (FATF) ahead of time and had been the only country to be removed from its grey list.\nForeign Minister Bilawal said in the year 2023, they aimed to improve bilateral and multilateral ties at all regional and global fora and organizations and would pursue the agenda of economic diplomacy.\nAbout the EU’s Generalised Scheme of Preferences Plus (GSP+) for Pakistan, he said they would seek its renewal through diplomatic channels as it had seen an increase of Pakistan’s export to the EU countries by 80 percent while those of EU countries to Pakistan by 60 percent.\nFelicitating the nation on the new year, he said the new year would be a harbinger of success for the foreign office and the foreign policy.",
  "retrievedAt": "2025-08-11T05:39:02.936Z"
}
