{
  "title": "21 fresh Covid-19 cases reported in 24 hours: NIH",
  "link": "https://www.app.com.pk/national/21-fresh-covid-19-cases-reported-in-24-hours-nih/",
  "date_published": "2023-01-01T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 01 (APP): Health officials on Sunday said that 21 new Coronavirus cases were reported during the last 24 hours across the country.\nAs per data shared by the National Institute of Health (NIH), the case positivity ratio is 0.51 percent while 19 patients were in critical condition.\nNo death was reported from the Coronavirus in the last 24 hours while 4,135 Covid-19 Corona tests were conducted.\nAround 430 tests were conducted in Karachi, 251 in Gilgit, 803 in Lahore and 447 in Peshawar.\nAs many as eight confirmed cases with a 1.86% case positivity ratio were reported from Karachi, one case with a 0.40% case positivity ratio was reported from Gilgit, three cases with a 0.37% case positivity ratio from Lahore, and one case with a 0.22% ratio from Peshawar was reported.\nMeanwhile, Minister for National Health Services, Regulations and Coordination, Abdul Qadir Patel said that the government has strengthened the role of Border and Health Services in Pakistan to deal with any sub-variant of Covid-19.\nThe minister said that there was a surveillance system at all entry points of the country including airports. He said that there will be rapid tests and screening of passengers at all airports.\nHe said that the situation was completely under control and asked the general public to avoid listening to rumors. He added that the Corona case passivity ratio was just 0.3 to 0.5 in the country while 90 percent of the country’s population already got the COVID-19 vaccine.\nHe said that an efficient system with a proper management team was fully functional in the country to remain vigilant and was ready to make an emergency plan to deal with any sub-variant of Covid-19.\nHe said that Border and Health Services Pakistan was ensuring the implementation of international health regulations.\nHe added further steps were being taken to strengthen the role of Border and Health Services Pakistan.\nHe said that in case of any untoward situation the health system was fully prepared to deal with any sub-variant of the Omicron variant of COVID-19 including BF.7 in the country.",
  "retrievedAt": "2025-08-11T05:39:03.863Z"
}
