{
  "title": "KP MTI Tribunal suspends Lady Reading Hospital dean’s orders to terminate 11 assistant professors - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Medical Teaching Institutions (MTI) Appellate Tribunal has temporarily suspended orders of the management of MTI Lady Reading Hospital (LRH) of ending services of 11 assistant professors till Nov 27.\n\nA bench of the tribunal comprising its chairman retired Justice Abdul Shakoor and members Abdul Ghafoor Qureshi and Mansoor Tariq fixed July 1 for next hearing of separate appeals filed by the said assistant professors challenging the letters issued to them by the LRH dean wherein they were told that their services would end by end of six months.\n\nThe bench observed that the points raised by the appellants’ counsel needed consideration, therefore, the appeals were admitted for regular hearing.\n\nThe bench issued notices to the respondents including the chairman of the LRH board of governors, the LRH dean and the chairman of its Institutional Promotion Committee (IPC), asking them to submit their comments before the next date of hearing.\n\nJuly 1 fixed for next hearing of separate appeals\n\nThe LRH dean had sent separate letters to the appellants informing them that they were considered for promotion at the completion of eight years in their respective posts at LRH, but they didn’t meet the required regulatory criteria of promotion.\n\nIn the impugned letters the appellants were further told that in accordance with the Regulations for MTIs under the MTI Act, 2015, their continuation as faculty had reached its regulatory limit without promotion .\n\nThe dean further claimed that as per section 21 (e ) (vi) of the MTI Regulations, if disapproval occurred at the 8th year (regarding promotion), the candidate service would end, effective in six months.\n\nThey were asked to let the dean know the date on which they would like to end their service, with the last possible date being Nov 27, 2025.\n\nAdvocate Habib Anwar appeared for the appellants and argued that his clients couldn’t be retired before reaching superannuation age i.e 60 years having a status of regular employees of the MTI LRH.\n\nHe argued that the impugned orders issued by the dean in the light of section 21 (e ) (VI) of the regulations, for their early retirement didn’t apply to the appellants.\n\nHe contended that the appellants were regular and pensionable institutional employees of the institution whose previous regular services had duly been protected while initially joining the respondent institution.\n\nHe contended that the respondent-dean had been holding the post as dean on acting charge basis for more than 6-months since Oct 2024, in clear defiance of section 7 (4) of the Act, which provided for such appointment for three months. He added that due to the said violation all his orders including the impugned orders were void and illegal.\n\nHe argued that the respondents had no lawful authority to end up the regular and pensionable services of the appellants as the same was not invested in them under the law.\n\nMr Anwar argued that the impugned letters had been issued without any notice/hearing, therefore, the same violated the principles of natural justice.\n\nFurthermore, the counsel stated that the impugned letters were contrary to an earlier circular of the respondents whereby the employees similarly placed, were directed to submit their promotion cases in next promotion cycle.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:48:26.846Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915959/kp-mti-tribunal-suspends-lady-reading-hospital-deans-orders-to-terminate-11-assistant-professors",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:40:22.000Z"
}
