{
  "title": "PHC rejects plea of foreign company against govt orders to wind up operations - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Peshawar High Court has turned down the petition of an export company owned by South Korean and American nationals against the government’s orders to wind up operations here.\n\nA bench consisting of Justice Syed Arshad Ali and Justice Wiqar Ahmad observed that the petitioner should have approached the federal government, including the ministries of interior, foreign affairs and commerce, to explain its position on the matter.\n\nRejecting the plea, it observed that the petitioner would be at liberty to approach the relevant ministry for the desired purpose.\n\nThe petition was filed by the company, GA Friends, which insisted that the two letters issued by the interior ministry and Khyber Pakhtunkhwa home department on Nov 23, 2023, and Dec 19, 2023, respectively, to the company for winding up operations should be declared illegal.\n\nObserves petitioner should have contacted federal govt on the matter\n\nIt had also challenged a Feb 22, 2024, police notice, asking it to vacate offices in Peshawar’s University Town.\n\nThe petitioner’s counsel said that the company had two directors, Inshook You and Jinwook Lee, both having dual citizenship of South Korea and the US.\n\nHe said that the company mostly focused on exporting pink salt from Pakistan and was also involved in cultural activities, including teaching Korean language to students.\n\nThe lawyer said that the directors had earlier applied for the registration of the Institute of Asian Culture and Development Korea, which was regretted by the federal government.\n\nHe said that GA Friends, which was legally carrying out activities, was utterly surprised at receiving the impugned letter from the home department in which it was accused of involvement in ‘undesirable’ activities.\n\n“The home department had sent the letter in light of another letter of Nov 23, 2023, received by it from the interior ministry that mentioned that the petitioner’s company is an international NGO and it could not work in the country without approval. In light of those letters, the bank account of the petitioner was also blocked without citing any reason,” he said.\n\nThe counsel contended that the impugned letters and actions of the respondents didn’t explain those ‘undesirable’ activities.\n\nHe pointed out that the lawful business of the export company was being stopped with no plausible justification, which was an unconstitutional and illegal act.\n\nAssistant attorney general Rahat Ali Khan Nahaqi appeared for the federal government along with the interior ministry’s deputy secretary, Robina Farooq, and section officer Bilqees Fatima.\n\nAdditional advocate general Inam Khan Yousafzai appeared for the KP government.\n\nMr Nahaqi said that the petitioner had also established an international non-governmental organisation under the name of IACD Korea and applied for registration with the ministry of interior in Feb 2022.\n\nHe added that the said request was rejected by the government on Feb 23, 2023, which was conveyed to the petitioner on March 15, 2023.\n\nThe lawyer pointed out that the Securities and Exchange Commission of Pakistan had also regretted the appointment of foreign director of the company as the security clearance was not provided to it.\n\nThe bench observed that the petitioner had never asked for directions to the respondents including the federal government that INGO should be registered, and its precise object as narrated in the petition was to carry out the business activities.\n\nIt added that the petitioner’s counsel had argued that the shareholders of the company had abandoned the idea of establishing the INGO.\n\nThe bench observed that the petitioner should have approached the federal government in order to clarify its position.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:48:27.572Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915953/phc-rejects-plea-of-foreign-company-against-govt-orders-to-wind-up-operations",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:40:22.000Z"
}
