{
  "title": "Auto sector raises red flags over tariff reforms, used car imports - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: As the government prepares to unveil the federal budget for the next fiscal year, the upcoming National Tariff Policy 2025-30 — designed under IMF guidance — is triggering alarm among local auto assemblers.\n\nThe plan proposes gradually lowering import duties, liberalising used car imports and permitting commercial imports of used vehicles. Industry stakeholders warn these measures could destabilise the local auto sector, erode foreign exchange reserves and widen the current account deficit.\n\nUnder the proposed tariff rationalisation, duties on completely built-up (CBU) vehicles would be slashed to 15 per cent over five years, down from the current 20pc. Additional Customs Duty (ACD) and Regulatory Duty (RD) will be phased out, and the number of tariff slabs reduced from five to four. The government also plans to eliminate the fifth schedule and lower the maximum slab rate to 15pc.\n\nThis sweeping overhaul of the trade regime is apparently aimed at fostering export-led growth, but the auto sector sees it as a serious threat. While the IMF-backed policy seeks to bring Pakistan’s tariff structures in line with global norms, local manufacturers argue that it risks flooding the market with cheaper used vehicles and reversing years of progress in localisation, employment and investment.\n\nLocal carmakers say IMF-backed policy risks flooding market with cheaper used vehicles; fear it will reverse ‘years of progress in localisation, jobs and investment’\n\nIMC urges policy stability\n\nIndus Motor Company (IMC) CEO Ali Asghar Jamali urged the government to avoid abrupt tariff changes and inconsistent policies that, he said, threaten the viability of Pakistan’s auto industry, which he said is the 34th largest in the world.\n\nThis sector contributes four per cent of total tax revenue, is among the top contributors in customs and sales tax collection and sustains 2.5 million jobs, Mr Jamali said. “With over $5 billion invested, harming this strategic industry risks revenue loss, unemployment and stalled localisation. Long-term, stable policies are essential for sustainable growth,” he said.\n\nHe suggested that industry volumes be stabilised at 350,000 units annually to strengthen local supply chains. He also called for maintaining a balanced duty differential of up to 40pc between completely built units (CBUs) and completely knocked down (CKD) units, and up to 25pc between raw materials and auto parts.\n\nHe also proposed increasing financing limits to 70pc of the vehicle’s price with a seven-year term and gradually phasing out used car imports by incentivising local production and rationalising the tax structure for fair competition.\n\n‘Parts makers being undermined’\n\nAamir Allawala, CEO of Tecno Auto Glass Limited and former chairman of the Pakistan Association of Auto Parts and Accessories Manufacturers (PAAPAM), argued that auto parts makers “need consistent volume and respect from the government as the biggest employment generator in the country”.\n\nHe criticised the growing market share of used vehicles, which now stands at 25pc, saying it comes at the cost of the indigenous vendor base.\n\nMr Allawala alleged that used car imports are widely known to involve black money, where transactions are often made through hawala and sales conducted in cash without any traceable money trail.\n\nStill, the government continues to encourage it by allowing “ridiculously low fixed duties” on used vehicles below 1,300cc while planning to increase sales tax on small local vehicles from 12.5pc to 18pc, he lamented.\n\nHe said the industry needed the continuation of a policy that encourages local manufacturing and helps increase volumes to 500,000 vehicles per year.\n\nSteel industry seeks road map\n\nMalik Javed Iqbal, chairman of the Pakistan Association of Large Steel Producers (PALSP), called on the government to establish a consistent, homegrown tariff policy in consultation with stakeholders.\n\n“Incentivising steel production through iron ore will further boost the domestic steel industry, which has the capacity to meet the entire demand of steel now and in future and can also opt for exports,” he said.\n\nHe said the revival of the steel and construction industries by the government can be boosted through a substantial increase in allocations in the Public Sector Development Program (PSDP) and a further cut in the power tariff to make prices of steel products affordable.\n\n“Tariff reduction without ensuring regionally competitive costs of critical inputs like power, gas, interest rates and taxes would invite massive dumping of steel from other countries, further hitting the local industry,” he added.\n\nUsed car importers\n\nOn the other hand, All Pakistan Motor Dealers Association (APMDA) President H.M. Shehzad expressed optimism that the upcoming budget would include provisions to increase the age limit for used car imports to five years and reduce import duties. He said the government is also likely to permit the commercial import of used vehicles.\n\nHe hoped these measures could reduce used car prices by Rs500,000 to Rs1 million and ensure the availability of these vehicles under Rs2 million.\n\nMr Shehzad pointed out that a five-year-old car in Japan costs $3,000-$4,000 compared to $8,000 for a three-year-old vehicle, while a locally assembled 660cc car is priced above Rs3 million. A duty cut and age limit hike could push annual used car imports from 30,000 to 70,000-80,000 units, bringing in additional revenue, he added.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:48:56.482Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915930/auto-sector-raises-red-flags-over-tariff-reforms-used-car-imports",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:39:23.000Z"
}
