{
  "title": "Walsh swims second-fastest 100m butterfly in history - Sport - DAWN.COM",
  "author": null,
  "content": "CHICAGO: Gretchen Walsh clocked a stunning 54.76sec to win the 100m butterfly at the US Swimming Championships on Thursday, coming up just shy of her own world record in a comfortable victory over Olympic champion Torri Huske.\n\nWalsh, who settled for silver behind Huske at the Paris Games last year, had lowered her own world record twice at the Fort Lauderdale Pro Swim last month, becoming the first woman to dip below 55 seconds with a world mark of 54.60sec in the finals there.\n\nShe was well under world-record pace when she turned in 25.19sec, and even though she couldn’t lower the mark, she posted the second-fastest time in history and had plenty to hold off Huske, who finished 1.8sec back in 56.61sec.\n\n“I just like pushing myself past boundaries that I never thought possible,” Walsh, who now owns the top seven times in history, told NBC Sports.\n\nShe lined up a second individual event at the World Championships in Singapore July 11-Aug 3 after winning the 50m fly with the fourth-fastest time ever on Wednesday.\n\nKatharine Berkoff also turned up the heat, posting the second-fastest 50m backstroke time in history with her win in 26.97sec. She broke the Ameri­can record of Regan Smith, who was second in 27.20.\n\nLilly King, a three-time Olympic gold medallist and an 11-time world champion who has announced this will be her last season, won the 50m breaststroke in 29.88sec.\n\nBobby Finke ran down Carson Foster to win the men’s 400m individual medley in 4min 07.46sec.\n\nHe sliced more than two seconds off his personal best to get the better of Paris Olympics bronze medallist Foster, who finished in 4:07.92.\n\nEmma Weyant, silver medallist at the Tokyo Olympics and bronze medallist at the Paris Games last year, won the women’s 400m individual medley in 4:34.81 with Katie Grimes second in 4:37.22.\n\nShaine Casas led all the way in winning the men’s 100m butterfly in 50.51sec.\n\nQuintin McCarty won the men’s 50m backstroke in 24.34sec with Casas second in 24.44.\n\nCampbell McKean, 18, won the men’s 50m breaststroke in a personal best 26.90, edging veteran Michael Andrew by two-hundredths of a second.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68433bdec7cc9.gif",
  "retrievedAt": "2025-10-12T03:27:59.449Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915867/walsh-swims-second-fastest-100m-butterfly-in-history",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:39:50.000Z"
}
