{
  "title": "Lone Pashto movie being released on Eid - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The struggling Pashto entertainment industry came up with a lone film being released on Eid as the once flourishing cinema culture continues a downward trend.\n\nSurprisingly enough, exactly 100 years ago a Hindu businessman, Achram Raam Ghai founded the first performing art theatre — Imperial Theatre — near the famous Qissa Khawani Bazaar way back in 1925.\n\nThat was the age of silent films but Imperial Theatre became the first to launch the era of talkie movies in the city and the maiden Urdu flick titled ‘Alam Aara’ was put up for screening and it proved a landmark.\n\nOut of 15 cinema houses in the city, about 12 were dismantled during the last less than a decade owing to countless factors. Lack of sponsorships, sky-rocketing taxes and power bills forced the owners to go for other business alternatives.\n\nYet experts say building cineplexes in the shopping malls will provide a source of entertainment to public as cinema houses occupy a large space, also modern hi-tech age brought about a drastic change in the cinema culture.\n\nSeveral other Hindu and Sikh business tycoons invested in cinema business and built a number of cinema houses in the city which encouraged local artists and performers and soon the city became the hub of theatres.\n\nAlso, Peshawar produced a large number of famous actors and playback singers and during 1930s and 40s cinema houses were built.\n\nEven after Partition, there were a number of cinema houses in and around the provincial capital during the early 1980s, but late 90s witnessed the declining cinema culture as militancy plagued Khyber Pakhtunkhwa and other parts of country.\n\nThe quality stuff — cast, music and subject — witnessed its lowest ebb and the militancy further aggravated the situation, the Pashto film industry after a successful journey came to its final act on the sliver screen.\n\nAK Khan, a film director, girded up to release lone Pashto flick titled ‘Badmashi Lewantub De’ (villainy is madness) today where it is going to be displayed at only three cinema houses left in the city.\n\nThe cast includes Shahid Khan Jahangir Jani, Arbaz Khan with heroines mostly quite known to viewers.\n\nThe viewers are of the view that the lone movie is a good attempt but to see it as a step towards revival of Pashto film industry would be a far-fetched idea.\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68437b776c75e.jpg",
  "retrievedAt": "2025-08-20T03:48:27.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915957/lone-pashto-movie-being-released-on-eid",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:40:22.000Z"
}
