{
  "title": "Agricultural sector teetering on the brink, warn stakeholders - Business - DAWN.COM",
  "author": null,
  "content": "• Pin high hopes for a major relief in upcoming budget\n• Wheat growers alone suffer Rs2.2tr losses since May 2024\n\nLAHORE: The Pakistan Kissan Ittehad (PKI) has issued a stark warning regarding an escalating agricultural crisis that has gripped the nation since May 2024, resulting in unprecedented financial losses for farmers and a severe downturn in the country’s vital agricultural sector.\n\nAccording to data compiled by the PKI, farmers have collectively sustained a staggering compound loss of approximately Rs2,200 billion in wheat alone between May 2024 and May 2025. This colossal figure represents a significant 23.15 per cent of the total crop sector’s contribution to GDP, which stood at Rs9,500 billion for FY24. The immense financial strain has severely curtailed farmers’ purchasing power, consequently hindering productivity across other critical crops.\n\n“The agricultural sector, the backbone of our economy, is teetering on the brink,” stated Khalid Mahmood Khokhar, President of Pakistan Kissan Ittehad. “The past year has been catastrophic for our farmers, with plummeting prices and unsustainable production costs pushing many to the wall. This crisis is not merely an agricultural issue; it’s a national emergency that demands immediate and decisive action.”\n\nThe crisis extends beyond wheat, with other key crops experiencing significant setbacks. According to PKI, cotton production has plummeted to 5.55 million bales this year, a staggering 50pc below target and 34pc lower than the previous year. This drastic decline is projected to inflate the cotton import bill to an alarming $1.9 billion, a massive leap from $448 million last year.\n\nLikewise, the 2025 wheat production is estimated at 28.98 million tonnes, an 8.91pc reduction from last year’s 31.81m tonnes, representing a shortfall of 2.82m tonnes. This reduction alone accounts for an estimated loss of Rs250bn based on international market values, it claims.\n\nMaize production has declined by 15.4pc to 8.24m tonnes from 9.74m tonnes last year, while sugarcane production has decreased to 84.24m tonnes from 87.64m tonnes.\n\nMr Khokhar says that the overall production of important crops has seen a collective decrease of 13.49pc in FY25, and the overall agricultural sector growth has nosedived from 6.25pc to a mere 0.56pc since July 2024, highlighting the severe contraction of the sector.\n\nThe impact of these production shortfalls is reflected in the nation’s trade balance for food items. While Pakistan’s raw food exports slightly decreased to $6.16bn during July-April 2024-25 compared to $6.23bn last year, the food import bill surged to nearly $7bn in the first 10 months of the current fiscal year, up from $6.82bn in the same period last year. This widening gap underscores the nation’s increasing reliance on food imports, further straining its foreign exchange reserves.\n\nAdding insult to injury, the current tax structure places an unfair burden on local farmers, he bemoans. There is zero General Sales Tax (GST) on imported cotton bales, while locally produced seed cotton is subjected to an 18pc GST, creating a disadvantage for domestic growers.\n\nThe PKI recommends abolishing further tax burden on the agricultural sector as it cannot withstand any additional tax in the form of GST or Federal Excise Duty (FED).\n\nIt also urges the government to immediately announce support or indicative prices for all crops to prevent the exploitation of farmers.\n\nIt demands a robust, efficient, and transparent commodity price mechanism, guaranteeing farmers at least a 25pc return on investment (ROI). The 18pc GST on locally produced seed cotton must be abolished immediately to protect cotton growers. Also the 14pc GST on tractors and 18pc on tractor-mounted implements should be abolished without delay, and electricity tariffs for the agricultural sector should be standardised at Rs10 per unit (one unit, one rate).\n\n’’These measures are not merely suggestions; they are vital for the survival of our farmers and the food security of our nation,“ remarked Khokhar. “The government must prioritise the agricultural sector and implement these recommendations without delay to avert a complete collapse.”\n\nPublished in Dawn, June 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684349c4cc286.jpg",
  "retrievedAt": "2025-08-20T03:48:55.066Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915908/agricultural-sector-teetering-on-the-brink-warn-stakeholders",
  "dateList": "2025-06-07",
  "date_published": "2025-06-06T23:39:44.000Z"
}
