{
  "title": "Two-day Pakistan Learning Conference 2023 kicked off in Islamabad",
  "link": "https://www.app.com.pk/national/two-day-pakistan-learning-conference-2023-kicked-off-in-islamabad/",
  "date_published": "2023-06-21T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): Ministry of Federal Education and Professional Training here on Wednesday commenced a two-day Pakistan Learning Conference 2023: Building Foundations from June 21-22, 2023.\nAttended by global educators, policymakers and experts, this eagerly awaited conference is delving into vital topics of Early Childhood Education (ECE) and foundational learning.\nSpeaking as the chief guest at the Inaugural session, Federal Minister for Education and Professional Training, Rana Tanveer Hussain said that Pakistan had a constitutional commitment to deliver ‘free and compulsory education for all children between the ages of 5 to 16’.\nHe added that the government was intending to go beyond it as Pakistan was committed for achieving the Sustainable Development Goals 4 (SDG4) to provide ‘lifelong learning opportunities for all’. He emphasized for sharing knowledge and experience during the conference and pushing hard for these goals.\nHe further said that through this event Pakistan could come closer to the vision of an educated, confident Pakistani youth, supported from the moment they are born and equipped with the foundational learning to achieve their dreams.\nEarlier, Secretary Education, Waseem Ajmal Chaudhary welcomed the participants and said that the gathering of passionate international and national level educators, policymakers and donors at the conference was a unique opportunity to collectively work towards transforming the landscape of early childhood education and foundational learning.\nHe informed the attendees about the Human Capital Review Report and shed light on how addressing learning poverty is crucial for socio-economic progress.\nHe further added that through the flagship initiatives of MOFEPT which include Out of School Children enrollment drive, foundational literacy through ASPIRE, establishment of classrooms in primary schools & kindergarten important steps are being taken for transforming early childhood education.\nRana added that the Federal Education Ministry was looking forward to creating a Combined Action Plan in the Conference through synergies, collaborations and experience sharing that will positively impact the future of early childhood education in Pakistan.\nRiffat Jabeen, Director Academics Federal Directorate of Education gave an overview of the themes and topics to be discussed in the conference.\nFeaturing nine international and 37 national speakers across diverse educational disciplines, the conference offers a rich tapestry of perspectives.\nWith their expertise and experience, the speakers are sharing invaluable insights, inspiring ideas, and global best practices, enriching the conference experience for all attendees.\nOn day one, insightful panel discussions on Progress and Challenges: ECE as the learning foundation, Right to Education, Financing, Delivery at scale and technical sessions on enabling structures and PPP as delivery models were carried out. Notable speakers included provincial minister of KPK Rehmat Salam Khatam, Baela Raza Jamil from Idara-e-Taleem-o-Agahi, Abigail Barnett from Cambridge International Assessment, representatives of provinces, World Bank, FCDO, UNICEF, USAID, International donors and policy makers, educationists etc.\nInnovative approaches were explored through interactive stalls by the Federal Directorate of Education (FDE), PTCL, National Book Foundation (NBF) and Robotmea, fostering engagement and learning. These stalls provided the visitors an opportunity to see the novel methodologies and ideas in the early childhood education and foundational learning.\nOverall, the Conference aims to shed light on key issues being faced in childhood education by uniting renowned speakers and visionaries. Emphasizing innovation and enhanced practices, this event is sparking insightful discussions, fostering idea exchange, and facilitating collaborative efforts to advance education in Pakistan.",
  "retrievedAt": "2025-08-11T08:45:47.219Z"
}
