{
  "title": "Rs 44124 million allocated for construction of 51 NHA road building schemes in next year’s PSDP",
  "link": "https://www.app.com.pk/national/rs-44124-million-allocated-for-construction-of-51-nha-road-building-schemes-in-next-years-psdp/",
  "date_published": "2023-06-21T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): For implementation of the present coalition government’s vision of building road infrastructure in the country, Rs 44124.386 million have been earmarked in the Public Sector Development Programme for 51 new schemes of the National Highway Authority (NHA).\nAccording to official data, Rs 6000 million have been proposed in the PSDP 2023-24 for dualization and rehabilitation of Karachi-Kararo and Wadh-Khuzdar road.\nSimilarly, Rs 6000 million have been allocated for the Kararo-Wadh and Kuchlak-Chaman section. Rs 4000 million have been set aside for construction of Abdul Khel Interchange to Dhakki to Kalurkot road.\nFor rehabilitation and upgradation of 38 km Pezu-Tank Road, Rs 2200 million have been allocated whereas Rs 2000 million have been apportioned for 35 km road from Yarik Interchange to Tank road.\nFor construction of 14.9 km two-lane D.I Khan bypass, Rs 1000 million have been set aside and as much amount has been earmarked for construction of 66 road link from Ramak (N-55) to Daraban (N-50).\nRs 1800 million have been set aside for rehabilitation and reconstruction 86 km section of N-5 from Moro to Ranipur including damaged bridges under ADB flood emergency loan.\nFor establishment of Interchange at Tandlianwala Area, District Faisalabad on M-3 motorway, Rs 1000 have been kept.\nFor rehabilitation and ugradation of 56 km Kundal Interchange to Lakki Marwat to Tajazai road under D.I Khan Development Package, Rs 1000 million have been allocated.\nRs 2500 million have been allocated for the PC-I for Lowari Tunnel electrical and mechanical works plus brdiges.\nRs 2580 million have been allocated for cosntruction of dual carriageway connecting M-2 at Neela Dullah viaKhaur with M-14 CPEC Western Corridor at Kharpa, Pindi Gheb.\nRs 1500 have been kept in the PSDP for link road from M-I Motorway to Margalla Avenue in Islamabad Capital Territory.\nFor dualization of road from Faisalabad Bypass to Motorway M-3 via Satiana, Rs 1625 million have been set aside.\nRs 986.949 million have been apportioned for extension of Karachi- Lahore Motorway start point to Saggian Road and Main Ravi Bridge Road.",
  "retrievedAt": "2025-08-11T08:45:46.014Z"
}
