{
  "title": "Shazia Marri vows to uphold Shaheed Benazir Bhutto’s mission",
  "link": "https://www.app.com.pk/national/shazia-marri-vows-to-uphold-shaheed-benazir-bhuttos-mission/",
  "date_published": "2023-06-21T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri Wednesday said Pakistan People’s Party (PPP) will always stand with the people of the country and fight against poverty, inflation and unemployment, following the mission of Shaheed Mohtarma Benazir Bhutto.\nPaying tribute to Shaheed Mohtarma Benazir Bhutto on her 70th birth anniversary, Shazia Marri said, “Her contributions to the restoration of democracy in the country will be remembered forever”.\nAddressing a news conference along with Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi, the federal minister said that the PPP leadership and its workers have rendered great sacrifices for upholding democratic values in the country.\nBenazir Bhutto was not only the first women Prime Minister of the country but of the entire Muslim Ummah giving a new perspective to the country’s politics.\nShe took a number of unprecedented initiatives for empowering women including establishing Women Police Stations, and First Women Bank as well as launching the Lady Health Workers project.\nThe Ghazi Barotha and Neelum Power Projects were also launched in her tenure of electricity generation.\nThe federal minister said that oil and gas production increased during the tenure of Shaheed Benazir Bhutto while Pakistan’s relations with foreign countries were also significantly improved.\nReferring to the Thar Coal project which Shaheed Benazir Bhutto once termed as ‘black gold’, Shazia Marri said that the Thar coal project is now the biggest cheap source of generating electricity for the country.\nBeing a woman, Shaheed Benazir Bhutto never considered herself weak but changed the dynamics of politics by empowering women in the country. “Shaheed Benazir Bhutto always fought for the rights of people of the country especially downtrodden segments at every forum and became the voice of the voiceless,” she said.\nShe advocated the policy of reconciliation in front of the country’s political forces through the Charter of Democracy and was of the view that “Instead of fighting with each other, we have to fight with those who are against progress and democracy in Pakistan”.\nThe essence of the Charter of Democracy reflected that two opposing political parties can sit together for the sake of the country’s stability and ensure democracy. “We must show the same political maturity even today”, Shazia Marri added.\nPursuing a positive approach, Shaheed Benazir Bhutto always fought the case of strengthening democracy in the country even when she was not in power, she said.\nShe said that Shaheed Benazir Bhutto had endured many hardships during her imprisonment but never compromised on her principles. “Now people cannot go to jail for half an hour even”, she said.\nThe federal minister said that the Chairman of Pakistan People’s Party, Bilawal Bhutto Zardari is carrying forward the vision and legacy of her mother showing political wisdom and patience.\nShazia Marri said the PPP had fulfilled its promise of establishing peace in Swat, following Shaheed Benazir Bhutto’s mission.\nShe said the PPP is not only a party but an ideology as Shaheed Benazir Bhutto rightly said “You can imprison a man, but not an idea. You can exile a man, but not an idea. You can kill a man, but not an idea.\nThe federal minister said that “You can kill Shaheed Benazir Bhutto but not her idea, her idea lived all in the heart of those who believe in democracy”.\nSpeaking on the occasion, Faisal Karim Kundi said that his party was celebrating the birth anniversary of Shaheed Benazir Bhutto with simplicity due to the recent Greece boat incident.\nAbout the BISP Kafaalat ongoing payments, Faisal Kundi said that the process of issuing quarterly payments of Benazir Kafaalat beneficiaries with a 25 per cent increase has been started a few days ago.\nAbout the recent incident of mistreatment of BISP women beneficiaries in Charsadda, the SAPM said that those constables involved in the incident have been suspended and an inquiry was being conducted against them.\nHe said action is also being taken against delays in payments of BISP beneficiaries by a partner bank.\nAbout those around 8,00,000 beneficiaries expelled from BISP during the previous government tenure, Faisal Kundi said that the cards of 2,62,291 beneficiaries have been unblocked and their quarterly payment is also being issued.\nDuring the ongoing dynamic registry, the SAPM said that over 21,00,000 people have been registered and were in the process of scrutinizing the poverty score.",
  "retrievedAt": "2025-08-11T08:45:40.363Z"
}
