{
  "title": "MNAs deliberate on Senate budget recommendations",
  "link": "https://www.app.com.pk/national/mnas-deliberate-on-senate-budget-recommendations/",
  "date_published": "2023-06-21T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Lawmakers in the National Assembly on Wednesday deliberated on recommendations of the Upper House of the Parliament presented for incorporation in the federal budget 2023-24, suggesting measures to improve the national economy, strengthen key financial sectors and provide maximum relief to the common man.\nResuming debate on the federal budget and the Senate recommendations, Dr Sobia Aslam Soomro of Pakistan Peoples Party Parliamentarians (PPPP) said the past regime of Pakistan Tehreek-i-Insaf (PTI) installed landmines for the incumbent government by weakening the national economy and pushing the country towards the default-like situation.\nShe said the present government effectively tackled all the economic challenges and put the country on a path of macroeconomic stability with collective wisdom, setting remarkable growth targets in the fiscal year 2023-24.\nPrime Minister Shehbaz Sharif, she said, soon after assuming charge of the office restarted the China Pakistan Economic Corridor (CPEC) project that remained on backburner during the three-hand-an-half year rule of the PTI.\nCommenting on the Senate budget recommendations, she suggested increasing sales tax on sugary-energy drinks and tobacco products so the generated revenue could be utilized in health and education sectors besides controlling the increasing population.\nMaulana Abdul Akbar Chitrali of Muttahida Majlis-e-Amal Pakistan (MMAP) recommended ensuring interest-free economic system in the country in line with the Islamic laws, terming the Senate recommendation in this regard ‘insufficient.’\nHe agreed with the suggestions of the Upper House of the Parliament about availability of daily use items in the Utility Stores Corporation (USC) outlets at the subsidized rates; and allocation of a regular budget for producing quality manpower in the health sector including doctors and pharmacists aimed at stopping the brain-drain.\nHe was of the view to establish medical colleges at district level across the country to accommodate maximum number of students who wanted to join this noble profession and serve the ailing humanity.\nSimilarly, he agreed with the recommendation of the Senate about tax exemption on import of sports goods, which were not being produced locally, as it would help create a healthy society and keep the younger generation away from social evils especially drug-addiction.\nThe lawmaker endorsed another recommendation to increase the television license fees, being charged through electricity bills, from Rs 35 to Rs 50, fixing Rs 15 for Radio Pakistan, declaring it ‘justified.’\nHowever, he suggested exempting all worship places from the television license fee/tax, and advocated for declaring Gwadar, Malakand and merged districts of Federally Administered Tribal Areas (FATA) tax-free zones.\nPML-N’s Shaista Pervaiz Malik strongly condemned May 9 riots in which historical Jinnah House was attacked by the protesters of a political party.\nThe perpetrators should be taken to task to avoid recurrence of such incidents in future, she said.\nShe said a person polluted minds of innocent youth which resulted hatred in the society, she said.\nShaista urged to prioritized promotion of quality education in the country as it could bring real change and development in Pakistan.\nAlthough education was devolved subject but we could use forum of Council of Common Interest (CCI) to devise unanimous strategy for promoting quality education, she added.\nShe said the government had launched various programmes for youth and allocated hefty amount to empower them.\nThere was dire need of Charter of Economy in the country on pattern of Charter of Democracy, she said.\nShe also called for abolishing regulatory culture in the country to attract investors’ as such regulatory authorities created unnecessary hurdles in investment.\nAhmed Hussain Deharr of PTI while taking part in the budget debate said that the people had sent us for addressing their longstanding issues but unfortunately mostly issues like holding general elections and court decisions were discussed at this forum.\nHe appreciated the prime minister Shehbaz Sharif and Asif Ali Zardari for floating idea of charter of economy to strengthen the national economy.\nThe PTI’s lawmaker also lauded the government for enhancing salary and pension of the employees which would certainly provide them relief.\nHe demanded of the government to give power to secretariat setup in South Punjab besides taking steps for creating a separate South Punjab.\nAli Musa Gillani of PPP said PPP passed bill to create south Punjab province from Senate unanimously.\nPractically efforts were only made by PPP for creation of South Punjab province, he added.\nHe appreciated the Prime Minister for addressing reservation of coalition partners.\nParticipating in the budget debate, Federal Minister Main Javeed Latif demanded action against the planners and facilitators responsible for the harrowing May 9 incident targeting public and defense installations.\nHe emphasized the need to bring these individuals to justice, expressing concerns over their continued freedom.\nThe minister also raised issue of the current inflation rate, highlighting that the salary and pension increased for government employees were insufficient to cope with the rising cost of living.\nHe pointed out the unique situation in the country’s political landscape, where no political parties were willing to take credit for the current budget.\nWhile acknowledging the challenges faced in presenting the budget amidst a difficult economic situation, he criticized the leadership of the Pakistan Tehreek-e-Insaf (PTI) party for alleged mismanagement of the country’s economy during their tenure.\nHe questioned why the masterminds behind the May 9 incident had not been arrested, further alleging that corruption by the PTI chief had been shielded by the judiciary.\nChaudhry Abid Raza of the Pakistan Muslim League Nawaz appreciated the finance minister for presenting a balanced budget and enhancing the salary of government’s employees.\nHowever, he accused the PTI chief of promoting the politics of division and hate.\nRaza strongly condemned the May 9 incident, where PTI workers attacked government and defense buildings.\nHe emphasized the need for signing another Charter of Democracy to lead the country towards progress, prosperity, and development.\nMNA Naveed Aamir Jeeva from the Pakistan People Parliamentary Party paid tributes to Shaheed Benazir Bhutto on her birth anniversary.\nHe commended the Prime Minister and Finance Minister for presenting a pro-people budget that included enhancements in the salaries and pensions of government employees.\nJeeva emphasized the importance of observing the 5% quota allocated for minorities in the country and called on the government to release development funds allocated for minority members of the National Assembly.\nThe budget debate highlighted various concerns, including the need for justice in the May 9 incident, addressing inflation, political accountability, minority rights, and overall progress and development of the country.",
  "retrievedAt": "2025-08-11T08:45:50.956Z"
}
