{
  "title": "UNHCR, Government of Pakistan pay tribute to resilience of displaced people",
  "link": "https://www.app.com.pk/national/unhcr-government-of-pakistan-pay-tribute-to-resilience-of-displaced-people/",
  "date_published": "2023-06-21T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): UNHCR, the UN Refugee Agency and the Government of Pakistan on Wednesday marked World Refugee Day by paying tribute to the resilience and courage of people who are displaced due to conflict or persecution across the world.\nAccording to UNHCR’s flagship annual report, the number of people displaced by war, persecution, violence, and human rights abuses stood at a record 108.4 million, up 19.1 million from a year earlier, which was the biggest ever increase.\nThe trend witnessed an increase in displacement in 2023, pushing the global total to an estimated 110 million by May 2023. More than 1 in 74 people worldwide remained forcibly displaced.\nThe number of refugees hosted in Asia and the Pacific region rose from 4.2 million in 2021 to 6.8 million by the end of 2022, nearly 20 percent of the global total. Over 90 percent of all refugees in the region are hosted in just three countries, the Islamic Republic of Iran, Pakistan, and Bangladesh.\nThis year’s theme is “Hope away from home”. In Islamabad, government officials, heads of diplomatic missions NGOs and UN agencies, partners’ staff, and many refugees joined UNHCR in marking World Refugee Day.\nMinister of State for Foreign Affairs, H.E. Ms. Hina Rabbani Khar was the chief guest on the occasion. Chief Commissioner for Afghan Refugee Mr. Abbas Khan was also present on the occasion.\nSpeaking at the occasion, UNHCR’s Representative in Pakistan, Ms. Noriko Yoshida paid rich tribute to the resilience of refugees and the generosity of host communities that provides shelter, and protection for refugees as well as giving them access to education and healthcare.\n“World Refugee Day is a time to recognize the generosity of host countries who have kept their borders and hearts open to people in need of protection,” she said, adding Pakistan’s solidarity for over four decades, is an example of commitment to protecting the rights of 1.3 million Afghan and other refugees and giving hope away from home. “We hope that Pakistan will continue to show its generosity and hospitality towards the refugees in Pakistan,” she said.\nThe Minister of State for Foreign Affairs, Hina Rabbani Khar expressed concern over the increasing numbers of displaced people across the world saying the growing number of displacements globally is adversely affecting Pakistan, which has been hosting the world’s largest protracted refugee population.\n“Amid our own financial challenges, we have opened our doors to Afghan and other refugees, however, the international community must come forward to play their role as part of responsibility sharing,” she said.\nVoluntary return of Afghans in safety and dignity is the preferred solution for Pakistan,” she said adding continuous support should be provided to the returning families in Afghanistan so that the return is sustainable.\nChief Commissioner for Afghan Refugees Mr. Abbas Khan, UN Resident/Humanitarian Coordinator in Pakistan, Mr. Julien Harneis also spoke on the occasion. At the event, Afghan refugee children presented a cultural performance. An art exhibition and handmade products made by refugees were also put on display.\nIn Balochistan, UNHCR arranged several activities to raise awareness about refugees. An event was organized in Quetta, which was attended by representatives from the UN, the government and other partners. Balochistan Governor Malik Abdul Wali Kakar was the chief guest at the occasion. Refugee children presented traditional performances. Refugee artisans also displayed their work at the event.\nIn Khyber Pakhtunkhwa, UNHCR and its partner organizations organized different events in connection with World Refugee Day. An exhibition to showcase a range of colors of Afghan culture including art and crafts, music and literature, jewelry and embroidery work, and traditional f",
  "retrievedAt": "2025-08-11T08:45:44.120Z"
}
