{
  "title": "Collected DNA samples of 28 boat victims’ relatives to be sent to Greece: DC Kotli",
  "link": "https://www.app.com.pk/national/collected-dna-samples-of-28-boat-victims-relatives-to-be-sent-to-greece-dc-kotli/",
  "date_published": "2023-06-21T15:12:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 21 (APP):Deputy Commissioner Chaudhry Haq Nawaz on Wednesday said collected DNA (Deoxyribonucleic Acid) samples of close relatives of 28 missing victims of the Greece boat disaster, hailing from the Kotli district, would be sent to Greece for final identification.\nHe told APP that total 30 persons of the Kotli, were on board of the ill-fated boat and only two survived after the incident.\nHe said they would send the DNA samples of the parents and children of missing boat victims to Greece to identify their dead bodies, if found, through cross-matching.\nThe DC said 24 of the missing people belonged to the Khuiratta Sub-division, three to Charhoi Sub-division and one to Sehensa Sub-division.\nThe two survivors – Adnan Bashir, son of Muhammad Bashir and Haseeb ur Rehman, son of Habib ur Rehman, residents of Khuiratta, could not be shifted from Greece to their native towns, he added.\nDC Haq Nawaz said seven of the 12 human traffickers, nominated in the first information report (FIR), including Muhammad Mehtab, Asif Khan, Manazer Hussain, Zaffar Mahmood, Assad Mahmood, Sohail Iqbal and Fareed Khan of the Kotli district had been arrested, while another trafficker Sajid, resident of Gujrat, was already in the custody of Federal Investigation Agency (FIA).\nFive facilitators, including Naveed Yaqoob, Mahboob son of Shafi, Raza son of Mansha Khan, Baber Rasheed son of Muhamamd Rasheed and Abdul Raoof son of Soofi Nazir Aymed, residents of Khuiraata and and Kotli city, had also been nabbed, he added.\nHe said two smugglers, hailing from Pakistani territory and two others including Ch Zulqarnain and Talat, currently based in Libya and Italy respectively, had not been arrested as yet.",
  "retrievedAt": "2025-08-11T08:45:42.782Z"
}
