{
  "title": "Pak-Azerbaijan LNG purchase agreement will end gas crises soon : Musadiq Malik",
  "link": "https://www.app.com.pk/national/pak-azerbaijan-lng-purchase-agreement-will-end-gas-crises-soon-musadiq-malik/",
  "date_published": "2023-06-21T06:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): State Minister for Petroleum Musadik Malik Wednesday assured that Pakistan’s a liquefied natural gas (LNG) purchase agreement framework with Azerbaijan would end gas crises and domestic consumers will not face any gas shortage in the next winter season.\nAzerbaijan will supply an LNG cargo every month to Pakistan at a “cheaper price,” he said while talking to a private news channel.\nWhile giving details of LNG Cargo, he said under Pak-Azerbaijan long-term agreement in the current year we will have 9 to 10 cargo factories in the country, adding, Azerbaijan would help Pakistan to fulfill its energy needs through cooperation in the fields of oil and gas.\nReplying to a question about the shortage of gas, he said in winter, we would be able to control the gas shortage.\nIn some specific areas in Karachi’s, he said that we have been facing infrastructure issues that will be solved on a priority basis.\nHe said that the government hoped to give more relief to domestic consumers in coming winters which will ensure gas supplies to residential consumers at three times.\nTo another question, he explained that the government has also devised a plan to attract investment from Gulf Cooperation Council (GCC) countries as part of the ‘Economic Revival Plan’, adding, these billion of investments in the country would create jobs and livelihoods for the youth and women.\nIn responding to another query about IMF, he said Pakistan has met all the conditions set by the International Monetary Fund (IMF) for a staff-level agreement and we are still very hopeful that the IMF programme will materialize soon.\nTalking about the senate chairman’s additional benefits, he strongly condemned and said that these certain privileges as well as allowances at a time when the country has been going through a severe financial crunch is unacceptable.\nHe said that as a Senator,” I will play my due role and raise objections for these special privileges”.",
  "retrievedAt": "2025-08-11T08:45:56.142Z"
}
