{
  "title": "Azerbaijan Embassy celebrates 105th Anniversary of Azerbaijan Armed Forces",
  "link": "https://www.app.com.pk/national/azerbaijan-embassy-celebrates-105th-anniversary-of-azerbaijan-armed-forces/",
  "date_published": "2023-06-21T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):The Embassy of the Republic of Azerbaijan in Islamabad hosted a grand reception to celebrate the 105th Anniversary of the Azerbaijan Armed Forces.\nSpeaking at the reception, the Ambassador of Azerbaijan to Pakistan, Khazar Farhadov, said, “We celebrate the 105th anniversary of the establishment of the Azerbaijan Armed Forces. Undoubtedly, the peak of the warpath of our National Army during this period is the glorious Victory gained in the Patriotic War, Karabakh Victory. There has been no similar Victory in the centuries-old history of our nation”.\nHe said that on June 26, 1918, by the decision of the Council of Ministers of the Azerbaijan Democratic Republic, the first regular military unit – the Combined Azerbaijan Corps was created. The government set the task of creating an army of 25 thousand people. On August 1, 1918, the Ministry of Defense of Azerbaijan was established.\nThe Ambassador highlighted that the process of army building in Azerbaijan entered a qualitatively new stage under the leadership of President Ilham Aliyev. He successfully continued the army-building policy, and continuous steps were taken toward increasing the military’s professionalism, improving the soldiers’ fighting spirit and moral-psychological training, and supplying our Armed Forces with the most modern weapons and equipment.\nThe 44 days Patriotic War of 2020, which resulted in the liberation of our territories from Armenian occupation by the brave Azerbaijani Army under the leadership of Supreme Commander-in-Chief Ilham Aliyev, was written in golden letters in our history. It is no coincidence that the military operations of the Azerbaijani Army, especially the Shusha operation, are studied in the leading military schools of the world today, he added.\nExplaining the relationship between Azerbaijan and Pakistan, the Ambassador said that the bilateral relations were expanding in all fields, including military and defense cooperation.\nThe Prime Minister of Pakistan’s recent visit to Azerbaijan will always be remembered as a very successful visit. He said that a broad range of issues of the bilateral agenda, including trade and investment, energy cooperation, defense industry, increasing of direct flights, and other important matters, was discussed. He added that all those projects that will further deepen our ties will be implemented very soon.\nAddressing the audience, Colonel Mehman Novruzov, Azerbaijan Defence Attaché to Pakistan said that since its establishment on June 26, 1918, the Azerbaijan Armed Forces had faced many security challenges and demonstrated remarkable resilience, unwavering dedication and a strong commitment to safeguarding security and territorial integrity of Azerbaijan.",
  "retrievedAt": "2025-08-11T08:45:49.658Z"
}
