{
  "title": "Parliamentary Secretary visits Chief Commissioner for Afghan Refugees Office",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):Federal Parliamentary Secretary for Ministry of Kashmir Affairs, Gilgit-Baltistan and SAFRON, Anwar-ul-Haq Chaudhary, on Friday visited the office of the Chief Commissioner for Afghan Refugees (CCAR).\nHe was warmly received by Commissioner HQ Fayaz Wazir during his official visit to the office of CCAR, said a press release on Friday.\nDuring the visit, Parliamentary Secretary was comprehensively briefed on the current status of Afghan refugees and the management of refugee camps across the country.\nThe briefing covered key aspects including the population figures, geographic distribution of refugee settlements and the range of services and facilities being provided to Afghan refugees.\nHe also took a keen interest in understanding the challenges and problems faced by Afghan refugees. The Parliamentary Secretary emphasized the importance of addressing these issues through coordinated efforts and assured that concerns raised would be brought to the attention of relevant authorities for appropriate action.\nThe briefing also shed light on the critical role of CCAR in providing humanitarian assistance, ensuring the protection of refugee rights and facilitating the safe and dignified repatriation of Afghan nationals.\nChaudhary commended the relentless efforts of the CCAR staff, acknowledging their dedication to upholding the dignity and welfare of Afghan refugees. He reaffirmed the government’s commitment to supporting the safe return of refugees while ensuring their well-being during their stay in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:52:59.570Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentary-secretary-visits-chief-commissioner-for-afghan-refugees-office/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T15:44:00.000Z"
}
