{
  "title": "Senate unanimously rejects Indian allegations linking Pakistan to Pahalgam attack",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP): The Senate of Pakistan on Friday unanimously passed a strongly worded resolution rejecting India’s allegations that Pakistan was involved in the April 22 attack in Pahalgam, located in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe resolution, moved by Foreign Minister and Deputy Prime Minister Ishaq Dar, categorically denounced what it described as “baseless and frivolous” attempts to malign Pakistan. It condemned terrorism in all forms and emphasized that the killing of innocent civilians goes against the core values upheld by the Pakistani nation.\nThe Senate resolution accused the Indian government of orchestrating a “mala fide campaign” to exploit the issue of terrorism for narrow political purposes. Lawmakers also strongly condemned India’s recent unilateral move to suspend the Indus Waters Treaty, calling it a blatant violation that “clearly amounts to an act of war.”\nThe resolution warned that Pakistan remains fully capable and prepared to defend its sovereignty and territorial integrity, citing the country’s “robust and valiant” response to Indian aggression in February 2019 as a precedent. It stressed that any further misadventure by India would be met with a firm, swift, and decisive response.\nWhile reaffirming Pakistan’s commitment to peace, the Senate declared that no compromise would be made on national sovereignty, security, and vital interests.\nThe resolution also called for India to be held accountable for its alleged involvement in acts of terrorism and targeted assassinations on foreign soil, including within Pakistan.\nFurthermore, the Senate reaffirmed Pakistan’s unwavering support for the Kashmiri people’s struggle for self-determination and vowed to continue its moral, political, and diplomatic backing for the cause.\nIn his address, Deputy Prime Minister Dar briefed the upper house on key decisions taken by the National Security Committee (NSC), which include suspension of trade ties with India, closure of the Wagah border crossing, downgrading of diplomatic relations, and a warning that any attempt to usurp Pakistan’s water rights would be considered an act of war.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:54:19.325Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-unanimously-rejects-indian-allegations-linking-pakistan-to-pahalgam-attack/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T08:21:00.000Z"
}
