{
  "title": "Delegation of OIC steering committee visits Quaid-i-Azam University",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):Under the facilitation of the COMSTECH Secretariat, Islamabad, a high-level delegation comprising participants of the 6th OIC Steering Committee Meeting visited here Friday Quaid-i-Azam University (QAU), Islamabad, a member institution of COMSTECH Consortium of Excellence.\nThe delegation was warmly received by Vice Chancellor, Prof. Dr. Niaz Ahmad Akhtar (S.I.), who welcomed the esteemed guests on behalf of the university.\nDuring the meeting, Prof. Dr. Niaz Ahmad Akhtar highlighted the immense potential of Islamic countries to lead advancements in science and technology. He emphasized the importance of strategic collaboration among member states and underscored Quaid-i-Azam University’s commitment to promoting scientific research and academic excellence.\n“Quaid-i-Azam University stands ready to collaborate with OIC member countries in all areas of science, research, and higher education. We believe that through mutual cooperation, we can address common challenges and harness our collective strengths,” said the Vice Chancellor.\nHe further stated that with the headquarters of the Standing Committee on Scientific and Technological Cooperation (COMSTECH) located in Islamabad, Pakistan has a special responsibility to take the lead in supporting and guiding fellow Islamic countries in their scientific and technological pursuits.\nEarlier, Prof. Dr. Muhammad Ishtiaq Ali, Director of ORIC, Quaid-i-Azam University, briefed the delegation on the university’s academic faculties, diverse disciplines, available facilities, and key achievements. Referring the international Standing of the University he said that in 2025, the QS World University Rankings recognized QAU’s strength, placing it at the distinguished rank of 315th in the world, 9th in South Asia and 84th in Asia while the Times Higher Education World University Rankings for 2025 ranked QAU top in Pakistan and401st globally.\nProf. Dr. Taswar Hayat, Dean Faculty of Natural Sciences, QAU, Prof. Dr. Irfan Zia Qureshi, Dean Faculty of Biological Sciences, QAU, Dr. Shafiq-ur-Rehman, Registrar, QAU, and Muhammad Murtaza Noor, Media Advisor to COMSTECH, also attended the meeting.\nThe visit aimed to strengthen ties between the academic and research institutions of OIC countries and explore collaborative opportunities.\nThe delegation members appreciated the hospitality extended by QAU and acknowledged the university’s valuable contributions to the advancement of science and technology in the region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:53:44.456Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/delegation-of-oic-steering-committee-visits-quaid-i-azam-university/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T11:49:00.000Z"
}
