{
  "title": "All options on table to preserve “lifeline” water treaty; no mediation effort so far: FO spox",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP): Pakistan on Friday said that it would do everything to defend its territorial integrity and sovereignty as all options were on the table to preserve the Indus Water Treaty – a lifeline and right of 240 million people – sanctified by international law, and bilateral treaties.\n“The Indus Water Treaty has been very clear. It’s unambiguous… All options are on the table for Pakistan. It is our lifeline. It is our right, sanctified by international law, customary law, bilateral treaties. We will do everything to secure this right for our people,” Foreign Office spokesperson Shafqat Ali Khan said at his weekly press briefing here.\nHe told the media that Pakistan was in touch with all the friendly countries to convey its position clearly, however, there were no mediation efforts so far.\nReiterating the decisions taken by the National Security Committee in its meeting on Thursday, including the closure of Wagah Border, suspension of trade, closure of airspace, downgrading of diplomatic ties, and suspension of visas, excluding Sikh pilgrims, he said that India was in no position to make any unilateral decision to hold the water treaty in abeyance.\n“Pakistan is a responsible country. It remains committed to fulfill its obligations under international law and bilateral agreements. However, it takes two to tango. India should not create a situation where we are constrained to take extreme steps… The National Security Committee has pronounced itself very clearly that any attempt to dramatically alter or stop the water treaty would be considered as an act of war,” he said.\nCommenting about the apprehension that Indian could misuse the Pakistani prisoners for its anti-Pakistan motives, the spokesperson expressed hope that the neighboring country would fulfill its international and human rights obligations to look after the prisoners undergoing sentences in its jails.\nHe said the relationship between the two countries was based on certain structural foundations of legal agreements but “if one country is utterly disinterested in any kind of relations, civilised discourse, or interaction, then we also reserve the right to take all necessary measures.”\nAsked about the anti-Pakistan propaganda by the Indian media, Spokesperson Shafqat Ali Khan called it “lamentable” for levelling accusations without verifiable evidence or credible investigation and creating a situation where their government’s position was justified through finger-pointing.\nComing to the Afghan relations, he said that in pursuit of friendly ties with the country Deputy Prime Minister Ishaq Dar paid an important visit to Kabul where various important understandings had been reached, particularly in the area of strong political interaction, which also followed the establishment of a hotline between two sides.\nApprising the media of diplomatic engagements during the last week, the spokesperson mentioned Prime Minister Shehbaz Sharif’s visit to Turkiye and his “extensive discussions” with the Turkish President Recep Tayyip Erdogan on bilateral relations and recent developments in the region and beyond.\nHe also referred to the visit of Deputy Prime Minister and Foreign Minister of the United Arab Emirates, Sheikh Abdullah bin Zayed Al Nahyan to Pakistan on April 20-21, 2025 and his meetings with PM Shehbaz, and DPM Dar besides signing of a Memorandums of Understanding on cultural cooperation, the establishment of a Joint Committee on Consular Affairs, and exchanges on the establishment of the UAE-Pakistan Joint Business Council.\nSimilarly, an MoU on diplomatic training was also signed between Pakistan and Rwanda during the visit of Rwandan Foreign Minister Olivier Nduhungirehe to Pakistan.\nThe spokesperson conveyed heartfelt condolences on the passing of Pope Francis, remembering him as a “revered spiritual figure and a worldwide advocate for peace, interfaith dialogue, and compassion” who demonstrated unwavering commitment to fostering unity among world religions, advocating for the oppressed, and promoting the inherent dignity of all humankind.\n“Pakistan deeply values his tireless efforts to enhance mutual respect and understanding amongst diverse cultures and faiths… At this moment of profound sorrow, Pakistan stands in solidarity with our Catholic brothers and sisters worldwide and with all those touched by the extraordinary life of service,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:54:14.966Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/all-options-on-table-to-preserve-lifeline-water-treaty-no-mediation-effort-so-far-fo-spox/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T09:36:00.000Z"
}
