{
  "title": "NUML spring festival 2025 concludes",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):The most vibrant and colourful Spring Festival at the National University of Modern Languages (NUML) came to a heartfelt conclusion on Friday with a grand Closing Ceremony, marking the end of five days filled with cultural richness, student talent, and global camaraderie.\nThe ceremony honoured the outstanding achievements of students who participated in various competitions across sports, arts, and academics. Prizes and awards were presented to winners and runners-up in events such as cricket, futsal, badminton, table tennis, tug of war, kabaddi, as well as in art, calligraphy, naat, qirat, Korean speech contest, poster and painting exhibition, Mehfil – e Moseequi, Meta Theatre and the bilingual speech contest. The competitions witnessed enthusiastic participation, showcasing the exceptional creativity and energy of NUML students.\nRector NUML, Major General Shahid Mahmood Kayani HI(M) (Retd), delivered an inspiring address that captivated the audience. Applauding the efforts of both organizers and participants, he emphasized the values of unity, empathy, and responsibility.\n“In a world full of challenges, it is unity and mutual respect that will lead us forward,” he remarked. “Our youth are the beacon of hope, and seeing your potential assures me that Pakistan’s future is in capable hands.” The Rector highlighted that 64% of Pakistan’s population is below the age of 35, urging students to recognize their role as future leaders and changemakers. He reminded them that leadership is a divine responsibility, citing Quaid-e-Azam Muhammad Ali Jinnah as an example of one chosen to lead with purpose and vision.\n“We must live for others, understand their pain, and help those in need. Education is the greatest equalizer and at NUML, we will continue supporting brilliant students who lack resources,” he affirmed.\n“Make a good name in society ; not for applause, but for the sake of Allah. If NUML students stand out, NUML will stand out.”\nThroughout the week, NUML’s Spring Festival served as a cultural kaleidoscope, beginning with a majestic opening ceremony that welcomed ambassadors, cultural attaches, and diplomatic guests from across the globe. The event featured mesmerizing performances representing the cultures of Khyber Pakhtunkhwa, Punjab, Balochistan, Sindh, Kashmir, Hazara, Saraiki belt, and Gilgit-Baltistan, as well as international cultural stalls from over 15 countries, offering a taste of global traditions, attire, and cuisines.\nThe Closing Ceremony concluded with a group photo, presentation of souvenirs to sponsors and special guests, and a shared sense of accomplishment, unity, and hope.\nAs the curtain falls on this unforgettable week, NUML’s Spring Festival leaves behind a legacy of diversity, excellence, and inspiration ; a testament to the university’s commitment to nurturing not just scholars, but global citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:53:49.456Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/numl-spring-festival-2025-concludes/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T11:30:00.000Z"
}
