{
  "title": "PMYP makes significant strides in youth empowerment",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP): The Prime Minister’s Youth Program (PMYP) has made significant strides in empowering the country’s youth.\nAccording to an available official document, the program’s core focus was empowering youth through a comprehensive 4E framework, built on four key pillars: Education, Employment, Engagement, and Environment.\nThe document claimed that this comprehensive strategy aims to cultivate a versatile and skilled youth demographic, empowered to spearhead positive transformation and advancement.\nThese initiatives included, launching of the Digital Youth Hub, attracting over one million downloads, with 1,022,424 young individuals registering interest through the app.\nThe National Youth and Adolescent Policy is in its final phase and under this policy, youth will be divided into two categories to better cater to their needs.\nThe policy is being developed by incorporating feedback from one crore (10 million) youth, in collaboration with international partners.\nIt will also include out-of-school children, transgender individuals, and special-needs youth.\nThe Prime Minister’s Laptop Scheme has reached a major milestone, with 600,000 laptops distributed across all phases by the end of Phase-III.\nThe PMYP Laptop Scheme helped the youth start freelancing and set up a digital Skills Institute.\nThe Prime Minister’s Youth Business and Agriculture Loan Scheme has benefited 171,000 youths from March 2025, with a total of 71 billion rupees.\nMany operational programs were also provided such as Youth Internship Program and National Volunteer Core Skills construction and public service opportunities.\nThe Youth Skills Development Program provided training in various businesses and technologies, while the Youth Business and Agriculture Loan Scheme offered free loans to businessmen.\nThe Youth Internship Program provided job opportunities to young people in Academia and the labor market, while the National Youth Council advised policy making.\nIn addition, Talent Hunt Sports League and Sports Academies played a vital role in the development of sports and the Green Youth Movement trains young people with environmental protection.\nThe National Volunteer Corps voluntarily encouraged positive change, and digital Youth Hubs connected young people with digital skills and opportunities.\nTalent Hunt Sports League and Sports Academies played a vital role in the development of sports and the Green Youth Movement trains young people with environmental protection.\nIn addition, the Green Youth Movement and the National Youth Council promoted the youth’s participation and policy influence.\nThe Pakistan Education Endowment Fund has given 861 scholarships worth Rs 250 million.  During the visit of the Commonwealth Secretary General in 2024, several steps were initiated on the youth, including the Commonwealth Asia Youth Alliance and the National Youth Corps.\nAs many as 104,000 players participated in the Prime Minister’s Youth Sports League, and the National Youth Council was formally established.\nUnder the Prime Minister’s Youth Program, the National Advanced and Youth Policy, UNICEF and Generation were being developed with the technical support of the Limited, which aims to meet the needs and wishes of the youth in Pakistan.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:54:27.443Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pmyp-makes-significant-strides-in-youth-empowerment/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T08:04:00.000Z"
}
