{
  "title": "PPRA, World Bank to develop competency framework for procurement professionals",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):The Public Procurement Regulatory Authority (PPRA) Pakistan, in collaboration with the World Bank, has launched an in-depth consultation on capacity building for public procurement practices aimed at developing a competency framework and accredited training modules.\nAs part of this effort, a World Bank consultant George Jadoun held extensive discussions with the Managing Director of PPRA, Hasnat Ahmed Qureshi, and his team, focusing on reviewing existing training programs, identifying capacity gaps, and exploring the development of a national competency framework, standardized procurement training modules, and an accreditation system, said a press release on Friday.\nIn pursuit of long-term reform, the World Bank consultant also engaged with key stakeholders including the Establishment Division and Civil Services Academy to address the institutional barriers hindering the formal recognition of public procurement as a professional discipline within the civil services structure.\nDiscussions were also held with officials from key federal ministries and procuring agencies to understand the needs and challenges of major public buyers.\nThe team consulted with provincial procurement regulatory authorities to assess capacity needs and expertise required to implement procurement reforms effectively. Furthermore, meetings were held with representatives from leading academic institutions—including the Lahore University of Management Sciences (LUMS), Institute of Business Administration (IBA) Karachi, COMSATS University Islamabad and National University of Sciences and Technology (NUST), Islamabad—to explore current training opportunities and evaluate existing curriculum and materials.\nSpeaking on the occasion, Hasnat Ahmed Qureshi stated that the World Bank is guiding us through the process of inculcating professionalism and this consultation would provide a clear roadmap through a well-defined competency framework. Highlighting the government’s broader reform agenda, Qureshi informed that this initiative is in line with the Prime Minister’s vision to establish dedicated procurement cells in all federal ministries to promote transparency and best international practices.\nThese cells are now handling procurement portfolios worth million and billions of rupees, and similar steps are being taken at the provincial level. This shift has created a critical demand for professionally trained procurement experts to deploy at these units, he added.\nMD PPRA emphasized that the development of a structured certification system and integration of procurement education into university curricula will ensure a sustainable, value-driven, and transparent procurement ecosystem.\nThis engagement is part of a broader set of reforms supported by the World Bank to enhance the capacity and performance of public procurement institutions across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:53:16.706Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ppra-world-bank-to-develop-competency-framework-for-procurement-professionals/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T13:50:00.000Z"
}
