{
  "title": "ITP honours brave services in Ghazi Week",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):The Islamabad Traffic Police (ITP) on Friday organized a special ceremony in connection with Ghazi Week to honor the valiant services of Islamabad Police Ghazis.\nAn official told APP that the event was held at the ITP Headquarters with Senior Superintendent of Police (SP Traffic) Majid Iqbal as the chief guest. An official told APP that the  ceremony was attended by senior officers, police veterans (Ghazis) and their families, members of the traffic police education wing, and a large number of students from the National Police Foundation School.\nHe said that SP Majid, along with students, also participated in a tree plantation activity to promote environmental awareness under the ITP’s ongoing plantation drive.\nSP Majid praised the sacrifices made by the Ghazis, stating, “The Ghazis of Islamabad Police are our heroes who have made remarkable sacrifices in the service and protection of the public. Today, we salute their sacrifices.”\nOfficial said that students paid tribute to the police Ghazis through speeches, essay writing, and drawing competitions, highlighting the courage and commitment of the police force.\nHe said that at the end of the ceremony, the chief guest distributed prizes among students who performed exceptionally well and appreciated their creativity and enthusiasm.\nSP Majid Iqbal affirmed that the Islamabad Traffic Police would continue to organize such events to inspire the younger generation with the values of patriotism, lawfulness, and responsible citizenship.\nHe said Chief Traffic Officer Captain (Retd) Syed Zeeshan Haider stated that Ghazi Week not only honors the sacrifices of police personnel but also serves to motivate the youth to follow in the footsteps of these national heroes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:53:16.190Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/itp-honours-brave-services-in-ghazi-week/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T15:37:00.000Z"
}
