{
  "title": "Zero tolerance on over speed & axle load on MWs: Aleem Khan",
  "author": null,
  "content": "ISLAMABAD, Apr 25 (APP):Federal Minister for Communications Abdul Aleem Khan has directed that zero-tolerance policy be strictly enforced against over-speeding and axle load violations across all national Highways & Motorways and no leniency should be observed in this regard.\nHe further instructed that all commercial vehicles must obtain fitness certificates within the next three months and special training programs be arranged for their drivers, as well.\nThese directives were issued in a high-level meeting chaired by the Federal Minister for Communications Abdul Aleem Khan during his visit to the National Highways and Motorway Police Headquarters, said a press release on Friday.\nAbdul Aleem Khan stressed that in order to reduce road accidents, vehicles older than 20 years should not be allowed to come on Motorways and separate certification must be issued for their tires, accordingly.\nHe instructed the Inspector General of Motorway Police to formulate a comprehensive and enforceable policy on these matters, as soon as possible.\nFederal Minister Abdul Aleem Khan expressed concern over recurring accidents at the same location on Motorways and noted that registering FIRs for over-speeding has yielded positive outcomes. He reaffirmed that protecting human lives is top priority and the Motorway Police must continue to improve upon their already commendable standards.\nDuring the briefing, IG Motorway Police informed the Federal Minister that 53 FIRs have been registered so far for the theft of safety barriers with 36 individuals arrested while over 2,000 meters of stolen fence has also been recovered.\nUpon his arrival at the Motorway Police Headquarters, Federal Minister for Communications Abdul Aleem Khan was presented with a guard of honor. He was received by the Federal Secretary for Communications, the IG Motorway Police and other senior officers.\nFederal Minister also laid a floral wreath at the Martyrs’ Memorial in honor of officers who laid down their lives in the line of duty.\nAleem Khan inspected the Motorway Police Control Room and was briefed on the process of handling complaints via the helpline and ensuring their swift solution. He also emphasized the need for the Motorway Police to enhance their presence on social media in accordance with modern-day requirement.\nIn memory of Inspector Mansoor Asghar and other officers recently martyred on the duty, the Federal Minister offered Fateha for their departed souls.\nHe further directed motorway officials to prioritize their own safety and proposed dedicated “shoulders” at various points along the Motorways to safely stop vehicles during emergencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:53:16.906Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/zero-tolerance-on-over-speed-axle-load-on-mws-aleem-khan/",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T14:03:00.000Z"
}
