{
  "title": "Asim Munir’s visit to the U.S. strengthens Pakistan’s position, exposes India’s terror links",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP): Field Marshal Syed Asim Munir’s recent visit to the United States has significantly contributed to the global recognition of Pakistan’s stance on regional security and has once again exposed India’s involvement in state-sponsored terrorism, security sources said on Tuesday.\nAccording to the sources, India’s covert support for terrorism has been brought to light through Field Marshal Munir’s successful military diplomacy. “The U.S. designation of Fitna-ul-Hindustan (BLA) and the Majeed Brigade as terrorist organizations is a direct outcome of the Field Marshal’s efforts,” they stated.\nThe sources emphasized that the U.S. move to blacklist the Indian-backed group Fitna-ul-Hindustan as a global terrorist organization represents international validation of Pakistan’s position.\nThe sources further revealed that India’s premier intelligence agency, the Research and Analysis Wing (RAW), has maintained direct contact with Fitna-ul-Hindustan and has provided financial and logistical support for its terrorist activities targeting Pakistan.\nThey added that India has also offered medical treatment to injured members of the group on its soil. Meanwhile, Indian mainstream media, referred to as “Godi Media,” has consistently attempted to justify and downplay the group’s terrorist actions.\nThe sources also pointed out that Indian Prime Minister Narendra Modi and National Security Advisor Ajit Doval have openly acknowledged links with Fitna-ul-Hindustan in Balochistan. The arrest of Indian naval officer Kulbhushan Jadhav, they said, remains undeniable proof of India’s involvement in state-sponsored terrorism.\nSecurity sources concluded by warning that India’s terrorist designs pose a serious threat not only to regional stability but also to global peace.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:03:32.664Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/asim-munirs-visit-to-the-u-s-strengthens-pakistans-position-exposes-indias-terror-links/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T20:09:00.000Z"
}
