{
  "title": "WHO to train 49,000 health workers for HPV drive",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP):The World Health Organization (WHO) will train over 49,000 health workers for the upcoming introduction of the human papillomavirus (HPV) vaccine from September 15 to 27 in partnership with the Government of Pakistan.\nThe campaign will be a historic milestone to prevent cervical cancer in the country, targeting for the first time 13 million girls aged nine to 14 years across Punjab, Sindh, Islamabad Capital Territory and Azad Jammu and Kashmir (AJK).\nCervical cancer ranks as the third most frequent cancer among women in Pakistan.\nWith a female population of 73.8 million aged 15 years and older at risk, the country reports over 5,000 new cases of cervical cancer in women annually.\nAlmost 3,200 of them (64%) die from the disease. This high mortality rate, one of the highest in South Asia, is primarily attributed to delayed diagnoses and limited access to screening programs.\nA recent WHO study conducted across 18 healthcare facilities in Pakistan (2021-2023) documented 1,580 cases of cervical cancer, indicating a significant underestimation of the disease burden due to low screening rates and the lack of a national cervical cancer registry.\nModelling data indicate that, in the absence of vaccination, the cervical cancer disease burden in Pakistan will increase markedly by at least three-fold over the next seven decades.\nWith funding support from GAVI, The Vaccine Alliance, the cascade training sessions will be conducted until the end of August, focusing on microplanning and essential skills for vaccinators, doctors, social mobilizers, and data entry operators.\nWHO’s support for the campaign also comprises technical guidance for the conceptualization, planning, data analysis, readiness assessments and capacity development in close collaboration with partners, the Pakistan Federal Directorate of Immunization (FDI) and its Expanded Programme on Immunization (EPI) at the federal and provincial levels.\n“This HPV vaccination campaign is more than just a public health intervention. It is an investment in the health and potential of our daughters,” said Dr Soofia Yunus, Director General, Federal Directorate of Immunization (FDI).\n“By embracing this vaccine, Pakistan is taking a big step to protect its future from cervical cancer.”\nThe campaign aligns with the World Health Assembly’s Global Strategy for cervical cancer elimination, which aims that, by 2030, 90% of girls are fully vaccinated with the HPV vaccine by 15 years of age, 70% of women are screened, and 90% of women with pre-cancer or invasive cancer receive treatment.\nWHO Representative in Pakistan Dr Dapeng Luo said, “We are witnessing a truly transformative moment for public health in Pakistan.”\nHe said that WHO is proud to stand with Pakistan and its Federal Directorate of Immunization in championing this critical health measure, ensuring that every girl has the chance to access lifesaving vaccines and lead a life free from the threat of cervical cancer.\nThe phased introduction of the HPV vaccine will pave the way for its eventual rollout in other provinces and areas (including Khyber Pakhtunkhwa in 2026, and Balochistan and Gilgit-Baltistan in 2027), further strengthening Pakistan’s routine immunization program.\nWHO extends its gratitude to Pakistan’s Ministry of Health, the FDI and partners for their unwavering commitment to protect girls from cervical cancer and build a healthier future for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:03:28.586Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/who-to-train-49000-health-workers-for-hpv-drive/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T21:55:00.000Z"
}
