{
  "title": "Pakistan, Ukraine to strengthen cultural and heritage ties",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP):Pakistan and Ukraine have agreed to deepen cooperation in culture and heritage, with both sides underscoring the role of cultural diplomacy in strengthening bilateral relations.\nThis was revealed during a meeting between Federal Minister for National Heritage and Culture Division Aurangzeb Khan Khichi and First Secretary at the Embassy of Ukraine, Ms. Oksana Patriaeva.\nBoth welcomed proposals to expand people-to-people linkages and showcase the two countries’ rich cultural traditions.\nMs. Patriaeva proposed setting up a Ukrainian Book Corner at the National Library of Pakistan to introduce Ukrainian literature, history, and arts to local audiences.\nShe also expressed interest in cultural exchange programs, film collaborations, exhibitions, and arts-based initiatives. “Pakistan is a beautiful country with warm-hearted people. We have always valued the support of the Government of Pakistan and want to further strengthen cultural contacts,” she said.\nThe Minister assured full support for the initiatives, designating a focal person to coordinate the process. He suggested joint exhibitions, cultural shows, and exchange programs, as well as expanding existing MoUs on culture, heritage, and literature. He also invited Ukraine to participate in Lok Virsa’s annual Lok Mela with a dedicated pavilion featuring Ukrainian cuisine, crafts, and performances.\nMs. Patriaeva welcomed the invitation and shared plans to bring Ukrainian artists and films to Pakistan, along with visits to heritage sites such as Mohenjo-daro and Harappa.\nHighlighting the government’s efforts to revive the film industry, the Minister offered Ukrainian cultural delegations the use of galleries in Karachi and Lahore for exhibitions.\nThe meeting concluded with both sides agreeing to fast-track cultural cooperation and explore new avenues for heritage-based engagement.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:03:03.604Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-ukraine-to-strengthen-cultural-and-heritage-ties/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T23:04:00.000Z"
}
