{
  "title": "Apex committee finalizes results for ‘National Seerah, Naat & Research Competitions 2025’",
  "author": null,
  "content": "ISLAMABAD, August 12 (APP):The Apex Committee of the Ministry of Religious Affairs and Interfaith Harmony has finalized the results of the National Competition for Seerah Books, Naat, and Research Papers 2025.\nThe outstanding contributors to Seerah literature will be honored with awards on 12 Rabi-ul-Awwal next month during the International Seerat-un-Nabi Conference.\nThe meeting, chaired by Prof. Dr. Sahibzada Sajid-ur-Rehman, was held on Tuesday at the ministry and attended by renowned educationists and Islamic scholars including Dr. Riaz Majeed, Dr. Yousuf Farooqi, Dr. Muhammad Sajjad, Dr. Ikram-ul-Haq Yaseen, Dr. Mohi-ud-Din Hashmi, Dr. Muhammad Ilyas, Dr. Feroz-ud-Din Shah, and Dr. Munazza Batool.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/08/WhatsApp-Video-2025-08-12-at-18.03.07.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nPreliminary results of the competition’s submissions were reviewed by the committee, which scrutinized the marks and recommendations provided by the judges. This year’s competition attracted 142 entries in major categories, including Seerah books, Naats, and magazines written in Urdu, regional languages, and other foreign languages.\nFor the essay-writing category, focused on the theme “State Responsibilities in Educating and Training for the Beneficial Use of Social Media – In the Light of Seerah of the Holy Prophet Peace Be Upon Him”, the ministry received 107 research papers from male and female scholars.\nThe ministry reaffirmed its commitment to publishing the winning research papers – providing contemporary solutions inspired by the Seerah – and distributing them to prominent educational institutions and libraries nationwide, a tradition it has upheld successfully for decades.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:02:11.827Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/apex-committee-finalizes-results-for-national-seerah-naat-research-competitions-2025/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-13T01:53:00.000Z"
}
