{
  "title": "Government firmly committed to youth development: Rana Mashhood",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP):On International Youth Day, Chairman of the Prime Minister’s Youth Programme, Rana Mashhood Ahmad Khan, praised the government’s ongoing efforts to empower young people, highlighting initiatives led by Prime Minister Shehbaz Sharif both in his current role and during his tenure as Punjab Chief Minister.\nIn his video message on Tuesday he stated  that Prime Minister Shehbaz Sharif had been instrumental in introducing Pakistan’s first youth policy, launching the laptop distribution scheme, awarding scholarships, and providing soft loans to young entrepreneurs.                He emphasised that 70% of Pakistan’s population is under the age of 30, adding that the government remains committed to offering opportunities in fields such as artificial intelligence, information technology, and sports.\nOn International Youth Day, Rana Mashhood said “Pakistan is working hard to meet its global development targets, thanks to the efforts of local youth, as per this year’s theme is “‘Local Youth Actions for the SDGs and Beyond”‘.                                                              He announced that under a new policy, laptops will be available for all on an interest-free loan basis, while Pakistanis securing overseas work permits will be eligible for interest-free loans of up to Rs 1 million to cover travel expenses.\nHe also revealed that the government is finalising Pakistan’s first National Youth and Adolescent Policy, which will address issues faced by age groups 10–15, 15–19, and 19–29.\nHe further stated that over 500,000 young people have registered with the Digital Youth Hub, while more than 1.6 million have downloaded its mobile application, leading to thousands of job placements both domestically and abroad.                                       He encouraged young people to remain determined, saying, “Every new day brings new opportunities for Pakistan’s youth. The Prime Minister and his programme stand firmly with you.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:01:19.693Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/government-firmly-committed-to-youth-development-rana-mashhood/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-13T04:19:00.000Z"
}
