{
  "title": "ITP issues diversion plan for August 13–14 for Ma’rakah-e-Haq commemorations",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP):Islamabad Traffic Police (ITP) has announced a special traffic diversion plan for August 13 and 14, 2025, in connection with the national commemorations of Ma’rakah-e-Haq.\nAn official told APP that under the plan, the Srinagar Highway from Zero Point to Jinnah Square will remain fully closed to general traffic in both directions, while entry of all types of heavy traffic into Islamabad will be prohibited from 12:00 p.m. on August 13 until 3:00 a.m. on August 14.\nMeanwhile, Murree Road via Shakarparian Road, Chand Tara Chowk, and Garden Avenue I-8 will also remain closed for all traffic, along with I-8 Garden Bridge, G-7 Loop, and Sports Complex Turn on Murree Road Garden Avenue.\nMotorists coming from the Motorway can use Srinagar Highway, Murree, and Bhara Kahu via Peshawar Mor, 9th Avenue, Jinnah Avenue, Embassy Road, and Serena Hotel.\nTraffic from Zero Point can use the left loop towards Suharwardy Road, Aabpara, and Serena Hotel.\nVehicles from Murree and Bhara Kahu heading to Rawalpindi can use Korang Road, Bani Gala, Park Road, and Faizabad.\nTraffic from Murree Jinnah Square can opt for Kashmir Chowk, Club Road, and Faizabad, while traffic from Kashmir Chowk can use Suharwardy Road, Aabpara Chowk, and Zero Point.\nITP officials will be deployed at major roads and intersections to guide commuters and ensure smooth traffic flow during the Ma’rakah-e-Haq commemorations. Citizens are advised to use alternate routes, plan their journeys in advance, and stay informed through ITP’s social media platforms and FM Radio 92.4./APP-rzr-mkz\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:02:11.128Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/itp-issues-diversion-plan-for-august-13-14-for-marakah-e-haq-commemorations/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-13T01:56:00.000Z"
}
