{
  "title": "Grand ceremony held at BISP in connection with Independence Day celebrations",
  "author": null,
  "content": "ISLAMABAD, Aug 12 (APP):The Benazir Income Support Programme (BISP) on Tuesday organized a grand ceremony at its headquarters to commemorate Pakistan’s 78th Independence Day and pay tribute to the historic “Marka-e-Haq” victory of the Pakistan Army.\nChairperson BISP, Senator Rubina Khalid, Secretary Aamer Ali Ahmad, Additional Secretary Dr. Asmat Nawaz, Director Generals, development partners, representatives of partner banks, and staff attended the event.\nIn her address, Senator Rubina Khalid lauded the Armed Forces for their decisive response to Indian aggression, calling it a moment of pride for the entire nation. “Just as the Pakistani Armed Forces ensured the freedom and security of the country, BISP is empowering its beneficiaries by giving them the right to receive funds through Sahulat Accounts and Digital Banking,” she said.\nHighlighting a landmark initiative, she announced that 10 million women will, for the first time in Pakistan’s history, be brought into the banking system, enabling them to choose their preferred bank and payment system.\nActing on the special instructions of President Asif Ali Zardari, she added, transparent payments are being ensured for deserving women in a dignified manner, with efforts underway to facilitate IBAN numbers and Full Mandate Accounts.\nSecretary BISP, Aamer Ali Ahmad praised the Armed Forces for safeguarding national sovereignty, drawing a parallel with BISP’s mission to combat poverty and economic injustice. “Our staff across the country remain united and committed to this important public mission,” he said.\nThe ceremony concluded with the cutting of the Independence Day cake by the Chairperson, Secretary, development partners, and staff.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:01:19.621Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/grand-ceremony-held-at-bisp-in-connection-with-independence-day-celebrations-2/",
  "dateList": "2025-08-12",
  "date_published": "2025-08-13T04:34:00.000Z"
}
