{
  "title": "Jammu Kashmir Liberation Front condemns raid on Yasin Malik’s home - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: The Jammu Kashmir Liberation Front (JKLF) condemned a raid by an investigation agency on the residence of its jailed chairman, Muhammad Yasin Malik, on Tuesday. His mother and sister were harassed during the search, the JKLF added.\n\nIn a statement, the JKLF’s spokesperson Muhammad Rafiq Dar said the Srinagar Investigation Agency (SIA) had been tasked with reopening decades-old “fictitious” cases and was being used by New Delhi to further its “anti-Kashmir agenda” by targeting anti-India leaders.\n\nMr Dar described recent court actions against Mr Malik as “unilateral judicial measures” taken in his absence, accusing New Delhi of pursuing “political vendetta” through coercion. He said creation of the SIA indicated that India had resorted to “aggressive tactics” to crush the freedom movement.\n\nThe JKLF vowed to intensify campaigns at home and abroad to highlight India’s “inhumane” treatment of Yasin Malik. “The JKLF is determined to continue its struggle until the complete freedom of Kashmiris from Indian subjugation. In view of the freedom movement’s overwhelming public support and the unprecedented sacrifices made at the national level, India, despite its state terrorism, cannot deprive Kashmiris of their right to freedom for too long,” he asserted.\n\nMeanwhile, Mr Dar appreciated the efforts by some party leaders, Raja Muzaffar, Prof Raja Zafar Khan, Nazim Bhatti, Malik Lateef, Malik Aijaz, Qari Ajaib, Haji Muhammad Iqbal, and Chaudhry Muhammad Rafiq, to bring all JKLF factions on one platform. In this regard, he welcomed Mr Muzaffar’s resignation from his group’s chairmanship as “a step toward unity” and assured of his support to initiatives aimed at consolidating the organisation.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2022/05/627ddb3319493.jpg",
  "retrievedAt": "2025-08-16T07:35:46.355Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930569/jammu-kashmir-liberation-front-condemns-raid-on-yasin-maliks-home",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:30.000Z"
}
