{
  "title": "European powers tell UN they are ready to reimpose Iran sanctions - World - DAWN.COM",
  "author": null,
  "content": "Britain, France and Germany have told the United Nations they are ready to reimpose UN-mandated sanctions on Iran over its nuclear programme if no diplomatic solution is found by the end of August, according to a joint letter obtained by AFP.\n\nThe letter to UN Secretary-General Antonio Guterres and the UN Security Council says the three European powers are “committed to use all diplomatic tools at our disposal to ensure Iran does not develop a nuclear weapon” unless Tehran meets the deadline.\n\nThe foreign ministers from the so-called E3 group threaten to use a “snapback mechanism” that was part of a 2015 international deal with Iran that eased UN Security Council sanctions.\n\nUnder the deal, which terminates in October, any party to the accord can restore the sanctions.\n\nAll three have stepped up warnings to Iran about its suspension of cooperation with the UN nuclear watchdog, the International Atomic Energy Agency.\n\nThat came after Israel launched a 12-day war with Iran in June, partly seeking to destroy its nuclear capability. The United States staged its own bombing raid during the war.\n\n“We have made clear that if Iran is not willing to reach a diplomatic solution before the end of August 2025, or does not seize the opportunity of an extension, E3 are prepared to trigger the snapback mechanism,” foreign ministers Jean-Noel Barrot of France, David Lammy of Britain and Johann Wadephul of Germany said in the letter.\n\nAll three countries were signatories to the 2015 Joint Comprehensive Plan of Action with the United States, China and Russia that offered the carrot and stick deal for Iran to slow its enrichment of uranium needed for a nuclear weapon.\n\nPresident Donald Trump pulled the United States out of the accord in 2018 during his first term and ordered new sanctions.\n\nThe European countries said they would stick to the accord. But their letter sets out engagements that the ministers say Iran has breached, including building up a uranium stock more than 40 times the permitted level under the 2015 deal.\n\n“The E3 remain fully committed to a diplomatic resolution to the crisis caused by Iran’s nuclear programme and will continue to engage with a view to reaching a negotiated solution.\n\n“We are equally ready, and have unambiguous legal grounds, to notify the significant non-performance of JCPOA commitments by Iran … thereby triggering the snapback mechanism, should no satisfactory solution be reached by the end of August 2025,” the ministers wrote in the letter first reported by the Financial Times.\n\nThe United States had already started contacts with Iran, which denies seeking a weapon, over its nuclear activities.\n\nBut these were halted by the Israeli strikes in June on Iran’s nuclear facilities.\n\nEven before the strikes, the international powers had raised concerns about the lack of access given to IAEA inspectors.\n\nIran halted all cooperation with the IAEA after the strikes, but it announced that the agency’s deputy chief was expected in Tehran for talks on a new cooperation deal.\n\nIran’s Foreign Minister Abbas Araghchi sent a letter to the UN last month saying that the European countries did not have the legal right to restore sanctions.\n\nThe European ministers called this allegation “unfounded”.\n\nThey insisted that as JCPOA signatories, they would be “clearly and unambiguously legally justified in using relevant provisions” of UN resolutions “to trigger UN snapback to reinstate UNSC resolutions against Iran, which would prohibit enrichment and re-impose UN sanctions.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/13123453b6d4cec.png",
  "retrievedAt": "2025-08-16T07:34:30.470Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930639/european-powers-tell-un-they-are-ready-to-reimpose-iran-sanctions",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T07:46:08.000Z"
}
