{
  "title": "Sindh Labour Code slammed, termed ‘conspiracy’ against workers - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh Labour Code (SLC) is being seen as an instrument to impose lawlessness on workers. This was the general consensus at a press conference called by the Workers’ Solidarity Committee (WSC), a joint platform of labour, human rights, social activists and progressive intellectuals, at the Karachi Press Club on Tuesday.\n\nThey were all of the opinion that the SLC was a document designed to strip workers of their identity and fundamental rights as part of an international conspiracy and agenda of capitalism.\n\nNasir Mansoor of the National Trade Union Federation pointed out some major problems with the SLC starting with workers’ objections to the Code not having been addressed in its proposed draft. Instead, he added, officials of the labour department, in collaboration with the International Labour Organisation (ILO), were “attempting to legitimise anti-worker contractual and outsourcing systems” under the cover of the Code.\n\n“Sadly, this anti-worker action by the ILO is itself against the ILO’s fundamental conventions,” he said.\n\nWorkers’ Solidarity Committee announces joint struggle to safeguard labourers’ rights\n\nThe labour department, it was said, is also hindering the formation of unions. “Union activists are being made jobless. They also get death threats,” he added.\n\n“It is in this kind of a situation that we have joined forces to form the WSC. It is a kind of ‘Save Our Souls’ call from us,” said Mr Mansoor, who added that more than 60 per cent of Pakistan’s workforce was in Sindh and 90 per cent of them were in Karachi.\n\nHe claimed that key social security institutions such as the Sindh Employees Social Security Institution and the Sindh Workers Welfare Board had not registered the entire workforce so their benefits didn’t reach them.\n\n“Most of the workers get no weekly offs, no health benefits and no gratuity or pension as they have been hired through the third-party contractual system,” he said.\n\nHuman rights activist Anis Haroon reminded the audience that labour is the backbone of any country.\n\n“But in our country, the government is taking away labour rights from them. A majority don’t even get minimum wage,” she added.\n\n“Joblessness is on the rise because everything is moving towards privatisation. I’m afraid that it will lead to an increase in violence as people lose hope and become frustrated,” she said.\n\nLiaquat Sahi of the Democratic Workers Union said that if any company was not doing well financially, the workers there were punished with salary and job cuts.\n\nQazi Khizar of Human Rights Commission of Pakistan said that it was the state’s responsibility to provide jobs to people. He demanded immediate withdrawal of the current SLC draft. “We demand that it be redrafted through tripartite consultation. If implemented in its present form, it will legalise modern forms of slavery in industrial, financial, media, and other sectors,” he warned.\n\nAcademic Dr Riaz Shaikh, of SZABIST, said: “With your labour not being given their basic rights, you have nothing of quality to export. And after the implementation of the SLC, your formal labour will turn into informal labour.”\n\nComrade Gul Sher of Watan Dost Mazdoor Federation criticised third party contractual system.\n\nFarhat Parveen of Now Communities urged to review the overall labour laws.\n\nKhalid Khan of National Labour Federation, Mohammad Iqbal of Peoples Unity of PIA Employees CBA, Abdul Razzaq Mamon of Port Workers Union, Tahir Hasan Khan of Pakistan Federal Union of Journalist and veteran labour leader Usman Baloch also spoke.\n\nSaeed Baloch of Pakistan Fisherfolk Forum, Haider Abbas of PILER and Zehra Khan of Home Based Women Workers Federation were also present.\n\nThey also announced a protest on Aug 19 in SITE.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:35:03.433Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930492/sindh-labour-code-slammed-termed-conspiracy-against-workers",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:57.000Z"
}
