{
  "title": "Bilawal hits out at PM Shehbaz over delay in K4 project - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP Chairman Bilawal Bhutto-Zardari on Wednesday criticised Prime Minister Shehbaz Sharif over the inordinate delay in the K-IV water project, saying he had expected the premier to demonstrate the same speed and efficiency in Karachi as he does in Lahore.\n\nLaunched in the early 2000s to ease Karachi’s water woes, the K-IV project has faced repeated delays and cost hikes. With just Rs3.2 billion allocated against the Rs40bn needed, officials fear completion could be pushed back another decade.\n\nAddressing an inauguration ceremony of a new canal for Karachi from Hub Dam, Bilawal said: “The K4 project, we had hoped for Shehbaz speed, but Karachi got Shehbaz slow. This cannot happen that Lahore gets Shehbaz speed and Karachi gets Shehbaz slow, so I will especially request the prime minister to complete the promises as quickly as possible regarding the K4 and this city.”\n\nBilawal was referring to the famed ‘Punjab speed’, a term coined to describe PM Shehbaz’s swift and efficient governance as chief minister of Punjab.\n\nIslamabad’s budget allocation had triggered a kind of rift between the PML-N and the PPP — allies in the ruling coalition.\n\nThe Sindh government had expressed strong reservations over the “inadequate allocation” in the federal budget, saying it was taking the matter very seriously and in the process of reviewing the entire budget.\n\n“We have serious concerns not only about this project but also the K-4 initiative,” Sindh Information and Transport Minister Sharjeel Inam Memon had said. “The funds allocated are highly inadequate. The Pakistan Peoples Party is taking these issues seriously and will thoroughly review the budget.”\n\nHe had stressed the need for fiscal discipline and smarter resource management at the federal level.\n\n“We’ve submitted formal proposals to the prime minister and urged the federal government to cut down on unnecessary expenditures,” he said. “If revenue is not increasing, it becomes essential to control expenditures. All spending must be managed wisely; otherwise, we’re putting our entire fiscal policy at risk.”\n\nMeanwhile, the new Hub Canal, a significant initiative of the provincial government aimed at addressing the water woes of the city, will add 100 million gallons of water per day (MGD) to the supply.\n\nThe Hub Canal project, approved in 2022, included the construction of a new canal and the rehabilitation of the old Hub Canal to further increase water supply in the two districts. The project included upgrading the Hub pumping station, rising main, and Hub Filter Plant from 80 MGD to 100 MGD.\n\nBilawal said the water from the new canal would be supplied to the Central, East and Keamari districts, hoping that it would be supplied to Lyari and the islands in the future as well.\n\nHe said restoration of the old canal was also underway and added that the party would try to secure increased water allocation of 200 MGD for Karachi from the chief minister.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/13172047d669c6b.jpg",
  "retrievedAt": "2025-08-16T07:34:02.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930670/bilawal-hits-out-at-pm-shehbaz-over-delay-in-k4-project",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T13:11:30.000Z"
}
