{
  "title": "Government denies rumours of more mosques being razed in capital - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Minister of State for Interior Talal Chaudhry on Tuesday turned the tables on the protesting clerics, claiming that religious elements were spreading rumours about demolition of more mosques in the federal capital.\n\nThe state minister said land on which Madani Mosque and madressah were built had been cleared in the presence of their management.\n\nThe minister categorically refuted the reports circulating on social media that the government was planning to demolish another 50 mosques in the middle of the night.\n\nResponding to the religious parties’ protest on Monday over the demolition of Madani Mosque, he said action was taken after seeking consent of the head of the madressah.\n\nState minister says Madani Mosque demolished after seeking consent of seminary head\n\n“We had filmed the entire operation because it was anticipated that such a situation can develop,” he told the National Assembly while responding to a point of order raised by Jamiat Ulema-i-Islam-Fazl (JUI-F) MNA Maulana Abdul Ghafoor Haideri over the issue of demolition of Madani Mosque.\n\nMaulana Haideri had maintained that the madressah was shifted but the concerned cleric was not willing to demolish the mosque.\n\n“Once a mosque is built, it cannot be demolished until the day of judgement,” the JUI-F leader said, adding that “this should not happen in an Islamic state”.\n\nHe said the relevant minister had given 48 hours to resolve the issue with mutual understanding.\n\nThe Maulana referred to the Lal Masjid scenario and said the matter got disturbed due to negotiation delays.\n\nResponding on the point of order, the state minister told the house that the entire operation was conducted in consultation and supervision of the management of the mosque and the seminary and the demolition took place in the presence of its head at the site.\n\nMr Chaudhry said the mosque and seminary were built illegally on a greenbelt, however, a modern building had been constructed for them at a cost of Rs40 million.\n\n“Besides, reports of an operation against more than 50 mosques in Islamabad were not true,” he said.\n\nThe state minister responded by saying that he was grateful to the Maulana for playing role of a great scholar in this matter.\n\nHe said since January this year, negotiations had continued with the management of the mosque and the seminary, adding that “we have given a new madressah building in the style of modern schools at a place of their choice”.\n\nHe said the actual cost of the land and the building given to the madressah amounted to upto Rs150 million.\n\nMr Chaudhry denied the impression that an understanding with the government had been reached only over the demolition of the madressah, adding that he had the understanding that mosques were present in all madressahs.\n\nHe said the new building was completed in July, and the students had been shifted there and they were allowed to take all necessary items, including fans, with them. He said there were 185 students in the madressah.\n\nThe state minister also said if there was any construction on the greenbelt or on the way, decision would be made after consultation with the management of that mosque.\n\nHe expressed the hope that the issue would be resolved amicably after return of Interior Minister Mohsin Naqvi from a foreign visit.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1311370827eb964.png",
  "retrievedAt": "2025-08-16T07:34:57.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930511/government-denies-rumours-of-more-mosques-being-razed-in-capital",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:06:12.000Z"
}
