{
  "title": "Boycotting PTI members return to NA, join legislative business - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Govt reiterates talks offer, opposition seeks time to respond\n• House witnesses passage of five, introduction of 16 bills\n• Fatyana moves Constitution amendment bill seeking creation of West Punjab province\n\nISLAMABAD: A day after causing a rumpus and boycotting the National Assembly over the conviction of party leaders in the May 9 riots, opposition Pakistan Tehreek-i-Insaf (PTI) lawmakers returned to the house on Tuesday for the private members’ day proceedings, allowing Speaker Ayaz Sadiq to complete the legislative agenda, as the assem­bly passed five bills and introduced 16 more.\n\nOn Monday, PTI members had lodged a strong, noisy protest and staged a walkout, protesting the convictions of party leaders in connection with the riots.\n\nAt the outset of Tuesday’s sitting, the opposition members, led by Asad Qaiser, again staged a walkout from the house when Mr Sadiq refused to give them the floor to move a privilege motion against the authorities denying them a meeting with incarcerated PTI founding chairman Imran Khan at Adiala Jail.\n\nAs the PTI members started leaving the hall, raising slogans, the speaker once again offered facilitation in the talks between the government and the opposition and went one step forward by nominating Law Minister Azam Nazeer Tarar, Minister of State for Interior Talal Chaudhry and veteran PPP MNA Syed Naveed Qamar to engage the opposition.\n\nWhen Mr Sadiq asked the opposition to propose two names from their side to become a part of negotiations, the latter sought time to come back to him after holding an in-house consultation.\n\nHe stressed that dialogue was the only way to resolve political differences and offered to act as a bridge between the government and the opposition.\n\nHe also referred to the arrest of Indian Opposition Leader Rahul Gandhi, noting that even in that case, no “production orders” were issued. He emphasised that no forum was greater than the National Assembly and the Senate as a “grand jirga”, and urged all political forces to come forward to strengthen parliament.\n\nMr Sadiq said that in the past, he had facilitated the government-opposition talks, alleging that it was the opposition, not the government, that had withdrawn from the negotiation process.\n\nThe speaker asked the protesting PTI members to make their talks with the government conditional on the permission for them to meet Imran Khan in jail. “Put this before the government as your demand,” he said.\n\nWhile refusing to grant PTI leaders the floor to move a privilege motion, the speaker said that such a motion could only be allowed if the members faced hurdles in fulfilling their parliamentary duties, whereas such a question did not arise if someone was not allowed to meet any person.\n\nPTI’s Aamir Dogar argued that the five PTI lawmakers who had gone to meet Imran Khan in jail were denied entry, describing the denial as a breach of privilege.\n\nMr Qaiser also protested over the non-inclusion of his private member bill granting the right of appeal to the civilians convicted by military courts before a high court.\n\nLaw Minister Tarar acknowledged that the bill was being vetted by the law ministry, stating that the government could also bring a similar bill. The minister also reiterated the talks offer from the government, stating that “dialogue is the beauty of democracy”.\n\nHe said the confrontation would produce no result, and political issues must be settled by the politicians themselves.\n\nPTI’s Iqbal Afridi also hit out at the speaker over his alleged failure to protect the lawmakers who were last year picked up by the law enforcement agencies personnel from the premises of the Parliament House.\n\nAs soon as the opposition members staged a walkout, the speaker started taking up the agenda, which included the introduction and passage of the bills, including those moved by the PTI members.\n\nThe speaker expressed his surprise to see Riaz Fatyana and other PTI members back in the house only to move their bills. They said that they had staged “a token walkout” and that they had come back with the permission of the party to introduce their bills.\n\nThe National Assembly passed five bills, including the Legal Prac­titioners and Bar Councils (Amend­ment) Bill, 2025; the National Institute of Health (Re-organisation) (Amendment) Bill, 2025; the Acid and Bum Crime Bill, 2024; the Reservation of Special Seats for Deserving Persons in Universities Bill, 2024; and the Zakat and Ushr (Amendment) Bill, 2025. These bills, many of which had already passed through the Senate, were approved by the assembly.\n\nThe house also saw the introduction of 16 bills, including a Constitution amendment bill seeking the creation of “a separate province within Punjab, comprising two divisions, namely Faisalabad and Sahiwal, calling it “West Punjab”. This is the first time that such a bill has been introduced in the parliament, as the house has been discussing the formation of South Punjab and Hazara provinces for many years.\n\nThe other bills introduced in the assembly included the Public Interest Disclosures (Amendment) Bill, the Guardians and Wards (Amendment) Bill, the Prevention of Obscenity and Indecency in Digital Media Bill, and the Multi-Vendor Electricity Distribution Bill.\n\nLater, speaking on points of order, several PPP lawmakers from Sindh, including Nabeel Gabol from Lyari, protested over long power outages in various parts of Sindh, especially Karachi.\n\nThe National Assembly will meet again today (Wednesday) at 11am.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:35:51.216Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930573/boycotting-pti-members-return-to-na-join-legislative-business",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:30.000Z"
}
