{
  "title": "Global leaders warn ‘genocide’ unfolding in Gaza Strip - World - DAWN.COM",
  "author": null,
  "content": "LONDON/STRAS­BOURG: The Elders group of international stateswomen and statesmen for the first time on Tuesday called the situation in Gaza an “unfolding genocide”, saying that Israel’s obstruction of aid was causing a “famine”.\n\n“Today we express our shock and outrage at Israel’s deliberate obst­ruction of the entry of life-saving humanitarian aid into Gaza,” the non-governmental group of public figures, founded by former South Africa president Nelson Mandela in 2007, said in a statement after delegates visited border crossings in Egypt.\n\n“What we saw and heard underlines our personal conviction that there is not only an unfolding, human-caused famine in Gaza. There is an unfolding genocide,” it added.\n\nHelen Clark, former prime minister of New Zealand, called on Israel to open the Rafah border crossing between Egypt and Gaza so aid could be delivered, after visiting the site.\n\nCouncil of Europe cautions on weapons sale to Israel\n\n“Many new mothers are unable to feed themselves or their newborn babies adequately, and the health system is collapsing,” she said.\n\n“All of this threatens the very survival of an entire generation.” Clark was joined by Mary Robinson, former president of Ireland and former UN High Commi­ssioner for Human Rights, on the visit. She said that international leaders “have the power and the legal obligation to apply measures to pressure this Israeli government to end its atrocity crimes”.\n\nWeapon sales to Israel\n\nThe Council of Europe urged its member states on Tuesday to halt deliveries of weapons to Israel if they could be used for human rights violations. Michael O’Flaherty, the Council’s commissioner for human rights, said member states should do “their utmost to prevent and address violations of international human rights” in the conflict.\n\n“This includes applying existing legal standards to ensure that arms transfers are not authorised where there is a risk that they may be used to commit human rights violations,” he said, in a statement.\n\nIt was also “essential to intensify efforts to provide relief to those affected by the conflict, by supporting efforts to ensure unhindered access for humanitarian assistance and by pressing for the immediate release of hostages”, O’Flaherty said.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689bc5651e2a6.jpg",
  "retrievedAt": "2025-08-16T07:35:18.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930584/global-leaders-warn-genocide-unfolding-in-gaza-strip",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:48.000Z"
}
