{
  "title": "Asif storms into World Games snooker semi-finals - Sport - DAWN.COM",
  "author": null,
  "content": "CHENGDU: Pakistani snooker star Mohammad Asif maintained his flawless run at the World Games, defeating Britain’s Zac Cosker 2-0 on Tuesday to advance to the semi-finals here at the Civil Aviation Flight University’s Tianfu Campus Gymnasium.\n\nThe four-time IBSF title holder, who triumphed in Bahrain just last month, asserted his dominance from the outset of the first frame. Asif showcased a masterful combination of precise potting, highlighted by a 51-break, and tactical safety play, securing the frame 79-15. The 42-year-old was even more clinical in the second frame, applying relentless pressure to win 81-39 and seal a comprehensive victory.\n\n“This wasn’t just about winning; it was about making a statement,” Asif told APP following the match. “When you reach this stage, every opponent is world-class. I’m looking forward to making a podium finish and giving a gift to my nation on Independence Day,” he added.\n\nThis victory marks Asif’s third consecutive win in Chengdu without dropping a single match, following earlier successes against China’s Liang Xiaolong and Germany’s Alexander Widau.\n\nMeanwhile, Pakistan’s squash prospect Noor Zaman concluded his World Games campaign as the plate event runner-up after a courageous but ultimately abbreviated final against South Africa’s Dewald van Niekerk.\n\nBattling visible illness and fever, Noor displayed tremendous grit in the opening games, narrowly losing 10-12 and 8-12. After falling behind 0-2, he made the difficult decision to retire, prioritising his health.\n\n“Noor gave everything he had despite being unwell,” Pakistan coach Fahim Gul told APP. “His fighting spirit in those first two games, while running a fever, shows his champion mentality. Health comes first, and we’re proud of his silver medal.”\n\nCoach Fahim indicated that their late arrival in Chengdu hindered their ability to properly acclimatise to the conditions, which adversely impacted their preparation for the event.\n\nGERMANY, ARGENTINA SECURE BEACH HANDBALL GOLD\n\nMeanwhile on Tuesday, Germany and Argentina bagged the men’s and women’s beach handball titles, respectively.\n\nGermany overcame Portugal 8-6 in a penalty shootout to claim gold in the men’s event. Portugal won the first period 21-18, but Germany bounced back, winning the second period 19-18, tying the match 1-1 to force the decisive shootout.\n\nThe Argentina women’s team triumphed in a shootout 7-2 against Germany, staging a comeback after dropping the first period 20-14. In the second period, Argentina took a 22-12 lead, forcing penalties before sealing the victory.\n\nElsewhere, China claimed its first ever para ju-jitsu title at the Global showpiece on the last day of the ju-jitsu competition.\n\nChina’s Li Yucai and Guo Ao won the mixed duo para physical, defeating Germany’s Ales­sa­ndro Schober and Christine Jahn by 167-162 in the final.\n\nHungary’s Tamara Toros stunned the arena by dethroning women’s 63kg champion Sung Ki-ra 2-0 in the semi-final, before claiming the women’s open gold over Israel’s Meshi Rosenfeld by submission.\n\nGermany’s Nike Hunecke and Julia Paszkiewicz took gold in the mixed duo para visual, edging China’s Wang Wenqiang and Pan Tianyou 149-143.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689bbb5d6ecfe.gif",
  "retrievedAt": "2025-08-16T07:35:24.988Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930543/asif-storms-into-world-games-snooker-semi-finals",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:41.000Z"
}
