{
  "title": "Fierce Senate showdown over PTI lawmakers’ convictions - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Opposition warns against using courts to target political opponents; labels convictions a ‘travesty of justice’\n• Law minister says disqualification is automatic after conviction unless overturned on appeal\n\nISLAMABAD: The Senate on Tuesday witnessed heated exchan­ges between the treasury and opposition benches over the “hasty convictions and disqualifications” of lawmakers affiliated with PTI.\n\nThe opposition warned against the use of courts as a weapon against political opponents, while the government advised the convicts to seek legal recourse.\n\nPTI parliamentary leader in the House, Barrister Syed Ali Zafar, was the first to question what he termed a wave of convictions and instant disqualifications of political opponents “without due process of law.” Rejecting the hasty convictions as a travesty of justice, he regretted that courts were being used as a weapon to hand down sentences to PTI lawmakers, leaders, and workers.\n\nAmid chants of “shame, shame” from the opposition benches, he lamented that leaders of the opposition in both houses of parliament, as well as the Punjab Assembly, had been convicted in “false and fabricated” cases. He also criticised the Election Commission of Pakistan (ECP) for hastily disqualifying lawmakers convicted through controversial verdicts of anti-terrorism courts (ATCs).\n\nReferring to Article 63(1) of the Constitution, Mr Zafar argued that the ECP cannot disqualify a member convicted by a trial court till the sentence attains finality. He noted the article had been interpreted in nine Supreme Court judgements. The PTI leader questioned the urgency behind process, saying it was ‘a conspiracy’.\n\nHe also referred to Article 10-A of the Constitution, which ensures the right to a fair trial and due process of law. He said the convictions without due process of law were meant to silence those who spoke truth, as the government was scared of the people’s voice.\n\nHe further said the issue was neither a matter of an individual, nor a party, but about the opposition’s role in democracy, warning such actions would harm the democratic system.\n\nHe said that opposition is not an enemy of the government as in democracy both the government and opposition work jointly to serve people, with opposition’s criticism helping improve government’s performance.\n\n“When the roots of a tree start decaying, the branches die,” he remarked, cautioning the treasury benches that if the “vicious cycle” continued, they too could face similar treatment in the future.\n\n“Those at the helm can show the door to elected representatives thro­ugh illegal means, but they cannot de-notify the will of the people,” he added.\n\nHe made it clear that the opposition’s protests inside and outside parliament would continue, warning, “As you judge, so shall you be judged.”\n\nProtest by treasury benches\n\nThe remarks of PTI parliamentary leader in the House, Barrister Syed Ali Zafar, sparked a protest from the treasury benches. Law Minister Azam Nazeer Tarar, res­ponding to Mr Zafar’s speech, said any conviction entailed disqualification, which remained in effect unless set aside or suspended by a court of law.\n\nHe explained that once a lawmaker was convicted, disqualification was automatic, and the ECP merely announced it. “The only mechanism available to convicted lawmakers is to file an appeal. This is how the judicial system works. This is how we should behave and move forward,” he stated.\n\nParliamentary Leader of the PPP in the House, Senator Sherry Reh­man, said her party never allowed political arrests when in government.\n\n“Even after signing the Charter of Democracy (CoD), no political arrests were made during any government except the PTI,” she said.\n\nPTI leader Azam Swati, who along with Mashal Yousafzai took oath as a senator, urged party leaders and workers to accept convictions, disqualifications, and hardships without compromising on the principles laid down by Imran Khan.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:35:57.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930576/fierce-senate-showdown-over-pti-lawmakers-convictions",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:30.000Z"
}
