{
  "title": "Competition Appellate Tribunal cuts fine on flour mills to Rs35m - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Competition Appellate Tribunal (CAT) has reduced the penalty imposed by the Competition Commission of Pakistan (CCP) on the Pakistan Flour Mills Association (PFMA) for its involvement in wheat flour price-fixing, cutting the fine from Rs75 million to Rs35 million.\n\nThe CCP had launched an inquiry in 2019 after reports emerged of an unusual spike in wheat flour prices nationwide.\n\nIt later found that the PFMA had violated Section 4 of the Competition Act 2010 by fixing prices, sharing commercially sensitive information, and collectively determining production quantities — conduct deemed a horizontal agreement with anti-competitive objectives.\n\nFollowing its investigation, the CCP imposed the maximum statutory penalty of Rs75m. However, the PFMA challenged the decision before the tribunal, which, after reviewing the record and hearing arguments from both sides, decided to reduce the fine to Rs35m.\n\nThe CCP’s counsel had argued that Sections 4(1) and 4(2)(a) of the Act prohibit any agreement among undertakings or trade associations aimed at fixing prices, stressing that PFMA’s repeated price instructions undermined the commercial autonomy of individual mills.\n\nCCP briefs finance minister on sugar cartelisation\n\nReiterating the CCP’s stance, Chairman Dr Kabir Ahmed Sidhu warned trade bodies against using their platforms for collusion or sharing sensitive pricing data. He reaffirmed the Commission’s commitment to maintaining fair competition across sectors.\n\nSugar cartel\n\nMeanwhile, Finance Minister Muhammad Aurangzeb was briefed on the CCP’s enforcement efforts and regulatory challenges in the sugar sector, including ongoing investigations into previous episodes of cartelisation and price manipulation.\n\nDuring a meeting with senior CCP officials, the minister was informed that the Commission is finalising its recommendations for the Sugar Sector Reform Committee. These include analyses of market disruptions during 2008-09, 2015-16, and 2019-20, along with proposals to enhance oversight and transparency.\n\nThe briefing covered key enforcement actions, notably the CCP’s 2021 order imposing a Rs44bn penalty on the Pakistan Sugar Mills Association (PSMA) and more than 80 sugar mills for alleged cartelisation. That order was later set aside by the tribunal on procedural grounds, with a directive for rehearing after ruling that the casting vote of the then CCP chair in a 2-2 split decision was not permissible under the Competition Act 2010.\n\nFresh hearings are scheduled for 22–25 September, following a delay due to legal counsel’s unavailability during the Supreme Court’s summer recess. The CCP informed the minister that a comprehensive legal and procedural strategy has been prepared for the rehearing.\n\nMr Aurangzeb expressed the government’s full support for the CCP’s mandate, pledging to facilitate the expeditious conclusion of legal proceedings and reinforce the Commission’s operational capacity. He stressed that competitive markets are vital for transparency, efficient pricing, and consumer protection.\n\nThe meeting also reviewed pending litigation, market regulation mechanisms, and institutional reforms needed to ensure fair competition across the economy.\n\nPublished in Dawn, August 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/14092748c071639.jpg?r=092758",
  "retrievedAt": "2025-08-16T07:35:32.991Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930563/competition-appellate-tribunal-cuts-fine-on-flour-mills-to-rs35m",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T00:05:36.000Z"
}
