{
  "title": "Terrorists blow up a gas pipeline in Lakki Marwat: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Terrorists on Wednesday blew up a gas pipeline in Khyber Pakhtunkhwa’s Lakki Marwat district, resulting in a suspension of gas supply to Punjab, police said.\n\nLakki Marwat police spokesperson Aamir Khan told Dawn.com that the terrorists detonated explosives planted on the pipeline within the limits of the Bhana Manjiwala area of the district.\n\n“Officials have initiated a search operation in the area to locate the culprits,” he said.\n\nHe added that the explosion resulted in a large crater at the site, leading to a complete halt of gas supply from the district to Punjab’s Mianwali region.\n\nFollowing the explosion, a large contingent of police and a bomb disposal squad arrived at the scene and began a search operation in the surrounding area.\n\nPolice officials noted that the location had previously experienced three similar attacks on the main transmission gas pipeline.\n\nIn July, a gas pipeline leading to Punjab was also blown up near the Wanda Amir area of Lakki Marwat, causing a similar suspension of supply. Later in the month, a gas pipeline was blown up with explosives for the fourth time in a month in the Torwah area, causing significant damage to the pipeline.\n\nTwo similar incidents had occurred previously in June. Early in the month, alleged terrorists targeted a key gas pipeline from the Bettani Gas Field to Punjab. Subsequently, a pipeline was blown up again with an improvised explosive device near the Jabbarkhel area, within 10 days of the previous incident.\n\nLakki Marwat has long been a hotspot for terrorism and violence, with unrest dating back to the early 2000s. While security operations brought a period of relative calm, militant activity has resurged in recent years, straining local peace efforts and heightening fears of renewed instability.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/13143338d5ab760.jpg",
  "retrievedAt": "2025-08-16T07:34:23.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930649/terrorists-blow-up-a-gas-pipeline-in-lakki-marwat-police",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T09:50:22.000Z"
}
