{
  "title": "Indonesia suspends TikTok registration over data sharing - World - DAWN.COM",
  "author": null,
  "content": "JAKARTA: Indonesia has suspended TikTok’s registration to provide electronic systems after it failed to hand over all data relating to the use of its live stream feature, a government official said on Friday.\n\nThe suspension could in theory prevent access to TikTok, which has more than 100 million accounts based in Indonesia.\n\nAlexander Sabar, an official at Indonesia’s communications and digital ministry, said in a statement some accounts with ties to online gambling activities used TikTok’s live stream feature during national protests.\n\nProtests rocked the world’s third-largest democracy over exorbitant lawmaker allowances and police brutality from late August to September. TikTok temporarily suspended its live feature during the protests, saying this was intended to “keep TikTok a safe and civil space”.\n\nA TikTok spokesperson said on Friday the company respects the laws in the markets it operates in, adding it is working on the issue with the digital ministry.\n\nSabar said the government had asked the company for its traffic, streaming and monetisation data. The company, owned by China’s ByteDance, did not provide complete data, citing its internal procedures, Sabar said without giving further detail.\n\n“So the communications and digital ministry deemed TikTok to have violated its obligations as a private electronic provider,” and suspended its registration, he said. The regulation regarding the list says every company that has signed up to Indonesia’s licensing rules must hand over its data to the government for the purpose of supervision or risk being blocked.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0408235138b97f5.webp",
  "retrievedAt": "2025-10-16T20:41:55.797Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946475/indonesia-suspends-tiktok-registration-over-data-sharing",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:48.000Z"
}
