{
  "title": "Rain likely in parts of Sindh, Balochistan today as ‘Shakhti’ intensifies into severe cyclonic storm: PMD - Pakistan - DAWN.COM",
  "author": null,
  "content": "Light to moderate rain was likely in parts of Sindh and Balochistan on Saturday as cyclonic storm ‘Shakhti’ over the Arabian Sea had moved westward during the past 12 hours and further intensified into a “severe cyclonic storm”, the Pakistan Meteorological Department (PMD) said.\n\n“It is likely to move west-southwestwards and reach northwest and adjoining central north Arabian Sea by Oct 5, then it will recurve and move east-northeastwards during subsequent 24 hours and weaken gradually,” a notification issued by the PMD said.\n\nIt said that under the influence of the storm, wind/thunderstorm and light to moderate rain was likely today in Sindh’s Badin, Thatta, Sujawal and Jamshoro districts, and Balochistan’s Hub, Lasbela, Awaran and Kech districts, as well as at isolated places in Karachi Division.\n\nThe notification stated that sea conditions were likely to remain “rough to very rough” with squally winds gusting 55 kilometres/hour near the Sindh coast. It also advised fishermen not to venture into the deep sea till Sunday.\n\nThe department further said that sea conditions were likely to remain very rough to high, then very high over central North and the North Arabian Sea during the next 36 hours. Thereafter, very rough to high around the system centre, it said.\n\n“The PMD’s Cyclone Warning Centre, Karachi is monitoring the system and will issue the updates accordingly,” it added.\n\nZoom Earth’s radar also denoted Shakhti as a “severe cyclonic storm” with a speed of 100km/h as of 11am. According to former chief meteorologist Dr Sardar Sarfaraz, regional cyclones are assigned names according to a list prepared by a 13-country panel.\n\nA separate PMD alert issued for Karachi Division stated that the storm now lay south-southwest at a distance of about 390km from Karachi and was likely to move west-southwards.\n\n“Isolated drizzle likely to occur in Karachi Division today. Hot and dry weather likely to prevail [in] most parts of the province,” it said.\n\nThe alert predicted partly cloudy and humid weather with chances of isolated drizzle for Saturday (today), partly cloudy and humid weather for Sunday and mostly sunny and humid weather on Monday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/04142849e0dac0b.webp",
  "retrievedAt": "2025-10-12T13:07:42.387Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946529/rain-likely-in-parts-of-sindh-balochistan-today-as-shakhti-intensifies-into-severe-cyclonic-storm-pmd",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T08:47:46.000Z"
}
