{
  "title": "Indonesia school collapse death toll rises to 17, dozens still missing - World - DAWN.COM",
  "author": null,
  "content": "The death toll in an Indonesian school collapse rose to 17 on Saturday, officials said, as rescuers deployed heavy machinery to recover dozens more victims believed still buried under the rubble.\n\nPart of the multi-storey boarding school collapsed suddenly on Monday as students gathered for afternoon prayers.\n\nRescuers retrieved two bodies and a body part from the rubble today, bringing the death toll to 17, National Search and Rescue Agency (Basarnas) operation director Yudhi Bramantyo said in a statement.\n\n“The evacuation process is still ongoing. Debris removal is focused to the north side in an area not integrated with the main structure,” Yudhi said.\n\nLocal search and rescue agency head Nanang Sigit confirmed the updated toll in a separate statement.\n\nEarlier today, authorities said they had recovered nine bodies on Friday.\n\nRescuers were searching for 49 people still missing, National Disaster Mitigation Agency (BNPB) chief Suharyanto said before prior to the retrieval of the latest bodies.\n\nMore victims could be found, said Suharyanto, who, like many Indonesians, only goes by one name, as rescuers brought heavy machinery to clear locations where the victims were believed to be buried underneath the rubble.\n\n“After the last victim was found last night, we are focusing on a massive cleanup, with heavy equipment entering the collapsed areas,” he said, as reported by broadcaster Kompas TV.\n\nThe school collapse was so violent that it sent tremors across the neighbourhood, according to residents.\n\nInvestigators have been looking into the cause of the collapse, but initial signs pointed to substandard construction, experts have said.\n\nThe rescue operation was complex because vibrations in one place could affect other areas, officials said.\n\nBut the families of the missing agreed on Thursday for heavy equipment to be used, after the 72-hour “golden period” for the best chance of survival came to an end.\n\nThe rescue operation was complicated by an earthquake that struck overnight on Tuesday, briefly halting the search.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/04192637dd618fc.webp",
  "retrievedAt": "2025-10-12T13:07:40.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946565/indonesia-school-collapse-death-toll-rises-to-17-dozens-still-missing",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T14:27:20.000Z"
}
