{
  "title": "Former SBP governor Ishrat Husain calls Islamic banking ‘economic necessity’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A book titled Unconventional — The Bank No One Saw Coming by Sibtain Naqvi on the success story of Meezan Bank was launched at a local hotel here on Friday evening.\n\nDelivering the keynote address, former State Bank of Pakistan (SBP) governor Dr Ishrat Husain commended the author for spending five years on putting together material for the book.\n\nHe said it’s an honour and privilege for him to reflect on a journey that not only transformed an institution but has reshaped the contours of Pakistan’s financial landscape.\n\nSharing the lessons that he’s learned from the bank, he said he’d divided them into three parts: (a) as a model for the banking industry; (b) as a pioneer in Islamic banking; (c) and leadership and human resource development.\n\nDr Husain, commenting on the first part, said starting from ground zero in 2002, the bank has risen from one of Pakistan’s top financial institutions in a remarkably short span. It has outpaced its competitors, a clear reflection of its exceptional performance.\n\nSibtain Naqvi’s Unconventional — The Bank No One Saw Coming launched\n\nHe said in the world of corporate leadership, we often see two archetypes: “We encounter those who are brilliant strategists but falter in execution, and those who are operationally sound but lack a clear sense of direction. Rarely do we find a leader who embodies both. Irfan Siddiqui is one such rarity… Professionalism, meritocracy and integrity are the cornerstone of trust in building any institution. When nepotism and favouritism creep in, they erode this very ethos that sustains excellence.”\n\nWith respect to the second lesson, Dr Husain said before he joined the SBP, he was intellectually convinced that Islamic banking was not just a religious imperative, it was an economic necessity.\n\n“Conventional banking places the entire burden on the borrower. Islamic banking, by contrast, introduces sharing, equity and fairness. It is not merely a financial model, it is a moral framework. Islamic banking has the potential to derive financial inclusion, alleviate poverty, support small farmers and invest in human capital… Unlike capitalism which often leads the marginalised behind or socialism which collapses under its own weight, Islamic finance offers a balanced path.”\n\nMoving on to the leadership and human resource development aspect, he said let’s not forget leadership is not a solo act, it’s a symphony. The progress the bank has achieved would not have been possible without the devoted team work of its staff. “What sets them apart is not just competence, it is conviction driven by a sense of mission, not a 9 to 5 mentality. Their commitment to embedding Islamic banking is nothing short of inspirational.”\n\nDr Husain in conclusion said the bank’s journey is not just a case study, it is a blueprint of how vision, values and execution can come together to build not just a successful institution but a movement.\n\nSpeaking on the occasion, Mr Naqvi, the author, said it was an honour for him to write the history of an institution that has reshaped the financial industry in Pakistan. “I first heard of Meezan as a student at IBA when my finance teacher was discussing interest-free loans. As a student it was completely new. The idea that a bank would lend without charging interest was unfathomable.”\n\nHe said during the 2008 financial crisis when the financial giants of the world crumbled, Islamic banks came through largely unscathed. “It made me realise that Islamic banking was not just a religious choice but a sound business decision.”\n\nHe said the bank’s rise was inevitable. Traders, shop owners and professionals trusted its name. “Clearly, something extraordinary was happening.”\n\nHe added Meezan Bank’s Irfan Siddiqui’s story was inseparable from that of the bank’s.\n\nApart from the speeches, there were two panel discussions lined up for the audience with talks by Irfan Siddiqui and incumbent SBP Governor Jameel Ahmad.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e0568feee88.gif",
  "retrievedAt": "2025-10-16T20:41:40.449Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946426/former-sbp-governor-ishrat-husain-calls-islamic-banking-economic-necessity",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:53.000Z"
}
