{
  "title": "Jamaat won’t allow govt to recognise Israel, says Naeem - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Jamiat Ulema-i-Islam-Fazl and Jamaat-i-Islami on Friday staged rallies across Khyber Pakhtunkhwa against Israeli attack on Global Sumud Flotilla, a humanitarian convoy carrying food and medical supplies for besieged Palestinians in Gaza, calling it an act of blatant hostility to humanity, and also warned of foiling any attempt to recognise the Zionist state.\n\nIn the provincial capital, JUI-F arranged a protest in Namak Mandi. Senior party leaders, including Maulana Amanullah Haqqani, Asif Daudzai and others condemned the Israeli aggression against the flotilla and the so-called 20-point peace plan announced by US President Donald Trump.\n\n“We would never allow the government to betray the Palestinian cause by accepting Israel,” JI central emir Hafiz Naeemur Rehman said, while addressing protesters in Mansehra district.\n\nHe warned that JI would resist such an attempt of recognising Israel. “If such an attempt is made, we will foil it with our full might,” he said.\n\nJI, JUI-F rallies condemn Israeli assault on aid flotilla\n\nMr Rehman, while addressing a crowd of over 20,000 youth, including women, at Thakra Stadium, urged youth to acquire education in modern disciplines to help Pakistan become a developed and prestigious nation.\n\nSpeakers at the other JI rallies said that the attack, carried out by the Israeli navy in international waters, violated international law and demanded immediate release of all flotilla participants, including former senator Mushtaq Ahmad Khan, who was arrested along with other humanitarian activists.\n\nAddressing demonstrators outside the US Consulate in the provincial capital, JI provincial secretary general Sabir Hussain Awan, and Peshawar emir Bahrullah Khan said over 80,000 Palestinians, including women and children, were killed and over 100,000 injured or disabled.\n\nThey accused US President Trump of serving as the chief facilitator of Israeli Prime Minister Benjamin Netanyahu, blaming Washington for the ongoing violence in Gaza.\n\nJI leader Abdul Wasi warned that Pakistan’s support for a ‘two-state solution’ contradicted the vision of Mohammad Ali Jinnah. “From day one, Israel has been an illegitimate state in our view,” he said, adding that attempts to recognise Israel would spark mass protests across Pakistan.\n\nParallel rallies were staged in Charsadda, Mardan, Swabi, Khyber, Mohmand and Nowshera, Chitral, Lakki Marwat and Battagram districts, where local JI leaders, joined by traders and civil society members, denounced Israel’s actions.\n\nIn Charsadda district, JUI-F organised a protest rally against Israeli aggression and occupation of the Global Sumud Flotilla.\n\nAddressing the protesters at Farooq Azam Chowk, JUI-F general secretary Dr Elahi Jan, Maulana Jamil Ahmed, Maulana Amjad Ali, Haq Nawaz, Syed Haleem Shah Bacha and others said Israel had become the biggest rogue state in the world today, which had stained its hands with the blood of innocent Muslims.\n\nThey said the Israeli prime minister was the murderer of more than 70,000 Palestinian people, including children, but even the so-called champions of human rights had remained criminally silent on this atrocity.\n\nThe speakers further said the path of Israeli barbarity can only be stopped by the unity of Muslim countries.\n\nIn Lower Dir, rallies were staged in Timergara, Chakdara and Samarbagh. The protesters were carrying placards and banners, and chanted anti-Israel and pro-Palestine slogans.\n\nThey criticised Washington for vetoing the UN Security Council’s ceasefire resolution and termed Pakistan’s reported nomination of Donald Trump for a Nobel Prize ‘shameful.’\n\nThe protesters demanded immediate release of former senator Mushtaq Ahmad and other flotilla members.\n\nIn Swabi, a protest demonstration was held in the district headquarters — the home town of former senator Mushtaq Ahmad. The protesters demanded of the human rights organisations, the UN and international community to play their due role in Ahmad’s release.\n\nJI’s district emir Maulana Murad Ahmad said under a well-crafted strategy, the US supported Israel policies against Palestinians and other Muslim countries.\n\nIn Bajaur, protesters termed the Israel’s attack on global flotilla an open act of terrorism, and urged the international community to play its role in ensuring the detained persons’ safe release.\n\nIn Mohmand, JUI-F and JI held protests in Mian Mandi and Ghalanai bazaars against Israel’s attack on the Global Sumud Flotilla.\n\nJUI-F workers also staged a demonstration in Bajaur.\n\nBesides workers, people from different walks of life attended the rally in large numbers held in Nawagai Bazaar.\n\nJUI-F local head Maulana Abdur Rasheed and others condemned the Israel’s massacre of Gaza people.\n\nA protest rally was held at the Ataliq Bridge in Chitral city, jointly organised by Jamaat and JUI-F, where the speakers condemned the Israeli aggression against flotilla and the atrocities committed against unarmed Palestinian people.\n\nAddressing the gathering, JI emir Wajihuddin, JUI-F emir Maulana Abdul Shakoor, former district nazim Maghfirat Shah, and others said Israel’s state terrorism and human rights violations were unacceptable in any way.\n\nProtest demonstrations were also held in lakki Marwat, Bannu and Karak districts to express solidarity with the Muslims of Gaza and to condemn the attack on Gaza-bound flotilla by Israeli forces.\n\nA joint protest demonstration was held in Battagram, which was attended by workers of Jamaat, JUI-F and Pakistan Tehreek-i-Insaf.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e033c0a1ea5.jpg",
  "retrievedAt": "2025-10-12T13:07:55.193Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946373/jamaat-wont-allow-govt-to-recognise-israel-says-naeem",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:05:16.000Z"
}
