{
  "title": "Cotton output rebounds 49pc - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: The country is witnessing an unexpected and remarkable surge in cotton production, prompting the government to announce the creation of the Pakistan Cotton Board (PCB), which will lead a comprehensive strategy for the sector’s revival.\n\nAccording to data released by the Pakistan Cotton Ginners Association (PCGA) on Friday, cotton arrivals at ginning factories across the country have surged significantly, as of Sept 30. Cotton production has increased by a record 49 percent compared to the same period last year, with a total of 3.044 million bales of seed cotton (phutti) arriving at the factories. Sindh led the charge with 1.907m bales, marking a 45pc rise, while Punjab recorded 1.136m bales, reflecting a 56pc increase.\n\nSajid Mahmood, Head of the Technology Transfer Department at the Central Cotton Research Institute in Multan, noted that the latest figures have alleviated earlier concerns about lower production in the season.\n\nDuring this period, textile mills purchased 2.410m bales, and exporters bought 95,000 bales. As of now, 540,000 unsold bales remain in ginning factories. Ginning activity has also seen a significant uptick, with a record 265 factories now operating in Punjab (up from 171), and 236 in Sindh (up from 221).\n\nGovt forms board to steer crop revival plan\n\nDespite challenges such as floods, water shortages, and heavy rains in both Sindh and Punjab, the overall situation remains positive. Mahmood commented, “While heatwaves, unusual rains, and floods have inflicted considerable damage in several districts of South Punjab, the overall production outlook remains strong. In Punjab alone, 162,000 acres were affected, while in Sindh, 57,552 acres of cotton were damaged.”\n\nHowever, discrepancies persist between the cotton data released by the PCGA and the Punjab Crop Reporting Service (CRS), which reported a cotton production figure of 2.650m bales for Punjab by Sept 30.\n\nMahmood also reflected on the significant decline in domestic cotton production over recent years, noting that the country’s total production had dropped dramatically from 14.8m bales to just 5.5m bales last year.\n\nIn a bid to ensure long-term growth, the government is taking a major step with the establishment of the Pakistan Cotton Board (PCB), which Deputy Prime Minister Ishaq Dar will lead. The Ministry of National Food Security and the All Pakistan Textile Mills Association (Aptma) have been tasked with developing a comprehensive “Pakistan Cotton Plan 2026” aimed at significantly boosting production. The PCB is expected to be funded through the Cotton Cess, a move that has raised some concerns.\n\nWelcoming the initiative, Cotton Ginners Forum Chairman Ihsanul Haq expressed reservations about certain aspects of the plan. He highlighted significant gaps in the preliminary information surrounding the Pakistan Cotton Plan 2026, particularly regarding the lack of provisions for crop zoning laws and upgrades to the Meteorological Department, both of which he views as essential to the sector’s revival.\n\nHaq also emphasized the role of sugarcane cultivation in cotton-growing areas as a major obstacle to improving both cotton production and quality. He explained that sugarcane cultivation causes environmental pollution, which in turn degrades the quality of cotton lint and cottonseed oil.\n\nIn contrast, areas such as Balochistan and Cholistan, where sugarcane cultivation is minimal, consistently produce higher-quality cotton that commands a premium price due to its greater length and strength.\n\nHe concluded by stressing that the revival of domestic cotton production would be impossible without addressing the sugarcane issue in key cotton-growing regions.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e066e2f0194.gif",
  "retrievedAt": "2025-10-16T20:41:55.765Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946442/cotton-output-rebounds-49pc",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:36.000Z"
}
