{
  "title": "Sindh police seek more details from British authorities about Range Rover stolen in UK, spotted in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh police have requested Interpol and the British police to share the detailed log of a tracker fitted in a high-end vehicle reported stolen from the United Kingdom and recently spotted in Karachi.\n\nThe black Range Rover Sport was stolen on Nov 11, 2022 from Harrogate, UK, and in February this year, with the help of its tracker, it was located in Karachi on Korangi Road.\n\nLater, Interpol sent a letter to the Federal Investigation Agency (FIA) in Islamabad, the Karachi police and the Anti-Vehicles Lifting Cell (AVLC), alerting them about the stolen vehicle.\n\nTalking to Dawn on Friday, Inspector General of Police Ghulam Nabi Memon said that the Interpol’s letter was received two days ago at the office of AVLC SSP.\n\n“We have sent an email to the UK police and asked them to send us a detailed log of the tracker fitted in the vehicle,” he said.\n\nInterpol says the SUV was last tracked on Korangi Road in February\n\nThe IGP said that the police also sought the source of the active location of the vehicle from the tracker, as the vehicle was last spotted in Karachi on Feb 11, 2025.\n\nAccording to the Interpol’s letter, the black Range Rover Sport was stolen from UK on November 11, 2022. The vehicle was fitted with a tracker, and it was last spotted in Leeds, where it was lost.\n\nIt said that the UK police requested cooperation from Pakistani authorities to trace and locate the vehicle.\n\nEarlier in 2022, another luxury vehicle, Bentley Mulsanne, stolen from the UK was recovered from Karachi after a British intelligence agency tracked down the exact location of the car and informed Pakistani authorities.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:41:41.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946425/sindh-police-seek-more-details-from-british-authorities-about-range-rover-stolen-in-uk-spotted-in-karachi",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:53.000Z"
}
