{
  "title": "BNP suspends its lone Balochistan MPA for defying party line - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan National Party (BNP) has suspended the party membership of its sole member in the Balochistan Assembly, Mir Jahanzeb Mengal, for two months.\n\nAccording to a statement issued by the party, the decision was taken due to Mr Mengal’s unsatisfactory response to an earlier show-cause notice, his continued violations of party policies, and his failure to represent the party’s stance in the provincial assembly on the Mines and Minerals Act.\n\nThe statement said Mr Mengal abstained from the assembly session instead of opposing the act and supporting the party’s narrative, which amounted to evading his responsibility.\n\nMr Mengal was elected MPA from Wadh constituency in a by-election after Sardar Akhtar Mengal resigned from the provincial seat and retained his National Assembly seat following the 2024 general elections, in which he had won both seats. The party had awarded its ticket to Jahanzeb Mengal, who won the by-election with a majority of votes.\n\nThe BNP has described the Mines and Minerals Act as legislation aimed at depriving the people of Balochistan of ownership of their resources and betraying the sacrifices of their forefathers.\n\nThe party has already rejected the act and its proposed amendments, saying it undermines the fundamental rights of the Baloch and Pashtun people.\n\nThe statement stressed that Balochistan’s resources are a matter of life and death for its people and that any negligence or silence on this issue is unacceptable.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0411232978a4390.webp",
  "retrievedAt": "2025-10-12T13:08:19.537Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946447/bnp-suspends-its-lone-balochistan-mpa-for-defying-party-line",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:28.000Z"
}
