{
  "title": "Pension shake-up: Finance ministry enforces new contribution rules - Business - DAWN.COM",
  "author": null,
  "content": "• Employees to pay 10pc, govt 12pc\n• Pension liabilities rise to Rs1.055tr in 2024-25, driven by armed forces pensions\n\nISLAMABAD: With some discretionary changes, the government announced on Friday that federal employees will contribute 10 per cent of their pensionable pay to qualify for a 12pc contribution from the public exchequer under the newly formalised contributory pension fund scheme. The total contribution rate will thus be 22pc, replacing the traditional pension system for new entrants.\n\nThe Ministry of Finance (MoF) published the “Federal Government Defined Contribution (FGDC) Pension Fund Scheme Rules 2024” under the Public Finance Management Act 2019, which regulates the scheme according to the Voluntary Pension System Rules 2005 and Non-Banking Finance Companies and Notified Entities Regulations 2008. These rules supersede an earlier MoF order of August 2024, which had set the government’s contribution at 20pc.\n\nOn Aug 20, 2024, the MoF initially announced the introduction of the contributory pension scheme for new entrants to the civil government and armed forces. At that time, employees were to contribute 10pc of their basic pay, while the government was to contribute 20pc. The new scheme applies to civil employees appointed on or after July 1, 2024, including civilian defence staff, and will extend to armed forces personnel appointed from July 1, 2025, though the latter implementation is pending.\n\nThe government allocated Rs10bn for the pension fund in the 2024-25 budget and Rs4.3bn in 2025-26 to support the new system.\n\nThe scheme was introduced on the advice of international lenders, notably the World Bank, to contain the rising pension liabilities, which the government has described as a growing fiscal risk. It does not apply to existing employees but aims to slow future growth in pension liabilities.\n\nFederal pension expenditure is estimated at Rs1.055tr for 2024-25, up from Rs821bn in 2023-24 — a rise of nearly 29pc in two years. Armed forces pension liabilities account for Rs742bn in 2025-26, up from Rs563bn in 2023-24, an increase of about 32pc. Civilian pension expenditure is budgeted at Rs243bn for the current year, up 6.6pc from Rs228bn in 2023-24, reflecting some savings from reforms.\n\nUnder the new rules, only authorised Pension Fund Managers will manage the employer pension funds. The government, acting as the employer, will contribute 12pc of the employee’s pensionable salary through the Accountant General’s office, which will also ensure proper record-keeping and transfer of contributions.\n\nThe Accountant General will verify pension account details before salary payments and will collect and transfer employer contributions to the designated Employer Pension Fund. Employees will contribute their 10pc share alongside their salary deductions.\n\nEmployees cannot withdraw funds from their pension accounts before retirement. Upon retirement, they may withdraw up to 25pc of their accumulated balance, while the remaining amount must be invested as per the Voluntary Pension System Rules 2002 for at least 20 years or until age 80, whichever comes first.\n\nSalary slips will include detailed information on employee contributions, employer contributions, and total accumulated balances.\n\nThe MoF will ensure annual budget allocations for government contributions and will enter agreements with Pension Fund Managers who support electronic transfer systems. These agreements will include mandatory insurance plans offering death and disability coverage, arranged by the Pension Fund Managers.\n\nTo oversee implementation and monitoring, the MoF plans to establish a Non-Banking Finance Company (NBFC), which will temporarily perform the NBFC’s role until it is formally created.\n\nIn cases of resignation, termination, dismissal, or voluntary retirement, employee entitlements from the pension accounts will be determined by government rules issued from time to time.The new pension fund scheme marks a significant shift from the traditional defined benefit pension system towards a defined contribution model aimed at improving fiscal sustainability while providing retirement security for future government employees.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:42:07.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946440/pension-shake-up-finance-ministry-enforces-new-contribution-rules",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:36.000Z"
}
