{
  "title": "Suspects’ interview by media a grave violation of human dignity: LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court has declared that recording and broadcasting interviews or confessional statements of under-custody suspects by the media is a grave violation of human dignity, privacy, and the right to a fair trial.\n\nJustice Ali Zia Bajwa announced the verdict, allowing a petition filed by a young lawyer as a public interest litigation, challenging the practice of humiliating and exposing individuals in custody through media trials.\n\nThe judge observed that despite being fully aware of their statutory duties, institutions such as the police, FIA, Excise Department, Pemra and PTA had failed to curb the practice.\n\nReports submitted by these agencies admitted that exposing suspects during custody undermined investigations and weakened prosecution cases.\n\nJustice Bajwa, in a strongly-worded ruling, held that “an arrest, however lawful, does not strip the accused of fundamental rights. Neither the cloak of custody nor the zeal of investigation can justify humiliation, public parading, or compelled confessions.”\n\nHe said coerced or publicized confessions amount to persecution, not justice.\n\nThe judge said the Constitution guarantees interconnected rights — including dignity (Article 14), liberty (Article 9), fair trial (Article 10-A), and protection against self-incrimination (Article 13) — that extend to every individual, whether free or in custody.\n\nThe judge termed custodial media interviews as “media trials” that prejudice public perception, erode the presumption of innocence, and damage the credibility of the justice system.\n\n“Trial by media does more than prejudice the right of an accused to a fair trial, it dents the credibility of the entire criminal justice system,” the judge warned.\n\nIssuing a set of directions, Justice Bajwa ruled that no law enforcement agency shall permit or facilitate media interviews of under-custody accused persons, as such exposure gravely tarnishes and compromises their dignity, self-respect, and future course of life.\n\nThe judge said the act constitutes a clear violation of fundamental rights and invites unwarranted public prejudice, declining the very essence of fair trial and due process.\n\nThe judge maintained that any violation of the order will constitute misconduct, and responsible officers will face legal proceedings.\n\nThe judge noted that the heads of investigating agencies shall bear responsibility for ensuring strict compliance and shall not disregard or condone any act of misconduct committed by their subordinates.\n\nJustice Bajwa observed, “It is high time that the role of media be effectively regulated by the competent regulatory authorities to ensure that its unchecked conduct neither transgresses the limits of law nor encroaches upon the fundamental rights, dignity, and liberties of citizens.”\n\nThe judge said the humiliation of citizens at pickets and checkpoints by law enforcement agencies, through their exposure to the media for displaying performance, is condemnable.\n\nThe judge admitted that the law enforcement agencies are empowered to take action against individuals found involved in violation of the law, however, any attempt to secure media attention at the cost of the dignity, respect, or privacy of citizens shall not be permitted.\n\nConcluding the judgement, Justice Bajwa stressed that freedom of expression under Article 19 of the Constitution cannot override the rights of suspects to dignity, fair trial, and privacy.\n\nAdvocate Vishal Riaz, the petitioner, had filed the petition in 2023 challenging the practice of recording interviews/confessional statements of suspects by the mainstream media and vloggers.\n\nThrough an interim order, Justice Bajwa had already restrained public functionaries from exposing under trial/custody suspects to media coverage and ordered the Pemra to ensure privacy of the citizens is not invaded by any person carrying a camera or mic.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:41:26.907Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946403/suspects-interview-by-media-a-grave-violation-of-human-dignity-lhc",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:59.000Z"
}
