{
  "title": "PIA announces nonstop flights from Islamabad to Manchester starting October 25 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan International Airlines (PIA) announced on Saturday that it would resume flights to the United Kingdom from October 25, with nonstop flights from Manchester to Islamabad.\n\nThis comes a day after the Pakistan High Commission in London announced that the national carrier would resume flight operations to the UK this month as PIA received its Foreign Aircraft Operating Permit from the UK Civil Aviation Authority and Third Country Operator approval, but no exact date was given.\n\nPIA announced its “historic return” to British skies with a post on X today, which read: “The wait is finally over! Pakistan International Airlines proudly reconnects Manchester and Islamabad, bringing loved ones closer once again.”\n\nIn yesterday’s announcement, the high commission said flight operations to Manchester would be resumed during the first phase, after which Birmingham and London would follow suit.\n\nIn July, the UK removed Pakistan from its Air Safety List, allowing Pakistani airlines to apply to operate flights in Britain.\n\nThe development came after the UK Department for Transport concluded an aviation security ins­pection at Islamabad Inter­nat­ional Airport on Thursday, declaring Pakistan’s security arrangements “satisfactory and in line with international standards”.\n\nThe national carrier was banned from flying to the European Union, the UK and the United States in June 2020, a month after one of its Airbus A-320s plunged into Karachi’s Model Colony, killing nearly 100 people.\n\nThe ban followed the grounding of 262 pilots whose licences then-aviation minister Ghulam Sarwar Khan termed “dubious”.\n\nThe ban on operating in Europe was lifted in November 2024.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:07:40.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946562/pia-announces-nonstop-flights-from-islamabad-to-manchester-starting-october-25",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T13:36:04.000Z"
}
