{
  "title": "Pakistan set to secure $1bn tranche despite slippages - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Flood challenges, missed revenue targets dominate policy-level talks with IMF\n• FBR, Punjab and Sindh govts under critical scrutiny for missing target, failing to meet cash surplus commitments\n• Power sector shows improved recovery, lower circular debt\n\nISLAMABAD: Pakistan appears well-placed to secure over $1 billion as the third tranche of the Enhanced Fund Facility (EFF) despite some slippages, as the authorities enter policy-level talks with a visiting review mission of the International Monetary Fund (IMF) on Monday.\n\nInformed sources said technical-level discussions had been concluded, indicating that the two sides would need to agree on a couple of waivers during policy-level engagements before wrapping up the review with Finance Minister Muhammad Aurangzeb by the weekend (Oct 9-10).\n\nWhile the power sector has shown unusual performance in terms of improved recovery and a reduction in circular debt — through diversion of fiscal space allocated to subsidies and fresh replacement loans — federal revenues and provincial performance, particularly in promised budget surpluses and agricultural tax collections, have emerged as weak areas.\n\nA combination of additional measures to be worked out over the next four days, along with relaxations in view of flood-related challenges, is expected to pave the way for the conclusion of the second review. This would lead to the disbursement of the next tranche worth over $1bn by early next month, subject to IMF board approval. The global political environment remains favourable for Pakistan, with major voting members backing the country.\n\nAccording to the sources, the Federal Board of Revenue (FBR) and the provincial governments of Punjab and Sindh remain under critical scrutiny. The FBR not only missed the end-June 2025 revenue target by a wide margin but also recorded a similar shortfall in the first quarter of the current fiscal year — about Rs200bn, with a monthly average of over Rs65bn — despite an expansive transformation plan that included, among other things, a large fleet of vehicles.\n\nThe key question now is whether anticipated recoveries from court cases will be enough to bridge the gap or if additional measures will be required at the start of November.\n\nCash surplus commitments\n\nOn the other hand, despite being part of the coalition at the Centre, the Sindh and Punjab governments failed to meet their cash surplus commitments at the close of the last fiscal year, with Sindh even announcing a deficit budget at the outset of FY26. The IMF has used the review to push for corrective measures, as these slippages have also pressured the opposition-led Khyber Pakhtunkhwa government to increase spending for political reasons, despite having so far maintained fiscal discipline.\n\nGiven flood-related demands, the provinces are unlikely to perform better this year, although they are being pressed by the IMF to correct their course. This pressure was reflected in Punjab chief minister’s public outburst on Thursday over being held accountable by the IMF for all financial matters. Punjab is required to deliver a Rs740bn surplus to the Centre, followed by Sindh with Rs370bn, KP with Rs220bn, and Balochistan with Rs155bn.\n\nMoreover, both the federal and provincial governments have struggled to establish a comprehensive mechanism for agricultural tax collection. Given the recent floods, they appear more inclined to seek relaxations and waivers rather than implement the laws they passed last year to meet IMF conditions. The provinces have been attempting to link their budget surpluses to the federal government’s revenue collection performance. Both KP and Punjab have reportedly assured the IMF review mission that they will meet flood-related expenses from their own resources.\n\nAlthough all provinces enacted agricultural income tax laws in time, their actual implementation and collection — scheduled to begin in September-October this year — remains uncertain, particularly due to the ongoing flood situation in Punjab and Sindh. As a result, authorities remain unclear about the extent of support required for flood-affected people, sectors, and infrastructure.\n\nThe dialogue also covered the rising circular debt in the gas sector, partly due to the shifting of liabilities from the power sector. The two sides are discussing benchmarking of the gas sector going forward, focusing on definitions and reporting mechanisms.\n\nSo far, the two sides have been unable to resolve issues related to compliance with the state-owned enterprises (SOE) laws, including matters concerning blue-chip companies under the Pakistan Wealth Fund and governance challenges such as public disclosure of assets and retu­rns of government officials across all tiers and organs of the state.\n\nOverall, the authorities’ programme performance as of end-June 2025 has been mixed, and the outlook requires enhanced efforts. The IMF has reportedly rebuffed the authorities’ push for tax-related relaxations to incentivise the upgrading of ageing refineries — putting at risk around $6bn in fresh investment — on the grounds that such relaxations would be counterproductive to the $1.4bn Resilience and Sustainability Facility (RSF) for climate change.\n\nThe policy to incentivise refinery upgrades had been announced two years ago in consultation with the industry, which was in the process of signing binding contracts when the authorities, under the IMF programme, committed not to grant any tax exemptions.\n\nThe Petroleum Division has argued that existing refineries produce significant environmental hazards during both refining and consumption, creating health risks and contributing negatively to climate conditions.\n\nWhile the government is seeking funds under the RSF for various projects, it has been losing ground domestically due to the continued use of outdated refining technology, a situation it blames on what it describes as the IMF negotiators’ technical misunderstanding and the stance of the finance ministry and FBR.\n\nPakistan has largely met all quantitative performance criteria for end-June 2025 but is lagging in meeting indicative targets and structural benchmarks, which could affect future implementation. Given the biannual reviews of the $7bn EFF and the $1.4bn climate-related RSF, the two sides must agree on both past performance and future implementation prospects.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:07:54.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946466",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:04:16.000Z"
}
