{
  "title": "EPA body okays new Air Quality Index forecasting model in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Technical Committee for Analysis of the Air Quality Index (AQI), under the Environment Protection Agency (EPA), Punjab, has formally approved the agency’s newly developed AQI Forecasting Model, terming it a major scientific advancement in environmental management.\n\nThe meeting, chaired by EPA Punjab Director General Dr Imran Hamid Sheikh, reviewed the system that aims to provide accurate short-term forecasts of air quality conditions across Punjab. Officials say it marks a new milestone in the province’s ongoing efforts to establish a robust network of air quality monitoring stations.\n\nDuring the session, Deputy Director Dr Farieha and Data Analyst Mr Fahad Ahmad from the Strategy & Analysis Wing (SAW) presented details of the forecasting model.\n\nThe system, they explained, relies on primary air quality data collected across Punjab and incorporates international forecasting methodologies to predict air pollution trends with improved accuracy.\n\nCommittee members, including environmental scientists, academics and representatives from relevant institutions, praised the initiative as a vital step toward evidence-based decision-making and policy formulation.\n\nThe panel noted that the forecasting model would not only strengthen the EPA’s scientific capacity but also enable it to issue timely health advisories and coordinated responses to pollution events such as smog.\n\nKey participants included Dr Nusrat Naz, Director (Monitoring, Laboratory & Implementation), EPA, Punjab; Dr Derk Bekker, Head of Environmental Sciences Department, Forman Christian College University (FCCU); Dr Zaeem bin Babar, Assistant Professor, University of the Punjab; Dr Umar Farooq from UET Lahore; Dr Hammad from PCSIR Laboratories; Mr Hassan from the Urban Unit; Ms Fatima Najeeb from the Foreign, Commonwealth and Development Office (FCDO); and Mr Riaz Ahmad, Deputy Director Lab, EPA Lahore.\n\nFollowing detailed deliberations, the committee approved the forecast for the next five days and put forward suggestions for refinement of the model, which the EPA team pledged to incorporate. Members also stressed the importance of comparing EPA’s forecast with other international patterns to ensure reliability and global alignment.\n\nThe committee was constituted under Dr Sheikh, exercising powers granted by the Punjab Environmental Protection Act, 1997.\n\nOfficialsemphasised that the forecasting system is a crucial tool in addressing Punjab’s recurring episodes of smog and its long-term air quality challenges.\n\nPublished in Dawn, October 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/040849227a6ffd0.webp",
  "retrievedAt": "2025-10-12T13:07:55.267Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946393/epa-body-okays-new-air-quality-index-forecasting-model-in-punjab",
  "dateList": "2025-10-04",
  "date_published": "2025-10-04T01:05:00.000Z"
}
