{
  "title": "Investment vital component of economic growth: Hammad Azhar",
  "link": "https://www.app.com.pk/national/investment-vital-component-of-economic-growth-hammad-azhar/",
  "date_published": "2021-10-21T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Federal Minister for Energy, Muhammad Hammad Azhar on Thursday said that investment was a vital component of economic growth and development, especially in developing countries.\nHe said in a statement on behalf of the Prime Minister of Pakistan at the “World Leaders’ Investment Summit”, one of the high level events of 7th World Investment Forum (WIF), said a press release issued by Federal Board of Investment (BOI) here.\nThe 7th WIF is being hosted by the UAE government virtually, in collaboration with United Nations Conference on Trade and Development (UNCTAD) from October 18 to 22.\nWorld Investment Forum is one of the pre-eminent global platforms for policy debate on investment for development.\nHammad Azhar underscored the importance of investment by saying that investment was a vital component of economic growth and development, especially in developing countries and FDI inflows were more necessary now than ever.\nHe pointed that investors require legitimate guarantees to mitigate risks and secure reasonable returns and proposed deployment of public finance as a means to de-risk private investments and said that Pakistan should prioritize investment flows to areas aligned with Sustainable Development Goals (SDGs).\nHe suggested that Multilateral Development Banks (World Bank, Asian Development Bank), Development Aid Agencies and private sector could play a major role to mitigate potential risks and through this approach could create huge impact in terms of human development, poverty alleviation, public health, education, jobs and livelihoods.\nThe minister proposed an integrated sustainable infrastructure facility under the UN umbrella for sustainable infrastructure to harmonize investment policies, provide assistance to developing countries for preparation of project and feasibility studies, and to access financing both from public and private sources.\nHe agreed that developing countries, as recipients of investment flows; need to provide an enabling investment environment and a regulatory framework that is fair and balanced.\nHe further stated that PTI government had made progress on the investment front and that Pakistan had been ranked among the top ten improvers in the World Bank’s Doing Business Report 2020.\nHe also shared that the government had issued Green Bonds and was also exploring options to swap debt for environmental protection related projects.\nHe added that the government was setting up Special Economic Zones and Technology Parks in the country and invited the global investors to avail a range of investment opportunities in infrastructure, energy, communications, technology and other areas in Pakistan.\nSpeaking at the World Investment Forum, International Investment Agreement (IIA) Conference 2021, another high level event of WIF, Secretary Board of Investment (BOI), Ms. Fareena Mazhar underscored that Pakistan was going to re-negotiate all the Bilateral Investment Treaties (BITs) on the new BIT template and that there is a positive initial response received from the BIT partners.\nShe also highlighted that BOI is working on reforming the overall investment policy and legal framework, for which UNCTAD has agreed to assist.\nFareena said that presently, governments around the world were facing pressing and controversial questions relating to their BITs, and were re-thinking their approaches to those agreements as BITs had not been as instrumental in attracting the much-needed FDI as a result unilateral terminations were taking place.\nShe added that Pakistan, with the assistance of UNCTAD and other local and international experts of repute, had developed the new BIT template to allow and protect the genuine and sustainable investments in the country.\nSecretary BOI shared that the Preamble for BIT template includes attainment of SDGs, social inclusion, employment generation, reducing inequalities, poverty alleviation and empowerment, protection of human rights; maintenance of health, labor and environmental standards; and Corporate Social Responsibility; apart from promotion, facilitation and protection of investment.\nFurther elaborating on the new template, she apprised that the new framework has differentiated between a short-term contractor and a long-term investor; a real company and a mail-box or shell company and that Pakistan is committed to protect all the investments of real long-term investors.\nShe further mentioned that the BOI is establishing forums to address grievances before they escalate to disputes and a new dispute resolution mechanism has also been developed.\nApart from local remedies, the investor will also have liberty to approach international arbitral forums, she added.",
  "retrievedAt": "2025-08-11T21:29:54.879Z"
}
