{
  "title": "1869 dengue cases detected so far in allied hospitals, 347,930 sites checked during surveillance",
  "link": "https://www.app.com.pk/national/1869-dengue-cases-detected-so-far-in-allied-hospitals-347930-sites-checked-during-surveillance/",
  "date_published": "2021-10-21T14:06:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Oct 21 (APP): As many as 1869 confirmed dengue cases had been brought to the allied hospitals of the city, out of which 1791 were discharged after recovery, while 56 more cases were surfaced in the last 24 hours.\nDistrict Coordinator Epidemics Prevention and Control (DCEPC) Dr Sajjad Mehmood informed Thursday that presently 98 dengue patients were under treatment in Holy Family Hospital (HFH), out of which 42 were tested positive, eight positive out of 12 in Benazir Bhutto Hospital(BBH) and 28 confirmed cases out of the total 49 admitted in District Headquarters Hospital(DHQ),” he added.\nDr Sajjad informed that HFH had registered 1153 positive cases of dengue fever, DHQ registered 237, while 479 had been registered with BBH.\nHe added that out of the total confirmed cases reported so far,1134 belonged to the Rawalpindi district while the remaining of the other districts included the Federal capital area.\nHe informed that among the 56 new cases reported during the last 24 hours with 23 belonged to the Rawalpindi Cantonment area, six from Pothohar Town, eight from Metropolitan Khan Rawalpindi, three from Chaklala Cantt and one each case arrived from Taxila Cantonment, Gujjar Khan and Murree while the addresses of the remaining cases were not confirmed yet, “he added.\nDr Sajjad that during indoor surveillance from October 13 to 21 in all tehsils of the district and Cantonment areas,263,443 houses were checked and larvae were found at 3837 homes while 408 teams during outdoor surveillance checked 84,487 sites and larvae was located at 121 points.\nHe urged the residents to keep their water tanks clean and not leave any place wet with stagnant water.\nCurrently, he said prevention of the disease was the government’s priority, and the district health administration was working day and night to control the outbreak of the infection.",
  "retrievedAt": "2025-08-11T21:29:58.056Z"
}
