{
  "title": "Tender for 10th avenue to be floated next month",
  "link": "https://www.app.com.pk/national/tender-for-10th-avenue-to-be-floated-next-month/",
  "date_published": "2021-10-21T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Federal Minister for Planning, Development, and Special Initiatives Asad Umar Thursday directed the authorities concerned to complete the 10th avenue road project within a period of 21 months and that the project mush be launched by the end of next month.\nThe minister was chairing a meeting to review progress on water issues of the Islamabad Capital Territory (ICT) region and the development of the 10th Avenue project, where he was informed that the tender for the project of 10th avenue would be floated by mid November 2021.\nThe meeting was attended by Special Assistant to the Prime Minister on CDA Ali Nawaz Awan, MNA Raja Khurram Nawaz, Chairman PCRWR, and other senior officials and departments representatives.\nThe meeting was informed that the alignment of 10th Avenue Phase I from IJP road to Margalla road contains two packages.\nPackage one is from IJP to Srinagar highway which includes 8 bridges, underpasses, and flyovers. While package-II includes Srinagar Highway Interchange and connections with G-9/G-10 sectors.\nFederal Minister for Planning Asad Umar directed in the meeting that the project must be completed within 21 months and both packages must be initiated simultaneously.\nMost importantly, he said this project must be launched by end of November. He further added that the 10th Avenue is a major initiative of the present government for the citizens of Islamabad especially for the residents of I-10 and I-9 who will have direct access to IJP Principle Road and the Srinagar highway road.\nMr. Umar also reviewed the progress on the rainwater harvesting project being implemented by Capital Development Authority (CDA) in collaboration with Pakistan Council of Research in Water Resources (PCRWR).\nDr. Muhammad Ashraf, Chairman-PCRWR and Member, CDA briefed the chair that the drilling work on 25 sites had been started, and by December 2021 a total of 50 sites for grand water recharge wells would have been developed, and under this initiative, the CDA would develop more than 100 recharge wells.\nHousing Authority representatives also informed the meeting that they were working on 25 recharge wells for their Sector G-13. Asad Umar directed them to start work on the rest of the housing sector as well and come up with a comprehensive plan to finalize it at the next meeting.\nAsad Umar appreciated the technical expertise extended by PCRWR and directed CDA and Housing Authority to speed up the work as well as ensure the completion of all the sites by June 2022.",
  "retrievedAt": "2025-08-11T21:30:00.711Z"
}
