{
  "title": "Pakistan committed to IPU’s mission for peace, democracy: President",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-ipus-mission-for-peace-democracy-president/",
  "date_published": "2022-09-13T13:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): President Dr Arif Alvi on Tuesday said that Pakistan would always stand by its commitment to the Inter-Parliamentary Union’s (IPU) mission for peace, democracy, human rights, gender equality and youth empowerment.\nThe president, while talking to President of the Inter-Parliamentary Union Duarte Pacheco, who called on him, at Aiwan-e-Sadr, reiterated Pakistan’s commitment to IPU’s efforts for sustainable development through political dialogue, cooperation and parliamentary action.\nTalking to the delegation, the president said that Pakistan had high expectations of IPU, particularly with regard to playing a key role in the resolution of conflict and upholding human rights in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe expressed the hope that IPU would take notice of the ongoing Islamophobia in India and the increasing persecution and intimidation of Muslims in India.\nWhile discussing the magnitude of recent floods in Pakistan, the president said that the recent devastating floods in Pakistan were a wake-up call to the world to take serious, meaningful and effective measures and actions on war footing to reduce carbon emissions to prevent the devastation caused by climate change in many parts of the world, especially in Pakistan.\nHe deplored that Pakistan was facing the worst impact of global warming despite the fact that it was contributing less than 01% of carbon emissions in the world.\nHe called upon the IPU to take parliamentary action to reduce the negative fallouts of climate change.\nPresident Alvi said that Pakistan alone could not shoulder the gigantic task of rehabilitation of 33 million flood victims and reconstructing millions of houses and vital infrastructure.\nHe appealed to the developed world to come forward and help Pakistan to cope with the devastation caused by global-warming-induced super floods.\nDuarte Pacheco, while offering his sincere condolences on the deaths caused by the floods, expressed his concerns over the destruction of infrastructure in most parts of the country.\nHe said that IPU being a multilateral forum discussed the issues confronted by the world as no single country could resolve the issues faced by it without the collective support of other countries.\nThe delegation was accompanied by Chairman Senate Muhammad Sadiq Sanjrani, Senator Faisal Saleem Rahman and Ambassador of the Portuguese Republic to Pakistan Paulo Neves Pocinho.",
  "retrievedAt": "2025-08-11T15:34:07.528Z"
}
