{
  "title": "Amir Muqam urges literary persons to promote positive thinking among citizens",
  "link": "https://www.app.com.pk/national/amir-muqam-urges-literary-persons-to-promote-positive-thinking-among-citizens/",
  "date_published": "2022-09-13T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Adviser to Prime Minister for Political and Public Affairs and National Heritage and Culture Engineer Amir Muqam on Tuesday urged the literary persons to promote positive thinking among citizens through their writings.\n“It is the national responsibility of literary persons to use the power of their pen to end ignorance and inculcate positive and constructive thinking among the citizens”, he said.\nHe stated this during his visit to Pakistan Academy of Letters (PAL) where the Adviser was warmly received by the Chairman PAL and senior officials of the Academy.\nFederal Secretary National Heritage and Culture Fareena Mazhar was also present on the occasion.\nSpeaking on the occasion, Amir Muqam said that literary activities are indispensable for promotion of peace, tolerance and generosity among the people.\nHe said that PAL should organize more literary activities to promote literature of the country of all national languages.\nAdvisor to Prime Minister also planted a sapling in the lawn of the Academy.\nChairman PAL Dr. Yousaf Khushk and other senior officials briefed the Adviser to Prime Minister about various activities and projects of PAL.\nOn this occasion, Chairman PAL also apprised the Adviser about the endeavors made at academy to promote literary activities in the country.\nAdviser to Prime Minister Engr Amir Muqam also visited the Hall of Fame and Faiz Ahmed Faiz Auditorium.\nChairman and senior officials of PAL also briefed him about the forthcoming projects of the Academy including the launch of the Literary Museum, international literary conference, children international conference and Hafiz Alpuri seminar to be organized Shangla Alpuri.\nEngr. Amir Muqam appreciated the efforts of Academy for the promotion of literature and directed to focus on promoting literature of all national languages.\nThe meeting was attended by senior officials of National Heritage and Culture Division and Pakistan Academy of Letters.\nLater, the Adviser also visited Academy Studio and recorded his short message in the newly established studio of the Academy.",
  "retrievedAt": "2025-08-11T15:34:03.474Z"
}
