{
  "title": "President for fair and egalitarian distribution of science & technology’s benefits for humanity’s development",
  "link": "https://www.app.com.pk/national/president-for-fair-and-egalitarian-distribution-of-science-technologys-benefits-for-humanitys-development/",
  "date_published": "2022-09-13T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): President Dr Arif Alvi on Tuesday stressed the need for ethical and morality-based research and development in biotechnology, agriculture and virology besides fair distribution of its benefits to provide food security to the entire world without discrimination between rich and poor countries.\nHe said that biotechnologies, like gene therapy, CRISPR and Case-9 could be used to understand the human genome as well as to recognize and cure genetic diseases, adding that scientific research and breakthroughs should be shared fairly with the rest of the world to overcome collective woes being faced by the humanity, such as disease, poverty, and food security.\nThe President expressed these views while addressing the inaugural session of the Kazakhstan-Pakistan-Turkiye Youth Forum on Biotechnology, at COMSTECH Secretariat.\nThe inaugural session was attended by members of the scientific and diplomatic community from Iraq, Turkiye, Kazakhstan, Azerbaijan, Nigeria, Morocco, Russia, Jordan and Pakistan, whereas over 800 participants from 35 countries joined the event virtually.\nAddressing the ceremony, the lresident said that the applications of biotechnology in genome editing, new breeding technologies, large-scale genomics and genomic selection in crop and livestock breeding, speed breeding for rapid genetic gain.\nNanotechnology for Agriculture Applications, he said, were affecting many sectors, especially food and agriculture, and could be used to achieve food security and end world hunger.\nHe said that the leadership needed to giveaway linear thinking patterns and put their country on the exponential growth trajectory to remain relevant in the fast-changing world by adopting Artificial Intelligence technology in an ethical manner and preparing their societies to willingly embrace emerging new technologies for making exponential growth.\nHe said that although the entire Muslim world had a large land area, however, either this land remained unutilized or the agriculture yield was very low compared to the developed world.\nThis, he said, had resulted in incidents of food insecurity and consequential political and economic unrest and societal tension.\nHe argued that by developing disease-resistant high-yield crop varieties having the ability to adapt to any given environment, and promoting vertical and hydroponic farming, the needs of people and the rest of the world could be met in compliance with Islamic ethical and moral values based upon solidarity and compassion.\nHe said that the Muslim world should take intellect-driven right decisions at the right time with the passion to set the direction right for their people.\nHe said that the Muslim world should be the first to adopt existing knowledge, generate new knowledge and bring innovation and advancement in every sector to cater to the needs of our present and coming generations.\nThe president observed that we needed to take collective and effective steps to increase the allocation of funds for biotechnology research and development to become an active player and beneficiary of the global agriculture biotechnology market which was anticipated to reach a market value of US$775 billion by 2024 with an annual growth rate of 7.7%.\nThe president said that the Muslim world, during its glory, considered knowledge as a blessing and creation of Allah and shared it with the rest of the world without limitation of copyrights.\nHe said that copyrighting knowledge was like the neo-colonization of precious resources and called upon the young scientists to lead the way to create ethical and morality-based new knowledge with passion and distribute it freely for the benefit of entire mankind.\nThe president underscored that science had provided valuable tools for discerning between facts and mere conjectures.\nHe said that human biases could be overcome by properly analyzing and utilizing the existing data, however, there was a need to take special care to avoid the incorporation of human biases, such as racial biases, in AI-based solutions.\nThe president appreciated the management of COMSTECH for playing a leading role in the promotion of science and technology-based economic development in the OIC region and hoped that the Youth Forum will further contribute to the adoption of the latest biotechnological advancements in its member countries.\nSami Sedar, CEO of the Young Business Hub, Islamic Cooperation Youth Forum from Turkiye while explaining the aims and objectives of the Youth Forum of Biotechnology said that the Youth Forum was aimed at creating a bridge between young scientists of member countries for sharing of their expertise and knowledge.",
  "retrievedAt": "2025-08-11T15:34:09.321Z"
}
