{
  "title": "Azerbaijan says Armenian military holds ‘large-scale provocations’ on its border",
  "link": "https://www.app.com.pk/national/azerbaijan-says-armenian-military-holds-large-scale-provocations-on-its-border/",
  "date_published": "2022-09-13T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Azerbaijan has said that on late Tuesday night, the Armenian military held ‘large-scale provocations’ in the directions of Dashkasan, Kalbajar and Lachin of Azerbaijan-Armenia state border and in response its troops returned the fire.\n“The sabotage groups of the armed forces of Armenia carried out planting landmines on the areas between the positions of the units of Azerbaijan’s army and the supply roads in different directions,” a press release issued by the Azerbaijan Embassy here said.\nIt said the Armenian armed forces also fired intensively at the positions of the Azerbaijani Army in Dashkasan, Kalbajar and Lachin regions with different types of weapons, including mortars and as a result, “there were casualties among the personnel of our armed forces, and damage was inflicted to the military infrastructure.”\nIn order to prevent further provocations by the Armenian armed forces, and “military threats against the territory and sovereignty of our country, definitive retaliatory measures were taken by the units of the Azerbaijani Army,” the embassy said.\nMoreover, it said, “the information disseminated by the Armenian side that Azerbaijan’s Army allegedly targets the civilian population, facilities, and infrastructure does not reflect reality, and is another disinformation spread by the Armenian side.\n“At the same time, Armenia’s increase in militarization along Azerbaijan’s borders, deployment of heavy equipment and large-caliber weapons in the region indicated that Armenia was preparing for a large-scale military provocation.\n“The following aggression of the Armenian side against Azerbaijan is a gross violation of the fundamental norms and principles of international law, as well as the provisions of the trilateral statements signed between the leaders of Azerbaijan, Armenia and the Russian Federation, and the agreements reached between Azerbaijan and Armenia.\n“These steps of Armenia are completely contrary to the ongoing normalization and peace process,” the embassy said and added at the time, when Azerbaijan was carrying out large-scale restoration and construction works in the territories liberated from occupation, Armenia by allowing aggression once again demonstrated that it was hindering the process by all means.\n“Responsibility for the provocation, clashes and losses lies with the military-political leadership of Armenia. Any actions against the territorial integrity and sovereignty of the Republic of Azerbaijan will be resolutely prevented,” the embassy added.",
  "retrievedAt": "2025-08-11T15:34:06.300Z"
}
