{
  "title": "Renewable energy holds potential for Pakistan’s future: PM",
  "link": "https://www.app.com.pk/national/renewable-energy-vital-for-pakistans-future-pm/",
  "date_published": "2022-09-13T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that Pakistan’s future hinged upon the utilization of renewable energy as these alternate resources of energy could help generate inexpensive power.\nDuring a meeting with a delegation of Zonergy Corporation, a Chinese company, the prime minister said the production of low priced-power would also remove the burden of price hike upon the general public.\nHe said that a major chunk of Pakistan’s import bill was being spent upon the import of costly fuel for power generation, and underlined that it was imperative to move towards the utilization of inexpensive energy which would also help in saving of precious foreign reserves.\nHe further informed that a pre-bidding conference on solar energy projects would be held in Islamabad on Wednesday.\nOn the occasion, the Zonergy Corporation delegation also presented a donation cheque for the PM Flood Relief Fund.\nZonergy delegation was led by its Chief Executive Richard J. Guo. Minister for Board of Investment Chaudhry Salik Hussain, Minister for Planning Ahsan Iqbal, Minister for Energy Engineer Khurram Dastagir, Minister for Law Azam Nazeer Tarrar, PM’s Special Assistants Dr Jehanzaib Khan, Zafaruddin Mahmood and Fahad Hussain.\nThe prime minister while appreciating Chinese support on the internal and external fronts said that China was the best friend.\nHe said that China Pakistan Economic Corridor (CPEC) was an extension of the Chinese flagship Belt and Road Initiative under which Chinese investment was made in the construction of infrastructure, industry and in different other sectors.\nThe 300MW Quaid-e-Azam solar power project in Bahawalpur was accomplished in a record period of time and the government was making efforts to promote investment in the renewable energy, especially in solar and wind energy.",
  "retrievedAt": "2025-08-11T15:34:10.379Z"
}
