{
  "title": "PM urges cabinet members to enhance efforts to help flood-hit people",
  "link": "https://www.app.com.pk/national/pm-urges-cabinet-members-to-enhance-efforts-to-help-flood-hit-people/",
  "date_published": "2022-09-13T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 13 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday urged the members of cabinet to come forward to help address the miseries of flood-hit people and enhance the relief and rehabilitation efforts.\nPresiding over the federal cabinet meeting, the prime minister in his televised remarks urged the ministers to put more focus on helping the poor flood-stricken at this critical time besides fulfilling their official duties.\n“In this digital world, you can even do your official work through zoom. But you also have to help those [flood-affected] people as well,” he remarked.\nThe Prime Minister while acknowledging the efforts of those cabinet members, who are active in flood relief activities, said those not active in such efforts should also come forward and help the affected people.\nHe hoped that water in the flood affected areas will recede in two to three months and people will be rehabilitated. “Be it the philanthropists, doctors, police officers, bureaucrats, army, all know what is the situation. Your efforts will be remembered by the flood affected people.”\nThe Prime Minister lamented that the flood affected masses, who also knew the people doing politics at this critical time and were quiet, will respond when the time will come.\nHe said that Pakistan despite its meager contribution in the global emission was facing the huge effects of climate change.\nThe Prime Minister appreciated UN Secretary General Antonio Guterres for visiting Pakistan at the critical time as well as the UN flash appeal of US $ 160 million to help the flood affected people.\nHe said that the UN Secretary General, who also visited the flood affected areas during his visit, urged international community to take practical steps to help Pakistan to mitigate the sufferings of the flood affected people as well as to mitigate the negative effects of climate change.\nThe Prime Minister also praised UN Secretary Antonio Guterres for his empathetic attitude towards the flood-affected people and his views about climate change injustice with Pakistan.",
  "retrievedAt": "2025-08-11T15:34:10.055Z"
}
