{
  "title": "Canadian Sikhs perform mass prayer to support Sept 18 Khalistan Referendum voting",
  "link": "https://www.app.com.pk/national/over-50000-sikhs-perform-prayers-to-support-sept-18-khalistan-referendum-voting/",
  "date_published": "2022-09-13T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Over 50,000 Sikhs performed special prayer in Toronto to support Khalistan Referendum to support the voting for Khalistan Referendum scheduled on September 18 in Toronto.\nThe Ardas mass prayer was offered at Sri Guru Granth Sahib Parkash Purab, Malton, Canada.\nThose who attended the prayer ceremony carried yellow flags inscribed with pro-Khalistan slogans. Men, women and children chanted slogans and vowed to continue the struggle till the creation of Khalistan.\nThe pro-Khalistan advocacy group Sikhs for Justice (SFJ), organiser of the voting, appreciated the mass gathering which supported the objectives of Khalistan Referendum.\nThe Khalistan Referendum voting will be held on September 18 at Gore Meadows Recreation Centre in Brampton but the large-scale activity has already started in full swing.\nSFJ’s Counsel General Gurpatwant Singh Pannun said, “Thousands of Canadian Sikhs congregated at the Ardas to offer their support for the Khalistan Referendum. Since the start of voting on October 31 in London, the momentum for the Khalistan Referendum has been on the increase. What is more heartening is that thousands of young Canadian Sikhs have shown their enthusiasm in the democratic process of Khalistan Referendum.”\nGurpatwant Singh Pannun said the Canadian Sikh community’s response to upcoming 18th September voting was overwhelming and “has caused nightmares to the Modi regime”.\nLast week, Canadian Sikhs have registered a new record in support of the Khalistan movement by taking out a car rally that stretched to several kilometers, consisting of over 2000 vehicles including cars and iconic Canadian trucks.\nKhalistan Referendum campaign — in which Sikhs are asked to answer the question “Should Indian governed Punjab be an independent country?” — has drawn fierce opposition from New Delhi, Indian media and pro-India segments of Non-Resident Indians (NRIs).\nWhile Indian media and NRIs have been voicing their opposition, the Indian government has been pro-actively labelling and equating the unofficial referendum on Khalistan as “terrorism” and has declared SFJ — the proponent of the referendum — as an illegal organisation under the controversial Unlawful Activities Prevention Act (UAPA) of India.\nAhead of September 18, Khalistan Referendum voting in Toronto, pro-Khalistan activists are actively holding truck rallies with Khalistan banners, plastering mega billboards, signs and distributing the promotional material at Gurdwaras in Brampton — the heavily Sikh town around Greater Toronto Area.\nThe voting will take place in the government-owned and operated facility The Gore Meadow Community Centre, Brampton.\nThe Punjab Referendum Commission (PRC), a panel of non-aligned experts on referendums and direct democracy, is supervising the voting procedure to ensure transparency and compliance with international standards of balloting.",
  "retrievedAt": "2025-08-11T15:34:08.657Z"
}
