{
  "title": "Kamal inaugurates MDCAT question bank at PMDC",
  "author": null,
  "content": "ISLAMABAD, Aug 21 (APP):Federal Minister for National Health Services, Regulations and Coordination, Syed Mustafa Kamal has inaugurated the newly developed MDCAT question bank at the Pakistan Medical and Dental Council (PM&DC).\nPM&DC President Prof. Dr. Rizwan Taj briefed the minister on preparations for the upcoming MDCAT Examination 2025.\nThe presentation highlighted measures to ensure transparency, security, and fairness in the national medical and dental entrance test.\nThe minister was informed that PM&DC’s role is confined to registering candidates and providing oversight, while the conduct of the exam, including paper setting, administration, and evaluation, rests solely with the designated public admitting universities.\nOfficials clarified that this arrangement ensures impartiality and merit-based admissions.\nReviewing the preparations, Kamal stressed that no lapses would be tolerated in the MDCAT arrangements.\nHe lauded the creation of the new question bank, calling it a vital step toward reducing errors, enhancing fairness, and strengthening public trust in the evaluation process.\nBriefing the Minister, PM&DC officials said more than 30 examination centers have been designated nationwide, with 97,028 candidates already registered. The number is expected to surpass 150,000 before registrations close.\nThe minister also inspected the online registration and monitoring portal, which incorporates modern digital safeguards to protect the integrity of the exam.\nCommending PM&DC’s efforts, Kamal suggested expanding the pool of questions to allow admitting universities greater flexibility in preparing papers.\nHe emphasized that PM&DC’s primary mandate is to develop a uniform policy framework, while the provinces are responsible for administering the exam transparently.\nHe also underlined the need for PM&DC to become fully digitized, covering all its functions including inspections, registration, and monitoring, in order to enhance efficiency, transparency, and reduce human interaction.\nReaffirming the government’s support, the minister said that reforms in PM&DC would contribute to strengthening both the health and education sectors.\nPM&DC President Dr. Rizwan Taj said that the council has spared no effort in upholding merit and excellence.\nHe said the standardized syllabus-based question bank addresses concerns of regional disparities, providing a level playing field for all candidates nationwide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:39:14.627Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kamal-inaugurates-mdcat-question-bank-at-pmdc/",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T10:21:00.000Z"
}
