{
  "title": "NHA announces open auction for toll plazas on key highways",
  "author": null,
  "content": "ISLAMABAD, Aug 21 (APP):The National Highway Authority (NHA), has officially announced an open auction for the Operations and Maintenance (O\\&M) contracts of 21 toll plazas across the national highways.\nThis auction is for the period ending June 30, 2026, and will be conducted under the supervision of the Finance Wing (Revenue Directorate) of the NHA, said a notification issued on other day.\nThe interested bidders, including individuals, firms, and companies are invited to participate in the process, subject to meeting specific eligibility criteria. These include holding a valid NTN certificate as an active taxpayer, having no outstanding dues (installments or taxes), and not being blacklisted or under arbitration proceedings with any government agency.\nThe list of toll plazas up for auction includes key locations such as Mityari (N-5), Ahmedpur East (N-5), Tarhada (N-130), Shaheed Benazir Bridge, and Sangjani (ETTM) M-15. Each site carries a specified Earnest Money and Net Reserve Price per month, ranging from Rs. 478,500 to over Rs. 46 million. Among them, Sangjani has the highest net reserve price, set at Rs155,150,000 per month.\nThe Request for Proposal (RFP) documents were available free of cost on the official NHA website. A pre-auction meeting is scheduled today, at 11:00 AM at the NHA Headquarters auditorium. The bidder registration will begin the same day and continue until September 3, 2025, at the Revenue Section, NHA HQ, Islamabad. The open auction itself will be held on September 4, 2025, starting at 11:00 AM.\nThe NHA has made it clear that bids lower than the specified net reserve prices will not be considered. Successful bidders will be obligated to fulfill all relevant tax obligations under the applicable law and sign contracts only after clearing all dues with the NHA.\nThis open auction offers a substantial opportunity for the private sector to participate in the operation and toll collection of some of country’s busiest and most strategic highway locations.\nFor further details, interested parties may contact the NHA at 051-9032841, 051-9032819, 051-9032945, or 0315-5192702. More information is also available on the NHA’s official website at http://www.nha.gov.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:39:37.292Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nha-announces-open-auction-for-toll-plazas-on-key-highways/",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T07:23:00.000Z"
}
