{
  "title": "CDA reclaims 210 kanals in anti-encroachment drive at Saidpur Model Village",
  "author": null,
  "content": "ISLAMABAD, Aug 21 (APP):The Capital Development Authority (CDA) has intensified its anti-encroachment drive in Saidpur Model Village, reclaiming 210 out of 370 kanals of illegally occupied estate land, officials said on Thursday.\nThe ongoing operation, carried out on the directions of CDA Chairman and Chief Commissioner Islamabad Muhammad Ali Randhawa, aims to clear the historic village of unauthorized constructions and restore its planned development.\nDeputy Director General Enforcement, Dr. Anam, is supervising the campaign. CDA teams demolished 11 illegal houses and 12 shops using heavy machinery.\n“The Enforcement Wing has been instructed to compile detailed data on all remaining unlawful structures to ensure the complete eradication of encroachments,” the authority said in a statement.\nFederal Interior Minister Mohsin Naqvi visited the site earlier this week to review the progress of both the anti-encroachment drive and beautification works.\nHe directed officials to continue “indiscriminate action against illegal constructions” and announced plans to establish outlets of well-known national food chains in the area.\nAccording to him, the move will not only create employment opportunities but also provide citizens with a new recreational spot, enhancing the beauty of Islamabad.\nThe CDA has urged residents to cooperate with its enforcement teams and to report any cases of illegal occupation.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/08/WhatsApp-Video-2025-08-21-at-21.09.46.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nAuthorities have also assured that the drive will continue until Saidpur Village is fully cleared, enabling its transformation into a “world-class recreational center.”\nThe centuries-old Saidpur Village, nestled at the foot of the Margalla Hills, has long been a popular tourist attraction.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:37:44.598Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-reclaims-210-kanals-in-anti-encroachment-drive-at-saidpur-model-village/",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T16:23:00.000Z"
}
