{
  "title": "Global action needed to tackle climate change challenges: Gilani",
  "author": null,
  "content": "ISLAMABAD, Aug 21 (APP):Chairman Senate Syed Yousaf Raza Gilani on Thursday said the impacts of climate change are being felt worldwide, stressing that addressing these challenges requires collective action and international cooperation.\nHe said that climate change is not only undermining economies but also directly affecting the lives of ordinary people, making global solidarity and practical measures indispensable.\nHe expressed these views while meeting an eight-member students’ delegation from Italy’s Duopassi Foundation, said a news release.\nThe Chairman said that Pakistan’s greatest asset is its youth, with nearly 60 per cent of the population comprising young people.\nHe stressed that the younger generation and institutions must take the lead in addressing contemporary challenges.\nHe also highlighted the role of overseas Pakistanis in strengthening the national economy and underscored the importance of leveraging modern technology to find solutions to pressing issues.\nRecalling his official visit to Italy during his tenure as Prime Minister, Gilani mentioned that the Italian Prime Minister had briefed him on Italy’s efforts to preserve its cultural heritage. On that occasion, he had also shared the historical and cultural significance of Multan with his Italian counterpart.\nThe Chairman underscored that empowering women and minorities has always been among his top priorities. He paid tribute to Shaheed Mohtarma Benazir Bhutto, Pakistan’s first woman Prime Minister, for her pioneering legislation and initiatives for women’s rights.\nHe also acknowledged the contributions of former Foreign Minister Hina Rabbani Khar and former Speaker of the National Assembly Dr. Fehmida Mirza in advancing women’s empowerment.\nHighlighting Pakistan’s potential, Gilani stated that there are vast opportunities for investment in the country.\nHe noted that health and education are sectors particularly close to his heart, as his forefathers also rendered valuable services in these areas. He said that efforts to improve healthcare facilities and literacy rates have been undertaken in the past and continue to this day.\nBriefing the delegation, the CEO of the Duopassi Foundation said that the Foundation is working in critical sectors including health, education, pharmaceuticals, and climate change, and has established partnerships with 17 international universities. She added that consultations were ongoing with a U.S.-based company to address climate change challenges. The Foundation has also initiated projects to combat dengue by eliminating its larvae, setting a target of eradicating dengue within the next 15 years.\nShe emphasised that international funding is essential to address global challenges and called on developed countries to play their role in this regard. She further informed that a global caucus has been established to focus on health, education, and climate change.\nOn this occasion, the Chairman Senate highlighted that Pakistan’s Senate committees are also actively engaged in these sectors.\nThe Standing Committees on Health, Education, Finance, and Commerce are not only legislating but also taking practical measures. He assured the delegation that the Duopassi Foundation could work closely with these parliamentary committees, and the Senate would extend full cooperation.\nAdvisor to the Chairman Senate, Misbah Khar, briefed the delegation on the objectives of the Inter-Parliamentary Speakers’ Conference (ISC), describing it as a dynamic new global platform comprising parliamentary speakers from 45 countries. She informed them that in the recent elections held in Malaysia, Syed Yousaf Raza Gilani was unanimously elected as the first President of the ISC — a recognition of Pakistan’s leadership role in global parliamentary diplomacy.\nShe further shared that the next ISC meeting will be held in Islamabad in November 2025, bringing together parliamentary leaders from across the globe. The conference will deliberate on key global issues such as peace, multilateral cooperation, and sustainable development, while also devising practical strategies and a roadmap to address climate change, regional peace, and prosperity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:38:53.248Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/global-action-needed-to-tackle-climate-change-challenges-gilani/",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T11:52:00.000Z"
}
