{
  "title": "Rising mental health issues due to COVID-19 evoke need for more parks in Capital",
  "link": "https://www.app.com.pk/national/rising-mental-health-issues-due-to-covid-19-evoke-need-for-more-parks-in-capital/",
  "date_published": "2020-10-25T11:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):With a manifold rise in mental health issues following the coronavirus outbreak, the need for more parks and other recreational facilities has increased for the residents of Federal Capital.\nAccording to health experts, parks with their green surface covered with trees and flower beds contribute enormously to the psychological well-being of the humans, who have been adversely impacted by the contagion with limited recreational opportunities and mobility restrictions in place.\nThe number of mental health cases in the Capital had gone up by 100 per cent after the outbreak of COVID-19, compounded with a limited number of parks and green places, which were also in shabby conditions, the experts said. No new park has been built in the urban areas during the last decade while the rural areas are completely deprived of the facility.\n“It is a high time for the city managers to set up more parks and green places in the urban and rural areas of Islamabad to cope with the mental health issues being faced by its dwellers particularly in the wake of coronavirus pandemic,” Raja Khurram Nawaz, a local Member of the National Assembly (MNA), said passionately.\nTalking to APP on Sunday, he said there were over 230 small parks in sectoral areas of Islamabad, which remained deserted to their dilapidated conditions. The situation in rural areas was bleak as not a single park like Fatima Jinnah Park in Sector F-9 had been built there to date, he added.\nHe said the unplanned development in the outskirts of Islamabad left the rural people in the lurch, keeping them deprived of the basic amenities of life. The MNA said the Capital Development Authority (CDA) should follow Prime Minister Imran Khan’s Clean & Green Pakistan vision, and set up new parks and develop green spaces in other than sectoral areas as it had owned sufficient land in those areas.\nHe mentioned encroachment of the state land by miscreants in the rural areas such as Burma and Farash Town. The residents in some areas had even started burying their loved ones in the state land. Khurram said the conversion of state land through green spaces and parks would save it from encroachment and help provide outdoor recreational opportunities to the residents.\nHe, however, expressed the optimism in a revival of the capital’s beauty with the CDA getting key civic departments back from the Metropolitan Corporation Islamabad recently.\n“The CDA chairman has recently assured of carrying out massive beautification work in the urban and rural areas,” he noted.\nCDA Chairman Amer Ali also regretted over unplanned development in the rural areas during the past, with the scope of Authority’s zoning rules and regulations limited to the urban areas only in the past.  He, however, said the civic body would try to build parks and green places in rural areas with the extension of its zoning laws to those areas.\nAmer Ali, who also has the charge of Chief Commissioner Islamabad, was of the view that 234 parks in the urban areas were enough to serve the recreational needs of the residents, but they needed upgradation and massive beautification. He said the upgradation of 50 parks was underway as the CDA had got the Environment Department back from the MCI.\nHe vowed to renovate all the city parks by the year-end, with building at least two public toilets each, in addition to cycling and jogging tracks.\nHe said all the workforce of the Environment Department had been deployed in various sectors for carrying out beautification work. To a query, he said the capital city had 24 sectors, comprising four sub-sectors each. Professor Dr Rizwan Taj, Head of Department of Psychiatry of Pakistan Institute of Medical Sciences, said public parks or play areas played a key role in personality grooming, behavioral order and, physical and mental fitness of human beings.\nThe importance of such spaces in the post-pandemic scenario had doubled as it had disrupted the social life of people and had multi-dimensional affects on the society including economic, business, domestic, educations, and others, he told APP. Dr Rizwan Taj said at present, the PIMS received 70 to 80 patients with corona related anxieties daily as compared to 30 in the pre-COVID times.\nHe mentioned various kinds of the coronavirus mental disorders such as corona induce phobias, corona induce depression, corona induce anxiety, corona induce obsessional disorder and corona induce adjustment disorder. “Bumpy tracks, broken swings and benches, faulty street lights and untrimmed wild bushes along with the walking tracks present only a grim picture of utter negligence,” a resident of I- 8, Alamgir Khan regretted while highlighting the apathy of the department concerned due to which the park in his area was in an abysmal condition.",
  "retrievedAt": "2025-08-11T19:56:21.411Z"
}
