{
  "title": "Awareness to effectively contain COVID-19: Asad Umar",
  "link": "https://www.app.com.pk/national/awareness-to-effectively-contain-covid-19-asad-umar/",
  "date_published": "2020-04-19T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):Minister for Planning, Development, Reforms and Special Initiatives Asad Umar Sunday said creating awareness among people about COVID-19 was necessary to effectively contain the pandemic.\nChairing the National Command and Operation Centre (NCOC) meeting , he said public awareness and education on COVID-19 safety guidelines and preventive measures was the only best possible tool to cope with the menace of coronavirus.\nAsad Umar also highlighted the need to gather feedback on locally manufactured samples of N-95 masks.\nHe said there was need to analyse the capacity of indigenous production of N-95 masks and mull over to the extent for scaling up that production.\nHe suggested to form an inter-ministerial group of relevant ministries with Ministry of Industries as it’s member.\nThe minister mentioned that there was also need to find gap between the guidelines and impart policy after through discussion whereas guidance would be sought from the Ministry of Health in this regard.\nHe also asked Chairman NDMA to apprise the meeting about the medical equipment imported and the strategy adopted for its disbursement.\nThe minister also asked the Ministry of Information and Broadcasting, Ministry of Health and Inter Services Public Relations (ISPR) to devise guidelines for patients placed under quarantine. It needs to be developed before Ramazan.\nMinister for Interior Brig (R) Ejaz Shah, Minister for Energy Omar Ayub, Minister for Industries Hammad Azhar, Minister for Food Security Fakhar Imam and Minister for Economic Affairs Khusroo Bakhtiar, Special Assistant to the Prime Minister on National Security Dr Moeed Yusuf, Prime Minister’s focal person for COVID-19 Dr Faisal Sultan and NCOC chief coordinator Lieutenant General Hamood Uz Zaman also expressed their views during the meeting.",
  "retrievedAt": "2025-08-11T19:07:26.199Z"
}
