{
  "title": "Govt introduces hoarding Ordinance to ease common man following coronavirus: Farogh",
  "link": "https://www.app.com.pk/national/govt-introduces-hoarding-ordinance-to-ease-common-man-following-coronavirus-farogh/",
  "date_published": "2020-04-19T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):Federal Minister Law and Justice Barrister Dr. Farogh Naseem on Sunday said that the government had promulgated an ordinance against hoarding of essential commodities amidst spread of coronavirus to protect the interest of a common man.\nThe new ordinance contained three-year sentence, summary trial and confiscation of the material for hoarding of wheat, sugar, flour, ghee, sanitizers, face masks and other essential items, he said while addressing a press conference here at PID Islamabad along with Parliamentary Secretary on Law and Justice Mulaeka Bokhari.\nThe minister said that the government had also prepared an Anti-Smuggling Ordinance to stop the smuggling of dollars and essential commodities like wheat and sugar through the undeclared routes. The Ordinance had been sent to the office of prime minister for vetting. This law was likely to be promulgated by Monday or Tuesday, he said. The minister said that stern actions would be taken against those involved in smuggling essential items.\nHe said that no one would be allowed to take advantage of the current prevailing situation in wake of coronavirus. He said that though customs would be a focal department to stop this practice, however, Federal Board of Revenue (FBR) would be authorized to dedicate powers to any state institution like Intelligence Bureau (IB) Inter Services Intelligence Bureau (ISI) and Military Intelligence (MI) to seek their assistance against smuggling.\nThe federal minister said that district administrations had been made bound to also share available information pertaining to any act of smuggling or hoarding to the relevant institution to take action against it. A copy of this information would also be sent to secretary law and justice who would view the actions taken by the department concerned on it, he maintained.\nStern action, he said, would also be taken against the officers for showing negligence on the matter. The minister said that changing could be introduced in Ordinance in extraordinary situations if necessary.\nThe minister said that a summary trial against the culprits would be initiated in accordance of the law, adding that the judges for the summary trial would be appointed with the consultation of chief justice of Pakistan.\nHe said that his ministry was introducing laws keeping in view the current situation on directives of Prime Minister Imran Khan to safeguard the interest of a common man.\nBarrister Farogh said that COVID-19 was a global pandemic and it was need of hour to work collectively to defeat this menace. All provinces should work together with the federal government in current situation, he maintained.\nThe minister said that the only way to tackle pandemic COVID-19 was precautionary measures, adding that Pakistani people were aware and educated in this regard.\nEarlier, Farogh Naseem said that Ministry of Law and Justice had resolved a total of 60,649 cases during twenty months which was a ratio of 99 percent. His ministry had been working round the clock during last several days to prepared ordinances against hoarding and smuggling, he said.\nSpeaking on the occasion, Parliamentary Secretary for Law and Justice Mulaeka Bokhari said that these laws were manifestation of the vision of Prime Minister Imran Khan and fulfillment of the PTI’s manifesto. She said the hoarding and anti-smuggling laws would bring ease in the life of the common people.",
  "retrievedAt": "2025-08-11T19:07:29.757Z"
}
