{
  "title": "Buzdar visits various areas to monitor implementation of govt’s steps",
  "link": "https://www.app.com.pk/national/buzdar-visits-various-areas-to-monitor-implementation-of-govts-steps/",
  "date_published": "2020-04-19T10:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 19 (APP):Punjab Chief Minister Sardar Usman Buzdar on Sunday undertook visit of various areas of Lahore without protocol.\nHe took round of different markets and main roads without security. Usman Buzdar himself drove vehicle and took stock of partial lockdown situation.\nHe monitored latest situation relating to government steps being implemented by visiting Shahra-e-Aiwan-e-Tijarat, Shahra-e-Quaid-e-Azam, Shadman, Jail Road and other areas.\nThe CM stopped his vehicle at few check posts and commended police personnel for vigilantly performing their duties.\nHe also viewed closure of different markets and bazaars.\nUsman Buzdar paid tributes to trader community for fully implementing government steps with regard to closing down markets and bazaars.\nHe further complimented that trader community had performed its national duty by fully ensuring implementation on government decision in this hour of distress and difficulty.\nThe CM appreciated that law enforcement personnel were diligently performing their duties on roads, market places and bazaars.\nUsman Buzdar appealed to the masses to remain inside their homes so as to protect themselves from coronavirus and should not get out of their houses without genuine need or reason.\nThe CM also expressed his anger and displeasure over presence of extra traffic on few roads and directed concerned officials to convince citizens at check posts to stay at their houses for personal protection.\nUsman Buzdar underscored that government had taken preventive measures in order to safeguard lives of the masses. He hailed that Prime Minister Imran Khan after taking into account ground realities and current situation had taken excellent decisions in the best interests of the country and nation.\nUsman Buzdar vowed, “We are standing by the masses in this time of trial and tribulation and my every moment is devoted to save the masses from coronavirus pandemic.”",
  "retrievedAt": "2025-08-11T19:07:28.293Z"
}
