{
  "title": "President, Ulema played laudable role in issuance of joint declaration: Dr Firdous",
  "link": "https://www.app.com.pk/national/president-ulema-played-laudable-role-in-issuance-of-joint-declaration-dr-firdous/",
  "date_published": "2020-04-19T06:58:00.000Z",
  "source": "APP",
  "content": "SIALKOT, April 19 (APP):Special Assistant to Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan has hailed the issuance of a joint declaration by the President Dr Arif Alvi and the Ulema regarding holding the prayers in the mosques during Ramzan.\nDr Firdous while talking to the newsmen here on Sunday said that the President Dr Arif Alvi and the Ulema were playing laudable role in combating coronavirus pandemic. She said that government would ensure the early implementation on joint declaration between government and the Ulema regarding prayers during Ramzan.\nSAPM Dr Firdous urged the Ulema to continue playing their role in promoting anti coronavirus awareness among the people besides performing their religious obligations and duties in the motherland.\nPrime Minister Imran Khan was successfully fighting against the coronavirus pandemic and the whole of the nation was standing with him, SAPM said, adding that “Nation must be united to battle against coronavirus”.\nShe said that the COVID-19 testing capacity would be increased up to 20,000 tests on daily basis by the end of this month.\nSAPM said that the government was providing financial assistance through ‘Ehsaas Cash Emergency Programme’ saying that and the programme reflected Prime Minister Imran Khan’s vision toward poor and deprived segment of the society.\nShe said that “Prime Minister Imran Khan proved that he feels the pain of masses and takes keen interest in providing relief to them.”\nShe said that the smooth, easy and transparent distribution of money to the deserving people was the important part of the ‘Ehsas Emergency Cash Programme’, as the government was giving this emergency financial assistance to all the deserving people purely on merit.\nDr Firdous Ashiq Awan said that the government would announce maximum financial relief for the small shopkeepers and businessmen, adding that “Stern legal action against all the profiteers and hoarders who are trying to get advantage of the prevailing hard time and situation in the wake of COVID-19 pandemic will be taken.”\nShe said that the government would purchase wheat in more than a bulk quantity keeping in view the future needs of Pakistan in prevailing coronavirus pandemic scenario.\nShe said that government was giving special subsidy of billions of rupees on 19 different daily used commodities at the Utility Stores across the Pakistan.\nSAPM Dr Firdous sid that the government was ensuring the self-protection of the doctors and paramedics busy in battling against coronavirus. She highly hailed the frontline role of the doctors and the paramedics in battle against coronavirus.",
  "retrievedAt": "2025-08-11T19:07:21.250Z"
}
