{
  "title": "AJK president warns about looming human disaster in IOJK",
  "link": "https://www.app.com.pk/national/ajk-president-warns-about-looming-human-disaster-in-iojk/",
  "date_published": "2020-04-19T05:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):Regretting the complete silent of the United Nations over the happenings in the Indian-occupied Jammu and Kashmir, the Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has warned of the catastrophic outcome of the situation rapidly developing in the disputed region.\nHe made these remarks while addressing as chief guest at “The Kashmir Video Conference” organized by Tehreek-e-Kashmir UK.\nChaired by President Tehreek-e-Kashmir UK (Tek-UK) Fahim Kayani, the conference was attended by more than 50 office bearers of TeK from 20 different cities of the United Kingdom through a video link.\nThe AJK president said Indian Occupied Jammu and Kashmir (IOJK) was under a double lockdown – a punitive, crushing siege since August 5 last year, and now the coronavirus lockdown. “While the world is fighting coronavirus, the occupation troops are killing the Kashmiri youth in the so-called cordon and search operations and then posthumously and falsely accuse them of militancy,” he added.\nSardar Masood Khan lamented that thousands of prisoners arbitrarily detained, including teenagers and children were rotting in cramped concentration camps and jails in the occupied territory and India. The Indian government had ignored appeals of six international human rights organizations for the release of these prisoners who had arbitrarily taken under unlawful laws, he underlined.\nHe said the COVID-19 patients in IOJK were not being given proper support or care. Restrictions on high-speed internet were increasing the number of corona patients. Doctors, nurses, paramedics were under server stress.\nThe AJK president said early this month, the Indian Government, in the dead of night, furtively, had introduced new domicile rules that would give permanent residence to Hindus from India to reduce Muslim majority in the territory to a minority.\n“This is a sinister move to take away Kashmiris’ jobs, livelihoods, land and educational privileges,” he said and pointed out that it was a brazen step toward land grab, colonisation and establishment of illegal settlements in a UN-recognized disputed territory and a sheer violation of the Fourth Geneva Convention, ICC Statute, and the Security Council resolutions on Kashmir.\nHe regretted that the Organisation of Islamic Cooperation had condemned the Indian move but powerful nations are silent. Even traditional allies of the people of Jammu and Kashmir had no time to speak up.\nStrongly condemning the unprovoked Indian shelling on the civilian population along the Line of Control in Azad Kashmir, Sardar Masood Khan said the use of artillery and mortar weaponry by the Indian troops had caused huge damages to lives and infrastructure.\n“Since January this year, India has violated the Line of Control nearly 800 times while the picture in IOJK is dismal and it is getting darker by the day,” he added.\nThe AJK president urged the Diaspora communities in the UK and Europe to mobilize the British parliamentarians and the All-Party Parliamentary Group on Kashmir to call out India for its actions which constitute war crimes, crimes against humanity, ethnic cleansing and genocide.\n“We are one big global family, and we cannot allow such brazen trampling of human rights of a people who only want justice,” he stressed.\nIt was the first online video Conference on the Kashmir issue in the United Kingdom and the participants of the conference shared their views on the current situation of Indian occupied Jammu and Kashmir and how Kashmiri and Pakistani diaspora can become the voice of voiceless people of Indian occupied Jammu and Kashmir during the lockdown in Europe.\nThe Tehreek-e- Kashmir UK has decided to launch the campaign titled Justice for Kashmir. In this campaign, emails will be sent to British MPs, The United Nations, International media and human rights organisations.",
  "retrievedAt": "2025-08-11T19:07:22.658Z"
}
