{
  "title": "US ambassador calls on Balochistan CM",
  "link": "https://www.app.com.pk/national/us-ambassador-calls-on-balochistan-cm/",
  "date_published": "2023-11-20T11:27:00.000Z",
  "source": "APP",
  "content": "QUETTA, Nov 20 (APP): US Ambassador to Pakistan Donald Blome along with Consul General Karachi Conrard Trrible called on Caretaker Balochistan Chief Minister Mir Ali Mardan Khan Domki at the CM Secretariat on Monday.\nDuring the meeting, Chief Minister Domki said that the mineral-enriched Balochistan province was the best region for foreign investment.\nHe said the ongoing US assistance projects in Balochistan in peace, education, women’s economic development and communication sectors would have a lasting impact.\nThe United States, he said, had contributed significantly to the education sector, especially the girls’ education.\nSimilarly, he added, the provision of vehicles and modern equipment to the Balochistan Police would help government efforts for countering terrorism, crime prevention and investigation processes on modern lines.\nThe project of providing business opportunities to empower the women of Balochistan was also of extraordinary importance for the development of women, he said.\n“Long-lasting diplomatic and bilateral relations are established between Pakistan and the United States,” the CM said, urging the need for increasing the volume of trade between the two countries.\nAmbassador Blome, on the occasion, said the relations between Pakistan and the US based on mutual respect were moving in a better direction.\n“I have always found the people of Balochistan hospitable and sincere, whenever visited the province,” he said, adding he had also met the Baloch parliamentarians in Islamabad.\n“Currently”, the envoy said, Balochistan was represented in two major key positions, ie, PM House and Senate in Pakistan, which was important for the development of the province.\nAbout the US assistance projects in progress, he said, “We are working on peace and justice projects in Balochistan and Khyber Pakhtunkhwa, and sustainable social development is part of our goals.”\nThe United States and international organizations continued their unflinching support during the last year’s floods that hit parts of Baloshistan and Sindh, he maintained.",
  "retrievedAt": "2025-08-11T10:36:09.290Z"
}
