{
  "title": "JUI-F decides to actively participate in next general elections",
  "link": "https://www.app.com.pk/national/jui-f-decides-to-actively-participate-in-next-general-elections/",
  "date_published": "2023-11-20T12:44:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 20 (APP): The Central General Council meeting of JUI-F on Monday decided to actively participate in the upcoming general elections and directed its district organizations to forward final recommendations of candidates on National and Provincial Assembly constituencies till 27th of current month.\nThe Two-day meeting of the Central General Council of JUI-F concluded at Mufti Mahmood Markaz with JUI-F Central Ameer, Maulana Fazalur Rehman in the chair.\nBesides, central secretary general Maulana Abdul Ghafoor Haideri, Akram Khan Durrani, Maulana Qamaruddin, Maulana Fazal Ali Haqqani, Mohammad Aslam Ghauri, Maulana Amjad Khan Lahori, Mufti Rozi Khan, Maulana Abdul Wasi (Ameer JUI-F Balochistan), Maulana Mahmood Shah (general secretary), Maulana Abdul Qayyum Halijvi (Sindh), Maulana Rashid Mahmood Soomro (Sindh), Hafiz Naseer Ahrar, Mufti Mazhar Asaadi (Punjab), Senator Maulana Atta-ur-Rehman (Ameer JUI-F KP), Maulana Atta-ul-Haq Darwaish (general secretary KP), Maulana Attaullah Shahab (Gilgit-Baltistan), Maulana Saeed Yousaf (Azad Kashmir),Senator Kamran Murtaza advocate, Hafiz Hussain Ahmad, Engineer Zia-ur-Rehman and Hafiz Hamdullah, former members National and provincial assemblies and members of the general council from across the country, attended the meeting.\nIt elected Maulana Fazalur Rehman and Maulana Abdul Ghafoor Haideri as central Ameer and general secretary of the party for another five-year tenure.\nThe meeting also authorized district chapters of the party to work out seat adjustment with other political parties in consultations with office bearers. During the meeting, Maulana Fazalur Rehman briefed the participants about his meetings during the visit to Qatar.\nThe provincial organizations of the party presented performance and political situation-based reports over which the central general council expressed satisfaction.\nThe meeting, while expressing profound concern over the atrocities of Israel against innocent Palestinians and daily incessant bombardment on hospitals, schools and civilian population, announced to observe the upcoming Friday (November 24)( as Solidarity Day with Palestinians.\nIt decided to take out solidarity rallies with Palestine in district headquarters across the country.\nAddressing the concluding session, Central Ameer JUI-F, Maulana Fazalur Rehman said they would participate in the general elections, despite specific reservations.",
  "retrievedAt": "2025-08-11T10:36:05.213Z"
}
