{
  "title": "Pakistan Pavilion at Singapore Fintech Festival showcases innovation, collaboration",
  "link": "https://www.app.com.pk/national/pakistan-pavilion-at-singapore-fintech-festival-showcases-innovation-collaboration/",
  "date_published": "2023-11-20T17:51:00.000Z",
  "source": "APP",
  "content": "SINGAPORE, Nov 20 (APP): The annual Singapore Fintech Festival (SFF), a global congregation of fintech firms, witnessed a significant representation from Pakistan with a 62-member delegation of fintech companies attending the event.\nHosted by Invent Global, an exhibition experience provider, the Pakistan Pavilion was inaugurated by\nHigh Commissioner and Deputy Governor of the State Bank of Pakistan (SBP) Saleem Ullah.\nThe pavilion showcased seven fintech companies including Red Buffer, Vizz Web Solutions, Dimensional Sys, EastRiver, Botwa Fintech, E.ocean and Emblem.\nThe Bank of Punjab-sponsored Sprint Pakistan Hackathon’s three finalists, Investors Lounge, Digi Khata and Dukan.pk were provided complimentary booths by SFF at the Talent Zone.\nThe festival, attended by more than 62,000 participants and 10,000 organizations from 134 countries, featured key addresses by global financial leaders. Kristalina Georgieva, Managing Director of the International Monetary Fund (IMF), delivered a keynote speech focusing on advancements in the international digital finance sector. Tharman Shanmugaratnam, the President of Singapore, engaged in a fireside chat discussing the rise and challenges of AI trends in Singapore, while the President of the World Bank, Ajay Banga, concluded the event with his closing speech.\nThe festival also provided unique opportunities for Pakistan to engage with global leaders in the fintech space.\nThe high commissioner hosted a networking dinner at Pakistan House, attended by top leaders from the Monetary Authority of Singapore, Singapore Fintech Association, Apix Singapore, Global Fintech Institute, and major banks including HSBC, Standard Chartered, and OCBC.\nThis dinner facilitated networking between Pakistani entrepreneurs and their Singaporean counterparts, as well as high-ranking tech executives.\nAdditionally, notable events included Dr. Sara Saeed, CEO of Sehat Kahani, sharing her success story at the prestigious “Founders Peak” and the Deputy Governor of SBP participating in a discussion at the Regulators Stage, sharing Pakistan’s experience in financial crimes prevention.\nPakistan fintech delegation visited and networked at Google, Meta and Stripe offices, arranged by the High Commission for exclusive networking and knowledge-sharing sessions. Deputy Governor SBP also visited and met with the Vice President of Meta, Singapore.\nThe UK-based Centre for Finance, Technology and Entrepreneurship hosted a lunch for Deputy Governor SBP, HBL team and the High Commissioner to explore courses on financial technologies and entrepreneurship for Pakistani bankers/finance professionals.\nParticipation of the Pakistani fintech delegation in the Singapore Fintech Festival 2023 and events on the sidelines was a significant milestone for the promotion of innovation and collaboration between Pakistan and the global fintech industry.\nIt showcased the growing strength and potential of the Pakistani fintech sector on a global stage.",
  "retrievedAt": "2025-08-11T10:35:52.054Z"
}
