{
  "title": "Citizens of age group 17-18 years eligible for COVID-19 vaccination: Dr Faisal",
  "link": "https://www.app.com.pk/national/citizens-of-age-group-17-18-years-eligible-for-covid-19-vaccination-dr-faisal/",
  "date_published": "2021-08-24T09:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):Special Assistant to Prime Minister on National Health Services, Regulations and Coordination, Dr Faisal Sultan Tuesday said that citizens of age group 17 and 18 years would be allowed to get COVID-19 vaccine from September 1st.\nAddressing a press conference, Dr Faisal said that with this decision all young people of this age group will be eligible for vaccination against coronavirus, who were earlier not included in the list of eligible for vaccination.\nHe said that the government would soon start vaccination for age group 15-16 years and they would be allowed to get vaccinated. He added the date in this regard would be announced soon.\nHe said that those Immunocompromised citizens of age 12 years and above would get special recommended COVID-19 vaccine on mega vaccination centers. He said their medical record would be maintained.\nSimilarly, he said those Pakistanis who want to travel abroad and they need specific vaccine as per respective country’s requirement, now would be able to get such vaccine. He added this vaccine would be allowed not on the basis of medical ground but for their traveling requirement.\nHe said that for this purpose they have to show their visa of respective country while this vaccine would be allowed on nominal charges. He said this category would be allowed for vaccination from September 1st.\nHe said that payment would be charged only in this category as the government wants to facilitate all those students or businessmen or tourists who want to visit abroad, but they are facing hurdles due to not having required vaccination.\nHe added further details of this category would be shared soon by the ministry for awareness of general public.\nDr Faisal said that the government has started consideration to initiate booster after six month of second shot to above 50 year frontline healthcare workers. He said after consultation this booster was likely to start from October 1st.\nHe added there was also plan to start booster to Immunocompromised persons after six month of their second dose.\nHe said that National Command and Operation Center (NCOC) has developed a mobile app with the support of National Database and Registration Authority (NADRA) to provide vaccine certificate at their mobile after submitting required details.\nHe added foreign vaccinated Pakistanis can also get their vaccine certificate at NADRA website from August 26. He added people can download valid vaccination certificate from NADRA website.\nHe said that the government has taken serious notice of matter of fake vaccination certificate and crackdown has been initiated against those involved in this crime. He said strict action has been launched through FIA and police.",
  "retrievedAt": "2025-08-11T21:07:32.968Z"
}
