{
  "title": "Fresh barbarism in IIOJK has exposed India: APHC",
  "link": "https://www.app.com.pk/national/fresh-barbarism-in-iiojk-has-exposed-india-aphc/",
  "date_published": "2021-08-24T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):All Parties Hurriyat Conference has expressed its deep concern over the most critical situation faced by the people of Kashmir and said that the fresh spree of barbarism unleashed by Indian forces has exposed the New Dehli’s claim that it enjoys any public support in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe APHC spokesman, in a statement issued in Srinagar, lashed out at some local stooges of India who exploited the anti-India sentiments of the people of Kashmir to grab the political power.\nHe said that these stooges by using the tags of regional parties are dancing to the tunes of their masers in New Delhi while the fact is that they have been taking oaths under the Indian constitution, and have been, therefore, recognized by India as its own people,Kashmir Media Service reported.\nThe same people, the spokesman added, are now issuing hard-hitting statements against Indian brutalities only to buy the sympathies of the Kashmiris. However, he made it clear that that gone are the days when these double-faced leaders succeeded in hoodwinking the masses.\nThe spokesman clarified that the people of Kashmir have rendered innumerable precious sacrifices in terms of blood, honour and material property for the sacred cause of freedom and not for any humiliating accords like that of 1975 within the Indian constitution.\nHe cautioned such political chameleons to desist from such mean political gimmicks of grabbing political power at the cost of our precious sacrifices given for the end of Indian illegal occupation in Kashmir.\nThe APHC spokesman urged the United Nations to fulfill its moral and legal obligations on Kashmir and force India to stop genocide of the Kashmiri people.\nMeanwhile, APHC leader and Tehreek-e-Muzahamat Chairman Bilal Ahmed Sidiqui in a statement said that New Delhi in its stubbornness is going too far to malign pro-freedom leadership by leveling unsound and dubious charges against it. “This only shows India’s unwillingness to resolve the Kashmir dispute, he added.\n“Instead of wasting energies and resources in such cheap and failed tactics, New Delhi should shun its stubbornness and work towards the resolution of the Kashmir dispute according to the wishes of people of Jammu Kashmir,” he concluded.",
  "retrievedAt": "2025-08-11T21:07:29.844Z"
}
