{
  "title": "Govt taking steps to build information highways, improve digital financial system: President Alvi",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-build-information-highways-improve-digital-financial-system-president-alvi/",
  "date_published": "2021-08-24T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):President Dr Arif Alvi Tuesday said the government was taking steps to build information highways and extend reach of the people to new fourth generation technologies.\nSpeaking at an international conference on innovation and entrepreneurship here, he said the goal of present government was to improve digital financial system, achieve women empowerment and ensure economic transparency.\nHe said Pakistan was making great progress with the use of emerging technologies. He noted that Pakistan was left behind during the industrial revolution.\nIn the fourth information technology revolution, the communication and spread of information had become very fast, he said adding the world was now witnessing the advent of fifth generation revolution.\nHe mentioned that immense information was accumulated by the world through cloud computing. Youth could gain advantage by gathering information and through innovation, creativity and entrepreneurship, he added.\nHe said the government was making efforts to attain one hundred percent literacy in the country and impart skills to the people who could not get education.\nThe stress was on making the youth familiar with artificial intelligence and technologies like block chain and computer networking, he added.\nThe president said the companies banking on gathering of information and intelligence had replaced the traditional top companies of the world.\nHe was of the view that economy of Pakistan could leapfrog to be among the top global economies. Pakistan had the necessary educational infrastructure to train its youth for the emerging challenges and the experienced businessmen should also provide mentorship to the young population, he added.\nThe president told that the government was working on setting up special technology zones and endeavouring to encourage investment and utilize its youth bulge.\nHe said the world needed the skilled youth of Pakistan but he wanted that the skilled youth should be retained in the country through joint ventures and other initiatives.\nPakistan could learn from the experiences of Japan and Germany to achieve digital transformation and better models of governance and economy.\nThe president said the importance of brick and mortar schools would decrease while the intellectual communication would gain speed. The industrial infrastructure had already changed in the next 15 to 20 years, he added.\n“The new technologies have created vibrancy and youth should focus on these technologies.”\nDr Arif urged the world to focus on reduction of poverty and merit based distribution of wealth and democratization of societies.\n“We have to be on guard against the accumulation of wealth as mentioned in so many books on capitalism.”",
  "retrievedAt": "2025-08-11T21:07:28.238Z"
}
