{
  "title": "NA body directs NCC to give detailed briefing on SNC",
  "link": "https://www.app.com.pk/national/na-body-directs-ncc-to-give-detailed-briefing-on-snc/",
  "date_published": "2021-08-24T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):The National Assembly Standing Committee on Federal Education, Professional Training, National Heritage and Culture directed the National Curriculum Council (NCC) to brief the Committee in detail on implementation of the Single National Curriculum (SNC) in the next meeting.\nThe directions were given during the 19th meeting of the Standing Committee on Federal Education, Professional Training, National Heritage and Culture held here in the Committee Room of National Curriculum Council Secretariat under the Chairmanship of Mian Najeeb Ud Din Awaisi, MNA.\nWhile briefing, the Director, National Curriculum Council Secretariat apprised the Committee that in line with the vision of the Prime Minister Imran Khan, the Council and Ministry of Federal Education and Professional Training is developing SNC for Pakistan in consultation and collaboration with Education Departments of all federating units of the country.\nShe said SNC was being developed in three phases. She informed the committee that SNC was aimed at providing equal learning opportunities to all fractions of society.\nIt would help students and parents in case of inter-provincial mobility, she said.\nThe Committee also considered “The Pakistan Global Institute Bill, 2021” and “The Pakistan Institute of Education Bill, 2021”.\nAfter detail deliberations, the Committee recommended that “The Pakistan Institute of Education Bill, 2021” may be passed by the Assembly. “The Pakistan Global Institute Bill, 2021” and “The NCS-Institute of Sciences Bill, 2021” (moved by Mr. James Iqbal, MNA) was, however, deferred till next meeting of the Committee.\nThe Dyslexia Special Measures Bill, 2021 (moved by Ms. Mehnaz Akbar Aziz, MNA) was also considered in the meeting. After detail deliberations, the Committee recommended that the Bill might be passed by the Assembly.\nThe committee also appointed a Sub-Committee under the convenership of Sadaqat Ali Khan Abbasi, MNA to discuss the challenges faced by universities under Higher Education Commission (HEC).\nWhile briefing on the current Admission Policy in ICT Schools, the Director General, Federal Directorate of Education (FDE) stated that the children of residents of Islamabad Capital Territory, Children of Federal Government/Semi Government employees residing in Islamabad would be eligible for admission to the nearest location of their residences.\nPriority should be given to the residents of same Union Council/Sector whichever the case may be, he added. However, DG FDE said children belonging to same family would be accorded preference for admission in the institutions where their brothers/sisters were already enrolled.\nHe apprised that admission tests were conducted for admission to institutions where the number of applicants for admission exceeded intake capacity of the institution.\nThe committee was not satisfied by the briefing given by Director General (FDE) and decided to have a separate presentation on admission policy in ICT Schools.\nBesides the Parliamentary Secretary, Federal Education and Professional Training Division, member national assembly Wajiha Qamar, the meeting was attended by Ali Nawaz Awan,\nMr. Sadaqat Ali Khan Abbasi, Javairia Zafar Aheer, Umar Aslam Khan, Muhammad Farooq Azam Malik, Nafeesa Inayatullah Khan Khattak, Andleeb Abbas, Ghazala Saifi, Asma Qadeer, Tashfeen Safdar, Farukh Khan, Mehnaz Akbar Aziz, Kiran Imran Dar, Musarrat Asif Khawaja and Dr. Shazia Sobia Aslam Soomro,\nMembers National Assembly, Jamshed Thomas, mover also attended the meeting.\nThe senior officers from Federal Education & Professional Training Division, Ministry of Law and Justice, Higher Education Commission, Federal Directorate of Education (FDE) and National Curriculum Council were also present in the meeting.",
  "retrievedAt": "2025-08-11T21:07:28.728Z"
}
