{
  "title": "Quranic garden-a treat to watch,source of immense pleasure",
  "link": "https://www.app.com.pk/national/quranic-garden-a-treat-to-watchsource-of-immense-pleasure/",
  "date_published": "2021-08-24T10:54:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 24 (APP):The Quranic Garden nurtured on the premises of “Aljamea-tus-Saifiah” Karachi campus, at a place called North Nazimabad is thriving with trees and plants of seven different kinds of fruits mentioned in the holy book, the Quranic Garden is adorned with vines of grapes and trees including that of pomegranate, fig, olive, banana, seedless jujube (baer) and dates.\nPresence of a garden thriving with trees and plants of fruits mentioned in the holy book, that too  in Karachi, may sound unbelievable but has been turned into a reality by a committed group against unfavorable geographical conditions through efficient application of the resources available in terms of technology, skills and commitment.\nThese are further complimented, at a little distance, by other fruit trees including lemon, grapefruit, custard apple (native) along with series of  varied shrubs, ornamental and flowering plants raised not exactly at the dedicated site but in close proximity.\n“To see that the trees grown at the Quranic Garden do bear fruits had been a challenge, particularly pomegranate and olives that are less suitable in the given climatic conditions and soil properties of Karachi,” said Dr. Huzaifa Nooruddin, a faculty member of a known Arabic Academy actively engaged in the project.\nTalking to APP and pointing towards the grove, he said it may not be large in size but do have trees of figs, dates, jujube, grapes, pomegranate and banana – bearing fruits on a regular basis, in accordance to their respective seasons, for the past several years.”We have attained some success in growing an olive tree which is expected to bear fruits in coming years,” said the young teacher.\nTo a question, he emphasized that the Holy Quran had always been and shall remain to be the bedrock of Aljamea-tus-Saifiyah movement hence optimum attention is paid to groom the students and enhance their understanding about the injunctions that encompass all aspects of life, with equal attention towards rights and responsibilities towards Allah followed by the society they are part of.\nAn official associated with the academy administration adding to his junior colleague said the basic idea behind the Quranic Garden was and continues to inculcate interest among the youth towards relevance of Quranic teachings in particular context of Allah’s blessings and their relevance for a healthy society.\nThe efforts to develop the garden marked its beginning in 1983 onwards with mostly imported saplings planted and duly supplemented, in accordance to requirement, by updated techniques encompassing hydroponics set-up around a science lab focused on relevant techniques as capillary action, homogeneous mixtures, neutralization reaction, specific heat capacity (SHC) of water coupled with thermal conduction and insulation.\nThese technology based interventions are not restricted to the Quranic Garden only but are extensively used in production and further growth of hundreds of other saplings that once prepared and having acquired needed strength are transported to other venues including community parks, residential areas and different institutions managed by the Dawoodi Bohra community.It was the 52nd spiritual head, Dr. Syedna Mohammad Burhanduddin (1969-1989) who ensured that teaching might begin at Aljamea-tus-Saifiah’s Karachi  in  1969, mirroring the academic and structural components of its sister academy at Surat.\nIt was, however, in 1983 that a full-fledged campus of the academy was established with work initiated on Quranic Garden almost the same year.Dr. Burhanuddin himself planted a number of saplings in the garden with clear instructions that along with teachers each and every student,  both girls and boys be motivated to contribute towards growth and nourishment of the garden in the best possible manner.\nThe arrangements specifically facilitate students to be part of hands-on activity of preparing nutrients, monitoring temperatures coupled with levels of TDS and pH content besides studying a real sapling with its roots and shoot.\n“Its organic nature brings us a step closer to nature and helps develop interest towards agriculture and farming,” commented Dr. Huzaifa.\nThe garden, not open to the public and also little known to many, is definitely a source of immense pleasure and surprise to those getting an opportunity to visit tthe place flourishing in an arid zone, said Dr. Rafi ul Haq attributing its success to absolute sense of responsibility and belongingness.\nFortunately, the current spiritual leader of the Dawoodi Bohra community Dr. Syedna Mufaddal Saifuddin continuing with the mission of his predecessor expects the followers to continue contributing towards betterment of the environment.\nCommunity members are expected to ensure cleanliness and maintain hygiene in the areas of their residence and business, said Ali Asghar Quettawala, the regional coordinator of the Nazafat organization, an active wing of the community dedicated to ensure cleanliness, hygiene and plantation in the country.\nHe referred to the active involvement of the Nazafat in the Prime Minister Imran Khan’s Ten Billion Trees Tsunami Initiative.\nIt is, in this, regard that the organization has been actively engaged in plantation drives in coordination with administration of different cities across the country.\nHowever, in Karachi ,a nursery has been set up with some 7000 plants meant to be provided, on request, to different government departments and organizations besides undertaking needed research under the supervision of horticulturists followed by training of community members.",
  "retrievedAt": "2025-08-11T21:07:30.710Z"
}
