{
  "title": "Rana Mashhood congratulates hockey team being selected for Azlan Shah Tournament",
  "link": "https://www.app.com.pk/national/rana-mashhood-congratulates-hockey-team-being-selected-for-azlan-shah-tournament/",
  "date_published": "2024-04-28T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): Chairman Prime Minister’s Youth Programme (PMYP) Rana Mashhood Ahmed Khan, on Sunday, extended warm congratulations to the National Hockey Team (PHT) on their selection for the upcoming Azlan Shah Cup Tournament scheduled in Malaysia.\nExpressing immense pleasure at the announcement, he conveyed his gratitude to all stakeholders for their unwavering support and cooperation in nurturing the talent and the selection process.\nAcknowledging the dedication and hard work of the players, Rana Mashhood wished the National Hockey Team the best of luck for the tournament.\nHe expressed confidence in the team’s abilities to showcase exemplary sportsmanship and bring glory to the nation at the international stage.\nThe Chairman emphasized the importance of sports in promoting unity, resilience, and national pride.\nHe reiterated the Government’s commitment to providing all necessary resources and support to empower athletes and enhance Pakistan’s standing in the world of sports.\nThe Chairman concluded by encouraging all citizens to rally behind the National Hockey Team, offering their fervent support as they embark on this prestigious journey to represent Pakistan with distinction.\nMeanwhile, the selection committee comprising Dutch coach Roland Oltmans, Manzoorul Hasan and Shahid Islam announcing the 18-member Pakistan Hockey Team after conducting trials in Islamabad said that Imad Shakeel Butt will lead the Pakistan team while Abu Bakr will be the vice-captain.\nThe committee broadcasted that six players of the Karachi camp also managed to be part of the team while two goalkeepers had been included in the Pakistani squad.\nSix defenders and six midfielders had also been selected while four forwards were also nominated for the tournament.\nSix players had been kept on standby, the committee announced.\nEarlier Chairman PMYP Rana Mashhood had constituted a three-member selection committee to select the team while Olympian Khawaja Junaid was also present during the trials on the instructions of Chairman PMYP.",
  "retrievedAt": "2025-08-11T02:09:39.057Z"
}
