{
  "title": "Renewables First launches first batch of MSEC graduates to fill knowledge gap in Energy sector",
  "link": "https://www.app.com.pk/national/renewables-first-launches-first-batch-of-msec-graduates-to-fill-knowledge-gap-in-energy-sector/",
  "date_published": "2024-04-28T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): Renewables First, an independent think tank working on Energy transition and intersecting perspectives, has launched the first batch of it’s flagship Margalla School on Energy and Climate (MSEC) graduates being trained on emerging trends and knowledge concepts due to adverse impacts of climate change demanding out of the box solutions to discover and resolve interconnected issues leading less environment hazardous energy production and consumption technologies.\nThe MSEC of Renewables First held a graduation cum networking ceremony here Sunday for the cohort members to celebrate their endeavour and start a circle of enlightened minds intended to illumine others in different sectors linked to energy and climate change to enhance climate resilience of energy sector.\nSpeaking on the occasion, Chief Executive Officer (CEO), Renewables First, Zeeshan Ashfaq said the world energy transition was a move being experienced globally driving the use of renewable energy which was intended to reduce reliance on fossil fuels causing global warming.\nHe said over 140 countries of the world have pledged to achieve net zero carbon emissions by 2050 at the global environmental conference of COP-28 in Dubai and many of them have pledged to triple their renewable energy production capacity.\n“Energy transition is not swapping coal for sun and wind for oil but a move to cultivate future energy leaders. Therefore, the Margalla School’s first round has been completed and it’s the same effort,” he said.\nZeeshan Ashfaq added the Renewables First selected young professionals to bring new and fresh perspective and passion to drive this movement of green energy transition.\nHe pointed out that only nine undergraduate courses were taught across the country which only offered infrastructure related degrees in energy sector. The Renewables First, he said that’s why conceived Margalla School on Energy and Climate, where some 500 applied for this fellowship and 22 got selected after a competitive process.\nProgramme Director, Renewables First, Mustafa Muhammad Amjad expressed his gratitude on training 22 professionals in the past two weeks.\nHe said the Renewables First was a young organisation in Pakistan and an energy transition think-tank intended to expedite inclusive renewable energy transition with people at its focus.\n“Elections globally have been deicded on the basis of renewable energy transition whereas Pakistan’s political discourse is still very nascent in this realm. We wanted to appirse the future generation of the nuances of energy sector which has been exclusive in the country. The curriculum for energy sector is outdated in the varsities of the country and the MSEC is developed to bridge that gap,” Mustafa said.\nThe School’s fellowship programme, he said focussed on three key areas of energy transition, leadership, climate and environment to develop understanding of Pakistan’s energy sector, it’s challenges and way forward.\nThe programme also helped the cohort members to explore the importance of climate and environment whereas many other thematic areas were explored during the fellowship, he added.\n“Some 42% women applied for MSEC fellowship whereas out of the total selected 64% are women (14/22). The reason for their selection is the value added by them to the programme through their valuable input who are now reckoned as agents of change,” he said.\nThe testimonial videos of participants were also presented showing their lessons learnt and passion for the fellowship.\nFormer Chairman NEPRA, Touseef Ahmed said the best thing was that all participants were vibrant and eager to learn as the sessions were extensively engaging with the participants.\nHe felicitated the MSEC management for successful endeavour and said, “This achievement brings more responsibility to the participants that they will take back and spread the knowledge in their native areas.”\nManagement Director, PPIB, Shajahan Mirza, said the project would help equip the participants and young graduates to equip them with modern trends as such programmes should be done frequently that provide a good exposure to the participants.\n“It’s an orientation and fellowship to venture into the field of energy. However, from university to market it’s a unidirectional aspect that the students and employeers have divergent expectations, however such initiatives help improve this gap. Power sector one of the most difficult sectors in Pakistan and can make or break the economy of the country. We need more youngsters in this field as this initiative will help develop more educated cohorts to enhance sector knowledge,” he said.\nAt the end, certificates were distributed among the participants Amina Urooj, Awais Riaz, Ayesha Khushboo, Faiza Zaheer, Laiba Nayab, Muhammad Asim Shoaib, Muhammad Usama, Muqadas Ashiq, Muzammil Ahmed Qazi, Neha Masroor, Obaidullah Zia, Quratul Ain, Rabia, Ramsha Panhwar, Saima Yousaf, Saira Saeed, Salman Tanseer, Shafqat Hussain Memon, Sukaina Batool, Urwa Usman, Verdah Sheikh and Zubair Khan.",
  "retrievedAt": "2025-08-11T02:09:40.570Z"
}
