{
  "title": "Saudi minister declares PM Shehbaz “Man of Action” as he highlights Pakistan’s investment potential, policies",
  "link": "https://www.app.com.pk/national/saudi-leadership-declares-pm-shehbaz-man-of-action-as-he-highlights-pakistans-investment-potential-policies-2/",
  "date_published": "2024-04-28T16:01:00.000Z",
  "source": "APP",
  "content": "RIYADH, Apr 28 (APP): Prime Minister Shehbaz Sharif was declared the “Man of Action” by a Saudi minister on Sunday in recognition of his commitment to reviving Pakistan’s economy through massive reforms and foreign investment. This acknowledgment came during his busy day in Riyadh, where he met different leaders and addressed a special meeting of the World Economic Forum.\nDuring the day, the prime minister held meetings with Saudi Minister for Investment Khalid Al-Falih, Minister for Finance Mohammad Al Jadaan, and Minister for Industry Bandar bin Ibrahim Alkhourayef, Managing Director of the International Monetary Fund Kristalina Georgieva and Emir of Kuwait Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah.\nIn his meeting with the prime minister on the margins of the Forum, Saudi Minister for Investment Khalid Al-Falih called him a “Man of Action,” recognizing his performance and speed of work, along with his commitment to contributing to Pakistan’s development and progress.\nThis is the second time Shehbaz Sharif has earned such a distinction from foreign leadership as earlier, he was given the title of “Shehbaz Speed” by a Chinese leader to acknowledge his swift execution of development projects while serving as Punjab chief minister.\n“We are all aware of your performance and speed of work,” the Saudi minister said, adding that the prime minister was advancing the mission of progress in Pakistan, with their full support. “Your mission is our mission,” he remarked.\nSaudi finance minister said that a delegation of Saudi investors would soon visit Pakistan. Pakistan was a priority for their investment and Saudi Arabia would continue to fully cooperate in the fields of agriculture, information technology and energy, he added and lauded Pakistanis’s prominent role in the progress of Saudi Arabia in different fields.\nDuring the meeting, it was agreed that Saudi Arabia would further explore opportunities of investment in Pakistan.  He reaffirmed the support of Saudi Arabia in the economic progress of Pakistan and called the “progress of Pakistan the progress of Saudi Arabia”.\nHe said that Saudi Arabia had made difficult decisions for reforms at the government level regarding its Vision 2030.\nThe prime minister also met the Saudi Minister for Industry who expressed keen interest in collaboration with Pakistan in agriculture, mining, information technology and other areas.\nThe Saudi minister said he was in contact with the Saudi private companies regarding investment in Pakistan and the representatives of these companies would soon visit Pakistan.\nTalking to the Saudi ministers, the prime minister thanked the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz and Crown Prince and Prime Minister Mohammed bin Salman bin Abdulaziz for supporting Pakistan in a difficult time.\nHe said during the previous tenure of his government, the economic conditions of Pakistan improved due to the support and assistance of Saudi Arabia.\nEarlier in the day, Prime Minister Shehbaz addressed a session of the World Economic Forum (WEF) regarding global health and terming the global inequity in the health sector as ‘the first and foremost problem’ called upon bridging the widening gap between the Global South and the Global North.\nHe said that the COVID-19 pandemic had exposed the existing gaps largely between the Global North and Global South in terms of provision of health facilities and distribution of vaccines.\nHe told the gathering that despite no contribution to the emissions, Pakistan witnessed the worst climate change-triggered floods in 2022 which hugely devastated the infrastructure and buildings and had to spend billions of rupees to rehabilitate the affected people.\nPrime Minister Shehbaz said that for the rehabilitation efforts, they sought costly loans. “Can a developing country like Pakistan afford it?” he questioned and observed that for the provision of health facilities, a developing country like Pakistan required resources.\n“The yawning gap between the Global South and Global North should be bridged,” he emphasised.\nSharing his personal experiences, the prime minister said that treatment for fatal diseases like cancer was too costly for the poor population of Pakistan.\nHe said that as a chief minister of Punjab, he had provided about 130 million inhabitants of the province with the best medical treatment initiatives like screening and treatment facilities for Hepatitis in the remotest and backward areas of the province where the poor people had been in dire need of basic facilities like education and health.\nThe prime minister said that while being Punjab chief minister, he had established the first kidney and liver hospital in Punjab which was probably one of the best in Asia providing free treatment to the poor. About the dengue outbreak in 2011 in the province, he shared that the phenomenon in the health sector was one of the biggest in the world but that was controlled through engaging international experts, equipment and activating government machinery, civil society and the common man.\nThe prime minister, in his remarks, appreciated the Bill and Melinda Gates Foundation for their support and provision of vaccines for polio eradication drives in Pakistan, besides their generosity during the 2022 floods to support the affected people of Pakistan.\nPrime Minister Shehbaz Sharif also met with Managing Director (MD) of the International Monetary Fund (IMF) Kristalina Georgieva wherein he reiterated his government’s commitment to put Pakistan’s economy back on track.\nThe prime minister said that he had directed his financial team, led by Finance Minister Muhammad Aurangzeb to carry out structural reforms, ensure strict fiscal discipline and pursue prudent policies that would ensure macro-economic stability and sustained economic growth.\nHe thanked Georgieva for supporting Pakistan in securing the USD 3 billion Standby Arrangement (SBA) from IMF last year that was about to be completed.\nThe IMF chief appreciated the prime minister’s leadership for timely securing the SBA last year.\nBoth sides also discussed Pakistan entering into another IMF program to ensure that the gains made in the past year were consolidated and its economic growth trajectory remained positive.\nThe prime minister, in a meeting with the Amir of Kuwait Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah expressed his desire to work closely with him to transform bilateral ties into a mutually beneficial economic partnership that would serve the best interests of the peoples of both countries.\nPakistan and Kuwait had signed a number of MoUs and agreements to deepen cooperation in trade and investment in November 2023. The prime minister assured the Kuwaiti leadership that these MoUs and agreements would be implemented in an efficient and timely manner.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:09:54.753Z"
}
