{
  "title": "Governor KP pays visit to Thandakoi Bazar in Peshawar city, meets with shopkeepers",
  "link": "https://www.app.com.pk/national/governor-kp-pays-visit-to-thandakoi-bazar-in-peshawar-city-meets-with-shopkeepers/",
  "date_published": "2024-04-28T16:23:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 28 (APP): Governor Khyber Pakhtunkhwa Haji Ghulam Ali Sunday visited the historical Sarkai Gate (Thandakoi) market in the inner city and met with the shopkeepers, traders and people from different walks of life.\nIn order to be safe from financial losses, he also appealed to take possible precautions including implementation of safety measures. The local population, business community, shopkeepers expressed their happiness and paid tribute to the Governor to visit the inner city.\nThe traders, shopkeepers and people from different walks of life appreciated the Governor for visiting and meeting with common people.\nIt is for the first time that a Governor suddenly reached among the common people that is why (Haji Ghulam Ali) has earned the title of People’s Governor across the province.\nThe citizens and businessmen expressed their happiness seeing the governor suddenly present in their midst and also informed the Governor about various problems and difficulties they are faced with.\nThe people of the area said that Governor Haji Ghulam Ali not only met with the people himself, but also given easy access to the political and social personalities, including the general public to the Governor’s House, which is highly commendable.\nMeanwhile, the Governor shook hands with the shopkeepers, met with them and got information about their problems and issues. He assured of his full cooperation to solve these problems on priority basis.\nThe people, traders and shopkeepers thanked the Governor who himself came and met with them to listen to their problem. It was for the first time that a Governor without any protocol, visited the inner city and met with the common people of the historical walled City Peshawar.",
  "retrievedAt": "2025-08-11T02:09:32.868Z"
}
