{
  "title": "First Margalla Hills Half marathon best effort to champion climate awareness: Romina",
  "link": "https://www.app.com.pk/national/first-margalla-hills-half-marathon-best-effort-to-champion-climate-awareness-romina/",
  "date_published": "2024-04-28T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): Prime Minister’s Coordinator on Climate Change, Romina Khurshid Alam on Sunday appreciated the civil society’s spirit to promote running as a healthy leisure activity and termed the first-ever Margalla Hills Half Marathon held at the scenic Trail-5 of the National Park as a best effort to champion climate awareness.\nAddressing the Margalla Hills Half Marathon which is the first and only trail running half marathon in the federal capital organised by the pioneer group of running, Islamabad ‘Run With Us’ as chief guest, the Prime Minister’s Coordinator extended her felicitations to the winning athletes and participants for actively participating in the adventurous endeavour and championing the climate awareness.\nMore than 150 participants from all across Pakistan including members of diplomatic community, foreigners and experienced runners joined running on all the main trails of Margalla Hills covering an area of 21.1 kilometers, including the portion of Margalla Road from Trail 5 to Japanese Zoo parking and Pirsohawa Road from Talhar Mor to Monal Restaurant.\nRomina said the participants of the Half Marathon were the real celebrities of the event that deserve praise alongwith the organisers of the activity. She added that climate and sustainable development goals (SDGs) are her passion for spearheading the climate agenda at the policy level which is also the need of the hour.\nThe Minister on the occasion refused to take water in single-use plastic bottle as part of her flagship campaign and awareness drive to apprise masses to end one-time use plastics under the ban being imposed across the federal capital.\n“The nature and the planet is our mother and we turn to it for solace to get rid of our vagaries of life and have to ensure its conservation. Say no to plastics and I am championing it, whereas media is our messenger and should carry forward this message as well,” she said.\nShe congratulated the marathon winners and participants and lauded their determination to walk for nature. “Everyone got their reward in the form of the best clean air and natural environment during the marathon,” she added.\nChairperson, Islamabad Wildlife Management Board (IWMB), Rina Saeed Khan thanked the media for supporting the cause of environmental conservation and mass awareness on responsible role towards nature.\nKhan also lauded the Prime Minister’s Coordinator for her warm support to the IWMB as a great supporter and advocate of the environment. “She (Romina) has a positive attitude and tremendous support towards IWMB and the Board will invite her on all its events,” she added.\nThe IWMB chair said that the marathon was a great experience and would be encouraged in the future as well.\n“IWMB has over 100 volunteers who are working without any reward and freely work on picking garbage from trails. We request visitors to enjoy nature but don’t litter and create noise and avoid staying in national park after sunset as most of the wildlife is nocturnal,” Rina Saeed said.\nFounder of Islamabad Run With Us, Qasim Naz said that the main objective of the event was to promote a healthy lifestyle and create awareness to preserve the mesmerizing beauty of Margalla Hills National Park.\nHe informed the participants that Islamabad Run With Us is the first community running club that started in 2016 and had held 600 events so far and also organise four races throughout the year including the Islamabad Half Marathon in April.\n“This time, due to Ramazan, there has been very little media campaign for the event within 8-9 days of social media campaign, Margalla Hills half marathon has bagged 150 participants that started running at 6:30 am and ended at 10:30am,’ he said.\nPM’s Coordinator, Romina Khurshid Alam conferred the awards to the winners whereas in the female category, Sadia Maqbool stood third, Emily (a US National) got second position whereas Inab Khan was the winner who is also the member of running squad of IRWS and an international marathon runner.\nIn the male category, the third position was secured by Athar Akhtar, second by Waqar Ahmed and the winner was Muhammad Akhtar.\nAt the end Qasim Naz presented mementos to PM’s Coordinator Romina Khurshid Alam and the Coordinator gave away the memento to Chairperson Rina Saeed Khan.\nCEO, North Naturals (co-partner of the event), Israr Uddin thanked the PM’s Coordinator and orgnanisers of the event for making the event a success and the leadership by the government. He said Pakistan existed in the geographical region prone to disasters and volatile ecosystems that needed special attention of all quarters of the society and his organisation through its products was playing that role.",
  "retrievedAt": "2025-08-11T02:09:57.702Z"
}
