{
  "title": "Government to continue smart lockdown policy during second wave of COVID-19: Asad Umar",
  "link": "https://www.app.com.pk/national/government-to-continue-smart-lockdown-policy-during-second-wave-of-covid-19-asad-umar/",
  "date_published": "2020-11-03T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP):Minister for Planning, Development and Special Initiatives Asad Umer Tuesday said the government would continue its smart lockdown policy during second wave of the COVID-19 without putting additional pressure on the common man.\n“Smart lock down and protecting employment opportunities at the same time was hallmark of the government strategy during the Covid-19 pandemic,” he said while accompanying Prime Minister Imran Khan during a briefing on power relief package here.\nHe said the government would also adopt the same strategy during the second wave so that the economic activities should not get affected.\nHe said the government had adopted the comprehensive strategy for the early revival of local industry in post Covid-19 pandemic scenarios.\nDue to such prudent strategies of the government, he said the local economy was rapidly reviving as compared to the other countries of the world.\nThe minister said that for the first time in the country’s history, the government had decided to announce energy prices for the industrial sector for next three year through a better future strategy.\nThe minister said that lowering the energy prices and reducing the cost of doing business was the part of government reforms for the growth of the industrial sector in the country.\nHe said that cheap and competitive energy prices would positively impact on different sectors of the economy, especially providing a level playing field to the industry for completing the regional player.\nWhile giving the message to the industrial sector, he said that now the government has offered a huge opportunity to the local industrial sector to get benefit from the current reform package provided by the government.",
  "retrievedAt": "2025-08-11T19:58:18.668Z"
}
