{
  "title": "India set to disintegrate soon due to Hindutva policies, warns Shehryar Afridi",
  "link": "https://www.app.com.pk/national/india-set-to-disintegrate-soon-due-to-hindutva-policies-warns-shehryar-afridi/",
  "date_published": "2020-11-03T13:28:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD , Nov 03 (APP):Chairman, Parliamentary Committee on Kashmir Shehryar Khan Afridi on Tuesday said that Indian today stands extremely polarised and it is bound to disintegrate due to the policies adopted by the Hindutva regime.\nAddressing the audiences of a seminar held here titled “Pakistaniat – the main driving force behind Kashmir Freedom Movement”, Shehryar Khan Afridi said that Modi regime was committing war crimes in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and these war crimes have exposed the true face of India to the world.\nThe moot was also addressed by President Azad Jammu and Kashmir Dr Masood Khan, former AJK Prime Minister Sardar Attique Ahmed Khan, Dr Abdullah Khan of PICSS and others.\nShehryar Afridi said today Muslims in India have recognised the fact that Quaid-e-Azam Mohammad Ali Jinnah’s struggle for Pakistan and two-nation ideology was right.\nChairman Kashmir Committee said that Kashmir is jugular vein of Pakistan according to the vision of Qauid-e-Azam and Pakistan would continue its legal, moral and political support for the freedom struggle of Kashmiris.\nAfridi said that Prime Minister Imran Khan is Ambassador of Kashmiris and Kashmir Committee is the voice of Pakistan.\nShehryar Afridi said that youth need to be the voice of the voiceless Kashmiris.\nHe said that Kashmir Committee was utilizing all its resources to raise voice for Kashmiris and a special focus was being laid on securing digital space and protecting and promoting the cultural heritage of Kashmir.\n“Gilgit Baltistan (GB) is being given ‘provisional provincial status’ in line with the United Nations resolutions on Jammu and Kashmir and Prime Minister Imran Khan has pledged to provide unprecedented funds to bring the GB at par with other parts of Pakistan,” he said.\nHe urged the youth to raise to the occasion and protect and project the cause of Kashmir.\nPresident AJK Sardar Masood Khan condemned the Indian government’s targeting of the family of eminent Kashmiri leader Altaf Bhat.\nHe said that Pakistan and Kashmir were inseparable identities and the people of Pakistan and Kashmir stood together for a joint cause.\nHe said that Hindutva ideologues wanted to kill all Muslims and India’s efforts to buy more and more military equipment reflected the same.",
  "retrievedAt": "2025-08-11T19:58:17.960Z"
}
