{
  "title": "Kundi pledges to increase BISP payment centres in Hazara Division",
  "link": "https://www.app.com.pk/national/kundi-pledges-to-increase-bisp-payment-centres-in-hazara-division/",
  "date_published": "2022-12-20T17:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Minister of State for Poverty Alleviation and Social Safety, Faisal Karim Kundi on Tuesday said that more payment centers of Benazir Income Support Programme (BISP) will be opened in various districts of Hazara division, particularly those Tehsils lacking such centers.\nHe stated this in a meeting with a delegation of notables from Hazara which was led by Shuja Khan, former minister and PPP Provincial General Secretary at his office.\nKundi said that BISP is operating nationwide to provide financial assistance to the underprivileged and marginalized segments of society and expanding BISP’s outreach to the last mile is the priority of the present coalition government.\nHe further said that there is a need to open more offices in various districts of Hazara division so that beneficiaries don’t have to travel too far away from their houses to receive their cash payments.\nKundi apprised the visiting delegation about details of the registration process that is mandatory for the eligible beneficiaries to be able to receive the BISP cash assistance. The process includes household surveys, poverty scorecards, biometric verification mechanisms, payment methods and partner banks, he explained.\nKundi urged all district presidents to be aware of various initiatives being implemented under BISP so that they can mobilize the local population of Hazara Division and help them get themselves registered with BISP to receive cash assistance under Kafalat Programme.\nKundi informed the delegates that FIRs are registered and stringent action is taken against those culprits who are involved in fraudulent deduction of money from the cash of the beneficiaries which is Rs.7000/- quarterly.\nThe members of the PPP delegation vowed to fully support BISP initiatives under the leadership of their party’s Provincial President Mr. Shuja Khan.",
  "retrievedAt": "2025-08-11T16:02:44.515Z"
}
