{
  "title": "SSG completes operation against terrorists at Bannu CTD centre: Kh Asif￼",
  "link": "https://www.app.com.pk/national/ssg-completes-operation-against-terrorists-at-bannu-ctd-centre-kh-asif/",
  "date_published": "2022-12-20T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): Defence Minister Khawaja Muhammad Asif on Tuesday said that the Special Services Group (SSG) had completed the operation against terrorists at Counter-Terrorism Department (CTD) Centre Bannu, recovering all hostages and killing all members of the outlaw organization.\nSharing details of the operation conducted by security forces against militants, who besieged the CTD center in Bannu, the minister informed the joint sitting of the parliament that all terrorists had been killed and the compound had been cleared at 2:30 pm on Tuesday.\nHe said that the operation started at 12:30 pm on December 20 (today) and concluded at 2:30 pm. He added around 10 to 15 SSG jawans including one officer received injuries while two embraced Shahadat.\nThe situation emerged after an arrested militant overpowered staff, snatched a rifle and later held hostages inside the CTD centre in Bannu, he added.\nKhawaja Asif said, “All the terrorists who had taken hostages at CTD centre in Bannu were killed during the operation of security forces.” He said that total 33 terrorists were inside the centre and all were killed in the operation carried out by the Pak Army’s SSG.\nHe said that it was a matter of concern that terrorist activities were increasing in Khyber Pakhtunkhwa and these 33 terrorists who were arrested was evidence of what was happening in KPK.\nHe said that the chief minister KPK and CTD department which is responsible for countering terrorism in the province were actually hostages of Imran Khan as his government did nothing during last nine years even in floods and other untoward situations.\nThe minister said that this incident is again an utter failure of Imran Khan’s government in KPK and added that again Pakistan Army played its role. He added there was no role of the provincial government of KPK in handling the situation, where Imran Khan openly uses resources of the provincial government including its helicopter.\nHe said that there was a total collapse of the KPK province in the presence of Imran Khan as the CM cannot do anything without his permission.\nLater, the minister informed the National Assembly that Inter-Services Public Relations (ISPR) will share the complete information about the operation against terrorists.",
  "retrievedAt": "2025-08-11T16:02:38.793Z"
}
