{
  "title": "President for an integrated national mental health helpline",
  "link": "https://www.app.com.pk/national/president-for-an-integrated-national-mental-health-helpline/",
  "date_published": "2022-12-20T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): President Dr Arif Alvi on Tuesday emphasised the need to set up an integrated, effective and standardized national-level mental health helpline to provide mental health services and counseling at the grassroots level.\nThe president, chairing a follow-up meeting on mental health here, said a coordinated, sound, and singular approach at the federal and provincial levels, with the participation of the public and private sectors, should be adopted to address the issues of mental health and well-being in Pakistan.\nCountry Director of the World Health Organization (WHO), Dr Palitha Gunarathna Mahipala, representatives of the National Commission for Human Rights, Pakistan Psychological Association, Pakistan Psychiatric Society, other organizations, and officials of the federal and provincial governments attended the meeting.\nThe president emphasised that all resources and initiatives taken at the federal and provincial level and in the private sector related to mental health and well-being should be enlisted and incorporated into a single national helpline for providing speedy and prompt mental health services to the people of Pakistan.\nHe called for enlisting mental health institutions, teaching hospitals, and other mental health facilities, besides creating a database of mental health providers, which should be integrated into the helpline for providing efficient and effective referrals to the patients.\nThe president said that avenues in the public and private sectors should be explored to meet the financial need of Rs 45 million for the establishment and launching of the first-ever national mental health helpline.\nHe added that after the establishment and activation of the mental health helpline, there should be a fully coordinated awareness campaign through conventional and social media and other means of communication to sensitize the masses to seek counseling and help through the helpline.\nPresident Alvi called for creating a curriculum on mental health and well-being in coordination with relevant stakeholders from the public and private sectors and teaching it at an appropriate level in educational institutions to sensitize students on stress and tension management during their studies and handling emotional and social issues.\nHe said that such students would also be able to educate their family members regarding the importance of mental health and well-being.\nHe underlined that a separate initiative may be taken to educate parents and family members to remain engaged with their family members and provide mental health counseling and help.\nThe president said that the HEC, universities and teaching hospitals should create additional seats to encourage enrolment in mental health education to create a critical mass of psychologists and psychiatrists to cater to the need of growing mental health issues in society.\nHe also said that the management of the national helpline may also consider engaging final-year students in the psychological and psychiatric disciplines for six-month internships to respond to the queries and provide counseling to the patients using the helpline.\nPresident Alvi appreciated the committee for coming up with a fully integrated comprehensive and all-inclusive first-ever national helpline model with an integrated WhatsApp chatbot, web-based counseling and referral system across the country at par with the world standards.\nThe president said that a separate committee may be set up comprising stakeholders from federal and provincial governments and the private sector and legal fraternity to review all the existing laws and rules that exist at different levels and propose improvements and suggestions while factoring in best practices around the world.\nHe said that it should come up with standardized laws and rules which may later be adopted at the federal and provincial levels to create an interface across the country of the resources and interventions in the mental health sector.\nThe president also took notice of the high suicide rate in certain parts of Gilgit-Baltistan and emphasised the need to carry out a comprehensive study to unearth reasons for such a high rate and put in place a counseling and remedial system to first arrest this trend and later fully eliminate it.\nCountry Director of the World Health Organization (WHO) said that the helpline should be made part of an integrated system of providing mental health services to the masses by integrating the primary, secondary and tertiary health systems at the federal and provincial levels. It should also involve Lady Health Visitors to provide mental health education and information at the grassroots levels and to unprivileged people in underserved areas.\nHe further said that WHO would provide the seed money of Rs 5 million to start the project. He also said that there was a need to establish a sustainable and fully budgeted program to pursue mental health well-being in society.\nThe participants thanked the president for providing his leadership to the stakeholders to develop the model of the first-ever national level mental health helpline by assembling the stakeholders from the public and private sectors and providing them with the motivation to proceed on a timeline basis to achieve the set targets.",
  "retrievedAt": "2025-08-11T16:02:40.394Z"
}
