{
  "title": "Joint session of Parliament (Majlis-e-Shoora) passes 10 bills",
  "link": "https://www.app.com.pk/national/joint-session-of-parliament-majlis-e-shoora-passes-10-bills/",
  "date_published": "2022-12-20T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): The Joint Session of the parliament (Majlis-e-Shoora) on Tuesday passed as many as 10 Bills with majority vote after rejecting amendments in some bills.\nSome amended bills were returned by President Arif Alvi seeking amendments for “consideration and detailed deliberations” by the parliament and its committees.\nThe joint sitting of the Parliament passed the Bill to amend the Global Change Impact Studies Centre Act, 2013 [The Global Change Impact Studies Centre (Amendment) Bill, 2022]. The Bill was moved by Minister for Climate Change Senator Sherry Rehman.\nThe House passed a Bill the Bill further to amend the Public Procurement Regulatory Authority Ordinance, 2002 [The Public Procurement Regulatory Authority (Amendment) Bill, 2022].It was moved by Minister of State for Law and Justice Shahadat Awan.The House passed another Bill seeking to amend and consolidate the laws relating to registration and training of nurses, midwives and Lady Health Visitors (LHVs) [The Pakistan Nursing Council (Amendment) Bill, 2022]. The Bill was moved by Minister for National Health Services, Regulations and Coordination Abdul Qadir Patel.\nJoint Session passed a Bill seeking to provide for governance and operation of the management and financial efficiency of state-owned enterprises owned and controlled by the Federal Government [The State-Owned Enterprises (Governance and Operations) Bill, 2022]. The Bill was moved by Minister of State for Law and Justice Shahadat Awan.\nThe House passed yet another Bill seeking to provide for establishment of the Pakistan Global Institute [The Pakistan Global Institute Bill, 2022]. The bill was moved by Minister for Federal Education and Professional Training Rana Tanveer Hussain.\nThe House passed another Bill seeking to amend the Regulation of Generation, Transmission and Distribution of Electric Power Act, 1997 [The Regulation of Generation, Transmission and Distribution of Electric Power (Amendment) Bill, 2022].The Bill was moved by MNA Qadir Khan Mandokhel.\nThe Majlis- e-Shoora passed yet another Bill to prohibit the business and practices of private money-lending and advancing loans and transactions based on interest [The Islamabad Capital Territory Prohibition of Interest on Private Loans Bill, 2022]. The Bill was moved by Maulana Abdul Akbar Chitrali.\nAnother Bill passed by the Majlis-e-Shoora seeking to give power to make the vaccination for universal immunization of children compulsory and to protect the health workers designated for immunization programs [The Islamabad Compulsory Vaccination and Protection of Health Workers Bill, 2022]. The Bill was moved by MNA Mehreen Razaq Bhutto.\nThe Joint Sitting of the Parliament passed another Bill seeking to repeal the Federal Medical Teaching Institutes Act, 2021 [The Pakistan Institute of Medical Sciences (PIMS) Bill, 2022].It was moved by Dr Mahreen Razzaq Bhutto, MNA of PPP.\nThe Majlis e Shoora also passed seeking to reconstitute the Medical and Dental Council in Pakistan [The Pakistan Medical and Dental Council Bill, 2022]. The Bill was moved by Dr Mahreen Razzaq Bhutto, MNA of PPP.",
  "retrievedAt": "2025-08-11T16:02:39.659Z"
}
