{
  "title": "President stresses adopting preventive measures to avoid diseases",
  "link": "https://www.app.com.pk/national/president-stresses-adopting-preventive-measures-to-avoid-diseases/",
  "date_published": "2023-08-16T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):President Dr Arif Alvi on Wednesday said adopting preventive measures could help people avoiding or minimizing intensity of diseases, and improving the overall health condition of the population of the country.\nHealth and education are the two basic sectors which needed to be put on top priority because nations always build on these two areas, he said while addressing the “Med-Health Expo 2023 and Summit” here.\nThe president said the people specially those with limited resources could easily avoid the chronic diseases such as breast cancer, hepatitis, and communicable diseases by adopting preventive measures.\nWith regard to deteriorating health sector in the country, the president highlighted that lack of decision-making, avoidance of merit and corruption in the past were the main reason behind limited health facilities in the country.\nThe health sector exhibition was organized by Rawalpindi Chamber of Commerce and Industry (RCCI) aimed at information exchange, learning, and cooperation opportunities for health professionals.\nThe two-day event would showcase the latest research and developments in various medical fields through a series of sessions.\nPresident Alvi stressed universities and academia to promote research in the health sector that would bring tremendous improvement in human health.\nHe urged the medical professionals to move along with the world that was doing advance research on human DNA to predict the disease in people.\nHe also called upon the industrialists to produce affordable medical devices to ensure access of people especially from all walks of society to the quality medical facilities.\nPresident Alvi said the industrialists and the exporters should explore big potential markets such as Africa to increase their exports of pharmaceutical and surgical instruments.\nHe informed that some 9 million pregnancies occurred annually in the country out of which 50% were unwanted which could easily be avoided by providing contraceptive facilities to the people.\nSimilarly he said doctors and hospitals should also use the latest technology to provide online healthcare facilities to save resources of both patients and the hospitals. This would also help reaching out to the maximum number of people, he added.\nThe president also stressed the need to provide first aid and cardiopulmonary resuscitation (CPR) training to common people from school levels to save lives of the people in emergencies.\nPresident RCCI Saqib Rafiq said President Dr Arif Alvi and First Lady Samina Alvi played vital role in creating awareness about different diseases especially breast cancer in the country.\nHe said Pakistan’s health sector was facing challenges which needed to be addressed. He said due to lack of awareness and health facilities, 10% of total population was suffering from hepatitis and 34% from stress. Similarly, he said maternal mortality was very high in the country.\nChairman of the event Usman Shoukat called upon the government to focus on health sector and take special measures for uplift of the sector.\nGroup Leader RCCI Sohail Altaf maintained that the government should provide subsidized land and equipments to the private sector to ensure affordable healthcare facilities to the masses.\nOn the occasion, President Alvi also awarded shields to pharmaceutical companies, private hospitals, and medical laboratories for their services in health sector.",
  "retrievedAt": "2025-08-11T09:11:21.139Z"
}
