{
  "title": "IHC declares arrest of Shehryar Afridi, Shandana Gulzar under MPO as illegal",
  "link": "https://www.app.com.pk/national/ihc-declares-arrest-of-shehryar-afridi-shandana-gulzar-under-mpo-as-illegal/",
  "date_published": "2023-08-16T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): The Islamabad High Court (IHC) on Wednesday declared the arrest of PTI leaders Shehryar Khan Afridi and Shandana Gulzar under the Maintenance of Public Order (MPO) as illegal and decided to indict Islamabad’s Deputy Commissioner and Senior Superintendent of Police (Operations) for contempt of court.\nJustice Babar Sattar heard the petitions of Shandana Gulzar and Afridi against their arrests under 3 MPO. Islamabad’s Chief Commissioner, Inspector General of Police, and DC appeared before the court.\nDuring the course of proceedings, the deputy commissioner adopted the stance that as per intelligence reports Sheharyar Afridi had instigated the PTI activists for violence on May 9. A planning was made to attack the district courts and a campaign was also launched to malign the judiciary, he said.\nThe court inquired that how the accused instigated the political workers for violence while staying in jail. The IGP said pre-cautionary steps used to be taken to avert any such violent incident and also to maintain the law and order in the city.\nThe deputy commissioner said that video clips and statements of the accused were on record. He said that the administration had to rely on the reports of intelligence agencies. However, the court remarked that the administration should have applied its own mind after viewing the reports.\nOn the occasion, the deputy commissioner and the SSP Operations submitted their comments against the show-cause notice issued by the court regarding the contempt.\nThe court declared the comments as unsatisfactory and decided to indict the two officers on next hearing for contempt of court.\nThe court also directed the authorities to produce the notification empowering the deputy commissioner for issuance of orders under 3 MPO. It also sought record from the Adiala Jail administration regarding the people who had met Shehryar  while in prison.\nThe IHC declared the orders under 3MPO for arrest of two leaders as illegal and instructed them to remain in the vicinity of capital. The court also instructed them to avoid giving statements on media or social media while adjourning the case for two weeks.\nThe court said that IGP and chief commissioner would be responsible for the protection of the two accused and their production before the court.",
  "retrievedAt": "2025-08-11T09:11:16.224Z"
}
