{
  "title": "SFJ raises £250,000 for 2024 Scotland vote on Khalistan Referendum",
  "link": "https://www.app.com.pk/national/sfj-raises-250000-for-2024-scotland-vote-on-khalistan-referendum/",
  "date_published": "2023-08-16T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):The Sikhs For Justice (SFJ) pro-Khalistan group has collected £250,000 for a Khalistan Referendum vote in Scotland in 2024 in response to the Indian government’s crackdown on Sikh Khalistani activists in the United Kingdom (UK).\nAccording to a message received here, SFJ has managed to accumulate a substantial Khalistan Campaign Fund (KCF) of £250,000, alongside disclosing their strategy to organize a Khalistan Referendum Voting in Scotland in 2024.\nSFJ’s announcement came within three days of UK Security Minister Tom Tugendhat’s visit to India and the UK government’s increased efforts to suppress pro-Khalistan activities.\nThe Khalistan Referendum is causing seismic effects in India, resembling significant explosions, and the eventual partition of the country is becoming unavoidable,” expressed Gurpatwant Singh Pannun, SFJ’s General Counsel. Pannun also noted, “Under UK laws, the obligation to protect the speech and expression rights of the Sikh People falls upon the government of Rishi Sunak.” Gurpatwant Singh Pannun.\nJust last week, UK’s Security Minister Tom Tugendhat revealed a fresh funding of £95,000 (approximately Rs 1 crore) to strengthen the country’s ability in countering “pro-Khalistan extremism.”\nDuring his three-day visit to India, Tom Tugendhat, the UK’s Security Minister, discussed this matter with the British High Commission.\nThey revealed that a £95,000 investment is intended to improve the government’s understanding of the challenges associated with “pro-Khalistan extremism.” This investment will work in tandem with the existing joint efforts between the UK and India through the joint-extremism task force.\nIn a three-day visit to India, Tom Tugendhat, the UK’s Security Minister, engaged in discussions with the British High Commission. The Commission unveiled a £95,000 investment aimed at enhancing the government’s grasp of the complexities linked to “pro-Khalistan extremism.” This financial commitment will collaborate with the ongoing joint initiatives between the UK and India under the joint-extremism task force.\nIn the meantime, the Khalistan flag was hoisted at the Indian Embassy in Washington DC, specifically at the Gandhi Statue, coinciding with India’s Independence Day. SFJ has asserted that 15 August isn’t a day of independence for Sikhs; instead, it symbolizes a day of oppression and mass killings for them",
  "retrievedAt": "2025-08-11T09:11:15.448Z"
}
