{
  "title": "“Pak-Iran friendship significant for region & Muslim Ummah”: Aleem Khan",
  "author": null,
  "content": "ISLAMABAD, Oct 16 (APP): Federal Minister for Communications Abdul Aleem Khan on Thursday said Pakistan’s relationship with Iran is deep rooted and heartfelt bond one that goes beyond diplomacy.\n“Pakistan and Iran are two brotherly Islamic countries, united in spirit and their friendship holds importance not only for this region but for the entire Muslim Ummah,” he said this while addressing a luncheon ceremony hosted by Ambassador of Iran in Pakistan, Dr Reza Amiri Moghaddam in the honor of minister.\nDuring the meeting, both dignitaries warmly welcomed each other and exchanged cordial remarks, underscoring the spirit of friendship between the two brotherly nations.\nAbdul Aleem Khan further said that, by the grace of Allah Almighty Pakistan and Iran have once again come together in mutual goodwill. Whenever Iran has faced a difficult time every Pakistani without any distinction has stood by our Iranian brothers,” he noted.\nEmphasizing the need for a comprehensive strategy and effective measures, the minister said that both sides must overcome bureaucratic red tapeism and traditional delays.\nProposing practical steps to enhance cooperation, Abdul Aleem Khan suggested involving the Ministries of Communications, Commerce, and National Food Security, along with relevant institutions to strengthen collaboration with Iran.\nHe assured that he would continue to play an active role, personally and officially to further strengthen bilateral relations. Welcoming the Minister, Ambassador Dr Reza Amiri Moghaddam praised Abdul Aleem Khan’s significant role and outstanding performance in the Cabinet.\nHe expressed Iran’s desire for long-term trade relations with Pakistan, stating that both countries can expand mutual trade in sectors such as rice, seeds and cotton, thereby benefiting equally through imports and exports. Dr Reza Amiri Moghaddam described the meeting as highly pleasant and productive, appreciating the exchange of ideas and proposals.\nThe Minister emphasized the importance of maintaining regular contact and holding more focused discussions in the future to achieve tangible outcomes.\nConcluding the meeting, he thanked Ambassador Dr Reza Amiri Moghaddam for his warm hospitality and the gracious luncheon, assuring that the Ministry of Communications will always remain at the forefront in fostering cooperation with Iran.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:08:26.459Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-iran-friendship-significant-for-region-muslim-ummah-aleem-khan/",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T16:39:00.000Z"
}
