{
  "title": "SC questions fairness and business impact of Super Tax Law",
  "author": null,
  "content": "ISLAMABAD, Oct 16 (APP):The Supreme Court’s five-member constitutional bench on Wednesday adjourned the hearing of petitions challenging the super tax till Friday. The bench, headed by Justice Amin-ud-Din Khan, comprised Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Ayesha Malik and Justice Hasan Azhar Rizvi.\nAt the outset, Advocate Farogh Naseem concluded his arguments on behalf of several companies. Justice Muhammad Ali Mazhar noted that the super tax law clearly defines the taxable profit threshold. “Companies must pay only what is legally due,” he remarked, adding that the argument presented seemed to suggest imposing tax even on those not liable to pay.\nJustice Mandokhail observed, “You mean there should be no discrimination.” Justice Mazhar further explained that once a tax is imposed under the final tax regime, it cannot be levied again — though the super tax operates as a separate category.\nAdvocate Aziz Nishtar, representing Pakistan Tobacco Company, argued that Article 18 of the Constitution allows the right to conduct business and obliges the state to ensure a favorable business climate. “We are being taxed even without making profits,” he said, adding that the government imposes a super tax whenever it needs quick revenue.\nJustice Mazhar asked whether expanding the tax net could help create a better business environment.\nAdvocate Ijaz Ahmad Zahid contended that the Finance Bill had been passed without meeting the constitutional requirements of Article 73. He recalled that the then-finance minister had announced a two percent super tax on income exceeding Rs300 million and maintained that such policy statements could not precede the formal budget.\nBefore adjourning the case, Justice Mazhar asked whether the dollar exchange rate remained unchanged, to which the lawyer replied that rising global energy prices inevitably push domestic costs upward.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:08:03.879Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-questions-fairness-and-business-impact-of-super-tax-law/",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T18:22:00.000Z"
}
