{
  "title": "ICCI all set to host annual Pink Ribbon Awareness Event on Saturday",
  "author": null,
  "content": "ISLAMABAD, Oct 16 (APP):The Islamabad Chamber of Commerce and Industry (ICCI) is going to organize annual Breast Cancer Awareness Programme (Pink Ribbon) on Saturday, October 18.\nThe ICCI continuing its proud tradition of serving society beyond the business realm, is once again taking the lead in its Corporate Social Responsibility (CSR) efforts and to organize the awareness seminar, said a press release issued here on Thursday.\nThe event will be graced by Governor Punjab Sardar Saleem Haider Khan as the Chief Guest, while Lt. Gen. (R) Nigar Johar Khan (Hilal-e-Imtiaz, Tamgha-e-Imtiaz), Pakistan’s first female three-star general and a symbol of women’s empowerment, will attend as the Special Guest.\nThe high-profile awareness session will also be addressed by Sardar Tahir Mehmood, President ICCI; Tariq Sadiq, Chairman ICCI Founder Group; and Professor Dr. Saeeda Yasmin, eminent General Surgeon and Breast Cancer Specialist, who will highlight the importance of early diagnosis, preventive care, and community awareness in combating the disease.\nIn his message on the occasion, President ICCI Sardar Tahir Mehmood said that the Chamber stands firm in its resolve to promote social and health causes alongside economic initiatives.\nHe added that such events reflect ICCI’s commitment to community wellbeing and that the Chamber will continue to organize awareness programmes in collaboration with public and private stakeholders in the future.\nSardar Tahir Mehmood emphasized that breast cancer is not just a health challenge but a social responsibility, and collective awareness is the first step toward saving lives, thereby  hopefully, women folk in large number will attend the session.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:08:30.851Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/icci-all-set-to-host-annual-pink-ribbon-awareness-event-on-saturday/",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T16:31:00.000Z"
}
