{
  "title": "Pakistan strengthens labour cooperation with Iran, Bangladesh, Kuwait",
  "author": null,
  "content": "ISLAMABAD, Oct 16 (APP): Pakistan has reaffirmed its commitment to promoting safe, orderly, and inclusive labour mobility through stronger regional partnerships with Iran, Bangladesh, and Kuwait.\nThis commitment was expressed by Federal Minister for Overseas Pakistanis and Human Resource Development Chaudhry Salik Hussain during his separate interactions with Bangladesh’s Adviser for Shipping and Labour and Employment Brigadier General retired Dr M Sakhawat Hossain, the Labour Advisor of Iran, and the Secretary of Labour and Manpower of Kuwait, on the sidelines of a regional meeting in Doha.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/10/WhatsApp-Video-2025-10-16-at-8.22.31-PM.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nSecretary Workers Welfare Fund Zulfiqar Ahmad also attended the meetings. During discussions with Iran, both sides agreed to enhance cooperation in labour, employment, and social protection under the existing MoU. They emphasized strengthening the Joint Working Group, collaboration in skills development, social welfare, and social security.\nIn talks with Bangladeshi representative, the two sides agreed to expand collaboration on labour migration, skills certification, and migrant welfare, and explore establishing a Pakistan–Bangladesh Joint Working Group on Labour and Migration.\nChaudhry Salik Hussain offered to host an Expert-Level Meeting to define joint priorities.The Bangladesh side accepted Pakistan’s invitation for a visit, underscoring both countries’ commitment to sharing expertise and strengthening bilateral engagement.\nMeeting the Kuwaiti Secretary of Labour and Manpower, Chaudhry Salik Hussain discussed enhancing manpower cooperation, noting that the MoU with Kuwait is being reviewed and that both sides are preparing a comprehensive action plan for the Pakistani workforce.\nThe Iranian Labour Advisor also expressed gratitude for Pakistan’s support during the Israel conflict and urged the Organization of Islamic Cooperation (OIC) to prioritize youth employment across member states.\nAll three countries recognized Pakistan as a key force within the Muslim Ummah, committed to advancing social justice, the dignity of work, and migrant welfare through active labour diplomacy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:07:38.084Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-strengthens-labour-cooperation-with-iran-bangladesh-kuwait/",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T20:24:00.000Z"
}
