{
  "title": "NA witnesses first ever successful vote of no-confidence in parliamentary history: Pildat",
  "link": "https://www.app.com.pk/national/na-witnesses-first-ever-successful-vote-of-no-confidence-in-parliamentary-history-pildat/",
  "date_published": "2022-04-27T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP): The National Assembly had witnessed the first-ever successful vote of no-confidence in Pakistan’s parliamentary history through which former premier Imran Khan lost the confidence of the house by 174 votes an hour past midnight on Sunday, April 10.\nThe 41st session of the 15th National Assembly was began on March 25 and ended on April 21.\nAccording to PILDAT only two previous Prime Ministers have faced votes of no confidence against them in National Assembly’s history: Benazir Bhutto in 1989 and Shaukat Aziz in 2006 and both survived as the votes of no confidence against them were unsuccessful. Muhammad Shehbaz Sharif, MNA, PML-N was elected as Prime Minister on April 11 as Prime Minister by securing 174 votes.\n“Within working hours, the 15th National Assembly of Pakistan held 12 sittings in 41st session held on March 25, March 28, March 31, April 3, April 9, April 10, April 11, April 16, April 18, April 19, April 20 and April 21.\nHowever, in nearly a month-long session, the National Assembly only met for 24 hours and 10 minutes with an average time of 2 hours and 3 minutes per sitting. The average delay in starting a sitting was 38 minutes per sitting”\n“Over 60.80% agenda items on average were left over in 12 sittings of the 41st session. Notably, on March 31, out of 24 agenda items, only 1 agenda item was taken up and no discussion was held on vote of no-confidence resolution, this was the shortest sitting of the session which lasted only 10 minutes.\nOn April 11, the house completed the whole agenda (100%) of electing the Prime Minister of Pakistan.\nThe maximum agenda items were left over on April 19 when 203 (98.54%) agenda items were left over out of 206.\nIn the last sitting of the 41st session, the house completed the whole agenda including election of the Deputy Speaker of the National Assembly and oath of the Deputy Speaker-elect”.\n“Quorum was not pointed out during the entire 41st session of the 15th National Assembly”\n“Muhammad Shehbaz Sharif, MNA, took oath as Prime Minister of Pakistan on April 11 and attended 2 out of 6 sittings of the National Assembly held on April 11 and April 16.\nHe remained Leader of the Opposition in the National Assembly till April 10 and attended all 6 sittings held on March 25, March 28, March 31, April 3, April 9 and April 10.\nFormer Prime Minister, Imran Khan, MNA, did not attend any sitting of the National Assembly held during the 41st session. On the average, 223 or 65.08% MNAs marked their attendance during the 41st session”\n“Makhdoom Shah Mahmood Hussain Qureshi, MNA, PTI was the most vocal MNA during the 41st session with a recorded talk time of 1 hour and 30 minutes. He remained Federal Minister, Foreign Affairs from August 20, 2018 to April 10, 2022.\nMian Muhammad Shehbaz Sharif, MNA spoke for 1 hour and 19 minute during the session, followed by Khawaja Muhammad Asif, MNA, PML-N who spoke for 52 minutes during the session.  Asad Mahmood, MNA, MMAP spoke for 42 minutes and Shireen M. Mazari, MNA, PTI, spoke for 38 minutes.\nShe remained Federal Minister, Human Rights from August 20, 2018 to April 10, 2022”\n“Only 1 Government bill was introduced during the whole session i.e. The Constitution (26thAmendment) Bill, 2022. No bill was introduced by Private Members.\nAlso no bill was passed by the National Assembly during the session. Neither any Ordinance laid nor extended during 41st session of the National Assembly.”",
  "retrievedAt": "2025-08-11T14:46:35.556Z"
}
