{
  "title": "PM assures steps to protect interests of growers, ensure supply of edibles at affordable prices: Firdous",
  "link": "https://www.app.com.pk/national/pm-assures-steps-to-protect-interests-of-growers-ensure-supply-of-edibles-at-affordable-prices-firdous/",
  "date_published": "2020-04-07T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 07 (APP):Prime Minister Imran Khan on Tuesday assured the Federal Cabinet that\nall necessary initiatives would be taken to protect the interests of farmers\nand ensure supply of edibles items to general public at affordable prices.\nBriefing the media persons about Cabinet meeting, chaired by Prime\nMinister Imran Khan, Special Assistant to the PM on Information and\nBroadcasting Dr. Firdous Ashiq Awan said Special Assistant to the\nPM on Accountability Shahzad Akbar presented the inquiry report\non flour and sugar crisis before the Cabinet at the outset of meeting\non the directives of the Prime Minister.\nShe said Shahzad Akbar informed the Cabinet that the concerned\nministry had presented the report in the ECC meeting that there was\nabout 2 million tones surplus sugar available in the country.\nShe said that after bumper crop of the sugarcane, the mill owners\npleaded that they were unable to purchase the same due to already\navailable stock. In this situation the PM was briefed that for saving\nthe interest of the farmers, it was necessary to hold consultations\nwith mill owners and take export-oriented initiative.\nShe said that the PM issued directives for resolution of the farmers\nproblems, however the federal government did not give any subsidy\non the export of sugar.\nShe said the Cabinet was informed that in 2017, Salman Shahbaz, the\nson of former chief minister Punjab Shehbaz Sharif approached the then\nPM Shahid Khaqan Abbasi to give Rs 20 billion subsidy for sugar export.\nSimilarly during 2014-18, Sindh government gave Rs 20 subsidy per\nkilogram on the sugar to benefit Omni group.\nThe SAPM said the present government for the first time since 2014\nincreased the price of sugarcane to protect the interests of the\ngrowers. The government has decided to take strict action against\nthose involved in artificial crisis of wheat and sugar after release\nof Inquiry Commission’s final report on April 25, she said.\nShe said that after inquiry report, specific questions arose about\neffectiveness of the sugar policy. She said that the Cabinet decided\nto take corrective measures to save the people from any such\nartificial crisis in future.\nShe said that it was decided to introduce reforms in Competition\nCommission of Pakistan to make it an effective origination to control\ncartelization. Besides, modern technology would be introduced in\ncollection and maintenance of sugar industry data so that nobody\ncould hoodwink the system in future, she added.\nFirdous Ashiq Awan said the prime minister has warned that strict\naction would be taken against those found involved in hurling threats\nto the Commission.\nThe Special Assistant said the Prime Minister has directed to resolve\nthe issues being faced by growers and farmers on immediate basis.\nShe said the government machinery was fully active to ensure the\navailability of quality edibles at affordable prices and no negligence\nwould be tolerated in this regard.\nGiving details of the Cabinet agenda, she said that it gave approval\nto the decisions of Cabinet committee on energy besides approving\ninclusion of 62 more districts in universal service fund to improve\nbroadband service there.\nShe said that the Cabinet approved proposals regarding revamping,\nreconstructing and reorganizing Evacuee Trust Property Board and\ngave approval to utilization Evacuee Trust Board land for welfare\npurposes including health, education and housing sectors.\nDr Firdous said that Special Assistant on Social Protection Dr Sania\nNishtar gave detailed briefing to the Cabinet on Ehsaas Emergency\nCash Programme. She said that the Cabinet was informed that the\nfederal government was providing cash assistance worth Rs12,000\nto over 12 million deserving families under Ehsaas Emergency Cash\nProgramme following coronavirus outbreak in the country.\nThe deserving families, she said, would get this cash assistance\nafter biometric verification through over 18,065 sale points or retail\nshops across the country.\nShe said that Special Assistant to the Prime Minister on Health Dr\nZafar Mirza briefed about the current the situation of ongoing coronavirus\nand the relief steps being taken. He informed the meeting that so far\n3864 coronavirus patient had been registered in the country and 54\ndeaths have been confirmed.\nShe said that the Prime Minister expressed his annoyance over the\ntreatment meted out to doctors in Balochistan and said that doctors\nand paramedical staff were the frontline soldiers in war against corona\nand it was responsibility of the concerned governments to provide them\nprotective gears so that they could focus on their work.\nThe Cabinet was informed that so far over 39,000 protective kits have\nbeen handed over to the provinces but these have not reached the\nhospitals in enough numbers. The Cabinet decided that from now onward,\nthese kits would be directly sent to the Medical Superintendents of the\nhospitals through courier service to speed up the delivery process.\nShe said that SAPM on Youth Affairs Usman Dar was specially invited\nin the meeting who briefed it about the registration of volunteers for\nTiger Volunteer Force. He said that so far 7,17,199 persons have\nregistered themselves for the force which would work at district,\nTehsil and union council level to support the district administration\nin rescue, relief and rehabilitation activities, she added.",
  "retrievedAt": "2025-08-11T19:03:40.575Z"
}
