{
  "title": "Low level business activity imperative to control poverty: Shafqat",
  "link": "https://www.app.com.pk/national/low-level-business-activity-imperative-to-control-poverty-shafqat/",
  "date_published": "2020-04-07T01:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP):Minister for Education and Professional Training, Shafqat Mehmood on Tuesday said low level business activity was necessary to control poverty in the country.\nIn light of the crucial situation emerged due to spread of coronavirus around the world, the present government had permitted the construction industry to open business in order to provide relief to labor community, he stated while talking to a private news channel.\nHe said a television channel for imparting education on different subjects covering disciplines of classes I-XII, would be launched in the next week so that difficulties being faced by the students in Pakistan could be addressed in a proper manner.\nThe public and private sector, he said had already made Online system for students living in remote and far flung areas of the country.\nTo a question about connectivity issue, the minister said the services of Universal Services Fund had been acquired for uninterrupted internet facility in the trouble regions particularly federally administered tribal areas (FATA), and Azad Jammu and Kashmir (AJK).\nTo another question, he said in case of extension of lock-down period, distance learning system and online system would continue across the country.\nAbout sugar and wheat crisis report, he said the details would be appeared before public on April 25, and till then, “we should avoid playing politics or commenting on this matter.”\nIn reply to a question about rising poverty cases due to continuous lock-down, he said the incumbent government had allocated an amount of Rs.1200 billion and in the first phase, the funds would be disbursed among the poor families in next few days.",
  "retrievedAt": "2025-08-11T19:03:46.627Z"
}
