{
  "title": "Every citizen counts as nation striving to contain COVID-19 : COAS",
  "link": "https://www.app.com.pk/national/every-citizen-counts-as-nation-striving-to-contain-covid-19-coas/",
  "date_published": "2020-04-07T02:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 07 (APP):Chief of Army Staff (COAS) General Qamar Javed Bajwa Tuesday said every citizen of the country was important as the nation was striving to contain the pandemic of Corona virus or COVID-19.\nPresiding over the 231st Corps Commanders’ Conference here, the COAS said:\n“Being a nation with vibrant youth and resilient people ready to share and sacrifice,  we will emerge stronger from this challenge, by the Will of Allah Almighty.”\nCorps Commanders participated through video link from respective Headquarters, an Inter Services Public Relations (ISPR) press release said.\nAppreciating the troops in the field for efforts so far, the COAS directed all\ncommanders to extend maximum assistance in moving critical resources and\nreaching out to mitigate suffering of people in far flung areas including\nGilgit-Baltistan, Azad Jammu and Kashmir, Interior Sindh and Balochistan.\nThe forum reviewed geo-strategic, regional and national security environment\nwith particular emphasis on latest situation arising from COVID-19.\nThe forum under took comprehensive review of deployment of Pakistan army\ntroops assisting civil administration in aid of civil power across the country.\nIt as apprised on functioning of National Command and Operation Centre\n(NCOC), established to synergise and articulate National effort for containment of COVID-19.\nThe forum paid tribute to those on frontline including doctors, paramedics,\nhealthcare workers and LEAs for braving this pandemic under challenging\nenvironment.\nIt also paid tribute to the Kashmiri people who are fighting the pandemic\nunder Indian atrocities and struggling for their just cause of self-determination.",
  "retrievedAt": "2025-08-11T19:03:40.534Z"
}
