{
  "title": "NA Speakers condoles with Foreign Parliaments’ Speakers over loss of lives due to COVID-19",
  "link": "https://www.app.com.pk/national/na-speakers-condoles-with-foreign-parliaments-speakers-over-loss-of-lives-due-to-covid-19/",
  "date_published": "2020-04-07T00:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP):National Assembly Speaker Asad Qaiser Tuesday offered deep condolences over the precious loss of lives due to coronavirus pandemic through letters addressed to the Parliaments’ Speakers of China, Kingdom of Saudi Arabia, Turkey, United States of America, United Kingdom, United Arab Emirates, Italy, Iran and Spain.\nIn his epistle to the Chairman of the National People’s Congress of China, he wrote, “It is indeed inspiring for the rest of the world the way government of the People’s Republic of China checked the vicious spread of virus. We are also thankful to the Chinese government for the care that they extended to the affected Pakistani student communities in China. We are also indeed grateful for the extensive support that China continues to render to Pakistan in addressing this public health crisis in the country”, said a press release.\nIn his letter to the Speaker of US House of Representatives, Ms Nancy Pelosi, the Speaker underlined the need for international cooperation. He remarked that relief in debt repayments and relaxation of international sanctions on states could be important steps in such international cooperation.\nIn his missive to the Speaker of British House of commons, the Speaker expressed his hope for the early and complete recovery of Prime Minister Boris Johnson.\nThe Speaker inter-alia wrote to the Speaker of Grand National Assembly of Turkey that Pakistan was attempting to strike a balance between the need to arrest transmission of the disease through social distancing and other measures and keeping the wheels of the economy moving.\nIn his letter to the Speaker of Majlis of Iran, Asad Qaiser not only expressed prayers for his early recovery but also highlighted the call by Prime Minister Imran Khan for debt relief and restructuring for the developing countries to create the fiscal space needed to save human lives and shore up economies.\nThe Speaker in his letters to Speakers of Shura of Kingdom of Saudi Arabia, National Assembly of United Arab Emirates, Italy, Iran and Spain expressed his heartfelt condolence on loss of precious lives of their citizens and reiterated Pakistan’s resolve to jointly fight that pandemic.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:03:47.900Z"
}
