{
  "title": "May 9 tragic events a wake-up call for us: PM",
  "link": "https://www.app.com.pk/national/may-9-tragic-events-a-wake-up-call-for-us-pm/",
  "date_published": "2023-05-25T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Prime Minister Shehbaz Sharif on Thursday calling the tragic and heart-rending events of May 9 a wake-up call, said the nation has to identify and expose all such people who wanted to destroy the foundations of Pakistan.\n“May 9 has drawn up a dividing line between the protectors and builders of Pakistan and those who wish to weaken it,” the prime minister said in a tweet as the nation observed Youm-e-Takreem Shuhada-e-Pakistan.\nThe day is being observed to pay a glowing tributes to the nation’s heroes, Ghazis, and martyrs and express its unflinching solidarity with their families.\nThe prime minister said that he did not see the tragic incidents of May 9 as merely a protest that became violent.\nInstead, he said the designs of those who planned them were actually very sinister.\nHe said there was a clear build-up to the shameful incidents, as the whole nation witnessed in “utter disbelief and a state of shock” how the lust of some people for power made them do what was never done before.\nPrime Minister Shehbaz said that by targeting, desecrating and destroying the monuments of Shuhada, and attacking the very symbols of the State, the miscreants attacked the idea & identity of Pakistan and gave the enemies of the country reasons to celebrate.\n“Our nation knows how to protect the honour of their martyrs,” he commented and said on the day, the nation revived and reiterated its pledge to uphold the honour and respect of its Shuhada.\nHe said the essence of Pakistan’s existence lies in the spiritual covenant between its people and the martyrs.\n“The creation of Pakistan is a miracle of the 20th century and its edifice stands on the sure foundation of their sacred blood. We will never be able to thank them enough,” the prime minister remarked.",
  "retrievedAt": "2025-08-11T08:33:34.350Z"
}
