{
  "title": "Pakistan’s former permanent envoy to UN Amb. Ahmad Kamal passes away in New York",
  "link": "https://www.app.com.pk/national/pakistans-former-permanent-envoy-to-un-amb-ahmad-kamal-passes-away-in-new-york/",
  "date_published": "2023-05-25T09:44:00.000Z",
  "source": "APP",
  "content": "NEW YORK, May 25 (APP): Pakistan’s eminent diplomat and former Permanent Representative to the United Nations Ambassador Ahmad Kamal passed away in New York on Thursday. He was 85.\nDuring his 40-year-long career with the Ministry of Foreign Affairs of Pakistan, Ambassador Kamal held diplomatic postings in India, Belgium, France, the Soviet Union, Saudi Arabia, and Republic of Korea and had a decade-long assignment as a Permanent Representative of Pakistan to the United Nations in New York and Geneva.\nAt the UN, Ambassador Kamal was elected to many high posts, notably as Vice President of the General Assembly, President of the Economic and Social Council, Chairman of the Consultations on the Role of NGOs at the United Nations, Chairman of the Working Group on Informatics, Chairman of the Board of Trustees of the United Nations Institute of Training and Research, and a member of the United Nations Advisory Committee on Administrative and Budgetary Questions.\nAmbassador Kamal served as a special advisor to the UN Secretary-General from 2011 to 2016. He was a Senior Fellow of the United Nations Institute of Training and Research and responsible for the training of diplomats posted to the United Nations. He was the Founding President and CEO of The Ambassador’s Club at the United Nations and also served as a Board Member of the International Association of Permanent Representatives.\nThroughout his distinguished career, Ambassador Kamal was widely recognized for his exceptional diplomatic skills and his tireless efforts in bridging cultural divides.\nWith a keen understanding of geopolitical dynamics, he navigated intricate negotiations and mediated conflicts, always seeking peaceful resolutions and promoting dialogue.\nAmbassador Kamal was a graduate of the Paris Institute of Political Studies (better known as Sciences Po) and the Fletcher School of Law and Diplomacy at Tufts University, USA. He was also a Carnegie Foundation Fellow at the London School of Economics.\nHe was the author of several important publications, on disarmament, management, multilateralism, global economic issues, and the technical aspects of informatics and information technology. He was an Honorary Visiting Professor at several universities in the United States, and a member of the board of trustees of Fairleigh Dickinson University. He received numerous honors in Pakistan and several other countries.\nAmbassador Kamal received several awards for his remarkable diplomatic service, including the Tamgha-i-Pakistan (Pakistan Medal) by the Government of Pakistan in 1971 and the Gwanghwa Medal, (Order of Diplomatic Service Merit) by the Government of the Republic of Korea in 1987. Within his personal sphere, Ambassador was a pillar of strength and love for his family and friends.\nHe leaves behind his wife Asma, son Omar, daughter Ayesha, and grandson Zain.",
  "retrievedAt": "2025-08-11T08:33:37.699Z"
}
