{
  "title": "MoL&J launches Prohibition of Corporal Punishment Rules in ICT",
  "link": "https://www.app.com.pk/national/molj-launches-prohibition-of-corporal-punishment-rules-in-ict/",
  "date_published": "2023-05-25T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Ministry of Law and Justice, Ministry of Federal Education and Professional Training, the Parliamentary Caucus on Child Rights, and UNICEF Pakistan came together in a momentous collaboration to successfully launch the “Islamabad Capital Territory Prohibition of Corporal Punishment Rules, 2022.”\nThis event took place at the Islamabad Model College for Girls (IMCG), F-10/2.\nThe Federal Minister for Law and Justice, Azam Nazir Tarar congratulated the stakeholders in getting the corporal punishment rules implemented.\nHe underscored that morals and values can’t be imparted through coercion or punishment and remarked that it was a late step but in the right direction. “The implementation of these rules from today shall serve as the building block in achieving our greater vision aimed at the well-being of our children; the ultimate future of Pakistan.”\nHe further pledged his commitment to fully support the cause of child rights and related legislation in the future as well.\nThe launch of the “Islamabad Capital Territory Prohibition of Corporal Punishment Rules, 2022” marks a historic milestone in the relentless pursuit of protecting children from the scourge of corporal punishment within the capital territory.\nThese comprehensive rules which stand implemented today, fall under the “Prohibition of Corporal Punishment Act, 2021” reinforcing the commitment of the government and stakeholders to eliminate corporal punishment and create a safe environment for children.\nThe Principal of Islamabad Model College for Girls F-10/2 acknowledged the relentless efforts of Minister for Law and Justice Senator Azam Nazir Tarar and Mehnaz Akber Aziz and expressed her gratitude for the collaborative efforts of the Ministry of Federal Education and Law in their commitment to champion the cause against corporal punishment.",
  "retrievedAt": "2025-08-11T08:33:30.977Z"
}
