{
  "title": "Indonesian defence minister expresses Jakarta’s desire to boost defence ties with Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "Indonesia’s Defence Minister Lt Gen (retired) Sjafrie Sjamsoeddin expressed his country’s desire to boost defence ties and explore possible collaboration in defence production as he met with Prime Minister Shehbaz Sharif in Islamabad on Tuesday.\n\nPakistan and Indonesia maintain strong bilateral relations rooted in shared religion and culture, with both countries cooperating in trade, education, and health.\n\nGen Sjamsoeddin called on PM Shehbaz at the PM Office today, where he reiterated Indonesia’s desire to “further strengthen defence ties with Pakistan and to explore possible areas for cooperation, especially in defence production”, according to a statement from government-run PID.\n\nThe Indonesian minister conveyed the best wishes of President Prabowo Subianto for the prime minister and people of Pakistan, the press release added.\n\nMeanwhile, PM Shehbaz “reaffirmed Pakistan’s commitment to explore and expand collaboration with Indonesia in joint ventures of investment in mutually beneficial projects”, the statement said.\n\nThe prime minister also reiterated Pakistan’s commitment to enhance bilateral cooperation with Indonesia in all avenues, including economic, strategic and trade sectors, along with defence and defence production.\n\nHe highlighted that Pakistan and Indonesia enjoyed a “longstanding friendship rooted in shared cultural, religious and historical bonds, supporting each other at international forums”.\n\nBoth sides stressed the importance of “enhancing multifaceted bilateral cooperation”, according to the PID.\n\n“The meeting underscored the deep-rooted historical, brotherly and friendly bilateral relations between Pakistan and Indonesia,” the statement noted.\n\nRecalling his meeting last year with Indonesia’s President Prabowo Subianto on the sidelines of Developing-8 Summit in Cairo, PM Shehbaz conveyed his best wishes for the Indonesian president.\n\nThe prime minister also reviewed ongoing initiatives under the Pakistan-Indonesia Defence Cooperation Agreement and agreed to “accelerate the implementation of key areas of mutual interest”, the PID added.\n\nGen Sjamsoeddin later met Chief of Army Staff Field Marshal Asim Munir at General Headquarters.\n\nBoth sides exchanged views on bilateral defence collaboration, regional security dynamics and avenues to further strengthen military ties.\n\n“The meeting underscored the longstanding friendship and cooperation between the two countries. Field marshal highlighted the importance of mutual cooperation in maintaining peace and stability in the region,” said a press release from the Inter-Services Public Relations.\n\nGen Sjamsoeddin appreciated the role of the Pakistan Army in the fight against terrorism and reaffirmed Indonesia’s commitment to enhancing defence relations with Pakistan.\n\nIn June, the two countries decided to increase cooperation in areas such as vaccine production in Pakistan, the establishment of medical institutions in Indonesia, pharmaceutical development and human resource exchange.\n\nLast year, Indonesian Charge d’Affaires Rahmat Hindiarta hosted an exclusive dinner for Pakistani business leaders and their spouses at the Indonesian Embassy to enhance bilateral finance and trade relations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1513543086c01cd.png",
  "retrievedAt": "2025-08-17T20:29:12.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924358/indonesian-defence-minister-expresses-jakartas-desire-to-boost-defence-ties-with-pakistan",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T10:45:50.000Z"
}
