{
  "title": "Six killed, dozens injured in widespread rain in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Six people died and dozens injured in rain-related incidents as widespread rain hit most parts of Punjab on Monday, submerging low-lying areas and triggering power outages.\n\nIn the last 24 hours, Lahore recorded 20.9mm rain, Okara 72mm, Sahiwal 66mm, Dera Ghazi Khan 51mm, Mianwali 38mm, Bahawalpur 36mm, Kot Addu 33mm, Gujranwala 30mm, Layyah 23mm and Murree 22mm.\n\nRain was also recorded in Rawalpindi, Attock, Sialkot, Faisalabad, Toba Tek Singh, Rahim Yar Khan, Multan and Lodhran.\n\nIn Okara, lightning killed two farm workers near Haveli Lakkha area.\n\nRescue 1122 said 19 people were injured in Okara district in different incidents.\n\nIn Bahawalnagar, two students were killed and 12 others injured when the roof of a seminary-cum-mosque collapsed due to rain in Minchinabad on Sunday night.\n\nIn Sahiwal, a man died while two others were injured in roof collapse incidents caused by heavy showers in villages 147/EB and 14/SP, Arifwala tehsil.\n\nIn Kasur, a woman died while her husband and son suffered injuries as the roof of the room they were sleeping in collapsed due to heavy spell of rain, on Monday, in Nathowala village, in the limits of Saddar police station.\n\nIn Toba Tek Singh, four people were critically injured in a roof collapse.\n\nFORECAST: Rain is likely in most districts of Punjab in the next 24 hours.\n\nThe third spell of monsoon is predicted to last till July 17, according to a weather advisory issued by the Pakistan Meteorological Department (PMD).\n\nRain-wind/thundershower with scattered heavy falls (at times very heavy/extremely heavy) is expected in Islamabad/Rawalpindi, Murree, Galiyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Wazirabad, Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Okara, Kasur, Khushab, Sargodha, Bhakkar, Mianwali, Bahawalpur, Bahawalnagar, DG Khan, Multan, Khanewal, Lohdran, Muzaffargarh, Rajanpur, Rahim Yar Khan, Kot Addu and Layyah from July 14 (evening) to 17 with occasional gaps.\n\nProvincial Disaster Management Authority (PDMA) Director General Irfan Ali Kathia said the water flow in most rivers of Punjab was normal. He said that there was moderate flood at Taunsa in the river Indus.\n\nHe said the flow of water in Chenab, Ravi, Jhelum and Sutlej was at normal level. The flow of water in Rajanpur hill torrents was also normal. A high level of flood is passing through Dera Ghazi Khan’s Vidor and Rudkohi torrents.\n\nIn view of the emergency situation, he directed the district administration and related institutions to remain alert. There is a possibility of further increase in the flow of water in rivers and streams due to monsoon rains.\n\nThe PDMA has issued a monsoon rain alert across the province. Thunderstorms and lightning are expected in most districts of Punjab from July 15 to 17.\n\nRains are expected in Rawalpindi, Murree, Galiyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujranwala, Hafizabad, Wazirabad.\n\nRains will also occur in Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal, Jhang, Toba Tek Singh, Nankana, Chiniot and Faisalabad.\n\nHeavy rains with thundershowers are expected in Okara, Kasur, Khushab, Sargodha, Bhakkar and Mianwali. Thunderstorms are also expected in Bahawalpur, Bahawalnagar, DG Khan, Multan, Muzaffargarh, Khanewal, Lodhran, Rajanpur, Rahim Yar Khan and Layyah from the evening of July 14 to 17.\n\nPDMA DG Mr Kathia issued instructions to the commissioners and deputy commissioners across the province to remain alert.\n\nHe said that there are concerns about an increase in water levels in the rivers and adjacent streams of Punjab.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6875d046deb9b.jpg",
  "retrievedAt": "2025-08-17T20:29:56.644Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924325/six-killed-dozens-injured-in-widespread-rain-in-punjab",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:50:39.000Z"
}
