{
  "title": "FIA gets remand of two senior Pak­istan Agricultural Research Coun­cil officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A local court in Islamabad on Monday granted the FIA a three-day physical remand of Pak­istan Agricultural Research Coun­cil (PARC) Chairman Dr Ghulam Muhammad Ali and Director Establishment Akhlaq Malik in a case related to illegal recruitment and misuse of authority.\n\nJudicial Magistrate Ahmed Shahzad Gondal authorised the remand, transferring both officials into the FIA’s custody.\n\nThe two officials were arrested and presented before the court by FIA investigators. The FIA alleges Mr Ali recruited 332 people for only 164 approved positions, a violation of official procedures.\n\nInvestigators, who had initially sought a 14-day remand, also claimed the process involved bribery and manipulation.\n\nA total of 19 officials have been nominated in the case.\n\nIn court, Mr Ali maintained his innocence, saying that all recruitments were made through a transparent process. He said the vacancies had been duly advertised and that selection committees had been formed to oversee the hiring.\n\nIn granting the shorter three-day remand, the judge noted that the investigation was in its early stages.\n\n“An investigation is yet to be conducted and things will come to light,” Magistrate remarked.\n\nLast month, the ministry ordered Ali’s office sealed, though it was later opened on an order from the Islamabad High Court.\n\nMr Ali was awarded the Tamgha-i-Imtiaz by the government of Pakistan in March for his services in the agricultural sector.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/15104552f20b1f9.png?r=104807",
  "retrievedAt": "2025-08-17T20:31:21.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924288/fia-gets-remand-of-two-senior-pakistan-agricultural-research-council-officials",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:13:42.000Z"
}
