{
  "title": "Fazl not willing to join ‘regime change’ efforts - Pakistan - DAWN.COM",
  "author": null,
  "content": "• JUI-F chief says that despite their differences, he won’t stoop to PTI’s level of discourse\n• Asks why state institutions have failed to ensure peace in KP\n\nCHARSADDA: Expressing his reluctance to join any attempt to bring about a regime change in Khyber Pakhtunkhwa, Maulana Fazlur Rehman said on Monday that a no-trust vote may not be possible, given how the fragmented nature of the opposition in the provincial assembly.\n\n“The opposition is busy trying to disqualify one another in courts. Even the PML-N has taken us to court,” the JUI-F chief mused during a visit to Charsadda.\n\nHe was talking to reporters during a visit to the area where he inquired after the health of party’s district emir and former legislator Maulana Gohar Shah.\n\n“They should reflect on who is benefitting from their actions. One must think a hundred times before aligning with such an opposition,” he said.\n\nThe JUI-F chief also downplayed the possibility of bringing a no-confidence motion against the incumbent PTI-led government in the province — something that KP Governor Faisal Karim Kundi has hinted at in recent days.\n\nThe governor had recently called on the Maulana alongside a PPP delegation — ostensibly to invite him to join efforts to de-seat the PTI-led government in the province — but the JUI-F chief reportedly did not commit to anything.\n\n“It’s difficult to implement any major political strategy with a divided opposition. Who is even ready for a no-confidence motion? The opposition itself is in disarray,” the Maulana said on Monday.\n\nTurning his attention to the PTI, he reiterated his remarks from a few days ago, saying: “In Khyber Pakhtunkhwa, there is a need for change, but that change should come from within the PTI”.\n\n“Those in power in KP today use vulgar language,” he noted, adding that despite their differences with the PTI, he would not stoop to respond to the harsh and insolent barbs levelled by his political rivals.\n\nThe Maulana said that maintaining composure and a respectful environment was one of his objectives, no matter how many differences he had with political opponents.\n\nBlaming the government and state institutions for the unrest prevailing in tribal areas of KP, the JUI-F chief said: “If they can defeat India in a matter of unrest going on for the past 40 years.”\n\nHe accused the government and institutions of blaming the public for their own failures. He said the people of Swat and Waziristan were still refugees in their own homeland.\n\n“The establishment is primarily responsible for the prevailing unrest, not the people. It’s unfortunate that instead of introspection, the blame is placed on the public. Declaring the public as a threat or a ‘shelter’ for unrest is not just misleading but unjust.”\n\n“People of Waziristan are once again being asked to leave their homes, why? Don’t burden us with your failures. Look in the mirror,” he remarked.\n\nHe also called for sincere diplomatic engagement with Afghanistan. “We usually act first and then talk, but the real solution lies in negotiation. All issues can be resolved through dialogue. Pakistan must adopt a path of serious negotiations to improve relations with Afghanistan.”\n\nThe JUI-F chief also offered condolences to the family of the late Maulana Muhammad Tayyab, the party’s patron-in-chief in Charsadda.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/6872f52a119e3.jpg",
  "retrievedAt": "2025-08-17T20:31:38.634Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924279/fazl-not-willing-to-join-regime-change-efforts",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:10:30.000Z"
}
