{
  "title": "Met Office warns of more countrywide rains - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Pakistan Meteorological Department (PMD) on Monday issued warning of torrential rains with wind-thundershowers that will last throughout the country till July 17.\n\nAccording to the Met Office, a low pressure area presently located over northwest Madhya Pradesh (India) is likely to affect Pakistan during next 24 to 72 hours. Under the influence of this weather system, strong monsoon currents are expected to penetrate central and upper parts of the country.\n\nA westerly wave is also present over upper parts of the country. Due to these meteorological conditions, rain-wind/thundershower with scattered heavy falls (at times very heavy) is expected in Kashmir (Neelum valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur) from July 14 (night) to July 17, while rain-wind/thunderstorm (with isolated heavyfalls) is expected in Gilgit-Baltistan (Diamer, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche and Shigar) on July 15 to 17 with occasional gaps.\n\nIn Khyber-Pakhtunkhwa, rain-wind/thundershower with scattered heavy falls (at times very heavy/extremely heavy) is expected in Dir, Chitral, Swat, Kohistan, Malakand, Shangla, Battagram, Buner, Kohat, Karak, Bannu, Tank, Lakki Marwat, Dera Ismail Khan, Bajaur, Mohmand, Khyber, Waziristan, Orakzai, Mansehra, Abbottabad, Haripur, Peshawar, Charsadda, Nowshera, Mardan, Swabi, Hangu and Kurram from July14 (night) to July 17 with occasional gaps.\n\nSimilarly, in Punjab and Islamabad, rain-wind/thundershower with scattered heavy falls (at times very heavy/extremely heavy) is expected in Islamabad and Rawalpindi, Murree, Galliyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Wazirabad, Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Okara, Kasur, Khushab, Sargodha, Bhakkar, Mianwali, Bahawalpur, Bahawalnagar, D.G. Khan, Multan, Khanewal, Lodhran, Muzaffargarh, Rajanpur, Rahimyar Khan, Kot Addu and Layyah from July 14 (evening) to 17th with occasional gaps.\n\nRain-wind/thundershower with scattered heavy falls (at times very heavy) is expected in northeastern and southern parts of Balochistan, including Quetta, Zhob, Qilla Saifullah, Qilla Abdullah, Ziarat, Sherani, Musakhel, Loralai, Sibbi, Bolan, Barkhan, Naseerabad, Kalat, Lasbela, Khuzdar, Awaran, Jaffarabad, Dera Bugti and Kohlu from July 14 to 16th.\n\nSindh is expected to receive rain-wind/thundershower in Tharparkar, Mirpur Khas, Sanghar, Sukkur, Larkana, Dadu, Jacobabad, Khairpur and Shaheed Benazirabad from July 14 to 16th with occasional gaps. Light rain is also expected in Karachi.\n\nThe PMD warned that torrential rains might generate flash floods in local nullahs and streams of Chitral, Dir, Swat, Shangla, Mansehra, Kohistan, Abbottabad, Buner, Charsadda, Nowshera, Swabi, Mardan, Murree, Galliyat, Islamabad and Rawalpindi, hill torrents of D.G. Khan, northeast Punjab, Kashmir and parts of Balochistan from July 14 (evening/night) to July 17.\n\nHeavy downpour may cause urban flood in low-lying areas of Islamabad, Rawalpindi, Gujranwala, Lahore, Sialkot, Sargodha, Faisalabad, Khanewal, Multan, Sahiwal, Okara, Bahawalpur, Bahawalnagar, Vehari, Nowshera and Peshawar from July 14 (evening/night) to 17th.\n\nLandslides or mudslides may cause road closure in vulnerable hilly areas of Khyber Pakhtunkhwa, Murree, Galliyat, Kashmir and Gilgit-Baltistan from July 14 to 17th.\n\nHeavy falls/windstorm and lightning may damage weak structures like roof and walls of houses, electric poles, bill boards, vehicles and solar panels during the forecast period.\n\nTorrential rain may damage standing crops in Punjab, Khyber Pakhtunkhwa and Kashmir. The Met Office also advised public, travelers and tourists to avoid unusual exposure in vulnerable areas to avoid any untoward situation and keep updated about any change in weather conditions.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687580ca6a36d.jpg",
  "retrievedAt": "2025-08-17T20:30:19.286Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924232/met-office-warns-of-more-countrywide-rains",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:14:17.000Z"
}
