{
  "title": "China, India should work towards ‘win-win’ cooperation: FM Wang - World - DAWN.COM",
  "author": null,
  "content": "Chinese Foreign Minister Wang Yi said on Monday that Beijing and New Delhi should work towards mutual trust and “win-win” cooperation, after talks with his Indian counterpart Subrahmanyam Jaishankar, state news agency Xinhua reported.\n\nChina and India should “adhere to the direction of good-neighbourliness and friendship” and “find a way for mutual respect and trust, peaceful coexistence, common development and win-win cooperation”, Wang said, according to Xinhua.\n\nThe two foreign ministers met in Beijing on Monday as the two rivals seek to repair ties following a 2020 clash on their border.\n\nThe world’s two most populous nations are intense rivals competing for strategic influence across South Asia, and their 3,500-kilometre frontier has been a perennial source of tension.\n\nThe 2020 clash between their troops led to a four-year military standoff, but they agreed in October on patrols in disputed areas.\n\nIndia’s Prime Minister Narendra Modi and China’s President Xi Jinping met for the first time in five years later that month, agreeing to work on improving relations.\n\nNew Delhi is concerned over Beijing’s increasing presence in the Indian Ocean, seeing the region as firmly within its sphere of influence.\n\nAnother source of tension is the Dalai Lama, the Tibetan spiritual leader India has hosted since he and thousands of other Tibetans fled Chinese troops who crushed an uprising in their capital Lhasa in 1959.\n\nThe 90-year-old Dalai Lama says only his India-based organisation has the right to identify his eventual successor.\n\nChina insists that it would have the final say on who succeeds the Tibetan spiritual leader.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/151639351f76f0e.png",
  "retrievedAt": "2025-08-17T20:29:13.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924368/china-india-should-work-towards-win-win-cooperation-fm-wang",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T11:34:23.000Z"
}
