{
  "title": "ECP seeks KP Assembly session to swear in MPAs on reserved seats - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Writes to KP governor, chief minister; says delay in oath taking would prevent it from holding Senate elections on schedule\n• Commission reserves verdict on plea seeking redistribution of reserved seats in provincial assembly\n\nISLAMABAD: With Senate elections in Kh­yber Pakhtunkhwa (KP) just a week away, the Election Commission of Pakistan (ECP) has written to the province’s governor and chief minister, asking that the provincial assembly be convened immediately so that new members can be sworn in on reserved seats.\n\nAlso on Monday, the ECP reserved its verdict in a case related to reallocation of reserved seats in the KP Assembly.\n\nThe letter, addressed to the KP governor’s principal secretary, stated that the commission was obligated to conduct Senate elections in the province, which had been set for July 21.\n\n“But the matter of administration of oath is still pending and dela­yed,” it said.\n\nThe correspondence no­ted that the KP Asse­mbly speaker was requ­ested to administer the oath to the newly returned candidates, enabling them to complete the electoral college for Senate elections.\n\nIn response, the speaker has conveyed that the oath will be administered when the assembly is in session.\n\n“The Commission has also received a copy of the letter of the Leader of the Opposition, attached with the application submitted by Mr Suresh Kumar MPA and others in this Comm­ission, wherein the Spe­aker has stated that neither the Constitution nor the Provincial Asse­mbly of Khy­ber Pakht­unkhwa Proce­dure and Con­duct of Business Rules, 1988, contain any provision empowering the Speaker to summon a session of Assembly on his own,” it said.\n\nNoting that the administration of oaths has already been delayed considerably, it asked the governor to summon the assembly at the earliest.\n\nThrough another letter, the KP chief minister has been requested to issue advice to the governor to summon the assembly immediately, so that new members can take oath and the Senate elections can be held.\n\nVerdict reserved\n\nMeanwhile, an ECP bench, headed by Chief Election Commissioner Sikandar Sultan Raja, reserved its verdict in a case related to the re-allocation of reserved seats in the KP Assembly, after hearing arguments from all parties.\n\nFive political parties — the PML-N, PPP, JUI-F, Awami National Party and PTI-Parliamentarians — and 71 individuals had been issued notices, as the ECP fixed the case for hearing after receiving the order of the Peshawar High Court.\n\nThe PHC had on July 8 ordered the ECP to redistribute reserved seats after hearing all parties, while declaring the ECP’s notifications on distribution of reserved seats of KP Assembly null and void. The PHC verdict came on a petition filed by the PML-N.\n\nLater, talking to reporters, JUI-F counsel Senator Kamran Murtaza said the PML-N was demanding a greater share of reserved seats after independent candidate, Tariq Awan, joined the party belatedly.\n\nMr Murtaza said that an independent lawmaker who joins a political party after the time stipulated in the law has expired, continues to be an independent, and this in no way affects the share of a political party in terms of reserved seats.\n\nThe PTI-led government currently holds 92 seats in the KP Assembly, while the opposition, which was only able to win 18 out of the total of 115 general seats, has seen its numbers swell to 53.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0407363342211ab.png?r=073643",
  "retrievedAt": "2025-08-17T20:31:44.327Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924275/ecp-seeks-kp-assembly-session-to-swear-in-mpas-on-reserved-seats",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T02:52:12.000Z"
}
