{
  "title": "Tesla marks India entry with first showroom, pricey $70,000 Model Y - World - DAWN.COM",
  "author": null,
  "content": "Tesla unveiled its first showroom in India on Tuesday, marking its entry into the world’s most populous country, as Elon Musk’s electric vehicle company seeks new customers amid sagging sales in the United States and Europe.\n\nThe store opened its doors to select visitors after its inauguration by Maharashtra Chief Minister Devendra Fadnavis in India’s financial capital Mumbai.\n\nTesla has for years signalled its interest in India but held back due to the country’s steep tariffs on electric vehicles.\n\nMusk, who once described India as having “more promise than any large country”, has also criticised its import duties, calling them among the “highest in the world”.\n\nNew Delhi has offered to cut import taxes on electric vehicles for global automakers only if they commit to investing hundreds of millions of dollars and make cars locally.\n\nTesla has yet to announce plans to set up a plant in India.\n\nFor now, local media reports say, the company will likely sell cars imported from China, with deliveries projected to start from late August.\n\nIts Model Y variants start from an on-road price of around $70,000 in India, according to its website, compared with a US price of $37,490 after a $7,500 federal tax credit.\n\nTesla’s India debut comes at a critical time for the company, which is seeing demand wane for its cars in countries around the world.\n\nThe recent slump in Tesla’s sales partly reflects the highly competitive nature of the EV market, which the company once dominated but now also features BYD and other low-cost Chinese players.\n\nWhile Tesla is looking to tap the world’s third-biggest car market, experts say it is unlikely to see huge volumes in the short term due to the nascent nature of India’s EV industry and the hefty price tag of its vehicles.\n\nIndia’s EV market is fast-growing but remains small, with automakers reporting sales of around 100,000 vehicles in 2024 or less than three per cent of total car sales.\n\nSoumen Mandal, a senior analyst at Counterpoint, said the high price tag will likely place it out of the price range of most Indian customers and see it compete against offerings from luxury carmakers instead.\n\n“We don’t expect Tesla to play the volume game right away given the price tag,” Mandal told AFP.\n\n“We project 500-700 units sold in the initial months and then that to taper off to 200-300 (per month).”\n\nIndia is currently negotiating a trade deal with the United States, including a potential reduction in tariffs on automobiles.\n\nIn February, Musk held a one-on-one meeting with Indian Prime Minister Narendra Modi in Washington.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1512163970decdf.jpg",
  "retrievedAt": "2025-08-17T20:29:41.307Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924346/tesla-marks-india-entry-with-first-showroom-pricey-70000-model-y",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T07:23:49.000Z"
}
