{
  "title": "No action against old number plates until Aug 14, says Sindh excise minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Mukesh Chawla hints at extending deadline for acquiring new number plates\n• Rules out reduction in fees for new plates\n\nKARACHI: Excise Minister Mukesh Kumar Chawla on Monday announced that no action would be taken against vehicles with old number plates as the deadline for obtaining new plates had been extended until Aug 14.\n\nHe made this statement while speaking at a press conference held to announce a major drug seizure by the Excise Department and the Pakistan Maritime Security Agency (PMSA).\n\nThe issue of new number plates featuring the Ajrak design has become highly controversial, as traffic police have been issuing hefty challans to motorists, especially motorcyclists, despite the fact that the deadline for mandatory replacement of number plates is still far off.\n\nJust on Sunday, the Jamaat-i-Islami staged a “bike rally” in protest against the provincial government’s decision and the traffic police’s unjustified crackdown over the new plates. Meanwhile, the Muttahida Qaumi Movement-Pakistan criticised the exorbitant fees and backlog and demanded that authorities ease the process.\n\nAgainst this backdrop, Mr Chawla clarified that there is only one law governing vehicle number plates across Sindh, from Karachi to Kashmore, and made it clear that the Ajrak design would be implemented across province.\n\nLater, speaking to Dawn, he said the deadline for obtaining new Ajrak-themed number plates for two- and four-wheelers might be extended again due to public demand.\n\n“We have already extended the deadline for replacing old number plates three times,” he said, adding that the replacement was mandatory.\n\nHowever, he ruled out any reduction in the fee for the new number plates, stating that over two million plates had already been issued.\n\nCurrently, the excise department charges Rs2,450 and Rs1,850 for new number plates of four-wheelers and two-wheelers.\n\nMajor drug seizure\n\nDuring the same press conference, Mr Chawla, who also holds the portfolio of the Narcotics Control Department, said that in a major operation on Sunday, the Sindh Narcotics Control Department, while working closely with the Maritime Security Agency, seized a large haul of narcotics and liquor, valued at approximately Rs7b in the international market.\n\nHe said this was the “largest operation of the year” based on shared intelligence, resulting in the recovery of 500 kg of high-quality hashish, 100 kg of crystal meth (ice) and 2,100 bottles of international-brand liquor.\n\n“This significant operation highlights our ongoing efforts to combat drug trafficking in the region,” he added.\n\nFlanked by Excise Secretary Abul Ala and Director General Narcotics Control Aurangzeb Panhwar, the minister said the operation targeted boats smuggling drugs through sea routes.\n\nHe shared that the smugglers attempted to dump the narcotics into the sea upon being spotted by law enforcement. “Further investigations are underway,” he added.\n\nMr Chawla said that the provincial narcotics department would continue to share intelligence with the MSA to launch joint efforts against drug smuggling via both land and sea routes.\n\nHe added that just four days earlier, the department had conducted two major operations in Sukkur and Karachi and seized 100 kg of hashish, 10 kg of heroin, 4 kg of ice and arrested three suspects, including a woman.\n\nHe also mentioned that surveillance under the Safe City project was progressing, with cameras being installed across Karachi.\n\nIn response to a question, he said five hospitals were currently operating in Karachi for the treatment of drug addicts, and that rehabilitation centres were under development in Hyderabad, Sukkur, Larkana and other districts.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68757ff334eab.gif",
  "retrievedAt": "2025-08-17T20:30:26.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924231/no-action-against-old-number-plates-until-aug-14-says-sindh-excise-minister",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:14:08.000Z"
}
