{
  "title": "News and denials - Newspaper - DAWN.COM",
  "author": null,
  "content": "SINCE the big lunch, saat sumandar paar, in DC, politics in Pakistan is in such a deep sleep that the snores can be heard in all corners of the country.\n\nNow that the Amreekans have put their stamp on where the power lies, by inviting the army chief to the big White House, it appears as if the mainstream political parties have decided the only way forward is to accept the suzerainty of Pindi and live happily ever after. It is the ever-after of arranged marriages, where the assumption is that role-playing and the trappings of family life are the best one can aspire to.\n\nAs long as there is a house, disposable income, kids, and social life, an existence can be passed off as happiness. And that is what our parties get — gormint houses and green number plates and protocol. So what if the real power lies elsewhere and so does the money. The house and the car are for free, and there are fewer court cases.\n\nLet’s just celebrate the little things in life. As the famous song goes, ‘Dil hai chota sa, chottee see aasha’.\n\nAnd if anyone expresses concern over the lunch in the White House and wonders where the prime minister was, simply extol the virtues of a hybrid system. There is no fighting and much cooperation — why should the dil maange more, the people are told.\n\nIn Islamabad, everything is possible and all options are being discussed.\n\nAnd if the subtext of these statements is that the PML-N supremo wasted his life arguing for the opposite, then people are just overthinking. Why would anyone extrapolate this from just a lunch and the cool-headed analysis of the benefits of hybridity?\n\nIt seems the prime minister and the Punjab chief minister agree. They are in any case far too busy working and occasionally posing for pictures. Though there must be moments where the prime minister pats himself on the back that the family member in charge of Punjab gets so much attention and criticism. Despite being in the centre, he gets less flak — surrounded as he is by more important people, in Lahore and closer.\n\nBut despite this, there have been moments in the past week or so which suggest trouble in paradise. But only in the Pakistani sense where little appears logical. Which in fact is the reason they are taken seriously — for we only take senseless issues seriously and then discuss them even more earnestly. And in this department were the reports about Nawaz Sharif setting off to Adiala to meet the baani as Imran Khan is now called, when he can’t be bothered to attend parliament. And while this ‘piece’ of news was called out rather quickly and clarified, the second one did the rounds for longer.\n\nIn this second piece of news, Asif Ali Zardari was about to be thrown out of the presidency. When it was first put out, those in government went into a bit of ‘sakta’ — the predictable response of the politicos when there is a fear that the news may have come from those who cannot be named. I mean, in this marriage of protocol and cars, who is going to deny a piece of gossip or information that might have been whispered by those who allowed you the cars in the first place?\n\nHence, there was silence as tongues wagged in drawing rooms and posts on social media did the rounds. And when the denial came, it had to come from sources more mustanid than just the PML-N itself. Hence, the interior minister had to enter the fray.\n\nThe rumour may have died down but not the questions about why and how it was started. For it wasn’t just reckless journalists who are to blame. And hence the tongues continue to wag. Who wanted to shock (or should it be shake) the PPP a bit? And to what end? And why do experts keep pointing out that the judgment in the reserved seats (which has awarded the PTI allocation to the other parties such as PML-N, PPP and JUI-F) has made PPP less critical to the government?\n\nAnd why do the same “experts” point out how bad the PML-N is at governance these days and how it has been made irrelevant by the famous lunch? The criticism over the import of sugar is not simply organic? It never is. Where is this analysis and this critique coming from?\n\nOr are these all hints to all the politicos to pull their socks up? In the land called Islamabad, everything is possible and all the options are being discussed. And while we mortals are confused, so might be the politicians. They always should be. The car and the protocol can just never be taken for granted — ask Imran Khan. And Nawaz Sharif. And Asif Ali Zardari.\n\nWhich is why the PTI in power is working so hard to keep itself in the good books of the powers that be. So much so that the party has dumped even Imran Khan. He asked them to protest and they drove off to Lahore to have dinner. And the KP chief minister thinks rhetoric can make up for everything — including lack of governance and lack of politics. But then who cares, for the car and the protocol are all that matter. As well as a good dinner in Lahore.\n\nFor the bill for the good times he enjoys, as with the prime minister, is being footed by the same people. And it’s not the electorate, be it in Punjab, KP or elsewhere.\n\nIndeed, it is all a bit like the conferences arranged for health practitioners by big pharma. Whatever the rhetoric, these fun events only work to the benefit of the organisers and the attendees. The people are not going to benefit. Not really. There was a word a property tycoon once used but it wouldn’t be appropriate.\n\nThe writer is a journalist.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6875cb542a3cc.png",
  "retrievedAt": "2025-08-17T20:29:46.626Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924305",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:31:21.000Z"
}
