{
  "title": "LA28 unveils Olympic competition schedule - Sport - DAWN.COM",
  "author": null,
  "content": "LOS ANGELES: Organisers of the Los Angeles 2028 Olympics on Monday released the first look at the Olympic competition schedule, highlighting a historic reshuffling of key events and the most ambitious sports lineup in Games history.\n\nThe announcement comes as the city marks three years to go until the Opening Ceremony and celebrates a major legacy milestone: more than one million enrolments in the PlayLA youth sports programme.\n\nFor the first time in nearly three decades, the Summer Olympics will return to the United States, with Los Angeles hosting for the third time after 1932 and 1984. The 2028 Games are set to feature 844 ticketed events designed to maximize both domestic and international viewership.\n\nOrganisers revealed that the Opening Ceremony will take place on July 14, 2028, at 8:00 p.m. ET (5:00 p.m. PT), split between the LA Memorial Coliseum and SoFi Stadium in Inglewood. The Closing Ceremony is scheduled for July 30 at the Coliseum.\n\nIn a notable departure from tradition, the LA28 schedule swaps the usual order of athletics and swimming competitions. Track and field events will open the Games in the first week, with swimming moving to the second week, culminating in its finale on the penultimate day at SoFi Stadium in Inglewood.\n\nThe first Olympic champion of LA28 will be crowned at Venice Beach in the triathlon event, while the marathon will close out athletics on the final weekend. Day 15 is expected to be the busiest for medal events, with 16 team sport finals and 19 individual sport finals taking place.\n\n“The Olympic competition schedule has been meticulously developed to ensure the world’s best athletes can compete in LA,” LA28 CEO Reynold Hoover said in a statement. “We are energised by today’s milestones and remain focused on the work ahead as the Road to 2028 continues.”\n\nOrganisers said the schedule will continue to be refined, with a more detailed breakdown to be released later this year.\n\n“When the world comes here for these Games, we will highlight every neighbourhood as we host a Games for all and work to ensure it leaves a monumental legacy,” LA Mayor Karen Bass said.\n\nMeanwhile, Hoover joined city officials on Monday at an event at the Coliseum to celebrate PlayLA surpassing one million programme enrolments.\n\nThe initiative, backed by up to $160 million in investment from LA28, the city’s Recrea­tion and Parks Department, and the IOC, provides affordable and inclusive sports programming for children aged 3-17 across more than 40 Olympic and adaptive sports.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/14235155122d185.jpg?r=235342",
  "retrievedAt": "2025-08-17T20:30:41.193Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924235/la28-unveils-olympic-competition-schedule",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:13:55.000Z"
}
