{
  "title": "Woman dies trying to save two children from drowning in Pindigheb - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: A woman lost her life while attempting to save her two children from drowning in a pond in a Pindigheb village, while two brothers were killed after the boiler of a tyre pyrolysis plant illegally operating in Margalla Hills exploded due to a technical fault.\n\nThe drowning incident occurred in village Dhoke Peerana in the jurisdiction of Pindigheb police station. Police while quoting eyewitnesses and family members of the deceased said Nighat Shaheen, 35, along with his 13-year-old daughter Ayesha Bibi and 10-year-old son Abdul Rauf had gone to the pond.\n\nWhile bathing, Rauf went into deep water and started drowning. Seeing her brother in distress, Ayesha tried to rescue him but she also drowned. Their mother jumped into the water in a bid to save her children but she also drowned.\n\nLocal volunteers retrieved the bodies and shifted them to the tehsil headquarters hospital. Police sources said the pond had turned into a swamp and the three victims were trapped in it and drowned. The incident sent shockwaves through the area when the bodies were brought to their home.\n\nMeanwhile, two brothers were killed after the boiler of a tyre pyrolysis plant illegally operating in the Margalla Hills exploded due to a technical fault. The victims, Abdullah and his brother Mohammad Khan were natives of Parachinar.\n\nSoon after the incident, officials from the police, local administration and Environmental Protection Agency (EPA) reached the spot and secured the area. Police registered a case against the owners under section 322 and 269 Pakistan Penal Code (PPC). It may be mentioned here that a number of plants are operating in the area due to alleged negligence of EPA and local administration.\n\nSeparately, a man was stabbed to death allegedly by his nephew over a land dispute in Ghourghushti village in the limits of Hazro police.\n\nSultan Afsar exchanged hot words with his nephew Nasir Khan over removal of wild growth from the field. Nasir took out a knife and stabbed him to death and fled.\n\nThe injured was taken to tehsil headquarters hospital Hazro where he died.\n\nMoreover, a teenage boy was killed while two others were injured when two motorcycles collided with each other near Khagwani Chowk in Hazro.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/67ef211adcfe6.gif",
  "retrievedAt": "2025-08-17T20:30:10.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924221/woman-dies-trying-to-save-two-children-from-drowning-in-pindigheb",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:14:17.000Z"
}
