{
  "title": "Three more petitions filed against SC decision on IHC judges’ transfer - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The challenges to the Supreme Court Constitutional Bench’s decision upholding the tra­n­sfer of three judges to the Islamabad High Court (IHC) continue to mount as three more appeals have been filed against the June 19 order.\n\nThe fresh Intra-Court Appeals (ICA) were filed on Monday by the Karachi Bar Association (KBA), PTI leader Shoaib Shaheen and Raja Muqsid Nawaz Khan.\n\nLast week, the Lahore High Court Bar Asso­­ciation and Lahore Bar Association challenged the decision.\n\nFive IHC judges — who filed the original petition in the Supreme Court against the transfers — have also challenged the decision.\n\nThe petitions filed by KBA and PTI leaders have urged the court to set aside the June 19 judgment, which declared, by a majority of three to two, that the transfer of judges from three different high courts to IHC was in line with the Constitution.\n\nChallenges filed by Karachi Bar Association, PTI’s Shoaib Shaheen and a lawyer\n\nThe KBA petition, filed on behalf of Advocate Faisal Siddiqi, pleaded the Constitutional Bench, in its judgment, had failed to provide findings on the question whether the transferred judges could have performed their functions in the IHC without taking a fresh oath.\n\nIf the Supreme Court had adjudicated this question and found that such an oath was necessary, then the acting chief justice could not have continued to perform his functions in the high court, the petition argued.\n\nThis is a glaring defect in the June 19 verdict, the petition contended, adding that without addressing this point, the judgment erroneously permitted the acting chief justice to carry out his duties. Therefore, the June 19 decision was contrary to the Constitution, without jurisdiction and liable to be set aside.\n\nThe petition pleaded the question of oath was not only central for determining seniority at a particular high court, but also strongly tethered to the notion of federalism.\n\nIt said that a judge takes an oath to serve at a particular provincial high court. Similarly, for serving at the IHC, a distinct federal territory, an oath is required to be made before the chief justice of IHC.\n\nThe CB order in which directed the president to determine the terms of transfer and seniority, has not taken into account that in the summary moved by the Law Ministry on Feb 1 for the transfer of judges, it was already mentioned that “seniority of the transferred judges will be reckoned from the day they entered upon the office of the judge in their respective high courts”.\n\nThe president approved this summary which means that this was “capitulation of CB” to the executive for determining the terms of transfer and the question of seniority, it is capitulation with the additional caveat that the president who has already sanctioned the transfers on a particular basis is expected to do something else the second time, the appeal said.\n\n‘Rewriting Constitution’\n\nLikewise, the petition filed by Mr Nawaz on behalf of Advocate Idrees Ashraf argued that Article 200 of the Constitution neither conferred nor implied any independent discretion upon the president to initiate or finalise judicial transfers.\n\nThe president, being a ceremonial head, acts on the advice of the executive, it pleaded.\n\nThe petition added the CB “erred in remanding the matter” to determine whether the transfer was ‘temporary’ or ‘permanent’. “This is a judicial question, and delegating it to the president undermines judicial autonomy and violates the principle of separation of powers.”\n\nThe appeal pleaded that interpreting transfers as “permanent” required importing words into the constitutional text, which amounted to judicial overreach and rewriting the Constitution — an act impermissible in constitutional interpretation.\n\nUnlike India, where Article 217 explicitly creates a vacancy upon transfer of a judge, no such vacancy arises in Pakistan.\n\nTherefore, the judge retains affiliation with the parent high court and their original seniority, the appeal contended.\n\nArticle 175-A governs judicial appointments and does not overlap with Article 200. Interpreting Article 200 to allow filling vacancies by transfers renders Article 175-A redundant and causes constitutional disharmony, the petition said.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:31:22.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924290/three-more-petitions-filed-against-sc-decision-on-ihc-judges-transfer",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:13:42.000Z"
}
