{
  "title": "US top court allows Trump to resume Education Department dismantling - World - DAWN.COM",
  "author": null,
  "content": "A divided United States supreme court gave US President Donald Trump the green light on Monday to resume dismantling the Education Department.\n\nThe conservative-dominated court, in an unsigned order, lifted a stay that had been placed by a federal district judge on mass layoffs at the department.\n\nThe three liberal justices on the nine-member panel dissented.\n\nTrump pledged during his White House campaign to eliminate the Education Department, which was created by an act of Congress in 1979, and he moved in March to slash its workforce by nearly half.\n\nTrump instructed Education Secretary Linda McMahon to “put herself out of a job”.\n\nAround 20 states joined teachers’ unions in challenging the move in court, arguing that the Republican president was violating the principle of separation of powers by encroaching on Congress’s prerogatives.\n\nIn May, District Judge Myong Joun ordered the reinstatement of hundreds of fired Education Department employees.\n\nThe supreme court lifted the judge’s order without explanation, just days after another ruling that cleared the way for Trump to carry out mass firings of federal workers in other government departments.\n\nJustice Sonia Sotomayor, in a dissent joined by justices Elena Kagan and Ketanji Brown Jackson, said in the Education ruling that “only Congress has the power to abolish the Department”.\n\n“The majority is either willfully blind to the implications of its ruling or naïve, but either way the threat to our Constitution’s separation of powers is grave,” Sotomayor said.\n\nTraditionally, the federal government has had a limited role in education in the US, with only about 13 per cent of funding for primary and secondary schools coming from federal coffers, the rest being funded by states and local communities.\n\nBut federal funding is invaluable for low-income schools and students with special needs. And the federal government has been essential in enforcing key civil rights protections for students.\n\nAfter returning to the White House in January, Trump directed federal agencies to prepare sweeping workforce reduction plans as part of wider efforts by the Department of Government Efficiency (DOGE) — previously headed by Elon Musk — to downsize the government.\n\nTrump has moved to fire tens of thousands of government employees and slash programmes — targeting diversity initiatives and abolishing the Education Department, the US humanitarian aid agency USAID and others.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/15105944db176df.png",
  "retrievedAt": "2025-08-17T20:29:40.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924341/us-top-court-allows-trump-to-resume-education-department-dismantling",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T06:07:58.000Z"
}
