{
  "title": "CIA had ‘ties with Oswald’ before JFK assassination: WaPo - World - DAWN.COM",
  "author": null,
  "content": "• Agency operative had contact with anti-Castro group that assassin also courted\n• CIA denied existence of ‘Howard’ for decades, but same man was made liaison for House Committee probing assassination\n• CIA covered it up not because they were involved, but to hide secrets, says committee chair\n\nTHE Central Intelligence Agency (CIA) withheld information about its knowledge of Lee Harvey Oswald’s activities before the assassination of John F Kennedy in November 1963, and lied about a covert officer who monitored Oswald for months, newly released documents reveal.\n\nAccording to The Washington Post, the documents confirm that George Joannides, a CIA officer in Miami, had financed and managed an anti-Castro Cuban student group that had direct contact with Oswald at least three months before Kennedy’s assassination in Dallas.\n\nFor decades, the CIA had denied any connection to the group, or knowledge of Oswald’s activities.\n\nThe agency told both the Warren Commission in 1964 and House Select Committee on Assassinations in 1978 that the operative known as “Howard” didn’t exist. Joannides also served as a liaison to the latter committee.\n\nBut documents released on July 3 reveal Joannides had a fake DC driver’s license under the name “Howard Mark Gebler”.\n\n“This confirms much of what the public already speculated: that the CIA was lying to the American people, and that there was a cover-up,” Anna Paulina Luna (R-Florida), who chairs the task force, said in an email.\n\nLuna’s House Oversight Committee task force pushed the CIA to search its archives after holding hearings on the assassination this spring.\n\nLuna said she believes “there was a rogue element that operated within the CIA” that “knowingly engaged in a cover-up of the JFK assassination”.\n\n“They did not like his foreign policy, and that’s why they justified turning a blind eye to his assassination and those involved,” she said.\n\nWin for the CIA\n\nThree months before JFK’s assassination, the CIA-backed group known as DRE (short for Student Revolutionary Directorate) confronted Oswald in New Orleans in August 1963, after he publicly promoted pro-Castro policies. The group then challenged him to a radio debate.\n\nDRE records show a tape of that debate was sent to “Howard”.\n\nLater, Oswald approached the group offering to help, possibly as a mole within his Fair Play for Cuba Committee, according to Jose Antonio Lanuza, a former DRE member.\n\nLanuza, now 86, recalled receiving a “ranting” two-page letter from Oswald offering his services. Lanuza filed it away.\n\n“Lee Harvey Oswald was trying to get in the good graces of the CIA,” Lanuza said in an interview. “He said ‘I’ll do whatever’.”\n\nBut when the news hit that Oswald had been arrested three months later, Lanuza and Rocha called Howard. Lanuza said Howard told them to call the FBI and provide the letter, and then alert the media to Oswald’s pro-Cuba leanings. The FBI came and took Oswald’s letter with a promise to return it, Lanuza said, but never did.\n\nLanuza then phoned his contacts in the news media, who promptly added Oswald’s political leanings to their coverage. The Fair Play for Cuba Committee soon imploded from its association with Oswald, a massive victory for the CIA — and for Howard.\n\nStonewalling\n\nDocuments show the CIA gave Joannides a career commendation medal in 1981, partly for handling the Cuban group and for serving as liaison to the House assassinations committee, where researchers say he stonewalled their investigation.\n\nResearchers have long accused Joannides, who died in 1990, of obstructing that committee’s investigation.\n\nStaff members testified that they were making progress until Joannides was installed as their CIA contact, unaware that he was central to the events they were trying to uncover.\n\n“The obstruction of our efforts by Joannides escalated over the summer [of 1978],” former committee staff member Dan Hardway testified in May. “It was clear that CIA had begun to carefully review files before delivering them to us for review.”\n\nThe documents, however, do not indicate CIA involvement in Kennedy’s assassination.\n\nThe Warren Commission concluded Oswald acted alone, while a 1976 House committee found a “probable conspiracy” but couldn’t identify other conspirators.\n\nBut Rolf Mowatt-Larssen, a former CIA counter-intelligence officer, said the evidence suggests “this looks a hell of a lot like a CIA operation.”\n\nHe theorised rogue CIA officers created the conspiracy, unknown to the agency, and “the CIA covered it up not because they were involved, but because they were trying to hide the secrets of that period.”\n\nMany CIA officers were angry with Kennedy after he withdrew support for the Bay of Pigs invasion in 1961 and moved toward peace with the Soviet Union after the 1962 Cuban missile crisis, he said.\n\n“The question is what was Joannides doing for the CIA monitoring Oswald?” he said. “His bona fides are being set up to be a lone gunman.”\n\nJ Barry Harrelson, a former CIA official who wrote a 1998 memo denying Howard’s existence, acknowledged his error after seeing the driver’s license documents.\n\n“My memo was incorrect,” Harrelson said. “But this wasn’t deliberate.”\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687582600a20d.jpg",
  "retrievedAt": "2025-08-17T20:31:23.579Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924237/cia-had-ties-with-oswald-before-jfk-assassination-wapo",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:13:36.000Z"
}
