{
  "title": "Unprivileged to get legal aid at state expense - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice of Pakistan Yahya Afridi on Monday anno­unced a new initiative for underprivileged litigants to engage legal representation, at state expense.\n\nThe initiative, launched under the auspices of the Law and Justice Commi­ssion of Pakistan (LJCP), will be implemented acr­oss all levels of the judiciary, from magistrate courts to the Supreme Court.\n\nThe counsels in such cases would be given up to Rs50,000 in remuneration, which would be provided to them through the Dis­trict Legal Empo­werment Commi­ttees, to ensure equi­table access to justice for all citizens.\n\nThe decision was taken during a meeting presided over by the chief justice at the Supreme Court Branch Registry in Quetta. The meeting reviewed institutional linkages between the bar associations of Balo­c­histan and LJCP in strengthening justice delivery.\n\nDuring the meeting, the CJP shared insights from his visits to some remote districts, where he noticed a gap in coordination bet­ween bar associations and the LJCP. He said that despite the availability of funds, they were not being properly utilised for uplifting the district judiciary.\n\nAs the commission has limited outreach capacity, LJCP has decided to post a senior-level representative in every province who will be stationed at the respective high courts. These representatives will act as front desk to maintain liaison with district bar associations, identify local priority areas, raise awareness, and supervise grassroots-level justice sector initiatives.\n\nThe bars associations may present their development project proposals to District Development Committees. Moreover, representatives of federal and provincial development departments have also been taken on board to ensure speedy execution and to avoid resource duplication.\n\nMoreover, CJP encouraged the bar representatives to ensure that their members benefit from the Continuing Legal Education programmes offered by the Federal Judicial Academy.\n\nBalochistan High Court Bar Association President Attaullah Khan Langov apprised the meeting about various facilities provided by the provincial government to the bar associations across the province.\n\nIt included 100 scooties for women lawyers, digital library at High Court Bar, shuttle services from high court to District Court Quetta, a 100-acre housing scheme for lawyers of high court and grant-in-aid by the federal government to 28 districts bars of Balochistan and the High Court Bar Association.\n\nAll federal and provincial stakeholders present at the meeting assured their full cooperation and support in advancing the shared goal of accessible and efficient justice.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6875878073bfe.jpg",
  "retrievedAt": "2025-08-17T20:31:45.553Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924282/unprivileged-to-get-legal-aid-at-state-expense",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:05:14.000Z"
}
