{
  "title": "Mediators push to revive stalled Gaza ceasefire talks - World - DAWN.COM",
  "author": null,
  "content": "• Negotiations drag into second week as Israel, Hamas blame each other for blocking prisoner deal\n• Israeli strikes kill another 22 Palestinians in besieged enclave\n\nGAZA CITY: Stuttering Gaza ceasefire talks entered a second week on Monday, with meditators seeking to close the gap between Israel and Hamas, as more than 20 people were killed across the Palestinian territory.\n\nThe indirect negotiations in Qatar appear deadlocked after both sides blamed the other for blocking a deal for the release of prisoners and a 60-day ceasefire after 21 months of fighting.\n\nAn official with knowledge of the talks said they were “ongoing” in Doha on Monday, telling AFP: “Discussions are currently focused on the proposed maps for the deployment of Israeli forces within Gaza.”\n\n“Mediators are actively exploring innovative mechanisms to bridge the remaining gaps and maintain momentum in the negotiations,” the source added on condition of anonymity.\n\nHamas accused Israeli Prime Minister Benjamin Netanyahu — who wants to see the Palestinian group destroyed as a fighting force — of being the main obstacle.\n\n“Netanyahu is skilled at sabotaging one round of negotiations after another, and is unwilling to reach any agreement,” the group wrote on Telegram.\n\nIn Gaza, the civil defence agency said at least 22 people were killed on Monday in the latest Israeli strikes in and around Gaza City and in Khan Yunis in the south.\n\nThe Al-Quds Brigades — the armed wing of Islamic Jihad, which has fought alongside Hamas — released footage on Monday that it said showed its fighters firing missiles at an Israeli army command and control centre near Shujaiya.\n\nTalks ‘ongoing’\n\nUS President Donald Trump said he was still hopeful of securing a truce deal, telling reporters on Sunday night: “We are talking and hopefully we’re going to get that straightened out over the next week.”\n\nHamas’s top negotiator, Khalil al-Hayya, and the leadership of Hamas and Islamic Jihad held a “consultative meeting” in Doha on Sunday evening to “coordinate visions and positions”, a Palestinian source with knowledge of the talks told AFP.\n\n“Egyptian, Qatari and American mediators continue their efforts that make Israel present a modified withdrawal map that would be acceptable,” they added.\n\nOn Saturday, the same source said Hamas rejected Israeli proposals to keep troops in more than 40 per cent of Gaza, as well as plans to move Palestinians into an enclave on the border with Egypt.\n\nA senior Israeli political official countered by accusing Hamas of inflexibility and trying to deliberately scupper the talks by “clinging to positions that prevent the mediators from advancing an agreement”.\n\nIsraeli Foreign Minister Gideon Saar and Palestinian minister of state for foreign affairs Varsen Aghabekian Shahin headed to Brussels on Monday for talks between the EU and its Mediterranean neighbours.\n\nBut the Ramallah-based Palestinian Authority denied media reports that any meeting between the two was on the agenda.\n\nNetanyahu has said he would be ready to enter talks for a more lasting ceasefire once a deal for a temporary truce is agreed, but only when Hamas lays down its arms. He is under pressure to quickly wrap up the war, with military casualties rising and with public frustration mounting at both the continued captivity of the prisoners and a perceived lack of progress in the conflict.\n\nPolitically, his fragile governing coalition is holding, for now, but Netanyahu is seen as beholden to a minority of far-right ministers in prolonging an increasingly unpopular conflict.\n\nHe also faces a backlash over the feasibility, cost and ethics of a plan to build a so-called “humanitarian city” from scratch in southern Gaza to house Palestinians if and when a ceasefire takes hold.\n\nThe UN agency for Palestinian refugees has described the proposed facility as a “concentration camp” and Israel’s security establishment is reported to be unhappy at the plan.\n\nIsrael’s military reprisals since October 2023 have killed 58,386 Palestinians, mostly civilians, according to the health ministry in Gaza.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6875826966b4a.jpg",
  "retrievedAt": "2025-08-17T20:31:29.763Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924244/mediators-push-to-revive-stalled-gaza-ceasefire-talks",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:13:36.000Z"
}
