{
  "title": "Eight SBCA men among 10 sent to prison in Lyari building collapse case - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Monday remanded eight officials of the Sindh Building Control Authority (SBCA) and two owners of a building that collapsed in Lyari in judicial custody.\n\nInvestigating Officer (IO) Zahid Hussain Shah produced the 10 suspects before Judicial Magistrate (South) Kalsoom Mustafa Sahto and sought an extension in their physical remand for another 11 days.\n\nAt the outset of the hearing, the IO informed the court that further custody was required to obtain technical evidence and to coordinate with the relevant department for collection of documents and related reports. He added that the extension of physical custody was also necessary to apprehend remaining suspects in the case.\n\nHowever, the defence counsel opposed the plea and requested that the suspects be sent to jail on judicial remand.\n\nAfter hearing arguments from both sides, the magistrate turned down the IO’s request and sent all 10 suspects to prison on judicial remand.\n\nAccording to the FIR, the five-storey building was constructed in two portions, and for a considerable period, both portions (buildings) were in dilapidated condition and unliveable. It added that one building with 20 apartments collapsed on July 4 due to the “criminal negligence” of the SBCA officials and the owner.\n\nThe FIR said the SBCA officials were aware of the condition of the building over years till its collapse. It added that the officials “completely failed” to perform their duty and “committed negligence and carelessness”.\n\nIt also said the officials “deliberately” did not mention in the official record that the building was dilapidated. It also added that the present owner of the building and other unknown owners also knew that it was not liveable for humans. Despite this, the owners gave several flats on rent to members of the Hindu community and committed negligence.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/10195044291465c.jpg?r=195049",
  "retrievedAt": "2025-08-17T20:30:20.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924219/eight-sbca-men-among-10-sent-to-prison-in-lyari-building-collapse-case",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:14:08.000Z"
}
