{
  "title": "‘4 of a family’ among 5 killed in Karachi road accidents - Pakistan - DAWN.COM",
  "author": null,
  "content": "Five people — four from the same family — were killed in two separate road accidents in Karachi on Tuesday, according to police and rescue officials.\n\nThe city has lately witnessed a rise in traffic accidents, especially involving heavy vehicles, including dumpers and water tankers, which killed nearly 500 people and injured 4,879 in 2024, according to hospital data.\n\nAt least four people lost their lives and another six were injured — all from the same family — after their speeding car crashed into a wall next to a nullah on Hawkesbay Road in the city’s Mauripur area, according to Deputy Inspector General (DIG) South Syed Asad Raza.\n\nDIG Raza speculated that the family was most likely returning from the Hawke’s Bay beach. The incident took place at 9am on Tuesday, he added.\n\n“The accident most likely happened as a result of speeding,” said the DIG, adding that further investigation was underway.\n\nThe deceased included a man and woman — identified as Yousuf and Khalida — along with two children, six-year-old Zainab and 10-year-old Ayesha.\n\nThe injured were taken to Civil Hospital Karachi, three of whom were in critical condition, according to Police surgeon Dr Summaiya Syed.\n\nIn a separate incident, a collision between a trailer and a truck left one dead and three injured near New Sabzi Mandi on the Super Highway, according to rescue officials.\n\nThe injured were rushed to Abbasi Shaheed Hospital, as per rescue officials.\n\nThe deceased has been identified as 39-year-old Gaya Chand, rescue officials said.\n\nOn June 19, a speeding dumper truck overturned on a 4x4 vehicle on Rashid Minhas Road, killing a woman and an accompanying five-year-old girl.\n\nOn June 11, a young man was killed and his wife injured in an accident after an unknown vehicle hit their bike on the Super Highway. The same day, two boys were killed after a water tanker hit them near Abdullah College in North Nazimabad.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/1122094497d3af5.jpg?r=220954",
  "retrievedAt": "2025-08-17T20:29:21.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924364/4-of-a-family-among-5-killed-in-karachi-road-accidents",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T10:17:08.000Z"
}
