{
  "title": "President Zardari, PM Shehbaz reiterate commitment to work together for country - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari and Prime Minister Shehbaz Sharif on Tuesday reiterated their commitment to working together with each other for the country’s sake.\n\nA statement issued by the Presidency said the two held a meeting today at the President House.\n\n“The meeting involved discussions on the country’s political, economic, and security situation. The state of law and order in the country and measures against terrorism were also discussed.\n\n“The prime minister briefed the president on the government’s measures to improve the economy. Both leaders reiterated their commitment to work together for the country’s stability, development, and prosperity,” the statement said.\n\nThe meeting was also attended by Defence Minister Khawaja Muhammad Asif, Planning Minister Ahsan Iqbal, Law Minister Azam Nazeer Tarar, Interior Minister Mohsin Naqvi and PM’s Adviser on Political and Public Affairs Rana Sanaullah.\n\nThe meeting comes in the wake of growing speculation about the upcoming 27th constitutional amendment and it being claimed that President Zardari may soon step down, potentially paving the way for the army chief to assume the country’s presidency.\n\nThe reports on social media claim that work is underway to replace the current parliamentary system with a presidential form of government. Some reports also claim that President Zardari has set one condition for his exit — a key role for his son Bilawal Bhutto-Zardari in the new dispensation.\n\nNaqvi said earlier this month that there were no plans to remove President Zardari and dismissed the reports about any such move.\n\nHe had to dismiss the reports again last week, claiming that the country was shifting to a presidential system and that Field Marshal Asim Munir would replace Zardari as head of state.\n\n“We are fully aware of who is behind the malicious campaign targeting President Asif Ali Zardari, Prime Minister Shehbaz Sharif and the chief of army staff (COAS). I have categorically stated that there has been no discussion — nor does any such idea exist — about the president being asked to resign or the COAS aspiring to assume the presidency,” Naqvi had posted on X.\n\nHe said the president enjoyed a strong and respe­ctful relationship with the leadership of the armed forces. “I know who is spreading these falsehoods, why they are doing so, and who stands to benefit from this propaganda.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/15203010027fbe4.jpg",
  "retrievedAt": "2025-08-17T20:28:57.998Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924394/president-zardari-pm-shehbaz-reiterate-commitment-to-work-together-for-country",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T15:52:05.000Z"
}
