{
  "title": "Senate body endorses disabled persons amendment bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Functional Committee on Human Rights on Monday endorsed the disabled persons amendment bill to ensure protection of rights of ‘people with special needs’.\n\nSenator Dr Zarqa Suharwardy Taimur had moved the ‘ICT Rights of Persons with Disability Bill, 2024’. The Ministry of Human Rights and the mover mutually agreed on a number of key amendments. Provisions were endorsed to conduct five-yearly surveys of schools, provide books and assistive devices, offer scholarships, and promote inclusive education. The committee also discussed the inclusion of internationally-recognised definitions for “mild” and “moderate” disabilities for legal clarity.\n\nThe committee convened its meeting to review legislative amendments and assess institutional mechanisms concerning the rights of children, persons with disabilities, and gender equality in Pakistan. Senator Samina Mumtaz Zehri chaired it.\n\nAlthough the ministry initially expressed reservations, arguing that existing frameworks cover many proposed functions, a consensus was reached after deliberation to refine the language and improve enforceability.\n\nThe committee stressed the importance of government-led awareness initiatives, regulatory mechanisms and reliable data collection. An app has already been launched in Islamabad to assist parents and gather data on children with disabilities, with the city being treated as a pilot model. It was noted that Punjab and Sindh have enacted their own laws, while Khyber Pakhtunkhwa’s legislation is still under finalisation.\n\nThe committee also considered the National Commission on the Rights of the Child (Amendment) Bill, 2023. It was briefed on initiatives to enhance child online protection and the operational capacity of the National Cyber Crime Investigation Agency (NCCIA). The committee recommended expanding cybercrime units across all regions, enabling remote complaint registration, recruiting trained professionals, and ensuring inter-agency coordination.\n\nThe members emphasised the need for proactive investigation, increased public awareness and psychological support services for victims. With only 30 convictions reported, concerns were raised regarding delays in legal proceedings, victim withdrawal, and the absence of timely support mechanisms.\n\nThe committee further urged authorities to maintain offenders’ databases, conduct background checks and strengthen existing helplines for timely intervention.\n\nA discussion was also held on the ineffective implementation of resolutions promoting gender equality and women’s participation.\n\nThe human rights secretary referred to Pakistan’s low ranking in the World Economic Forum’s Gender Gap Report, attributing it to outdated data, under-reporting and systemic as well as cultural barriers. Lack of coordination between institutions such as HEC and Unesco was also highlighted as a cause for unreliable national reporting.\n\nThe committee stressed the need for regular reporting, greater accountability from implementing partners and penalties for negligence.\n\nDuring the meeting, chairperson Senator Zehri also raised concerns over systemic delays in convictions, highlighting inefficiencies in the judicial process and prosecutorial bottlenecks.\n\n“Justice delayed is justice denied,” she noted and called for coordinated efforts among stakeholders to fast-track justice delivery.\n\nSenator Zehri further pinpointed the government’s failure to provide accurate data at international forums, particularly during UN reviews in Geneva, noting that the dissemination of misleading information on sensitive matters damaged Pakistan’s international credibility. She urged the ministry to ensure factual, transparent reporting and to adopt a proactive approach in international engagements.\n\nPublished in Dawn, July 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/03/65ece9c97be64.jpg",
  "retrievedAt": "2025-08-17T20:30:21.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924223/senate-body-endorses-disabled-persons-amendment-bill",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T03:14:17.000Z"
}
