{
  "title": "Pakistani artist paints vibrant Truck Art in Sri Lanka",
  "link": "https://www.app.com.pk/culture-heritage/pakistani-artist-paints-vibrant-truck-art-in-sri-lanka/",
  "date_published": "2022-04-07T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP):Entrepreneur and artist Ali Salman Anchan showcased Pakistan’s indigenous ‘truck art culture’ in Sri Lanka through an amazing wall painting project.\nSalman is an entrepreneur and founder of a social enterprise ‘Phool Patti’ which is dedicated to promote Pakistani truck art culture around the globe. They have been working to revolutionize art and highlight the positive face of Pakistan through their creative themes.Recently the ‘Phool Patti’ team flew to Sri Lanka for an amazing project of mural paintings which was arranged in collaboration with the Pakistan High Commission in Colombo to promote Pakistan’s heritage globally.\nPhool Patti Pakistan’s Truck Art team took it to social media and shared this initiative via their official Facebook page.\n“Phool Patti painted a wall of size 40×8 that highlights the cultural heritage of both Pakistan and Sri Lanka. The primary aim of painting the wall is to acquaint and familiarize the Sri Lankan community with the rich Buddhist heritage in Pakistan.”\nWhile stating the detailed information about this incredible collaboration they mentioned the specifications and key features of the artwork.\n“The wall has been divided into two sections. The part of the wall dedicated to showcasing Sri Lankan heritage has been adorned with the Lord Buddha stupa discovered in Taxila and Mohen-jo-Daro; an important region during the Indus Valley Civilization. Also, the Sri Lankan side displays its cultural heritage like the national flower Lotus, an important landmark of Independence Memorial Hall, and its national animal, the Chicken.”\n“The Pakistani side of the wall showcases Pakistan’s historic and cultural heritage like Faisal Mosque, Taxila city, the country’s national flower jasmine and the national bird, Chakoor. The center of the wall has been painted with Pakistani and Sri Lankan flags,” they added further.\nTeam Phool Patti have also won various national and international awards and certificates for their efforts to promote the soft image of Pakistan globally.",
  "retrievedAt": "2025-08-11T14:40:13.096Z"
}
