{
  "title": "PM launches national 911 Helpline for integrated emergency relief services",
  "link": "https://www.app.com.pk/national/pm-launches-911-helpline-for-integrated-emergency-relief-services/",
  "date_published": "2022-04-07T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP): Prime Minister Imran Khan Thursday launched a 911 Helpline to provide all emergency relief services through a single platform, which he believed, was a major step forward to developing Pakistan on the pattern of the Madina welfare state.\n“Now, every citizen in any part of the country will get the state’s response (in case of any emergency). This is a major move forward towards our mission statement of making Pakistan an Islamic welfare state,” the prime minister said addressing the launching ceremony of the helpline.\nThe integrated Pakistan Emergency Helpline (PEHEL)-911 would provide emergency services like fire brigade, police, health assistance, disaster recovery and motorway police etc. A needy person will have to dial just 911 and the call center would forward the call to the relevant government agency.\nThe prime minister said the government was striving to ease people’s lives as in any welfare state, the citizens should have the confidence of receiving the state’s response in case of any threat to life and property.\nHe said besides being a major facility, the PEHEL helpline would also give the people a feeling that Pakistan was for all as earlier, there were two parallel discriminatory systems supporting rich and poor respectively.\nThe prime minister, who earlier launched the helpline by pushing a button, also lauded the interior ministry and other collaborating departments for establishing the helpline said that it would also require constant coordination among all provinces.\n“This project should have all the provinces on the same page because it was about the benefit of all,” he remarked.\nThe prime minister said the PEHEL helpline would also enable the government to maintain the crimes data besides assessing the requirement of resources in different sectors.\nReiterating his vision of making Pakistan a welfare state, said his government had launched Sehat Insaf Card providing Rs 1 million health insurance to every family across the country, except the opposition-led Sindh province. He said being, a provincial subject, the people of Sindh could not get the facility of health insurance.\nHe said the government introduced a core national single curriculum to do away with the discriminatory education system and also launched multiple welfare initiatives under the umbrella of the Ehsaas and Kamyab Jawan Program including skill training, interest-free loans, housing loans, and farmers loans.\nMoreover, the introduction of a legal aid system to provide free legal services to needy people was also on his government’s agenda.\nImran Khan said the Madina welfare state took the responsibility of all of its citizens without considering the dearth of resources. Following the same model, China also steered around 700 million people out of poverty within 35 years, he added.\nHe said the country could not achieve progress sans inclusivity and without breaking the elite system.",
  "retrievedAt": "2025-08-11T14:40:11.917Z"
}
