{
  "title": "President for introducing special educational tools for differently-abled people",
  "link": "https://www.app.com.pk/national/president-for-introducing-special-educational-tools-for-differently-abled-people/",
  "date_published": "2022-04-07T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP): President Dr Arif Alvi on Thursday called for introducing special educational tools for differently-abled people, particularly the visually and hearing-impaired persons, to facilitate them in continuing their higher education.\nThe president also emphasised that the huge number of out-of-school children was a major issue that needed to be addressed with the collective efforts of educational institutions, civil society and non-governmental organizations.\nThe President made these remarks while chairing a follow-up meeting on Allam Iqbal Open University (AIOU), Islamabad, at Aiwan-e-Sadr, today. The meeting was attended by the Vice-Chancellor of AIOU, Prof Dr Zia-ul-Qayyum, and senior management of the University.\nAddressing the meeting, the president underscored the need for skill-based courses to equip the youth with employable skills, particularly in the IT sector.\nHe also underlined the need to introduce two-year Associate Degree Programs to fulfill the market demand for skilled professionals.\nHe stated that AIOU needed to further increase its outreach through online and distance learning modes to increase the number of graduates in the country.\nThe president urged the management of the University to effectively utilize the latest ICT tools in this regard.\nWhile briefing the meeting, the Vice-Chancellor of AIOU highlighted that during the last two years, AIOU had transformed its operations through massive technological interventions under its “Digital Transformation Policy”.\nIt was informed that AIOU was the first university in the public sector to launch an integrated automated suite of applications that had automated all academic, administrative and financial processes of the University.\nHe apprised the meeting that over 1.2 million students were currently enrolled in the institution whereas more than 4.43 million students had graduated in various disciplines so far.\nThe president appreciated the initiatives undertaken by the University, particularly enhancing its outreach and digitization of the institution.",
  "retrievedAt": "2025-08-11T14:40:11.854Z"
}
