{
  "title": "Flash appeal for Pakistan’s flood victims being responded positively: UN",
  "link": "https://www.app.com.pk/national/flash-appeal-for-pakistans-flood-victims-being-responded-positively-un/",
  "date_published": "2022-09-14T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP): The United Nations Resident Coordinator in Pakistan Julien Harneis on Wednesday said that the joint flash appeal by the Government of Pakistan and United Nations Secretary General got a positive response from the international community.\nAddressing a press conference here, he said that United States, Canada and other countries had made good announcements in response to the appeal.\nThe purpose of the press conference was to ensure transparency, he said.\n“We will try to keep the media updated and will answer every question,” he added.\nHe said the Emergency Relief Fund had announced $10 million, adding that they were exclusively discussing that how Pakistan could attain the maximum donations from the UN system.\nHe said the UN had already launched a $161 million flash appeal for Pakistan flood victims and for the rehabilitation purpose, adding the funding would provide critical food and cash assistance to nearly one million people residing in various districts of Balochistan, Sindh, Punjab and Khyber Pakhtunkhwa provinces.\nHe agreed, in the current situation, that $161 million may not be enough for relief activities as they had again made an appeal before the international community to grant more funds.\n“All the international support and funding is going into the government system,” he said.\n“We have a responsibility to maintain financial accountability and transparency,” he asserted.\nThe coordinator voiced the government stance that around 33 million people had been affected due to recent flooding and it would take at least three to four months for people to return to their routine life.\n“We have started an immediate response to the disaster, but we are still in the early stages. We have to speed up our response, which need more funds,” he said .\nHe also apprised that from the announced donations of 150 million dollars from various countries, only 38.5 million dollars transactions were received uptil now. .",
  "retrievedAt": "2025-08-11T15:34:26.038Z"
}
