{
  "title": "U.S. Embassy partners, USPWC launch ‘Pakistan Future of Women, Work Initiative’",
  "link": "https://www.app.com.pk/national/u-s-embassy-partners-uspwc-launch-pakistan-future-of-women-work-initiative/",
  "date_published": "2022-09-14T12:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):In partnership with Texas A&M University, S&P Global, and the U.S. Chamber of Commerce’s U.S.-Pakistan Business Council, the U.S. Embassy in Islamabad and the U.S.-Pakistan Women’s Council (USPWC) launched the Pakistan Future of Women and Work Initiative here on Tuesday.\nThe launch event highlighted a study on the impact of COVID-19 on women’s workforce participation in Pakistan, and efforts to catalyze research, public discourse, and private sector commitments to address gaps facing women amidst the ongoing pandemic, a press release issued by the U.S. Embassy here Wednesday said.\nAt the launch event, the State Department’s Acting Principal Deputy Assistant Secretary for South and Central Asian Affairs Elizabeth Horst said, “Through the U.S.-Pakistan Women’s Council, the United States has been working for a decade to build bridges between the people of our two countries to support Pakistan’s sustained prosperity, benefiting thousands of women in Pakistan.”\nHe said today’s initiative helps create a foundation for greater collaboration and exchange between the two countries on women’s economic advancement, adding that when women are not part of the economy, Pakistan misses out on growth for the entire country but when women are included, everyone wins.\nHighlighting the U.S. provision of $53.1 million in humanitarian assistance and resilience programming to support Pakistan in the wake of devastating floods, U.S. Ambassador to Pakistan Donald Blome said, “Just as the COVID-19 pandemic highlights the disproportionate impact on women’s participation in the workforce, the catastrophic flooding in Pakistan is a reminder that women and girls are among the most vulnerable groups during a humanitarian crisis.\nHe said as the United States works to provide direct assistance to affected communities in Pakistan and to help mitigate the effects of future floods, “we will closely consider the unique impacts of the current flooding and other natural disasters on women and girls.”\nDr. Raymond Robertson, lead author of the study and Director of the Mosbacher Institute for Trade, Economics and Public Policy at Texas A&M University’s Bush School, said, “Women the world over bore a larger burden during the COVID-19 crisis than they usually do during economic recessions. Pakistan was no exception. We intend for our findings to start a conversation and shape investments to help women in the economy thrive.”\nManaging Director of S&P Global in Pakistan Mujeeb Zahur announced that S&P Global will put the data to use by partnering with USPWC to host workshops in Karachi, Lahore, and Islamabad to foster increased investments in women’s workforce participation.\nHe said, “Through data, dialogue and commitments made by the private sector, the Pakistan Future of Women and Work Initiative will inform government, private sector, and philanthropic dialogue and action to address challenges women are facing in Pakistan’s economy.”",
  "retrievedAt": "2025-08-11T15:34:29.961Z"
}
