{
  "title": "PILDAT releases 4th parliamentary year’s comparative performance report of provincial assemblies",
  "link": "https://www.app.com.pk/national/pildat-releases-4th-parliamentary-years-comparative-performance-report-of-provincial-assemblies/",
  "date_published": "2022-09-14T15:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP): Pakistan Institute of Legislative Development and Transparency (PILDAT) on Wednesday released comparative performance assessment report of provincial assemblies for the 4th parliamentary year with regards to working hours, days consumed in budget session and attendance of members and leaders of the opposition.\nAccording to the report, the Provincial Assembly of Khyber Pakhtunkhwa was only convened for 60 days during the fourth parliamentary year and worked for more days than other provincial assemblies during the year. Provincial Assembly of Balochistan met for 53 days, Punjab held only 42 sittings and Sindh assembly held 41 sitting during 4th parliamentary year, the report further said.\nIn comparative analysis, the KP Assembly was convened for most working hours at 126.05 hours during fourth year. The provincial assembly of Sindh has met for 111.51 working hours, Balochistan Assembly 91.10 working hours and Punjab Assembly 76.31 hours during the said period.\nAs per the PILDAT report, during the 4th parliamentary year, Chief Ministers of Balochistan have attended highest percentage (30 percent) of sittings of the assembly. Jam Kamal Khan, MPA had resigned as CM on October 24, 2021 and Mir Abdul Quddus Bezinjo, MPA replaced him on October 29, 2021. This is a combined attendance of both in which Jam Kamal Khan attended only 2 percent sittings and Mir Abdul Quddus Bezinjo attended 28 percent sittings).\nAttendance of Chief Ministers of Punjab ranked at two with 21 percent sittings. Sardar Usman Ahmed Khan Buzdar, MPA resigned as CM on March 28, 2022 and Mr. Muhammad Hamza Shahbaz Sharif, MPA replaced him on April 16, 2022, who was then replaced by Mr. Parvez Elahi, MPA on July 26, 2022. This is a combined attendance of these three Chief Ministers.\nCM Sindh Syed Murad Ali Shah attended 15 percent sittings during the 4th parliamentary year while CM KPK Mahmood Khan attended only 8 percent sittings of the provincial assembly during the said period.\nLeader of the Opposition in the Sindh Assembly, Haleem Adil Sheikh topped in the comparative analysis in terms of attendance as he attended 51.22 percent sittings during fourth parliamentary year, followed by leader of the opposition in Balochistan, Malik Sikandar Khan who attended 50.94 percent sittings, Mr. Akram Khan Durrani, leader of the opposition in KPK attended 18 percent sittings.\nThe KPK Assembly passed 60 laws, followed by Punjab which has passed 35 bills, Sindh 28 bills and Balochistan passed 27 bills during the said period.\nIn the fourth parliamentary year, the KPK Assembly spent 8 days in budget session, Sindh 7 days, Balochistan 7 days while Punjab Assembly showed 50 percent decline in days spend in budget sessions from 12 days to 6 days when compared to the third year, the report further said.\nDuring the fourth parliamentary year, quorum was pointed out 24 times in 22 (36.67 percent) in KPK Assembly, 7 times in Punjab,4 times in Balochistan while quorum was not pointed out in Provincial Assembly of Sindh.",
  "retrievedAt": "2025-08-11T15:34:22.587Z"
}
