{
  "title": "Two news bills introduced, two ordinances laid in NA",
  "link": "https://www.app.com.pk/national/two-news-bills-introduced-two-ordinances-laid-in-na/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):As many as two new bills including the Pakistan Citizenship (Amendment) Bill, 2025 and the Motor Vehicles Industry Development Bill, 2025 were introduced in the National Assembly on Wednesday.\nMinister of State for Interior and Narcotics Control Talal Chaudhry and National Food Security & Research Rana Tanveer Hussain introduced the bills in the National Assembly respectively.\nDeputy Speaker Syed Ghulam Mustafa Shah referred both the bills to the concerned standing committees for detailed deliberation.\nMeanwhile, two ordinances included the Capital Development Authority (Amendment) Ordinance, 2025 (Ordinance No. III of 2025) and the National Agri-trade and Food Safety Authority Ordinance, 2025 (Ordinance No. VI of 2025) were laid before the National Assembly as required by clause (2) of Article 89 of the Constitution.\nThe ordinances were laid by State Minister for Interior and Narcotics Control Talal Chaudhry and National Food Security & Research Rana Tanveer Hussain in the House respectively.\nMoreover, as many as four reports of various standing committees including Interior and Narcotics Control and Cabinet Secretariat were presented in the House.\nChairman Standing Committee on Interior and Narcotics Control Raja Khurram Shahzad presented the report of the Standing Committee on the bill further to amend the Pakistan Penal Code, 1860 [The Criminal Law (Amendment) Bill, 2024] (Ordinance No. VI of 2023) in the House.\nSimilarly, Chairman Standing Committee on Cabinet Secretariat Ibrar Ahmad presented three reports of the committee including the Asaan Karobar Bill, 2025, the National School of Public Policy (Amendment) Bill, 2025 and the bill further to amend the Civil Servants Act, 1973 [The Civil Servants (Amendment) Bill, 2025] in the House.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T10:33:35.480Z"
}
