{
  "title": "CDA Chairman orders 24/7 medical services, upgrades at Capital Hospital",
  "link": "https://www.app.com.pk/national/cda-chairman-orders-24-7-medical-services-upgrades-at-capital-hospital/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): Chairman Capital Development Authority (CDA) and Chief Commissioner Islamabad, Muhammad Ali Randhawa, paid a detailed visit to Capital Hospital on Wednesday, pledging significant improvements in medical facilities, infrastructure, and staff accountability.\n\nAccompanied by senior CDA officials including Member Finance, Member Engineering, and Director General Services, Randhawa toured key hospital departments such as the emergency unit, outpatient department (OPD), wards, laboratories, and dispensary.\n\nDuring the visit, he interacted directly with patients, listened to their concerns, and assessed the quality of care being provided.\n\nVideo Player\n00:00\n00:00\n00:00\nUse Up/Down Arrow keys to increase or decrease volume.\n\n“The Capital Hospital plays a vital role in public health, and any negligence in its operations will not be tolerated,” said Randhawa, emphasizing the need for clean, efficient, and patient-friendly services.Buy vitamins and supplements\n\nHe directed hospital administrators to prioritize hygiene, ensure 24/7 functionality of medical equipment, and guarantee the full-time presence of biomedical staff.\n\nOne of the key directives included the immediate upgrading of the hospital’s operation theatres and ensuring the MRI machine remains operational round the clock.\n\nRandhawa also ordered the release of necessary funds for new equipment and hospital modernization, instructing Member Finance to facilitate this without delay.\n\nHighlighting the importance of digitization, the chairman called on the IT Wing to implement digital attendance systems for doctors and streamline hospital records and services through technology.\n\nTo address long-standing maintenance issues, Randhawa directed DG Services to ensure elevators and air conditioners are repaired and maintained promptly.\n\nHe further instructed that senior CDA officials conduct daily visits to oversee hospital operations and ensure that improvement measures are being implemented effectively.\n\nTackling overcrowding and logistical issues, Randhawa ordered the relocation of the 1122 emergency service to a nearby Emergency and Disaster Management site, freeing up critical space at the hospital.\n\nHe also directed the Planning Wing to allocate dedicated parking for patient attendants to ease congestion.\n\n“Emergency services are the face of any hospital. Capital Hospital’s emergency department must meet the standards of leading medical institutions and be equipped with specialized doctors and modern technology,” Randhawa stated.\n\nHe also called for an expansion of emergency facilities and provision of essential medicines and up-to-date medical machinery.",
  "retrievedAt": "2025-08-10T10:21:04.000Z"
}
