{
  "title": "Pakistan ramps up fight against climate change: Dr. Shezra Mansab Ali",
  "link": "https://www.app.com.pk/national/pakistan-ramps-up-fight-against-climate-change-dr-shezra-mansab-ali/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):Minister of State for Climate Change on Wednesday stated that Pakistan is stepping up its fight against the devastating effects of climate change through initiatives like the National Adaptation Plan and the Recharge Pakistan programme.\n\nAddressing the National Assembly in response to a question from MP Shahida Rehmani, Dr Shezra Mansab Ali underscored the severe challenges posed by climate change, which has made Pakistan one of the world’s most vulnerable nations.\n\n“We are witnessing its impacts through recent heavy rains and earthquakes,” she said.\n\n“To counter this, we have developed the National Adaptation Plan, under which several key programmes are being implemented.”\n\nAmong these is Recharge Pakistan, a major initiative aimed at conserving and storing water resources.\n\nPartnering with the World Wide Fund for Nature (WWF), the programme employs nature-based solutions to manage rainwater and floodwater.\n\n“We are diverting this water to natural lakes, ensuring it is stored and used effectively rather than wasted,” she explained.\n\nThe initiative also includes the National Capital Land Water project, designed to bolster water management.\n\nIn addition to water conservation, Pakistan is focusing on urban resilience.\n\nShe highlighted new regulations mandating green building standards for future constructions.\n\nShe added, “These rules ensure that new buildings are resilient and environmentally sustainable,”.\n\nEfforts are also underway to address illegal encroachments, with the Capital Development Authority (CDA) tasked with controlling such activities.\n\nResponding to a supplementary question from MP Naeema Kishwar, Dr Shezra elaborated on Recharge Pakistan’s role in water conservation and storage, describing it as a “pivotal programme.”\n\nShe noted that environmental issues, including deforestation, are now a provincial responsibility following the 18th Amendment. “We are working closely with provincial governments to curb tree-cutting and other harmful practices,” she said.\n\nTo mitigate the risk of natural disasters, she stressed the importance of public awareness and disaster management.\n\n“The National Disaster Management Authority (NDMA) has established warning systems and issued public alerts for natural calamities,” she said.\n\n“However, we need to do more to raise awareness so people avoid high-risk areas during flood or heavy rainfall warnings and take necessary precautions, she stated.\n\nPakistan’s multifaceted approach, from innovative water management to resilient urban planning, reflects its determination to tackle climate change head-on, she said.",
  "retrievedAt": "2025-08-10T10:19:52.750Z"
}
