{
  "title": "Kamal reaffirms commitment to protect BF practice",
  "link": "https://www.app.com.pk/national/kamal-reaffirms-commitment-to-protect-bf-practice/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): Federal Minister for Health, Syed Mustafa Kamal, has reaffirmed the government’s unwavering commitment to promoting, protecting, and supporting breastfeeding practices for ensuring better health of child.Buy vitamins and supplements\n\nIn a message on the occasion of World Breastfeeding Week, the minister termed it a vital investment in Pakistan’s health, economy, and gender equality.\n\nHe emphasized that breastfeeding is not only nature’s best start in life for a child, but also a powerful equalizer that ensures every child has an equal chance of survival, growth, and development—regardless of background.\n\n“Breastfeeding is the first vaccine a child receives, providing essential antibodies and nutrients that protect against infections and chronic illnesses,” he stated.\n\n“It strengthens cognitive development, emotional bonding, and significantly lowers the risk of stunting, wasting, and undernutrition.”\n\nHighlighting findings from the latest National Nutrition Survey, the Minister expressed concern that only 48 percent of children in Pakistan are exclusively breastfed during the first six months—well below the global target of 60 percent by 2030.\n\n“While we have made progress in early initiation and continued breastfeeding, much more needs to be done to ensure every child and mother receives the support they need,” he added.\n\nHe stressed the importance of supportive policies, strong healthcare systems, family engagement, and active community involvement to ensure breastfeeding is facilitated at every level.\n\nHe announced that the government is actively working to strengthen national legislation by implementing and enforcing the International Code of Marketing of Breastmilk Substitutes in line with the World Health Assembly (WHA) 2016 recommendations.\n\nMustafa Kamal also highlighted the vital role of Lady Health Workers, community health workers, and peer counselors in spreading awareness and supporting breastfeeding practices, especially in underserved areas.\n\nHe advocated for stronger linkages between facility-based and home-based care to ensure continuity for mothers.\n\nAddressing workplace challenges, the Minister underscored the need for both public and private sectors to adopt family-friendly policies, including breastfeeding breaks, lactation spaces, and flexible work schedules, enabling mothers to return to work without compromising their child’s health.\n\n“Breastfeeding is not just a health issue—it’s a gender equality issue,” he noted. “It reflects the disproportionate burden of unpaid care work that women bear. We must move towards a system that empowers women with informed choices and the necessary support to breastfeed if they wish to.”Buy vitamins and supplements\n\nHe called on all segments of society—policymakers, healthcare professionals, employers, media, civil society, and families—to play their part in building an enabling environment for mothers.\n\n“Breastfeeding is more than a feeding method. It is a lifeline, an act of care and protection, and a right that must be upheld,” the Minister said.\n\nHe said, “Let us come together to protect, promote, and support breastfeeding—for our children’s health, our women’s empowerment, and the strength of our nation.”",
  "retrievedAt": "2025-08-10T10:20:53.508Z"
}
