{
  "title": "Revocation of Articles 370, 35A dark chapter in Kashmir's history: Sultan Butt",
  "link": "https://www.app.com.pk/national/revocation-of-articles-370-35a-dark-chapter-in-kashmirs-history-sultan-butt/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Senior leader of the All Parties Hurriyat Conference (APHC), Muhammad Sultan Butt, has strongly condemned India’s unilateral actions in Indian-Illegally Occupied Jammu and Kashmir, terming the abrogation of Articles 370 and 35A on August 5, 2019, as a blatant attempt to further the Hindutva agenda and permanently alter the region’s demography.\n\nIn an exclusive interveiw with APP, Butt said that India has persistently engaged in conspiracies to erode Kashmir’s identity and autonomy.\n\n“The unilateral revocation of constitutional provisions has enabled non-Kashmiris, particularly Hindus, to purchase land and settle in the occupied territory,” he said.\n\n“This move is aimed at changing the demographic composition of Jammu and Kashmir, which has caused severe unrest among the local population,” he added.\n\nHe noted that none of the stakeholders in Kashmir or even in India have accepted these actions.\n\n“The people of Kashmir, the political parties, the Hurriyat leadership, and even opposition parties in India, including the Congress, have rejected this move,” Butt said.\n\nCalling August 5 a “black day” in Kashmir’s history, Sultan Butt stated that India’s steps are temporary and will eventually be reversed.\n\n“This is not the will of the people. The Indian government will not be able to sustain these actions. Sooner or later, the unconstitutional amendments will be undone, Insha’Allah,” he added.\n\nHe strongly criticized the continued detention of Kashmiri political leaders and the suppression of dissent. “India has imprisoned the legitimate leadership of Kashmir and is punishing them simply because they refuse to accept its illegal occupation and repressive policies.”\n\nButt urged the international community to break its silence and take cognizance of the situation in Kashmir. “It is imperative that we unite to awaken the global conscience and expose the human rights violations being committed in Kashmir.”\n\nExpressing deep gratitude to Pakistan, Sultan Butt acknowledged Islamabad’s unwavering diplomatic and moral support for the Kashmiri cause.\n\n“We highly value Pakistan’s efforts in highlighting the Kashmir issue on global forums. We hope Pakistan will continue its support until Kashmiris achieve their right to self-determination.”\n\nHe concluded by asserting that the future belongs to the people of Kashmir and no amount of repression can silence their aspirations for freedom.",
  "retrievedAt": "2025-08-10T10:20:23.262Z"
}
