{
  "title": "All segments appreciating budget except opposition: Farrukh",
  "link": "https://www.app.com.pk/national/all-segments-appreciating-budget-except-opposition-farrukh/",
  "date_published": "2021-06-13T15:25:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jun 13 (APP):State Minister for Information & Broadcasting Farrukh Habib Sunday said all segments of society were satisfied with the federal budget and appreciating it except for the opposition.\nAddressing a press conference at Circuit House here, he said the government had allocated a major chunk of budget for welfare and development purposes. He said the government did not impose new taxes and all the fiscal measures were aimed at utilisation of existing resources and taxes.\nHe said corona also badly affected Pakistan’s economy, but with PM Imran Khan’s steadfastness, the country successfully overcome that critical situation, and now almost all economic indicators were positive. The large scale manufacturing has posted an excellent profit while the agriculture sector also performed well and “we are hoping that the remaining sectors will also start yielding good results before the next financial budget and the government will be in a position to pass on maximum benefits to masses”.\nHe said the government is focusing on uplift of the poor segments of society and under the Ehsaas programme, multiple factors have been identified to provide them with maximum relief. Now the government has introduced ‘Kamyab Pakistan’ programme and ultimate objective of the programme is to lift 4 to 6 million families from below the poverty line.\nThrough this programme, a large number of people would be involved directly in the economic activities and they would not only generate sustenance for themselves but also play their role in stability of the national economy.\nUnder this programme, Rs 500,000 loan would be provided on easy terms, he said adding that there was shortage of houses and the government would provide Rs 2 million for each individual to construct his own house. Similarly, a massive amount had been allocated for the farming community so that they could enhance per acre yield. It will also help eliminate the rural poverty.\nHe said that the main focus of the government was on preservation of water resources, which was actually lifeline for any society in general and for the agriculture sector in particular. Despite financial hurdles, every segment of the economy had been compensated in the budget, he added.\nHe said that another importance of the budget was that the government was focusing on the poor and neglected areas of the country. In this connection, a massive amount had been allocated for transformation of Karachi, where people were living in a very miserable condition. Similarly, steps have been proposed to enhance the living standard of people in Balochistan and Gilgit-Baltistan.\nHe said that earlier the government had doled out Rs 1459 billion in 2013 under National Finance Commission (NFC), which were increased to Rs 2384 billion in 2018 and now the amount had been increased to Rs 3412 billion.\nThe state minister said that Prime Minister Imran Khan had emerged as a global environment leader by launching and hosting the summit on global environment. He said that innovative idea of 10 billion tree plantation had been appreciated by every segment which would bring a major environment change and provide a favorable, healthy and excellent ecosystem for the coming generations.\nThe minister said that the PML-N had allocated only Rs 802 million to control environmental changes, but the PTI government had enhanced it to Rs 14.5 billion, which had been recognised by the global community. The previous government had allocated only Rs 138 billion as subsidy for the public, but the PTI government increased the amount to Rs 682 billion which would facilitate the special groups and sectors of the economy.\nHe appreciated foreign remittances and said that the expatriate Pakistanis were playing a major role in stabilising national economy. He said that overseas Pakistanis were remitting $500 million per annum, which would help Pakistan meet its foreign commitments.\nHe said that the PPP had allocated only Rs 70 billion for the Benazir Income Support Programme (BISP), but the PTI government increased allocation by 34 per cent for the Ehsaas programme and enhanced its amount from Rs 210 billion to Rs 262 billion. It will facilitate the vulnerable segments of society.\nHe said that yet another important aspect of the budget is fixation of minimum salary of the unskilled persons up to Rs 20,000. We have not only announced this scheme but now we have started to take measure to implement it in letter and spirit.",
  "retrievedAt": "2025-08-11T20:50:31.090Z"
}
