{
  "title": "UNICEF Regional Director concludes one-week visit to Pakistan",
  "link": "https://www.app.com.pk/national/unicef-regional-director-concludes-one-week-visit-to-pakistan/",
  "date_published": "2021-06-13T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): UNICEF Regional Director for South Asia George Laryea-Adjei concluded his first official visit to Pakistan in which he stressed the importance of ensuring continuity of essential services for women and children.\n“We know that COVID-19-related disruptions have had a devastating impact on the most vulnerable children and families over the past year,” George Laryea-Adjei said.“It is critical to ensure that lifesaving, essential services for children and mothers, including routine immunization, keep running even as the pandemic continues.\nUNICEF will continue to support the government to respond to the pandemic and to build more resilient health and education systems that can reach every child.”\nThe UNICEF Regional Director began his visit by meeting Prime Minister Imran Khan with members of the Global Polio Eradication Initiative Board in Islamabad, said a press release issued here.\nTogether with Dr Ahmed Al-Mandhari, WHO Regional Director for the Eastern Mediterranean, and representatives of the Bill & Melinda Gates Foundation, Laryea-Adjei attended the launch of the June polio campaign.\n“It is inspiring to see the commitment of frontline workers and communities towards our joint vision of a polio-free Pakistan. I applaud the efforts to deepen the link between the polio eradication programme and routine immunization, which is a significant step in the right direction,” Laryea-Adjei said.\nLaryea-Adjei visited Peshawar’s Shaheen Muslim Town and Karachi’s Gujro, two super high-risk districts in the north-western Khyber Pakhtunkhwa province and in the south-eastern Sindh province where polio is endemic.\nUNICEF works with provincial authorities to run Integrated Services Delivery programmes that seek to provide a package of essential services in high-risk communities.\nThrough the integrated approach, children are not only given polio drops but also immunized against other diseases and provided with a package which includes screening and treatment for malnutrition; birth registration; access to safe drinking water and sanitation services; advice on hygiene, child health care and early childhood development.\nThe Regional Director also stressed the need to overcome the devastating impact of the new surge of COVID-19.\n“We may be exhausted, but the virus is not. As I speak, the virus continues to spread in South Asia, health workers are putting themselves at risk, and health systems are struggling,” Laryea-Adjei said. “Over one billion people are still waiting for their vaccine in the region.\nThis includes over seven million frontline health workers who still are not fully vaccinated. The longer this virus continues to spread unchecked, the higher the risk of more deadly or contagious variants emerging. World leaders must step up to share excess doses and ensure health systems in South Asia are prepared for future waves of COVID-19.”\nOn Thursday, Laryea-Adjei visited the Pakistan Institute of Medical Sciences (PIMS) in Islamabad. A center of excellence, PIMS implements low cost, high impact interventions supported by UNICEF to save newborn lives.\nDuring his visit, the Regional Director met with mothers who are taught how to use ‘skin-to-skin’ contact to help care for their premature newborns in the Kangaroo-Mother Care unit. He discussed with front-line workers who work in the 24-hour immunization service room to make sure that no baby is discharged without receiving their first immunization dose of polio, tuberculosis, and hepatitis B vaccines.\n“Despite progress, Pakistan remains one of the countries with the highest number of newborn deaths in South Asia, with one newborn dying every two minutes,” Laryea-Adjei said.\n“The country is headed in the right direction thanks to new policies and the dedication of front-line workers. However, more investment is needed in cost-effective, quality interventions to ensure every child survives its first days of life.”",
  "retrievedAt": "2025-08-11T20:50:30.891Z"
}
