{
  "title": "Pakistani nation stands behind London tragedy victim family: Envoy",
  "link": "https://www.app.com.pk/national/pakistani-nation-stands-behind-london-tragedy-victim-family-envoy/",
  "date_published": "2021-06-13T18:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): Pakistan High Commissioner to Canada Raza Bashir Tarar attended the funeral prayers for four members of the London Ontario-based Muslim family killed last Sunday, saying Pakistani nation stood with the family “shoulder to shoulder” in that hour of grief.\n“Our hearts are bleeding because of the atrocity that has befallen this wonderful, marvellous family,” he said as he conveyed to the family the deepest condolences and prayers from Prime Minister Imran Khan, Foreign Minister Shah Mahmood Qureshi and the entire Pakistani nation.\nThe high commissioner also thanked the Canadian leadership and the people for standing with the family of the victims, and also standing up to Islamophobia by condemning all forms and expressions of Muslim-hate in Canada and elsewhere in the world.\nEarlier, dead bodies of Salman Afzaal 46, wife Madiha Salman, their 15-year-old daughter Yumna Afzaal and Salman’s 74-year-old mother Talat Afzaal were brought to the Islamic Centre prayer ground, draped in the Canadian flags.\nThe funeral prayers were attended by hundreds of people observing Corona related SOPs.\n“And the very fact their coffins are draped in the beautiful Canadian flag is an apt testimony of the fact that the entire Canadian nation stands with them,” Raza Bashir Tarar said.\nMeanwhile, a series of prayer sessions and vigils were held in different cities of Canada by various Canadian Pakistani associations and groups to express solidarity for the victims of the Sunday killings.\nPakistan Canada Association of Edmonton arranged a talk on the cause of hate and racist incidents happening in Alberta, challenge of Islamophobia and how community leaders from diverse backgrounds could come together for an open conversation on these subjects.\nThe discussion was also attended and addressed by Consul General of Pakistan Vancouver Janbaz Khan.\nA number of federal and provincial parliaments members, government functionaries, and political parties’ representatives attended a gathering in Montreal to express solidarity with the brutally murdered Muslim family in London-Ontario.\nSpeaking at the occasion, Ishtiak Ahmed Akil, Acting Consul General of Pakistan Montreal, highlighted the statements and speeches of Prime Minister Imran Khan made at various international forums including the UN General Assembly and called for the international community’s attention towards taking concrete actions against a rising tendency of Islamophobia all over the world.\nA prayers meeting was arranged in a local mosque in Toronto and attended by Consul General of Pakistan Toronto Abdul Hameed among others.\nA similar prayer session and vigil was also held in Ottawa and represented from The Pakistan High Commission by Counsellor Press Hamid Raza Khan.",
  "retrievedAt": "2025-08-11T20:50:27.881Z"
}
