{
  "title": "Punjab governor removed as per constitution: Tarar told NA",
  "link": "https://www.app.com.pk/national/punjab-governor-removed-as-per-constitution-tarar-told-na/",
  "date_published": "2022-05-11T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP): Minister for Law and Justice Azam Nazeer Tarar on Wednesday said the Punjab governor had been removed in line with the law and constitution of the Pakistan.\nSpeaking in the National Assembly, he said “As per the constitution of the country, the president is bound to act as per the advice of the cabinet and Prime Minister”.\nHe also quoted a decision of the apex court of 2012 in which directions had been issued to implement the advice of PM in the removal of governor.\nThe minister said on the advice of the then prime minister Imran Khan, when he was facing a no-confidence motion in the National Assembly, the president had removed and appointed governors within no time.\nTarar said Prime Minister Shehbaz Sharif had advised the President twice for removal of the Punjab governor, but it was not implemented. Following which, the federal government notified that Punjab Governor Omar Sarfraz Cheema had ceased to hold office on the advice of the prime minister sent to the president on April 17 and reinforced on May 1.\n“If the parliament and the constitution are not defended at present, we will be ashamed before the next generation,” he added.\nAttorney General of Pakistan (AGP) Ashtar Ausaf Ali elaborated the Article 48 (2) of the Constitution and said whenever the matter (governor’s appointment/removal) was taken to the courts they viewed “it is the pleasure of the prime minister, pleasure of the federal government and not of the president.”\nCommenting on removal of Punjab governor, he said it was clearly mentioned that only the appointing authority could remove, adding it could not happen that Prime Minister appointed [the governor] and be retained by President. The same rule applied for the office of AGP said.\n“It (removal of the Punjab governor) is not only in line with the Constitution, the Business Rules and decision of the Supreme Court,” he said.\nGrand Democratic Alliance (GDA) MNA Ghous Bux Mahar said the Constitution was not clear on the procedure of removing a governor unless he/she tendered resignation himself/herself.\nThe GDA members opposed a resolution presented in the House by MNA Mohsin Dawar urging the President of Pakistan to play a role of non-partisan while dealing with state affairs, keeping in view the Constitutional provisions.",
  "retrievedAt": "2025-08-11T14:52:11.856Z"
}
