{
  "title": "CCI approves National Electricity Policy 2021 to reform power sector: Hammad",
  "link": "https://www.app.com.pk/national/cci-approves-national-electricity-policy-2021-to-reform-power-sector-hammad/",
  "date_published": "2021-06-21T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): Federal Minister for Energy Muhammad Hammad Azhar on Monday said that the Council of Common Interests (CCI) unanimously approved the National Electricity Policy-2021 to streamline matters related to power sector.\n“It is a historic time [for the country] as we have succeeded to formulate a national electricity policy which will have its impact in the next five to ten years when our next generations will get inexpensive and eco-friendly electricity, mainly depending on local fuels,” said the minister in a news conference.\nFlanked by Special Adviser to the Prime Minister on Finance and Revenue Dr Waqar Masood Khan, the minister said unlike past, the policy was formed with a long-term view that would focus on reforming the power sector in the coming decade.\nHe said the policy was formulated after extensive deliberation with all the stakeholders who had discussed each and everything related to the power sector at length. Four meetings of the CCI, in addition to more than 100 meetings with all the federal and provincial stakeholders, were held in that regard, he added.\nTransparency, development of local fuels and more reliance on clean energy was the hallmark of the national electricity policy, he said, adding a national action plan would be chalked out under the initiative.\nHe said the policy envisioned special targets for renewable energy, long-term hydel projects and development of local fuels, paving the way to determine power tariff through open competitive process among private investors.\nThe minister said the next step would be the formulation of multiple sub policies pertaining to various sectors including generation, transmission and renewable energy, which would eventually become part of the national electricity plan whose variables to be shifted to the Indicative Generation Capacity Expansion Plan (IGCEP) model after approval of the CCI.\nHe said the past governments had been making abortive attempts to form such a policy, but failed to do so due to certain reasons such as lack of interest.\nHammad said the major issue in the power sector was the finances not the electricity generation as the present government faced issues related to capacity payments of billions of rupees annually due to expensive agreements signed by the previous regimes with the Independent Power Producers (IPPs).\nThose capacity payments eventually did balloon the circular debt, he added.\nHe said another major issue was the electricity transmission as the capacity to transmit the power had been increased up to 24,000 Megawatt during the last two years.\nThe transmission network still required capacity addition of around 10,000 MW for which the government had allocated Rs1 billion funds in the next budget.\nHe added the power sector had many challenges pertaining to transmission, imported fuels, circular debt and others.\nTo a question, he said, that Pakistan had met 24, out of the 27 Financial Action Task Force(FATF) requirements while there was a rapid progress on remaining three points.",
  "retrievedAt": "2025-08-11T20:52:17.086Z"
}
