{
  "title": "SBP policy initiative to enhance financial inclusion of persons with disabilities : President",
  "link": "https://www.app.com.pk/national/sbp-policy-initiative-to-enhance-financial-inclusion-of-persons-with-disabilities-president/",
  "date_published": "2021-06-21T15:47:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 21 (APP): President Arif Alvi on Monday said the policy initiative by State Bank of Pakistan (SBP) would eventually enhance financial inclusion of persons with disabilities (PWDs) in the country.\nThe president appreciated the SBP for designing a comprehensive policy to facilitate the PWDs in collaboration with all the stakeholders.\nIn his key note address, he expressed satisfaction that the launch of new policy by the SBP would contribute significantly in alleviating the difficulties faced by the PWDs, which would enhance their confidence in the financial system significantly.\nHe highlighted the difficulties experienced by the PWDs in the society and referred to the impediments faced by them in accessing financial services. He also drew attention towards the more vulnerable segment of PWDs – women with disabilities, who might face two-fold discrimination.\nThe president hoped that all the stakeholders would continue to collaborate on a regular basis to keep the momentum of providing improved infrastructure, service delivery, use of innovative technologies and availability of financing at an affordable cost.\nThe State Bank of Pakistan has unveiled the policy to specifically enhance the financial inclusion of persons with disabilities.\nThe policy was launched at a meeting here with President Dr Arif Alvi as the chief guest and attended by senior SBP officials, presidents/chief executive officers of banks and heads of non-governmental organizations working for PWDs.\nThis policy aims at financial independence for the PWDs by improving their access to banking services as well as providing opportunities to contribute as bank employees.\nAn important feature has been incorporated in collaboration with the banks and non-governmental organizations (NGOs) dedicated to improving the lives of PWDs, said a press release.\nState Bank Governor Dr Reza Baqir apprised the president about the efforts being made to improve the quality of banking services for the PWDs. He acknowledged the valuable input given by various associations of PWDS in this regard.\nDr Reza Baqir said the SBP would work with banks to support the goal that PWDs had equal access and opportunity to participate in economic activities.\nHe emphasized that the banks should design and deliver products and services that cater to the special needs of PWDs, and make physical and assistive technological infrastructure available for their facilitation.\nHe said the promotion of diversity and inclusion was an important pillar of the SBP’s overall policy framework, aimed at deepening of the financial system to achieve broad-based sustainable growth and development.\nNational Bank of Pakistan President Arif Usmani, speaking on behalf of the Pakistan Banks Association, reiterated the banking sector’s full commitment in supporting the financial inclusion of PWDs. Amin Hashwani, on behalf of associations of PWDs thanked the SBP for issuance of the policy. SBP’s Ghulam Muhammad Abbasi made\na detailed presentation on the policy.\nThe SBP’s new instructions require the board of directors of banks to approve a policy and strategy framework for the financial inclusion of PWDs, while management will ensure its implementation.\nUnder the policy framework, banks will offer products and services catering to the special needs of all categories of PWDs, including the physically handicapped, visually impaired, and those with hearing and speech disabilities.\nBanks have been asked to ensure the availability of essential forms and documents in braille, sign language interpretation services and ramps at the entrances of their branches and ATM (auto-teller machines) vestibules.\nThe importance of respectful and empathetic behaviour towards PWDs has been given prominent attention and banks have been asked to create awareness and train their employees in serving customers with the PWDs.\nThe SBPs policy places special emphasis on giving priority, special assistance, and care to the vulnerable segment of society in order to increase their financial inclusion.\nIn the context of helping PWDs to join banks as employees, an important feature of the policy requires banks to meet prescribed job quota for the PWDs and align human resource policies and practices to cater to their specific needs throughout the career cycle.\nThis covers recruitment, retention, capacity building, and career development in addition to conventional HR practices. In order to encourage female PWDs, the job quota for PWDs at banks, shall ensure at least a 25% share for women with disabilities. Moreover, while designing products and services, the banks shall ensure focused and efficient provision of banking facilities to female PWDs.\nThis ground breaking policy also entails establishment of a dedicated network of model branches across the country, including Azad Jammu Kashmir (AJK) and Gilgit Baltistan (GB), which will provide all necessary physical and technological infrastructure and services at one place for PWDs.\nSBP has required banks to develop the policy framework for PWDs by 30th September 2021. Banks are also required to establish a minimum number of Model branches, under a prescribed criteria, in each province, AJK and GB by 31st March 2022.",
  "retrievedAt": "2025-08-11T20:52:15.824Z"
}
