{
  "title": "COVID-19 claims 30, infects 907 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-30-infects-907-more-people/",
  "date_published": "2021-06-21T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): The national tally on Monday of total active COVID-19 cases was recorded 34,020 with 907 more people tested positive for the deadly virus and 829 people recovered from the disease during the last 24 hours.\nThirty corona patients have died during past 24 hours, 28 of whom were under treatment in the hospitals and two out of the hospitals had perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in Sindh followed by the Punjab.\nOut of the total 30 deaths occurred in the last 24 hours 14 of them had died who were under treatment on ventilators.\nThere were 2,238 Covid infected patients under treatment in critical care among four of them admitted in various Covid dedicated healthcare facilities in past 24 hours.\nThe National Covid positivity ratio during past 24 hours was recorded 2.6 percent.\nIt may be mentioned here that the Covid positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major areas including Islamabad 21 percent, Lahore 21 percent, Bahawalpur 26 percent and Multan 34 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gilgit 45 percent, Abbottabad 23 percent, Karachi 23 percent and Muzaffarabad 26 percent.\nAround 283 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, and Gilgit Baltistan (GB).\nSome 34,754 tests were conducted across the country on Sunday, including 13,985 in Sindh, 6,299 in Punjab, 9,149 in Khyber Pakhtunkhwa (KP), 3,627 in Islamabad Capital Territory (ICT), 828 in Balochistan, 391 in GB, and 475 in AJK.\nAround 893,148 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 949,175 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 19,967, Balochistan 26,633, GB 5,813, ICT 82,368, KP 137,075, Punjab 345,065 and Sindh 332,254.\nAbout 22,007 deaths were recorded in country since the eruption of the contagion. Around 5,341 have perished in Sindh among 12 of them died in hospitals and two out of the hospitals on Sunday.\n10,642 in Punjab had died with nine deaths occurred in past 24 hours. All of them died in the hospitals.\n4,269 in KP where seven of them died in hospitals on Sunday, 775 in ICT, 301 in Balochistan, 108 in GB and 571 in AJK succumbed to the deadly virus.\nA total of 14,148,424 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 2,497 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:52:23.865Z"
}
