{
  "title": "Massive plantation efforts help revive lost butterflies in twin cities",
  "link": "https://www.app.com.pk/national/massive-plantation-efforts-help-revive-lost-butterflies-in-twin-cities/",
  "date_published": "2021-06-21T12:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): The residents of the twin cities of Rawalpindi and Islamabad have embraced the once endangered species of Butterflies after massive plantation launched by the government under Ten Billion Tree Tsunami Plantation (BTTP) programme.\nThe colorful and delicate insect species with its unique patterns of wings has a crucial role in our environment where it played a significant role in cross pollination of buds among various fruits and crops yielded in the various ecosystems, told APP the Head of Entomology Department of Arid Agriculture University Rawalpindi Dr Imran Bodlah.\nDr Imran said the Butterfly used to feed on nectar of flower bore by various plant species that provide a favourable and conducive environment to breed in the environment.\n“Many birds, insects and vertebrates of different kinds feed on butterfly larvae, pupa and adults which continue to sustain the food cycle. Its absence from the ecology breaks the cycle of food chain leading to disorder in species existence,” he said.\nHe said the plantation being carried in the garrison city of Rawalpindi and Islamabad had not only helped in reviving butterflies rather provided alternate host trees or plants bearing flowers with conducive nectar for its nourishment.\nMargalla Hills National Park, Dr Imran said, had a thriving population of diverse plant species whereas increase in its number had supported the nurturing of butterflies that were dying or going extinct due to global warming and anthropogenic activities.\nTo a query, he responded that raising temperature was one of the factors driving the decline of butterflies whereas pollution levels spike and galloping urbanization was leading to disastrous impacts resulting habitat loss of the butterflies.\nHe went on to mention that the public should plant fruit trees in their surroundings that used to bear flowers for long duration along water resources as it would help revive massive population of butterflies.\nResponding to another query, he said loss of butterflies was not a positive omen as they used to help in cross-pollination of various fruits and crops leading to good yield and extinction of butterflies would mar crop and fruit cultivation.\nHe said it was a healthy and soothing sight to see butterflies hovering from flower to flower and nestling in the two rapidly urbanized mega cities after massive plantation.\nPublic should take ownership of the precious ecology being depleted for a sustainable and pollution free environment, he added.",
  "retrievedAt": "2025-08-11T20:52:21.903Z"
}
