{
  "title": "Prof. Zaheer appointed in WHO expert advisory group on blood safety",
  "link": "https://www.app.com.pk/national/prof-zaheer-appointed-in-who-expert-advisory-group-on-blood-safety/",
  "date_published": "2021-06-21T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): The World Health Organization (WHO) has appointed Pakistani medical expert Prof. Hasan Abbas Zaheer to its Advisory Group on Blood Regulation, Availability, and Safety.\nThe Advisory Group comprises of 25 global blood transfusion experts representing a broad range of disciplines relevant to blood regulation and blood transfusion medicine.\nThis prestigious appointment is in a personal capacity but is also an honor for the country and an acknowledgment of the achievements of the blood safety systems reforms being implemented in Pakistan since 2008 by the government’s Safe Blood Transfusion Programme.\nProf. Zaheer is the pioneer of blood safety reforms in Pakistan initiated in 2008 by the federal Health Ministry. He served as the National Coordinator of the German government-funded Safe Blood Transfusion Program, Ministry of Health since its inception in 2010 till his retirement last year.\nDuring this period he helped transform the existing fragmented and unsafe blood system with the internationally recommended centrally coordinated system through the development of a nationwide network of large modern Regional Blood Centers linked to existing (renovated) Hospital-based Blood Banks.\nThrough the Programme the capacity of the national partners and many implementation systems and processes have also been developed and tested. In addition to the national stakeholders, the key international partners in this reforms process included the German Development Bank KfW and the World Health Organization.\nThe functions of the WHO Advisory Group included advising on the development of WHO norms, standards, technical guidelines and high-level strategic recommendations advising on scaling up the implementation of existing WHO policies, strategies as well as strengthening the national systems for blood supply and regulation to achieve the goal of universal access to safe, effective and quality assured blood products, providing a scientific assessment of current and emerging threats to the safety and availability of blood and blood products; and advising on the recommended measures and actions to be taken by the Member States in preparedness for and in response to the emerging public health threats.\nAs a member of the prestigious WHO Advisory Group, Prof. Zaheer will continue to not only contribute to the blood safety reforms process in the country but also share his professional expertise to promote blood regulation, availability and safety at the international level.",
  "retrievedAt": "2025-08-11T20:52:22.694Z"
}
