{
  "title": "Senate condoles death of Usman Kakar, eulogizes his political services",
  "link": "https://www.app.com.pk/national/senate-condoles-death-of-usman-kakar-eulogizes-his-political-services/",
  "date_published": "2021-06-21T15:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): The Senate on Monday adopted a resolution to condole the sad demise of former Senator Muhammad Usman Khan Kakar and paid glowing tributes to him for his meritorious parliamentary services.\nMaulana Faiz Muhammad led Fateha for the departed soul on the request of Chairman Senate Muhammad Sadiq Sanjrani. The former Senator passed away on June 21, 2021 after brief illness.\nSenators lauded the unflinching commitment of the deceased to democracy, constitution, rule of law and supremacy of the Parliament.\nLeader of the House in the Senate Dr. Shahzad Waseem said that the whole House was in grief due to sad demise of former Senator Usman Khan Kakar. He also condoled with his family.\nLeader the opposition in the Senate Yusuf Raza Gilani said Senator Usman Kakar was highly respected political worker. He also condoled with his family and party leaderships.\nMinister for Railways Senator Azam Swati said despite ideological differences, he had a good relationship with Usman Kakar. He prayed for the elevation of the rank of Usman Kakar in paradise.\nParliamentary Leader of Pakistan Muslim league (PML-N) Senator Azam Nazir Tarar also paid a glowing tribute to the parliamentary services of Senator Usman.\nMinister of State for Parliamentary Affairs Ali Muhammad Khan said Senator Usman Kakar was very sincere with his party workers, adding that despite ideological differences on some issues, he was part of us. He said that Usman Kakar had always spoken for the people of Balochistan.\nPPPP Senator Sherry Rehman said that Usman Khan Kakar was very strong voice for the rights of people of his province. She said that he was also voice of the deprived people across the country.\nSenator Manzoor Kakar said the sudden demise of Usman Khan Kakar was a national tragedy, adding he was a courageous leader.\nSenator Raza Rabbani while condoling the death of Usman Kakar said that he was a true democratic, adding that we lost two great comrades Mir Hasil Khan Bizenjo and Senator Usman Khan Kakar.\nSenator Tahir Bizenjo said the death of Usman Kakar was a tragedy for Balochistan and was an honest leader.\nSenator Muzaffar Hussain on behalf of his party PML Functional, condoled sad demise of Senator Usman Kakar. He termed his death a great loss for the country.\nSenator Fida Muhammad appreciated the parliamentary services of Usman Khan Kakar and condoled with his family.\nSenator Kamran Murtaza, Senator Bahramand Khan Tangi, Senator Atta ur Rehman, Senator Dilawar Khan, Senator Kuda Babar, Senator Rana Maqbool, Senator Nawabzada Umar Farooq, Senator Hafiz Abdul Karim, Senator Kamran Michael and Senator Muhammad Akram also spoke about various aspects of life and politics of late Usman Khan Kakar.\nSenators also demanded to conduct the postmortem of his body and constituting a committee for probing the sudden death of Usman Khan Kakar.\nChairman Senate informed the House that postmortem of late Usman Khan Kakar was underway on the request of his family.\nLater, Leader of the Opposition in the Senate Yousaf Raza Gillani read a condolence resolution. The House adopted the resolution expressing profound grief, shock and sorrow on the sad demise of former Senator Muhammad Usman Khan Kakar who passed away today on June 21, 2021.\nDuring his tenure as Member Senate of Pakistan he served in various Committees of the Senate and he remained Chairman of the Committee on Less Developed Areas, said resolution, adding that he also made landmark speeches in the House on all important national and international issues and always raised his voice for the rights of the people of Balochistan as well as all the voiceless and the oppressed.\nHe was a human rights activist, with strong courage and convictions.\nThe services rendered by him for supremacy of the parliament and democracy in true letter and spirit will be long remembered. His death is not only the loss of his family and his party but also of the nation. His reports on the less developed areas of Pakistan remain a landmark documents, with clear policy guidelines for the Parliament.\nThis House expresses its deepest sympathies with the bereaved family, friends and his party leadership. We pray to Almighty Allah to shower His infinite blessings upon the departed soul and may his soul rest in eternal peace, the resolution concludes.",
  "retrievedAt": "2025-08-11T20:52:16.549Z"
}
