{
  "title": "Pakistan desires peaceful, stable Afghanistan: FM",
  "link": "https://www.app.com.pk/national/pakistan-desires-peaceful-stable-afghanistan-fm/",
  "date_published": "2021-06-21T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 21 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Monday reiterated that Pakistan wanted peace and stability in Afghanistan and it had always played its role, at different fora of the world, for peace, reconciliation and politically negotiated settlement of the issue.\nTalking to media during his visit to National Institute of Health (NIH), the foreign minister referred to his recent visit of Turkey and said that about 44 foreign ministers and other heads of governments from different countries had acknowledged the role Pakistan played for the peaceful resolution of the Afghan issue.\nHe said Afghans had to take decision about their future, Pakistan desired lasting peace in Afghanistan as an immediate neighbour its interests were linked with that country. With peace and stability, the shared objectives of connectivity and economic cooperation could be met, he added.\nHe observed that it was a test for the Afghan leadership and they had to take decision, adding an Afghan faction was busy to run away from its failures in Afghanistan.\nThe foreign minister said that he also held meetings with his Afghan counterpart and chairman Afghan Reconciliation Council Dr Abdullah Abdullah and exchanged views on the Afghan peace process.\nDuring conversation, the foreign minister said Afghan side had shared their concerns over recent developments, cautioning if Afghanistan reeled back into 90s, it would definitely mount pressure on Pakistan, and might once again, increase influx of Afghan refugees.\nThe foreign minister said Pakistan was a shared partner in peace process and he had told his Afghan counterparts that trust was must in this regard.\nThe foreign minister sharing his concerns said that Afghanistan looked like a divided house. By harping on the old tunes at US would do no good for the region, he observed.\nIn Antalya Diplomatic Forum, he said, the foreign ministers of different countries also emphasized upon political settlement resolution of the issue.\nQureshi further said the foreign forces were pulling out of Afghanistan, about 60 per cent troops’ drawdown had completed and still continued.\nHe said the US wanted to rid Afghanistan from international terrorist network and they thought that they had achieved their objective. The US had trained Afghan army and helped establish their infrastructure, but now the Afghan government was admitting that they could not defend itself, he said expressing his wonder.\nIn the US-Taliban agreement, it was agreed upon that Afghan soil would not be used against any country which was a development, he added.\nQureshi further said Pakistan had given huge sacrifices in the war against terrorism in terms of human and financial losses.\nHe said he had responded to comments of Afghan national security advisor as a Pakistani and the whole nation had also trashed his baseless accusations, even Afghans had also disagreed with his statement terming it unsuitable.\nAbout Indian prime minister Modi’s call for a moot on Indian Illegally Occupied Jammu and Kashmir (IIOJK) on June 24 , the foreign minister termed it as unusual development. It was an admission of New Delhi that nothing was right in IIOJK.\nHe said Kashmiris had unanimously rejected India’s steps of August 5, 2019, ever Mehbooba Mufti and Farooq Abdullah who had shared power with the Indian government did not accept these steps.\nThe foreign minister, on the occasion, lauded the covid vaccination arrangements for the diplomatic corps, at NIH.\nEarlier, while addressing the diplomatic corps at NIH, the foreign minister said Pakistan faced the coronavirus pandemic and had been successful in its efforts to contain its spread.\nThe whole world acknowledged prime minister Imran Khan’s smart lockdown policy which on one hand, saved the peoples’ lives while on the other, helped in continuation of their livelihood.\nExpressing his satisfaction, he said the vaccination drive in the country continued successfully.\nThe event was attended by the Dean of the diplomatic corps, group of ambassadors, senior officials of the ministry of foreign affairs, NIH officials and media personnel.\nThe foreign minister lauded all the stakeholders especially, ministry of health services, regulations and coordination, NIH and the National Command and Operation center (NCOC) for their relentless efforts during the pandemic.\nHe also appreciated the preparation process of Pak-Vac by the NIH experts which manifested their professionalism and dedication. He also referred to indigenous manufacturing of ventilators.\nQureshi further expressed gratitude to the World Health Organization (WHO) and China for their support and help in securing vaccines.\nHe also commended the health workers, doctors and paramedical staff who braced the coronavirus waves with their professional dedication and sacrifices.\nSpeaking on the occasion, Executive Director of NIH Prof Dr Maj Gen Aamer Ikram lauded the lead role played by the ministry of foreign affairs in Pakistan’s COVID response, starting from the largest repatriation operation in the history of the country that brought back stranded Pakistanis from more than 70 countries around the world, last year.\nWhile appreciating Pakistan’s effective COVID response, the Dean of the Diplomatic Corps, speaking on behalf of the diplomatic community, conveyed great appreciation for the assistance provided by the ministry of foreign affairs to the diplomatic missions during the ongoing pandemic.",
  "retrievedAt": "2025-08-11T20:52:17.992Z"
}
