{
  "title": "Pakistan urges India to end illegal detention of Kashmiri activists",
  "link": "https://www.app.com.pk/national/pakistan-urges-india-to-end-illegal-detention-of-kashmiri-activists/",
  "date_published": "2023-08-17T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP):Pakistan Thursday urged India to bring an end to the unjustified and illegal detention of Khurrum Pervaiz and Irfan Mehraj and numerous other Kashmiri activists who were languishing in jails for raising their voice against Indian oppression.\nSpeaking at a weekly press briefing here, the Foreign Office Spokesperson said, “In a communication addressed to the government of India, UN special procedures for human rights have expressed serious concerns at the arrest, detention and charges against Kashmiri human rights defenders Khurram Pervaiz and Irfan Mehraj.”\n“The communication has been signed by the UN Special Rapporteur on the Situation of Human Rights Defenders; the Working Group on Enforced or Involuntarily Disappearances; the Special Rapporteur on the Rights of Freedom and Peaceful Assembly and of Association; and the Special Rapporteur on the Promotion and Protection of Human Rights and Fundamental Freedoms,” she added.\nKhurram Pervaiz, who was the Programme Coordinator of the Jammu and Kashmir Coalition of Civil Society (JKCSS) and Irfan Mehraj, a researcher with JKCSS, were detained in Rohini prison in New Dehi. The UN Special Procedures had expressed concern that their arrests and detention were designed to delegitimize their human rights work and to obstruct monitoring of the human rights situation in IIOJK.\nThe Spokesperson said the communication by the UN Special Procedures was yet another indictment of the Indian occupation authorities in Indian Illegally Occupied Jammu and Kashmir (IIOJK) as it continued to silence and harass Kashmiri human rights defenders.\nTo a question, she said, “Pakistan has always welcomed peace and dialogue between countries especially between our friends.” “Iran is a friend and so is the United States. We welcome constructive engagement and result oriented dialogue between them. As far as the meeting with Dr. Aafia Siddiqui is concerned, I do not wish to speak on a case that is subjudice.”\n“But what I can say is that the Ministry of Foreign Affairs, our Embassy in Washington and our Consulate in Houston have been closely following the case of Aafia Siddiqui and the requests for consular access.”\nTo another question about relations with Afghanistan, she said Pakistan had said clearly time and again, that it would like to have peace and amity with Afghanistan.\n“Our relationship is centuries old, it is rooted in our culture and in our history. It is important for the two sides to resolve all differences and concerns and that is why we have been raising our concerns with respect to terrorism that emanates from Afghanistan and endangers Pakistan. This has been an area of regular contact and dialogue between our two countries,” she added.",
  "retrievedAt": "2025-08-11T09:11:33.318Z"
}
