{
  "title": "NCRC expresses concern over many rising incidents of child rights violations",
  "link": "https://www.app.com.pk/national/ncrc-expresses-concern-over-many-rising-incidents-of-child-rights-violations/",
  "date_published": "2020-06-27T23:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):The newly established National Commission on the Rights of the Child (NCRC) has expressed its concerns over the rising incidents of child rights violations in its maiden meeting held here the other day.\nIn its inaugural meeting the National Commission for the Rights of the Child (NCRC) reiterated to highlight impediments that have caused children to suffer in inhumane circumstances, while moving forth to a mechanism that would serve as a model for the protection and welfare of the child.\nThe commission is mandated to advice the federal and provincial governments to align in laws, policies and prograrmmes related to child rights in compliance with constitutional obligations and international commitments. This commission is empowered to work for the promotion, protection and fulfillment of child rights.\nAfshan Tehseen Bajwa, chairperson NCRC welcomed the members of the commission and appreciated the efforts of ministry of human rights for establishment of the commission headed by its minister Shireen Mazari.\nThe Commission believes that the future of our country lies in the child; therefore, a child should be given the environment to raise a productive citizen.\nThe meeting was attended by ex-officio members; Mohammad Hassan Mangi, Ministry of Human Rights; Qazi Baleen, ministry of Forign Affairs; Shehzed Nawaz Cheema, ministry of Interior; Sara Ahmed , Child Protection Welfare Bureau Punjab; Mohammad Amen Met, Sindh Child Protection authority; Mohammad ljaz Khan, KPK Child Rights commission; Nasir Baloch, Balochistan Child Rights Commission; Dr. Sulman Shah, National Commission of Status of Women and Ahab Alam National Commission on Human Rights. All members unanimously extended their full support to operationalize the commission.\nThe members from provinces and child members were also present there including Dr. Rubina Fareed (member ITC), Dr. Rubina Feroze Bhatti (Member Punjab) lqbal Ahmed Detho (Member Sindh), Mohammed Hashim Kakar (Member Punjab), Dr. Jahanzeb Khan (Memebr KP), Faryal Javed (child member) and Tajdar Hashmi Qureshi (child member).\nMuhammad Hassan Mangi, DG MoHR highlighted that “One of the ignored areas in child rights is child’s participation that was the reason to include children in NCRC”.\nShehzad Nawaz Cheema, JS law from ministry of Interior urged to have more interaction between MoFA and NCRC for supporting the commission strategically while Qazi Saleem , director human rights and humanitarian affairs MoFA stated that “We look forward to active role of NCRC in strengthening child protection framework in Pakistan. Sara Ahmed, chairperson Punjab Bureau ensured that the Bureau will strengthen the commission at provincial level in Punjab.\nThe meeting was concluded on the note that the Commission would now be reaching out to other stakeholders to join hands and collaborate in erecting a suitable system that can cater to the growing needs of the child. While discussing the impact of COVID-19 on children, the chairperson emphasized the adequate provision of budgetary allocation for the improvement of the socio-economic conditions of the children.",
  "retrievedAt": "2025-08-11T19:24:58.196Z"
}
