{
  "title": "Over 92,000 people recovered so far from pandemic",
  "link": "https://www.app.com.pk/national/over-92000-people-recovered-so-far-from-pandemic/",
  "date_published": "2020-06-28T01:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):Making a significant count against the novel coronavirus (COVID-19) above 92,000 people in Pakistan had so far recovered from the pandemic, official figures said on Sunday.\nAccording to the NCOC data shared, 25,013 tests conducted during last 24 hours and 92,624 people recovered so far across the country making it a significant count.\nIt also said that total active Covid cases in the country are 106,213 and 502 vents occupied across the country out of 1562 vents allocated for COVID-19.\nIt also said that a total of 202,955 cases detected so far (AJK 1027, Balochistan 10261, GB 1423, ICT 12395, KP 25380, Punjab 74202, Sindh 78267.\nAbout the details on deaths the data said that 4,118 deaths have occurred including 1243 in Sindh, Punjab 1673, KP 914, ICT 122, Balochistan 114, GB 24 and AJK 28.\nIt said that 1,239,153 tests have been conducted and 768 hospitals with COVID facilities with 5,342 patients admitted across the country.\nThe government also provided 189 additional oxygenated beds in Islamabad in a four days’ time span to meet contingency requirements.\nSpecial Assistant to Prime Minister (SAPM) on National Health Services Dr Zafar Mirza in an online meeting informed Regional Director of the World Health Organization Dr. Ahmed Al-Mandhari that Pakistan was fighting COVID-19 through a robust coordinated national response.\nPurpose of the meeting was to discuss Pakistan’s COVID-19 response and explore areas where WHO could provide technical guidance and support to the country.\nSpeaking about political commitment in Pakistan to fighting the disease, Dr Mirza said this was the highest level of uninterrupted political attention to a health-care issue.\nPrime Minister Imran Khan chaired the National Coordination Committee with all Provincial Chief Ministers as members, he added.\nThe National Command and Operation Centre was established in March with top leadership discussing each aspect of the response thread-bare every day.\nPakistan was implementing smart lockdowns rather than a generalized lockdown as the prime minister was cognizant of the financial hardship for around 25 percent of the population living below the poverty line.\nCurrently 543 lockdowns are in place across Pakistan shared by Dr Zafar Mirza.\nHe added 35 SOPs had been developed and the public was being educated through a strong risk communication initiative.\nStrict action was being taken against those who do not adhere to the SOPs, he shared. “We have ramped out our health system to cater to critical cases and done so with unprecedented speed,” Dr Mirza added.",
  "retrievedAt": "2025-08-11T19:24:54.824Z"
}
