{
  "title": "European countries opting for smart lockdowns; an effective strategy PM Khan consistently pronounced",
  "link": "https://www.app.com.pk/national/pm-feels-pride-over-his-team-for-enforcing-smart-lockdown/",
  "date_published": "2020-06-28T01:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):Contrary to earlier harsher lockdowns which led the economies to a grinding halt in different countries of Europe, now a number of these countries are opting for smart or selective lockdowns.\nThis approach is vehemently and consistently advocated by Prime Minister Imran Khan to face the challenge of coronavirus pandemic without imperiling the economy and pushing huge masses into margins of unemployment, hunger and poverty.\nAccording to a report of Ferdinando Giugliano, a renowned columnist on the European economics for the ‘Bloomberg View’, said the European Union countries are experimenting with new ways of dealing with the coronavirus.\nGermany, Portugal and Italy have all enforced selective or “smart” lockdowns, shutting down smaller regions in response to new outbreaks as opposed to bringing their entire countries to a halt.\nThis approach is the only hope of returning to a more normal life as we wait for a vaccine. However, it also puts a much larger onus on the public sector compared to generalized lockdowns. Health officials have to ensure small outbreaks do not get out of control and force the need for harsher measures.\nPrime Minister Imran Khan Sunday took to his twitter account to draw a parallel between these approaches and highlighted his government’s successful strategy for smart lockdown which was yielding tangible and positive results.\n“My team was amongst the first to enforce smart lockdowns. I am proud of it for helping me continue to navigate our country through the Covid19 crisis. InshaAllah, from now onwards if we follow SOPs we will see off the worst of this crisis,” he posted on his twitter account.\nAccording to Bloomberg report, Germany has seen a number of outbreaks in abattoirs, leading local governments to declare new lockdowns, such as in the municipality of Guetersloh, and enforce partial lockdowns, such as in the nearby town of Warendorf.\n“But if Europe is successful in this new phase of its fight against the pandemic, the economic and social benefits could be huge. Only a vaccine or a benign mutation will ensure that the COVID-19 threat is over. Until then, smart lockdowns are the best hope we have,” he added.\nAccording to author, over the past few months, Italy has managed to contain some small flare-ups, including one in the tiny region of Molise and one in Rome, without having to impose additional restrictions. But the southern region of Calabria has recently imposed quarantine on an area of the seaside town of Palmi, after a handful of cases were reported. And after a worrying new spike in cases, Portugal has ordered stores in parts of the Lisbon region to shut down early, among other restrictions.\nSome of these cases show striking similarities. For example, many of these new outbreaks originated in migrant communities facing overcrowded living quarters or unsafe working conditions. This was true of one meat processing plant owned by the Toennies Group in Germany, where more than a thousand employees, most of them migrants from Eastern Europe, came down with COVID-19.\nThis was also the case of the much smaller outbreak in Italy’s central region of Marche. It was similar in Portugal: At the end of May, an outbreak emerged in Lisbon’s Jamaica neighborhood, which was already struggling with a housing crisis. Health-care facilities are another potential source of contagion, as was the case for the recent flare-up in Rome.\nSo far, the authorities have managed to contain these outbreaks. In Italy, the number of new infections has been stable in the low hundreds for the past few weeks, despite a substantial reopening of the economy.\nIn Germany, the reproduction rate “R” of the coronavirus, which measures how many people a virus carrier infects on average, shot up to nearly three last weekend — well above the level of one needed to believe the outbreak is under control. Fortunately, this factor has begun to decline. According to the country’s Robert Koch Institute, it also does not appear to be too alarming since the overall number of cases remains relatively low, it added.\n“This tailored approach to lockdowns is in no way a repudiation of the more draconian measures most European countries enforced earlier. In fact, the current strategy can only work because Europe has largely brought new infections under control. It doesn’t look as feasible for countries such as the U.S. and Brazil, where new infections are still on the rise in many areas,” the author further added.\nFerdinando Giugliano stressed that smart lockdowns required the collaboration of citizens: ‘Wearing masks and maintaining social distancing are two ways to reduce the risk of a new surge in cases",
  "retrievedAt": "2025-08-11T19:24:54.720Z"
}
