{
  "title": "Religious Ministry to start refunding Government Scheme hajj dues from Thursday",
  "link": "https://www.app.com.pk/national/religious-ministry-to-start-refunding-government-scheme-hajj-dues-from-thursday/",
  "date_published": "2020-06-28T00:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):The Ministry of Religious Affairs and Interfaith Harmony has decided to refund Government Hajj Scheme dues following the Saudi decision of excluding pilgrims from outside Saudi Arabia from performing hajj this year to contain coronavirus spread in the kingdom.\nAccording to spokesman of the ministry, the branches of designated scheduled banks would start cash return of the deposited hajj dues of Government Scheme pilgrims from Thursday (July 2).\n“All successful hajj applicants of Government Scheme were being informed about the repaying of their amount by sending messages to mobile phone of each pilgrim,” the spokesman said.\nA pilgrim will have to visit his respective bank branch (where he had deposited the dues) along with original CNIC and bank receipt of hajj dues deposit for cash return of the amount. While in case of getting amount through banker’s cheque, the group leader should visit the relevant bank’s branch along with the original documents of his group’s intending pilgrims.\nThe applicants should contact Accounts Officer Refund on telephone No: 051-9208465 in case of any difficulty in refunding process. Hajj inquiry number 051-9205696; 051- 9216980-82.\nIn case closure of the relevant branch, he said the amount will be refunded through other nominated bank branch.\nA total of 86,765 intending pilgrims were picked through general balloting from out of 149,295 applicants, aspiring to perform the sacred religious obligation under Government Scheme.\nA total 179,210 Pakistanis were aspiring to perform hajj this year including 107,526 under government scheme and 71,684 under private\nscheme.\nThe government Hajj package (per person) was Rs 463,445 for north region without Qurbani and Rs 486,270 for same region with Qurbani (animal sacrificial).\nWhile Rs 455,695 for South Region without Qurbani and Rs 478,520 for same region without Qurbani.",
  "retrievedAt": "2025-08-11T19:24:55.854Z"
}
