{
  "title": "PM directs CDA to operationalize Islamabad metro bus service from April 16, orders inquiry into project’s delay",
  "link": "https://www.app.com.pk/national/pm-directs-cda-to-operationalize-islamabad-metro-bus-service-from-april-16-orders-inquiry-into-projects-delay/",
  "date_published": "2022-04-14T03:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP): Prime Minister Shehbaz Sharif on Thursday directed the Capital Development Authority (CDA) to operationalize the Islamabad Metro Bus Service from April 16 and ordered an inquiry into the delay in the launch of the project pending for last four years.\nThe prime minister, at 7 am, visited the Peshawar More metro bus station and reviewed the on-ground progress of the project.\nIslamabad Metro Bus Service was launched by then Prime Minister Nawaz Sharif in 2017 and was due to become functional in 2018.\nPM Shehbaz Sharif directed the authorities concerned to run the metro bus service from Peshawar More to Islamabad International Airport in order to facilitate the passengers traveling towards the airport.\nHe also ordered to carry out a feasibility study as per PPRA (Public Procurement Regulatory Authority) rules for two additional routes, namely from Rawat and Bhara Kahu connecting the airport.\nHe directed to establish a metro bus station on the motorway for better connectivity and to enhance the benefit of the service to a maximum number of people.\nShehbaz Sharif expressed dismay over the delay in the materialization of the project, terming it severe negligence as Rs 16 billion had been spent on the mega project of public importance.\nHe termed it unfair towards the general public whose tax money had been consumed, however the facility in return was being denied to them.\nHe directed the officials concerned to make TORs of the inquiry to assess the reasons for the delay that led to the loss of national wealth.\nThe prime minister suggested ensuring the installation of racks in the buses to accommodate the luggage of passengers en route the airport.\nHe directed running free-of-cost service for a trial period until the installation of ticketing machines.\nPM Shehbaz Sharif after assuming his office on April 11 had ordered to make operational the Islamabad metro bus service within five days.\nThe leaders of the Pakistan Muslim League-Nawaz Ahsan Iqbal, Marriyum Aurangzeb, Hanif Abbasi, and Anjum Aqeel accompanied the prime minister during the visit.\nThe officials of the National Highway Authority and CDA briefed the prime minister about the project.\nIt was highlighted that initially 30 buses would be run on the 24-kilometere-long track from Peshawar More to Islamabad International Airport. Fifteen buses will be taken from Punjab Mass Transit Authority, Rawalpindi till the new fleet is added to Islamabad metro service.\nThe prime minister was informed that CDA was temporarily operating on behalf of the government, while a separate Metro Bus Authority was required to be formulated.\nBuses will be covered in orange skin for route coding. The NHA to N5 station will take 6-8 minutes and from N5 to the airport around 25-30 minutes. The shuttle service will be run on a stretch of 11 kilometres.\nLater in a tweet, Shehbaz Sharif said the mass transit systems were the way forward to provide citizens with dignified, inexpensive, and environment-friendly transport service.\nHe said it was unfortunate that public welfare projects had suffered delays and cost overruns. “Almost all sectors of economy remained stagnant under Imran Khan,” he regretted.\nPML-N Spokesperson Marriyum Aurangzeb in a tweet said PM Shehbaz Sharif had given directives to run free of cost metro bus service during the month of Ramazan. She said the previous rulers were making the excuse of “foreign conspiracy” to cover up their incompetence and corruption.",
  "retrievedAt": "2025-08-11T14:42:17.880Z"
}
