{
  "title": "Shibli asks citizens to stay away from PDM rallies as COVID-19 spreading rapidly",
  "link": "https://www.app.com.pk/national/shibli-asks-citizens-to-stay-away-from-pdm-rallies-as-covid-19-spreading-rapidly/",
  "date_published": "2020-12-08T17:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP): Referring to Pakistan Democratic Movement (PDM)’s upcoming public gathering in Lahore, Minister for Information and Broadcasting Senator Shibli Faraz Tuesday asked the citizens to stay away from its rallies to save their own and their families’ lives from the second wave of coronavirus pandemic.\nAddressing a post-cabinet press briefing along with Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar, Shibli urged Lahoris and others to refrain from falling into the PDM leaders’ trap as they were liar and deceitful, and had nothing to do with the public welfare.\nHe said the PDM leaders did not bother about the ordinary people as they just wanted to use them for their own agendas and vested interests. Their level of sincerity with the people could be gauged from the Bakhtawar Bhutto Zardari’s engagement in which the COVID-19 test was mandatory for the participants.\nOnce the rallies were over, they would not even help the people to get tested for the coronavirus, he added.\nTheir public gatherings were only meant to get relief in the corruption cases by building pressure on the government but they were mistaken as they had to meet their ultimate fate,” the minister said adding Prime Minister Imran Khan was an honest leader and would never compromise with them corruption cases.\nHe said the PDM leaders had looted the country with impunity bringing it at the brink of destruction and weakened the national institutions.\nThe opposition leaders during their tenure promoted nepotism and appointed their blue-eyed people on covet positions that eventually led to the massive brain drain of the country as competent people opted to move abroad for jobs, he added.\nShibli said when the PDM leaders were in the power, they took every possible step to weaken the country’s economy. They kept the economic trajectory upward with cosmetic measures and put the tough decisions under the carpet, he added.\nHe said people had rejected them in the last general elections for their corruption, but now they refused to accept the results, especially in those areas where they were lost.\nShibli Faraz said the opposition was silent over elections’ results for last two years but now it was making rumpus about ballot rigging all of the sudden.\nHe said as per international election observers, last general elections were fairer than 2013 ones.\nHe said opposition had its own definition of fair and unfair elections, if JUI-F chief lost his seat, it was an unfair election and if his son elected Member of the National Assembly, then it was fair.\nIf Shahid Khaqan Abbasi lost his native town seat, the election was rigged and if he clinched the victory from any other part of the country, then he had no issue about its transparency.\nSimilarly, the Pakistan Peoples Party considered elections fair in Sindh but refused results elsewhere, he added.\nCalling opposition as irresponsible and immature, he said how it could ask the elected government to go back to pavilion without any logical reason while it had looted the national wealth, weakened the state departments, and promoted land mafia and nepotism culture in the country during its tenures.\nHe said the present government had been striving to ensure national progress through economic stability.\n“Our prudent policies are paying dividends as inflation is declining, prices of sugar and wheat are decreasing, economic indicators are getting better, foreign loans are under control and sales of cement, cars and motorbikes are on rise.”\nThe minister said two new dams and cities were being set up to spur economic activities and jobs creation in times of coronavirus, which had ravaged the economies of other countries.\nCommenting on current situation of the pandemic in the country, he said the second wave of coronvirus seemed more dangerous than the first one, which was dealt by the government effectively.\n“Our smart and effective strategy during the first wave helped us safeguard the peoples’ lives and livelihoods.”\nMentioning the government steps to curb the virus spread during the second wave that included ban on indoor weddings, schools closure and others, he said the number of deaths due to coronavirus had reached to the level of June, when 89 people succumbed to the virus in single day.\nHospitals were over burdening as positivity ratio was on rise, he said, adding if the situation remained the same, more restriction would follow.\n“We will not impose complete lockdown or restrictions on revenue generating sectors, but those sectors which do not have any economic activity can be closed in the wake of more coronavirus cases.”\nShibli also lauded the efforts of National Command and Operation Center for guiding the government in coping with the first wave.\nTo a query, he said Kashmir issue had been internationalized due to effective strategy of Prime Minister Imran Khan. A strategy was being made to curb the growing Islamophobia globally in effective manner.\nHe said Pakistan and Afghanistan relations were improving gradually due to effective foreign policy.\nIt was the first time in the history that the current Afghan president publicly appreciated the role of Pakistan in Afghan peace process and spoke about Prime Minister Imran Khan’s recent visit to Kabul.\nMeanwhile, the information ministry shared a news release of the cabinet meeting, chaired by Prime Minister Imran.\nAccording to it, the cabinet approved the appointment of chairman and executive director of State Life Insurance Corporation and postponed the matter pertaining to amendments in the import policy of weapons of non prohibited bores till its next meeting.\nThe prime minister issued directions for formulating a policy for promotion of weapons industry in the tribal districts and to bring it in the legal ambit.\nThe prime minister directed to review the production of morphine produced from opium poppy in tribal districts to stop illegal use of the plant in these areas.\nThe cabinet allowed import of 37,605 kilogrammes montanide oil and vaccines for the livestock by the Department of Livestock and Dairy Development Punjab.\nThe cabinet approved Rs 2,500 per month M Phil allowance for those personnel of armed forces who had verified degree from the Higher Education Commission.\nThe civil employees were already getting this facility.\nAfter the certification of Controller General of Accounts, the finance ministry presented the consolidated financial reports of the federation and provinces for the financial years 2014-15 to 2017-18 in the cabinet.\nIn the next cabinet meeting a comparative analysis of the report would be presented.\nThe cabinet in principle had given its consent for the appointment of House Building Finance Company managing director.\nIn line with the direction of Islamabad High Court, it supported highlighting of steps for the protection of sanctity of Prophet Muhammad Peace Be Upon Him.\nThe cabinet authorised the provincial quota for admission in the dentistry department of Shaheed Zulfiqar Ali Bhutto Medical University Islamabad.\nIn order to improve the capacity of distribution companies, the cabinet approved the reorganisation of the board of directors of six companies and inclusion of local representatives in them.\nThe boards of companies of Lahore, Peshawar, Quetta, Islamabad, Faisalabad and Hyderabad were to be reorganised.\nThe law ministry took back the summary for construction of Federal Judicial Complex in Karachi while the Ministry of National Food Security and Research withdrew the summary for reorganisation of Pakistan Central Cotton Committee.\nThe cabinet delayed the appointment of Pakistan Tourism Development Corporation (PTDC) managing director and instructed the cabinet division to put before it the nominations of experts.\nIt endorsed the decisions taken by the Cabinet Committee on Legislation during its meeting held on November 18.\nIt also ratified the decisions taken by Economic Coordination Committee in its meetings on December 2 and 3.\nUnder the National Aviation Policy 2019, the cabinet allowed two private Pakistani airlines including Air Blue and Serene Air to fly international flights to more countries.\nThe cabinet allowed additional charge of Karachi Port Trust chairman for three months to Nadir Mumtaz Warraich.\nThe approval was given till the appointment of regular chairman.\nIt also gave go ahead for appointment of Shakeel Ahmed as Pakistan National Shipping Corporation chairman.",
  "retrievedAt": "2025-08-11T20:06:57.775Z"
}
