{
  "title": "Coronavirus pandemic poses serious threat to human lives: PM",
  "link": "https://www.app.com.pk/national/coronavirus-pandemic-poses-serious-threat-to-human-lives-pm/",
  "date_published": "2020-12-08T18:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Prime Minister Imran Khan Tuesday said that there should be no politics on coronavirus pandemic because it posed threats to human lives and the country’s health system could not afford its large scale spread.\nDuring a meeting of the cabinet, the prime minister also took notice of the provision of oxygen in hospitals and directed that abundant supply of oxygen should be made available in this regard, whereas, hospitals should also devise a mechanism in this regard.\nAccording to a press release of the PM Office media wing, PM’s special assistant Dr Faisal Sultan apprised the cabinet about the latest situation of coronavirus pandemic and said that its second wave was proving lethal as the country registered 89 deaths in a day.\nRecord spike in the coronavirus related cases had been witnessed in different cities, he added.\nMinister for Industries Hammad Azhar apprised the meeting that the oxygen using industries had assured that in emergency situation, they would provide required oxygen to hospitals. Currently, the country had three times additional stock of oxygen compared to its requirement.\nThe cabinet approved appointment of chairman and executive director State Life Insurance Corporation. Appointment of additional secretary Ministry of Maritimes Affairs Nadir Mumtaz Warraich as chairman Karachi Port Trust was also granted. He would hold the additional charge for three months and during this period, process for regular appointment of the chairman would be completed.\nThe cabinet also approved appointment of Shakeel Ahmed Mangnejo as chairman Pakistan National Shipping Corporation.\nIt also approved Rs 2500 MPhil allowance to personnel of armed forces who already possessed Higher Education Commission verified MPhil degrees and to those who would acquire such degrees in the future. The civil servants had already been availing the same allowance.\nThe ministry of finance with the verification of Controller General of Accounts, presented collective financial reports of the federal and provinces pertaining to fiscal year 2014-15 to 2017-18. In the next cabinet meeting, a comparative review of these reports would be submitted.\nThe cabinet also approved fixation of provincial quota in the department of dentistry of Shaheed Zulfikar Ali Bhutto university Islamabad.\nIt also approved constitution of board of directors of six DISCOS to further improve capacity of the power distribution companies. These companies included Faisalabad, Lahore, Islamabad, Hyderabad, Peshawar and Quetta. The cabinet approved inclusion of local representatives in the boards of these companies.\nThe cabinet also ratified decisions of its committees on legislation and economic coordination taken during their meetings held on November 18 and 2, 3 December this year respectively.\nUnder the National Aviation Policy 2019, it also granted its approval to two private local airlines Serene Air and Air Blue to run international flights to more foreign countries.\nForeign Minister Makhdoom Shah Mahmood Qureshi apprised the cabinet about the 47th foreign ministers meeting of Organization of Islamic Countries (OIC) which unanimously condemned illegal occupation of Indian Jammu and Kashmir by India.\nThe cabinet was further told that at the international level, under prime minister’s vision, the issue of Islamophobia and Namoos-e-Risalat were effectively raised which was a big achievement.\nThe prime minister, on the occasion, said that Islam had taught respect for other religions and they expected from the followers of other faiths to show respect to religion of Islam and Holy Prophet Hazrat Muhammad (Peace Be Upon Him).\nThey should take care that from their acts or words, Muslims’ religious sentiments about the Holy Prophet (PBUH) were not hurt, he added.\nThe prime minister stressed upon holding of dialogue at the international level to control the issue of Islamophobia.",
  "retrievedAt": "2025-08-11T20:06:57.689Z"
}
