{
  "title": "Int’l Anti-Corruption day to be marked tomorrow",
  "link": "https://www.app.com.pk/national/intl-anti-corruption-day-to-be-marked-tomorrow/",
  "date_published": "2020-12-08T10:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP): United Nations’ (UN) International Anti-Corruption Day will be marked on December 9 (Wednesday) across the globe including Pakistan to raise public awareness against corruption and its elimination.\nMusicals, plays, keynote speeches and other activities that focus on the theme of fighting against corruption help promote International Anti-Corruption Day. International Anti-Corruption Day is a time for political leaders, governments, legal bodies and lobby groups to work together against corruption work by promoting the day and the issues that surround this event.\nOn this day anti-corruption advocates organize events to engage the general public to effectively fight against corruption and fraud in communities. Other activities that promote the day include: musicals and plays to publicize the message of fighting against corruption. Keynote speeches by those who were victims of corruption or fought against it. Essay competitions on issues surrounding the topic of corruption.\nThe dissemination of posters, flyers and other material to increase awareness levels on corruption. Some organizations hold special recognition ceremonies to pay tribute to people and projects that provide assistance to nations and communities in the battle against corruption.\nCorruption comes in various forms such as bribery, law-breaking without dealing with the consequences in a fair manner, unfairly amending election processes and results, and covering mistakes or silencing whistle blowers (those who expose corruption in hope that justice would be served). UN General Assembly designated December 9 as International Anti-Corruption Day to raise people’s awareness of corruption and of the role of the United Nations Convention against Corruption in combating and preventing it.\nThe assembly urged all states and competent regional economic integration organizations to sign and ratify the United Nations Convention against Corruption (UNCAC) to ensure its rapid entry into force. UNCAC is the first legally binding, international anti-corruption instrument that provides a chance to mount a global response to corruption.",
  "retrievedAt": "2025-08-11T20:07:07.306Z"
}
