{
  "title": "Pakistan, Netherlands hold 8th round of bilateral political consultations",
  "link": "https://www.app.com.pk/national/pakistan-netherlands-hold-8th-round-of-bilateral-political-consultations/",
  "date_published": "2020-12-08T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Pakistan and The Netherlands on Tuesday discussed bilateral relations, including political, economic, trade and investment, climate change, cooperation on multilateral issues as well as developments in their respective regions.\nThe discussion took place during the 8th round of Pakistan-The Netherlands Bilateral Political Consultations (BPC) held in the virtual format.\nSpecial Secretary (Europe) Dr. Aman Rashid and Director-General for Political Affairs, Ministry of Foreign Affairs, The Netherlands, Mr. Thijs van der Plas, led their respective delegations.\nWhile expressing satisfaction at the steady growth in bilateral ties, it was reiterated that high-level interactions were necessary for further strengthening relations, a press release issued by the Ministry of Foreign Affairs here said.\nThe two sides expressed satisfaction at the level of cooperation at international fora, including at the UN and agreed to continue supporting each other.\nDutch side was briefed on the Covid-19 situation in Pakistan and the steps being taken by the government to save lives and livelihoods.\nSpecial Secretary (Europe) noted that The Netherlands is a major trade partner of Pakistan in the European Union and encouraged the Dutch side to take advantage of the investment opportunities created by business-friendly policies of the government especially in areas like agriculture, renewable energy, and tourism.\nThe Special Secretary appreciated Dutch support for Pakistan’s GSP Plus scheme and reiterated Pakistan’s commitment to the implementation of the 27 international conventions.\nThe two sides exchanged views on important global and regional issues.\nSpecial Secretary conveyed Pakistan’s concerns on the rise of xenophobia, particularly Islamophobia, in different parts of the world and stressed on the need to further promote inter-faith harmony.\nThe Dutch side was briefed on the Indian government’s discriminatory policies against minorities, and its illegal and unilateral actions in Indian Illegally Occupied Jammu and Kashmir (IIOJK) to alter its demographic structure, in contravention of the relevant UNSC resolutions and international law.\nSpecial Secretary (Europe) urged the Dutch side to stress upon India to lift the military siege, stop the ongoing gross violations of human rights in IIOJK, allow independent international organizations to carry out an inquiry, and take steps towards peaceful solution of the Jammu & Kashmir dispute in accordance with the relevant UN Security Council resolutions.\nThe Dutch side was also briefed on Pakistan’s efforts aimed at supporting peace process in Afghanistan.\nSpecial Secretary (Europe) stated that Pakistan would continue to support the peace process for an inclusive, broad-based and comprehensive political solution, paving the way for a peaceful, stable and prosperous Afghanistan.\nThe two sides agreed to remain in contact to further enhance bilateral relations in all spheres of mutual interest.",
  "retrievedAt": "2025-08-11T20:06:57.635Z"
}
