{
  "title": "Influx of educational apps capturing attention of home-stricken students",
  "link": "https://www.app.com.pk/national/influx-of-educational-apps-capturing-attention-of-home-stricken-students/",
  "date_published": "2020-12-08T10:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): The influx of educational apps during the second wave of COVID-19 pandemic was again capturing the attention of home-stricken students after closure of educational institutions to get intact with studies.\nHowever, the reliability and quality of these apps are still questionable for most of the parents who do not allow their children from adapting to the digital world of learning.\nTalking to APP, Expert on Information Technology, Nighat Dad said “Apps have always been an appealing source of providing entertainment and information in an engaging way. The educational apps undoubtedly disseminate knowledge in innovative and creative ways; however their value as compared to the actual learning might not be high”.\n“The potential of educational or learning apps for the young kids are higher as compared to the elder ones. As soon the children get older and start to learn more complex things, the learning value of apps decreases”, she observed.\nShe said app-based learning can still be used as a good accessory to formal learning, rather than a total substitute for it.\nNighat Dad said technology has changed our entire education system with the influx of online classrooms, online lectures by professors and teachers through short videos to explain particular concepts.\nApps are a part of this technological revolution of education and can work alongside all the other digital educational resources; however, these cannot stand alone in the field of learning.\nThe influx of apps during the COVID-19 days raises concerns regarding quality, privacy as well as digital safety and the question that if these apps are safe to use, and how they’re using our private data is an important one, she observed.\nParents and educators need to be on the lookout for these apps and make sure that children are not being targeted through these applications, especially younger kids, Nighat Dad advised.\nEducation expert, Murtaza Noor was of the view that since millions of the students have been suffering globally due to closure of educational institutions so it is very important to engage these students through various means of learning while staying at home.\nLearning apps can be useful for the students if these were according to their age group and curriculum however these cannot be the substitute of regular classroom coaching and guidance.\nMurtaza Noor suggested that these apps can be helpful for the time being to engage the students in learning activities.\nProfessor Tariq Bhatti, lecturer at a college said, “Sometimes when our kids play some online games, all of the sudden advertisements with objectionable content appear so it is necessary to check the reliable educational apps before installation and keep check on the kids while learning through apps also”.\n“Today we are living in the era of science and technology and can access a large number of educational apps at a time but the things which these apps lack are social environment of classroom, training about social behaviours and time management”, he observed.",
  "retrievedAt": "2025-08-11T20:07:06.719Z"
}
