{
  "title": "Religious scholars for ending gender-based violence for peaceful, just society",
  "link": "https://www.app.com.pk/national/religious-scholars-for-ending-gender-based-violence-for-peaceful-just-society/",
  "date_published": "2020-12-08T11:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 08 (APP): Religious leaders and scholars from different faith groups on Tuesday emphasized ending all forms of violence against women and girls terming it critical to building a peaceful society and maintaining and promoting interfaith harmony.\nThey were invited for a dialogue by UN Women, Provincial Office Khyber Pakhtunkhwa (KP) and EVAW Alliance KP as part of commemoration of the 16 Days of Activism against Gender Based Violence (GBV), a global campaign that runs from 25 November – International Day for the Elimination of Violence against Women – to 10 December, the International Human Rights Day.\nThe event was attended by religious scholars, members of EVAW Alliance, UN officials and civil society.\nReligious scholars discussed the issue of GBV in detail and jointly signed a declaration condemning gender-based violence and pledging to play their role in sensitizing communities in order to prevent and eliminate GBV.\nThey observed that, women, being the most vulnerable segment of the society and deprived of their basic rights, were more prone to violence followed by transgender community.\n“There is a need to strengthen state-run social protection networks and ensure the provision of required support to the vulnerable groups,” the scholars underlined.\n“For prevention of gender-based violence, the State has primary responsibility to protect its citizens and religious leaders have a strong potential to influence the lives and behaviour of those who follow their faith and share their beliefs,” stressed the participating scholars.\nZainab Qaisar Khan, Provincial Head UN Women KP, said that like other parts of the world, GBV was also rampant in Pakistani society.\nIt can happen anywhere, anytime and across all classes irrespective of education level and income status.\nIt can happen against boys, men, elderly and transgender but mostly the targets are women and girls,” she remarked, adding that GBV included, but was not limited to, domestic abuse.\nQamar Naseem, Co-Chair EVAW/G Alliance, threw some light on the role of religious leaders, while stating that religious leaders had great influence and could play a significant role in shaping the behaviours of local communities.\nHe said, “It is essential to engage religious scholars from different faith groups, as a practical strategy, to raise awareness on gender-based violence and address the issue.”",
  "retrievedAt": "2025-08-11T20:07:07.021Z"
}
