{
  "title": "National Curriculum Summit 2024 inaugurated at AIOU",
  "link": "https://www.app.com.pk/national/national-curriculum-summit-2024-inaugurated-at-aiou/",
  "date_published": "2024-11-26T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP):The Ministry of Federal Education and Professional Training, in collaboration with the National Curriculum Council (NCC), inaugurated the National Curriculum Summit 2024 on Tuesday at the Allama Iqbal Open University (AIOU).\nThe summit marks a significant milestone in the country’s ongoing efforts to modernize its education system by introducing new schemes of studies, subjects, and academic streams at both the Secondary School Certificate (SSC) and Higher Secondary School Certificate (HSSC) levels.\nThe Summit, which will conclude tomorrow (Wednesday), brings together key stakeholders in the education sector, including policymakers, educators, curriculum specialists, and thought leaders.\nThe event features keynote speeches and panel discussions aimed at shaping the future of Pakistan’s educational landscape.\nThe Summit kicked off with a warm welcome address by Mr Mohyuddin Ahmad Wani, Federal Secretary for the Ministry of Education and Professional Training.\nHe acknowledged the contributions of the National Curriculum Council and expressed his gratitude to all the participants for their active involvement in the two-day event.\nIn his address, Mr. Wani highlighted the suggestions made by Mr. Ahsan Iqbal, the Federal Minister of Planning, Development & Special Initiatives, regarding a holistic review of Pakistan’s education system. “We have successfully reviewed the existing scheme of studies and updated in just six months and the suggestions received from the summit will be made part of curriculum reforms” Mr. Wani stated.\nHe emphasized the importance of ensuring that the curricula remain relevant and dynamic, adapting to the needs of a rapidly changing world.\nThe keynote address was delivered by Mr. Ahsan Iqbal, who outlined the government’s vision for education reform. He shared his insights on the four key initiatives launched during PMLN’s tenure from 2013 to 2018, which faced significant challenges after their tenure but are now back on track. These initiatives are part of the government’s broader goal to transform Pakistan’s education system and align it with global standards.\n“Education plays a pivotal role in the development of any nation. To build a prosperous and competitive society, we need a strong foundation—starting with the curriculum,” said Mr. Iqbal.\nHe also acknowledged the ongoing debate over the medium of instruction, noting that while some advocate for Urdu and others for English, he believes in a pragmatic approach—Urdish, a combination of both languages. “Urdish is the future of our education system, a balanced blend that will foster better communication, cultural integration, and global connectivity,” he remarked.\nThe Minister further emphasized that the country faces a civilizational crisis, which demands urgent attention. “We need to reframe our education system to address not only academic knowledge but also our identity, values, and cultural heritage,” he said.\nIn an important announcement, Mr. Iqbal revealed plans to establish a Teaching Training Center aimed at enhancing the professional development of educators. The center will invite teachers from all provinces to participate in training programs designed to equip them with modern pedagogical skills and new teaching methods.\nDr. Shafqat Ali Janjua, Joint Educational Advisor of the National Curriculum Council (NCC), also addressed the summit, highlighting the latest developments in Pakistan’s curriculum. “The scheme of studies has been updated, with new curricula introduced at both the SSC and HSSC levels. New academic groups have also been included, broadening the scope of studies available to students and providing them with a wider range of academic and career pathways,” said Dr. Janjua.\nHe further emphasized that the curriculum is a continuous process of improvement, aimed at addressing contemporary challenges.\n“We are committed to ensuring that our curricula evolve with the times, equipping students with the knowledge and skills required to thrive in an increasingly complex global landscape,” he added.\nOver the next two days, the National Curriculum Summit will focus on several pressing themes aimed at enhancing the quality and relevance of the national goals.\nThese include Integration of Skills and IT in National Curricula, Entrepreneurship & Financial Literacy in Education, Innovation in the Teaching-Learning Process, Environmental Literacy & Greening Curricula, Redefining Assessment through Technology, Cybersecurity and Digital Citizenship, Incorporating Space Sciences in Education, and Cultivating a Healthy Mindset.\nThese discussions are designed to encourage dialogue and collaboration among various stakeholders, with the ultimate goal of ensuring that the national curriculum meets the evolving needs of students and society.\nThe two-day summit will continue to provide a platform for collaboration and thought leadership on the future of education in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:38:51.679Z"
}
