{
  "title": "Gilani calls for enhanced Pakistan-Saudi Arabia cooperation in trade",
  "link": "https://www.app.com.pk/national/gilani-calls-for-enhanced-pakistan-saudi-arabia-cooperation-in-trade/",
  "date_published": "2024-11-26T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Chairman Senate Syed Yousuf Raza Gilani on Tuesday emphasized the need to strengthen trade ties between Pakistan and Saudi Arabia in key sectors such as textiles, agriculture, and technology to achieve shared prosperity.\nDuring his official visit to Saudi Arabia, Gilani, accompanied by his delegation, held separate meetings with the Speaker of the Saudi Shura Council and the Saudi Arabia-Pakistan Friendship Group, according to a news release.\n“I deeply appreciate the warm reception and hospitality extended by the Speaker of the Shura Council,” he said during the meetings.\nDiscussions centered on bilateral cooperation, trade relations, and critical issues such as Palestine and Kashmir. “This visit reflects the strong brotherly ties between Pakistan and Saudi Arabia,” he added.\nGilani called for enhanced institutional collaboration, increased delegation exchanges, and stronger people-to-people connections between the two nations.\nHe urged joint efforts by Saudi Arabia and Pakistan to resolve the issues of Palestine and Kashmir while advocating for the rights of Muslims worldwide.\n“The global community must raise its voice against the ongoing atrocities in Palestine and Indian Illegally Occupied Jammu and Kashmir (IIOJK),” he stressed.\nHe called for practical solutions in line with United Nations resolutions and international laws.\nHighlighting severe human rights violations by Indian forces in IIOJK and Israeli forces in Palestine, Senate Chairman urged the global community to address these urgent issues.\nHe also expressed gratitude for Saudi Arabia’s unwavering support for Pakistan’s stance on these matters, underlining the importance of continued collaboration to advance mutual interests.",
  "retrievedAt": "2025-08-10T15:38:30.878Z"
}
