{
  "title": "Despite progress, adolescent girls continue to bear the brunt of the HIV epidemic with 98,000 new infections in 2022: UNICEF",
  "link": "https://www.app.com.pk/national/despite-progress-adolescent-girls-continue-to-bear-the-brunt-of-the-hiv-epidemic-with-98000-new-infections-in-2022-unicef/",
  "date_published": "2023-12-01T11:39:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Dec 1 (APP):Nearly 98,000 adolescent girls aged 10-19 were infected with HIV in 2022 – or 1,900 new infections every week according to UNICEF’s latest Global Snapshot on Children with HIV and AIDS released ahead of World AIDS Day.\nWhile total infections among girls aged 10-19 have almost halved since 2010 from 190,000 to 98,000 girls were still more than twice as likely to contract HIV last year, than boys. Globally, there were 270,000 new HIV infections among all children and adolescents aged 0-19 in 2022, bringing the total number of young people living with HIV to 2.6 million, said a press release issued here.\n“It is unacceptable that adolescent girls, who should be planning their futures, continue to bear the heaviest burden of HIV infection,” said UNICEF Associate Director of HIV/AIDS Anurita Bains. “We the UN, communities, governments and organisations must eradicate the obstacles that make HIV a threat to their health and well being.”\nIn sub-Saharan Africa, HIV prevalence among adolescent girls and young women, aged 10-24 years, is persistently over three times higher than among their male counterparts.\nThe latest data shows that Eastern and Southern Africa continues to carry the overwhelming burden of HIV infection among the 0-19 age group, followed by West and Central Africa; East Asia and the Pacific; Latin America and the Caribbean and South Asia.\nThe Global Snapshot further highlights how children and young adolescents face considerable inequities when it comes to access to treatment, compared to adults. Globally, nearly one million people aged 0-19 living with HIV are not receiving treatment, and more than half of this group – about 60 per cent – are in Eastern and Southern Africa.\nCumbersome diagnostic processes for children; specific testing requirements for infants that are not always available in middle- and lower-income countries; and a lack of age-appropriate antiretroviral medication for younger age groups are among the reasons that just 57 per cent of children aged 0–14 years are receiving antiretroviral treatment, compared to 77 per cent of people aged 15 and above.\nProgress toward ending AIDS remains slow, with 99,000 children and adolescents aged 0-19 years dying globally due to AIDS-related causes in 2022, accounting for 15 per cent of all AIDS-related deaths, even though this age group comprises just 7 per cent of people living with HIV.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:47:59.520Z"
}
