{
  "title": "ECP moves closer to elections, releases the final list of constituencies",
  "link": "https://www.app.com.pk/national/ecp-moves-closer-to-elections-releases-the-final-list-of-constituencies/",
  "date_published": "2023-12-01T03:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP): The Election Commission of Pakistan (ECP) has released the final list of constituencies derived from the 7th Population and Housing Census 2023 for the upcoming general elections.\nAccording to the notification issued by the Election Commission of Pakistan, the number of general seats has been reduced from 272 to 266. The 12 seats originally designated for elsewhere FATA have been abolished, with six seats reallocated to Khyber Pakhtunkhwa based on population.\nThe Election Commission reports that the National Assembly will have 266 constituencies for general seats, and there will be 593 constituencies for general seats in the provincial assemblies nationwide.\nAccording to the finalized constituencies, Islamabad is allocated 3 general seats in the National Assembly, Punjab will have 141 general seats, and the Provincial Assembly is set to have 297 general seats.\nSindh is designated 61 general seats in the National Assembly and 130 in the Provincial Assembly. Khyber Pakhtunkhwa is allotted 45 general seats in the National Assembly and 115 in the Provincial Assembly. Meanwhile, Balochistan holds 16 general seats in the National Assembly and 51 in the Provincial Assembly.\nAs outlined by the Election Commission, the National Assembly will include 60 seats for women and 10 reserved seats for minorities. The total membership of the National Assembly will be 336, comprising 266 general seats.\nProviding specifics on reserved seats for women, the election commission stated that the National Assembly will allocate 32 seats for women from Punjab, 14 from Sindh, 10 from Khyber Pakhtunkhwa, and 4 from Balochistan.\nProviding a breakdown of the 141 general seats in Punjab, the final list of constituencies issued by the Election Commission indicates that Attock district will have 2 National Assembly seats, Rawalpindi will have 6, and Rawalpindi and Murree combined will have 1 National Assembly seat.\nLikewise, Chakwal is allocated 1 National Assembly seat, while Talagang and Chakwal combined will have 1 seat. Jhelum will hold 2 seats, and Gujarat will have 4 National Assembly seats.\nWazirabad and Hafizabad will each have 1 seat, Mandi Bahauddin will have 2, Sialkot 5, Narowal 2, and Gujranwala 5 seats.\nSimilarly, sargodha is set to have 5 National Assembly seats, Khushab 2, Mianwali 2, while both Bhakkar and Chiniot will each have 2 seats. Faisalabad will account for 10 National Assembly seats, Toba Tek Singh 3, Jhang 3, Nankana Sahib 2, and Sheikhupura 4.\nLahore is allocated 14 seats in the National Assembly, Kasur 4, Okara 4, Pakpattan 2, Sahiwal 3, Khanewal 4, and Multan will have 6 National Assembly seats.\nThe number of National Assembly seats for Lodhran will be 2, Wahari 4, Bahawalnagar 4 and Bahawalpur 5 while Rahim Yar Khan will have 6, Muzaffargarh 4, Kot Addu 2, Liyyah 2 and Taunsa will have one seat.\nAccording to the conclusive list of constituencies issued by the Election Commission, Dera Ghazi Khan is assigned 3 National Assembly seats, while Rajanpur is also allocated 3 seats.\nSindh province is allocated 61 general seats in the National Assembly. The final constituency list indicates that Jacobabad district in Sindh will have 1 National Assembly seat, with Jacobabad and Kashmore jointly forming 1 constituency.\nShikarpur will be represented by 1 National Assembly seat, and combined, Kashmore and Shikarpur will share 1 seat. Additionally, Larkana and Qanbar Shahdadkot will jointly hold 2 National Assembly seats.\nGhotki, Sukkur, and Khairpur will each have 3 National Assembly seats, while Nauwshehro Feroze and Shaheed Benazirabad will both have 2 seats. Sanghar is allocated 2 National Assembly seats, Mirpur Khas 2, Umarkot 1, and Tharparkar will have 2 seats.\nThe final constituency list indicates that Matiari, Tando Allahyar, Tando Muhammad Khan, Sajawal, Thatta, and Jamshoro will each hold 1 National Assembly seat. Hyderabad is set to have 3 seats, while Badin and Dadu will each have 2 seats in the National Assembly.\nAccording to the final list of constituencies from the Election Commission, Malir district in Karachi will have 3 National Assembly seats, Korangi 3, Karachi East 4, and Karachi South 4 seats. Kemari will be represented by 2 seats, Karachi West 3, and Karachi Central is designated 4 National Assembly seats.\nKhyber Pakhtunkhwa will have 45 general seats in the National Assembly. According to the Election Commission’s final list of new constituencies in Khyber Pakhtunkhwa, there will be 1 seat each for Lower and Upper Chitral, 3 for Swat, 1 for Upper Dir, and 2 for Lower Dir. Additionally, Bajaur, Malakand, Buner, Shangla, and Battagram will each have 1 seat. Upper Kohistan, Lower Kohistan, and Kolai Pass Kohistan will collectively have 1 seat. Mansehra will have 1 seat, and Mansehra and Toor Ghar will share 1 seat in the National Assembly.\nAbbottabad is allocated 2 National Assembly seats, Haripur 1, Swabi 2, and Mardan will have 3 National Assembly seats. Charsadda will have 2 seats, Khyber 1, and Mohmand is designated 1 seat in the National Assembly.\nAccording to the Election Commission, Peshawar will have 5 National Assembly seats, Nowshera 2, and Kohat 1. Hangu and Orakzai are each assigned 1 seat in the National Assembly, while Kuram, Karak, Bannu, North Waziristan, and Lakki Marwat will also have 1 seat each.\nUpper and Lower South Waziristan are designated 1 seat, while Tank and Dera Ismail Khan will jointly hold 1 National Assembly Constituency. Additionally, Dera Ismail Khan will independently have 2 National Assembly seats.\nBalochistan is allocated 16 general seats in the National Assembly. As per the Election Commission’s list of new constituencies in Balochistan, there will be 1 National Assembly Constituency comprising Shirani, Zhob, Qila Saifullah. Musakhel, Barkhan, Loralai, and Daki will each have 1 National Assembly seat.\nZiarat, Harnai, Sibbi, Kohlu, Dera Bugti will constitute 1 seat of National Assembly while Jhal Magsi, Kachchi and Naseerabad will be 1 constituency of the National Assembly.\nSohbatpur, Jafarabad, Aosta Muhammad, and Naseerabad will collectively form 1 National Assembly constituency, and Khuzdar will have 1 seat in the National Assembly. Additionally, there will be 1 National Assembly seat comprising Panjgur and Kech, along with 1 constituency consisting of Kech and Gwadar.\nSimilarly, Chaghi, Naushki, Kharan and Wasak will have 1 National Assembly Constituency while Sorab, Kalat, Mastung will have 1 National Assembly Constituency.\nThe number of National Assembly seats for Quetta will be 3 while the National Assembly consisting of Pashin, Qila Abdullah and Chaman will have 1 seat.",
  "retrievedAt": "2025-08-11T10:47:50.921Z"
}
