{
  "title": "India’s weaponization of Indus Waters Treaty unacceptable: PM",
  "author": null,
  "content": "ISLAMABAD, May 5 (APP):Prime Minister Muhammad Shehbaz Sharif on Monday stressed that India’s weaponization of the Indus Waters Treaty was unacceptable and a red-line for the people of Pakistan.\nDuring a meeting with Foreign Minister of the Islamic Republic of Iran Seyed Abbas Araghchi who called on him, the prime minister shared Pakistan’s serious concerns over the prevailing tensions in South Asia as a result of India’s provocative behavior since Pahalgam incident.\nHe categorically rejected any attempts to link Pakistan to the incident, without sharing any evidence and said Pakistan had offered that an international transparent, neutral and credible investigation be conducted to ascertain the facts behind the Pahalgam incident.\nWhile stating that Pakistan had acted with maturity and responsibility, the Prime Minister said “India had, on the other hand, created a media frenzy to divert the world’s attention away from Jammu and Kashmir dispute, which remained the root cause of instability in South Asia,” PM Office Media Wing, in a press release.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/05/WhatsApp-Video-2025-05-05-at-17.54.52.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nThe Iranian foreign minister is on an official visit to Islamabad.\nAt the outset, the prime minister expressed his sincere condolences to the Iranian side over the tragic explosion in Bandar Abbas that had led to the loss of precious lives and injured hundreds of people.\nHe prayed for those who had lost their loved ones, as well as for the early recovery of the injured.\nDuring this warm and cordial meeting, the prime minister conveyed his respectful regards to Supreme Leader Ayatullah Ali Khamenei and warm wishes for President Masoud Pezeshkian.\nHe underscored that Pakistan attached great importance to its historic, deep-rooted fraternal ties with Iran.\nWhile fondly recalling his earlier meetings and recent telephone call with President Pezeshkian, Prime Minister Shehbaz\nSharif expressed satisfaction at the positive trajectory of Pakistan-Iran bilateral engagement and emphasized the need to enhance cooperation in trade, energy, border management, and regional connectivity.\nHe also reaffirmed Pakistan’s resolve to work closely with Iran for peace, stability, and development in the region.\nForeign Minister Araghchi conveyed warm greetings from the Iranian leadership to the prime minister and reaffirmed Iran’s commitment to strengthening its relations with Pakistan and also playing its part in bringing peace and stability in South Asia.\nHe also reiterated President Pezeshkian’s invitation to the prime minister to undertake an official visit to Tehran during current year.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:05:31.191Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/indias-weaponization-of-indus-waters-treaty-unacceptable-pm/",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T13:30:00.000Z"
}
