{
  "title": "Pahalgam attack: An internal orchestration by Indian intelligence agencies against Pakistan",
  "author": null,
  "content": "PESHAWAR, May 05 (APP):On April 22, 2025, a tragic incident occurred at the famous tourist destination Pahalgam in the Indian Illegally Occupied Jammu and Kashmir (IIOJ&K) on broad day light where 27 tourists were gunned down under the nose of the Indian military.\nLike previous false flag operations, the RSS backed Hinduvata Modi regime and its biased media have immediately labelled the attack as “terrorism,” blaming Pakistan and Kashmiri freedom fighters. However the leaked documents posted on Telegram have rejected these Indian allegations, declaring Pehalagam shooting was a false flag operation planned by RAW.\nHussain Khateeb, leader of All Parties Hurriyat Conference (Gillani Group) Azad Kashmir told APP on Monday that Pahalgam is heavily guarded by Indian military, paramilitary forces, and intelligence agencies where all entry points, hotels, and key sites are secured through security checkpoints.\nIn such tightly controlled conditions, he said a critical question arises: “how could unidentified armed individuals manage to enter the area? With the border completely under Indian control, how was such an attack even possible and how could the accused easily escape?\nAccording to a report by the Times of India, he said that an intelligence alert had already been issued prior to the Pehalgam attack, indicating that some suspicious individuals were surveying hotels in the area. Despite this alert, he said there was no police or army presence at the time of incident at Pehalgam and the gunmen equipped with automatic weapons were set free by the Indian forces to kill tourists. Moreover, locals were seen transporting the injured down the hills on mules without first aid, which in itself raises serious questions.\n“All of these circumstance and situation evidences proved that the attack was a pre-planned operation orchestrated by the RAW apparently on the directives of Modi government,” he said, adding immediately after the shooting, India blamed Pakistan without providing any evidence or allowing an independent investigation that has further exposed its ulterior designs against Islamabad.\nHe said that prominent Indian YouTuber Dhruv Rathee has also raised several fundamental questions in his video, questioning whether only VIPs, businessmen, and film stars matter to the Indian state.\n“If Mukesh Ambani can be provided Z+ security with 55 NSG Commandos, why are ordinary citizens in India left unprotected? If prior warning existed, why were Indian security forces absent at the time of the attack and gunmen were set free to kill tourists on a broad day?\nHussain Khateeb categorically claimed that the attack was planned by the Hinduvata regime to divert attention of international community from the Indian Forces’ brutalities, war crimes and state sponsored terrorism at IIOJ&K.\nThe recently leaked secret document posted on Telegram, revealed RAW’s role in planning and execution of the Pahalgam false flag operation. As per the leaked document, anti-Pakistan narrative should be spread in the media 36 hours after the Pehalgam attack, and its entire blame should be placed on the ISI. The narrative of the Pehalgam incident should depict an attack on the Indian state and non-Muslims, and that media assets should be mobilized 36 to 48 hours before the incident at the attack location.\nWithin two to four hours of the assault, witness statements would be recorded using an AI system, and anti-ISI trends to be spread uncontrollably on digital platforms, the leaked document further disclosed.\nHussain accused India of conducting similar false flag operations like Ganga hijacking case 1971, attack on Indian Parliament in 2001, Pathankot airbase’s assault in 2016, Ori attack in 2016 and Palwama’s assault in 2019 designed to divert attention of international community from independence movement in its different states including IIOJK where the occupied forces unleashed terror especially against women and children besides killing innocent Kashmiris in fake encounters in a bid to deprive them of birth right of freedom.\nFollowing the Pahalgam incident, Pakistan has strongly rejected the Indian allegations, calling it totally baseless. ISPR Director General Lt. Gen. Ahmed Sharif Chaudhry in recent press briefings categorically stated that India has not presented any evidence so far, whereas Pakistan possesses undeniable proof of India’s state-sponsored terrorism in Pakistan.\nHe said Pakistan arrested an Indian trained terrorist from Jehalum while trying to plant a bomb near a bus stand and was caught red handed with explosives. He further said that India often resorts to false flag operations to divert attention from internal weaknesses and political failures.\nProfessor Dr A.H.Hilali, former Chairman Political Science Department at University of Peshawar said the Pehalgam incident has severely strained Pakistan-India relations as the latter took unnecessary harsh diplomatic steps against the former, including suspension of visa services, recalling ambassadors, and halting trade relations besides announcing suspension of Indus Water Treaty. He said these uncalled for measures have further escalated the already tense situation between the two nuclear armed countries and intensified clashes on LoC.\nHe said India was also facing grave internal turmoil and separatist movements referring to rising persecution of minorities, attacks on Muslims and Sikhs, and unrest in northeastern states which have put the Modi government under immense pressure. As a collective punishment after Pehalgam, Indian forces started demolishing houses of innocent Kashmiris at IIOJK where light became a nightmare for oppressed people.\nIn such a scenario, he said that attacks like the one in Pahalgam served the BJP government as an opportunity to distract the public from domestic issues by pushing a national security narrative and defaming Pakistan on the global stage which remained counterproductive.\n“For monetary gains, Indian media turns every government failure into a perceived success. The BJP’s political agenda is to divide Hindus and Muslims to prolong its rule,” he said, adding the RSS backed Modi Govt’s goal is to keep the public in a constant state of fear, so they may continue voting for the BJP under the pretext of security. This is why, since 2014, a consistent narrative has been pushed claiming that Hindus are under threat.\nDr Hilali said as per leaked documents on Telegram, Pahalgam attack was not terrorism rather a false flag operation possibly orchestrated by RAW to cover up Modi Govt’s failures, separatist movement and mislead the world.\nHe said the United Nations, human rights organizations, and global media must conduct an impartial analysis of India’s state policies in the wake of the Pahalgam attack. The media blackout in occupied Kashmir, restrictions on free speech, and military occupation have testified to the Indian’s tyranny. The experts said that the Pahalgam attack was a wake-up call sufficient to shake the global conscience.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:06:24.292Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pahalgam-attack-an-internal-orchestration-by-indian-intelligence-agencies-against-pakistan/",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T08:10:00.000Z"
}
