{
  "title": "IRSA declares 21 % water shortage for early Kharif season",
  "author": null,
  "content": "ISLAMABAD, May 5 (APP):Indus River System Authority Advisory Committee (IAC) on Monday declared an overall water shortage of 21 percent for the remaining early Kharif season in case supplies in River Chenab remains normal while 7 percent water shortage for late Kharif.\nHowever, the situation would be monitored on a daily basis and if the decrease continues in “River Chenab”, the shortages would be revisited accordingly.\nThe Committee which met with IRSA chairman Sahibzada Muhammad Shabir approved the Anticipated Water Availability Criteria for balance period of Kharif from May to September 2025.\nIAC reviewed the water situation for the remaining months of “Early Kharif” (May – Jun 10) & Late Kharif (Jun 11 – Sep) season.  It was noted with concern unanimously that sudden decrease in river Chenab inflows at Marala due to short supply by India would result in more shortages in Early Kharif Season.\nKeeping in view the crisis created by Indian short supplies in Chenab River, it was also decided that conjunctive use of reservoirs would be done pragmatically to ensure indented supplies to the provinces. The participants showed determination to handle this crisis with unanimity and national spirit – setting the internal reservations aside.\nThe meeting was attended, inert alia, by all IRSA Members, Chief Engineering Advisor, MoWR; Secretaries PIDs of Punjab and Sindh; Senior Officials of Khyber Pakhtunkhwa & Balochistan Irrigation Deptt:, General Managers of WAPDA; Senior representatives of Tarbela and Mangla Dams, Senior Representatives of Provincial Agriculture Departments and Director (Opr) / Secretary IRSA, along with senior technical personnel of IRSA.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:05:25.957Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/irsa-declares-21-water-shortage-for-early-kharif-season/",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T15:30:00.000Z"
}
