{
  "title": "Deal with Xi ‘extremely hard’, says Trump - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Donald Trump said on Wednesday that it was “extremely hard” to reach a deal with Chinese leader Xi Jinping, but the EU touted progress in its own trade talks with Washington even though the US president doubled global metal tariffs.\n\nTrump’s latest trade moves came as ministers from Organisation for Economic Cooperation and Development (OECD) countries gathered in Paris to discuss the outlook for the world economy in light of a US hardball approach that has rattled world markets.\n\nTrump’s sweeping tariffs on allies and adversaries have strained ties with trading partners and sparked a flurry of negotiations to avoid the duties.\n\nThe White House has suggested the president will speak to Xi this week, raising hopes they can soothe tensions and speed up a trade deal between the world’s two biggest economies.\n\nEU sees progress in its trade talks with Washington even though US president has doubled global metal tariffs\n\nHowever, early on Wednesday, Trump appeared to dampen hopes for a quick deal.\n\n“I like President XI of China, always have, and always will, but he is VERY TOUGH, AND EXTREMELY HARD TO MAKE A DEAL WITH!!!” he posted on his Truth Social platform.\n\nAsked about the remarks during a regular press briefing, Chinese foreign ministry spokesman Lin Jian said: “The Chinese side’s principles and stance on developing Sino-US relations are consistent.”\n\nChina was the main target of Trump’s April tariff blitz, hit with levies of 145 per cent on its goods and triggering tit-for-tat tariffs of 125 per cent on US imports.\n\nBoth sides agreed to temporarily de-escalate in May, after Trump delayed most sweeping measures on other countries until July 9.\n\nHis latest remarks came hours after he increased his tariffs on aluminium and steel from 25 per cent to 50 per cent, raising temperatures with various partners while exempting Britain from the higher levy.\n\nEU trade commissioner Maros Sefcovic said after talks with US Trade Representative Jamieson Greer on the sidelines of the OECD meeting in Paris that raising the metal tariffs “doesn’t help the negotiations”. The two sides were nonetheless “making progress” in their negotiations, Sefcovic said at a news conference.\n\nGoods from the 27-nation bloc will be hit with 50 per cent tariffs on July 9 unless it reaches a deal with Washington. The EU has vowed to retaliate.\n\nSteel tariffs\n\nThe US-EU meeting took place a day after the OECD cut its forecast for global economic growth, blaming Trump’s tariff blitz for the downgrade.\n\n“We need to come up with negotiated solutions as quickly as possible, because time is running out,” German economy minister Katherina Reiche warned.\n\nFrench trade minister Laurent Saint-Martin said: “We have to keep our cool and always show that the introduction of these tariffs is in no one’s interest.” After talks between UK Trade Secretary Jonathan Reynolds and Greer on Tuesday, London said that imports from the UK would remain at 25 per cent for now.\n\n“We’re pleased that as a result of our agreement with the US, UK steel will not be subject to these additional tariffs,” a British government spokesperson said.\n\nMexico will request an exemption from the higher tariff, Economy Minister Marcelo Ebrard said, arguing that it was unfair because the United States exports more steel to its southern neighbour than it imports.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/06/05101637350767f.png",
  "retrievedAt": "2025-10-12T03:26:54.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915513/deal-with-xi-extremely-hard-says-trump",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:54:24.000Z"
}
