{
  "title": "Education budget to go up by 13pc, says Gandapur - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur on Wednesday said that the provincial government had decided to increase the education budget by 13 per cent in the upcoming fiscal year.\n\n“The increased education budget will help strengthen the infrastructure of educational institutions as without such a strong infrastructure, it’ll be difficult to boost the standard of learning,” the chief minister told the first convocation of the Gajju Khan Medical College here.\n\nThe convocation was held at the Ghulam Ishaq Khan Institute of Engineering Sciences and Technology as the GKMC doesn’t have its own building and functions in the building of the Bacha Khan Teaching Hospital.\n\nThe event was attended by medical graduates, their parents, and teachers.\n\nCM attends first convocation of Gajju Khan Medical College in Swabi\n\nAli Amin Gandapur, KP Chief Minister was chief guest on the occasion, conferring degrees on 235 successful candidates. Asad Qaiser, former speaker of national assembly, Shahram Khan Tarakai MNA and Rangaiz Khan provincial minister for transport also attended the convocation.\n\nGold medals were also awarded to 104 students whose academic performance had remained outstanding throughout their professional knowledge acquiring period.\n\nFounded in 2014, the first batch crossed the GKMC’s portal in Sept 2016 and so far four batches have completed their MBBS from the college.\n\nThe chief minister said there should be value of Pakistani degrees across the world, only those educational institutions are successful whose degrees had value in the job market and elsewhere.\n\nHe said there was no need for getting education from the institutions whose degrees had “no value.”\n\n“The doctors, especially those who are fresh graduates, should work in the far-flung hospitals because it came into sight that both buildings and equipment were there but due to non-availability of the doctors they turned useless,” he said.\n\nMr Gandapur said medicine was a highly respectable profession, so its practitioners should never shatter the confidence of patients.\n\nHe said the government was committed to providing adequate health facilities to people and had already taken various steps in that, while much more was on the cards.\n\nThe chief minister also spoke about the Sehat Card health insurance programme and said the government was focusing its attention on the provision of health facilities to the ailing community.\n\nHe said when he assumed the role as the chief minister, the exchequer had funds to pay salary to public sector employees for 18 days only but the economic situation had improved as it had a salary for three months.\n\n“I feel sad when pensioners don’t get pension on time, so we are trying our best to pay the salary and pension on time to the employees,” he said.\n\nMr Gandapur said the government had so far paid off Rs50 billion debt, with the debt totaling Rs750 billion when he assumed the chief minister’s office.\n\nHe said that the GKMC’s building, work on which had been halted for the last few years due to a lack of funds, would be ready in the current year and funds for it would be allocated in the next budget.\n\n“The second convocation of your college will be held in its own building,” he said.\n\nThe chief minister said that the cardiac centre in the Bacha Khan Teaching hospital would be established to improve care, especially to provide free treatment to patients. He said the initiative was aimed at providing health services to cardiac patients in their native district.\n\nMr Gandapur announced Rs35 million funding for the provision of honorarium to employees of GKMC and declared that their promotion would be approved soon.\n\nGKMC Principal Prof Shamsur Rehman highlighted the college’s academic activities and continued efforts of the faculty to impart quality medical knowledge to students.\n\nHe said in the last three years, the college showed 100 per cent exam results due to “contribution and determination” of academia.\n\nThe principal said it was imperative for the college to have its own building.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:32.423Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915457/education-budget-to-go-up-by-13pc-says-gandapur",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:55:30.000Z"
}
