{
  "title": "Pakistan wants Trump to arrange talks with India - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PM calls US president ‘man for peace’; says offer of impartial probe into Pahalgam was met with aggression\n• Bilawal says New Delhi can’t be ‘net security provider’ in the region if it can’t even defend its own skies\n• Dar blames political rhetoric from Indian leaders for keeping South Asia tensions high\n\nWASHINGTON / ISLAMABAD: Prime Minister Shehbaz Sharif and PPP Chairman Bilawal Bhutto-Zardari have praised US President Donald Trump for his role in helping de-escalate the latest India-Pakistan military confrontation, and urged Washington to facilitate a comprehensive dialogue between the two nuclear neighbours.\n\nSpeaking at an event at the US Embassy in Islamabad marking the 249th anniversary of American independence, PM Shehbaz said the recent four-day conflict had revealed the “Pahalgam incident was a false-flag operation”, and credited President Trump for playing a decisive role in ensuring a ceasefire.\n\nThe premier said that the US president had shown beyond any doubt that “he is a man for peace … and beneficial business deals”.\n\nHe added, “President Trump is a man against escalation and a man against cold and hot war.”\n\nPM Shehbaz said Pakistan downed six Indian fighter jets in self-defence after Indian aggression on May 6-7 resulted in the deaths of 33 Pakistani civilians.\n\n“We responded with restraint and patience,” he said. “Our offer for an impartial international probe into the Pahalgam incident was met with aggression instead.”\n\nHe said that India “should have come out with solid evidence and convinced the world about the occurrence of the incident”.\n\nPM Shehbaz also extended heartfelt felicitations to the US president and people of the United States, on his behalf and on behalf of the Pakistani nation, on celebrating their Independence Day.\n\nHe said the bilateral ties between the US and Pakistan were entering into renewed friendship, and the close contacts were being revived.\n\nFacilitate dialogue\n\nMeanwhile, speaking to US-based Pakistani journalists in Washington, PPP Chairman Bilawal Bhutto-Zardari said President Trump “deserves credit” for helping facilitate the ceasefire between Pakistan and India last month.\n\n“We should also pay attention to what the US president is saying. On 10 different occasions, he has taken credit for facilitating the ceasefire between India and Pakistan — and rightly so. He deserves that credit, because it was his efforts that helped make the ceasefire possible,” said Mr Bhutto-Zardari, the leader of the Pakistani delegation that began a three-day visit to Washington on Wednesday.\n\n“So, if the US is willing to help Pakistan in maintaining this ceasefire, it is reasonable to expect that an American role in arranging a comprehensive dialogue would also be beneficial for us,” he added.\n\nWhile India publicly denies that President Trump played any role in the ceasefire agreement and consistently rejects third-party mediation on bilateral issues, Mr Bhutto-Zardari’s remarks appear aimed at drawing the US into a more proactive diplomatic role in South Asia.\n\n“Yes, America has an establishment, a thought pattern,” he acknowledged, “but knowing the ground realities, we are not delusional. We know what the realities of this city (Washington) are, what its geopolitics are, but we are here because we believe that our message is the message of truth. It aligns with international laws and relevant UN Security Council resolutions.”\n\nHis comments also targeted what he described as a failed US strategy of building up India as a regional security anchor. Referring to New Delhi’s recent troubles, he said: “What security will that net security provider provide to others when it cannot do that for itself? They were supposed to protect others, but couldn’t protect their own planes.”\n\n“The concept of India as a counterweight to China now seems hollow. It’s not even a paperweight anymore. This approach, I believe, must now be re-evaluated,” he said.\n\nIndia has long pitched itself as a “net security provider” in the Indo-Pacific region — a concept US policymakers have also endorsed. But Mr Bhutto-Zardari said this strategy had outlived its utility.\n\n“I believe that this strategy of building up India as the net security provider has failed,” he said. “I believe what can really provide security to this region, and to the rest of the world, is peace bet­ween India and Pakistan.”\n\nRhetoric sustaining tensions\n\nSeparately, Deputy Prime Minister and Foreign Minister Ishaq Dar on Wednesday expressed readiness for a comprehensive dialogue with India, but warned that rising political rhetoric from Indian leaders is sustaining high tensions between the nuclear-armed rivals following last month’s military confrontation.\n\n“Whenever they (Indians) want a dialogue, at any level, they will find us ready, but we are not desperate,” Mr Dar said during a press briefing in Islamabad.\n\nMr Dar said that although the ceasefire has held, political tensions remain inflamed by statements from Indian leaders, particularly Prime Minister Narendra Modi, who recently described the military exchange as “just a trailer” ahead of upcoming elections in Bihar.\n\n“Political rhetoric is still on, possibly for internal reasons,” Mr Dar said. “I wish sense prevails. We are peace lovers, focused on economic revival, but dignity, sovereignty and territorial integrity come first.”\n\nMr Dar insisted that any future dialogue between Pakistan and India must be comprehensive, addressing terrorism, water rights under the Indus Waters Treaty, and broader bilateral issues. “When India is ready for talks, it will find us ready for talks on all issues.”\n\nHe also rejected Indian External Affairs Minister Subrahmanyam Jaishan­kar’s assertion that the talks should only cover the issue of terrorism, saying it wouldn’t work.\n\nSyed Irfan Raza in Islamabad also contributed to this report\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/050741274d42368.jpg",
  "retrievedAt": "2025-08-20T03:46:40.768Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915520/pakistan-wants-trump-to-arrange-talks-with-india",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:33:30.000Z"
}
