{
  "title": "Pakistan fighting RAW-funded, intelligence-driven war: CM Bugti - Pakistan - DAWN.COM",
  "author": null,
  "content": "Balochistan Chief Minister Sarfaraz Bugti on Thursday said Pakistan was fighting a full-fledged “intelligence-driven war” funded by India’s Research and Analysis Wing (RAW) and carried out through “Indian proxies”.\n\nThe security situation in Balochistan has deteriorated, with militants escalating attacks as part of a long-running insurgency. Last month, Inter-Services Public Relations Director General Lt Gen Ahmed Sharif Chaudhry accused India of activating its “assets” post-Pahalgam to intensify terrorism in Pakistan, citing “irrefutable evidence” of state-sponsored attacks directed by Indian military personnel. He said “credible intelligence” showed India tasked groups such as the banned Tehreek-i-Taliban and other militant cells to ramp up activity.\n\nAddressing a press conference in Islamabad today, Bugti referred to the attacks in his province and said: “This is a completely Raw-funded intelligence-driven war against the state of Pakistan.”\n\nHe said India changed its narrative after suffering a crushing blow by Pakistan’s security forces during their recent military escalation.\n\n“Pakistan army gave a befitting reply to Indian aggression. The failure of Operation Sindoor ignited the Indian proxy Fitna ul Hindustan,” he said, adding that the Indian media shared fake news about an attack on Karachi port.\n\nLast month, India and Pakistan engaged in a military confrontation over New Delhi’s allegations against Islamabad, without evidence, about a deadly attack in occupied Kashmir’s Pahalgam.\n\nNew Delhi launched air strikes killing civilians, prompting Pakistan to down five Indian jets in retaliation. After reciprocal strikes on airbases, American intervention on May 10 secured a ceasefire.\n\nDuring his press conference, CM Bugti showed a video of what he said was an “Indian proxy” agent talking to an unknown person — that the chief minister claimed was a RAW handler — sharing intelligence about Karachi port as evidence of Indian involvement.\n\n“The government has sufficient evidence against Fitna ul Hindustan which will be shared at appropriate time,” he said. “The enemy wants to destroy Pakistan’s emerging economy.”\n\nThe chief minister said these “Indian proxies” had no connection with the Baloch identity, but were terrorists attacking Pakistani citizens and security forces.\n\n“They should not be connected with Baloch identity. The Baloch have their own culture but they [terrorists] have [done away with] all norms. They are terrorists killing innocent Pakistanis and attacking security forces,” the chief minister said.\n\nIn reply to a question, he said the government could launch an operation in Balochistan against the terrorists, but security forces were focusing on small kinetic operations.\n\n“There can be an operation in Balochistan like Khyber Pakhtunkhwa, but it is not in law enforcement agencies’ capacity,” he said. “The solution is small, kinetic operations which security forces are conducting.”\n\n“If required, we will not hesitate to use the military to conduct an operation.”\n\nBugti said terrorist capacity had risen due to US gadgets available on the black market and weapons supplied by RAW.\n\n“The solution is small kinetic IBOs (intelligence-based operations).”\n\nRegarding the issue of missing persons, the chief minister said that “a narrative had been built” against the state on a controversial subject. “There is a missing count. There are people missing in KP. No one speaks about them,” he said.\n\nHe said the Balochistan government passed legislation to set up centres where radicalised youth would be trained to reintegrate them into society.\n\n“They will be kept there, their parents will be there, a magistrate will be present. A high-powered board chaired by BHC (Balochistan High Court) chief justice will be giving them extension,” he said.\n\nBugti also said there was a difference between “self-disappearance” and enforced disappearances.\n\n“Many have self-disappeared. That’s why we passed a law and political dialogue will continue,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/05163904779e62d.jpg",
  "retrievedAt": "2025-08-20T03:46:24.671Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915596/pakistan-fighting-raw-funded-intelligence-driven-war-cm-bugti",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T11:26:12.000Z"
}
