{
  "title": "Targeted operations across Balochistan restoring peace: CM - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Inaugurates assembly’s new block, auditorium hall\n• Claims over 90pc of development budget utilised on time\n\nQUETTA: Balochistan Chief Minister Mir Sarfraz Bugti has said that targeted operations against terrorism and efforts to restore peace and order are underway and have yielded positive results across the province.\n\n“Peace is returning to Balochistan. Roads are open, and life is resuming in all areas — this is tangible evidence of progress and stability,” he said while speaking to the media after inaugurating the new block and auditorium hall of the Balochistan Assembly on Wednesday.\n\nHe emphasised that restoring peace and maintaining law and order is imperative for the province’s development, and his government is making all-out efforts to ensure peace and stability across Balochistan.\n\nThe chief minister said the new infrastructure within the assembly premises has been designed to reflect the cultural heritage and traditional values of Balochistan, as well as the evolving needs of future generations.\n\n“This new building will not only serve as a functional workspace but also enhance the efficiency and effectiveness of this prestigious platform for public representation,” he added.\n\nAccompanied by Speaker Abdul Khaliq Achakzai, provincial ministers, parliamentary secretaries and other assembly members, the chief minister delivered his speech in the newly constructed auditorium. He praised the Department of Communication and Works for the swift and high-quality completion of the project, noting that the older assembly building could no longer meet the province’s legislative requirements.\n\nCM Bugti added that the new complex, being developed with the support of the federal government, will be equipped with modern facilities to support the legislative process. He reiterated his administration’s commitment to providing all necessary amenities to the elected representatives and enhancing the overall functioning of the assembly.\n\nHe claimed that over 90 per cent of the development budget had been utilised within the stipulated time frame — a clear indicator of the government’s effective performance. He said the upcoming provincial budget will be a surplus one, reflecting strong financial discipline and improved strategic planning. He assured that youth welfare and job creation will remain top priorities.\n\nThe chief minister said the government’s focus on infrastructure, financial responsibility, and youth engagement signals a forward-looking agenda for Balochistan.\n\nCrackdown on illegal mining\n\nBalochistan Chief Minister Mir Sarfraz Bugti has taken serious notice of illegal mining operations in different districts of the province and directed authorities concerned to immediately take strict action against the people involved in illegal exploration.\n\nPresiding over an importing meeting regarding mines and minerals, here on Tuesday, he took notice of the reports about the ongoing illegal mining of different precious minerals in the province.\n\nThe meeting was informed that many influential people were involved in illegal mining. It was informed that unauthorised mining was continuing in various areas of the province particularly in the Khanozai, Muslim Bagh area of Qila Saifullah District.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/05100313ea50114.png",
  "retrievedAt": "2025-10-12T03:26:52.624Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915501/targeted-operations-across-balochistan-restoring-peace-cm",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:53:41.000Z"
}
