{
  "title": "Import of coal, soapstone from Afghanistan remains suspended - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The import of coal and soapstone from Afghanistan had been suspended since Monday as customs authorities at Torkham, Ghulam Khan and Kharlaachi borders linked it with production of certificate of the country of origin by importers.\n\nCoal importers at Torkham told Dawn that though customs clearance of coal and soapstone from Afghanistan was abruptly suspended on Sunday, the orders regarding production of certificate of country of origin were conveyed to them on Monday morning.\n\nThey said that the sudden suspension of customs clearance resulted in queuing of hundreds of vehicles loaded with coal and soapstone on the Afghan side of the border.\n\nThe sudden imposition of the condition of country of origin certificate production at the time of customs clearance also caused a ‘mini panic’ among coal and soapstone importers along with the transporters as majority of them had planned an early leave for Eidul Azha after completion of the clearance process.\n\nHundreds of loaded vehicles wait for clearance to enter Pakistan\n\nMujjebullah Shinwari, the president of Torkham Customs Clearing Agents Association, told Dawn that hectic efforts were under way to at least acquire a one-time waiver from higher authorities in Islamabad to clear the already arrived consignments at Torkham and also to provide some relief to importers and transporters before Eidul Azha.\n\nHe said that customs officials were apprehensive of misuse of the import facility to coal and soapstone importers as they feared the ‘goods’ might be imported from another country instead of Afghanistan.\n\nHe said that they also discussed in the recent past issuance of required document with Afghan authorities. However, he said that some ‘technical’ issues pertaining to weight, value and import surfaced during those discussions.\n\nMr Shinwari said that there was no ‘wrongdoing’ in the import of both coal and soapstone as both the minerals were genuinely brought from different parts of Afghanistan for which they provided sufficient proof to customs officials at Torkham at different times.\n\nHe said that a request for a temporary resumption of coal and soapstone clearance was conveyed to all relevant authorities in Peshawar, Islamabad and Kabul.\n\nHe hoped that they would receive ‘good news’ before Eidul Azha.\n\nJamshed Khan, a coal importer at Torkham, told Dawn that around 300 to 350 loaded vehicles of coal and 100 to 150 vehicles of soapstone would come to Pakistan via Torkham, Ghulam Khan and Kharlaachi borders on a daily basis prior to imposition of Monday’s restrictions.\n\nHe said that all the imported coal was taken to different cities in Punjab where it was used for running various types of industrial units while the soapstone was entirely taken to Karachi for its onward export to different countries.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:30.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915451/import-of-coal-soapstone-from-afghanistan-remains-suspended",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:55:30.000Z"
}
