{
  "title": "Three drown in canal in KP’s Malakand: Rescue 1122 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three people drowned in a canal in Khyber Pakhtunkhwa’s Malakand district on Thursday, while a body was discovered in a river in Upper Dir in a separate incident, rescue officials told said.\n\nRescue 1122 official Nasar Khan told Dawn.com that four people, including a minor, were bathing in the canal to cool off amid intense heat.\n\n“All four people were recovered from the canal by divers, but three of them had drowned,” Nasar said. “One person was still alive and we transported him to Tehsil Headquarters Hospital in Dargai.”\n\nThe official added that local residents aided rescuers in recovering the victims’ bodies.\n\nRescue 1122 Malakand identified the deceased as 32-year-old Alamzeb, 26-year-old Mohammad Bilal and 6-year-old Arman Khan, while the survivor was identified as 17-year-old Salman Khan.\n\nMeanwhile, in a separate incident, Ibrahim Khan, a spokesperson for Rescue 1122 in Upper Dir, told Dawn.com that rescuers recovered the body of a seminary student who drowned in a river in the district’s Gandigar area.\n\n“The student went missing three days ago,” Ibrahim said. “Rescue teams and civil defence personnel participated in a search operation.”\n\nThe student was identified as Mohammad Hilal Khan.\n\nIn April, two minor sisters drowned in the Indus River in the Shangla district’s Bisham tehsil, according to officials.\n\nBisham Station House Officer (SHO) Khurshid Ali told Dawn.com that the children had gone to the river to play at the river bank, where the strong current ended up drowning them.\n\nSHO Ali said the girls’ ages, as told by their relatives, were seven and nine.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/052201240739a3b.jpg",
  "retrievedAt": "2025-08-20T03:46:19.330Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915652/three-drown-in-canal-in-kps-malakand-rescue-1122",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T18:12:25.000Z"
}
