{
  "title": "US busts Indian family for forced labour, child exploitation racket - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US federal prosecutors have charged five Nebraska hotel operators — all members of the same family — in what the Department of Justice (DOJ) calls a large-scale human trafficking operation exploiting undocumented workers, including at least ten children under the age of 12.\n\nThe defendants are accused of forcing both children and adults into grueling labour under threat and coercion, highlighting vulnerabilities in low-wage service industries across the United States.\n\n“This case is about a family business built on human exploitation,” said US Attorney Susan Lehr for the District of Nebraska. “The defendants allegedly profited by compelling vulnerable victims, including children, to work for little or no pay under threat and coercion.”\n\nThe five accused — Kentakumar Chaudhari, Rashmi Ajit Samani, Amit Prahladbhai Chaudhari, Amit Babubhai Chaudhari, and Maheshkumar Chaudhari — allegedly ran hotels where undocumented individuals were forced to work in “unclean, unsafe conditions, sometimes in the very hotels where they were forced to work,” according to the DOJ.\n\n27 victims, including 10 children, made to work long hours in unsafe, unclean hotels for little or no pay\n\nVictims were reportedly required to work “long hours, seven days a week, in exchange for little or no pay” and were “threatened with arrest, deportation, and harm to their families if they refused to work.”\n\nFederal raids\n\nOn Aug 12, federal, state, and local officers executed search warrants at the Nebraska hotels, including AmericInn, Omaha, The Inn (formerly Super 8), Omaha, The New Victorian Inn and Omaha, Roadway Inn, Bellevue.\n\nThe DOJ said these properties were “used as part of a conspiracy to commit forced labour” and that the defendants “conspired to harbor undocumented non-citizens for the purposes of commercial advantage and private financial gain.”\n\nA total of 27 victims were rescued: “Ten minor children under the age of 12 from the forced labour scheme, and 17 adult victims from the same criminal conspiracy.”\n\nAssistant Attorney General Kristen Clarke of the DOJ’s Civil Rights Division emphasised: “No child should ever be forced into labour. We will use every tool available to bring to justice those who exploit the most vulnerable members of our society.”\n\nThe Nebraska arrests come amid a wider push by US authorities to dismantle trafficking networks.\n\nIndia on Tier 2\n\nThe US 2024 Trafficking in Persons (TIP) report placed India on Tier 2, noting that the government “does not fully meet the minimum standards for the elimination of trafficking” but is “making significant efforts to do so.” The report highlighted persistent concerns about “forced labour, sex trafficking in religious and tourist destinations, and the exploitation of children, including in the context of child sex tourism.”\n\nExperts in Washington stress that the Nebraska case underscores the global nature of trafficking. Indian authorities have increasingly coordinated with US counterparts to investigate potential exploitation networks affecting Indian nationals abroad, especially in low-wage labour sectors.\n\nThe five Nebraska defendants now face federal charges that could carry decades in prison if convicted, and the investigation remains ongoing.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:54.286Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930968/us-busts-indian-family-for-forced-labour-child-exploitation-racket",
  "dateList": "2025-06-05",
  "date_published": "2025-08-15T02:06:37.000Z"
}
