{
  "title": "Country racing against time to ensure flood preparedness - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Indian water aggression, combined with higher temperatures and forecast of high-intensity monsoons, may hamper country’s disaster response\n• Met Office warns of above-normal rate of snow melting in GB, raising risk of Glof events\n\nISLAMABAD: India’s ‘water aggression’, higher-than-normal estimated rainfall and temperatures have reduced the response time for floods expected in the upcoming monsoon season, raising the risk of greater natural and man-made devastation unless improved vigilance and coordination is ensured, particularly in the country’s eastern parts.\n\nThis was the central theme of the annual flood preparation meeting of the federal and provincial governments on Wednesday, presided by Fed­e­ral Minister for Water Resources Muhammad Mueen Wattoo.\n\nParticipants of the meeting agreed to enhanced inter-agency and inter-provincial coordination and round-the-clock vigilance to manage flood risks during the upcoming monsoon season, set to begin on July 1.\n\nThe Pakistan Meteorological Depar­tment (PMD) officials told participants that temperatures were already abo­ve normal in Gilgit-Baltistan and forecast to remain so in the days ahead, resulting in above-normal snow-melting.\n\nAs a consequence, there could be higher and repeated chances of Glacial Lakes Outburst Floods (Glofs) in the monsoon season.\n\nThe rainfalls were also projected to be higher than normal across the country, particularly in the northern parts — Azad Jammu and Kashmir, GB, Potohar and parts of Khyber Pakhtunkhwa — and there could be greater frequency of all-weather events, including excessive thunderstorms and hailstorms.\n\nAdding risks to the challenge was the unpredictability of water events from across the eastern borders as India is not sharing data relating to weather and river flows. Therefore, it was decided to be extra vigilant in relevant areas, particularly more than extra vigilance would need to be kept at Sialkot flood warning station because that would not provide more than 5-6 hours of response time.\n\nIn this regard, the Indus River System Authority (Irsa) expressed serious apprehensions over unpredictable and volatile Chenab flows which had already started affecting the Mangla dam filling. India has been reducing Chenab flows, forcing irrigation authorities to discharge around 40,000 cusecs of water from Mangla Dam instead of normal 10,000 cusecs a few days ago. Chenab flows reached just 6,000 cusecs about three days ago instead of 35,000-40,000 cusecs. The Mangla dam releases had to be increased to compensate for Chenab loss. With some improvements for subsequent two days, India against reduced flows to 21,000 cusecs on Monday.\n\nAn official statement said the PMD has “forecasted normal to slightly above-normal rainfall across central and southern Pakistan for the July to September period. Enhanced precipitation is expected in northeastern Punjab and Kashmir, while northern Khyber Pakhtunkhwa and Gilgit-Baltistan may experience normal to below-normal rainfall”.\n\nThe forecast also warned of higher-than-normal temperatures nationwide, increasing the likelihood of extreme hydrological events such as riverine floods, flash floods, urban flooding, and Glacial Lake Outburst Floods (Glofs), the statement said.\n\nWater and Power Development Authority (Wapda), on the other hand, reported that enough storage was available both in Tarbela and Mangla dams and even at Chashma barrage. Therefore, there would not be a big challenge to cater for floods, whether on the Indus or Jhelum side as standard operating procedures were in place for controlled discharges downstream reservoirs in case of peak floods. However, localities around catchment areas in the northern part could be at risk in case of unusual floods.\n\nIn view of these inputs, the meeting agreed to have enhanced inter-agency coordination and round-the-clock vigilance to manage flood risks during the upcoming monsoon season. The crucial meeting, an annual ritual, was held to assess national preparedness for Monsoon Season 2025 and brought together representatives from federal agencies and provincial governments, to review flood mitigation strategies and pre-emptive measures for the safe passage of potential floodwaters.\n\nMinister Mueen Wattoo directed to ensure immediate clearance of storm water drains in major urban centers and removal of encroachments and debris around waterways, particularly near barrages and key infrastructure such as National Highway Authority and Pakistan Railways bridges, to prevent floodwater blockages. Special attention was given to the de-silting and encroachment removal from urban nullahs in flood-prone cities including Karachi, Lahore and Rawalpindi, the statement said.\n\nThe chairman of the Federal Flood Commission briefed the meeting on pre-monsoon initiatives undertaken by the Commission, including readiness assessments and coordination plans. Stakeholders reported on ongoing monitoring of river flows, infrastructure readiness, and the functionality of meteorological and telemetry systems.\n\nThe minister also called for special attention to ensure the safety of vulnerable communities and public infrastructure.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6840d1e53a4dd.jpg",
  "retrievedAt": "2025-10-12T03:26:56.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915515/country-racing-against-time-to-ensure-flood-preparedness",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:53:01.000Z"
}
