{
  "title": "IHC to move ahead in Peca case, with or without govt reply - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Delay in submission of response to challenges irks court\n• Fear has gripped media industry, judge told\n\nISLAMABAD: The Islamabad High Court (IHC) on Wednesday issued a final deadline to the federal government to respond to the identical petitions filed against “co­­ntroversial amendments” in the cybercrimes law, and hinted at deciding the matter ex parte if re­­plies to the challenges were not received.\n\nJustice Raja Inaam Ameen Minhas issued final notices to the Ministry of Law and Justice, Mi­­nistry of Information Techno­logy, the Federal Investigation Agency (FIA, and the Pakistan Telecom­munication Authority (PTA) to submit their replies to the petitions filed against controversial amendments to the Prevention of Electronic Crimes Act (Peca).\n\nThe judge made it clear that the hearing will proceed even if responses were not filed.\n\nThe petitions filed by the Pak­istan Federal Union of Journa­li­s­­ts, anchorpersons, and various journalist organisations have chal­­lenged the expanded scope of Peca, which, they argue, crimina­lises journalistic activity and curtails press freedom. During the hearing, several senior media rep­­­resentatives appeared in court.\n\nImran Shafiq, counsel for the pe­­­­­titioners, informed the court that only the Ministry of Interior and the Ministry of Information had filed partial responses, while the Ministry of Law, PTA, and other agencies concerned had ei­­ther sub­­mitted incomplete replies or igno­red the court’s orders altogether.\n\nHe accused the government of using delaying tactics, highlighting that it had raised jurisdictional objections. He asserted that only a constitutional bench could hear the case under the 26th Constitutional Amendment.\n\nHe argued that this objection was unfounded.\n\n“This is merely an attempt to prolong the proceedings,” Mr Shafiq told the court, also pointing out that one of the government’s objections mentioned a verse from the Holy Quran that suggests caution before sharing information publicly. He alleged that the government had done so to justify the registration of FIRs against journalists.\n\nSenior journalist Mazhar Abbas emphasised that an atmosphere of fear had gripped the media industry, adding that journalists were routinely harassed, summoned by the FIA, and threatened with arrest for performing their professional duties.\n\n“We are not demanding any special treatment,” Mr Abbas said, adding, “We only ask for the protection of our constitutional rights and the right to report freely.”\n\nAdvocate Riasat Ali Azad urg­ed the court to issue an interim stay order to prevent the registration of FIRs and arrests of journalists.\n\nBesides, he suggested the court should impose a fine of Rs500,000 on the agencies for failing to comply with court orders.\n\nJustice Minhas wondered whether journalists were being truly prevented from reporting.\n\nIn response, Adnan Haider said, “We are fighting a war on social media just like the army defends the country in a war.”\n\nThe court granted a final opp­ortunity to the government depa­rtments to file their responses and adjourned the hearing to the second week of July.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:35.832Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915504/ihc-to-move-ahead-in-peca-case-with-or-without-govt-reply",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:53:41.000Z"
}
