{
  "title": "Balochistan amends ATA, allowing detention sans charge for three months - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Baloc­histan Assembly on Wednesday adopted the Anti-Terrorism (Balo­chistan Amendment) Act, 2025, giving law enforcement agencies powers to detain any person for three months without being charged.\n\nThe draft of the bill was moved by Balochistan Awami Party (BAP) MPA Mir Sadiq Sanjrani.\n\nJUI-F MPA Ms Shahida Rauf, while speaking on the floor of the House, said that the bill is being bro­ught to the assembly with good intentions and her party would support it.\n\nShe, however, suggested to the Leader of the House that every clause of the bill should be discussed in the House again so that there remained no ambiguity about it.\n\n“If only one party opposes it, that will cause great loss to the province,” Ms Rauf said, adding that the bill should not be passed in haste.\n\nJamaat-i-Islami MPA Maulana Hidayatur Rehman, while taking up the issue of missing persons, said the matter must be resolved.\n\nCommenting on the draft of the amendment, he said the anti-terrorism bill might be correct, but it needs to be clear who it actually benefits.\n\n“Who will be held accountable for those being killed?” Maulana Rehman said, adding that the Counter Terrorism Department’s actions are visible to everyone and the House should be taken into confidence on the bill and it should be passed only after taking the opinion of every member of the House.\n\nBalochistan Chief Minister Sarfraz Bugti claimed the issue of missing persons has been used to discredit state institutions, and legislation was the solution to the problem.\n\n“We must now prevent this issue from being misused. Now, anyone arrested will be presented before a magistrate.”\n\nSix-year sunset clause\n\nThe bill, seen by Dawn, proposes that anyone suspected of offences enshrined in the anti-terrorism law may be held in preventive detention for up to three months for the purpose of inquiry.\n\nThe inquiry will be held by a police officer not below the rank of Superintendent or through a Joint Interrogation Team (JIT). If the detention order is issued by the armed forces or intelligence agencies, the inquiry shall be conducted by a JIT consisting of members of the concerned agency.\n\nDuring the course of inquiry, the concerned law enforcement officer heading it shall be vested with all powers relating to search, arrest, and seizure of property and other materials relevant to the offence.\n\nThe amended law also allows for detainees to be confined in a detention / rehabilitation / de-radicalisation centre who, upon a written request by the investigating agency or investigating officer, can be handed over to any law enforcement agency for the purpose of investigation.\n\nThe provincial government shall notify Oversight Board(s), comprising two civilians, two military officers, a psychiatrist, and a criminologist, under the chairmanship of the additional chief secretary (Home) or any other nominated officer to assess the case of each detainee and their ideological disposition and mental, physical, and psychological condition during detention, and recommend, where necessary, their transfer to a rehabilitation / de-radicalisation centre.\n\nExplaining the bill’s salient features, CM Bugti told the House that if any institution picks someone up, it can keep them in custody for up to three months, after which they must be presented before a court and informed of the charges filed against him/her.\n\nThe detained person will be kept in a centre where he/she can meet their family members and the lawyer of the detained person will also be informed about it.\n\n“If anyone disappears beyond this system, then he/she will be considered a truly missing person,” Mr Bugti said, adding that the new law would be valid for six years. The legislation also includes a provision to extend its operation by two years through a notification by the provincial government.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:39.226Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915518/balochistan-amends-ata-allowing-detention-sans-charge-for-three-months",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T02:53:01.000Z"
}
