{
  "title": "HRCP concerned over letter to bar Ahmadis from observing Eid - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Human Rights Commission of Pakistan (HRCP) has expressed deep concern over the Lahore High Court Bar Association (LHCBA)’s letter urging the Punjab police to prevent members of the Ahmadiyya community from observing their religious rituals during Eid.\n\nIn a statement, the HRCP said this action, coupled with the requirement that Ahmadis should submit affidavits disavowing their beliefs, violates the community’s constitutional right to freedom of religion or belief under Article 20 as well as their right to equal citizenship.\n\nThe commission feared that this continued institutionalised discrimination against the Ahmadiyya community would empower vigilante actors and extremist groups to enforce a defacto ban on the community’s freedom of movement and public participation.\n\nIt said the LHCBA must withdraw its letter and the Punjab government should instruct local authorities to protect members of the Ahmadiyya community at a time when they were especially vulnerable to vigilantism.\n\nIn its letter to the Punjab IGP, the LHCBA sought to prevent the Ahmadiyya community from observing Islamic rituals on the occasion of Eidul Azha and action against its members if found violating the law.\n\nChild marriage act challenged before FSC\n\nThe “Islamabad Capital Territory Child Marriage Restraint Act, 2025” has been challenged before the Federal Shariat Court (FSS) for being ‘un-Islamic’.\n\nShahzada Adnan, a resident of Lahore, filed a petition through Advocate Mudassar Chaudhry pleading that the impugned law has been enacted in clear conflict to the Shariah, the Constitution and the fundamentals of Islam. The petition argues that the impugned legislation has totally negated the Islamic concept of marriage as according to the injunction of Islam, age does not matter but puberty is the key of ceremony of Nikah as well as marriage.\n\nCiting Quranic verses, the petition says the impugned law is ultra vires and against the basic principles of Islamic Shariah.\n\nIt alleges that the implementation of the impugned law would open a door for pre-marriage sex in the country.\n\nThe petition argues that the parliament did not consider the legislation work of Quran, Hadith, Muslim jurists and other Islamic countries.\n\nIt said the legislative body also ignored the opinion of Council of Islamic Ideology, a constitutional body, which already declared the impugned law against the spirit of Islam as well the Constitution of the country. The petition asks the FST to declare the impugned law as unconstitutional and against the Islamic principles.\n\nPublished in Dawn, June 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:28.471Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915559/hrcp-concerned-over-letter-to-bar-ahmadis-from-observing-eid",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T04:05:09.000Z"
}
