{
  "title": "Afghan women UN staff forced to work from home after threats - World - DAWN.COM",
  "author": null,
  "content": "Afghan women working for the United Nations in Kabul have been threatened by unidentified men because of their jobs, the organisation and several women told AFP on Thursday.\n\nMultiple women working for various UN agencies told AFP on condition of anonymity they had been threatened on the street and over the phone by men warning them to “stay home”.\n\nUN staffer Huda — not her real name — said that for weeks she has been bombarded with messages abusing her for “working with foreigners”.\n\n“The messages keep coming and they are always harassing us … saying, ‘Don’t let me see you again, or else’,” the young woman told AFP. She said her office had advised her to work from home until further notice.\n\nThe United Nations Assistance Mission in Afghanistan (UNAMA) confirmed that UN staff had been threatened.\n\n“Several United Nations female national staff members in the Afghan capital Kabul have been subjected to threats by unidentified individuals related to their work with the UN,” it said in a statement.\n\nConsidering the threats “extremely serious”, the UN has taken “interim” measures “to ensure the safety and security of staff members”, it added.\n\nThe Taliban government, accused by the UN of imposing a “gender apartheid” against women since returning to power in 2021, has denied any involvement.\n\nInterior ministry spokesman Abdul Mateen Qani said such threats were a “crime” and that police would take action. UNAMA said the authorities had opened an investigation.\n\nSince seizing power in 2021, the Taliban authorities have severely restricted Afghan women from working and it is the only country in the world where women are banned from education beyond primary school.\n\nThe government in 2022 banned women from working for domestic and international NGOs, which was extended to include the UN’s offices in the country the following year.\n\nThe policy has some exceptions, including for women working in healthcare and education, and has not been consistently enforced.\n\nThe UN has previously called the policy “deeply discriminatory”.\n\nSelsela, in her 30s, said that while returning from the office last week, she was approached by unknown men who told her she should be “ashamed” and that she must “stay home”.\n\n“They said, ‘We told you nicely this time, but next time you’ll have another thing coming’,” she told AFP.\n\n“I was very scared,” she said, explaining how she struggles to work efficiently from home in a country where electricity and internet are unreliable.\n\n“The situation for women is getting worse every day.”\n\nAnother woman, Rahila, said she and two other women colleagues were stopped by men while travelling home in a UN vehicle and told not to go to the office anymore.\n\n“They said, ‘Don’t you know that you are not allowed?’,” Rahila said, adding that she has also received threatening messages from unknown numbers.\n\n“I am very worried, I need my job and my salary,” she said.\n\nThree-quarters of Afghanistan’s population of some 45 million people struggle to meet their daily needs, according to the UN, with the country facing one of the world’s worst humanitarian crises.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:19.422Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915646/afghan-women-un-staff-forced-to-work-from-home-after-threats",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T15:30:40.000Z"
}
