{
  "title": "Cattle prices soar as sacrifice meets inflation in Karachi’s mandis ahead of Eidul Azha - Pakistan - DAWN.COM",
  "author": null,
  "content": "As Karachi’s sweltering heat bore down on the bakra mandi (cattle market), the air buzzed with the bleating of goats, the clatter of hooves, and bursts of conversation and laughter.\n\nThe entrance was lined with food stalls which welcomed visitors with snacks and tea, while a man handed Rs100 entry tickets to oncoming vehicles for parking.\n\nInside the mandi, red tents near the entrance glowed under small chandeliers, while large pens stretched on for miles, filled with sacrificial animals.\n\nFrom goats to sheep to oversized bulls and camels, the cattle market offered something for everyone.\n\nHowever, amid the lively buzz of the mandi, what stood out the most were the soaring prices of the livestock.\n\nSellers quoted steep rates, as the price of cows jumped by several hundred thousand rupees within just a year, while healthy goats that cost Rs40,000 only two years ago were now being sold for Rs45,000 and above.\n\nWith transport, rent, and feed costs soaring, many struggle to keep up, and the spirit of sacrifice is increasingly overshadowed by steep price tags.\n\nWhile economic indicators like inflation and remittances have shown improvement, prices at the cattle markets tell a different story.\n\nAccording to the 2024 Pakistan Economic Survey (PES), the [livestock sector][5] accounted for approximately 61 per cent of the agriculture value added and 15pc of the GDP during FY24, with a growth rate of 3.8pc.\n\n“The gross value addition of the livestock sector has shown an increase, rising to Rs5.8 trillion in 2023-24 from Rs5.59 trillion in 2022-23, marking a growth rate of 3.9pc,” stated the PES.\n\nDespite this, however, sellers and buyers of sacrificial livestock are shouldering an economic burden, as these prices do not seem to drop.\n\nOne seller, Mohammad Abid, told Dawn.com that the prices of cattle vary depending on different sellers, mandis and factors related to the quality of cattle, as well as where the cattle are brought from.\n\n“Cattle from Sindh would be cheaper as it is closer, while livestock from Punjab would be more expensive due to greater transportation costs,” he explained.\n\nHe also remarked on the increasing prices for goats over the past two years.\n\n“In two years, there has been a Rs3,000 to Rs4,000 increase in the prices of goats,” he said. “If a goat cost Rs40,000 a year or two ago, it now costs between Rs43,000 and Rs45,000, with the highest price ranging from Rs50,000 to Rs70,000.”\n\nAbid also opined that the government did not provide funds for the animals’ upkeep, stating, “Sellers must pay rent to set up their tents in the mandi.”\n\nAnother seller, Ibrahim, added that although the government had provided the space and electricity for generators and lights, they had to pay between Rs100,000 and Rs150,000 in rent every 10 days on top of bearing the cost of the animals’ food and water intake.\n\nThese prices reflected expenses like rent, feed, and caretaking — plus a profit margin — all of which are ultimately passed on to the customer.\n\n“A cow worth Rs1.8 million last year now ranges between Rs2.3m to Rs2.5m. For more expensive animals, costing Rs2.5m to Rs3m, people may negotiate and take them for Rs1.8m to Rs1.9m,” Ibrahim highlighted. “Even with soaring prices, people are still willing to pay.”\n\nKhurram Jameel, a customer who visited a few mandis to get an idea of the prices, said that he had seen cows sold for up to Rs7 million.\n\n“I bought most of my cattle from a mandi near the Karachi-Hyderabad Super Highway,” he said, adding that he also had to pay Rs14,000 to transport the animals to the Defence Housing Authority, located on the other end of the city.\n\nJameel also agreed that rising prices had an impact on cattle-buying, but said it was also a matter of faith.\n\n“This is Sunnat-i-Ibrahim and honestly, we enjoy it as Muslims,” he emphasised. “This is why it is called ‘Bari Eid’ — buy cattle yourselves, sacrifice them yourselves in your homes, take care of the animals and love them as we have been asked to do in our religion.\n\n“If you are passionate about something, you do your best to get what you can.”\n\nDespite complaints and disappointment over inflated prices, some customers echo similar sentiments, highlighting the true meaning of Eid and what it means to partake.\n\nAnother visitor at the mandi, Razia Abbasi, pointed out that the idea of a mandi had become more about “showing off wealth.”\n\n“It’s become more of a show, a status symbol, as people believe the bigger the better, even though it’s not a [part of] Islamic criteria that you must get something bigger and more expensive. Qurbani (sacrifice) is what you can afford with an open heart, it is not about showing off.”\n\nShe added that she mostly chose to buy Qurbani shares rather than only livestock.\n\n“It is more affordable, costing between Rs38,000 and Rs39,000 for a share of a cow; though this has also increased from last year’s Rs32,000,” she said. “There is also the bonus of convenience as there is not always someone to take care of the animals, nor may there be space to keep them.”\n\nIn light of price surges, several customers said they now resorted to window shopping at mandis and opted to buy qurbani shares and search for cattle on online marketplaces for cheaper prices.\n\nYet, for some, the essence of Eidul Azha remains untouched as they keep in mind the deeper devotion behind the rising costs, but for how long can faith outweigh financial strain as prices climb consistently?\n\nHeader image: Goats are on display at a cattle farm in Karachi. — Photo by author",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/04225618889b730.jpg",
  "retrievedAt": "2025-08-20T03:46:24.785Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915215/cattle-prices-soar-as-sacrifice-meets-inflation-in-karachis-mandis-ahead-of-eidul-azha",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T07:00:03.000Z"
}
