{
  "title": "Heatwave likely to intensify in Khyber Pakhtunkhwa from June 7 to 12 - Pakistan - DAWN.COM",
  "author": null,
  "content": "With the heatwave in Khyber Pakhtunkhwa likely to intensify from June 7 to 12, the provincial disaster management authority (PDMA) on Thursday issued an advisory cautioning the public.\n\nDay temperatures are likely to remain 5 to 7°C above normal from June 7-12 in Peshawar, Swabi, Mardan, Charsadda, Nowshera, Kohat, Hangu, Bannu, Karak, Lakki Marwat, Khyber, Kurram, Orakzai, Waziristan, Tank, Dera Ismail Khan, Chitral, Dir, Swat, Kohistan, Shangla, Battagram, Mansehra, Abbottabad, Haripur, Buner, Malakand, Bajaur and Mohmand, according to a PDMA advisory dated June 5, a copy of which is available with Dawn.com.\n\n“Additionally, dust storm/rain-thunderstorm associated with gusty winds are expected over the province,” PDMA said.\n\nIt noted that rising temperatures in upper areas may enhance the snowmelt rate during the forecasted period, and advised precautionary measures be taken to avoid any loss of life, damages to crops/ infrastructure and livestock.\n\nThe general public, especially senior citizens and children, should avoid direct exposure to sunlight during peak hours between 10am-5pm.\n\nThe PDMA said it was necessary to ensure that the general public was “made aware to make judicious use of water for drinking and cooling-off.”\n\nIndividuals with underlying health conditions were encouraged to remain especially vigilant and ensure they have necessary medical supplies readily available.\n\nThe PDMA advised to promote the use of appropriate protective measures, such as lightweight, loose-fitting and light-coloured clothing, along with SPF and hats.\n\n“Educate the public about the signs and symptoms of heat-related illnesses (ie dehydration, heat exhaustion, heatstroke) and necessary steps to take when experiencing these symptoms,” the advisory said.\n\nThe KP Health Department, in coordination with local administration, was directed to mobilise resources to establish heatstroke centers, cooling points, and mobile cooling stations at high-traffic areas.\n\n“Ensure the facilities are equipped with adequate cooling equipment (air conditioners, fans, misting systems) and drinking water [and] have trained personnel available to provide immediate medical assistance if needed.”\n\nAdditionally, farmers were advised to manage their wheat harvesting keeping in view the weather conditions, and to take care of their livestock as well.\n\nThe advisory requested that emergency services, such as Rescue 1122 and the fire brigade remain alert against possible fires.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:46:23.218Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915603/heatwave-likely-to-intensify-in-khyber-pakhtunkhwa-from-june-7-to-12",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T10:39:10.000Z"
}
