{
  "title": "People stand by Nawaz Sharif due to his ideology: Marriyum",
  "link": "https://www.app.com.pk/national/people-stand-by-nawaz-sharif-due-to-his-ideology-marriyum/",
  "date_published": "2023-08-02T16:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said the people, voters and legislators of Pakistan Muslim League-Nawaz (PML-N) firmly stood by its Qauid Muhammad Nawaz Sharif due to his ideology.\nHowever, those who hatched conspiracies against the country could not face the people today, the minister said while addressing a news conference after his visit to the Shalimar Recording and Broadcasting Corporation.\nShe said the people fully knew that it was Nawaz Sharif who could steer the country out of the crises.\nThe three-time elected prime minister, she said, was removed in 2017 through a conspiracy which culminated into the “Project Imran” that was imposed on the nation in 2018 and the journey of development came to a grinding halt, the minister regretted.\nShe said many uplift projects started by the Pakistan Muslim League-Nawaz (PML-N) government were stopped, the China-Pakistan Economic Corridor was put on the back burner, achievements against terrorism went in vain and the masses faced the worst inflation during the four-year tenure of the Pakistan Tehreek-e-Insaf (PTI) regime.\nIn the last 15 months, she said, Prime Minister Shehbaz Sharif along with his allies brought the country out of crisis created during the four-year inefficient and incompetent rule of the PTI.\nShe remarked that the PTI chairman was “an enemy of the country”, who first signed an agreement with the International Monetary Fund (IMF) on tough conditions, then violated and suspended it for petty political gains jeopardising the economy and prestige of the nation.\nMarriyum said the PTI regime was bent upon auctioning the national institutions, however, it was the current government which had completely transformed them by initiating reform programmes.\nThe minister congratulated PML-N leaders Talal Chaudhry and Daniyal Aziz as their five-year disqualification period had come to an end.\nThe two leaders, she said, stood firm with Nawaz Sharif and the party in difficult and tough times.“Talal Chaudhry and Daniyal Aziz fought against the odds and remained steadfast as political workers,” she added.\nThe minister said the National Assembly had approved the PEMRA Amendment bill today, expressing her gratitude for the media workers and stakeholders for supporting the bill.\nAfter the passage of this bill, she added, minimum salary of media workers would now be as per the government’s guidelines, and the issue of delay in the payment of salaries would also be resolved.\nThe media, she said, through a self-regulatory move had joined hands with the government to make ‘misinformation and disinformation’ as part of the bill.\nShe said that the amendment was enacted to promote responsible journalism in the country. Now, they would have to fulfill their responsibilities on misinformation and disinformation, she maintained.\nThe scope of public service messaging had been widened in the amended PEMRA Bill, Marriyum Aurangzeb noted.\nShe congratulated the employees of Shalimar Recording and Broadcasting Corporation (SRBC) on the completion of 108-room building.\nShe said when the present government came to power, the building of SRBC was a ruin, and employees were on the streets as they were not paid salaries and pensions for many months.Now, she added, that their salaries and pensions were being paid in time.\nShe said that state broadcasters like PTV, Radio Pakistan and SRBC were assets of the nation and their revival would boost the industry.\nMarriyum said during the PTI era, the minister concerned used to talk about the auction of the buildings of PTV, Radio Pakistan and SRBC but the present regime in only 15 months had taken concrete steps for their transformation on modern lines so that they could stand on their own feet.\nShe said that the former prime minister was termed a “media predator” by an international organization, whereas during the past 15 months, Pakistan’s ranking in the freedom of expression index had improved by seven points.\nShe said Prime Minister Shehbaz Sharif would formally launch the health card scheme for artists and journalists.\nAbout Radio Pakistan, she said that the problem of salaries and pensions of its employees had been resolved.\nThe minister said that the government wanted to provide entertainment to people at affordable cost and for that purpose it had decided to build cinema houses in the premises of PTV, Radio Pakistan and SRBC.\nShe said that the aim was to revive the local film industry so that Pakistan’s national narrative could be promoted and projected through screen tourism.\nThe minister inaugurated the MCR and also broke ground of a cinema house in the SRBC building.",
  "retrievedAt": "2025-08-11T09:02:57.668Z"
}
