{
  "title": "Dar questions PTI govt’s Rs 500B anti-terror spending in KP",
  "link": "https://www.app.com.pk/national/dar-questions-pti-govts-rs-500b-anti-terror-spending-in-kp/",
  "date_published": "2023-08-02T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Minister of Finance and Revenue Muhammad Ishaq Dar, on Wednesday, raised questions about the effective usage of Rs 500 billion allocated to the Khyber Pakhtunkhwa government over the past decade to combat terrorism.\nDuring a Senate debate on the Bajaur suicide bombing, Dar revealed that the Khyber Pakhtunkhwa government received over Rs 500 billion, including Rs 71 billion during 2022-23, from the divisible pool since 2009 to combat terrorism in the province. He expressed his disappointment, stating that if they had spent the amount on budget support, it would be regrettable.\nMinister for Finance and Revenue, Muhammad Ishaq Dar, brought attention to the special provision in the NFC Award, 2021, stating that the provinces unanimously decided to allocate 1 per cent of the Divisible Pool’s net proceeds to Khyber Pakhtunkhwa (KP) as an acknowledgement of its front line role against terrorism. However, Dar expressed concern that the provincial government had not effectively utilized the allocated funds to build the intended counter-terrorism capacity.\nExpressing condemnation for the gruesome incident in Bajaur, he expressed regret that terrorism has resurged, prompting the need for introspection into the reasons behind its resurgence in the country.\nHe called upon the House to organize a briefing from the Interior Ministry, urging them to share terror data from the last decade. He emphasized that a collective decision should be taken to determine the future course of action in combating the menace of terrorism.\nHe strongly criticized the PTI government for engaging in negotiations with terrorists, providing them sanctuary in the province, and demanded that those responsible should apologize to the people of the country.\nSyed Yousaf Raza Gillani expressed condemnation of the Bajaur killings and called for an in-camera meeting of the National Security Committee to devise a joint strategy for combating terrorism.",
  "retrievedAt": "2025-08-11T09:03:01.415Z"
}
