{
  "title": "Experts seek favourable solution to settle Kashmir dispute",
  "link": "https://www.app.com.pk/national/experts-seek-favourable-solution-to-settle-kashmir-dispute/",
  "date_published": "2023-08-02T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): The foreign policy experts on Wednesday stressed the need for exploring a favourable solution for the settlement of the Kashmir dispute in order to ensure peace and prosperity in the region.\nThe experts made the remarks during a roundtable conference “Historical Analysis of Contested Sovereignty and Statehood in UN Recognised Disputed Territory of Jammu & Kashmir”, organized by the Islamabad Policy Research Institute (IPRI).\nThey analyzed the struggle of Kashmiris from the prisms of legal, political and diplomatic angles, and took a holistic view of the prevailing situation.\nIt was noted that Kashmir and Pakistan were indispensable to each other, and all dimensions should be explored to raise the issue for a favourable solution.\nParticipants from Kashmir, especially, highlighted the efforts that they had undertaken under consecutive Indian governments, and regretted the attitude of intransigence of New Delhi in addressing an issue of existential crisis.\nSpecial Representative on Afghanistan Dr Nasir Qadri viewed that Pakistan should have done more on the front of International Court of Justice, as there were ample avenues available to tap the legal decorum.\nRSIL President Asif Durrani elucidated that Pakistan had to face a lot of setbacks as India was bent upon crushing the Kashmiris, and even thinking of extra-territorial adventures in the occupied valley. He cited Pulwama and Balakot incidents as cases of international aggression.\nHe said that India literally had three options while dealing with the Kashmiris, which were to exterminate all the Kashmiris, befriend all the Kashmiris, and talk it out with the Kashmiris.\nIt was noted that India’s August 5, 2019 action was tantamount to occupying Jammu & Kashmir for the second time. Indian Prime Minister Narendra Modi was in a denial mode, and his acts were in contravention to law and Constitution of India itself.\nIt was a general consensus among the participants that the struggle in Kashmir could be better highlighted from a position of strength if Pakistan reoriented its economic, political and military muscles.\nDr Ahmer Bilal Soofi was of the view that the least that Pakistan could do was to list out the violation on all international fora and call a spade a spade.\nThe roundtable was told that it was time to break Indian intransigence, and the best way to do it was to increase the cost of India in Kashmir; unite all groups under one narrative; adopt a sustained policy approach and influence international environment.",
  "retrievedAt": "2025-08-11T09:03:07.408Z"
}
