{
  "title": "Senators seek in-camera briefing on terrorism",
  "link": "https://www.app.com.pk/national/senators-seek-in-camera-briefing-on-terrorism/",
  "date_published": "2023-08-02T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Senators on Wednesday demanded an in-camera meeting to address sensitive matters concerning national security and to devise a collective strategy for combating terrorism and extremism within the country.\nDuring the debate on the Bajaur suicide attack, the Upper House members have expressed strong condemnation of the terrorist attack in Bajaur urging the development of an effective strategy to eradicate terrorism from the country.\nThe debate participants reached a consensus to assert parliament’s powers. They emphasized the importance of regularly summoning key officers to question their performance and the measures taken to ensure peace in their respective areas.\nThey stressed the need to seek regular feedback and take concrete steps to combat terrorism.\nDuring the discussion, JUI-F leader Maulana Abdul Ghafoor Haideri strongly denounced the terrorist attack, emphasizing that its purpose was to destabilize the country. He reaffirmed his party’s unwavering commitment to stand for the cause of Islam and Pakistan and expressed their readiness to make any necessary sacrifices.\nHaji Hidayat Ullah emphasized the need to hold the perpetrators of the Bajaur terrorist attack accountable as a way to set an example for others.\nDost Muhammad Khan urged the Federal Government to promptly announce a compensation package for the victims of the Bajaur incident. Finance Minister Ishaq Dar pledged to address the issue of announcing compensation for the victims of the Bajaur incident with the Prime Minister and at the cabinet level.\nMushtaq Ahmed Khan emphasized that safeguarding the lives and liberties of Pakistani citizens is the joint responsibility of federal, and provincial authorities and security agencies.\nHe urged the government to announce compensation for the victims of the Bajaur incident.\nAdditionally, he proposed holding an in-camera session of Parliament to discuss the issue and develop a comprehensive strategy to combat terrorism.\nBahramand Tangi stressed the importance of avoiding political point-scoring regarding the Bajaur incident. Instead, he called for all stakeholders, including political forces, to unite in the fight against terrorism.\nFurthermore, he emphasized the significance of honouring and recognizing the martyrs of the armed forces.Tahir Bizinjo said Pakistan must reevaluate its Afghan policy and develop a new strategy in collaboration with all political forces in the country. He believes that establishing good relations with neighbouring countries and resolving conflicts through dialogue is crucial for restoring peace in Pakistan.\nPalwsha alleged that enemies were planning to push Pakistan towards default.\nSaifullah Abro, Fida Muhammad, Kamran Murtaza and Danesh Kumar also spoke.\nAt the outset of the proceedings, Maulana Attaur Rehman led the House in offering Fateha for the martyrs of Bajaur.",
  "retrievedAt": "2025-08-11T09:03:01.415Z"
}
