{
  "title": "BISP board approves record Rs. 471 billion budget for FY 2023-24",
  "link": "https://www.app.com.pk/national/bisp-board-approves-record-rs-471-billion-budget-for-fy-2023-24/",
  "date_published": "2023-08-02T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): In a significant development towards empowering women and enhancing social protection measures, the board of the Benazir Income Support Programme (BISP), in its 60th meeting, approved a record Rs. 471 billion budget for FY 2023-24.\nThe board met under the chair of Federal Minister for Poverty Alleviation and Social Safety (PA&SS) and Chairperson BISP, Shazia Marri.\nThe BISP Board approved Rs. 471 billion budget for FY-2003-24 which included Rs. 361.5 billion for Benazir Kafaalat Programme, covering 9.3 million families, Rs. 32.27 billion for Benazir Nashonuma Programme covering 1.5 million individuals, Rs. 55.4 billion for Benazir Taleemi Wazaif which would benefit 9.2 million children.\nIn addition, six billion rupees have been earmarked for Benazir Scholarships for Undergraduates.\nThe board was further briefed that only 1.20% of the total budget is for employees including administrative expenses while the rest of the budget is programme based. Wrapping-up the 2022-23 revised estimates it was highlighted that 99.98% of the budget for the programme has been utilized.\nThe board was also apprised of the performance of last one year, whereby, the number of Benazir Kafaalat beneficiaries was increased from 7.6 to nine million along with increase in cash stipend from Rs. 7000 to Rs. 8750 per quarter per family.\nThe Board was briefed that the beneficiaries of Benazir Nashonuma Programme were increased from 0.2 to 0.77 million and beneficiaries of Taleemi Wazaif were increased from 2.6 to 7.52 million.\nThe board was further informed that two major steps have been approved. One of the major decisions taken was to expand the scope of the recently launched Benazir Social Protection Account.\nThe existing payment system of the Benazir Income Support Programme faced challenges due to its reliance on two banks and their agents, leading to complaints and discrepancies.\nThe new model aims to provide beneficiaries with greater dignity and increase transparency and convenience. It would allow beneficiaries to choose their preferred banks, ensuring a beneficiary-centric approach with enhanced autonomy. The Hybrid Social Safety net Programme was referred to the Technical Design Committee.\nThe board also approved several agendas providing resolution of long standing issues of employees of BISP. In a move towards supporting its employees, the board decided to restructure the salaries of its staff in line with government policies.\nThis decision comes as a response to a long-standing demand from the dedicated personnel working tirelessly to implement and manage the programme. These employees had been working without any pension benefits.\nHowever, it was approved that now the Contributory Pension Fund will be introduced with matching contributions by the government which will lessen the burden on government exchequer.\nShazia Marri, while chairing the meeting, highlighted the government’s commitment to strengthening social protection initiatives.\nShe emphasized that the BISP is dedicated to uplift the underprivileged segment of the society and promoting gender equality, empowering women to play active roles in the country’s development.\nSecretary BISP, Amer Ali Ahmad, Secretary PA&SS, Yusuf Khan, Addl. Secretaries of Finance and Economic Affair Division (EAD) as well as private members Dr Kaiser Bengali, Dr Abid Qaiyum Suleri, Barrister Ayesha T. Haq, Mr. Haris Gazdar and Dr. Amjad Saqib, attended the board meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:03:05.282Z"
}
