{
  "title": "FIA nabs 470 human smugglers in last four years: NA told",
  "link": "https://www.app.com.pk/national/fia-nabs-470-human-smugglers-in-last-four-years-na-told/",
  "date_published": "2023-08-02T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Minister of State for Law and Justice Shahadat Awan on Wednesday told the National Assembly that Federal Investigation Agency (FIA) has arrested 470 human smugglers and convicted 364 during the last four years.\nReplying to a question during Question Hour, the minister said the FIA has been taking action against those involved in human smuggling and   registered 889 cases under Prevention of Smuggling of Migrants Act, 2018 during 2020, 2021, 2022 and April 30, 2023. Some 2016 Pakistanis were identified travelling on fake/ forged documents against whom 971 cases were registered and arrested 104 smugglers/ agents during the said period, he said.\nHe said seven Airline Staff members who were involved in facilitation to paxes on fake travel documents have also been arrested. Legislation has been done to punish human traffickers as well as safeguard the rights of victims.\nThe minister said we were also strengthening international cooperation to curb the menace of human smuggling.\nTo another question, the minister said that the federal capital witnessed 20 per cent reduction in crimes cases. Eagle Squad has been established in the Federal Capital Territory on the pattern of the Dolphin Force in Punjab to control the crime rate, he said.\nHe said there was considerable reduction in the crime rate in Islamabad after the establishment of Eagle Squad.\nTo a separate question, Shahdat Awan said that no air ambulance services was available in the Capital Hospital CDA. The Ambulances services including Air Ambulances was the domain of CARES-1122 MCI, he said.\nHe said the government has also taken effective measures to prevent human smuggling.\nAPP/raz-muk\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:03:03.996Z"
}
