{
  "title": "Roundtable of Engineer Parliamentarians Caucus held",
  "link": "https://www.app.com.pk/national/roundtable-of-engineer-parliamentarians-caucus-held/",
  "date_published": "2023-08-02T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): The second event of the Engineer Parliamentarians Caucus (EPC), titled “Roundtable of Engineer Parliamentarians Caucus,” was successfully held at the Pakistan Institute for Parliamentary Services (PIPS) on Wednesday.\nThe event was organized by the Pakistan Engineering Council (PEC) and hosted by Engr. Muhammad Najeeb Haroon, MNA, and Chairman PEC, along with Engr. Senator Rukhsana Zuberi, Convener-EPC, and former Chairperson PEC.\nThe event witnessed the presence of esteemed members of EPC, along with honourable Parliamentarians, including Engr. Senator Farhatullah Baber, Engr. Sabir Hussain Kaim Khani, MNA; Engr. Senator Muhammad Asad Ali Khan Junejo; Ms Shahida Rehmani, MNA/Secretary of Women’s Parliamentary Caucus; Sardar Shafiq Tareen, Chairman of the Senate Standing Committee of Science and Technology; Dr. Shazia Sobia Aslam Soomro , MNA/ Parliamentary Secretary, alongside experts and professionals from diversified engineering fields.\nDuring the event, Engr. Sabir Hussain Kaim Khani, MNA, shared that the National Assembly of Pakistan has unanimously passed a resolution on August 01 and recognized the establishment of the Engineer Parliamentarians Caucus.\nThe resolution will also be presented in the ongoing Senate. The main objective of the caucus is to strengthen engineering policy and advocacy in all technical matters for the government, aiming to enhance quality control and boost both export and import substitutions.\nThe Engineer Parliamentarians Caucus aims to play a pivotal role in reshaping policies for the betterment of Pakistan and promoting engineering practices that align with the best international standards.\nAdditionally, the Caucus will serve as a vital link between the Parliament/Federal Government, and the Pakistan Engineering Council.\nEngr. Senator Asad Junejo, while extending appreciation for this commendable initiative, emphasized that the solutions to the challenges being faced by the country lie with engineers.\nAs a member of various standing committees in the Parliament, he strongly believed that engineers’ involvement in policy decisions is crucial, and the caucus will play a pivotal role in this regard.\nHe also proposed the creation of an engineering cadre, known as Pakistan Engineering Services, in addition to the existing 12 cadres of the Central Superior Services (CSS).\nOther members of Parliament also lauded the initiative of the Pakistan Engineering Council, acknowledging that the Engineer Parliamentarians Caucus is a significant milestone and represents a strategic collaboration between the engineering profession and the Parliament for the socio-economic development of the country.\nThe plenary session featured speeches by Engr. Senator Rukhsana Zuberi, Engr. Dr. Mohsin Hafeez, Engr. Naseer Ahmed Gillani, and Engr. Mian Sultan Mahmood, presented insights into the economic challenges and their engineering solutions.\nThese specialized sessions were chaired by Engr. Sabir Hussain KaimKhani, MNA; Engr. Muhammad Najeeb Haroon, MNA and Chairman PEC, Engr. Senator Muhammad Asad Ali Khan Junejo and Miss Shahida Rehmani, MNA.\nThe Engineer Parliamentarians Caucus is poised to make a significant impact on shaping the future of engineering practices in Pakistan and addressing the country’s socio-economic challenges with the expertise and collaboration of engineers in the parliamentary process.",
  "retrievedAt": "2025-08-11T09:03:00.775Z"
}
