{
  "title": "Facilitating business community, resolution of their issues among govt’s priorities: PM",
  "link": "https://www.app.com.pk/national/facilitating-business-community-resolution-of-their-issues-among-govts-priorities-pm/",
  "date_published": "2023-08-02T15:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 2 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday said that provision of facilities to the business community and resolution of their issues were among the top priorities of the government.\nDuring a meeting with a delegation of Karachi Chamber of Commerce and Industry (KCCI) led by its President Tariq Yousaf and Chief Executive Officer of Trade Development Authority Zubair Motiwala, the prime minister lauded the contribution of traders in addressing the economic issues of the country, the PM Office Media Wing said in a press release.\nSindh Governor Kamran Tissori and Chief Minister Syed Murad Ali Shah, federal ministers Syed Naveed Qamar, Syed Ameenul Haque, Ahsan Iqbal, Eng. Khurram Dastagir Khan and Musadiq Malik, special assistants Tariq Bajwa, Tariq Pasha and Jahanzaib Khan, State Bank governor, FBR chairman and other relevant authorities attended the meeting.\nThe prime minister maintained that the incumbent government had taken steps for the creation of business friendly environment in the country and had set up a project of generating 10,000MW of solar power in which the foreign investors were showing keen interest.\nHe also welcomed the suggestions regarding equitable distribution of electricity and gas.\nWith constitution of the Special Investment Facilitation Council (SIFC), he said, huge foreign investment would be secured.\nThe prime minister, during the meeting, directed the State Bank and Federal Board of Revenue to resolve the business community’s issues with their cooperation.\nHe assured that the government would provide electricity to the traders in Karachi at similar rates.\nOn the occasion, Chief Executive of the Trade Development Authority and traders’ leader Zubair Motiwala submitted proposals for the resolution of the business community’s problems and praised the prime minister for the resolution of their issues.",
  "retrievedAt": "2025-08-11T09:03:04.578Z"
}
