{
  "title": "President imposes fine on UBL for filing frivolous representation",
  "link": "https://www.app.com.pk/national/president-imposes-fine-on-ubl-for-filing-frivolous-representation/",
  "date_published": "2023-01-07T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): President Dr Arif Alvi has imposed a fine of Rs 20,000 on United Bank Ltd (UBL) over filing a frivolous representation in a disputed transaction case involving a mere amount of Rs 20,000 only.\nHe further ordered that the bank should pay the fine in addition to returning the defrauded amount to its customer as the bank adamantly filed frivolous representation wasting its resources and time as well of the Banking Mohtasib of Pakistan (BMP) and the office of the Head of State, President Secretariat Press Wing said in a press release on Saturday.\nUBL had filed a representation with the President against the orders of the BMP in a case where a customer had attempted to withdraw cash of Rs 20,000 from UBL’s ATM but the cash was not dispensed whereas the customer’s account was debited.\nThe customer had also filed a complaint and submitted the Dispute Settlement Form but his complaint was rejected summarily. Feeling aggrieved, he had raised the matter with the BMP, which passed the orders of returning the disputed amount to the customer.\nThe president rejected the UBL’s representation on the grounds that the bank had failed to discharge the burden and statutory liability cast upon it under the law by failing to comply with the State Bank of Pakistan’s directives that the banks should install external cameras in ATM cabins within three months from the date of issue of SBP’s circular to have secondary evidence against cash claims to satisfy the customers.\nHe further observed that the bank also failed to comply with SBP’s instructions that for record keeping relating to complaints, banks were required to follow instructions contained in Prudential Regulations, and where CCTV footage was considered part of circumstantial evidence, it must be retained at least for two months, and for complaints escalated to Courts, all related evidence should be retained till the final decision.\nThe president held that UBL had failed to provide its investigation report and requisite information to BMP office despite follow up and being given the opportunity during the hearing as well.\nThe president rejected the UBL’s representation filed against the orders of the BMP wherein BMP had rejected the view point of the bank terming it baseless and without any evidence and directed the Bank to pay the defrauded amount of Rs 20,000 to the complainant and report compliance within 30 days.\nHe also upheld the order of BMP and also imposed a fine of 20,000 on the bank for filing an appeal in a case where meagre amount was involved and was less than even the cost of litigation and was frivolous.",
  "retrievedAt": "2025-08-11T05:41:41.966Z"
}
