{
  "title": "Senate adopts two resolutions",
  "link": "https://www.app.com.pk/national/senate-adopts-two-resolutions-2/",
  "date_published": "2024-01-01T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 1 (APP): The Senate on Monday adopted two resolutions recommending the government to award strict punishment to those involved in negative propaganda against armed forces and ensure reform in the higher education curriculum to apprise students of the consequences and risks of drug usage.\nPPPP Senator Bahramand Khan Tangi sponsored a resolution which recommended the government to take necessary steps to award severe punishment as per law to those involved in malicious propaganda against the armed forces and other security agencies on various social media platforms.\nAccording to the text of the amended resolution, “Cognizant of the huge sacrifices of Armed forces and other security agencies in the war against terror and for the Defence and protection of the country’s borders; Acknowledging the fact that strong army and other security agencies is indispensable for the Defence of the country, especially in view of the hostile neighborhood; Expressing deep concern on the negative and malicious propaganda against the armed forces and other security agencies on various social media platforms; The Senate of Pakistan, therefore, recommends to the Government to take necessary steps to award severe punishment as per law”.\nBAP Senator Samina Mumtaz Zehri moved another resolution recommending the government to take immediate steps to cater needs of all students with diverse cultural backgrounds and to reform the higher education curriculum to apprise students of the consequences and risks of drug usage.\nIt also demanded to devise a monitoring mechanism in all the universities for enforcement of the ‘Policy on Drug and Tobacco Abuse in Higher Education Institutions 2021’ in letter and spirit.\nAnother resolution of PTI Senator Seemee Ezdi was not taken up due to the absence of lawmaker which recommended the government to prioritize climate change projects in its development Budget and allocate sufficient funds for climate change adaptation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:18:34.931Z"
}
