{
  "title": "China’s BRI project appreciated by world as progress possible by working together: Solangi",
  "link": "https://www.app.com.pk/national/chinas-bri-project-appreciated-by-world-as-progress-possible-by-working-together-solangi/",
  "date_published": "2024-01-01T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 01 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Monday that China’s Belt and Road Initiative was appreciated by the world as progress was possible only by working together.\nIn an exclusive interview with China Radio International, the minister said that President Xi Jinping’s vision of development was based on universal development.\n“The fruits and benefits of development come only when development is not limited. No country can progress in isolation”, Murtaza Solangi maintained.\nWelcoming the message of the President of the People’s Republic of China Xi Jinping at the beginning of the new year, Murtaza Solangi said his vision of global development was also evident in his New Year message.\nPresident Xi has always promoted the timeless principles of humanity and his theory was a negation of the theory that a country can achieve development only by keeping other countries behind, the minister opined.\n“In our region too, President Xi Jinping’s globalist ideology is gaining ground,” he said.\nCentral Asian countries, Solangi added were already implementing Belt and Road Initiative projects.\nHe said with the passage of time, President Xi’s globalization-based ideology will gain momentum.\nHe said that Pakistan’s relations with China entered a new era after the start of the China-Pakistan Economic Corridor project.\nThe minister said due to the cooperation of the People’s Republic of China and China’s leadership, Pakistan has made progress through CPEC.\nWhen CPEC was launched, the focus was on energy and infrastructure projects, Murtaza Solangi said and added currently, work was being done in many new areas under CPEC. Wishing Happy New Year to the people of China he said relations between Pakistan and China have always been exemplary.\nSolangi said cooperation in the fields of information technology, mining, special economic zones, agriculture, agro-based industry and tourism was developing as new avenues of cooperation between China and Pakistan were opening.\nHe remarked that Pakistan-China friendship was not limited to slogans and the future of the relations between the two countries was very bright.\n“Thousands of Pakistani students are studying in Chinese universities”, Murtaza Solangi stated.\nAs a result of the cooperation between Radio Pakistan and China Radio International, Pakistan’s professionals went to China and brought back the pleasant experiences of working with their Chinese brothers, the minister said.\nSaying that CPEC projects have had a positive impact on the lives of local people, Murtaza Solangi urged the media to highlight the positive impact on people’s lives.",
  "retrievedAt": "2025-08-10T23:18:09.967Z"
}
