{
  "title": "NCOC lauds Khyber Pakhtunkhwa govt efforts to overcome COVID-19 outbreak",
  "link": "https://www.app.com.pk/national/ncoc-lauds-khyber-pakhtunkhwa-govt-efforts-to-overcome-covid-19-outbreak/",
  "date_published": "2020-07-27T04:41:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 27 (APP):The National Command and Operation Centre (NCOC) on Monday in its special session held at Peshawar acknowledged the efforts of Khyber Pakhtunkhwa government to contain the COVID-19 pandemic.\nThe NCOC meeting chaired by Federal Minister for Planning, Development and Special Initiatives Asad Umar discussed the ground check of standard operating procedures (SOPs) compliance, measures to control tourist visits to recreational spots, parks and tourism sites during Eid holidays. Update on smart lockdowns, hotspots and contact tracing, Anti COVID-19 strategy of Khyber Pakhtunkhwa (KP) government, disease prevalence and low testing in various KP cities and Epi Curve Chart data also came under discussion.\nThe NCOC special session was hosted by Chief Minister KP Mahmood Khan where Chief Secretary KP and other senior officials of the provincial government were also present.\nSpeaking on the occasion, Chief Minister Mahmood Khan welcomed the NCOC team and expressed his gratitude to Asad Umar for acknowledging the efforts made by the provincial government to cope with the contagion.\nHe dedicated the success in overcoming the mounting spike of COVID deaths and positive cases to his entire team.\nThe NCOC forum, he said should permanently remain intact as it would be helpful in coping with many other emergency situations and disasters through better coordination with the provinces to amicably resolve many provincial issues.\nMahmood Khan mentioned that the tourism sector was a significant part of the provincial economy and there was much pressure on the provincial government to lift the ban and any decision of NCOC regarding this would be implemented in its full spirit.\nFederal Minister for Planning, Development and Special Initiatives Asad Umar said the efforts of the Khyber Pakhtunkhwa government and the district administration in controlling the contagion outbreak deserved commendation and appreciation. The way in which the leadership of all the provinces came together to control the pandemic with tireless work and tremendous measures, any complacency could exacerbate the situation. “We need to rigorously and effectively implement smart lockdowns, SOPs and safety measures. We have to ensure more efficiency and strict enforcement of the health guidelines.”\nOn the outset of Eid-ul-Adha, he said there was need to stop the flow of tourists between the provinces and towards the famous tourist destinations of the country. While the NCC and NCOC meeting after Eid under the leadership of the Prime Minister would deliberate on opening tourism sector with the consultation of Khyber Pakhtunkhwa and Gilgit Baltistan governments. He added that keeping in view the increasing number of masses visiting cattle markets the closing timings would be extended to 11pm.\nNational Coordinator NCOC Lieutenant General Hamood Uz Zaman Khan, Prime Minister’s Focal person on COVID Dr Faisal Sultan and Special Assistant to the Prime Minister on Digital Pakistan Tania Aidrus and Chief Secretary Khyber Pakhtunkhwa Dr Kazim Niaz were present on the occasion and other provincial representatives participated in the meeting through video link.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:33:07.594Z"
}
