{
  "title": "Nation remembers Captain Muhammad Sarwar Shaheed on his martyrdom anniversary",
  "link": "https://www.app.com.pk/national/nation-remembers-captain-muhammad-sarwar-shaheed-on-his-martyrdom-anniversary/",
  "date_published": "2020-07-26T23:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP):The 72nd martyrdom anniversary of Captain Raja Muhammad Sarwar Shaheed, first ever recipient of greatest award, Nishan-e-Haider was observed on Monday.\nRaja Muhammad Sarwar was born in Singhori village in Gujar Khan district on November 10, 1910. His father, Raja Muhammad Hayat Khan, served in the British army as a constable. The British government gifted Raja Hayat Khan with property near Samundari because of his services during the First World War.\nRaja Sarwar obtained his early education from Islamia High School in Faisalabad. He had three brothers and one sister. Raja Sarwar was very interested in the sports of football and kabadi during his youth years. He was married in 1936 and became father to a son and a daughter, all electronic channels reported.\nHe entered into the army as a Sepoy in April 1929 and served in the Baloch regiment till 1941. He was commissioned in the Punjab regiment in 1944 and also got promoted to the rank of Second Lieutenant that very year.\nHe joined the Punjab regiment in 1946 and achieved the rank of Captain, months before the creation of Pakistan. Once the country emerged on the map of the world in 1947, Raja Muhammad Sarwar volunteered to be a part of the battalion formed to regain Kashmir.\nHe was given the rank of Company Commander of the Second Battalion of the Punjab Regiment. Under his leadership, the regiment was able to force the Indian forces to retreat out of certain regions of Gilgit-Baltistan. However, his battalion faced heavy resistance from the opposing forces present in the Uri sector as the soldiers pushed forward to take over a well-guarded enemy position.\nAs he along with his battalion continued moving forward, the intensity of gun-fire, grenade attacks and mortar fire. He received martyrdom on July 27, 1948, after receiving multiple shots on his chest as he attempted to cut a barbed wire barrier while making an effort to progress further into enemy lines.\nIn recognition of his courage, Captain Sarwar was awarded with the Nishan-e-Haider by Pakistan army. Sarwar Shaheed College, located in Gujar Khan, was named to honour him.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:33:14.371Z"
}
