{
  "title": "Radio-based service charges hiked by 360pc - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Rising from almost a 25-year deep slumber, the government has approved an increase of up to 360 per cent in charges of radio-based services (RBS) for around 1,100 radio networks and mobile stations to partially cover administrative charges.\n\nA decision to this effect was taken last week by the Economic Coordination Committee (ECC) of the cabinet, which chose to keep secret the steep revision in charges, although it confirmed the rates had been revised.\n\nAccording to the Pakistan Telecommunication Authority (PTA), which tabled the proposal, the RBS spectrum and licence fees had remained unchanged since 2000 despite inflation rising by over 700pc in the same period.\n\nOfficial record seen by Dawn suggests that a hike of about 361.3pc has been approved in RBS charges for 748 licensees of private radio networks to Rs350 million from Rs76m, an increase of Rs274m per licence.\n\nPTA to collect Rs463m under revised fee structure\n\nLikewise, a 300pc increase in RBS rates has been allowed for mobile stations used by a total of 144 licensees of aircraft and ships to Rs2.852m from Rs713,000, showing an increase of Rs2.139m per licence.\n\nSimilarly, the charges for licensees of 165 Amateur Radio, 17 Inmarsat and 19 Microwave DRS links have been doubled. The revised fee for Amateur Radio licences has increased from Rs160,000 to Rs320,000 per licence. Inmarsat licence charges have risen from Rs625,000 to Rs1.25m, while the fee for Microwave DRS links has been raised from Rs53.92m to Rs107.84m.\n\nThe PTA estimates that the increase in service charges would increase its revenue to about Rs463m from the existing Rs131.4m, an increase of 252pc or Rs331.44m.\n\nThe increase in RBS rates in terms of foreign exchange, on the other hand, has been estimated to actually drop by 18pc to $1.66m per year from the existing revenue of $2.021m.\n\nInformed sources said the ECC expressed displeasure at the fact that relevant stakeholders, including PTA and the Ministry of IT and Telecom, had been sleeping over the issue for two and a half decades.\n\nThe ECC “directed the ministry to ensure periodic revision of RBS charges every three to five years, aligned with ongoing economic changes and technological advancements in the sector”, an official statement said.\n\nThe PTA is responsible for frequency allocation, licence issuance and fee adjustments for RBS services, including PRNs, Mobile Station Aircraft/Ship, Inmarsat, Amateur, and DRS/Microwave links.\n\nThe Ministry of IT and Telecom informed the ECC that the outdated fee structure had led to a significant mismatch between service charges and the costs incurred in managing licences and spectrum oversight.\n\nIt said the economic landscape had undergone a significant transformation since the implementation of the previous fee structure. Further, the monetary value and technological sophistication of services rendered through RBS licences and authorisations also increased substantially, driven by technological advancements and the evolving requirements of contemporary communication systems.\n\nThis significant evolution in both economic parameters and service delivery frameworks required an immediate and comprehensive revision of the RBS fee structure.\n\nUnder Sections 5(2a), 5(2c) and 43(5) of the Pakistan Tele-communication (Re-organisation) Act, 1996, the PTA is mandated to regulate the issuance and renewal of licences, the processing of frequency assignment requests and the charging of relevant fees.\n\nMoreover, Clause 8.7.5 of the Telecommunication Policy 2015 mandated the PTA to propose to the federal government the methods of assigning and pricing frequency spectrum after consultation with stakeholders. Based on an industry consultation in August 2024, the PTA then proposed a revision in the RBS fee structure.\n\nPublished in Dawn, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:33:42.723Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927079/radio-based-service-charges-hiked-by-360pc",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:05:35.000Z"
}
