{
  "title": "Unidentified bodies of man, woman recovered from Karachi’s China Port: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "The unidentified bodies of a man and a woman were recovered from Karachi’s China Port area on Monday, police said.\n\nThe deceased remain unidentified, but their age was estimated to be between 25 and 30 years old, according to South Deputy Inspector General (DIG) Syed Asad Raza.\n\n“There are bullet marks on the body,” he said, adding that two 9mm shells were also recovered from the site of the incident.\n\n“Evidence is being collected from the crime scene,” the DIG said. “The identification of the deceased and further investigation are underway.”\n\nSituated near Clifton beach, China Port, also known as Oyster Rocks or the South Asia Pakistan Terminal (SAPT) breakwater, is a man-made structure built by China to protect the port from waves. It’s a popular spot for locals, offering views of the port, cargo ships, and cranes.\n\nLast month, a partially decomposed body of a young man was found in a desolate area in Karachi’s Scheme 33.\n\nSachal Station House Officer Aurangzeb Khattak had said the body of the man, who appeared to be in his mid-20s, was recovered from bushes outside the wall of Karachi University’s Teachers Society near the Superhighway.\n\nThe body bore marks of torture, he said, adding that the victim had sustained head injuries. The officer hinted at the possibility that the body might have been thrown there by suspects travelling in a car. The corpse was taken to the Abbasi Shaheed Hospital but his identity could not be ascertained immediately.\n\nIn February, the body of a trader, who was allegedly kidnapped, was found at Seaview.\n\nLast year, the bodies of a man and a woman were recovered from a pond inside the sprawling Bagh Ibne Qasim in Clifton on the second day of Eidul Azha. According to the police, the victims were aged between 28 and 30, and it appeared that they had drowned around two days prior.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:31:05.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927147/unidentified-bodies-of-man-woman-recovered-from-karachis-china-port-police",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T09:55:23.000Z"
}
