{
  "title": "Thailand and Cambodia agree truce after 5 days of fighting - World - DAWN.COM",
  "author": null,
  "content": "Thailand and Cambodia’s leaders agreed to an “unconditional” ceasefire on Monday, after five days of combat along their jungle-clad frontier that has killed at least 36 people.\n\nMore than 200,000 people have fled as the two sides fired artillery, rockets and guns in a battle over the long-disputed area, which is home to a smattering of ancient temples.\n\nThe flare-up was the deadliest since violence raged sporadically from 2008-2011 over the territory, claimed by both sides because of a vague demarcation made by Cambodia’s French colonial administrators in 1907.\n\nReading a joint statement from the leaders of both countries after peace talks, Malaysian Prime Minister Anwar Ibrahim said they had agreed “an immediate and unconditional ceasefire” with effect from midnight on Monday (10pm PKT).\n\n“This is a vital first step towards de-escalation and the restoration of peace and security,” he said at a press conference in Malaysia’s administrative capital Putrajaya, flanked by Thai acting PM Phumtham Wechayachai and Cambodia’s PM Hun Manet.\n\nAnwar said a meeting of military commanders from both sides would take place on Tuesday morning, before the countries’ cross-border committee would meet in Cambodia on August 4.\n\nAs the deal was being announced, an AFP journalist in the Cambodian city of Samraong — 17 kilometres from the fraught frontier — reported hearing continuing artillery blasts.\n\nUS President Donald Trump — who both nations are courting for trade deals to avert the threat of eye-watering tariffs — intervened over the weekend, and said both sides had agreed to “quickly work out” a truce.\n\n“Today we had a very good meeting and very good results,” said Cambodia’s Hun Manet, thanking Trump for his “decisive” support and saying the truce would serve as “a foundation for future de-escalation”.\n\nAhead of the summit, Thailand and Cambodia had traded fresh fire and barbed accusations.\n\nCambodia’s defence ministry spokeswoman Maly Socheata said it was “the fifth day that Thailand has invaded Cambodia’s territory with heavy weapons and with the deployment of a lot of troops”.\n\nAs he departed Bangkok airport, Phumtham told reporters he did not believe Cambodia was “acting in good faith”.\n\nAfter the talks hosted by Anwar — chair of the ASEAN bloc of which both Thailand and Cambodia are members — Phumtham called for the truce to be “carried out in good faith by both sides”.\n\n“Thailand decides for peaceful resolution, while continuing to protect our sovereignty and the lives of our people,” he said.\n\nOn the eve of the talks, Thailand’s military said Cambodian snipers were camped in one of the contested temples, and accused Phnom Penh of surging troops along the border and hammering Thai territory with rockets.\n\nIt said there was fighting at seven areas in the rural region, marked by a ridge of hills surrounded by wild jungle and fields where locals farm rubber and rice.\n\n“The situation remains highly tense, and it is anticipated that Cambodia may be preparing for a major military operation prior to entering negotiations,” the Thai military statement read.\n\nThai King Maha Vajiralongkorn marked his 73rd birthday on Monday, but a notice in the country’s Royal Gazette said his public celebrations scheduled for Bangkok’s Grand Palace had been cancelled amid the strife.\n\nTrump has threatened both countries with high levies in his global tariff blitz unless they agree to independent trade deals — but said he would “look forward” to signing them once “peace is at hand”.\n\nEach side had already agreed to a truce in principle, while accusing the other of undermining peace efforts and trading allegations about the use of cluster bombs and targeting of hospitals.\n\nThailand says nine of its soldiers and 14 civilians have been killed, while Cambodia has confirmed eight civilian and five military deaths.\n\nThe Thai military said it had returned the bodies of 12 Cambodian soldiers killed in combat.\n\nMore than 138,000 people have fled Thailand’s border regions, while around 140,000 have been driven from their homes in Cambodia.\n\nWith the skirmish enflaming nationalist sentiments, Thailand warned its citizens to “refrain from any kind of violence, whether in speech or action” against Cambodian migrants living in the country.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2817564408cdc2a.jpg",
  "retrievedAt": "2025-08-17T21:31:25.702Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927128/thailand-and-cambodia-agree-truce-after-5-days-of-fighting",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T06:57:16.000Z"
}
