{
  "title": "Greenback — a safe haven no more? - Business - DAWN.COM",
  "author": null,
  "content": "AFTER suffering its steepest first-half-year decline in 50 years, the US dollar managed to recover a touch in July — but not before its repute as a global safe-haven currency had taken a significant hit.\n\nDespite a slight improvement in the US dollar index, the markets continue to discount an early recovery of the greenback.\n\nThe dollar index had initially dropped 10.8 per cent against a basket of major global currencies during the period between January and July — its lowest since 1973, when President Richard Nixon detached the dollar’s value from gold.\n\nThis time around analysts have linked the slump to President Donald Trump’s “chaotic” economic policies — tariff wars, swelling fiscal deficits and debt growth, and interference in Federal Reserve policy to force it to lower the interest rates — that have prompted global investors to sell their greenback holdings.\n\nThe depreciation of the US dollar index in 2025 is significant and reflects the broader panic in financial markets around US debt sustainability, argues Ahmed Jamal Pirzada, senior lecturer in economics at the University of Bristol. “While developed countries like the US are not expected to default in the traditional sense of the word, there are growing concerns that the government may undermine central bank independence and attempt to stabilise debt through inflation.\n\nThe recent bill making the 2017 tax cuts permanent and Trump’s statement on what the Fed [Federal Reserve] should be doing substantiate some of these concerns. The tax cuts are expected to cost $4.5 trillion over the next 10 years. In contrast, the savings proposed in the bill only amount to $1.7tr. The gap is equivalent to 11pc of the US GDP.“\n\nK-Trade Securities chairman Ali Farid Khwaja observes that the US has moved from a policy where it played a role in stabilising the global economy to a US-centred one. “The aim is to move manufacturing back to the US. This is deglobalisation on steroids. Indeed, this would not only damage the long-term position of the dollar but also force other countries to develop new economic relationships.”\n\nAfter years of dominance, only 23pc of global fund managers now prefer US stocks following Trump’s ‘chaotic’ economic policies\n\nThe situation is also made worse due to the central banks reversing the policies like quantitative easing, which remained in place for more than a decade since the 2008 global financial crisis.\n\nTrump’s trade wars and unpredictable policymaking have sharply turned investor sentiment, shaking trust in the greenback’s safe-haven status. A Bank of America survey shows that only 23pc of global fund managers now prefer US stocks — down from years of dominance, with foreign investors cutting exposure to American equities and bonds, pushing the dollar lower as they convert holdings into other currencies.\n\nThe dollar’s weakness is boosting other markets. Gold — the ultimate hedge — has surged, with hedge funds and central banks piling into the metal amid dollar volatility. Meanwhile, cryptocurrencies like Bitcoin have staged a moderate rally, riding on the back of distrust in fiat currencies. European stocks are rallying. The euro has also made considerable gains. This shows that markets are concerned about the US policy direction under President Trump’s second term.\n\nCentral banks and sovereign wealth funds are voting with their portfolios, international media reports suggest. The euro and Chinese renminbi have gained ground not just in foreign exchange markets but also in central bank reserves. For the first time in three decades, the dollar’s share of global reserves has dipped below 58pc, according to International Monetary Fund data, as the credibility premium the dollar enjoyed is eroding.\n\nMr Pirzada argues that while the situation is extraordinary, it is still hard to imagine the US dollar getting dethroned and losing its reserve currency status anytime soon.\n\n“For context, the US dollar index fell from the highs of 120 at the start of 21st century to around 80 by the late 2000s. The dethroning will not only take a bigger crisis that persists for much longer but will also require a significant improvement in the trust financial markets are willing to put in the institutions and the long-term economic prospects of the alternate candidates out there.”\n\nSome regional experts, like Dr Mehmood-Ul-Hassan Khan, the executive director at the Centre for South Asia and International Studies, feel that the decline of the US dollar index indicates serious structural concerns over the American economy and erosion of investor confidence in its future. “The dollar slump stems from worries over Trump’s economic and tariff policies. It is feared that the recently passed One Big Beautiful Fiscal Bill will further increase the US debts, diminishing fiscal sustainability and confidence in the American economy.”\n\nFurthermore, he believes that countries around the world are diversifying their reserves away from the dollar, trading in their own currencies, and working to develop alternative international payment clearing systems to counter the potential consequences of the US policies as well as its weaponisation of tariffs and sanctions. “You cannot rule out a new financial, payment, and clearing system by the Brics countries [Brazil, Russia, India, China, and South Africa] in the near future to counter the negative implications of Trump’s policies.”\n\nNow, what are the potential implications of a weakened dollar for Pakistan? Mr Khan argues that the short- to long-term weakness of the dollar index will suit Pakistan’s economy by reducing its import bill, easing debt servicing, and boosting its competitiveness. Besides, it should help stabilise the country’s exchange rate.\n\nTrade economist Adil Nakhuda sees an opportunity to increase Pakistan’s exports to the European Union, as the appreciation in the value of the euro and pound sterling would make us more competitive in those markets.\n\nMr Khwaja points out that the US is Pakistan’s biggest market, and while “our exports are relatively small, the redesign of trading patterns would also significantly impact us”. He thinks that, like other countries, Pakistan would need to find new markets.\n\n“I fear the transition will be chaotic and gold prices will go up even more. While countries might attempt to develop alternative settlement methods, such a policy would get a direct attack from the US.”\n\nPublished in Dawn, The Business and Finance Weekly, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:33:12.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927015/greenback-a-safe-haven-no-more",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:05:41.000Z"
}
