{
  "title": "Finance minister heads to US for final trade negotiations - Pakistan - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb has departed for the United States to engage in high-level negotiations aimed at concluding the Pakistan–US trade dialogue, the finance ministry announced in a press release on Monday.\n\nAuran­gzeb and US Trade Representative Jami­eson Greer launched the negotiations through a telephonic conference call on reciprocal tariffs in May, agreeing to get into technical discussions in the coming weeks. The talks began after the US proposed a 29 per cent duty on Pakistani exports and later temporarily suspended the decision.\n\nBy July, talks in Washington had entered their final phase. Aurangzeb described the dialogue as “very constructive,” emphasising a shared commitment to resolving outstanding issues and moving toward finalising a broad economic framework.\n\nDuring this visit, the finance minister will lead concluding discussions with senior US officials including Commerce Secretary Howard Lutnick and Trade Representative Greer.\n\n“The aim is to formalise a comprehensive trade agreement expected to yield mutual economic benefits for both nations,” the statement read.\n\nThe finance ministry highlighted that robust trade and economic ties remained the backbone of Pak-US ties.\n\nIt noted that the US is still Pakistan’s largest trading partner.\n\n“Pakistan is eager to expand cooperation into non-traditional sectors such as information technology, agriculture, and minerals — all offering significant growth potential,” it added.\n\nIt concluded that Pakistan seeks to boost bilateral trade beyond traditional goods by encouraging US investment in critical sectors, including energy and mining.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/03104337de27af1.jpg?r=104621",
  "retrievedAt": "2025-08-17T21:30:20.170Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927204/finance-minister-heads-to-us-for-final-trade-negotiations",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T17:37:40.000Z"
}
