{
  "title": "Pricing electricity correctly - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S electricity sector stands at a critical inflection point. While the country has amassed more than enough generation capacity to meet its needs, our tariff structure, following an archaic International Monetary Fund (IMF) driven cost-plus regime, continues to punish demand rather than enable it.\n\nThe result is a grid increasingly starved of industrial users, while factories defect to off-grid solutions at scale. This is not just a power sector issue; it is an industrial crisis that is spiralling into a low-growth trap for Pakistan. A macroeconomic focus for maintaining balance of payments is great, but losing sight of the forest for the trees may have disastrous consequences for the country’s population.\n\nElectricity, when priced competitively, is a catalyst for economic expansion. When overpriced, it becomes a tax on production and employment. Pakistan has, unfortunately, drifted into the latter category, and any attempt to escape the abyss fails, because for a hammer everything is a nail.\n\nPakistan’s industrial power tariffs are among the highest in Asia, hovering around 13-15 cents. In contrast, India charges closer to 12 cents, Bangladesh 9 cents, and Vietnam just 8 cents. Malaysia, a long-standing industrial magnet, offers electricity at a meagre 4 cents per unit. It’s no surprise that investors favour locations where energy costs don’t break the business model.\n\nPakistan must pivot from a supply-centric mindset to a demand-led decentralised policy\n\nEurope’s experience during the 2021–2023 energy crisis echoes this trend, wherein soaring prices led to factory closures and deindustrialisation. Germany alone spent nearly 4 per cent of its GDP subsidising power for users — an unsustainable stopgap. The lesson is clear that without affordable energy, industry cannot survive.\n\nPakistan has a surplus generation capacity of 46,605 MW, yet average utilisation remains under 35pc. Peak demand seldom exceeds 30,000 MW, and off-peak demand can fall below 8,000 MW.\n\nDespite this, the system pays nearly Rs 1.9 trillion annually in fixed capacity payments, costs ultimately passed on to the consumer. If the grid inadvertently fails due to consumer defections, the same cost would be borne by the taxpayer (or lack of), creating yet another macroeconomic crisis.\n\nThe impact is visible. In FY24, industrial consumption fell by 10pc, even though there was no supply shortage. Instead, the high cost of electricity pushed industry into solar self-generation and forced a contraction in output.\n\nDriven by high tariffs and unreliable grid supply, industrial users and farmers have turned en masse to solar, or even bio-mass, kicking off a behind-the-meter (BTM) revolution. Pakistan now has an estimated 22 GW of BTM solar capacity, mostly off-grid and invisible to electricity distribution companies.\n\nThis has created a massive “noon demand hole” in the grid, with some 2.5 GW of load disappearing during daylight hours, creating a duck curve in the process.\n\nBattery storage is also accelerating. Pakistan imported an estimated 1.65 GWh of lithium-ion storage in early 2025 and is expected to unlock 8.75 GW of total dispatchable energy by 2030. Consumers are finding their own solutions. If the grid continues to price itself out of relevance, it risks becoming a stranded asset.\n\nAt the core of the problem is Pakistan’s outdated cost-plus tariff system, designed to recover costs rather than stimulate future demand. The solution lies in marginal pricing.\n\nAs of May 2025, the system’s marginal generation cost — the cost of producing one extra unit — was around Rs17–18/kWh (and up to Rs 22/kWh during peak hours). This is far below what industries currently pay. If even part of Pakistan’s surplus were sold at, say, Rs 25/kWh, for incremental power, it would be a win-win: factories would return to the grid, and utilities would improve their recovery of fixed costs.\n\nSuch reforms are not unprecedented. Countries like Vietnam and China have successfully deployed marginal or time-of-use tariffs to support industrial clusters and export industries.\n\nWhat is needed is a shift to a two-part tariff system, one that includes a capacity subscription charge to cover network costs, and a marginal energy charge that can be locked to real-time or average system costs.\n\nThis model ensures utilities recover their investment while offering industry the flexibility to expand usage based on affordable price signals. It also allows for the rationalisation of harmful cross-subsidies, where commercial and industrial users are unfairly burdened to finance residential and agricultural subsidies.\n\nPolicy must acknowledge that solar and batteries are here to stay. Instead of resisting this trend, Pakistan should integrate them into its planning and grid operations. This includes time-of-use net metering, to encourage solar exports during peak hours, peer-to-peer energy trading within industrial zones and estates, grid-scale battery programmes where consumers are rewarded for reducing peak demand, and microgrids in rural areas that connect solar tube wells as well as and small businesses.\n\nIt is estimated that almost 900 MW of decentralised solar exists in rural areas, which have scant to no supply of electricity, while almost 3,000 MW of tubewells have been solarised, moving away from the grid and diesel. The future is decentralised, and policies should also capture the same. These steps can turn the solar ‘threat’ into a stabilising force that enhances grid reliability during periods of volatility and lowers system-wide costs.\n\nAffordable electricity can also be a driver of new demand. With the right tariff systems in place, Pakistan can electrify industrial processes, attract new sectors (eg data centres), and expand electric transport.\n\nPakistan imports more than $15 billion of fuel every year, of which almost $10bn is used for transportation. There exists a strong case for electrification of transport — and that can only be done through a systems-wide approach, rather than operating in silos.\n\nEven agriculture, which is turning to solar pumps, could be reconnected to the grid through solar-grid hybrids that provide backup during non-sunny hours — if priced appropriately.\n\nPricing marginal industrial consumption alone at Rs22/kWh could drive an increase of around 6.6 GWh in new sales per day, equivalent to roughly 275 MW, even under current circumstances, while providing a signal to the market for more capital investments. That’s GDP growth waiting to happen, with power capacity already in place.\n\nPakistan must pivot from a supply-centric mindset to a demand-led decentralised electricity policy. We must treat electricity not as a sunk cost to be recovered, but as a growth enabler to be priced intelligently.\n\nThe current trajectory, high tariffs, suppressed demand, and growing off-grid defection, is unsustainable. What’s needed is bold, coordinated reform, consisting of marginal pricing, capacity-based subscriptions, solar integration, and targeted electrification.\n\nElectricity, priced right, can reindustrialise Pakistan. But if we fail to reform now, we risk turning our most abundant resource, surplus power, into a national liability, instead of the economic engine it was meant to be. The cost of such a national liability will be paid by all taxpayers, and create a macroeconomic crisis like no other, seeding foundations for yet another lost decade for economic growth.\n\nAmmar H Khan is an assistant professor of practice at IBA, member of the Thar Coal Energy Board, CEO, NCGCL and Shahmir Khan is an analyst at NCGCL\n\nPublished in Dawn, The Business and Finance Weekly, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:31:29.271Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927016",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:05:41.000Z"
}
