{
  "title": "Leopard mauls teenage boy a day after killing girl in AJK’s Jhelum Valley - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: A teenage boy narrowly escaped death on Sunday afternoon when a leopard attacked him in Nalai Dabra’n, a border village in Azad Jammu and Kashmir’s (AJK) Jhelum Valley district — less than 24 hours after the same predator had mauled an eight-year-old girl to death in the same locality.\n\nThe boy, identified as Mudassir Ali Awan, a student of 10thgrade, was returning home after attending the funeral prayers of the deceased girl when the big cat pounced on him. In a desperate attempt to save his life, he cried for help and tried to fight off the predator. His shouts alerted nearby villagers who rushed to the scene, making loud noises and attacking the leopard with sticks and stones, eventually forcing it to flee back into the forest.\n\nAlthough the teenager sustained only minor injuries and scratches, his clothes were torn in the terrifying encounter, which has sent shockwaves through the small mountainous community.\n\n“It’s a miracle that he survived. Had the villagers not been nearby, the consequences could have been catastrophic,” Naseer Awan, a resident of Nalai Dabra’n, who was present on the occasion, told Dawn by telephone.\n\nA day earlier, the same leopard had snatched a minor girl from her home’s courtyard and dragged her into the nearby forest, where her mutilated body was found hours later.\n\nThe tragic death of the young girl has sparked anger and fear among the villagers, who said the authorities had failed to respond adequately despite repeated incidents involving wild animals in human settlements.\n\n“The Wildlife Department and the district administration did not take any action even after a child was killed,” lamented Mr Awan. “We are now living in constant fear. The government must either catch or relocate this leopard before more lives are lost.”\n\nOn July 24, local journalists had also sounded the alarm on social media, warning of the leopard’s increasing presence in human-populated areas and calling for urgent intervention — but to no avail.\n\nFormer AJK Prime Minister Raja Farooq Haider also expressed grave concern over the incident, warning that the unchecked rise in the leopard population posed a growing threat to human life in the region.\n\n“Yesterday’s incident reflects an extremely alarming situation,” he said. “While the preservation of wildlife is important, it cannot come at the cost of human lives. There is nothing more precious than a human life.”\n\nMr Haider urged the Wildlife Department to consider relocating or exporting the increasing number of leopards from populated areas. “If people begin killing them in self-defence, they cannot be blamed,” he remarked.\n\nHe also offered condolences to the bereaved family and urged the government to offer them compensation. “Special preventive measures must be taken immediately in this and other vulnerable regions to protect children and ensure such tragedies are not repeated,” he added.\n\nEfforts to reach officials from the Wildlife Department for comment remained unsuccessful.\n\nThe incidents underscore a growing pattern of human-wildlife conflict in AJK, particularly in forested and hilly areas where shrinking habitats have pushed wild animals closer to human settlements.\n\nWildlife experts and local communities have repeatedly called for a sustainable management plan to address the issue, but action on the ground remains limited and reactive — mainly due to scant fiscal and human resources allocated to the Wildlife Department.\n\nPublished in Dawn, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/271056280832d51.jpg?r=111229",
  "retrievedAt": "2025-08-17T21:32:13.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926995/leopard-mauls-teenage-boy-a-day-after-killing-girl-in-ajks-jhelum-valley",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:06:09.000Z"
}
