{
  "title": "Space for informal economy - Business - DAWN.COM",
  "author": null,
  "content": "THE national debate on the informal economy has acquired a new dimension given the views on its role in the country’s economy by two experts.\n\n“In Pakistan, the informal sector is not an aberration. It is the economy’s lifeboat. Where the formal economy is hamstrung by high entry barriers and stifling compliance costs, the informal economy is nimble, responsive, and inclusive,” writes Nadeem ul Haque, former deputy chairman of the Planning Commission, and Shahid Kardar, former State Bank governor, in their recent joint article titled ‘In defence of the informal economy’.\n\nWith estimates ranging from 30-70 per cent of GDP and over 70pc of non-agricultural employment, informality underpins the real economy, they stated. The informal entrepreneurs are often more innovative, dynamic, and risk-tolerant than their formal counterparts. They operate without subsidies, navigate unruliness without protection, and finance their ventures through personal savings.“\n\nEven the formal sector, particularly the textile industry, it may be added here, depends on the informal sector to cut costs and achieve a competitive edge.\n\nThe state would do better to learn from the presently growing informal economy rather than simply crushing it\n\n“If the idea of Pakistan is to become a modern democratic welfare state, then we must carefully view the subject of public opinion both from top-down and bottom-up perspectives,” says Muhammad Ehsan Ali, a non-resident research fellow in the research and analysis department of the Islamabad Policy Research Institute.\n\nMr Ali recalls a famous statement by Robert Cecil, a winner of the Nobel Peace Prize in 1937 for his efforts in international diplomacy and peace, who said, “The great weapon we rely upon is public opinion, and if we are wrong about it, then the whole thing is wrong. The freedom to speak is not just the right to talk, but it is the power to question, to challenge, and to change.”\n\nIn Pakistan, one can witness various segments of the population struggling to achieve a better quality of life. To quote a few examples, labourers want living wages, not just minimum wages. Underpaid women want more jobs with compensation equal to that paid to men. Domestic servants want better working conditions and decent salaries.\n\nEven the formal sector, particularly the textile industry, it may be added here, depends on the informal sector to cut costs and achieve a competitive edge\n\nPrime Minister Shehbaz Sharif has stressed the need to align the country’s civil service with modern technology and international standards of public service, emphasising its revitalisation to enhance effectiveness. He was presiding over a meeting on civil service reforms.\n\nCalling the comprehensive and effective reform of the civil service a government priority, the prime minister directed the inclusion of input from public representatives and those of government officials in administrative and institutional reforms of the civil service. Briefing the prime minister, Federal Minister for Planning Ahsan Iqbal said there was significant room for improvement in the current system of recruitment, promotion, training, and capacity building of government officials.\n\nWhile the long-awaited civil service reforms would be a welcome move, it is not clear how they would tackle the problematic status quo. To quote Dr Farrukh Saleem, “We continue to operate within a framework that exploits the many for the benefit of the few.”\n\n“Whether under elected governments, military rule, or hybrid regimes, the core fundamentals have remained stubbornly unchanged.” In an article in a daily newspaper, Dr Saleem stresses that the status quo needs to be ‘dismantled’.\n\nAnd to paraphrase Mr Haque and Mr Kardar’s earlier piece, “In countries where the state apparatus is extractive, regulatory structures are punitive, and public services are lacking, the informal economy does not shrink; it thrives. People will formalise when the state earns their trust. Until that happens, informal markets will remain the true face of Pakistan’s economy. Informality is a verdict.”\n\nThey recall how Peruvian economist Hernando de Soto once put it, “Informality is the people’s spontaneous and creative reaction to the obstacles that the state places in their way.” The writers elaborate the idea as a rational, often brilliant, response to institutional failure. Rather than crush it, the state should learn from it.\n\nExercising their right to self-determination, job-hopping has become a common phenomenon in the domestic market. Professionals, skilled workers and unskilled labour, the educated youth etc, prefer to seek employment abroad to improve their own and their family’s quality of life. Remittances from overseas Pakistanis are helping finance trade deficits and produce current account surpluses. A major share of the increase in federal income tax is contributed by the middle class.\n\nAmong the causes of the current faltering phase of globalisation is its failure to reduce growing economic disparity among and within nations.\n\nThe country needs an egalitarian socio-economic model and right-sizing of government apparatus, centralisation based on democracy with a bottom-up approach with people empowered at various levels to improve their quality of life, step by step, by themselves.\n\nPublished in Dawn, The Business and Finance Weekly, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:31:56.599Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927106/space-for-informal-economy",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T02:03:23.000Z"
}
