{
  "title": "Man kills mother-in-law, injures wife over domestic dispute in Toba Tek Singh - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: A man allegedly murdered his mother-in-law and injured his wife over a domestic dispute in Ranjana Chak 186 GB on Sunday.\n\nRescue 1122 and police reports said that accused Muhammad Yasin went to the house of his in-laws for reconciliation with his wife. However, his wife refused to go back with him over which he allegedly opened indiscriminate fire. As a result, his mother-in-law Khursheed Bibi (75) and wife Rukhsana Bibi (40) were injured.\n\nLater, his mother-in-law succumbed to her injuries on the spot, while his wife was shifted to the DHQ hospital and referred to the Faisalabad Allied Hospital.\n\nMeanwhile, a woman was allegedly strangled to death in Chak 6 JB Faisalabad. Complainant Umar Hayat informed the Nishatabad police that his wife Daulat Bibi (45) was asleep at the outhouse when he was away working in the fields. He claimed that unidentified accused strangled her with a cloth.\n\nSENTENCE: Faisalabad District and Sessions Judge Abdul Raheem sentenced a man to death on two counts and fined him Rs2 million in a double murder case on Saturday.\n\nThe Dijkot police arrested Shoukat Ali four years ago for murdering his wife Sumera Bibi and her paramour Zeeshan Ahmad for honour.\n\nARRESTED: The Mamukanjan police of Tandlianwala tehsil, Faisalabad on Saturday night arrested a tailor for allegedly raping, blackmailing and extorting a woman.\n\nIn the FIR, the victim’s husband said that his wife disclosed that her tailor had allegedly forcibly raped her some time ago and made a video of the incident. The suspect had demanded Rs500,000 for deleting the video but she was able to give him only Rs10,000. However, after taking the money, he continued to blackmail her and repeatedly raped her. He claimed that when she refused to pay money, he uploaded the video on social media.\n\nPolice said the police had arrested the accused and seized his mobile phone.\n\nACCIDENT: A man died and another was injured when a trailer hit a mini truck on Sunday near Qasim Bagh, Khanewal due to over-speeding.\n\nThe deceased was identified as mini truck driver Aurangzeb (31) and the injured as his helper Muhammad Umar (25). He was shifted to the Khanewal DHQ hospital.\n\nATTACKED: The Faisalabad Khurrianwala police booked 31 persons, including 16 nominated, for attacking revenue department officials and restraining them from retrieving the state land in Chak 76 RB.\n\nIn his complaint, revenue department qanoongo Bahadur Ali claimed that the land grabbers, including eight nominated men and as many women, attacked the team.\n\nPolice registered the FIR and made some arrests.\n\nPublished in Dawn, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:33:13.679Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927068/man-kills-mother-in-law-injures-wife-over-domestic-dispute-in-toba-tek-singh",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:05:36.000Z"
}
