{
  "title": "Babusar Highway partially reopened as search operations continue in GB - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Babusar Highway was partially reopened on Monday as the search for missing people continued after heavy rains last week prompted flash floods in Gilgit-Baltistan.\n\nThe devastating impacts of climate change have become more visible in GB as unprecedented heat­­waves, erratic weat­her patterns and glacial melting have triggered cloudbursts and intense floods across the region.\n\nOn July 21, floods swept across GB, causing landslides and leaving many stranded, and damaging more than 500 houses, roads and other infrastructure. At least 10 people died and four were injured as a result.\n\nIn a statement today, GB government spokesperson Faizullah Faraq said: “The Babusar-Naran Highway has been reopened for one-way traffic.”\n\nHe noted that heavy machinery was used to reopen it, while work for complete restoration was underway. He also advised passengers to be cautious and avoid unnecessary travel.\n\nFaraq further said, “Several families, including five members of a TV anchor’s family, have contacted the government about the missing people and appealed for help in the search.”\n\nThe wallet of the TV anchor Shabana Liaquat was found among the flood debris, which also included her and her child’s student cards, he added.\n\n“The provincial government has enlisted the help of Pakistan Army sniffer dogs to search for those buried under the rubble,” the spokesperson said.\n\nSeparately, the National Highway Authority (NHA) initiated swift road restoration operations in northern areas after orders by Minister for Communications Abdul Aleem Khan, APP reported.\n\nAleem said that key highways, including the Mansehra-Naran-Jalkhad (N-15) and Skardu-Jaglot Road, were blocked due to landslides and cloudburst. “NHA teams have cleared multiple obstruction points, ensuring partial restoration of traffic and improved accessibility for travellers,” he said.\n\nThe minister described the 242-kilometre-long N-15 as a “critical route for tourism and regional connectivity”, which was blocked at various locations.\n\nAccording to officials, landslides along the route were successfully cleared, while restoration work from Naran to Babusar Top and Chilas was ongoing, he added.\n\nCommunication Secretary Ali Sher Mehsud and NHA chairman were present on-site to oversee the restoration activities, the report said.\n\n“We are committed to restoring all major highways at the earliest,” Mehsud said, adding that travel towards Kaghan and Naran had resumed.\n\nNHA managed to clear 20 out of 25 landslide-affected points on the Skardu-Jaglot Road.\n\n“To maintain pace, NHA has placed all field officers on 24-hour alert, cancelled staff leave and activated its emergency response plan across Gilgit-Baltistan. Heavy machinery remains operational across the region to tackle any further disruptions,” the report added.\n\nSeparately, the National Disaster Management Authority issued an alert for the northern areas of the country, predicting rainfall from July 28 to 31 and warning about risks of urban flooding, glacial surges and landslides, APP reported.\n\nIt advised citizens to avoid travelling to vulnerable areas and directed authorities to remain alert in case of an emergency.\n\nAccording to the National Emergencies Operation Centre (NEOC), rain was expected in Gilgit, Skardu, Hunza, and Shigar areas of GB, as well as in Muzaffarabad, Neelum Valley, and Bagh in Azad Jammu and Kashmir during the forecast period.\n\n“These rains may lead to flooding, while heavy showers in hilly regions may also trigger landslides,” it stated.\n\nIn Chitral Valley, Buni and Reshun areas, rainfall combined with melting glaciers may raise the water flow of River Chitral, according to NEOC. “Urban flooding is also likely in Muzaffarabad and Bagh due to heavy downpours,” it added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/28135856a0c340d.jpg",
  "retrievedAt": "2025-08-17T21:31:16.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927139/babusar-highway-partially-reopened-as-search-operations-continue-in-gb",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T09:39:23.000Z"
}
