{
  "title": "Brawls between lawmakers throw Punjab Assembly into chaos - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Punjab Assembly session on Monday was thrown into chaos when two brawls erupted between lawmakers, leading to the suspension of a Member of the Provincial Assembly (MPA), according to a Dawn.com correspondent present at the scene.\n\nEarlier today, opposition member Khalid Nisar Dogar struck ruling PML-N’s Hasan Riaz during the session, before the two were separated by other lawmakers. Footage of the incident has since gone viral.\n\nActing speaker Zaheer Iqbal Channar called the altercation “highly inappropriate”.\n\nAccording to the correspondent, the session was adjourned until 2pm on Tuesday by Channar, who summoned government and opposition MPAs to his chambers. He suspended Dogar for 15 sessions under Rule 210 (power to order withdrawal of members or suspend sitting) of the Rules of Procedure of the Provincial Assembly of Punjab, 1997.\n\nSpeaking to reporters following the fracas, Riaz called it “a dark day”.\n\n“I was addressing the speaker, but an opposition lawmaker was hurling insults at me,” he said. “When I saw him, he came and attacked me. These people have no control over themselves; they’ve been the same since May 9 [riots in 2023].”\n\nAnother altercation later erupted in the assembly’s press hall, where a government MPA’s staff members reportedly hurled insults at opposition lawmakers.\n\nAs a result, opposition MPAs Sardar Mohammad Ali Khan and Muhammad Ejaz Shafi also hurled abuse as both sides came face-to-face again. However, security personnel arrived at the press hall and separated both groups of lawmakers.\n\nVideo footage recorded in the press hall shows Khan and Shafi claiming that two people came and hurled abuse at their fellow lawmakers before leaving the press hall.\n\n“They insulted our MPA,” Khan emphasised. “You all witnessed that two miscreants abused an honourable member. If you do not raise your voices, this will happen to you too.”\n\nThis is not the first time that unruly behaviour has been seen in the Punjab Assembly.\n\nIn June, Punjab Assembly Speaker Malik Muhammad Ahmad Khan ordered the suspension of 26 opposition MPAs for 15 sittings after their protests disrupted the proceedings as Chief Minister Maryam Nawaz Sharif was presenting the budget.\n\nAccording to an order issued by Malik on June 27, the suspended MPAs “became disorderly, beyond all parliamentary reasoning and practices”, including tearing the agenda papers and hurling torn pieces towards the treasury benches as well as using “offensive, abusive, and unparliamentary language and slogans”.\n\nThe order was issued under Rule 210 of the Punjab Assembly Rules of Procedure, 1997.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/28223034a9c94f8.png",
  "retrievedAt": "2025-08-17T21:30:20.909Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927205/brawls-between-lawmakers-throw-punjab-assembly-into-chaos",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T18:16:09.000Z"
}
