{
  "title": "Jaffar Express derailed by explosion near Shikarpur - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three coaches of the Jaffar Express train were derailed near Shikarpur in Sindh due to an explosion on Monday, leaving one injured, The Associated Press of Pakistan reported.\n\nAccording to the report, rescue teams from Sukkur were dispatched to start repair work after the incident.\n\nSukkur Railways Divisional Superintendent Jamshaid Alam said that the Jaffar Express was travelling from Peshawar to Quetta when it was caught in the explosion near Sultanpur.\n\n“Following the blast, train operations have been suspended,” Alam said, adding that passengers “faced serious difficulties due to the train’s derailment”.\n\nRailways officials stated that it may take up to another five hours to restore the track.\n\nMeanwhile, the Sindh government authorities have taken notice of the explosion on the track and ordered an investigation.\n\nThis is not the first time the train service has been attacked.\n\nIn June, the detonation of a remote-controlled explosive device fitted to rail tracks derailed four bogies of the Jaffar Express near the cattle market in Jacobabad.\n\nNo one was hurt in the incident, but the attack was reportedly claimed by the banned Baloch Repu­blican Guards in a statement.\n\nOn March 11, the train became the target of an unprecedented hijacking, when terrorists fired on the locomotive and took over 400 passengers hostage.\n\nMedia reports said that security forces had surrounded the area and launched a clearance operation to rescue all passengers. Radio Pakistan reported that security forces had rescued 80 hostages held by the terrorists.\n\nInter-Services Public Relations Director General Lt Gen Ahmed Sharif Chaudhry said on March 12 that the clearance operation, launched after the train’s unprecedented hijacking in Balochistan, ended with all 33 terrorists being killed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/684b66c823782.jpg",
  "retrievedAt": "2025-08-17T21:30:47.555Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927185/jaffar-express-derailed-by-explosion-near-shikarpur",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T13:17:46.000Z"
}
