{
  "title": "Fact check: Viral video of firing on demonstrators is not from KP’s Tirah Valley but July 2024 Bannu rally violence - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users and politicians on social media platform X on Sunday shared a video of children ducking to the ground as firing could be heard in the background, claiming it was footage from firing on demonstrators in Khyber Pakhtunkhwa’s Tirah Valley. However, the video was shared as far back as July 2024 when demonstrators at a Bannu peace rally were fired upon.\n\nA day ago, seven people were shot after a protest outside a military installation in Tirah took a violent turn. Hundreds of tribesmen had brought the body of a girl, who they claimed was killed in a mortar strike in the Darbar locality of Peer Mela in Zakhakhel a day earlier, to the Brigade Headquarters in Bagh-Maidan Markaz.\n\nThe situation turned violent when an angry mob, comprising mostly young men, ignored calls by local elders to remain calm. They first torched an excavator parked outside Brigade Headquarters, and then tried to force open the garrison’s main gate. Security personnel guar­ding the installation reportedly opened fire to control the crowd.\n\nThere was no official statement from the local administration or the military about the mortar strike or the deaths.\n\nOn Sunday, PTI KP President Junaid Akbar shared a video on X featuring a group of people, including children, ducking to the ground as firing could be heard in the background.\n\nThe caption of the post read: “During the peace march in Tirah Valley, as a result of firing on unarmed tribal elders, youths, and innocent children, seven innocent individuals, including children, were martyred, and several others were injured. No religion, state, or law permits the killing of innocent children even during war. Consider and reflect: will this act of the state reduce or increase terrorism? Do the rulers have any sense of awareness? To what extent are the distances growing between the Pashtuns, bullets, and the state?”\n\nThe video, shared at 4:10pm, gained 203,700 views.\n\nThe video with the same claim was also shared by Qasim Khan Suri, former deputy speaker of the National Assembly, on Instagram with the caption: “These are not visuals from Gaza but from Tirah Valley of Khyber Pakhtunkhwa … innocent Pakistanis are being targeted for minerals worth Rs8 billion.”\n\nThe post was viewed over 79,000 times and gained over 5,000 reactions.\n\nFormer human rights minister Shireen Mazari also shared the video on X with the caption: “Where is KP govt and KP chief minister? This is on your watch.”\n\nThe post was viewed over 70,000 times.\n\nThe video was also shared by former anchor Imran Riaz Khan, PTI leaders Mirza Shahzad Akbar and Amir Mughal, and other social media users as seen here, here, here and here, racking up over 900,000 views collectively.\n\nThe clip was also shared by an Indian propaganda account, gathering nearly 10,000 views.\n\nA fact-check was initiated to determine the veracity of the claim due to its high virality, keen public interest in the evolving situation in Tirah Valley and to address the potential harmful impact of such videos.\n\nInvestigating the social media posts that shared the video showed comments from users who flagged the clip as being old.\n\nOne X user provided a screenshot of a post featuring the same video, which was dated July 2024 and shared with the hashtag “Bannu Peace March”.\n\nAkbar, who shared the video on his X account at 8:39pm, also later at night clarified that the clip was from Bannu.\n\nA keyword search for “Bannu Peace March” and “NCRC” to corroborate the responses in the comments yielded the same video shared on X by a local news outlet focusing on Pakhtun rights, on July 23, 2024, with the caption: “A viral video on social media showed children participating in a peace protest in Bannu last Friday where the Pakistan army opened a straight fire, killing a young man and injuring 27, including several kids.”\n\nThe authenticity of the video could not be confirmed because it was not shared elsewhere or by any credible media outlets.\n\nHowever, a keyword search to corroborate the post’s caption led to a news article by Dawn published on July 20, 2024, titled: “One killed, scores hurt as violence mars Bannu rally”.\n\nAs per the report, one person was killed and over a dozen others were injured in Bannu city when gunfire caused a stampede at a peace rally, attended by thousands demanding security in the region.\n\nQuoting eyewitnesses, the report stated that tensions escalated when the crowd marched towards the Bannu cantonment, setting fire to tents set up by security forces. “According to official accounts, shots were fired from an adjoining area towards the tents. Security forces returned the fire, and in the ensuing gunfire and melee, at least one person was killed and scores were injured,” it added.\n\nTherefore, the fact-check determined that the claim that a viral video shows recent firing at demonstrators in KP’s Tirah Valley is misleading. The video was shared as far back as July 2024, when violence broke out at a Bannu peace rally and demonstrators were fired at.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/28124951bf88974.png",
  "retrievedAt": "2025-08-17T21:30:56.867Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927142/fact-check-viral-video-of-firing-on-demonstrators-is-not-from-kps-tirah-valley-but-july-2024-bannu-rally-violence",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T11:33:18.000Z"
}
