{
  "title": "Return of hard power - Pakistan - DAWN.COM",
  "author": null,
  "content": "HARD power has returned with a vengeance to centre stage in geopolitics. Not that its importance ever diminished. That will not happen. Military force will remain a key power resource in international affairs. But there was hope that wars would be abjured as a means to settle inter-state differences and the use of force would be an option of last resort.\n\nDialogue and diplomacy, rather than military or economic coercion, would become the preferred policy choice for states. And soft power — the power of persuasion — would be utilised much more to pursue foreign policy goals and build a country’s global influence.\n\nNot so today. Powerful countries and regional powers are using hard power to try to bend other states to their will. The threat or the use of force has become an option of first and not last resort for them, and the main way of ‘resolving’ disagreements and imposing their will. Israel’s war on Gaza, its attacks on Iran, Syria, Lebanon and Yemen, the Russian invasion of Ukraine, US bombardment of Iran and India’s military action against Pakistan all testify to the increasing use of force.\n\nAll these actions have defied international law and the legal prohibition on the use of force. They have been carried out with impunity, further fragmenting an already fraying global order and undermining multilateralism and systems of international cooperation. Global norms that de-emphasise the coercive use of hard power have been wilfully ignored by them in pursuit of their goals. This modern version of ‘gunboat diplomacy’ has seen the greater use or the threat of force to secure political and economic objectives. This is pushing the world towards a Hobbesian state of lawlessness.\n\nThe rising salience of hard power in international affairs is reflected in how countries, especially big powers, have been augmenting their hard power resources. The spike in global defence spending is evidence of this. It has reached a new high as countries big and small deem increasing their hard power assets to be essential to promoting their goals and secure themselves in an unstable international environment.\n\nWith use of military force and economic coercion dominating geopolitics does soft power still count?\n\nThe way economic coercion is being used by the Trump administration also testifies to the current surge in the exercise of hard power. President Donald Trump has imposed a trade war by slapping higher tariffs on almost every country in the world to extract concessions in negotiations conducted under the pressure of threats and punitive actions. The use of coercive economic power to browbeat countries has involved no distinction between allies and adversaries. All are being compelled to renegotiate trade deals, with tariffs used as a punitive hard power tool for economic gain. The signal sent by this approach is that noncompliance with US demands will entail a heavy cost. The consequence of this form of hyper-unilateralism is to upend not just the global trade order but also established norms of engagement between countries, with unknowns outpacing the knowns.\n\nDoes all this mean soft power has become less important or relevant? Is diplomacy devalued by the increased use of hard power? Is the practice of co-opting others rather than coercing them being discarded? Has the concept of soft power become dated, as some analysts claim? The short answer is no, as it remains an important component of international politics — a key tool in the arsenal of countries to build influence and shape perceptions. Therefore, despite the prevailing dominance of hard power, it would be a mistake to conclude that soft power, which is the ability to shape the preferences of others and achieve outcomes through ‘attraction’, no longer counts on the global stage.\n\nIn fact, while the US and other states are exercising hard power, China has increasingly been pursuing a soft power strategy, to complement the increase in its economic and military strength. This has helped it expand its global influence, build trust and secure greater cooperation from countries. Not surprisingly, it has shot to number two position among 193 countries in the latest global soft power index compiled by Brand Finance, the London-based consultancy firm. This is the result of its multifaceted economic, diplomatic and cultural strategy to boost its global image.\n\nChina’s Belt and Road Initiative (with 150 participating countries), technological advances especially in AI, development assistance, investments in green technology and cultural diplomacy are all aspects of its vigorous and diverse soft power efforts. So is its active role in multilateral institutions as well as speaking for the Global South. Its proactive diplomacy, for example, in mediating the rapprochement between Saudi Arabia and Iran, has also enhanced its soft power appeal. All this has enabled China to increase its global influence and shape international perceptions to its advantage.\n\nJoseph Nye, who introduced the notion of soft power decades ago, considered the question of whether soft power was still significant in today’s world. An insightful piece in the current issue of Foreign Affairs co-authored with Robert Keohane, written just before Nye passed away, argued that Trump, “inordinately committed to coercion”, did not understand soft power or its role in foreign policy, and relied only on deploying hard power. This was a losing strategy in the long run. This is because if a country is attractive “it won’t need to rely as much on incentives and penalties to shape the behaviour of others”.\n\nMoreover “If allies see it as benign and trustworthy, they are more persuadable and likely to follow that country’s lead”. But if they see their trading partner as a bully, they are more likely to be reluctant partners and seek to reduce their long-term dependence. The authors also posit that in a world characterised by growing interdependence, securing cooperation is essential which soft power strategies are very effective at doing.\n\nWhile the exercise of hard power seems to be the dominant global trend today, soft power continues to have its own place and value in international politics. This means that countries can advance their interests not just through military and economic strength but also by persuasion and attraction which encourages other states to cooperate and align with them. Soft assets cannot replace hard resources but can help states earn respect and trust, so essential for the successful promotion of national goals.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6886cf50e473d.jpg",
  "retrievedAt": "2025-08-17T21:31:54.785Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927092/return-of-hard-power",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:19:27.000Z"
}
