{
  "title": "CORPORATE WINDOW: Muted impact of import of used cars - Newspaper - DAWN.COM",
  "author": null,
  "content": "ROUGHLY 44,000-45,000 used cars were imported in FY25, according to a Japanese car assembler and a brokerage house. However, importers and dealers of vehicles offer a different view.\n\nAccording to Top Line Securities, the management of Honda Atlas Cars Limited (HACL) informed in a corporate briefing held in mid-July that around 45,000 “used cars” have been imported over the last 12 months, with the majority being 1,000cc or below.\n\nHonda management believes that “tariff rationalisation and rising used car imports are unlikely to impact the company as these primarily benefit vehicles below 1,000cc, which make up 90pc of total imports.”\n\nHACL said that further clarity on the implementation of the new used car import policy is expected from the government by September 2025, particularly regarding the duty structure, vehicle safety and emissions standards, and the phased relaxation of age limits.\n\nMyesha Sohail of Top Line Securities, prior to HACL’s corporate briefing, had disclosed imports of 44,000 units in FY25, up by two per cent than FY24. She expects imports to increase by over 40pc in FY26 to 62,000 units, following the government’s opening of commercial imports from September 2025.\n\nAs in the past, these used car imports will be largely concentrated in small-end vehicles, affecting the product lineup of Pak Suzuki Motor Company Limited (PSMCL) significantly. Sedan car imports may become feasible once the additional duty is reduced to 20pc in FY28 from the current 40pc.\n\nHigh demand for local cars pushed up imports of semi- and completely knocked-down kits to $1.1bn in FY25, compared to $779m in FY24, a 41.5pc increase\n\nHowever, she said that importers claim that allowing commercial imports would not affect any lineup, as the process has become very stringent with higher additional duties.\n\nAccording to data from the Pakistan Bureau of Statistics (PBS), the import of completely built-up units (CBU) comprising old and new cars inched up 3.44% in FY25 to $278 million from $269m in FY24. The auto segment remained robust as sales of locally assembled cars, pickups, vans, and SUVs swelled to 148,023 units, up 43pc year-over-year (YoY).\n\nThe overall sale of used cars and locally assembled cars, SUVs, pickups and vans crossed 200,000 units in FY25, thus nullifying the impression that used cars have been hitting hard the sales of local assemblers.\n\nHigh demand for cars also pushed up the arrival of semi and completely knocked down (CKD/SKD) kits by the local car assemblers to $1.1 billion in FY25 compared to $779m in FY24, up by 41.5pc, which also signals brisk demand for cars in the coming months.\n\nPatron-in-Chief, All Pakistan Car Dealers and Importers Association (APDA), Mian Shoaib Ahmed, while quoting customs figures, said that 38,761 units of used vehicles were imported during FY25 under transfer of residence, gift scheme and personal baggage as compared to 36,458 in FY24.\n\nHe said demand for both used and new cars has been showing a positive trend, thanks to the downward trend in interest rates, the introduction of new and facelift variants, easing inflation, and improving consumer sentiment. Soaring prices of locally assembled vehicles will continue to shift more buyers towards used cars, he said.\n\nTo review a roadmap for used car imports after the Budget FY26, the association held a meeting with Coordinator to the Prime Minister on Commerce Rana Ihsaan Afzal Khan, and discussed their policy recommendations for the upcoming framework on the regulated import of used vehicles, set to take effect from September 2025.\n\nHe said the association supports the government’s initiative to allow the commercial import of used vehicles, bringing healthy competition to the automobile market and benefiting the end user. The delegation presented proposals focusing on environmental and road safety compliance, including pre-shipment inspections to ensure emissions and structural standards, as well as transparent valuation mechanisms for imported vehicles.\n\nRecommendations were also shared on foreign exchange arrangements and revisions to the existing depreciation framework to align with market realities. During the discussion, it was highlighted that taxes and tariffs for the coming year would require careful consideration.\n\nTo ensure that all used vehicle imports meet appropriate safety, environmental, and consumer protection benchmarks, a clear and enforceable regulatory framework must be established without delay.\n\nMr Ahmed said mandatory pre-shipment inspection (PSI) must verify the minimum emissions standard of Euro 3 or equivalent roadworthiness. At the same time, vehicles must be certified to remain roadworthy for a minimum of 10 years. Odometer Integrity must be verified and untampered, while battery health must be 70pc or higher.\n\nThere is a need to confirm that the vehicle is not stolen or under any encumbrance. The inspection agency must independently verify and certify the actual manufacturing date of the vehicle, not just its first registration date. The inspection agency must maintain offices both in the country of export and in Pakistan, enabling cross-verification.\n\nIt is important that the policy framework includes a clear and flexible foreign exchange mechanism to ensure smooth and practical implementation, he said.\n\nPublished in Dawn, The Business and Finance Weekly, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6886d9a9498bf.gif",
  "retrievedAt": "2025-08-17T21:31:37.833Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927105",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T02:03:23.000Z"
}
