{
  "title": "New US envoy discusses economic ties with Finance Minister Aurangzeb - Business - DAWN.COM",
  "author": null,
  "content": "United States Chargé d’Affaires in Pakistan Elizabeth Horst on Monday met Finance Minister Muhammad Aurangzeb in Islamabad, according to a press release by the Finance Division.\n\nThe US State Department appointed Elizabeth Horst the acting ambassador to Pakistan on Thursday.\n\nHorst, a senior career diplomat, was serving as the principal deputy assistant secretary in the Bureau of South and Central Asian Affairs before arriving in Pakistan to take charge of her position.\n\n“Horst welcomed the economic progress and the government’s reform-driven approach, emphasising the US commitment to strengthening economic and trade ties with Pakistan,” the press release said.\n\nThe meeting served as an opportunity to exchange views on matters of mutual interest and to reaffirm the positive trajectory of bilateral relations between Pakistan and the US.\n\nThe finance minister expressed appreciation for the longstanding support extended by the US towards Pakistan’s economic development. He particularly lauded the continued US support for macroeconomic stability achieved over the past year and a half, and welcomed the healthy momentum in bilateral engagement across various sectors.\n\n“Recalling his recent visit to the United States, the minister shared insights from his productive meetings with US Secretary of Commerce Howard Lutnick and United States Trade Representative Ambassador Jamieson Greer in Washington, DC,” the statement continued.\n\nHe noted the encouraging progress in deepening trade and economic ties between the two countries.\n\nAurangzeb underscored the importance of the US as Pakistan’s largest trading partner and highlighted Pakistan’s keen interest in broadening bilateral cooperation beyond traditional sectors. He specifically pointed to the promising potential in information technology, minerals, and agriculture as avenues for mutually beneficial collaboration.\n\nThe finance minister also briefed Horst on Pakistan’s recent macroeconomic indicators, including sovereign rating upgrades and renewed investor confidence.\n\nHe outlined the government’s reform agenda focused on critical areas such as taxation and energy, aimed at unlocking sustainable, long-term economic growth.\n\n“Furthermore, he shared updates on Pakistan’s successful entry into Middle Eastern capital markets, its upcoming plans for issuing the inaugural Panda bond, and future access to euro and US dollar markets,” the press release added.\n\nThe acting US ambassador reiterated US support for continued economic and political stability in Pakistan and expressed optimism for an enduring and robust business partnership between the two nations.\n\nThe meeting concluded with a mutual commitment to building on the momentum of current engagements to further deepen bilateral cooperation.\n\nLast week, United States Secretary of State Marco Rubio lauded Pakistan’s role in “global and regional peace” in his first meeting with Deputy Prime Minister and Foreign Minister Ishaq Dar, the Foreign Office (FO) had said.\n\nUS-Pakistan relations saw a major boost when Trump hosted Chief of Army Staff Field Marshal Asim Munir at the White House last month in an unprecedented meeting.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/28175441185d988.jpg",
  "retrievedAt": "2025-08-17T21:30:35.330Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927183/new-us-envoy-discusses-economic-ties-with-finance-minister-aurangzeb",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T13:34:45.000Z"
}
