{
  "title": "Rawalpindi police to exhume body of girl allegedly killed for ‘honour’ on Jirga orders - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The grave of a married woman allegedly killed in the name of honor following a jirga’s order will be exhumed amid tight security on Monday (today) to ascertain the cause of her death.\n\nHer second husband, who has recorded his statement with the police, is considered a key eyewitness in the case.\n\nUsman, the second husband of 17-year-old Sidra, was earlier booked by the police after her first husband, Ziaur Rehman, lodged a kidnapping FIR against him. Usman, reportedly brought to Rawalpindi from Muzaffarabad, presented legal documents of his marriage to Sidra along with supporting evidence to investigators.\n\nAccording to police sources, Usman stated that he married Sidra lawfully after she had completed her iddat period, following her divorce from her first husband. Sidra had also submitted a statement before a judicial magistrate in Muzaffarabad, confirming her marriage to Usman was consensual and that she feared for her life.\n\nPolice expand investigation to include all members of Jirga\n\nPolice officials said Sidra had requested protection from the court. Her testimony, along with Usman’s statement, is being treated as vital evidence. Investigators believe Usman was the last person to see her alive before she was forcibly taken by five armed family members from the Pirwadhai area in Rawalpindi, under the pretext of arranging a traditional rukhsati.\n\nAccording to sources, a jirga, comprising her family members and former in-laws, was convened and it was decided that Sidra, having eloped, did not deserve to live.\n\nA video statement by Usman’s father, Muhammad Ilyas, has also surfaced. He described how Sidra sought protection from him, claiming her father had died, her mother had remarried her uncle and she was being forced into another marriage. Ilyas said he arranged Rs30,000, took Sidra to court and got the couple married according to Islamic tradition.\n\nHe alleged that four days after the marriage, armed individuals stormed his home and threatened the family. They later convinced Sidra’s in-laws they would arrange a proper Rukhsati. Two days later, the family learned through the media that Sidra had been murdered.\n\n“I handed my son over to the police to avoid any accusations,” Ilyas said, adding that his family was now in danger and requesting protection.\n\nPolice have since arrested three individuals: a member of the cemetery committee, a gravedigger, and a rickshaw driver. All three are in remand and will be produced in court on Monday.\n\nThe case is being personally supervised by City Police Officer (CPO) Rawalpindi Khalid Hamdani. The investigation team includes SSP Investigation Saba Sattar, SP Rawal Haseeb Raja, DSP City Syed Azhar Shah, officers from the HIU and investigation wing and IT experts.\n\nPolice have seized CCTV DVRs from the cemetery office and confiscated records, including the rickshaw used to transport Sidra’s body and grave-digging tools. CCTV footage shows participants of the Jirga moving around the burial site during heavy rainfall on the day of the incident. Evidence linked the rickshaw and burial site to the girl’s disappearance.\n\nAccording to the gravedigger’s statement, Sidra was buried at 5:30am on July 17. He claimed cemetery committee member Gul Badshah instructed him via phone to prepare a grave within an hour. Due to heavy rain and a shortage of laborers, the grave was not ready in time. Gul Badshah then arrived with 25 laborers to dig the grave.\n\nSidra’s body was brought in a loader rickshaw and buried. The grave was covered with soil to blend with the surrounding ground. A receipt for the grave, #78, was reportedly issued in the name of “Sidra D/O Arab Gul” to Gul Badshah’s son. The cemetery committee secretary later replaced the receipt book, and receipt #78 was missing from the returned records.\n\nThe police are now expanding their investigation to include all members of the Jirga, those involved in erasing evidence and other suspects under surveillance. However, the formal arrest of the Jirga leader or other members has not yet been announced.\n\nCPO Khalid Hamdani said the initial attempt by the suspect to label the case as a kidnapping was disproven during investigation.\n\n“The girl was murdered and buried secretly. Grave markers were erased. We take such matters very seriously,” he said.\n\nA special police team was deployed to locate the grave and ensure its protection.\n\nThe case is now being prosecuted by the police and the state. Section 311 of the Pakistan Penal Code (PPC) has been invoked, meaning the crime is non-compoundable and cannot be settled through reconciliation.\n\nAmong those arrested so far are the cemetery committee chairman and the gravedigger.\n\nPublished in Dawn, July 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:32:17.996Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926993/rawalpindi-police-to-exhume-body-of-girl-allegedly-killed-for-honour-on-jirga-orders",
  "dateList": "2025-07-28",
  "date_published": "2025-07-28T01:06:09.000Z"
}
