{
  "article_id": "2025-02-23_c3d6f739dee3ad2c6744051087d8cbae",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/h-9-itwar-bazaar-popular-shopping-point-offers-affordable-prices/",
    "retrieved_at": "2025-08-27T13:02:30.586Z"
  },
  "metadata": {
    "title": "H-9 Itwar bazaar popular shopping point offers affordable prices",
    "author": null,
    "date_published": "2025-02-23T09:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 511,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 23 (APP):Itwar Bazar, also known as the Sunday Market, is a lively shopping spot in Islamabad's H-9 sector. Famous for its wide variety of affordable goods, the market offers fresh produce, second-hand clothing, electronics, household items, and more. It operates on Sundays, Tuesdays, and Fridays. Shoppers can find everything from fresh fruits, vegetables, and spices to used clothes, toys, gadgets, and home essentials. The market is also a hotspot for street food vendors serving up local favorites. Kamran Raza, the in-charge of the bazar, told APP that the stalls are organized into sections from A to H, with a total of 2,743 stalls. At Itwar Bazar in Islamabad, a portion of the stalls was specifically allocated for female vendors. According to Raza, approximately 100 to 150 stalls were set aside for women, offering them a dedicated space to run their businesses. This initiative helps promote women's participation in the local economy and ensures they have access to a fair and organized environment within the market. The stall allocation process is typically done through a transparent balloting system, where the stalls are fairly distributed among the vendors. This method ensures an organized and fair approach to the distribution of market spaces. The stalls at Itwar Bazar are available in different sizes, with the smallest stalls measuring 88 feet, priced at 15,780, and the larger stalls measuring 1616 feet, with a price of 62,000. Stalls are allocated on a first-come, first-served basis, ensuring a fair distribution of space among vendors. This allocation system allows vendors to secure their preferred stall size based on availability and demand, he further said. Meanwhile, during the construction of the metro station for the H-9 stop, several stalls located along the Metro Bus route were demolished to accommodate the new infrastructure. As new roads and bus stations were built, the layout of the market was altered, resulting in changes to the space allocation and adjustments in the way the market operated. Vendors whose stalls were demolished had to be relocated to other parts of the market or surrounding areas. The authorities likely made efforts to compensate or assist vendors, but the demolitions did cause temporary disruptions to the market's operations. \"During the construction of metro stop, some stalls at 'section A' were demolished but, later relocated at the same section.\" he said. The administration of bazar has developed a strict system for prices of the goods like prices of the vegetable, fruits and etc. After determination of prices, the list of prices of goods was distributed to the stalls for compliance. He also mentioned that approximately 8,000 to 10,000 vehicles move in and out of the market area for shopping especially on Sunday. This highlights the significant volume of shoppers and the high demand for goods at the market, making it a key commercial hub in Islamabad. Most importantly, the use of single-use plastic bags has been banned in the bazaar, emphasizing the market's commitment to sustainability. This initiative highlights the bazaar's focus on being environmentally friendly and contributing to a cleaner, more user-friendly shopping experience.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}