{
  "title": "21 truck relief convoy from Pakistan reaches Turkiye",
  "link": "https://www.app.com.pk/national/21-truck-relief-convoy-from-pakistan-reaches-malatya/",
  "date_published": "2023-02-25T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP): A 21-truck convoy carrying 275 ton relief assistance goods from Pakistan arrived at Malatya in Turkiye, one of worst hit cities by earthquake Saturday afternoon. The truck convoy carrying mainly winterized tents, blankets and other essential relief goods departed from Pakistan on February 11 and reached Turkiye via Iran.\nThe convoy was received by Deputy Mayor Malatya Hakan Ezgi , Ambassador Fazli Corman of Turkish MOFA, Pakistan Embassy Deputy Ambassador, Abbas Sarwar Qureshi, Commander Mehmet Bhaktiyar and officials from AFAD and local administration.\nUnder the directions of the Prime Minister Shehbaz Sharif, an air bridge was established immediately between Islamabad and Ankara on February 6 to transport rescue teams and deliver essential relief goods. As of now, 20 flights have brought relief assistance goods to Turkiye. A ship carrying earthquake relief goods is also scheduled to leave Pakistan for Turkiye soon.\nSpeaking on the occasion, Abbas Sarwar Qureshi stated that Pakistan and Turkiye have a glorious history of supporting each other under all circumstances. As per the wishes of the Prime Minister and people of Pakistan, relief assistance shall keep coming from Pakistan to brotherly Turkiye till complete recovery and rehabilitation, he added.\nDeputy Mayor Hakan Ezgi said that the trucks have not only brought relief goods but tons of prayers and best wishes from Pakistanis whose hearts beat with the hearts of Turkish brethren. He thanked the people and government of Pakistan for quick response and solidarity with Turkiye in this difficult time.\nAs a part of Government of Pakistan’s earthquake relief efforts, National Logistics Cell (NLC), which is Pakistan’s leading multimodal logistics organization has transported the earthquake relief supplies from Pakistan to Turkiye.",
  "retrievedAt": "2025-08-11T06:11:53.849Z"
}
