{
  "article_id": "2025-06-28_82e61a3de592c1487669eb9f1ea949b1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/field-marshal-syed-asim-munir-visits-corps-headquarters-peshawar/",
    "retrieved_at": "2025-08-27T16:34:46.541Z"
  },
  "metadata": {
    "title": "Field Marshal Syed Asim Munir visits Corps Headquarters Peshawar",
    "author": null,
    "date_published": "2025-06-28T17:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 271,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jun 28 (APP):Field Marshal Syed Asim Munir, NI (M), Chief of Army Staff (COAS), visited Corps Headquarters Peshawar today, where he was briefed in detail on the prevailing security situation and ongoing counter-terrorism operations. During the visit, the Field Marshal also attended the funeral of the Shuhada of the incident at Bannu Garrison and visited the injured at Bannu CMH, said an ISPR news release. COAS paid rich tribute to the unwavering courage and resilience of Pakistan's security forces, who continue to confront and neutralize the Indian-sponsored Fitna al-Khawarij with exemplary valour. He reaffirmed that the people of Pakistan stand united in their resolve to eradicate terrorism in all its forms and manifestations until the threat is decisively eliminated from the country. Reiterating the state's uncompromising stance, the Chief of Army Staff vowed that all facilitators, abettors, and perpetrators of terrorism will be relentlessly pursued and brought to justice, without exception and at all costs and face of true perpetrators of terrorism in the region will be exposed to the entire world. Field Marshal Syed Asim Munir assured the nation that the blood of every innocent Pakistani shall always be avenged, and any attempt to undermine Pakistan's internal stability will be met with swift and decisive retribution. The Field Marshal also emphasised the critical need for institutional capacity enhancement of civilian law enforcement agencies, particularly the Khyber Pakhtunkhwa Police. He urged relevant government stakeholders to prioritise these efforts while reaffirming the Army's continued support in building and augmenting the capabilities of law enforcement institutions. Upon arrival at Corps Headquarters, the Chief of Army Staff was received by Corps Commander Peshawar.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}