{
  "article_id": "2025-06-28_85efa5c7722d5cedfef831f758a49a66",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-concludes-partnership-mou-with-russias-premier-think-tank/",
    "retrieved_at": "2025-08-27T16:35:13.097Z"
  },
  "metadata": {
    "title": "ISSI concludes partnership MoU with Russia’s premier think-tank",
    "author": null,
    "date_published": "2025-06-28T14:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 296,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 28 (APP):The Institute of Strategic Studies Islamabad (ISSI) and the Primakov National Research Institute of World Economy and International Relations (IMEMO) of the Russian Academy of Sciences (RAS), have concluded a Memorandum of Understanding (MoU) to institutionalise and deepen academic collaboration. IMEMO is among Russia's premier think-tanks. The MoU was signed on June 24, 2025, in Moscow, on the side-lines of the prestigious Primakov Readings 2025, an international forum that brings together top policymakers, diplomats, and scholars to deliberate on pressing global and regional issues, said a press release issued here on Saturday. The signing ceremony was attended by senior officials and experts from both sides. Ambassador Sohail Mahmood, Director General ISSI, and Dr. Feodor Voitolovsky, Director of IMEMO-RAS, signed for their respective sides. The MoU establishes a framework for long-term collaboration in areas such as joint research, policy dialogue, academic exchanges, co-publications, and participation in seminars and conferences on regional and global strategic issues of mutual interest. Expressing his views, Ambassador Sohail Mahmood underscored the significance of enhanced academic and intellectual engagement between Pakistan and Russia, particularly at a time of profound transformations in the global order. He noted that this MoU on forgoing a close partnership would serve as a foundation for sustained cooperation and knowledge-sharing between the two institutions. Dr Feodor Voitolovsky, in his remarks, welcomed the partnership and expressed IMEMO's commitment to expanding research collaboration with ISSI on a wide range of topics. The ISSI-IMEMO partnership marks an important step in the growing scholarly linkages between Pakistan and Russia and is expected to contribute meaningfully to bilateral understanding and regional dialogue through high-quality research and exchanges. It is also expected to reinforce the positive trajectory of Pakistan-Russia relations, which has been a high priority for both sides in recent years.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}