{
  "article_id": "2025-06-28_d3b1dd8ed2b68d8a56583e2d67848b88",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/india-isolated-at-sco-summit-masood-khan/",
    "retrieved_at": "2025-08-27T16:35:18.063Z"
  },
  "metadata": {
    "title": "India isolated at SCO Summit: Masood Khan",
    "author": null,
    "date_published": "2025-06-28T10:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 425,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 28 (APP):\"India's attempts to portray itself as a victim of terrorism have backfired. The world is now witnessing the true face of the extremist Hindutva regime - one that exports violence, fuels division, and violates international law,\" said Sardar Masood Khan, Former President of Azad Jammu & Kashmir, in an exclusive interview with a TV network News. He was speaking in the context of India's diplomatic isolation at the recent Shanghai Cooperation Organisation (SCO) Summit, where New Delhi's narrative failed to find endorsement among key regional powers. He emphasized that the SCO operates through consensus, and any member state's disagreement results in the exclusion of that viewpoint from the final declaration. \"India's positions were not accepted by Russia, China, Iran, Kazakhstan, Tajikistan and others,\" Khan noted, adding that this development reflected growing international awareness of India's destabilizing role in the region. India, he explained, sought to anchor its case around the SCO's long-standing principles of combating terrorism, separatism, and extremism. However, this posturing was met with firm resistance, given that India's ruling party itself represents religious extremism and ideological fascism. \"The Bharatiya Janata Party's government thrives on extremism and exclusion. Its policies are inherently extremist, and its credentials on combating terrorism are discredited by its own conduct,\" he said. He further referenced credible international documentation, most recently from Canada, which implicated India in transnational interference and terrorism. \"The assassination of Canadian citizen Hardeep Singh Nijjar on Canadian soil and the exposure of Indian agents in the United States show that New Delhi has crossed red lines,\" Masood Khan remarked. \"When India levels false accusations against Pakistan, it is like the thief scolding the police. The world is no longer buying their story.\" He underlined that while India speaks of the incompatibility between Weapons of Mass Destruction (WMDs) and terrorism, it is India is in fact portraying. \"Their doctrines are dangerous and their intentions clear - India seeks to dominate the region through fear and force,\" he added. Khan praised Pakistan's measured diplomacy and firm stance at the SCO, stating that member states stood with Pakistan because they recognized the facts on the ground and rejected India's fabrications. \"India failed to sell its narrative, and instead, exposed itself as a destabilizing actor,\" he asserted. The former President concluded by reaffirming Pakistan's commitment to peace, stability, and responsible statecraft. He urged the government to continue exposing India's disinformation campaigns, promote factual narratives. The interview was widely viewed and appreciated across policy and academic circles for its clarity of message and robust articulation of Pakistan's position.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}