{
  "article_id": "2025-06-28_67e16e9eccfa0c2692b446560d46a8b9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-pays-surprise-visit-to-nadra-mega-center-in-islamabad/",
    "retrieved_at": "2025-08-27T16:35:14.257Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi pays surprise visit to NADRA Mega Center in Islamabad",
    "author": null,
    "date_published": "2025-06-28T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 259,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 28 (APP):Federal Interior Minister Mohsin Naqvi paid a surprise visit to the 24/7 NADRA Mega Center located in Blue Area here Saturday and reviewed the facilities being provided to citizens at the center. During his visit, the interior minister interacted with citizens who had come to the Center for the processing of their CNICs and other documents. He inquired about the time it takes for the services being provided at the center. The citizens expressed satisfaction with the facilities available at the Mega Center, stating, \"We no longer have to wait for long; our turn comes quickly now.\" They thanked Mohsin Naqvi, saying, \"The staff is also very cooperative and conditions have significantly improved since you have started taking personal interest in the matter.\" The interior minister appreciated the shift in-charge and staff of the NADRA Mega Center and encouraged them to work with even more dedication. He also lauded the performance of NADRA Chairman Lt. General Muhammad Munir Afsar and his team. He visited the waiting area and various counters, personally speaking to citizens and listening to their concerns. He also issued on the spot instructions to resolve issues related to CNICs of the citizens. The federal minister also inspected the modern self-service machine, entered a CNIC number, and used fingerprint verification to review the automated system. He remarked, \"It is heartening to see that citizens no longer face delays here. The system operating without queues is commendable.\" He added that the government would continue to take steps to create ease for citizens at every level.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}