{
  "title": "COVID-19 claims 41 lives, infects 1,050 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-41-lives-infects-1050-more-people/",
  "date_published": "2021-02-23T06:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): The national tally on Tuesday of total active COVID-19 cases recorded 24,483 with 1,050 more people tested positive for the deadly virus and 752 people recovered from the disease during the last 24 hours.\nForty one corona patients have died during past 24 hours, 38 of them were under treatment in hospital and three in their respective quarantines and homes on Monday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 41 deaths, 13 people died, were under treatment, on ventilators.\nThe maximum ventilators were occupied in four major areas including Multan 27 percent, Islamabad Capital Territory (ICT) 33 percent, Peshawar 24 percent and Lahore 39 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in Four major areas of Gujrat 61 percent, Peshawar 35 percent, ICT 22 percent, and Lahore 24 percent.\nAround 250 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 33,978 tests were conducted across the country on Monday, including 9,869 in Sindh, 12,157 in Punjab, 5,985 in Khyber Pakhtunkhwa (KP), 4,580 in Islamabad Capital Territory (ICT), 376 in Balochistan, 430 in GB, and 581 in AJK.\nAround 536,243 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 573,384 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 9,878, Balochistan 18,993, GB 4,951, ICT 43,623, KP 71,146, Punjab 168,348 and Sindh 256,445.\nAbout 12,658 deaths were recorded in country since the eruption of the contagion. Around 4,293 perished in Sindh among one of them died during past 24 hours in the hospital.\n5,237 in Punjab had died with 29 deaths in past 24 hours. 27 deaths have occurred in the hospital and two out of the hospital.\n2,043 in KP where seven of them died in hospital on Monday, 493 in ICT among one of them died in the past 24 hours in hospital, 199 in Balochistan, 102 in GB and 291 in AJK among two of them succumbed to the deadly virus in the hospital and one out of the hospital on Monday.\nA total of 8,752,533 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,069 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:24:02.252Z"
}
