{
  "title": "Newly appointed OGRA chairman assumes office-charge",
  "link": "https://www.app.com.pk/national/newly-appointed-ogra-chairman-assumes-office-charge/",
  "date_published": "2021-02-23T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):Newly appointed Oil and Gas Regulatory Authority (OGRA) Chairman Masroor Khan has assumed the charge of his office, which is considered “a step further towards the betterment of the organization and fair implementation of regulatory roles for all stakeholders in Pakistan.”\nThe new chairman brought with him 30 years of local and international experience notably in the field of downstream retail fuel, engineering, project management, oil asset management, joint venture governance and management, cross-country oil pipeline, downstream assets acquisition portfolio projects and operational experience in the oil and gas industry including Liquefied Natural Gas and Compressed Natural Gas.\nMasroor Khan’s vast experience in the energy sector includes oil infrastructure development and formation of corporate alliances, besides having both national and international industrial exposure, as he has had the opportunity to work in various markets including Pakistan, Malaysia, United Kingdom and the Philippines, said a news release issued here on Tuesday.\nMasoor Khan held regional roles for Thailand, Oman, Cambodia, Laos and Dubai as well, it added.\nThe new chairman has a proven track record as a senior executive and is a strong strategic thinker, who remained part of the team responsible for transforming Pakistan Burma Shell network into the Shell Pakistan brand.\nHe was formerly working as Operations Manager in Pakistan overseeing, a widespread Shell Oil Assets across country, providing operational and technical assurance and leading a large team of professionals.\nMasoor Khan also remained Head of Distribution Engineering for Pakistan, United Arab Emirates and Oman; and was responsible for company owned Oil Installations and depots, SBMs and Oil pipelines.\nBesides, he served as Shareholder Representative for PAPCO (WOP – White Oil Pipeline Project) and led a strategic growth LNG project from inception to EPCM final design & planning stage.\nMoreover, the new chairman held the positions of Network Manager for Pakistan and Oman in Shell Oil Company. Other positions include Planning Manager for Pakistan, Thailand, Oman, Cambodia and Laos and Maintenance Advisor for Asia and Australia based at Malaysia.\nDuring the initial stages of his career as ‘Planning Engineer’ he was deputed at Civil Aviation Authority from NESPAK for the Jinnah Terminal Project, New Quaid-e-Azam International Airport, Karachi.",
  "retrievedAt": "2025-08-11T20:23:56.645Z"
}
