{
  "title": "‘Rehmatul-lil-Alameen’ scholarship programme to emulate Madina like welfare state: Firdous",
  "link": "https://www.app.com.pk/national/rehmatul-lil-alameen-scholarship-programme-to-emulate-madina-like-welfare-state-firdous/",
  "date_published": "2021-02-23T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): Special Assistant to the Chief Minister on Information and Culture Dr Firdous Ashiq Awan Tuesday said Punjab government had launched a special merit-based scholarship programme ‘Rehmatul-lil-Alameen’ for underprivileged students to transform Pakistan on the model of state of Madina.\nTalking to a private news channel, she termed the scholarship programme as a giant step towards uplifting the social and economic conditions of the deserving students, with ample opportunities to excel in the life and serve the nation and country.\nThe Pakistan Tehreek-e-Insaf (PTI) government under the leadership of Prime Minister Imran Khan was working on the agenda of making Pakistan a prosperous Islamic welfare state on the pattern of state of Madina.\nUnder this scholarship programme, 14,891 students of Intermediate and BS (Hons) programme would be given scholarships worth Rs417 million and the amount would be expanded to Rs1 billion in the next budget, she explained.\nFirdous said the scope of this scholarship would further be expanded to other professional degrees as 50 percent scholarship would be given on merit while the rest of the amount would be earmarked for needy and deserving students.\nShe said Rehmatul-lil-Alameen Chair would also be established in every district’s university along with the provision of PhD scholarships to highlight different aspects of the most blessed and revered personality and character of Holy Prophet Muhammad Peace Be Upon Him.\nReplying to a question, she said the government was working on introducing uniform curriculum to overcome discrimination in field of education.\nTalking about Daska elections, Firdous condemned Pakistan Muslim League-Nawaz (PML-N) Vice President Maryam Nawaz for doing propaganda against the government just to make the Daska election controversial.\nShe further criticized that the ‘queen of lairs’ (Maryam Nawaz) was just selling lies and misleading the innocent public.\nMaryum Nawaz would not be allowed to go abroad for her ‘thyroid surgery’ as she was making excuses to travel abroad for her minor surgery, she replied a question.\nShe alleged that PML-N Punjab president Rana Sanaullah, who was the mastermind of Model Town tragedy, had planned that the Daska election should bleed that led to the death of two political workers.\nThe PML-N was not habitual to accept its defeat in elections and in Daska, the PML-N workers under Rana Sanaullah leadership had badly harassed the people which was shameful for party leaders, she added.",
  "retrievedAt": "2025-08-11T20:24:02.729Z"
}
