{
  "title": "COVID: Chinese youth keen to learn from ‘Tiger Force’ experiences",
  "link": "https://www.app.com.pk/national/covid-chinese-youth-keen-to-learn-from-tiger-force-experiences/",
  "date_published": "2020-07-25T04:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):The All-China Youth Federation has requested the government of Pakistan to share operational details of the Prime Minister’s Corona Relief Tiger Force (CRTF), said Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar’s office on Saturday.\nIn a news release, it said the CRTF, formed on instruction of Prime Minister Imran Khan, has started receiving international acclaim and being hailed for its business model.\nThe CRTF was announced in March after the coronavirus pandemic broke out in the country. Initially, it was assigned a task of assisting the local administrations in carrying out rescue and relief activities across the country.Later, additional tasks were added to their duties including tree plantation drive, locusts’ surveillance and other services that required more human resource.\nThe SAPM office said the Chinese youth federation has shown interest in learning from the experiences of the tiger force and forwarded a formal request to the Pakistani authorities in that regard.\n“We are informed that in a recent month, Muhammad Usman Dar has been leading a campaign called ‘Tiger Force’, promoting the engagement of the youth voluntaries of all the country to fighting against the pandemic. The Chinese Youth are very interested in it and hope to learn from it in order to enhance voluntary service targeting to the pandemic fighting and economy recovery,” read the letter, forwarded by the Chinese youth federation.\n“It will be very helpful if your side could share with All-China Youth Federation some information on ‘tiger force’, its proposal background, performance, difficulties, solutions or any other aspect you would like to share with us,” it added.\nThe organization also expressed the desire for projecting the initiative in its country local media and at social media.\nCommenting on the development, SAPM Usman Dar said he would consult the prime minister before responding the All-China Youth Federation’s request.\nHe said the decision to form the tiger force was taken on the basis of ground situation. It was a visionary decision, he added.\nUsman Dar said youth exchange programmes between China and Pakistan were underway. A delegation of around 100 Pakistani youngsters had already completed their training in China, he added.\nHe underlined the need for exchange of information between both the countries.",
  "retrievedAt": "2025-08-11T19:32:31.763Z"
}
