{
  "title": "Smart lockdown policy worked successfully to protect vulnerable segments from hunger through Ehsaas",
  "link": "https://www.app.com.pk/national/smart-lockdown-policy-worked-successfully-to-protect-vulnerable-segments-from-hunger-through-ehsaas/",
  "date_published": "2020-07-25T04:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):The internationally acknowledged smart lockdown policy adopted in the developing country like Pakistan has served substantially to reduce COVID-19 cases and prevent its economy from turmoil along with protecting a big chunk of population living below poverty mostly daily wagers and piece-rate workers and their families from the drastic consequence of hunger.\nSince the outbreak of COVID-19 in the country, the Prime Minister Imran Khan’s stance of not imposing complete lockdown transcending all the criticism paved the way for the country’s largest-ever social protection initiative of Ehsaas to address the financial needs of the vulnerable segments of society successfully.\nA big challenge for the country, after the unusual circumstances due to COVID-19, was to implement prevention measures through limiting social interaction on one hand as well as compensating the daily wagers and labourers whose livelihood were badly affected, on the other.\nTo provide relief to the daily wagers and piece-rate workers, Ehsaas Emergency Cash Program was launched by the start of April to provide cash assistance of Rs 12,000 to those rendered jobless amid lockdown, through a transparent manner.\nTill July 23, an amount of Rs 158.933 billion has been disbursed among 13,137,230 lockdown affected persons through Ehsaas payment centers across the country.\nAccording to the province wise distribution update, around Rs 71.219 billion has been disbursed among 5,885,826 deserving families in Punjab, Rs 48.202 billion among 3,997,997 in Sindh, Rs. 27.016 billion among 2,225,741 in Khyber Pakhtunkhwa, Rs 7.910 billion among 651,227 in Balochistan, Rs 2.614 billion among 214,097 in Azad Jammu and Kashmir, Rs 1.160 billion among 94,996 in Gilgit Baltistan and Rs 0.813 billion among 67,346 beneficiaries in Islamabad.\nAccording to the Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar, the scope of emergency cash programme, after its unprecedented success, has been expanded to reach out to around 16.9 million deserving families from 12 million with the increased budget up to Rs 203 billion from the previous Rs 144 billion.\nEhsaas Ration Portal was another initiative launched on April 21 after COVID-19 to save the poor segments from starvation through creating bridge between charitable organizations, philanthropist and the deserving persons.\nThe primary role of the Ehsaas was focused on providing data of eligible people to the donors through registration at www.rashan.pass.gov.pk after providing their required information.\nThe information provided by the deserving persons is scrutinized through using Ehsaas data analytics to determine their eligibility while the donor organizations are evaluated according to specific eligibility criteria to become partners in the program.\nAs many as 738,869 people have registered themselves for ration assistance through the Ehsaas Ration Portal so far while the distribution of ration among the needy has been started.\nThe other ongoing programs under Ehsaas include Ehsaas Undergraduate Scholarship, Ehsaas Panagah (Shelter) and Langar Scheme, Ehsaas Kafalat, Ehsaas Interest Free Loans and Ehsaas Amdan and Assets Transfer Program.\nThe present government has so far utilized a total of Rs 254.95 billion on social protection and poverty alleviation programmes under Ehsaas.\nThe Ehsaas Amdan Program, launched on February 21, 2020, has so far distributed assets worth Rs 1.5 billion among 25,054 families. The Ehsaas Saylani Langar initiative was launched on October 7, 2019 has opened six Langar points through public-private partnership in Punjab, Sindh, Khyber Pakhtunkhwa and Islamabad. The Ehsaas Kafalat programme, launched on January 31, 2020 has so far benefited 4,576,463 women.\nThe Ehsaas Interest free loan scheme, launched on July 5, 2019, has provided interest free loans worth Rs. 24.082 billion among 712,852 persons. The country’s biggest Ehsaas Undergraduate Scholarship program, launched on November 4, 2019, has provided Rs. 148.94 billion to the Higher Education Commission (HEC) to extend scholarship opportunity to the 50,500 outstanding but deserving students.\nThe preparations to launch the first-ever of its kind Ehsaas Nash-o-Numa programme were also in full swing aiming to prevent stunting in children through provision of specialized nutritious food to pregnant and lactating mothers and their children under the age of 24 months.\nThe program, to be launched during the current month, will also educate the mothers through awareness raising sessions and informational videos about their health and hygiene. The mothers after attending these sessions will be given cash stipends also.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:31.024Z"
}
