{
  "title": "Murad asks opposition to learn about history of their leaders’ introduction in politics",
  "link": "https://www.app.com.pk/national/murad-asks-opposition-to-learn-about-history-of-their-leaders-introduction-in-politics/",
  "date_published": "2020-07-25T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):Minister for Communications and Postal Services Murad Saeed Saturday said the leaders from opposition parties who challenge the legitimacy of the popularly elected present government should read the history of Pakistani politics to know how and by whom their leaders Zulfikar Ali Bhutto and Nawaz Shairf were introduced.\nAddressing a press conference here, he said the people of Pakistan remember how Zulfikar Ali Bhutto got himslef inducted in Sikander Mirza cabinet by writing a letter full of flattery and by which name he called Ayub Khan, after the latter came to power.\nAbout Nawaz Sharif, he said the former prime minister was launched by General Zia and General Jeelani and Islami Jamhoori Ittehad (IJI) was set up to bring him in power.\nHe said Shahbaz Sharif was even today looking for “selectors” to get a chance to become prime minister. He said that PML-N leader Khawaja Asif was on record stating in a television interview in US that Imran Khan was a religious minded person, whereas his party was liberal which could serve US interests in a better manner.\nMurad said on the contrary Imran Khan founded Pakistan Tehreek-e-Insaf in 1996 and struggled for over 22 years before coming to power.\nHe said Imran Khan was offered premiership after 2002 elections which he rejected. He said the PTI came into power in KPK in 2013 and in 2018 in centre with the support of the masses who voted to power the most popular politician of the country, Imran Khan.\nHe said it was strange that Pakistan People’s Party (PPP) Chairman Bilawal Bhutto Zardari whose entire family was facing cases of corruption and money laundering was accusing others of corruption.\nMurad said in the JIT reports of fake accounts and sugar scam, Zardari’s name was mentioned but his son was giving lectures on morality and righteousness. He said every Pakistani knew that the funds allocated for health, education and other sectors of Sindh were transferred in the accounts of Asif Zardari and Faryal Talpur.\nHe said Bilawal had the habit of making speeches in the National Assembly and promptly leaving the house as he could not listen to the response from a PTI worker. Bilawal Bhutto Zardari was imposed on the PPP as its chairman and he did not know that political parties were answerable to the masses and media.\nMurad Saeed said after 50 years, during the past one year Kashmir issue had been discussed in the UN Security Council twice which was the proof that the Kashmir case had been successfully advocated by Prime Minister Imran Khan at international fora. He reminded that when Indian Prime Minister Rajiv Gandhi came to Islamabad, the then PPP government removed the sign board of Kashmir House.\nSimilarly, he said the PML-N government was shy of mentioning the name of Kalbhoshan Yadev.\nThe minister asked the opposition to act responsibly if some legislation was being done in line with ICJ rules. He recalled that it was the previous government which accepted the jurisdiction of ICJ on Indian spy case, about which Law Minister Farough Naseem had made a speech and told that it was mistake.\nHe reminded that it was the statement of Nawaz Sharif which India used for its benefit at the ICJ. He said that today Pakistan was known for tourism, not terrorism as in the opposition tenures and Pakistan had earned respect in the comity of nations, thanks to the leadership of Imran Kahn.\nHe said it was Imran Khan who contested the case of Islam, Pakistan and Kashmir at the international foray, whereas in the past they surrendered before the demand of “do more”. He said they released Raymond Davis, the killer of Pakistani nationals and allowed drone attacks in tribal areas.\nHe said Imran had no camp office and pay from his own pocket for road to his residence and fencing.\nMurad said none of Imran’s relatives accompanied him on foreign visits and none of his foreign visit was private. He mentioned that Asif Zardari spent Rs 3,164,100,000 on his foreign trips as president and up to over 800 persons were deployed on his security whereas at his residence about 2000 persons had security duty.\nSimilarly, he said the visits of former PM Nawaz Sharif and Shahid Khaqan Abbasi proved costly on national exchequer.\nTaking about the sugar scam, he said for the first time such an inquiry was conducted and its findings were made public and now steps were being taken by the departments concerned to take the responsible elements to task and its credit went to Prime Minister Imran Khan.\nHe said flour prices had increased in the country as a huge quantity of wheat was stolen from Sindh godowns which created shortage of the commodity.\nThe minister said the government, in the shape of Ehsaas programme, announced the largest programme of the country’s history to support poor segments of the society.\nHe said the budget of Ehsaas Programme has been enhanced from Rs192 billion to Rs 208 billion this year and its scope was also being expanded.\nHe said over 200 shelter homes have been established across the country for destitute people.\nThe minister said the government conducted operations against land grabbers and retrieved land worth billions of rupees.\nHe said the government had fast tracked the work on CPEC projects and started the construction of three dams that would not only create job opportunities but also meet the water and energy requirements.\nMurad said the policies of last governments of Pakistan People’s Party and Pakistan Muslim League-Nawaz had ruined public sector institutions including PIA, and Pakistan Steel Mills.\nHe said the opposition was demanding closure of the National Accountability Bureau as they wanted to commit corruption without any fear of accountability but the PTI would never allow them to do so.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:26.156Z"
}
