{
  "title": "NUMS, South Korean Research Center agree to set up preventive vaccines production unit in Pakistan",
  "link": "https://www.app.com.pk/national/nums-south-korean-research-center-agree-to-set-up-preventive-vaccines-production-unit-in-pakistan/",
  "date_published": "2022-12-22T10:29:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 22 (APP): National University of Medical Sciences (NUMS) and South Korean biopharmaceutical company Research and Development of Eyegene Inc have agreed in principle on setting up preventive vaccines production units in Pakistan on the basis of Public Private Partnership to further enhance cooperation between the two institutions.\nThis understanding was reached during a meeting of Vice Chancellor NUMS Lt Gen Wasim Alamgir HI(M) with Dr Seo-Hyun Kim,Head of R&D Center of Eyegene Inc and their teams, in South Korea, said a message received from Seoul here on Thursday.\nThe Vice-Chancellor also visited the R&D center and was given a detailed briefing by Professor Dr H. Christian Hong Chief Scientific Officer Renhain Therapeutics. He met scientists and researchers working on the development of mRNA and other vaccines at the center.\nBoth sides also identified other potential areas of collaboration including conduct of clinical trials for various therapeutic vaccines for the mutual benefit of the two countries, said the message.\nEarlier NUMS also entered into collaboration with the South Korean International Vaccine Institute (IVI) and the School of Medicine Gachon University to collaborate in indigenous development of vaccines through transfer of technology and by building capacity of Pakistani scientists.\nLt Gen Wasim Alamgir during his visit to South Korea held separate meetings with Director General of International Vaccine Institute (IVI) South Korea Dr Jerome H. Kim and with Kee-Jong Hong PhD, Director General and Prof. School of Medicine of Gachon University, an understanding was reached for collaboration in this regard, said a message received here from Seoul on Thursday.\n“Both sides agreed to cooperate in areas of capacity building including on-site training for a group of scientists from Pakistan, along with technology transfer for vaccine development.”\nThe Vice-Chancellor presented Dr Jerome H. Kim NUMS’ shield while Dean NUMS Faculty of Multidisciplinary Studies Dr. Prof. Aisha Mohyuddin and Consultant Strategic Planning and Development Jaweed Akhtar were also present on the occasion.\nIn his meeting with Kee-Jong Hong PhD, Director General and Prof. School of Medicine of Gachon University (South Korea), the two sides agreed to transfer of “technology mRNA vaccine and vaccines for emerging diseases” and to accommodate more scientists from NUMS for training in above technologies.\nMeanwhile, in another initiative, NUMS and University Of MOSTAR of Bosnia and Herzegovina inked a Document of Understanding (DOC) at an impressive ceremony held at Mostar (Sarajevo) early this week to promote scientific research and academic cooperation.\nThe DOU was signed by Lt Gen Wasim Alamgir HI(M) Vice Chancellor NUMS and Rector Bosnian and Herzegovina University Of MOSTAR(SUM) Prof. Zoran Tomic PhD during former visit to Bosnia.\nPakistan ambassador to Bosnia and Herzegovina Maj Gen Akhtar Jamil Rao HI(M) (Retd), Dean NUMS Faculty of Multidisciplinary Studies Dr. Prof. Aish a Mohyuddin and Dr. Lalarukh Consultant Clinical Trial Unit(CTU) were also present on the occasion.\nThe DOU envisaged “the areas and matters of mutual cooperation as well as the forms and manners of its implementation”.\nUnder the DOU both Universities can choose their staff for participation in the staff exchange “with an aim of studying or lecturing at the other University, on a reciprocal base”. Both sides agreed to call professors from the other University for giving lectures or consultations for a certain period or choose one or more of their employees for mutual visits for improving the study or research in their respective institutions.\nThe universities will exchange students, either in undergraduate or graduate studies, in the appropriate fields of study, said the DOU.",
  "retrievedAt": "2025-08-11T16:03:13.930Z"
}
