{
  "title": "WHO, Health Ministry observe Universal Health Coverage Day",
  "link": "https://www.app.com.pk/national/who-health-ministry-observe-universal-health-coverage-day/",
  "date_published": "2022-12-22T15:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): Ministry of National Health Services, Regulations, and Coordination, in collaboration with World Health Organization (WHO), Pakistan, commemorated on Thursday Universal Health Coverage (UHC) Day, 2022.\nThe day was observed with the aim to raise awareness about the need for strong, equitable, and resilient health systems and UHC in Pakistan.\nMinister of State Dr Mahesh Kumar Malani and WHO representative Dr Palitha Mahipala were the chief guests of the ceremony.\nIn a statement, Federal Health Minister Abdul Qadir Patel said: “The government of Pakistan is fully committed to the Sustainable Development Goals and ensuring the Health and well-being of its people.”\nHe added achieving universal health coverage is a foundational driver of inclusive and sustainable economic growth. Maintaining progress towards UHC is challenging and is first and foremost a political choice, he added.\nHe said that effective primary health care (PHC)-oriented systems are the bedrock of equitable and resilient health systems that deliver high-quality health care to everyone. Investing in UHC and PHC is the sure way to guarantee the socio-economic well-being of our communities, he added.\nPatel said that strong political commitment from national and provincial and federating area governments and partner organizations is an essential ingredient for overcoming barriers.\nHe appreciated the provincial, federating area health departments, district health offices, and health development partners for their extensive support and contribution towards UHC. He also appreciated the WHO to organize this ceremony for the UHC day commemoration.\nOn the occasion, WHO Representative Dr Palitha Mahipala thanked the health minister for the overwhelming support by his ministry to celebrate this day at the national level to renew commitment towards UHC advancement in the country.\nHe highlighted that this year’s UHC Day theme, “Build the world we want: a healthy future for all”, emphasizes that to build strong health systems we need equity, trust, healthy environments, investments, and accountability.\nHe stressed that investment in health systems is the need of the hour and urged all stakeholders to join hands and make the commitment to prioritize investments for building resilient health systems that can withstand at the time of crises such as pandemics and natural disasters to ensure a “Healthy Future for All”.\nWHO and the Ministry of National Health Services jointly launched three reports on UHC Day (Pakistan UHC Monitoring Report 2022, Pakistan PHC P, and Status of Health Financing in Pakistan).\nThe launch of these reports is an important step to monitor the current UHC, PHC, and health financing situation at the national level.\nThe event was attended by representatives from federal and provincial health departments, UN agencies, health development partners, and other stakeholders.",
  "retrievedAt": "2025-08-11T16:03:08.602Z"
}
