{
  "title": "Pakistan to help Somalia build national identification and registration system",
  "link": "https://www.app.com.pk/national/pakistan-to-help-somalia-build-national-identification-and-registration-system/",
  "date_published": "2022-12-22T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): United Nations Development Program UNDP-Pakistan and UNDP-Somalia have organized a first-ever Somalia-Pakistan Ministerial Study Tour on Federalism, Devolution and State-Building from December 20 to 27, 2022.\nThe Ministry of Interior, Federal Affairs and Reconciliation (MOIFAR) of Somalia has sent the delegation of honorable ministers representing both Federal Government and Federal Member States including representatives of Banadir Regional Administration (BRA).\nHis Excellency Ahmed Moallim Fiqi, Federal Minister, Ministry of Interior, Federal Affairs and Reconciliation, Federal Republic of Somalia is leading the study tour.\nThe core objectives of the study tour are to learn from the process of consensus building on constitutional development regarding the 1973 Constitution and 18th Amendment introduced in 2010 – with focus on key processes defining the federal structure in post-independence context.\nThe other objective is to learn about the composition, scope and functioning of Council of Common Interests (CCI) with special reference to the management of inter-governmental relations and dispute resolution between and among Federal and sub-national governments.\nAnother objective is to learn about the mechanism of fiscal equalization and fiscal federalism introduced through 7th National Finance Commission (NFC) Award.\nOther important objectives include; learning about the framework(s) of democratic devolution introduced through local governance systems and structures; and policy, legislative and institutional dimensions of strengthening social contract between citizens and state.\nZafarullah Khan, a famous expert on federalism, moderated the discussion.\nYesterday, at NADRA headquarters, inaugural session was organized, and a warm welcome was extended to 11 members from various ministries and states of Somalia.\nThe visiting team was taken to NADRA regional office at Blue Area where and citizen registration office at G-11, Islamabad. While at the headquarters, they were acquainted with the NADRA processes of citizen registration databases, the technologies being used, monitoring and administrative processes, security measures, and also expansion of NADRA databases in other areas such as social protection, immunization, and health benefits for the vulnerable and deserving population.\nNaeem Khan, DG Africa, Ministry of Foreign Affairs, Government of Pakistan said that Pakistan is an interesting place to study and it has traveled a long way in institutional development. He emphasized on the need of improved trade ties between Somalia and Pakistan and cooperation in the area of coastal area management.\nKaiser Ishaque, Assistant Resident Representative, Assistant Resident Representative, UNDP, Pakistan, said Pakistan has a successful model of constitutional development.\nAmjad Bhatti, Chief Technical Specialist, UNDP, Somalia emphasized on the South-South cooperation model because there are many political and cultural similarities between the countries of the South.\nAliona Niculita, Resident Representative, UNDP said that UNDP has historical ties with Pakistan and has worked on many issues such as federalism, devolution, climate change, gender equality, rule of law and others.\nDeputy Ministry of Justice and Constitutional Affairs, Ahmed Abdirehman Hassan, shared his desire to not only listen what people say, but also experience federal life in Pakistan and visit offices and places.\nHodain Osman, Advisor to the President of Somalia, said that she is interested in fiscal distribution, equalization, and revenue sharing modalities, and looking forward to learning from Pakistan’s experience.\nMuhammad Tariq Malik, Chairman NADRA, shed light on NADRA’s experience of creating evidence of identity of people and treating identity card as social contract between a citizen and the state. It helped people get access to social benefits and other entitlements.\nAhmed Moallim Fiqi, Hon’ble Federal Minister, Ministry of Interior, Federal Affairs and Reconciliation, Federal Republic of Somalia, said that they want to learn from the 75 years of Pakistan’s experience about constitutional development so that state-building efforts in Somalia can benefit from it.",
  "retrievedAt": "2025-08-11T16:03:12.525Z"
}
