{
  "title": "22nd death anniversary of ‘Malika-e-Tarannum’ to be observed on Friday",
  "link": "https://www.app.com.pk/national/22nd-death-anniversary-of-malika-e-tarannum-to-be-observed-on-friday/",
  "date_published": "2022-12-22T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): The 22nd death anniversary of ‘Malika-e-Tarannum’ [Queen of Melody] Madam Noor Jehan will be observed on December 23 (Friday) to remember her valuable contribution to the music industry.\nKnown as one of the most melodious voices of South Asia, Noor Jehan ruled the Pakistani film and music industry for decades and sang thousands of songs and Ghazals in Urdu, Sindhi and Punjabi and was given the honorific title of Malika-e-Tarannum.\nBesides playback and ghazals singing, the queen of melody also proved her talent in the field of acting across the border.\n“Malika-e-Tarannum was a legendary artist of the sub-continent who had a unique and melodious voice, which still touches the hearts and souls of listeners,” noted musician Salman Adil said while sharing his views about the Queen of Melody.\nHe said that the unique voice of Noor Jehan transcended all the social, geographical and cultural barriers and was widely admired by music lovers across the globe.\nNoor Jehan with her unique range of voice changed the trend of music due to which she was given huge respect and admiration by the music fans.\nShe was a hardworking artist who represented a very strong and impressive image of Pakistani women to the world and thousands of her students and followers are carrying forward her legacy.\nAlong with making her identity in the field of singing and acting, she has the honor of becoming the first female film director of Pakistani cinema with the film ‘Chann Wey’ in 1951, Salman highlighted.\nHe suggested establishing a trust or music institution in the name of the legendary artist keeping in view her great contributions to the entertainment industry.\nBorn as Allah Wasai on September 21, 1926 in Kasur, Noor Jehan inherited music from her family and started her musical career from Calcutta at the age of nine as a child singer.\nAfter partition, she moved from Bombay to Pakistan and started her film career as an actress and singer. Her last film ‘Ghalib’ was released in 1961.\nShe received many awards for her acting and singing capabilities ‚ including the highest Pakistani honor in entertainment‚ Tamgha-e-Imtiaz (The Pride of Performance) in 1966 and the President Award in 1957.Malika-e-Tarrannum’s national patriotic songs, during the 1965 Pak-India war, are an important part of our national history.\nOn December 23, 2000, Noor Jehan died as a result of heart failure and was buried in Karachi.",
  "retrievedAt": "2025-08-11T16:03:14.227Z"
}
