{
  "title": "Sanjrani pledges materializing women’s empowerment dream",
  "link": "https://www.app.com.pk/national/sanjrani-pledges-materializing-womens-empowerment-dream/",
  "date_published": "2022-12-22T18:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): Senate Chairman Muhammad Sadiq Sanjrani on Thursday said that the dream of empowering women would be materialized by making further improvements in the relevant laws.\nIn his message on National Working Women’s Day observed on December 22, Sanjrani said that Government of Pakistan had adopted an effective strategy to include women in the mainstream of progress and development.\nHe said the rights given to women by Islam were unprecedented having no other example in history.\nThe National Working Women’s Day is being observed in Pakistan Since 2010 in the acknowledgement of the contributions made by women to the development of the country.\nThe day is marked in recognition of the struggle of working women to secure a dignified and respectful working environment.\nHe said revolutionary measures had been taken to empower women and protect their rights.\n“Today, we need to join hands to celebrate the progress made in empowering women and to reaffirm our collective resolve for redoubling efforts to further advance respect for women’s rights,” he said.\n“The Constitution of Pakistan upholds the equal status of women. We have made significant advancements in empowering women politically, economically and socially, including through progressive legislative, policy, institutional and administrative measures. At the international forum, Pakistan’s voice has always resonated in favour of women’s empowerment and gender equality. As a nation, we honour and salute their role and contribution to the society and State of Pakistan,” the chairman added.\n“Women have proven that they can shoulder any kind of responsibility with ease. The role of women today is something that varies significantly across the world. The unwavering perseverance and commitment of women in the judicious execution of their duty at the workplace is laudable,” he lauded.\n“The number of women joining the workforce has increased In the last few years which is why the government and Parliament of Pakistan have made extraordinary strides toward workplace equality and legislated a law to protect women against sexual harassment at the workplace.\nThis special day calls upon everyone to stand up for the equality and freedom of women and shun gender discrimination, sexual harassment, abuse, oppression and exploitation against them. We must strive to remove all the barriers that confront women to walk shoulder to shoulder with their male counterparts,” the chairman concluded.\nThe chairman said the enactment of important legislation like the women’s protection bill also proved the government’s commitment towards the cause of women’s issues.\nDeclaring December 22 as the national day of working women, he hoped that these actions will pave the way for making Pakistan a gender-balanced, gender-friendly and gender-supportive democratic polity, where all women have equal rights and opportunities as enshrined in the Constitution for their development.",
  "retrievedAt": "2025-08-11T16:03:05.865Z"
}
