{
  "title": "Prudent foreign policy rectifies Pakistan’s strained ties with world",
  "link": "https://www.app.com.pk/national/prudent-foreign-policy-rectifies-pakistans-strained-ties-with-world/",
  "date_published": "2022-12-22T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Through a consistent high-level engagement with international community, the incumbent government pursued a prudent foreign policy to revive friendly foreign relations while effectively contesting Pakistan’s case on multiple fronts – from Kashmir and climate change to the Muslim world issues.\nThe coalition government inherited a damaged foreign policy that isolated Pakistan at the international level; however Foreign Minister Bilawal Bhutto Zardari under Prime Minister Shehbaz Sharif’s leadership took up the gigantic task of improving the strained ties with otherwise closely allied countries.\nSoon after the coalition parties formed their government, the country was hit by the worst floods affecting 33 million people and inflicting around $30 billion loss to the national economy and infrastructure.\nThe current government sensitized the international community about the damages by climate change-induced floods despite Pakistan’s contribution of less than 1% to carbon emissions.\nThe latest credit to the present government’s prudent foreign policy was the establishment of Loss and Damage Fund agreed at the COP27 summit to support the developing world for the losses cause by the climate change-induced calamities.\nEarlier, the removal of Pakistan from the grey list of the Financial Action Task Force also manifested the government’s forceful advocacy of Pakistan’s measures to combat terror financing and simultaneous successful implementation of two action plans.\nPrime Minister Shehbaz and Foreign Minister Bilawal repeatedly interacted with the leadership from friendly countries including United States, China, Saudi Arabia, Turkey and others to strengthen the relations by enhancing the scope of bilateral and regional cooperation.\nIn April, Prime Minister Shehbaz Sharif visited Saudi Arabia and met Crown Prince Muhammad bin Salman to further strengthen bilateral economic, investment and trade ties.\nBesides participation in Open Debate of the UN Security Council on “Conflict and Food Security”, and 2nd Global Covid-19 Summit by Bilawal Bhutto in May, State Minister Hina Rabbani Khar also attended High-Level International Donors Conference for Ukraine.\nBilawal undertook his first official visit to China to discuss advancing the CPEC construction and attended the annual meeting of World Economic Forum (WEF) in May.\nIn the prime minister’s visit to Turkey in from 31 May-2 June 2022, both the countries agreed to further improve their relations in the fields of tourism, education, logistics, civil aviation and communication.\nThe visit of German Foreign Minister to Pakistan, Bilawal Bhutto’s visit to Mashhad, the visit of Secretary General, Shanghai Cooperation Organization to Pakistan and the foreign minister’s participation in SCO Council of Foreign Ministers Meeting in Tashkent are highlights of Pakistan’s diplomatic engagements in June and July this year.\nIn August, the prime minister visited Qatar while the foreign minister undertook four-state visit to Germany, Denmark, Sweden and Norway.\nFollowing the devastating floods, Pakistan and the United Nations jointly launched the “flash appeal” seeking the international community’s help for rescue and relief operations in the affected areas.\nUN Secretary-General Antonio Guterres paid a Solidarity Visit to Pakistan in September who was briefed on the flood situation by Prime Minister Shehbaz Sharif and Foreign Minister Bilawal Bhutto Zardari.\nThe same month, Foreign Minister Bilawal chaired High Level event on Loss & Damage organized by Pakistan on sidelines of 77th Session of UNGA and told the international community that the floods impacted one in seven Pakistanis and caused damages equivalent to 10% of Pakistan’s GDP.\nOn the UNGA sidelines, Prime Minister Shehbaz Sharif met French President Emmanuel Macron wherein France agreed to host an international conference before the end of the year aiming at contributing to the rehabilitation and reconstruction of flood-affected areas.\nIn October, Pakistan and the United Nations launched the Revised Flash Appeal of US $ 816 million to respond to the needs of people affected by unprecedented climate-induced floods\nThe UNGA unanimously adopted resolution to express solidarity and support to government and people of Pakistan in the wake of devastating floods.\nDuring his visit to Kazakhstan for CICA summit, Prime Minister Shehbaz also held bilateral meetings with the Presidents of Azerbaijan, Belarus, Kazakhstan, Tajikistan and Uzbekistan, besides interaction with other leaders.\nWhile advocating for a peaceful relationship with other countries, the incumbent government strongly supported the Kashmiris and linked any betterment of Pak-India ties with the reversal of Indian unilateral actions of August 5, 2019.\nDuring his media interaction with recent US visit, the foreign minister censured Narendra Modi calling him the “Butcher of Gujarat” and that the BJP drew inspiration of Hitler.\nDuring the interaction with leaders from different countries, Pakistan’s leadership repeatedly called for constructive engagement with the interim Afghan government for betterment of the people of the war-torn countries.\nAt the same time, Pakistan also urged the Afghan side to abide by its commitment with the international community vis-à-vis women rights and girls’ education.\nDuring his visit to Pakistan from December 10-12, the OIC Secretary General Hissein Brahim Taha also visited Azad Jammu and Kashmir where he reiterated OIC’s support to the oppressed people of the IIOJK.\nOn November 19, Hina Rabbani Khar paid a day-long visit to Kabul and held meetings with leadership of the interim government and discussed the cooperation in education, health, agriculture, trade and investment, regional connectivity, people-to-people contacts and socioeconomic projects.",
  "retrievedAt": "2025-08-11T16:03:14.379Z"
}
