{
  "title": "Tackling global challenges require a collective approach: NA Speaker",
  "link": "https://www.app.com.pk/national/tackling-global-challenges-require-a-collective-approach-na-speaker/",
  "date_published": "2022-12-22T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): National Assembly Speaker Raja Pervez Ashraf Thursday said that the world is facing global climate challenges and only collective effort can transform these challenges into opportunities.\nTalking to Ambassador of Belgium Charles Delogne at Parliament House, he said that Pakistan has been facing severe impacts of global climate change as there has been severe destruction of properties and loss of lives of common people.\nSpeaker said that enhancing parliamentary interactions and economic cooperation is vital for the prosperity of people and their well-being.\nHe said that the official visit of the 7 members Belgium’s Parliamentary delegation in Pakistan from 16th to 20th January 2023 would enhance parliamentary cooperation between both nations.\nHe also said that the Pakistani economy is agriculture-based and flash floods have destroyed the agriculture sector.\nThe Speaker appreciated the support of the Belgium people and government for being 1st country to support Pakistan in flood rehabilitation initiatives.\nThe Speaker stressed on the need to further develop contact between the business communities of both countries to tap the massive economic potential in Pakistan.\nHe said, “Pakistan attaches great importance to its relations with Belgium as these relations are based on close people-to-people contacts,”Convener Pakistan-Belgium Parliamentary Friendship Group MNA Ms. Asia Azeem was also present in the meeting.\nIt is pertinent to mention that Seven member Parliamentary delegation of Belgium would visit Pakistan from January 16, 2023 to January 21, this year. While talking about Belgium’s Parliamentary delegation to Pakistan, Speaker said that this would further strengthen ties between both nations.\nThe Ambassador of Belgium in Pakistan appreciated Speaker of National Assembly Raja Pervez Ashraf for his warm welcome.\nHe appreciated the comprehensive schedule of seven members Belgium’s Parliamentary Delegation to Pakistan.\nHe said that both Belgium and Pakistan share the same cultural and language diversity. He also said that Belgium was the first country to support Pakistan, especially in flood relief efforts.",
  "retrievedAt": "2025-08-11T16:03:12.437Z"
}
