{
  "title": "Pakistan opens 11 PoR Centres to facilitate Afghan refugees",
  "link": "https://www.app.com.pk/national/pakistan-opens-11-por-centres-to-facilitate-afghan-refugees/",
  "date_published": "2022-12-22T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): Pakistan has operationalized eleven Proof of Registration (PoR) card modification centers across the country in order to facilitate the Afghan refugees in collaboration with United Nations High Commissioner for Refugees (UNHCR).\nThe centres located in Peshawar, Quetta, Karachi, Lahore, Islamabad, Nowshera, Mianwali, Lower Dir, Haripur and Kohat will serve Afghan refugees who hold cards with an expiry date till June 2023, said a press release on Thursday.\nThe PCM centers would update, correct and modify information pertaining to the PoR card holders which was run by Pakistan’s National Database and Registration Authority (NADRA).\nChief Project Officer for NADRA Gohar Ahmed, Commissioner for Afghan Refugees (HQ) Farid Ullah Jan and the UNHCR Representative in Pakistan Noriko Yoshida formally inaugurated the Center in the Federal Capital.\nSpeaking on the occasion, Gohar Ahmed that the PCM operations had been extended to nationwide sites, equipped with 80 counters and 140 IT professionals to serve Afghan citizens more effectively.“By virtue of support from UNHCR\nand other development partners, PoR cardholders can register their newborn children and obtain a birth certificate,” he added.\nIn brief remarks, Farid Ullah Jan said it was a landmark achievement that the data of Afghan refugees were verified and updated during the DRIVE exercise conducted last year, and extended his appreciation to the donor community for their continued support. He expressed the hope that the PCM centres will enable refugees to get swift services in their respective areas.\nSpeaking on the occasion, the UNHCR Representative underscored the significance of the identity document which grants legal status and protected Afghan refugees from arbitrary detention and deportation during their stay in Pakistan as well as provided access to essential services.\n“It is important for Afghan refugees to hold updated cards that will help ensure access to health, education and other facilities,” she said.\nPakistan hosts some 1.3 million registered Afghan refugees who are holding PoR cards.",
  "retrievedAt": "2025-08-11T16:03:10.007Z"
}
