{
  "title": "Rights of religious minorities to be protected: PM",
  "link": "https://www.app.com.pk/national/rights-of-religious-minorities-to-be-protected-pm/",
  "date_published": "2022-12-22T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): Prime Minister Shehbaz Sharif Thursday assured that the government of Pakistan would protect rights of people from all religious minorities including Christians, Sikhs, Hindus and Parsis and would ensure a secure environment for them.\nSpeaking at a ceremony organized here to celebrate Christmas, he said, “We want that Pakistan should move forward according to the thinking and teachings of Quaid e Azam and Allama Muhammad Iqbal who called for peace and brotherhood among all religions.”He reminded that Quaid e Azam in a speech on August 11, 1947, gave a clear message about the equality of rights of minorities.Under the constitution of Pakistan, people of all religions in the country had equal constitutional and political rights and they were allowed to take part in all fields of life, he added.\nUnfortunately, Shehbaz said due to extremism and terrorism in the last decades, a number of incidents happened which was unfortunate and weakened the protections given to the minorities who felt threatened and vulnerable.\nHowever, the Pakistani state succeeded in eradicating terrorism and extremism, he said while referring to the latest incident in Bannu where terrorists made people hostage but later the armed forces overcame and killed the terrorists. The personnel of armed forces embraced martyrdom during the incident, he noted.\nWhile felicitating the Christian community on Christmas, he said, “We all share the happiness of the Christian community on this auspicious occasion.”\nHe lauded the Christian community for its sacrifices and services for the nation right from the start of the movement for the independence of Pakistan.People from all walks of life including teachers, students, religious scholars, doctors, engineers and labour contributed to the independence of Pakistan, he observed.\n“We value from the core of our heart your services for Pakistan. Your services for the progress and development of Pakistan will be remembered in golden words. Justice Cornelius, Group Captain Cecil Chaudhry, Sister Ruth Pfau who was German and served the Pakistani nation for 55 years, were examples of service to Pakistan.”He said the Christian community contributed immensely in the fields of education and defence. “I myself got education in a missionary school Sacred Heart.”\nHe said Hazrat Isa gave a message of peace, brotherhood and love, to the humanity.The holy Quran mentioned Hazrat Isa and Hazrat Maryam on numerous occasions, he said adding all religions promoted peace and brotherhood in the world.\n“People from all religions across the world whether Christians, Hindus, Sikhs, Parsis or Muslims wanted to live in peace and harmony. Nobody should oppress and do injustice to others or violate rights of others and change the religion of each other by force. Islam nor any other religion allow this.” Islam ordered that rights of people of all religions should be protected, he stressed.He assured that as per demand of the religious minorities a national minority commission would be formed after legislation in the Parliament.\nMinister for Religious Affairs Mufti Abdul Shakoor while speaking on the occasion, said Islam taught that followers of all religions should be treated equally. He felicitated the Christian community on the occasion of Christmas.\nThe Prime Minister along with bishops and leaders of the Christian community and other minorities also cut a Christmas cake on the occasion.",
  "retrievedAt": "2025-08-11T16:03:05.847Z"
}
