{
  "title": "NA Special Committee directs to regularize all contractual employees, daily wagers in 15 days",
  "link": "https://www.app.com.pk/national/na-special-committee-directs-to-regularize-all-contractual-employees-daily-wagers-in-15-days-2/",
  "date_published": "2022-12-21T19:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):The Special Committee of the National Assembly for Affected Employees on Wednesday issued an across-the-board directive to all ministries/divisions/corporations/autonomous bodies to regularize the services of contractual, daily-wages, and contingent employees in 15 days.\nThe committee, which met with Qadir Khan Mandokhel in the chair, observed in its directive that all those employees, who entered into service on contract, daily wages, or contingent basis by November 30, 2022, in any government department across Pakistan were eligible to be regularized.\nThe departments were directed to scrutinize the cases of contractual employees on their own and submit a compliance report to the committee within 15 days time period.\nThe committee also banned fresh appointments until the services of all contractual/daily-wagers and contingent employees were regularized and during the process transfer /posting of any employee, especially in lower grade, would be considered harassment.\nIt also directed all the ministries to resolve issues of pay fixation and seniority of sacked restored employees in line with the judgment of the Supreme Court of Pakistan.\nThe committee issued show-cause notices to the secretaries of Interior, Railways and Power Division ministries and the Federal Investigation Agency (FIA) director general for not attending its meetings.\nIt also reprimanded the Chief Executive Officer of K-Electric for his absence and summoned him to appear before it in person along with the written reply of the show-cause notice issued to him in the last meeting.\nThe committee banned the entry of CEO MEPCO in its meetings for “attempting to influence its chairman”.\nChairman Qadir Mandokhel constituted a sub-committee comprising Qasim Noon and Ali Gohar Baloch to scrutinize cases of fake degrees in the OGDCL and present a report to the committee for final directions.\nSimilarly, the committee constituted another sub-committee comprising Aliya Kamran, Usama Qadri, Kishware Zehra and Ramesh Kumar to scrutinize the cases of employees of Sui Southern Gas Company (SSGC) and submit a report.\nAnother sub-committee comprising Nawab Sher Ali and Naveed Jeeva was tasked to scrutinize the cases of employees of Sui Northern Gas Pipe Line (SNGPL) and submit a report in one month.\nThe committee also directed to remove ban on employment on sons quota in government departments and implement the Prime Minister’s Assistance package in letter and spirit. It also sought a report of those ministries/departments, which had already Implemented the PM Assistance Package and sons quota in a week time.",
  "retrievedAt": "2025-08-11T16:03:15.760Z"
}
