{
  "title": "President for preventive care to address health-related challenges",
  "link": "https://www.app.com.pk/national/president-underlines-need-for-combined-efforts-to-overcome-education-health-economic-issues/",
  "date_published": "2024-02-20T08:32:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Feb 20 (APP): President Dr Arif Alvi on Tuesday stressed the need for adopting preventive care to address health-related challenges, especially oral diseases, in Pakistan, adding that over 90 per cent of dental issues could be prevented by adopting healthy habits.\nThe president said that a resource-constrained country like Pakistan could not afford to provide curative care to such a large population, however, creating awareness could help reduce the disease burden on the country’s health sector.\nThe president expressed these views while addressing the National Health Summit organized by the Rawalpindi Chamber of Commerce and Industry (RCCI).\nSpeaking on the occasion, the president highlighted the importance of physical hygiene, he said that from the Islamic teachings, it stood proved that personal hygiene was linked with spiritual purity.\nHe said that poor dental health could lead to other problems, affecting the overall well-being of individuals.\nHe said about 90 per cent dental cases could be cured if prevention habits were developed by the people including regular brushing of teeth, similar was the case with communicable diseases.\nThe president urged all the stakeholders and the business community to play their role in creating awareness among the masses about health-related issues including dental health, mental stress and population growth.\nThe president said that the entire nation had set a precedent in the world with their collective efforts during the Covid-19 pandemic and stressed that such a display of unity was critical to address disconcerting issues in education, health and economic sectors.\nHe highlighted that during the Covid-19 pandemic, when the deadly wave was hitting the globe, Pakistan emerged as the third best-performing country in the world to avert the damages in health and economic sectors.\nHe said it was all possible due to the collective efforts and cooperation of the people and all stakeholders who displayed unison in their efforts to ward off the spread of the pandemic.\n“That precedent has carved a path for the future which can guide us in our endeavours to overcome the contemporary challenges,” he opined.\nThe serious issue of over 26 million out-of-school children required joint efforts and mosques could be utilized to impart education to these children, he added.\nThe president mentioned Bangladesh, India and Sri Lanka where the literacy rate among the children was higher than Pakistan.\nHe also cited the precedent of China that lifted millions of its people out of poverty by focusing on health and education sectors.\n“The State can show the path but it is the responsibility of all stakeholders of the society to share the responsibility by addressing issues in the education and health sectors,” he added.\nPresident Alvi further stressed upon focusing on priorities and continuity of policies which required public involvement.\nAbout 24 percent of the population in the country was suffering from the mental stress due to various reasons which should be addressed comprehensively, he said, adding that awareness about the child and drug abuse should be created through different mediums.\nThe president also called for morality-based principles in the world which was overwhelmed by the vested interests and reiterated the removal of disparity in distribution of wealth and accumulation of resources in fewer hands.\nEarlier, speaking on the occasion, RCCI President Saqib Rafique said President Dr Arif Alvi was the first head of state who visited the chamber’s building and encouraged the business community for their involvement in different initiatives taken for the health of the general public.\nHe said almost 90 per cent of people could not afford the expensive treatment of dentistry, adding the dental related diseases could be avoided with just due care and prevention.\nHe said the chamber was making all possible measures to extend better health facilities in every nook and cranny of the Rawalpindi division, under which it had arranged mobile dental units for diagnosing chronic disease caused by bad oral hygiene.\nBesides, it was carrying out water testing and data collection in 74 union councils of the Rawalpindi division, he added.\nChairman RCCI Standing Committee on Health Dr Shimail Daud Arain stressed the need for creating awareness among the masses about oral health as around 90 percent of Pakistanis were suffering from dental-related diseases.\nRCCI Group leader Sohail Altaf said, “a strong economy guarantees the strong national defence that comes from political stability and consistency in policies.”",
  "retrievedAt": "2025-08-11T00:49:30.065Z"
}
