{
  "title": "Senate body approves Int’l Institute for Technology, Culture, Health Sciences Bill 2024",
  "link": "https://www.app.com.pk/national/senate-body-approves-intl-institute-for-technology-culture-health-sciences-bill-2024/",
  "date_published": "2024-02-20T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Senate Standing Committee on Federal Education and Professional Training on Tuesday granted approval to the International Institute for Technology, Culture, and Health Sciences Bill 2024.\nThe committee meeting held at Parliament House, was chaired by Senator Irfan Siddiqui.\nThe session began with the deliberation of the private member’s bill titled “The Higher Education Commission (Amendment) Bill, 2024,” presented by Senator Shahadat Awan during the Senate session on 1st January 2024.\nThis bill, referred to the committee for consideration and report, seeks to establish parliamentary oversight on the functioning of the HEC through the submission of an annual report to both houses. The Committee unanimously approved the Bill.\nAdditionally, the Committee gave its approval to the “The International Institute of Technology, Culture, and Health Sciences Bill 2024,” introduced by Senator Fawzia Arshad in the Senate session on 19th February 2024.\nAs this was the final meeting of the standing committee before dissolution, the Chairman Committee, Senator Irfan Siddiqui expressed gratitude to committee members, the Secretary Ministry of Federal Education and Professional Training, and the Chairman HEC for their unwavering support over the past three years.\nThe committee members, along with officials from the Ministry and HEC, also commended Senator Irfan Siddiqui’s leadership for ensuring the seamless functioning of the committee proceedings.\nThe committee meeting witnessed the presence of Senators Fawzia Arshad, Falak Naz, Engr Rukhsana Zuberi, Shahadat Awan, the Chairman of HEC, and senior officials from the Federal Education Ministry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:48:38.964Z"
}
