{
  "title": "Engro Fertilizers welcomes gas tariff revision as a step in the right direction",
  "link": "https://www.app.com.pk/national/engro-fertilizers-welcomes-gas-tariff-revision-as-a-step-in-the-right-direction/",
  "date_published": "2024-02-20T07:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Engro Fertilizers has welcomed the bold decision of the government to remove the subsidy for fertilizer manufacturers that get their gas from the Sui Northern Gas Pipelines Limited (SNGPL) network, which represents 60% of all fertilizer manufacturing capacity.\nIn a press release issued here on Tuesday, the Engro said that it fully supports the government in taking this first step to partially remove the existing subsidy given to fertilizer manufacturers. “We encourage the government to continue with this bold strategy and completely remove all subsidies so that it can reduce its debt burden, promote efficiency, attract new investments, and help build a stronger future for Pakistan,” it said.\nThe feedstock prices have increased from Rs 580/mmbtu to Rs. 1,597/mmbtu with almost a 300% increase in the cost of producing fertilizer. While this is a step in the right direction, the battle is half won, as the remaining 40% of fertilizer manufacturing capacity that is on the Mari network, is still at the subsidized price of Rs. 580/mmbtu.\nIn the national interest of the country and to fix the problem at the source, the Engro called to completely remove all subsidies from the fertilizer sector. With the complete removal of subsidy, the government is expected to collect Rs. 150 billion, which can then be used for targeted agricultural projects and initiatives that generate economic activity and growth in the country.\nThis is a fantastic opportunity for all fertilizer manufacturers to demonstrate that even without subsidized gas they are globally competitive. When everyone has the same gas price, it will encourage the manufacturers to become more efficient and lean and encourage capital investment in the fertilizer industry.\nIn addition, the fertilizer industry will emerge as a role model that can operate efficiently without any subsidies, thereby encouraging the government to potentially look at removing subsidies from other sectors of the economy as well.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:50:09.981Z"
}
