{
  "title": "NUML organizes national conference on Mother-Tongue",
  "link": "https://www.app.com.pk/national/numl-organizes-national-conference-on-mother-tongue/",
  "date_published": "2024-02-20T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):One day National Conference on “Multilingual and Cultural Implications of Mother-Tongue in context of Globalization” was organized by the Department of Urdu Language & Literature of the National University of Modern Languages (NUML) here on Tuesday.\nRector NUML Major General Shahid Mahmood Kayani (Retd) presided over the session while Dean faculty of Social Sciences & Humanities AIOU Professor Dr. Abdul Aziz Sahir was the chief guest and Dr. Arshid Mahmood Nashaad Associate Professor AIOU was the keynote speaker of the inaugural session.\nDeans, Directors, Heads of Departments, guests, faculty members and a large number of students also attended the session.\nSpeaking on the occasion, Dr. Abdul Aziz said that the ruling elite decides the language of the region. Today, in the era of globalization, the international establishment wants us to think that our languages are being vanished.\nHe was of the view that language cannot be eliminated if it is deeply rooted and linked with the culture & civilization of that region. Dr Sahir further said that the power corridor decides the language of the people and he quoted the example of the Persian language before the east India Company.\nDr. Arshid Mahmood in his address said that there are 70 languages, being spoken in this country, adding it seems that global world has started a campaign to eliminate our beautiful languages. Every language faces the process of evolution hence, we should promote our all-regional languages and Urdu as well.\nIn the concluding remarks, Rector NUML Major General Shahid Kayani said that language is the reflection of the society, and we must give importance to all our languages. He hoped that this conference would pave the way forward\nto further promote Urdu and other regional languages. Later, he distributed shields among the guests.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:49:04.352Z"
}
