{
  "title": "AIOU to establish training and development center",
  "link": "https://www.app.com.pk/national/aiou-to-establish-training-and-development-center/",
  "date_published": "2024-02-20T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):A “Training and Development Center” is being set up at Allama Iqbal Open University (AIOU) for the professional development of academic, administrative and servicing department employees.\nThe Vice Chancellor of AIOU, Prof. Dr. Nasir Mahmood, has taken this initiative, a press release on Tuesday said.\nAs a pilot project, an 8-week training workshop was started yesterday to train hostel staff, sanitation workers, gardeners, and naib qasids.\nDean, Faculty of Education, Prof. Dr. Fazal ur Rahman said that the professional development of staff is crucial at present.\nHe emphasized that the establishment of this training and development centre would mark a new beginning for the university.\nDirector, Adult Literacy Center, Dr. Muhammad Ajmal Chaudhry explained the specifics of the training workshop.\nIn the first phase, the hostel staff will be trained about the basics of hospitality, in the second phase, the sanitary workers and gardeners will be exposed to the best and modern methods of cleaning and beautifying the campus, while in the last phase, naib qasids, security guards and other employees will be trained about public dealing.\nManager, Islamabad Club, Abid Agha, Dr. Muhammad Ajmal Chaudhry, Dr. Zaheer, Dr. Rahmatullah Bhatti and Dr. Tahira Bibi will be the trainers.\nHostel in-charge, Muzaffar Abbas, thanked the Vice Chancellor, Prof. Dr. Nasir Mahmood and the Adult Literacy Department for providing training to the hostel staff.\nAddressing the opening session, Dr. Muhammad Ajmal Chaudhry and President, Employees Welfare Association (EWA), Yasir Mehmood, thanked the Vice Chancellor and described the professional development of the staff as a good initiative.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:49:29.697Z"
}
