{
  "title": "SC adjourns Z.A Bhutto reference till Feb 26",
  "link": "https://www.app.com.pk/national/sc-adjourns-z-a-bhutto-reference-till-feb-26/",
  "date_published": "2024-02-20T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):The Supreme Court of Pakistan on Tuesday adjourned the hearing till February 26, in a presidential reference pertaining to the death sentence of former prime minister Zulfikar Ali Bhutto.\nA nine-member larger bench presided over by Chief Justice of Pakistan Qazi Faez Isa heard the reference.\nJustice Sardar Tariq Masood, Justice Mansoor Ali Shah, Justice Yahya Afridi, Justice Amin ud Din Khan, Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Hassan Azhar Rizvi and Justice Musarrat Hilali were also part of the bench.\nPakistan People’s Party (PPP) Chairman Bilawal Bhutto Zardari was also present during the hearing.\nThe court instructed all respondents to keep their arguments short and comprehensive in the next hearing.\nIn its order, the court said that Lawyer Makhdoom Ali Khan has given his arguments and has stated to file the written comments as well. Other amicus curiae Khalid Javed submitted a written answer and he could also give verbal arguments in the next hearing, it said.\nThe court said that it would also hear the heirs of Zulfikar Ali Bhutto. After the amicus curiae, the court would hear Bilawal Bhutto’s counsel Farooq H. Naek, Raza Rabbani, Zahid Ibrahim and Ahmed Raza Qasuri as well.\nEarlier, during the course of the proceeding, the CJP questioned how the court could draw a line in this case as its jurisdiction was clear and the case couldn’t be reviewed again. He asked that if the top court could order an inquiry or re-open this case on a presidential reference.\nOn the occasion, Advocate Makhdoom Ali Khan concluded his arguments after which, the court wrote an order pertaining to this day’s hearing. Further hearing of the case was then adjourned till the next date.\nIt may be mentioned here that former president Asif Ali Zardari had moved the reference to SC in 2011 under Article 186 of the Constitution.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:48:37.855Z"
}
