{
  "title": "Small railway stations’ upgradation key to boost PR’s revenue: Bilal Kayani",
  "author": null,
  "content": "ISLAMABAD, Apr 26 (APP): Minister of State for Railways Bilal Azhar Kayani Saturday said that the upgradation of small railway stations across all divisions and districts to enhance passenger convenience would significantly increase Pakistan Railways’ revenue.\nSpeaking at a ceremony in Sohawa, Jehlum, Bilal Kayani said that upgrading local stations would reduce the need for passengers to travel long distances to major cities like Karachi, Lahore and Peshawar.\nThe minister announced that on May 10, formal inauguration ceremonies would be held for the addition of stops at Jhelum and Sohawa stations for the Rehman Baba Express and Awam Express trains to facilitate the locals.\nHe said that initially, Rehman Baba Express would stop at Jhelum and Awam Express at Sohawa on a three-month trial basis.\nBilal Kayani stressed that if these stations fail to generate sufficient revenue during the trial period, the stops would be discontinued, in accordance with merit-based assessments.\nCommenting on recent developments involving India, Bilal Kayani sent a clear message from the soil of Jhelum — known for its martyrs and veterans — saying, “Last time, we only served Abhinandan tea; this time, we are ready to serve tea to all of India.”\nThe minister condemned India’s recent unilateral actions, particularly the suspension of the Indus Waters Treaty despite World Bank guarantees, calling them illegal and a violation of international laws.\nHe highlighted that India’s continued Illegal Occupation of Jammu and Kashmir remains unrecognized globally.\nBilal Kayani also pointed to credible evidence linking India to the killings of several individuals in countries like Canada and the United States.\nHe accused India of supporting terrorism within Pakistan, emphasizing that these actions demonstrate India’s blatant disregard for international laws and its role in promoting global terrorism.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:55:06.871Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/small-railway-stations-upgradation-key-to-boost-prs-revenue-bilal-kayani/",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T14:35:00.000Z"
}
