{
  "title": "Leghari terms India’s Indus Water Treaty suspension statement childish, illegal",
  "author": null,
  "content": "DERA GHAZI KHAN, Apr 26 (APP): Federal Minister for Energy Sardar Awais Ahmed Khan Leghari has termed India’s statement regarding the suspension of the Indus Waters Treaty as childish, stupid and illegal.\nHe stated that the treaty could only be revoked through mutual consent between Pakistan and India and could not be unilaterally suspended.\nTalking to media representatives on Saturday, the minister stated that Pakistan’s stance on the Indus Waters Treaty was clear and firm. He said that Pakistan has an undeniable right over every single drop of water under the treaty. He further said that India’s baseless statement has damaged its credibility on the global stage, highlighting India’s involvement in terrorist activities across various countries, including Canada. He affirmed that Pakistan was a stronger country which is fully capable of defending itself.\nThe Minister highlighted the government’s commitment to providing affordable electricity, noting that 18 million consumers were now receiving electricity at a 56% reduced rate. He mentioned efforts to extend subsidies to farmers under the fuel adjustment charges, an initiative not previously available.\nSpeaking on national security, Leghari criticized the former Prime Minister for allegedly allowing the return of 40,000 terrorists from Afghanistan, stating that Pakistan was still dealing with the consequences of that decision. He reiterated that the fight against terrorism would continue until its complete eradication, emphasizing the unflinching resolve of Pakistan’s armed forces and law enforcement agencies.\nEarlier, speaking at the second convocation of Ghazi University, Dera Ghazi Khan, the Minister praised the talent and determination of Pakistan’s young generation but stressed the need for proper platforms to help them advance. He cautioned students against the spread of misinformation through social media and urged them to build a strong and research-based understanding of history.\n“I advise students to strengthen their bond with the Holy Quran, as it was not only a source of guidance but a complete code of life,” he said, recalling similar advice given to him by his late father, former President Sardar Farooq Ahmed Khan Leghari.\nHe also congratulated the graduating students and their parents and encouraged them to work harder and contribute towards the development of South Punjab and Pakistan. He reminded them of the immense sacrifices made by their forefathers for the creation of Pakistan, emphasizing the importance of serious study over misinformation.\nLauding the achievements of Punjab Chief Minister Maryam Nawaz Sharif, he noted that within just one year, the CM Punjab has delivered remarkable successes, including the awarding of 50,000 merit based scholarships and the distribution of over 110,000 laptops. He highlighted that Ghazi University students have already benefited from these initiatives. He also mentioned the provision of buses for 130 new women’s colleges across Punjab and the appointment of 26 new Vice Chancellors.\n“The journey of hard work and success under Chief Minister Maryam Nawaz Sharif’s leadership continues,” he concluded.\nVice Chancellor GHAZI University Dr Ashfaq Ahmed, Member National Assembly (MNA) Sardar Ammar Awais Leghari, MPAs Muhammad Hanif Pitafi, Ali Yousuf Leghari, Salahuddin Khosa, Parliamentary Secretary Sardar Ajmal Chandia, Additional Secretary HEC Qamar-Ul-Zaman Qaisrani and others were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:55:04.749Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/leghari-terms-indias-indus-water-treaty-suspension-statement-childish-illegal/",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T13:24:00.000Z"
}
