{
  "title": "Govt to recover looted money, punish Model Town killers: Raja Basharat",
  "link": "https://www.app.com.pk/national/govt-to-recover-looted-money-punish-model-town-killers-raja-basharat/",
  "date_published": "2020-11-10T15:52:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 10 (APP): Punjab Minister for Law and Parliamentary Affairs Raja Basharat on Tuesday said the government considered it a responsibility to bring back the looted resources and bring the Model Town killers to a logical conclusion.\nThe blood of the martyrs of Model Town was demanding justice, he said and added that law would come into play against those who took the law into their own hands.\nAddressing the media after Punjab Assembly session, he said there was no government business on private members’ day.\nIt was the tradition of the Assembly to bring the bills of public interest only. It had also been a tradition that quorum was not indicated on Private Member’s Day but the attitude of the Opposition on Private Member’s Day was extremely undemocratic which should be condemned, he maintained.\n“The attitude of the opposition in the meeting for two days was not democratic,” adding that democratic traditions demanded to give suggestions for the betterment of the people but there was only cry for relief for those who looted billions of rupees and went abroad.\nThe minister said that if Nawaz Sharif’s name was mentioned, he was a convict and a fugitive from the judiciary.\nIf his voice was raised in the House, it was an insult to the courts, he added.\nRaja Basharat said the PML-N was the only party facing theft and looting charges.\nIf the thieves wanted to use any pressure to save the leadership, Prime Minister Imran Khan clarified that the thieves would not get NRO and no compromise with the thieves but to take all possible steps to bring back the looted wealth, he asserted.\nThe minister said the Chairman NAB had recovered most of the money from the corrupt people in the tenure of present government.",
  "retrievedAt": "2025-08-11T19:59:50.483Z"
}
