{
  "title": "India’s colonial designs major threat to regional, global peace: Afridi",
  "link": "https://www.app.com.pk/national/indias-colonial-designs-major-threat-to-regional-global-peace-afridi/",
  "date_published": "2020-11-10T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): Chairman Pakistan Parliamentary Committee on Kashmir Shehryar Khan Afridi Tuesday warned that Indian colonial designs and occupational and expansionist agenda was a major threat to regional and global peace and development.\nAddressing a seminar hosted by the World Kashmir Forum, he said it was prerogative of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) to decide through a free and transparent plebiscite whether they want to live with Pakistan or India.\nReferring to the statement of the United Kingdom military chief General Sir Nick Carter that the threat of 3rd World War is real, Afridi said: “Pakistan and India may head to a nuclear war if Kashmir dispute is not amicably resolved.”\n“The UN and the world need to immediately take practical steps to resolve Kashmir dispute to help avoid a nuclear war in the region where three nuclear neighbors – Pakistan, India and China are involved in border disputes,” he said.\nAfridi said Pakistan and India had fought three all out wars beside two limited wars on Kashmir.\n“China and India are locked in another border dispute in Kashmir. Threat of a nuclear war is real now,” he said.\n“Indian occupational regime in IIOJK is so fearful that it has put restrictions on the elections of Jammu and Kashmir High Court Bar Association, asking it to first submit explanation over its constitution which states that Jammu and Kashmir is a disputed territory.\nBut such tactics would fail as the people of Jammu and Kashmir have decided to offer any sacrifice required for freedom from Indian occupation,” said the Kashmir Committee chairman.\nShehryar Afridi said that the Hindutva regime of India did not learn anything about the history of Kashmir as the Indian Prime Minister with fake degree had no knowledge of history and law.\nNeither Kashmiri people nor Pakistan took Kashmir dispute to the UNSC. Rather it was Indian Prime Minister Jawaharlal Nehru who took the Kashmir dispute to the UNSC and begged for its intervention and hold plebiscite, he said.\nThere are at least 20 UN resolutions which call for holding referendum in Jammu and Kashmir region to decide its political fate but India has been delaying the process.\nAfridi said the Indian occupational forces were committing worst war crimes in Indian Illegally Occupied Jammu and Kashmir.\n“Hindutva regime is putting extreme media gags to suppress the voices of media but brave Kashmiri journalists are writing new chapter of resistance in the history of Jammu and Kashmir,” Afridi asserted .\nHe called upon the UN experts on Human Rights and Freedom of Expression to make an immediate intervention into the Indian government’s illegal transfer of 2.4 lakh kanals of land in IIOJK to Industries and Commerce Divisions of India.\n“All Indian actions in IIOJK are illegal and in blatant violation of the United Nations resolutions on the Kashmir dispute and are aimed at genocide of Kashmiris,” he said.\n“I ask the UN experts to take note of the unabated raids of National Investigation Agency (NIA) of India on offices and residences of human rights defenders, journalists and of members of civil society, humanitarian aid organizations operating in Indian Illegally Occupied Jammu and Kashmir,” Afridi demanded.\nHe said that the NIA had been creating fear among the activists of human rights organizations and journalists since October 28 so that the media and human rights organizations do not report about India’s genocidal actions against Kashmiris.\n“Hindutva regime of India wants to cover up the ongoing genocide in Kashmir by gagging the voices of media and human rights organizations. Amnesty India was forced to shut down its operations in India last month.\nAmnesty International also has condemned the Indian government’s ongoing campaign against human rights organizations and the media,” he said.\nShehryar Afridi said the Modi government must understand that “truth cannot be hidden by such raids and atmosphere of fear”.\n“RSS goons and Modi administration cannot fool the world on Kashmiri genocide. We will continue to expose the inhuman actions of the colonial rulers in Kashmir.\nThe world must break its criminal silence and give freedom to Kashmiris”.\nHe said nations were formed when they were connected to their foundation. “Kashmiris are glued to their roots.\nThey cannot be fooled by the occupational regime of Jammu and Kashmir,” he added.\n“We pay tributes to our heroes. Our heroes are performing significant tasks in every field.\nMy salutes to the doctors, paramedical staff and the Armed Forces who have been instrumental in defeating the coronavirus pandemic under the vision and strategy of Prime Minister Imran Khan,” Afridi said in his concluding remarks.\nPresident Azad Jammu and Kashmir Sardar Masood Khan, former Ambassador Abdul Basit, World Kashmir Forum President Haji Rafique Pardesi, Former Attorney General for Pakistan Anwar Mansoor Khan and others also addressed the forum.",
  "retrievedAt": "2025-08-11T19:59:53.321Z"
}
