{
  "title": "SACM Dr. Firdous for capacity building of provincial Information dept",
  "link": "https://www.app.com.pk/national/sacm-dr-firdous-for-capacity-building-of-provincial-information-dept/",
  "date_published": "2020-11-10T17:15:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 10 (APP): Special Assistant to Chief Minister Punjab (SACM) on Information Dr. Firdous Ashiq Awan on Tuesday said the Punjab Information Department would be reorganized in accordance with the modern-day trends in order to keep pace with the modern times.\nPresiding over a meeting at the DGPR Headquarters here, she said capacity building of the department was necessary and it was not possible without digitization, adding, “Information academy will be set up in Punjab a la Information Academy of the federal government.”\nDr. Fridous Ashiq Awan also directed to launch an FM radio and a YouTube channel to highlight performance of the provincial government in a befitting manner.\nDirector General Public Relations Muhammad Aslam Dogar and other officers attached with different provincial departments attended the meeting.\nThe SACM on Information said the world had become a global village, adding that digitalization of Pakistan was the only option to connect Pakistan with rest of the world. She said role of media was very important to provide awareness to the masses.\nDr. Firdous Ashiq Awan said specialized training courses would be arranged for the Information officers and journalists belonging to private institutions.\nAnnouncing to evaluate performance of the PROs on daily basis, she said the department would announce “PRO of the month” who would be given a commendation certificate and honorarium.\nThe SACM said the opposition tried to create an impression that they did a lot of work during their tenure whereas the situation was opposite and instead they used to blow their own trumpet.\nShe said, “Focus of the PTI government is the welfare of the public and we are working day and night on it without blowing our trumpet.”\nDr. Firdous Ashiq said the electronic and digital media cells of the DGPR would be transformed into directorates.\nLater, the SACM on Information Dr. Firdous Ashiq Awan met Bureau Chiefs of Lahore based private television channels and informed them about the government’s media policy.\nShe said welfare of journalists was top priority of the government and it considered media the best way to convey the message to the public.\nDr. Firdous Ashiq said the PTI government was making strenuous efforts to uplift the lives of masses and there was a strong need to convey it to the general public through media. She said the PTI government believed in staying in touch with everyone and avoiding confrontation.",
  "retrievedAt": "2025-08-11T19:59:47.938Z"
}
