{
  "title": "Citizens of all faiths enjoying equal rights in Pakistan: PM",
  "link": "https://www.app.com.pk/national/citizens-of-all-faiths-enjoying-equal-rights-in-pakistan-pm/",
  "date_published": "2023-12-23T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar Saturday reiterated that citizens of all faiths including Hindus, Sikhs and Christians were enjoying equal rights in Pakistan with dignity and the government would ensure protection of their places of worship.\nSpeaking at an event organized to celebrate Christmas here, he felicitated the Christian community on behalf of the government and people of Pakistan.\nHe said Prophet Muhammad (PBUH) signed the treaty of Najran that assured protection to the places of worship of Christians.\nIn view of that treaty, it was obligatory for the Muslims for all times to come to protect the religious places of Christians, he said adding, “We need to promote harmony, peace and love.”\nHe recounted that a Christian King was the first one to lend support to the Muslims in their early days.\nHe said it was obligatory for Muslims to have faith in all prophets from Prophet Adam to Prophet Muhammad (PBUH).\nAll Prophets were a guiding light for humanity, he said adding spirituality was a cure for the ills of humanity despite all the technological progress that the humans had made.\nHe recalled the first speech of Quaid-e-Azam Muhammad Ali Jinnah in the constituent assembly in which he outlined the basic principles of the state of Pakistan.\nHe quoted the Quaid as saying that “in course of time Hindus would cease to be Hindus and Muslims would cease to be Muslims, not in the religious sense, because that is the personal faith of each individual, but in the political sense as citizens of the State.”\nIn this way, Quaid-e-Azam made it clear that all Pakistani citizens had the same political rights, he stressed.\nThe prime minister said Quaid-e-Azam foresaw that Muslims, Christians and other communities would be denied their religious freedoms in India as Hindutva was raising its head at that time.\n“We will resist all kinds of fascism. Pakistan is the flag carrier of inclusiveness and harmony.”\n“We are free to choose our faith. God, Prophets and their companions did not force any body to choose their faith. The free will is awarded by the divine. God respects my dignity then how can it be flouted by any government or ideology,” he continued.\nHe said Pakistan had its challenges and it was a victim of terrorism and thousands of its martyrs performed their national duty and defended every inch of the territory of the great nation of Pakistan.\n“Our valiant armed forces which included members of all religious communities were defending and protecting our shores, land, sea, and air and we take great pride in their valour,” he added.\nHe lauded the role of minorities especially the Christian community in progress of Pakistan in the fields of business, education and health.\nChristian teachers and missionary schools contributed immensely in shaping societies in Pakistan, India, Bangladesh and Sri Lanka, he noted.\nPM Kakar said when blasphemy was committed in the west against Prophet Muhammad (PBUH) it was painful for Muslims.\nBlasphemy should not be allowed in the name of freedom of expression, he added.\nTalking about the plight of Palestinians, he called for immediate peace in Palestine and opening of a humanitarian corridor so that vital relief could reach the oppressed Palestinians.\n“Everyone deserved peace and Pakistan wanted peace for everyone in the land of prophets.”\nMinister for Human Rights Khalil George appreciated the prime minister for taking significant steps for betterment of Pakistan.\nHe said people of different faiths were living in the country in harmony, adding the Christian community was very patriotic and contributed to peace and prosperity of Pakistan.\nSpecial Representative to Prime Minister for Inter-Religious Harmony Maulana Tahir Ashrafi and leaders from different faiths were present at the event.\nThe prime minister along with the guests cut a cake to celebrate the occasion of Christmas.",
  "retrievedAt": "2025-08-11T11:10:15.187Z"
}
