{
  "title": "Elderly, medically vulnerable teachers appeal for exemption from polling duties",
  "link": "https://www.app.com.pk/national/elderly-medically-vulnerable-teachers-appeal-for-exemption-from-polling-duties/",
  "date_published": "2023-12-23T07:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): Elderly and medically vulnerable teaching and non-teaching staff of educational institutions have appealed for exemption from their duties at polling stations during general election 2024.\nThe Election Commission of Pakistan (ECP) has recently announced a training schedule for polling staff, a national duty that is mandatory and cannot be refused.\nThe staff of educational institutions are predominantly called upon for polling duties. The lack of consideration for the health and well-being of many teachers is highlighted by the fact that even those suffering from chronic conditions like heart problems are being appointed for election duties.\nThe situation is exacerbated by the apparent absence of engagement of staff from other ministries and divisions by the Election Commission, limiting the pool of resources available for such critical roles.\nThis has raised concerns among the senior educators about the potential impact on their health.\nA senior women teacher, speaking to APP, expressed the physical challenges associated with age, stating, “I am 59 years old and at the verge of retirement and facing multiple health issues.\nThe teachers like me should be exempted from the polling duty which is a hustle job because it involves a range of responsibilities that can be physically and mentally demanding.”\nAs per medical experts, individuals aged beyond the fifth decade often experience a decline in muscle strength, aerobic capacity, and cognitive abilities. Factors such as slower reaction times and caution increase with age, presenting a trade-off between speed and accuracy. This is particularly concerning given the fast-paced and high-stress environment of election duties.\nEmphasizing the need for younger, energetic teachers to take on these responsibilities, a young teacher said, “The young teachers who are energetic and enjoy performing such duties should be appointed as polling staff. Election duties typically require long hours, attention to detail, and the ability to handle various logistical challenges.\nPolling stations are busy, with a continuous flow of voters, and the responsibility of ensuring a smooth and fair electoral process falls on the shoulders of the individuals working during elections.\nThis includes tasks such as verifying voter identities, managing queues, handling potential issues, and maintaining the overall integrity of the electoral process. It is a difficult job for those senior teachers who are in their late fifties.”\nAdding to the plea, an Associate Professor of a local college, also choosing to remain anonymous, disclosed his struggle with diabetes and hypertension, conditions that make the physically demanding and stressful nature of polling duties even more challenging.\nHe stressed, “Teachers above the age of 55, especially those with chronic health conditions, should be exempted from polling duty because the pressure associated with election duties increases as the responsibility for maintaining order and facilitating a transparent voting process rests on the staff involved.\nThis demanding nature of the job can be particularly challenging for those who may not have the physical stamina or cognitive agility required for such tasks.”\nAnother teacher said, “Directors within the Federal Directorate of Education, who are in the same grades as the teachers, seem to be exempt from such duties, raising questions about the fairness and equity of the appointment process.\nThis has left many to wonder why teachers from the education department bear the brunt of election duties, impacting not only their well-being but also the education of students during their absence.\nThe teachers urged the authorities to consider their age and health conditions when assigning polling duties, suggesting that exemptions for those aged 55 and above or with specific health concerns would be a reasonable and compassionate approach.",
  "retrievedAt": "2025-08-11T11:10:41.804Z"
}
