{
  "title": "Pakistan’s talented youth takes center stage at PNCA drama festival",
  "link": "https://www.app.com.pk/national/pakistans-talented-youth-takes-center-stage-at-pnca-drama-festival/",
  "date_published": "2023-12-23T18:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):The Pakistan National Council of the Arts (PNCA) on Saturday is buzzing with vibrant performances as the three-day drama festival unfolds on the second day, a diverse array of acts filled the stage, ranging from stand-up comedy and Sufi dance to puppet shows and thought-provoking plays.\nThe Government College University Faisalabad brought the energy with a dance performance, while Team Reliant presented the intriguing play “Mystery 404.” Quaid-e-Azam University showcased their talent with a stand-up comedy play titled “Robo Khan,” and also treated the audience to a Rabab music performance. National Council of Arts (NCA) Rawalpindi impressed with a drama exhibition, and Peace University Wow captured hearts with their play “Meri Zara Nishaan.”\nThe festival, organized in collaboration with Quaid-e-Azam University Islamabad, features 23 university students and theatre groups from across Pakistan, Director PR Dr Bilal Karim said while talking to APP. The stage is set for a mix of performances, including cultural dances, engaging plays, and even audience-inspired sketches.\nThis cultural extravaganza not only entertains but also aims to promote healthy activities among the youth. The plays not only deliver strong expressions but also carry profound messages, weaving together acting, dialogue delivery, and script techniques.\nThe PNCA Drama Festival is not just a platform for showcasing talent; it’s a celebration of the vibrant theatre scene in Pakistan. With a theme centred on promoting peace, love, and harmony, the festival brings alive the concept of theatre in the twin cities, offering a quality entertainment experience to residents and art lovers alike.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:10:36.117Z"
}
