{
  "title": "Reuters X accounts ‘withheld’ in India: local media - World - DAWN.COM",
  "author": null,
  "content": "The Reuters news agency’s X account handles were “withheld” in India “in response to a legal demand”, Indian outlet The Print reported on Sunday.\n\nThe accounts for both Reuters and Reuters World were inaccessible in India; however, users were still able to access 30 other Reuters accounts, The Print added. The Reuters news website is also accessible.\n\nX users in India have posted screenshots showing that they are unable to access the news agency’s accounts.\n\nReuters has yet to issue a statement, while the Indian Ministry of Electronics and Information Technology (MeitY) told India Today that no order was given to restrict the accounts.\n\n“There is no requirement from the Government of India to withhold the Reuters handle. We are continuously working with X to resolve the problem,” an official spokesperson for the ministry told outlet India Today.\n\nThe Print reported that in previous instances of X restricting access to accounts in India due to legal requirements, the platform issued statements through its Global Government Affairs handle.\n\nThe account has yet to issue a statement on the restriction.\n\nThis is not the first time India has blocked accounts on the platform, formerly known as Twitter.\n\nAccording to an Instagram post by The Hindustan Times, the accounts were withheld as per orders issued amid Operation Sindoor, when India launched missiles at sites in Pakistan in May.\n\n“The centre (government) has reportedly responded to social media platform X blocking the account of news agency Reuters in India, saying that it is a mistake on the part of the Elon Musk-owned company,” the outlet wrote in the post’s caption.\n\nAccording to The Print, X issued a statement on May 8 saying it had “received executive orders from the Indian government” to “block over 8,000 accounts in India, subject to potential penalties including significant fines and imprisonment of the company’s local employees”.\n\n“In most cases, the Indian government has not specified which posts from an account have violated India’s local laws. For a significant number of accounts, we did not receive any evidence or justification to block the accounts,” X wrote.\n\nThough X stated that it disagreed with New Delhi’s demands, the platform withheld access to the account solely within India.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:47:50.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922497/reuters-x-accounts-withheld-in-india-local-media",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T12:11:37.000Z"
}
