{
  "title": "Deep strikes as India hammer England in second Test - Sport - DAWN.COM",
  "author": null,
  "content": "Akash Deep took 10 wickets in a Test match for the first time as India thrashed England by 336 runs at Edgbaston on Sunday for a series-levelling win.\n\nDeep was playing in the second Test of the five-match series after India rested outstanding quick Jasprit Bumrah.\n\nThe 28-year-old took 6-99 as England, set a mammoth 608 runs to win, were dismissed for 271 on the fifth day.\n\nDeep’s match figures of 10-147 were far and away the best of his eight-Test career.\n\nJamie Smith was the lone England batter to pass fifty in the second innings, with the wicketkeeper’s 88 following his brilliant 184 not out the first time around.\n\nA crushing victory gave India their maiden Test win in nine matches at Edgbaston following seven defeats and a draw at the Birmingham ground.\n\nThis game was also a personal triumph for India captain Shubman Gill after he became the first batsman in Test cricket to post scores of 250 and 150 in the same match.\n\nThe 25-year-old’s majestic 269 in the first innings was followed by a dashing 161 off 162 balls in the second.\n\nGill has now scored three centuries in his first two Tests as captain following his 147 during India’s five-wicket loss in the series opener at Headingley.\n\nHistory was against England when they resumed at 72-3 after rain delayed Sunday’s start by more than 90 minutes.\n\nNo Test side has made more in the fourth innings to win than the West Indies’ 418 against Australia at St John’s in 2003.\n\nIndia, bidding for just a fourth series win in England, struck an early blow when Ollie Pope failed to add his overnight 24 by deflecting a Deep ball of extra bounce onto the stumps.\n\nHis exit brought in England captain Ben Stokes, on a king pair after his first golden duck in Tests in the first innings.\n\nBut Stokes, without a Test hundred in two years, avoided the embarrassment of two noughts in the same match with a legside flick.\n\nEngland were soon 83-5, however, when Harry Brook was lbw for 23 to a Deep delivery that hit him on the back knee.\n\nBrook, who made 158 in England’s first innings while sharing a stand of over 300 with Smith that kept the hosts afloat, optimistically reviewed.\n\nBut the confirmation of his dismissal was greeted by raucous cheers from the large number of India fans at Edgbaston.\n\nSmith helped Stokes briefly keep India at bay during a sixth-wicket partnership of 70.\n\nBut in the last over before lunch Stokes was lbw for 33 to off-spinner Washington Sundar, the first India bowler other than Deep or Mohammed Siraj to take a wicket in the match.\n\nEngland were 153-6 at the interval and after lunch Smith defiantly hit 17 off a Sundar over, including two soaring straight sixes.\n\nBut Chris Woakes fell tamely for seven when a miscued pull off Prasidh Krishna lobbed gently to midwicket.\n\nSmith pulled Deep for two successive sixes to go to 88.\n\nBut it was a case of third time unlucky for the 24-year-old when trying to repeat the shot next ball, he holed out to Sundar at deep backward square leg off a well-disguised slower delivery to give Deep his fifth wicket of the innings.\n\nAt 226-8, the writing was on the wall for England.\n\nTailender Josh Tongue was brilliantly caught by a diving Siraj at midwicket before Brydon Carse holed out off Deep to cover where Gill, the player of the match, fittingly took the clinching catch.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/06224021b574630.jpg",
  "retrievedAt": "2025-08-17T19:47:44.194Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922506/deep-strikes-as-india-hammer-england-in-second-test",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T17:42:42.000Z"
}
