{
  "title": "How Hyderabad is keeping the memory of Karbala alive - Pakistan - DAWN.COM",
  "author": null,
  "content": "It was 3:30am in Khokhar Mohalla, one of Hyderabad’s oldest neighbourhoods, when streams of women clad in black crossed security barriers on July 4. Some carried sleepy toddlers in their arms; others held the hands of young boys or walked alongside their husbands. Men and children also mingled in the growing crowd.\n\nThey had come together for the cherished ritual of mannat at an Imambargah set in a modest house dating back to 1876. The passageway leading to the entrance was already packed with scores of women. “I couldn’t get in, but my son has gone inside,” said a young woman anxiously.\n\nMoments later, her son, Danyal, returned. “I saw the ziarat. Let’s go now,” he told his mother, who had brought him all the way from their home in Qasimabad to seek blessings. “We’re not Shia Muslims — we’re Maulaee,” she clarified with quiet pride, using a term that reflects deep devotion to the fourth caliph of Islam and his family, who were martyred in Karbala in 61 Hijri.\n\nThe sea of women had gathered to perform the ritual of the mehndi of Shahzada Qasim, the son of Hazrat Imam Hassan (RA). Dozens of police officers had cordoned off the area, erecting barricades that brought the usual flow of traffic to a halt.\n\nAt this historic Imambargah, the mehndi is a women-led tradition. Inside, men and women alike lit candles, holding it on their palms as they whispered prayers for their wishes to be fulfilled. Many women brought adorned replicas of cradles into the house — symbols of gratitude that their prayers for a child had been answered.\n\n“My wife has come here today,” said Sumair, cradling his baby girl in his arms. “She prayed here last year that I find a job,” he continued. “This year, I was appointed in the police, and so she has returned to offer thanks and pay her respect.”\n\nAnother young man stood clutching a flickering candle. “I want to marry, but my marriage keeps getting delayed,” said Awais.\n\nThe more one lingers among these devoted visitors, the more stories like his emerge — each a window into hearts burdened with worries and brimming with faith.\n\nDraped in black attire, which symbolises mourning for the martyrs of Karbala, Apa Kulsoom, sat quietly inside the Imambargah Gul Shah Bukhari, established in 1876. She is the custodian of the place which overflows with striking symbols of devotion: tiny cradles, decorated sehra, platters of sweets, replicas of alams, and henna. This ceremony, held every Muharram 7, is commonly known as Gul Shah ki Mehndi, a tradition that continues to draw the faithful year after year.\n\nThese items will be taken to Qadam Gah Maula Ali at Fajr on Muharram 8, when mourners from the pir that originates in Tando Mir Mahmood — one of Hyderabad’s oldest localities — arrive at Apa’s Imambargah. This pir, known as Jamaytan jo pir, has been carried out by Anjuman Safina-i-Hussaini since 1909.\n\nThe term pir, rooted in the Sindhi language, refers to the sacred ground or designated space for azadari — mourning rituals — or the very site where an alam rises skyward, bringing together people to honour the memory of Karbala.\n\nAs the ritual unfolds, women and young girls recite eulogies, recalling the martyrdom of Imam Hussain — the beloved grandson of the Holy Prophet (PBUH) and son of Hazrat Ali (AS) — who, along with 72 of his loyal companions, was slain on the plains of Karbala, Iraq. Among the symbols of grief and reverence are small cradles, representing Ali Asghar, Imam Hussain’s youngest son and one of the youngest martyrs of Karbala.\n\nSalamat Feroz is a poet who composed a tune for Shahzada Qasim’s mehndi ritual, which was recited by Rahat Fateh Ali Khan in 2022. This year, he produced Sajjad AS ki manzil bhari hai, in memory of Hazrat Sajjad, once again brought to life through Rahat’s stirring voice.\n\nReflecting on the significance of these rituals, Feroz explained, “The faithful perform the mehndi ceremony as an expression of their deep love for the Ahl-e-Bait. We all know Hazrat Qasim’s wedding never happened in Karbala — but it is precisely this unfulfilled hope that inspires people to continue this ritual today, keeping his memory alive.”\n\nHistorically, Hyderabad served as the capital of Sindh for many years, until the British conquest led by Charles Napier in 1843 wrested it from the Talpur dynasty. The British forces toppled the Talpur rulers and exiled them to Calcutta.\n\nHyderabad, named in honour of Islam’s fourth caliph, is renowned for its rich Muharram traditions, which set it apart from other cities — from its alams and pirs to centuries-old Imambargahs. One of its most unique observances is the mehndi ritual held annually on Muharram 7, a ceremony steeped in reverence.\n\nAt the heart of these traditions stands Qadam Gah Maula Ali which embodies Hyderabad’s spiritual identity. This expansive landmark, which includes a mosque, is primarily known as ‘ziarat’, drawing visitors from across Pakistan and beyond.\n\nPirs and alams are powerful legacies from the Talpur era that shape Hyderabad’s identity even today. During Muharram, they become especially visible, adding a unique character to the city.\n\nAlams are tall wooden structures raised at famous Imambargahs like Qadam Gah, as well as in many homes. The alam denotes a flag, typically carried by military leadesr in battles fought by Muslims during the Holy Prophet’s (PBUH) era.\n\nIn Karbala, explained Salamat Feroz, Imam Hussain (AS) handed over this flag or alam to his step brother, Hazrat Abbas (RA), which is why he is known as Abbas Alamdar [flag bearer]. During the battle, Hazrat Abbas (RA) demonstrated exceptional valour and skills while fighting Yazid’s forces to fetch water for the Imam’s children and holding the alam as well. “He held the alam on his body somehow even after losing both of his arms,” said Feroz.\n\n“So, these alams are seen today on the rooftops of houses and imambargahs in memory of Abbas Alamdar,” he added.\n\nThe structure of any tall alam rests on an iron frame prepared by caretakers, who perform various tasks to ensure its stability before it is finally raised. When the time comes, men — young and old — gather in fervent devotion, their chants of “Labbaik ya Hussain!” echoing through the air, as they pull the structure with synchronised strength, carefully maneuvering it to stand upright at a precise 90-degree angle.\n\nIn the days leading up to Muharram, these alams are respectfully lowered for cleaning and essential refurbishment, before they are raised on or before Muharram 1 amid recitation of nohas. This process, known as nahar, typically begins after Eidul Azha. “Nahar means lowering the alams for beautification, fresh coats of colour, new decorations, or the addition of artistic elements,” explained Salamat.\n\nSome of these alams are incredibly tall. One of the tallest alams — 82ft long — is fixed at Imambargah Anjuman Safina-i-Hussaini. A few years ago, Nisar Bhatti, a carpenter, shared that he crafted two alams of 93ft and 82ft for the Imambargahs of Tando Agha and Aliabad, dating back to 1963.\n\nAnother celebrated alam stands in the Wadhan jo Pir area, famously known as Jhandi Wadhu jo Pir. It has intricately carved peacock motifs, exemplifying a decorative trend that has now become common.\n\nAll famous alams are raised upon the sighting of the Muharram moon, as the ritual dictates. Large crowds gather at every Imambargah to witness their raising. The historic Qadam Gah Maula Ali consistently attracts an impressive turnout during this ceremony. As the massive structures begin to rise, colourful bulbs and decorative lights attached to them burst into brilliance. Considering their massive size, crane-like machines are often used to raise them.\n\nMaintaining or, in some cases, replacing these alams can be a demanding task, reserved for craftsmen who possess the necessary dexterity and experience. This specialised work has its own jargon among those who perform it, passed down through generations. Typically, an alam is fixed into a beautifully ornate, onion-shaped concrete structure called a dikki, which serves both as a foundation and as a work of art. Decorative items such as carved images of pigeons, peacocks, and flower petals embellish the wooden elements of the alam, making the entire display visually captivating for onlookers.\n\nThen there is a circular wooden structure used in the alam, known as the chauk, which is connected to a wooden piece called the dilli in the alam-making jargon. The dilli holds the shama daan. Finally, the kals — made of pipe or wood — carries a human palm, symbolising Hazrat Ghazi Abbas (RA), who was martyred on the 8th of Muharram during the battle of Karbala.\n\n“I believe Qadam Gah’s history dates back to around 1810, and so does its alam’s,” said Kazim Mirza, one of the longest serving custodians of Qadam Gah. “There is an old sketch made by a foreigner in which an alam can be seen at the facade of the Fort (now Pucca Qilla). That very alam was fixed in Qadam Gah during the Talpur era,” he added.\n\nQadam Gah is located off Station Road and has recently undergone refurbishment with Iranian-style architecture. The building’s facade resembles the mausoleum of Hazrat Ali in Najaf Ashraf. A prayer mat made of stone is also kept there.\n\nThe prayer mat bears the imprints of Hazrat Ali’s forehead, hands, knees, and feet in the position of prostration. “This stone prayer mat was gifted by Iran’s ruler, Fatah Shah Kachar, to Mir Karam Ali Talpur, the then ruler of Sindh,” said Mirza. Kazim belongs to the Mirza family, whose ancestors migrated from Georgia and settled in Sindh in the early 19th century.\n\nNo pir is considered complete without the use of the shehnai, a small wooden musical instrument. Different tunes played on the shehnai express the sorrow, grief, and pain endured by Imam Hussain and his 72 companions. These tunes mark the mersias and nohas (elegies).\n\nOn Muharram, the Jamaityan jo Pir is taken out from the Imambargah, and the procession begins with the arrival of mourners. Its first big stopover is at Faqir ka Pir, where devotees from Hyderabad and beyond gather in large numbers. This pir is among the most significant highlights of Hyderabad’s Muharram commemorations. Throughout the journey, which lasts nearly 30 hours, the mourners make several stops at various locations. The procession concludes on Muharram 8 back at the same Imambargah. Over two dozen zuljanahs (horses) are a part of this.\n\nAccording to Dr Imam Ali Mirza, who completed his PhD on Sindhi mersias, “The shehnai travelled from Iran to India and then to Sindh. It is also called nafeer in Persian.” He points out that there is evidence suggesting that, like the naqara, the nafeer was used in Karbala.\n\n“Talpur rulers actively promoted azadari in various ways. Even after their release from Calcutta, they continued to donate money among the people for purposes of nazar-o-niaz,” said Mirza. He further explained that when the Urdu-speaking community migrated from India to Pakistan’s Hyderabad, they introduced their own cultural traditions of Muharram observance. “Their azadari practices remain distinct from those of the local community,” said Imam Mirza, author of Sindh aur Ahl-e-Bait and Sindh ki Azadari.\n\nKazim endorsed Imam’s view, saying that ashara-e-majalis were uncommon in Sindh before Partition. “Our elders used to organise majalis in different areas during Muharram, but after these communities migrated from India, they started holding 10-day majalis at a single location — a tradition that continues to this day at places like Qadam Gah or Mehfil-e-Hussaini,” said Kazim. He noted that while Allama Samar Zaidi from Lucknow had been visiting Tando Thoro in Hyderabad earlier, it was after migration that these 10-day majalis became an integral part of Muharram here.\n\nHyderabad’s central Ashura procession is organised under the aegis of Anjuman-e-Hyderi, established in 1948. The Anjuman is currently headed by Nawaz Bhutto and Raza Irani. The procession starts from Qadam Gah and takes place at Karbala Dadan Shah.\n\nMeanwhile, 10-day majalis are held on Station Road under the patronage of the Asna-Ashari Khoja community, who migrated from India. Their organisation was founded in a small location in Resham Gali in 1948 and has operated from a three-floor building off Station Road since 1967.\n\nOver centuries, these rituals and traditions have been passed down generations, ensuring that the spirit of sacrifice and valour displayed in Karbala remains etched in the minds of Hyderabad’s residents.\n\nHeader image: A shabeeh or replica of the cradle of Imam Ali Asghar, one of the martyrs of Karbala during a pir on Muharram 7.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/05220126a5e9a10.png",
  "retrievedAt": "2025-08-17T19:47:59.154Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922275/how-hyderabad-is-keeping-the-memory-of-karbala-alive",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T08:43:14.000Z"
}
