{
  "title": "Sindh govt, SBCA earn opposition’s ire over Lyari tragedy - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: In a unanimous display of outrage, major opposition parties — the Pakistan Tehreek-i-Insaf (PTI), Muttahida Qaumi Movement-Pakistan (MQM-P) and Jamaat-i-Islami — have condemned the PPP’s Sindh government, the Sindh Building Control Authority (SBCA) and other authorities, accusing them of “criminal negligence” which led to collapse of a building in Lyari killing more than a dozen people.\n\nThe political leaders not only demanded compensation for the affected families, but also called for registration of manslaughter cases against the officials responsible for the tragedy.\n\nAddressing a press conference at the MQM-P’s temporary headquarters in Bahadurabad, Leader of the Opposition in the Sindh Assembly, Ali Khurshidi, said that this was not the first such incident of building collapse.\n\nPTI, Muttahida and JI seek compensation for victims, FIRs against responsible officials\n\n“In this city, illegal constructions are flourishing under the patronage of SBCA officers, and even children are aware of this fact,” he said. “The people are dying, yet illegal constructions are still underway. The SBCA officers are receiving billions of rupees in bribes. Karachi has been handed over to mafias — there’s a dumper mafia, water mafia, and SBCA mafia. In Sindh, no legal work is possible without bribery. The traffic police have also turned bribery into a business.”\n\nPTI leaders visit site of collapsed building\n\nLeaders of PTI led by its Sindh chapter president Haleem Adil Sheikh visited the collapsed building site and met the affected families.\n\nTalking to reporters, Mr Shaikh held the Sindh government and the SBCA responsible for the incident.\n\nCalling for accountability, the PTI leader demanded that an FIR was registered against those responsible in the SBCA and the provincial administration.\n\n“This is no accident — it is an administrative manslaughter,” he asserted and demanded that each family who lost a loved one be given Rs10 million in compensation.\n\nSix-month rent for displaced families sought\n\nJI Karachi chief Monem Zafar Khan demanded six-month rent and alternative residences for the victims of the collapsed building.\n\nHe lambasted the SBCA over its “failure” in discharging its responsibilities.\n\nHe too held the PPP government and the SBCA responsible for the tragedy saying that the building control authority became a hub of corruption. As a result, he maintained, the city of lights has turned into a concrete jungle.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68698b7d0b87b.gif",
  "retrievedAt": "2025-08-17T19:48:52.749Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922336/sindh-govt-sbca-earn-oppositions-ire-over-lyari-tragedy",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:42.000Z"
}
