{
  "title": "PSX delivers stellar weekly gains amid macroeconomic stability - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) commenced the new fiscal year on a bullish note, as the KSE-100 index posted a robust 6.1 per cent gain during the outgoing week, closing at a record high of 131,949.06 points. The rally was underpinned by strong institutional buying, a reallocation of funds from fixed-income instruments, and strengthening macroeconomic fundamentals.\n\nTopline Securities Ltd attributed the surge to shifting liquidity dynamics following the implementation of the Finance Act 2025-26, which raised withholding tax on returns from savings and fixed deposits to 20pc, while keeping equity investment tax at 15pc. This encouraged a shift towards equities amid falling yields.\n\nThe benchmark index added 7,570 points over the week, rising from the previous close of 125,627.31. Average daily trading volumes jumped 31.4pc to 967 million shares, while average traded value rose 33pc to Rs41.5bn. In dollar terms, average daily turnover reached $145.7m, up 31.9pc week-on-week.\n\nThe upbeat sentiment was supported by stabilising macroeconomic indicators. Inflation eased to 3.2pc in June from 3.5pc in May. The trade deficit narrowed to $2.3bn for June — down 9pc month-on-month and 3pc year-on-year — while the full-year trade deficit for FY25 stood at $26.3bn, up 9pc from FY24.\n\nKSE-100 index gained 6.1pc to close at a record high of 131,949 points\n\nForeign exchange reserves held by the State Bank of Pakistan (SBP) rose by $3.66bn to $12.73bn for the week ended June 27, marking the second-largest weekly increase on record. Total reserves hit $14.5bn by the end of June, in line with SBP’s year-end target.\n\nThe rupee remained broadly stable, closing the week at Rs283.97 against the dollar, down just two paise.\n\nSector-wise, commercial banks led the rally, contributing 4,561 points to the index, followed by fertiliser (722 points), technology and communication (438 points), exploration and production (401 points), and pharmaceuticals (187 points). Conversely, cement (-136 points), glass and ceramics (-65 points), refinery (-6 points), and woollen (-1.5 points) sectors posted negative contributions.\n\nMajor positive contributors included United Bank (1,597 points), MCB Bank (653 points), Habib Bank (462 points), and Bank Al Habib (425 points). On the losing side, Maple Leaf Cement (-44.1 points), Lucky Cement (-41 points), Ghani Glass (-39 points), and Pioneer Cement (-30 points) weighed on the index.\n\nForeign investors remained net sellers for the second consecutive week, offloading equities worth $15.3m, compared to $11.8m the week before. The highest selling was seen in commercial banks ($4.5m) and miscellaneous sectors ($4m). In contrast, local mutual funds and companies were net buyers, investing $22.1m and $12.2m, respectively.\n\nAmong regulatory and economic developments, Nepra reduced electricity tariffs by Rs1.14/kWh to Rs31.59/kWh, while Ogra raised gas prices across residential and industrial categories effective July 1. The government also introduced a New Energy Vehicle (NEV) levy, resulting in price hikes for multiple car models.\n\nIn the cement sector, total dispatches for FY25 rose to 46.2m tonnes, up 2pc year-on-year, driven by stronger exports. Domestic sales, however, declined 2.4pc to 38.6m tonnes. The oil marketing sector posted a 7pc rise in product offtake to 16.3m tonnes for the fiscal year.\n\nPerformance vs other asset classes\n\nThe KSE-100 emerged as the best-performing asset class in FY25, delivering a stellar return of 60.15pc. In comparison, gold returned 45.19pc, T-Bills 21.44pc, Defence Savings Certificates 12.61pc, bank deposits 12.60pc, Pakistan Investment Bonds 11.97pc, and the rupee appreciated 1.95pc against the US dollar.\n\nThe strong equity market performance was driven by aggressive monetary easing, improved liquidity, and the unlocking of value in key sectors — reinforcing investor confidence in Pakistan’s capital markets.\n\nArif Habib Ltd expects the bullish momentum to persist in the near term, driven by positive investor sentiment, macroeconomic stability, and relatively low equity valuations. The KSE-100 is currently trading at a forward price-to-earnings ratio of 6.8x for 2025, compared to a 10-year average of 8.0x, while offering an attractive dividend yield of approximately 7.4pc versus a historical average of 6.5pc.\n\nAKD Securities echoed the optimistic tone, forecasting the index to reach 165,215 points by December. Strong earnings in the fertiliser sector, sustained return on equity in banks, and improving cash flows of exploration and oil marketing companies — buoyed by falling interest rates — are expected to drive further gains.\n\nInflation for FY25 averaged 4.5pc. Forward inflation for FY26 is projected at 4.4pc, providing room for further monetary easing and acting as a potential catalyst for equities.\n\nPublished in Dawn, July 6th, 2025\n\nCorrection: An earlier version of this story contained an incorrect graph. The graph has been updated following an update by Arif Habib Ltd.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09202012065dadf.png",
  "retrievedAt": "2025-08-17T19:49:14.126Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922377/psx-delivers-stellar-weekly-gains-amid-macroeconomic-stability",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:23.000Z"
}
