{
  "title": "Songs of hate - World - DAWN.COM",
  "author": null,
  "content": "I SAW the ‘disturbing’ music video of Jatt Mehkma, a Punjabi hip-hop song that caused Britain’s MP Manuela Perteghella so much anguish that she lodged a complaint with the government. The song by Indian rapper Yo Yo Honey Singh features Pakistani actress Mehwish Hayat; they are gangsters at a party in the video.\n\nAs they drive away, and are stopped by ‘bad guys’, young children emerge out of nowhere, surround Hayat and fire guns at their opponents. The MP was so disturbed by the violent content that she complained to the Home Office and called for a ban on the entry of Singh and Hayat. It is one of the silliest things I’ve read this past week. And a reminder of the gross hypocrisy we see on display every day.\n\nI don’t condone violence but I’m surprised this video released in November has caused anyone this kind of umbrage.\n\nI’m comparing it to Israel’s genocide of Palestinians being streamed on our screens 24/7 which doesn’t cause any concern. It’s almost expected that Palestinians deaths will be streamed live with no accountability.\n\nI went looking for Ms Perteghella’s outrage about Zionist songs celebrating the death and destruction of Gaza but till the time of writing could not find anything on this specifically. Her politics aren’t all bad — she does support an immediate ceasefire, the UK restoring funds to UNRWA so they can get aid to Gaza and an arms embargo on Israel while it perpetuates war crimes to name a few.\n\nThe rappers spit on those calling for a Free Palestine and praise their erasure.\n\nBut, it seems she takes exception to brown folks acting like gangsters in a music video.\n\nViolent images and music about Palestinians haven’t just surfaced following the Hamas attack in 2023. In 2015, Israeli settlers attacked two Palestinian homes in the occupied West Bank and burned a baby alive. That gruesome act has been celebrated. Zei Squirrel’s account on X posted a video of an Israeli wedding in which they stab the photo of that burned baby as they dance to rock music, saying they will do it to other infants. It is beyond depraved.\n\nThis is how violence is normalised and, as a story in UnTold Mag last year said, creates a collective identity which “cultivates a shared mindset of hatred”.\n\nIt has gotten worse as evidenced on the hatred across social media platforms like TikTok where these “popular expressions carry not only hateful and violent messages but, in some instances, verge on the genocidal,” reported the magazine. And it’s not just settlers sharing this violent musical content.\n\nThere are videos showing Palestinian prisoners in Israeli camps listening to a child’s song Meni Mamtera for eight hours on end. People soon started playing it at Orthodox weddings and in one video on X, I saw guests mimicking the handcuffed prisoners listening to the song. Then there was the TikTok ‘challenge’ of kidnapping and blindfolding Palestinians.\n\n“In these different videos, the prisoners have no face, no life stories, no voice, all that remains is an Israeli song, torturing anonymous bodies,” reports the magazine. “Taken outside of time, space and humanity, the prisoners are excluded from both human and political communities, treated as dispensable entities without rights or protections.”\n\nThe rap song Harbu Darbu (which means raining hell on the enemy) by Ness Ve Stilla, which has 35m views since its release last year, calls Palestinians rats. The rappers spit on those calling for a Free Palestine and praise their erasure. The song was number one for weeks in Israel. It was used also on TikTok as a way to show support for the war.\n\nIsrael has killed more than 56,000 people and uprooted ne­a­rly the entire pop­ulation of 2.3 million acc­ording to Al Jaze­era. It has also killed 1,000 Pales­­tinians in the West Bank, an oft-ignored story as the focus is on Gaza.\n\nHow were entire generations wiped out in the name of Israel’s right to ‘self defence’?\n\nYou can unde­­rstand my outrage then when one British MP chooses to take umbrage with a Punjabi video that uses children resorting to violence but seems to ignore Israeli children’s songs glorifying violence in Gaza?\n\nI understand the music video may have flouted some UK laws including “the use of imitation firearms and exposing minors to harmful content” according to a report last week by Deadline. But does it merit Singh and Hayat not being allowed to enter the UK because they are “not conducive to the public good” under immigration rules?\n\nWill the same rules be applied to everyone involved in the creation of Friendship Song 2023, where children sing “we will annihilate everyone in Gaza”? The video was taken down from YouTube but I watched it on Electronic Intifada’s X account and it made Singh’s video look amateur. Legislators should direct their concern at the impact Israel’s genocide is having on society.\n\nThe writer is an instructor of journalism.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6869e0d756c24.jpg",
  "retrievedAt": "2025-08-17T19:48:24.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922430/songs-of-hate",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T02:35:58.000Z"
}
