{
  "title": "GPE okays $9m grant to boost early education in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Global Partnership for Education (GPE) will provide a $9m grant to improve access to and quality of early childhood and primary education in Balochistan. The funding aims to enhance learning environments and strengthen reading and numeracy skills for boys and girls in GPE-supported schools across the province.\n\nGPE, a global initiative to address the education crisis, is coordinating this grant through two key agencies — the World Bank and Unicef.\n\nThe World Bank-managed component will focus on improving teaching quality at the Early Childhood Education (ECE) and primary levels through a continuous professional development (CPD) programme in seven targeted districts. It will also support the province-wide rollout of a revised ECE curriculum and the development of new teaching and learning materials.\n\nThe Unicef-managed component will expand the Balochistan Student Learning Improvement Programme (BSLP) — a GPE-funded initiative from a previous cycle — across 20 districts.\n\nAccording to a World Bank document, the seven districts identified for targeted interventions include five with high refugee populations — Quetta, Qila Abdullah, Pishin, Chaghi and Chaman — which were also part of Balochistan Human Capital Investment Project. The two other districts are Qila Saifullah and Noshki, both bordering Afghanistan.\n\nAs co-grant agents, the World Bank and Unicef will coordinate their activities to ensure complementarity and effective implementation. This will include the joint rollout of teaching and learning materials, collaborative CPD implementation, coordinated action planning and the development of key performance indicators for teachers and education administrators.\n\nThere has been an improvement in gross enrolment rates at the primary level in the province over time, but it is much lower (54 per cent) compared to 78pc national average.\n\nInsufficient investment towards fostering children’s readiness for learning, including in ECE, hinders Balochistan’s overall human capital development. The province has an estimated population of 1.36 million children aged three to five, with around 14pc enrolled in ECE classrooms in public schools and nearly 5pc in private schools.\n\nThe current budget distribution to school clusters and feeder schools in Balochistan is ineffective. The school budgets are calculated based on a 50-50 split introduced in 2014: half of the allocated budget is fixed, and half is proportionate to student enrolment. The budget is distributed into four non-fungible categories: uniforms, reading and writing materials, furniture and fixtures, and building repairs, with no flexibility for clusters.\n\nAround 3.13 million children (65pc children aged between five and 16) are out of school in Balochistan, with 45pc of them at the primary level. The issue of out-of-school children in Balochistan presents a multifaceted challenge, exacerbated by various factors, including limited access to education facilities and low penetration of early childhood development and early childhood education for school readiness.\n\nAcross the province, the density of schools is notably sparse, with the average public school being one kilometre away from accessible roads.\n\nThe report says there is a shortage of qualified teachers in Balochistan, and most schools lack a dedicated ECE teacher. The government has hired 11,000 teachers in 2025, a first since 2019, which will provide a push to the system.\n\nStill, only 9pc of schools in Balochistan have dedicated ECE teachers, leaving most classrooms without this specialised expertise. The prevalence of multigrade classrooms, where children ranging from ages three to eight are grouped together, is a common challenge observed at both pre-primary and primary levels.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/6851faf41b97e.jpg",
  "retrievedAt": "2025-08-17T19:49:35.521Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922402/gpe-okays-9m-grant-to-boost-early-education-in-balochistan",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:17.000Z"
}
