{
  "title": "Ashura processions in major cities of country conclude peacefully - Pakistan - DAWN.COM",
  "author": null,
  "content": "Yaum-i-Ashura processions in major cities across the country safely concluded on Sunday evening amid tightened security.\n\nYaum-i-Ashura is observed every year on Muharram 10 with solemnity to pay homage to Imam Husain — the grandson of Holy Prophet Muhammad (PBUH) — and other martyrs of Karbala.\n\nSo far, processions in Karachi, Hyderabad and Punjab have culminated, according to statements from senior officials.\n\nThe Ashura procession in Karachi safely culminated at Hussainiya Iraniyan Imam Bargah, with a police update sharing that the head of the procession reached the imam bargah at 6:20pm.\n\nAdditional IG Karachi Javed Alam Odho praised the Karachi Police for excellent security arrangements during Muharram, according to a statement from his office.\n\n“Majalis and processions were organised at several places in Karachi, including Nishtar Park,” he was quoted as saying, expressing appreciation for the Traffic Police for arranging alternative routes for the convenience of the general public during the main procession.\n\nAdditional IG Odho also thanked media representatives, procession organisers, mourners and other institutions for their cooperation, according to the statement.\n\nMeanwhile, Sindh Chief Minister Murad Ali Shah expressed his satisfaction over the peaceful end of Ashura and thanked the interior minister, police and Rangers for “foolproof” security arrangements and the local government minister, Karachi mayor and relevant staff for providing facilities, according to a statement from his office.\n\n“The peaceful conclusion of Ashura processions across Sindh is the government’s success,” Shah was quoted as saying. “Despite high security concerns, the Sindh Police did an excellent job, and the government made every effort to provide all facilities to the mourners.”\n\nShah praised the role of religious scholars in maintaining religious harmony, calling their role “commendable”.\n\n“Sindh is the land of Sufis. We are advocates of peace,” Shah stated.\n\nSindh Home Minister Ziaul Hassan Lanjar also congratulated Sindh Police for their excellent security strategy and performance during Ashura.\n\n“During this important occasion, security measures taken by all units of the Sindh Police, including the Traffic Police and Special Branch Police at the provincial level from Muharram 1 to Ashura, are commendable at every level,” he was quoted as saying in a statement.\n\nLanjar also praised and appreciated the performance of Rangers Sindh and other security agencies on this occasion.\n\nMeanwhile, the central Ashura procession in Hyderabad culminated peacefully at Karbala Dadan Shah.\n\nEvery year, the procession departs from Qadam Gah Maula Ali and is managed by Anjuma-i-Hyderi, which was founded in 1948.\n\nThe entire route was sealed since the early morning with barbed wire, while police and Rangers personnel were deployed.\n\nThe procession reached St Mary’s Convent School roundabout, where mourners performed zohrain prayers. Subsequently, a majlis was addressed a small distance from the roundabout by Syed Wasim Hyder Zaidi, according to an Anjuman-i-Hyderi spokesman.\n\nA majlis was also addressed by Allama Irfan Ali Kazmi before the procession departed from Qadam Gah.\n\nThe procession was delayed by over an hour at St Mary’s Chowk and passed the area at 5.15pm instead of the usual time of 4pm. This area also connects the route of the tazia procession from the city.\n\nPolice arrangements for security were also weak. No strict checking was seen and everyone was allowed to reach the procession route, especially from Universal Book Depot point. Some policemen who were initially seen for security purpose disappeared subsequently.\n\nDeputy Inspector General Tariq Dharejo, Senior Superintendent of Police Adeel Chandio and Deputy Commissioner Zain Ul Abidin monitored the proceedings in the control room set up in the City police station.\n\nMeanwhile, a statement from the Punjab government stated that processions were culminating safely in multiple cities across the province. Chief Minister Maryam Nawaz Sharif congratulated her team, including Salman Rafique, ministers, institutions and others, for the “excellent arrangements”.\n\n“For the first time, we had not only the best Muharram in terms of arrangements but also the most peaceful one,” Maryam was quoted as saying. “Along with cleaning the roads, the dirt of hatred was also wiped away.”\n\nSenior Provincial Minister Marriyum Aurangzeb, accompanied by other ministers, arrived at the bridge of the Metro Bus Station, leaving Nisar Haveli in Lahore. She also visited the control room established at the Punjab Home Department and reviewed arrangements for Yaum-i-Ashura across the province in detail.\n\nA briefing delivered to Aurangzeb confirmed that the processions were being monitored in real-time through 7,500 cameras across Punjab and that 113,000 personnel were deployed.\n\nAdditionally, more than 1,600 “hate-spreading accounts” were reported by the Cyber ​​Patrol Cell of the Home Department and 170 people were arrested, according to the briefing.\n\nAurangzeb was also briefed on the provision of clean water and clean procession routes, where water was sprinkled to cool mourners amid the heat and the spraying of disinfectants was continuous. Mobile toilets were also provided and rescue personnel were on standby in case of emergency.\n\nA coordinated plan was also prepared with the Water and Power Distribution Authority (Wapda) and other institutions for uninterrupted power supply during Yaum-i-Ashura.\n\nEarlier in the week, Karachi Traffic Police issued a traffic plan for Muharram 8 to 10, outlining the procession routes as well as alternative traffic flows.\n\nStringent security measures are being taken across the country, such as army deployment as well as a crackdown on sectarian content and hate mongers, ahead of Ashura (Muharram 10), being observed today.\n\nA total of 4,836 processions and 5,480 majlis were being carried out across the country today, Interior Minister Mohsin Naqvi said in a press conference.\n\n“In Islamabad, 54 majlis and 12 processions were being carried out, while in Punjab 2,502 majalis and 3,025 processions were being held,” he said.\n\nIn Sindh, 1,040 majlis and 1,039 processions were being held. In Khyber Pakhtunkhwa, 735 majalis and 257 processions were being held. Across Balochistan, 32 majlis and 24 processions were held.\n\nIn Gilgit-Baltistan, a total of 1,070 majlis were carried out as well as 141 processions, while in Asad Jammu and Kashmir, 47 majlis and 41 processions were held.\n\n“Like the 9th of Muharram, all forces and administration are on high alert for law and order for Ashura,” Naqvi said, adding that a crackdown on religious hatred and sectarianism on social media is underway.\n\nIn Karachi, the Ashura majlis commenced at Nishtar Park at around 8:30am, according to an alert from the police. “The number of participants is approximately 3500 to 4000 and it is being led by Shahenshah Hussain Naqvi.”\n\nTraffic has been closed from main Numaish to MA Jinnah Road up to Kharadar Hussainiya Iranian Imam Bargah, with the exception of Bab-e-Urdu Chowk, Karachi traffic police said in a post on X.\n\nA total of 7,004 police personnel are present for surveillance and security for the main procession.\n\nAdditionally, 733 NGOs, as well as senior officers of Karachi Police, and 6,271 head constables and constables are performing duty today. Expert police snipers have also been deployed alongside the main procession.\n\n“Traffic police officers and personnel have been deployed to maintain traffic flow on the main procession routes and crossings, including alternative traffic routes arranged for the 10th Muharram procession, so as to keep the traffic flowing by keeping the public safe from any inconvenience,” said a statement from the office of Karachi’s additional inspector general of police.\n\n“Karachi Police is providing complete security to the mourners participating in the 10th Muharram processions.”\n\nThe statement urged the public to keep an eye on their surroundings and immediately inform the police on Madadgar 15 of any suspicious or unusual situation.\n\nPots of Haleem were cooked at Sindh Governor House niaz distribution. It was distributed among the people on the instructions of Governor Kamran Tessori.\n\nIn Multan, 225 majlis and 283 processions have commenced across the city, according to commissioner Aamir Kareem Khan. More than 5,000 police personnel are providing security, and 12 vigilance teams have also been formed for monitoring.\n\nThe processions are expected to conclude at Haram Gate, where mourners will offer asr prayers.\n\n“Special reserves are in place to deal with any kind of emergency that may arise,” said a statement from the Multan police. “In addition to rooftop duty, police personnel in white uniforms are also present on procession routes for surveillance.”\n\nCCTV cameras have been installed at more than 180 places across Multan and are strictly monitoring the processions and gatherings , according to Deputy Commissioner Wasim Hamid Sindhu.\n\n“Law and order across the province is being monitored from the central control room of the Home Department,” Multan City Police Officer (CPO) Sadiq Ali Dogar said.\n\nPunjab Emergency Service Rescue 1122 put in place several measures, including 600 rescue personnel, 15 fire tenders, 30 ambulances, 93 motorbike ambulances, and two special vehicles deployed in Multan’s Shujaabad tehsil and Jalalpur Pirwala.\n\nSimilar arrangements have been made across Punjab on the instructions of Chief Minister Maryam Nawaz, with more than 12,000 rescuers deployed for Ashura and routine rescue operations, according to Emergency Services Secretary Dr Rizwan Naseer.\n\n“Across Punjab, 815 ambulances, 2,166 motorbikes, and 316 fire and rescue emergency vehicles have been deployed,” he said.\n\nMeanwhile in Lahore, 55 emergency ambulances, 300 rescue motorbikes, 44 fire and rescue and specialised emergency vehicles have been deployed, as well as 1,350 rescuers deployed.\n\nIn Khanewal, Ashura processions were underway with mourners participating in large numbers. Khanewal DC Dr Salma Suleman and District Police Officer Ismail Kharak inspected the Ashura routes for cleanliness, security and other arrangements.\n\n“Under the orders of Punjab CM Maryam, all resources are being provided to the mourners,” DC Suleman was quoted as saying in a police statement. “A search operation was carried out in sensitive areas throughout the night.”\n\nThe DC added that foolproof security is being provided for the procession.\n\nIn Islamabad, over 4,000 police officers and personnel were deployed to ensure the safety of 12 processions and 48 religious gatherings scheduled for the day.\n\nInspector General of Police (IGP) Syed Ali Nasir Rizvi is personally monitoring all security arrangements across the federal capital and supervising operations on the ground, according to the Associated Press of Pakistan.\n\nA total of 57 security checkpoints have been established across Islamabad to secure processions and majalis, and more than 300 traffic officers have been deployed to ensure smooth vehicular flow and assist the public throughout the day.\n\n“All security operations are being monitored through Safe City surveillance, body-worn cameras, drones, as well as both mobile and central control rooms,” IG Rizvi said.\n\nIn Peshawar, a total of 12 processions were carried out, and two have concluded so far, according to a Dawn.com reporter.\n\nSo far, 5,148 mourners across Punjab have been given first aid on the spot, while 189 injured mourners have been shifted to hospitals, Punjab Rescue Spokesperson Farooq Ahmed said.\n\nIn 56 major gatherings in Lahore, 408 mourners were given first aid while were shifted to the hospital. In 272 major gatherings in Faisalabad, 249 mourners were given first aid on the spot and 11 were shifted to hospital. In Multan, 295 mourners were given first aid on the spot in 148 major gatherings, while one mourner was shifted to the hospital.\n\nSimilarly in Rawalpindi, 111 mourners were given first aid on the spot across 133 processions while seven were shifted to the hospital. In Gujranwala, 368 mourners were given first aid on the spot across 99 large gatherings, and nine were shifted to the hospital.\n\nIn Jhang, 436 mourners were given first aid on the spot in 154 gatherings while three were shifted to the hospital, while in Jhelum, 275 mourners were given first aid on the spot in 90 gatherings and four were shifted to the hospital.\n\nRescue personnel on boats were deployed to provide medical services to mourners on both sides of Mianwali River. “The Provincial Monitoring Cell is monitoring rescue operation across Punjab,” Ahmed said.\n\n“In case of any emergency, dial the rescue helpline 1122 immediately.”\n\nIn the remaining districts of Punjab, 3,006 mourners were given first aid on the spot and 150 were shifted to the hospital.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif paid rich tribute to the sacrifice of Hazrat Imam Hussain (RA) and his companions, saying that Ashura gives us a message of sacrifice, truthfulness, sincere determination, and standing up for the truth.\n\nIn their separate messages on Yaum-i-Ashura, they urged the nation to uphold the values and principles of fortitude and courage demonstrated by the martyrs of Karbala and to exhibit perseverance in the face of trials, state-run Radio Pakistan reported.\n\nPresident Zardari said that Karbala is a symbol of an eternal struggle against falsehood. “This day is not only an unparalleled story of sacrifice, loyalty, and patience but also a bright lamp that shows the path of truth and righteousness in the darkness of every era.”\n\nIn his message, PM Shehbaz said: “Karbala teaches us that although the path of truth is difficult, it is the path that leads to the pleasure of Allah Almighty and the satisfaction of hearts and eternal prosperity.”\n\nHe said the message of Hazrat Imam Hussain (RA) is not limited to his time but is a universal message, which even today convinces us that a Muslim stands for the truth, supports the oppressed, and advocates justice in all circumstances.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/061219128102e13.png",
  "retrievedAt": "2025-08-17T19:48:08.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922472/ashura-processions-in-major-cities-of-country-conclude-peacefully",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T05:29:02.000Z"
}
