{
  "title": "Police file three cases against Pakpattan hospital staff - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: Following Chief Minister Maryam Nawaz’s directive, Pakpattan police on Saturday registered three FIRs in connection with the death of 20 babies at the paediatric ward of Pakpattan District Headquarters (DHQ) Hospital between June 16 and 22.\n\nTwo FIRs have been registered against hospital officials and lab technicians for what the CM described as “criminal negligence” during a briefing on investigation findings. A third FIR was filed against the hospital’s parking stand contractor and staff for allegedly overcharging token fees and threatening patients. All nine suspects were presented before the local duty magistrate Mr. Gulzar who gave two-day physical remand.\n\nPakpattan District Police Officer (DPO) Javed Iqbal Chadhar told Dawn that all suspects were handcuffed and transferred to city police station lock-up. The medical superintendent and the health CEO were transported in their official vehicles under police custody.\n\nCity Station House Officer (SHO) Mr. Hashim said the FIRs were registered early in the morning on the basis of written complaints by the victims’ families.\n\nHealth CEO, MS among nine suspects remanded in police custody for two days\n\nThe first case, FIR No. 738/25, under Sections 322 (causing death by negligence) and 201 (destruction of evidence) of the Pakistan Penal Code (PPC), names health CEO Dr. Sohail Asger, MS Dr. Adnan Ghaffar, Medical Officer Dr. Ahsan, lab technicians Muhammad Tufail, Muhammad Murtaza, and Mumtaz.\n\nThe complainant, Ali Hyder of Mohalla Gulzarabad, said his newborn daughter Minhaj Fatima died due to lack of oxygen and proper treatment. He claimed that after raising concerns with the CEO, no action was taken. He also alleged the records of deceased children were deliberately removed. The FIR includes names of 15 grieving parents citing negligence and oxygen shortages.\n\nThe second case, FIR No. 739/25, was lodged by Muhammad Waseem of Chak 93/E under Sections 382 (theft with preparation for harm), 341 (wrongful restraint), 506 (criminal intimidation), and 148/149 (unlawful assembly). It accuses lab technicians Muhammad Tufail, Muhammad Murtaza, Mumtaz, of DHQ Hospital, along with Shahid Iqbal, Javed of Shafqat Lab, Irfan of Janoom Lab and Faisal of Alshifa Lab. The complainant alleged that these individuals were illicitly selling hospital oxygen to privately run facilities in which they had financial stakes. Waseem claimed he was threatened after exposing the theft on June 19.\n\nThe third case, FIR No. 737/25, was filed against parking stand officials under Sections 342 (wrongful confinement), 506, and 384 (extortion) on the complaint of Muhammad Ashraf. Those named include contractor Rana Nasir, Ali Raza, Rao Naveed, Shahzeb and two unidentified staff members. The complainant alleged that when he objected to excessive parking fees, he was held hostage by armed personnel and later released.\n\nThe DPO confirmed that all nine suspects were presented before the local duty magistrate Mr. Gulzar who remanded them in police custody for two days.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/27095233982a235.jpg?r=095238",
  "retrievedAt": "2025-08-17T19:48:12.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922451/police-file-three-cases-against-pakpattan-hospital-staff",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T03:15:54.000Z"
}
