{
  "title": "Trump hints at Russia sanctions after largest assault on Ukraine - World - DAWN.COM",
  "author": null,
  "content": "KYIV: US President Donald Trump said Russia just wanted to “keep killing people” and hinted at sanctions after Moscow launched its largest ever drone and missile attack on Ukraine in the three-year-old war.\n\nTrump said on Friday he was “very unhappy” about his telephone call with Russian leader Vladimir Putin, saying: “He wants to go all the way, just keep killing people, it’s no good”.\n\nThe US president said he and Putin talked about sanctions “a lot”, adding: “He understands that it may be coming”. Hours-long Russian bombardments sent Ukrainians scurrying for shelters across the country and came after the call between Trump and Putin, which ended without a breakthrough.\n\nJournalists in Kyiv heard drones buzzing over the capital and explosions ringing out throughout the night as Ukrainian air defence systems fended off the attack. Ukraine’s President Volodymyr Zelensky also spoke to Trump and said they agreed to work on bolstering Kyiv’s defences.\n\nUS president agrees with Zelensky to work on bolstering Kyiv’s defences\n\n“We spoke about opportunities in air defence and agreed that we will work together to strengthen protection of our skies,” Zelensky said on social media after the call.\n\nTymur, a Kyiv resident who said he had experienced previous Russian attacks, said that the assault in the early hours of Friday felt different from others.\n\n‘Nothing like this happened’\n\n“Nothing like this attack had ever happened before. There have never been so many explosions,” he said. The Kremlin said it was “preferable” to achieve the goals of its invasion through political and diplomatic means. “But as long as that is not possible, we are continuing the special operation,” spokesman Dmitry Peskov said, referring to Russia’s invasion.\n\nAt least three people were wounded in Russian drone and artillery strikes on several parts of Eastern Ukraine overnight Friday to Saturday, regional governor Sergiy Lysak said on Telegram. Zelensky said air alerts began echoing out across the country as the Trump-Putin call was getting under way.\n\nHe urged the United States in particular to increase pressure on Moscow, which on Friday announced fresh territorial gains on the front line with the capture of a village in the Donetsk region. Poland said its embassy building in Kyiv had been damaged in the attack but that staff were unharmed.\n\nIn Kyiv, one person was pulled from the rubble after the strikes, which also wounded at least 26 people, emergency services said. The barrage, according to the air force, comprised 539 drones and 11 missiles. A representative of Ukraine’s air force told Ukrainian media that the attack was the largest of the Russian invasion.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/684e18df4b94a.gif",
  "retrievedAt": "2025-08-17T19:48:59.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922393/trump-hints-at-russia-sanctions-after-largest-assault-on-ukraine",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:36.000Z"
}
