{
  "title": "Gill’s record-breaking ton sets England gigantic target - Sport - DAWN.COM",
  "author": null,
  "content": "BIRMINGHAM: Indian captain Shubman Gill became the first batsman in Test history to make scores of 250 and 150 in the same match before Mohammed Siraj and Akash Deep again struck with the new ball as the tourists pressed for a series-levelling win at Edgbaston on Saturday.\n\nGill followed his first-innings knock of 269 with a superb 161 off just 162 balls to amass 430 runs in the match and now sits second behind England’s Graham Gooch (456 against India in 1990) for the most runs by a batter in a single Test.\n\nGill’s knock took him past compatriot Sunil Gavaskar’s 344 runs in a Test against West Indies in 1971 to make the Indian record his own.\n\nGill eventually declared India’s second innings on 427-6 after tea on the fourth day.\n\nThat left England needing a mammoth 608 runs to go 2-0 up in this five-match series.\n\nNo side in 148 years of Test cricket have made more to win in the fourth innings than the West Indies’ 418 against Australia at St John’s in 2003. England’s corresponding record is the 378 they made against India at Edgbaston three years ago.\n\nBut at Saturday’s close in Birmingham they were 72-3, needing a further 536 runs on the final day to achieve a win that would be remarkable even in their current ‘Bazball’ era of aggressive batting.\n\nBut Harry Brook, who helped keep England afloat in the first innings with 158 in a total of 407, was still there on 15 not out.\n\nSiraj, who led India’s attack with 6-70 in the first innings, struck an early blow on Saturday when he removed Zak Crawley for a duck as a loose drive went straight to backward point.\n\nDeep, given the unenviable task of replacing Jasprit Bumrah, the world’s number one ranked fast bowler, then carried on from his four-wicket haul first-time around by bowling left-hander Ben Duckett (25) with a nip-back ball.\n\nHe then clean bowled Joe Root for just six as the world’s top-ranked Test batsman was undone by a superb full-length ball that moved away late.\n\nEarlier, by taking his tally in this match to 430 runs, the 25-year-old Gill became only the fifth batsman to score 400 or more runs in a single Test.\n\nGill, thrust into the captaincy following Rohit Sharma’s shock retirement from Test duty in May, has scored three hundreds in his first four innings as skipper following his 147 during India’s defeat in the first Test at Headingley.\n\nHe was ably assisted earlier Saturday by Rishabh Pant, who made England pay dearly for dropping him twice, including a poor miss by Crawley at mid-off when the wicket-keeper had made just 10.\n\nPant cashed in with a typically dashing 65 during a fourth-wicket partnership of 110 in just 103 balls with his skipper.\n\nBut Gill, often a classical stylist, showed he could bat just as aggressively as Pant by hitting fast bowler Josh Tongue for three consecutive boundaries, with a superb hooked six followed by a swiped four over mid-on and a scorching pull that England captain Ben Stokes could not stop.\n\nGill, batting in the number four slot previously occupied by India star Virat Kohli, who retired just days after Rohit, hooked another six off Tongue.\n\nPant’s dashing display ended when, trying to smash off-spinner Shoaib Bashir, he lost control of his bat, which flew to midwicket while the ball went to deep mid-off — where Duckett made no mistake with the catch.\n\nPant faced just 58 balls, including eight fours and three sixes.\n\nAfter tea, Gill piled on the runs with a brilliant straight six and two fours off consecutive balls from Chris Woakes, before slog-sweeping part-time off-spinner Root for six to go to 150 in superb style.\n\nThere was a comical moment next ball when Ollie Pope, with sunglasses on top of his cap rather than over his eyes, lost sight of a chance in the deep.\n\nGill’s brilliant display finally ended when he spooned a simple return catch to Bashir, having hit 13 fours and eight sixes in his latest masterclass.\n\nThere were crowd chants of “Boring, boring India” as the tourists batted on before Gill finally called a halt, with Ravindra Jadeja 69 not out.\n\nScoreboard\n\nINDIA (1st Innings) 587 (S. Gill 269, R. Jadeja 89, Y. Jaiswal 87; S. Bashir 3-167)\n\nENGLAND (1st Innings) 407 (J. Smith 184 not out, H. Brook 158; M. Siraj 6-70)\n\nINDIA (2nd Innings, overnight 64-1)\n\nY. Jaiswal lbw b Tongue 28\n\nK.L. Rahul b Tongue 55\n\nK. Nair c Smith b Carse 26\n\nS. Gill c&b Bashir 161\n\nR. Pant c Duckett b Bashir 65\n\nR. Jadeja not out 69\n\nN.K. Reddy c Crawley b Root 1\n\nW. Sundar not out 12\n\nEXTRAS (B-3, LB-4, NB-1, W-2) 10\n\nTOTAL (for six wkts decl, 83 overs) 427\n\nDID NOT BAT: A. Deep, M. Siraj, P. Krishna\n\nFALL OF WICKETS: 1-51 (Jaiswal), 2-96 (Nair), 3-126 (Rahul), 4-236 (Pant), 5-411 (Gill), 6-412 (Reddy)\n\nBOWLING: Woakes 14-3-61-0, Carse 12-2-56-1, Tongue 15-2-93-2 (1w), Stokes 7-1-26-0, Bashir 26-1-119-2 (1w), Root 9-1-65-1 (1nb)\n\nENGLAND (2nd Innings):\n\nB. Duckett b Deep 25\n\nZ. Crawley c sub b Siraj 0\n\nO. Pope not out 24\n\nJ. Root b Deep 6\n\nH. Brook not out 15\n\nEXTRAS (LB-1, NB-1) 2\n\nTOTAL (for three wkts, 16 overs) 72\n\nSTILL TO BAT: B. Stokes, J. Smith, C. Woakes, B. Carse, J. Tongue, S. Bashir FALL OF WICKETS: 1-11 (Crawley), 2-30 (Duckett), 3-50 (Root)\n\nBOWLING: Deep 8-1-36-2, Siraj 5-1-29-1 (1nb), Krishna 3-0-6-0\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6869ab983d761.jpg",
  "retrievedAt": "2025-08-17T19:49:04.839Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922371/gills-record-breaking-ton-sets-england-gigantic-target",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:30.000Z"
}
