{
  "title": "9th Muharram observed peacefully across KP amid tight security - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The 9th Muharram was observed peacefully across Khyber Pakhtunkhwa on Saturday amid tight security arrangements.\n\nAround 50,000 personnel of law-enforcement agencies have been deployed in the province as part of security measures for 9th Muharram and Ashura (today).\n\nIn the provincial capital, the main procession of the ninth Muharram was taken out from Imambargah Hussainia Hall in Saddar area on Saturday morning, while several mourning processions emerged from different imambargahs in the city and adjacent areas.\n\nThe participants flagellated on Saddar Road as the procession slowly moved on. It culminated at 3pm at the main imambargah.\n\nInspector General of Police Zulfiqar Hameed told reporters that that 50,000 police personnel had been deployed for the security of Muharram. While monitering security checks for the mourning procession in Saddar area, he said 14 districts had been declared sensitive for 9th Muharram and Ashura, while eight of them were the most sensitive.\n\nHe said the paramilitary and army personnel had also been deployed in those most sensitive districts. The police chief said that more than 10,000 security personnel were deployed in Peshawar, while 50,000 law-enforcers were deployed throughout the province.\n\nMeanwhile, Governor Faisal Karim Kundi visited a mourning procession in Saddar area and reviewed security arrangements. He praised law-enforcement agencies for their role in ensuring peace during Muharram.\n\nIn Dera Ismail Khan, the 9th Muharram was marked peacefully amid tight security.\n\nThe main procession was taken out in the morning from the Imambargah Bammun Shah. Itpassed through Hashmi Chowk, Hussaini Chowk, by Imambargah Fazal Abbas, Imambargah Yalla Shah, Imambargah Hazrat Abbas, through Haideri Chowk, Alamdar Chowk, Mohallah Dr Jalal Hussain and Mohallah Ghayanwala and concluded at Jamia Masjid Latu Faqeer in the noon.\n\nThe processions from other Imambargahs in the city also joined the main procession at different points. During the processions, the mourners recited Nohas and beat their chests to mourn the Karbala tragedy.\n\nFood, sherbet and water were offered to participants.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686990a345988.gif",
  "retrievedAt": "2025-08-17T19:48:32.964Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922359/9th-muharram-observed-peacefully-across-kp-amid-tight-security",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:59.000Z"
}
