{
  "title": "Jirga rejects case against Mengal tribal leaders - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHUZDAR: A Mengal tribe’s grand Jirga, convened by its tribal elder Takri Haji Nazir Ahmed Mengal, was held in Wadh on Saturday.\n\nThe gathering was largely attended by tribal elders from various parts of Sindh and Balochistan.\n\nFollowing the Jirga proceedings, Takri Haji Nazir Ahmed Mengal addressed a press conference and announced the Jirga’s decisions. He stated the Mengal tribe has always stood for peace, unity, and tolerance, proudly upholding its longstanding traditional values.\n\nHe added the Jirga condemned the recent FIR against tribal leaders Sardar Asadullah Mengal, Sardarzada Gorgain Mengal, Mir Abdul Salam Mengal, Mir Shakir Khan Mengal, and Farooq Mengal in connection with the killing of a tribal figure in Aranji.\n\nMr Nazir described the FIR as “false, baseless, and fabricated”, asserting that it had no connection with reality.\n\n“The participants of the Jirga rejected the FIR, calling it a politically motivated conspiracy,” he said, alleging that the inclusion of respected and innocent tribal leaders in the case was part of a deliberate and malicious plot. He warned that such actions could seriously impact regional peace and stability.\n\nMr Nazir affirmed that the Mengal tribe would continue to stand firmly alongside Sardar Asadullah Mengal and his family, offering them unwavering support through all challenges.\n\nThe Jirga demanded withdrawal of the FIR and called on the government and local administration to play their role in ensuring peace and stability in Wadh and across Khuzdar district.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/171026417c4feef.jpg",
  "retrievedAt": "2025-08-17T19:49:28.902Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922397/jirga-rejects-case-against-mengal-tribal-leaders",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:18.000Z"
}
