{
  "title": "Dar, Naqvi allay fears over ‘breach’ in coalition - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Deputy PM says PML-N won’t abandon PPP despite having better strength in parliament now\n• Interior minister dismisses reports about president’s removal, says two parties, army ‘on same page’\n• PPP leader claims party in no mood to join federal or Punjab cabinet\n\nLAHORE: Two key federal ministers on Saturday dismissed speculations regarding the disintegration of the PML-N-PPP alliance, saying the two parties, and even the army were “on the same page”.\n\nHowever, the enthusiasm regarding the coalition was a bit more diminished among PPP leaders who accepted having differences with the ruling party and also stressed the party has no desire to take ministries in the federal government.\n\nWhile talking to the media in Lahore, Deputy Prime Minister and Foreign Minister Ishaq Dar said that the PML-N’s total seats in the National Assembly have increased after the distribution of reserved seats in light of the Supreme Court’s order but the party was in no mood to shun PPP.\n\n“The Bilawal-led party stood by the government during difficult times and we have instructions from Nawaz Sharif that in the times of stability, we must not abandon those who had supported us in challenging times.”\n\nHe said the PPP was a key ally of the federal government and would remain so. “We have an ideal working relationship. We [the PML-N] had formed the government with the help of the PPP,” he said while talking to reporters.\n\nHe acknowledged the critical support by PPP, without which the ruling coalition wouldn’t have come to power after the 2024 general elections.\n\n‘No change in top office’\n\nAlso, Interior Minister Mohsin Naqvi during an interaction with the media in Sukkur said that there were no plans to remove President Asif Zardari and dismissed the reports about any such move.\n\nHe said the government, army, and the president were “fully aligned and on the same page”.\n\n“Those who don’t want to see them united are spreading such rumours.”\n\nSpeculations about widening gap emerged as both parties, allies in the Centre, started jostling to strengthen their ranks by wooing disgruntled PTI leaders in Azad Jammu and Kashmir while the PTI leadership addressed pressers to declare that they would foil attempts to dislodge KP Chief Minister Ali Amin Gandapur amid political wrangling over reserved seats.\n\nIn AJK, the PML-N formally inducted a PTI defector into its parliamentary party, raising its strength in the 53-member Legislative Assembly to nine. Chaudhry Akmal Sargala, who was elected in 2021 from LA-37 (Jammu-IV), a Kashmiri refugees’ constituency in Punjab, announced his switch to PML-N on Friday.\n\nMr Sargala’s decision comes just days after the PPP pulled off a similar move, managing to break away four lawmakers elected on PTI tickets in 2021. These lawmakers included Ali Shan Soni, Shahida Sagheer, Chaudhry Rafique Nayyar and Javed Butt.\n\nFollowing these inclusions, the strength of the PPP parliamentary party in AJK Assembly has risen to 17.\n\nEarlier, speculations that the PPP might join the cabinet in Centre and Punjab started making rounds after Defence Minister Khawaja Asif claimed, “There is a growing possibility of an arrangement between the PML-N and PPP that will allow both parties to jointly pursue a national agenda.”\n\nWhen Deputy PM Dar was asked about the move, he told reporters in Lahore that the PPP had not demanded any ministries from the PML-N.\n\nWhile PPP, over the past year, publicly shunned the idea of joining the federal and provincial cabinets, some of its leaders proposed taking the ministries as all the party has supported the PML-N on every other matter.\n\n‘Take ministries or quit’\n\nSenate chairman Yousuf Raza Gilani, a PPP leader, also recently proposed to the party leadership that they either join the government or leave the coalition and go to the public.\n\nSome party leaders believe that after 17 months of robust support for the PML-N in the Centre, the time has now arrived for the PPP to consider whether it should take ministries in both the federal and Punjab governments.\n\nOne issue where PPP leaders think the party went above and beyond its role as a “silent coalition partner” to support the government was in the aftermath of the conflict with India.\n\nPPP Chairman Bilawal Bhutto-Zardari travelled to different countries “playing the role of a foreign minister” to fight Pakistan’s case against India in the world, a PPP leader from Punjab told Dawn on Saturday.\n\nThe PPP called Foreign Minister Dar’s portfolio “ceremonious” and added that it would be better if his party joined the government and Mr Bhutto-Zardari became the foreign minister officially.\n\nAmid this jostling, Mr Dar said the PML-N would work with all parties, including those in the opposition.\n\n‘Wishful thinking’\n\nHowever, he ruled out any meeting between PML-N president Nawaz Sharif and PTI patron-in-chief Imran Khan at Adiala Jail in the coming days, calling it “wishful thinking”.\n\n“We don’t need to go to someone … However, [with regard to Imran Khan], the law will take its own course.\n\nMeanwhile, PPP Secretary General Humayun Khan said his party had been offered ministries by the PML-N in the Centre and Punjab, but it was not interested in joining the cabinets.\n\n“The PML-N has offered cabinet positions to us, but the party is not interested in joining the cabinet as it has reservations on some issues,” said Mr Khan\n\nHe said the two parties have “different ideologies and stances” on various issues.\n\nWaseem Shamsi in Sukkur and Tariq Naqash in Muzaffarabad also contributed to this report\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:49:53.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922412/dar-naqvi-allay-fears-over-breach-in-coalition",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:05.000Z"
}
