{
  "title": "BNP-M plans province-wide protests after Ashura - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan National Party-Mengal (BNP-M) has announced province-wide protests on July 10 against enforced disappearances, border closures, and certain policies of the government.\n\nThe decision was taken during a meeting chaired by party President Sardar Akhtar Mengal on Saturday. The meeting reviewed the overall situation in the province, and while expressing serious concern over the deteriorating political and law and order situation, decided to stage protest demonstrations across Balochistan.\n\nIn addition to province-wide demonstrations, the party also announced that a seminar will be held in Quetta on July 15, with invitations extended to political parties, student organisations, human rights groups, bar councils, and members of civil society.\n\nSenior leaders who attended the meeting also included, Secretary General Waja Jahanzeb Baloch, Vice-President Prince Agha Musa Jan, Deputy Secretary General Malik Naseer Ahmed Shahwani, Finance Secretary Akhtar Hussain Langove, Human Rights Secretary Ahmad Nawaz Baloch, and others.\n\nDemonstrations to be held against enforced disappearances, border closures and govt policies\n\nThe meeting featured detailed discussions on the current political landscape and internal organisational matters. Participants voiced serious concern over ongoing human rights violations in Balochistan, particularly the targeted killings of political workers, discovery of mutilated bodies, enforced disappearances — especially of women — and a rising number of unlawful raids and arrests. The BNP leadership strongly condemned these actions.\n\nThe meeting also denounced what it termed “bogus cases and legal notices” issued against Sardar Asadullah Khan Mengal, Sardarzada Gorgerin Mengal, and other family members. It was noted that such tactics, including fake cases, arbitrary arrests, and assassinations of BNP leaders and workers, have historically failed to suppress the party’s political and national movement, and will not succeed now. The leadership stressed that the BNP would not be intimidated by such measures.\n\nTo organise the upcoming events, a committee has been formed, comprising Waja Jahanzeb Baloch, Malik Naseer Ahmed Shahwani, Agha Hassan Baloch, Akhtar Hussain Langove, Ahmad Nawaz Baloch, and Ghulam Nabi Mari.\n\nThe party has directed all central and district-level officials, including members of the Central Executive Committee, to finalise preparations for both the protest demonstrations and the Quetta seminar. District leaders have been directed to engage with the public and ensure strong participation in the upcoming protests.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/27103816e88466c.jpg?r=103824",
  "retrievedAt": "2025-08-17T19:49:34.431Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922401/bnp-m-plans-province-wide-protests-after-ashura",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:17.000Z"
}
