{
  "title": "Analysis: Greenwashing the ‘climate change’ budget - Newspaper - DAWN.COM",
  "author": null,
  "content": "WHILE Pakistan’s FY26 federal budget is being sold as the country’s first-ever “climate budget”, there are inherent contradictions.\n\nUnder the International Monetary Fund’s (IMF) Extended Fund Facility, the government is pushed towards austerity while raising tax revenue. Meanwhile, under the IMF’s Resilience and Sustainability Facility (RSF), Pakistan is supposed to take measures to adapt to climate change. However, the EFF seems to be negating the effects of the RSF.\n\n“The government has masked taxation levies as climate mitigation efforts,” says Ahtasam Ahmad, Climate Tech and Energy Finance Lead at Renewables First.\n\n“The measures in the name of climate change, such as the carbon levy on petroleum products and the 10 per cent tax on the import of solar panels, are a form of indirect taxation rather than steps towards sustainability. If the government truly wanted to discourage the consumption of fossil fuels, it would not have coal-based electricity,” Mr Ahmad argues.\n\nExperts criticise FY26 budget for prioritising taxation over genuine climate adaptation and sustainability efforts\n\nUnder the Resilience and Sustainability Facility, Pakistan has agreed to a climate tagging mechanism whose purpose is to improve the visibility and accountability of climate-related expenditures. Under it, the country will monitor projects that are eligible under climate goals as per its Nationally Determined Contributions.\n\nHowever, Mr Ahmad insists that the implementation mechanisms for these initiatives remain largely primitive and inadequately developed. While the government had checked the required boxes under the RSF, it has done so by feeding into the targets of the EFF.\n\nFugitive emissions\n\n“There is a tax hunger in the budget,” says Aftab Alam Khan, an international consultant on climate resilience and social development. A levy of Rs2.5 per litre on petroleum products in the name of climate support is more a measure of taxing a captive market than a step towards sustainability.\n\nPakistan is ranked 156th in terms of carbon dioxide emissions, but is among the top 10 methane-producing countries in the world. In terms of greenhouse gas (GHG) emissions by sector, agriculture ranks number one and transport is number four in Pakistan, according to data from Climate Watch.\n\nMr Khan suggests that if the government wanted to rein in GHG emissions, it would have looked towards administrative measures first, rather than disproportionately burdening the poor in the name of climate change — roughly half of petrol consumption is through motorcycles. Agriculture generates the most methane emissions and is convoluted to address, but fugitive emissions can be addressed through administrative measures, Mr Khan explains.\n\nFugitive emissions are leakages in the oil and gas industries and are the second-largest contributor to methane emissions in Pakistan, he says. Mr Khan stresses that addressing these leaks requires working with oil and gas exploration companies to improve efficiency, an onerous task that would put the burden of action on the government rather than the low-hanging fruit of taxing demand-inelastic products like petrol.\n\nMore mitigation, not enough adaptation\n\nA climate-vulnerable company that is overall a low emitter of GHG should focus on adaptation, such as finding ways to sustainably manage floods, rather than mitigation, which involves reducing emissions.\n\nUnfortunately, about 87pc of the climate change budget measures are towards mitigation, says Mr Khan. There is a 30pc cut in disaster preparedness in the budget but a 157pc increase in post-disaster rehabilitation, he points out.\n\nIn his podcast “Front Seat to Climate Change”, Dawar Butt points out that most of the “climate money” isn’t new — it’s existing dam projects, now labelled as green. More critically, spending on climate adaptation has shrunk from 40pc a decade ago to just 10pc today.\n\nNo sector is more exposed to climate change than agriculture, yet it remains underrepresented in this climate budget, says Mr Ahmad. While there are small grants for crop resilience, agricultural adaptation challenges are largely overlooked. Farmers are living with climate change, but they are missing from this climate budget.\n\nThe other missing pillar is forestry, essential for absorbing carbon and protecting ecosystems, points out Mr Butt. Despite record deforestation rates, the budget for forest programmes has plummeted from Rs14bn during the Billion Tree programme years down to Rs2.4bn today.\n\nThe world tends to follow the US’s lead, and under Trump, America is moving away from climate change initiatives. His “big beautiful bill” will slow down US solar and wind power expansion as well as sales of electric vehicles, while potentially adding an extra seven billion tonnes of emissions to the atmosphere from now until 2030.\n\nAs a non-emitter and climate-vulnerable country, Pakistan needs to look towards itself and not the West for climate solutions. The underwhelming commitments under COP29’s climate finance targets attest to that. Without walking the talk and taking adaptation measures, tragedies like the deaths of 18 tourists in the Swat River flash floods are likely to continue.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:48:05.710Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922411",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:05.000Z"
}
