{
  "title": "No preparedness - Newspaper - DAWN.COM",
  "author": null,
  "content": "WITH swelling rivers, the heightened risk of GLOFs and forecasts of heavy monsoon rains, Pakistan is standing on the precipice of yet another flood disaster. Since June 26, scores of lives have been lost to flash floods and house collapses in the country, bringing back painful memories of the devastating 2022 deluge that killed hundreds, displaced millions and inflicted over $33bn in economic costs. Labelled a “climate catastrophe” by the UN, the floods exposed critical gaps in Pakistan’s flood-warning and disaster-preparedness systems.\n\nThe recent tragedy in Swat, where surging river waters swept away several tourists, shows, however, that there was little effort to plug them. An inquiry report has highlighted the glaring flood telemetry gaps across flood-vulnerable areas, indicating that a functioning early flood-warning system could have predicted the sudden rise in the water well in time to save the tourists’ lives. It also points out that the rescue staff did not have the necessary tools to save them.\n\nPakistan is among the world’s most climate-vulnerable countries. Extreme weather events such as floods, heatwaves, droughts and heavy rainfall have become more frequent due to the rapid climate change in the last couple of decades. But climate change should not be used as an excuse to explain away the gaps in the early flood-warning systems or the lack of disaster preparedness.\n\nThe experience of other countries shows that early forecast and timely messaging can drastically bring down the death toll caused by monsoon floods. Likewise, flood-resilient infrastructure can help cut economic losses. Recently, the NDMA chairman emphasised reducing the impact of disaster by being prepared in advance and issuing timely alerts. He also stressed on coordinated efforts among different government departments and agencies. This shows that the awareness is there. However, it is not being backed by action.\n\nWith the frequency of calamitous weather events increasing, Pakistan cannot afford to be in denial after every tragedy. Each year of inaction means putting more lives at risk and increasing the cost of rescue and recovery. Even though the prime minister and other government officials never tire of highlighting the impact of climate change, the lack of adequate investment in flood-warning systems and disaster readiness reflects the old pattern of misplaced development priorities and bureaucratic complacency. But the time for half-hearted measures is long past.\n\nThe country will continue to suffer climate-induced tragedies unless we reset our development policies by placing vulnerable communities at the centre of the national policymaking process. It is time the government started prioritising investment in flood-resilient infrastructure, telemetry stations and disaster preparedness to protect the people and the economy from the adverse impacts of a changing climate landscape.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/021724157e7aae5.jpg?r=172437",
  "retrievedAt": "2025-08-17T19:48:14.470Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922428/no-preparedness",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T02:32:40.000Z"
}
