{
  "title": "Footprints: Hope beneath the rubble - Newspaper - DAWN.COM",
  "author": null,
  "content": "In the heart of Lyari’s densely packed Baghdadi neighbourhood, the deafening silence amid shock and fears is broken only by the persistent hum of generators, the clatter of shovels, and the anguished cries of those waiting for news. More than 24 hours after a five-storey residential building collapsed early Friday morning, rescue teams are still clawing through debris — brick by brick, slab by slab — searching for signs of life or closure.\n\nStanding atop the rubble, Rescue 1122 personnel repeatedly press their ears to the debris of the collapsed building, calling out, “Is anyone there? Speak up. Make a sound.”\n\nEach time they do, a flicker of hope stirs among the crowd gathered outside — the hope that, perhaps, a voice will respond. But within moments, that hope fades, giving way to fear — the haunting thought that maybe there is no life left beneath the ruins.\n\nWith every passing moment, hope dims while fear deepens. On Saturday, the recovery of eight more bodies from the rubble pushed the death toll to 21 — a grim reminder of the tragedy’s growing scale.\n\nOver 580 buildings across Karachi officially declared dangerous — 107 of them in Lyari alone\n\nAmong the dead are nine women, eight men and a 13-year-old girl. Yet, for many, the waiting hasn’t ended. As evening falls on Saturday, families camped near the site cling to fading hopes that their loved ones may still be pulled out alive.\n\n“My daughter and her son are still inside,” sobs 57-year-old Manohar, his face streaked with dust and tears. “I’ve been here since yesterday morning. Every sound from the rubble gives me hope — and then breaks my heart again.”\n\nManohar is not alone in his despair. Beneath the makeshift tents lining the edge of the rubble on main Fida Hussain Sheikha Road, dozens wait in silent hope for a miracle — one that might bring their loved ones back from beneath the debris.\n\nAbid Hussain, a Rescue 1122 director overseeing the operation, offered a grim assessment that only deepened the community’s anxiety.\n\n“We’re not sure,” says Mr Hussain when asked how many people are still missing or possibly trapped beneath the rubble. “Just moments ago, we spotted two more bodies under the debris — now we’re working to retrieve them safely. I can’t say anything with certainty, but I estimate there are still eight to ten people inside.”\n\nThe narrow alleys of Lyari, once echoing with the clamour of life, are now choked with emergency vehicles, volunteers, journalists, and live broadcast vans.\n\n“Our machinery can’t get through the main street,” said the Rescue 1122 director. “We’ve had to carry heavy equipment by hand for over 300 metres. In some cases, stretchers couldn’t pass without dismantling nearby fences and stalls.”\n\nThe area, known for its age-old buildings and unregulated construction, presents a persistent risk. According to the Sindh Building Control Authority (SBCA), 588 buildings across Karachi have been officially declared dangerous — 107 of them in Lyari alone. In a neighbourhood already burdened by decades of neglect, these numbers reflect a ticking time bomb that residents have long feared.\n\n“This was bound to happen,” said Iqbal Hussain, a local resident. “There are so many buildings like this — cracked walls, tilted rooftops — but no one acts until disaster strikes.”\n\nDespite the bravery on display, cracks are also appearing in the city’s emergency response system. Witnesses recount a lack of coordination among agencies and moments of chaos when first responders arrived. A local resident claimed that the initial response team lacked proper equipment — some members, he said, didn’t even have helmets.\n\nBut Humayun Khan, chief of the KMC Fire Department and Urban Search and Rescue (USAR), firmly dismissed any suggestion of negligence.\n\n“Just last Monday, a six-storey residential building collapsed near the Barra Imambargah in Kharadar, trapping at least 22 people,” he noted, citing the incident to support his case. “Can you believe it? All 22 were rescued — not a single life lost.\n\nAs clouds gathered over Karachi on Saturday afternoon, the threat of rain brought new concerns. Drizzle in parts of the city, threatens to soften the debris and further endanger both survivors below and rescuers above.\n\n“If it rains tonight, our operations may be halted,” says a rescue official requesting anonymity. “The debris will become unstable and slippery, increasing the multiple risks.”\n\nPlastic sheets were seen being hurriedly set up over portions of the site, an improvised shield against worsening weather.\n\nOfficials confirmed that the collapsed building had been illegally extended by several floors — one of which housed at least three separate residential units.\n\n“This isn’t just a tragedy; it’s criminal negligence,” says Muhammad Hassan Bakhshi, Chairman of the Association of Builders and Developers (ABAD). He blamed officials within building control and development authorities for colluding with “mafias”.\n\nThe Sindh government claims to have initiated an inquiry into the tragedy and, as a first move, suspended the relevant SBCA officers. But locals remain sceptical. Many point fingers at the same regulatory bodies now promising justice.\n\n“Where were these people when construction was going on?” asked Ishaq Baloch, a neighbourhood elder. “Everyone knew the building was too tall for such a small plot. But nothing happens until there’s a body count.”\n\nLyari is once again in the headlines for reasons no one wants.\n\n“This could’ve been prevented,” said Jawad Shoaib, a Lyariite and city councilor of KMC who spent the night helping distribute food to victims’ families. “But for people in Lyari, prevention is a luxury. We only get attention when we bleed.”\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/06074958d65783c.jpg",
  "retrievedAt": "2025-08-17T19:48:20.962Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922376/footprints-hope-beneath-the-rubble",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T00:54:11.000Z"
}
