{
  "title": "Death toll in Lyari building collapse stands at 27 as rescue operation ends on 3rd day - Pakistan - DAWN.COM",
  "author": null,
  "content": "Rescuers on Sunday concluded their operation to recover people from the site of a five-storey building which collapsed in Karachi earlier this week, with the final death toll standing at 27.\n\nRescue teams worked overnight on Friday to pull out more bodies from the rubble of the building situated in Lyari on Fida Husain Shaikha Road in Lea Market.\n\n“The rescue operation was completed on Sunday evening,” Rescue-1122 spokesperson Hassaanul Haseeb Khan told Dawn.com. “No more human casualties have been found; thus, the total death toll stands at 27 people, whose bodies were earlier recovered and transported to Civil Hospital Karachi.”\n\nThe spokesperson added that acting Rescue 1122 Director General Dr Abid Jalaluddin Shaikh remained on the ground for over 30 hours, directly commanding the rescue operation.\n\nKhan said that the exact cause of the collapse would be determined later, but suggested it was “because the building was dilapidated”.\n\n“A day before the collapse, residents felt a ‘shock’. It can be said now that it was not an earthquake, but the building’s structure being shaken or dislocated,” Khan said. “There were 12 families, though some families had already left the building after the tremors.”\n\nThe Rescue-1122 spokesperson said that there was a lack of coordination among different rescue organisations and that staffers from two private rescue organisations fought during the operation.\n\n“They sustained injuries to the head during the scuffle,” Khan said. “It would have been more appropriate if one organisation had been given command, under which all rescue institutions could have worked.”\n\nAnother problem, according to Khan, was that relatives remained at the site as they were not willing to be moved to any government or private shelter. The rescue workers faced “immense pressure” from the relatives, he added.\n\nKhan added that there was difficulty in moving heavy machinery like cranes due to the narrow streets.\n\n“We used the same high-tech equipment that was used during the recent earthquake in Turkiye,” Khan told Dawn.com. “The use of such high-tech equipment, like life detectors helped rescue several people safely with some minor injuries. Without this equipment, the use of heavy machinery might have caused further injury.”\n\nHe said that over 100 personnel took part in the operation for three days, working in different shifts.\n\nAt around 1:30pm, Khan told Dawn.com, “it will take five to six more hours to complete the rescue operation”.\n\nA total of 27 bodies were recovered, including nine women, 15 men, a 13-year-old child, a 10-year-old child, and a one-year-old infant. The bodies were transported to Civil Hospital Karachi by Edhi Ambulance.\n\nTen people who were injured have been discharged.\n\nWhile speaking to the media today after leading the Ashura procession, Sindh Chief Minister Murad Ali Shah provided details on the building collapse.\n\n“Immediate rescue efforts were launched to save any survivors trapped under the rubble,” he said, adding that the bodies recovered had been handed over to the families.\n\nHe echoed Khan’s statement of rescue operations being expected to conclude today.\n\nThe chief minister assured that a detailed inquiry into the causes of the collapse would be conducted, with committees already formed to investigate the matter thoroughly.\n\nHe revealed that over 480 buildings in old city areas, mostly in District South, have been declared dangerous.\n\n“The government plans to assist affected residents in finding alternative housing,” he said.\n\nCM Murad added that the recently collapsed building was constructed only a few months ago, apparently without proper approval, and those responsible for unauthorised construction would face strict punishment.\n\nHe also urged the public to verify that any building they purchase has proper approval from the Building Control Authority.\n\nHe acknowledged that several people resist evacuation due to poverty and lack of alternatives, often buying or renting cheaper properties without checking safety approvals and later demanding government protection.\n\nWhile empathising with these difficulties, he stressed that sometimes strict action is necessary to ensure public safety, as demonstrated by recent enforcement measures.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/061425053bc6ea3.jpg",
  "retrievedAt": "2025-08-17T19:47:49.416Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922486/death-toll-in-lyari-building-collapse-stands-at-27-as-rescue-operation-ends-on-3rd-day",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T09:07:33.000Z"
}
