{
  "title": "PCHR organises capacity building workshop on ‘Media Freedoms and Journalists Safety’",
  "author": null,
  "content": "ISLAMABAD, Feb 25 (APP):Parliamentarians Commission for Human Rights (PCHR), in collaboration with Media Matters for Democracy (MMFD), and supported by European Union, organized a capacity building workshop on ‘Media Freedoms and Journalists Safety’ at the local hotel here on Tuesday.\nThe training session was attended by individuals from Ministry of Human Rights, Ministry of Information and Broadcasting, NCHR, NCSW, media professionals, Police and prosecution, and member of the civil society organizations.\nThe main objective of the training session was to strengthen the capacity of journalists, civil society members, and Bar representatives by deepening their understanding of both international and constitutional frameworks related to freedom of expression.\nMoreover, the session aimed to equip participants with the knowledge and tools necessary to develop effective strategies to navigate and combat the challenging circumstances surrounding press freedom and journalist safety.\nWhile conducting the session on national and international human rights frameworks in relation to freedom of expression,  Aftab Alam, ED, IRADA and renowned media rights activist, expressed his deep concerns regarding the dismal state of freedom of expression and the safety of journalists in the country.\nThrough an engaging and interactive session, Alam guided the participants in exploring both local and international human rights frameworks that can be utilized to address issues related to journalist freedom and safety.\nThe second session on ‘Strengthening Stakeholder Collaboration for Effective Implementation’ was facilitated by Asad Baig, Executive Director of Media Matters for Democracy (MMFD).\nThrough interactive dialogue, the facilitator discussed the role of national human rights institutions, such as the National Commission for Human Rights, in addressing the issue of journalist safety.\nHe explained that the safety of journalists can only be ensured through effective liaison and collaboration with the existing available avenues.\nThe concluding session of the training, led by Shafique Chaudhry, Executive Director of PCHR, placed a significant focus on the pivotal role that media organizations and journalist unions and federations play in safeguarding the overall interests of the journalists in general and their safety in particular. These institutions are important and can play an instrumental role in devising strategies for effective collaboration and advocacy.\nHe shared that individual journalist are vulnerable to harassment, intimidation, and even violence, hence the journalists’ unions and federations must be aware of the international mechanisms as well.\nHe cited and shared the salient features of the UN plan of action on the safety of journalist and the issue of impunity.\nThe training session concluded with a certificate-awarding ceremony, Afzal Butt, President of the Federal Union of Journalists, presented certificates to the participants and extended his congratulations to PCHR for organizing this training.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:06:17.196Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pchr-organises-capacity-building-workshop-on-media-freedoms-and-journalists-safety/",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T18:36:00.000Z"
}
