{
  "title": "Over 4,500 missing children cases reported, 3,869 resolved: NA body told",
  "author": null,
  "content": "ISLAMABAD, Feb 25 (APP):The National Assembly’s Committee on Parliamentary Affairs was informed on Tuesday that a total of 4,591 cases of missing children have been reported to date, out of which 3,869 cases have been successfully resolved, while 722 cases remain open.\nWhile briefing the committee, the Secretary of the Ministry of Parliamentary Affairs highlighted that Section 3 of the Zainab Alert, Response, and Recovery Act, 2020, mandates the establishment of the Zainab Alert, Response, and Recovery Agency (ZARRA) to ensure a prompt and effective response to cases of missing children.\nTo facilitate the safe recovery of missing children, ZARRA has established a toll-free helpline, 1099, where legal advisors and officers provide free legal assistance and coordinate administrative measures.\nThe committee recommended that ZARRA collaborate with provincial authorities to develop effective strategies for expediting cases of missing children. It also stressed the need to sensitize police departments across Pakistan to ensure the timely and consistent sharing of data with the agency.\nAdditionally, the committee was informed that for the swift resolution of public grievances, it is essential to integrate the Prime Minister’s Public Affairs and Grievances Wing and the Pakistan Citizen Portal (PCP) with the Chief Minister’s grievance system, as well as the grievance mechanisms of Gilgit-Baltistan (GB) and Azad Jammu & Kashmir (AJK). This integration is considered crucial for ensuring the timely and effective redressal of public concerns.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:06:45.062Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/over-4500-missing-children-cases-reported-3869-resolved-na-body-told/",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T16:57:00.000Z"
}
