{
  "title": "Irfan Siddiqui congratulates nation on Youm-e-Takbeer, asserts Pakistan’s strength won’t be challenged by India",
  "author": null,
  "content": "ISLAMABAD, May 28 (APP): On the occasion of ‘Youm-e-Takbeer’, Senior Parliamentary Leader PML-N Irfan Siddiqui Wednesday extends heartfelt congratulations to the nation, affirms Pakistan’s unwavering resolve to confront India on all fronts, citing Pakistan’s diplomatic support and growing global influence.\nIn an exclusive conversation with a local news channel, Irfan Siddiqui expressed immense pride for Pakistan’s heroes and armed forces, hailing their unwavering dedication to defending the country.\nHe asserted that Pakistan’s strength will not be challenged by India, emphasizing the nation’s unshakeable resolve and resilience.\n“We stand united in our support for our armed forces, who tirelessly work to safeguard our sovereignty and territorial integrity,” Irfan Siddiqui said, conveying a strong message of national unity and solidarity.\nHe further emphasized that Pakistan’s dignity and honor would remain uncompromised, reflecting the nation’s unwavering commitment to its principles and values.\nResponding a query, he criticized the Modi government, accusing the regime of making India diplomatically isolated and democracy infertile and slammed Modi for resorting to dramatic speeches, saying they will not work as Pakistan has laid bare his plans globally.\nIrfan Siddiqui further emphasized that Indian Prime Minister Narendra Modi should refrain from using “filmi dialogues” and instead adopt a more practical approach in his dealings with Pakistan.\n“Narendra Modi is unfit to lead a country,” he said, accusing Modi of “ruining India’s economy and shamelessly scapegoating Pakistan without any evidence.”\n“India is heading towards intellectual bankruptcy under Modi’ s leadership,” Irfan said.\n“Modi’ s desperation for international backing has backfired miserably, as not a single country has lent support to his baseless claims; instead, the world is rallying behind Pakistan’s narrative, exposing his diplomatic failure,” he added.\n“Pakistan has always maintained restraint and avoided using obscene language, but as a nuclear-capable nation, we will respond decisively to any provocation from India,” he said, adding, “Our armed forces and government are vigilant, closely monitoring every statement made by Modi.”\n“We will not be intimidated; we will respond eye-to-eye to every act of aggression,” he said, emphasizing Pakistan’s determination to stand up to India.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:00:01.787Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/irfan-siddiqui-congratulates-nation-on-youm-e-takbeer-asserts-pakistans-strength-wont-be-challenged-by-india/",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T05:23:00.000Z"
}
