{
  "title": "ASI Abbasi laid to rest with full honors after embracing martyrdom",
  "author": null,
  "content": "ISLAMABAD, May 28 (APP):The funeral prayer of Assistant Sub-Inspector (ASI) Sudheer Ahmed Abbasi of Islamabad Capital Police who was martyred in the line of duty, was offered with full honors at the Police Lines Headquarters at late-night Tuesday.\nAn official told APP that the martyred officer was paid salute following the funeral prayer, and his body was sent to his native village, Thullah, Abbottabad, with official protocol. His burial will take place with full state honors in his hometown.\nHe said that the funeral was attended by senior police officers, Deputy Commissioner Islamabad, officials and personnel from Islamabad Police, and the district administration.\nInspector General of Police (IGP)  Syed Ali Nasir Rizvi said that ASI Sudheer Ahmed Abbasi was a professional and fearless investigation officer who showed exemplary bravery by confronting dangerous dacoits without regard for his own life.\nIG Rizvi said that Islamabad Police will take full care of the martyred officer’s family and ensure all necessary support.\nIG Rizvi said that every officer of Islamabad Police is committed to their duty and will not shy away from any sacrifice in the line of duty.\nIG Rizvi said that three senior SSPs are currently leading the operation to apprehend the culprits involved in the incident.\nIG Rizvi said that the supreme sacrifice of ASI Sudheer Ahmed Abbasi will not go in vain and Islamabad Police is determined to bring the perpetrators to justice.\nIG said that the entire force stands united in honoring the courage and sacrifice of their fallen comrade.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:00:20.500Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/asi-abbasi-laid-to-rest-with-full-honors-after-embracing-martyrdom/",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T06:01:00.000Z"
}
