{
  "title": "GSP holds conference on geological hazards",
  "author": null,
  "content": "ISLAMABAD, May 28 (APP): The Geological Survey of Pakistan (GSP), under the Ministry of Energy (Petroleum Division), successfully organized the International Conference on Geological Hazards on 27–28 May 2025 in Islamabad.\nThe event brought together national and international experts to address Pakistan’s seismic and climate-related geological hazards, said a press release.\nDirector General Dr. Sajjad Ahmad inaugurated the conference, while Deputy Director General/Project Director Adnan Alam Awan outlined the country’s geohazard status and challenges.\nKeynote speakers included renowned scientists Dr. Roger Bilham (USA) and Dr. François Jouanne (France), who discussed seismic gaps and GNSS-based tectonic monitoring. Dr. Biham advised to focus on critical seismic risk areas in Pakistan and the experts should proceed for necessary interventions.\nUNESCO Pakistan, Agha Khan Agency for Habitat and Pakistan Engineer Council each hosted one technical session during the conference. Experts from different universities across Pakistan participated and presented their research work during the event.\nThe updated Tectonic Map of Pakistan (2025) was launched at the occasion and Letter of Cooperations were also signed with key stakeholders. Total in nine technical sessions, over 50 national and international presentations covered seismic mapping, GNSS and InSAR monitoring, landslide risks, and disaster mitigation.\nThe conference participants unanimously agreed on the idea of working together in the field of Geological Hazards and also agreed to initiate necessary interventions to advance the research programme for earthquake and landslides hazard assessment in the country.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:58:59.758Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gsp-holds-conference-on-geological-hazards/",
  "dateList": "2025-05-28",
  "date_published": "2025-05-28T15:48:00.000Z"
}
