{
  "title": "China, Pakistan to establish ‘Joint Research Center on Earth Sciences’  in October",
  "link": "https://www.app.com.pk/national/china-pakistan-to-establish-joint-research-center-on-earth-sciences-in-october/",
  "date_published": "2023-09-10T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):China and Pakistan will establish a joint research center in October to promote the study of Earth sciences and sci-tech exchanges, an official in charge of the center’s preparatory work said during the 2023 China International Fair for Trade in Services.\nHong Tianhua said, “China-Pakistan Joint Research Center on Earth Sciences will be established in Islamabad, the capital of Pakistan, in October as a high-level scientific and technological innovation platform between the two countries to promote sci-tech cooperation and talent cultivation.”\n“The center is being initiated by the Chinese Academy of Sciences (CAS) and the Higher Education Commission of Pakistan, and supported by the Institute of Mountain Hazards and Environment under the CAS and Quaid-i-Azam University in Pakistan,” Xinhua reported.\nIts establishment also involves CAS-affiliated institutes and other Chinese research institutions, as well as universities in Pakistan, such as the University of Peshawar. The center will carry out joint research in four areas: natural disaster and risk management; geological structures and tectonic activities; climate change and environmental effects; and resources, environment, and green development. The center will also serve as a matchmaker for the investment and technologies of Chinese and Pakistani enterprises and institutions.\n“We hope to build a high-level platform for sci-tech cooperation between the two countries, and gradually extend it to neighboring countries to provide sci-tech and human resources support for the construction of the Belt and Road Initiative and the China-Pakistan Economic Corridor,” Hong said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:34:42.901Z"
}
