{
  "title": "IESCO detects 105 meters, imposes Rs 7.567 mln fine on power pilferers",
  "link": "https://www.app.com.pk/national/iesco-detects-105-meters-imposes-rs-7-567-mln-fine-on-power-pilferers/",
  "date_published": "2023-09-10T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):On the directives of the government, the Islamabad Electric Supply Company (IESCO) has expedite drive against power pilferage and caught 105 meters and imposed fine of Rs 7.567 million for stealing electricity in various areas of the company in the current month.\nIESCO Chief Dr Muhammad Amjad in a statement said that during the current crackdown against electricity thieves, the field formations checked 5,743 meters and found 105 meters were involved in electricity theft through various means.\nAs many as 73 meters were found tampered while 22 were getting direct power supply, he said.\nHe said fine of Rs 7.567 million has imposed on the power pilferers while charging over 177,000 units.\nHe said on directives of the Federal Minister for Energy, the IESCO launched crackdown against  electricity thieves and their facilitators in the all circles including Islamabad-Rawalpindi-Attock-Jhelum and Chakwal circles.\nAll operation circles, including Incharge Executives and SDOs, were rigorously inspecting industrial, commercial, domestic, and other tariff categories within their respective areas, the IESCO chief said.\nHe said local administration and police were also assisting the company to carry out the operations.\nHe expressed confidence in the success of this government-led campaign, with the full dedication of officers and staff.\nHe emphasized that electricity theft put extra burden on the public and government institutions adding that both the agencies and the public needed to work together to combat this menace.\nDr. Khan appealed to the consumers to demonstrate their national and moral responsibility by reporting electricity theft and facilitators to the Anti-Power Theft focal person at mobile number 03195991304 or to the Complaint and Monitoring Cell at numbers 0519252933.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:34:37.410Z"
}
