{
  "title": "Paucity of funds hampers flood relief & rehabilitation efforts in Pakistan: UN officials",
  "link": "https://www.app.com.pk/national/paucity-of-funds-hampers-flood-relief-rehabilitation-efforts-in-pakistan-un-officials/",
  "date_published": "2022-12-15T15:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): The officials of the United Nation in Pakistan on Thursday feared that the paucity of funds was hampering the flood relief and rehabilitation efforts in the country.\nAddressing the journalists here, the officials said Pakistan needed $816 million in funding to cope with the challenges faced by the flood-affected people in different areas.\nHowever, funds amounting to only $2.623 million had been received so far which created a gap of $553.7 million in funding, they added.\nThey said upto 9.1 million people may be pushed below the poverty line due to the recent flood in Pakistan and more funding was required to rebuild the affectees homes and restore their livelihoods in different sectors like agriculture and livestock during the winter.\nHumanitarian Coordinator of UN Julien Harneis said world community did not respond to the appeal of the UN in a proactive way as the countries were already facing a host of challenges such as grim economic situations, energy crises and others.\n“There is a chaotic situation in flood-affected areas where two hundred thousand people are homeless, the school remains inaccessible for two million people, risk of exploitation and violence against women and transgender mounting and rising inflation pose serious humanitarian crises in Pakistan,” he added.\nHe urged the humanitarian partners and donors to keep the aid continued by donating more funds to ensure the rehabilitation of flood affectees. The existing funds would dry up by January 15, he added.\nThe Chief Field Operations at UNICEF, Scott Whoolery said the situation was extremely worrisome which required immediate actions as there was serious shortage of food for lactating mothers and children under two years were facing acute malnutrition.\n“We cannot turn a blind eye to the situation. World community needs to come forward for the help of millions of children who need special attention,” he added.\nThe Humanitarian Response and Operations Advisor of Save the Children, Ambreen Niazi International said that it was a high time to further improve communication with global partners to ensure more funding which would help one third of the flood affected women who were suffering from Anemia and contracting different diseases due to stagnant water in flood affected areas.\nThe UN officials also shared an analytic report with the media persons on aid distribution among the flood affectees which showed that out of 4 million people, some 3.4 million received the aid in the food and agriculture sector.\nIt said health support was provided to 3 million people against a need for 6.4 million, while 1.5 million people against a need for 3.9 million got the nutrition assistance.\nSo far, 1.9 million people got water, sanitation and hygiene support, while shelter & NFI assistance was given to 1.5 million people against a need for 3.5 million.\nEducation support was provided to 135,000 people against 700,000, while 0.99 million people against a need for 8.5 million received protection assistance, including for women and children at risk.\nThe document showed that agricultural and livestock assistance had benefitted 151,000 people so far.",
  "retrievedAt": "2025-08-11T16:01:17.006Z"
}
