{
  "title": "More Pakistani workers to be employed in Korea in coming years",
  "link": "https://www.app.com.pk/national/more-pakistani-workers-to-be-employed-in-korea-in-coming-years/",
  "date_published": "2022-12-15T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): More Pakistani workers will be employed in Korea in the coming years in view of their due diligence and sincerity to their work and employers observed by the Korean business owners.\nAccording to a news release issued here, the number of Pakistani workers who have entered Korea through the Employment Permit System (E9) in 2022 has exceeded 1,600 as of the end of November.\nThe Pakistan EPS Center is cooperating closely with the Overseas Employment Corporation of Pakistan (OEC) for the prompt entry of Pakistani workers who have been unable to enter Korea for the past two years due to the impact and restrictions brought on by COVID-19.\nThe Center is currently aiming to achieve its target of 2,000 Pakistani workers to enter Korea this year.\nIn total, approximately 13,000 people have entered Korea from Pakistan in the past 15 years since the establishment of the Pakistan EPS Center through a memorandum of understanding (MOU) signed in 2006.\nThe number of people entering the country this year far exceeds the number of people entering in the previous years.\nMeanwhile, the Embassy of the Republic of Korea in Pakistan and the Ambassador Mr. Suh Sang-pyo have proposed to the Korean government to additionally incorporate the construction sector as a viable occupation alongside the existing manufacturing sector within the Employment Permit System in order to employ more Pakistani workers and to give them enhanced opportunities to find employment in Korea.\nAs a result of the continuous efforts of the Embassy and the EPS Center, the quota for Pakistan was significantly increased this year, and the number of applicants for the EPS-Topik is also expected to foresee a significant increase of up to 1,600 people.\nWithin the Employment Permit System (E9), 16 nationalities are employed in Korea, and over the past 18 years, foreign workers have played a strong role in alleviating the labor shortage of Korean SMEs and towards contributing to the balanced development of the Korean economy.\nThe nationalities employed in Korea include Indonesia, Vietnam, Thailand, Philippines, Sri Lanka, Mongolia, Uzbekistan, Pakistan, China, Cambodia, Bangladesh, Nepal, Myanmar, Kyrgyzstan, East Timor.\nAdditionally, 2023 is set to mark the 40th anniversary of Korea-Pak Diplomatic Ties, and various events in the field of public diplomacy are being envisioned by Korean Embassy in Pakistan.\nThe UCC Contest for Successful Returned Workers will also be held in 2023 to uncover success stories of Pakistani workers who worked in Korea, the experiences they had and how their lives changed after successfully returning from Korea.\nIn the future, as a public institution dedicated to the Employment Permit System, which is aimed at providing one-stop support for the entire process from selection and introduction of foreign workers to their stay in Korea and their eventual return.\nThe Center is aiming to implement the Korean Proficiency Test (CBT) method which will further enhance the selection process of the foreign workers by promoting the transition from computer-based testing to the digital-based UBT (Ubiquitous Based Test) method.\nCurrently, there are about 253,000 foreign workers in Korea through the Employment Permit System, and amongst them, the number of Pakistani workers stands at 3,100.",
  "retrievedAt": "2025-08-11T16:01:19.270Z"
}
