{
  "title": "Spectrum auction for 5G to be completed by March 2025: NA body informed",
  "link": "https://www.app.com.pk/national/spectrum-auction-for-5g-to-be-completed-by-march-2025-na-body-informed/",
  "date_published": "2024-07-23T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):The National Assembly Standing Committee on Information Technology and Telecommunications on Tuesday informed that the Spectrum auction for 5G is under consideration and expected to be completed by March 2025.\nThe Committee, chaired by Syed Amin ul Haq, recommended that the ministry require service providers to ensure proper 5G services in major cities without compromising quality after the auction.\nThe Committee advised that the ministry incentivize service providers in the 5G spectrum auction and ensure these incentives are properly spent on infrastructure improvements to guarantee uninterrupted 5G services in the country.\nThe Committee also discussed “The Establishment of Telecommunications Appellate Tribunal Bill, 2024” in detail.\nAccording to the bill, a tribunal will be established to expedite pending cases in the telecom sector, which are currently delayed in the High Court. Once established, the tribunal will be bound to decide within 90 days. Currently, 71 cases are pending before the High Court and will be transferred to the tribunal upon the bill’s passage. The Supreme Court of Pakistan will serve as the forum of appeal for such cases.\nThe Committee inquired about the procedure for appointing the tribunal’s chairperson and its appointing authority, recommending that the Ministry consult with the Ministry of Law and Justice and propose any necessary amendments in the next meeting. The Committee deferred the bill until its next meeting.\nDuring the briefing, the Director of the Universal Service Fund (USF) informed the Committee that 1.5% of the revenue from all service providers goes into the USF, which uses these funds to provide services in underserved and unserved areas, ensuring the availability of data and voice services.\nThe USF also reported that Rs. 61 billion from their fund was taken by the Federal Government in 2015 for the Federal Consolidated Fund, of which Rs. 45 billion is still outstanding despite repeated requests for their return.\nThe Committee recommended that the ministry send a request every three months to the Federal Government for the return of these funds.\nThe meeting was attended by MNAs Mukhtar Ahmad Malik, Ahmad Atteeq Anwar, Ammar Ahmad Khan Leghari, Dr. Mahesh Kumar Malani, Sadiq Ali Memon, Syed Mustafa Kamal, Pullain, Gohar Ali Khan, Umair Khan Niazi, and officials from the Ministry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:02:44.855Z"
}
