{
  "title": "NEECA rolls out energy Conservation Building Code 2023",
  "link": "https://www.app.com.pk/national/neeca-rolls-out-energy-conservation-building-code-2023/",
  "date_published": "2024-07-23T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):The National Energy Efficiency and Conservation Authority (NEECA), in partnership with the Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH on Tuesday unveiled the direly needed Energy Conservation Building Code (ECBC) 2023.\nManaging Director of NEECA Dr Sardar Mohazzam, in his keynote address, presented the ECBC 2023 as a transformative framework poised to improve building practices across the nation.\nHe emphasized that this building code would transcend beyond mere documentation to emphasize its vigorous implementation.\nHe elaborated on the multifaceted benefits of the code, highlighting its potential to significantly reduce energy consumption, and generate substantial cost savings for both building owners and occupants.\nWolfgang Hesse, the Cluster Coordinator from GIZ Pakistan, delivered an insightful discourse on the mutual partnership between NEECA and GIZ, which has been instrumental in the formulation and forthcoming comprehensive implementation of the ECBC 2023.\nHe highlighted the critical role of international collaborations in fostering sustainable development and achieving global environmental objectives, commending the ECBC 2023 as a beacon of such endeavors.\nThe event featured a series of presentations by NEECA officials as well as the Building Energy Research Center (BERC) who meticulously outlined the salient features of the ECBC 2023, delineating its profound impact on the construction industry and putting their expert analysis on the technical aspects of energy-efficient building design, highlighting the manifold advantages of adhering to the ECBC guidelines.\nThe launch of the ECBC 2023 symbolizes a pivotal stride in Pakistan’s journey towards a greener, more sustainable future.\nThis illustrious gathering of stakeholders, industry experts, and government officials reaffirmed the pivotal importance of green building practices and the indispensable role of robust regulatory frameworks like the ECBC in crafting a sustainable legacy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:02:46.509Z"
}
