{
  "title": "Climate change boosts wildfire, pest threats to world’s forests: UN report",
  "link": "https://www.app.com.pk/national/climate-change-boosts-wildfire-pest-threats-to-worlds-forests-un-report/",
  "date_published": "2024-07-23T05:30:00.000Z",
  "source": "APP",
  "content": "United Nations, Jul 23 (APP): The world’s forests are becoming increasingly susceptible to wildfires and pests due to climate change, according to a new report by the UN Food and Agriculture Organization (FAO).\n“Forests and trees are essential components of agrifood systems. The removal of forest cover, especially in the tropics, increases local temperatures and disrupts rainfall patterns in ways that compound the local effects of global climate change, with potentially severe consequences for agricultural productivity,” the report warned.\nThe report is calling for innovation in the forestry sector alongside urgent action from the international community in order to face these challenges and progress toward achieving the Sustainable Development Goals (SDGs).\nWildfires around the world are more intense and frequent than ever before, even in areas that were previously unaffected.  In 2023 alone, wildfires released an estimated 6,687 megatonnes of carbon dioxide.\nSpecifically, fires in the boreal zone just south of the arctic reached a new high in 2021 and accounted for nearly one-quarter of total wildfire emissions, up from 10 per cent previously, FAO said.\nClimate change also makes forests more vulnerable to invasive species, with insects, pests and disease pathogens threatening tree growth and survival. Pine wood nematode, a microscopic parasitic roundworm, has already caused significant damage to native pine forests in some countries in Asia.\nAreas of North America are also projected to experience devastating damage due to insects and disease by 2027.\nThis destruction of forests is a serious threat given that demand for global wood production is at record levels, at four billion cubic metres a year. Projections show global round wood demand could grow by up to 49 per cent between 2020 and 2050.\nMoreover, nearly six billion people rely on non-timber forest products and 70 per cent of the world’s poor rely on wild species for their basic needs.\nFAO believes that science can help to address these challenges and identifies five types of innovation that enhance forests’ potential to address global challenges: technological, social, policy, institutional, and financial.\nOne example of such an innovation is to use AI for data analysis and innovative financing for forest conservation.\nSince innovation can create winners and losers, FAO is arguing for inclusive and gender-responsive approaches to ensure the fair distribution of benefits among men, women and youth in all socioeconomic and ethnic groups.\nFAO Director-General Qu Dongyu ultimately hopes the new report will “scale up evidence-based innovation in forestry.”\n“I believe it will also support FAO Members and other stakeholders in enabling responsible, inclusive, and essential innovation in the forest sector to strengthen sustainability and the resilience of agrifood systems for a better world and a better future for all,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:03:59.172Z"
}
