{
  "title": "NTDC clarifies news about 12 hour load-shedding in HESCO region",
  "link": "https://www.app.com.pk/national/ntdc-clarifies-news-about-12-hour-load-shedding-in-hesco-region/",
  "date_published": "2024-07-23T15:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):In response to a news story published in a section of press on July 22, 2024, the spokesman of the National Transmission and Despatch Company (NTDC) has clarified about the recent power outages experienced in the Hyderabad Electric Supply Company (HESCO) service areas.\nAccording to NTDC spokesman, additional load management measures implemented in the HESCO region were carried out in accordance with the NEPRA Grid Code 2023, said a statement issued on Tuesday.\nThis action was taken in response to an emergency situation that arose during the nights of Saturday and Sunday, July 21 and 22, 2024.\nNTDC spokesman emphasized that the claim of a 12-hour load shedding period solely attributable to NTDC was an exaggerated figure and not an accurate representation of the situation.\nWhile explaining this, he said that the primary reason for these measures was a significant dip in power generation from the 36 wind farms located in the Gharo and Jhimpir wind clusters. These wind farms, with a combined installed capacity of 1,845 MW, support the 500 kV Jamshoro grid station of NTDC. The abnormally low wind speeds resulted in a drastic reduction in wind power generation, leading to an extreme load burden on the NTDC transformers at Jamshoro Grid Station.\nIn an effort to safeguard the critical equipment, NTDC coordinated with the HESCO authorities to implement additional load shedding measures. However, the wind generation was normalized by Sunday morning, and the additional load shedding was no longer required in the HESCO service area.\nIt is important to note that the actual load shedding duration was significantly less than the 12 hours flashed in the news report. The spokesman stated that the quantum of load shedding was about 75 MW for 4 hours and 142 MW for 6 hours on Saturday and Sunday nights respectively, resulting in an average interruption of approximately 01 hour per 11kV feeder selected by HESCO for this power curtailment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:02:47.186Z"
}
