{
  "title": "Pakistan, Turkmenistan agree to deepen political, economic, defense cooperation",
  "link": "https://www.app.com.pk/national/pakistan-turkmenistan-agree-to-deepen-political-economic-defense-cooperation/",
  "date_published": "2024-07-23T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): Pakistan and Turkmenistan on Tuesday agreed to intensify their efforts for deepening bilateral cooperation in political, economic and defence domains besides reiterating their commitment to enhancing bilateral trade to make it commensurate to existing potential.\nThe bilateral ties were discussed during the one-on-one meeting between Deputy Prime Minister and Foreign Minister Ishaq Dar and Deputy Chairman of the Cabinet of Ministers and Minister for Foreign Affairs of Turkmenistan Rashid Meredov, as well as the third round of Bilateral Political Consultations (BPC) co-chaired by them here.\nBoth the foreign ministers, addressing a joint press stakeout following their engagement, told the media that the BPC undertook a comprehensive review of bilateral relations in all dimensions besides deliberating on the development of closer economic engagement in priority areas of investment including energy, connectivity and information technology.\nDeputy Prime Minister Ishaq Dar said both sides would enhance exchanges at the leadership level as Pakistan eagerly looked forward to the visit of Turkmenistan national leader Gurbanguly Berdimuhamedow to further advance and foster friendly ties between the two countries.\nHe said both countries enjoyed deep-rooted relations based on a common vision for peace and prosperity.\nThe deputy prime minister highlighted Pakistan’s investment climate, particularly the special role of the Special Investment Facilitation Council (SIFC) and invited Turkmen companies to benefit from the conducive investment climate and opportunities in Pakistan.\nBesides, he said Pakistan’s seaports offered business communities of two countries to explore win-win opportunities and welcomed them to exploit the potential of Gwadar and Karachi seaports to enhance their international connectivity.\nBoth sides also reviewed progress on TAPI gas pipeline and power transmission line offering enormous opportunities to both countries and the region.\nDar said that both countries agreed to work for trade diversification and accelerating transit trade agreement\nbesides promoting bilateral parliamentary exchange, educational scholarship and people-to-people contacts.\nIshaq Dar also apprised the Turkmen counterpart about the dismal human rights situation in the Indian Illegally Occupied Jammu and Kashmir and reiterated that durable peace in South Asia was linked with the peaceful resolution of the Kashmir dispute in accordance with the UN Security Council resolutions and the aspirations of the Kashmiri people.\nIn his remarks, Turkmen Foreign Minister Rashid Meredov said the BPC featured a wide-ranging discussion on political and diplomatic ties, trade, economy and cultural exchanges, besides identifying avenues for mutual collaboration.\nCalling friendly relations with Pakistan one of the priority areas of Turkmenistan’s foreign policy, he said Pakistan was an important partner as both sides shared the understanding on almost all issues of regional and global importance.\nHe thanked Pakistan for its consistent support of Turkmenistan’s neutrality and highlighted that both countries constantly supported each other within the framework of international organizations, particularly the United Nations.\nMeredov said while discussing TAPI gas pipeline and power transmission and fiber optic communication along the Turkmenistan, Afghanistan and Pakistan route, both sides agreed to make joint efforts to implement the projects.\nEmphasising the development of joint modern infrastructure along East-West and North-South corridors, he said both countries also agreed to maintain an active dialogue on creating international transport route to capitalise the transit potential.",
  "retrievedAt": "2025-08-11T04:03:36.673Z"
}
