{
  "title": "Intensified CASOs leaving trail of destruction in IIOJK: APHC",
  "link": "https://www.app.com.pk/national/intensified-casos-leaving-trail-of-destruction-in-iiojk-aphc/",
  "date_published": "2024-07-23T11:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): The All Parties Hurriyat Conference (APHC) has deplored that intensified cordon and search operations by Indian forces in occupied Jammu and Kashmir were leaving a trail of destruction, warranting immediate attention and action from the global community to prevent further human rights abuses and ensure a lasting resolution to the Kashmir dispute.\nAPHC spokesman advocate Abdul Rashid Minhas in a statement issued in Srinagar said, the world’s most militarized zone is witnessing a surge in CASOs, with districts like Rajouri, Poonch, Doda, Kathua, Samab, Reasi and Kupwara bearing the brunt of the brutal operations. Indian troops’ actions have become the norm, with Kashmiris facing brutalization daily.\nHe said, the so-called CASOs have turned into a pretext for Indian forces to kill, subdue, and intimidate the local population. Residential houses are regularly destroyed, and human rights violations are rampant.\nThe APHC spokesman said, the ongoing CASOs are widely seen as a revengeful policy aimed at silencing Kashmir’s voice of freedom. The Modi regime’s brutal measures have further worsened the already grim situation in the occupied territory. Despite the odds, Kashmiris remain determined to pursue their freedom struggle. He urged the international community to take notice of the Indian onslaught and intervene to rescue Kashmiris from oppression.\nMeanwhile, APHC leader Shaikh Abdul Majid in a statement strongly condemned the Indian government’s nefarious plan to allocate thousands of kanals of land in different districts of Kashmir to non-state subjects under the guise of ‘investment and industry’. This move is a clear attempt to alter the demographic composition of the territory and marginalize the indigenous population. Besides being a blatant violation of the rights of the people of Jammu and Kashmir, Shaikh Abdul Majid said, this scheme is designed to dispossess the local population and dilute their unique cultural and demographic identity.\nHurriyat leader urged the international community to force the Indian government to desist from such actions that threaten the peace and stability of the territory. He called upon all stakeholders to unite and raise their voices against this unjust and dangerous Indian plan.",
  "retrievedAt": "2025-08-11T04:03:13.770Z"
}
