{
  "title": "NDMA alerts relevant departments after forecast of significant rainfall, flooding across KP, AJK, Southern Sindh",
  "link": "https://www.app.com.pk/national/ndma-alerts-relevant-departments-after-forecast-of-significant-rainfall-flooding-across-kp-ajk-southern-sindh/",
  "date_published": "2024-07-23T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): The National Disaster Management Authority (NDMA) on Tuesday issued alert to relevant departments amid forecast of significant rainfall, flooding across Khyber Paktunkhwa (KP), Azad Jammu and Kashmir (AJK) and Southern Sindh.\nAccording to the National Emergency Operation Center (NEOC) of NDMA, strong monsoon currents were likely to penetrate from Arabian Sea and Bay of Bengal in upper regions of Pakistan, resulting in a series of rains across various parts of the country over the next 24 hours, expected to continue until July 27.\nThunderstorms and rain are expected tonight in the coastal areas of Sindh including Karachi, Hyderabad, Umarkot, Mirpur Khas, Nawabshah, Sukkur, Larkana Division, Tharparkar, Badin, Thatta, Sujawal, Islamkot, and surrounding areas. NEOC anticipated heavy to moderate rainfall in Rohi and Rahim Yar Khan of southern Punjab, Neelum Valley, Muzaffarabad, Rawalakot, Kotli, Bhimber, Mirpur in Azad Kashmir, Dir, Chitral, Swat, Kohistan, Bajaur, Shangla, Battagram, Buner, Kohat, Bajaur, Mohmand, Mansehra, Abbottabad, Haripur, Peshawar, Swabi, Nowshera, Mardan, Charsadda, Hangu, Kurram, Waziristan, Bannu, Lakki Marwat, Dera Ismail Khan in KP and areas of Gilgit Baltistan.\nThe rain may cause flood situations in various urban areas, rising water levels in streams and rivers, and landslides in mountainous areas.\nNDMA urges all relevant authorities and the public to take necessary precautions to mitigate the potential impacts of flooding and landslides. NDMA issued instructions to all relevant departments to alert Emergency Response Teams and mobilized resources to ensure a swift response to any arising situations. Tourists are advised to avoid traveling to these areas during the forecast period.\nThe public is advised to remain vigilant and follow instructions from local authorities. NDMA advises the public to stay informed and download ‘Pak NDMA Disaster Alert’ mobile app for timely alerts and closely monitor weather reports.",
  "retrievedAt": "2025-08-11T04:03:34.839Z"
}
