{
  "title": "Pakistan desires peace and stability in Afghanistan: Durrani",
  "link": "https://www.app.com.pk/national/pakistan-desires-peace-and-stability-in-afghanistan-durrani/",
  "date_published": "2024-07-23T13:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):Ambassador Asif Durrani, Pakistan’s Special Representative to Afghanistan at a roundtable on Pak-Afghan relations on Tuesday said, “Pakistan desires peace and stability in Afghanistan.”\nHe was speaking at a roundtable discussion on “Pak-Afghan Relations: Challenges and Opportunities” at the Institute of Regional Studies (IRS) here, a news release said.\nAmbassador Durrani stated that Pakistan desires socioeconomic and political conditions in Afghanistan that would facilitate the return of over 3 million Afghan refugees currently residing in Pakistan.\nHe urged the international community, especially the UN Refugee Agency (UNHCR) to come up with strategies for dignified return of Afghan refugees to their homeland.\nHe maintained that terrorism emanating out of Afghanistan was a concern not only for Pakistan but other neighbouring countries like China, Iran, Tajikistan, and Uzbekistan as well. Therefore, he urged, the Afghan interim administration to take steps against terrorist groups.\nAmbassador Durrani shared that Afghan interim administration’s efforts for poppy eradication were acknowledged by the  stakeholders concerned at the UN Doha meeting that concluded earlier this month.\nThe Special Representative called for removing obstacles to trade between Pakistan and Afghanistan as well as transit of Pakistani goods through Afghanistan to Central Asia.\nHe also called for expediting regional connectivity projects like the Turkmenistan-Afghanistan-Pakistan-India (TAPI) gas pipeline project and the CASA-1000 power transmission line from Kyrgyzstan and Tajikistan to Afghanistan and Pakistan.\nAmbassador Durrani  urged the Government of Pakistan to continue its crackdown against smuggling from Afghanistan.\nSpeaking on the occasion, Pakistan’s former ambassador to Afghanistan Ambassador Abrar Hussain, highlighted the importance of border management in the relations between the two countries.\nHe appreciated people-to-people as well as diplomatic contacts between Afghanistan and Pakistan at the highest levels.\nAbrar Hussain also urged regional countries to assist the Afghan interim government in addressing its capacity issues with regard to dealing with terrorism emanating out of Afghanistan.\nIn his concluding remarks, President IRS, Ambassador Jauhar Saleem, highlighted the multiple commonalities and linkages between Pakistan and Afghanistan, besides the economic interdependence.\nHe termed terrorism as the major source of friction between the two neighbouring countries and called upon the Afghan interim administration to honour its commitments with regard to not allowing its soil to be used for terrorism against any other country underscoring that supporting counter-errorism would be in the interest of Afghanistan itself.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:03:11.975Z"
}
