{
  "article_id": "2025-05-16_628c429bdbffb3aaa2ef4648440bf2ca",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-danesh-lauds-armed-forces-highlights-pakistans-commitment-to-minority-rights-amid-regional-tensions/",
    "retrieved_at": "2025-08-27T15:31:57.914Z"
  },
  "metadata": {
    "title": "Senator Danesh lauds armed forces, highlights Pakistan’s commitment to minority rights amid regional tensions",
    "author": null,
    "date_published": "2025-05-16T16:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 438,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 16 (APP):Senator Danesh Kumar on Friday expressed heartfelt gratitude to the Almighty and lauded Pakistan's armed forces for their resolute response to aggression, stating that the entire nation is celebrating Youm-e-Tashakur (Thanksgiving Day). Senator Danesh said, \"I bow before my Ishwar, my Lord, who granted us victory. The way our valiant armed forces responded to aggression with dignity and strength deserves the highest commendation.\" Danesh said the nation's pride and defense were preserved by the Pakistan Army's decisive actions. \"On behalf of my one crore-strong literary community, I salute our armed forces and offer heartfelt tribute to their sacrifices,\" he added. Danesh said India's misadventure turned into Pakistan's blessing, as the world recognized Pakistan's military capabilities, from its Shaheen missile program to cyber warfare expertise. \"The whole world now acknowledges our national resolve,\" he said, adding that this unity transcended ethnic boundaries, uniting all Pakistanis under one flag. Senator Danesh further emphasized that despite Indian forces targeting mosques and persecuting minorities across the border, Pakistan remained committed to protecting all religious sites. \"Not a single temple or place of worship in India was harmed in response. Our armed forces, even in retaliation, upheld human and minority rights. This is the moral distinction between us and them,\" he added. Senator noted that the recent developments have revived the Kashmir issue on the global stage, contradicting India's claim that the matter was settled. \"China's renewed claim over the region has further complicated India's position,\" he said. \"Our diplomatic success has isolated India internationally, with only Israel standing by them.\" Senator Danesh also expressed appreciation for the United States, acknowledging its support for Pakistan. He urged his compatriots to recognize and respect this support instead of issuing anti-American statements. \"India's desire to dominate the region has been thwarted; now they are wandering in search of dignity,\" he remarked. Turning to the plight of minorities in India, Danesh said, \"I want my media to relay this directly: after the temple incident in India, Muslims and other minorities are facing life-threatening conditions, with their mosques attacked and rights suppressed.\" In contrast, he said, Pakistan ensured full protection of its Hindu citizens and their places of worship. \"Pakistani Hindus were respected and embraced as fellow countrymen,\" Senator said, adding that this inclusive spirit reflects Pakistan's true character. Senator Danesh also thanked Senate Chairperson Sherry Rehman and her party for their support, and appealed to the government to establish a committee for the welfare of the martyrs' families. He announced a donation of Rs 5 million if such a committee is formed, reaffirming his commitment to supporting those who sacrificed for the nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}