{
  "article_id": "2025-05-16_958b5615c3f73b595b0e99b5c50599f8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-maintains-military-readiness-to-respond-to-any-indian-misadventure-fo-2/",
    "retrieved_at": "2025-08-27T15:32:20.748Z"
  },
  "metadata": {
    "title": "Pakistan maintains military readiness to respond to any Indian misadventure: FO",
    "author": null,
    "date_published": "2025-05-16T13:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 645,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 16 (APP):Pakistan on Friday said that it was maintaining its military readiness to respond any misadventure of India under its jingoistic and hegemonic ambitions along with its preference for ceasefire over conflict amid regional security concerns in the aftermath of Ma'arka-e-Haq. Foreign Office Spokesperson Shafqat Ali Khan, at his weekly press briefing, reaffirmed Islamabad's commitment to regional peace while underscoring its military preparedness and diplomatic engagements. He confirmed that tensions with India had escalated into direct hostilities in recent weeks, during which Pakistan's Armed Forces shot down six Indian aircraft. He said that the Pakistan Armed Forces remained \"ever-ready\" in the face of \"India's unrelenting aggression.\" In response, Pakistan launched Operation Bunyanum Marsoos, a limited but strategic military campaign to defend its sovereignty, strictly targeting military infrastructure in accordance with the UN Charter. \"Our response reaffirmed Pakistan's military superiority and commitment to safeguarding national sovereignty,\" he said. \"The nation stood united in this effort.\" Foreign Office Spokesperson welcomed the recent Pakistan-India ceasefire as a \"positive development\" and acknowledged the role of several friendly nations, including the United States, Turkiye, Saudi Arabia, and others, in mediating the agreement. He noted that the Directors General of Military Operations (DGMOs) of both countries have maintained \"periodic and constructive contact\" and agreed on stage-wise de-escalation. He said that Pakistan returned a captured Indian Border Security Force (BSF) constable, and India reciprocated by handing over a Pakistani Rangers sepoy. \"This reflects Pakistan's maturity and commitment to peace, unlike India, which must be urged to abide by its ceasefire commitments,\" he said. Shafqat Ali Khan emphasized Pakistan's preference for diplomacy and peaceful dialogue. He reiterated Islamabad's support for international mediation efforts, including the U.S.initiative to address the Kashmir dispute. \"The resolution of Jammu and Kashmir, a UN-recognized dispute under several resolutions, including UNSC Resolution 47, remains vital to regional peace,\" he said. Responding to media queries pertaining to recent Indian claims of a nuclear facility being attacked, he dismissed reports as \"fake, preposterous, and a product of Indian propaganda.\" He urged New Delhi to \"reverify such misinformation before dissemination.\" He expressed concern over India's continued militarization and growing defence budget, calling it \"aggressive and hegemonic.\" He said that India's recent unilateral suspension of the Indus Waters Treaty was a violation of international norms and must be reversed immediately to restore water-sharing obligations. \"Pakistan is a sovereign nation with resilient institutions and an able populace. We are fully prepared to defend ourselves without harbouring hegemonic ambitions,\" he stated. He highlighted ongoing diplomatic initiatives, including the trilateral talks between Pakistan, China, and Afghanistan focused on regional security, development, and connectivity. He reaffirmed Islamabad's close ties with Turkiye and Azerbaijan and expressed appreciation for Russia's \"clear and balanced position\" during Indo-Pak tensions. Regarding allegations of terrorism, the spokesperson pointed out India's double standards: \"Pakistan has never hesitated to condemn terrorism, and we remain one of its biggest victims. India's role in sponsoring terrorism in the region and beyond is well-documented.\" He noted that while Pakistan offered condolences to India over recent tragic event in Pahalgam, the same courtesy was never extended from the Indian side after terrorist attacks in Pakistan. On the issue of illegal foreigners, he said the repatriation drive, initiated in November 2023, is \"ongoing and being handled humanely and lawfully.\" He assured that Pakistan has established a 24/7 hotline to address concerns regarding harassment, property disputes, or legal aid, particularly for Afghan nationals. Concluding the briefing, he emphasized that Pakistan remained a strong advocate of peace, multilateralism, and rule-based international order. However, he warned that continued Indian aggression, including its growing defence spending and diplomatic belligerence, could destabilize the region. \"Pakistan's vision is clear - we seek peace, not provocation. But rest assured, our Armed Forces are fully prepared to respond to any misadventure. We hope India will abandon its jingoism and work towards shared regional prosperity,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}