{
  "article_id": "2025-05-16_11addbedfc43e5c6a28596948329f17a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/restoration-of-neelum-jhelum-project-likely-to-take-two-years-na-told/",
    "retrieved_at": "2025-08-27T15:33:55.356Z"
  },
  "metadata": {
    "title": "Restoration of Neelum-Jhelum project likely to take two years: NA Told",
    "author": null,
    "date_published": "2025-05-16T08:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 303,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 16 (APP):Federal Minister for Water Resources Muhammad Moeen on Friday told the National Assembly that the restoration of the Neelum-Jhelum Hydropower Project (NJHPC) is expected to be completed within two years. During the question hour, he said a committee investigating the issue will soon finalize its report. The minister said about Rs 6.6 billion has been spent so far to repair the project's Tail Race Tunnel (TRT). After the TRT was fixed, the plant resumed full operations in March 2024, generating 969 megawatts of electricity. However, the plant had to be shut down again in May 2024 due to an issue in the Head Race Tunnel (HRT). He added that the main contract for repairing the HRT has not yet been awarded, following government instructions. Giving more details, the minister said NJHPC spent Rs 3.8 billion in 2022-23 and Rs 3 billion in 2023-24 for TRT repairs, with approval from its Board of Directors. He said the project is currently working under a provisional tariff on a \"take-and-pay\" basis. He said there are no fixed payments or returns on investment being paid. The company is managing its expenses through its own resources and pending payments from power sales to the Central Power Purchasing Agency (CPPA-G). According to the National Power Control Centre, the country currently has enough power generation to meet demand, and no load-shedding is being done due to shortages. He also said that local electricity supply has not been affected by the shutdown, as other power plants are supplying electricity through the national grid. The minister informed the House that the project's consultants have been told to review and improve maintenance procedures to avoid such issues in the future. He stressed the importance of operating and maintaining the plant according to the equipment manufacturer's guidelines to prevent unexpected closures.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}