{
  "title": "ICT administration to plant over 1 mln trees in Spring 2020",
  "link": "https://www.app.com.pk/national/ict-administration-to-plant-over-1-mln-trees-in-spring-2020/",
  "date_published": "2020-02-11T01:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP):Islamabad Capital Territory (ICT) Administration was going to plant over one million trees under the Prime Minister’s Clean Green Pakistan Initiative in Spring 2020.\nThe federal capital’s administration had already planted one million plants in 2019 and worked out the strategy to beef up the metropolis’ green cover as per the prime minister’s vision under the patronage of Chief Commissioner Islamabad Amir Ali Ahmed and Deputy Commissioner Muhammad Hamza Shafqaat, said Additional Deputy Commissioner (ADC) Dr Asif Raheem in an exclusive talk with APP.\nHe said the district administration had played a cooperative and supportive role to carry out massive plantation drive as purely a philanthropist and corporate social responsibility driven initiative with public support.\n“Around 16 registered cooperative housing societies, Islamabad Chambers of Commerce and Industry, schools, colleges and universities have participated in the plantation campaign where no public money has been spent in this drive. The trees have planted as per the vision to plant and own a tree as the people planting trees are themselves taking care of these plants,” he added.\nHe said around 0.6 million trees were planted by the cooperative housing societies with the collaboration of ICT administration in 2019. Moreover, National University of Science of Technology (NUST) and ICT administration had jointly planted one lac tree. However, around 4 lac trees were planted from the new Airport Road to Kashmir Highway and Islamic International University Islamabad took part in the plantation drive.\n“This year ICT administration has formed its Plan 2020 to augment its plantation target to 2 million whereas faster growing plant species with increased impact are being planted,” he added.\nMr Raheem said the plant species selected were climate change adaptive and suitable for the environmental conditions in the Potohar region.\nTo a question, he said horticulturists teams were constituted as per the directives of Chief Commissioner and Deputy Commissioner Islamabad to look after the installed plants in different parts of the metropolis. There had been separate meetings with the community organizations and cooperative housing societies and educational institutes to manage the plantation carried out under their domain.\nHe said the district administration with the assistance of Capital Development Authority (CDA) retrieved the encroached land from marquees and other buildings where 5,000 trees were planted with the help of private bodies.\n“Under Plan 2020, we have started work in the sectors of G-12, G-13, G-14 and Kashmir Highway. Plantation will also be carried out from Kashmir Highway to Zero Point. We have sufficient stock of saplings available and do not rely on Metropolitan Corporation Islamabad’s nurseries,” ADC Dr Asif Raheem said.\nHe added that third party evaluation had been conducted by Horticulture Department’s consultant after six months of the plantation done in 2019. “The evaluation report has shown 70 to 80 percent survival rate of the plants planted in the federal capital,” he added.",
  "retrievedAt": "2025-08-11T18:47:09.169Z"
}
