{
  "title": "Deputy Speaker sees off walker Kasrat Rai on special walk for Kashmir",
  "link": "https://www.app.com.pk/national/deputy-speaker-sees-off-walker-kasrat-rai-on-special-walk-for-kashmir/",
  "date_published": "2020-02-11T05:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP):Deputy Speaker National Assembly Qasim Khan Suri Tuesday seen off renowned walker Kasrat Rai on special walk for the people of Indian Occupied Jammu and Kashmir here from Parliament House.\nTalking to media persons, he said that Kasrat Rai would walk throughout New Zealand to highlight the atrocities being committed against the people of Indian Occupied Kashmir (IOK).\nHe said that India government was committing atrocities and human rights violations against the innocent people of IOK.\nHe said that India was doing all this to implement the RSS mind set against Indian Muslim and people of Kashmir.\nHe said, “I would salute people of Kashmir for their resilience against the Indian atrocities”.\nThe Deputy Speaker said that people of Kashmir was always feeling proud to hold flags of Pakistan despite all the atrocities.\nHe said that Indian government also was not tolerating minorities and people of other religions in India.\nHe said that Kashmiris were in deep love with Pakistan and one day Kashmir would get freedom from India illegal occupation.\nKasrat Rai is Pakistani two-time holder of the world record for peace walks.\nHe has devoted his life for the cause of Peace, Education, Health and Cultural activities.\nHe achieved a wide spread fame for the sake of his noble cause.\nHe has conducted a number of walks with the flag of peace within and beyond the boundaries of Pakistan.\nSpeaking on the occasion, he thanked the government and Deputy Speaker National Assembly for organizing special event to seen off him.\nHe said that he would walk throughout New Zealand to highlight the atrocities and human rights violations in IOK. He said that his walk was against the Indian government discriminatory laws and atrocities on the people of Kashmir.",
  "retrievedAt": "2025-08-11T18:46:53.183Z"
}
