{
  "title": "Pakistan Post revenue increases by Rs7 b within a year: Murad",
  "link": "https://www.app.com.pk/national/pakistan-post-revenue-increases-by-rs7-b-within-a-year-murad/",
  "date_published": "2020-02-11T05:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP):Minister for Communication and Postal Services Murad Saeed Tuesday said under the dynamic leadership of Prime Minister Imran Khan, the revenue of Pakistan Post had witnessed an increase of Rs7 billion within a year after PTI government’s coming into power.\nSpeaking in the National Assembly, he said the prime minister and his team had rescued the economy which was sinking and all the institutions were near to bankruptcy.\nMurad Saeed said the government was working on a reforms agenda aiming to make all the institutions profitable including Pakistan International Airlines (PIA), Pakistan Railways and Pakistan Steel Mills.\nThe minister said Pakistan Peoples Party left the country in shambles with crippling debt. He said the previous governments had looted the country mercilessly and left the national economy in lurch.\nMurad Saeed said the 2019 was the year of economic stability and the fruits of stable economic initiatives would start reaching the masses in coming days.\nHe said 5.7 million families had been provided with Sehat Insaf Cards under which the cardholders could get medical treatment of up to Rs720,000 at the government and private hospitals.\nThe minister said the government had allocated Rs192 billion for the Ehsaas programme to help the poor segments of the country, adding that as many as 135 programmes come under the ambit of the Ehsaas programme.\nHe said tourism activities in the country had doubled under the Pakistan Tehreek-e-Insaf (PTI) government as it effectively projected the country’s positive image across the world.\nMurad Saeed said the present government was taking concrete measures to uplift the agriculture, reopen the textile mills and other sectors, adding that now investors were investing in Pakistan.\nIn past, the minister said all the contracts of gas and electricity were made in violation of the PPRA rules, which was tantamount to selling the nation for 25 years. Imran Khan, smelling the rat, had pointed out the violations in 2016 in a press conference, he said.\nMurad Saeed said the present government would not compromise on the accountability of corrupts and all the persons who looted the national exchequer would be hold accountable.\nHe said Pakistan Peoples Party (PPP) looted the country with both hands and transferred the ill-gotten money, which belonged to the poor people of Sindh, in fake accounts of Bilawal Bhutto Zardari.\nThe minister warned that Bilawal would not be able to speak at the floor of the house in future, unless he took oath that he would not leave the National Assembly without listening to the members, speaking in response to his speech.\nEarlier, PPP Chairman Bilawal Bhutto said the present government had failed to provide relief to the masses and could not control inflation and unemployment, besides it missed tax collection targets.\nCiting the report of different institutions like Pakistan Bureau of Statics (PBS), he said the country had never witnessed such a high inflation during the last ten years as it went up during the present government’s tenure.\nPointing out the empty seats of treasury benches in the house, Bilawal Bhutto said it showed the seriousness of the government with regard to the affairs of the state.\nBilawal Bhutto admitted the fact that there was poverty and inflation in the country before the PTI’s government took the power but unfortunately the state affairs went from bad to worse.\nThe PPP chairman also claimed that the federal government had tried to sabotage the Benazir Income Support Programme (BISP) and label it as their own under pseudonyms.",
  "retrievedAt": "2025-08-11T18:46:52.737Z"
}
