{
  "title": "Arrest of Netanyahu’s close aides over ‘Qatargate’ flares up political tension in Israel - World - DAWN.COM",
  "author": null,
  "content": "Two long-serving aides of Israel’s Prime Minister Benjamin Netanyahu were remanded in custody for three days after Israeli police arrested them for alleged unlawful ties between the senior aides and Qatar, a case that has become known as ‘QatarGate’, CNN reported.\n\nNetanyahu testified on Monday in the probe, which alleged payments from Qatar to some of his aides, an investigation he denounced as “politically motivated”.\n\nThe two aides, Yonatan Urich and Eli Feldstein, were arrested earlier on Monday. The arrests ratchet up political tensions in the country, where the government is trying to fire both the domestic security chief and attorney general, while expanding the power of politicians over the appointment of judges.\n\nThe moves have reignited a protest movement in Israel, coinciding with the government’s resumption of fighting this month in the Gaza Strip.\n\nFeldstein had separately been arrested late last year and released into house arrest on accusations of leaking a classified document related to hostage negotiations in Gaza to shift critical media coverage of the Israeli leader.\n\n“As soon as I was asked to testify, I said that I was free and that I wanted to testify immediately,” Netanyahu said in a video statement.\n\n“I understood that it was a political investigation but I didn’t realise how political it was, and they are holding Yonatan Urich and Eli Feldstein hostage … There is no case, there is absolutely nothing, just a political witch hunt, nothing else.”\n\nNetanyahu is separately on trial over corruption allegations that he denies.\n\nIsraeli media reported that a journalist from a prominent local publication had also been summoned for questioning in the case.\n\nQatar, a gas-rich Gulf state, has no diplomatic ties with Israel and has long hosted leaders of Palestinian group Hamas.\n\n“The brutal arrest of Yonatan Urich marks a new low in the political witch hunt to topple a right-wing prime minister and to prevent the dismissal of the failed head of the Shin Bet,” said a statement released by Likud, Netanyahu’s political party.\n\nTwo weeks ago, the Israeli government unanimously approved Netanyahu’s proposal to fire Ronen Bar, the head of the Shin Bet, Israel’s internal security agency.\n\nThe Supreme Court froze Bar’s dismissal and is to hold a detailed hearing on the case on April 8.\n\nAttorney General Gali Baharav-Miara, who is facing a similar dismissal, said the top court’s initial ruling prevents the hiring of a new security chief, but Netanyahu did so anyway on Monday.\n\nIn its statement on Monday, the Likud party linked the QatarGate investigations to efforts to prevent Bar and Baharav-Miara’s dismissals, saying “for weeks, the prosecution and the head of the Shin Bet have been conducting baseless investigations in the dark under a gag order, trying to prevent the dismissal of the head of the Shin Bet while using Urich and others as cannon fodder”.\n\nEarlier this month, the Shin Bet agency announced it had started investigating Netanyahu’s aides in relation to the case, barring the publication of any details.\n\nBar has accused Netanyahu of having a “personal interest” in firing him to “prevent investigations into the events leading up to October 7 and other serious matters” being looked at by the Shin Bet.\n\nIn a letter, Bar referred to the “complex, wide-ranging and highly sensitive investigation” involving people close to Netanyahu who allegedly received money from Qatar.\n\nOn Monday night, anti-government demonstrators again joined a protest outside parliament, mocking Netanyahu and calling for an end to the Gaza conflict and a deal to release hostages still held by militants there.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:55:53.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901645/arrest-of-netanyahus-close-aides-over-qatargate-flares-up-political-tension-in-israel",
  "dateList": "2025-04-02",
  "date_published": "2025-04-02T14:11:33.000Z"
}
