{
  "title": "Myanmar quake victim rescued after 5 days as death toll rises to over 2,880 - World - DAWN.COM",
  "author": null,
  "content": "Rescuers in Mandalay on Wednesday pulled a man alive from the rubble five days after Myanmar’s devastating earthquake, as calls grew for the junta to allow more aid in and halt attacks on rebels.\n\nThe shallow 7.7-magnitude earthquake on Friday flattened buildings across Myanmar, killing more than 2,800 people and making thousands more homeless.\n\nMyanmar’s state television MRTV said the death toll from last week’s earthquake has risen to 2,886. MRTV on Telegram also said 4,639 people were injured and 373 were missing, according to data as of Wednesday morning.\n\nSeveral leading armed groups fighting the government have suspended hostilities during the quake recovery, but junta chief Min Aung Hlaing said military operations would continue — despite international criticism of multiple reported air strikes.\n\nUN agencies, rights groups and foreign governments have urged all sides in Myanmar’s civil war to stop fighting and focus on helping those affected by the quake, the biggest to hit the country in decades.\n\nHopes of finding more survivors are fading, but there was a moment of joy on Wednesday as a man was pulled alive from the ruins of a hotel in the capital Naypyidaw.\n\nThe 26-year-old hotel worker was extracted by a joint Myanmar-Turkish team shortly after midnight, the fire service and junta said.\n\nDazed and dusty but conscious, the man was pulled through a hole in the rubble and put on a stretcher, a video posted on Facebook by the Myanmar Fire Services Department showed.\n\nWith patchy communication and infrastructure delaying efforts to gather information and deliver aid, the full scale of the disaster has yet to become clear, and the toll is likely to rise.\n\nThe World Health Organisation (WHO) reported severe damage in the city of Sagaing, citing local rescuers saying one in three houses there have collapsed.\n\nHealthcare facilities, damaged by the quake and with limited capacity, are “overwhelmed by a large number of patients”, while supplies of food, water and medicine are running low, WHO said in an update.\n\nSagaing has seen some of the heaviest fighting in Myanmar’s civil war, and AFP journalists have not been able to reach the area.\n\nRelief groups say the overall quake response has been hindered by continued fighting between the junta and the complex patchwork of armed groups opposed to its rule, which began in a 2021 coup.\n\nJulie Bishop, the UN special envoy on Myanmar, called on all sides to “focus their efforts on the protection of civilians, including aid workers, and the delivery of life-saving assistance”.\n\nEven before Friday’s earthquake, 3.5 million people were displaced by the fighting, many of them at risk of hunger, according to the United Nations.\n\nLate on Tuesday, an alliance of three of Myanmar’s most powerful ethnic minority armed groups announced a one-month pause in hostilities to support humanitarian efforts in response to the quake.\n\nThe announcement by the Three Brotherhood Alliance followed a separate partial ceasefire called by the People’s Defence Force — civilian groups that took up arms after the coup to fight junta rule.\n\nBut there have been multiple reports of junta air strikes against rebel groups since the quake.\n\nMyanmar’s junta said today its troops fired warning shots at a Chinese Red Cross aid convoy, underlining the challenge of delivering relief amid a civil war.\n\nThe military has struggled to run Myanmar following its coup against the elected civilian government of Nobel laureate Aung San Suu Kyi in 2021, reducing the economy and basic services, including healthcare, to tatters after civil war broke out.\n\nJunta spokesperson Zaw Min Tun said the Chinese Red Cross had not informed authorities it was in a conflict zone on Tuesday night, and a security team fired shots in the air after the convoy, which included local vehicles, failed to stop.\n\nA Chinese foreign ministry spokesperson said the aid team and supplies were safe, and called on all parties in Myanmar to ensure the safety of rescuers.\n\n“It’s necessary to keep transportation routes for relief efforts open and unobstructed,” Guo Jiakun told a press conference.\n\nThe rural parts of hard-hit Sagaing region were mostly under the control of armed resistance groups fighting the military government, the International Crisis Group (ICG) said.\n\n“They will be among the most challenging for aid agencies to reach, given regime restrictions, a complex configuration of local administrations and control by armed resistance groups, and the persistent conflict,” it added in a statement.\n\nEven before the quake, the ICG said, information had been hard to gather from such areas, because of a junta blackout of internet and mobile phone networks as part of the conflict.\n\n“Soldiers are everywhere in the town,” a man who travelled to Sagaing told Reuters. “They are there for security, not for rescue. They check every vehicle.”\n\n“We are aware that some ethnic armed groups are currently not engaged in combat, but are organising and training to carry out attacks,” said Min Aung Hlaing yesterday, mentioning sabotage against the electricity supply.\n\n“Since such activities constitute attacks, the Tatmadaw (armed forces) will continue to carry out necessary defensive activities,” he said in a statement.\n\nBut the UN special rapporteur on human rights in Myanmar, Tom Andrews, rejected the junta’s characterisation of its operations.\n\n“Senior General Min Aung Hlaing has described ongoing junta attacks in the midst of Myanmar’s suffering as ‘necessary protective measures’,” he wrote on X.\n\n“They are neither necessary nor protective. They are outrageous and should be condemned in the strongest possible terms by world leaders.”\n\nAustralia’s government decried the reported air strikes, saying they “exacerbated the suffering of the people”.\n\n“We condemn these acts and call on the military regime to immediately cease military operations and allow full humanitarian access to affected areas,” Foreign Minister Penny Wong said.\n\nAmnesty International said “inhumane” military attacks were significantly complicating earthquake relief efforts in Myanmar.\n\n“You cannot ask for aid with one hand and bomb with the other,” said the group’s Myanmar researcher Joe Freeman.\n\nHundreds of kilometres away, in the Thai capital of Bangkok, workers continued to scour through the rubble of a collapsed 30-storey skyscraper.\n\nThe structure had been under construction when the earthquake hit and its crash buried dozens of builders — few of whom have come out alive.\n\nThe death toll at the site has risen to 22, with more than 70 still believed trapped in the rubble.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0214061748fef65.jpg",
  "retrievedAt": "2025-08-25T13:55:55.801Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901620/myanmar-quake-victim-rescued-after-5-days-as-death-toll-rises-to-over-2880",
  "dateList": "2025-04-02",
  "date_published": "2025-04-02T10:20:17.000Z"
}
