{
  "title": "Trump tells Cabinet, others that Musk will leave soon, Politico reports - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump has told members of his Cabinet and other close contacts that tech billionaire Elon Musk will soon step back from his cost-cutting government role, Politico reported on Wednesday, citing three people close to Trump.\n\nTrump has tasked the Tesla and SpaceX CEO with leading efforts through his Department of Government Efficiency (DOGE) to cut government funding and dismantle various US agencies as a special government employee.\n\nPolitico reported that both Trump and Musk decided in recent days that Musk will soon return to his businesses, but gave no specific date.\n\nMusk and DOGE did not immediately respond to requests for comment on the report.\n\nShares of some companies, including government contracting companies, rose following the report. Shares of Musk’s Tesla, which were down 2 per cent in early trading after a sharper-than-expected fall in first-quarter deliveries, reversed course and were up about 5pc.\n\nIt was not immediately clear if Musk would leave before his 130-day mandate is set to end in late May or early June.\n\nA White House source told Reuters that Musk’s investors want him to return to his companies, that his work with DOGE would be done within 130 days, and that he had communicated that to the president multiple times.\n\nMusk was not leaving before his DOGE work was done “and no one is pushing him out”, the source added.\n\nAsked on Monday if he wanted Musk to stay beyond his 130-day term, Trump told reporters: “I think he’s amazing, but I also think he’s got a big company to run. At some point, he’s going to be going back. He wants to.”\n\nMusk told Fox News last week that he was confident he would finish most of his work to cut $1 trillion in federal spending by the end of his 130 days.\n\nMusk’s potential departure does not necessarily mean the end of DOGE. The cost-cutting team’s mandate expires on July 4, 2026, under an executive order Trump signed on January 20.\n\nThere has been growing unease across the US over Musk’s blunt approach to cutting tens of thousands of workers from the government workforce.\n\nRepublican lawmakers have faced the wrath of angry voters at unruly town halls while many of DOGE’s efforts have become the subject of lawsuits.\n\nTesla dealerships have been vandalised in the US and abroad, and a nationwide protest against DOGE and Trump’s agenda is planned for this Saturday.\n\nOn Tuesday, a liberal judge in Wisconsin won election to the state Supreme Court, easily defeating a conservative judge whose campaign had been heavily bankrolled by Musk and groups tied to him.\n\nThe vote had been seen as an early referendum on Trump’s presidency and Musk’s campaign to remake the US civil service.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/02235255eb411ed.jpg",
  "retrievedAt": "2025-08-25T13:55:53.041Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901662/trump-tells-cabinet-others-that-musk-will-leave-soon-politico-reports",
  "dateList": "2025-04-02",
  "date_published": "2025-04-02T18:56:08.000Z"
}
