{
  "title": "US prosecutors to seek death penalty for Luigi Mangione, Bondi says - World - DAWN.COM",
  "author": null,
  "content": "US Attorney General Pamela Bondi directed federal prosecutors to seek the death penalty for Luigi Mangione, the man accused of shooting and killing Brian Thompson, the CEO of UnitedHealth Group’s insurance division, in New York last year.\n\nIn a statement, Mangione’s lawyer Karen Friedman Agnifilo called the decision to seek the death penalty “barbaric”.\n\n“While claiming to protect against murder, the federal government moves to commit the pre-meditated, state-sponsored murder of Luigi,” Friedman Agnifilo said.\n\nMangione, 26, has pleaded not guilty to New York state charges of murder as an act of terrorism and weapons offences. He could face life in prison without parole if convicted in that case. New York does not have the death penalty for state charges.\n\nMangione faces a parallel federal indictment in Manhattan federal court over Thompson’s killing, which is where Bondi said prosecutors will aim for the death penalty. He has not yet been asked to enter a plea to the federal charges.\n\nIf Mangione is convicted in the federal case, the jury would determine in a separate phase of the trial whether to recommend the death penalty. Any such recommendation must be unanimous, and the judge would be required to impose it.\n\nThompson was shot dead on December 4 outside a Midtown Manhattan hotel, where the company was gathering for an investor conference.\n\n“Luigi Mangiones murder of Brian Thompson — an innocent man and father of two young children — was a premeditated, cold-blooded assassination that shocked America,” Bondi said in a statement.\n\n“After careful consideration, I have directed federal prosecutors to seek the death penalty in this case as we carry out President Trump’s agenda to stop violent crime and make America safe again,” Bondi said.\n\nThe brazen killing of Thompson and the ensuing five-day manhunt captivated Americans.\n\nPolice officers in Altoona, Pennsylvania, found Mangione on December 9 with a 9-millimeter pistol and silencer, clothing that matched the apparel worn by Thompson’s shooter in surveillance footage, and a notebook describing an intent to “wack” an insurance company CEO, according to a court filing.\n\nWhile public officials condemned the killing, some Americans have cheered Mangione, saying he drew attention to steep US healthcare costs and the power of health insurers to refuse payment for some treatments. He is currently being held in federal lockup in Brooklyn.\n\nBondi lifted a moratorium on February 5 on federal executions imposed in 2021 by her predecessor Merrick Garland, the attorney general under Democratic president Joe Biden.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/02170538b5b7896.jpg",
  "retrievedAt": "2025-08-25T13:55:55.399Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901641/us-prosecutors-to-seek-death-penalty-for-luigi-mangione-bondi-says",
  "dateList": "2025-04-02",
  "date_published": "2025-04-02T12:10:21.000Z"
}
