{
  "title": "More women come forward over ‘prolific’ Chinese rapist - World - DAWN.COM",
  "author": null,
  "content": "More than 20 women have come forward to say they may have been sexually assaulted by a Chinese student convicted last month of raping 10 women, London police said on Wednesday after an international appeal.\n\nAccording to a report published in 2024, Unicef estimates revealed that more than 370 million girls and women alive today experienced rape or sexual assault before the age of 18.\n\nSerial rapist Zhenhao Zou, 28, who is due to be sentenced in June, targeted young Chinese women whom he invited to his flat for drinks or to study before drugging and attacking them.\n\nHe filmed some of the rapes with hidden or handheld cameras, his London trial was told. Of the 10 women cited in the trial, only two have been identified.\n\nAfter his March 5 conviction, London’s Met police said they had evidence to suggest he could have targeted more than 50 other women and urged possible victims to come forward.\n\n“Given how prolific Zou seems to have been, there is every potential he could be one of the most prolific offenders that we’ve ever seen,” the Met’s Commander Kevin Southworth said.\n\nSouthworth said 23 potential victims had contacted officers from “different parts of the globe”.\n\n“The primary places where we believe offending may have occurred at this time appears to be… here in London, and over in China.”\n\nNo one had yet contacted police from Belfast in Northern Ireland where Zou also studied in 2017 before moving to London two years later, but Southworth said officers were “open-minded about that”.\n\n“Given how active and prolific Zou appears to have been with his awful offending, there is every prospect that he could have offended anywhere in the world,” he added.\n\nZou, who was an engineering student at University College London, was found guilty by a jury on March 5 of 28 offences including 11 counts of rape – with two of the counts relating to one woman – three counts of voyeurism and one of false imprisonment.\n\nHe was also convicted of three counts of possessing butanediol – an industrial solvent – with intent to commit a sexual offence and 10 counts of possession of an extreme pornographic image.\n\nThe Met said officers were compiling a file of new evidence to be submitted to prosecutors after Zou’s sentencing on June 19.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:55:57.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901638/more-women-come-forward-over-prolific-chinese-rapist",
  "dateList": "2025-04-02",
  "date_published": "2025-04-02T11:13:13.000Z"
}
