{
  "title": "PUC, Dar-ul-Ifta Pakistan issue code of conduct for pilgrims, emphasizing religious etiquette, Saudi regulations",
  "link": "https://www.app.com.pk/national/puc-dar-ul-ifta-pakistan-issue-code-of-conduct-for-pilgrims-emphasizing-religious-etiquette-saudi-regulations/",
  "date_published": "2023-06-14T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): The Pakistan Ulema Council (PUC), in collaboration with Dar-ul-Ifta Pakistan, has released a comprehensive code of conduct for pilgrims, urging them to observe religious decorum and abide by the regulations set by the Kingdom of Saudi Arabia.\nChairman Hafiz Muhammad Tahir Mahmood Ashrafi who is also the prime minister’s special representative on interfaith harmony and the middle east, made the announcement during a press conference, highlighting the significance of Hajj as a sacred act of worship aimed at seeking Allah’s pleasure.\nHe commended the Saudi government for its exceptional arrangements, describing them as unparalleled in the history of Islam.\nHe emphasized that it was the responsibility of pilgrims to refrain from engaging in religious or political gatherings or discussions during their stay in Saudi Arabia and strictly adhere to the government’s rules and regulations for Hajj.\nThe code of conduct advised pilgrims to follow the teachings of the Saudi Ministry of Interior and the Saudi Ministry of Hajj and Umrah, showing respect to instructors in Mina, Arafat, and Muzdalifah, and displaying good manners towards fellow pilgrims and encouraging the younger pilgrims to serve and assist the elderly, he added.\nAshrafi highlighted that within the Haram’s jurisdiction, every prayer offered carries the reward of a hundred thousand prayers. Additionally, he stressed the importance of maintaining good health during the Hajj days and clarified that the new Mina area was an integral part of Mina, dispelling any doubts.\nThe chairman urged pilgrims to exhibit patience and compassion and refrain from engaging in conflicts, using abusive language, or indulging in political and sectarian discussions.\nHe expressed gratitude to the Kingdom of Saudi Arabia, its people, and the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz, and Crown Prince Muhammad bin Salman for their dedicated services to pilgrims and devotees.\nAshrafi also acknowledged the commendable support provided by the Saudi government through the Road to Makkah project, and also praised the Ministry of Religious Affairs and Interfaith Harmony, under the leadership of Senator Muhammad Talha Mehmood, for their remarkable improvements, ranging from the selection of assistants to the accommodations for Pakistani pilgrims.\nDuring the press conference, he expressed concern over baseless campaigns by certain Pakistani elements in the United States (US), United Kingdom (UK), and European countries in the name of human rights.\nHe criticized the irresponsible role played by some political party leaders in this regard.\nAshrafi assured that a committee had been formed by the PUC to investigate the events of May 9, and a report containing all the facts would be submitted by July 15.\nThe committee aimed at presenting its findings to the nation and the world, including the ambassadors of the US, European countries, and the UK, urging action against both the political workers and those behind them.\nResponding to a question, Ashrafi emphasized the PUC’s apolitical stance and called for politicians to engage in negotiations to bring stability to the country.\nHe added that the council would support candidates in elections who demonstrate sincerity towards religion, country, and the nation, and decisions in this regard would be made when the time comes.\nAlongside Hafiz Muhammad Tahir Mahmood Ashrafi, the press conference included the presence of prominent figures such as Maulana Nauman Hashir, Maulana Tahir Aqeel Awan, Maulana Abu Bakar Hameed Sabri, Maulana Zulfikar, Maulana Hafeezur Rahman, Maulana Shahbaz Ahmed, Hafiz Saqib Munir, Maulana Afzal Shah Hussaini, Maulana Naib Khan, Maulana Atif Tanveer, Maulana Gulistan and otters.",
  "retrievedAt": "2025-08-11T08:42:46.991Z"
}
