{
  "title": "BIiparjoy: Cyclone halts small aircraft flights, ban on commercial flights to be decided today",
  "link": "https://www.app.com.pk/national/biiparjoy-cyclone-halts-small-aircraft-flights-ban-on-commercial-flights-to-be-decided-today/",
  "date_published": "2023-06-14T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): The very severe cyclonic storm (VSCS) Biparjoy has caused a halt of small aircraft operations in the areas facing impacts of cyclonic winds, whereas the government has started mulling over the closure of commercial flights as well in its high-level meeting to be convened on Wednesday evening.\nThe Very Severe Cyclonic Storm (VSCS) “Biparjoy” over the northeast Arabian Sea moved further north-northwestward during the last six hours, and now lies near Latitude 21.9°N and Longitude 66.3°E at a distance of about 340km south-southwest of Karachi, 355km south-southwest Thatta and 275km south-southwest of Keti Bandar.\nIn a joint media briefing, flanked by Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik, Federal Minister for Climate Change and Environmental Coordination Senator Sherry Rehman shared a recent update on the VSCS Biparjoy.\nSenator Sherry Rehman said that the cyclone was heading toward the coastline of the country. She added that the winds were blowing at a speed of 140 kilometers per hour (km/h) and all the institutions were working together to ensure that the preparations were being made along with precautionary measures.\nThe senator informed that some 75 relief camps were established and according to the Sindh government, all the individuals were evacuated from the potentially affected areas.\nShe urged the masses that there was no need to panic as the authorities concerned were vigilant and taking prerequisite measures. Public safety and saving people’s lives was the top priority of the government, she added.\nThe minister requested the masses to stay away from coastal areas and reiterated that this difficulty needed to be faced with courage. She announced that the government would soon issue an advisory regarding small ships.\nChairman NDMA, Lieutenant General Inam Haider Malik informed that the VSCS BIPARJOY might make landfall in Keti Bandar by tomorrow (June 15) afternoon. He underlined that there was a risk of urban flooding in the areas of Karachi, whereas some 62,000 people were shifted to safer places.\n“After every two hours, cyclone-related information is being shared with the institutions concerned. The movement of small aircraft is being stopped at Karachi Airport, whereas a decision will also be taken soon regarding commercial planes,” he added.\nThe NDMA chairman said a data bank of the relocated population was also compiled, adding, “If more areas are submerged, another phase of migration will follow,” he said.\nHe informed that the orders were issued to immediately stop flights of small aircraft while a decision regarding commercial flights would be taken in the meeting to be held at 1700 hours in the evening.",
  "retrievedAt": "2025-08-11T08:42:54.173Z"
}
