{
  "title": "Minister Talha announces successful impact of Hajj Portal in resolving pilgrims’ issues",
  "link": "https://www.app.com.pk/national/minister-talha-announces-successful-impact-of-hajj-portal-in-resolving-pilgrims-issues/",
  "date_published": "2023-06-14T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Minister for Religious Affairs and Interfaith Harmony Senator Muhammad Talha Mahmood held a press conference on Wednesday to discuss the positive impact of the Hajj portal on pilgrims in Pakistan and Saudi Arabia.\nHe emphasized the portal’s significance in addressing various issues faced by pilgrims during their sacred journey.Senator Talha highlighted his personal commitment to facilitating direct communication with pilgrims by employing a team of information technology experts at his own expense.\nThis team had developed a state-of-the-art Hajj portal, enabling pilgrims to lodge complaints and providing the minister with a platform to monitor and promptly address their concerns.\nIn addition, the minister informed the audience that the ministry had established complaint centers in Makkah and Madinah to further assist in resolving pilgrims’ issues.\nHe assured everyone that the ministry was dedicated to ensuring the provision of maximum facilities and would continue to strive for the success of the Hajj operation.\nSenator Talha shared some excellent news, stating that the ministry had already returned Rs. 4.5 billion to the pilgrims. Moreover, the ministry had set aside a significant amount to be returned to the pilgrims upon their completion of the spiritual journey, providing them with a financial cushion.\nSince assuming the position of religious affairs minister, he had consistently worked to address the ministry’s challenges and discourage free Hajj trips through all possible means.\nHe even shared a personal example, mentioning that he and his personal staff paid their dues at the bank to fulfill this sacred religious obligation.\nWhen asked about the issue of tent allocations in the old Mina area, the minister explained that he had written a letter to the Saudi Ministry of Hajj and Umrah. However, they informed him that they had already made allocations based on the pattern of Hajj in 2018 and 2019.\nThey expressed their inability to make changes at the present time but assured him that the issue would be addressed next year, taking into account the ground realities.\nRegarding the departure of a certain number of Moavineen-e-Hujjaj to Saudi Arabia, the minister stated that the private sector had returned 13,500 Hajj quotas, while the government had withdrawn 6,500 quotas. As a result, 20,000 individuals were not proceeding for Hajj this year, and therefore, it was deemed unnecessary to send further assistants using the hard-earned money of the pilgrims.\nSenator Talha also clarified his stance on the news circulating in some sections of the media regarding President Arif Alvi’s Hajj pilgrimage.\nHe made it clear that neither the presidency had been in contact with him nor did he have any involvement in the process.\nThe Minister for Religious Affairs and Interfaith Harmony concluded the press conference by reiterating his dedication to serving the pilgrims and resolving their issues in a fair and transparent manner.",
  "retrievedAt": "2025-08-11T08:42:45.548Z"
}
