{
  "title": "Seminar highlights importance on ‘World Blood Donation Day’",
  "link": "https://www.app.com.pk/national/seminar-highlights-importance-on-world-blood-donation-day/",
  "date_published": "2023-06-14T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): The Pakistan Institute of Medical Sciences (PIMS) organized a seminar Wednesday on the occasion of ‘World Blood Donation Day’ to pay tribute to the people who donate their blood so that many human lives can be saved.\nAddressing the seminar, Chief Executive Officer (CEO) of Pakistan Sweet Home and President of the Allied Health Professional Council of Pakistan Zamurrad Khan (Hilal E Imtiaz) termed the day as the ‘great day’ which imparted the message related to the importance of blood donation.\n“This day is a day to pay tribute to the heroes who donate blood regularly to save innocent lives. Donating blood is the greatest act,” he said and asserted that “People as good as in Pakistan are not found anywhere in the whole world”.\n“Our people of Pakistan are lively and do not hesitate to make any sacrifice. What can be a better example than this we started the mission of saving innocent lives two years ago today,” he recalled.\n“It [Pakistan Sweet Home] collected more than 13 thousand blood donations from Rawalpindi and Islamabad alone. This is only the passion of the people of the twin cities,” he said, hoping that if the blood donation exercise was extended to all over Pakistan then there would never be a shortage of blood in any of the country’s hospitals.\nAddressing the ceremony, Secretary Federal Ministry of Health Iftikhar Ali Shalwani said that it was a great honour for him to be a part of this ceremony. He said that It was delightful to see that there were people who had donated blood more than 200 times. “Undoubtedly, Mr. Zamurrad Khan is on his way to achieving a great mission in this regard,” he acknowledged.\n“Collecting blood donations on a daily basis for children battling thalassemia, haemophilia and blood cancer diseases and providing free quality blood to deserving patients is indeed a great work. We are proud of Zamurrad Khan Khan and the whole world is in awe of what he is doing. May Allah reward Mr. Zamurrad Khan and his entire team,” the secretary said.\nMeanwhile, Director Project Asad Bin Azam of Pakistan Sweet Home Blood Bank, while giving a briefing, said that World Blood Donor Day was celebrated every year on June 14 worldwide to increase the number of safe, voluntary blood donors.\n“Pakistan requires an average of 30 to 35 lakh blood units every year. Blood donors provide an important service to humanity. If only 1-3% of the population voluntarily and regularly start donating their blood every 3 months in a year, the requirement of blood and blood bags can be easily met,” he asserted.\nGeneral (Rtd) Mustafa Kamal Akbar, Brigadier (Rtd) Nuzhat Mushahid, Col. (Rtd) Tauqeer Abbas, Dr Farwa Sharjeel, Dr. Hassan Abbas and others also spoke on this occasion.",
  "retrievedAt": "2025-08-11T08:42:45.399Z"
}
