{
  "title": "Lawmakers lauds government for presenting balanced budget",
  "link": "https://www.app.com.pk/national/lawmakers-lauds-government-for-presenting-balanced-budget/",
  "date_published": "2023-06-14T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):The lawmakers in the National Assembly have expressed their commendation for the government’s presentation of a balanced budget despite the current economic challenges.\nAgha Hassan Baloch, during the budget debate, condemned the May 9 incident and emphasized his party’s opposition to violence.\nHe appreciated the government’s decision to enhance the salary of government employees and highlighted the issues faced by the people of Balochistan, urging the government to take steps to address them.\nHe also suggested improving trade ties with Iran and emphasized the need for the federal government to promote agriculture in Balochistan province.\nOn the other hand, Syed Mobeen Ahmed criticized the budget, pointing out that expenditures exceed the government’s revenue. He called for political forces to come together, engage in discussions, and find solutions to the country’s current challenges.\nNawabzada Iftikhar Ahmed Khan criticized the PTI government, holding them responsible for the country’s economic downturn and alleged that they had undermined the country’s diplomacy. While appreciating the increase in government employees’ salaries, he urged the government to raise it further by up to 50 percent.\nHe also commended the government for introducing measures to uplift the agriculture sector and strongly condemned the May 9 incident, calling for punishment of the culprits involved.\nRana Muhammad Aslam Noon expressed satisfaction with the government’s announcement of a balanced budget during the current economic depression.\nHe strongly condemned the May 9 incident and criticized the PTI leadership for promoting a culture of abuse in the country.\nMuhammad Aslam Noon also expressed his dissatisfaction with the PTI leadership, accusing them of promoting a culture of abuse and disrespect towards Pakistan army personnel who have made sacrifices for future generations.\nAgha Syed Mehmood Shah appreciated Finance Minister Ishq Dar and Minister for Planning Ahsan Iqbal for presenting a balanced budget.\nHe stated that despite the economic crisis, the government, under the leadership of the prime minister, has announced the best budget.",
  "retrievedAt": "2025-08-11T08:42:52.339Z"
}
