{
  "title": "Rashid discusses border security with Iranian authorities",
  "link": "https://www.app.com.pk/national/rashid-discusses-border-security-with-iranian-authorities/",
  "date_published": "2021-01-04T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):Minister for Interior Sheikh Rashid Ahmed Monday said Pakistan had a history of close and fraternal relations with Iran and it was ready to further extend the existing ties with the neighbouring state in all the sectors beneficial for the two countries.\nThe minister expressed these views during a meeting with Chief of Iran’s Anti-Narcotics Police Brigadier-General Majid Karimi, who called on him here, a news press release said.\nThe meeting was also attended by Iranian Ambassador to Pakistan Seyed Mohammad Ali Hosseini.\nSheikh Rashid said the Government of Pakistan was committed to work closely with Iran in border management and the fight against drug trafficking.\nHe also called for the development of relations between the relevant institutions of two countries, especially the professional activities between the two anti-narcotics forces.\nPakistan was ready to cooperate with Iran in guarding the common borders, he added.\nThe Iranian Anti-Narcotics Police chief congratulated Sheikh Rashid for taking over the responsibility as interior minister and conveyed a warm greeting from the Chief of the Police of the Islamic Republic of Iran.\nMajid Karimi said Iran was willing to expand cooperation with Pakistan especially during the situation of pursuit and conflict with smugglers and terrorists.\nHe stressed the need for further extending the cooperation in border control, security issues at common crossing points and effective tackling of drug traffickers.\nHe welcomed Pakistan’s move to fence its common border with Iran and considered it effective in the fight against drug trafficking and other crimes.\nIran desired to enhance the security border security and bring economic prosperity in order to improve the livelihoods of residents living on both sides of the border, he added.\nHe called for the increased interaction between the Iranian Border Police and the Frontier Corps, saying, “The current level of this cooperation is desirable and we seek to strengthen it even more.”",
  "retrievedAt": "2025-08-11T20:12:49.371Z"
}
