{
  "title": "PTI govt to add 6,147 kms highways to national network: Murad",
  "link": "https://www.app.com.pk/national/pti-govt-to-add-6147-kms-highways-to-national-network-murad/",
  "date_published": "2021-01-04T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):Federal Minister for Communications and Postal Services Murad Saeed Monday said the Pakistan Tehreek-e-Insaf government was going to add 6,147 kilometers highways in the national network to provide best connectivity and transport infrastructure facilities to the people.\nAddressing to a vehicles handing over ceremony here, he said the authority had recovered Rs 20 billion through accountability and internal audit recovery during the current government’s regime.\nThe government would construct 150 percent more roads than the previous governments, which already contributed 1,600 kilometers roads in the system to date.\nThe government would lay down around 3,250 kilometers roads in Balochistan where not more than 1,000 kms roads were constructed in the past ten years in the province.\nThe PTI government had initiated development work on western route of Pakistan China Economic Corridor (CPEC) to eliminate the distress of the people of underprivileged areas, he added.\nMurad mentioned that the Prime Minister Imran Khan had inaugurated ground breaking ceremony of Zhob-Kuchlak and Khuzdar-Basima highway as around 60 percent of construction work was completed.\nThe construction work was also initiated on Khushab-Awaran and Ratodero to Shikarpur routes whereas the project of Dara Adam khel would be completed in near future.\n“The NHA will also inaugurate the projects of Quetta and Dera Murad Jamali bypass during the ongoing month.”\nHe also shared the details of projects to be complete in next three months including Nokundi-Mashkel , Harnai-Sinjavi, Chitral to Gilgit Baltistan and other connectivity routes.\nThe minister added that the development work would be started on the construction of Shikarpur to Rajanpur road in next three months.\n“The feasibility report of 796 km long Chaman-Quetta and Quetta to Karachi has been completed which would be built under the public private partnership.”\nThe communication ministry has decided to distribute the revenue generated though fines on motorway to improve the performance of attached departments.\nThe ministry has also handed over charge of newly constructed motorways to the NHMP.\nAround 609 junior patrolling officers had passed out and the process was underway to appoint 1,200 more officers in the motorway police.\nThe government has integrated the prerequisite of motorway police required under the project including security cameras and vehicles for patrolling in the PC-1 of Sukkur-Hyderabad motorway project.\nNHMP had launched “Hamsafar” Smartphone application to facilitate commuters by providing real-time road situation to commuters, instant weather updates and help motorway users in distress.\n“With the help of this Hamsafar app, NHMP will respond quickly and serve the people more effectively.”\nFirst time in the history of the country, the ministry of communication had launched road safety policy with the consultation of provincial transport department with an aim to control road accidents.\nHe directed the authority concern to launch awareness campaign on all platforms of media to sensitise the commuters regarding traffic roles and road safety.",
  "retrievedAt": "2025-08-11T20:12:50.489Z"
}
