{
  "title": "PM gives in-principle approval to setting up pension fund for Pakistan Post",
  "link": "https://www.app.com.pk/national/pm-gives-in-principle-approval-to-setting-up-pension-fund-for-pakistan-post/",
  "date_published": "2020-05-13T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):Prime Minister Imran Khan on Wednesday gave an in-principle approval to establishment of Pakistan Post Pension Fund for an institutionalized mechanism for disbursing of pension to retired employees.\nChairing a meeting on pension for employees of Pakistan Post, the prime minister also approved setting up a committee comprising Ministry of Finance, Ministry of Communications, Security Exchange Commission of Pakistan and National Investment Trust to finalize proposals on the Pension Fund for submission before the federal cabinet.\nThe prime minister stressed devising pension system across the country on modern lines to meet the challenges of limited financial resources of the government and reduce burden over exchequer.\nThe meeting was attended by Minister for Communications Murad Saeed, Minister for Planning Asad Umar, PM’s Adviser on Finance Dr Abdul Ahafeez Sheikh, Adviser on Constitutional Reforms Dr Ishrat Hussain, Secretary Finance Naveed Kamran Baloch, Director General Pakistan Post Muhammad Ikhlaq Rana and senior officials.\nThe meeting was informed that pension consumed around 34 percent of the budget of Pakistan Post, with gradual increase with time.\nPakistan Post, in line with prime minister’s direction to follow Malaysia’s pension model, has proposed establishment of a pension fund. The objective is to reduce the burden on the government and improve system of pension.\nMurad Saeed briefed about reforms in Pakistan Post and other steps to make the institution profit-making.\nThe prime minister was apprised that the agreement on digitalization of Pakistan Post would be signed next week, under which the employees would be provided iPads and other gadgets for biometric verification.\nFor the first time, the retired and elderly pensioners of Pakistan Post have been given pension at their homes, a step being appreciated worldwide including by the United Nations. On the eve of Eid, Pakistan Post is disbursing pensions in advance.\nThe minister said 26 valuable land had been demarcated which remained under no use so far. The details would be soon presented to the cabinet for using the land for positive purposes.\nImran Khan lauded Minister for Communications and his team on the reforms relating to Pakistan Post.\nDr Ishrat Hussain briefed about the over-all pension mechanism of government employees.",
  "retrievedAt": "2025-08-11T19:12:40.111Z"
}
