{
  "title": "Around 45,000 Tiger Force volunteers in action to combat COVID-19: Usman Dar",
  "link": "https://www.app.com.pk/national/around-45000-tiger-force-volunteers-in-action-to-combat-covid-19-usman-dar/",
  "date_published": "2020-05-13T01:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):The government has fully activated the Prime Minister’s Corona Relief Tiger Force (CRTF) in multiple cities to assist the civil administrations in carrying out the rescue and relief activities amid the coronavirus pandemic.\nOut of 185,000 volunteers, called for duties, about 45,000 have been assigned to perform various duties in different parts of the country, assisting the civil administrations in carrying out relief activities, Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar told the Commissioners of various areas via video link.\nIn separate teleconferences with the local administrations of Faisalabad, Multan and Sargodha, Usman Dar stressed over the phase-wise engagement of about one million registered volunteers of the CRTF across the country.\nHe underlined the need for enhanced coordination among various tiers of civil administration to maximize service delivery of volunteers registered under the PM’s CRTF.\nAppreciating the spirit of volunteerism among CRTF members, the SAPM said that their passion of community work during the global pandemic was praiseworthy.\nThe virtual meetings were held separately with Commissioner Sargodha Dr. Farah Masood, Commissioner Faisalabad Ishrat Ali and Commissioner Multan Shan ul Haq. Respective Deputy Commissioners of all districts falling in these divisions shared updated status of duties assigned to volunteers of CRTF, said a news release issued here on Wednesday.\nIt was informed during these meetings that steering committees had been constituted at districts and tehsil levels of those divisions. The deputy commissioners apprised that volunteers had been called for assigning various duties in their respective districts.\nThey informed that majority of the volunteers in those districts were deputed at mosques for ensuring standard operating procedures, registration of unemployed labor in Ehsas Kafalat programme, visiting markets for checking prices, reporting hoarding and reporting availability of subsided items on utility stores.\nThe online meetings were told that the CRTF volunteers were assigned duties after conducting proper orientation sessions by the concerned district administration.",
  "retrievedAt": "2025-08-11T19:12:47.128Z"
}
