{
  "title": "Over 100,000 ton PPEs arrive from China: NDMA",
  "link": "https://www.app.com.pk/national/over-100000-ton-ppes-arrive-from-china-ndma/",
  "date_published": "2020-05-13T01:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):Chairman National Disaster Management Authority (NDMA) Lieutenant General Muhammad Afzal Wednesday said that 11 flights carrying 1,001,54 ton safety items had so far arrived here from China.\nAddressing a news conference, he said NDMA was given 50 million dollars for procuring the equipment. NDMA has so far spent half of the amount.\nThe country’s COVID-19 testing capacity should be 50,000 as resources are abound.\nThe current COVID-19 testing average is 11,500 and need is to enhance it up to optimum level.\nHe said that country had only five laboratories in March as comparing to 70 laboratories right now.\nNDMA is procuring Personal Protective Equipments (PPEs) from local market except ventilators.NDMA has the stocks of one month available.\nPakistan had indeed started producing N-95 masks, he added.\nA transparent system has been devised for maintaining transparency in purchasing safety items.\nHe said a total of four committees had been constituted for ensuring transparency in purchases.\nAnother committee namely Strategic Response, Coordination Implementation Committee, headed by chairman NDMA has also been working for evaluating needs, deciding purchase mechanism , to meet demands of provinces and distribution and to ensure Government decision implementation.\nHe said safety items were being purchased through a competitive tendering process.\nN-95 masks are available at Rs 300 from Rs 2,000. While ordinary mask is available at Rs 9 or Rs 10 per item.\nHe said in March, it was challenge to provide masks to frontline 22,000 doctors and paramedics. 39,500 PPEs were provided to 22,000 frontline doctors by April 5.\nA transparent distribution system has been put in place to directly deliver safety equipment to hospitals, he said adding that NDMA had established 300 beds quarantine centre at Haji camp Islamabad.\nThe NDMA has already set up helpline UAN 111-157-157 for registering complaints of doctors and paramedics. No complaint has been received in helpline since last five days.\nOnly five complaints were received which were resolved accordingly.\nHe said the NDMA had provided thermal scanners and other equipment to all airports.\nHe said a 255 bed isolation or infectious diseases hospital in Islamabad would be functional by end of current month. Civil work has already been completed . The work on the project was started on March 30.\nResponding to a question, he urged people to follow precautionary measures as pandemic still looms.\nResponding to a question, he said five helicopters had been hired from Pakistan Army to spray poisonous fumes over the fields covering thousands of acres of land in a bid to rid them of the pest.China has given 300,000 litre malathion and NDMA was procuring 175,000 litre malathion to provinces.\nThe spraying of 5,000 hectares has already been completed. While 500,000 hectare area will be sprayed.",
  "retrievedAt": "2025-08-11T19:12:47.660Z"
}
