{
  "title": "Documentary evidences of Shahbaz Sharif,sons involvement in money laundering collected: Shahzad Akbar",
  "link": "https://www.app.com.pk/national/documentary-evidences-of-shahbaz-sharifsons-involvement-in-money-laundering-collected-shahzad-akbar/",
  "date_published": "2020-05-13T01:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):Special Assistant to the Prime Minister on Accountability Shahzad Akbar on Wednesday said that the assets of Sharif family had significantly increased in ten years, the Pakistan Muslim League-Nawaz was in power in the Punjab.\nHe said that Shehbaz Sharif had established dozens of paper front\ncompanies on employees’ names for money laundering and documentary\nevidences of all these unlawful transactions had been collected and\nit would not be easy for him to escape the law.\nAddressing a press conference here, Shazad Akbar said that from 2008\nto 2018, mind-blowing increase in assets of Shahbaz Sharif and his\nsons was detected. He said that source of their income were\nTelegraphic Transfers sent to them by poor employees of their\ncompanies. He said that the money was sent abroad through Hundi and\nthen sent back via TTs.\nHe said through a paper firm GNC billions of rupees transactions were\ndone by two front men and close friends and call fellows of Salman\nShahbaz, Nisar Gill and Ali Ahmed. He said that Shabaz Sharif had\ntaken the plea that his sons were grownup and he was not responsible\nfor their actions. However, he appointed Nisar Gill and Ali Ahmed in\nChief Minister office as Director on Political Affairs and Director\nPolicy.\nHe said that one company Nisar Trading Company was registered in the\nname of Sharif Feed Mills employee Rashid Karamat and Rs 425 million\ntransaction was done in this firm’s account. He said Rs 450 million\nwere deposited in the account of a company Khan Traders, registered in\nthe name of the father of one Gulzar, an employee of Ramzan Sugar\nMills . He said Rs 5 billion were deposited in the account of Maqsood\nand Co, a firm in the name of Malik Maqsood, who worked at the\nSharif-owned Chiniot Energy Office as a peon. Similarly Rs 350 million\nwere deposited in the account of Azhar Abbas, Rs 480 million in\naccount of Muhmmad Anwar, Rs 560 million in account of Ghulam Shabbir\nand Rs 210 million in the account of Tanveerul Haq, all employees of\nRamzan Sugar Mills. Overall Rs 17.4 billion were deposited in paper\nfirms and benami accounts of the employees of Shabaz Sharif companies\nwhose monthly salaries were from Rs 18000 per month to Rs 70,000. He\nsaid that all details of these employees were available with Employees\nOld Age Benefit Fund (EOBI) record and nobody could deny that they were\nnot working with Shahbaz Sharif’s firms.\nHe said that as per collected documentary proofs, Rashid Karamat,\nresident of a slum near Gulberg, Lahore was a procurement assistant\nearning Rs 18000 per month. How were Rs 450 million transferred in his\naccount, he asked.\nHe said that two employees so Sahbaz Sahrif namely Masroor Anwar and\nShoaib Qamar transferred big amounts from Nisar Trading Company\naccount to Shahbaz Sharif and Hamza Shahbaz accounts and copies of the\nCNICs of both of them were available with the concerned bank branches.\nHe said that when party members of the PML-N were questioned about\nthe cheques given by them deposited in Nisar Trading Company, the\naccounts of Hamza and Shahbaz Sahrif they said that had given donation\nfor party funds. However, he questioned as to why those people donated\nwho either got some contracts from Punjab government or they got\npolitical benefits.\nHe asked Shahbaz Sharif if these allegations were baseless, he should\ndrag him courts in London as he used to claim and he should give\nanswers to these questions in the courts and media.\nReplying the questions of media persons, Shahzad Akbar said that\narrest of any accused was purview of National Accountability Bureau\n(NAB). He demanded that name of Shabaz Sharif should be put in Exit\nControl List (ECL) as there was chance that with hot winds blowing\nhere, he might go to England to celebrate Eidul Azha there.\nDispelling the impression that only opposition party leaders were\nvictimized, he said that in the history of accountability for the\nfirst time the government was doing self-accountability and inquiry on\nsugar and wheat shortage were its manifestation.\nHe said that PTI was fighting against the obsolete system and not\nagainst Sharifs and Zardaris, who were its beneficiaries’.",
  "retrievedAt": "2025-08-11T19:12:50.833Z"
}
