{
  "article_id": "2025-07-01_a48d4e55bee19a36018bf6eb448817c1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/railways-open-luxury-saloon-coaches-to-public/",
    "retrieved_at": "2025-08-27T09:09:53.876Z"
  },
  "metadata": {
    "title": "Railways open luxury saloon coaches to public",
    "author": null,
    "date_published": "2025-07-01T09:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 322,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 1 (APP):In a landmark move to modernize its services and optimize asset utilization, Pakistan Railways has opened its luxury saloon coaches-once reserved exclusively for top government officials and senior railway executives-for public booking on major intercity routes. \"Five premium saloon coaches are now available for booking on key routes, including Karachi-Lahore, Lahore-Islamabad and Islamabad-Lahore,\" an official in the Ministry of Railways told APP. \"This initiative follows a special directive from Prime Minister Muhammad Shehbaz Sharif, emphasizing public access to state-owned assets and the importance of innovative revenue generation,\" the official added. He said each luxury saloon offers a hotel-like experience on wheels, complete with a master bedroom, lounge area, dining space, fully equipped kitchen, and a bathroom with both shower and bathtub. \"Designed primarily for families or groups, these coaches provide a private and comfortable alternative for premium rail travel,\" he added. The official said the Prime Minister's saloon is available for Rs. 600,000 on the Karachi-Lahore route and Rs. 150,000 on the Islamabad-Lahore route. The Railways Minister's saloon is priced at Rs. 400,000 and Rs. 100,000 for the same respective routes. \"These rates have been structured to make premium rail travel accessible for special occasions or long-distance journeys,\" the official said. The bookings can be made via Pakistan Railways' online portal or through designated reservation counters nationwide. He said that this step is part of Pakistan Railways' broader modernization and reform strategy, which also includes digital ticketing, enhanced onboard services, and upgraded station facilities. In addition to exclusive privacy, travelers can enjoy sleeper sofas, personal attendants, and luxurious amenities throughout the journey. To reinforce transparency and public benefit, a complete ban has been imposed on the personal use of saloon coaches by railway officers, a decision finalized in a recent high-level meeting chaired by Minister for Railways Muhammad Hanif Abbasi. \"The aim is not only to elevate passenger experience but also to enhance non-fare revenue streams,\" the official said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}