{
  "title": "IESCO board prioritizing customer-centric reforms & digital transformation: Chairman",
  "author": null,
  "content": "ISLAMABAD, Nov 02 (APP): Chairman Islamabad Electric Supply Company (IESCO), Dr. Tahir Masood, has said that the existing Board of Directors is taking comprehensive measures to modernize the company’s administrative and technical systems.\n\nIn a statement, Dr. Masood said transparency in professional affairs, better governance, and satisfactory customer service are the board’s top priorities.\n\nHe further said that, in view of the latest technology and system digitalization, the IESCO Board of Directors has introduced several initiatives that have not only promoted transparency in office operations but also made it possible for esteemed consumers to receive high-quality, timely, and electronic services.\n\nHe mentioned that state-of-the-art Customer Facilitation Centers have been established at the division and sub-division levels, where consumers can access all services under one roof including bill correction, complaint registration, bills installments, extension in due date and other facilities.\n\nHe added that the installation of international standards Advanced Metering Infrastructure (AMI) is underway in Rawalpindi City and Rawalpindi Cantt Circles which is really a revolutionary initiative in power sector of Pakistan.\n\nFurthermore, through the “Apna Meter Apni Reading” mobile application, consumers have been made part of the billing process, allowing them to record their meter readings within the prescribed time, which will likely eliminate doubts and discrepancies, related to meter readings.\n\nAn online tracking system has also been introduced for new connections and complaint registrations, enabling customers to track the progress of their applications in real time.\n\nDr. Masood stated that the Digital Record Management System has strengthened IESCO’s internal accountability mechanism. Additionally, the supply of transformers, meters, HT/LT poles, and other essential field materials has been ensured in the store system.\n\nHe concluded that he and his board members are committed to transforming IESCO into a modern organization aligned with technological advancements where customer convenience, transparency, and improved performance remain the fundamental priorities.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/WhatsApp-Image-2025-11-02-at-5.50.10-PM.jpeg",
  "retrievedAt": "2025-11-02T19:09:45.725Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iesco-board-prioritizing-customer-centric-reforms-digital-transformation-chairman/",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T17:52:03.000Z"
}
