{
  "title": "PM’s National Innovation Award initiates incubation phase for awardees",
  "link": "https://www.app.com.pk/national/pms-national-innovation-award-initiates-incubation-phase-for-awardees/",
  "date_published": "2024-01-09T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 09 (APP): The Prime Minister’s National Innovation Award (PMNIA) on Tuesday initiated the incubation phase for Round 1 and 2 awardees with the formal signing of a tripartite contract involving the awardees, Host Incubator, and the Higher Education Commission (HEC).\nThe signing ceremonies were held at the Institute of Management Sciences, Peshawar; Pak-Austria Fachhochschule Institute of Applied Sciences and Technology (PAF IAST); National University of Sciences and Technology (NUST), Islamabad; University of the Punjab, Government College University; and University of Engineering and Technology (UET) Lahore, a press release saidxc.\nPMNIA, a cornerstone of the Prime Minister’s Youth Programme executed by the HEC, acts as a unique catalyst fostering a culture of innovation and entrepreneurship.\nIt empowers young entrepreneurs to transform their ideas into tangible solutions, with 100 startup ideas earning cash prizes, through a rigorous selection process in two rounds, the top 10 startups in each round secured a substantial prize of Rs 1 million each, while the remaining 40 received support of Rs 0.5 million each.\nIn this next phase, awardees are set to receive a seed grant of Rs 1 million upon consenting to a 6-month incubation programme at designated incubators.\nA network of 18 incubators nationwide, in collaboration with HEC, is poised to deliver comprehensive incubation services, encompassing training, mentorship, and networking opportunities with potential clients and investors.\nThe Prime Minister’s National Innovation Award underscores its commitment to nurturing a culture of creativity, innovation, and a knowledge economy. This initiative provides crucial opportunities and support to young entrepreneurs, aligning with HEC’s dedication to scaling innovative ventures through technical and financial backing.",
  "retrievedAt": "2025-08-10T23:30:02.797Z"
}
