{
  "title": "Govt to fully support private educational institutions in ensuring their services: Minister",
  "link": "https://www.app.com.pk/national/govt-to-fully-support-private-educational-institutions-in-ensuring-their-services-minister/",
  "date_published": "2024-01-09T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 09 (APP): Federal Minister for Education and Professional Training Madad Ali Sindhi on Tuesday said that the government will provide every possible support to private institutions in order to ensure their delivery of service to the public at large.\nHe said this while chairing a meeting held here with the heads of major private educational institutions of Islamabad Capital Territory, which was also attended by the Chairperson PEIRA, Dr. Sayeda Zia Batool.\nMadad Ali Sindhi emphasized on improving equity through fostering a more inclusive educational environment, and to increase the scope of fee concession/scholarships for needy students.\nThe minister was told that on average all private institutions are giving scholarships between 15-25% to all its students.\nThe innovative CSR approaches and sustainable practices were discussed by the representatives of the private educational institutions in detail.\nThe minister appreciated the CSR initiative and activities that private educational institutions have already adopted. This will open the doors of quality education provision to children from the less advantaged segments of society. These initiatives are pivotal in elevating Pakistan’s human development and strengthening the nation’s social capital.\nMadad Ali Sindhi highlighted the importance of teachers’ training. He said that not only in the federal territory but in all of the provinces it should be given the highest importance. The minister was told that CDA has planned to auction plots for schools.\nHe directed PEIRA and the ministry to support CDA in this process. The minister said that his focus has remained to improve the quality of education of public schools and to control the out-of-school children in Pakistan.\nHe said that the federal education ministry has planned to make 2 model schools in every province as well. Madad Ali Sindhi acknowledged the issues of all private institutions and vowed to support them in every way possible.\nMadad Ali Sindhi said that the aim of the meeting is to focus on robust Corporate Social Responsibility (CSR) activities including community engagement strategies, and the educational provisions offered by the private sector especially for the needy students.\nMadad Ali highlighted the importance of the contribution of the private sector to provide education to bridge the gap to ensure educational provisions under the ambit of article 25-A alongside public sector.\nAll the representatives of private institutions appreciated the efforts of the minister in solving the issues of the private schools and colleges.",
  "retrievedAt": "2025-08-10T23:29:52.477Z"
}
