{
  "title": "Ex-PTI chairman, wife indicted in Toshakhana case",
  "link": "https://www.app.com.pk/national/ex-pti-chairman-wife-indicted-in-toshakhana-case/",
  "date_published": "2024-01-09T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP): The Accountability Court (AC) of Islamabad on Tuesday indicted former PTI chairman and his wife in the Toshakhana case and sought evidence from the prosecution on January 11.\nThe same court, however, fixed January 17 to frame charges on the ex-chairman of Pakistan Tehreek-eInsaf (PTI) in the Al-Qadir Trust reference pertaining to a scam of 190 million pounds.\nAC-I Judge Muhammad Bashir heard the cases against the accused at the Adiala Jail Rawalpindi, wherein the former PTI chairman was produced before the court.\nDuring the hearing, the court also instructed the authorities to freeze the assets of absconders in the Al-Qadir Trust case.\nThe judge read out the charge sheet before the accused in the Toshakhana case. The accused, however, denied the charges against them, and then the court sought evidence from the prosecution.\nThe National Accountability Bureau, in the Toshakhana case, has blamed the accused for causing a loss of about Rs1,573 million.\nIt claimed that the the former PTI chairman and his wife Bushra Bibi had received 108 gifts from various countries out of which they kept 58 after paying the small amounts.\nNAB alleged that the accused also kept a jewelry set received from the Saudi Crown Prince against payment of small amount instead of submitting it to the Toshakhana. It also alleged that the accused managed to get a low value assessment of the jewelry set from a private person.\nThe NAB submitted a list of 12 witnesses against the accused in court.\nDuring the proceedings, the court instructed the prosecution to share the copy of challan with Bushra Bibi in the 190 million pound reference.\nNAB also submitted the property details of absconder accused Farah Shehzadi and Shahzad Akbar.\nThe court ordered to seize the said property and bank accounts of the absconders, including Farah Shehzadi, Shahzad Akbar, Zulfi Bokhari and others.",
  "retrievedAt": "2025-08-10T23:29:32.164Z"
}
