{
  "title": "Int’l workshop on curriculum development through project based learning held at IIUI",
  "link": "https://www.app.com.pk/national/intl-workshop-on-curriculum-development-through-project-based-learning-held-at-iiui/",
  "date_published": "2024-01-09T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 09 (APP): National and International speakers of an International workshop at International Islamic University Islamabad (IIUI) deliberated upon the ways of curriculum development through project based learning and CDIO.\nThe international workshop on “Curriculum Development through Outcome Based Education and CDIO” was organized by Faculty of Engineering and Technology of IIUI at the Faisal Masjid Campus on Tuesday.\nProject-based learning is an instructional approach designed to allow students to develop knowledge and skills through engaging projects set around challenges and problems they may face in the real world.\nThe CDIO Initiative is an educational framework that stresses engineering fundamentals set in the context of conceiving, designing, implementing and operating real-world systems and products.\nThe workshop was sponsored by Higher Education Commission and British Council Pakistan under PAK-UK Education Gateway Mobility Grant.\nProf. Dr. Abdul Raheman, Acting President IIUI, while addressing to the participants, appreciated the efforts of the Faculty for organizing such an informative and innovative workshop.\nThe workshop also received accolades from Dean Faculty of Engineering and Technology, Dr. Nadeem Ahmed Sheikh, who expressed appreciation for the initiative, emphasizing its significance in fostering professional development among future educators.\nThis collaborative effort aimed to equip participants with a deep understanding of the curriculum development for faculty, emphasizing their importance in shaping the future of teacher education.\nThe event not only provided a platform for practical insights but also highlighted the commitment of the universities to enhance the quality of education through outcome-based education and CDIO.\nDr. Taqi Ahmed Cheema (Dean Faculty of Mechanical Engineering, GIKI), Dr. Tabbi Wilberforce Awotwe from King’s College London, Dr. Gareth Thomson, Dr. Sarah Junaid from Aston University, Dr. Fareeha Azmat, University of Warwick also shared their insights during the workshop. In the end, CDIO and Lego activity was also performed by Dr. Sarah, Dr. Tabbi, Dr. Muftooh, Dr. Umar Mansoor.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:30:16.061Z"
}
