{
  "article_id": "2025-02-04_484f3e797dcb9b76b4cb13319667efed",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-to-unveil-corruption-free-ramazan-package-sans-utility-stores-pm-2/",
    "retrieved_at": "2025-08-27T12:23:31.098Z"
  },
  "metadata": {
    "title": "Govt to unveil corruption-free Ramazan Package sans Utility Stores: PM",
    "author": null,
    "date_published": "2025-02-04T10:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 583,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 4 (APP):Prime Minister Shehbaz Sharif on Tuesday said that the government would unveil the Ramazan Relief Package this year sans Utility Stores' role to prevent corruption and the distribution of low-quality commodities to the people. \"As the Holy Ramazan is about to start, I have asked the Ministry of National Food Security to bring about a Ramzan Package without Utility Stores to prevent corruption and the sale of low-quality material. I had asked many months ago that this cannot go on with the Utility Stores,\" the prime minister said in his televised opening remarks at the meeting of the federal cabinet chaired by him. He told the cabinet members that last year, the government had received immense complaints about the execution of the Ramazan Package by the Utility Stores. Therefore, the government has devised a solution to provide the facility minus the Utility Stores. About the launch of the polio vaccination drive, he mentioned the killing of a policeman Abdul Khaliq in Jamrud who was deployed on the security of the polio team and paid tribute to his sacrifice to make Pakistan a polio-free nation. He also lauded the services of PM's Coordinator on Health Dr Mukhtar, Polio Coordinator Dr Ayesha Farooq, secretary health and polio vaccinators for their tireless efforts to rid the country of this crippling disease. Apprising the cabinet members of his Quetta visit on Monday, the prime minister said he visited the hospital to inquire after the security personnel who were injured in an anti-terror operation in Kalat in which 18 security personnel were martyred and 23 terrorists were eliminated. \"I met the injured. They were in high morale and were even ready to sacrifice their lives for the country. These are the martyrs and Ghazis who are resolved to rid the country of terrorism and striving day and night for the cause,\" he remarked. Prime Minister Shehbaz said that the soldiers of the army, police, FC and Rangers sacrificing their lives were actually bearing the brunt of the blunderous policies of a government in the past when thousands of terrorists were set free. The cabinet members also offered Fateha for the martyred security personnel as well as the policeman on the polio duty. The prime minister expressed pleasure over the inflation coming down to a nine-year low at 2.4% from 28.73% on a month-to-month basis. He congratulated the entire nation, the cabinet members particularly the finance minister, his team, FBR and others for their efforts during the last 11 months to bring the inflation down to the lowest level. \"Now, we are fully striving to head toward economic growth... This is the main challenge. All of our energies will be focused on economic growth. Just like other targets, we will achieve this too,\" he resolved. He told the cabinet members that on Monday, Saudi Crown Prince Mohammed bin Salman sent a delegation to Pakistan and both sides signed an agreement under which the Kingdom would provide oil worth annual $1.2 billion on deferred payment. Besides, the Saudi Development Fund will also provide a loan for a $40 million water supply scheme project in Mansehra. He said that the entire nation would observe Kashmir Solidarity Day on Wednesday to express solidarity with their Kashmiri brethren. Prime Minister Shehbaz also lauded the approval of agricultural income tax by all four provinces as per the IMF condition and thanked the chief ministers, President Asif Ali Zardari, Bilawal Bhutto Zardari, and Mian Nawaz Sharif for their support in this regard.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}