{
  "article_id": "2025-02-04_f5f81fa7164466e428e4c3dd41639d78",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gcwuf-observes-kashmir-solidarity-day-with-a-series-of-commemorative-events/",
    "retrieved_at": "2025-08-27T12:23:31.628Z"
  },
  "metadata": {
    "title": "GCWUF observes Kashmir Solidarity Day with a series of commemorative events",
    "author": null,
    "date_published": "2025-02-04T10:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 252,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "FAISALABAD, Feb 04 (APP):Government College Women University Faisalabad (GCWUF) has marked Kashmir Solidarity Day by organizing a series of events in collaboration with Directorate of Student Affairs and various academic departments. GCWUF spokesperson said here on Tuesday that the activities were arranged to express unwavering support for the people of Kashmir in addition to raising awareness about their ongoing struggle for self-determination. The Kashmir Day activities commenced with a solidarity walk led by GCWUF Vice Chancellor(VC),Prof Dr. Kanwal Ameen. Department of Humanities GCWUF sponsored the walk in which a large number of students,faculty members and administrative staff participated to show solidarity with the Kashmiri people. Department of International Relations & Political Science GCWUF presented cultural displays to highlight different facets of Kashmiri culture and heritage while Department of Nutritional Sciences set up traditional food stalls offering authentic Kashmiri cuisine including Kashmiri tea and other delicacies. Department of Art & Design arranged an exhibition of posters and paintings which depicted Kashmir's historical and contemporary struggle for freedom. Meanwhile,GCWUF Library set up a dedicated stall to showcase Kashmiri literature and historical records in addition to provide valuable insights into the region's rich cultural and political legacy. Speaking on the spot,GCWUF Vice Chancellor(VC),Dr.Kanwal Ameen said that the university organized a series of events to honor the resilience of Kashmiri people in addition to fostering a deeper understanding among students regarding the significance of Kashmir issue. Such events played a vital role in educating young minds about the historical and political context of Kashmir's struggle,she concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}