{
  "article_id": "2025-02-04_a2e247b4f45bd941666e5e20d01fda68",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistanis-stand-in-solidarity-with-kashmiri-poeple-on-feb-5-yousfzai/",
    "retrieved_at": "2025-08-27T12:23:35.595Z"
  },
  "metadata": {
    "title": "Pakistanis stand in solidarity with Kashmiri poeple on Feb 5: Yousfzai",
    "author": null,
    "date_published": "2025-02-04T09:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 4 (APP):All Parties Hurriyat Conference (APHC) leader Dawood Khan Yousfzai on Tuesday said that the people of Pakistan have demonstrated unwavering solidarity with the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) for decades, a testament to the deep bond of love and brotherhood. Every year, on February 5, Pakistanis across the globe come together to demonstrate their solidarity with the Kashmiri people. This act of unity not only boosts the morale of the Kashmiri people but also reinforces the hope that their rights will one day be realized, he added. Yousfzai said that the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) have expressed their gratitude to the Pakistani nation for standing by them at every step, offering both moral and political support. Pakistanis have consistently raised their voices for the rights of Kashmiris, acting as a steadfast wall of support. He said that the people of Jammu and Kashmir have faced significant hardships, and the consistent backing from Pakistan has been a source of encouragement for them. Dawood Khan said that this annual display of solidarity not only boosts the morale of the oppressed people of Jammu and Kashmir but also strengthens their resolve to continue their struggle for freedom. The enthusiasm and passion with which Pakistanis commemorate this day, both within the country and abroad, serve as a source of encouragement for Kashmiris, uplifting their spirits and reaffirming their hope for freedom. Dawood Khan Yousfzai said that we remain hopeful that such demonstrations of unity will continue with the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK). By the grace of Allah Almighty, the day is not far when the Kashmiri people will achieve their rightful freedom. InshaAllah, when that day comes, the people of Jammu and Kashmir will respond to Pakistan's love and support in the best possible way.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}