{
  "title": "Govt determined to boost economy to give confidence to business community: Commerce Minister",
  "link": "https://www.app.com.pk/national/govt-determined-to-boost-economy-to-give-confidence-to-business-community-commerce-minister/",
  "date_published": "2024-04-08T17:06:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 08 (APP):Federal Minister for Commerce Jam Kamal Khan on Monday said that the government was confident and focused to further improve all the factors linked with the economy, so as to boost confidence of the business community.\nHe said this while talking to media after a meeting at the Pakistan Business Council (PBC) here on Monday.\nHe said that Prime Minister Shahbaz Sharif also held several meetings regarding economy of the country and business, exports, trade and energy sectors are among our top priorities.\nJam Kamal Khan said that the Commerce Ministry is well aware of its responsibility to reach out business community to take the input from them and we are determined to give our utmost to resolve the challenges being confronted by this community.\nReferring to a recently held pre-budget seminar at Islamabad, the Federal Commerce Minister said that representatives of the business community from all over the country were invited to take their valuable suggestions to incorporate in the policy and decision-making process so as to further improve the situation.\nThe commerce minister told that trade diplomacy has been a very vital factor throughout the globe which helps the countries to improve their diplomatic ties.\nHe said that the government as well as the business community are considering the available options to move the things in the positive direction.\nJam Kamal Khan said that the government is very hopeful and taking things forward in a progressive way and in near future we will share with the media and the masses the opportunities we need to ponder over for our progress and prosperity.\nHe told another questioner that the road map of exports is not like pushing a button to improve the exports immediately rather it is a gradual and continuous process and therefore we will have to take appropriate steps accordingly.\nHe lauded the performance of the previous caretaker government, and said that many things were streamlined by the caretaker setup in the past six months as smuggling was also controlled to a greater extend and some of the initiatives needed to be taken ahead.\nTo a question, he said that the ban on Onion export was imposed till April 15 only for Ramazan-ul-mubarak and further extension in it is not under consideration.\nHe said that steps were taken during last five months to improve border control mechanism and now the present government has taken a decision to establish a dedicated authority to enable all the concerned departments operate under one umbrella.\nTo a question about the auto industry, he said that like other industries the suggestions are also received pertaining to cars manufacturing and we will take an amicable decision on it ahead of the next budget.\nSpeaking about the law and order situation in Karachi, he said that the law and order is a provincial subject while the Center government facilitates the provincial governments and we will continue our cooperation and further improve collaborations in this regard.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:46:25.973Z"
}
