{
  "title": "Romina for establishing first ever wildlife centre of excellence in Pakistan",
  "link": "https://www.app.com.pk/national/romina-for-establishing-first-ever-wildlife-centre-of-excellence-in-pakistan/",
  "date_published": "2024-04-08T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 08 (APP): Coordinator to the Prime Minister on Climate Change, Romina Khursheed Alam, expressed the intention to establish the first-ever center of excellence for climate change in the country on Monday.\nThe Centre would be for welfare of wildlife wherein veterinary training, transfer of veterinary technology, awareness for the public would be provided by senior wildlife scientists for betterment of niche, ecology, growth and experimentation of wildlife.\nThe Coordinator to PM on Climate Change held a meeting with Islamabad Wildlife management Board along with experts from Four Paws on Monday at ministry of climate change, a news release said.\nRomina Khurshid Alam was apprised on management, preservation of wildlife, issues and challenges about Margalla Hills National Park & Marghazar Zoo. Dr. Frank Goeritz, head of Institute of zoo & wildlife research and Dr. Amir Khalil, Director reveal & rescue briefed the coordinator to PM on bio rescue & endangered species.\nThe Coordinator to PM on Climate Change emphasized on setting up a new park dedicated for rare species, endangered species and vulnerable species. For this purpose 28 acre land, under the ministry would be utilized.\nWhile discussing the challenges of natural life of Pakistan, Coordinator to PM on climate change remarked that she was persuing for the earliest signing of Islamabad Nature & wildlife management act 2023 after which measures for bio rescue and wildlife would be upscaled.\nCoordinator to PM on climate change expressed her gratitude to the participants of the meeting adding that there is long way to go for welfare of Pakistani wildlife which was neglected for a very long time",
  "retrievedAt": "2025-08-11T01:46:28.431Z"
}
