{
  "title": "Dr Al-Issa: A global advocate for peace, interfaith dialogue, moderation",
  "link": "https://www.app.com.pk/national/dr-al-issa-a-global-advocate-for-peace-interfaith-dialogue-and-moderation/",
  "date_published": "2024-04-08T17:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 08 (APP):Dr Mohammad bin Abdulkarim Al-Issa stands as a towering figure in the contemporary Islamic world, renowned for his steadfast commitment to promoting moderate Islam and fostering interfaith harmony on a global scale.\nAs the Secretary-General of Muslim World League (MWL) and the head of the Intellectual Warfare Center, Dr. Al-Issa has dedicated his life to combatting extremism and advocating for the true message of Islam—empathy, understanding, and cooperation among all people.\nDr. Al-Issa’s leadership has been marked by groundbreaking interfaith efforts aimed at fostering understanding and reconciliation among different communities, faiths, and nations. Notable among these initiatives were his historic visit to Auschwitz in January 2020, where he led the most senior Islamic delegation ever to visit the site.\nThis visit, commemorating the 75th anniversary of the liberation of the death camp, symbolized Dr. Al-Issa’s commitment to combatting anti-Semitism and promoting mutual respect.\nHe has been honored by various organizations, including the American Jewish Committee and the Combat Anti-Semitism Movement, for his leadership in combating anti-Semitism, Islamophobia, and hate speech worldwide. In 2019, Dr. Al-Issa orchestrated an agreement for peace and solidarity among representatives of the Abrahamic religions in France, further demonstrating his dedication to fostering harmony and understanding.\nDr. Al-Issa’s efforts have garnered praise from leaders across religious and political spectrums. Cardinal Timothy Dolan hailed him as “the most eloquent spokesman in the Islamic world for reconciliation and friendship among the religions.” United States Ambassador-at-Large for Religious Freedom Sam Brownback commended Dr. Al-Issa as “a constituent of the future” and applauded his partnership in bringing together Abrahamic faiths to combat hate.\nSince assuming the role of Secretary-General of the Muslim World League in 2016, Dr. Al-Issa has embarked on a journey to promote dialogue and cooperation globally. He has expanded representation within the MWL to ensure inclusivity of all Muslim communities worldwide. Under his leadership, the MWL has signed numerous cooperation agreements with Jewish institutions, promoting common values and interfaith understanding.\nOne of Dr. Al-Issa’s most significant contributions is the Charter of Makkah, which calls for combatting hate speech, violence, extremism, and terrorism while advancing the principles of moderate Islam and interfaith partnership. Endorsed by over 1,200 Muslim scholars, this charter underscores Dr. Al-Issa’s commitment to fostering dialogue, understanding, and cooperation among diverse religious and cultural groups.\nDr. Al-Issa’s tireless efforts have earned him numerous accolades, including the Norwegian Bridge Builder Award, the Prophet’s Hijra Award from Malaysia, and an honorary doctorate from the United Nations’s University of Peace. His leadership in promoting peace, tolerance, and intercultural harmony has been recognized globally, from Russia to Sri Lanka, Senegal to Italy.\nDr. Mohammad Al-Issa’s remarkable journey—from his early career in Saudi Arabia to his current role as a global advocate for peace and moderation—stands as a testament to the transformative power of dialogue and cooperation. His unwavering dedication to fostering understanding and reconciliation among people of different faiths serves as a beacon of hope in an increasingly divided world.\nAs he continues to champion the principles of empathy, tolerance, and mutual respect, Dr. Al-Issa remains a symbol of inspiration for generations to come.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:47:01.105Z"
}
