{
  "title": "Punjab govt to roll out network of rehab centers to treat, cure ailing wildlife: Marriyum",
  "link": "https://www.app.com.pk/national/punjab-govt-to-roll-out-network-of-rehab-centers-to-treat-cure-ailing-wildlife-marriyum/",
  "date_published": "2024-04-08T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 8 (APP):Senior Minister Punjab, Marriyum Aurangzeb on Monday said that government of the Punjab would roll out a province wide network of rehabilitation centers to treat and cure ailing wildlife being poached and mutilated for entertainment purposes and enhance public education and awareness on bio-diversity with the technical assistance of Four Paws.\nThe senior Punjab Minister visited the Margallah Wildlife Rescue Centre erstwhile Islamabad Marghazar Zoo to view the newly rehabilitated black bears being rescued by the Punjab Wildlife Department on the special directives of the Chief Minister Punjab and held a press talk, where she was flanked by Prime Minister’s Coordinator for Climate Change, Romina Khurshid Alam, Chairperson Islamabad Wildlife Management Board (IWMB), Rina Saeed Khan and team of Four Paws’ experts busy in treating the rescued bears.\nMarriyum Aurangzeb said the Prime Minister and the Chief Minister Punjab have initiated combing operations against poached wild animals, whereas the Punjab Wildlife Department rescued six dancing black bears who were in a pathetic condition. There were three raids conducted in a row which resulted into a series of actions being underway to curb the menace of illegal wildlife trafficking and poaching, she added.\nThe IWMB has been working on wildlife preservation, whereas the Four Paws team had reached on their own expenses from Bulgaria, Austria and Germany to treat the maltreated animals, she said.\n“It is against CITES (international convention on illegal wildlife trade) and our wildlife laws. But it is unfortunate to know that there has been no wildlife rescue center across Punjab to rehabilitate the bears. The Bears have a natural habitat of their own that is unique,” she said.\nMarriyum Aurangzeb mentioned that the Punjab Wildlife Department revealed that the bears were made dancing on hot plates, whereas the nose pins drilled in their nostrils were pulled to hurt them that made the animal shake showing people like the bear was dancing.\nSenior Punjab Minister termed it an insensitive attitude and a punishable offence as per the law.\nShe noted that Punjab wildlife rescue centers’ establishment was underway, whereas the first has been started from Lahore Safari and the other at the Lahore Zoo area.\n“A microchip has been installed for a separate identity of each bear. However, a five-hour surgery by Dr Frank was done here with his mobile equipment of Four Paws to do a critical dental surgery of the bear. We will collaborate with them to establish a network of rehab centers and education of local masses for awareness across the province,” she added.\nThe Minister regretted that wildlife had never been at the political agenda whereas the current regime had endorsed special focus on the matter. “We have started GIS survey of wildlife population and a mobile app will be launched after eid to keep public aware of wild animals,” she said.\nMarriyum Aurangzeb said the federal capital showcased the country’s wildlife and therefore a most modern wildlife education facility would be established here to apprise the masses on protection and benefits of wildlife. However, the\ncitizens role would be critical in making it a success, she added.\nTo a query, Marriyum said, “It’s a holistic wildlife plan and we will introduce licensed trade of pet animals that will be electronically linked to EPA’s dashboard to keep a digital track of the animals being domesticated at home. However, captivity of wildlife is illegal.”\nPM’s Coordinator, Romina Khurshid Alam said that wildlife was crucial for the survival of the coming generations.\nShe extended her gratitude to the Four Paws for their voluntarily efforts to preserve and rehabilitate wild animals.\n“We are going to introduce a regulatory regime to tighten the noose against poachers and illegal wildlife traffickers. However, the federal government  establish a state-of-the-art rehabilitation center to produce mobile veterinary centers in collaboration with the provinces as the Prime Minister has taken strict notice of this situation,” she said.\nRomina Alam in response to query underlined that the Wildlife Center to be established at the old zoo site and for this, funds would be issued soon.\nChairperson, IWMB, Rina Saeed Khan said that the Zoo was converted into a wildlife rehab and rescue center on the landmark judgment of the then Chief Justice Islamabad High Court, Justice Athar Minallah.\nShe informed that the Centre had eight bears and two more were on their way from Sargodha. She extended her thanks to Senior Minister Marriyum Aurangzeb for her support in this regard.\nShe added that the gypsies were poaching black bears in Khyber Pakhtunkhwa (KP), Azad Jammu and Kashmir (AJK) by killing the female and taking its cubs into custody, who were later mutilated by removing their fangs, whereas black bear dancing was recently declared illegal in Punjab by the current regime whereas it was banned earlier in KP, Sindh, Balochistan and AJK.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:46:25.974Z"
}
