{
  "title": "E&P sector firms announce $5 bn investment in Pakistan’s oil,gas sector",
  "link": "https://www.app.com.pk/national/ep-sector-firms-announce-5-bn-investment-in-pakistans-oilgas-sector/",
  "date_published": "2024-07-06T07:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP):The local and international firms of Pakistan’s oil & gas exploration and production (E&P) sector, expressing confidence over the leadership of Prime Minister Shehbaz Sharif on Saturday, announced an investment of US$5 billion during next three years in the country.\nThe announcement was made in a meeting presided over by Prime Minister Shehbaz Sharif at PM House.\nA delegation of oil and gas exploration and production sector companies told the meeting that during three years, around 240 places would be excavated with an investment of $5 billion to explore petroleum and gas in Pakistan.\nThe prime minister constituted a committee under the chairmanship of Deputy Prime Minister Ishaq Dar that would include experts, secretaries and the relevant authorities.\nThe committee, after consultation with the representatives of the sector, would formulate proposals to create attractive policy for the exploration and development of petroleum and gas reserves in Pakistan.\nPM Shehbaz directed the relevant authorities to solve all the problems of the sector, and submit policy proposals to the constituted committee on priority.\nThe delegation thanked the prime minister for making the petroleum and gas exploration and production sector, a part of the consultation process, listening to their problems and finding serious solutions to them.\nThe meeting was informed that currently, Pakistan’s domestic production stood at 70998 barrels and 3131 MMSCFD gas per day.\nThe prime minister invited petroleum and gas exploration and production companies to also find the offshore reserves.\nExploring the oil and gas reserves at the local level in Pakistan is our top priority, PM Shehbaz said adding that Pakistan spent billions of dollars every year on importing oil and gas.\n“Production from local reserves will save Pakistan’s valuable foreign exchange and fuel and gas will become affordable for the common man,” the prime minister added.\nHe directed the concerned authorities to provide solutions to all the problems of the sector on priority basis.\nGovernor State Bank of Pakistan Jamil Ahmed told the meeting that on the prime minister’s special instructions, all the remittances (profit of the business) had been sent to the respective countries of the oil and gas production companies.\nThe meeting was attended by Deputy PM Ishaq Dar, Federal Ministers Ahad Khan Cheema, Muhammad Aurangzeb, Syed Mohsin Raza Naqvi, Engineer Amir Muqaam, Ahsan Iqbal, Sardar Awais Khan Leghari, Deputy Chairman Planning Commission Jehanzeb Khan, Coordinator to PM Rana Ehsaan Afzal, Chairman Federal Board of Revenue Amjad Zubair Tiwana, representatives of domestic and international companies and relevant high officials.",
  "retrievedAt": "2025-08-11T03:44:20.736Z"
}
