{
  "title": "Saudi Arabia conducts airdrop of food aid to Gaza Strip",
  "link": "https://www.app.com.pk/national/saudi-arabia-conducts-airdrop-of-food-aid-to-gaza-strip/",
  "date_published": "2024-07-06T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 06 (APP): Advisor at the Royal Court and Supervisor General of King Salman Humanitarian Aid and Relief Center (KSrelief), Dr Abdullah bin Abdulaziz Al Rabeeah on Saturday announced the Kingdom of Saudi Arabia, in cooperation with the Jordanian Hashemite Charity Organization (JHCO) and the Jordanian Hashemite Armed Forces (Arab Army), has successfully conducted an airdrop of food aid to the Gaza Strip.\nThe operation aimed to bypass the closure of border crossings by Israeli occupation forces, which had previously hindered the entry of humanitarian aid to the affected people in the Strip.\nDr. Al Rabeeah highlighted that Saudi Arabia, through KSrelief, provided Jordan with parachutes and dedicated networks for airdrops weighing a total of 30 tonnes. He disclosed that the food supplies dropped by air are suitable for immediate consumption without the need for heating.\nUnderscoring Saudi Arabia’s commitment to supporting humanitarian efforts in the Gaza Strip and assisting the Palestinian people, Dr. Al Rabeeah emphasized the leadership of the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince and Prime Minister Mohammed bin Salman bin Abdulaziz.\nThis airdrop of food supplies effectively bypassed the issue of closed land and sea crossings, which had previously stopped aid from being delivered. However, Dr. Al Rabeeah called for the opening of border crossings to facilitate the delivery of substantial humanitarian assistance to the afflicted people.\nThe KSrelief Supervisor General stated that the Kingdom had launched a donation campaign under the directives of the Custodian of the Two Holy Mosques and Crown Prince to support the defenseless Palestinian people in the Gaza Strip. To date, the campaign has collected financial sums exceeding $184 million. The Kingdom also operated an air bridge consisting of 54 planes and a sea bridge consisting of eight ships still in operation.\nDr. Al Rabeeah expressed his gratitude and appreciation to the government of Saudi Arabia, led by the Custodian of the Two Holy Mosques and the Crown Prince, for the exceptional and high-quality humanitarian assistance provided to support international efforts and alleviate the suffering of the brotherly Palestinian people.",
  "retrievedAt": "2025-08-11T03:43:54.311Z"
}
