{
  "title": "WAPDA generates 34.436 bln units in FY 2023-24",
  "link": "https://www.app.com.pk/national/wapda-generates-34-436-bln-units-in-fy-2023-24/",
  "date_published": "2024-07-06T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP): As many as 22 Hydel Power Stations of WAPDA cumulatively provided 34.436 billion units of electricity to the National Grid in 2023-24, which is 3.266 billion units more than that of fiscal year 2022-23.\nWAPDA achieved this additional hydel power generation because of the improved hydrology and effective operation and maintenance of its Hydel Power Stations, said a press release.\nThis increase in hydel generation by WAPDA to the tune of 3.266 billion units helped save national exchequer an amount of Rs. 143.7 billion, if the same quantum of electricity had to be generated through imported furnace oil.\nIt is pertinent to note that the cumulative installed generation capacity of WAPDA Hydel Power Stations, including Neelum Jhelum, stands at about 9,500 MW. Hydel generation is the most economical electricity, generated in the country.\nThe tariff for fiscal year 2023-24 determined by NEPRA for WAPDA hydel electricity is Rs. 3.81 per unit. which constitutes about 30% of the total electricity provided to the National Grid. Therefore, it plays a vital role for lowering the overall tariff for the consumers.\nAccording to the data, Tarbela Hydel Power Station generated 13.424 billion units, Tarbela 4th Extension 4.672 billion units, Ghazi Barotha 6.556 billion units, Mangla 5.276 billion units, and Neelum-Jhelum Hydel Power Station generated 762 million units. While, rest of the generation i.e. 3.747 billion units – was contributed by other hydel power stations of WAPDA.\nWAPDA is vigorously implementing a least-cost energy generation plan to enhance share of hydel electricity in the National Grid. A number of mega projects are under construction in Water and Hydropower Sectors including Diamer Basha Dam, Mohmand Dam, Dasu Hydropower Project and Tarbela 5th Extension etc. scheduled for completion in a phased manner. These projects will increase the WAPDA hydel generation in next four to five years from 9,500 MW to 20,700 MW with an addition of about 11,200 MW clean, green and low-cost hydel electricity.",
  "retrievedAt": "2025-08-11T03:44:19.854Z"
}
