{
  "title": "PARC introduced 10 high-yielding pulses seed varieties during current year",
  "link": "https://www.app.com.pk/national/parc-introduced-10-high-yielding-pulses-seed-varieties-during-current-year/",
  "date_published": "2024-07-06T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP):Chairman Pakistan Agriculture Research Council (PARC) Dr Ghulam Muhammad Ali Saturday said that the Variety Evaluation Committee of the Council during current year has approved 10 high yielding pulses varieties to boost output of pulses in the country.\nTalking to APP here on Saturday, he said that the pulses play a crucial role in global food security and nutrition of the country, adding that Pakistan needs 1.56 million tons of pulses annually.\nWe have become self-sufficient in mung production during 2021-22 which was 0.263 million tons against the total requirement of 0.180 million tons, he added.\nThese ten high-yielding pulses varieties poised to revolutionize the pulses output, adding that now the country is focusing on increasing the production of other pulse crops, such as chickpea, lentil and mash bean.\nOut of the recommended 10 pulses varieties that included 05 chickpea and 01 mung bean variety of NIAB, Faisalabad, 01 lentil and 01 mung bean variety of Pulses Research Program, NARC, Islamabad, he said adding that 01 mung bean variety by Pulses Research Institute, AARI, Faisalabad and a mung bean variety of NIFA, Peshawar.\nThis achievement is due to the consistent backup support by PSDP, Pulses Project “Promoting Research for Productivity Enhancement in Pulses” to its research components throughout the country, he added.\nThe Chairman said  that high yielding, disease and climate resilient varieties play an important role in improving pulses productivity. However, he was of the view that as the pulses gene pool has widened, therefore, all pulses scientists across the country are urged to focus on strengthening the pulses foundation seed production including BNS, Pre-basic and basic seed.\nMoreover, there were a need to a strong nexus among researchers and extension workers so that more seed can be produced to shrink the gap between pulses production and requirement in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:44:18.974Z"
}
