{
  "title": "PM asks rich economies to write-off debts as Covid-19 set to affect poor states",
  "link": "https://www.app.com.pk/national/pm-asks-rich-economies-to-write-off-debts-as-covid-19-set-to-affect-poor-states/",
  "date_published": "2020-03-17T05:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):Prime Minister Imran Khan has asked the richer countries to write off the debts of poorer states, expressing the fear that the coronavirus could devastate the economies of developing nations.\n“My worry is poverty and hunger,” he said. “The world community has to think of some sort of a debt write-off for (the) countries like us, which are very vulnerable, at least that will help us in coping with [coronavirus].”\nThe prime minister, in an interview with Associated Press released on Tuesday, said if a serious outbreak happened in Pakistan, he was worried his government’s efforts to lift the ailing economy out of near-collapse would begin an unstoppable slide backward.\nHe feared that exports would fall off, unemployment would soar and the national debt would become an impossible burden.\n“It’s not just Pakistan. I would imagine the same in India, in the Sub-continent, in African countries.”\n“If it (virus) spreads, we will all have problems with our health facilities. We just don’t have that capability. We just don’t have the resources.”\nImran Khan called for lifting sanctions against Iran, the epicenter of the coronavirus outbreak in the Middle East.\nAs most of Pakistan’s cases of the coronavirus were traced back to Iran, he said the country (Iran) was a “classic example” of a place where the humanitarian imperative to contain the outbreak outweighs political rivalries or economic dogmas.\nMaking another call for action from the international community, he said it was time for the US to end its sanctions on Iran, where one of the worst coronavirus outbreaks in the world had unfolded.\nExpressing concern over India’s worst Hindu-Muslim violence in decades, the prime minister said the Indian prime minister’s Hindu nationalist-led government threatened to disenfranchise hundreds of millions of people through a controversial new citizenship law.\n“The worst nightmare of the world has happened — an extremist, racial party, that believes in racial superiority, has taken over a country of more than one billion people and has nuclear weapons.”\n“That’s why I went to the United Nations” to warn of the danger posed by Indian Prime Minister Narendra Modi’s Hindu nationalist-led government, he said. He had also warned about the violent strife on the other side of the eastern border, amid the rise of Hindu nationalism in India.\n“A new citizenship law in India fast-tracks naturalization for foreign-born religious minorities of all major faiths in South Asia, except Islam. There are about 280 million Muslims there.”\nImran Khan criticized the recent comments of Afghan President Ashraf Ghani, alleging that Pakistan used militants to further its own goals in the past. He called the comments “disappointing”.\nSince taking charge of the office, the prime minister, said he had worked hard with the United States to help cobble together a peace deal in Afghanistan. “If anything, it should have been appreciation of the way Pakistan has gone about furthering the peace process.”\nHe said he always opposed his country’s participation in the “war on terror”, calling it a waste of Pakistanis’ lives and money.",
  "retrievedAt": "2025-08-11T18:57:39.145Z"
}
