{
  "title": "Cabinet apprised over coronavirus situation, steps taken to deal with pandemic",
  "link": "https://www.app.com.pk/national/cabinet-apprised-over-coronavirus-situation-steps-taken-to-deal-with-pandemic/",
  "date_published": "2020-03-17T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):The Federal Cabinet on Tuesday was apprised about the overall situation relating to the coronavirus and the steps taken by the National Coordination Committee (NCC) to deal with the pandemic.\nThe NCC was working in coordination with the provincial governments to monitor the situation and take steps, which were also being informed to public on daily basis, Special Assistant to the Prime Minister Dr Firdous Ashiq Awan said while briefing the newsmen regarding the decisions taken in the Federal Cabinet meeting.\nFlanked by Minister for Religious Affairs and Interfaith Harmony Noorul Haq Qadri, Minister for Aviation Ghulam Sarwar Khan and Council of Islamic Ideology (CCI) Chairman Dr Qibla Ayaz, Dr Firdous said Prime Minister Imran Khan would address the nation to take it into confidence regarding the situation arisen due to the coronavirus.\nShe said Advisor on Finance Dr Abdul Hafeez Shaikh, while briefing the cabinet on the budget strategy paper, said unprecedented achievements had been made in a relative shorter period of time.\nShe said the cabinet reviewed the amounts spent on food security, health, higher education, tourism and other sectors.\nIt was informed that the present government had paid Rs 5,000 billion debt taken by the previous regimes, financially empowered the ministries and increased revenue by 17 percent.\nShe said under the Public Sector Development Programme (PSDP), Rs 700 billion and under the public-private partnership Rs 250 billion were earmarked. The prime minister congratulated his adviser on finance over his efforts for stabilization of the economy.\nThe SAPM said it was told that due to the bad policies of previous governments, a long term programme was adopted for reducing the higher load of utility bills.\nThe cabinet, she added, was briefed in detail on the country’s energy situation. It was told that all areas of energy, including production, delivery and distribution had shown improvement sine the Pakistan Tehreek-e-Insaf took charge of the government.\nThe prime minister issued directives that in the changed circumstances, there was need to start consultations with the power generation companies over renegotiation of tariff.\nThe prime minister, on the occasion, was also apprised about the measures taken to increase exports, on which he expressed his satisfaction.\nReplying to questions, she said the coronavirus was an international challenge and it was unfortunate that the opposition was trying to get political mileage of it. There was need of unity and cohesion on the occasion, and the entire nation should stand united to defeat the threat.\nThe prime minister, in his address, would give a road-map for overcoming the international threat, and lead the nation towards safety, he added.\nTo a question, she said due to the coronavirus, Pakistan’s economic growth would be affected and measures would be taken in consultation with the International Monetary Fund and all the stakeholders to better it.\nShe said the prime minister tasked the Adviser Finance and Secretary Finance to bring a plan of action for ending parity in the salaries of federal government employees.",
  "retrievedAt": "2025-08-11T18:57:39.174Z"
}
