{
  "title": "Keel laying ceremony of 1st MILGEM class corvette’ for Pakistan Navy held in Turkey",
  "link": "https://www.app.com.pk/national/keel-laying-ceremony-of-1st-milgem-class-corvette-for-pakistan-navy-held-in-turkey/",
  "date_published": "2020-06-03T22:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP):The “keel laying ceremony of 1st MILGEM Class Corvette” for Pakistan Navy was held at Istanbul Naval Shipyard (INSY), Turkey where Chief Naval Overseas (Turkey), Commodore Syed Rizwan Khalid graced the occasion as chief guest.\nThe contract for four corvettes for Pakistan Navy with Transfer of Technology (ToT) was signed with ASFAT (Turkish state owned Defence Firm), said Pakistan Navy press release.\nThe contract entails construction of two corvettes in Turkey while two at Karachi Shipyard & Engineering Works (KS&EW). Construction of corvettes in Pakistan is aimed at providing impetus to local ship building industry and further enhance KS&EW capabilities.\nThe MILGEM class corvettes will be state-of-the-art surface platform equipped with modern surface, subsurface and anti-air weapons, sensors and combat management system. These ships will be among the most technologically advanced platforms of Pakistan Navy and will significantly contribute in maintaining peace, stability and balance of power in Indian Ocean.\nSpeaking on the occasion, the chief guest highlighted that the project was manifestation of strong relations between Pakistan and Turkey. He appreciated the MILGEM project for its construction standards, outfitting and performance. The chief guest also acknowledged the professional competence of Turkish Defence Firm and Istanbul Naval Shipyard for their meticulous efforts in meeting the time lines despite global crisis of COVID-19 pandemic.\nThe ceremony was attended by officials of Pakistan Navy, dignities and representatives of ASFAT, Istanbul Naval Shipyard and Turkish Lloyd.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:48.495Z"
}
