{
  "title": "NCOC for strict crackdown against violators of SOPs",
  "link": "https://www.app.com.pk/national/ncoc-for-strict-crackdown-against-violators-of-sops/",
  "date_published": "2020-06-04T00:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP):The National Command and Operation Centre (NCOC) Thursday focused on Standard Operating Procedures (SOPs) compliance, strict administrative actions and enforcement of Track, Trace and Quarantine (TTQ) Strategy.\nMinister for Planning Development Reforms and Special Initiatives Asad Umar chaired the NCOC meeting here on Thursday.\nThe provincial chief secretaries including Gilgit Baltistan and Azad Jammu and Kashmir (AJK) informed the NCOC that strict administrative action has been initiated against the violators of standard operating procedures (SOPs) and social distancing in public places and high risk areas of markets, public transport and industrial sectors.\nThe NCOC meeting discussed implementation of SOPs, safety and quarantine guidelines to avoid spread of coronavirus with the provincial chief secretaries.\nSpeaking on the occasion, Asad Umar said the main point of the strategy was containing the risk of the contagion and to ensure “SOPs Compliance and Enforcement of Quarantine Measures”. He said that all measures should be implemented swiftly to make the strategy a success in overcoming the risk of further spread of coronavirus.\nPunjab chief secretary told the meeting that strict SOPs and social distancing would be ensured whereas on violation the entire market, business centre and plaza would be sealed. He said that around Rs6.5 lac fines were also imposed on the transporters over violation of SOPs whereas a fine would also be imposed for not wearing face mask at public places and high risk areas.\nSindh chief secretary informed the forum that business centres, bazaars and markets violating the SOPs and safety guidelines were issued strict warning notices.\nKhyber Pakhtunkhwa chief secretary said that public compliance of SOPs and safety measures was not satisfactory rather careless attitude was witnessed in the province.\nHe said that the decisions made in NCC meeting on 1st June and NCOC sessions on 2nd and 3rd June 2020, were sent for implementation to provincial administration. In this context, two complete markets in various districts including Peshawar were sealed for violating safety protocols. “Around 25,000, ‘No Masks No Service’ informative banners and slings have been displayed across the province to create awareness among the masses to comply with wearing face masks measure.”\nBalochistan chief secretary informed the forum that keeping in view the increasing number of coronavirus positive cases after opening of the shops the provincial administration has prepared a comprehensive plan to initiate stringent action against violation of SOPs and safety measures.\nGilgit Baltistan chief secretary apprised the meeting that smart lockdown strategy was implemented earlier that helped in minimizing disease spread. “A fine of Rs100 is being imposed on the person for not wearing face mask in public places and three face masks instead are provided to volunteers on spot to follow the safety protocol. The people have generally welcomed the initiate”, he said.\nAJK chief secretary briefed the meeting that transport was opened in the valley with SOPs compliance whereas effective contact tracing was being carried out to trace affected patients and their close contacts; community mobilization and RSPN were also contributing effectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:46.744Z"
}
