{
  "title": "Women Wonder Awards 2020 held to honour women contributions",
  "link": "https://www.app.com.pk/national/187966-2/",
  "date_published": "2020-03-03T22:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP):Women Wonder Awards held here Wednesday to honour women who have been contributing tremendously to the economic development of the country and created impact at large, Connected Women Pakistan, a social impact community of women, celebrated the International Women’s Day by organizing Women of Wonders Awards 2020’ ceremony in partnership with ‘WOW Pakistan, N-Shield Solutions and Inspire Mill’.\nThe ceremony was attended by a large number of women from various professional fields the Women of Wonders Awards 2020 Ceremony was an annual event dedicated to celebrating Pakistani women’s professional excellence in various fields.\nThe Awards Ceremony was Connected Women Pakistan’s premiere event of the year, in the first phase, nominations in nine different categories including education, health, technology, e-commerce, lifestyle, women entrepreneurship, public services, food and agriculture, and community service were collected from the women all over Pakistan.\nNominees were then assessed upon quality of work, excellence and achievements on the basis of materials supplied with the nomination form.In the second phase, the winners were selected through a two tier process, via public voting and a prestigious panel of three member jury. The winner of each category was awarded a prestigious WOW Award.\nSpeaking on the occasion The team leader of Connected Women Pakistan, Zia Hassan, who is Founder WOW PK and NShield Solutions, said, “One way forward for women empowerment is to make sure that women support each other and that their achievements are honoured and celebrated by the society.\nWomen hold up half the sky and supporting women will help them advance at work, start businesses, reach big life goals and take part in the progress of the country.\nThis awards ceremony is all about our achievements and taking the credit we deserve.”\nSidra Jalil, Founder Inspire Mill and one of the organizers of the event, said, “This ceremony was an opportunity to celebrate the women who have paved the way towards the progress of Pakistan. If we want to empower and inspire future generations to create innovations that would change the world, we must celebrate and highlight the achievements of our women.”\nConnected Women Pakistan being a social impact community dedicated to driving technology adoption by women-led businesses and startups, aims to provide training tools and resources for success and scalability and runs events designed to empower and develop women in Karachi, Lahore and Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:54:04.515Z"
}
