{
  "title": "Govt determined to provide ease of doing business: PM",
  "link": "https://www.app.com.pk/national/govt-determined-to-provide-ease-of-doing-business-pm/",
  "date_published": "2020-03-04T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP):Prime Minister Imran Khan on Wednesday said the purpose of establishment of special economic zones (SEZs) was to provide every possible facility and incentives to the business community.\nSpeaking at the fifth meeting of the Board of Approval set up for the SEZs’ establishment, he said the government was committed to provide ease of doing business and favourable environment to the business community to generate more economic activity in the country.\nThe high-level meeting approved setting up of seven special economic zones in Balochistan, Sindh, Khyber Pakhtunkhwa and Punjab provinces.\nEstablishment of Special Economic Zone Bostan and Special Economic Zone Hub in Balochistan, Special Economic Zone at Rashaki, Nowshera in Khyber Pakhtunkhwa, SEZs at Noshero Firoz and Bholari in Sindh, and SEZs at Bhalwal, Bahawalpur, Rahimyar Khan, Vehari and Allama Iqbal in Punjab were approved.\nThe Board of Investment (BoI) secretary informed the meeting that 13 SEZs had so far been notified while work on setting up 12 more economic zones in the public sector and six in the private sector was in progress.\nThe meeting was told that after approval of law for the SEZs in 2012, only seven economic zones were set up in the country till 2018, while the present government had notified six new economic zones in one year (2019).\nThe BoI secretary said the process of amending the law for increasing incentives in the economic zones had almost been completed. The meeting was briefed about the industries to be set up in the special economic zones, and their location and land.\nThe meeting decided that all matters about the SEZs’ establishment would be resolved by the provincial governments.\nIt also decided to provide facilities of kepto power for power production industries in the special economic zones and wheeling for power transmission. The prime minister directed for making the system regarding kepto power and wheeling more simple and easy ,and fix a timeframe for its approval process.\nThe prime minister also directed for setting up a working group comprising ministers for planning and energy, commerce advisor and others for the establishment of SEZs, and making the required laws and regulations more easy to provide facilities to the investors and businessmen.\nThe working group will also submit its recommendations about the special economic zones to the prime minister.\nMinister for Planning Asad Umar told the meeting that work was in progress to formulate an economic growth strategy regarding Gilgit Baltistan, which also included progress of the industrial sector.\nThe prime minister stressed the need for utilizing the tourism potential of Gilgit Baltistan and the establishment of special economic zones there.\nThe meeting was attended by Leader of the House in Senate Shibli Faraz, Minister for Energy Omar Ayub, Minister for Planning Asad Umar, Advisor on Finance Dr Abdul Hafeez Sheikh, Commerce Advisor Abdul Razak Dawood, Khyber Pakhtunkhwa Chief Minister Mahmood Khan, Gilgit Baltistan Chief Minister Hafiz Hafeez ur Rehman, Special Assistant to the PM on Information and Broadcasting Dr Firdous Ashiq Awan, Special Assistant Nadeem Afzal Chan, BoI Chairman Zubair Gillani, KP Finance Minister Taimoor Zafar Jhagra, Punjab Minister for Industries Mian Muhammad Aslam and senior officials.",
  "retrievedAt": "2025-08-11T18:53:53.084Z"
}
