{
  "title": "Naval Chief chairs Bahria University’s BoG meeting, inaugurates new academic facilities",
  "link": "https://www.app.com.pk/national/naval-chief-chairs-bahria-universitys-bog-meeting-inaugurates-new-academic-facilities/",
  "date_published": "2020-03-04T00:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP):Chief of Naval Staff Admiral Zafar Mahmood Abbasi NI (M) on Wednesday chaired 42nd meeting of Board of Governors (BoG) of Bahria University here at its office.\nA detailed briefing was given to the Board on progress of various ongoing projects, with special reference to growth and diversification in academic disciplines, infrastructure enhancement, budget and new initiatives of academic & nonacademic areas, a press release said.\nChief of the Naval Staff who is also the Pro-Chancellor and Chairman BoG, Bahria University appreciated efforts of the university for focusing on students grooming through academic teachings and its core values of integrity, creativity and excellence.\nPrior start of the Board meeting, Admiral Abbasi also inaugurated various new academic facilities the university’s campus including an Academic Block, Bahria Innovation Centre and Chinese Language Lab.\nHe appreciated the academic benchmarks being raised in the university aligned with its strategic vision and mission.\nInnovation Center at Bahria University aims to provide inclusive support and facilities to all its components for a state-of-the-art Center to foster networking for its startups, SME’s and Commercial Research, including Maker space, Startup Factory, Accelerators & Industrial offices, Research Centers and Training & Capacity Building Space.\nThe university has also established Chinese Language Lab with Chinese instructors for understanding the language through cultural knowledge. Chinese Ambassador to Pakistan Mr Yao Jing was also present during the inaugural session.\nThe ambassador lauded the efforts of the university for providing versatile academic opportunities to the students.\nThe BoG meeting was attended by Board Members including senior Naval Officers, Secretary Ministry of Science & Technology, Financial Adviser Planning Ministry of Finance, Rector BU and relevant top management of Bahria University.",
  "retrievedAt": "2025-08-11T18:53:59.664Z"
}
