{
  "title": "Rs 10 mln fines imposed on profiteers, hoarders: DC",
  "link": "https://www.app.com.pk/national/rs-10m-fines-imposed-against-profiteers-hoarders-dc-islamabad/",
  "date_published": "2020-03-04T01:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP):The Islamabad Capital Territory (ICT) administration has imposed around Rs10 million fines on profiteers and hoarders during the last year, setting an example for other federating units to curb profiteering across the country.\n“It is first time in the history of Pakistan that such a huge amount of fine has been imposed on profiteers and hoarders in the federal capital,” Deputy Commissioner Islamabad Hamza Shafqaat told APP in an exclusive interview on Wednesday.\nUnlike past, strict measures were being taken to control artificial price-hike in the city, he said while pointing out that fine amount was only limited to Rs 1 million to Rs 3 million during previous years.\nHamza said the local administration had also embraced latest technologies to control inflation and ensure provision of relief to the masses by providing them food and vegetables at their doorstep on subsidized rates.\nHe said the city administration had recently launched ‘Durust Daam’ and ‘Sabzi Mandi’ apps which received overwhelming response from public as nearly 20,000 people had downloaded the applications.\nExtensive awareness campaign was also launched to sensitize people about the applications so that desire results could be achieved, he added.\nHe said the price control committee of administration was having regular huddles to stem price hike in the capital city.\nTo a query, he said under the Price Control and prevention of Profiteering and Hoarding Act 1977, the administration could only take action against those profiteers, who were selling edible items like flour, grains, sugar and others on unofficial rates.\nHowever, most of the complaints of citizens were about grocery items and mobile accessories which were also being addressed through different measures, he added. “We dispatch our teams to the capital’s vegetable and fruit market daily to check profiteering,” he said while urging the citizens to lodge complaints against the violators on the administration’s whatsapp number i.e. 03359950236.",
  "retrievedAt": "2025-08-11T18:53:58.038Z"
}
