{
  "article_id": "2025-02-22_0bdfb73236cd37527d6e99f774e55dc8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/security-plan-finalized-for-champions-trophy-5800-police-personnel-deployed/",
    "retrieved_at": "2025-08-27T13:00:55.586Z"
  },
  "metadata": {
    "title": "Security plan finalized for Champions Trophy, 5,800 police personnel deployed",
    "author": null,
    "date_published": "2025-02-22T09:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 195,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 22 (APP):Inspector General (IG) Police, Syed Ali Nasir Rizvi, chaired a crucial late-night meeting regarding the security arrangements for the upcoming ICC Champions Trophy. An official told APP on Saturday that the senior officers from Islamabad and Punjab police participated in the meeting. He said the officials were briefed on the comprehensive security plan for the cricket teams. IG Rizvi stated that 5,800 police personnel would be deployed to ensure security during the matches. He said full-scale security measures would be in place for the movement of the cricket teams. IG Rizvi emphasized that hosting the Champions Trophy in Pakistan was a positive development and assured that all necessary security arrangements had been finalized. To maintain smooth traffic flow, citizens would be informed about alternative routes. IG said the movement routes of the teams would be monitored using drone cameras and smart vehicles. Senior officers would provide continuous briefings to the deployed personnel, ensuring that all security protocols were strictly followed. He added that every officer on duty must display their security card at all times. \"This is an extremely important duty, and every officer must perform it with utmost dedication,\" IG said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}