{
  "article_id": "2025-02-22_05d51c4285a1e28d5c7581d26d7dd734",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-900-cameras-to-monitor-champions-trophy-security/",
    "retrieved_at": "2025-08-27T13:00:58.271Z"
  },
  "metadata": {
    "title": "Over 900 cameras to monitor champions Trophy security",
    "author": null,
    "date_published": "2025-02-22T09:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 192,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 22 (APP):Islamabad Capital Police has implemented comprehensive security measures for the upcoming ICC Champions Trophy, ensuring a foolproof plan for the safety of teams, officials, and spectators. A public relations officer told APP that more than 5,800 security personnel will be deployed across the federal capital to oversee the security arrangements. The Safe City Islamabad is conducting surveillance through over 900 cameras to monitor the movement of cricket teams from airports to hotels and stadiums. He said that all routes and residences are under 24-hour surveillance using drone cameras, 202 body-worn cameras, and a vehicle tracking system. Virtual patrolling officers and technical teams are performing their duties round the clock at the Safe City Islamabad facility. He said that smart cars are also being utilized to monitor all designated routes. The security arrangements adhere to international security standards, integrating advanced technology and seamless coordination among security agencies. He said that there is complete coordination between Safe City staff and field personnel to ensure efficient communication and rapid response to any security concerns. All law enforcement agencies involved in securing the matches are working in full coordination with Safe City Islamabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}