{
  "title": "Dr Faisal launch refurbished BHU in SMT, inaugurate Nov round of polio drive",
  "link": "https://www.app.com.pk/national/dr-faisal-launch-refurbished-bhu-in-smt-inaugurate-nov-round-of-polio-drive/",
  "date_published": "2020-11-29T14:14:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 29 (APP): Special Advisor to Prime Minister for National Health Services, Regulations and Coordination, Dr Faisal Sultan has said that provision of quality health services to people is top priority of the government and efforts are being made at all levels to equip existing health facilities with latest state of the art services to ensure uniform health infrastructure across the country.\nHe said this while addressing a press briefing here at Finance Department Civil Secretariat Peshawar on Sunday.\nHealth Minister KP, Taimur Saleem Jhagra, Special Assistant to CM on Information, Kamran Bangash, Special Assistant to CM on Excise & Taxation, Ghazan Jamal, MPA Ayesha Bano, Special Secretary Health KP Dr Farooq, Coordinator National EOC, Dr Rana Safdar, Additional Secretary Health (polio) & Coordinator EOC, Abdul Basit, National Technical Focal Person, Dr Altaf Bosan, Director EPI Dr Saleem, National team Lead UNICEF Hamesh Young and representatives of technical partners including UNICEF, WHO and BMGF were also present on the occasion.\nTalking to media after a detailed briefing about polio eradication programme, current interventions, remaining challenges by Coordinator provincial EOC Abdul Basit, Dr Faisal Sultan said that Prime Minister has issued clear directives for ensuring uniform health system across the country and to specifically focus on poor and marginalized areas that were lacking in basic health facilities.\nHe reiterated strong political commitment for polio eradication saying that all possible efforts are being made to stop virus circulation in the country and to wipe out the scourge from the region.\nWith the number of measures taken at the provincial level to address the remaining gaps and challenges in polio eradication, I am positive we will soon eliminate the menace from this last endemic region, he added.\nHe also thanked media for responsible reporting on health and polio that has been of vital help to the government in motivating communities about the significance of immunization including polio vaccination.\nOn his day long visit to the provincial capital, Dr Faisal Sultan also visited Super High Risk Union Councils (SHRUCs) where he was briefed about Integrated Health Service Delivery strategy (ISD) by the focal person following which he inaugurated a model Basic Health Unit (BHU) here at Shaheen Muslim Town (SMT) Peshawar.\nThe advisor to PM also went to Emergency Response Unit (ERU) at Maulvi Ameer Shah Hospital where he was informed about the role and functions of ERU that specifically focus on addressing operational and communication challenges in the 18 union councils that falls in Shaheen Muslim Town (SMT).\nIt is relevant to mention here that it is one of the 13 environmental collection sites of the province that tells about circulation of virus in the environment.\nEarlier, Dr Faisal Sultan administered polio drops to the children in Civil Secretariat to inaugurate the November round of anti-polio campaign.",
  "retrievedAt": "2025-08-11T20:04:39.858Z"
}
