{
  "title": "Pakistan gifted oxygen plant inaugurated at Jinnah hospital, Kabul",
  "link": "https://www.app.com.pk/national/pakistan-gifted-oxygen-plant-inaugurated-at-jinnah-hospital-kabul/",
  "date_published": "2020-11-29T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): Afghan Minister for Public Health Ahmad Jawad Usmani and Pakistan’s Ambassador to Afghanistan Mansoor Ahmad Khan Sunday jointly inaugurated an oxygen production plant fixed at Muhammed Ali Jinnah Hospital at Kabul.\nThe plantwas gifted by the government of Pakistan to cater to the needs of the Afghan patients.\n“The installment of this plant will make the doctors to treat Covid-19 patients effectively as the plant has the capacity of providing oxygen to more than 200 beds in addition to extra 50 oxygen balloons per hour and around 1200 balloons in 24 hours,” said a press release.\nOn the occasion, Ambassador of Pakistan Mansoor Ahmad Khan said that Pakistan had pledged $1billion as assistance to Afghanistan.\nOnly in health sector three hospitals had been completed at a cost of $72 million which included Jinnah Hospital at Kabul, Naib Aminullah Hospital at Logar and Nishter Kidney hospital at Jalalabad, he added.\nHe further said that they had proposal for conversion of this hospital into a post graduate teaching hospital wherein doctors trained in Pakistan could continue their post graduate training under supervision of leading medical institutes of Pakistan.\nHe also expressed his view that he also wished to extend the existing facilities in Jinnah Hospital by incorporating cancer block and other facilities as required by the Afghan patients.\nThe ambassador said that they had been closely coordinating with the Afghan government through ministry of health and ministry of Foreign Affairs on aforementioned proposals.\nHe also elaborated upon new visa policy for the Afghan nationals wherein special priority had been given to the Afghan patients even serious patients were given visas on Torkham border which showed serious commitment by the government of Pakistan.\nThe inauguration ceremony was attended by health professionals and other dignitaries and etc.\nThe hospital is a sign of good will gesture by the government of Pakistan where free of cost treatment is being provided to the Afghan patients.\nJinnah Hospital is a 200-bed, state-of-the-art hospital in Kabul, funded by the government of Pakistan which was initiated in 2007 under the Pakistan Technical",
  "retrievedAt": "2025-08-11T20:04:39.919Z"
}
