{
  "title": "Govt fully committed to digital advancement for country’s progress: Atta Tarar",
  "link": "https://www.app.com.pk/national/govt-fully-committed-to-digital-advancement-for-countrys-progress-atta-tarar/",
  "date_published": "2024-09-04T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): Minister for Information, Broadcasting, Culture and National Heritage Attaullah Tarar on Wednesday ruled out the possibility of progress in the country without digital advancement while highlighting multiple initiatives for transformation, taken by Pakistan Muslim League-Nawaz (PML-N) led governments.\n.\nAddressing a ceremony regarding “Digital Sahafat: Training Programme for Pakistani Journalists,” the minister said the PML-N leadership had completely realized the importance of technology with the substantial growth of the digital space.\n“I have been working with Prime Minister Shehbaz Sharif…, and when he was chief minister of Punjab, we realized that without technology we cannot achieve progress and growth,” he said, recalling the then provincial government efforts for setting up Pakistan’s First Land Record Management Information System.\nHe said the then provincial government led by PM Shehbaz Sharif digitalized whole revenue system which was inherited by the country after partition.\n“When we took up the challenge and came with this system, it was not easy and it was big challenge because when you move away from traditional system, change is something which is resisted the most.”\nHe also mentioned about establishing largest safe city project in Punjab by the then provincial government, which helped the country combating crime and terrorism.\n“I believe if you don’t change with time, the time will change you,” he remarked.\n“In this digital age, as far as information is concerned and as far as editorial content is concerned, I think verification and authentication are the two most important things we need to pursue in order to give the people of world a true prospective on the global issues and ground reality.”\nHe said all the televisions and newspapers should have proper editorial system, regular trainings and well-equipped people who could deal with information and its circulation.\nTarar said ironically, there was no mechanisms to authenticate and verify information with growth of digital space.\nHe highlighted the severe damage caused by the fake news, disinformation and misinformation. “The damage of fake news for a fragile economy like us, could inflict immeasurable loss.”\nThe minister said he has been advocating to equip the journalists and freelancers with proper skills so that they could build image the country.\nHe said the vulnerable groups and minorities were mostly targeted through digital media under the certain hidden agenda.\nThe minister said minorities were “actually at loss” as small amount of the information could cause a huge damage.\nHe recalled his last election campaign in his constituency which had 70,000 minority voters and pointed out “the agony they were facing due to some misconception, pre-conceived notion and false information spread by religious extremists which had caused huge wedge between them and us.”\n“It took me one week to make them feel secure, and to convince that the country is yours as much as it is mine,” he said, adding “the people who spread false information and hatred are not our friends.”\nHe said the government was determined to counter fake news, misinformation and disinformation.\nA fact check system was introduced two years ago in the ministry of information, he said, adding the people were being sensitized about the fake news with a stamp of fact-check on the digital posts.\nHighlighting pros and cons of the digital media, he also regretted the lack of means to counter growing use of digital platforms by the terrorist organizations.\nHe said the government was committed to curb the menace of fake news, misinformation and disinformation.\nHe paid homage to those journalists who were subjected to great difficulties during their line of duties, adding the government was committed to the freedom of speech and journalism as envisaged in the Constitution.\nHe appreciated the Google and TechValley who brought master trainers to train journalists with right skills.\n“I believe these trainings will help build our society and bridge the gap we have in our community and it will discourage hatred and misinformation.”\nHe assured the Google and Techvalley of all-out assistance for capacity-building of the journalism.",
  "retrievedAt": "2025-08-10T20:44:27.240Z"
}
