{
  "title": "Churna Island declared second Marine Protected Area in Pakistan",
  "link": "https://www.app.com.pk/national/churna-island-declared-second-marine-protected-area-in-pakistan/",
  "date_published": "2024-09-04T14:06:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 04 (APP): WWF-Pakistan appreciates the Government of Balochistan for declaring Churna Island as the second Marine Protected Area (MPA) in Pakistan.\nThe cabinet of Balochistan in its meeting held on Wednesday approved the declaration of Churna Island as the second Marine Protected Area (MPA). Previously, the Government of Balochistan declared Astola Island as the first MPA in June 2017, a news release said.\nChurna Island, like Astola Island, is among the limited marine areas in Pakistan that have coral habitat and are termed a biodiversity hotspot. However, Churna Island, located near Karachi is being extensively used for scuba diving, snorkelling, cliff jumping, and jet skiing and other recreational activities. It is considered an important fishing ground where a large number of fishermen from Sindh and Balochistan operate.\nThe marine ecosystem and diverse wildlife inhabiting Churna Island are under serious threat due to many anthropogenic activities including the development of power plants, single-point mooring, an oil refinery in the immediate vicinity, as well as recreational activities that are conducted at the area. WWF-Pakistan believes that declaration of Churna Island as a MPA is an important step towards ensuring that the fragile ecosystem of the area is protected.\nWWF-Pakistan appreciates the efforts of Government of Balochistan and lauded the role of Dostain Jamaldini, Secretary Forest and Wildlife Department and Sharifuddin Baloch, Chief Conservator Wildlife for their dedicated efforts in securing this designation. Pakistan is a signatory of the Convention of Biological Diversity and according to its Kunming-Montreal Global Biodiversity Framework, states are required to declare 30 % of the ocean area as a protected area by 2030 (called 30 x 30). The Declaration of Churna Island as a MPA will be an important step towards achieving this target.\nCommenting on this declaration, Rab Nawaz, Senior Director, Biodiversity Programmes, WWF-Pakistan appealed to both the federal and Sindh governments to take decisive actions to achieve the target of 30 x 30 by following the footsteps of the Government of Balochistan and declaring additional Marine Protected Areas in Pakistan. Nawaz further said that because of poorly planned development activities and climate change, we are losing our marine resources. “This initiative will help reverse the damage caused to marine ecosystems and would protect marine life for future generations”, he added\nMuhammad Moazzam Khan, Technical Advisor, WWF-Pakistan pointed out that Churna Island is a biodiversity hotspot known for more than 50 species of corals and 250 species of fish as well as many invertebrates and vertebrates. The declaration of Churna Island as a MPA will address the challenge of biodiversity loss and help protect the threatened species reported from this area.",
  "retrievedAt": "2025-08-10T20:44:49.800Z"
}
