{
  "title": "Court issues non-bailable arrest warrants against CM KPK in illegal weapon, liquor case",
  "link": "https://www.app.com.pk/national/court-issues-non-bailable-arrest-warrants-against-cm-kpk-in-illegal-weapon-liquor-case/",
  "date_published": "2024-09-04T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): A lower court on Wednesday issued non-bailable arrest warrants against Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur in cases of possessing weapons illegally and recovery of liquor from him.\nThe court instructed the police to present the CM KPK before the court after arresting him.\nCivil Judge Shaista Khan Kundi heard the aforesaid case against Gandapur wherein his lawyer submitted a one-time exemption from appearance request on medical grounds for CM KPK.\nThe court dismissed the request for exemption from appearance and ordered the station house officer Bharakau to present Ali Amin Gandapur before the court after arresting him.\nAs the hearing began, the judge inquired about the attendance of Gandapur to which the associate lawyer said that there was a situation of flood in Peshawar. Addressing lawyer Zahoor ul Hassan, the judge said that whether he remembered what undertaking they had submitted in last hearing.\nThe lawyer said that his client was sick and they would submit his medical report to the court. The court said that the associate lawyer stated that there was an issue of flood and now you are giving reference to health issue. The court has also given relief to the accused in last hearing, the judge said.\nThe advocate said that he has to appear before courts in five cases, he just arrived here after getting free, adding that they have filed an acquittal plea in the case. Judge Shaista Kundi said that as per the judgment of the Supreme Court when the case is going towards conclusion then the acquittal matter shouldn’t be viewed. It is 8th time when the statement of section-342 was not recorded, she noted.\nThe court, subsequently, issued non-bailable arrest warrants against the accused and adjourned the hearing till tomorrow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:45:36.821Z"
}
