{
  "title": "K-Electric receives seven bids for solar, wind projects to generate 220 MW, Tarar tells NA",
  "link": "https://www.app.com.pk/national/k-electric-receives-seven-bids-for-solar-wind-projects-to-generate-220-mw-tarar-tells-na/",
  "date_published": "2024-09-04T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): Federal Minister for Information, Broadcasting, National Heritage, and Culture Attaullah Tarar informed the National Assembly on Wednesday that the Karachi Electric Company has received seven bids for solar and wind power projects aimed at generating 220 megawatts (MW) of electricity.\nResponding to a calling attention notice concerning the collapse of K-Electric’s electricity transmission and distribution system and the electrocution of numerous individuals in the city during the current monsoon season, he said that the government was committed to ensuring that the seven bids for solar and wind power projects are implemented transparently to enhance K-Electric’s capacity.\nHe expressed the hope that the implementation of these projects would resolve Karachi’s electricity challenges.\nThe minister said that between July and August, Karachi experienced increased rainfall. As a precautionary measure, particularly in areas facing drainage issues, K-Electric temporarily shut down 300 feeders out of 1,800.\nHe further said that, due to these measures, no incidents of electrocution were reported in the city. However, 24 incidents did occur due to internal wiring issues and short circuits within homes.\nHe said an FIR was registered for one such case, but upon investigation, no negligence on the part of K-Electric was found.He further said that there have been 24 reported incidents during the recent rains in Karachi, but none resulted in fatalities.\nHe added that since the current government took office, significant steps have been taken to improve the country’s electricity system. Load shedding primarily occurred in areas with high electricity theft and line losses, he added.\nHe said that the prime minister was continuously being briefed on efforts to enhance the capacity of K-Electric and other power distribution companies. In response to another query, he said that some load shedding was being done in certain areas due to technical faults, which cannot be attributed to capacity issues.\nHe said that a task force had been established to review capacity payments. the task force, he said, will also review the K-electric projects. When questioned about budgeting, he explained that funds were allocated separately for each institution, taking into account their operational expenses.\nThe minister highlighted that unexpected rains this year have caused issues, particularly in Karachi, where drainage problems have worsened the situation. While the Mayor of Karachi has made significant efforts to address drainage concerns, there remains a need to increase K-Electric’s maintenance budget.\nHe informed the National Assembly that a group of individuals in Khyber Pakhtunkhwa recently stormed a grid station and forcibly turned on the feeders. Warning that such actions could lead to serious accidents, he stated that PESCO has decided to take legal action in this matter.\nHe said that such issues should be resolved amicably and that storming a grid station was not a viable solution to any problem. Syed Ghulam Mustafa Shah referred the calling attention notice to the concerned standing committee for further deliberation.",
  "retrievedAt": "2025-08-10T20:45:37.131Z"
}
