{
  "title": "‘Korean Week 2024’ to strengthen ties with cultural events, films screening, Taekwond",
  "link": "https://www.app.com.pk/national/korean-week-2024-to-strengthen-ties-with-cultural-events-films-screening-taekwond/",
  "date_published": "2024-09-04T05:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 4 (APP):: South Korean Ambassador to Pakistan, Park Kijun, announced on Tuesday that the South Korean Embassy will host “Korean Week 2024” from October 22nd to 27th in Islamabad. The event aims to enhance people-to-people connections and deepen the bilateral relationship between South Korea and Pakistan.\nAmbassador Park emphasized the importance of advancing the relationship between South Korea and Pakistan beyond mere friendship, advocating for a transition from cordial ties to a more complementary bilateral partnership.\nHighlighting the significance of the upcoming event, Ambassador Park shared details of the “Korean Week,” which will feature four major activities: the National Foundation Day and Armed Forces Day Reception, the Korea-Pakistan Cultural Gala, Korea-Pakistan Movie Day, and the 17th Korean Ambassador’s Cup National Taekwondo Junior Championship.\nThe Korea-Pakistan Cultural Gala, in particular, will be a public event designed to foster a deeper understanding of the strong historical and cultural bonds shared by the two nations. “We hope to attract as many participants as possible to this gala. We are closely collaborating with the EP Wing of Pakistan’s Ministry of Information to ensure the success of this event,” Ambassador Park added.\nRaisa Adil, an official from the Ministry of Information and Broadcasting, remarked on the longstanding historical and cultural ties between Pakistan and South Korea, noting the recent celebration of the 40th anniversary of their bilateral relationship. “Korean companies like Daewoo, Hyundai, and Samsung are household names in Pakistan. Moreover, Korean culture, particularly through K-pop, dramas, and films, has a significant presence in Pakistan. ‘Korean Week’ will showcase movies, music, and other cultural events that highlight these connections,” she stated.\nSecond Secretary Jee Eun Seok also expressed optimism about the upcoming event, emphasizing that it will offer Pakistani audiences a valuable opportunity to explore and appreciate Korean culture.\nThe announcement was made in the presence of senior officials from the Korean Embassy, including Park Jae-lark, Deputy Head of Mission; In Yong Lee, Counselor; and Ms. Gong Sooyun, First Secretary.",
  "retrievedAt": "2025-08-10T20:45:55.678Z"
}
