{
  "title": "IHC adjourns PTI chairman’s appeal against Toshakhana case verdict till Aug 24",
  "link": "https://www.app.com.pk/national/ihc-adjourns-pti-chairmans-appeal-against-toshakhana-case-verdict-till-aug-24/",
  "date_published": "2023-08-22T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 22 (APP): The Islamabad High Court (IHC) on Tuesday adjourned an appeal of Pakistan Tehreek-e-Insaf chairman till August 24, against his conviction in the Toshakhana case while granting time to the Election Commission of Pakistan (ECP) for production of case record.\nThe IHC bench comprising Chief Justice Aamer Farooq and Justice Tariq Mehmood Jahangiri, which heard the appeal of PTI chairman against the verdict of trial court, also served notices to the respondents.\nDuring the course of proceedings, the petitioner’s lawyer Latif Khosa Advocate said that as per the inspection report of District and Sessions Judge Attock, a camera had been fixed in front of the cell of PTI chairman in jail.\nSher Afzal Murawat Advocate said that the lawyers were not being allowed to meet the former prime minister.\nThe chief justice remarked that he did not know why the jail administration was not permitting the lawyers to meet the PTI chief despite his order. He said that he had instructed that two or three lawyers could visit the prisoner in jail.\nThe court said that it was serving notices to the respondents to the plea seeking provision of facilities to the PTI chairman in jail.\nTo a court’s query regarding the case record, ECP’s counsel Amjad Pervaiz prayed the court to grant two weeks time in that regard. The petitioner had also prayed the court to suspend his sentence in his plea and he also needed some time for preparation, he added.\nLatif Khosa Advocate opposed the request of ECP’s lawyer and said that the trial court had announced verdict in the absence of his client, and his basic rights were being violated in jail. The PTI chief wanted only his right and not of any concession, he added, praying the court to decide the matter pertaining to the suspension of imprisonment sentence same day.\nThe PTI chief’s lawyer argued that the sessions court had announced the sentence against the law as it was even not authorized to hear the case. The ECP Secretary was not authorized to file such complaint, he said, adding the trial court had abolished the right of defence of his client and announced the verdict in one day.\nThe lawyer said that delaying tactics were being used in the case.\nThe court, however, adjourned hearing of the case till August 24.",
  "retrievedAt": "2025-08-11T09:15:53.806Z"
}
