{
  "title": "‘National heroes’: PM lauds teamwork for successful chairlift rescue operation",
  "link": "https://www.app.com.pk/national/national-heroes-pm-lauds-teamwork-for-successful-chairlift-rescue-operation/",
  "date_published": "2023-08-22T18:22:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 22 (APP): Caretaker Prime Minister Anwaar-ul-Haq on Tuesday expressing his relief over the safe rescue of all eight passengers trapped in a cable car in Battagram, said all those involved in the operation were “national heroes.”\n“Relieved to know that Alhamdolillah all the kids have been successfully and safely rescued. Great team work by the military, rescue departments, district administration as well as the local people,” the prime minister wrote on X, formerly Twitter.\nHe expressed his gratitude to the officers and personnel of the Pakistan Army, Pakistan Air Force, rescue departments, district administration and all related organizations who participated in the rescue operation.\nHe also paid tribute to the volunteers who arrived on emergency basis from local and other areas and participated in the rescue operation.\nRelieved to know that Alhamdolillah all the kids have been successfully and safely rescued. Great team work by the military, rescue departments, district administration as well as the local people.  https://t.co/2gPq2Q51Xi\n— Anwaar ul Haq Kakar (@anwaar_kakar) August 22, 2023\nThe prime minister said that the officers, personnel and volunteers involved in the rescue operation did not only save eight precious lives as well as the lives of eight families.\nHe said that by completing the difficult operation in a very professional manner, the officials, officers and volunteers also saved many mothers from losing their dear ones.\n“All the people participating in the rescue operation are heroes of the nation,” the prime minister remarked.\nEarlier, on the same social media platform, he said that he was closely monitoring and tracking the rescue efforts in Battagram.\n“I am happy that progress is being made, and thanks to the efforts of our army personnel, Air Force, rescue organizations, district administration and others, students stuck in the chairlift have started returning to the ground safely,” he added.",
  "retrievedAt": "2025-08-11T09:15:50.837Z"
}
