{
  "title": "Religious tolerance key to peace, stability: NA Speaker",
  "link": "https://www.app.com.pk/national/religious-tolerance-key-to-peace-stability-na-speaker/",
  "date_published": "2023-08-22T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 22 (APP): Speaker National Assembly Raja Pervez Ashraf has said that religious tolerance and Inter-Faith Harmony are key for global peace and stability.\nHe expressed these views in his message on “International Day Commemorating The Victims of Acts of Violence Based on Religion or Belief”.\nThe Speaker in a statement, said that acts of violence based on religious belief and faith are condemnable. He also stressed the need for tolerance and forbearance as the prevalent norm in societies.\nThe speaker has also condemned the incidents of Desecration of Holy Quran which are cause of deep concern and pain the Muslims in Pakistan and around the world. He also said that Islamic teachings stress Ideology and the notion of Religious Tolerance and Inter-Faith Harmony.\nWhile highlighting the increasing incidents of hatred and animosity against Indian Muslims by the fascist Modi government, he said that global stakeholders need to take cognisance of the plight of Indian Muslims. He also said that the world should also take notice of severe violence against innocent Palestinians by Israeli forces.\nFurthermore, Raja Pervez Ashraf has said that Kashmiris have been facing the suppression and aggression of Indian state machinery in Illegally Indian Occupied Jammu & Kashmir. He said that acts of violence on the basis of religious belief are the real cause of instability in the world.\nSpeaker National Assembly Raja Pervez Ashraf has said that the constitution of Pakistan guarantees the provision of fundamental rights to all irrespective of religious belief and faith. He also said that the implementation of the constitution in Letter & Spirit would ensure a pluralist society in Pakistan.",
  "retrievedAt": "2025-08-11T09:15:55.169Z"
}
