{
  "title": "PM determined to turn Pakistan into Islamic welfare state: Murad",
  "link": "https://www.app.com.pk/national/pm-determined-to-turn-pakistan-into-islamic-welfare-state-murad/",
  "date_published": "2021-10-31T17:50:00.000Z",
  "source": "APP",
  "content": "Addressing a public meeting at Marghuz here, he said all the citizens of Punjab would be provided health cards by end of the current year.\n“Welfare and well-being of the people is the top priority of the government.”\nHe said the biggest beneficiary after the completion of the China Pakistan Economic Corridor (CPEC) would be Khyber Pakhtunkhwa.\nHe said the PM provided free health facilities to the people, adding people support Imran Khan because he cared for the labourers and daily wage earners.\nThe minister recalled that the Health Insaf Card was initiated form the Khyber Pakhtunkhwa province and now the card would be distributed among all people of Punjab.\nHe said when the government of Pakistan Tehreek i Insaf (PTI) was formed, Khyber Pakhtunkhwa was badly affected due to war on terrorism but now with the grace of Allah the province was peaceful and tourism activities had increased manifold.\nMurad said the PM made stance of Pakistan clear before the world on the issue of sanctity of Prophet Muhammad (PBUH) and raised the issue at all international forums.\nHe said in the past era, the rulers signed expensive energy agreements to stuff their own pockets.The opposition put pressure on the PM to impose a complete lockdown during the coronavirus pandemic but Imran Khan felt the difficulties and problems of poor people and did not go for absolute lockdown.\nMurad said opponents of the government did not care about the people but were running a movement to protect their loot and plunder.\nInflation was an international issue and those blaming the government of PTI should be ashamed of themselves, he remarked.\nThe minister said during the previous government, the province was afflicted with terrorism, people of Malakand were made homeless and on that occasion people of Swabi opened their doors for them and he was thankful for this gesture.\nWhen some elements were linking Islam with terrorism, at that time Imran Khan came forward and stressed that Islam was a religion of peace, he recalled.\nHe said sugar mills were owned by Zardaris and Sharifs, so if they had love for people they would have reduced prices of sugar.\n“They do not love people but love future of their children.” He said Nawaz Sharif went abroad but even after such a long time could not complete his medical treatment.",
  "retrievedAt": "2025-08-11T21:32:25.375Z"
}
