{
  "title": "Chinese envoy meets Shehbaz Sharif; calls him China’s committed, respected friend",
  "link": "https://www.app.com.pk/national/chinese-envoy-meets-shehbaz-sharif-calls-him-chinas-committed-respected-friend/",
  "date_published": "2022-04-12T18:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):The Charge d’ Affaires of China Pang Chunxue Tuesday called on Prime Minister Shehbaz Sharif and emphasized that the latter was viewed as a strong and committed friend of China and enjoyed great respect and admiration there.\nDuring the courtesy call, the charge d’ affaires conveyed warm felicitations and good wishes of the Chinese government and leadership on the assumption of office by the prime minister.\nThe charge d’ affaires also lauded the prime minister’s contribution to promoting China-Pakistan Economic Cooperation during the years that he was Chief Minister  of the Punjab province.\nConveying his warm greetings and gratitude to the Chinese leadership, the prime minister recalled his many visits to China, when he also met with President Xi Jinping who had taken a personal interest in promoting relations with Pakistan.\nThe prime minister appreciated CPEC’s continued progress as the flagship project of President Xi’s Belt and Road Initiative and its importance for economic development and prosperity of Pakistan.\nHe affirmed his government’s resolve to speed up high quality development of CPEC projects and make it a symbol of China-Pakistan friendship and close partnership.\nHe underlined the importance of enhanced investment from China in industrialization, agriculture, and digital technologies.\nRecalling his close cooperation with China as Chief Minister of Punjab, the prime minister reaffirmed the All-Weather Strategic Cooperative Partnership between Pakistan and China as a cornerstone of Pakistan’s policy and factor for regional peace and stability.\nHe underscored that friendship with China resided in the hearts of the people of Pakistan and China was Pakistan’s strongest friend and closest partner.\nThe prime minister affirmed his government’s commitment to further deepeningthe win-win economic cooperative partnership between the two countries.",
  "retrievedAt": "2025-08-11T14:41:33.164Z"
}
