{
  "title": "PM confident of tackling high inflation, economic challenges",
  "link": "https://www.app.com.pk/national/pm-confident-of-tackling-high-inflation-economic-challenges/",
  "date_published": "2022-04-12T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 12 (APP): Prime Minister Muhammad Shehbaz Sharif has expressed his determination and urge to tackle the key economic challenges, including the double-digit inflation and price hike, worsened by the faulty policies of former Pakistan Tehreek-i-Insaf’s government.\nShehbaz Sharif, in his maiden speech in the National Assembly on Monday soon after his election to the office of prime minister, announced immediate remedial measures to ensure economic turnaround by stemming the rising tide of inflation and price hike in the country.\nOn his Twitter handle, he also congratulated the people of Pakistan on the peaceful transition of power.\nReferring to the bullish stock market & strengthening of the currency, he said that it was an indication that the journey towards the destination had already started\n“Our focus is on providing as much relief as possible to all Pakistanis by tackling high inflation & kick-starting the stagnant economy. Together we will make Pakistan a great nation, Insha’Allah. Pakistan Zindabad,” he posted on his Twitter handle.\nWhile in the National Assembly session, he also narrated the specific contours of his government’s economic priorities.\nOn Monday, Shehbaz Sharif was elected as the 23rd Prime Minister of Pakistan after 174 members of the National Assembly voted for him in the 342-member lower house of the Parliament.  Shahbaz Sharif was a nominee of the joint opposition parties.\nOther Pakistan Tehreek-i-Insaf nominee Makhdoom Shah Mahmood Qureshi opted to boycott the election process and announced that PTI’s members had decided to tender resignation from their seats.\nThe prime minister in his speech further said that through untiring struggle and unity they would strive to achieve the desired results of economic turnaround, and affordability of commodities of life to the lower segments of the society by saving the stranded boat and steering it to the bank.\nThe prime minister announced immediate relief to the pensioners through 10 per cent increase in pensions and enhancing the minimum wage to Rs25,000.\nDeclaring himself as ‘Khadim-e-Pakistan”, he said through joint efforts and unity they would turn the tides of inflation and poverty through immediate measures.\nHe said during 1974, late Zulfikar Ali Bhutto had laid the foundation of nuclear deterrence, and Mian Nawaz Sharif had refused 5-billion-dollar aid and conducted the nuclear tests, thus making the country’s defence impregnable. Through 18th Constitutional Amendment, powers were devolved to the provinces, he added.\nSuch historic feats were achieved through sheer struggle and solidarity among the ranks of the nation, he said and assured the nation that through the joint efforts by all the allied parties, they would reset the tune of the economy left in shatters by the PTI’s government.\nLater in the night, Muhammad Shehbaz Sharif took oath of the office of Prime Minister of Pakistan in a ceremony held at Aiwan e Sadr.\nActing President and Senate Chairman Sadiq Sanjrani administered the oath of office to the newly-elected prime minister.\nThe ceremony was held here at the Aiwan-e-Sadr and was attended by parliamentarians, services chiefs and senior officials. Leaders of political parties, including Bilawal Bhutto Zardari, Maulana Fazlur Rehman, Hamza Shehbaz Sharif, Maryam Nawaz, Aleem Khan, Raja Zafarul Haq, Khawaja Saad Rafiq, Maryam Nawaz, Yusuf Raza Gilani, Iqbal Zafar Jhagra, Akhtar Mengal, Mohsin Dawar, Khalid Siddiqui and Ahsan Iqbal, and senior officers also attended the oath taking ceremony.",
  "retrievedAt": "2025-08-11T14:41:40.037Z"
}
