{
  "title": "Govt taking measures to promote investment, export industry in SEZs: PM",
  "link": "https://www.app.com.pk/national/govt-taking-measures-to-promote-investment-export-industry-in-sezs-pm/",
  "date_published": "2021-06-15T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 15 (APP): Prime Minister Imran Khan Tuesday terming timely completion of China Pakistan Economic Corridor (CPEC) as one of government’s foremost priorities stressed that measures were being taken for the promotion of investment in export industry in the country’s Special Economic Zones (SEZs).\nHe added that export industries besides providing jobs, increasing economic volume and the precious foreign exchange will also ensure the access of “Made-in-Pakistan” brand in the international market.\nThe Prime Minister expressed these views while presiding over a review-meeting on foreign investment in export industries under CPEC.\nFederal Ministers Shaukat Tarin, Makhdoom Shah Mahmood Qureshi, Sheikh Rashid Ahmad, Asad Umar, Makhdoom Khusro Bakhtiar, Ali Haider Zaidi, Advisor on Commerce and Investment Abdul Razak Dawood, Special Assistants to PM Dr. Waqar Masood, Dr. Moeed Yusuf, Chairman CPEC Authority Lt. Gen. ® Asim Saleem Bajwa and senior officers concerned were present in the meeting which was also attended through video-link by Governor State Bank Raza Baqir.\nThe meeting was told that with the complete redressal of visa issues for Chinese officials coming to Pakistan under the CPEC, the Ministry of Interior was disposing of the new cases on daily basis, which was positively impacting the pace of CPEC.\nThe Board of Investment (BOI) briefed the meeting in detail about comprehensive strategy for the establishment of export industries in SEZs.\nThe meeting was apprised of the identification of possible foreign investors from China in different sectors and the incentives being offered to them for direct investment in Pakistan.\nThe meeting was told about the establishment of mobile assembly units by three big international mobile companies in Pakistan as well as their domestic consumption and the positive effects on exports.\nBesides, the meeting was also briefed about the measures taken by the CPEC Authority, the Ministry of Industries and Production and BOI.",
  "retrievedAt": "2025-08-11T20:50:51.316Z"
}
