{
  "title": "Parliament’s role important for promotion of democratic values: Sanjrani",
  "link": "https://www.app.com.pk/national/parliaments-role-important-for-promotion-of-democratic-values-sanjrani/",
  "date_published": "2021-06-15T08:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): Senate Chairman Muhammad Sadiq Sanjrani has said that the role of parliament is very important for the promotion of democratic values in the present era.\nPakistan made many sacrifices for the promotion of democracy, he said this while addressing an orientation workshop at the Pakistan Institute of Parliamentary Services (PIPS) to provide training to the newly elected members of the Senate on House business Rules and Regulations and Parliamentary Affairs here Tuesday.\nHe said in the modern age, there were many challenges that need to be tackled with basic information and facts.\nThe Pakistan Institute for Parliamentary Services is playing an important role in training Parliamentarians and Government Officials and solving problems by improving efficiency in the 21st century, which is the basic need of the hour.\nThe Senate chairman said that such training programs hold great importance. It is necessary to conduct such training courses for the newly elected members of the Senate and the chairmen of the committees, he said.\nPakistan Institute of Parliamentary Services is a unique institution that provides the opportunity to learn, he further said.\nHe said that extremely hardworking and experienced officers were ready to provide all kinds of guidance to the newly elected Members of the Upper House.\nSanjrani said that Parliament ass the supreme body and was the central machinery of government. Parliamentarians must have expertise in relevant matters to meet the challenges in the context of modern times.\nThe newly elected members of the Senate will be helped to improve legislation and other issues by providing information, awareness on specific administrative courses will be provided to make parliamentary services more efficient.\nHe emphasized for providing factual information to parliamentarians so that they could play their effective role in effective legislation. It is time to legislate effectively for the newly elected members, for which we need to work hard.\nSenate Chairman Sadiq Sanjrani hoped that through this training program, parliamentarians would gain effective knowledge and play their role in the country’s development through useful legislation.\nMuhammad Anwar, Executive Director PIPS while addressing the workshop said that Parliamentary affairs were the same for almost every house, but the practice was different.\nHe appreciated the active role always played by the Senate chairman for promotion of such programs.\nHe said that PIPS was making all out efforts for training and orientation of the parliamentarians.\nThe orientation session was attended by large number of newly elected senators.",
  "retrievedAt": "2025-08-11T20:50:57.471Z"
}
