{
  "title": "President for accelerated efforts to increase enrollment rates in universities",
  "link": "https://www.app.com.pk/national/president-for-boosting-efforts-to-increase-enrollment-rates-in-universities/",
  "date_published": "2021-12-22T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): President Dr Arif Alvi on Wednesday emphasised the need for accelerating efforts to increase enrollment rates in universities, particularly in Information Technology and Engineering sectors, so as to fulfill the market demand for skilled graduates.\nHe remarked that regional countries were producing a far-greater number of university graduates than Pakistan and our universities should focus on the promotion of online and distance learning to boost the number of Bachelors and Masters’ graduates in the country.\nThe President expressed these views during a meeting with the Vice-Chancellors/Rectors of federally chartered universities and degree-awarding institutions here at the Aiwan-e-Sadr.\nMinister for Federal Education and Professional Training (FE&PT) Shafqat Mahmood, Executive Director Higher Education Commission (HEC) Dr Shaista Sohail, Vice-Chancellors and Rectors of various universities attended the meeting.\nAddressing the meeting, the President urged the universities to equip their students with marketable skills by developing academia-industry linkages for enhancing the graduate employment rate in Pakistan.\nHe also called for making concerted efforts to improve the quality of virtual education through properly designed online courses, and improved content delivery and assessment methods.\nMinister for Education Shafqat Mehmood underlined the need for producing quality graduates by focusing on skills-based education, faculty development, and making investments in labs and associated educational facilities.\nThe meeting discussed various proposals for increasing the number of BS and MS graduates, besides exchanging views on HEC’s Online and Distance Learning policy and its criteria for ranking of universities.\nKeeping in view the market demand for a skilled workforce, the meeting also discussed the prospects of introducing Associate Degrees (2-year degrees) in different fields and improving the quality and standard of higher education in Pakistan.\nThe participants underscored the need for faculty development, research facilities and teacher training so as to equip them with the required skills to impart online education.",
  "retrievedAt": "2025-08-11T21:45:04.700Z"
}
