{
  "title": "FM reaffirms Pakistan’s commitment to SAARC charter",
  "link": "https://www.app.com.pk/national/fm-reaffirms-pakistans-commitment-to-saarc-charter/",
  "date_published": "2021-12-22T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): Foreign Minister Shah Mahmood Qureshi Wednesday reaffirmed Pakistan’s commitment to the principles and objectives of the SAARC Charter for the welfare of the people of the region, economic integration and regional prosperity.\nHe said Pakistan believed SAARC could provide a conducive and congenial atmosphere to build economic synergies and transform the quality of life of the people of South Asia.\nThe foreign minister received Secretary-General of South Asian Association for Regional Cooperation (SAARC) Esala Ruwan Weerakoon at the Ministry of Foreign Affairs. The Secretary General is on his first visit to Pakistan since assuming office in March 2020.\nThe foreign minister recalled the important and constructive role played by Pakistan in realizing the true potential of SAARC and making it a useful organization for regional cooperation and mutual benefit based on the principle of sovereign equality.\nHe reassured the secretary-general of Pakistan’s strong support for regional cooperation and urged him to accelerate the pace of SAARC process.\nQureshi reiterated Pakistan’s commitment for hosting the SAARC Summit when the artificial obstacles created in its way would be removed.\nExpressing condolences on the death of Priyantha Kumara, the foreign minister said that entire political leadership, religious scholars and Pakistani nation had condemned the incident and the government of Pakistan was determined to take all necessary steps to bring perpetrators to justice.\nThe SAARC secretary-general thanked the foreign minister for sharing his views on different SAARC related issues and assured to make concerted efforts to strengthen cooperation among Member States so as to realize the full potential of SAARC.",
  "retrievedAt": "2025-08-11T21:44:58.456Z"
}
