{
  "title": "Dr Faisal lauds HSA efforts to mitigate sufferings of ailing humanity",
  "link": "https://www.app.com.pk/national/dr-faisal-lauds-hsa-efforts-to-mitigate-sufferings-of-ailing-humanity/",
  "date_published": "2021-12-22T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):Special Assistant to Prime Minister on National Health Services Regulations and Coordination Dr. Faisal Sultan on Wednesday lauded the efforts of Health Services Academy (HSA) in mitigating suffering of the ailing humanity.\nDuring his visit to the HSA along with Parliamentary Secretary on National Health Services Regulations and Coordination Dr Nausheen Hamid, he also appreciated HSA Vice Chancellor for making tireless efforts for betterment of the academy.\nDr Faisal Sultan and Dr Nausheen Hamid also inaugurated the Office of Research Innovation and Commercialization (ORIC), the student affairs office, one-year diploma on Public Health Nutrition and Life Style Medicine and the graduation program on Mid Wifery.\nHe also shed light on the importance of basic and applied research, the value of innovation and commercialization during his discussion with the Director ORIC, Prof. Dr. Mubashir Hanif.\nWorld Health Organization (WHO) Representative-Somalia, Dr. Mamunur Rahman Malik was also present during the inauguration of the said offices and diploma/degree programs.\nMeanwhile the WHO Somalia Mission, which is currently on a visit to Pakistan from December 17-24, comprising Dr Mamunur Rahman Malik, Dr Mashrur Mirza, Emergency Programme Dr Shajib Hossain (Planning Officer) visited Health Services Academy (HSA).\nThe HSA representation was led by the Vice Chancellor, Dr. Shahzad Ali Khan accompanied by the Registrar, Director ORIC and other faculty members.Welcome remarks were given by Dr. Shahzad Ali Khan after the arrival of the mission at HSA.\nThe Vice Chancellor also explored the possibilities of collaboration on short and long-term training and capacity building of Somali students on public health and emergency preparedness and he also gave a brief on different courses offered at the HSA like Family Practice Approach including AMR; Primary Health Care; Health Economics.",
  "retrievedAt": "2025-08-11T21:45:02.600Z"
}
