{
  "title": "Speakers call for bridging gap between policy makers, stakeholders to fully tap potential of CPEC",
  "link": "https://www.app.com.pk/national/speakers-call-for-bridging-gap-between-policy-makers-stakeholders-to-fully-tap-potential-of-cpec/",
  "date_published": "2021-12-22T13:25:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 22 (APP):The speakers in a meeting of “1st National Network of Economic Think Tanks” Wednesday called for bridging gap between policy makers and stakeholders to fully tap the business and trade potential from China Pakistan Economic Corridor (CPEC) project and Pak Afghan Transit trade by facilitating investors and business community.\nThe think tanks from different sectors, said the government should facilitate investors and the business community in the wake of CPEC and Pak-Afghan Transit Trade projects to boost the national economy.\nThe meeting was organized by SDPI a non-governmental organization here at Khyber Pakhtunkhwa Board of Investment and Trade (KP-BOIT) wherein all stakeholders including representatives of chamber of commerce and industries, academicians, government officials and media persons were present.\nAddressing the meeting, Hassan Daud Butt, CEO KPBOIT said that there should be consistency in economic policies, digitalization of the national economy and archiving structure for informed decisions.\nHe said that a research based economic policy should be implemented in the country and for the purpose universities and youth should be mobilized to do research from time to time and suggest the missing facilities and loopholes for the policy makers to play role in the decision making process.\nVice Chancellor University of Science and Technology, Bannu Dr Khizar ur Zaman called for setting priorities and developing linkages between universities and trade bodies to find new vistas of investment and trade.\nHe said that CPEC and Afghan transit trade have opened new avenues of business and investment for Pakistan and foreign and local investors are keen to invest here. He suggested that leadership of all stakeholders should have to sit together and find out ways and means about how to facilitate investor and business community.\nJoint Executive Director Dr Vaqar Ahmed said that this network brings together economic think tanks from all provinces of Pakistan with the single objective of discussing and brainstorming regulatory ease of doing business.\nHe said for the first time federal and KP government have shown openness to discuss measures for ease of doing business which shows their seriousness to facilitate investors and entrepreneurs.\nHe said the idea of the meeting is to really discuss sub-provincial business reforms and steps to move forward with district-level or city-level business reforms strategies, adding that the last three years have seen a plethora of city level taxes, charges, levies, and other forms of payments which increase cost of doing business in KP.\nHe said different districts of KP have different business potentials, some are being benefited from Afghan transit trade, some have vast potential accruing from mines and minerals and some are ready for livestock revolution.\nBut the real challenge is to facilitate the new investors and facilitate them in doing business without any difficult, he said and added that evidence informs that the certain barriers can be addressed by legislative, regulatory and policy actions.\nDeputy Collector KP Revenue Department Fazal Amin Shah said the government reduced the rate of different taxes in the province to facilitate the entrepreneurs and investors.\nHe told the participants of the meeting that during Covid-19 pandemic the KP government collected Rs 22 billion revenue which was ample proof businessfriendly policies.\nHe assured to convey the suggestions of the meeting to the government for incorporation in the decision making process and also assured consultation of the business community in the provincial budget.\nExecutive Member Peshawar Chamber of Small Traders and Industry Adnan Jalil said that the energy crisis was adversely affecting the overall economic growth.\nHe suggested that industrialists should be given cheap plots in new industrial zones with all the facilities and youth should be encouraged to come forward and invest in new sectors.\nEx-Senior Vice President Sarhad Chamber of Commerce and Industry Haris Mufti suggested the government to develop linkages among stakeholders and facilitate the investors and entrepreneurs.\nHe said that Khyber Pakhtunkhwa Economic Zones Development and Management Company (KPEZDMC) should focus on provision of facilities in already developed industrial areas instead of giving more attention to new industrial zones where no facilities are available.\nHe suggested that the business community should be educated about new taxes and banking channels and new policies from time to time.\nAbdul Qadoos Khan, a senior journalist suggested that the revenue earned from oil and gas sectors should be equally spent on development of local people and they should be given opportunities.",
  "retrievedAt": "2025-08-11T21:45:01.097Z"
}
