{
  "title": "ANF recovers 921 kg narcotics; arrests 20 in various operations",
  "link": "https://www.app.com.pk/national/anf-recovers-921-kg-narcotics-arrests-20-in-various-operations/",
  "date_published": "2022-10-02T07:32:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Oct 02 (APP): Anti-Narcotics Force (ANF) while conducting raids in different areas of the country, managed to recover over 921 kg narcotics and arrested 20 drug smugglers during last two weeks.\nThe ANF spokesman told on Sunday that while conducting raid on Sunday near Angoor Adda at Pak-Afghan border, the ANF managed to recover nearly 23 kg charras concealed in bushes.\nThe spokesman informed that in other operation, the ANF recovered nearly 900 kg narcotics and arrested 20 accused.\nIn another operation, it recovered 6,505 grams heroin tactfully concealed in trolley bag at Bacha Khan International Airport and arrested a passenger going to Malaysia.\nThe ANF Lahore in an operation near Kala Shah Kaku Interchange, recovered 36 kg charras and 26.400 kg opium from a vehicle. A drug smuggler was also arrested on the spot.\nIn a raid, the ANF Karachi recovered Ice drug tactfully concealed in 16 books being sent to Australia through a courier company.\nThe ANF Rawalpindi in an operation at Islamabad International Airport recovered 45 Ice and heroin filled capsules weighing 360 grams, from the possession of a passenger, going to Doha.\nThe ANF Peshawar recovered 132 kg charras and 43.200 kg opium besides netting an accused.\nIn another raid conducted on Islamabad Expressway, ANF seized 1200 grams charras and 1000 grams Ice from the possession of two accused.\nThe ANF also recovered 1200 grams charras and 300 grams Ice drug from the possession of two drug smugglers including a woman, netted during the operation near Faizabad Bus Stop area.\nThe ANF Balochistan in an operation conducted a raid near Gaddani Mor, RCD Highway at Hub and foiling a drug smuggling bid from Balochistan to Sindh recovered over 345 kg charras, concealed in secret cavities of a pick-up. ANF also arrested two accused during the operation.\nIn an operation at Islamabad International Airport, the ANF recovered 114 charras-filled capsules, weighing 734 grams and 10 Ice-filled capsules weighing 69 grams from the possession of passenger, going to Abu Dhabi.\nThe Anti-Narcotics Force in an operation conducted a raid near Islamabad Motorway Toll Plaza and recovered over 52.600 kg narcotics including 45.60 kg charras, four kg heroin and 3.600 kg opium, concealed in secret cavities of two cars. The ANF also arrested three accused during the operation.\nAccording to ANF spokesman, the force managed to recover 110 charras-filled capsules, weighing 636 grams from the possession of an accused at Islamabad International Airport. The accused was going to Bahrain, he added.\nIn another raid, the ANF Karachi recovered 1840 grams heroin form a parcel booked for Canada at a courier company.\nIn an operation on main Korangi Road Karachi, the ANF recovered 252 kg charras tactfully concealed in secret cavities of three cars. The ANF team also arrested four accused during the operation.\nHe informed that separate cases have been registered against the accused. The spokesman said that accomplices of the accused would also be sent behind the bars.",
  "retrievedAt": "2025-08-11T15:40:02.852Z"
}
