{
  "title": "Germany enhances financial support to €56 million for flood victims",
  "link": "https://www.app.com.pk/national/germany-enhances-financial-support-to-e56-million-for-flood-victims/",
  "date_published": "2022-10-02T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 2 (APP):German Ambassador to Pakistan Alfred Grannas has announced that Germany scaled up financial assistance to €56 million for families affected by floods.\nIn his tweet, the German Ambassador said the aid was increased to help families and deal with the devastating effects of recent flooding, adding, “We will continue to stand by the brave people of Pakistan and extend our help and support during this tragic time.”\nThe aid will supply food, hygiene products, medical supplies, etc., to the flood victims in Pakistan.\n“Our thoughts are with the victims’ families, as expressed by President Frank-Walter Steinmeier and federal chancellor Olaf Scholz in their letters of condolences to their respected counterparts.\nFederal Minister Svenja Schulze held a video conference with the minister for climate change Sherry Rehman, on 7 September, he added.\nHe said that the homeless would be able to return to their home regions as quickly as possible.\nPakistan has asked for international help, and Germany is coordinating its support towards Pakistan with other donors.\nIt is pertinent to mention that several projects of bilateral support for Pakistan have been implemented already, e.g., for Baluchistan, or announced. In close cooperation with the government of Pakistan, Germany has expedited its short-term humanitarian assistance and middle-and long-term cooperation for Pakistan in this difficult situation.\nThe total amount of German support for Pakistan currently adds up to approx. € 56m.The ministries in charge are in close contact with their Pakistani partner institutions.\nGermany will continue to cooperate closely with Pakistan in addressing the devastating effects of climate change.",
  "retrievedAt": "2025-08-11T15:39:59.496Z"
}
