{
  "title": "Pakistan’s ties with Belgium, EU, NATO further strengthened by COAS visit: Envoy",
  "link": "https://www.app.com.pk/national/pakistans-ties-with-belgium-eu-nato-further-strengthened-by-coas-visit-envoy-2/",
  "date_published": "2022-02-25T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP):Pakistan’s Ambassador to Belgium Zaheer A Janjua on Friday underscored that recent high-level engagements in Brussels, including visit of Chief of Army Staff (COAS) General Qamar Javed Bajwa, contributed to further strengthening of the country’s bilateral relations with Belgium, EU and NATO. He highlighted that the host authorities expressed gratitude for the key role played by Pakistan in evacuation operations from Afghanistan.\nAmbassador Janjua expressed these views during the 14th Khuli Katchery organized by the embassy in a virtual format with the Pakistani diaspora in Belgium and Luxembourg.\nHe briefed the participants about the continued efforts of the Mission to provide efficient and seamless services to the community, a press release issued by Pakistan Embassy in Brussels on Friday said. The Ambassador of Pakistan to the European Union, Belgium, and Luxembourg appreciated the diaspora’s active participation to commemorate Kashmir Solidarity Day on February 5.\nHe emphasized that Pakistan would continue to extend political, diplomatic and moral support to the people of Jammu and Kashmir for achieving their right to self-determination guaranteed by the United Nations Security Council.\nHe encouraged the community members to be the voice of innocent Kashmiris across the world and expose Indian atrocities in the Illegally Occupied Jammu and Kashmir to trigger a strong international response.\nThe ambassador expressed satisfaction on&nbsp;the&nbsp;revised policy of the government for inbound passengers with effect from February 24, particularly the abolition of pre-boarding negative PCR test requirement for fully vaccinated inbound travellers and exemption from mandatory vaccination for&nbsp;passengers between 12-18 years till March 31.\nHe, however, encouraged the community members to exercise due caution. The ambassador announced that due to the relaxation of COVID-19 restrictions by the local authorities, the National Day ceremony on March&nbsp;23 would be held physically at the Chancery.\nHe invited&nbsp;the&nbsp;community members to participate in the ceremony with their family members.&nbsp; The monthly interaction with the Pakistani diaspora was organized in accordance with the vision of Prime Minister Imran Khan and in line with the embassy’s efforts to ensure efficient and smooth service delivery to the Pakistani diaspora.\nThe virtual interaction was attended by diaspora members from different walks of life.\nThe community members conveyed their complete satisfaction with the services provided by the embassy. They praised the ease of access and the forthcoming attitude of the embassy to resolve the problems faced by the members of the Pakistani community in Belgium and the Luxembourg.",
  "retrievedAt": "2025-08-11T14:24:34.021Z"
}
