{
  "title": "President for paradigm shift in education sector to cope with modern era challenges",
  "link": "https://www.app.com.pk/national/president-for-paradigm-shift-in-education-sector-to-cope-with-modern-era-challenges/",
  "date_published": "2022-02-25T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP): President Dr. Arif Alvi on Friday called for a paradigm shift in the education sector to promote cutting-edge research and online mode of learning in the country.\nHe underlined the need for preparing the nation in the field of emerging technologies, particularly Artificial Intelligence, Cyber Security, Data Analytics, Cloud Computing, Robotics and Automation to cope with the challenges of the modern era.\nThe President expressed these views during a briefing on the National University of Science and Technology (NUST), Islamabad here at Aiwan-e-Sadr, today.\nRector NUST Lt. Gen. ® Engr. Javed Mahmood Bukhari briefed the President about the contributions of his institution in providing quality science and engineering education.\nHe highlighted that NUST had established a first of its kind inter-disciplinary research facility in Pakistan to equip the next generation of researchers with cross-disciplinary expertise and create new knowledge and technologies.\nHe added that NUST, which had been developed into a multidisciplinary university, was offering education in various disciplines such as Information Technology, Social Sciences and Humanities, and Arts, Design & Architecture.\nHe apprised that the university had planned to offer two of its programs – MS Engineering Management and MS Peace and Conflict Studies – through the online mode of education.\nIt was further informed that the university was catering to the professional needs of the country by offering flagship courses and trainings in Cyber Security, Data Analytics, Cloud Computing, Artificial Intelligence, Finance, Management, and Marketing.\nAddressing the meeting, the President said that it was imperative to promote and encourage the online mode of education for increasing the number of graduates to meet the rising demands of the market.\nHe urged the universities to focus on skill development of students, particularly in the IT sector, to enhance the country’s exports besides meeting the growing demand of IT professionals in the global market.\nHe lauded the establishment of the National Science and Technology Park at NUST, saying that such projects needed to be replicated to promote innovation-led growth and attract foreign investment from Hi-tech companies in the country’s IT sector.\nThe President appreciated the efforts of the university’s management to improve the quality of science education in different disciplines of IT and Engineering.",
  "retrievedAt": "2025-08-11T14:24:43.195Z"
}
