{
  "title": "20 years after Gujarat Riots: Modi pushes India to brink of Muslim genocide",
  "link": "https://www.app.com.pk/national/2002-gujarat-riots-blood-stained-modi-stays-on-course-to-muslim-genocide/",
  "date_published": "2022-02-25T15:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP): Two decades after the Gujarat riots which killed 790 Muslims in 2002, India continues on the deadly path of Muslim genocide under the patronage of Narendra Modi, the flag bearer of Hindu supremacy.\nThe riots were triggered with the burning of a Sabarmati Express train in Godhra on February 27, 2002, which carried the Hindu pilgrims while returning to Ahmedabad from Ayodhya, a holy site disputed between Muslims and Hindus.\nIt is estimated that 230 mosques and 274 shrines were destroyed during the Gujarat riots. For the first time in the history of communal riots, the Hindu women also took part, looting Muslim shops.\nThe post-independence India has a long history of communal massacres including Nellie in 1983, Delhi in 1984, Bhagalpur in 1989, and Bombay in 1992–93 but the Gujarat carnage stands out.  In a series of incidents, not only the Muslims were killed but the women and children were also made subject to rapes and vicious forms of violence.\nSince the 2002 riots, the Bharatiya Janata Party had constantly been patronising the Hindu fanatics. Particularly after Modi’s becoming the prime minister, the ideology of the Hindu supremacy is being pursued through drastic systemic discrimination and pieces of legislation to marginalize the non-Hindu communities.\nAs a common practice, the Muslims were blamed for the Gujarat tragedy, but later it was revealed to have been planned and executed by Bajrang Dal.\nSince 1998, the BJP is in power there and out of these 22 years, Narendra Modi remained Gujarat’s chief minister for 13 years from 2001 to 2014, till his election as the prime minister. The Gujarat riots took place just four months after Modi assumed power as chief minister in October 2001.\nHaving a mindset of Hindutva ideology, Modi used the train incident as an excuse to punish Muslims and initiate cold-blooded genocide of Muslims.\nAfter 2002, the Hindu extremists started campaigns against Muslims under Modi’s patronage which strengthened Hindu extremism politically, socially and culturally.\nFollowing the massacre, even former Indian PM and Modi’s mentor Atal Bihari Vajpaee also once asked him to at least offer a resignation but nothing could change Modi, also known as the “Butcher of Gujarat.”\nIn 2008, an inquiry commission termed the train burning a “conspiracy” and Modi’s failure to halt the violence who indirectly encouraged some of the Hindu rioters.\nZakia Jafri, the wife of late Congress leader Ehsan Jafri, who was killed at Gulberg Society in Ahmedabad on February 28, 2002, claimed that Gujarat riots were carried out through a “design” calling Narendra Modi responsible for the bloodshed.\nOn January 28, 2020, the Indian Supreme Court granted bail to 14 criminals involved in the Gujarat massacres of 2002 which also raised questions on the role of the Indian judiciary.\nThe 2002 anti-Muslim pogrom in Gujarat also coincided with violence in IIOJK and can be termed as its refined form, where Indian military forces have resorted to a systematic ethnic cleansing of the Muslim majority population.\nIn January, Prof Gregory H Stanton declared a Genocide Emergency Alert for India stating that the country had reached the 8th stage of genocide with the persecution of the Muslim community.\nProf Stanton is the architect of the “10 stages of genocide” theory and also the founder of Genocide Watch, a non-profit organisation that works to predict and prevent genocide and all other forms of mass murder.\nHe said that India was just one step away from conducting extermination and Prime Minister Narendra Modi “will be very happy to watch it happen”.\nCriticising Modi over his link with Hindu extremist group, Rashtriya Swayamsevak Sangh (RSS), Prof stanton said, “RSS is filled with hate ever since it was founded, it is basically a Nazi organization, and in fact, it admired Hitler.”\nBrad Adams, Asia director at Human Rights Watch commented, “The incidents of state-sponsored ethnic cleansing show the extreme vulnerability of religious minorities in different parts of India”.\nRecently, a group of powerful Kuwaiti parliamentarians have demanded the government of Kuwait to put an immediate ban on the entry of any member of the ruling BJP of India into Kuwait. “We can’t sit back and watch Muslim girls being publicly persecuted,” they said.\nModi is hell-bent on obliterating Muslims from the land of Kashmir. The observers had called such events meeting the “legal definition of genocide,” or referred to them as state terrorism or ethnic cleansing.\nNow as Modi is holding the chair of prime minister, he as well as his cronies continue to promote Hindutva ideology through systemic discriminations, public speeches as well as social media and other tools.\nEven as the Muslims observe the anniversary of the Gujarat riots, the RSS goons continue to share the posts on social media targeting and provoking violence against Muslims.\nInstead of apprehending the elements disturbing the Indian social fabric, the Modi regime continues to promulgate the laws to marginalize the non-Hindu communities.",
  "retrievedAt": "2025-08-11T14:24:34.367Z"
}
