{
  "title": "US expands visa interview waiver eligibility for Pakistani citizens",
  "link": "https://www.app.com.pk/national/us-expands-visa-interview-waiver-eligibility-for-pakistani-citizens/",
  "date_published": "2023-01-12T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): The United States Mission in Pakistan has announced the expansion of interview waiver eligibility at the U.S. Embassy in Islamabad and the U.S. Consulate General in Karachi for Pakistani citizens who are renewing B1/B2 tourist and business visas.\n“All Pakistani citizens, regardless of age, whose B1/B2 visas are valid or have expired within the last 48 months are eligible to participate,” said a news release from the embassy of the US in Pakistan on Thursday.\nPreviously, only Pakistani citizens of ages 45 and older were eligible to participate. Additionally, interview waiver eligibility for student and petition-based work visa applicants who have previously held a U.S. visa is also extended through 2023.\nThe expansion of interview waiver eligibility is a procedural change to provide better customer service and more efficiently process renewals of tourist and business visas for qualified and eligible Pakistani citizens.\nAs required by U.S. law, some eligible visa holders may be required to appear at the U.S. Embassy or U.S. Consulate General for interviews after submission of their applications.\nApplicants can also visit the website at https://www.ustraveldocs.com/pk/pk-niv-visarenew.asp to determine their eligibility for an interview waiver.\nAs per the US embassy, the applicants who are now eligible for the interview waiver, but are currently scheduled for an interview, may cancel their appointment online, start from ‘New Application’ on the scheduling dashboard, and follow the steps online for submitting through the interview waiver.\nThe applicants are advised to approach only authorized courier service locations for interview waiver submissions: https://ustraveldocs.com/pk/pk-loc-documentdropoff.asp. The average processing time will be four weeks.\nThe applicants are advised to visit https://www.ustraveldocs.com/pk/pk-gen-faq.asp for further details and queries.",
  "retrievedAt": "2025-08-11T05:43:39.427Z"
}
