{
  "title": "Smog may go with current wet spell, but only after infecting thousands",
  "link": "https://www.app.com.pk/national/smog-may-go-with-current-wet-spell-but-only-after-infecting-thousands/",
  "date_published": "2023-01-12T13:07:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 12 (APP): After a long dry spell, the current smoggy conditions may subside with the ongoing wet spell, which is likely to continue till Friday, and are expected to be eliminated completely with two other rainy spells during the current month, though thousands of people have already contracted lungs and respiratory-system related diseases due to the environmental pollution in the province.\nAll the major government and private hospitals of the city faced huge burden of patients with lung and throat related diseases lately, but overall scenario remained under control during the November-January period, as compared to the last years, due to aggressive anti-smog campaign, initiated by the Environment Protection Department and other institutions on the orders of the Lahore High Court.\nThe Air Quality Index in the provincial capital could not cross 455 value and the AQI of the city was recorded 333 on Wednesday, and 298 on Thursday after a drizzle, which had reached 455 (PM2.5) on December 30, 2022, as per the details given by the control room, established in the Environment Protection Department.\nThe Services Institute of Medical Sciences, Sir Gangaram Hospital, Mayo Hospital, Mian Munshi Hospital, Fatima Memorial Hospital, Ittefaq Hospital, Shalamar Hospital and other government and private hospitals of the city received hundreds of patients with respiratory and lung diseases during this season, November to January, mostly were children and elderly people, sources told APP.\nLocal health experts said that the size of particles was directly linked to their potential for causing health problems. Small particles less than 10 micrometers in diameter pose the greatest problems, because they can go deep into lungs and some may even get into bloodstream.\n“Exposure to such particles can affect both lungs and heart,” said Dr Adnan-ul-Qamar, Medical Superintendent Mian Munshi Hospital, while talking to APP.\nHe said numerous scientific studies had linked particle pollution exposure to a variety of problems, including premature death in people with heart or lung disease, nonfatal heart attacks, irregular heartbeat, aggravated asthma, decreased lungs function, increased respiratory symptoms, such as irritation of the airways, coughing or difficulty in breathing.\nHe said that people with heart or lung diseases, children and older adults were most likely to be affected by the particle pollution exposure and they should remain indoors during the smoggy season. He said that major effects of air pollution on human and animals health were respiratory diseases and eye irritation and reduced visibility, etc.\nThe pollution also results in loss of vegetation, damage to material, heritage and monuments, and affects the growth of plants. He said that collaborative efforts were need of the hour to reduce the chances of all such damages.\nThe measure taken by different departments on the LHC orders, including closure of schools for three days in a week in Lahore, extension in winter holidays period of secondary and higher education institutions by one week, closure of all markets and restaurants in the provincial capital by 10 pm on weekdays, helped reduce toxic levels of air pollution and smog in the city.\nExperts said measures should also be taken in the city suburbs, which also struggle to breathe easy every winter as cold temperatures and calm winds trap pollutants closer to the ground.\nTalking to APP, Provincial Disaster Management Authority (PDMA) Punjab spokesman Tasawar Chaudhry said that after the Lahore High Court orders, the provincial authority has planned establishing a control room besides installing CCTV cameras to monitor smog and pollution level in the city.\nHe said that November and December are the worst months as far as smog is concerned, but after a long prevailing dry spell, the Air Quality Index of the city has not much improved. He hoped that after two to three wet spells, the smoggy conditions would eliminate completely by the end of the current month.\nNaseem-ur-Rehman, head of Special Smog Squad, Environment Protection Department Punjab, said that as per World Health Organisation (WHO) data, almost entire global population (99%) breathes air that exceeds the WHO air quality minimum levels.\nThe main causes of air pollution are vehicular emissions, industrial emissions and dust fall, which should be focused. He said the EPD has taken various measures to reduce pollution especially in urban centres.\nHe advised citizen to keep their vehicles in good condition, prefer 4-stroke engine vehicles, use CNG as fuel, limit the industrial effluents as per Punjab Environmental Quality Standards (PEQS), do not establish industrial units within the residential areas, apply 3R formula i.e. Reduce, Reuse, Recycle, grow as many trees as possible.\nDr Muhammad Younas Zahid, Deputy Director EPD, said that the department had set up eight special squads in big districts to overcome the smog issue.\nIn 2022, a number of aggressive measure had been taken including sealing of pollution causing industries and imposing fine on them. He said that vehicular traffic emissions contribute to around 43 per cent of pollution.\nSources in the EPA revealed that a number of furnaces and other industrial units in several areas in and around the city were still operating at night and using sub-standard fuel, such as rubber tyres, plastic and other materials, while many other units in different industrial estates in the city were also contributing to rising air pollution.\nSources said that a half-hearted campaign was started against smoke-emitting vehicles and the EPA’s claims of using safe city cameras to take action against smoke-emitting vehicles had proved to be only a media statement.\nThe EPD has so far also failed to install permanent monitors in main city localities to calculate/ monitor the PM2.5 in air quality.\nInsiders said that the EPD has only one mobile van, which can monitor the level of PM 2.5 while the rest of its eight fixed stations in the provincial metropolis were either non-functional or were not able to detect PM 2.5.\nAs per the World Health Organisation’s key findings, given on its website, every day around 93pc of the world’s children under the age of 15 years (1.8 billion children) breathe the air which is so polluted that it puts their health and development at serious risk.\nSadly, many of them die later on. The WHO estimates that in 2016, six lakh children died from acute lower respiratory infections, caused by polluted air.\nIt revealed that when pregnant women are exposed to polluted air, they are more likely to give birth prematurely, and have small, low birth-weight children.\nAir pollution also impacts neuro-development and cognitive ability and can trigger asthma, and childhood cancer.\nChildren, who have been exposed to high levels of air pollution, may be at greater risk for chronic health complications such as cardiovascular disease, later in their lives.",
  "retrievedAt": "2025-08-11T05:43:34.902Z"
}
