{
  "title": "PML-N given two months’ time to hold intra-party elections",
  "link": "https://www.app.com.pk/national/pml-n-given-two-months-time-to-hold-intra-party-elections/",
  "date_published": "2023-01-12T08:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): The Election Commission of Pakistan (ECP) on Thursday granted reprieve for two months to Pakistan Muslim League-Nawaz (PML-N) for holding intra-party elections.\nA five-member Commission, headed by Chief Election Commissioner (CEC) Sikandar Sultan Raja, resumed the hearing of the case regarding the intra-party elections of the political parties and directed the PML-N leadership to hold intra party elections by March 14 after hearing arguments from the lawyer of the political party.\nThe ECP then adjourned the hearing of the case until March 14.\nThe PML-N counsel said the intra-party polls were delayed due to some unavoidable circumstances as elections could not be held as the PML-N President and Secretary General had gone abroad. PML-N Secretary General Ahsan Iqbal would return to Pakistan from Geneva by Jan 14, adding that the Party was planning to hold elections on January 31.\nECP Punjab Member Babar Bharwana remarked the electoral symbol of the Party would be withdrawn if elections were not held by Jan 31.\nThe CEC remarked that the electoral body could grant more time, if valid reasons were submitted. He also remarked that PML-N should hold intra-party polls.\nThe ECP on January 5, had given the PML-N a week to hold intra-party elections with the warning that the election symbol allotted to the Party would be withdrawn.\nAs per the record, the intra-party election in the PML-N was due by March 22 last year.\nThe Section 209 of the Elections Act, 2017 says, “Certification by the political party; (1) A political party shall, within seven days from completion of the intra-party elections, submit a certificate signed by an office-bearer authorized by the Party head, to the commission to the effect that the elections were held in accordance with the constitution of the political party and this act to elect the office-bearers at the federal, provincial and local levels, wherever applicable.”\nWhereas, Sections 215 (4) of the Act state, “Where a political party or combination of political parties, severally or collectively, fails to comply with the provision of Section 209 or Section 210, the commission shall issue to such political party or parties a notice to show cause as to why it or they may not be declared ineligible to obtain an election symbol.”\nMoreover, Section 215 (5) of the act reads, “If a political party or parties to whom show cause notice has been issued under Sub-section 4 fails to comply with the provision of Section 209 or Section 210, the Commission may after affording it or them an opportunity of being heard, declare it or them ineligible to obtain an election symbol for election to the Parliament, provincial assembly or a local government, and the Commission shall not allocate an election symbol to such political party or combination of political parties in subsequent election.”",
  "retrievedAt": "2025-08-11T05:43:37.181Z"
}
