{
  "title": "Alvi assures Mahmoud Abbas of Pakistan’s continued support for Palestine cause",
  "link": "https://www.app.com.pk/national/alvi-assures-mahmoud-abbas-of-pakistans-continued-support-for-palestine-cause/",
  "date_published": "2023-11-10T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): President Dr Arif Alvi on Friday telephoned President of Palestine, Mahmoud Abbas and assured Pakistan’s continued support for resolving the Palestinian dispute in accordance with the relevant resolutions of the United Nations Security Council (UNSC).\nThe president expressed his heartfelt sympathies and grief on behalf of the people and government of Pakistan over the atrocities being committed by Israel against people of Palestine.\nHe deplored the situation in Gaza, terming it “very painful” and said that the entire Pakistani nation was deeply saddened by the brutalities and reign of terror unleashed by the Israeli security forces.\nHe strongly condemned the lethal bombing by Israel which even did not spare schools and hospitals.\nThe barbaric actions, he said, resulted in killing of thousands of Palestinians including women and children, healthcare workers, journalists and UN aid workers.\nThe president said the current situation in Gaza was the reaction of decades of apartheid and unjust policies of Israel. He condemned Israel for ethnic cleansing against the Muslims and pushing them out of their territories.\nPresident Alvi regretted the lack of action on part of the international community to stop Israel from its murderous campaign against the people of Gaza.\nHe urged the international community to make efforts for urgent ceasefire, opening of unhindered humanitarian corridor to Gaza, stopping further displacement of the Palestinians from their homeland and permanent solution to the Palestinian dispute in accordance with the UNSC resolutions.\nPalestinian President Mehmood Abbas said that Israel was committing genocide in Gaza. He called for stopping Israel from fighting across the Palestinian territory.\nHe also demanded opening of a corridor to Gaza to ensure the delivery of humanitarian assistance as there was no food, medicine and electricity available for the people of Gaza.\nPresident Mahmoud Abbas thanked Pakistan for supporting the Palestinian cause and sending humanitarian assistance.",
  "retrievedAt": "2025-08-11T10:27:27.082Z"
}
