{
  "title": "PM congratulates Pakistani teacher Sister Zeph for winning Global Teacher Prize",
  "link": "https://www.app.com.pk/national/pm-congratulates-sister-zeph-for-winning-global-teacher-prize/",
  "date_published": "2023-11-10T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday congratulated Pakistani teacher Sister Zeph on winning the Global Teacher Prize 2023, calling it a “great moment of pride” for Pakistan.\n“A great moment of pride for Pakistan. Our very own sister Zeph has won the Global Teacher Prize 2023,” the prime minister wrote on social media platform X.\nHe said education was a subject really close to his heart as only education could uplift the people to achieve laurels for themselves and their country besides making them better citizens.\n“I once again congratulate Sister Zeph on this remarkable achievement,” he remarked.\nA great moment of pride for Pakistan. Our very own sister Zeph has won the Global Teacher Prize 2023. Education is a subject really close to my heart. I believe only education can uplift the people to achieve laurels for themselves and their country and can make them better… https://t.co/U4Hpt4UY77\n— Anwaar ul Haq Kakar (@anwaar_kakar) November 10, 2023\nSister Zeph founded her own school for underprivileged children in the courtyard of her home at just 13, while studying at night for her own education.\nShe was lauded as “a true change-maker and advocate for women’s rights and children’s education”.\n“Varkey Foundation Global Teacher Prize 2023” is organised in collaboration with UNESCO and in strategic partnership with Dubai Cares, a UAE-based global philanthropic organisation. Now in its eighth year, the US$1 million award is the largest prize of its kind.\nSister Zeph’s win was announced at the Unesco headquarters in Paris, France. There were more than 7,000 nominations and applications from 130 countries.\nSister Zeph also met President Macron of France. Welcoming Sister Zeph, the winner of the Varkey Foundation Global Teacher Prize 2023 , President Macron of France said,\nHe said “I would like to offer a very special greeting to Sister Zeph, who we welcome among us this evening as the winner of the Global Teacher Prize, which she received yesterday at UNESCO. At the age of 13, Sister Zeph, dissatisfied and mistreated in class, founded her own school in her native village in Pakistan, and despite the difficulties she encountered along the way, notably for wanting to educate girls in the same way as boys, today leads a foundation which offers free, quality education to more than 200 children. And it is the same fight that you carry that we carry for the African continent in many countries which are today also affected by terrorism and divisions. The education of young girls remains key for us.”",
  "retrievedAt": "2025-08-11T10:27:26.553Z"
}
