{
  "title": "CM reviews law & order, progress on uplift projects in Mianwali",
  "link": "https://www.app.com.pk/national/cm-reviews-law-order-progress-on-uplift-projects-in-mianwali/",
  "date_published": "2020-01-04T01:03:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 04 (APP):Punjab Chief Minister Sardar Usman Buzdar Saturday visited Mianwali where he presided over a meeting at the Police Lines about law & order situation and got briefing on development schemes in the district.\nThe chief minister directed the authorities concerned for timely completion of development schemes and reiterated that he was monitoring the uplift projects in far-flung areas and conducting field visits, said a handout issued here.\nHe expressed satisfaction over performance of the district administration and ordered the officers to work hard for public service, adding that action should be initiated against the elements involved in artificial price hike.\nHe directed the administrative officers to keep a vigilant eye on the prices of essential items and action should be initiated against hoarders and illegal profiteers.\nUsman Buzdar said that campaign should continue against absconders and complainants should be treated gently in the police stations. He hoped that the establishment of model police stations would prove fruitful in changing archaic police culture in Mianwali.\nAmjad Ali Khan Niazi, MNA, Provincial Assembly Members Aminullah Khan and Malik Ahmed Khan Bhachar were also present on the occasion.\nTalking to the assembly members after inauguration of model police station, the chief minister said that at least one model police station was being established in every district. The initiative was a step towards changing police culture, he added.\nThe chief minister said to improve police performance, monitoring and control rooms have also been set up in model police stations. Similarly, carpeted non-smoking lockups have been established along with the facility of washrooms, he added. Along with it, CCTV cameras have also been installed to monitor the investigation process.\nLater, CM Usman Buzdar visited various areas of the city and inspected cleanliness arrangements. He also paid a surprise visit to Police Station Wan Bachran and inspected its various sections as well as the official record.",
  "retrievedAt": "2025-08-11T18:34:19.536Z"
}
