{
  "title": "PM inaugurates Model Police Station Attock",
  "link": "https://www.app.com.pk/national/pm-inaugurates-model-police-station-attock/",
  "date_published": "2020-01-04T11:15:00.000Z",
  "source": "APP",
  "content": "ATTOCK, Jan 04 (APP):Prime Minister Imran Khan inaugurated Model Police Station Attock along with 28 other police stations of the Punjab through video link. The Police Station will have all modern facilities.\nOn this occasion, MPA Jamshed Altaf , Deputy Commissioner Attock Ali Anan Qamar, District Police Officer Attock Syed Shahzad Nadeem Bokhari, PRO Police Taimoor Alizai and other police officers were also present.\nAfter the video link inauguration by Prime Minister, District Police Officer Syed Shahzad Nadeem Bokhari told newsmen that the purpose of establishing Model Police stations is to ensure provision of quick relief to the citizens and to get rid of “Thana Culture”.\nThese Police Stations will also strengthen trust between public and the police, he expressed and said that in police department, police stations have a fundamental and vital role and steps are being taken to improve the working of all the police stations. He said that front desks were being set up at all the police stations to redress the grievances of the people, open door policy is being followed and the doors of his office are always open for the people.\nBokhari said, special initiatives being taken to restore the confidence and trust of the people in police. While talking about the newly inaugurated Model Police Station, he said that this has been done as per the vision of Prime Minister and IGP Shoaib Dastagir, adding that this police station will use modern technology, will have waiting room and front desk counters, Dispute Resolution Committee Hall, CCTV cameras and other facilities to serve the visiting citizens.\nIt is worth mentioning that 50 police stations will be converted into Model Police Stations and in the first phase, 29 police stations including Attock city have been made Model Police Stations today.",
  "retrievedAt": "2025-08-11T18:34:14.612Z"
}
