{
  "title": "Qasim Suri urges nation to remember deprived segments of society on Eid",
  "link": "https://www.app.com.pk/national/qasim-suri-urges-nation-to-remember-deprived-segments-of-society-on-eid/",
  "date_published": "2020-05-18T00:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP):Deputy Speaker of the National Assembly Qasim Suri Monday urged that the affluent section to help the country’s distressed people in this time of coronavirus crisis and not to forget those who were deprived in this Eid.\nTalking to a private news channel, Qasim Suri called upon the affluent class to remember their poor relatives and neighbors on the auspicious day of Eid and help them generously.\nHe asked the people and opposition to shun their differences and forgive each other’s mistakes during the holy month of Ramazan and the advent of the Eid.\nHe also emphasised that the citizens should obey the government’s set of laws for COVID-19 and stay home to stop the spread of the virus as government has to maintain a balance between economic activities and preventive measures against coronavirus pandemic.\nHe explained the situation that all over the world people were going for smart lockdown and we have to learn to live with COVID-19 pandemic because there was no vaccine available right now.\nThe pandemic has adversely affected the global economy and the developing country like Pakistan cannot afford complete lockdown for indefinite period of time, he mentioned.\nUnfortunately Industry, trade, export and small scale businesses have been ceased due to coronavirus outbreak, he said, adding, it was imperative to start economic activities for revival of economy.\nPrime Minister Imran Khan has allowed reopening transportation to facilitate the masses however this permission was conditioned with adaptation of standard operating procedure.\nIt was citizens’s social and moral responsibility to observe all precautionary measures including wearing of masks and observing social distancing.\nIt was high time to motivate youth to play their active role to sensitize the people and contain the spread of Covid-19, he added.\nHe appealed to the people to adapt all precautionary measures and SOP to stay safe.",
  "retrievedAt": "2025-08-11T19:13:54.822Z"
}
