{
  "title": "Amin asks tiger force volunteers to create awareness on COVID-19",
  "link": "https://www.app.com.pk/national/amin-asks-tiger-force-volunteers-to-create-awareness-on-covid-19/",
  "date_published": "2020-05-18T00:58:00.000Z",
  "source": "APP",
  "content": "ATTOCK, May 18 (APP):Advisor to Prime Minister on Climate Change Malik Amin Aslam on Monday asked the tiger force volunteers to help the country people in this difficult situation and play effective role in creating public awareness about COVID-19.\nAddressing a ceremony, he asked the volunteers of Corona relief tiger force to help ensure implementation of the standard operating procedures (SOPs) to protect from COVID-19.\nHe said that the tiger force volunteers were contributing great humanity services without any political objective. He added they should also help the district administration in implementation of SOPs after start of business activities and social distancing.\nHe said that without getting any financial benefit, tiger force members were doing a great job in COVID-19 situation and ensuring full assistance to district administration by supplementing their efforts against Corona.\nHe said this tiger force would also help those people who are unemployed due to the Coronavirus lockdown, in getting registered at the Ehsaas web portal.\nHe also asked the volunteers of tiger force to keep visiting the Utility Stores to ensure social distancing and also have check on the availability of essential items at the USC outlets as well as their working.\nHe said that over 12 million deserving families will be given Rs 12,000 each after biometric verification under Ehsaas Emergency Cash Programme.\nHe said that the objective of this programme was to transfer cash amount to deserving people transparently as financial assistance to mitigate impact of lockdown to contain spread of COVID-19.\nHe assured that distribution of funds to the deserving families will be totally on merit, transparent and non-political basis.\nHe said that the government was utilizing all its resources to help the people in this difficult time. He asked the officials concerned to adopt standard operating procedures (SOPs) pertaining to coronavirus and ensure assistance to people.",
  "retrievedAt": "2025-08-11T19:13:53.898Z"
}
