{
  "title": "Rs 104.91711 bln disbursed among 8,619,142 beneficiaries under Ehsaas Emergency Cash programme",
  "link": "https://www.app.com.pk/national/rs-104-91711-bln-disbursed-among-8619142-beneficiaries-under-ehsaas-emergency-cash-programme/",
  "date_published": "2020-05-18T00:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP):Ehsaas Emergency Cash Programme has disbursed a total of Rs 104.91711 billion among 8,619,142 beneficiaries so far under the different categories.\nAccording to the details provided by Ehsaas Emergency Cash Programme, this amount has been disbursed among the daily wage, piece-rate workers and deserving ones till May 18, since the beginning of the payment process under this initiative on April 9.\nTill today, an amount of Rs 1.6090 billion has been disbursed among 128,890 beneficiaries in Azad Jammu and Kashmir, Rs 4.8535 billion among 397,261 beneficiaries of Balochistan, Rs 0.7166 billion among 56,368 beneficiaries in Gilgit-Baltistan and Rs 0.3884 billion among 31,983 beneficiaries of Islamabad Capital Territory.\nAn amount of Rs 19.8468 billion has been disbursed among 1,611,098 beneficiaries of Khyber Pakhtunkhwa, Rs 45.0158 billion among 3,704,038 beneficiaries in Punjab and Rs 32.4871 billion among 2,689,504 beneficiaries in Sindh. The total disbursed amount also included due payments of Rs 1.48 billion to the Kafalat beneficiaries.\nAccording to the category wise disbursement, an amount of Rs 54.86 has been disbursed among 4,447,493 Kafaalat beneficiaries under the category-1 .\nIn category-2, a total of Rs 37.12 has been disbursed among 3,093,023 beneficiaries identified through 8171 SMS service.\nWhile in Category-3, a total of Rs 12.94 billion has been disbursed among 1,078,626 beneficiaries identified through district administrations.\nThe beneficiaries facing problems in withdrawing cash due to faulty biometric identification and registration of deaths can visit their nearest National Database and Registration Authority (NADRA) office to get solutions.\nThe beneficiaries will be able to resolve their issues regarding biometric verification and death registration within 24 hours. The fee of Rs 50 charged for death registration has been waived off for the beneficiaries.\nThose applicants who have received SMS from 8171 that their data is being scrutinized will get the message regarding their eligibility by the current week.\nThe beneficiaries having expired Computerized National Identity Cards can receive their payments as per their eligibility from payment center of Ehsaas by showing their old CNIC.\nThe citizens who are not registered through 8171 for government assistance are requested not to visit payment centers unless receiving message with date and place for the payment to avoid unnecessary crowding and enabling the deserving people to receive their payments easily.\nThose who have received the payment already or they have not registered through 8171 must not visit the payment centers.\nThe beneficiaries in Punjab, Sindh and Balochistan can receive their payments from the designated retailer of Habib Bank while those from Khyber Pakhtunkhwa, Gilgit-Baltistan and Azad Jammu and Kashmir can get their payments from the designated retailers of Bank Al-falah.\nIf they belong to such a district or province which is different from what is mentioned on their CNICs can get information from these banks by showing their SMS of payments through biometric verification.",
  "retrievedAt": "2025-08-11T19:13:56.365Z"
}
