{
  "title": "CM lays foundation stone of Rs 1.76bln Firdous Market underpass",
  "link": "https://www.app.com.pk/national/cm-lays-foundation-stone-of-rs-1-76bln-firdous-market-underpass/",
  "date_published": "2020-05-18T00:54:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 18 (APP)::Punjab Chief Minister Sardar Usman Buzdar laid the foundation stone of Firdous Market underpass project here on Monday.\nSpeaking on the occasion, he said Rs 1.76 billion would be spent on the project, which included the land acquisition cost also.\nGiving details, he said the construction cost was estimated at 1.09 billion. However, the government conducted a transparent tendering process and awarded the construction contract for Rs 960 million, thus saving Rs 130 million of the nation’s money.\nThe chief minister commended the Lahore Development Authority (LDA) for saving Rs 130 milliion, adding that Pakistan Tehreek-e-Insaf (PTI) government was the custodian of every penny of the national exchequer.\nThe project was estimated to be completed in four months; however, the LDA had been directed to complete it in 90 days without compromising on quality of the construction work, he added.\nThe CM said he would personally supervise the project, just like those he was supervising in backward areas. The public resources were plundered in the past, but the incumbent government had saved the public money, he added. Money-minting had been a basic aim of the past rulers, but this government was making all-out efforts to spend the public money on their welfare, added the CM.\nThe CM said that the 540-metre long two-lane dual carriageway underpass would facilitate traffic from the adjoining areas, with special arrangements for water disposal. He said around seven-kanal land would be acquired for the project, promising that no building at Firdous Market chowk would be affected.\nThe project would benefit more than 91,000 vehicles daily to save fuel worth millions of rupees annually, he said.\nLDA Director General Ahmad Aziz Tarar briefed the CM about the project.\nProvincial ministers Mian Mehmood-ur-Rasheed, Fayyaz-ul-Hassan Chohan, Murad Raas, Vice Chairman LDA Sheikh Muhammad Imran, Punjab Assembly members Sadia Sohail Rana, Umer Aftab Dhillon, Secretary Information, DC Lahore and others were also present.",
  "retrievedAt": "2025-08-11T19:13:57.089Z"
}
