{
  "title": "PM for immediate relief aid to Palestine, Lebanon through land, aerial routes",
  "link": "https://www.app.com.pk/national/pm-for-immediate-relief-aid-to-palestine-lebanon-through-land-aerial-routes/",
  "date_published": "2024-10-22T06:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP):Prime Minister Shehbaz Sharif on Tuesday directed the authorities concerned to immediately dispatch two planeloads of relief goods to Gaza and Lebanon and called for using both land and aerial routes for the aid supply.\nThe prime minister, chairing a meeting to review the relief activities for Palestine and Lebanon, asked for improving coordination with Pakistan’s ambassadors in Palestine, Lebanon, Jordan and Egypt to ensure a better supply of relief goods.\nStressing for an accelerated pace of relief aid, he called for ensuring that the relief goods reached the deserving people.\nPrime Minister Shehbaz reiterated his appeal to the countrymen and the expatriates to donate generously to the PM Fund Fund for Gaza and Lebanon with Account No. IBAN:PK11SBPD0000001111114292. He also instructed the relevant authorities to run an awareness drive to acquaint the people with the Relief Fund established by the government.\nIn the briefing on the relief activities, the prime minister was told that relief goods including winter tents, clothes, blankets, medicines and eatables were being dispatched for the people suffering the Israeli barbarism in Gaza and Lebanon.\nIt was told that the Israeli attacks and siege were impeding the supply of relief goods to the affected areas.\nThe meeting was told that the government would also facilitate the NGOs desiring to send relief aid to Gaza and Lebanon.\nFederal ministers Ahsan Iqbal, Ahad Khan Cheema, and Attaullah Tarar, Minister of State Shiza Fatima Khawaja, Special Assistant to PM Tariq Fatemi, chairmen of the Higher Education Commission, and National Disaster Management Authority and senior officers attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:13:48.332Z"
}
