{
  "title": "APACE celebrates 75-years of Sino-Pak Friendship",
  "link": "https://www.app.com.pk/national/apace-celebrates-75-years-of-sino-pak-friendship/",
  "date_published": "2024-09-27T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP):The Chinese Association of Chinese Foreigners in Pakistan & All-Pakistan Association of Chinese Enterprises  (APACE) celebrated the 75th Anniversary of the founding of the People’s Republic of China.\nAmong the notable highlights of the event was the performance by renowned Pakistan singer Umair Shahid, known by his Chinese name Omi, whose heartfelt song on China-Pak friendship resonated deeply with attendees, said a press release issued here Friday.\nThe event drew prominent figures from both nations, including Shi Yuanqiang, Minister of the Chinese Embassy in Pakistan, MNA. Danyal Chaudhry and Jiang Zaidong, the Chinese Ambassador to Pakistan.\nThese dignitaries gathered to reflect on the enduring partnership that has flourished over the past seven decades, characterized by mutual respect, trust, and a shared vision for future cooperation.\nYet, it was Umair Shahid’s performance that truly stole the spotlight. The Song “Wo men bu yi yang”, tweeted by Chinese Ambassador in Pakistan, went viral two years ago all over the social media and TV Channels, not only captivated audiences in Pakistan but also resonated within Chinese communities. This song is identity of Pak – China Friendship and millions of people listened to it both in China and Pakistan.\nAs Shahid performed, it became evident that his words served as a bridge linking the two cultures, traditions, folk music and such combined activities that bind Pakistan and China together.\nThe event also featured a rich array of traditional Chinese cultural presentations, including Chinese Opera, folk dances and traditional music.\nThese performances showcased the beauty of Chinese heritage and added a festive flair to the celebrations.\nUmair Shahid, is indeed making significant strides in promoting the China-Pakistan relationship through his music.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:24:14.041Z"
}
