{
  "title": "IHC orders immediate reopening of Tandoori Junction hotel",
  "link": "https://www.app.com.pk/national/ihc-orders-immediate-reopening-of-tandoori-junction-hotel/",
  "date_published": "2024-09-27T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The Islamabad High Court (IHC) on Friday lifted the closure of Tandoori Junction, a private hotel in F-7, and ordered the member state Director General (DG) Building Control of the Capital Development Authority (CDA) to appear before the court in person for explaining the reasons behind the shutdown.\nChief Justice of Islamabad High Court (IHC) Justice Aamer Farooq heard a petition challenging the illegal closure of Tandoori Junction. The hotel was sealed by the CDA on claims of legal violations. Advocate Qaiser Imam represented\nthe petitioner’s Javed Asif, while Advocate Sardar Yaqoob Mastoi appeared from the DMA. Deputy Director of CDA Raheel Junejo was also present during the proceedings.\nDuring the hearing, Chief Justice Farooq questioned the legal basis for the hotel’s closure, pointing out that the three notices issued by the CDA were inconsistent. He noted that in 2024 notice, the CDA claimed the hotel was illegally reopened after being sealed in 2020. However, he remarked that the notices from 2022 and 2023 made no mention of any hotel closure or related violations.\nDuring the hearing, Chief Justice Aamer Farooq reprimanded the Deputy Director of the Building Control Section (BCS), Raheel Junejo, for his conduct in the case. He noted that the file presented in court suggested that the hotel was unlawfully sealed, potentially at the request of a third party. The judge asked Junejo to disclose who had ordered the closure, warning that failure to do so could lead to an investigation by the Federal Investigation Agency (FIA).\nIn a stern rebuke, Justice Farooq admonished the officer for damaging the reputation of the institution, warning to recommend his suspension to higher authorities.\nFollowing the hearing, the court ordered the immediate reopening of Tandoori Junction and summoned the Member State and Director General of the Building Control Authority to appear in person. The case has been adjourned till next week.",
  "retrievedAt": "2025-08-10T21:23:56.526Z"
}
