{
  "title": "Naqvi calls on INL delegation",
  "link": "https://www.app.com.pk/national/naqvi-calls-on-inl-delegation/",
  "date_published": "2024-09-27T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP):Federal Minister for Interior and Narcotics Control, Mohsin Naqvi, met with the delegation of US Bureau of International Narcotics and Law Enforcement Affairs (INL) at the Ministry of Interior on Friday.\nThe delegation included US Deputy Ambassador Natalie Baker, Country Director INL Lynn Nelson, Police Advisor Ed Preston, and Police Program Specialist Faisal Gill.\nFederal Interior Minister appreciated INL’s exceptional cooperation in enhancing the capacity of Pakistan’s police and paramilitary forces, citing several notable projects as praiseworthy. He emphasized for further strengthening this cooperation and making it more sustainable. He underscored the need for prioritizing high-impact projects through a master plan.\nInterior Minister said that FIA is one of the most important investigative agencies of Pakistan. He  expressed the desire to make the Federal Investigation Agency (FIA) a dynamic organization, akin to the FBI, with INL’s cooperation. He said that this project will be of pivotal importance in combating organized crimes in Pakistan.\nHe also stressed the need of restructuring the National Police Academy so that it can be made an international standard institution. He emphasized that it is also need of the hour to modernize the Frontier Constabulary  which serves as a reserve police force across the country. Regarding Anti-narcotics efforts, Naqvi said that all possible measures are being taken.\nThe US delegation extended their condolences over the loss of precious lives in recent terrorists incidents. US Deputy Ambassador Natalie Baker  said that  INL has been working in close cooperation with the Government of Pakistan for more than 42 years and expressed the desire to make this cooperation stronger and sustainable. She emphasized that Pakistan’s security is integral to US security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:24:13.638Z"
}
