{
  "title": "Chairman HEC stresses measures for continuous sustainable development of higher education sector",
  "link": "https://www.app.com.pk/national/chairman-hec-stresses-measures-for-continuous-sustainable-development-of-higher-education-sector/",
  "date_published": "2024-09-27T17:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP):Chairman Higher Education Commission (HEC), Pakistan Dr. Mukhtar Ahmed has reiterated HEC’s commitment to materialising holistic development of higher education sector and extending utmost facilitation to the universities for their role in the country’s socio-economic development.\nSharing HEC’s accomplishments during the 4th meeting of the National Assembly Standing Committee on Federal Education & Professional Training with Dr. Azim-ud-Din Zahid Lakhvi in the chair, the Chairman HEC emphasised the need for continuous support from the state to higher education sector to ensure sustainable development of higher education sector in the country.\nHe said that HEC, in line with its core objectives, has made remarkable progress in terms of enhancing access, quality and relevance while employing financing, regulations and capacity building as its tools.\nHe elaborated that the number of universities has reached 265 in the country. He maintained that the tertiary education rate was 2.1 percent before 2002, however it has now reached around 13 percent. Highlighting the improvement in gender parity in the enrolment ratio of male and female students in the higher education institutions, he revealed that the ratio was 68 percent male and 32 percent female students respectively before HEC, however it has now come closer to 52 percent males and 48 percent females.\nHe underlined that universities are meant for creation of knowledge, dissemination of knowledge, and integration of knowledge with society. He continued to say that the universities’ role has been remarkable in all the three areas. A single university today hits 1000 publications annually now, while the number of research publications in high-impact journals has grown significantly. He said that despite facing scarcity of funds, Pakistani universities are making their way to international rankings.\nHe said HEC spends a major part of its funding on development of human capital. He added that HEC has so far awarded as many as 3,97,250 scholarships under various HEC scholarship programmes. He proudly exclaimed that the Pakistani youth have a great potential. “For the third consecutive year, Pakistan has been ranked first in the world for the number of scholarships awarded under the Erasmus Mundus scholarships for the year 2024,” he underscored.\nDilating on the financial hardships facing the sector, Dr. Mukhtar apprised that the higher education sector has been facing a shortfall for the past several years. He explained that the sector faced a shortfall of Rs. 17.7 billion in 2018-19, which continuously increased with every passing year. “Now, the sector is confronted with a shortfall of Rs. 60.1 billion. HEC requirement was Rs. 125 billion, while the allocation is Rs. 65 billion,” he explained.\nHe stressed the need for considering allocation to the sector as an investment in the future of Pakistan, i.e., the country’s youth. He also underlined the need for provincial support to universities in addition to unabated funding from the centre. “Pakistan is blessed with highly capable youth and we have to invest in them for the sake of this country’s future,” he stressed.\nThe Chairman shed light on progress in the areas of quality and governance. He said HEC is putting strenuous efforts to provide pragmatic solutions to quality issues through regulatory interventions for smooth operations of the universities. In addition, he said, HEC has set up Quality Enhancement Cells (QECs) in 258 universities for monitoring and enhancing the education standards and implementing the quality assurance policies.\nHe said National Academy of Higher Education (NAHE) conducts training and workshops for the capacity building of HEIs leadership, administrative staff and faculty in addition to creating exposure opportunities for them. Nonetheless, he stated that there is a long way to go to fix various quality and governance problems of the universities.\nResponding to a query of Mr. Rafiullah (MNA) regarding quality of education in the country, the Chairman HEC highlighted multiple factors affecting the quality of education and those include financial, administrative governance in the universities and external/internal interference in the affairs of the universities, causing multiple governance challenges for the institutes  by affecting quality of learning as well as administrative and financial challenges.\nDr. Mukhtar Ahmed underlined HEC’s efforts for universities technological readiness. He said that HEC, while expanding Information Technology systems in the universities, has developed a futuristic state-of-the-art ICT infrastructure. He highlighted the expansion of Pakistan Education and Research Network (PERN), establishment of Smart Universities, connecting academia through a dedicated Video Conferencing Network, establishment of Cloud Computing-based Data Centres, starting a Learning Management System for distance education, and running Edu TV.\nHe said that HEC is focused on promoting applied and problem-solving research, innovation and entrepreneurship. The country, he noted, is faced with issues like climate change, food security, health, water scarcity, energy crisis, and lack of tolerance.\nHe underlined that HEC’s initiatives are oriented towards sorting out resolution to the prevailing issues. He highlighted the accomplishments made through different HEC measures, including Office of Research, Innovation and Commercialization (ORICs), Business Incubation Centres (BICs), Innovator Seed Fund, National Innovation Award, and National Centres of Excellence.\nThe meeting was attended by parliamentarians including Anjum Aqeel Khan, Zulfiqar Ali Bhatti, Syed Sami Ul Hasan Gilani,  Zeb Jaffar, Musarrat Asif Khawaja, Ms. Abdul Hakeem Baloch, Dr. Shazia Sobia Aslam Soomro, Musarrat Rafique Mahesar, Abdul Aleem Khan, Sabheen Ghoury, Dawar Khan Kundi, and Muhammad Aslam Ghumman along with Secretary to the Ministry of Federal Education and Professional Training Mohyuddin Ahmad Wani, Executive Director HEC Dr. Zia Ul-Qayyum, and several other notable government officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:24:22.848Z"
}
