{
  "title": "Seerat-un-Nabi Conference: Salik calls for integration of religious, worldly knowledge in modern curriculum",
  "link": "https://www.app.com.pk/national/seerat-un-nabi-conference-salik-calls-for-integration-of-religious-worldly-knowledge-in-modern-curriculum/",
  "date_published": "2024-09-17T06:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): Minister for Religious Affairs and Interfaith Harmony, Chaudhry Salik Hussain on Tuesday emphasized the importance of following the teachings of the Holy Prophet Muhammad (Peace Be Upon Him) to enlighten the daily lives and strengthen the moral fabric of society.\nHe said this while addressing the opening session of the Seerat-un-Nabi Conference 2024 held to mark the sacred occasion of 12th Rabi-ul-Awwal.\nThe conference, which coincides with the celebration of the birth anniversary of the Holy Prophet Muhammad (Peace Be Upon Him), was graced by Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, parliamentarians, ambassadors, scholars, and dignitaries from across the country.\nMinister Salik, extending his heartfelt greetings to the nation and the distinguished guests on this auspicious day, noted that this year’s conference theme, “The Educational System of the State in Light of Seerat-un-Nabi (Peace Be Upon Him)”, highlights the Prophet’s exemplary leadership and governance, which transformed Madina into a welfare state based on education and wisdom.\nMinister Salik lauded the role of the Ulema and religious scholars in disseminating the teachings of the Prophet Muhammad (Peace Be Upon Him) and emphasized the critical need for an education system inspired by Islamic values that not only focuses on intellectual growth but also moral and spiritual development.\nHe recalled the Prophet’s (Peace Be Upon Him) first divine command, ‘Iqra’ (Read), underscoring the importance of knowledge as a foundation for human civilization and progress. He further elaborated that the inclusion of ethical teachings, such as honesty, justice, and responsibility, into the educational curriculum is vital for fostering a balanced and well-rounded society.\nMinister Salik mentioned that the key point that shook the very roots of feudalism, inequality, and injustice is the fundamental right to education for all of humanity, without discrimination. He said the Holy Prophet (Peace Be Upon Him) advocated for every person’s right to acquire knowledge, whether male or female, regardless of race or social status.\nMinister Salik drew the attention of scholars to how the practical implementation of modern education systems is possible. In light of the teachings of the Holy Prophet (Peace Be Upon Him), how we can incorporate these principles into the contemporary educational framework, he added.\nHe said the curriculum should be designed to balance religious and worldly knowledge adding that subjects like science, mathematics, and history should be taught alongside the Quran, Hadith, and Fiqh to ensure a well-rounded education for students.\nAdditionally, Minister Salik said the role of technology in the education system cannot be overlooked. He said the principles taught by the Prophet (Peace Be Upon Him), such as utilizing all available resources to acquire and disseminate knowledge, are still applicable today. Integrating technology into the education system can make knowledge more accessible and engaging, he maintained.\nIn his concluding remarks, Minister Salik called for the continuous promotion of the teachings of the Prophet (Peace Be Upon Him) and recognized the national consensus on the sanctity of the belief in the finality of Prophethood. He also praised the judiciary, particularly the Chief Justice of Pakistan, and prominent religious scholars like Mufti Taqi Usmani and Mufti Muneeb-ur-Rehman, for their contributions to upholding the nation’s religious values.\nThe Seerat-un-Nabi Conference is an annual event organized by the Ministry of Religious Affairs and Interfaith Harmony to encourage research and discussion on the various aspects of the life of the Holy Prophet (Peace Be Upon Him) and their application in modern times.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:10:32.441Z"
}
