{
  "title": "Eid Milad-un-Nabi (PBUH) celebrated in capital with great zeal",
  "link": "https://www.app.com.pk/national/eid-milad-un-nabi-pbuh-celebrated-in-capital-with-great-zeal/",
  "date_published": "2024-09-17T09:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): The great occasion of Eid Milad-un-Nabi (PBUH) is being celebrated on Tuesday with religious zeal and enthusiasm while reminding us of the enduring legacy of the Holy Prophet Hazrat Muhammad (Peace Be Upon Him) and his timeless message of peace, compassion and brotherhood.\nMilad processions were taken out by the believers across the federal capital like other parts of the country, carrying banners and chanting praises of the Prophet Hazrat Muhammad (Peace Be Upon Him), drawing citizens from different walks of life to join in the festivities.\nThe day dawned with a 31-gun salute in the federal capital and 21-gun salutes in provincial capitals to pay homages to the Holy Prophet Muhammad (Peace Be Upon Him).\nBesides religious gatherings, many community events were held across the city where food was distributed to the needy, following the Prophet’s message of charity and compassion.\nThe day was declared as a public holiday by the government, like every year. Public and private buildings, mosques, and streets across the country were adorned with fairy lights and green flags.\nSpecial prayers were being offered at mosques for the promotion of Islam and unity, solidarity, progress, and welfare of the country and the Muslim Ummah.\nSpecial security plans were executed by the city administration and security forces for the celebrations, including increased security around illuminated buildings and processions.\nThe mobile services were also partially suspended in the areas adjacent to the main procession’s route due to security concerns.\nSchools, colleges and universities also arranged Milad, Naat and Qirat competitions during the month of Rabi ul Awwal to highlight the importance of the day and educate the students about the exemplary life of Prophet Muhammad (Peace Be Upon Him).\nThe extra-ordinary illumination of the public and private buildings in the federal capital on the eve of Eid Milad-un-Nabi (pbuh) became the attraction for most of the residents as they visited the main Constitution and Jinnah avenues along with their families and took pictures.\nEnthusiastic little girls wearing fairy white clothes and boys disguised in mostly white dresses in impressive rallies taken out with reciting darood and naats to pay glowing tributes to the Holy Prophet Muhammad (Peace Be upon Him).\nMahafil-i-Naat were being arranged at many of the mosques while women arranged Mehfil-e-Naats at their homes.\nBesides decorating homes, offices and buildings, a large number of vehicles were also decorated with colourful buntings, flags and lights by the faithful youngsters.\nAmong many other events, a special calligraphy exhibition with reference to Eid Milad-un-Nabi (PBUH) was held on September 13 (Friday) at Parliament House.\nThe exhibition was organized under the special directives of Sardar Ayaz Sadiq to mark the blessed month of Rabi-ul-Awwal who also inaugurated the exhibition. The exhibition featured 112 unique calligraphy artworks, all created by the renowned calligrapher Wasil Shahid.\nThese artworks displaying the names of the Holy Prophet Muhammad (Peace Be Upon Him) and verses from the Holy Quran were attracting a large number of visitors.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:10:30.301Z"
}
