{
  "title": "Govt decides to increase power tariff with no impact on poor consumers: Khurram",
  "link": "https://www.app.com.pk/national/govt-decides-to-increase-power-tariff-with-no-impact-on-poor-consumers-khurram/",
  "date_published": "2022-07-26T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP): Minister for Power Engineer Khurram Dastgir on Tuesday said the Federal Cabinet had decided to increase the power tariff with special directives to the Power Ministry for protecting the poor consumers from its impact.\nAddressing a press conference along with Minister of State for Petroleum Musadiq Malik, he said that Rs 3.50 per unit hike in the tariff would be from July 26 while another Rs 3.50 per unit increase would be from the next month while 90 paisa from October.\nHe said first three months would be difficult for the consumers but the power prices would start decreasing from November after reflection of fuel surcharge in the tariff.\nThe hike would have no such impact on the consumers as the increase had already been reflected in the monthly bills on account of fuel prices adjustment, he added.\nKhurram said the cabinet had also decided to provide smooth and uninterrupted power supply round the clock to the dedicated industrial feeders to protect the livelihoods of the people.\nSimilarly, minimum load-management would be carried out on mix-industrial feeders, he added.\nHe said it was also decided to provide both gas and electricity on priority basis to five major export sectors on reduced rates.\nAn announcement to this effect would be made soon, he added.\nHe said they would give the tariff that was close to the regional countries in order to enhance the country’s exports.\nHe said the cabinet was also informed about power shortfall in last month.\nHowever, power generation has significantly jumped owing to increase hydel generation from Tarbela and resumption of 1100 MW from nuclear power plant K-2. Currently, hydel generation from Tarbela stood at 4500 MW, he added.\nThe minister said the country’s economy had gradually been strengthening and the power supply had also witnessed ups and down.The prime minister was personally monitoring the entire situation, he added.\nReplying to a question, he said the incumbent government inherited Rs 2467 billion circular debt which had been brought down by Rs 214 billion in short term.\nSteps were also being taken to reduce line losses, he added.\nComing hard on the previous PTI government, the minister said Imran’s government delayed main power projects including 1320 MW Shanghai Thar Coal, 1200 MW Trimmu RLNG, 1320 MW Jamshroo and 720 MW Karot hydropower to provide benefit to their blue eyed.\nTo another question, the minister said entire tunnel of Neelum Jhelum was being de-watered to assess real issue while Guddu power plant was generating 460 MW.\nMinister of State for Petroleum Dr Musadik Malik expressed confidence that the electricity price would start coming down from October-November due to effective policies of the government.\nFrom day one, he said, the incumbent coalition government had been saying that the fruits of its prudent policies would come to nutrition after almost 4-6 years.\nBased on the good performance and decision of the government, he said, “there will be a visible gradual reduction in the electricity price, hop in the coming 3-4 months.”\nHe said the previous government of Pakistan Tehreek-e-Insaf (PTI) had run the state affairs with extreme bad governance and its cost was now being paid by the common man.\nExplaining the ‘rebasing’, the minister said, it was the basic production cost of electricity that included the fuel rate, losses, and other expenses faced in transmitting power to consumers.\n“There are two basic components of the rebasing (revised tariff] i.e. production and transmission cost.’\nAs per the law, he said, the revision was a regular process, but the PTI government after February 2021 did not carry out the rebasing. “Non-rebasing does not mean that you [consumers) did not pay the price. Rebasing means to just make an announcement, as the current government has done today [instead of using fuel adjustment tool],” he said.\nMusadik Malik said the previous government was in the practice of non-announcement of the rebasing but continued increasing the price on account of fuel adjustment and quarter tariff adjustment in electricity bills.\nHe said the incumbent government wanted to put everything before the general public in a transparent manner, adding the un-announced rebasing of electricity tariff had been in place during the tenure of the past regime, who had been using the ‘fuel price adjustment’ tool every month to increase the rate to hoodwink the consumers.\nThe minister said there were strict directives of Prime Minister Shehbaz Sharif to protect poor segments of the society from additional financial burden, adding there were almost 27 million domestic electricity consumers in the country, out of which 13 million families would have no negative impact on the tariff’s rebasing.\n“In the new adjustment, it has been ensured that 13 million families (almost 80-85 million people) will remain protected. This tariff adjustment will not affect them.”\nAnswering a question, the petroleum minister said the country’s indigenous gas deposits were depleting at the rate of 10 per cent annually, causing a shortage of the commodity, especially during the peak winter season.\nOn the network of Sui Northern Gas Pipelines Limited alone, he said, around 780 Metric Million Cubic Feet per Day (MMCFD) of gas was available against the average winter demand of 1,150 MMCFD of domestic consumers in Punjab and Khyber Pakhtunkhwa only.\nHe said the government was in process of devising an effective strategy and exploring all possible means to meet the upcoming peak winter needs of gas consumers.\nThe minister held the PTI government for the prevailing energy crisis in the country as it had miserably failed to make arrangements for the availability of Liquefied Natural Gas (LNG), keeping in view the next 2-4 years’ needs of the country.",
  "retrievedAt": "2025-08-11T15:17:50.887Z"
}
