{
  "title": "BISP sets target to enroll three million additional children during financial year 2022-23",
  "link": "https://www.app.com.pk/national/bisp-sets-target-to-enroll-three-million-additional-during-financial-year-2022-23/",
  "date_published": "2022-07-26T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Benazir Income Support Program (BISP) has so far enrolled eight million children and disbursed Rs. 40 billion among them under the Benazir Taleemi Wazaif Program which is a Conditional Cash Transfer (CCT) initiative. While the future target is to enroll three million additional children by financial year 2022-23 through the allocation of Rs. 35 billion, an official source revealed.\nBenazir Taleemi Wazaif, initiated in 2012, has been focusing on school enrollment and reducing the dropout rate of children of BISP beneficiaries through cash incentives.\nThe objective behind this program was creating awareness amongst beneficiary families on importance of education, increasing enrollment rates and reducing the dropout rate by ensuring the retention. The program enrolls the children of Benazir Kafalat beneficiary family, aged between 04-22 years, from Primary to Grade 12 level.\nThe program includes quarterly disbursement of Rs. 1500 for primary, Rs. 2500 for secondary and Rs. 3500 for higher secondary to the boy child while the quarterly disbursement of Rs. 2000 for primary, Rs. 3000 for secondary and Rs. 4000 for higher secondary to the girl child.  The program is providing higher stipend for girl child, with a one-time graduation bonus of Rs. 3000 on completion of primary education.\nThe cash transfer is linked with 70 percent school attendance.\nThe biometric based payment mechanism is in place while the stipend is paid through the mother of enrolled children.\nThe program is being executed through end-to-end digital enrollment and monitoring mechanism to minimize leakage to ensure transparency in implementation.\nAbout the impact of the program, the source revealed that the initiative has helped increase the proportion of children currently enrolled in schools by 13 percent points for boys and 15 percent points for girls.\nThe school enrollment rates in BISP households are significantly higher for those supported by the CCT (81 percent) as compared to those who are not (60 percent).\nThe average attendance rate for both boys and girls is significantly above the minimum required (70 percent. On average boys had attendance rate of 83 percent and girls had 81 percent.",
  "retrievedAt": "2025-08-11T15:17:54.751Z"
}
