{
  "title": "President for consultative process to overcome economic woes",
  "link": "https://www.app.com.pk/national/president-for-consultative-process-to-overcome-economic-woes/",
  "date_published": "2022-07-26T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP): President Dr Arif Alvi on Tuesday said that there was a need for the political parties to find solutions to financial and economic woes faced by the country through a consultative process and to take steps to manage the rising inflation.\nHe made these remarks during an interaction with media persons here at the Aiwan-e-Sadr.\nThe President said that as uncertain political and economic situation in any country can expand polarization in society which was detrimental to everyone’s interest, therefore, all stakeholders should take meaningful steps to bring about political and economic stability through a consultative process while remaining within the bounds of the Constitution and relevant laws of the country.\nHe said that all pillars of the state and institutions should play their constitutional role while remaining within the bounds of law for holding free and fair elections, whenever held, to pave the path for the setting up a government which truly reflected the aspirations and hopes of the people of Pakistan.\n“Only a government that comes to power through transparent, free and fair elections can provide much-needed political, financial and economic stability to the country”, he said according to a press release issued here by the President’s Media Wing.\nThe President said that he had good working relationship with the current government and had no confrontation with the Prime Minister.\nHe stated that he had received 74 summaries from the present government out of which 69 summaries had been assented to without any delay.  “The Budget bill was signed immediately as it was received”, he added.\nThe President said that he didn’t receive any directions from the PTI’s leadership in relation to his official duties and conduct.\nReplying to a question, he said that he believed in making the right decisions without any fear and favour.\nHe further stated that he was ready to play his role in facilitating a consultative process amongst the political parties, only if all the stakeholders asked him to play such a role.\nReplying to a question about the early appointment of the Army Chief, the President said that if the appointment of the Army chief was initiated through the laid down procedure under relevant laws and contained the formal approval of relevant institutions and offices, then he would have no objection to it.\nHe said that the role of the army was clearly defined under articles 8(3) (a), article 39, article 243 to 245 and entry No.1&2 of the Fourth Schedule of the Constitution\nResponding to a question regarding the establishment of a parliamentary committee on Article 06 against him, Dr. Alvi said that he had been performing his duties as President within the bounds of the Constitution and prescribed laws and procedures and with a clear conscience, therefore, he would clarify his position whenever if such a situation arose.\nThe President emphasized pursuing a non-confrontational foreign policy by the country and establishing good friendly and mutually beneficial relations with all countries of the world based on equality and dignity and pursuing peace throughout the world.\nHe added that past policies of the country to completely align with one block did not go well with the interests of the country.\nWhile responding to a question about the Presidential system, the President said that the parliamentary system was a tried and tested system and had evolved over a period of time as the best-suited system for our country.\nHe said that vesting of extraordinary powers to the President through articles like the expunged 58 2 (b) was not in the larger interest of the country.",
  "retrievedAt": "2025-08-11T15:17:47.028Z"
}
