{
  "article_id": "2025-03-13_766ecffe5281e4f01e76e0a6edc2f847",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-pushes-to-fast-track-solar-conversion-of-balochistans-agricultural-tube-wells/",
    "retrieved_at": "2025-08-27T13:39:30.718Z"
  },
  "metadata": {
    "title": "Govt pushes to fast-track solar conversion of Balochistan’s agricultural tube wells",
    "author": null,
    "date_published": "2025-03-13T08:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 277,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 13 (APP):A meeting of the Steering Committee on the conversion of agricultural tube wells to solar power, chaired by Deputy Prime Minister Muhammad Ishaq Dar, was held yesterday. The meeting was attended by the Chief Minister of Balochistan, the Minister for Power, the Additional Secretary of Finance, GoP, the Secretary of Power Division, the Chief Secretary of Balochistan, and the Secretary of the Energy Department, Balochistan, said a press release issued here on Thursday. The meeting took stock of the progress on the government's initiative to convert agricultural tube wells in Balochistan to solar power. The meeting was informed that a sanction of PKR 14 billion was issued by the Federal Government to the Government of Balochistan on February 4, 2025. According to the Daily Situation Report (DSR) submitted by QESCO, PKR 12.4 billion was disbursed by the Government of Balochistan till March 1, 2025. A total of 4,539 disconnections, 2,378 poles and allied materials, and 2,626 transformers were retrieved, resulting in a 67.4 MW load reduction from these agricultural tube wells, the meeting was apprised. The meeting was further informed that there were 27,437 subsidized agricultural tube wells and 10,263 illegal agricultural tube wells in Balochistan. QESCO has 50 agricultural-dominated feeders active, with total pending receivables of PKR 564 billion. As per the initiative, a compensation of PKR 2 million for each tube well subject to disconnection is being provided will be borne by the Federal Government and Government of Balochistan on a 70:30 cost sharing basis. It was informed that third-party verification of solarization will be conducted. The Chaired showed concern on slow implementation and urged Gob and QESCO to fast tract implementation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}