{
  "article_id": "2025-03-13_ed096b89230485d7447e988d311303dc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-concludes-mou-with-university-of-central-punjab/",
    "retrieved_at": "2025-08-27T13:38:42.417Z"
  },
  "metadata": {
    "title": "ISSI concludes MoU with University of Central Punjab",
    "author": null,
    "date_published": "2025-03-13T15:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 13 (APP): The Institute of Strategic Studies Islamabad (ISSI) has concluded a Memorandum of Understanding (MoU) with the University of Central Punjab, Lahore. The virtual signing ceremony marked a significant step towards enhancing collaboration in academic research, exchanges, and policy dialogue, said a press release. The MoU was signed by Malik Qasim Mustafa, Director Arms Control and Disarmament Centre (ACDC), ISSI, and Prof Dr Khalid Manzoor Butt, Dean, FOHSS. The signing ceremony was attended by Ambassador Sohail Mahmood, Director General, ISSI; Heads of Departments at FOHSS; and representatives from both institutions. Speaking on the occasion, Ambassador Sohail Mahmood highlighted ISSI's history and institutional evolution as well as the geographical and thematic focus of its five distinct Centres. Noting that ISSI's three core functions were research, policy dialogue, and national and international outreach, he welcomed the signing of the MoU with UCP. This collaboration, he noted, aims to facilitate joint seminars, workshops, and research projects on regional and global issues. He also shared ideas on the nature and scope of future ISSI-UCP collaboration. Prof Dr Khalid Manzoor Butt introduced the various Departments within the Faculty of Humanities and Social Sciences. He emphasized the potential for collaboration between students and researchers, and highlighted the Faculty's existing international linkages and the University's research journal. Dr Rauf Butt articulated a strong desire to further enhance cooperation in research initiatives, conferences, lectures, seminars, etc. Earlier, Malik Qasim Mustafa introduced the Institute and ongoing cooperation between FOHSS, UCP, and ISSI. He highlighted the successful internship experiences of UCP students at ISSI. Both sides agreed to hold joint seminars, conferences, and research activities and designated their respective focal persons to facilitate mutual collaboration. Besides enhancing ISSI's outreach to national institutions, the signing of the MoU paves the way for initiatives that will benefit students, faculty members, researchers, and practitioners like.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}