{
  "article_id": "2025-03-13_5e9b450a0e28fd39566b75b7f1b77ee4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-unanimously-passes-resolution-vowing-to-eliminate-terrorism-pays-tribute-to-security-forces/",
    "retrieved_at": "2025-08-27T13:39:06.410Z"
  },
  "metadata": {
    "title": "NA unanimously passes resolution vowing to eliminate terrorism, pays tribute to security forces",
    "author": null,
    "date_published": "2025-03-13T09:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 304,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 13 (APP):The National Assembly on Thursday unanimously passed a resolution reaffirming the country's unwavering commitment to eliminating terrorism from every corner of the nation and safeguarding its sovereignty. The Resolution tabled by Federal Minister for Parliamentary Affairs Dr. Fazal Dr. Tariq Fazal Chaudhary firmly condemned the hijacking of the Jaffar Express and all acts of terrorism that endanger the lives of citizens and disrupt the peace of the nation. The resolution expressed resolve to take every possible measure to eliminate terrorism from every corner of our nation and affirms that no group, no individual, and no ideology that seeks to undermine our nation's peace, security prosperity, and sovereignty will be allowed to spread fear, hatred, or violence within the territorial limits of the country. Furthermore, pledges not to allow any terrorist activity to go unchecked in any part of our country and commits to working relentlessly to root out terrorism in all its forms and manifestations, ensuring that those who attempt to destabilize the country face the full force of the law. This House expresses deepest respect and gratitude to the brave men and women who have sacrificed their lives in this tragic incident, recognizing their courage, sacrifice, and patriotism. This House extends sincere appreciation to the Pakistan Army, FC, and other law enforcement agencies for their unwavering commitment, bravery, and sacrifices in safeguarding the lives of citizens and protecting the integrity of Pakistan. Their heroic efforts in neutralizing the terrorists involved in this incident reflect the resolve and readiness of our security forces to defend our nation at all costs. The House calls upon the people of Pakistan, regardless of ethnicity, religion, or background, to unite in the fight against terrorism and to reject extremism in all its forms, ensuring the peace, safety, and prosperity of our nation for future generations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}