{
  "article_id": "2025-03-13_a00cf3dcc72a1d6ef29ad7a28245d2fd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-acquits-suspects-of-kid-murder-after-17-years/",
    "retrieved_at": "2025-08-27T13:39:02.275Z"
  },
  "metadata": {
    "title": "SC acquits suspects of kid murder after 17 years",
    "author": null,
    "date_published": "2025-03-13T11:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 13 (APP):The Supreme Court of Pakistan has acquitted two convicts awaiting death penalty in murder of a five years old kid and abduction for ransom case happened in Charsadda district of Khyber Pukhtunkhaw some 17 years ago. A three-member bench of the Supreme Court of Pakistan, headed by Justice Hasham Ali Kakar and comprising Justice Salahuddin Panwar and Justice Isthiaq Ibrahim was hearing the appeals of the two prisoners awaiting capital punishment. The two prisoners Imtiaz and Naeem were acquitted by the court on the basis of poor and doubtful evidence. The two individuals were suspects of kidnapping for ransom and latter killing of a five years old boy Inam in 2008. The trial court condemned the two suspects with death penalty under the Counter Terrorism Act. The Peshawar High Court, however, converted the death penalty into life imprisonment that was challenged by the accused in the Supreme Court. The Supreme Court, Thursday, acquitted the two prisoners on the basis of poor quality of evidence. The Court order says that in cases where life imprisonment or death penalty is involved, the court should be extra careful in examination of evidence. One cannot be condemned to death on the basis of poor evidence especially when the evidence is only a confession that is withdrawn latter.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}