{
  "article_id": "2025-03-13_798c791842f4106a2e44d70d477c24bb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/legislation-is-sole-prerogative-of-parliament-khwaja-haris/",
    "retrieved_at": "2025-08-27T13:38:44.183Z"
  },
  "metadata": {
    "title": "Legislation is sole prerogative of parliament; Khwaja Haris",
    "author": null,
    "date_published": "2025-03-13T12:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 427,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 13 (APP):Counsel for the Ministry of Defense Advocate Khwaja Haris has argued before the Supreme Court that legislation is the right of the parliament and the parliament has to decide the extent of the jurisdiction of a particular law and on whom it will be applied. Advocate Khwaja Haris, Counsel for the Ministry of Defense in intra court appeals against trial of civilians in military courts was arguing before the seven-member Constitutional Bench of the Supreme Court in rebuttal to the arguments against the law under discussion. The seven-member Constitutional Bench of the Supreme Court of Pakistan, headed by Justice Amin ud Din Khan and comprising Justice Jamal Mandokhail, Justice Muhammad Ali Mazhar, Justice Hasan Azhar Rizvi, Justice Musarrat Hilali, Justice Naeem Akhtar Afghan and Justice Shahid Bilal Hasan, was conducting the proceedings. During the course of proceedings, Justice Jamal Mandokhail remarked that the very purpose of the Army Act is to keep discipline in the forces. Khwaja Haris, however, said that it is the prerogative of the parliament to legislate and decide on whom a particular law to be applied. Justice Jamal Mandokhail remarked that the Constitution is above the parliament and the parliament is to move under and according to the Constitution. Khwaja Haris, while responding to the observation of the Court, said that things to be examined in a broader and collective ambit of the Constitution instead of focusing in a particular clause ignoring the overall spirit of the Constitution. It, again, is the prerogative of the Parliament to decide the standard and implementation of a particular law in a particular situation. Justice Jamal Mandokhail asked the Counsel 'does it mean that the parliament can broaden the jurisdiction of the Army Act?'It is not the question before the Court yet', responded Khwaja Haris. 'We agree with you at least on Article 8(5) of the Constitution', remarked Justice Mandokhail. Justice Musarrat Hilali complained that the question remains unanswered despite arguments for over a year that 'are military courts the same as provides Article 175 of the Constitution?' Justice Amin ud Din Khan remarked that the judgment under discussion is not correct to the extent relating to Section 2/1-D and I agree with the Counsel on this point. Khwaja Haris said that he will focus on Article 8 of the Constitution and answer the main question regarding trial of civilians in military courts in coming part of his arguments. The Court is hearing this case on almost daily basis for last more than a month but adjourned the proceedings Thursday for April 7, 2024.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}