{
  "article_id": "2025-03-13_99768154cb2bdb0b86340840fe50897b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/meeting-of-national-leadership-to-be-called-to-counter-menace-of-terrorism-pm-2/",
    "retrieved_at": "2025-08-27T13:38:16.374Z"
  },
  "metadata": {
    "title": "Meeting of national leadership to be called to counter menace of terrorism: PM",
    "author": null,
    "date_published": "2025-03-13T16:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 865,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "QUETTA, Mar 13 (APP): Prime Minister Shehbaz Sharif Thursday said a meeting of the country's leadership would be called to hold consultation on the issue of terrorism as was done after the attack on the Army Public School in Peshawar. He expressed these views in a meeting with political leadership in the backdrop of the recent train hostage incident. He said, \"We needed unity and national solidarity which will provide support to the armed forces to fight against terrorism and Khawarij.\" Deputy Prime Minister Ishaq Dar, Governor Balochistan Jaffar Khan Mandokhail, Chief Minister Balochistan Sarfraz Bugti, Chief of Army Staff General Asim Munir, parliamentarians and high level officials attended the meeting. The prime minister said, \"Today we are together on the occasion when the whole nation was grieving as three days ago, terrorists attacked a train in which more than 400 persons were travelling.\" The terrorists did not care about the sanctity of Ramazan and cruelly took the passengers out of the train and held them captive at an abandoned place, he recounted adding the passengers were going to their hometowns to celebrate Eid and visit their loved ones. He said the security forces came up with a strategy and saved lives of passengers including children and eliminated terrorists. He said, \"We should be thankful to the security forces under the leadership of Chief of Army Staff and Corps Commander Quetta, intelligence agencies and the Zarrar Company which rescued 339 passengers and eliminated 33 terrorists.\" He said he took more than two hours of briefing on the security situation in Balochistan and visited the injured in the hospital. The prime minister said, \"I on behalf of people and governments of Pakistan particularly Balochistan pay tribute to the security forces for their bravery.\" He said the governments at the federal and provincial levels and people should work together to ensure peace in the country particularly Khyber Pakhtunkhwa and Balochistan. He pointed out that Balochistan was the biggest province of Pakistan in terms of area and people from all provinces were living there. The prime minister was of the view that Pakistan would not make progress and achieve prosperity without bringing Balochistan at par with other provinces of the country. He recalled that the finalization of the National Finance Commission award by the leadership of the country headed by Nawaz Sharif and Asif Ali Zardari in 2010 was a big achievement. Punjab financially contributed for the development of Khyber Pakhtunkhwa and Balochistan prior during the approval of the award, he said adding Punjab gave away Rs 600 billion for Khyber Pakhtunkhwa over the years but no visible development projects were executed. The prime minister said Pakistan would not be able to make progress without elimination of terrorism from Khyber Pakhtunkhwa and Balochistan. He said Pakistan lost 80,000 lives in the war against terrorism and peace was only restored in 2018 after immense sacrifices of the army, police and law enforcement agencies. Pakistan's economy suffered losses of $ 30 billion because of the war on terrorism, he continued. The prime minister questioned why terrorism raised its head again in the subsequent years and said release of thousands of Taliban from jail had caused the surge in terrorism. The released Taliban included those who were involved in very heinous crimes, he added. The prime minister said officers and Jawans were sacrificing their lives in Khyber Pakhtunkhwa and Balochistan to save people of Pakistan from the scourge of terrorism. He regretted the language used by some elements within the country against the armed forces and Pakistan. Poisoned propaganda against the armed forces was not acceptable and tolerable, he warned. The prime minister, \"We have to honour the sacrifices of our armed forces who leave behind their loved ones to protect future of the country.\" He said Pakistan's eastern neighbour was unleashing propaganda which was first spewed by some elements within the country. PM Shehbaz Sharif underlined the need to raise a new force, equipped with modern weapons and equipment in Balochistan and said he was ready to provide all necessary resources to counter the menace of terrorism. He said the government stabilized the economy in a year and the critics who were talking about default were amazed at the economic achievements of the country. He said Pakistan's unwavering commitment against terrorism helped the world achieve peace and security. The prime minister called on the leadership of the country to sit together to discuss the challenges facing the country. He said the train hostage crisis was against the culture and traditions of Balochistan, adding the terrorist elements were trying to use every tool to create disunity in the nation. While talking about development in Balochistan, he said 300 agriculture students including those from Balochistan were being sent to China to get higher education. The quota of Balochistan in the sectors of education and skill development training was higher than other provinces, he noted. While speaking on the occasion, Chief Minister Balochistan Sarfraz Bugti said attack on the train and captivity of passengers was contrary to the traditions and norms of people of Balochistan. He strongly condemned the incident and vowed to wipe out terrorism from the province and ensure good governance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}