{
  "title": "National Central Bureau (NCB) Interpol Pakistan issues Performance Report",
  "link": "https://www.app.com.pk/national/national-central-bureau-ncb-interpol-pakistan-issues-performance-report/",
  "date_published": "2024-02-22T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): National Central Bureau (NCB) Interpol Pakistan achieved significant success in apprehending various wanted criminals involved in serious criminal activities in 2023.\nInterpol Pakistan reported the arrest of 120 accused from various countries wanted for serious offences, with an additional 36 accused apprehended upon arrival or departure from abroad, said the press note. These arrests included accused wanted by the Punjab, Khyber Pakhtunkhwa, and Islamabad Police.\nAmong the arrested accused, 45 were apprehended in the UAE, 12 in Saudi Arabia, and 13 in Oman.\nFurthermore, NCB Interpol Pakistan successfully coordinated with international partners, resulting in the arrest and extradition of 14 accused from countries such as Canada, Kuwait, Cambodia, Italy, Spain, Australia, Ireland, France, Turkey, Japan and Swaziland.\nThe arrested individuals were promptly handed over to the relevant authorities at the airports.\nDuring the year 2023, NCB Interpol Pakistan issued a total of 303 notices, including 289 red notices for the arrest of wanted accused. The majority of these red notices (275) were issued at the request of the Punjab Police, while 5 were issued at the request of the FIA and 4 at the request of the KP Police.\nAdditionally, 5 accused were issued notices based on requests from Sindh Police, Islamabad, and NAB.\nAs part of its commitment to combating criminal elements, in year 2023, NCB Interpol Pakistan signed several Memorandum of Understanding (MoUs) with various organizations to enhance information sharing on criminals.\nNCB Interpol Pakistan, in collaboration with other Law Enforcement Agencies (LEAs), remains dedicated to achieve its targets and ensuring the safety and security of the nation.",
  "retrievedAt": "2025-08-11T00:52:27.689Z"
}
