{
  "title": "Urdu poet Josh Malihabadi being remembered",
  "link": "https://www.app.com.pk/national/urdu-poet-josh-malihabadi-being-remembered/",
  "date_published": "2024-02-22T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): The 42nd death anniversary of famous Urdu poet and prose writer Josh Malihabadi is being observed on Thursday.\nHe is remembered as a ‘Poet of Revolution’.\nHis real name was Shabbir Hassan Khan. His father Bashir Ahmad Khan Bashir, grandfather Muhammad Ahmad Khan Ahmad and great grandfather Faqir Muhammad Khan Goya were all well-known poets.\nJosh Malih Abadi started poetry at an early age. He started his practical life by working in Dar-ul-Tarjuma Usmania (Hyderabad State).\nHe lost both his job and state citizenship due to a poem against the system of Hyderabad. He came to Delhi and published magazine ‘Kaleem’.\nJosh Malihabadi also remained associated with All India Radio. He was also the editor of ‘Aaj Kal’, the official magazine of Indian Government. He received Padma Bhushan Award in 1954.\nAfter moving to Pakistan in 1955, he started work along with founder of Anjuman Taraqqi-e-Urdu Maulvi Abdul Haque in the preparation of Urdu dictionary. He was also Editor of magazine ‘Urdu Nama’.\nJosh Malih Abadi also wrote songs for films. The song ‘Ae Watan Hum Hain Teri Shama Ke Parwanon Main, for the film ‘Aag Ka Darya’ became popular. He also wrote columns under the title of ‘Ilm wa Fikr’ in daily Jang.\nJosh’s prominent poetry works include ‘Rooh-e-Adab’, ‘Shaer ki Raatain, ‘Naqsh o Nigar’, ‘Shula Aur Shabnam’, ‘Fikr o Nishat’, ‘Janun-O- Hikmat’, ‘Harf o Hikayat’, ‘Ayat o Naghmat’ , ‘Arsh o Farsh’, ‘Ramsh o Rang’, ‘Sumbal o Salasil’, ‘Saif o Sabu’, ‘Sarud o Sarosh’, ‘Samoom o Saba’, ‘Taloo-e- Fikr’, ‘Ilhaam o Ifkaar’, ‘Mohid o Mufakkir, ‘Najoom o Jawahir’, ‘Josh kay 100 Sher’, ‘Paighamber-e-Islam’, ‘Josh Key Marseeay.\nThe famous prose books of Josh Malih Abadi are: ‘Maqalat-e-Zarrin’, ‘Auraq-e-Sahar’, ‘Irshadaat’, ‘Jazbaat-e-Fitrat’, ‘Maqalat-e-Josh’, ‘Mukalmaat-e-Josh’ and ‘Yaadon ki Barat’.\nHe was posthumously awarded Hilal Imtiaz in 2013. He was died on this day in 1982 in Islamabad at 83.",
  "retrievedAt": "2025-08-11T00:52:23.859Z"
}
