{
  "title": "Senate body approves amendment in Pakistan Penal Code",
  "link": "https://www.app.com.pk/national/senate-body-approves-amendment-in-pakistan-penal-code/",
  "date_published": "2024-02-22T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Senate Standing Committee on Interior on Thursday unanimously passed the Bill further to amend the Pakistan Penal Code, 1860 and the Code of Criminal Procedure, 1898 [The Criminal Laws (Amendment) Bill, 2024].\nThe committee passed the bill unanimously emphasizing the preservation of the right of dignity of the human corpse. The bill was passed with the increase of fine to 5 hundred thousand rupees.\nHowever, the Bill further to amend the Prevention and Control of Human Trafficking Ordinance, 2002 [The Prevention and Control of Human Trafficking (Amendment) Bill, 2024] introduced by Senator Samina Mumtaz Zehri on Amendments in Sections 3, 4 & 5 of the Ordinance was withdrawn by the mover as the Ordinance in which the amendment was being proposed has already been repealed by an Act of Parliament in the year 2018.\nThe Bill further to amend the Pakistan Penal Code, 1860 and the Code of Criminal Procedure, 1898 [The Criminal Laws (Amendment) Bill, 2024] introduced by Senator Shahadat Awan on 1 January, 2024.\n(Amendments in Sections 292, 293, & 294 of PPC and subsequent amendment in Cr.P.C). was also passed by the committee.\nThe chairman committee however was of the view that the enhancement of sentences as proposed by the Mover are not reasonable as the same will be misused. The bill however was passed with amendments.\nThe Bill further amended the Code of Criminal Procedure. 1898 [The Code of Criminal Procedure (Amendment) Bill, 2024] introduced by Senator Shahadat Awan on 1 January, 2024. (Amendments in Sections 513 and 514 of Cr.P.C) was deferred.\nAdditionally the Bill further to amend the National Database and Registration Authority Ordinance, 2000 [The National Database and Registration Authority (Amendment) Bill, 2023], introduced by Senator Fawzia Arshad on 6th November, 2023 was also passed by the committee with amendments.\nThe committee also discussed at length the point of public importance raised by Senator Danesh Kumar regarding the problems/humiliation being faced by the commuters/travelers from different areas of Balochistan to Karachi via Hub Chowki at check posts of various agencies including Sindh Police, Pakistan Rangers, Customs Police etc., on the pretext of security checking. After due deliberation the committee recommended to establish a joint check post and directed all relevant stake agencies including customs, rangers and police to develope consensus on one window operation.\nSimilarly the point of public importance raised by Senator Danesh Kumar regarding the demolition of a Hindu Temple in Mithi District of Tharparkar by the District Administration was also discussed in detailed.\nThe chairman committee after due deliberation recommended that if the district administration can demolish the temple on the pretext of encroached land then similar treatment should also be done to the person who has encroached the state land and included it in his house.\nThe committee was attended by Senator Saifullah Abro, Senator Danesh kumar, Senator Fawzia Arshad, Senator kamil Ali Agha, Senator Shahadat Awan, Senator Waqar Mehdi, and Senator Aon Abbas. Senior Officials from the Ministry and other relevant department were also in attendance.",
  "retrievedAt": "2025-08-11T00:52:08.932Z"
}
