{
  "title": "Pak inks agreement to export skilled workers to Saudi Arabia in construction sector",
  "link": "https://www.app.com.pk/national/pak-inks-agreement-to-export-skilled-workers-to-saudi-arabia-in-construction-sector-2/",
  "date_published": "2024-02-22T10:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Special Assistant to the Prime Minister, Jawad Sohrab Malik has signed an agreement recently with NESMA & Partners for the export of skilled Pakistani labor to Saudi Arabia. The agreement was signed at the Embassy of Pakistan in Riyadh, Saudi Arabia, said a press release received here on Thursday.\nThe agreement marks a pivotal collaboration between Pakistan and Saudi Arabia, paving the way for the export of a substantial Pakistani workforce to contribute to Saudi Arabia’s ambitious infrastructure and development goals.\nNESMA & Partners, as the leading construction company in Saudi Arabia, holds responsibility for numerous mega-projects within the kingdom.\nThe agreement would provide Pakistani workers with the opportunity to showcase their expertise and contribute to the success of these critical infrastructure projects.\nJawad Sohrab Malik highlighted the exceptional reputation of Pakistani workers for their dedication and hard work.\nThe agreement was signed between the Pakistan Overseas Employment Corporation (POEC) and NESMA & Partners.\nThe POEC is a government agency responsible for the recruitment and deployment of Pakistani workers abroad.\nNESMA & Partners is a leading Saudi Arabian construction company with a portfolio of mega-projects in the kingdom.\nThe agreement is expected to create significant job opportunities for Pakistani workers in Saudi Arabia. It will also help to strengthen the economic ties between the two countries.\nThe meeting was also attended by the Ambassador of Pakistan to Saudi Arabia, Ahmad Farooq, Director-General of the Bureau of Emigration and Overseas Employment (BEOE), and the Joint Secretary of the Ministry of Overseas Pakistanis and Human Resource Development, along with community welfare attachés.",
  "retrievedAt": "2025-08-11T00:52:23.947Z"
}
