{
  "title": "Caretaker setup leaves behind useful strategy safeguarding national interests: PM",
  "link": "https://www.app.com.pk/national/caretaker-setup-leaves-behind-useful-strategy-safeguarding-national-interests-pm/",
  "date_published": "2024-02-22T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP):Prime Minister Anwaar-ul-Haq Kakar on Thursday said the caretaker setup in a short span of time had left behind a useful strategy for the upcoming elected government that would ensure public welfare and protect national interests.\n“The caretaker government always gave priority to national interests while taking policy decisions as it believed to work together for national stability and development,” the prime minister said while chairing a meeting of the federal cabinet at Prime Minister office.\nHe said the government had improved the national economy, saying “we are leaving country’s economy in a better condition than before”.\nHe appreciated and thanked his cabinet members and the civil servants for their tireless efforts during short tenure of the government.\nThe federal cabinet expressed satisfaction over the steps taken by the caretaker government regarding restructuring of various institutions, promotion of foreign investment and providing facilities to businesses.\nAppreciating the prudent leadership of Prime Minister Kakar on behalf of the federal bureaucracy, the cabinet secretary said that he had taken important difficult decisions in the interest of the country, which will have far-reaching results.\nAmong other agenda items, the cabinet, on the recommendation of the Ministry of Foreign Affairs, allowed Chief of Army Staff General Syed Asim Munir NI (M) to receive the “Turkish Armed Forces Legion of Merit” awarded by Turkiye in honor of his services regarding cooperation between the armed forces of Pakistan and Turkiye.\nOn the recommendation of ministry of finance, the cabinet also approved the extension of deputation period of Lubna Farooq Malik as Director General Financial Monitoring Unit (FMU) from June 9, 2023 to June 8, 2024.\nThe cabinet, on the recommendation of ministry of National Food Security and Research (MNFS&R), approved the signing of Memorandum of Understanding (MoU) between MNFS&R Pakistan and Khalifa International Award for Date Palm and Agriculture Innovation.\nUnder this MoU, the first Pakistan International Date Palm Festival will be held by September, 2024 to promote date production in the country.\nThe cabinet approved the decisions taken in the meetings of the Economic Coordination Committee held on February 13, 2024 and February 14, 2024.\nThe cabinet also approved the decisions made in the meeting of the Cabinet Committee for State Owned Enterprises held on February 16, 2024.\nThe Federal Cabinet ratified the decisions taken in the meeting of the Cabinet Committee on Legislative Cases held on February 16, 2024.",
  "retrievedAt": "2025-08-11T00:52:08.112Z"
}
