{
  "title": "Hindutva inspired Indians demonstrate against Pakistanis in a bid to export extremist ideology",
  "link": "https://www.app.com.pk/national/hindutva-inspired-indians-demonstrate-against-pakistanis-in-a-bid-to-export-extremist-ideology/",
  "date_published": "2021-10-03T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 3 (APP): A small group of Indian community recently held a demonstration in the United Kingdom to pour their venom against Pakistani community, which the locals denounced as another attempt by the right-wing Hindu groups to attack Muslims all over the world.\nThe protest was termed as an effort to create Islamophobic atmosphere in the UK which is rapidly growing in India. The speakers tried to stir sentiments against Pakistani community living in the UK by making announcement to boycott the restaurants run by Pakistanis.\nWhile on the other hand, enlightened Britishers have expressed their serious concerns over the efforts of the Indian government to infuse Hinduvta mindset at home and export it into the British society.\nThey also blamed neo-Nazi Indian regime of polluting the mindset of peaceful and harmonious societies outside. “This campaign is nothing but a form of prejudice and bigotry against Muslims,”, the British citizens opined.\n“This is quite possibly the stupidest thing I have heard in my life. So, these Pakistani people come to the UK for a better life to provide for their family, just like Indians, but our Hindu brother are painting it is as a conspiracy to fund and kill Indian soldiers,” another concerned person said.\nThey said the entire Indian nation was suffering from the Hindutva mindset and were just making an issue out of a non-issue because of their hatred.\nA recently held mega online international conference titled ‘Dismantling Global Hindutva’ in the US was the first academic attempt initiated by academia to understand the undercurrents of Hindutva and its impact on western societies including western campuses of renowned universities.\nThe conference was addressed by speakers from leading universities in the world including Stanford, Harvard, Princeton, University of Chicago, and Berkeley. Over 600 academics across the world attended the online event.\nThe participants expressed their concerns that Hindutva was becoming a global phenomenon and even the western universities were not safe from its influence propagated by the Indian Hindu students.\nThe conference highlighted that Rashtriya Swayamsevak Sangh (RSS) was promoting Hindutva. Motivated by the Nazi ideology, its regulatory principle was to transform India from a secular democracy to a Brahmin state where Muslims, Christians Jews and other religious minorities were demoted to the position of second-class citizens.\nSpeakers were of the view that Hindutva was a political philosophy styled after European fascism of the early twentieth century, an ideology that privileged a cult of personality and authoritarian leadership.\nThe speakers also noted that the term Hindutva was a strategy based on violence, hatred and terrorism. It is an enemy to democracy and has been targeting freedom of speech since the BJP came into power.\nThey were of the view that hatred was being generated by the Hindutva narrative which was against humanity because the philosophy placed Hindutva as a vehicle, and the message was actually the supremacy of Brahmin Varna over any human bearing stark resemblance to Hitler’s neo-Nazi ideology.\nSpeakers were of the view that in the western world, Hinduism was promoted as a culture rather than a religion during the last half a century but now it has changed its face as a brutal and extremist religious monster that wanted to kill everybody except Brahmins.\nHindutva had a history of ill-treatment of women, zero respect for transgender rights, minority exploitation, and extreme policies towards Muslims, Christians, Jews and non-Brahmins. It violated the basic fundamental rights of everybody.\nIn the name of Hindutva, the Indian government had instituted discriminatory policies including ban on beef, restrictions on religious conversion and interfaith weddings, and the introduction of religious discrimination through controversial India’s citizenship laws.\nThese measures led to a horrifying rise in religious and caste-based violence, including hate crimes, lynching and rapes directed against Muslims, Dalits, Sikhs, Christians, Adivasis, and dissident Hindus. Women of these communities were being specially targeted.\nGlobal experts have warned that India became an epic-center of social terrorism, using highly negative trends for creating communal division and hatred. The experts and media analysts are classifying India as factory of communal and social terrorism exporting the same globally.",
  "retrievedAt": "2025-08-11T21:23:03.212Z"
}
