{
  "title": "New archaeological sites to help promote tourism in Punjab: Buzdar",
  "link": "https://www.app.com.pk/national/new-archaeological-sites-to-help-promote-tourism-in-punjab-buzdar/",
  "date_published": "2021-10-03T14:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 03 (APP): Punjab Chief Minister Sardar Usman Buzdar has said that the discovery of new archaeological and historical sites, artifacts and developing tourist points will help make the province a tourism hub.\nAccording to official sources here, the CM said that discovery of archeological sites would not only attract foreign tourists and researchers but also improve the local economy.\nUniversity of the Punjab’s Archaeology Department Chairman Dr Muhammad Hameed said that according to the local traditions, the newly discovered Talajah Fort was built 5,000 years ago but, according to preliminary research, it was about two thousand years old.\nThe architecture of the houses and the artifacts discovered in Talajah Fort gave the traces that the Muslim population was settled there.\nIt was a presumption that archaeological and historical sites before the Muslim era in South Asia could also be discovered from Talajah Fort, he added.\nHe said that according to the local tradition, Muslims lived in the fort before the arrival of Jalaluddin Khawarizmi, the ruler of Central Asia.\nHe said that the discovery of Talajah Fort could reveal many facts for the archaeologists besides promoting tourism.\nThe discovery and preservation of thousands of years old archaeological and historical sites in Punjab are being carried out with a vision to promote tourism, according to official sources.\nAs a result of archaeologists’ successful expedition, thousands of years old authentic artifacts had been discovered at Talajah Fort in Soan Valley.\nThe archaeologists further disclosed that a research team had also discovered engraved manuscript on the stones of Mehmood Ghaznavi era during an excavation in Nandana Fort.",
  "retrievedAt": "2025-08-11T21:23:00.227Z"
}
