{
  "title": "NCOC, civic admin visit M-2, E-11 marquees, vaccinated Cansino to passengers",
  "link": "https://www.app.com.pk/national/ncoc-civic-admin-visit-m-2-e-11-marquees-vaccinated-cansino-to-passengers/",
  "date_published": "2021-10-03T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 03 (APP): The NCOC and district administration teams late Saturday visited hotels, restaurants, marquees of the Islamabad Capital Territory (ICT) and Motorway-2 Toll Plaza to ensure strict enforcement of obligatory vaccination regime.\nThe district administration team along with Islamabad Police inspected vaccination status of staff and people visiting Guest Houses, hotels, restaurants, marquees in E-11 Sector and passengers at M-2 Toll Plaza.\nThe district administration sealed several hotels, restaurants, marquees in E-11 and surroundings, registered First Information Reports (FIR) against violators, imposed heavy fines on unvaccinated owners, staffers and visitors.\nThe people who were attending the marriages were also vaccinated single dose of Cansino.\nThe team also detained the owner and staffers of a renowned Sheesha Centre at E-11 for allowing permission to unvaccinated people. All staffers, visitors in the Sheesha Centre were unvaccinated.\nAn FIR has also been registered against them, and the center was sealed and imposed heavy fine while the owner were shifted to Police Station for permitting entrance to unvaccinated people in the Sheesha Cafe.\nIn another action, NCOC team along with Secretary Islamabad Transport Authority visted M-2, checked the vaccination certificates of passengers in buses. The bus administrations were imposed heavy fines for awarding tickets to non vaccinated people.\nThe passengers were also barred to travel without getting the vaccination.   The team also vaccinated single dose Cansino vaccine to non-vaccinated passengers on the spot and strictly advised the masses to complete their vaccination.",
  "retrievedAt": "2025-08-11T21:23:02.241Z"
}
