{
  "title": "PTI govt has steered country out of economic crisis: Shahbaz Gill",
  "link": "https://www.app.com.pk/national/pti-govt-has-steered-country-out-of-economic-crisis-shahbaz-gill/",
  "date_published": "2021-10-03T14:51:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 03 (APP): Special Assistant to Prime Minister (SAPM) for Political Communication Dr Shahbaz Gill has said the  government of Pakistan Tehreek-e-Insaf (PTI) has successfully steered the country out of economic crisis.\nAddressing a public gathering during inaugural ceremonies of various development projects in his native village Chak No 89-JB Ratna here, he said that the previous governments had left the national economy in a bad shape and Prime Minister Imran Khan had to take multidisciplinary measures to tackle the critical situation.\nHe said the top most challenge for the PTI was to pay off heavy loans, acquired by the previous governments. In order to tackle the challenge, the government lowered its expenditures to the minimum, but the corona posed yet another threat due to global meltdown.\nHe said that the government was following the most prudent policies and it had overcome the negative impact of the prevailing crisis much earlier than the other countries.\nAbout Pandora papers, on the pattern of Panama leaks, he said that “we are not afraid of it, as we have neither been involved in any loot and plunder nor we can be held accountable for it”.\nHe said that Prime Minister Imran Khan had no offshore company. “If I have an offshore company, I am accountable for it,” he said and added that the premier could not be held accountable for the acts of any minister.\nHe said that two residences in Zaman Park had the same addresses, but both were situation half a kilometre away from each other. Hence, the person who had an offshore company should be held accountable for it.\nContinuing, he said that the economy was in a bad shape a few years ago, but the Pakistan’s captain boldly faced the situation and now the country was speedily heading towards progress and prosperity.\nHe said that when Pervez Musharraf left the government, the PPP had to borrow $2.5 billion loan to pay the installments of foreign loans. When the Pakistan Muslim League-N (PMLN) replaced the PPP government, it had to pay loans of $5 billion every year.\nHe said that when the PTI government came to power after the PML-N, it had to pay $11 billion loan every year. He said saving of Rs 1080 million was made only in the expenditures of Prime Minister’s House.\nHe said PM Imran Khan was the custodian of national exchequer, and he would give details of every penny spent from the national kitty. Similarly, the PTI government would make all others accountable for the public money spent by them.\nHe said that the government was giving subsidy of Rs 80 billion on flour, which would give some relief to the inflation-stricken people.\nThe PTI government was launching the Kamyab Pakistan Programme under which interest-free loans would be given to the poor people on the basis of their CNIC and the prime minister himself would stand guarantor for them.\nHe said that the government was issuing the Kisan Cards through which subsidy would be given to the targeted group and no middleman could pilfer the subsidy.\nHe said that increase in petroleum prices was a global phenomenon, which had multiplied the government difficulties. However, the government had reduced sales tax on petroleum levies on the petroleum products to pass on minimum impact of price hike to masses.\nHe criticised Shehbaz Sharif and Suleman Sharif for projecting fabricated news that they had been exonerated from money laundering case. He said that they were involved in money laundering through mafia companies.\nHe said that work on Rs 13 billion road projects had been started, under which Jhang Road, Sammundri Road, Jaranwala Road and Chiniot Road would be upgraded to provide better communication facilities to people.",
  "retrievedAt": "2025-08-11T21:23:00.234Z"
}
