{
  "title": "Pesticides causing widespread harm to animals and plants: study - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Pesticides are significantly harming wildlife across the planet, stunting growth, damaging reproduction and even causing behavioural changes in animals not meant to be targeted, according to a large-scale study published on Thursday.\n\nSpecies loss has reached a level not seen since an asteroid smashed into earth and wiped out the dinosaurs 66 million years ago, with scientists warning that human activity is pushing the world into its sixth mass extinction event.\n\nResearchers have already shown that pesticides are detrimental to a wide range of species — adding to the damage to the natural world caused by habitat loss and, increasingly, climate change.\n\nIn a new study, published in the journal Nature Communications, scientists in China and Europe looked at 1,700 previous research papers to look into how these chemicals harm animals and plants across the world. The authors said that unlike previous studies with a narrower focus on specific habitats or species like fish or bees, the new research looked to build a comprehensive picture of global impacts from 471 different pesticide types used in farms, businesses and homes.\n\n“It is often assumed that pesticides are toxic primarily to the target pest and closely related organisms but this is clearly not true,” said co-author Dave Goulson of the University of Sussex.\n\n“Concerningly, we found pervasive negative impacts across plants, animals, fungi and microbes, threatening the integrity of ecosystems.” More than 800 species in land and in water were assessed to have suffered detrimental effects, including reducing how fast they grow, their reproductive success and even their ability to catch prey or attract mates. Ultimately, the authors said this can lead to death.\n\nUN talks on protecting nature\n\nCo-author Dr Ben Woodcock, at the UK Centre for Ecology and Hydrology, said the chemicals were “a necessary evil, without which global food production and farmers’ livelihoods would likely collapse”. But researchers in the latest study said that farmers can cut pesticide use by planting crops at different times, or sowing wildflowers to encourage pest-eating species.\n\nThe study comes ahead of United Nations negotiations on biodiversity in Rome later in February that aim to secure funding to protect species from deforestation, overexploitation, climate change and pollution.\n\nIn a landmark report in December, UN biodiversity experts warned that overconsumption and unsustainable farming are fuelling overlapping crises in nature and the climate, having already warned that a million species are threatened with extinction.\n\nAntonis Myridakis of Brunel University in London — who was not part of the research — said the study reinforced concerns that pesticides are “contributing significantly to biodiversity loss”.\n\nHe said the dataset used only covered a relatively small sample of species potentially affected. “Therefore, there is the possibility that the true extent of pesticide harm is even greater than reported.”\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:26:15.547Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891836/pesticides-causing-widespread-harm-to-animals-and-plants-study",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:23:08.000Z"
}
