{
  "title": "CDA turns to World Bank to address capital’s water woes - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Capital Development Authority (CDA) has said it is collaborating with the World Bank on water-related projects to address the city’s growing need for potable water.\n\nThe capital city, which has been witnessing rapid growth in its population, is facing water scarcity with no major project completed in the last three decades. This has resulted in acute water shortages in many areas of Islamabad.\n\nCurrently, against the total need of 220 million gallons per day (mgd), the CDA is providing around 65 mgd in city areas while rural areas depend on boring and other water sources.\n\nThere are three main sources of water in the federal capital — Simly Dam, Khanpur Dam and tube wells — as CDA has failed to develop any new source.\n\nThree decades on, civic agency yet to execute any major water project in Islamabad\n\nOn the other hand, during the last two decades, the construction of several new dams, including Dotara Dam, Shahdhara Dam, Chinot Dam and Chirah Dam and Ghazi Barotha project - has remained a key agenda in CDA meetings, but without any significant progress.\n\nSo far, all of these projects are reportedly in their feasibility study stages.\n\n“There is a need to focus on the issue as Islamabad is facing a shortage of water and if timely steps are not taken, the situation will worsen in future,” said an official, adding that every summer the residents of Islamabad faced water shortages.\n\n“Scarcity of water is a major challenge being faced by Islamabad…the pace of development activities in Islamabad including new housing schemes shows that in coming years the crisis will deepen further,” the official said.\n\nMeanwhile, CDA Chairman Mohammad Ali Randhawa and board members met World Bank Public-Private Partnership Adviser Michael Opagi at the CDA headquarters on Thursday.\n\n“During the meeting, it was agreed to work on water-related projects and their tangible deliverables with timelines for the city of Islamabad,” read a press release issued by CDA after the meeting.\n\nIt said the meeting focused on enhancing mutual cooperation in various sectors and discussed the initiation of water-related projects. According to the statement, the CDA chairman said the civic agency was ready to work under public-private partnership for various projects.\n\nHe emphasised the need for immediate action for better supply of water.\n\nThe CDA chairman further added that the World Bank needed to provide technical assistance and consultancy for various projects.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:37:01.126Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891876/cda-turns-to-world-bank-to-address-capitals-water-woes",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T03:13:52.000Z"
}
