{
  "title": "At least 10 dead, 6 injured as blast in Harnai targets pickup truck carrying mine workers - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 10 people were killed and six others were injured when an explosion hit a pickup truck carrying coal mine workers in Balochistan’s Harnai area on Friday, officials said.\n\nAccording to Harnai Deputy Commissioner Hazrat Wali Kakar, the blast occurred when an improvised explosive device (IED) detonated in Coal Mines Area PMDC 94 in Harnai’s Shahrag district.\n\n“The bodies of the deceased and the injured have been shifted to the Shahrag Basic Health Unit,” Kakar said.\n\nNo group has claimed the attack.\n\nLaw enforcement agencies reached the site, and an investigation has been ordered into the incident, according to a statement by Balochistan Government Spokesperson Shahid Rind.\n\nEvidence was being collected, and a preliminary investigation showed that the explosive material was planted on the roadside, the statement added.\n\nAccording to identity documents seen by Dawn. com, the deceased coal miners belonged to Khyber Pakhtunkhwa’s Shangla district. KP Coalmine Workers Federation’s General Secretary, Ali Bash Khan, also confirmed that the miners were from Shangla.\n\nMaqsood Ahmad, uncle of the blast victim Iqbal Hussain, told Dawn.com that only men in the family knew about the latter’s demise and were keeping the incident hidden from the rest of the family till the body arrived in Shangla, Lilownai.\n\nHe said Hussain had gone to work two months ago and was a hardworking man struggling to earn income for his family back in Shangla.\n\nAhmad said they were preparing for the dead body’s arrival and a place for guests who would come for condolences to their home.\n\nThe leader of the opposition in the KP Assembly, Ibadullah Khan, has contacted CM Bugti, Balochistan chief secretary, Balochistan inspector general of Police, requesting the CM to provide all possible medical facilities to the injured.\n\nThe CM assured the injured would be provided with all possible medical facilities.\n\nDr Khan also demanded immediate disciplinary action against the saboteurs.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif strongly condemned the blast and offered heartfelt condolences to the families of the deceased, according to the Associated Press of Pakistan.\n\nIn separate statements, the president and prime minister vowed to continue efforts till the elimination of terrorism from the country.\n\nPM Shehbaz directed relevant authorities to provide the best medical support to the injured and prayed for their recovery. He said that those who harm the lives and property of innocent and defenceless citizens will have to pay a heavy price.\n\nBalochistan Chief Minister Sarfraz Bugti condemned the incident and expressed sorrow over the loss of lives, an official statement from the CM House said.\n\nHe directed the authorities concerned to provide the best medical facilities to the injured workers while vowing to uproot the scourge of terrorism.\n\n“Terrorists who target innocent citizens do not deserve any forgiveness,” the CM said. “Strict action will continue against the elements damaging the peace of Balochistan.”\n\nThe intentions of the enemies of peace will not be allowed to succeed under any circumstances, Bugti said, adding that the Balochistan government was taking all possible steps to protect the lives and property of the people.\n\n“The terrorists involved in this incident will be brought to justice soon,” Bugti said.\n\nInterior Minister Mohsin Naqvi condemned the attack and expressed his heartfelt sympathies to the families of the deceased. He echoed Bugti’s sentiment in saying that the “beasts who target innocent civilians do not deserve any leniency.”\n\nAdditional reporting by Umar Bacha from Shangla.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1411590815a4f07.png",
  "retrievedAt": "2025-08-25T19:36:59.205Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891903/at-least-10-dead-6-injured-as-blast-in-harnai-targets-pickup-truck-carrying-mine-workers",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T06:16:21.000Z"
}
