{
  "title": "Sindh govt relaxes timing of ban on entry of heavy vehicles - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Instead of 11pm, dumper trucks will now be allowed after 10pm in metropolis\n• Decision made after discussions with transporters’ associations, says Sharjeel\n\nKARACHI: In what is being widely seen as a surrender to powerful transport associations, the Sindh government on Thursday relaxed the timing of a ban on the movement of heavy vehicles by one hour and claimed that the decision had been taken for the convenience of both the public and transporters.\n\nOnly on Wednesday, Sindh Home Minister Zia Lanjar had vowed to strictly enforce the ban and not allow any heavy vehicles on road before 11pm.\n\nHowever, a high level meeting, chaired by Chief Minister Murad Ali Shah, decided to allow movement of heavy traffic from 10pm to 6am, relaxing the timing of the ban by one hour.\n\nSindh Information Minister Sharjeel Inam Memon, at a press conference held to share decisions taken in the meeting, said that the current time for dumper trucks to enter the city was from 11pm to 6am. “However, due to various challenges, the government is making changes and it was decided to adjust timing after discussions with various associations,” he said and added that now heavy traffic would be allowed 10pm onward.\n\n“This adjustment has been made because traffic congestion is lower during these hours,” he said, adding that the decision had been made for the convenience of both the public and transporters.\n\nHe said that the provincial government on Thursday made it mandatory for all heavy vehicles to obtain fitness certificate and eliminated all charged parking across the city.\n\nThe senior minister said that vehicles entering Sindh from other provinces would also be required to obtain a fitness certificate from the Sindh authorities.\n\nHe said that the certificates issued by Punjab, Balochistan, or Khyber Pakhtunkhwa would not be considered valid in Sindh. “The Punjab government has already enforced a similar law requiring fitness certificates for vehicles,” he said and added that vehicles without a fitness certificate would not be allowed on the roads.\n\nThe minister said that a 30-day grace period had been given for heavy traffic vehicles to obtain a fitness certificate.\n\nIn the first phase, all heavy vehicles would have to obtain fitness certificate, he said. “The transport department will ensure that all heavy traffic vehicles, including trailers, tankers, buses, and dumpers, undergo proper inspection and verification,” he said and made it clear that any such vehicle, regardless of its origin, would be confiscated if it was unregistered.\n\nMr Memon, who also holds portfolios of information and transport, said that the Karachi Water and Sewerage Corporation had also implemented a barcode system for all registered water tankers operating from authorised hydrants. “These barcodes are issued to vehicles that meet fitness standards,” he said, adding that any vehicle plying without a barcode would also be confiscated.\n\nHe said that individuals involved in the water transportation business must register their vehicles with the water utility. “No unregistered vehicle will be allowed to operate in the city,” he added.\n\nThe provincial government had already passed a law prohibiting showroom owners from selling vehicles without registration, the minister said. “Any vehicle purchased from a showroom must be registered before leaving the premises,” he stated and added that if an unregistered vehicle was found on the roads, it would also be confiscated, and the showroom responsible for its sale would be sealed. From Monday onward, strict enforcement of this law would begin, he shared.\n\nFurthermore, imported vehicles arriving at Karachi’s port would be transported to showrooms in Sindh and to other provinces using a car carrier, he said.\n\nBan on arms display\n\nThe senior minister said that a strict ban had been imposed on the open display of weapons. “Only uniformed police officers are permitted to display weapons,” he said and added that any security personnel in civvies, whether from government or private agencies, found displaying weapons would face strict legal action.\n\nHe stated that the provincial government had ordered the removal of sirens and police lights from both private and government vehicles. “Any vehicle found using police lights or similar items will be confiscated,” he added.\n\nVendors selling police lights, sirens, or similar items had been given two days to stop selling these products, he said.\n\nMr Memon said that a strict crackdown on fake number plates is also ongoing. “Anyone found driving without a valid licence will face immediate arrest,” he said.\n\nHe also urged parents to prevent their children under 18 from driving as they would be held responsible for any violations.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:25:38.682Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891766/sindh-govt-relaxes-timing-of-ban-on-entry-of-heavy-vehicles",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:25:23.000Z"
}
