{
  "title": "Pakistan hopes hosting major cricket tournament will erase worries of instability - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan is hoping that hosting its first major multi-country cricket tournament in nearly 30 years will help erase worries of instability in the country and restore confidence in it as a tourism and investment destination.\n\nThe Champions Trophy, which kicks off next week, comes to Pakistan as the country battles terrorism and a political crisis that has sent its former prime minister and greatest cricket hero, Imran Khan, to jail.\n\nBut the government and Pakistan’s cricket board believe the elite tournament of one-day games featuring the top eight teams in the world presents one of the most potent image-building opportunities in decades.\n\n“The return of global cricket is not just about hosting matches,” said cricket board chairman Mohsin Naqvi, who doubles as Pakistan’s interior minister and security chief.\n\n“It is about restoring pride, igniting national passion and giving back to the millions who have stood by Pakistan cricket.”\n\nPakistan’s security environment has been clouded since the US war in neighbouring Afghanistan began in 2001. The country was struggling to convince sports teams to visit when gunmen attacked a bus carrying touring Sri Lanka cricket players in the city of Lahore in 2009. At least six players were injured, and visits by international teams came to an abrupt halt.\n\nSecurity has improved dramatically since then in major urban centres, and cricket teams from overseas have been touring since 2018.\n\nThe Champions Trophy will be the first major tournament to be held in Pakistan since 1996 and will feature the home side and teams from New Zealand, England, Australia, Afghanistan, South Africa, Bangladesh and India.\n\nAll have agreed to play in Pakistan except India, which will play its matches in Dubai, including its encounter with Pakistan, the latest in a storied rivalry.\n\nDespite the relatively improved security situation, Pakistan is still struggling to contain insurgencies in the north by militants and in the southwest by ethnic Baloch separatists. But officials say violence is limited to fringe areas.\n\nThe country is also navigating a challenging economic recovery path, buttressed by a $7 billion facility from the International Monetary Fund.\n\nNaqvi said staging the tournament was a “monumental task” that involved vast logistical improvements from roads and hotels to security.\n\nBut he said the visiting teams were happy with the arrangements and the International Cricket Council had received the board’s security plan with “unanimous approval”.\n\n“Players are treated as state dignitaries for enhanced security,” said Shahzada Sultan, the deputy police chief for Punjab province where two of the three venues within Pakistan are located.\n\nFor the Champions Trophy, police in Lahore, Karachi and the twin cities of Rawalpindi and Islamabad have deployed over 20,000 troops, including snipers on rooftops along key routes. Hotels where players will stay, stadiums and airports will be heavily guarded as will the roads connecting these locations.\n\n“Their movement warrants the best box security we can ever provide, with their routes under close surveillance,” Sultan said.\n\nFans from the participating countries are also expected to fly to Pakistan in large numbers, but authorities have not disclosed details on the number of visas issued.\n\nPolice have said they will provide “ironclad” security to both players and supporters.\n\nPunjab police said they have updated surveillance systems and installed around 10,000 AI-powered facial recognition cameras and additional CCTV cameras across the two cities.\n\nKarachi police said they have set up an additional SWAT unit to respond to emergencies and conducted preventive intelligence operations to identify potential threats.\n\n“The law and order situation is relatively better,” Karachi Mayor Murtaza Wahab said.\n\nPakistan hosted cricket’s one-day international World Cup as defending champions in 1996 during a period of optimism about sports in the country.\n\nThe national team had triumphed in the previous edition under the leadership of Imran, who is now behind bars on corruption charges after falling out with the powerful military.\n\nHis party and supporters say the charges are “politically motivated.” They have taken to the streets to protest and clashed with security forces, adding to instability in the country.\n\nA spokesman for Imran’s party PTI described the political climate as “suffocating” but welcomed the return of international cricket and wished Pakistan’s national team luck.\n\nWhile the tournament promises to stabilise Pakistan’s shaky image, the partial absence of arch-rivals India means it’s not a full diplomatic success.\n\nTheir intense rivalry has meant cricket matches between the two are among the most watched sporting contests in the world but they only play each other at multi-nation events.\n\nPakistan’s cricket board did not comment on questions about India but former chairman Najam Sethi said hosting India would be the ultimate prize.\n\n“This is a culmination of a long six-year trend of everyone coming to Pakistan… but the big thing will be when India and Pakistan play each other in Pakistan,” he said.\n\n“I think that will be the big breakthrough.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/14125454674dff8.jpg",
  "retrievedAt": "2025-08-25T19:36:59.136Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891911/pakistan-hopes-hosting-major-cricket-tournament-will-erase-worries-of-instability",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T08:38:55.000Z"
}
