{
  "title": "15 wounded in grenade attack on French bar - World - DAWN.COM",
  "author": null,
  "content": "GRENOBLE: French police were on Thursday searching for an unidentified man who hurled a grenade into a bar in the southeastern city of Grenoble, wounding 15 people.\n\nThe attacker, whose motive was still unclear, entered the Aksehir bar, situated in a rough neighbourhood of the city, shortly after 8pm on Wednesday, prosecutors said.\n\n“Someone came in and threw a grenade, apparently without saying a word, and ran away,” prosecutor Francois Touret de Coucy told reporters. The injuries suffered by six people were serious, with “at least two” still in critical condition, said Health Minister Yannick Neuder as he visited victims and medical staff at Grenoble University Hospital.\n\nThey suffered damage to inner organs in an “extremely violent” attack that was reminiscent of “methods of war”, said Neuder.\n\n“I heard a loud bang, and I said to myself that it wasn’t a firecracker,” said Agnes Lefebvre-Paquet, a witness in her 70s. “I assumed it was a neighbourhood problem.” Another neighbour said: “We’re all shocked.” She had lived in the area for 30 years and it was “getting worse and worse”, she added.\n\nTouret de Coucy said the man may also have been carrying an assault rifle, possibly a Kalashnikov — but if so, did not appear to have fired it. “From what we can tell, all the damage was caused by the exploding grenade,” he added.\n\nMany clients were present when the grenade exploded at the bar in the Olympic Village neighbourhood, built when the Alpine city hosted the 1968 Winter Olympics.\n\nInvestigators have not yet identified a motive, said Touret de Coucy — but they did not believe it was a “terrorist attack”, he added.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/14092119dde5711.jpg",
  "retrievedAt": "2025-10-12T01:25:32.737Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891838/15-wounded-in-grenade-attack-on-french-bar",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:23:08.000Z"
}
