{
  "title": "PCB chief hopes Champions Trophy will bring more big events - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan will host a first major multi-country cricket tournament in nearly three decades next week and its cricket chief is hopeful that a successful Champions Trophy will bring a flood of other such events.\n\nTop teams shunned Pakistan after the 2009 attack on a bus carrying Sri Lankan cricketers in Lahore, forcing them to relocate home matches, mostly to the United Arab Emirates.\n\nIt took the Pakistan Cricket Board years to convince foreign counterparts that it was safe to visit. Touring sides began returning after the board successfully staged its own T20 league, with several foreign players, on home soil in 2017.\n\n“The ICC (International Cricket Council) Champions Trophy 2025 is a culmination of those efforts,” PCB chairman Mohsin Naqvi told Reuters.\n\n“Our successful hosting of this event will further enhance Pakistan’s credentials, positioning us as a strong contender for more ICC events in the next events cycle.”\n\nPakistan staged the 1996 World Cup after winning the previous edition of cricket’s marquee event but the country’s fortunes crumbled with the rise of militancy following war in neighbouring Afghanistan.\n\n“Security has long ceased to be a concern for visiting teams as we have consistently demonstrated our ability to provide a safe, secure and well-managed environment for international cricket,” said Mohsin, who also doubles as the country’s internal security chief.\n\n“Once we successfully staged home international series and consistently delivered PSL (Pakistan Super League) editions at world-class standards, the ICC accepted and recognised Pakistan’s readiness to host a global event,” he said.\n\n“Since 2019, all major Test-playing nations — except India — have toured Pakistan, some multiple times.”\n\nMohsin said multiple visits by England and New Zealand and the growing number of international players in the PSL were an endorsement.\n\n“As a result, they are already familiar with Pakistan’s world-class playing conditions, operational efficiency and robust security measures.”\n\nBut he acknowledged that staging a multi-team event was tougher than hosting a single team.\n\n“The ICC Champions Trophy 2025 has been a monumental task, requiring extensive preparations in a limited timeframe. Our stadiums last underwent significant renovations for the 1996 World Cup, and since then, the global cricketing landscape has evolved tremendously.”\n\nThe PCB has upgraded two main grounds in Karachi and Lahore for the event in an 11th-hour facelift.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:25:33.447Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891774/pcb-chief-hopes-champions-trophy-will-bring-more-big-events",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:24:14.000Z"
}
