{
  "title": "Punjab law minister blames ‘complacent’ law officers for court summons to secretaries - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab Law Minister Malik Sohaib Ahmad Bherth has instructed the provincial law officers to vigorously defend the bureaucracy in cases against the government before the Lahore High Court, Dawn has learnt.\n\nSources said the law minister, in a recent meeting in the library of the office of the advocate general of Punjab, expressed his dissatisfaction with the performance of the law officers.\n\nHe observed that provincial secretaries of different departments were being personally summoned by the judges of the high court, which was due to the inefficiency of the law officers. He urged the law officers to take on the judges and try to win the cases without the relevant government authorities being summoned in the courts.\n\nMr Bherth is a nephew of Chief Secretary Zahid Akhtar Zaman.\n\nThe sources said it appeared that the law minister presented the case of the chief secretary in the meeting with the law officers. When contacted by Dawn, Law Minister Sohaib Bharath said the purpose of the meeting was to establish a liaison between the advocate general office and government departments so that the challenges faced by law officers could be addressed.\n\nHowever, he said, there were many concerns that he expressed at the meeting. He was of the view that when law officers were given high salaries, the government’s representation in courts should be effective.\n\nTo a query about the potential candidates for the advocate general, the law minister said that Baliguz Zaman was a competent law officer, but the decision on who will be the next advocate general will be made after consultation with the chief minister.\n\nSources also claimed that the law minister was observed throwing his weight behind Additional Advocate General Baleeghuz Zaman Chaudhry, who has been given acting charge of the advocate general after the elevation of Khalid Ishaq to the bench. They said the meeting was a message to all that Baleeghuz Zaman would be the next advocate general.\n\nMr Zaman is a son of senior lawyer Aftab Iqbal Chaudhry who also served as advocate general of Punjab from 2005 to 2008.\n\nParvez Elahi: An accountability court on Thursday reserved its decision on an application of PTI President Parvez Elahi seeking a permanent exemption from personal appearance in the trial of a corruption reference related to development projects in Gujrat.\n\nMr Elahi did not appear before the court and his lawyers argued that he was elderly and unwell, with doctors advising complete bed rest.\n\nThe lawyers requested the court to approve the appointment of a pleader to attend the proceedings on behalf of Mr Elahi.\n\nNAB Prosecutor Waris Ali Janjua opposed the defence request, stating that Elahi’s personal appearance was necessary before appointing a pleader.\n\nJudge Zubair Shehzad Kiyani allowed an application of Mr Elahi for one-time exemption from personal appearance and reserved the verdict on the plea for the appointment of a pleader.\n\nThe judge adjourned the hearing of the reference till Feb 27.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:37:02.919Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891858/punjab-law-minister-blames-complacent-law-officers-for-court-summons-to-secretaries",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:57:32.000Z"
}
