{
  "title": "TikTok returns to Apple and Google app stores - World - DAWN.COM",
  "author": null,
  "content": "TikTok has returned to Apple and Google app stores nearly a month after a new security law forced its removal, AFP journalists confirmed on Thursday.\n\nThe Chinese-owned social media platform faces being banned in the United States over national security concerns about the data it gathers on users.\n\nThe popular video-sharing app briefly went dark late on January 18 and disappeared from app stores to the dismay of millions of users.\n\nThe service was restored when new US President Donald Trump began his second term and ordered a 75-day pause on enforcing the law, signed by his predecessor Joe Biden and passed overwhelmingly by Congress.\n\nHowever, Apple and Google had not made TikTok available on their app stores until now.\n\nThe TikTok ban was passed due to concerns that the Chinese government could exploit the app to spy on Americans or covertly influence US public opinion through data collection and content manipulation.\n\nIt ordered the company to divest from its Chinese owner ByteDance or be banned.\n\nTrump has suggested a joint venture between the United States and ByteDance, although he did not provide details about how this could be achieved.\n\n“Essentially, with TikTok, I have the right to either sell it or close it,” Trump said soon after ordering the pause.\n\n“We may have to get an approval from China too… but I’m sure they’ll approve it or that would be a hostile act” that could be reciprocated with tariffs, he said.\n\nCompanies that violate the law, which remains officially in effect, face penalties of up to $5,000 per user if the app is accessed.\n\nTrump had attempted to ban TikTok in the United States over similar national security concerns during his first stint in office but said he now has “warm spot” for the app.\n\nOriginally launched in 2016 as Douyin for the Chinese market, the international version was named TikTok and released in 2017.\n\nThe platform has faced intense scrutiny from governments worldwide over concerns about data privacy and potential ties to the Chinese government.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:36:59.218Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891909/tiktok-returns-to-apple-and-google-app-stores",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T07:37:06.000Z"
}
