{
  "title": "Local bodies members flexing muscles for another protest in Peshawar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Thousands of elected members of local bodies from across the province will launch agitation on next Monday as government has failed to fulfil their demands including release of development funds and restoration of their powers in the given time.\n\nLike their previous protests, the mayors, chairmen and councillors of local bodies will stage protest outside Khyber Pakhtunkhwa Assembly on February 17 and highways across the province will be blocked on February 25.\n\nIt is pertinent to mention here that police had used heavy tear gas against local bodies’ representatives for two consecutive days on January 1 and 2 when they blocked the busy GT Road for release of development funds and restoration of their clipped powers.\n\nLater on, they called off their protest following a jirga of four provincial ministers including Minister for Local Government Arshad Ayub Khan, Minister for Education Faisal Tarakai, Minister for Revenue and State Nazir Abbasi and Special Assistant to Chief Minister Rangraiz Khan pledged to fulfil their demands within 20 days.\n\nThe coordinator of Local Council Association, Taimur Kamal, told Dawn that local bodies representatives would launch agitation again as provincial government and a jirga of ministers failed to fulfil their demands.\n\nGovt fails to release funds to them and restore their powers despite promise\n\nHe said that the two-tier local government system comprising tehsil and village and neighbourhood councils was installed in two phases of elections held in December 2021 and March 2022, respectively.\n\nHe said that there were 29,960 elected members of local bodies including general, youth, peasants and minority councillors. He said that there were 4,212 chairmen of village and neighbourhood councils and 131 mayors and chairmen of tehsil councils in the province.\n\nHe said that the provincial government was bound to allocate 20 per cent funds from Annual Development Programme for schemes of local bodies as per Khyber Pakhtunkhwa Local Government Act, 2013. He said that the share of local bodies in budget for financial year 2022-23 was Rs33 billion and in 2023-24 it was Rs 34 billion while in the current fiscal year it was Rs27 billion.\n\n“However, not a single penny has been released to local bodies out of their share in the development funds,” claimed Mr Kamal.\n\nBesides release of funds and restoration of powers, other demands of local government representatives are implementation of Local Government Act in letter and spirit and framing of LG Rules of Business in line with Section 112 of the law. They also demand establishment of offices at tehsil and village council level, especially in tribal districts, and setting up offices of devolved departments.\n\n“The denial of development funds has literally brought municipal and social services of local bodies to a standstill and people of the province are the ultimate sufferers. The non-availability of funds has also affected the performance of devolved departments,” said Mr Kamal.\n\nHe said that the local government representatives had been protesting for their demands for the last three years but in vain. He said that provincial government on December 5 released Rs3.5 billion to those tehsil chairmen, who were affiliated with Pakistan Tehreek-i-Insaf, and ignored others, who were aligned with opposition parties.\n\nFollowing the release of funds, which had mostly gone to the mayors and tehsil chairpersons affiliated with the ruling party, opposition parties staged a protest outside Adiala Jail in Rawalpindi due to which the provincial government withdrew the released funds.\n\nMr Kamal said that after each protest, the government held a meeting with the local bodies’ representatives, however, not a single issue was resolved.\n\nA statement issued by Local Council Association said that despite the worst shelling, baton-charge and arrests in the history of Peshawar, the morale of local government representatives was high and thousands of them would head to Peshawar on February 17.\n\nThe local government system of Khyber Pakhtunkhwa has been paralysed for three years. Due to non-availability of development funds, problems of people are increasing at local level. The salaries of tehsil municipal administration employees are often delayed.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:37:00.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891896/local-bodies-members-flexing-muscles-for-another-protest-in-peshawar",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T03:34:40.000Z"
}
