{
  "title": "Imran’s attempts to engage military draw cold shoulder - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Message from ex-PM accuses ISPR of building ‘false narrative’, calls on top brass to reconsider its policies\n• COAS denies getting correspondence, says he will forward it to PM if received\n\nISLAMABAD: While incarcerated PTI founder Imran Khan seems bent on communicating with the top military brass, the army chief indicated on Thursday that he would not engage with any such correspondence, but would rather forward it to the prime minister.\n\nOn Thursday, the contents of a third open letter purportedly addressed to Army Chief Gen Asim Munir on behalf of Mr Khan were shared on the former prime minister’s official X account.\n\nHowever, the full text of the letter was not shared by the party, and it is not known whether the communique has formally been dispatched to the army chief, or the party is relying on mainstream and social media channels to convey its message to the powers that be.\n\nWhen asked why a draft of the so-called open letter had not been shared with the media — as had been the case with recent letters written to an IMF delegation and the chief justice of Pakistan — a party insider told Dawn that the letter to the army chief “does not exist”.\n\n“Imran Khan has been behind bars for 20 months and he cannot sign any documents. Mr Khan’s lawyer revealed the contents of the message outside Adiala jail and that is what was shared on social media,” the insider said.\n\nIn contents shared on the PTI founder’s X (formerly Twitter) account — which he does not personally have access to while in prison — Mr Khan accused Inter-Services Public Relations of building a false narrative, which he claimed was “bringing the armed forces into disrepute”.\n\n“Repeating again and again that the army does not interfere in politics insults the nation’s intelligence,” said the post on Mr Khan’s X account, adding that every child in the country knows that the army chief effectively runs the country.\n\nThe latest message posted on behalf of the PTI leader stated that he did not seek any concessions for himself, but rather was concerned with restoring the reputation of the Pakistan Army. Contending that the gulf between the people and the armed forces was widening, the message claimed that the democracy has been derailed in Pakistan.\n\nThe message recalled that it was the establishment that had once told the nation that the ruling elite was involved in corruption, but regretted how “rejected faces had been imposed on the nation through rigged elections”.\n\nEfforts are being made to paint cases against Sharif family and Asif Zardari as politically motivated, but the fact is that NAB initiated those cases, it said. Former ISI chief Gen Ehtesham Zamir and former president Farooq Leghari provided dossiers containing proof of corruption in these cases, the message said, which were filed long before the PTI’s tenure.\n\nThe only case filed under PTI rule was the Ramazan Sugar Mills case against Shehbaz Sharif, which has also been closed, it said, regretting that all the same faces had been imposed on Pakistan again after being dry-cleaned.\n\nThe incarcerated former prime minister’s message also claimed that after the PTI government was ousted, democracy was derailed through the imposition of a fake government, while the Constitution was violated and party symbol was snatched from PTI.\n\nWhile the whole world has been progressing, Pakistan has been moving in opposite direction, the PTI founder’s message said, adding that these problems can only be solved by the people’s true representatives.\n\nMr Khan’s message also criticised the 26th amendment, alleging that handpicked judges were being appointed, leading to a collapse of justice.\n\nThe message called on the establishment to reconsider its policies to “avoid further damage to the institution”.\n\nArmy chief’s response\n\nMeanwhile, during an informal interaction with media persons during a state banquet held in honour of visiting Turkish President Recep Tayyip Erdogan, Chief of Army Staff Gen Asim Munir denied receiving any correspondence.\n\nWhile he did not name the PTI or Imran Khan, the army chief said that he would forward any such letters to the prime minister.\n\nIn his brief remarks, the COAS said, “Pakistan is moving forward, and it must move forward”.\n\nThis is the second time the establishment has denied receiving any correspondence from the PTI founder. The party has previously claimed to have sent the army chief two open letters, which were also mired in controversy.\n\nSecurity sources had denied receipt of the first purported letter to the army chief, whose contents were divulged to the media. Similarly, a second such letter also never saw the light of day; instead, only its salient features were shared on the social media handle of the ex-PM.\n\nWhen asked whether the letter supposedly sent to army chief physically existed or not, a source privy to the development told Dawn on condition of anonymity that it was not possible for anyone to write a letter containing allegations against the establishment on behalf of Imran Khan to the army chief.\n\nHowever, the source claimed that the fact that the army chief had come forward to talk about the letter was “a success for Imran Khan”, as an earlier response was given through security sources.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/140853080c7ab71.png",
  "retrievedAt": "2025-08-25T19:37:31.912Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891813/imrans-attempts-to-engage-military-draw-cold-shoulder",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:23:17.000Z"
}
