{
  "title": "FIA submits final charge-sheet in Umerkot Dr Kunbhar’s ‘extrajudicial killing’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "UMERKOT: The Federal Investiga­tion Agency (FIA) has submited the final charge-sheet of Dr Shahnawaz Kunbhar’s alleged extrajudicial killing in the Mirpurkhas Anti-Terrorism Court, according to his brother-in-law Advocate Ibrahim Kunbhar, who shared the charge-sheet with the media on Friday.\n\nAdvocate Kunbhar is also complainant of the case. The 35-page charge-sheet reveals the timeline of the entire episode along with mobile phones as well as vehicles tracking record of suspects, who included officers and personnel of police and CIA.\n\nDr Shahnawaz Kunbhar had to flee his hometown a couple of days before his alleged murder on Sept 17, 2024 to escape wrath of several religious outfits, who were bent upon punishing him over some of his social media posts, regarded by them as ‘blasphemous’.\n\nSoon after he left Umerkot, he was taken into protective custody in Karachi and handed over to a team of the Mirpurkhas police.\n\nPresents timeline of entire episode, tracking record of police vans and phones; claims senior officers had been in constant touch with prime suspect, associates\n\nHours later, the police declared that Dr Shahnawaz Kunbhar was shot dead in an encounter with criminals on Sept 17, 2024. Amid continuing protests organised by several religious outfits against Dr Kunbhar and civil society organisations against his alleged custodial killing, the body was exhumed on a court order on October 16, 2024.\n\nThe FIA has claimed in the charge-sheet that Dr Kunbhar had been in custody of Umerkot police for nearly five hours before he was unlawfully handed over to the Mirpurkhas police, according to Advocate Ibrahim Kunbhar, who produced a copy of the charge-sheet to the media and discussed its main points in Janhero village of Umerkot.\n\nThe FIA document stated that Dr Kunbhar, who was sitting in Mirpurkhas SSP’s vehicle, was handed over to the city’s police at Jamrao checkpoint. When SSP’s vehicle reached Ratanabad, another vehicle, belonging to the Mirpurkhas CIA arrived at the location. Dr Kunbhar was then handed over to the CIA mobile unit, which moved towards Khipro Road to reach the Hingorno area near Sindhri. At this point, a vehicle belonging to the Sindhri police joined the unit.\n\nAccording to the charge-sheet, both vehicles arrived at Sabzal Stop at around 12:25am on [Sept 17, 2024], halted for only a minute and then started moving towards Sindhri.\n\nSubsequently, the Sindhri police mobile unit returned to the police station while the CIA vehicle carrying Dr Kunbhar’s “body” proceeded to the Mirpurkhas Civil Hospital.\n\nThe charge-sheet negated the initial police claim that Dr Kunbhar possessed a weapon [when engaged in the encounter]. It argued that he had been in police custody during the entire time.\n\nThe assertions by the Sindhri and CIA police that Dr Kunbhar had fired two shots were found to be false, the FIA charge-sheet said.\n\nIt further revealed that three persons — Imtiaz Ali, Farhan Jinjhi and another one identified only as ‘Abbu Ji’ — had been in continuous contact with a cleric, Maulvi Umar Jan Sarhandi, on WhatsApp during the whole episode. These persons were present at key locations, including Jamrao Road, Ratanabad and the CIA Centre.\n\nThe charge-sheet confirmed that the firearms used in Dr Kunbhar’s killing belonged to two CIA men, Nadir Pervaiz and Ghulam Qadir.\n\nAccording to the charge-sheet, Mirpurkhas DIG Javed Jiskani had been in constant contacts with Mirpurkhas SSP Asad Ali Chaudhry and Umerkot SSP Asif Raza Baloch with Maulvi Umar Jan Sarhandi, whose associates were closely coordinating with the Umerkot police team that had first arrested Dr Kunbhar.\n\nSSP Asad Chaudhry was frequently contacting a person named Ghulam Akbar, who in turn was in touch\n\nwith Mirpurkhas CIA officer Mohammad Iqbal, it said, adding that the mobile phone location tracking confirmed that Mohammad Iqbal was travelling alongside Maulvi Umar Jan Sarhandi.\n\nThe FIA charge-sheet has also made mention of a transaction of Rs1.5m and linked it to certain accused officers. The money was transferred into an account a few days after the incident [Kunbhar’s murder], it said.\n\nFIA’s findings are supported by forensic analyses of the suspects’ mobile phones.\n\nAccording to Dr Ibrahim, the ATC has adjourned the case till February 26.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:37:03.945Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891759/fia-submits-final-charge-sheet-in-umerkot-dr-kunbhars-extrajudicial-killing-case",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:25:23.000Z"
}
