{
  "title": "Hamas signals readiness to move forward with truce - World - DAWN.COM",
  "author": null,
  "content": "• Israel threatens war resumption if prisoners not freed\n• Egypt, Qatar ‘overcome’ Gaza ceasefire obstacles\n\nCAIRO: The Palestinian group Hamas signalled on Thursday that a crisis threatening to unravel the Gaza ceasefire deal could be avoided despite uncertainty over the number of prisoners due to be released on Saturday and disagreements over aid supplies.\n\nThe 42-day ceasefire has appeared close to failure this week amid accusations on both sides of violations to the agreement sealed last month with the help of Egyptian and Qatari mediators and US support.\n\nHamas said it did not want the deal to collapse, though it rejected what it called the “language of threats and intimidation” from Israeli Prime Minister Benjamin Netanyahu and US President Donald Trump. They have said the ceasefire should be cancelled if the prisoners are not released.\n\n“Accordingly, Hamas reaffirms its commitment to implementing the agreement as signed, including the exchange of prisoners according to the specified timeline,” Hamas said in a statement.\n\nIsrael warned on Thursday that Hamas must release three living prisoners this weekend or face a resumption of the war in Gaza. “If those three are not released, if Hamas does not return our prisoners, by Saturday noon, the ceasefire will end,” said government spokesman David Mencer.\n\nEgyptian state-aligned media reported on Thursday that Egypt and Qatar have successfully “overcome obstacles” hindering the completion of the Gaza ceasefire agreement. Citing an official source, Extra News said that Israel and Hamas were now committed to fully implementing the deal following a round of disputes that had called it into question.\n\nHamas, whose Gaza chief leader Khalil Al-Hayya is visiting Cairo for talks with Egyptian security officials, said both Egyptian and Qatari mediators would press on with efforts “to remove obstacles and close gaps”.\n\nThis week Hamas accused Israel of failing to respect stipulations calling for a massive increase in aid deliveries and said it would not hand over three prisoners due to be released on Saturday until the issue was resolved.\n\nIn response, Netanyahu ordered reserves to be called up and threatened to resume combat operations that have been paused for almost a month unless the prisoners were returned.\n\nIsraeli minister Avi Dichter, a member of Netanyahu’s security cabinet, told Israeli public radio on Thursday that he did not believe Hamas would be able to get out of the agreement.\n\n“There’s a deal, they won’t be able to give anything less than what is in the deal,” he said. “I don’t believe that Hamas can behave otherwise.”\n\nEgyptian security sources told Reuters they expected heavy construction equipment to enter on Thursday and if that happened then Hamas would release prisoners on Saturday.\n\nThe standoff between Israel and Hamas has threatened to reignite their conflict, which has devastated Gaza and taken the Middle East to the brink of a wider regional war.\n\nEgyptian and Qatari officials have been working to avoid a breakdown and a Palestinian official close to the mediation effort said both sides had agreed to go ahead with the ceasefire and the exchange of prisoners.\n\nTents, medical supplies\n\nThe talks in Cairo have focused on issues such as Israel’s allowing the entry of mobile homes, tents, medical and fuel supplies, and heavy machinery needed for the removal of rubble, Hamas said.\n\nSalama Marouf, head of the Hamas-run government media office in Gaza, told Reuters only 73,000 of the required 200,000 tents had arrived in the enclave, while no mobile homes had been permitted so far.\n\nCOGAT, the Israeli military agency overseeing aid deliveries into Gaza, said 400,000 tents had so far been allowed in, while countries meant to supply mobile homes had not yet sent them.\n\nInternational aid officials confirmed that aid was coming in despite considerable logistical problems, though they cautioned that far more was needed.\n\n“We have seen improvement in some ways, but certainly, the response is nowhere near enough to meet the needs of so many people who face so much destruction and loss,” said Shaina Low, an official from the Norwegian Refugee Council based in the Jordanian capital Amman.\n\nShe said shelter materials were going in, despite Israeli restrictions on so-called “dual use” materials, which could also be used for military purposes.\n\nPublished in Dawn, February 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/14080713a2a16d6.jpg",
  "retrievedAt": "2025-10-12T01:25:25.226Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891808/hamas-signals-readiness-to-move-forward-with-truce",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T02:23:26.000Z"
}
