{
  "title": "Govt lifts restriction on construction industry to benefit labor community: Asad Umer",
  "link": "https://www.app.com.pk/national/govt-lifts-restriction-on-construction-industry-to-benefit-labor-community-asad-umer/",
  "date_published": "2020-04-04T03:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 4 (APP):Minister for Planning and Development, Asad Umer on Saturday said that government had lifted the restriction on construction industry to benefit the labour community attached with construction sector.\nIn order to remove the miseries and hardships faced by daily wage workers linked with construction work, the present leadership had ordered to open the industry, the minister stated this while talking to a private news channel programme. Expressing dismay over lack of working of institution responsible for collecting data of labour community, he said unfortunately, Pakistan did not have proper data system of labour class working in the construction sector. In advance countries, he said the data of labour community could be collected easily. To a question about choosing “Tiger Force” symbol by Pakistan Tehreek e Insaf (PTI), for distribution of food items among deserving families observing lock down in the country in wake of Coronavirus pandemic, the federal minister said that Pakistan Muslim League-Nawaz and other rival parties should expressed satisfaction over the name of “Tiger” because that the slogan had been used by PML-N leaders during election campaign.\nThe Opposition, he lamented was playing politics on non-issues. He advised that they (Opposition) should come forward for helping the lower income group rather to focus on criticizing positive initiatives of the PTI government.\nTo another question about report on shortcomings of wheat and sugar industry, the minister said that Imran Khan as Prime Minister of Pakistan would never let lose the elements behind this gruesome negligence.",
  "retrievedAt": "2025-08-11T19:03:06.291Z"
}
