{
  "title": "Zulfi Bukhari criticises opposition for doing politics over corona crisis",
  "link": "https://www.app.com.pk/national/zulfi-bukhari-criticises-opposition-for-doing-politics-over-corona-crisis/",
  "date_published": "2020-04-04T05:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):Special Assistant to Prime Minister Syed Zulfi Bukhari Saturday advised opposition to stop “politicizing” the rising cases of deadly coronavirus in the country and invited them to fight against the common enemy unitedly as it was not right to blame anyone for this challenge.\nTalking to private news channel, he criticized opposition parties for doing politics over corona crisis, adding for this common enemy, there was need to shut down politics for some period of time. He said the opposition should avoid doing politics on the pandemic.\nBukhari said that he would take a legal action against PML-N leader Khwaja Asif for levelling false allegation that he was involved in allowing pilgrims to go to their homes without completing 14-day quarantine at Taftan, .\nReplying to a Question , he appreciated the Prime Minister Imran Khan for announcing historic package for construction industry that would create lots of job opportunities for daily wagers.\nBukhari said with the revival of construction industry, many other industries would also groom as they were linked with this industry.\nThe government was monitoring the situation regarding COVID-19 very closely and taking all possible measures to retrieve the economy that was affected after the outbreak of the pandemic and lockdown in the country, he added.\nHe pointed out the main focus of the government was to maintain supply and demand of commodities so that the consumer could not be suffered.\nTalking about Pakistanis stuck in other countries he said, there was need to increase capacity of airports and from UK, the government was starting flights and people would returned after complete coronavirus tests.\nThe number of coronavirus cases would be increased all over Pakistan in coming weeks, he said, adding, all precautionary measures must be observed and blood transition and surgical equipment should be cleaned properly before and after use.\nThe government machinery was vigilant enough to face any situation and counter Covid-19 challenge, but collective efforts were need of the hour, he said.\nHe appreciated that provincial, federal governments and the institutions were on same page in contain the pandemic.\n“I appreciate and salute paramedical and hospital staff. We should not forget our daily-wagers at this crucial moment. It is high time to help those poor people who are in need of financial assistance,” he added.",
  "retrievedAt": "2025-08-11T19:03:02.734Z"
}
