{
  "title": "Nation to emerge successful from Covid 19 challenge: PM",
  "link": "https://www.app.com.pk/national/nation-to-emerge-successful-from-covid-19-challenge-pm/",
  "date_published": "2020-04-04T08:59:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 04 (APP):Prime Minister Imran Khan Saturday while expressing his optimism in charity giving capability of the nation, termed the recent challenge of coronavirus (Covid 19) epidemic as a real test which should be faced with patience and sagacious behavior, besides strict observance of self-discipline.\nAddressing at PM’s relief fund for Covid 19, he assured that all the donations and contributions to support the vulnerable segments of the society would be made through judicious and transparent way through use of latest scientific applications.\nThe prime minister said there would be no political interference with regard to distribution of such relief package.\nThe prime minister said that Allah Almighty had always tested nations with trials and tribulations and those emerge stronger which faced such testing times with patience.\n“A good man faces hard times and often emerges from the trials without seeking a shortcuts. It is a testing time for the nation to bear it with patience. It is a test of the nation, though it is indeed a difficult time as no one had the experience as how to deal with coronavirus challenge,” he opined.\nFederal ministers, special assistants, governor and chief minister of Punjab and large number of philanthropists and representatives from the charity and welfare organizations were present on the occasion.\nOn the occasion, different philanthropists and members from the welfare and other organizations made donations through cheques or rations supplies.\nThe prime minister referring to recent impacts of the corona pandemic, said the rich countries with strong institutions and perfect health system had been collapsed. The US government had announced a relief package of worth 2000 billion dollars, but his government could only hardly announced 8 billion dollar relief package due to the limited resources, he added.\nIn Pakistan, he said they had already the challenge of poverty as fifty to sixty million people were living below the poverty line while other with the same numbers had been living on the verge of this line.\n“Inshalla, the nation will be a different one after overcoming this challenge,” he added.\nThe prime minister regretted that the vision for which Pakistan had been created could not be fully realized. Pakistan came into being on the principles of Islamic welfare state which also found its place in the thinking of Allama Iqbal.\nThe prime minister said in the country, religion was often misused for the political reasons.\nHe referred to the creation of State of Madina, which was a role model among the civilizations of the world. For the first time, a state took responsibility of looking after the welfare of its vulnerable population. The same reflection was manifested in the creation of the humane system binding the Muhajirs of Madina with Ansar of Makkah.\nThe prime minister said that all the available resources would be utilized to support the nation in this difficult time and referred to his government’s biggest package which would be followed by more.\nHe maintained that all efforts were being made to protect the daily wagers,rickshaw drivers, carts owners, labourers, and other workers associated with the construction sector as they had been sitting at homes out of the current challenge.\nThe prime minister said on one hand, they had make efforts to contain the coronavirus and on the other to look after the vulnerable segments of the society.\nHe said about 100 million people had already been badly hit in the country with corona pandemic and it could further cast effects upon others as well.\nThe prime minister enumerated government’s efforts with regard to opening of the construction and agriculture sectors which would buttress the people living in the rural and urban areas of the country.\nHe further said that they had been considering and evaluating the situation closely with compiling of the data. In case of any emergence of cluster outbreak, they would go for lockdown but in that case, they would have to ensure supply of foodstuff to those areas, he added referring to the situation in Chinese city of Wuhan.\nThe prime minister said that the number of Corona Relief Tiger force had reached to six lac which would be utilized to deal with such like situation.\nHowever, he cautious that it might be a long drawn fight and urged the nation to remove all misconceptions by adopting a careful behavior over coronavirus. He cited the conditions in New York city which was a home to billionaires with huge resources.\nThe prime minister also expressed the satisfaction that the nation ranked among the top five countries of the world which had been generous in giving away alms and donations. Today, number of philanthropists had immensely increased with different show biz personalities and sportsman making donations.\nHe termed this charity giving quality as the biggest power of the nation.\nThe prime minister also urged all parliamentarians and politicians to continue sharing their responsibility and come forward in this critical time.\nHe also announced that soon a Facebook page would be launched to get feedback from the people suffering from the difficult situation and contributions announced by the organizations.",
  "retrievedAt": "2025-08-11T19:02:58.055Z"
}
