{
  "title": "Clinical trials of PEC’s ventilators start at three hospitals: Fawad Ch",
  "link": "https://www.app.com.pk/national/clinical-trials-of-pecs-ventilators-start-at-three-hospitals-fawad-ch/",
  "date_published": "2020-04-04T06:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Saturday said clinical trials of Ventilators in Pakistan were being started at Jinnah Hospital Lahore, Indus Hospital Karachi and CMH Rawalpindi.\nIn a tweet , Fawad Chaudhry conveyed that two approved designs of ventilators of Pakistan Engineering Council (PEC) have been selected for this final phase which is a great development for Pakistan.\nAccording to a news release shared by the federal minister in his tweet, PEC has been assigned the lead role to innovative Engineering and Technological solutions including ventilators.\nPEC has asked all engineers and designers to share details to assist in regulatory approvals.\nOut of 48 proposals initially, 02 designs based on prototype availability were sent for clinical testing permission to Drug Regulatory Authority of Pakistan (DRAP).\nAs of today 4x applications have been submitted to DRAP.\nClinical tests/ trials are planned in Indus Hospital Karachi, Jinnah Hospital Lahore and CMH Rawalpindi for 3x prototypes available by designers, the press release stated.\nThis is a continuous process all designers are welcome to present design prototypes so that this effort goes on and maximum designed products make it to serial production.\nThe aim is to promote industrial manufacturing of electro-medical equipment and devices.\nOur defence/strategic organizations are also working on manufacturing of the masks, sanitizers and Ventilators’ and soon we would have good news.\nDue to concerted efforts of scientists, researchers engineers and technologists of universities, private sector and defence organizations, Pakistan would achieve some good breakthroughs in local manufacturing of electro-medical devices and equipment, the press release further added.",
  "retrievedAt": "2025-08-11T19:03:01.637Z"
}
