{
  "title": "Govt submits report on NAP for combating Coronavirus outbreak",
  "link": "https://www.app.com.pk/national/govt-submits-report-on-nap-for-combating-coronavirus-outbreak/",
  "date_published": "2020-04-04T03:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):The government on Saturday submitted to the Supreme Court of Pakistan a report on its national action plan (NAP) for combating the Coronavirus pandemic spreading across the country.\nIn its report, the government detailed the situation arising in the wake of the pandemic and the severity of suspected cases.\n“The testing of quality should enhance,” it added, while also emphasising the necessity of training burial workers and religious leaders on proper protocols for burial of patients who died from Covid-19.\nThe report sought to inform the court about the steps taken by the government so far and also solicit recommendations from the apex court for further action.\nThe report claimed that the Ministry of National Health Services, Regulation and Coordination (NHSRC) started off early preparations to deal with the Covid-19 pandemic. These efforts included establishing Standard Operating Procedures for screening of people at all points of entry and issuing guidelines for contact management to all provinces.\nAccording to the report, testing facilities have been established in all the provinces, Azad Jammu and Kashmir and Gilgit-Baltistan while indigenously developed testing kits by the National University of Science and Technology (NUST) had been sent to DRAP Technical Assessment Committee. If these testing kits were approved, they would then be made available to the public.\nIt also said some 13,000 surveillance centres had been set up across the country which would submit data to the Public Health Emergency Operation Centre (EOC) at the National Institute of Health, Islamabad. The EOC had also been made responsible to submit daily situation reports and to conduct data analysis and risk assessments.\n“Funds from World Bank and Asian Development Bank were also used for strengthening preparedness and response to the Covid-19 pandemic,” the report said.\nIt added that the ministry of finance had also released emergency funds for dealing with the Coronavirus.\nIt also said that arrangements had been made in 154 districts across the country to keep suspected patients of the virus under quarantine.",
  "retrievedAt": "2025-08-11T19:03:06.319Z"
}
