{
  "title": "CCLC meeting discusses draft of Criminal Law Reforms",
  "link": "https://www.app.com.pk/national/cclc-meeting-discusses-draft-of-criminal-law-reforms/",
  "date_published": "2021-09-30T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP):The Cabinet Committee for Disposal of Legislative Cases (CCLC) on Thursday discussed the draft of criminal law reforms.\nFederal Minister for Law and Justice Barrister Dr. Muhammad Farogh Naseem chaired the meeting of CCLC. Federal Minister for Human Rights Dr. Shireen Mazari, Federal Minister for Railways Azam Khan Swati, Minister of State for Parliamentary Affairs Ali Muhammad Khan, Parliamentary Secretary for Law and Justice Barrister Maleeka Ali Bukhari, members of National Assembly Bashir Khan, Rai Murtaza and senior officers of various departments attended the meeting.\nSignificant agenda item was “Criminal Law Reforms, 2021” proposed by Barrister Dr. Muhammad Farogh Naseem which was thoroughly discussed in the meeting. Shireen Mazari, Ali Muhammad Khan, Basir Khan, Rai Murtaza gave their suggestions.\nPrior to the meeting, Federal Minister for Narcotics Control Ejaz Ahmad Shah also presented his suggestions regarding the draft to the Law Minister and appreciated the reforms.\nThe Law Minister heard the suggestions of all the committee members and answer their queries.The Law Minister said that these amendments would introduce an efficient and expeditious procedure for filing FIRs and would significantly reduce the number of pending cases as the time to pursue cases would be greatly reduced, police abuse with the public would also be eradicated.\nThese amendments would enable cases to be brought to a transparent conclusion, evidence gathering would be further improved and expedited, modern tools would be used to deliver justice, he added.\nHe said that a draft of amendment to the criminal law would be presented to the federal cabinet for approval after recommended by the committee.\nDr. Barrister Frogh Naseem said that the laws of other countries were also studied while drafting amendments to the Criminal Law.\nExperts were of the view that if the amendments pertaining to Criminal Reforms, as introduced by Dr. Farogh Naseem, Law Minister, were properly implemented, it would completely overhauled the criminal justice system in Pakistan.",
  "retrievedAt": "2025-08-11T21:21:24.169Z"
}
