{
  "title": "By US withdrawal, Imran Khan vindicated for prescient position on Afghanistan: FT",
  "link": "https://www.app.com.pk/national/by-us-withdrawal-imran-khan-vindicated-for-prescient-position-on-afghanistan-ft/",
  "date_published": "2021-09-30T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): The withdrawal of the US troops from Afghanistan and Taliban takeover have vindicated Prime Minister Imran Khan which made his decades-old position on Afghanistan look prescient.\n“Pakistan’s Prime Minister Imran Khan appears vindicated by the Taliban takeover in Afghanistan,” a Financial Times report said Thursday.\nIt said Imran Khan had for years criticised the US invasion of Afghanistan. Long before US President Donald Trump signed a withdrawal deal with the Taliban, Khan had been pushing for peace talks.\nHe had repeatedly decried the US war on terror, and its involvement in Afghanistan since 2001, saying in countless interviews that it was one of Pakistan’s “biggest blunders” to get involved, a mistake that cost over 70,000 Pakistani lives compared with less than 2,500 American soldiers.\nIn 2013, as chair of his Pakistan Tehreek-e-Insaf party, Khan threatened to block NATO supply routes after US drone strikes in Pakistan. For his stance, he was even ridiculed by critics who said his positions were hollow and half-baked.\nImran Khan’s recent calls to engage with and “incentivise” the Taliban since it took power resonate in Pakistan, where the US war on terror has bred resentment and hostility,” the London based daily said.\nFor his government’s handling of the coronavirus pandemic — a far lower death rate and less economic disruption compared with arch-rival India — polls say Khan was now on track to become Pakistan’s first prime minister to complete a full term since Zulfikar Ali Bhutto in the 1970s, and be re-elected.\nAs Khan steers the country through a radical reshaping of the geopolitical order of South Asia with the US exit from Afghanistan, Pakistan is seeking to re-establish itself as a strategic bridge in the region for the world’s great powers.\nKhan went on the offensive at the UN General Assembly on September 24, when in a pre-recorded speech he criticized the US for using Pakistan as a scapegoat for its failures in Afghanistan.\n“If the world community incentivises them [the Taliban], and encourages them to walk this talk, it will be a win-win situation for everyone,” Khan told the Assembly.\nThe latest poll by Gallup Pakistan shows him with a 48 per cent approval rating, his highest since coming into power in 2018, and seven out of 10 Pakistanis believe he will complete his five-year term before elections in 2023.\n“Imran Khan and the military are on the same page,” says Bilal Gilani, executive director of Gallup Pakistan.\nYet government insiders say Khan’s gut instinct on issues — such as his decision not to enforce a harsh coronavirus lockdown thus sparing the poor from an even greater economic catastrophe — have proved popular.\n“When everyone shut down [during the pandemic], Khan said ‘no, you need to trust me on this’,” says a government adviser. “We thought he was a goner, that the government would collapse, but he proved us wrong.”\nPakistan’s economy is expected to expand at an annual rate of 4 per cent in 2022, boosted in part by expansionary fiscal policies introduced to revive growth following the shock of the pandemic.",
  "retrievedAt": "2025-08-11T21:21:25.663Z"
}
