{
  "title": "RUDA to showcase Pakistan’s largest theme park project in Dubai Expo, PM told",
  "link": "https://www.app.com.pk/national/ruda-to-showcase-pakistans-largest-theme-park-project-in-dubai-expo-pm-told/",
  "date_published": "2021-09-30T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Prime Minister Imran Khan was on Thursday briefed about the plan of Ravi Urban Development Authority (RUDA) to build Pakistan’s largest theme park in collaboration with IMG Dubai Theme Park.\nRUDA will showcase this theme park project – planned over 2000 kanals of land on the Ravi river front – in the upcoming Dubai Expo 2020 for attracting investment, he was told.\nThe Prime Minister was chairing a review meeting on RUDA and Central Business District (CBD), Walton.\nThe meeting was attended by Finance Minister Shaukat Tarin, Minister of State for Information and Broadcasting Farrukh Habib, Special Assistant on Political Communication Dr Shahbaz Gill, Chairman Naya Pakistan Housing and Development Authority (NAPHDA) Lt. Gen. ® Anwar Ali Haider and senior officers.\nPunjab Local Government Minister Mian Mehmood ur Rasheed, Advocate General Punjab Ahmed Awais, Chief Executive Officer (CEO) RUDA Imran Amin, Advisor to CM Punjab Dr Salman Shah and other officers concerned from Punjab joined the meeting via video link.\nCEO RUDA briefed the Prime Minister about various challenges being faced by RUDA in the smooth execution of its various projects.\nThese projects include installation of solar-based renewable power generation plant, establishment of Special Economic Zones (SEZs) and Special Technology Zones (STZs), launching of ferry operations, establishment of knowledge Park and Rakh Jhok farms.\nThe Prime Minister was briefed that all these projects were designed to generate their own revenue streams in order to ensure their sustainability.\nThe Prime Minister reiterated the importance of both RUDA and CBD for the promotion of smart, self-sustaining, clean and green housing and business projects in the country.\nHe directed the authorities concerned to resolve the issues by adopting a proactive strategy so that Pakistan could reap maximum benefits of these modern and sustainable real estate projects by attracting Foreign Direct Investment (FDI).",
  "retrievedAt": "2025-08-11T21:21:25.738Z"
}
