{
  "title": "Safe, exploitation-free society for women everyone’s responsibility: President",
  "link": "https://www.app.com.pk/national/safe-exploitation-free-society-for-women-everyones-responsibility-president/",
  "date_published": "2021-09-30T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): President Dr Arif Alvi Thursday said that it was everyone’s responsibility to ensure a safe and exploitation-free society to the women; however, it required mass awareness as well as behavioral change.\nThe president, addressing a seminar on “Protection against Harassment and Women Property Rights” organized by Federal Ombudsman Secretariat for Protection Against Harassment” said every civilized society always protected the rights of vulnerable groups.\nHe said Islam had guided the followers on women rights including inheritance rights contrary to the west where everything belonging to women was considered men’s property until first decade of 20th century.\nHe said the additional mandate to the Ombudsman to hear cases of women property rights would open up new avenues for rights’ protection.\nThe president said the tendency of depriving women of their inheritance rights was in vague across the world however Islam highly valued justice for women among its teachings.\nHe said as the intellectual labour had replaced physical labour to a great extent, it had created immense opportunities for women to prove their capabilities in the society.\nHowever, the women had to face the social biases which necessitated the behavioral change as the society was bound to discourage any injustice to women. If the society continued to tolerating the usurpers of women rights, the state would be compelled to involve police, he added.\nThe president also emphasized the media role to aware women of their rights as well as the institutions established by the government for their protection. Moreover, the role of mosques was also essential to preach and portray women rights guaranteed by Islam.\nHe said the focus on women’s better health and education was also equally important for what the society would need to be accommodative.\nPresident Alvi said women would continue to feel shy to report their incidents of harassment unless they had confidence for their protection.\nHe lauded a recent decision of Balochistan High Court ruling that a woman could not gift her inherited property to anyone without once being transferred to her.\nHe said it was justice, not resources to lead any society to progress and hoped that Pakistan would also emerge as a just society based on the struggle of all segments.\nSpecial Assistant to Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar said the inability to capitalize the women’s potential was tantamount to losing the contribution of half of the population.\nShe said unlike some other countries, Pakistan did not have systematic constraints for women as women’s ratio was constantly on rise in higher education as well as civil services.\nShe said over 50% of the beneficiaries of Ehsaas Program were women and even they were 100% beneficiaries of some of the programs.\nCountry Representative of UN Women Sharmeela Rasool said giving mandate of hearing property rights to Ombudsman was a timely step.\nShe said it was essential to ensure easy mobility for women and called for everyone’s role in this regard.\nFederal Ombudsman for Protection against Harassment Kashmala Tariq said the Ombudsman had come a long way to create awareness on women rights and had placed a systematic mechanism of deterrence.\nShe said the Ombudsman had been given mandate to arbitrate where the women rights were being infringed. Kashmala Tariq said the new mandate had made a huge impact and lauded the proactive role of President Arif Alvi for pushing and empowering the Ombudsman to ensure protection of women rights.",
  "retrievedAt": "2025-08-11T21:21:30.113Z"
}
