{
  "title": "CPEC’s Matiari-Lahore power transmission line to cut losses to 4pc: PM",
  "link": "https://www.app.com.pk/national/matiari-lahore-power-transmission-line-to-cut-line-losses-from-17-to-4pc-pm/",
  "date_published": "2021-09-30T08:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Prime Minister Imran Khan on Thursday said the operationalization of the country’s first-ever transmission line of 660 KV High-Voltage Direct Current (HVDC) would reduce line losses from 17 to four percent, resulting in availability of cheap electricity for consumers.\nAddressing at the inauguration of 886-kilometre-long Matiari-Lahore HVDC with a capacity of 4,400 megawatt power generation under the China Pakistan Economic Corridor (CPEC), the prime minister said the project would prove as a “leading energy transmission artery from the country’s south to north”.\nImran Khan said the significant reduction of line losses would save billions and also lessen the burden on common man paying the expensive electricity bills.\nHe regretted that the previous government did not carry out on-ground work on the Matiari-Lahore project signed with China in 2013, which made the public immensely suffer the power load-shedding.\nThe prime minister expressed satisfaction that his government after assumption of power in 2018 carried out the construction work of the state-of-the-art Matiari-Lahore project at full pace and completed it despite the pandemic.\nBesides energy, he said, other CPEC projects under Chinese President Xi Jinping’s Belt and Road Initiative relating to industrialization and innovation in agriculture would be launched in the next phase.\nHe hoped that completion of CPEC projects would lead to wealth creation and help the government pay off heavy debt.\nFederal Minister for Energy Hammad Azhar said the project, which was made operational after testing it in three phases including the peak seasons, would help in removing the transmission bottleneck.\nHe said the CPEC power projects were the important pillars of Pakistan’s economic system and were acting as “smart and efficient sources” of green energy generation.\nChinese Ambassador Nong Rong terming the operationalization of 660 KV HVDC project a milestone said Pakistan’s power grid system had now entered a new era of development and upgradation.\nHe said cheap electricity was key to socio-economic development of Pakistan and vowed that China would continue to extend its support in this regard.\nHe mentioned that the 886 km transmission line would go along 510 km of motorway and create around 70,000 jobs in the country.\nPresident State Grid Corporation of China Xin Baoan in his video-link address to the ceremony said the 70th anniversary of Pak-China friendship was marked by cooperation at diverse levels for the benefit of their people.\nHe said his corporation would work closely with its local counterparts in Pakistan on projects of energy cooperation.\nThe HVDC transmission line project will evacuate power from the upcoming coal-based thermal power plants located at Port Qasim, Hub and Thar.\nThe National Transmission and Dispatch Company (NTDC) carried out a study through an international consultant which proposed HVDC technology for transfer of bulk power for its cost-effectiveness and lower line losses. Moreover, the requirement of ‘right of way’ for HVDC is less than High-Voltage Alternate Current (HVAC) lines.\nThe HVDC  line Matiari in Sindh to Lahore in Punjab will have 1973 towers and two converter stations with AC substations, one each at Matiari and Lahore.\nIt will have two grounding stations at 50-80 km from Matiari and Lahore converter stations and three repeater stations along the route of line to boost telecommunication signals, each at Salehpat, Rahiim Yar Khan, Hasilpur.\nThe National Electric Power Regulatory Authority (NEPRA) has approved the total cost of the project of $1,658 million (including taxes, insurance etc.) and has issued a tariff determination of Rs.0.74 per kWh at the rate of $ 1 (equal to Rs 104.4).\nThe monthly HVDC Line capacity charges for 4,000 MW are Rs 4.2 billion approximately (after indexation in tariff).\nThe project is being executed on Build, Own, Operate and Transfer (BOOT) basis for a 25 years term. The operation and maintenance of the converter stations will be carried out by Pak MLTC and that of the Transmission Line by NTDC.\nThe self-supported towers have been installed for bi-pole HVDC line with Quad Bundle Conductor and size of 4×1250 mm2.\nThe NEPRA has fixed the line availability factor of 98.5 percent and any non-availability beyond 1.5 pecent allowed unavailability shall be penalized. The EPA (Environmental Protection Agency) of the Sindh government and Punjab government have issued No-Objection certificates for EIA (Environmental Impact Assessment).\nThe testing and commissioning of the project continued for more than one year and was completed on August 18, 2021 after its trial run for 168 hours along with capability demonstration tests.",
  "retrievedAt": "2025-08-11T21:21:21.197Z"
}
