{
  "title": "Pakistani Opera singer Saira Peter promotes Sufism at Turkey’s Mystic Music Festival",
  "link": "https://www.app.com.pk/national/pakistani-opera-singer-saira-peter-promotes-sufism-at-turkeys-mystic-music-festival/",
  "date_published": "2021-09-30T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP):After soprano’s heart-capturing performance at Mystic Music Festival in Konya, Turkey, Pakistan first Sufi Opera singer Saira Peter was invited to Ankara for an enthusiastic reception organised by Embassy of Pakistan.\nAmbassador of Pakistan to Turkey Muhammad Syrus Sajjad Qazi highly commended Opera singer for taking the Sufi message worldwide, said a press release.\nAmbassador Qazi remarked how proud Pakistan is of Saira Peter’s efforts to lift Sufi values across the western world, through their own language and cultural idiom.\nThe other officers present also praised her, acknowledging how her ability to sing in seventeen languages takes Sufi values even further.\nAs Pakistan’s first operatic voice and the world’s first Sufi opera singer, Ms. Peter had been invited by the Turkish government’s Department of Culture to perform at the 18th annual Mystic Music Festival, Konya, which commemorates the birthday of Maulana Jalaluddin Rumi.\nShe also gave a live performance of Maulana Jallaludin Rumi’s Qawwali, which she had specially composed for the festival, leaving her listeners spellbound.\nFollowing this, Ms. Peter and team also called on US Deputy Officer of Cultural Affairs Victoria O’Connell, who also appreciated Saira Peter and her American-British husband Stephen Smith’s endeavours.\nLater on Smith, who is also her music director and accompanies Ms Peter on harmonium and piano, described how they travel to US universities giving workshops and demonstrations of Sufi music, Pakistani-western fusion and lectures on Sufi values.\nLastly, the Sufi opera star and her group were also called on British Ambassador Dominick Chilcott at the British Embassy.\nMs Peter told the Ambassador of her upcoming English language ‘Sufi opera’ relating the story of Umar Marvi and highlighting women leadership. The musical drama will feature an international cast and be initially staged in London.\nShe is presently working with her creative team to discover and develop this new genre ‘Sufi opera’, which she describes as an amalgamation of East and West. Ambassador Chilcott expressed appreciation for her efforts and said he looks forward to co-organising her concert in November, in cooperation with Pakistan Embassy.",
  "retrievedAt": "2025-08-11T21:21:28.410Z"
}
