{
  "title": "Israel kills 73 more Palestinians - World - DAWN.COM",
  "author": null,
  "content": "• Tanks fire into crowd trying to get food from trucks in Gaza\n• Worst death toll in a single day since aid resumed in May\n\nCAIRO: Israeli tanks fired into a crowd trying to get aid from trucks in Gaza on Tuesday, killing at least 59 people, according to medics, in one of the bloodiest incidents yet as desperate residents struggle for food.\n\nMedics said at least 14 other people were also killed by Israeli gunfire and air strikes elsewhere in the densely populated enclave, taking Tuesday’s overall death toll to at least 73.\n\nVideo shared on social media showed around a dozen mangled bodies lying in a street in Khan Yunis in the southern Gaza Strip. The Israeli military acknowledged firing in the area and said it was looking into the incident.\n\nWitnesses interviewed by Reuters said Israeli tanks had launched at least two shells at a crowd of thousands who had gathered on the main eastern road through Khan Yunis in the hope of obtaining food from aid trucks that use the route.\n\nPalestinian medics said at least 59 people were killed and 221 wounded in the incident, at least 20 of them in critical condition. Casualties were being rushed into the hospital in civilian cars, rickshaws and donkey carts. It was the worst death toll in a single day since aid resumed in Gaza in May.\n\nIn a statement, the Israeli military said: “Earlier today, a gathering was identified adjacent to an aid distribution truck that got stuck in the area of Khan Yunis, and in proximity to IDF troops operating in the area.\n\nThe health ministry said 397 Palestinians, among those trying to get food aid, had been killed and more than 3,000 were wounded since late May.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6851f7a7eb329.jpg",
  "retrievedAt": "2025-08-20T04:10:28.360Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917729/israel-kills-73-more-palestinians",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:18:11.000Z"
}
