{
  "title": "Spread of hate - Newspaper - DAWN.COM",
  "author": null,
  "content": "HATE speech is not confined to words; in fact, there is a causal link between hateful rhetoric and real-world violence. That is why today, as we observe the International Day for Countering Hate Speech, states worldwide must re-examine their efforts to counter violent and hateful speech both online and in the real world.\n\nThis year’s theme is ‘Hate speech and artificial intelligence’. As the UN chief notes, “biased algorithms and digital platforms are spreading toxic content and creating new spaces for harassment and abuse”.\n\nIn Pakistan, we have witnessed the deadly consequences of ignoring hate speech, as extremist groups have used online platforms — along with more traditional methods — to mobilise against certain communities.\n\nSometimes hatemongers have provoked members of the majority community to prevent minority groups from observing their religious rites. In other, more violent episodes, there have been organised attacks on various confessional groups on flimsy, often fabricated grounds. In all these instances, hate speech has amplified matters.\n\nTherefore, while the state has banned extremist groups, there must also be stringent punishment for individuals or outfits that spread venom and endanger lives.\n\nThe fact is that hate speech is a worldwide problem. For example, in India, even elected officials have been witnessed using vile, inflammatory language against Indian Muslims. It appears that members of the Sangh Parivar can get away with murder, as the BJP-led government is not interested in clamping down on anti-Muslim hate.\n\nEven in the supposed democracies of the West, Islamophobia has become a major concern. Figures collected by the UK advocacy group Tell Mama reveal that Islamophobic incidents were at a record high in 2024.\n\nNumbers from the US, released by CAIR, a Muslim community organisation, tell a similar story. The incidents range from abusive behaviour to actual physical assaults. It is also true that in many societies, the far right is treating Muslims as well as people of colour and immigrants as bogeymen responsible for society’s ills. Recent riots in Northern Ireland were apparently racially motivated.\n\nAll states need to take a firmer line against hate groups, and the targeting of individuals based on their religion or ethnicity. The world seems to be drowning in a cesspool of hatred, and governments must adopt a zero-tolerance approach against individuals or groups that promote violence and the exclusion of others. Cracking down on hate speech, whether in the virtual realm or the real world, is the first step.\n\nIn this regard, Big Tech must also be held to account, as social media platforms often turn into breeding grounds for abhorrent, hateful rhetoric, with little to no moderation. These platforms cannot be allowed to ignore their responsibilities, especially when their negligence is putting lives at risk.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:09:59.927Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917807/spread-of-hate",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:32:30.000Z"
}
