{
  "title": "Balochistan Budget 2025-26: Biggest-ever Rs1.03tr budget unveiled for ‘sustainable progress’ - Business - DAWN.COM",
  "author": null,
  "content": "• Aims at cash surplus of Rs36.5bn through ‘austerity’\n• Major initiatives include infrastructure projects, reforms, job creation and restoration of peace • Minister Nausherwani claims entire development fund of Rs219bn fully utilised for first time in outgoing year\n\nQUETTA: The PPP-led government in Balochistan on Tuesday presented its second budget of the current term, featuring a record outlay of Rs1.03 trillion and proposing a development expenditure of Rs349.5 billion.\n\nThe budget for the fiscal year of 2025-26 also commits to ‘austerity’ in its current expenditure, aiming to produce a provincial cash surplus of Rs36.5bn, according to budget documents.\n\nThe budget was presented by Finance Minis­ter Mir Shoaib Nausherwani in the Balochistan Assembly, who claimed it was “not a mere document”, but a “roadmap for sustainable economic progress” of the strife-ridden province.\n\nHe claimed the government fully utilised the development budget — Rs219bn — for the first time in history in the outgoing fiscal year.\n\nIn comparison, the average utilisation had been 60pc during the three previous years.\n\nThe budget projects most of its receipts — Rs801bn — in the shape of its share from the federal tax divisible pool and straight transfers.\n\nMeanwhile, revenue generation from the pro­vince’s own-source is estimated to be Rs101bn, including Rs48bn from levy on services.\n\nThe federal and foreign assistance for development projects is estimated to be Rs104.5bn.\n\nThe current expenditure is projected to stay around Rs642bn while the development allocations of Rs349bn include provincial PSDP of Rs245bn, federal assisted schemes of Rs66.5bn and foreign assisted projects of Rs38bn.\n\nMr Nausherwani said the government would will extend the ban on the purchase of new cars except for law enforcement agencies as a part of its austerity drive.\n\nHe claimed the government had reduced its budgeted current expenditure during the outgoing fiscal year from Rs609bn to Rs544bn by cutting wasteful spe­n­ding and increased total allocations for development to Rs243bn.\n\nMajor initiatives\n\n“The major initiatives of the government for the FY 2025-26 include improving the basic infrastructure in far-off and backward areas of the province, preemptive measures to deal with emergency situations, introduction of modern reforms, strengthening of social sector, steps for social protection, creation of job opportunities and restoration of complete peace,” said Mr Nausherwani in his budget speech.\n\nHe claimed the budget document proposed steps for the welfare of all segments of society, including public servants, women, pensioners, youth, fishermen and labourers.\n\nThe government has proposed an increase of 10pc increase in salaries and a 7pc in pensions of all public-sector employees, in line with the federal government’s decision.\n\nThe Disparity Reduction Allowance for the government employees from Grade 1 to 16 has been increased to 20pc.\n\nThe minister said the government had abolished 6,000 extra jobs as part of its downsizing drive in various provincial departments under advice of the International Monetary Fund (IMF) to save Rs14bn for development schemes during the current fiscal year.\n\nHowever, he also announced plans to create 4,188 new contract and 1,958 regular posts in government departments next year to accommodate the youth entering the job market.\n\nHe said the government would has proposed projects in the next fiscal year that would “change the fortune of the people”.\n\nThese projects include safe city authorities in eight more cities with an allocation of Rs18bn, Rs20bn for public welfare at the district level, Rs3bn for sanitation schemes and 1,000 water filtration plants at the union council level and Rs25bn for the construction of a dam in Mashkel.\n\nMr Nausherwani added that Rs16bn have been allocated for the skill development of youth and ext­e­n­ding interest-free loans to them.\n\nSustainable development\n\nThe minister claimed his government’s priority would be projects to meet Sustainable Development Goals in FY26.\n\nSuch projects would include the construction of new dams, roads, indu­s­trial zones, terminals, railways sche­mes, microfinance and agriculture.\n\nHe said for the first time, a Rs500m grant is being allocated to protect the environment under the Balochistan Climate Change Fund.\n\nRs8bn have been earmarked for all universities of Balochistan, while the Higher Education Commi­ssion has also allocated Rs3bn.\n\nHe said the government would spend Rs28bn on Early childhood education and primary education in the next fiscal, while it allocated Rs6.7bn for Global Partnership Education.\n\nThe provincial government has allocated Rs16.4bn for the health sector and Rs71bn for the non-development budget.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6851faf41b97e.jpg",
  "retrievedAt": "2025-10-12T03:38:33.303Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917732/balochistan-budget-2025-26-biggest-ever-rs103tr-budget-unveiled-for-sustainable-progress",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:18:02.000Z"
}
