{
  "title": "Young married couple gunned down for ‘honour’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A young married couple was allegedly killed for honour by unknown armed men in Kahna area on Tuesday.\n\nThe victims were identified as Peer Mohammad and Safina and the police launched investigations into the double murder case after shifting the bodies to the city morgue for autopsy.\n\nA police official said the couple had contracted love marriage and recently shifted to a rented house on Ahlu Road. He said it seemed the couple was allegedly murdered over the ‘marriage issue’.\n\nQuoting initial inquiries, he said Safina (21), a resident of Shadbagh, had expressed her wish to marry Peer Mohammad (32) and requested her parents to give respect to her choice. However, her parents refused her as they wanted her to marry by the family’s choice.\n\nThe official said the girl continued her efforts to convince her parents arguing that being an adult she could make decisions for her future. The matter of marriage of her choice remained the hot issue of the family for some months, he said.\n\nThe official said the girl also introduced Peer Mohammad to her family but she was left disappointed when her parents rejected her proposal, insisting her to follow ‘her family’s orders whatever they are’.\n\nMeanwhile, the official said, she contracted love marriage to the ‘man of her choice’ who later rented a house in the jurisdiction of Kahna area some 15 days back.\n\nDuring the initial course of inquiry, it transpired that the family members of the girl were not only unhappy over her decision of love marriage but also nourished a grudge against her.\n\nThe inquiry revealed that the family was constantly chasing the couple and managed to trace them at Ahlu Road where they were living in a rented house.\n\nOn Tuesday, the police official said the girl was allegedly gunned down along with her husband and declared it an ‘honour killing’.\n\nThe police had questioned the owner of the house and other residents of the area to trace the families of the murdered couple to investigate them in the case.\n\nA police team had been dispatched for the arrest of the suspected killers, the police said.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:38:57.458Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917842/young-married-couple-gunned-down-for-honour",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:53:50.000Z"
}
