{
  "title": "US senator introduces bill to curb Trump’s power to go to war with Iran - World - DAWN.COM",
  "author": null,
  "content": "A PROMINENT Democratic senator has introduced a bill to require United States President Donald Trump to first seek authorisation from Congress before ordering military strikes against Iran, Al Jazeera reported.\n\nThe measure, put forward by Virginia Senator Tim Kaine on Monday, came amid growing calls by pro-Israel groups for the US to join the Israeli bombing campaign against Iran as the attacks between the two countries intensify.\n\n“I am deeply concerned that the recent escalation of hostilities between Israel and Iran could quickly pull the United States into another endless conflict,” Kaine said in a statement.\n\n“The American people have no interest in sending service-members to fight another forever war in the Middle East.\n\nThis resolution will ensure that if we decide to place our nation’s men and women in uniform into harm’s way, we will have a debate and vote on it in Congress.“\n\nThe bill invokes the War Powers Resolution of 1973, passed during the Vietnam War to constrain unilateral presidential powers to engage in military hostilities.\n\nThe US Constitution gives Congress the power to declare war, but successive US presidents have used their positions as the commander-in-chief of the armed forces to mobilise troops, initiate attacks and start conflicts without clear congressional authorisation.\n\nKaine’s proposal adds to the pressure Trump is facing from anti-war advocates in both major parties, advocates said.\n\nWhile Republican Party controls both houses of the US Congress, the resolution may pass if conservative lawmakers who oppose foreign military interventions join the Democrats in backing it.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:10:14.397Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917768/us-senator-introduces-bill-to-curb-trumps-power-to-go-to-war-with-iran",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:18:37.000Z"
}
