{
  "title": "Careem announces end of ride-hailing service in Pakistan from next month - Pakistan - DAWN.COM",
  "author": null,
  "content": "Careem will suspend its ride-hailing service operations in Pakistan from July after nearly a decade in the industry, its CEO announced on Wednesday, adding that its journey in the country would continue “in a different role”.\n\nMudassir Sheikha, Careem’s CEO and co-founder, shared a post on LinkedIn announcing “a new chapter” for the company.\n\n“It is with a heavy heart that I share this update: Careem will suspend its ride-hailing service in Pakistan on July 18,” Sheikha said, adding that it was “an incredibly difficult decision.”\n\n“The challenging macroeconomic reality, intensifying competition, and global capital allocation made it hard to justify the investment levels required to deliver a safe and dependable service in the country.\n\n“In the end, the Careem Rides team had to make this tough call,” he said.\n\nHe called the ride suspension “the end of an iconic chapter — one built with purpose, grit and a ton of relentless hustle”.\n\nSheikha highlighted some of Careem’s notable achievements while operating in Pakistan, including safe rides on demand, women travelling with strangers, and smartphones and digital payments for everyday use.\n\n“The challenges were real and formidable. But our Pakistan team was brilliant and fearless — bold, determined, and literally on a mission to create millions of jobs for captains across the country,” he said.\n\nHe lauded his team for building a service that millions of Pakistanis relied on “to move and earn”.\n\n“They delivered significant public goods: digital infrastructure, trust, regulation, capability, confidence — all of which paved the way for countless local and global digital ventures to take root in Pakistan.”\n\nSheikha added that “while ride-hailing is sunsetting, Careem’s journey in Pakistan continues in a different role.\n\n“Careem Technologies (the spinout building the Everything App) will continue to build from Pakistan for the region.”\n\nSheikha said that nearly 400 Careem employees from across all functions, including engineering, are building the Everything App and its ecosystem of verticals (food/grocery delivery, payments, and more).\n\n“This presence is only set to grow, with over 100 open roles and the expansion of our Falcon/NextGen programme that brings in top graduates from Pakistani universities and gives them hands-on training on building highly scalable systems,” Sheikha elaborated.\n\n“Pakistan is in Careem’s DNA — our first line of code was written here, and the country remains a rich source of innovation and talent for us,” he said.\n\nThe company said Careem Care will be available till September 18 to help users with any pending issues or questions, according to an update sent to a Dawn.com staffer who uses the app.\n\n“If you have remaining balance in your Careem Wallet, we’ll be in touch soon with clear instructions on how to reclaim it,” the update said.\n\nIn April 2024, Uber made the decision to cease operating its ride-hailing app in Pakistan, saying: “Our subsidiary brand Careem will continue to operate, with the Careem app offering ride-hailing services across Pakistan and earning opportunities for drivers.”\n\nCareem officially entered the Pakistani market in October 2015, offering an app, a website and a helpline where customers could order rides. It operates in 12 countries across the Middle East and North Africa, Turkiye and Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/06/181251565281c1e.jpg?r=125935",
  "retrievedAt": "2025-08-20T04:09:59.593Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917884/careem-announces-end-of-ride-hailing-service-in-pakistan-from-next-month",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T08:18:32.000Z"
}
