{
  "title": "MPC to devise ‘joint strategy’ against new taxes in Malakand - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Jamaat-i-Islami has rejected both federal and provincial budgets and announced to hold a multi-parties conference on June 25 to devise an effective joint strategy against new taxes.\n\nSpeaking at a press conference at Peshawar Press Club on Tuesday, former senior provincial minister and Emir Jamaat-e-Islami Khyber Pakhtunkhwa North (chapter) Inayatullah Khan, criticised both federal and provincial budgets, claiming that the people of Malakand division have been completely ignored vis-à-vis the development programme for fiscal 2025–26.\n\nFormer provincial minister Shah Raz Khan, who is also president, Tehreek-e-Huqooq Malakand, and former member National Assembly Sahibzada Tariqullah, ex-district nazim Sahibzada Fasihullah, and Tehsil Chairman Rafeeullah Khan were also present on the occasion.\n\nThe JI leader condemned the lack of financial relief for the Malakand region, adding, both federal and provincial governments weren’t interested in the development of Malakand division.\n\n“The provincial government violated the previous agreement by reimposing taxes on Malakand residents. We will not let this injustice stand, and a multi-parties conference will be held on June 25 to devise future course of action.”\n\nHe further lambasted the imposition of 18pc sales tax on solar panels, calling it “a punishment for self-reliance”. According to Inayatullah, the imposition of the tax meant to punish households seeking affordable alternatives to rising electricity costs. “The government is essentially forcing people to buy expensive power,” he said.\n\nHe noted that the federal budget offered tax relief to industrialists and elites and also questioned the credibility of provincial claims of fiscal strength, branding the “budget surplus”.\n\nThe JI leader also highlighted the contradiction in the provincial government’s budget document, which states it will raise Rs129 billion through local means. “Will this amount be extracted through illegal taxation in Malakand?” he asked, warning of public backlash as the Khyber Pakhtunkhwa Revenue Authority (KPRA) has already collected Rs200 million in taxes from Malakand.\n\n“The long-standing underfunding of tribal districts and local governments continues as funds haven’t been released in the last three years out of the annual allocation of Rs 45bn for local bodies,” he added.\n\nShah Raz Khan also spoke at the press conference, announcing that all political parties would soon unite under a single platform to oppose the tax imposition on Malakand division to protect the basic rights of the people.\n\nThe June 25 conference is expected to draw leaders from across the political spectrum in defence of the region’s economic and constitutional rights.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:38:36.919Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917848/mpc-to-devise-joint-strategy-against-new-taxes-in-malakand",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T02:05:20.000Z"
}
