{
  "title": "Building and delivering a nuclear weapon - World - DAWN.COM",
  "author": null,
  "content": "Iran has significantly ramped up production of highly enriched uranium — called near-bombs-grade material — in recent years, according to reports.\n\nIsrael on June 13 launched an unprecedented attack against its arch-foe, which it said was aimed at preventing Iran from acquiring nuclear weapons, an ambition Tehran denies.\n\nBut building and delivering a nuclear weapon requires several complex steps.\n\nThe key ingredient in a nuclear bomb is enriched uranium or plutonium, which can be obtained through the combustion of uranium.\n\nAlthough uranium is a relatively common mineral, more than 85 percent of uranium production comes from six countries: Kazakhstan, Canada, Australia, Namibia, Niger and Russia, according to the World Nuclear Association.\n\nNatural uranium is composed of uranium 238 (U-238), which makes up 99.3 per cent, and uranium 235 (U-235), the remaining 0.7pc. Only U-235, called “fissile uranium”, can be used for nuclear fuel.\n\nEnrichment refers to the process of increasing the proportion of U-235 to obtain enough fuel to make a nuclear bomb.\n\nFirst, uranium ore is crushed and ground before being irrigated with sulfuric acid. Then, groundwater and oxygen are injected into the rock to extract the uranium.\n\nAfter drying, the result is a concentrated solid known as “yellowcake”, which is transformed into uranium hexafluoride and then heated into a gaseous state to prepare it for enrichment.\n\nThe most common process for separating the heavier U-238 from the lighter U-235 involves the use of a series of centrifuges that spin the uranium at high speeds.\n\nThousands of centrifuges are needed to obtain a sufficient volume of enriched uranium. Only a handful of countries have such installations, which are vast and costly.\n\nAccording to the Institute for Science and International Security (ISIS), a US-based organisation specialising in nuclear proliferation, Iran has about 22,000 centrifuges, significantly up from the around 6,100 permitted under the 2015 nuclear deal it struck with world powers.\n\nWith low concentrations of U-235 — 3.5 to 5pc — the fuel can be used to power a nuclear energy plant. Uranium enriched up to 20pc can be used to produce isotopes for medical uses, for example, in diagnosing certain cancers.\n\nTo build a bomb, enrichment must be pushed to 90pc. Such a high concentration — termed weapons-grade — is needed for the critical mass to set off the chain reaction leading to a nuclear explosion.\n\nAccording to the International Atomic Energy Agency (IAEA), 42 kilogrammes of highly enriched uranium is needed for one nuclear weapon.\n\nIran theoretically has enough near-weapons-grade material, if further refined, for more than nine bombs.\n\nAtomic bombs work on the principle of nuclear fission, where energy is released by splitting atoms, causing a highly explosive chain reaction.\n\nDelivering a bomb aboard a missile, poses further challenges: it entails mastering both ballistics — all the calculations involved in getting the warhead to its target — and the miniaturisation of the nuclear charge so that it can be mounted on the warhead.\n\nOnly two nuclear bombs have been used militarily: the one dropped on Hiroshima on August 6, 1945, and the one dropped three days later on Nagasaki, which in total killed some 214,000 people.\n\nHeader image: An image of a mushroom cloud caused by a nuclear bomb. — Image generated by ChatGPT",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/18223352c7d41a6.jpg",
  "retrievedAt": "2025-08-20T04:09:52.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917936/building-and-delivering-a-nuclear-weapon",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T15:55:38.000Z"
}
