{
  "title": "AJK’s Rs310.2bn budget passed amid opposition’s boycott - Pakistan - DAWN.COM",
  "author": null,
  "content": "The coalition government in Azad Jammu and Kashmir (AJK) on Wednesday unveiled a Rs310.2 billion deficit-free budget for the fiscal year 2025-26, which was approved by the Legislative Assembly amid a boycott by the opposition.\n\nEarlier today, the budget session was delayed by over two hours after five opposition members — four from the PTI and one from the Jammu Kashmir People’s Party (JKPP) — staged a sit-in at the entrance of the assembly hall, protesting what they described as the government’s attempt to “bulldoze the budget”.\n\nFour to five cabinet members approached the opposition to convince them to end their protest and voice their concerns inside the hall, but they were told that verbal assurances aside, the government’s “ill-will” was evident from the agenda of the budget session.\n\nThe agenda stated that after the presentation of the revised budget for 2024-25 and the estimated budget for 2025-26, the finance minister would move a motion for suspension of Rules 127, 128, 129, and 131 of the Rules of Procedure of Assembly — all pertaining to the budget process.\n\nAccording to Rule 129, the speaker shall fix at least four days for open debate on the budget, provided there is a gap of two days between its presentation and the start of the debate. The coalition government has presented and passed its two previous budgets in a single day by suspending these rules.\n\nAfter the ministers returned in disappointment, Speaker Chaudhry Latif Akbar himself attempted to persuade the protesting legislators, but also failed to bring them around.\n\nLater, treasury members made their way into the assembly hall by navigating the space on either side of the sofas occupied by opposition lawmakers, following which the Finance Minister Majid Khan was given the floor by the chair to present his budget speech.\n\nBut before the finance minister began his speech, he moved a resolution for suspension of rules, which was approved by the treasury benches with a majority vote.\n\n“Budget is not just a statement of income and expenditures, but a summary of the just distribution of available resources, future planning and official priorities,” Majid Khan said.\n\n“I am presenting a people-friendly as well as historic budget in terms of its volume, and I am sure its implementation will usher in an era of development, guaranteeing the progress and prosperity of the nation,” he added.\n\nMajid informed the House that Rs 261.2bn for recurring expenditures would be met entirely from the AJK’s revenue receipts.\n\nGiving details of these receipts, he said Rs67.477bn would be generated through income tax collection, Rs 17.522bn from other taxes, Rs25bn from internal receipts, Rs1bn from water-use charges and Rs1.2bn from capital receipts (loans and advances). A major chunk of income — Rs149bn — would come from the AJK’s share in federal taxes (variable grant).\n\nOf the development budget, the finance minister informed that its volume was Rs49bn, including a foreign component of Rs1bn.\n\nAJK’s development budget is provided by the federal government as a ‘development grant’.\n\nIn 2023-24, the federal government had committed Rs30bn for development work in AJK, but the coalition government had announced a Rs42bn development budget, claiming it would generate the remaining Rs12bn from its own resources.\n\nHowever, by the close of 2023-24, the actual development budget stood at Rs25.835bn.\n\nSimilarly, while unveiling the 2024-25 budget, Majid had put the development budget portfolio at Rs44bn, but the revised figures presented today showed it had amounted to only Rs28bn.\n\nImmediately, it remains unclear whether the next fiscal year’s estimated development budget will meet the same fate, or the AJK government will manage to obtain and utilise the full amount of Rs49bn.\n\nThe finance minister asserted that despite financial constraints, the government was striving to support its employees, and announced an increase in their pay and pensions “in accordance with what had been declared by the federal government”.\n\nAs he concluded his speech and was about to present the budgetary demands, PML-N regional president Shah Ghulam Qadir and the party’s senior leader Raja Farooq Haider took turns questioning the rationale behind the hasty passage of the budget.\n\n“This House is supposed to hold a debate on each and every aspect of the budget. The parliament and all four provincial assemblies are discussing their budgets. I wonder what problem the government has with holding a debate … This is not a healthy tradition,” remarked Qadir.\n\nHaider urged the government not to make a mockery of the system by using the “brute force of majority” in the House.\n\n“There are no unusual circumstances, such as war, natural calamities or internal disturbances, that can justify this hastiness,” he said.\n\nHowever, despite their objections, the finance minister proceeded to present the demands for grants, prompting the duo, along with their party colleague Chaudhry Ismail, to walk out of the hall in protest.\n\nThe House approved all 32 and 23 demands for grants under the recurring and development budgets, respectively. The minister also presented the demands for grants under the revised budget for the current fiscal year, which were subsequently approved by the House.\n\nAfter the AJK Finance Act 2025 was also referred to the relevant select committee, the chair adjourned the House until June 23.\n\nA week earlier, Finance Minister Muhammad Aurangzeb presented the proposed budget for the FY2025-26 on the floor of the National Assembly.\n\nOn Tuesday, AJK cabinet approved the development and non-development budget FY2025–26, along with the Finance Bill 2025.\n\nDuring the meeting, the finance secretary briefed the cabinet on the revised estimates for the current fiscal year and the proposed allocations for 2025–26, while the secretary of inland revenue presented details of the Finance Bill 2025.\n\nSpeaking on the occasion, AJK Prime Minister Chaudhry Anwarul Haq said a people-friendly budget was essential to address public grievances and promote inclusive development.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/18224433fb3aa09.jpg",
  "retrievedAt": "2025-08-20T04:09:56.601Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917940/ajks-rs3102bn-budget-passed-amid-oppositions-boycott",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T18:10:45.000Z"
}
