{
  "title": "Karachi Millennium Mall fire still burning, fuelled by flammable material: rescue official - Pakistan - DAWN.COM",
  "author": null,
  "content": "Firefighters have been unable to completely put out the massive blaze that erupted in Karachi’s Millennium Mall on Tuesday night, as inflammable items stored in shops continue to reignite the flames.\n\nRescue-1122 spokesperson Hassan Ul Haseeb Khan told Dawn.com on Wednesday evening that 12 fire tenders attempted to control the blaze after seven hours of hectic efforts.\n\nHowever, he noted that the blaze has not been completely extinguished, as clothes and other goods kept inside hundreds of destroyed shops are still fuelling the blaze.\n\n“We are expecting to continue firefighting operations until Wednesday night because of the presence of clothes, cell phones, gaming zones and other items,” Khan said. “Firefighters are searching every shop and are extinguishing any flames that are reignited.”\n\nResponding to a question, the Rescue-1122 spokesperson said that there was a fire safety system in the mall, but it was not functional.\n\n“When the firefighters attempted to use the fire suppression system, it could not be operationalised,” he said, adding that there was no ventilation and the system was found to be “inactive”.\n\nEarlier, the spokesperson said, “The rescue team arrived at the mall within 15 minutes of receiving information of the fire at 4:06am. There, a security guard informed them that the fire had erupted inside surveillance system of a control room due to a short circuit on the third floor.”\n\nThe spokesperson was of the view that perhaps the mall management had initially overlooked the fire.\n\nWhen the firemen arrived there, the fire had spread onto the roof of the mall, where chillers were being kept as it was centrally air conditioned. This intensified the fire and heavy flames emanating from it touched the windows of the nearby Saima Mall and Residency building, triggering fears of a fire there.\n\n“However, 12 fire tenders, with the help of two snorkels, managed to control the fire after hectic efforts lasting for several hours. Cooling work is continuing,” he said.\n\nKhan added it might take two more hours to completely extinguish the fire. He elaborated that the fire has been extinguished by up to 90 per cent, adding that it is taking a long time because of the presence of large objects inside shops. Firefighters are searching every shop to extinguish any flames there.\n\nHe said that the third floor of the three-storey building was completely destroyed, while the first and second floor were partially damaged. There were more than 150 shops on each floor.\n\nHe estimated that around 500-600 shops were badly destroyed, causing significant financial losses, but no injuries were reported.\n\nFire incidents are common in the metropolis due to the absence of adequate fire safety measures in buildings. In November of 2023, city planners, engineers and experts of building plans at a symposium were sure that some 90 per cent of all structures in Karachi — residential, commercial and industrial — did not have a fire prevention and firefighting system.\n\nThirty shops were gutted when a huge fire erupted in a commercial building in Clifton in February. Four people, including one firefighter, were affected by smoke inhalation, and 12 firefighters worked for four hours to bring the fire under control.\n\nLast year, the KMC informed the Sindh High Court that it had conducted a fire safety audit of over 265 commercial buildings, and not a single one was found to have a fire safety certificate or a no-objection certificate (NOC) issued by the fire brigade department.\n\nOut of 265 buildings, around 155 did not have fire alarms and smoke detectors installed, while the status of nine such buildings was not available in this respect, the KMC report added.\n\nSimilarly, the condition of the wiring and electric system of over 155 buildings was termed unsatisfactory. Regarding access to firefighting equipment, the report said that around 200 buildings had no or unsatisfactory firefighting equipment.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/181122244715906.jpg",
  "retrievedAt": "2025-08-20T04:09:58.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917876/karachi-millennium-mall-fire-still-burning-fuelled-by-flammable-material-rescue-official",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T07:19:26.000Z"
}
