{
  "title": "Balochistan govt outlines Rs250bn development plan - Business - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan government has allocated Rs249.50 billion for the Annual Development Plan (ADP) for 2025-26.\n\nWhile unveiling the budget in the Balochistan Assembly on Tuesday, Finance Minister Mir Shoaib Nosherwani stated that it was the first time a significant amount had been allocated for development to provide maximum facilities to the people.\n\nHe said that the allocated funds would be spent on 3,633 ongoing and 2,550 new development projects, with Rs18bn earmarked for the installation of safe city projects in eight cities in 2025-26.\n\nHe said that the government will make efforts to complete most of the ongoing schemes, which include irrigation, drinking water, road construction, health, education, flood protection, climate change, and other sectors.\n\nHe said that in the outgoing fiscal year, Rs38bn was allocated for irrigation-related projects, which included 431 ongoing and 348 new schemes, out of which 186 had been completed.\n\nEstimates over Rs104bn in federal and foreign grants\n\nHe said that the provincial government had decided to immediately release funds for ongoing schemes that were near completion but could not be completed on time due to a lack of funds.\n\n“Around 1,700 such ongoing schemes would be completed very soon that will reduce the number of ongoing schemes and the government would provide maximum new development schemes,” Mr Nosherwani said, adding that the provincial government has successfully spent entire development funds allocated for 2024-25. “We have released 98pc development budget so far, and by June 30, the figure will be 100pc,” he said, adding that it will be the first time in the history of Balochistan that all development funds will be released before the end of the fiscal year.\n\nAdditionally, he said grants of Rs66.5bn for federal-funded and Rs38bn for foreign projects assistance had been estimated for 2025-26.\n\nHe said the allocation for the Communication and Works Department had been increased by 19pc to Rs55.19bn for the construction of roads and upgradation of existing infrastructure.\n\nThe government allocated Rs42.78bn for the irrigation sector to boost agriculture and manage water resources; major investments are being made in dams, canals, and water storage systems.\n\nMr Nosherwani said that Rs24.84bn was set aside for the education sector — specifically, secondary and higher education — to upgrade educational infrastructure, hire teachers, and introduce modern facilities.\n\nThe minister said that Rs16.15bn had been allocated for the upgrading of hospitals, recruitment of medical staff, and procurement of modern healthcare equipment in the next financial year.\n\nHe stated Rs17.16bn had been allocated to provide clean drinking water to the residents of the province, as well as to improve sewerage and wastewater management solutions across the province.\n\nFor developing Balochistan’s rich mineral resources through modern and efficient methods, a sum of Rs567.6 million has been allocated, he said. A meagre sum of Rs154m had been set aside for the empowerment of women in areas such as education, healthcare, and economic participation.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:10:16.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917758/balochistan-govt-outlines-rs250bn-development-plan",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:18:26.000Z"
}
