{
  "title": "Stark gender gap in financial inclusion - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: The percentage of Pakistanis with a bank or mobile wallet account has increased by 28 per cent in the past decade, but for women financial inclusion has remained elusive due to several reasons, according to data released on Tuesday.\n\nThe Karandaaz Financial Inclu­sion Survey showed that 35pc of respondents had access to digital financial services (DFS) — a bank account, a mobile wallet account or a non-bank financial institution account — in 2024 compared to just 7pc in 2014.\n\nThe male financial inclusion stood at 56pc compared to just 14pc for women.\n\nThe data is based on a survey conducted in 6,624 households ac­­ross four provinces, Gilgit-Baltistan and Azad Jammu and Kashmir.\n\nOnly 14pc women have access to financial services compared to 56pc men\n\nThe survey aimed to highlight access to and demand for financial services, especially DFS, among key underserved groups (females, poor, rural, etc.) and identify barriers to further adoption of DFS, Kaarandaz said. In terms of financial inclusion by region, Punjab has the highest level with 40pc, followed by Islamabad 38pc and GB 33pc.\n\nGender gap\n\nThe male financial inclusion re­­corded an increase of 45 percentage points from 11pc in 2014. However, for women, the increase was only 11 percentage points, up from 3pc in 2014.\n\nThe financial inclusion ratio for men and women in Punjab was 62pc and 17pc, respectively. In Sindh, it was 43pc and 9pc, in KP 49pc and 29pc, in Islamabad 64pc and 38pc, in GB 53pc and 33pc, in Balochistan 41pc and 4pc and in AJK 48pc and 1pc.\n\nWhile 28pc men reported having a bank account in 2024, only 6pc of women had one.\n\nOverall, the most significant increase was in the adoption of mobile wallets — from 0.3pc in 2014 to 30pc in 2014.\n\nHowever, a stark gender gap persisted, with 48pc of men having registered mobile money wallet accounts in 2024, compared to only 11pc of women.\n\nSeveral other social factors, inclu­ding literacy and access to technology, hinder women’s financial inclusion. As per the data, mobile phone ownership in Pakistan has increased from 54pc in 2014 to 64pc in 2024.\n\nWhile women’s ownership rose from 29pc to 46pc, the gender gap remained stark as male ownership reached 82pc in 2024.\n\nIn terms of having a registered SIM card in their name, only 47pc of women reported having one, compared to 78pc of men.\n\nSIM ownership is crucial for accessing financial services, as registered numbers are required to open accounts and receive transaction codes.\n\nPublished in Dawn, June 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:09:59.967Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917762/stark-gender-gap-in-financial-inclusion",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T01:18:26.000Z"
}
