{
  "title": "India is a perpetrator of foreign interference, Canadian intelligence agency says - World - DAWN.COM",
  "author": null,
  "content": "India is a perpetrator of foreign interference, Canada’s intelligence agency said in a report published on Wednesday, just after India’s and Canada’s prime ministers vowed to strengthen ties at a global summit hosted by Canada.\n\nCanadian Prime Minister Mark Carney and Indian Prime Minister Narendra Modi held what both sides called productive talks on Tuesday at the G7 summit in Alberta and agreed to reinstate top diplomats they had withdrawn last year.\n\nCarney drew outrage from some members of Canada’s Sikh community when he invited Modi to the G7.\n\nCanada-India relations have been tense since former prime minister Justin Trudeau in 2023 accused India’s government of involvement in the June 18, 2023, murder of Hardeep Singh Nijjar, a Sikh separatist leader in Canada.\n\nModi’s government has denied involvement in Nijjar’s killing and has accused Canada of providing a safe haven for Sikh separatists.\n\nThe intelligence report noted transnational repression “plays a central role in India’s activity in Canada”, though it said China poses the greatest counter-intelligence threat to Canada and also named Russia, Iran and Pakistan.\n\nThe Royal Canadian Mounted Police said in October that they had communicated more than a dozen threats to Sikhs advocating for the creation of a homeland carved out of India.\n\n“Indian officials, including their Canada-based proxy agents, engage in a range of activities that seek to influence Canadian communities and politicians,” the Canadian Security Intelligence Service report reads.\n\n“These activities attempt to steer Canada’s positions into alignment with India’s interests on key issues, particularly with respect to how the Indian government perceives Canada-based supporters of an independent homeland that they call Khalistan.”\n\nThe Indian High Commission and the Chinese embassy in Canada did not immediately respond to requests for comment.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:09:55.727Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917937/india-is-a-perpetrator-of-foreign-interference-canadian-intelligence-agency-says",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T16:07:24.000Z"
}
