{
  "title": "SDPI, PCP sign MoU to strengthen social delivery service in Pakistan",
  "link": "https://www.app.com.pk/national/sdpi-pcp-sign-mou-to-strengthen-social-delivery-service-in-pakistan/",
  "date_published": "2023-03-16T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Sustainable Development Policy Institute (SDPI) and Pakistan Center for Philanthropy (PCP) on Thursday signed a Memorandum of Understanding (MoU) to conduct research and evidence-based interventions for strengthening of social protection services, particularly in testing times.\nThe Executive Director of SDPI, Dr Abid Qaiyum Suleri said that the informal charity and philanthropy were critical in protecting people from economic shocks and can provide relief to the vulnerable communities when the state resources are constrained or can not reach in time.\nBoth the institutions were eager to find research and evidence-based philanthropic and social delivery interventions, he said and added that there was a need to prevent thinning out of resources and increase the efficacy of such efforts.\nHe stressed the need for finding solutions to increase the engagement of private sector in social delivery and channelizing their CSR and ESG agendas. Dr Suleri further said that with the arrival of Ramadan, stocking and profiteering would rise which can undermine the philanthropic efforts and turn it into a zero-sum game.\nHe maintained that such challenges call for strengthening collaboration between organizations like SDPI and PCP which are pivotal to find out pragmatic solutions for the policy makers and private sector.\nThe Executive Director of PCP, Shazia Maqsood said that Pakistanis were an extremely generous nation, but there was no data available to verify and support this claim. She stressed the need for evidence-based research and data to support such claims and drawing comparisons with developed countries in terms of GDP to philanthropy ratio.\nShe added that the private sector and informal charities mobilize and reach affected communities swiftly and well before public social protection in the advent of climate disasters. She urged the authorities to simplify the regulatory environment and ensure ease of doing good just like ease of doing business to create a conducive environment for social delivery organizations.\nShazia Maqsood further urged the government to adopt a risk-based approach to facilitate social delivery organizations to provide relief to the vulnerable communities as adopting a single approach for all has caused more damage than good.",
  "retrievedAt": "2025-08-11T06:23:49.506Z"
}
