{
  "title": "FCDO, UNDP extends partnership to improve governance public service delivery",
  "link": "https://www.app.com.pk/national/fcdoundp-extends-partnership-to-improve-governance-public-service-delivery/",
  "date_published": "2023-03-16T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): The United Kingdom’s Foreign, Commonwealth and Development Office (FCDO) and the United Nations Development Programme(UNDP) signed a new Contribution Arrangement on Thursday to extend their partnership for the period 2023-2026.\nThe FCDO has extended its engagement due to successive governments’ continued ownership of the project’s reform efforts, said a UNDP press release.\nThe Contribution Arrangement will not only expand the scope and geographic coverage of UNDP’s Reforms and Innovation project from the federal to the provincial government levels for enhancing governance effectiveness and improved public service delivery, but will also introduce new programming streams in the form of risk governance interventions.\nChief Economist, Planning and Development Department Sindh Asghar Memon expressed his gratitude to FCDO and UNDP for acceding to the provincial government’s request for technical support, “We are grateful for the opportunity to work with UNDP and FCDO to enhance governance in our province by institutionalizing risk governance frameworks and practices for improved disaster management and recovery.”\nSpeaking on the occasion, Jo Moir, the Development Director for the British High Commission, said, “We are delighted to extend our collaboration with UNDP in Pakistan. The previous three years have been extremely productive, and we are committed to continuing our joint efforts in pursuit of institutionalizing performance-driven management of public sector organizations and evidence-based policy making. We are confident that this partnership will continue to have a positive impact on the people of Pakistan as a result of the expansion of our support to the provincial level and the introduction of risk governance interventions.”\nUNDP’s Resident Representative in Pakistan Knut Ostby said “FCDO is a long-standing trusted partner of UNDP. We have collaborated and worked together in the governance landscape of Pakistan to create a lasting impact through systemic reforms. I am pleased to announce that our partnership has been extended up to 2026 with additional resources. I would also like to take this opportunity to thank the Government of Sindh for placing its trust in UNDP as its key partner in taking forward the government’s institutional reforms agenda”, he added.\nUNDP’s Reforms and Innovation project has been working towards improved governance and public service delivery outcomes in Pakistan since 2015.",
  "retrievedAt": "2025-08-11T06:23:55.085Z"
}
