{
  "title": "Lawmakers call for supremacy of parliament, demand institutions to stay in domain",
  "link": "https://www.app.com.pk/national/lawmakers-call-for-supremacy-of-parliament-demand-institutions-to-stay-in-domain/",
  "date_published": "2023-03-16T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):Parliament is the supreme institution of the country and all institutions should stay in their domain and not interfere with work of other institutions.\nThese views were expressed by the incumbent and former Senators while taking part in a debate in the Senate session summoned in connection with the Golden Jubilee of the Upper House.\nOn the second day of the special session, the incumbent and former senators, parliamentary leadership, foreign diplomats and prominent figures from various walks of life participated and congratulated the Senate of Pakistan over completing 50 years.\nThe Senate special session summoned to celebrate Golden Jubilee started with the recitation of the last two verses of Surah Al-Baqarah that highlighted the importance of believing in the messengers of the Almighty Allah and His angels, books and obeying the messengers.\nIt also added that Allah does not burden anyone more than his or her capacity and it’s the reward of what a person does and what he receives in the form of its outcome.\nChairman Senate Muhammad Sadiq Sanjrani welcomed the foreign diplomats and high commissioners of friendly countries on the second day of the Senate’s golden jubilee celebrations. He said their presence at this occasion was a testament to the importance of the day. The Senate had played a crucial role in shaping the political landscape of the proud nation, he added.\nThe Senate chair underlined that these celebrations reminded us of the significance of the Upper House in strengthening democracy and ensuring the protection of the rights of all.\n“Senate has run an extra mile in representing the country at the international and regional level. It promoted Pakistan’s positive image internationally through parliamentary diplomacy,” Sanjrani said. He also thanked the International Parliamentary Union (IPU) for considering an emergency agenda item in its plenary in Rwanda on creating a loss and damage climate fund. He informed that the Senate was the first parliamentary institution to submit its report on the review of the progress on SDGs 16.6 and 16.7. He wished the foreign diplomats would find this session informative and interesting.\nSenator Dar who is also the finance minister addressed the house and thanked the members of the diplomatic corps for joining the golden jubilee celebrations. “It’s the Upper House of the Parliament and it is determined to promote pluralism, provincial autonomy and democracy,” he said. Dar presented a brief introduction of the working of the Upper House to the foreign diplomats.\nHe added that democracy alone could not achieve results unless there was transparency, accountability and stringent economic discipline. He welcomed all the members of the diplomatic corps on behalf of the entire house.\nFederal Minister for Law, Senator Azam Nazeer Tarar said it was a wonderful idea to convert the House into a committee of the whole and allowed the guests to speak.\nHe added that the previous day senators and guests expressed their excitement and gratitude for the opportunity to speak on the golden jubilee celebrations.\nThe minister highlighted that the Senate throughout its journey had been striving for strengthening democracy and supremacy of the constitution. He also underscored that the country was facing the unprecedented challenge of climate change impacts causing extreme natural disasters. “Last summer, it was a different Pakistan that we saw due to extreme weather events leaving its population badly impacted due to floods and heat waves,” he added.\nHe acknowledged that the world community also contributed to lessening Pakistan’s burden in managing the natural disaster of the 2022 Floods. “The international community at the Geneva moot openheartedly supported Pakistan,” he added.\nTarar said there was a need to stand united and determined as the country was passing through tough times that demanded a national economic dialogue and strengthening of political institutions.\nSenator Mian Raza Rabbani said it was an occasion to not only celebrates the five-decade journey of the Senate but also to discuss the weaknesses and failures of the Upper House so far.\nHe pointed out that the Parliament should have snubbed the statement of the US Special Envoy on Afghanistan intended to exhort Pakistan on its internal matters. “Parliament should have told him to mind his business as we better know how to handle our own affairs,’ he added.\nHe underlined that the Parliament should be taken into confidence on matters related to defence, security and financial affairs. “When Parliament exerts itself then results flow. When it recluses and goes into its shell and becomes shy of facing odds then other forces try to take advantage,” he added.\nSenator Mushtaq Ahmed paid tribute to Zulfiqar Ali Bhutto and all leaders of the political parties who played their roles in the formulation of the Constitution.\nHe said the country had a constitution, parliament, democracy, political commitment and resistance that were a ray of hope but there was a need to take stock of our role for self-accountability in the efforts made throughout the journey.\nHe said the implementation of the Constitution was very important to curtail all sorts of threats both internal and external to achieve parliamentary supremacy.\nChairman Senate while listening to the remarks of the Senators said that the open discussion made by the Senators amid the presence of foreign diplomats was the very spirit of democracy.\nEuropean Union Ambassador, Dr Riina Kionka extended her sincere congratulations to the Senate on its golden jubilee. She said people used to delegate their power to the elected representatives and they held them accountable.\n“Democracy is the core value of EU States. The EU is supporting Pakistan in strengthening its parliament and democracy for the past 60 years of strategic relations,” she added.\nHigh Commissioner of South Africa, Mthuthuzeli Madikiza extended felicitations to the Upper House on the occasion. He also underlined the support of the parliament, particularly the Senate, in endorsing the UN Resolutions for the independence of African countries and racial discrimination in African countries.\nMadikiza said Pakistan should move forward to promote ties with African countries and partake in its development agenda\nFormer Senator Muhammad Javeed Abbasi appreciated the Senate chairman for arranging special celebrations to mark the golden jubilee of the Senate of Pakistan.\nFormer Senator Sanaullah Baloch said that issues in Balochistan should be resolved on priority. He said that the development of Balochistan was linked with the progress and prosperity of Pakistan.\nJordanian Ambassador to Pakistan Maj. Gen. (R) Ibrahim Yala Al Madani, while speaking in the Senate extended congratulations to the leadership and people of Pakistan for celebrating 50 years of the Senate of Pakistan. He said that Pakistan and Jordan were enjoying brotherly relations based on a solid foundation of mutual respect and joint cooperation on political and military aspects.\nPalestinian Ambassador to Pakistan Ahmed Rabei congratulated the Senate chairman of the Golden Jubilee.He appreciated Pakistan’s support to Palestine. He retained the viewpoints of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal regarding Palestine.\nFormer Senator, Haji Attaullah said that unity was required to confront the challenges faced by the country. He said that the 18th Amendment was passed unanimously to give more powers to the provinces.\nSenator Tahir Bizenjo said that the country was facing the worst economic, constitutional and political crisis. Despite all these odds, he said the future of Pakistan was linked with democracy, free and transparent elections and respect for the constitution.\nFormer Senator Zahid Khan said that the authority of Parliament was challenged and the constitution was violated multiple times in the last 50 years.\nHe said that the Senate had played a crucial role in strengthening democracy and legislation for public welfare. He said that every institution should remain in its domain and respect other institutions.\nThe supremacy of Parliament should be admitted by other institutions instead of creating hurdles in it. Senator Sarfraz Ahmed Bugti congratulated Chairman Senate for arranging events in connection with the Golden Jubilee celebrations.\nHe also welcomed the diplomats attending the event. Senator Sarfraz said that the supremacy of the Parliament should be ensured and objective debate to be made to know the reasons as to why it could not be ascertained.\nHe said that financial powers should be given to the Senate and the sense of deprivation of small provinces be removed. Senator Mushahid Hussain Syed said that Quaid-e-Azam Muhammad Ali Jinnah was a great supporter of democratic system and supremacy and supremacy of the parliament.\nHe said that the Senate of Pakistan took a bold stance on various foreign affairs and national issues in the past including the Iraq war, Balochistan affairs and climate matters.\nHe said that the Senate would continue to play a significant role in protecting the interests of the country as per the aspirations of the people. He said it was the mutual responsibility of the government and opposition to play their role in strengthening democracy.\nJUI-F Senator Maulana Abdul Ghafoor Haidri appreciated the leadership of all parties who drafted the Constitution and unanimously approved it in Parliament. He also spoke for the supremacy of parliament and strengthening democracy.\nYemen Ambassador to Pakistan Mohammed Motahar Ali-Shabi congratulated the people of Pakistan on the completion of 50 years of Senate of Pakistan. He said that Pakistan was an important country in the Islamic world and internationally. He said that Yemen and Pakistan were enjoying excellent bilateral ties. He also appreciated Pakistan’s support for peace in the region.\nMauritius High Commissioner to Pakistan Rashidally Soobadar congratulated the Chairman Senate and his team for arranging an event to celebrate 50 years of the Senate of Pakistan.\nHe said that strong institutions were very important for the country to make progress. He said proper working of institutions ensured rule of law, accountability and good governance in any country.\nHe said that democracy ensured freedom of expression, movement and worship.\nAmbassador of Turkmenistan to Pakistan, Atadjan Movlamov said, “ I am very pleased to convey heartfelt congratulations and best wishes on the auspicious occasion of the 50th anniversary of the upper house of the Parliament”.\nHe said that the Senate of Pakistan over the years had emerged as an essential organ and a stabilizing factor of the federation.\nHe said the Senate had played an important role in strengthening democratic values ensuring the rights and full representation of the people of the country.\n“I congratulate Chairman Senate, all Pakistani parliamentarians and all people of Pakistan on the auspicious occasion of the 50th anniversary- the golden jubilee of the upper House of the Parliament”.\nSenator Samina Mumtaz demanded to fulfill the promises made with Balochistan on the name of the `Aghaz-e-Haqooq-e-Balochistan Package’.\nShe said that small provinces should be given their due rights and a committee to be constituted to review the implementation on the18th amendment.\nPPPP Senator Keshoo Bai thanked his party leadership for giving her opportunity to serve in Senate of Pakistan.\nShe said that she felt proud of chairing a sitting of the Senate on an International Women’s Day.\nAmbassador of Indonesia to Pakistan, Adam M. Tugio said that relations between Indonesia and Pakistan parliament were getting stronger and stronger.\nHe said that parliamentarians of both the counties were exploring ways to strengthen these relations.\nAmbassador of Belarus to Pakistan Andrei Metelitsa congratulated the Chairman Senate and people of Pakistan for celebrating 50 year of the Senate of Pakistan.\nHe said that Belarus and Pakistan had established cordial bilateral and parliamentarian relationships.\nHe said that high level delegations of Pakistan had also visited Belarus many times.\nHe also invited the Chairman Senate to visit Belarus along with the parliamentarians’ delegation.\nAmbassador of Kazakhstan to Pakistan Yerzhan Kistafin congratulated the Senate over its golden jubilee and invited the Senators to visit his country with an aim to enhance parliamentary relations.\nAmbassador of the Syrian Arab Republic Ramez Alraee thanked the Pakistani government for extending help to Syrian people in difficult times especially during the recent earthquake.\nHe also wished prosperity and progress for Pakistan.\nSenator Rana Maqbool Ahmed said that the Senate really deserves this important function which had elaborated its success stories.\nHe said that Zulfikar Ali Bhutto strengthened the security of the country by starting a nuclear program which was accomplished by PML-N supremo, Muhammad Nawaz Sharif.\nHe said that the Constitution was a public document which must be followed in letter and spirit.\nAmbassador of the Royal Thailand to Pakistan Chakkrid Krachaiwong also congratulated the Senate over its golden jubilee celebrations and said that ties between Pakistan and Thailand would increase in the coming days.\nAmbassador of Islamic Republic of Iran in Pakistan, Mohammad Ali Hosseini said that Pakistan and Iran had strong parliamentary relations which would be further strengthened in the coming days.\nSenator Manzoor Ahmed Kakar said that the Senate represented all federating units and worked a lot to raise the voice of the people.\nHe said that important legislation had been initiated in the Senate and it provided guidelines to the governments in challenging situations.",
  "retrievedAt": "2025-08-11T06:24:17.887Z"
}
