{
  "title": "US announces $4.5 mln programme to strengthen fertilizer efficiency, effectiveness for Pakistani farmers",
  "link": "https://www.app.com.pk/national/us-announces-4-5-mln-programme-to-strengthen-fertilizer-efficiency-effectiveness-for-pakistani-farmers/",
  "date_published": "2023-03-16T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): The United States on Thursday announced a $4.5 million programme from its Department of Agriculture to strengthen fertilizer efficiency and effectiveness for Pakistani farmers among other initiatives at the conclusion of the second meeting of the US and Pakistan Climate and Environment Working Group.\nMinister for Climate Change Senator Sherry Rehman and the US Department of State’s Assistant Secretary for the Bureau of Oceans and International Environmental and Scientific Affairs Monica Medina led their respective sides, a joint news release said.\nThe officials and experts engaged on climate and environmental issues, including climate change, energy transition, water management, climate-smart agriculture, air quality, biodiversity, and waste management, including plastics recycling.\nThe two sides discussed the impacts of the devastating floods in Pakistan in 2022 and emphasized the importance of building resilience to the impacts of climate change.\nThe United States expressed support for Pakistan’s “Living Indus” initiative to restore the ecological health of the Indus River Basin. The two governments recommitted to tackling the climate crisis through cooperation on climate change mitigation and adaptation.\nBoth governments resolved to continue deepening their bilateral partnership through the US-Pakistan “Green Alliance” framework. The “Green Alliance” would help the two countries jointly face the climate, environmental, and economic needs of the present and future, especially through partnerships on agriculture, water, and clean energy.\nRegarding agriculture, the two sides discussed the importance of adopting modern farming practices and innovative seed varieties to bolster resilience against climate change.\nOn water management, the governments identified technical assistance, governance, and water efficiency mechanisms as areas ripe for cooperation. They emphasized the importance of supporting nature-based solutions and building community resilience to climate change.\nThe US and Pakistan also acknowledged their long history of working together to advance sustainable economic growth. For example, in the 1960s, the US supported Pakistan’s “Green Revolution” to improve agricultural crop yields and strengthen food security.\nThey committed to advancing future cooperation in agriculture, water, and energy transition through the US-Pakistan “Green Alliance” framework.\nThrough the Climate and Environment Working Group, the two governments made new commitments to partner together.\nThe US announced new programmes in Pakistan, including the programme to strengthen fertilizer efficiency and effectiveness for Pakistani farmers.\nThe US Agency for International Development (USAID) announced new activities in Pakistan to promote climate-smart agriculture and climate finance.\nThe US Army Corps of Engineers would start sharing weather data on glacial melt with the Ministry of Climate Change and other local stakeholders to strengthen Pakistan’s flood forecasting and disaster response capabilities.\nPakistan informed the United States about the approval of its new National Clean Air Policy and explained its recent waste management actions, including on plastics.\nThe two sides also pledged to collaborate on a successful year as the 2023 co-chairs of the Green Climate Fund Board.",
  "retrievedAt": "2025-08-11T06:23:53.093Z"
}
