{
  "title": "Combating Crimes; Digitization of AJK Police afoot: IGP Amir Ahmed Sheikh",
  "link": "https://www.app.com.pk/national/combating-crimes-digitization-of-ajk-police-afoot-igp-amir-ahmed-sheikh/",
  "date_published": "2023-03-16T12:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 16 (APP): Under the spirit to facilitate the needy with swift police services for the safety of lives and properties with a focus to combat crimes, and eliminate unscrupulous elements, integration programme for digitization of the AJK Police services to the masses is afoot under the phased integrated programme across Azad Jammu Kashmir.\nThis was disclosed by AJK Inspector General of Police Amir Ahmed Sheikh while talking to the media after inaugurating a state-of-the-art facilitation center, established close to the SSP office, in Mirpur late Wednesday.\nThe AJK Police chief was flanked, on this occasion, by Commissioner Mirpur Division Shoukat Chaudhry, Mirpur Div. DIG Khalid Mahmood Chauhan, DC Ch. Amjad Iqbal, SSP Raja Irfan Saleem, SP Raja Azhar Iqbal, SSP Bhimbher Muhammad Akmal and other senior district administration officials.\n“The project is to ensure the delivery of quick services of the police primarily for combating crimes and maintaining peace to ensure the safety of lives and properties of the masses across Azad Jammu Kashmir harmonious to the need of the modern age”, the IGP told media adding that entire police services are being digitized across the State including Mirpur district through the establishment of the fully-equipped digitized Police Facilitation Centers in all ten district headquarters of AJK.\nHe continued that the gigantic police felicitation center will help deliver all police related services through one window to the aspirant in minimum possible time.\nThe AJK police chief underlined that it will have foreigners security desk to monitor the security of foreigners working at various development projects in AJK, including in the District, especially around the country’s second largest Mangla dam reservoir.\nThe AJK Police Chief Amir Ahmed Sheikh disclosed that Azad Jammu Kashmir police services were being digitally integrated with the Federal Investigations Agency (FIA), NADRA, CTD (Counter Terrorism Department) and other concerned law-enforcement institutions of the government of Pakistan to ensure the due access of the central government functionaries to assist the AJK police in maintaining complete peace and order and discouraging all sorts of crimes in this State, he added.\nThe AJK IGP underlined that after digitalized integration of the AJK police with the NADRA, the identification of any of the registered citizen could immediately be proved through the mobile phone after feeding the CNIC (Computerized National Identity Card) of the concerned person.\nHe continued that digitization of the AJK police services would help resolve the issues related to the needy in a minimum possible.\nHe disclosed that in order to integrate the AJK police services to combat cyber crimes with the concerned federal government law-enforcement functionaries, the required process was being passed through the legal framework in this direction.\nThe AJK Police chief disclosed that the AJK police force was being made fully literate of the information technology through their participation in due computer-literacy training programs in AJK as well as in the national information Technology and police training institutions in various parts of the country.",
  "retrievedAt": "2025-08-11T06:23:59.767Z"
}
