{
  "title": "Experts discuss advances in bariatric surgery at int’l conference",
  "link": "https://www.app.com.pk/national/experts-discuss-advances-in-bariatric-surgery-at-intl-conference/",
  "date_published": "2023-03-16T11:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):The Pakistan Society for Metabolic and Bariatric Surgery (PSMBS) and International Bariatric Club have jointly organized the Third International Conference on Bariatric Surgery, which commenced on Thursday in a private hotel.\nThe conference is being attended by 200 delegates, including 27 foreigners from countries such as the United States, Canada, Turkey, Mexico, and Taiwan.\nDuring the conference, various topics related to bariatric surgery were discussed, including the establishment of bariatric surgery in Faisalabad, doctors’ perceptions regarding bariatric surgery, apprehensions of morbidly obese people regarding bariatric surgery, level of satisfaction, bariatric tourism, transit bipartition in patients with mild to severe obesity, robotic surgery, modified roux-en-y gastric bypass, and parallel surgery high tech.\nMoreover, a panel discussion was also held on bariatric surgery and transplant surgery, covering various issues such as renal failure, liver failure, and preexisting organ failure in connection to bariatric surgery. The conference’s closing session, scheduled for Friday, will focus on magnetic bariatric surgery, controversies, a parallel course on Roux-en-Y Gastric Bypass and Mini Gastric Bypass.\nSpeaking to APP, General Secretary PSMBR Islamabad Chapter Dr. Tanseer Asghar stated that the conference has attracted health professionals from around the world and will provide an excellent opportunity to medical professionals to increase their exposure and skills through interaction with international experts.\nHe informed that the session also included a basic and advanced laparoscopic skills workshop, during which Professor C-k Huang performed lap gastric bipartition surgery at Rawalpindi International Hospital in a revisional case of stomach twist with a structure, which proved to be a great learning experience for practitioners.",
  "retrievedAt": "2025-08-11T06:24:07.919Z"
}
