{
  "title": "Toshakhana case: No respite for Imran as court maintains arrest warrants",
  "link": "https://www.app.com.pk/national/toshakhana-case-no-respite-for-imran-as-court-maintains-arrest-warrants/",
  "date_published": "2023-03-16T14:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): A local court on Thursday, here, dismissed the plea of Pakistan Tehreek-e-Insaf Chairman Imran Khan, seeking cancellation of non-bailable arrest warrants in the Toshakhana case and maintained its earlier orders to the police to produce the accused after arresting him.\nAdditional District and Sessions Judge Zafar Iqbal said that the application had been viewed from every legal aspect before issuing this order. He announced the verdict which was earlier reserved after hearing arguments from the lawyers.\nEarlier during the course of the proceedings, Inspector General of Police Islamabad Akbar Nasir appeared before the court and adopted the stance that how he would answer to the families of the police personnel who suffered cruelty in Lahore.\nThe IG further apprised the court that unarmed police personnel were sent there for the execution of the court orders.\nThe IGP said that no representative of Islamabad police was allowed to meet Imran Khan, adding that an assurance was also given last day regarding his appearance. No one had talked to Islamabad police in Zaman Park instead the police was “attacked with petrol bombs”, he confided to the court.\nThe IG Islamabad contended that everyone was equal before the law. “If one person is given the relief then other people have the same rights,” he said, adding that the police water cannon was burnt and 65 personnel were injured in the clashes with the PTI supporters who resisted the arrest of Imran.\nEarlier, the judge remarked that the Islamabad High Court (IHC) had endorsed the orders of this court. He said the court viewed the matter if Imran Khan appeared before it. The court wanted to completely cooperate with the accused but he had made the attendance matter as very complex.\nThe judge said that the court didn’t want to put Imran Khan’s life on risk but there were some legal requirements as the court also had to follow the directives of IHC. He said the resistance by Imran Khan was so strange, adding the legal team should have suggested the PTI chief to extend cooperation with the course of law.\nMeanwhile, Imran’s lawyer Khwaja Haris prayed to the court to review the plea against arrest warrants and the furnished undertaking of Imran Khan assuring the court that he would be appear on March 18. He argued that the said date was very close and the court had the powers to cancel the warrants.\nHaris prayed the court to view all aspects to ensure the attendance of his client. He asked the court to view that whether it was appropriate to restore arrest warrants or not in current situation. He claimed the Islamabad High Court in its order had also written to view the undertaking before deciding the matter.\nHe said that Imran Khan had never stated that he wouldn’t appear before the court, instead he had assured his appearance on March 18.\nIt is pertinent to mention that the IHC, the other day, had also up held the decision of trial court regarding the arrest warrants of Imran Khan in Toshakhana case.",
  "retrievedAt": "2025-08-11T06:23:43.093Z"
}
