{
  "title": "Pakistan sends three more flights carrying earthquake relief supplies to Turkiye",
  "link": "https://www.app.com.pk/national/pakistan-sends-three-more-flights-carrying-earthquake-relief-supplies-to-turkiye/",
  "date_published": "2023-03-16T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Three more flights carrying hundreds of tonnes of earthquake relief supplies from Pakistan arrived on Thursday at Adana, Turkiye.\nA special chartered flight operation, launched by the Government of Pakistan to ensure delivery of earthquake relief supplies in the month of March, continues to deliver essential 50,000 tents to Turkiye at a fast pace, said a press release from Pakistan Embassy in Ankara.\nOn average, over 2,400 tents are being transported to Turkiye daily. Today, three flights carrying 1200, 1400 and 1200 tents each arrived at Adana.\nSince March 11, 2023, 9,800 tents have been delivered to Turkiye through 8 flights. Factories in Pakistan are working at full capacity to ensure mass production of winterized, water and fireproof tents to meet the requirements of the quake-affected people in Turkiye.\nUnder the directions of Prime Minister Shehbaz Sharif, all three transport routes such as air, road and railways are being used.\nIn addition to this special flight series, 10  aircrafts have brought relief assistance goods to Turkiye. It includes three Pakistan Air Force (PAF) C-130, one PAF  IL-78, one Turkish Military aircraft, two Turkish cargo, and three PIA Chartered flights. Furthermore, relief goods are being sent through belly space available on regular PIA flights to Istanbul.\nMoreover, a  21-truck convoy delivered approximately 275 tons of relief goods to Malatya in the month of February. Three ships carrying earthquake relief supplies are en route to Turkiye, which will arrive at Mersin in the third week of March.\nPakistan will continue its relief operations till complete recovery and rehabilitation, as stated by Prime Minister Sharif, the statement added.",
  "retrievedAt": "2025-08-11T06:24:10.126Z"
}
