{
  "title": "Strong academia-industry partnership must for vibrant economy: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/strong-academia-industry-partnership-must-for-vibrant-economy-ahsan-iqbal/",
  "date_published": "2023-03-16T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal Thursday highlighted the important role of establishing a strong academia-industry partnership for ensuring a stable and vibrant national economy.\n“Strong academia-industry partnership is must for future of our economy that needed collective efforts by all stakeholders . . . Private sector is the engine of growth and it has to lead the wave. Our [the government] job is to provide the necessary support,” he said while addressing Pakistan’s 4th Artificial Intelligence (AI) Summit-2023 here.\nHe hoped that the private sector would take the country to an export-led economy and the corporate sector would play its due role in ‘earning dollars’ for Pakistan.\n“…I hope that Pakistani professionals and AI take forward in this field, and create opportunities for Pakistan through expertise in artificial intelligence and digital technologies.”\nThe minister assured the summit participants that the government would extend all possible assistance in providing competitive infrastructure and a knowledge foundation.\nProfessor Ahsan Iqbal regretted that some elements were fanning disappointment in the country for their petty political gains.\nHe said there was no doubt that Pakistan was facing challenges on multiple fronts, but the country needed stability and continuity of economic policies to tackle them [confronted issues].\nHe said no nation in the world attained progress unless it started developing a ‘self-esteemed image,’ adding it was unfortunate that some elements in the country were fanning disappointment.\n“We are facing issues because the country had not been allowed to function with stability during the last 75 years. We have been causing disruptions. It has nothing to do with our promise and potential. We are the extraordinary people, the nation is great,” he added.\nHe said the country needed only stability and continuity of policies.\nHad the continuity of 2018 not disrupted, the China-Pakistan Economic Corridor (CPEC) would have been brought an economic revolution in Pakistan, he claimed.\nDuring the Pakistan Muslim League-Nawaz (PML-N)’s last tenure, he said the Chinese president had asked 100 top Chinese companies to invest in Pakistan and they [companies) opened up their offices in the country. “I was hoping that in the next 5-7 years, we will see around $ 30-50 billion private investment in Pakistan.”\nThe minister reminded China’s billions of dollars investment in the Thar coal project that remained unattended due to the non-availability of finances and technologies for the 70 years.\n“Through CPEC, China provided us technology and financing. Today, the Thar coal, which has the energy equivalent of Saudi Arabia and Iran’s oil, is a productive asset for Pakistan producing cheaper electricity and it is good to go for the next 400 years for Pakistan. Thanks to the Chinese and CPEC . . . but what we did do . . . we scandalized them.”\nIn 2018, Professor Ahsan Iqbal said when he left the Ministry of Planning and Development, the development budget was around Rs 1,000 billion which came down to Rs 550 billion in the next four years.\n“If you keep in mind the rate of inflation, the development budget should now stand at around Rs 1600-1800 billion,” he said, regretting that in April last, before taking over of the incumbent government, the previous management of the Finance Ministry announced not giving the development budget for the last quarter (April-June 2021-22) because they had no money.”\nIt happened for the first time in the history of the country, he said, recalling that such a situation did not surface even when the PML-N government carried out nuclear explosions despite facing international sanctions.\nThe minister said the incumbent government was taking all-possible measures to clear the inherited ‘macro-economic mess’ and put the national economy on a sustainable path of recovery and development.\n“We have to stabilize Pakistan’s economy. We have to be very safe from any default-like situation. By the grace of Allah Almighty, we are almost inching out of the crisis. With every passing day, we are closing to the point of stability where we will end our vulnerability,” he vowed.",
  "retrievedAt": "2025-08-11T06:24:13.970Z"
}
