{
  "title": "Punjab Governor calls on Saudi envoy in Islamabad",
  "link": "https://www.app.com.pk/national/punjab-governor-calls-on-saudi-envoy-in-islamabad/",
  "date_published": "2020-12-12T10:44:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 12 (APP): Governor Punjab Chaudhry Mohammad Sarwar met Saudi Arabia Ambassador to Pakistan Nawaf bin Saeed Al-Maliki in Islamabad and discussed various issues including bilateral relations between Pakistan and Saudi Arabia.\nDuring the meeting, the Governor Punjab said that relations between the two countries were strongest than a rock and Pakistanis respect the custodians of the Two Holy Mosques, adding that Pakistanis feel a spiritual connection with Saudi Arabia, says a press release issued here on Saturday.\nHe said both the countries enjoyed warm and close bilateral relations, adding that hearts of the people in two countries beat together. He said that ideal relations between the two countries were a source of pride for 220 million Pakistanis.\nAcknowledging Saudi Arabia’s cooperation in the development of Pakistan, Chaudhry Mohammad Sarwar said the Saudi government had always worked hand in hand with Pakistan.\nSarwar said Pakistan stands by Saudi Arabia and is committed to safeguard the territorial integrity of Saudi Arabia.\n“Under the leadership of Prime Minister Imran Khan, our relations with Saudi Arabia have become stronger than ever”, he said, adding that the two countries would stand together on every front.\nTalking on the occasion, Saudi Ambassador Nawaf bin Saeed Ahmed Al-Maliki said that Saudi Arabia had never left Pakistan alone and it would continue to support Pakistan in future as well.\n“We consider Pakistan our second home and we will continue to play our role for its development”, he said, adding that both the countries were enjoying brotherly relations.\nSaudi Ambassador Nawaf Al-Maliki invited Chaudhry Mohammad Sarwar to visit Saudi Arabia and the Governor Punjab accepted the invitation.",
  "retrievedAt": "2025-08-11T20:08:12.187Z"
}
