{
  "title": "Govt is not scared for opposition’s jugglery tactics: Shibli",
  "link": "https://www.app.com.pk/national/govt-is-not-scared-for-oppositions-jugglery-tactics-shibli/",
  "date_published": "2020-12-12T17:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Federal Minister for Information and Broadcasting Senator Shibli Faraz on Saturday said the government would not become under pressure and scared by opposition’s jugglery tactics which they had adopted to get National Reconciliation Ordinance (NRO) but they would fail in this regard.\nTalking to a private TV channel, he said the opposition was trying to blackmail the government by using different tactics and they were using resignations as political stunt but not serious for the purpose.\nHe said the government was ready to hold dialogue with them on every important national issues but would not make any compromise over the matter of accountability of the corrupts.\nThe minister said the opposition had no moral logic to hold public gatherings during the second wave of coronavirus which was more lethal as compared to first, adding opposition was intentionally pushing the people in danger during this crucial time of pandemic in the country as international community was insisting to avoid for attending gatherings during the spreading of the deadly virus among the people.\nHe said the present situation of the COVID-19 was not allowing to hold any gathering in the country, adding the opposition parties were violating the National Command and Operation Centre (NCOC) directives.\nOpposition was showing irresponsible attitude and they had only one point agenda to protect corruption of their leadership but not for the welfare of the masses, he added.\nReplying to a question, he said both the political parties including Pakistan Muslim League Nawaz and Pakistan Peoples Party had destroyed the country and its institutions during their governments but now they were trying to become well wishers of the country and its people.\nShibli Faraz said although the government inherited different challenges but due to its hectic efforts the national economy was improving, exports were increasing,foreign remittances were enhancing, increasing international investment, Pakistani currency was strengthening day by day and reduced current circular deficit during the COVID-19 pandemic.\nTo another query, he said opposition should come in the Parliament as it was the best forum to discuss every national issue.\nHe said the opposition was exposing itself before the people by holding gatherings to protect corruption and they were playing with the lives of the people for their own interests during coronavirus spreading in the country.\nHe urged that it was our collective responsibility to act according to NCOC decisions and adopt all standard operating procedures SOPs with letter and spirit to contain the deadly virus.",
  "retrievedAt": "2025-08-11T20:08:09.398Z"
}
