{
  "article_id": "2025-05-13_c3af76abd3ae788d68fd6f57eb186dfa",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/punjab-bans-use-of-sacred-text-material-for-packaging-purpose/",
    "retrieved_at": "2025-08-27T15:25:53.331Z"
  },
  "metadata": {
    "title": "Punjab bans use of sacred text material for packaging purpose",
    "author": null,
    "date_published": "2025-05-13T07:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "LAHORE, May 13 (APP):The Punjab Home Department has enforced Section 144 across the province, banning the use of newspapers and printed papers containing holy verses for packaging and wrapping purposes. According to the spokesperson for the Punjab Home Department, the ban will remain in effect for 90 days. The decision has been made in response to concerns that newspapers and printed materials often contain sacred words, including Quranic verses, which are then inappropriately used for wrapping or packaging goods-an act considered disrespectful and religiously sensitive. \"The use of such materials for commercial or domestic packaging can not only hurt religious sentiments but also lead to unrest,\" said the Punjab home secretary. \"To prevent any potential disturbance to law and order, the ban under Section 144 has been enforced.\" The order strictly prohibits the wrapping and packaging of any items using papers that bear religious text. Authorities have directed that the notification be widely disseminated through the official gazette, print media and electronic outlets to raise public awareness. The Punjab Home Department emphasised that maintaining the reverence of sacred words is a collective responsibility and urged citizens to cooperate fully with the new regulations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}