{
  "article_id": "2025-05-13_954d8c05091225811432e218a2d4e473",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pml-chief-links-lasting-peace-to-resolution-of-kashmir-dispute/",
    "retrieved_at": "2025-08-27T15:25:05.113Z"
  },
  "metadata": {
    "title": "PML chief links lasting peace to resolution of Kashmir dispute",
    "author": null,
    "date_published": "2025-05-13T15:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 195,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 13 (APP): Pakistan Muslim League (PML) President and former Prime Minister Chaudhry Shujaat Hussain stated that true global peace cannot be achieved without resolving long-standing conflicts such as Kashmir, emphasizing the need for sincere and serious efforts toward lasting stability in the region. He specifically urged the United States, stating that if the international community is truly committed to lasting global peace, it must not ignore longstanding disputes like Kashmir and should prioritize resolving them. Chaudhry Shujaat Hussain appreciated the US President's interest in the Pakistan-India ceasefire and expressed hope that President Trump would show the same seriousness by taking practical and prioritized steps toward a lasting solution to the Kashmir issue. Chaudhry Shujaat Hussain also stressed that while global attention is focused on conflicts such as Russia-Ukraine and Israel-Palestine, the significant issue of Kashmir must not be overlooked. Chaudhry Shujaat Hussain thanked friendly nations including Saudi Arabia, China, Turkiye, Azerbaijan, the United Arab Emirates, Iran, Qatar, and other Islamic countries for consistently supporting Pakistan's stance and standing with the Kashmiri people on all issues. He urged global powers to rise above self-interest and pursue a policy rooted in justice for the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}