{
  "article_id": "2025-05-13_2ada2345005acc0a5d2bf4be773ab4c5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-rejects-provocative-inflammatory-assertions-by-indian-pm-fo/",
    "retrieved_at": "2025-08-27T15:25:03.927Z"
  },
  "metadata": {
    "title": "Pakistan rejects provocative, inflammatory assertions by Indian PM: FO",
    "author": null,
    "date_published": "2025-05-13T13:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 360,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 13 (APP): Pakistan on Tuesday rejected the recent remarks by the Indian Prime Minister, terming them as \"provocative and inflammatory\" that represented a dangerous escalation and a blatant disregard for international law, reflecting a propensity to fabricate misleading narratives to justify the aggression and its military adventurism. The statement issued by the Ministry of Foreign Affairs warned of escalating regional tensions and accused India of engaging in political opportunism, misinformation, and a dangerous disregard for international law. The response follows a controversial address by the Indian leader, which falsely portrayed Pakistan's intent in supporting a ceasefire and misrepresented the recent Pahalgam attack to justify potential military aggression. \"At a time when international efforts are focused on regional peace and stability, such rhetoric is a reckless escalation,\" said the Foreign Office, asserting that India is using the incident to \"fabricate misleading narratives\" and justify its \"military adventurism.\" The statement emphasized that Pakistan's response to Indian aggression had been \"calibrated and targeted against military installations,\" reiterating the country's right to self-defense and its capacity to respond with strength and precision. It said New Delhi was setting a 'dangerous precedent' by targeting civilians and military bases alike, risking \"an uncontrollable escalatory spiral.\" The Ministry also refuted Indian claims that Pakistan sought a ceasefire and said the agreement was the result of diplomatic efforts by friendly countries and Pakistan's commitment to de-escalation. The Foreign Office further criticized India's violations of the Indus Water Treaty and pointed to what it described as India's \"revisionist mindset\" and \"brinkmanship,\" which could threaten strategic stability in South Asia. Highlighting its sacrifices in the global war on terror, Pakistan reiterated its position as a victim of terrorism - \"directly sponsored by India\" and reaffirmed its support for a peaceful resolution of the Jammu and Kashmir dispute in accordance with UN Security Council Resolutions. Calling on the international community to monitor India's actions closely, the Foreign Office concluded by urging a return to \"mature leadership, regional cooperation, and respect for international norms,\" warning that any future aggression would be met with full resolve. \"Peace is the true strength,\" the statement read, \"and must not be mistaken for weakness.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}