{
  "article_id": "2025-05-13_8b42e0859893e259cf05f96a4aeef83e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-taking-concrete-steps-to-bridge-voter-gender-gap-tariq-fazal-chaudhry/",
    "retrieved_at": "2025-08-27T15:25:36.811Z"
  },
  "metadata": {
    "title": "Govt taking concrete steps to bridge voter gender gap: Tariq Fazal Chaudhry",
    "author": null,
    "date_published": "2025-05-13T08:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 263,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 13 (APP):Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry informed the National Assembly on Tuesday that comprehensive measures are being taken to ensure the registration of women voters in the electoral rolls. He said that the current gender gap between male and female voters stands at 7.39%. Responding to a calling attention notice by MNA Alia Kamran regarding the underrepresentation of women in the voters' lists compared to their overall population, the minister emphasized that the Election Commission of Pakistan (ECP) has consistently prioritized the inclusion of women in electoral rolls. Dr. Chaudhry stated that all relevant departments and agencies are working in close coordination to eliminate the gap wherever it exists. As a result of these efforts, the registration of women voters has shown significant improvement compared to previous years. He added that further measures are being undertaken to enhance this progress. He informed the House that under the Election Act, 2017, coordinated data on voter registration is published annually. According to the data, in 2012, male voters made up 56.3% while female voters accounted for only 43.37%, with a gender gap of 13.27%. As of 2025, male voters constitute 53% and female voters 46.3%, narrowing the gap to 7.39%. To promote female voter registration at the grassroots level, district committees were formed in 2018, and their meetings are held regularly. A survey on the gender gap was also conducted in 2020, he added. Moreover, Dr. Chaudhry noted that NADRA and ECP staff are utilizing mobile vans to reach women at their homes, facilitating easier access to registration services.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}