{
  "article_id": "2025-05-13_6656a274fda5c9cdb92e5537d429dec1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/40-civilians-11-troops-martyred-in-indian-aggression-ispr/",
    "retrieved_at": "2025-08-27T15:25:10.750Z"
  },
  "metadata": {
    "title": "40 civilians, 11 troops martyred in Indian aggression: ISPR",
    "author": null,
    "date_published": "2025-05-13T08:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 277,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, May 13 (APP): 40 civilians and 11 Pakistan Armed Forces personnel were martyred in unprovoked and reprehensible dastardly attacks during the night of May 6 to 7. \"On the night of 6-7 May 2025, the Indian Armed Forces launched unprovoked and reprehensible dastardly attacks targeting innocent civilians, including women, children, and the elderly. These barbaric strikes resulted in the martyrdom of 40 civilians-among them 7 women and 15 children-while 121 others sustained injuries, including 10 women and 27 children\" said an ISPR news release. In response to this grave aggression, the Pakistan Armed Forces mounted a resolute response under the banner of Marka-e-Haq, delivering precise and notch-up retributive strikes through Operation Bunyanum Marsoos. While defending the motherland with exemplary valour, 11 personnel of the Pakistan Armed Forces embraced martyrdom and 78 were wounded. The martyrs from the Pakistan Army included Naik Abdul Rehman, Lance Naik Dilawar Khan, Lance Naik Ikramullah, Naik Waqar Khalid, Sepoy Muhammad Adeel Akbar, and Sepoy Nisar. The martyrs from the Pakistan Air Force included Squadron Leader Usman Yousuf, Chief Technician Aurangzeb, Senior Technician Najeeb, Corporal Technician Farooq, and Senior Technician Mubashir. Their noble sacrifice of martyrs is an enduring symbol of courage, devotion, and unwavering patriotism, etched forever in the nation's memory. The Pakistan Armed Forces, together with the people of Pakistan, pay solemn tribute to the martyred civilians and military personnel and offer heartfelt prayers for the swift recovery of the injured. \"The nation remains resolute in the face of aggression. Let there be no ambiguity: any attempt to challenge Pakistan's sovereignty or territorial integrity, ever again, shall be met with a swift, full-spectrum, and decisive response Inshallah\" the release said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}