{
  "article_id": "2025-05-13_14a3464dcd4cda21e852e32311b4c323",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-matvienko-reaffirm-commitment-to-deepening-bilateral-relations-parliamentary-diplomacy-trade/",
    "retrieved_at": "2025-08-27T15:24:16.599Z"
  },
  "metadata": {
    "title": "Gilani, Matvienko reaffirm commitment to deepening bilateral relations, parliamentary diplomacy, trade",
    "author": null,
    "date_published": "2025-05-13T16:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 634,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 13 (APP): Chairman Senate Syed Yousaf Raza Gilani met with bilateral relations Chairperson of the Federation Council of the Russian Federation, in Kremlin, Moscow, on Tuesday where both leaders reaffirmed their commitment to deepening bilateral relations, boosting parliamentary diplomacy, and promoting peace, trade, and regional stability. Expressing gratitude for the warm hospitality, Gilani highlighted Pakistan's desire to strengthen ties with Russia. \"Pakistan-Russia cooperation today carries global significance - not just for our shared prosperity, but also for a stable and secure region,\" he said. Gilani emphasized that high-level parliamentary engagements like this play a key role in fostering better understanding and long-term cooperation, said a news release received here. He also congratulated the Russian leadership on the 80th anniversary of Victory Day and discussed wide-ranging issues with Chairperson Matvienko, including enhanced parliamentary dialogue, energy collaboration, regional peace, and people-to-people connections. Matvienko welcomed Gilani warmly, acknowledging his longstanding ties with Russia and his contributions to deepening relations during his premiership. She said bilateral ties were growing stronger and reaffirmed Russia's commitment to implementing the MoU signed between the two parliaments. She noted the Joint Implementation Protocol had been received and would soon go through internal processes. Both sides stressed the value of parliamentary diplomacy, especially in times of rising global tensions. Gilani said stronger parliamentary ties could help stabilise volatile regions such as Afghanistan and South Asia. Reaffirming Pakistan's commitment to peace and dialogue, Gilani said Pakistan continues to advocate for diplomatic solutions to disputes, including the issue of Jammu and Kashmir. He said Pakistan remains dedicated to peaceful coexistence despite ongoing provocations. \"Billions of lives cannot be hostage to conflict. We have rejected baseless accusations, called for independent investigations into recent escalations, and condemned unilateral actions like the suspension of the Indus Waters Treaty,\" he said. Gilani urged Russia to play a constructive role in facilitating dialogue between Pakistan and India, adding that Pakistan has formally requested proof and a fair investigation instead of escalatory measures. \"We passed a unanimous resolution rejecting false claims and condemned India's unilateral suspension of the water treaty as a serious breach of trust,\" he said. Reiterating Pakistan's counter-terrorism stance, Gilani stressed, \"No country's soil should be used for terrorism against another.\" He called on Russia, as a responsible global power, to help encourage peace and stability in South Asia. Matvienko responded positively, saying Russia is ready to assist in Pakistan-India dialogue. \"It is encouraging to see signs of stabilization and a ceasefire,\" she said. On global security, Gilani and Matvienko agreed that international terrorism is a threat beyond regional borders. Referring to the Russia-Ukraine conflict, Gilani said the language of diplomacy must be prioritised, and all disputes must be resolved through dialogue. On economic cooperation, Gilani noted the untapped potential in Pakistan-Russia trade and called for progress through the Intergovernmental Commission. He advocated for joint projects in energy, metallurgy, LNG, and hydropower, and welcomed recent discussions on barter trade and business-to-business (B2B) cooperation. He also called for expanding cultural and academic exchange through university partnerships, student programs, technology collaborations, and relaxed visa regimes. He expressed optimism about the resumption of direct flights to enhance tourism and trade. Recalling Pakistan's sacrifices in the fight against terrorism, Gilani shared personal experiences: \"My son was held hostage for three years. Shaheed Benazir Bhutto fell to terrorism. Malala Yousafzai-recognised globally during my term-symbolises Pakistan's resilience. We expect global solidarity in our fight.\" Gilani further noted that both countries are part of the six-nation Speakers' Conference and proposed future cooperation between this body and Russia's Federation Council to enhance dialogue and regional connectivity. The meeting, held in a cordial and forward-looking atmosphere, was also attended by Federation Council Deputy Chairman Konstantin Kosachev, Head of the Pakistan-Russia Parliamentary Cooperation Group Vladimir Chizhov, Pakistan's Ambassador to Russia Khalid Muhammad Jamali, and Aizaz Khan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}