{
  "article_id": "2025-05-13_6f00d917082fea361260e9c6961ee02e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-scbap-calls-on-governor-baluchistan/",
    "retrieved_at": "2025-08-27T15:24:36.599Z"
  },
  "metadata": {
    "title": "President SCBAP calls on Governor Baluchistan",
    "author": null,
    "date_published": "2025-05-13T18:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 333,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 13 (APP):Mian Muhammad Rauf Atta, President Supreme Court Bar Association of Pakistan (SCBAP), met with Shaikh Jaffar Khan Mandokhail, Governor Baluchistan, in Quetta. Mir Attaullah Langove, President of the High Court Bar Association of Baluchistan, accompanied the SCBAP President during the meeting. The discussions encompassed a range of topics, including the prevailing situation at the eastern borders. Both parties praised the valor and courage of our armed forces across all services, which responded to India's unfounded provocations with a measured use of force-one that the opposing side could not counter. They emphasized that any violation of our territorial integrity would be deemed unacceptable, and any future escalation would be met with full force, resulting in unimaginable consequences for the aggressor. The role of both federal and provincial governments, the federal cabinet, and all political parties in Parliament was acknowledged as extremely satisfactory and patriotic, which was crucial at this time. In this context, the decision to celebrate May 10 each year as a day of remembrance for the triumphs achieved by our armed forces was appreciated, along with the plan to hold Youm-e-Tashakur on May 16, 2025, in which the legal fraternity will also participate at all levels Besides the above, both sides also commended the collective social response of the entire Pakistani society, including the media and representatives from various political parties and communities, who displayed true patriotism during these challenging times. Both sides reiterated that Pakistan, having been a victim of terrorism, condemns terrorism in all forms and manifestations around the world. They expressed hope for a continued ceasefire, contingent upon mutual adherence by the opposing party. Additionally, they called for meaningful dialogue regarding the restoration of the Indus Water Treaty and negotiations on Indian-occupied Kashmir, seeking a just and fair resolution in line with the aspirations of the resilient Kashmiri people and United Nations resolutions. They asserted that it is high time that state of Pakistan should hold discussions for the independence of the illegal occupation of Kashmir.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}