{
  "title": "Swati inaugurates Scrapyard Management System",
  "link": "https://www.app.com.pk/national/swati-inaugurates-scrapyard-management-system/",
  "date_published": "2022-01-20T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Pakistan Railways and  Google joined hands to revolutionise scrapyard management by deploying the state-of-art Scrapyard Management System powered by Google technologies and implemented by Tech Valley Pakistan.\nThe management system is currently being deployed in Railways Carriage Factory, Islamabad as a Proof of Concept which will be later on expanded to the national level.\nFederal Minister for Railways Senator Muhammad Azam Khan Swati inaugurated the Scrapyard Management System along with Google Productivity and Collaboration Suite.\nSenior officials from the Ministry of Railways and CEO Tech Valley Mr Umar Farooq along with his team were present at the occasion. Representatives from Google also joined the event online through Google meet.\nDuring the inauguration ceremony, Federal Minister Railways said: “Pakistan Railways has an annual scrap disposal target of Rs. 2 billion which is added to the national exchequer. For quite some time copper scrap has not been disposed of, recently the same scrap was given on Government-to-Government (G2G) basis to M/S POF and Railways received Rs. one billion in the last two months.”\nThe cloud-based scrapyard management system will digitize the scrapyard assets of Pakistan Railways, in addition to streamlining the scrapyard inventory management & bringing transparency to the Scrap Management process of Pakistan Railways.\nAlong with Scrapyard Management System, the collaboration and productivity suite was also inaugurated by Federal Minister for Railways. The suite will provide Railway employees with an effective way to collaborate with different teams using the latest digital tools. This will also aid in ensuring productivity while working remotely or communicating from distant locations.\nOn this occasion, Umar Farooq, CEO Tech Valley said, “Under the Prime Minister’s vision of Digital Pakistan, digitizing scrapyard management and deploying Google Workspace are one of the many upcoming steps in digitizing the Pakistan Railways and current government at large.”\nSpeaking at the event Federal Minister Railways appreciated the efforts of Google, Tech Valley team and officers from Railways especially project lead Saad Ullah Zahid, who were involved in the development and implementation process of the Scrapyard Management System.\nHe further added, “An IT-based system is the only way such process can be streamlined and transparency can be brought to Government institutes”. The minister also shared details about the other technological initiatives that are currently being deployed in Railways including RAB TA, Complaint Management System, Facial recognition, E-Ticketing and E-Procurement.",
  "retrievedAt": "2025-08-11T14:09:27.237Z"
}
