{
  "title": "Sania for public-private sectors coordination to create new jobs",
  "link": "https://www.app.com.pk/national/sania-for-public-private-sectors-coordination-to-create-new-jobs/",
  "date_published": "2022-01-20T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): Special Assistant of the Prime Minister (SAPM) on Poverty Alleviation and Social Protection Dr Sania Nishtar Thursday stressed the need for coordination between public and private sectors for creating new employment opportunities in the country.\nCollaboration between government, academia and the private sector in structuring a sustainable intervention for providing an enabling environment, was need of the hour, she added.\nShe was addressing a conference on the ongoing street vendors’ initiative in Islamabad under the ambit of Ehsaas Rehribaan program, jointly organized here by Pakistan Institute of Development Economics (PIDE) and Metropolitan Corporation Islamabad (MCI), a press release said.\nThe purpose of the conference was to highlight the transformation of street vending Dr Sania Nishtar appreciated the first of its kind collaboration between government, academia, and the private sector in structuring a sustainable intervention for providing an enabling environment to street vendors.\nShe said Prime Minister Imran Khan had been behind the initiative with his full support. “However, the success of the programme lies in the integrity of the individuals running the programme.”\nShe recognized the fact that the initiative was among the most difficult ones among all Ehsaas programmes, as it directly shook up the status quo for saving the poor vendors from an entrenched exploitative system. “It creates opportunities for livelihood and contributes to climate change efforts through solar system-fitted carts,” she added.\nShe expressed her hope that the programme would continue with the pace to cover other areas of the city and later be replicated in other cities of the country Zia Banday, the focal person of the Ehsaas Rehribaan program, presented the background and progress of the programme.\nDeputy Commissioner Islamabad, Hamza Shafqat stated that the local administration, with the collaboration of different community organizations, was working for the betterment of street vendors.\nPIDE Vice-Chancellor Dr. Nadeem ul Haque, in his opening remarks, said every country focused on street vending businesses but it was not the case in Pakistan.\n“As we all know the encroachment of street vending has affected every single person, but those who are highly affected are the lower social class. Under the current situation, it has become difficult for them to meet their basic needs.\n“They are even starving to death and as all the businesses are shutting down the government is also unable to focus on all these problems and to support each person for a long period of time.”\nDr. Nadeem ul Haque, who is also former Deputy Chairman Planning Commission, said labor market was a big mess. Foreign involvement and funding had led to certain projects only such as building roads, which did not help improve the livelihoods of people.\nDifferent countries, he said, had uniform street vending systems but in Pakistan, there was no such kind of uniformity let alone a system to help them build one. The government did not focus on such smaller projects as most funding was done for specified projects.\nHe further added that for a country, to prosper, it was equally important to focus on bigger projects as well as it was to focus on smaller projects including the street vending businesses.\nHuman development was an essential ingredient in alleviating the vicious circle of poverty and unemployment, he added.\nAround 150-street vendors, who are given vending licenses and new eco-friendly carts, did participate in the conference. A high number of officials and representatives from municipalities, government agencies, academia, microfinance banks, and civil society also attended.",
  "retrievedAt": "2025-08-11T14:09:27.290Z"
}
