{
  "title": "Qadri for SOPs to remove anomalies in ‘Ruet-e-Hilal’s system",
  "link": "https://www.app.com.pk/national/qadri-for-sops-to-remove-anomalies-in-ruet-e-hilals-system/",
  "date_published": "2022-01-20T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Federal Minister for Religious Affairs and Interfaith Harmony Noorul Haq Qadri Thursday formed a committee for making standard operating procedures (SOPs) to remove all the anomalies in the Ruet-e-Hilal Committee’s system.\nHe announced this while holding a meeting with Ulema of various schools of thought and stakeholders here in the religious ministry.\nThe committee is consisted of Jamia Subhania Rizvia Maladag Dargai’s Mufti Fazal-e-Jameel Rizvi, Jamia Minhajul Hussain, Shahrah Ali Bin Talib Principal Allama Muhammad Hussain Akbar and Jamia-tul-Rasheed’s Mufti Faisal Ahmed.\nThe committee will give a final shape to the unified framework in consonance with Ulema and stakeholders such as; Council of Islamic Ideology, Pakistan Meteorological Department and Pakistan Space and Upper Atmosphere Research Commission etc in a month.\nBesides Federal Minister for Religious Affairs and Interfaith Harmony Noorul Haq Qadri, Council of Islamic Ideology (CII) Chairman Dr Qibla Ayaz, Central Ruet-e-Hilal Committee Chairman Moulana Abdul Kabeer Azad, Jamia Minhajul Hussain, Shahrah Ali Bin Talib Principal Allama Muhammad Hussain Akbar, Jamia Subhania Rizvia Maladag Dargai’s Mufti Fazal-e-Jameel Rizvi, Mohbat Khan Masjid Khateeb Moulana Tayyab Qureshi, Data Darbar Masjid Khateeb Moulana Muhammad Ramzan Sialvi, Jamia Islamia’s Moulana Abu Bakar Mohiuddin, Jamia-tul-Rasheed’s Mufti Faisal Ahmed, Al Markaz Al Islami’s Maulana Naseem Ali Shah, Darbar-e-Alia Eidgah Shareef’s Muhammad Hassan Haseeb-ur-Rehman and Muhtamen Idara Fathul Uloom (Nawankali Rustam Mardan)’s Qazi Fathul Bari Rustami attended the meeting.\nDuring the meeting, a number of proposals were discussed by the respective Ulema and stakeholders.\nData Darbar Masjid Khateeb Moulana Muhammad Ramzan Sialvi said there should be a ‘science library’ to seek help from the latest astronomical inventions.\nHe said the members of the Ruet-e-Hilal Committee should be well-qualified and expert so that nobody could point out at its credibility.\nHe said the people had no proper information about ‘Ruet-e-Hilal’ so that a media campaign should be launched to sensitize the public about its goals and functions.\nHe said there should a well-coordinated liaison among the zonal and district committees to resolve the ‘Ruet-e-Hilal’ issues like testimony of moon sighting with mutual understanding.\nHe said there should be a timeframe to announce the moon sighting because the delay in the announcement would create confusions in the masses and provide an opportunity to the miscreants to sabotage the sacred events based on lunar calendar.\nHe also urged the media to play a responsible role especially on the occasion of Ramazan and Eidul Fitr’s moon sighting.\nMohbat Khan Masjid Khateeb Moulana Tayyab Qureshi pointed out some areas of Khyber Pakhtunkhwa province – Charsadda, lucky Marwat, Kohat, Bannu and Peshawar where the issue of moon sighting was created for whole the nation.\nHe proposed that the Central Ruet-e-Hillal Committee should hold talks with the troublesome people like Mufti Shahabuddin Popalzai in a bid to reach a consensus over the moon sighting issue.\nAl Markaz Al Islami’s Maulana Naseem Ali Shah shared a format of a form for the people who wanted to give testimony about the moon sighting so that they could be held accountable later if proved guilty.\nJamia Minhajul Hussain, Shahrah Ali Bin Talib Principal Allama Muhammad Hussain Akbar highlighted the significance of astronomy and urged to seek help of astronomers while sighting the moon.\nHe said the astronomers support would remove the ambiguity if any as it was the age of science and technology.\nCentral Ruet-e-Hilal Committee Chairman Moulana Abdul Kabeer Azad, on this occasion, presented a report to the minister and CII chairman regarding the achievements of Ruet-e-Hilal Committee so far.",
  "retrievedAt": "2025-08-11T14:09:17.863Z"
}
