{
  "title": "Unvaccinated more at risk from Omicron variant, positivity ratio jumps high: Faisal Sultan",
  "link": "https://www.app.com.pk/national/unvaccinated-more-at-risk-from-omicron-variant-positivity-ratio-jumps-high-faisal-sultan/",
  "date_published": "2022-01-20T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Special Assistant to Prime Minister on Health Dr. Faisal Sultan Thursday said that omicron variant of COVID-19 is dangerous for those who have not been vaccinated against the disease and positivity ratio had jumped high but the situation was under control in hospitals.\n“This vaccination rate is proving quite effective against the omicron variant as the number of infections is soaring, but patient hospitalization and death rate is still low in the country”, he said while talking to a private news channel.\nFaisal said a majority of omicron cases were reported in Karachi, followed by Lahore and Islamabad, adding, almost all patients with omicron infection have mild symptoms, especially the vaccinated people.\nSAPM said over 0.8 million doses of the Covid-19 vaccine had been administered in Pakistan on daily basis and the campaign would be further sped up.\nHe also expressed his concern over non-compliance of SOPs, that wearing a mask and vaccination are the most effective ways to stop the spread of the coronavirus pandemic’s 5th wave which would continue in next few weeks.\nReplying a question, he said NCOC directed provinces to ensure that district administrations should play an effective role in the enforcement of SOPs and take strict actions against violators.\nHe said that more than 51% people above 12 years living in county are fully vaccinated against the coronavirus, adding, Faisal urged people to wear masks at all times and avoid crowded places. Meanwhile, smart lockdowns will be imposed in areas where the infection rate is high.\nPeople above 18 years can also get their booster dose from any vaccination centre across Pakistan, he said, adding, the shots will be administered free of cost.\nReplying another question, he said that government was taking wise decisions to overcome the burden of Omicron, however, people should need to change their social behavior towards vaccination drives as mostly people are not yet paying heed to virus seriously.",
  "retrievedAt": "2025-08-11T14:09:43.175Z"
}
