{
  "title": "Kashmiris can never forget Gawkadal like massacres: Mushtaq Gilani",
  "link": "https://www.app.com.pk/national/kashmiris-can-never-forget-gawkadal-like-massacres-mushtaq-gilani-2/",
  "date_published": "2022-01-20T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Senior All Parties Hurriyat Conference (APHC) leader, Mushtaq Hussain Gilani said Thursday that Kashmiris could never forget the Gawkadal massacre perpetrated by Indian occupation forces back in 1990.\nIn a statement issued here, the APHC leader said that on 21 January 1990 at least 50 innocent Kashmiris were mercilessly gunned down by the Indian occupation forces while opening indiscriminate fire on a peaceful procession at Basant Bagh locality of Srinagar city.\nHe said, Kashmiris have always been victim of Indian barbarism as in 1947, India, under a well-conceived plan, martyred at least 300,000 innocent people with the help of extremist Hindus in Jammu.\nSince then the Kashmiri people have been the victims of Indian tyranny adding that the occupation forces have perpetrated many such massacres including in Srinagar, Bijbihara, Sopore and Handwara.\nHe said, recently USA based “Genocide watch”, had warned the international community that India was planning a massacre in IIOJK and Indian state of Assam.\nHe said, the Gawkadal massacre was a big tragedy and this clearly made Kashmiris understand the greed and selfishness of those who have been collaborating with India to prolong its occupation.\nHe said, India had always been hell bent on not only seizing the land of Kashmiris but also preparing conducive environment for Hindutva by subverting religious and cultural values in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe said, Kashmiris have no choice but to carry on their struggle for freedom from Indian occupation.\nHe lamented that the world community was deliberately neglecting the Kashmir issue despite the fact that it was internationally recognized disputed territory, adding peace in South Asia could not be materialize without resolving this issue.",
  "retrievedAt": "2025-08-11T14:09:43.311Z"
}
