{
  "title": "‘Lighter Bag Brighter Student’ policy kicks off at federal capital",
  "link": "https://www.app.com.pk/national/lighter-bag-brighter-student-policy-kicks-off-at-federal-capital/",
  "date_published": "2022-01-20T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):The Federal Directorate of Education (FDE), much to the delight of students, parents and teachers alike, launched ‘Lighter Bag Brighter Student’ policy on Thursday at the Junior Campus (I-8/2) of Islamabad Model College for Girls I-8/4.\nUnder the initiative of ‘Books Free Bag for Primary Classes’ inaugurated here by Parliamentary Secretary for Education Wajeeha Akram as chief guest, the little souls would be relieved from the daily burden of carrying all their books to school and back home.\nThe inauguration ceremony was attended by smiling and fresh faces as it certainly was a long awaited initiative and was warmly welcomed by all.Speaking on the occasion, the Parliamentary Secretary urged the need to focus on quality education through the use of latest technology.\nWajiha Akram also said that there was a need to pay special attention on teachers’ training.The students of primary classes will be given two sets of books; one will be kept at home and the other will be kept at school.As a result, the little angels would no longer be overburdened by the heavy bags. All they would have to carry now is a bag containing two notebooks, a lunch box and a water bottle.\nOn the occasion, Additional Secretary Ministry of Federal Education and Professional Training (MoFEPT) Mohi ud Din Wani recalled the spiritual bond with his teachers and urged for better relations between teachers and students.\nIt was the responsibility of teachers to create and maintain a friendly atmosphere, he added.Director General, FDE, Dr Ikram Ali said all institutes in Islamabad Capital Territory would be brought under the umbrella of this policy and eventually the rural areas would also be included.\nPrincipal of the college, Dr Firdous Zahra Bashir, thanked the guests for honoring the ceremony with their presence. She greatly appreciated the policy and called for its impact assessment in the future.A student Meherwar Bakht of class 5 speaking on the occasion said she was very pleased by the initiative taken by the FDE. Not having to carry all her textbooks daily “Makes me feel lighter and brighter both mentally and physically,” she expressed joyfully.\nAnother student, Asawir Shabbir of class 4, thanked the policy makers for relieving their tiny bodies from this burden. She was greatly appreciated for her confidence as she mumbled a few times but did not give up and finished her speech artfully. She vowed to study hard and bring fame to her school by becoming a successful person and a responsible citizen.\nEarlier, a group of students welcomed the guests with the school’s band performance, and beautiful girls clad in traditional dresses presented them bouquets of flowers.A group of students from IMCG I-10/4 mesmerized the audience with their amazing tableau on ‘Mera Dais Mera Mahiya’.\nAnother group spellbound the audience with their melodious voice as they sang and reinvigorated patriotism in the audience with the song ‘Chalo Ye Sochain Hum Aaj Mil Kay, Jo Is Zameen Se Kiya Tha Hum Nay, Wo Ahd Kia Hum Nibah Rahe Hain.’\nTalking to APP, teachers and mentors told that the Policy was a unique and necessary initiative that would positively affect the mental and physical well-being of the students.The ceremony that formally began with the recitation of Holy Quran by Jaweria Khawas of class 8, followed by Naat recitation by Javeria Abid, concluded with a patriotic standing ovation in honor of the national anthem.",
  "retrievedAt": "2025-08-11T14:09:30.753Z"
}
