{
  "title": "Gaw Kadal massacre: Victims still await justice after 32 years",
  "link": "https://www.app.com.pk/national/gaw-kadal-massacre-victims-await-justice-for-past-32-years/",
  "date_published": "2022-01-20T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Despite lapse of around 32 years, the victims of Gaw Kadal massacre are still yearning for justice, which has become an elusive dream for them as it was state-managed and the Indian authorities have never shown any intention to bring the culprits to justice .\nBack in 1990, on the fateful day (January 21) at least 50 Kashmiris were killed on-the-spot when Indian forces opened indiscriminate fire on a peaceful procession at Basant Bagh locality of Srinagar city.\n“Investigation reports submitted to the government had established the Indian army’s direct involvement in these horrendous incidents of the violence but no action whatsoever was taken against the perpetrators,” Shafiq-ur-Rehman, spokesman of the Jammu Kashmir National Front (JKNF), an APHC constituent, said in a statement.\nThe spokesman urged the international community to play its much-needed role to hold the Indian government accountable for the crimes its troops have committed against Kashmiris.\nKashmiris across the Line of Control (LoC) remember the martyrs of Gaw Kadal every year and pay rich tributes to them for sacrificing their lives for the sacred cause of freedom.\nThis year too, the All Parties Hurriyat Conference (APHC) has given a call for complete shutdown on January 21 in the Srinagar district to observe the day and pay tributes to the martyrs.\nThe illegally detained APHC Chairman Masarrat Aalam Butt, in a message from New Delhi’s Tihar Jail, has paid rich tributes to the martyrs, appealing to the people to organize congregational prayer meetings on the auspicious day of Friday and register peaceful protests against the genocide of innocent people, extrajudicial killings, arbitrary arrests, custodial disappearances, change of demography and imposition of Hindutva ideology by the Indian occupation forces in the territory, Kashmir Media Service reported.\nIt was not possible for the Kashmiris to forget the Gaw Kadal massacre, said senior APHC leader Mushtaq Hussain Gilani while talking to APP.\nThe Kashmiris, he said, had always been victim of Indian barbarism. However, the tragedies like Gaw Kadal, Bijbihara, Sopore and Handwara had further strengthened their resolve that there was no way out without complete independence from India.\nHe lamented that the world community was deliberately neglecting the Kashmir issue despite the fact that it was an internationally recognized disputed territory. However, peace in South Asia could not materialize without resolving the issue, he added.\nFor many people, January is the month which always reminds Kashmiris of the massacres. “January is the month which keeps reminding Kashmir of the worst civilian massacres of Kashmiris in history. #GawKadal #Handwara,” said a Twittrati, Gohar Geelani in recent tweet.\nAnother Twitterati, Qashmir has tweeted that this day, Gaw Kadal had bloodbath.\n“31 one years ago today, Indian forces killed 52 Kashmiris on “The bridge of no return” brutally. Abdur Rauf Wani took 32 bullets to his chest, from a very close range, to shield his brethren. He saved many lives as he took his own last breaths Broken heart,” writes another Twitterati, Bea.\nMeanwhile, posters have appeared in Srinagar and adjoining areas asking people to observe a complete shutdown to mark the 32nd martyrdom anniversary of Gaw Kadal massacre victims.\nKashmiris living in Pakistan and other parts of the world have also scheduled different programmes to pay homage to the martyrs and remind the world community of its obligations to resolve the Kashmir dispute in accordance with the relevant United Nations Security Council resolutions.\nFor many people January is the month which keeps reminding Kashmir of the worst civilian massacres of Kashmiris in history. Indian forces martyred 52 Kashmiris brutally  on \"The bridge of no return\"",
  "retrievedAt": "2025-08-11T14:09:35.305Z"
}
