{
  "article_id": "2025-07-08_95fb6645284417121680a26c2b4ae3e6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/actions-underway-to-curb-illegal-connections-electricity-meters-being-installed-based-on-cnics-na-body-told/",
    "retrieved_at": "2025-08-27T09:21:54.696Z"
  },
  "metadata": {
    "title": "Actions underway to curb illegal connections, electricity meters being installed based on CNICs: NA body told",
    "author": null,
    "date_published": "2025-07-08T17:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 816,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 08 (APP):The 9th meeting of the National Assembly Standing Committee on Power Division was held here on Tuesday at Parliament House under the chairmanship of MNA Muhammad Idrees. The session was attended by Federal Minister for Power and senior officials from the Power Division, NTDC, HESCO, PESCO, K-Electric, and TESCO, said a press release. The Committee confirmed the minutes of its previous meeting held on May 29, 2025. The Committee decided to defer agenda items related to discriminatory electricity load-shedding by Hyderabad Electric Supply Company (HESCO) and denial of basic utility rights to bill-paying constituents, as well as the comprehensive briefing by the CEO, HESCO, on electricity load-shedding and completion of grid station works at Jam Nawaz Ali, District Sanghar. The Committee reviewed the comprehensive report on the implementation status of its previous recommendations from the meeting held on May 29, 2025, and expressed satisfaction with the majority of the actions taken. The Special Secretary, Power Division, informed the Committee that in response to the Committee's recommendation, the issue of initiating electricity billing in 25 villages in Shabqadar, District Peshawar, was reconsidered. Meetings had been convened with the local community and concerned MNAs to resolve the matter. The CEO, PESCO, informed the Committee that local residents remain unwilling to clear outstanding dues or accept individual electricity meters, insisting instead on a fixed monthly lump-sum payment per household. The MNA from Charsadda apprised the Committee that the issue dates back to 1999, and electricity connections to the residents were disconnected in 2022. To resolve the issue, the MNA from Charsadda proposed the provision of solar energy system to the affected villages. However, the Minister for Power explained that actions are currently underway to curb illegal connections, and electricity meters are being installed based on Computerized National Identity Cards (CNICs). He further requested that the concerned MNA provide details of unauthorized connections. The Committee decided that upon receipt of the details, a Sub-Committee would be constituted to investigate the matter further. The Committee was also briefed on the internship programs offered during the Financial Year 2024-25 across departments under the Power Division. It was informed that a total of 1,996 unpaid and 551 paid internships had been offered. While student interns receive only a token amount of Rs. 3,000 per month, graduate engineers under the apprenticeship program are paid Rs. 75,000 per month for a two-month tenure. Members expressed concern over this disparity and directed the Division to explore options for establishing a uniform and market-competitive stipend policy. Further, the Committee deliberated on the non-completion of work on two 11 KV feeders-Jhalkot and Komalia-crossing the River Indus in Kohistan. The Committee directed that WAPDA release the required funds to PESCO for timely completion of these project. A comprehensive joint briefing was also given by HESCO and K-Electric regarding the provision of an alternate grid station (500 KV to 220 KV) to enhance power supply to Sindh and Karachi. This included proposals for additional transformers, upgrading the existing transformers at Jamshoro, and establishing a new 220 KV Grid Station at Nawabshah. NTDC also presented a briefing on the development of an alternate power source near Sekhat Road (500 KV to 220 KV) in Sindh, and the installation of transmission lines from the Mirpurkhas NTDC Grid Station. Syed Waseem Hussain, MNA from Hyderabad, raised concerns about the current electricity distribution status, noting that HESCO is also supplying electricity to Karachi. He stated that due to rising demand, the distribution system is often rendered dysfunctional. At present, demand stands at 1600 MW, while supply is limited to 1100 MW. He proposed the establishment of a new grid station in response to the area's growing population. The Committee, after the briefing, directed the CEO, HESCO and MD, NTDC to prepare a comprehensive technical and financial report addressing grid issues and power sector reforms for presentation in the next meeting. Rana Muhammad Hayat Khan, MNA from Punjab, raised the issue of numerous illegal electricity connections in Katchi Abadis in major cities. He proposed regularizing these connections through fines and issuing formal demand notices. The Minister responded that power supply planning to new housing schemes depends on the prior approval of layout plans by municipal or development authorities, as power infrastructure needs to be aligned with other essential services such as water, sanitation, and road networks. Lastly, the Committee decided to take up in its next meeting the issue of varying charges levied on consumption of 200 and 201 electricity units. The Minister, however, proposed that the next session should primarily focus on electricity theft and the status of bill recoveries across the Division. The meeting was attended by Sheikh Aftab Ahmed, Chaudhry Naseer Ahmed Abbas, Syeda Nosheen Iftikhar, Rana Muhammad Hayat Khan, Muhammad Abdul Ghaffar Watto, Muhammad Shaharyar Khan Mahar, Syed Abrar Ali Shah, Syed Waseem Hussain, Malik Anwar Taj, Sher Ali Arbab, Haji Imtiaz Ahmed Choudhry, Ali Afzal Sahi, MNAs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}