{
  "article_id": "2025-07-08_892a6aa3c67daf5e7467a45a394b6378",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pal-planetpulse-join-hands-to-promote-climate-conscious-literature/",
    "retrieved_at": "2025-08-27T09:22:29.322Z"
  },
  "metadata": {
    "title": "PAL & PlanetPulse join hands to promote climate-conscious literature",
    "author": null,
    "date_published": "2025-07-08T15:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 08 (APP):In an initiative merging literature and environmental advocacy, the Pakistan Academy of Letters (PAL) and PlanetPulse on Tuesday signed a Memorandum of Understanding (MoU) to collaboratively promote climate awareness through literature, storytelling, and education. The MoU was signed by Dr. Najeeba Arif, Chairperson, PAL, and Dr. Khalid Khan, Founder of PlanetPulse, here at PAL's office. This partnership aims to elevate climate literacy by integrating environmental narratives into Pakistan's literary landscape, engaging writers, poets, and educators across the country. Under the agreement, both organizations will collaborate to support climate-themed literary content, host events such as Mushaira, fellowships, and storytelling workshops, and co-publish anthologies in Urdu and regional languages. The MoU also emphasizes public engagement, collaboration with academic institutions, and policy advocacy to ensure that literature serves as a powerful tool for environmental change. One of the key initiatives includes the creation of a Climate Literature Archive, a multilingual online repository of Pakistani literary contributions addressing environmental challenges. PlanetPulse has agreed to arrange a special session on climate literary and its link with creative literature during the Academy forthcoming Youth Literature Festival scheduled on August 12-13, to acquaint young writers with sensitivity of the matter. Dr. Najeeba Arif praised the collaboration as \"a timely convergence of creative and social/civic responsibility,\" emphasizing literature's role in shaping public consciousness. Dr. Khalid Khan reiterated the importance of storytelling in transforming climate discourse and inspiring action. In addition to the heads of both organizations, this event was also attended by officers including Director General, PALSultan Nasir, Director, Planet Pulse Ms. Umama Khalid , Director, PAL Asim Butt, Deputy Directors PAL Mir Nawaz Solangi, Akhtar Raza Saleemi, Admin Officer Ms. Rafiqa Nazli, Muhammad Sajid, and Junaid Khalid. This three-year partnership marks a significant step towards cultural and environmental sustainability in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}