{
  "article_id": "2025-07-08_8420d736ae87ccd201ed18c71db60225",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-hosts-media-coordination-conference-to-strengthen-disaster-rick-communication/",
    "retrieved_at": "2025-08-27T09:20:29.450Z"
  },
  "metadata": {
    "title": "NDMA hosts Media Coordination Conference to strengthen disaster rick communication",
    "author": null,
    "date_published": "2025-07-08T14:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 8 (APP):The National Disaster Management Authority (NDMA) organized a media coordination conference in Islamabad to strengthen disaster preparedness, responsible crisis communication, and the timely dissemination of early warning alerts in collaboration with Provincial (PDMAs) and District Disaster Management Authorities (DDMAs). The session began with welcome remarks by Air Cdre (Retd) Umar Naeem, Executive Director of the Regional Military & Media Wing, emphasizing the need for unified messaging to reduce disaster impacts. The conference forms part of NDMA's broader Risk Communication Forum initiative, aimed at fostering seamless coordination and proactive alert systems nationwide. The conference brought together key stakeholders from the Ministry of Information and Broadcasting (MoIB), ISPR, Rescue 1122, mobile network operators, and humanitarian organizations. The NEOC Technical Team presented a detailed three-month hydro-meteorological impact analysis, highlighting anticipated monsoon-related risks across various regions. Ms. Sara Malik, Deputy Director Media NDMA, briefed participants on national media strategies for disaster risk communication, focusing on timely alert dissemination and countering misinformation during emergencies. Discussions emphasized community-focused messaging, collaboration with local media and influencers, and the use of digital tools like AI platforms, chatbots, and geo-tagged SMS alerts. Participants also stressed the importance of coordinated digital narratives to counter misinformation. Media representatives and provincial PROs shared challenges and local strategies for effective communication during disasters. The forum concluded with consensus on organizing provincial-level media workshops and joint trainings for PROs and journalists to improve crisis reporting and build communication capacity. NDMA reaffirmed its commitment to integrated, tech-enabled communication systems for strengthening national resilience.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}