{
  "article_id": "2025-07-08_d93eb10e732f643b468a839ccd3ab924",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iesco-installs-884000-ami-meters-so-far/",
    "retrieved_at": "2025-08-27T09:22:19.087Z"
  },
  "metadata": {
    "title": "IESCO installs 884,000 AMI meters so far",
    "author": null,
    "date_published": "2025-07-08T16:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 206,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 08 (APP):Islamabad Electric Supply Company (IESCO) has installed some 884,000 Advanced Metering Infrastructure (AMI) meters so far in Rawalpindi City and Cantt Circles. Project Director of IESCOas AMI Syed Mohsin Raza Gilani IESCO has consistently pioneered the use of cutting-edge and customer-centric technology in the power sector, delivering timely and quality services to its valued consumers. The AMI metersadesigned to ensure 100% accurate and timely meter readingsarepresent a revolutionary step in enhancing operational transparency and customer service. The installation campaign is in full swing, with 97% of connections with a load of 41 kW or more across the IESCO region already equipped with AMI meters. These smart meters enable automated complaint registration, real-time electricity consumption monitoring, reduction in line losses, detection and elimination of electricity theft, and enhanced recovery of electricity bills.A Additionally, they will help reduce transformer overloading and stabilize the distribution network, he said. This project is a game-changer for the power sector, Mr. Gilani added. It aims to enhance system efficiency and build a stronger, more transparent relationship between IESCO and its consumers.a Currently focused on Rawalpindi City and Cantt Circles, the AMI rollout will soon expand across the entire IESCO region, establishing a new benchmark in power sector service excellence.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}