{
  "title": "Martyred SHO buried amid touching scenes, mourners strongly condemn terrorists",
  "link": "https://www.app.com.pk/national/martyred-sho-buried-amid-touching-scenes-mourners-strongly-condemn-terrorists/",
  "date_published": "2023-01-31T14:25:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 31 (APP): The martyred Station House Officer (SHO) of Badabair, Irfan Khan was buried amid touching scenes at his native graveyard in Kotla Moshin Khan area while mourners strongly condemned terrorists for unleashing of a killing spree over innocent citizens.\nLate Irfan Khan had received fatal injuries on his head as he was standing close to the suicide bomber in the first row of the Police lines mosque for offering prayers.\nThe ill-fated Police official had visited Police Lines on Monday for some official engagements and was returning back to Police Station, but stayed for fulfilling his religious obligation of offering Zohar prayers.\nAccording to his relatives, Irfan was a regular visitor to masjid and preferred to offer prayer in the first row.\nHe had also survived a brutal attack by militants at a check post in Badabair area a week earlier and fought with exemplary audacity with attackers, compelling them to retreat and escape for safety. The attack claimed lives of three police officials including a Deputy Superintend of Police (DSP) and two constables.\nIrfan left behind five children while his elder son, who was also present at the funeral, is a student in fifth grade.\nHe was first cousin of two prominent Islamabad based journalists including Imtiaz Gul and Ayaz Gul who were also present at the last rituals of Irfan Khan.\nA large number of people of Kotla Moshin Khan, Police officials and relatives of Irfan Khan were present at the funeral.\nPoignant scenes were witnessed while lowering down the body of young martyred Police official of 42 years age into the grave and people were cursing those responsible for the gruesome act leaving around 90 families losing their dear ones and injuring to around 170 persons.",
  "retrievedAt": "2025-08-11T05:52:49.315Z"
}
