{
  "title": "Gandhara Festival 2023 opens",
  "link": "https://www.app.com.pk/national/gandhara-festival-2023-opens/",
  "date_published": "2023-01-31T14:36:00.000Z",
  "source": "APP",
  "content": "Commissioner Rawalpindi Division, Liaquat Ali Chatta visited Gandhara Festival and attended Dastan Goi (storytelling) program. Speaking on the occasion, he said meaning of Gandhara is the land of fragrances. Through these fairs, we will spread the fragrance of tolerance and peace in our country, which will stand out as a message of peace and love for humanity.\nThe expected arrival of ambassadors from China, Nepal, Sri Lanka, Bhutan, Laos, Thailand, Japan, South Korea, Malaysia and Indonesia is reflective of our commitment to promoting a soft image of Pakistan. The arrival of the Buddhist delegation from Sukkur shows the religious harmony.”\nExecutive Director Punjab Arts Council Muhammad Mehboob Alam and Director of the Arts Council Waqar Ahmed welcomed the Malaysian ambassador and informed him about the aims and objectives of the festival. Malaysian Ambassador Muhammad Adam Tugyu said on this occasion that there are long-standing diplomatic relations between Pakistan and Malaysia.\nThe civilization of Gandhara connects the two countries in a strong relationship. The teachings of Buddhism have traveled a long distance to reach Malaysia. The Government of Punjab, especially Punjab Arts Council’s initiative to highlight the culture of Gandhara is welcomed. The Malaysian Embassy will continue to play its role in presenting the culture of Gandhara to the world.\nExecutive Director Punjab Arts Council Muhammad Mehboob Alam said that civilization is a mirror of any country, nation and people. Fairs are being organized to bring the culture of Cholistan to the people. In the storytelling program of Gandhara Festival, Fazal Jatt won the applause of the audience by narrating folk tales in his unique style.\nThe event has been organized by Information and Culture Department, Government of Punjab and Punjab Council of the Arts to highlight the cultural heritage of the “Land of Fragrance”. The activities of the festival include master artisan at work, Gandhara art exhibition and book fair, folk dances, documentaries screening on Gandhara civilization, kids zone, traditional food stalls, panel discussions on Gandhara, performance of local singers, Mehfil e Samaa by Imran Aziz Mian, Mushaira, Folk Music night by Rahat Bano Multanikar, Sufi dance by versatile group, Sufi night by Sawaal band, and drama Ashoka The Great.\nThe opening ceremony was followed by a Folk music performance by Naeem Hazarvi.",
  "retrievedAt": "2025-08-11T05:52:50.781Z"
}
