{
  "title": "Pakistan Pavilion wins “Best New Exhibitor” award at New York Travel & Adventure Show",
  "link": "https://www.app.com.pk/national/pakistan-pavilion-wins-best-new-exhibitor-award-at-new-york-travel-adventure-show/",
  "date_published": "2023-01-31T18:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP): Pakistan pavilion has won the “Best New Exhibitor Award” at New York Travel & Adventure Show 2023 for displaying the country’s tourism and culture in a remarkable way.\nCEO of New York Travel & Adventure Show presented the award to Pakistan Tourism Development Corporation (PTDC) Managing Director Aftab ur Rehman Rana, said a news release on Tuesday.\nThe two-day event was held at Jacob K. Javits Convention Center New York on January 28-29.\nSpeaking on the occasion, PTDC MD Aftab ur Rehman Rana stated that the participation of Pakistan in the Travel and Adventure Show was highly impactful in terms of response from the public and engagement of all the team members throughout the show.\nBoth the PTDC MD and Advisor to Prime Minister on Tourism & Sports Awn Chaudhry congratulated all the members of Pakistan’s delegation including the provincial tourism departments and private sector tour operators for their dedication and commitment.\nThey also highly appreciated the support of team of PTDC, Trade Development Authority of Pakistan (TDAP) and Pakistan Consulate General at New York to make all this happen.\nPakistan pavilion at the Travel and Adventure show was organized by the PTDC in collaboration with Trade Development Authority of Pakistan (TDAP), Tourism Departments of Punjab, Sindh, Balochistan, Khyber Pakhtunkhwa, Azad Jammu & Kashmir, Gilgit – Baltistan and 20 Private sector stakeholders of tourism and hospitality industry.\nThe New York Travel and Adventure Show 2023 concluded with the belief that B2B and G2G meetings of Pakistan with the counterparts of USA would attract international tourists and foreign investment in the country.",
  "retrievedAt": "2025-08-11T05:52:39.107Z"
}
