{
  "title": "China rolls out 718,000 5G base stations, 6G exploration is underway",
  "link": "https://www.app.com.pk/national/china-rolls-out-718000-5g-base-stations-6g-exploration-is-underway/",
  "date_published": "2021-03-01T06:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP):China has rolled out more than 718,000 5G base stations, with 5G network covering all cities at the prefectural level or above, China’s Minister of Industry and Information Technology Xiao Yaqing said on Monday, revealing the country also has plans for 6G development.\nChina has taken the global lead in 5G network construction, as measured by the number of base stations, network quality and manufacturing levels of telecom equipment, Xiao said during a press conference in Beijing, Global Times reported.\nThe country’s commitments to 5G have hit tens of billions of yuan and 5G terminal connections have topped 200 million, possibly ranking the first globally, according to the minister. Mobile phone shipments hit 163 million last year with the availability of 218 new models.\nThe integration of 5G into industrial network has also made conspicuous headway, with projects underway concerning 5G plus industrial network exceeding 1,100.\n“China’s self-reliance and self-improvement will surely contribute to global industrial and Information development,” the minister said.\nVowing to strengthen international telecom cooperation in 5G research and development and applications, and to create a globally coordinated industrial ecosystem for there to be a safer, opener and more mutually trusting environment, Xiao also highlighted 6G that remains in the exploration stage.\nThe country would take part in global efforts to push for common standards and the maturity of new technologies, he said.\n5G strength apparently underpins the country’s industrial capacity. China’s industrial added value grew up to 31.3 trillion yuan ($4.84 trillion) in 2020 from 23.5 trillion yuan at the beginning of the 13th Five-Year Plan (2016-20), rendering it the world’s top manufacturing nation for the 11th year in a row.\nIn the arena of new-energy vehicles (NEVs), the ministry has over recent years announced more than 60 supportive policies and measures. The country’s NEV production and sales have gained the world’s top spot for the sixth consecutive year, with over 5.5 million units having cumulatively been promoted.\nNonetheless, competition within the NEV market is fairly fierce, Xiao said, pledging efforts in the pipeline to address the issues in technical, quality and consumer experience terms.\nThe ministry will further raise standards and toughen quality regulations when it comes to user experience, he stated, urging NEV companies to continue improving manufacturing levels.\nThe ministry also vowed to expand opening-up in NEV development, saying to hold an open and cooperative attitude in technological innovation, international trade and standard rule making.",
  "retrievedAt": "2025-08-11T20:25:51.659Z"
}
