{
  "title": "Opposition wants to make Senate elections disputed: Ch Fawad",
  "link": "https://www.app.com.pk/national/opposition-wants-to-make-senate-elections-disputed-ch-fawad/",
  "date_published": "2021-03-01T06:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Monday said that the opposition intentionally wanted to make Senate\nelections disputed.\n“The opposition knew they would not be able to win the Senate elections and consider horse trading as the only option to win”, he stated this while talking to media outside Election Commission of Pakistan (ECP).\nThe minister was accompanied by Special Assistant to Prime Minister on Political Communication Shahbaz Gill, Federal Minister for Education Shafqat Mahmood and Senior leader Pakistan Tehreek-e-Insaf, Babar Awan.\nChaudhry Fawad said that the delegation from government side had expressed full confidence over the ECP as the final decision of the ECP to prevail.\n“We have expressed full confidence over ECP considering the fact that if the institutions will be strengthened, the country will become strong”, he stated.\n“Secrecy of ballot , as per SC decision, will be kept for the political parties but not for ECP which would empower ECP to conduct inquiry if there will be any allegation of horse trading raised by any member”, he said. However the final decision would be of ECP, the\nminister added.\nThis was the principle on which Prime Minister, Imran Khan and our cabinet had filed reference before Supreme Court, he said.\nHe emphasized that the Supreme Court’s decision should be implemented in letter and spirit.\nHe said this was the principle for which Prime Minister Imran Khan had been struggling since the year 2013.\n“We have requested the ECP to implement the decision of Supreme Court which empowers the commission to ensure complete transparency in election and eliminate the chances of horse trading and corruption”, he said.\nPakistan Muslim League-Nawaz and Pakistan People’s Party had signed the Charter of Democracy in that regard in the year 2006 but PML-N stepped back before formally pursuing the law, he said.\nHe said PML-N, PPP and Pakistan Democratic Movement (PDM) did not have majority in the upper house and they could not win the elections.\n“This is the reason they are against every such effort that bring transparency in election. Otherwise there would be no need of horse trading if they knew that they would get maximum votes in Senate election,” he said.\n“We have presented our stance in front of ECP with sufficient  arguments”, he said.\nAround 1,700 total ballot papers would be required to be printed for the elections for which we had the required technology, he added.\n”If we can print a big number of currency notes in Pakistan on daily basis which is a highly secure tender why not 1,700 ballot papers,” he asked.",
  "retrievedAt": "2025-08-11T20:25:52.473Z"
}
