{
  "title": "ECP finalizes arrangements for holding Senate polls on March 3",
  "link": "https://www.app.com.pk/national/ecp-finalizes-arrangements-for-holding-senate-polls-on-march-3/",
  "date_published": "2021-03-01T11:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP): The Election Commission of Pakistan (ECP) has finalized all arrangements for holding Senate elections on March 3 on those seats which are going to be vacant after expiration of term of incumbent members on March 11.\nAccording to an official of ECP, the polling will be held from 0900 hours to 1700 hours simultaneously in Parliament House Islamabad, and provincial assembly buildings in Sindh, Khyber Pakhtunkhwa and Balochistan.\nThe polling was due on 48 seats- two in Islamabad, 11 each in Punjab and Sindh, and 12 each in Khyber Pakhtunkhwa and Balochistan- that will fall vacant on the expiration of the term of the members. However, on duly electing un-contested candidates on all 11 seats of Punjab, there will be no polling in Punjab.\nThe election will be held to fill one general seat and one seat for women from the Federal Capital, seven general seats, two seats for women, two seats for Technocrats including Ulema from each province like Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan and one seat for non-Muslims each from Khyber Pakhtunkhwa and Balochistan province.\nThe commission has appointed Returning Officers (ROs) and Polling Officers (POs) to conduct Senate elections. The ECP made these appointments in pursuance of section 105 of the Elections Act, 2017, read with clause (3) of Article 224 of the Constitution of the lslamic Republic of Pakistan.\nHe said the commission has announced names of duly elected un-contested candidates on various vacant seats of Senate from Punjab included Azam Nazeer Tarar (PML-N) and Syed Ali Zafar (PTI) on Technocrat and Ulema seat while Zarqa Suharwardy Taimur (PTI) and Saadia Abbasi (PML-N) on Women seats besides seven candidates on General seats included Kamil Ali Agha (PML-Q), Saifullah Sarwar Khan Nyazee (PTI), Afnan Ullah Khan (PML-N), Aon Abbas (PTI), Ejaz Ahmad Chaudhry (PTI), Sajid Mir (PML-N) and Irfan-ul-Haq Siddiqui (PML-N).\nHe said the election campaign for Senate election in the country would come to an end with effect from the midnight falling between the March 1 and 2.\nThe commission has asked all the political parties and the contesting candidates to follow the provisions of law and exercise self-restraint so that the poll is held in an orderly and peaceful manner on the March 3, he added.\nIt is pertinent to mention here that the commission has directed all the Chief Secretaries and the Chairman National Accountability Bureau (NAB) to ensure presence of any member National or Provincial Assembly in its custody, at their designated polling stations for casting their votes on the polling day of Senate on March 3.\nThe commission has issued its order while exercising its powers under the Articles of the Constitution as Article 220 of the Constitution read with Section 5 of the Elections Act, 2017 provides that it shall be the duty of all executive authorities in the Federation and in the Provinces to assist the Chief Election Commissioner and the Election Commission in the discharge of his or their functions.\nIt said that the Election Commission of Pakistan issued notification to conduct the Senate Elections 2021 on February 11, 2021. It added it is the duty of the Election Commission to organize and conduct the election and to make such arrangements as are necessary to ensure that the election is conducted honestly, justly, fairly and in accordance with law and that corrupt practices are guard against.\nIt said that the Supreme Court of Pakistan vide its Judgment report in PLD 2012 SC page-681 in Workers Party Pakistan and others vs. Federation of Pakistan and others and PLD 2014 SC page-72 has held that right of vote is fundamental right in terms of Article 17 (2) at the Constitution.",
  "retrievedAt": "2025-08-11T20:25:48.386Z"
}
