{
  "title": "PNS Yarmook induction important milestone for Pakistan Navy: Naval Chief",
  "link": "https://www.app.com.pk/national/pns-yarmook-induction-important-milestone-for-pakistan-navy-naval-chief/",
  "date_published": "2020-07-13T03:08:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jul 13 (APP):Chief of the Naval Staff, Admiral Zafar Mahmood Abbasi said the induction of state of the art Corvette, Pakistan Navy Ship (PNS) YARMOOK was an important milestone for Pakistan Navy.\nThe induction ceremony was held at Pakistan Navy Dockyard, Karachi where Chief of the Naval Staff, Admiral Zafar Mahmood Abbasi graced the occasion as chief guest, said a Pakistan Navy press release.\nSpeaking at the occasion, he said PNS YARMOOK in Pakistan Navy Fleet would significantly act as force multiplier to safeguard maritime interests of Pakistan.\nThe Admiral futher underscored that the ship would contribute towards achieving sustained maritime order through Pakistan Navy Regional Maritime Security Patrols (RMSP) initiatives.\nHighlighting the plight of Kashmiris in Indian Occupied Jammu and Kashmir (IoJk), the chief guest paid tribute to their exemplary struggle of self-determination against Indian oppression.\nHe also paid tribute to the medical and paramedical staff of the country to fight COVID-19 pandemic.\nPNS YARMOOK is the latest warship with an effective amalgam of weapons and sensors possessing cutting edge self-protection and terminal defence systems constructed at M/S DAMEN Shipyards, Romania.\nThe ship is capable to perform variety of naval operations and transport helicopter and Unmanned Aerial Vehicle (UAV) simultaneously.\nThe second Corvette PNS TABUK was expected to join Pakistan Navy Fleet towards end of this year.\nLater, the chief guest lauded professional competence of M/s DAMEN Shipyards (Romania) and cooperation for delivering high quality platforms to Pakistan Navy.\nThe induction ceremony was attended by Senior Naval Officers.",
  "retrievedAt": "2025-08-11T19:29:08.487Z"
}
