{
  "title": "Pakistan to continue supporting Kashmiris till their freedom from India : Shahryar Afridi",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-humiliation-of-humanity-in-indian-occupied-kashmir-shahryar-afridi/",
  "date_published": "2020-07-13T00:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Chairman of the Parliamentary Committee on Kashmir Shehryar Afridi Monday said Pakistan had highlighted the Indian atrocities on the people of Occupied Kashmir and would continue supporting the Kashmiris till realization of their right to self-determination and freedom from Indian yoke.\nTalking to a private news channel, he paid tributes to the Kashmiris, who were braving a reign of terror let loose by the occupation forces and urged the international community to stop the extremist Narendra Modi regime from perpetrating cruelties across the held valley to achieve its nefarious designs.\nPrime Minister Imran Khan, he said, had highlighted the Kashmiris cause at every world fora and now it had become an international issue. The media had an important role to play in further highlighting the issue across the world and exposing the abhorrent face of India.\nThe brutal Indian forces were using pellet guns on the innocent Kashmiri people in an attempt to suppress their desire for freedom, he added.\nAfridi said if the world community remained silent over the sufferings of Kashmiris then it would be equal partner to India in the crimes being committed by the later against humanity.\nReplying to a question, he said being Chairman of Parliamentary Committee on Kashmir he was in contact with the key international stakeholders to highlight the Kashmir cause.\nHe said Pakistan had adopted a more aggressive strategy on the Kashmir issue at diplomatic level. He would continue drawing the whole world’s attention towards the plight of people of occupied Kashmir.\nThe international community needed to wake up and get stopped the genocide of Kashmiris being committed by the Indian occupation forces, he added.\nAfridi said many civilians had been martyred and injured with their houses damaged as Indian troops continued ceasefire violations on the Line of Control.",
  "retrievedAt": "2025-08-11T19:29:20.183Z"
}
