{
  "title": "Country to have first ever moon observatory before next Eid: Chaudhry Fawad",
  "link": "https://www.app.com.pk/national/country-to-have-first-ever-moon-observatory-before-next-eid-chaudhry-fawad/",
  "date_published": "2020-07-13T00:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Monday said the country would have a moon observatory in the federal capital before next Eid which would reduce the burden of the Ruet-e-Hilal Committee regarding the moon-sighting process.\nThe provinces can replicate this idea and set up their own moon observatories, he said in an MoU signing ceremony related to use of drone technology to eliminate the locusts.\nThe MoU was signed between the Ministry of Science and Technology and ABN SATUMA (Private) Ltd for development of UAVs/drones for agriculture application.\nThe drones will specifically be used for countering locust attacks.\nThe federal minister said he would discuss with the provinces to increase their spending in the field of science and technology.\nChaudhry Fawad said the government was taking effective measures for mitigating the locusts attack.\nManufacturing of drones for agriculture sector would be a big achievement for the country on which work is under process, he said.\nHighlighting his ministry’s achievements, Chaudhry Fawad said when the COVID-19 pandemic broke out, the country was having reduced manufacturing capacity of essential medical equipment.\n“However, today we are manufacturing ventilators, personal protective equipment and N-95 masks which is a significant achievement,” he added.\nHe said today, three more companies had been given the permission to manufacture ventilators and soon Pakistan would be able to export ventilators.\nDr. Suleman, CEO of the private company, said the drones would be given to the National Disaster Management Authority (NDMA) to fight locusts in the country.\nHe said, “We were given the task by the ministry to make drones. These drones can not only be used to spray [disinfectants] but also map areas,” he added.\nHe said the drones would be able to carry 16 kg of chemicals.",
  "retrievedAt": "2025-08-11T19:29:23.683Z"
}
