{
  "title": "Govt to bring GB at par with other developed areas: Ali Amin",
  "link": "https://www.app.com.pk/national/govt-to-bring-gb-at-par-with-other-developed-areas-ali-amin/",
  "date_published": "2020-07-13T00:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Minister for Gilgit-Baltistan and Kashmir Affairs Ali Amin Gandapur on Monday reiterated the incumbent government’s commitment to bring Gilgit-Baltistan at par with other developed areas of the country.\nWinding up discussion on commenced motion that the house may discuss the need for reforms in GB in order to enhance sense of participation of the people of GB, upgrade standard of governance and public service delivery and boost industry and commercial activity especially under CPEC, the minister said the government enhanced the budget of GB despite the fact that Coronavirus pandemic badly affected the economies of all countries.\nHe said work has already been kicked off on mega projects including Diamer Basha dam which would help address power related issue in GB. Work on other welfare and development projects was being carried out which would benefit thousands of families. Regarding health related projects, the minister said that work on Cardiac Hospital was being carried out which would be completed during the current year. Similarly, hospital was also being set up at Skardu.\nAli Amin said there was huge potential of tourism in GB which was being exploited. International standard facilities would be provided to the tourists in GB to promote the tourism sector, he added.\nHe said the government has also plan to set up medical college and engineering university in GB. Regarding health card, the minister said that health cards were being given to the people of Gilgit-Baltistan.\nThe minister said Pakistan would continue to support the Kashmiris struggle for right to self determination.\nHe said today, on Youm-e-Shuhada-e-Kashmir, they salute Kashmiris for their continued struggle against the illegal and barbaric Indian occupation of Jammu and Kashmir.\nHe expressed the hope that soon the Kashmiri people would be freed from the clutches of Indian illegal occupation.",
  "retrievedAt": "2025-08-11T19:29:22.190Z"
}
