{
  "article_id": "2025-04-06_ac5543f3a1039acfff629ebedfa61b9c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-applauds-security-forces-for-foiling-infiltration-attempt-by-terrorists-on-pak-afghan-border/",
    "retrieved_at": "2025-08-27T14:14:47.011Z"
  },
  "metadata": {
    "title": "PM applauds security forces for foiling infiltration attempt by terrorists on Pak-Afghan border",
    "author": null,
    "date_published": "2025-04-06T14:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 179,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "LAHORE, Apr 06 (APP):Prime Minister Muhammad Shehbaz Sharif on Sunday commended the bravery and professionalism of Pakistanas security forces for thwarting an infiltration attempt by Khawarij terrorists along the Pakistan-Afghanistan border in the Hasan Khel area. In his official statement, the Prime Minister lauded the swift and decisive response of the officers and personnel, who successfully repelled the terroristsa attempt to enter Pakistan. He acknowledged their outstanding performance in eliminating eight terrorists and apprehending four others in injured condition. aThe officers and personnel of our security forces have foiled the nefarious designs of the Khawarij to spread chaos inside Pakistan,a said the Prime Minister. He further emphasized that the armed forces of Pakistan remain vigilant and fully committed to defending the nationas borders. aOur officers and soldiers are tirelessly engaged day and night to counter any attempts of mischief and ensure the safety and sovereignty of the country,a he added. The Prime Minister concluded by expressing his full confidence in the capability and dedication of the security forces, reaffirming the governmentas resolve to eliminate terrorism in all its forms.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}