{
  "title": "Golfers’ encouragement imperative for better representation of country: President",
  "link": "https://www.app.com.pk/national/golfers-encouragement-imperative-for-better-representation-of-country-president/",
  "date_published": "2020-11-22T17:20:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 22 (APP): President Dr Arif Alvi on Sunday said it was essential to encourage the golfers for promotion of the game as well as better representation of the country abroad.\nAddressing as chief guest at a prize distribution ceremony of Pakistan Open Golf Championship, the president said that he himself, being fond of the golf, found it a “very fascinating” game.\nHe congratulated winners of the championship and said it required dedication and craze to achieve excellence in any game.\nHe said due to the immense passion, Pakistan produced world class hockey and squash players in past despite lack of facilities and resources.\nHe said the better green leveling of golf courses could also attract tourists as people traveled to Thailand and Dubai to enjoy the game.\nThe president told the audience that he played 18-holes in Margallah Golf Club and preferred to walk instead of availing the cart.\nHe said it was impressive to know that Pakistan had around 15,000 golfers and 48 golf courses. However, the game could be well promoted through better facilities at the courses like sprinkle irrigation using treated waste water and better leveling.\nThe president also lauded the idea of introducing golf facilities for the children and women and recalled that he had also bought a golf set for his kids to inculcate the game’s passion in them.\nThe president started his address advising people to continue adhering to the\nanti-COVID 19 precautions. He said statistics and graphs revealed that the second\nCOVID wave was surging more consistently and looked more dangerous too.\nTherefore, the people must not give up precautions of wearing mask and maintaining social distancing.",
  "retrievedAt": "2025-08-11T20:02:41.724Z"
}
