{
  "title": "Steps taken by govt to eliminate sense of insecurity among minorities in country: Governor Sindh",
  "link": "https://www.app.com.pk/national/steps-taken-by-govt-to-eliminate-sense-of-insecurity-among-minorities-in-country-governor-sindh/",
  "date_published": "2020-11-22T12:38:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 22 (APP): Governor of Sindh, Imran Ismail said that the different kinds of steps had been taken to eliminate sense of insecurity among minorities communities and in addition, to help minorities to avail equal job opportunities in the country.\nHe expressed such views while addressing the Dewali Festival organized by Ministry of Religious Affairs and Inter-faith Harmony and National Commission for Minorities (NCM) here on late night of Saturday.\n“On behalf of Prime Minister Imran Khan, I am extending congratulations to you”, he said, telling that Prime Minister emphasized to ensure the provision equal rights to Minority community in Pakistan because they were equal citizens alike Muslims.\nNeighboring country, which always claimed to be secular, oppressed the religious minorities and even it did not allow Muslims to celebrate the festival or Eid in Kashmir, Governor of Sindh said this while condemning oppression of Kashmiri people.\nWe are equal in the Pakistan, Imran Ismail added, articulating that next year, we will celebrate this festival in the governor house. Appreciating the strict implementation of SOPs by participants, Governor of Sindh said that everybody was wearing the mask to contain the cornona-virus.\nPTI MNA and Parliamentary Secretary on Human Rights, Lal Chand Malhi said that Diwali is a festival of lights, adding that the Diwali symbolizes the spiritual “victory of light over darkness, good over evil and knowledge over ignorance.\nUnder dynamic leadership of Primer Minister Imran Khan, the minorities are enjoying equal rights in the Pakistan, Lal Chand Malhi said. “We are here and celebrating the Diwali festival where you will find the people from different religions like Sikh, Christian, Muslims, Hindu and others because this festivals is for all not only Hindu community”, he added.\nEarlier speaking, Chairman National Commission for Minorities, Chela Ram said that this was first time; we were celebrating this festival in Karachi. “It is good gesture where every person is participating in the festival because this festival is for all”, he stated, telling further that Muslims, Hindu, Sikhs, Jains and Christian came here to celebrate festival with us.\nThe credit goes to federal government for organizing such wonderful festival, Chairman told the media.\nMember of National Commission for Minorities, Dr. Jaipal Chhabria said, earlier this festival was being organized in Islamabad but on the request of NCM, it was organized here because the majority of Hindu community was living in Sindh province.\n“We are thankful to federal minister Noor-ul-Haq Qadri for organizing such the function here and also thankful to governor Sindh for participating in the festival”, he said, appreciating that they played extensive role in making the Diwali Festival successful.\nParticipation of people from different faith and religion in this function had promoted interfaith harmony and it is need of time, he added, suggesting that other provincial government including Sindh should organize such programs to promote the interfaith harmony.\nThe verses from Quran, Bible and Gayartri Mantra were recited at start of Diwali function. The mythological performance was also organized and in addition, participants also enjoyed the music sung by renowned singers especially Narodha Malini.\nPTI MNA Dr. Ramesh Kumar, Member of Sindh Assembly Mangla Sharma and other notables attended the festival.\nA large number of people from different walk of life along with families participated.\nThey appreciated the federal government and PTI Minority leaders especially MNA Lal Chand Malhi for organizing such wonderful Dewali festival in Karachi.\nDiwali is one of major festivals celebrated by Hindus, Jains and Sikhs. The festival usually lasts five days and celebrated during the Hindu Junisolar month Kartika (Mid-October and Mid-November). It is a celebration of the day Lord Rama returned to his kingdom Ayodhya with his wife Sita and his brother Lakshmana after defeating Ravana in Lanka and serving 14 years of exile.",
  "retrievedAt": "2025-08-11T20:02:45.197Z"
}
