{
  "article_id": "2025-08-07_6fffce2dfd237456e9edfa1dd053a100",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-to-use-drones-google-earth-surveillance-for-anti-encroachment-drive/",
    "retrieved_at": "2025-08-10T10:22:32.284Z"
  },
  "metadata": {
    "title": "CDA to use drones, Google Earth surveillance for anti-encroachment drive",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 279,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 07 (APP): The Capital Development Authority (CDA) is stepping up its campaign against illegal encroachments across Islamabad with a tech-driven strategy that includes drone surveillance and satellite monitoring. CDA Chairman and Chief Commissioner Muhammad Ali Randhawa, in a major policy shift on Thursday, vowed to enforce the law indiscriminately and ensure permanent protection of reclaimed public land. During the meeting, officials reported that the campaign, had already resulted in the recovery of more than 60 kanals of illegally occupied land in the Saidpur area. Additional operations were conducted on GT Road, Srinagar Highway, Tarnol, and the Expressway, targeting both encroachments and unlawful construction. Chairman Randhawa emphasized the need for sustained and law-based enforcement. \"We are taking indiscriminate action against all illegal encroachments,\" he stated. \"But it is equally important to ensure these areas remain protected going forward. That's why we are establishing a permanent monitoring system, including regular drone footage and Google Earth surveillance.\" The new system aims to provide real-time oversight of previously cleared areas to deter illegal reoccupation. Furthermore, Randhawa directed CDA officials to speed up legal proceedings against encroachers and explore long-term preventive measures. As part of a broader vision to revitalize the capital, the CDA is also planning eco-friendly redevelopment of reclaimed land. This includes tree plantations and optimal public use of cleared spaces. \"Our goal is not just to remove encroachments but to transform Islamabad into a model capital-green, lawful, and inclusive,\" Randhawa added. Senior officials from the CDA, ICT administration, and enforcement departments participated, including Member Admin and Estate Talat Mahmood, Member Planning Dr. Khalid Hafiz, Member Environment Esfandyar Baloch, Deputy Commissioner Irfan Nawaz Memon, and DG Building Control Faisal Naeem.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}