{
  "article_id": "2025-08-07_a79cd84ec26040b12eebce168abb2bd8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-iqbal-highlights-minorities-role-in-pakistan-movement/",
    "retrieved_at": "2025-08-10T10:22:41.114Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal highlights minorities' role in Pakistan Movement",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 270,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 7 (APP): Federal Minister for Planning, Development and Special Initiatives, Professor Ahsan Iqbal, on Thursday highlighted the vital role played by minorities in the Pakistan Movement, that resulted in creation of an independent homeland. Speaking at 'Special Azadi Baithak (Freedom Gathering) with Minorities held in connection with the Ma'rka-e-Haq (Battle of Truth), he said, Pakistan was founded through the collective sacrifices of all communities, including minorities, whose contributions remain unforgettable. \"We not only created Pakistan together but have worked to strengthen it collectively,\" he noted. Underscoring the importance of unity, Iqbal said a nation's real strength lies not in weapons or wealth but in solidarity among its people. \"All Pakistanis are equal, and inclusive development is a right for everyone-regardless of race, religion, or ethnicity,\" he added. Reviving Quaid-e-Azam's message of unity, the minister called for cooperation across all segments of society for a prosperous future. He asserted that Pakistan's armed forces and the nation have consistently responded bravely to aggression, including India's, citing military successes and the country's nuclear deterrence as proof of strength. Highlighting achievements such as overcoming the energy crisis and defeating terrorism, Iqbal reiterated the government's commitment to inclusive progress through initiatives like Uraan Pakistan, describing it as a national promise, not just a project. He called for nationwide community gatherings to ensure every citizen's voice is heard and promoted a message of love, justice, and equality. Stressing the importance of political stability and policy continuity, Iqbal urged collective effort to move forward on the path of development. \"Under the green crescent flag, we are united. The time for progress is now,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}