{
  "article_id": "2025-08-07_27e7db0dcd9319618404602e883eb7c7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/global-food-crisis-deepens-with-over-2-3-bln-facing-insecurity-203-mln-undernourished-in-oic-states-warns-comstech/",
    "retrieved_at": "2025-08-10T10:22:32.298Z"
  },
  "metadata": {
    "title": "Global food crisis deepens with over 2.3 bln facing insecurity, 203 mln undernourished in OIC states, warns COMSTECH",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 405,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 07 (APP): As the global food crisis reaches alarming proportions, with more than 2.3 billion people facing food insecurity, the Organisation of Islamic Cooperation (OIC) has called for urgent scientific collaboration among its member states to combat hunger, climate shocks, and agricultural decline.Best restaurants near me The stark warning came from Prof. Dr. M. Iqbal Choudhary, Coordinator General of COMSTECH, who emphasized the dire state of nutrition and food systems in OIC countries-where over 203 million people are undernourished-as he addressed an international symposium on sustainable agriculture and climate change. Speaking at the International Symposium on \"Sustainable Agriculture for Food and Nutritional Security under Climate Change Scenario\" held at the International Center for Chemical and Biological Sciences (ICCBS), University of Karachi, Prof. Choudhary called for a united front in science, technology, and innovation to tackle food insecurity and climate vulnerabilities. The event was jointly organized by ICCBS and the Sindh Innovation, Research, and Education Network (SIREN), drawing participants from across the Muslim world and beyond. In his keynote, Prof. Choudhary shared sobering global data, including the fact that 733 million people experienced hunger in 2023 and nearly 864 million endured extreme food deprivation. He stressed that the crisis is particularly acute in OIC nations, where 11.2% of the population lacks access to adequate nutrition. Highlighting COMSTECH's initiatives, Prof. Choudhary showcased the COMSTECH Forum on Environment and Ecosystem Restoration (CFEER), which has conducted climate-resilient agricultural programs in Niger, Uganda, Benin, and Somalia. The further sessions are planned this year in Indonesia and East Africa, focusing on urban food systems and ecosystem regeneration. He also outlined COMSTECH's youth-centric programs, including leadership and industrial training in sustainable agriculture, food safety, and biotechnology, aimed at empowering the next generation of scientists and agripreneurs in OIC states. Additionally, research fellowships and regional capacity-building projects-such as the Halal Products Testing Programme-are enabling countries to improve nutrition, trade standards, and scientific infrastructure. Looking ahead, Prof. Choudhary announced that the third COMSTECH Biotechnology Youth Forum will take place in Dhaka this September, spotlighting frontier technologies like CRISPR to enhance crop resilience and food security.Best restaurants near me With hunger and climate shocks converging across developing nations, COMSTECH continues to emerge as a vital platform for knowledge exchange and innovation within the Islamic world. \"We need a scientific revolution in agriculture, food systems, and climate adaptation if we are to secure a sustainable and sovereign future for our people,\" Prof. Choudhary concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}