{
  "article_id": "2025-08-07_36da7445ba9959874ca1dcf45090b534",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-employee-left-unsupported-after-pak-pwd-dissolution-na-told/",
    "retrieved_at": "2025-08-10T10:22:50.708Z"
  },
  "metadata": {
    "title": "No employee left unsupported after Pak PWD dissolution: NA told",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 192,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 07 (APP):Employees of the dissolved Pakistan Public Works Department (Pak PWD) are being adjusted in other ministries and departments, with continued salary payments, ensuring no one is left unsupported, Housing Minister Riaz Hussain Pirzada said on Thursday. Responding to a calling attention notice moved by MNAs Aliya Kamran, Shahida Begum, Naeema Kishwar Khan, and Muhammad Usman Badini, Minister for Housing and Works Riaz Hussain Pirzada said that a bill to adjust Pakistan Public Works Department (Pak PWD) staff has already been approved by the standing committee. The adjustment plan includes a golden handshake offer, and some employees have already been accommodated in the Capital Development Authority (CDA), he added. The employees of Pakistan Public Works Department (Pak PWD) staff, are receiving salaries, with some already absorbed into various ministries. Aliya Kamran informed the House that the Capital Development Authority (CDA) has declined to absorb certain employees of the dissolved Pakistan Public Works Department (Pak PWD). In response, Minister for Housing and Works Riaz Hussain Pirzada stated that he is personally reaching out to the Interior Minister to facilitate the adjustment of those employees who were not accommodated by the CDA.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}