{
  "title": "British Council trains 100 emerging young women for leadership role",
  "link": "https://www.app.com.pk/national/british-council-trains-100-emerging-young-women-for-leadership-role/",
  "date_published": "2022-04-04T11:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):Celebrating the launch of its ‘Women in Leadership’ programme in South Asia, the British Council has reiterated its commitment to take more effective initiatives to increase women contribution towards nation building through women empowerment.\nThe British Council hosted a digital event across South Asia to celebrate the launch of its ‘Women in Leadership’ programme, a training programme for women in Bangladesh, India, Pakistan and Sri Lanka.\nThe training programme was launched under which a network of 100 young women leaders in Bangladesh, India, Pakistan and Sri Lanka and the United Kingdom was built.\nThe programme offered 100 emerging young women leaders (25 each from the four states) a learning opportunity through an eight-week online, self-access leadership course to become more effective in leading interventions to support gender equality and women’s leadership within their sectors.\nRepresentatives from British Council, Clore Social Leadership UK, SoLF, Women in Leadership participants, and other experts participated in the event.\nThe event was moderated by Sidra Iqbal, a celebrated broadcast journalist and media personality from Pakistan while Jehan Ara, Founder and CEO of Katalyst Labs was the keynote speaker.\nA panel discussion also took place where stakeholders shed light on the factors hindering gender parity and women decision-making roles.\nThe discussion called for more vigorous efforts to ensure an enabling environment for capacity building of women.\nThe panellists included Coordinator Nijera Kori, Bangladesh, Khushi Kabir; Member of Youth Advisory Group on Climate Change, India, Archana Soreng; Country Director Marie Stopes Society, Pakistan, Asma Balal; and CEO Chrysalis, Sri Lanka, Ashika Gunasena.\nDuring the event, inspirational stories of women, who have been part of the Women in Leadership programme, were also showcased.\nThe British Council is the UK’s international organisation for cultural relations and educational opportunities. It builds connections, understanding and trust between people in the United Kingdom and other countries through arts and culture, education and the English language.",
  "retrievedAt": "2025-08-11T14:39:24.179Z"
}
