{
  "title": "Measures to combat covid-19 discussed at NCOC",
  "link": "https://www.app.com.pk/national/measures-to-combat-covid-19-discussed-at-ncoc/",
  "date_published": "2020-04-27T01:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP):A detailed briefing was given on Monday on current coronavirus (COVID-19) situation and measures being adopted to combat the disease at National Command and Operation Centre (NCOC).\nThe meeting which was chaired by Special Assistant to Prime Minister n National Health Services Dr Zafar Mirza, comprehensive reviewed the implementation of Ramazan guidelines and health situation.\nChief Secretaries, focal persons from all provinces, Azad Jammu and Kashmir (AJK), Gilgit Baltistan and Commissioner Islamabad Capital Territory (ICT) joined through video link.\nThe forum apprised on implementation of guidelines for Ramazan particularly opening of stores.\nMinister for Interior, Brig ® Ijaz Ahmed Shah asked the provinces to educate store owners that only those people be allowed in side store who follow guidelines on surgical masks and social distancing.\nThe meeting was informed that inter-city movement may be curtailed on weekends to avoid crowding for public safety and health.\nDr Zafar Mirza said that steps are being take to deal with this challenge. He added protecting the lives of health professionals was the top priority of the government.\nHe said that the government has taken several steps to ensure provision of personal protection equipment (PPE) kits to doctors and health workers besides their training.\nHe said that a comprehensive strategy has been planned for hospitals to provide treatment to corona patients and protection of health staff from infection. He said that there are complaints of not using protective kits by health workers.\nHe said that there was an effective monitoring mechanism to observe the performance of hospitals and doctors.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:08.204Z"
}
