{
  "title": "341 new coronavirus cases emerge, Karachi worst affected : CM Sindh",
  "link": "https://www.app.com.pk/national/194670-2/",
  "date_published": "2020-04-27T00:22:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 27 (APP):Sindh Chief Minister Syed Murad Ali Shah on Monday said that 341 more cases of coronavirus were reported in the province during last 24 hours and the virus was spreading as positive cases were emerging from Karachi to Kashmore and Karachi to Thar.\nThis he said while briefing the cabinet about coronavirus situation, said a statement issued by a spokesperson to the CM Sindh.\nThe cabinet meeting was attended by all provincial ministers, advisors, chief secretary, chairman P&D, PSCM, Secretary Finance, secretaries of forest, food, agriculture and law.\nThe chief minister who was assisted by Secretary Finance Hassan Naqvi said that 341 more cases emerged when 2733 test were conducted which is 12.6 percent of the tests conducted.\nThe health department has conducted so far 43949 tests against which 4956 cases were diagnosed which constituted 11.2 percent of the tests.\nThe chief minister said that four more patients lost their lives and the number of deaths stemming from the coronavirus had reached to 85 which was 1.7 percent of the total patients. He added that 24 patients were in critical condition and 16 others were already on ventilators.\nHe said that at present, 3946 patients were under treatment, including 2705 or 68 percent in home isolation, 825 or 21 percent at Isolation centers and 416 or 11 percent in different hospitals.\nThe chief minister said that out of 341 news cases 269 belong to Karachi. They include\nDistrict central 20, East 90, Korangi 40, Malir 30, South 50 and West 39.\nHe added that despite serious efforts, the people living in katchiabadies of the city were not observing social distancing, therefore the cases were increasing every day.\nHe said that Khairpur had 23 cases, Larkana 12 cases, Hyderabad 12, Ghotki eight, Sukkur four, Dadu three, Matiari two, Matiati two, Jacobabd, Umerkot and Dudu one each.\nThe statement said that the Sindh government through law department had proposed an ordinance to mitigate the challenges emanating from the province-wide lockdown and to put in place all necessary measures to help respond to the coronavirus affectees by providing them relief.\nThe Sindh COVID-19 Emergency Relief Ordinance, 2020 would provide the prevention of eviction in private rented and social sector for the time being, giving equal relief to domestic residential and commercial tenants, employees and daily-wages workers; extending deadlines associated with responding to the school fees, rent and utility charges, conduct of trial or indictment and extension of period for performance of duties by the court or an office.\nNo educational institution shall charge more than 80 per cent of the total monthly fees. The relief amount, reduced equivalent to 20 per cent.\nNo employee or worker shall be laid of, terminated or removed and the employee shall be paid salary by the employers.\nThe salary amount and the deduction, if necessary, is given in schedule-I of the ordinance.\nAll utility providers falling within the territorial jurisdiction of the government shall provide concession (schedule-II of the ordinance) in the utility services to all domestic, residential and commercial consumers.\nThe landlord shall defer or suspend the recovery of the rent of the premises for payable amount as indicated in schedule-III; provided that the same shall not apply in case where the owner is the widow, differently abled person and senior citizen.\nThe government may provide exemption in the provincial taxes, duties, fees, cess, levies and charges.\nIn case of non-compliance of the ordinance different penalities have defined.\nThe cabinet was told that a target of 1.4 million tons of wheat at a rate of Rs 1400 per 40 kg procurement had been started. The department has achieved 33.55 percent target by procuring 469,673 tons.\nIt was pointed out that the conditions of presenting land documents such as pass book, form-7 and verification of documents by local councils and Mukhtiarkars were causing problems in smooth procurements process. At this the cabinet on the request of the food minister Hari Ram waived of the conditions imposed on procurement of wheat from the growers.\nThe chief minister directed food department to achieve the target and even if they had the capability of exceeding the target he would appreciate them.\nSpeaking on the occasion, the chief minister said that he had reports that the locust swarm attacks on the standing crops would multiply in next cropping years. “Just after coronavirus the locus swarm attacks will be another disaster,” he said\nMinister Agriculture Ismail Rahu and Secretary Agriculture Raheem Soomro briefed the cabinet about the locus control and threat issues.\nThe provincial government has released Rs 335.095 million to the agriculture department to spray the crops against which the department utilized Rs 181.638 million on the purchase of 22 (spray) vehicles, 300 solo power sprayers, 1000 hand sprayers,50,000 Emulsifiable Concentrate (EC) to combat the locust issue.\nStill Rs153.457 million are available with the department. The agriculture department has constituted 57 teams at district and taluka level and sprayed the crops.\nThe chief minister was told that 12 aircrafts were required to spray in the desert areas of Sindh, Balochistan and Punjab.\nThe cabinet on the request of the home department approved a proposal to authorize Jail Superintendent to grant 72 hours temporary parole to an under-trial prisoner(s) to attend death of his/her blood relative.\nThe cabinet also authorized the Home department to grant temporary parole to prisoner(s) under trial prisoners/convicted for 72 hours to attend marriage of blood relative or visit seriously ill blood relatives.\nThe cabinet approved a proposal to authorize Adl Chief Secretary /Home Secretary and all the commissioners to perform the powers under section 144 Cr.PC.\nThe cabinet approved one-time waiver of Sindh Sales Tax on the commission payable to the branchless banking retailers disbursing the cash financial assistance provided under the Ehsaas Kafalat programme of the Benazir Income Support Programme (BISP).\nThe Sindh cabinet also approved exemption of tax and duties on import and transfer of machines and equipment for Gawadar Hospital project.\nThe cabinet accorded ex-post facto approval of all the notifications, circulars and SOPs issued by Additional chief Secretary Home, Additional Chief Secretary Law and Secretaries of administrative departments under the Sindh Epidemic Disease Act 2014.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:13.318Z"
}
