{
  "title": "Fitrana fixed at Rs 100 per head",
  "link": "https://www.app.com.pk/national/fitrana-fixed-at-rs-100-per-head/",
  "date_published": "2020-04-26T23:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP):The minimum amount of Sadqa-e-Fitr has been fixed at Rs 100 per head this year, said Central Ruet-e-Hilal Committee Chairman Mufti Muneeb-ur-Rehman.\nAccording to a press release, Mufti Muneeb said according to the market price of 2.25 kilograms of flour, the amount for Fitrana was calculated as Rs 100 per head and those using Chaki Flour should pay Rs125 per head as Fitrana.\nThe faithful who want to pay Fitrana equal to the price of barley, dates, raisins and cheese should pay Rs 320, Rs 1,600, Rs 1,920 and 3,540 per head, respectively.\nA Muslim, who possesses food in excess of his needs, must pay Sadqa-e-Fitr before the Eid prayers. If the person is a breadwinner, he should also pay Sadqa-e-Fitr for his dependants, such as wife, children, dependent relatives or servants.\nMufti Muneeb also advised the people to pay the amount to the poor before Eid-ul-Fitr so that they could also celebrate the festival. The most deserving people for Sadqa-e-Fitr are close relatives followed by neighbours and the poor.\nMufti Munibur Rehman said real spirit of Fitr and Fidya was two-time meal of a destitute person, so it was better to pay the meal cost of a hotel. However, those who were wealthier, they should try to pay more to extend assistance to the poor in this time of coronavirus, he added.\nIf any one had been unable to keep fast for the whole month of Ramadan, he or she should pay Fidya as compensation worth Rs 3,750 in proportionate to Chaki flour price, Rs 9,600 for barley, Rs 48,000 for date, Rs 57,600 for raisin and Rs106,200 for cheese.\nLikewise the Kufara (compensation for feeding 60 destitute) for leaving 30 fasts in wheat would be Rs 7,500, barley Rs 19,200, date Rs 96,000 , raisin Rs 115,200 and cheese Rs 212,400.\nThe Kufara for breaking swear will be Rs 1,250 in proportionate to flour price, Rs 3,200 barley, Rs 16,000 dates,Rs19,200 raisin and 35,400 cheese.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:15.445Z"
}
