{
  "title": "MoHR Helpline facilitates 108,065 people in nine months",
  "link": "https://www.app.com.pk/national/mohr-helpline-facilitates-108065-people-in-nine-months/",
  "date_published": "2020-11-08T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Ministry of Human Rights helpline (1099) for Legal Advice on Human Rights Violations provided its services to 108,065 people from Januarary 2020 till September 2020.\nAccording to details, legal services were provided to 3,464 people, legal advice and instant referrals to relevant department through calls to 1108 people, legal advice and referral through calls to 2215 and legal advice and referrals through letters to 34 people and legal advice was provided to 107 people visitors through applications, fax and emails.\nThe helpline officials did 8360 follow-up calls while 13178 violence victims were call backed during this time span, an official of MoHR told APP.\nThe officials said objectives of the Helpline for legal advice on Human Rights violations were in line with the social sector programmes of the government mentioned in annual plan, Pakistan’s growth strategy, vision 2025 and vision 2030.\nThese programmes were focused to make social and economic policies and programs for ensuring social protection to weak and vulnerable segments of the society.\nDuring COVID-19, he added, the Ministry was cognizant of the potential increase in domestic violence and due to lockdowns, it was more difficult for victims to speak to Helpline officials.\nTherefore, he added, Ministry of Human Rights has decided to upgrade its complaint registration system in collaboration with UN Women, and has transformed the Helpline and upgraded it to be able to take complaints through SMS and a mobile app.\nThe Helpline also aimed to facilitate and link relevant support services to the victims of human rights violations and their families ,he said.\nSpecific objectives of the project are to establish grievance-redressal mechanism through referral services to the victims of human rights violations and to maintain data-base on human rights violations at national level, he added.",
  "retrievedAt": "2025-08-11T19:59:27.005Z"
}
