{
  "title": "Master plan evolved for development projects in Sialkot: Usman Dar",
  "link": "https://www.app.com.pk/national/master-plan-evolved-for-development-projects-in-sialkot-usman-dar/",
  "date_published": "2020-11-08T13:15:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Nov 08 (APP): Special Assistant to the Prime Minister on Youth Affairs Usman Dar said on Sunday a master plan had been evolved for mega water supply, up-gradation of parks and\nsewerage projects in the city.\nTalking to the media at Jinnah House Sialkot, he said the mega project at a cost of Rs 15 billion would help ensure world class municipal facilities to one million people of the city.\nHe said the Punjab government was working with experts of Asian Development Bank on the mega project to improve the supply of clean and safe drinking water to citizens,\nsewerage, sanitation, solid waste management, up-gradation of parks, transport and traffic management.\nDar said that completion of these projects would directly benefit to one million residents of Iqbal city which would truly prove to be a game changer.\nHe said the master plan would be made with the cooperation of Asian Development Bank (ADB) by keeping in mind the future needs of next 30 to 40 years.\nHe said that state-of-the-art 250-bed hospital was going to be built in Sialkot at a cost of Rs 5.1 billion to provide better and advance medical facilities to the people of Sialkot.\nThe SAPM said the construction of new campus of Govt College Women University (GCWU) Sialkot was briskly underway near Eimanabad.\nHe said the government had released a special grant of Rs 3.38 billion for the infrastructure development in this new campus of GCWU Sialkot.\nUsman Dar said the government was working on health, education, justice, infrastructure and provision of clean drinking water projects.\nHe said the construction of 5km road at a cost of Rs 250 million from KFC to Shelton Hotel was briskly underway.\nHe said the upgrdation and beautification of Sialkot city was the top priority of the government.\nDar said Sialkot was an important economic hub and totally export-oriented city of the country.\nHe said that Special Economic Zone (SEZ) was approved to be set up in Sialkot near Sambrial over 1,000 acres of land.",
  "retrievedAt": "2025-08-11T19:59:27.140Z"
}
