{
  "title": "Winning accolades for initiating a flagship program",
  "link": "https://www.app.com.pk/national/winning-accolades-for-initiating-a-flagship-program/",
  "date_published": "2020-11-08T09:38:00.000Z",
  "source": "APP",
  "content": "By Shahid Mehmood Sra\nISLAMABAD, Nov 08 (APP): Prime Minister Imran Khan has won accolades on way to the accomplishment of yet another herculean task to build five million houses for homeless poor in the country.\nHe stood tall among his contemporaries by leaping forward in materializing a dream which his opponents could just think of as builder community in the country eulogized him for removing hiccups to make Naya Pakistan Housing Program, a success.\nAfter the relentless efforts he put in during last two years, the program is now on ground and builders are jubilating and praising him for giving them level playing field to lend a hand in the government efforts for construction of five million houses.\nSeries of meetings and deliberations personally chaired by the Prime Minister coupled with his unflinching commitment paved way for his dream to come true.\nThese efforts made the builder community to eulogize this program with hopes that the target of five million houses was doable.\n“The incentives offered by the government to housing sector would help achieve the target of constructing five million houses and creating 15 million jobs,” said Mohsin Sheikhani, Chairman Association of Builders and Developers of Pakistan (ABAD).\nWelcoming incentive package, he said, it was the PTI government that declared the housing sector as an industry for the first time in 70 years history of the country.\n“If initially, the government starts with one million houses, it would create 2.5 million jobs and revive 40 to 72 allied industries. The package would be very useful for the construction industry,” he said.\nHe said that Covid-19 had slowed down economic growth across the world but hoped, “brisk advancement on this project would help bring an economic turnaround.\nThe construction industry is the backbone of our economy and its progress would help overcome housing units shortage, result in the growth of allied industries and jobs creation.”\nChairman Naya Pakistan Housing and Development Authority (NAPHDA) Lt Gen (R) Anwar Ali Hyder has expressed hope that simplified documentation process and other measures to ensure ease of doing business would help attract more investors to the housing and construction industry.\nHe said the investors, investing in housing and construction industry till December 31 would not be asked for their income source.\n“Earlier, it was difficult for the builders and developers to get approvals, but now the government has eased the ‘Approvals Regime’ to facilitate the housing construction sector.\n“He also mentioned the government’s vision of incentivizing the construction industry for the benefit of multiple industries, overall economic activity and jobs creation.\nThe government desires the builders and developers to take full advantage of this package and start their projects before December 31.\nAbid Qayyum Sulehri, an economist and Executive Director SDPI, saw the construction sector as a future driving force for the economy and appreciated incentives for the construction industry that would finally benefit the poor.\nBuilders and real estate agents have also seen this package as a major initiative for the revival of the sector as they hoped the government incentives would definitely restore the confidence of the local and foreign investors.\nCommenting on the government’s initiative, a leading property developer and businessman Ejaz Gohar was of the view that it was the first plan, which would make it affordable for low and middle-income people to build houses with low rate mortgage financing.\nThe commercial banks would allocate five per cent of their portfolio for the construction activities, he said and noted that some Rs 20 trillion was circulating in the informal unregistered economy and now was the opportunity for the people to get the huge amount of money declared by investing in the real estate sector by December 31, 2020.\n“Now low-income people can build a house of 5-marla with mortgage financing at 5 per cent.”\nEjaz said the mortgage financing was started in the United States 82 years back to kick-start its economy and Pakistan was far behind in terms of the home mortgage financing as compared to the developed world.\nAfter the announcement of the special package, the State Bank of Pakistan (SBP) decided to set a mandatory target for banks to extend mortgage loans and financing for developers and builders.\nManaging Director and Chief Executive Officer Pakistan Mortgage Refinance Company (PMRC) Mudassir Khan said PMRC was providing refinancing facility backed by funding from the World Bank and the government.\nMudassir said they have made long-term affordable housing finance a reality now with disbursements reaching Rs.15 billion to 11 partner banks and financial institutions through their conventional and innovative Islamic refinancing products.\nPMRC had also introduced a risk-sharing facility as a trustee for the government to encourage banks to lend for low-cost housing. It had jointly with the insurance industry created a new conventional and Takaful product for low-income housing under the Naya Pakistan Program.\n“The PTI government deserves credit as not only it did not shy away from the challenges and remained focused on the task but also elicited participation from the private sector in a positive manner,” said Muhammad Ejaz, Director, Arif Habib Corporation Limited.\nHe said the government undertook an elaborate process of consultation and engaged all relevant stakeholders. Instead of rushing to force any half-baked plan, it maintained steady and gradual progress towards developing an effective system through creating and reforming institutions.\nAt the same time, he said, creation of ease-of-doing-business and reforms in the foreclosure laws would enable institutional funding support, which was extremely positive.\nMuhammad Ejaz, Director Arif Habib Corporation further said, “Key factor is an investor. Giving them confidence by giving the construction sector the status of the industry would help motivate them to invest more in this sector.\nWe are grateful to the PTI government for these initiatives,” said Chief Executive Officer of Makeen Marketing Pvt. Limited Hassan Talal, a builder associate of Capital Smart City, Bahria Town, Blue World City, Lahore Smart City and other projects.\n“Rationalization of taxation would also have a positive impact. NPHP would also help the boost construction industry,” he noted.\nMuhammad Ahsan, a builder and interior designer saw the incentive package as a ‘well in time endeavor’ of the government for putting construction sector back on track and revival of economy.\n“The boom in the construction sector would provide business to 40 sectors and generate employment. If the pace continues the target of constructing five million houses would be achievable,” he noted.\nHe sought incentives for small contractors and builders in getting bank loans, guarantees and for securing their business.\nPrivate housing societies also see the package as a step forward for boosting real estate business and described it as a marvellous job of the government.\n“It is the best, any government can offer for the sector in an era of turmoil due to Covid-19. It would help steer through the crisis times,” said Muhammad Mansha Sahi Secretary Civilian Cooperative Housing Society (Soan Gardens).\nSpecial relief package for the construction industry had been announced by the government to boost construction activity.\nChairman All Pakistan Cement Manufacturers Association, Azam Faruque said the NPHP will help revive business activity in the market and benefit the steel industry.\nHe said that in the current challenging situation, when the whole global economy was in slowdown mode, Pakistan had a huge opportunity to choose a better option like the construction of new houses to come out of this crisis.\nChairman Pakistan Iron and Steel Merchant Association, Tariq Irshad said that the construction industry was considered as the backbone of any economy, which generated huge employment opportunities.\nChairman All Pakistan Marble Industries Association, Noman Baqi Siddiqui also welcomed the government decision, saying that in this critical situation, the initiative would not only benefit the construction sector but the whole economy.\nThe Federal Cabinet, with amendments in the Income Tax Ordinance 2001 and Finance Act 1989, approved an ordinance to provide tax incentives to the construction industry.\nThe approval of incentives package for the construction industry through an Ordinance was aimed at promoting economic activities and generating employment opportunities in the country, affected by lockdown in the wake of COVID-19.\nFor low-cost housing projects by Naya Pakistan Housing and Development Authority, the tax was further reduced by 90 per cent for housing projects approved by NAPHDA.\nThe new tax rate was applicable to new projects starting before December 31, 2020 and to existing incomplete projects which opt for taxation under this scheme.\nBoth new and existing projects would have to get registered with FBR by filing a prescribed form on the IRIS web portal.\nExisting projects would self-declare the percentage of completion and shall pay fixed tax for the remaining project under the new fixed tax scheme.\nThere will be exemption of tax on dividends paid to shareholders by builders and developers opting for taxation under this scheme.",
  "retrievedAt": "2025-08-11T19:59:28.028Z"
}
