{
  "title": "World Science Day celebrations to be held at COMSTECH",
  "link": "https://www.app.com.pk/national/world-science-day-celebrations-to-be-held-at-comstech/",
  "date_published": "2020-11-08T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP): The World Science Day for Peace and Development will be celebrated on November 10 (Tuesday) at COMSTECH under this year’s theme “Science for and with Society”.\nThe convening power of the World Science Day provides us with an opportunity to share good practices and provide guidance to improve the inter-linkages between science and society to resolve global challenges such as the current pandemic.\nThe mega event will be organized by United Nations Educational, Scientific and Cultural Organization (UNESCO) in collaboration with Commission on Science and Technology for Sustainable Development in the South (COMSATS),\nOrganization of Islamic Cooperation Standing Committee on Scientific and Technological Cooperation (COMSTECH), Economic Cooperation Organization Science Foundation (ECOSF), Pakistan Science Foundation (PSF) and Pakistan Academy of Sciences (PAS).\nFederal Minister for Science and Technology, Chaudhry Fawad Hussain will be the chief guest on the occasion while renowned Scientist, Dr Atta-ur-Rahman will deliver key note address virtually on the topic “Enhancing national capacities for evidence-based policy making”.\nPresident, Pakistan Academy of Sciences (PAS), Dr Qasim Jan will speak on key issues concerning people–nature interactions, including some references to nature based-solutions for sustainable development with an emphasis on biodiversity and water issues.\nChairman ECO Science Foundation (ECOSF), Dr Manzoor Soomro, will speak on improving dialogue among scientists, government and citizen in view of combating global challenges.\nUNESCO Representative, Patricia McPhillips would highlight the importance of “Sharing in-time knowledge and data” to facilitate greater and timely access to scientific research across the world.\nRector COMSATS University Islamabad, Dr Junaid Zaidi will share his views on “Strengthening international scientific cooperation to facilitate progress.\nStudents from Tharparkar and Loralai will give perspective of youth as well as what is the impact of the science activities they were involved.\nScientists, students, teachers, researchers, science communicators who work in science centers and science museums, independent science communicators and science journalists would participate in the event which will be live streamed as well at 10:00 am (Pakistan time).\nThe World Science Day for Peace and Development, celebrated every year on November 10, was established by UNESCO in 2001 to highlight the important role of science in society and the need to engage the wider public in debates on emerging and important contemporary issues relevant to science.\nThe theme of the 2020 celebrations, `Science for and with Society’, has relevance in dealing with the global pandemic of COVID-19.\nThe COVID-19 pandemic has reminded all of the extent to which today’s world is complex and how intricately our health, economy, food security, climate, biodiversity and peoples’ well-being are interdependent and interconnected.\nThe societies have learned several lessons from this pandemic in term of science and society interface.",
  "retrievedAt": "2025-08-11T19:59:29.248Z"
}
