{
  "title": "Allama Muhammad Iqbal’s poetry, ideology and philosophy is a beacon for Muslim Ummah: CM KP",
  "link": "https://www.app.com.pk/national/allama-muhammad-iqbals-poetry-ideology-and-philosophy-is-a-beacon-for-muslim-ummah-cm-kp/",
  "date_published": "2020-11-08T16:28:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 08 (APP):Khyber Pakhtunkhwa Chief Minister Mahmood Khan Sunday said that Allama Muhammad Iqbal was a high-ranking philosopher, intellectual and poet as well as a great leader of the Muslims of the subcontinent whose poetry, ideology and philosophy is a beacon for Muslim Ummah especially our young generation.\nHe not only gave very wise guidance on various issues of life but also gave a separate identity to the Muslims by presenting the concept of Pakistan, on the basis of which the Islamic Republic of Pakistan came into being.\nIn his message issued here on the birthday of Allama Muhammad Iqbal, poet of the East, artist of Pakistan, the Chief Minister said that the words of Allama Muhammad Iqbal create a spirit of patriotism and service to humanity in the nation.\nDiscouraging racial discrimination, Iqbal emphasized the unity of the Muslim Ummah. Iqbal’s wish and message was that all Muslims from Nile to Kashgar should unite to guard the sanctuary and restore the dominance of Islam.\nThe Chief Minister said that in order to meet the challenges facing by the Muslim Ummah we need to promote Iqbal’s thought again today. He said that today we need the spirit of Tehreek-e-Pakistan which has made possible the establishment of Pakistan by uniting the Muslims of the subcontinent.\nThe Chief Minister said that the ideas and thoughts of Allama Iqbal are the best source of guidance in every sphere of life. “You have always taught truthfulness, self-awareness and national identity,” he remarked.\n“Our future lies in the awakening of consciousness, the support of truth, the justice system and the impartial service to humanity and we have to take the country forward in the light of Iqbal’s philosophy and make it a truly great Islamic welfare state,” the Chief Minister concluded.",
  "retrievedAt": "2025-08-11T19:59:29.332Z"
}
