{
  "title": "Ehsaas programme helps keep economic cycle running",
  "link": "https://www.app.com.pk/national/ehsaas-programme-helps-keep-economic-cycle-running/",
  "date_published": "2020-07-27T23:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):The Ehsaas Programme, allocations of which were enhanced to Rs 208 billion during the fiscal year 2019-20, has not only helped in protecting vulnerable segments of society but was also helping to keep economic cycle running through socio-economic development.\nVarious measures taken under the Ehsaas programme, have supported economic activity, new long-term investment and employment generation in the country, official sources said.\nAmid the impacts of coronavirus, the government mobilized all of its available resources to provide maximum relief to the public. The government, under its Ehsaas Emergency Relief Programme, provided Rs 160.5 billion to 13.3 million beneficiaries till July 27, 2020 to support those suffering from lock down.\nMoreover, the State Bank of Pakistan (SBP) disbursed Rs 6.4 billion for hospitals and Rs 10.4 billion for investment purposes and a sum of Rs 119 billion for wages till July 3, 2020.\n“These measures, coupled with persistent decline in new cases of Corona in last four week are expected to further support economic activity, new long-term investment and employment generation,” official sources said.\nIt is pertinent to mention here that after the outbreak of coronavirus, the main priority of the government was to protect the vulnerable segments through social safety nets and implement immediate measures that support early and quick economic recovery.\nIn this regard, the budget strategy for FY2021 is focused on maintaining a balance between Corona related expenditure and fiscal deficit, keeping primary balance at the sustainable level, and development expenditure at sufficient level to support the economic activity and revenue mobilization.\nSince the outbreak of COVID-19 in the country, the Prime Minister Imran Khan’s stance of not imposing complete lockdown transcending all the criticism paved the way for the country’s largest-ever social protection initiative of Ehsaas to address the financial needs of the vulnerable segments of society successfully.\nA big challenge for the country, after the unusual circumstances due to COVID-19, was to implement prevention measures through limiting social interaction on one hand as well as compensating the daily wagers and labourers whose livelihood were badly affected, on the other.\nTo provide relief to the daily wagers and piece-rate workers, Ehsaas Emergency Cash Program was launched by the start of April to provide cash assistance of Rs. 12,000 to those rendered jobless amid lockdown, through a transparent manner. Till July 28, an amount of Rs.160.51 billion has been disbursed among over 13,268,000 lockdown affected persons through Ehsaas payment centers across the country.\nThe primary role of the Ehsaas was focused on providing data of eligible people to the donors through registration at www.rashan.pass.gov.pk after providing their required information. As many as 738,869 people have registered themselves for ration assistance through the Ehsaas Ration Portal so far while the distribution of ration among the needy has been started.\nThe other ongoing programs under Ehsaas include Ehsaas Undergraduate Scholarship, Ehsaas Panagah (Shelter) and Langar Scheme, Ehsaas Kafalat, Ehsaas Interest Free Loans and Ehsaas Amdan and Assets Transfer Program. The present government has so far utilized a total of Rs. 254.95 billion on social protection and poverty alleviation programmes under Ehsaas.\nThe Ehsaas Amdan Program, launched on February 21, 2020, has so far distributed assets worth Rs. 1.5 billion among 25,054 families. The Ehsaas Saylani Langar initiative was launched on October 7, 2019 has opened six Langar points through public-private partnership in Punjab, Sindh, Khyber Pakhtunkhwa and Islamabad. The Ehsaas Kafalat programme, launched on January 31, 2020 has so far benefited 4,576,463 women.\nThe Ehsaas Interest free loan scheme, launched on July 5, 2019, has provided interest free loans worth Rs. 24.082 billion among 712,852 persons. The country’s biggest Ehsaas Undergraduate Scholarship program, launched on November 4, 2019, has provided Rs. 148.94 billion to the Higher Education Commission (HEC) to extend scholarship opportunity to the 50,500 outstanding but deserving students.\nThe preparations to launch the first-ever of its kind Ehsaas Nash-o-Numa programme were also in full swing aiming to prevent stunting in children through provision of specialized nutritious food to pregnant and lactating mothers and their children under the age of 24 months.",
  "retrievedAt": "2025-08-11T19:33:37.807Z"
}
