{
  "title": "Facilitation of youth towards getting education must for utilization of their talent: PM",
  "link": "https://www.app.com.pk/national/facilitation-of-youth-towards-getting-education-must-for-utilization-of-their-talent-pm/",
  "date_published": "2020-07-28T05:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):Prime Minister Imran Khan lauding the measures taken for tele-schooling and provision of education through internet Tuesday said that facilitation of youth towards getting education was a must for utilization of their talent. He was presiding over a high level meeting held here about ensuring enhanced and improved coverage of internet in the country. Issues relating to telecom sector were also discussed. Federal Ministers Shafqat Mehmood, Muhammad Hamad Azhar Amin ul Haq, Asad Umar, PM Advisor on Finance Dr. Abdul Hafeez Shekh, Special Assistant to PM Tania Aidrus, Secretary Information Technology, Chairman Pakistan Telecommunication Authority (PTA), Chief Executive Officer (CEO) Universal Service Fund (USF) and other officers attended the meeting.\nThe Prime Minister while appreciating the various measures taken by USF about broadening the mobile and internet coverage especially in the backward and far flung areas directed to speed up all the necessary steps for the inclusion of priority sectors like education in the jurisdiction of USF. About easy access of internet for youth, provision of cheaper packages and for resolution of issues relating to telecom sector, he directed to consider those issue in the Economic Coordination Committee of the Cabinet (ECC) and take decisions within the next two weeks.\nThe meeting discussed in detail the measures being taken to ensure enhanced and improved internet coverage and addressing the issues relating to telecom sector.\nThe meeting discussed measures for easy access of internet for students and provision of cheaper packages. During the meeting, views were also exchanged on various USF projects for ensuring mobile and internet coverage in the country’s backward areas.",
  "retrievedAt": "2025-08-11T19:33:30.720Z"
}
