{
  "title": "IOJK – A legacy of betrayal by Indian successive regimes",
  "link": "https://www.app.com.pk/national/iojk-a-legacy-of-betrayal-by-indian-successive-regimes/",
  "date_published": "2020-07-28T00:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP): The dawn of August 5, 2019 brought in another era of torture, subjugation and usurpation of fundamental rights in Indian occupied Kashmir. It was another day of political betrayal, injustice and violation of human rights for Kashmiri people by yet another successive Indian regime.\nThe RSS plagued Narendra Modi government had made the sham decision of annexing Occupied Kashmir by revoking article 370, shocking the saner segment within India and abroad.\nEveryone had a sense of injustice and disillusionment except fascist Modi, his aides and RSS. Some described it as a political holocaust inflicted on innocent people. Others saw it as sheer violation of international law and an illegal decision analogous to committing a fraud with Kashmiri people. India had violated United Nations Security Council resolutions on Kashmir and Modi and aides had acted as land grabbing mafia.\nSince partition, this legacy of betraying, kidnapping, torturing and killing Kashmiris continued. The Kashmiri leadership has once again urged world nations to redeem their pledge of right to self-determination for Kashmiris.\nFrom 1954 until August 05, 2019, Jammu and Kashmir enjoyed special status under the Indian Constitution.\nUnder Article 370 of the Indian Constitution, the State of Jammu and Kashmir’, was accorded autonomy. India had allowed the state to have its own constitution, a separate flag and independence over all matters except defence, foreign affairs and communications. The state’s residents lived under a separate set of laws related to citizenship, ownership of property and fundamental rights, as compared to other Indians.\nBut in a major shift, the Modi government revoked article 370 making the Indian constitution to come into full force in Indian Occupied Kashmir. The Article 35A of the Indian Constitution allowed the legislature to define the state’s “permanent residents.” All identified residents are issued a permanent resident certificate which entitles them to special benefits related to employment, scholarships and other privileges. But the biggest advantage for permanent residents is that only they have the right to own and buy property in the state.\nThe move to scrap Article 35A is driven by the desire of Hindu nationalist groups such as Modi’s Bharatiya Janata Party (BJP) to end Muslim majority in IOK. The article’s removal opens the door for mass Hindu migration and settlement in IOK.\n“The situation in Kashmir is very alarming and extremely terrifying. I am conscious of the fact if the United Nations and the OIC will not come out of its slumber, the whole nation of Kashmir will be pushed to the brink of extinction,” remarked Ghulam Nabi Fai ( FaceBook Twitter), Executive Director Kashmiri American Council, United States.\n“No foreigner can buy land in Kashmir, no foreigner can settle in Kashmir but India passed a domicile law on May 18, 2020 enabling other Indians who were there for last seven years, to get domicile certificate,” Fai said. “Even non-Kashmiri Indians including personnel of Indian forces, their children and Indian labour class working in IOK can now get this certificate.”\n“But, I being the Kashmiri and the Kashmiri Diaspora cannot get it because we had not lived in Kashmir for the last seven years,” he said. “This is simply happening to change the demography of Kashmir because India knows that Kashmiris will not opt for India and vote for India.”\n“We fear that 1.7 million Indians are going to settle in Kashmir within a year or so. This calls upon the United Nations to redeem their pledge made to Kashmiri people,” Fai said. “They must understand that Kashmir issue can lead to serious confrontation between India and Pakistan and needs immediate resolution.”\nAll Parties Hurriyat Conference leader Altaf Hussain Wani (Facebook Twitter) condemned imposition of curfew in the IOK and illegal arrest of thousands of people including political leaders, civil society activists, children and women.\nHe lambasted India for enacting laws like new domicile rules and enabling Indian non-state subjects to get permanent residence in IOK. “The personnel of Indian armed forces and their children involved in brutalizing the people of IOK were also being entertained under the law.”\nAlong with this, he said, the new education policy was also being introduced in the valley to rewrite the history of IOJK besides rolling out new media policy to choke the press freedom.\n“The unilateral action of August 05 received worldwide condemnation, but unfortunately India continues its oppressive regime with impunity,” he said and called upon world nations to fulfill their pledges made to Kashmiri people under the UNSC resolutions.",
  "retrievedAt": "2025-08-11T19:33:37.870Z"
}
