{
  "title": "India grabs more than 9600 kanals of IIOJK land in IE’s name",
  "link": "https://www.app.com.pk/national/india-grabs-more-than-9600-kanals-of-iiojk-land-in-ies-name/",
  "date_published": "2020-07-27T22:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):While treading the path of occupier Israel in Palestine, Modi-led fascist government of India has grabbed more than 9600 kanals of land in the name of creating 37 new industrial estates (IE) across Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to Kashmir Media Service, the move was strongly condemned by the Jammu & Kashmir Right to Information (RTI) Movement, a civil society organization comprising people almost from all walks of life.\nThe RTI Movement in a statement issued in Srinagar said that the act would prove to be disastrous for the agriculture-based Kashmir’s economy, which already under stress due to double military siege.\nThe RTI Movement Chairman, Dr Raja Muzaffar Butt said that as per the 10th Agriculture Census of 2015- 2016, the agricultural land holding in Jammu and Kashmir was mere 0.59 hectares.\n“This was a bit more i.e. 0.62 hectares in 2011,” he said and asked the authorities to take into account the unique natural and topographical features of the occupied territory.\n“We have dozens industrial estates in J&K without any infrastructure and acquiring huge land to create more such estates is completely an unwise decision” Dr Raja Muzaffar further said.\nInstead, he urged the authorities to create green jobs by increasing subsidies in dairy farming, sheep farming, vegetable growing, apple and fruit cultivation plus growing of exotic flowers and herbs for medicinal and aromatic purposes.”\nOn 9600 kanals of land instead of setting up factories that cause air, water and noise pollution, the authorities can help set up 100’s of agri based farms,“ he added.\nThe RTI Movement asked the authorities including Lt. Governor C G Murmu and Chief Secretary B V R Subramanhyam to revisit this decision and ensure that 9654 kanals of land is utilized for agri based startup’s across the occupied territory.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:33:42.079Z"
}
