{
  "title": "Int’l community urged to pressurize India for stopping HR violations in IIoJK",
  "link": "https://www.app.com.pk/national/intl-community-urged-to-pressurize-india-for-stopping-hr-violations-in-iiojk/",
  "date_published": "2020-07-27T22:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):The AJK-Chapter leadership of All Parties Hurriyat Conference (APHC) on Tuesday urged international community to exert pressure on India to immediately stop the flagrant human rights violations and systematic killings of Kashmiri people at the hands of oppressive Indian forces.\n“International Community including United Nation must put pressure on Indian government to stop flagrant human rights violations and systematic killings of Kashmiri people at the hands of oppressive Indian force,” APHC-AJK leader and Vice Chairman of Jammu and Kashmir Mass Movement, Abdul Majeed Mir expressed these views while talking to APP, in connection with Youm-e-Istehsal being observed on August 5, the first anniversary of Indian unilateral abrogation of the limited autonomy of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe also questioned the continued silence of international community and said it was the obligation of the world to take notice of the gross human right violations in IIOJK.\nHe said, that India had deprived Kashmiris of their basic rights for last several decades and now the territory had been converted into a big jail since August 5, 2019.\nThe August 5, 2019 move was a classical example of the Machiavellian machination and mischief by India to disenfranchise, disempower and demoralize the Kashmiris who have an enviable history of fighting against the imperialistic designs of the Indian state he added.\nHe termed the August 5 action of Indian as unmoral, illegal and said it has exposed the ugly face of Indian democracy at international level.\nHe said with the abrogation of Articles 370 and 35A of the Indian constitution, which had restricted land ownership to Kashmiri state subjects, a series of new laws were enforced in the state that besides opening floodgates for Indian settlers would enable them to have more capital to take over Kashmiri lands.\n“For decades the people of occupied Kashmir have been waging a struggle against Indian conspiracies and subjugation. Indian inhuman acts have brought them to the brink of extinction, which is a wake-up call for the international community,” he said.\nThe APHC leader said the fascist Narendra Modi government was poised to deprive the Kashmiri people of their birth right to self-determination promised by the United Nations as he mentioned to August 5, 2019 as another ‘Black Day’ in the history of Kashmir.\nHe appreciated the government of Pakistan for highlighting the Kashmir issue at international level and said that three times the issue of Kashmir was rose in the United Nation Security General.\n“The people of Kashmir have rejected the Indian government’s illegal and unilateral action of August 5, to deprive them of their special status,” he said. “They are fully alive to their rights and will never bow down before India",
  "retrievedAt": "2025-08-11T19:33:40.718Z"
}
