{
  "title": "Asif opens World Games snooker campaign with dominant win - Sport - DAWN.COM",
  "author": null,
  "content": "CHENGDU: Pakistan’s top cueist, Muhammad Asif, began his World Games snooker challenge impressively, defeating China’s Liang Xiaolong 2-0 here at the Civil Aviation Flight University of China Tianfu Campus Gymnasium on Sunday.\n\nAsif, Pakistan’s most successful player with three IBSF titles and the nation’s sole representative at the multi-sport event, secured the Group ‘A’ victory convincingly.\n\nThe 43-year-old Asif took the first frame against the home hope 79-50 and followed with a commanding 77-24 win in the second frame.\n\n“This win means a lot to me,” Asif said after the match. “I’m happy with my performance and hope to keep this momentum going.”\n\nNasir — who lost his opening match in the main draw — dominated from the first serve, showcasing his superior shot-making and court coverage to leave Pena with no answers.\n\nThe win gives Asif a strong start in the 12-player tournament featuring athletes from nine nations, divided into four groups. The top two players from each group after the round-robin stage will progress to the quarter-finals.\n\nMeanwhile in the squash event, Nasir Iqbal kept his winning run intact as he crushed Romania’s Radu Pena 11-3, 11-3, 11-2 to secure a semi-final berth.\n\nNasir delivered a masterclass in precision and control, dismantling his Romanian opponent in just 22 minutes of ruthless squash.\n\nThe 31-year-old Nasir has now conceded only 14 points across his last two matches.\n\nMeanwhile, compatriot Noor Zaman received a walkover in his plate event quarter-final fixture, automatically progressing to the semi-finals.\n\nKOZERSKA SETS WORLD RECORD\n\nElsewhere on Sunday, Pola­nd’s Julia Malgorzata Kozerska set a new world record in the freediving women’s dynamic without fins event.\n\nKozerska’s winning distance of 222.5 metres shattered her previous mark of 214.0m set at CMAS World Championship Freediving Indoor Masters in Athens this May.\n\nZsofia Torocsik of Hungary was 10m behind to take the silver, while Poland’s Magdalena Solich Talanda settled for the bronze.\n\nIn the men’s dynamic without fins event, world record holder Mateusz Jan Malina of Poland took the gold medal with a distance of 228.5m, with Rolando Salgado Martinez of Cuba and Croatia’s Vanja Peles completing the podium in second and third place, respectively.\n\nIn the women’s wakeboard freestyle event, Chinese water skier Xu Lu claimed victory at the Sancha Lake International Aquatics Center, while Alice Virag of Italy and Argentina’s Eugenia De Armas finished second and third, respectively.\n\nIndonesia added to their medal tally in the dragon boat racing competition as they won two more golds in the open eight-seater 200m and the 10-seater 500m.\n\nIndonesia claimed the first gold on Saturday in the open eight-seater 2,000m pursuit race.\n\nUkraine secured golds in the open eight-seater 500m and the 10-seater 2,000m pursuit race. Thailand won the 10-seater 200m gold.\n\nMeanwhile, Chinese Taipei beat Switzerland 3-0 in the final to claim the women’s 500kg tug-of-war title while United States and Japan shared the men’s softball gold as persistent rain forced the cancellation of the final.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68993f1d627ed.jpg",
  "retrievedAt": "2025-08-16T07:27:07.910Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930106/asif-opens-world-games-snooker-campaign-with-dominant-win",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:54:43.000Z"
}
