{
  "title": "Pakistan gets offers in 100,000-tonne white sugar tender, traders say - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Trading Corporation of Pakistan (TCP) on Monday received offers in its international tender to buy 100,000 tonnes of white sugar, European traders said in initial assessments.\n\nOn July 8, the government had approved plans to import 500,000 tonnes of sugar to help maintain price stability. Market analysts said that retail sugar prices in the country have risen sharply since January.\n\nTCP had last week issued a fresh international tender to purchase 100,000 tonnes of white refined sugar, after a previous one for 50,000 tonnes of sugar in July reportedly received no offers.\n\nThe lowest price offered in the tender was believed to be $539.00 a tonne, cost and freight (c&f) included, according to traders. They said offers were still being considered and no purchase had been reported yet.\n\nThe lowest offer was said to have been submitted by trading house ED&F Man for 50,000 tonnes of fine-grade sugar sourced from any origin.\n\nThere were reportedly three other participants in the tender.\n\nDreyfus was said to have offered $580.75 a tonne c&f for 25,000 tonnes of fine-grade sugar from any origin, while Al Khaleej Sugar offered $586.00 a tonne c&f for 30,000 tonnes of medium-grade sugar sourced from the United Arab Emirates.\n\nTrading house Bare offered $555.00 c&f for medium-grade and $550.00 c&f for fine-grade sugar, both from Brazil.\n\nReports reflect the assessments so far from traders, and further estimates of prices and volumes are still possible later.\n\nNo purchase was reported in a previous tender for 100,000 tonnes on July 31, with the lowest price offer also $539.00 a tonne c&f.\n\nThe new tender seeks small/fine- and medium-grade sugar from worldwide origins, excluding India and Israel.\n\nThe sugar shipments should be organised to achieve the arrival of all the sugar in Pakistan by October 20, traders said.\n\nShipment of breakbulk supplies is sought from September 1 to September 15 for 50,000 tonnes, while the rest can be shipped from September 10 to September 25. Sugar in ocean shipping containers can also be shipped between September 1 to 20.\n\nMeanwhile, traders remain puzzled by the government’s sugar trade policy.\n\nDuring FY25, Pakistan exported 765,734 tonnes of sugar, generating $411 million in foreign exchange, with an average per tonne price of $537. By contrast, only 33,101 tonnes were exported in FY24, earning just $21m.\n\nThe government has vowed strict monitoring of sugar stocks and also placed some unidentified mill owners on the Exit Control List in a bid to stabilise rates.\n\nA cartelisation case involving 79 sugar mills and the Pakistan Sugar Mills Association (PSMA) is also being heard by the Competition Commission of Pakistan (CCP).",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:26:25.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930198/pakistan-gets-offers-in-100000-tonne-white-sugar-tender-traders-say",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T12:07:18.000Z"
}
