{
  "title": "Complete 3-day curfew imposed in KP’s Bajaur, Miranshah amid operation: home dept - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Khyber Pakhtunkhwa Home Department on Monday announced that a three-day curfew was being imposed from today until August 14 (Thursday) amid an operation against militants in the areas.\n\nAt the end of July, security forces backed by gunship helicopters and artillery launched ‘Operation Sarbakaf’ against terrorists in Lowi Mamund tehsil and imposed a three-day curfew in the region.\n\nThe operation was paused after both sides agreed to a ceasefire until the conflict was completely resolved thro­ugh dialogue; however, peace talks between militant commanders and the Bajaur peace jirga fell through.\n\nToday’s statement said that the curfew would be imposed from 11am today until 11am on August 14, in order to ensure the safety of the public during the anti-terror operation.\n\n“A complete curfew will be imposed … in which movement on the roads and leaving houses will be prohibited,” the statement read.\n\nIt listed Laghari, Guati, Ghanam Shah, Bad Siya, Kamar, Amanta, Zagai, Gut, Gunde, Gadigal, Niag Kali, Rigi, Daag, Damadola, Sultan Beg, Chautra, Shenkot, Gang, Jeewar, Inam Khoro, Chengai, Anga, Safri, Bar Gatki, Kharki, Shukro and Bakro as areas in which the curfew would be in effect in Bajaur.\n\nKhar Munda Road, Khar Navagi Road, Khar Pusht Salarzai Road and Khar Sadiqabad Inayat Kalay Road were also listed as off limits under the curfew.\n\n“The public is requested to end their activities by 10:30am and return to their homes during the curfew; otherwise, they will be at risk of any untoward incident,” the statement added.\n\nMeanwhile, Adviser to the KP Chief Minister on Information Barrister Mohammad Ali Saif said in a statement that the curfew was limited only to Bajaur and Miranshah, rubbishing rumours that it had been imposed across KP.\n\n“Rumours of a curfew across Khyber Pakhtunkhwa are completely false,” the statement read. “Life in the province is going on as usual. There is no curfew except for specific areas in Bajaur and Miranshah.\n\n“News of a curfew is political propaganda and an attempt to mislead the public,” Saif was quoted as saying. “The rumour-mongering mafia wants to spoil the province’s journey of peace and development.”\n\nSaif urged people to avoid listening to rumours and implored them to only pay attention to information from official sources, reiterating that movement in the province was normal.\n\n“Those who create fear by lying about the curfew are enemies of the people,” the statement read. “Action will be taken against those spreading false information on social media. The people of KP know that propaganda will fail.”\n\nMeanwhile, according to Khar Assistant Commissioner Dr Sadiq Ali, people displaced by the operation have been housed in 100 government schools and colleges.\n\n“Right now, we have 435 schools. More than 100 private schools are also vacant,” he told Dawn.com. “A form has been issued for the registration of victims, and it is also being done through Nadra (National Database and Registration Authority).\n\nIn a speech in the KP assembly today, Awami National Party Member of the Provincial Assembly (MPA) Nisar Baz Khan raised questions about whether the home department was under the control of the provincial government.\n\n“At midnight, the provincial home department ordered that curfew be imposed across Bajaur. Is the home department under the provincial government or not? If so, who imposed this curfew and under what authority?” he asked.\n\n“On the one hand, millions of people are homeless and on the streets, with no place to hide, and on the other hand, the government is blocking their routes by imposing a curfew. If there is no transport arrangement, how will people leave?”\n\nNisar said appeals were made and jirgas were held to halt the operation, but it started anyway.\n\n“Now, it should be clarified whether this operation is being carried out with the permission of the chief minister or with the permission of the prime minister,” Nisar said. “I clearly say that the operation in Bajaur should be stopped and the curfew should be lifted immediately. Emergency relief should also be provided for IDPs (internally displaced persons).”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:26:03.496Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930221/complete-3-day-curfew-imposed-in-kps-bajaur-miranshah-amid-operation-home-dept",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T16:36:32.000Z"
}
