{
  "title": "‘Mazhab nahi, soch badlo’: Religious minorities seek end to forced conversions, intolerance - Pakistan - DAWN.COM",
  "author": null,
  "content": "“I have a problem with the use of the term ‘minority’. It only serves to otherise religious groups within the country and reinforce existing divides. We are all equal citizens of Pakistan.”\n\nChristians like Pastor Daniel were among hundreds gathered at Karachi’s YMCA on Sunday for the Minority Rights March, which, ironically, was celebrated a day earlier since “minorities wouldn’t get a day off to celebrate it”.\n\nJinnah’s oft-quoted speech of Pakistani citizens being free to go to temples and places of worship remains relegated to the history textbooks since the lived realities for religious minorities across Pakistan are far from that freedom once promised.\n\n“Christians like me aren’t allowed to preach their religion, and seldom can we practice it without the fear of the supposed majority,” said Daniel of Karachi’s Philadelphia Pentecostal Church.\n\nJinnah’s speech and his very upbringing were woven through the day’s itinerary. The speakers emphasised that his early education was at schools founded by religious minorities, to whom these schools now remain largely inaccessible.\n\nSunday’s march centred around two main demands: the denationalisation of educational institutions, and an end to forced conversions.\n\n“The biggest discrimination against the Christian community and minority communities in general is that the institutions we built, the institutions that equipped Jinnah to become Quaid of the country, have now been captured under elitist policies and are inaccessible to the general minority population,” Luke Victor, an organiser at the march, told Dawn.com.\n\nVictor explained that the denationalisation policy has been in place for the past 40 years, but educational institutions still haven’t been returned to the church administration.\n\n“We have a right under Article 22 to manage our own institutions, but the nationalisation policy is ultra vires of that,” Victor explained. Article 22 of the Constitution outlines “safeguards as to educational institutions in respect of religion”.\n\n“It’s sort of a robbery of our heritage, of our educational institutions.”\n\nOther speakers emphasised how former premier Benazir Bhutto was empowered by her alma mater, Karachi Grammar School — founded by the city’s first chaplain, Reverend Henry Brereton — but it hardly has any Christian students today.\n\n“Systemic discrimination and biased policies have kept minorities away from institutions they once founded and thrived in. They now face a state-created cycle of educational exclusion,” a post on the Minority Rights March’s official X account said.\n\nOn the other hand, Christian-founded public schools like the YMCA lie vacant and misused after being brought under government control as part of the nationalisation policy.\n\nSeveral points made at the march were amplified speeches of a robust social media campaign that the Minority Rights March team had begun ahead of the event. #EducationForAll, #GiveBackOurInstitutions, #StopForcedConversions and #MeraMazhabMeriMarzi were just some of the hashtags across the team’s social media, which were spotted on posters too.\n\n“The state has stolen our educational institutions from us,” one speaker chanted to applause from a colourful sea of participants dressed in quintessentially Sindhi chunri prints, munching on papad and bhel sold by vendors who followed the crowd as they marched to the Arts Council Chowk. The crowd was a microcosm of what minority communities in Pakistan tend to look like: intergenerational, close-knit, small but mighty.\n\nOne of the many slogans reverberating through the crowd of 500-something people was ‘mazhab nahi, soch badlo’ (change your mindset, not religion), which called for an end to forced conversions of Hindu girls.\n\n“If you can’t get a driver’s licence or own a gun before the age of 18, then why are forced conversions allowed before that age?” asked one speaker who runs a private shelter for young minority girls who were forcibly converted.\n\nThe state’s failure in this case is two-pronged; on the one hand, it fails to protect religious minorities from being forcibly converted. On the other hand, the police refuse to recover those who have been abducted and converted, claiming the girls have now embraced Islam and the parents must stop seeking their recovery.\n\nAccording to a study by the Human Rights Commission of Pakistan, Sindh, a province that is host to the largest Hindu population in the country, has seen a mass exodus of Hindus towards India.\n\n“We have a total of 11 demands today, the foremost being an end to forced conversion of Hindu girls,” said organiser Rampal Singh, who donned a sea-green turban and white kurta shalwar, standing in solidarity with his Hindu brethren.\n\n“This is not a protest but a celebration for us,” Singh proclaimed, vowing to stand with his Muslim brothers on August 14 as “they are standing with us today”.\n\n“I am a son of this soil, and all we are asking today is that, please hear us out and our issues.”\n\nSuhani Naveej, of the Jaguti Foundation, detailed her work on the issue of forced conversion. “Many Hindu parents are now refusing to get their daughters’ CNIC cards made lest it be used as evidence in a court, declaring her a legal adult if she is ever abducted and forcibly converted.”\n\nNaveej believed that the state’s apathy towards the plight of Hindu girls often leaves them vulnerable to social and educational inequalities.\n\n“The lack of a CNIC card severely impacts the future prospects of the girls, barring them from accessing education and healthcare, among other basic facilities,” Naveej said.\n\nStill, the activist remained hopeful. Through her work, she aims to rebuild the Hindu community’s trust in state institutions. She has repeatedly called on the state to support her efforts in bridging the divide that has taken root only due to the state’s negligence.\n\nWhile expressing despair at the state of forced conversions, activist and organiser Najma Maheshwari said: “Today is supposed to be a day of celebration for us, but instead, we are forced to protest for our basic rights, and for our daughters to not be taken away.”\n\nVoluntary migration also has its roots in religious discontent. Several nurses belonging to religious minorities flee the country due to workplace harassment, which Pastor Naomi Bashir urged the government to end, as well as address the severe shortage of nurses in Pakistan.\n\nThere was an almost palpable distaste from the crowd when speakers addressed the synonymity of sanitary workers with religious minorities, particularly Christians and Hindus, who are often referred to as “churra” and “bhangi” (derogatory terms used for cleaners).\n\n“We always see that job listings for sanitary work or Khakrob, exclusively ask for non-Muslims. Such actions constitute and promote systemic exclusion against religious communities, pushing them towards the margins,” Jagruti Foundation’s co-founder Sanjana Kumar told Dawn.com.\n\nJagruti Foundation is an initiative which aims to promote education in underserved communities.\n\nKumar, among many others at the march, questioned the discrimination, asking if cleanliness is “half of faith, then why does the responsibility of it fall solely on religious minorities?”\n\n“Is that why we voted to be a part of Pakistan? So we could pick up trash?” one organiser asked as she spurred the crowd to chants of “shame, shame”.\n\nThe day’s doom and gloom was replaced by crowds dancing and swaying to a harmonium player singing Damadam Mast Qalandar as the sun broke through a cloudy sky that shielded the crowd from otherwise unbearable heat.\n\n“Chant louder so that it reaches the place where laws are passed,” one of the organisers said as he gestured to the Sindh Assembly behind him, the first legislature to pass a resolution in favour of creating Pakistan.\n\n“We lived here before Pakistan was formed, and we will continue to live here, because, to us, this land’s significance is equivalent to that of our mother”, Maheshwari said.\n\n“We have been fighting all our lives, and we will continue until our last breath.”\n\nHeader Image: A woman holds up a wooden cross outside the Sindh Assembly at the Minority Rights March held in Karachi on August 10, 2025. — Photo by Shifa",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/11121730968ffc9.png",
  "retrievedAt": "2025-08-16T07:26:32.185Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930166/mazhab-nahi-soch-badlo-religious-minorities-seek-end-to-forced-conversions-intolerance",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T10:57:42.000Z"
}
