{
  "title": "Updating NFC award - Business - DAWN.COM",
  "author": null,
  "content": "The 10th National Finance Commission (NFC) expired on July 21, and the NFC secretariat in the Finance Ministry is in the process of forming a new commission. There is no notification yet of the representatives of the four provinces for the 11th NFC.\n\nThe 7th NFC Award has now been in effect for nearly 15 years — far beyond its five-year tenure. The president of Pakistan has extended the award every year due to a disagreement between the provinces and the Centre over the new formula.\n\nThe 18th Amendment provided constitutional protection to the share of the federating units, stipulating that a sub-federation’s share in any future award must not be less than its share in the previous award. In the current political situation, any constitutional amendment seems a remote possibility.\n\nIt appears now that unanimous agreement among five stakeholders can only be reached based on give and take and rights and responsibilities anchored on democratic participatory federalism.\n\nDespite constitutional obligations, central and provincial governments have not fully empowered local administrations to meet the people’s needs\n\nA fresh NFC award has become an imperative to ensure that fiscal federalism remains dynamic, equitable, and responsive to the country’s evolving development landscape while protecting provincial rights, says Planning Minister Ahsan Iqbal.\n\nDue to limited fiscal space and higher spending on debt servicing, the minister says the federal government lacks enough fiscal space for development expenditure. He says the federal Public Sector Development Programme (PSDP) has shrunk alarmingly from 2.6 per cent of GDP in 2018 to just 0.8pc in 2025.\n\nHowever, the latest official data show positive developments. The overall tax-to-GDP ratio increased by a record 3.2 percentage points in FY25 to hit a 21-year peak of 15.7 per cent, and non-tax revenue grew by 68pc against a 26pc growth in tax revenues, according to a report on consolidated federal and provincial operations released for the year by the Finance Ministry.\n\nTotal revenue of Rs18 trillion included Rs12.72tr tax and Rs5.27tr non-tax revenue. The Federal Board of Revenue recorded total tax collection of Rs11.74tr compared to Rs9.31tr in FY24, reflecting a growth of 26pc but missed the revised target of Rs11.9tr.\n\nTransfer from the federal government to the four provinces under the NFC divisible pool stood at Rs6.85tr. The 7th NFC award had increased the provinces’ share in the divisible pool from 47.5pc to 56pc in 2010–11 and to 57.5pc from 2011 onwards. All four provincial governments recorded a budget surplus of Rs921.46tr against the revised target of Rs1.1tr.\n\nThe 7th NFC award also shifted from a population-only formula for horizontal distribution of the provincial share to a multiple-indicator model, allocating 10.3pc weight to poverty, 5pc to revenue generation, and 2.7pc to inverse population density and 82pc for population. Khyber Pakhtunkhwa was awarded an additional 1pc share to make up for the cost of security operations, while Balochistan received a guaranteed transfer of its share.\n\nAhsan Iqbal feels that there is still a need to reward provinces with stronger digital infrastructure and higher tax-to-GDP ratios to expand their narrow tax base.\n\nProvinces’ tax collection was recoded at Rs979bn in FY25, marking a 26pc increase from Rs774bn raised in the previous fiscal year. Provincial non-tax revenues grew by 41pc to Rs314b, surpassing the previous year’s collection of Rs223b — a significant improvement in provinces’ revenue-generating capacity.\n\nIn recommendations made to Prime Minister Shehbaz Sharif, the minister said the population numbers should be frozen at 241.5m and its weightage should be reduced from the current level to promote population stabilisation.\n\nThe minister has proposed including environmental resilience as a new criterion in the NFC award by adding indicators such as forest cover, climate adaptation investments, and reforestation efforts. He says transfer of resources should be linked to human development outcomes and the province should prioritise education, health, and gender equity.\n\nHe also recommended water vulnerability as another new criterion and suggested allocating funds for provinces investing in sustainable water infrastructure and management.\n\nThe decentralisation of power and the provision of essentials such as food, clothing, shelter, education and healthcare to the citizens have not been carried out as mandated by Articles 37 and 38, says former advocate general of Sindh, Barrister Zamir Ghuman.\n\nCurrent expenditure accounted for 95pc of the total federal outlay in FY25, according to a report of the Finance Ministry. Total federal expenditure was Rs16.48tr and included current expenditure of Rs15.7tr.\n\nUnder the constitution, Mr Ghuman argues that development is primarily the responsibility of provinces and local governments.’ Despite constitutional obligations, central and provincial governments have not fully empowered local administrations to meet the people’s needs.\n\nMr Iqbal also emphasised encouraging fiscal responsibility and own-revenue generation at the provincial level, and more importantly, operationalisation of Provincial Finance Commissions (PFCs). He argues that the constitutional promise of equity cannot be realised without intra-provincial resource distribution.\n\nThe minister wants the new NFC Award to make Provincial Finance Commission’s operationalisation mandatory as part of the NFC framework. He notes that PFC envisioned decentralising resources within provinces. That remains largely dormant or non-transparent in its functioning.\n\nPublished in Dawn, The Business and Finance Weekly, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/6818079192b1a.gif",
  "retrievedAt": "2025-08-16T07:28:47.460Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929983/updating-nfc-award",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:11.000Z"
}
