{
  "title": "Fireworks, drones, kite flying banned for Independence Day celebrations in twin cities - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The police and district administration in Rawalpindi and Islamabad have been directed to enhance security measures and enforce the ban on fireworks, aerial firing, quadcopters/drones, kite and pigeon flying during the Independence Day and Maraka-i-Haq celebrations on the night of August 13 and 14 at Shakarparian Parade Ground and Sports Complex, Islamabad.\n\nThe regional police officer, city police officer, commissioner and deputy commissioner of Rawalpindi have been asked by the authorities concerned to ensure the implementation of Section 144, maximum law enforcing till the end of the celebrations, especially in the funnel area of Nur Khan Base to ensure that no aerial firing, kite flying and pigeon flying took place in the surrounding areas.\n\nAs part of the preventive measures suggested by the authorities concerned, the area (five kilomtres radius) in the surrounding of the parade venue and PAF Base Nur Khan are to be made a weapon-free zone. Display boards should be installed at prominent places in Rawalpindi and Islamabad to bar aerial firing.\n\nHigh-rise buildings and vulnerable areas are to be kept under surveillance during aerial display. Police pickets on all leading roads falling in the fly past route and funnel areas be established and work on under-construction buildings located in the fly past routes should be stopped temporarily.\n\nDistrict admin, police told to ensure implementation of Section 144 Maximum security till conclusion of events at Parade Ground 8 Sports Complex\n\nDeployment of sufficient police personnel in the funnel areas and fly past routes on high-rise buildings and other specific locations should be ensured well in time on the actual days as well on the days of rehearsals.\n\nIn this regard, the district administration and police have also been asked to generate alert messages for public through cellular companies residing or visiting the surrounding areas of Parade Venue and PAF Base Nur Khan that “You have entered the no firing/weapons free zone”.\n\nIt was also suggested to educate the area residents to report any violation in this regard to the concerned police. Material related to kite flying etc., should be barred and stopped from entering Rawalpindi through effective checking at entry points, including G.T. Road and the motorway.\n\nThe authorities said that the event was aligned with PAF’s national image and public expectations. While preparations are being undertaken in a wholesome manner, safe conduct of the event remains undoubtedly the first and the top priority.\n\nDuring the fly past, the activity of fireworks, aerial firing, flying of quad copters/drone cameras and birds/kites flying on aerial routes poses a potential safety hazard to the aircraft and may result in serious consequences.\n\nMoreover, aircraft flying at low altitude while performing fly past can be exposed to several hazards, including the fireworks, aerial firing, quadcopters, drone cameras, bird strikes.\n\n“It is therefore requested to issue a special police order regarding deployment of police on funnel routes, high rise buildings and special search operations to avoid any untoward situation, keeping in view the prevailing security threats and implementation of Section 144.”\n\nMeanwhile, all leaves of police (operational division) have been cancelled due to prevailing security scenarios and upcoming events of Independence and Maraka-i-Haq day celebrations.\n\nAn order issued by the deputy inspector general of police (DIG) Islamabad said: “Due to prevailing security scenarios and upcoming events of Independence and Maraka-i-Haq Day celebrations, maximum police strength would be required for deployment on duty.”\n\nIt is therefore directed that no officer of operations division including investigation wing, Counter-Terrorism Department, ITP and Dolphin ERU may be granted any leave till August 14, the order said.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/689687722cab6.gif",
  "retrievedAt": "2025-08-16T07:27:22.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930092/fireworks-drones-kite-flying-banned-for-independence-day-celebrations-in-twin-cities",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:49:11.000Z"
}
