{
  "title": "Lahore ATC acquits Qureshi in 2 more May 9 cases; convicts Dr Yasmin, Ejaz Chaudhry and others - Pakistan - DAWN.COM",
  "author": null,
  "content": "An anti-terrorism court (ATC) in Lahore on Monday acquitted PTI leader Shah Mahmood Qureshi in two more cases related to the May 9 riots, while sentencing Dr Yasmin Rashid, Ejaz Chaudry, Omar Sarfraz Cheema and Mian Mehmoodur Rasheed to 10 years in prison.\n\nOn May 9, 2023, PTI supporters, protesting party founder Imran Khan’s arrest, staged violent protests throughout the country, following which thousands were arrested.\n\nThe ATC had reserved its verdict in the two cases on Saturday related to the May 9 riots — the Shadman police station attack and burning of police vehicles near Jinnah House — after completing proceedings at Kot Lakhpat jail. The judge concluded the hearings inside the jail in two sessions during the whole day.\n\nATC-I Judge Manzer Ali Gill announced the judgments today and convicted Dr Yasmin, Chaudhry, Cheema and Rasheed in both cases.\n\nPTI leaders Aliya Hamza and Sanam Javed were also sentenced to five years in prison in the Shadman case.\n\nAdvocate Rana Mudassar confirmed today’s sentencing to Dawn.com.\n\nSpeaking to Dawn.com, Hamza said that the PTI leaders did not fear punishment and would not take one step back.\n\n“We are standing with the PTI founder and will continue to stand with him,” she said. “I was in government custody when I was sentenced.”\n\nShe continued: “Maryam Nawaz was convicted because of corruption, while I was convicted because of loyalty. I have already served 16 months in prison, I am not afraid.”\n\nHamza stated that she was already consulting with her lawyers to file an appeal against the sentence with the Lahore High Court (LHC).\n\nIn the Shadman police station case, the court indicted 25 accused out of 41 nominated in the challan and recorded statements of 45 prosecution witnesses. At least 15 accused have been declared proclaimed offenders in this case.\n\nIn the police vehicles torching case, the court indicted 17 accused, declared seven proclaimed offenders and recorded statements of 65 prosecution witnesses.\n\nLast month, the Lahore ATC had acquitted Qureshi while sentencing Dr Yasmin, Chaudhry, Cheema, Rasheed and others to 10 years in prison over a May 9 riots case related to violence on Sherpao Bridge.\n\nSarwar Road police had registered a case against PTI leaders and workers on charges of ransacking and burning public property at Sherpao Bridge in the Cantonment area during the violent protests.\n\nChaudhry had filed two petitions in the LHC on Saturday, pleading with the court to suspend his sentence and conviction, along with ordering his release on bail. He further requested the court in the second petition to set aside his conviction and acquit him in the case in the “interest of justice”.\n\nPTI Chairman Barrister Gohar Ali Khan assailed the convictions, saying: “We’ve said before that if injustice is allowed to thrive, then the voice of the people will be silenced.”\n\nLamenting that the PTI’s mandate was stolen, Gohar said that the government did not have the people’s respect or vote and did not have the people’s trust.\n\n“Yet we sat [in parliament] so that we could move forward and protect the nation, save democracy, free the courts and ensure the supremacy of order.\n\n“If this blade of injustice doesn’t stop, the nation will suffer a great loss,” he warned.\n\n“We condemn the judgments and reject them,” Gohar added. “Justice has been killed.”\n\nThe PTI chairman further said that the party condemned the riots on May 9, stating that they should not have happened and should not happen again. However, he added that the party submitted a petition requesting a hearing on the allegations.\n\n“That hearing has not happened, our petition was ignored and no decision was made,” he stated.\n\n“Because the courts didn’t grant us justice, political tensions and instability rose. We don’t get justice and it keeps getting killed,” Gohar emphasised.\n\nHe said that Pakhtunkhwa Milli Awami Party chairman Mehmood Khan Achakzai was saying the right thing: “People need to rise up, their voice cannot be silenced.\n\n“We will carry on our movement until the true leader of the world’s 6th biggest party is released.”\n\nReferring to those convicted in today’s hearing, Gohar said that the party members were voices who were representatives of the state who did not condone violence against it.\n\n“If their voices are silenced, if the knife of injustice plunges deeper, then there will be a lot of division. This needs to end,” Gohar emphasised.\n\nAccording to Gohar, the chief justice of Pakistan (CJP) summoned the party leadership, who requested a meeting with Imran. “He (the CJP) said he is pursuing judicial reforms and would allow us to meet Imran in Adiala,” Gohar recalled.\n\n“It’s been six months and there has been no meeting. We submitted a privileged motion to meet Imran, but there has been no action on it.\n\n“We even submitted requests and raised the issue in parliament, but nothing happened,” he added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:26:33.101Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930196/lahore-atc-acquits-qureshi-in-2-more-may-9-cases-convicts-dr-yasmin-ejaz-chaudhry-and-others",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T11:24:28.000Z"
}
