{
  "title": "Karachi Bar Association to march on CM House today after lawyer killed in gun attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A young lawyer was shot dead in a Garden locality late on Saturday night, police said on Sunday.\n\nThe Karachi Bar Association (KBA) on Sunday announced that it would stage a protest outside Chief Minister House on Monday (today) over the police failure to provide protection to the legal fraternity.\n\nSoldier Bazar police station SHO Waqar Azeem told Dawn that lawyer Nasir Malik, 38, had gone to meet his sister at Al-Fareed Apartment in Garden East on Business Recorder Road.\n\nHe was inside the parking area of the building when armed men opened indiscriminate fire on him and fled on motorcycles and in private cars. The lawyer sustained critical bullet wounds in the head. He was taken to the Civil Hospital Karachi where doctors pronounced him dead on arrival.\n\nTraffic police to close Dr Ziauddin Ahmed Road due to security concerns from 8am\n\nThe officer said the murder appeared to be an outcome of personal enmity as the deceased had a property dispute with someone in the area.\n\nHe said the victim’s brother had nominated four persons in the FIR under Sections 302 (murder) and 34 (common intention) of the Pakistan Penal Code and efforts were underway to arrest them.\n\nLawyers’ announce strike today\n\nSpeaking to Dawn, president of KBA Aamir Nawaz Warraich said the KBA would stage a protest outside CM House on Monday (today) and the legal fraternity would boycott judicial proceedings.\n\nMr Warraich said Advocate Nasir had been brutally murdered, while the police authorities had previously assured them that lawyers would be provided protection.\n\n“In the past 10 days, three advocates have been attacked — two of whom have died while the third one is critically injured,” he added.\n\nHe said they demand that the government immediately issue arms licences to lawyers and arrest the culprits involved in the attacks on lawyers, including senior lawyer Khawaja Shams ul Islam.\n\nMr Warraich reiterated that a protest would be held outside CM House on Monday and lawyers would boycott judicial proceedings.\n\nMeanwhile, the traffic police announced that Dr Ziauddin Ahmed Road will be closed from 8am due to security concerns. They announced alternative routes for traffic going towards I.I Chundrigar Road.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/082314599982cdc.png?r=232335",
  "retrievedAt": "2025-08-16T07:27:41.743Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930024/karachi-bar-association-to-march-on-cm-house-today-after-lawyer-killed-in-gun-attack",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:58.000Z"
}
