{
  "title": "An era of financial transformation - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s digital financial landscape is undergoing a transformation that mirrors global trends of accelerating digital adoption, financial inclusion, and real-time payment innovation.\n\nThe recent State Bank of Pakistan’s (SBP) Payment Systems report for March 2025 reveals a striking rise in retail and large-value digital transactions, driven by mobile app-based banking, electronic wallets, and widespread merchant digitisation.\n\nThis momentum, backed by regulatory reforms and consumer preference shifts, is propelling Pakistan toward a more inclusive, efficient, and transparent payment ecosystem.\n\nIn a landmark development, retail payment transactions crossed 2.4 billion during Jan-March 2025, a 12 per cent increase from the previous quarter. The value of these transactions rose 8pc to Rs164 trillion This uptick indicates not just a growing digital footprint but also a rise in average transaction size, particularly through mobile and internet banking.\n\nNotably, 89pc of all retail transactions were made via digital channels, reaffirming a decisive consumer shift away from over-the-counter (OTC) methods. By value, however, OTC channels still dominate, handling 71pc of transaction value, reflecting a lag in high-value digital adoption — something central banks globally are also striving to improve.\n\nReplicating models like India’s UPI or Nigeria’s NIBSS could enhance financial inclusion\n\nMobile banking has emerged as the strongest growth driver. During the quarter, mobile banking apps processed 1.7bn transactions worth Rs27tr, representing 16pc growth in volume and a remarkable 22pc in value. This includes apps from commercial banks, branchless banking providers (BB-wallets), and electronic money institutions (EMIs). The average ticket size varies considerably between bank apps and e-wallets — highlighting their use across diverse income segments.\n\nInternet banking also showed robust growth, reaching 71 million transactions worth Rs9.6tr, largely driven by corporate and high-value payments. The number of internet banking users rose to 14.1m, reflecting increased trust in online banking infrastructure.\n\nSBP’s Raast Instant Payment System is proving to be a cornerstone in Pakistan’s digital payments revolution. The person-to-person (P2P) segment witnessed 368m transactions valued at Rs8tr, reflecting a 25pc increase in volume and 31pc in value quarter-over-quarter. The recently launched Raast P2M (person-to-merchant) service also gained momentum, crossing 700,000 onboarded merchants and processing Rs4.5bn in transactions.\n\nCard-based payments and e-commerce have shown a healthy growth. With 57.4m payment cards in circulation, of which 89pc are debit cards, 7pc are social welfare cards, and only 4pc are credit cards — a figure reflecting Pakistan’s conservative credit culture.\n\nE-commerce continues to thrive, with 213m online transactions, a 40pc increase in volume, and 34pc rise in value reaching Rs258bn. Interestingly, 94pc of these transactions were made through wallets or bank accounts, rather than cards — a pattern consistent with mobile-first markets like Indonesia and Kenya.\n\nWith expanding merchant digitisation, SBP’s emphasis on onboarding small merchants has paid off. Over 778,000 retail/Kiryana stores are now accepting digital payments via QR codes and wallets. During the last quarter, these merchants processed 22m payments worth Rs61bn, reflecting growing grassroots acceptance of digital finance tools.\n\nFurthermore, POS terminals rose to 179,383, enabling 99m transactions worth Rs550bn. While POS penetration in Pakistan is still lower than regional peers like Malaysia or Turkey, the quarterly growth of 8pc in value suggests significant latent potential.\n\nIn the area of large-value and OTC transactions, Pakistan’s Real-Time Gross Settlement System (RTGS), PRISM, processed Rs347tr in large-value transactions across 1.5m transactions. Customer-initiated RTGS payments account for the majority of the volume, but with government securities settlement dominating the value share.\n\nMeanwhile, bank branches and branchless banking agents remain essential for cash-based communities. These traditional channels handled 238m transactions of Rs116tr, providing vital services such as fund transfers, bill payments, and cheque settlements. However, a slow but visible migration to digital is evident.\n\nDespite these achievements, challenges persist. Digital literacy, low smartphone penetration in some regions, cybersecurity concerns, and patchy internet access continue to impede wider adoption. At the same time, the lack of Shariah-compliant offerings by some leading banks and branchless banking providers is also holding many retail and small merchants from adopting a digital path.\n\nGlobally, central banks are investing in open banking, central bank digital currencies (CBDCs), and interoperability protocols to create seamless, cost-effective financial ecosystems. For Pakistan, replicating models like India’s Unified Payments Interface (UPI) or the Nigerian Inter-Bank Settlement System (NIBSS) could enhance financial inclusion and reduce reliance on physical infrastructure.\n\nWith the help of focused policy support, public-private collaboration, and digital awareness campaigns, Pakistan can position itself as a leader in digital finance across South Asia.\n\nThe writer is the founding director of IBA CEIF & Group Head Meezan Bank\n\nPublished in Dawn, The Business and Finance Weekly, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:28:48.212Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929976/an-era-of-financial-transformation",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:12.000Z"
}
