{
  "title": "Punjab govt, Rawalpindi private schools at loggerheads over extended summer break - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Rawalpindi Education Authority has warned private schools not to end their summer breaks before September 1, 2025.\n\nThe education authority has established complaint cells in Rawalpindi, Gujar Khan, Kahuta, Kotli Sattian, Murree and Taxila, and has urged the public to notify the authority if any school opens on Monday (today).\n\nThe Punjab government has extended summer holidays for all public and private schools across the province until August 31, with institutions set to reopen on September 1st.\n\nAccording to the notification, all district education authorities (DEAs) have been instructed to ensure strict adherence to the revised schedule. The extension comes amid ongoing extreme weather conditions in the province.\n\nThis marks the second change to the academic calendar this summer. Parents and students are advised to note the new date, while school administrations are expected to adjust their academic plans accordingly.\n\nRawalpindi Education Authority CEO Tariq Mehmood told Dawn that teams have been formed to ensure full compliance with the orders of the Punjab government.\n\nHe stated that the authority would seal any school that opens prematurely and impose substantial fines on the management.\n\nHe added that the summer holidays were extended on the government’s instructions due to the heatwave in central and southern Punjab, as well as adverse weather conditions in the northern parts of the province.\n\nMeanwhile, President of the All Pakistan Private Schools Management Association (APPSCA) North Punjab, Abrar Ahmed Khan, told Dawn that the provincial government’s decision to extend summer holidays until August 31 was unjustified and unwise, and should be revoked immediately.\n\nMr Khan explained that the extended holidays have severely impacted students’ education. “Parents are also protesting against this decision by the Punjab Education Department, as they have been paying fees for the last three months. School administrations are still paying rent, utility bills, and staff salaries,” he said.\n\nHe further noted that private schools in Islamabad reopened on August 4, schools in Sindh on August 2, and institutions in other provinces are also resuming as usual.\n\nPresident of the APPSCA Central, Dr Malik Abrar Hussain, has strongly criticised the Punjab government’s extension of the summer holiday until September 1 as an illogical, anti-education and unjustified move.\n\nSchools must be opened before August 14, otherwise the already ruined education system in the country will lead to further backwardness, he said.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/08102911ac683ef.jpg?r=102937",
  "retrievedAt": "2025-08-16T07:27:30.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930095/punjab-govt-rawalpindi-private-schools-at-loggerheads-over-extended-summer-break",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:49:11.000Z"
}
