{
  "title": "Israel’s Gaza takeover plan risks another calamity: UN - World - DAWN.COM",
  "author": null,
  "content": "• 27 more killed on Sunday as UN Security Council holds ‘rare meeting’\n• Palestine envoy says over 2m victims enduring ‘unbearable agony’\n• British diplomat terms plan ‘path to more bloodshed’; Algeria seeks sanctions on Tel Aviv\n• Pakistan, Turkiye foreign ministers share concern over dire situation in besieged enclave\n• Netanyahu insists to go ahead with the Gaza plan despite protests\n\nUNITED NATIONS: A UN official on Sunday warned the Security Council that Israel’s plans to control Gaza City risked “another calamity” with far-reaching consequences, as criticism against Tel Aviv both at home and abroad intensified amid a famine risk in the besieged enclave.\n\nThe United Nations Security Council held a rare emergency weekend meeting after Israel said its military would “take control” of Gaza City in a plan approved by Prime Minister Benjamin Netanyahu’s security cabinet that sparked a wave of global criticism.\n\n“If these plans are implemented, they will likely trigger another calamity in Gaza, reverberating across the region and causing further forced displacement, killings, and destruction,” UN Assistant Secretary General Miroslav Jenca told the Security Council. The UN’s humanitarian office OCHA said 98 children had died from acute malnutrition since the start of the conflict in October 2023, with 37 of those deaths since July, according to Gaza’s authorities. “This is no longer a looming hunger crisis—this is starvation, pure and simple,” said OCHA’s coordination director Ramesh Rajasingham.\n\nPalestinian ambassador to the UN Riyad Mansour said “over two million victims are enduring unbearable agony,” calling Israel’s plans for Gaza City “illegal and immoral,” and for foreign journalists to be allowed into Gaza.\n\nIsrael’s offensive has killed at least 61,430 Palestinians. According to Gaza’s civil defence agency, at least 27 people were killed by Israeli fire across the territory Sunday, including 11 who were waiting near aid distribution centres.\n\nSanctions calls\n\nBritain, a close ally of Israel which nonetheless pushed for an emergency meeting on the crisis, warned the Israeli plan risked prolonging the conflict. “It will only deepen the suffering of Palestinian civilians in Gaza. This is not a path to resolution. It is a path to more bloodshed,” said British deputy ambassador to the UN James Kariuki.\n\nOutside the meeting at UN headquarters in New York, a small but noisy protest calling for an end to the conflict was met by a large police presence.\n\nThe United States, a veto-wielding permanent member of the Security Council, accused those nations who supported Sunday’s meeting of “actively prolonging the war by spreading lies about Israel”. “Israel has a right to decide what is necessary for its security and what measure measures are appropriate to end the threat posed by Hamas,” said US envoy to the UN Dorothy Shea.\n\nIsrael’s deputy ambassador to the UN Jonathan Miller said “pressure should not be placed on Israel…but on Hamas”. Algeria’s ambassador Amar Bendjama called for sanctions on Israel in response to its Gaza City plan. “The hour has come to impose sanctions on the enemy of humanity,” he said. “If it was another country, you would have been imposing sanctions a long time ago,” Palestinian envoy Mansour said.\n\n‘Dire humanitarian situation’\n\nMeanwhile, Pakistan expressed concern over the dire humanitarian situation in Gaza. Foreign Minister Ishaq Dar spoke with Turkiye Foreign Minister Hakan Fidan on Sunday, as both sides expressed grave concerns regarding the dire humanitarian situation in Gaza.\n\nFM Dar condemned the Israeli plan for a complete military takeover, calling it a flagrant violation of international law and UNSC resolutions, the Foreign Office spokesperson said in a statement. He also stressed the urgent need for providing unimpeded humanitarian assistance and an end to Israeli impunity, state-run APP reported.\n\nPolarised Israel\n\nMore than 22 months into the war, Israel is gripped by a yawning divide pitting those demanding an end to the conflict and a deal for the release of the prisoners against others who want to see Hamas vanquished once and for all.\n\nBut PM Netanyahu told journalists gathered for a rare press conference that “this is the best way to end the war, and the best way to end it speedily”. “I don’t want to talk about exact timetables, but we’re talking in terms of a fairly short timetable because we want to bring the war to an end,” he added.\n\nThe press conference came ahead of the UN Security Council meeting called to discuss the situation in Gaza and the new Israeli plan. It also came a day after thousands of people took to the streets in Tel Aviv to protest the security cabinet’s decision.\n\n“The new plan is just another plan that is gonna fail, and it could very well be the end of our prisoners, and of course, it will take probably more lives of our soldiers,” protester Joel Obodov told AFP.\n\nThe Israeli government has faced regular protests over the course of the war, with many rallies calling for a ceasefire and prisoner-release deal after past truces saw captives exchanged for Palestinian prisoners in Israeli custody.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689938690faa4.jpg",
  "retrievedAt": "2025-08-16T07:28:24.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930101/israels-gaza-takeover-plan-risks-another-calamity-un",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:28.000Z"
}
