{
  "title": "RSS, BJP plotted terrorist attacks in India, ex-RSS insider claims - World - DAWN.COM",
  "author": null,
  "content": "A FORMER Rashtriya Swayamsevak Sangh (RSS) insider has claimed that senior leaders from the RSS, Bharatiya Janata Party (BJP), Vishwa Hindu Parishad (VHP) and Bajrang Dal planned and executed deadly bombings across India from 2004 to 2008.\n\nIn an interview to The Wire, Yashwant Shinde alleged the plot was a calculated bid to inflame communal violence and kill thousands, only for the sake of political power.\n\n“This was a conspiracy by some people in the RSS, VHP, Bajrang Dal and BJP with extremely vile and perverse mindsets, solely for the sake of power,” Mr Shinde said. “They wanted to set the country on fire so that power would always remain with them.”\n\n“Politically in coma, they exp­loited Ayodhya for 82-84 seats in 1989, their eyes lit up and then Kashmir to repeatedly boost Atal Bihari Vajpayee to prime minister,” he said.\n\nSays Hindu-Muslims riots, attacks in Pakistan, and Kashmir were part of a plan to gain political power\n\nMr Shinde accused RSS leader Indresh Kumar of spearheading the plan, introducing him around 2000 to a group from Nanded and that group also underwent weapons training from the army, and there were plans to send them to Pakistan to attack civilians.\n\nHe claimed this group was training to build time bombs, with inst­ructions to target public gatherings like Muslim weddings and they went and committed these acts.\n\nMr Shinde recalled a bomb they were preparing accidentally exploded in Nanded in 2006, killing an RSS member. He alleged that those involved in the conspiracy included Rakesh Dhawde and Ravi Dev. Mr Shinde claimed operatives such as Pragya and Purohit were “pawns” who could be sacrificed to protect the real masterminds.\n\nMr Shinde, who joined the RSS in 1994, claimed he tried to derail the conspiracy from within but could not oppose it openly for fear of being killed.\n\nAfter the Supreme Court dismis­sed his petition seeking a new investigation, he decided to speak publicly.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/05/210807454a9e76d.png?r=080805",
  "retrievedAt": "2025-08-16T07:28:19.397Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930027/rss-bjp-plotted-terrorist-attacks-in-india-ex-rss-insider-claims",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:33.000Z"
}
