{
  "title": "Defending champs Sinner, Sabalenka make winning starts in Cincinnati - Sport - DAWN.COM",
  "author": null,
  "content": "CINCINNATI: Jannik Sinner and Aryna Sabalenka got their title defenses off to smooth starts as they powered into the third round of the ATP-WTA Cincinnati Open on Saturday.\n\nThe men’s and women’s top seeds, each ranked number one in the world, were both competing for the first time since Wimbledon — where Sinner lifted the title and as Sabalenka bowed out in the women’s semi-finals.\n\nSinner crushed Colombian Daniel Elahi Galan 6-1, 6-1 in steamy afternoon weather while Sabalenka beat 2023 Wimbledon champion Marketa Vondrousova 7-5, 6-1 under the lights of the night session.\n\nSabalenka needed 54 minutes and a service break in the final game to clinch the opening set with a stinging winner.\n\nThe second set was more of a grind than the score suggested as she saved five break points for a 4-1 lead and recovered from 0-30 down in the final game before securing the win.\n\n“It’s always a tough match against her,” Sabalenka said of the Czech opponent she has faced nine times.\n\n“She pushed me to the limit. If you lose focus even a little bit it can cost you a set. I had to fight for every point against her,” added Sabalenka, who next faces Britain’s Emma Raducanu, a 6-3, 6-2 winner over Olga Danilovic.\n\nMeanwhile Sinner outclassed Colombia’s Galan with 17 winners and just four unforced errors.\n\nSinner won the opening five games in 15 minutes as he allowed his 144th-ranked opponent, who came through qualifying, little breathing room.\n\nThe victory in 59 minutes was the fastest of Sinner’s ATP career, beating his previous quickest by one minute.\n\nSinner claimed his 22nd consecutive win on hardcourt, last losing the Beijing final in September to rival Carlos Alcaraz.\n\n“I didn’t know what to expect,” Sinner said of his return to tournament action. “I’m happy because it’s not easy to play here.\n\n“The ball is flying and you have to serve very precise if you want to go far in the tournament.\n\n“Today I was finding my spots but there is still a little room to improve. For a first match it could not have gone better.”\n\nAfter snapping up the first set Sinner broke to start the second before Galan clawed out a hold in a seven-minute game in which he fought off five break points.\n\nBut it was only a momentary reprieve. Sinner fired three aces to hold for 3-1 as he roared away again for the victory.\n\nFourth-seeded Amer­ican Taylor Fritz eased past qualifier Emlilio Nava 6-4, 6-4 and seventh-seeded Holger Rune won his opener 7-5, 7-6(7/5) over Russian Roman Safiullin.\n\nBut eighth-seeded Lorenzo Musetti and 11th-seeded Casper Ruud bowed out to French opponents.\n\nBenjamin Bonzi defeated Musetti 5-7, 6-4, 7-6(7/4) while Artur Rinderknech beat Ruud 6-7(5/7), 6-4, 6-2 — taking full advantage of Ruud’s 34 unforced errors.\n\nRinderknech was pleased with his success so far at his Cincinnati debut.\n\n“I stayed aggressive throughout the match,” he said. “You cannot let Casper start to dictate.”\n\nIn other women’s action, reigning Wimbledon champion Iga Swiatek earned an efficient opening win over Anastasia Potapova 6-1, 6-4.\n\nPoland’s Swiatek has reached the final four at the last two editions but Cincinnati remains one of the two 1000-level tournaments — along with Canada — where she has never played a final.\n\nThe third seed moved into the third round in just 74 minutes, saving four of the five break points she faced.\n\n“I wanted to play solid — but intense as well,” Swiatek said. “It was up and down in the second set. But in the important moments I got my level up to close out the win.”\n\nShe next plays Ukraine’s Marta Kostyuk, who she has defeated in all three previous meetings, in the third round of the US Open tune-up tournament.\n\nAustralian Open winner Madison Keys needed more than two hours to advance with a 1-6, 6-3, 7-6(7/1) over German Eva Lys, saving two match points at 5-6 in the deciding set.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68995ed77a2b6.jpg",
  "retrievedAt": "2025-08-16T07:27:06.871Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930138/defending-champs-sinner-sabalenka-make-winning-starts-in-cincinnati",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T03:08:00.000Z"
}
