{
  "title": "Trump’s 401(k) order offers retirement savers crypto, private assets - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: The new White House order directing regulators to expand access to alternative investments in 401(k) plans, like crypto or privately owned companies adds a new layer of risk to the retirement portfolios for ordinary investors that they may not fully understand, investment professionals say.\n\n“This is brand new; none of it has been stress-tested yet” in a market shock or long-term selloff, said Christopher Bailey, director of retirement, at Cerulli Associates, an asset management research firm. “There are liquidity concerns, issues around fees, among others.”\n\nWhile industry advocates and the Trump administration say investments in private equity, crypto or privately held companies like ChatGPT developer OpenAI or Elon Musk’s SpaceX hold the promise of greater returns, critics say the investments are inherently riskier, lack the same disclosures and carry higher fees than traditional retirement plans.\n\n“I don’t think people are talking enough about the potential for higher fees,” said Philitsa Hanson, head of product, equity and fund administration, Allvue Systems, a software and solutions provider for private asset managers.\n\nThe executive order, she said, “raises more questions than answers. Someone will need to be very thoughtful about how these types of assets can be incorporated” into 401(k) plans.\n\nPrivate equity and other alternative asset funds have increasingly been raising capital from wealthy individuals but are traditionally designed for institutional investors and typically include layers of fees. Private equity, for instance, has long had the “2 and 20” structure: managers collect a 2pc overall fee, as well as 20pc of any gains. In contrast, the mutual funds that today make up the lion’s share of 401(k) plan assets offer fees that average a mere 0.26pc, according to the Investment Company Institute.\n\nDmitriy Katsnelson, deputy chief investment officer at Wealthspire Advisors, which manages $30 billion for affluent and high net worth individuals and families, notes that if the executive order triggers a rapid and significant change in the menu of investment plans open to investors, that would reverse the trend of the last few decades.\n\n“It’s been all about cutting fees, doing no harm,” Katsnelson said. “It’s going to take a while for people to come up with a framework to make this work and think about the risks.”\n\nAlternative asset managers will likely need to come up with new products with lower fees, greater liquidity and more transparency if they want to tap into the trillions of dollars and 90 million investors in employer-sponsored retirement plans.\n\nJason Kephart, an analyst at Morningstar, said the fees for some alternative investments aren’t clearly spelled out, some even have to be deciphered from footnotes.\n\nThey “might be even underrepresenting the actual cost to the end investor, and I have a hard time seeing how plan sponsors are going to get comfortable with that,” he said.\n\n“I think there is going to be more light shed on all these fees and exactly where they are and make it transparent.” Under the current system, investors can also monitor fluctuations in their portfolio’s performance on a daily basis and understand precisely what is contributing to those results, Hanson said. That won’t be so easy for investments that aren’t traded on open exchanges.\n\n“Private equity, private assets are the opposite,” said Allvue’s Hanson. “You’re asking systems designed for daily trades to support illiquid and sometimes manually priced assets. There’s a fundamental mismatch there.\n\nThat creates an obligation on the part of asset managers and plan sponsors to increase their outreach and education efforts, suggests Cerulli’s Bailey.\n\nA typical retirement fund investor “is not sitting there thinking about optimizing their portfolio” and considering the impact of adding private assets to the mix on their risk or potential return, he said.\n\nBlackstone President and Chief Operating Officer Jon Gray recently told analysts that private assets are more appropriate for younger investors that have a longer investing horizon than for someone nearing retirement.\n\nPublished in Dawn, August 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:27:47.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930032/trumps-401k-order-offers-retirement-savers-crypto-private-assets",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T00:48:52.000Z"
}
