{
  "article_id": "2025-08-15_3856c15b5c324c53f1704d2f886d6e2e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-demands-equal-green-financing-in-global-plastics-talks/",
    "retrieved_at": "2025-08-17T20:12:46.159Z"
  },
  "metadata": {
    "title": "Pakistan demands equal green financing in Global Plastics Talks",
    "author": null,
    "date_published": "2025-08-15T19:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 15 (APP):Pakistan has taken the lead in rallying regional support for a fair and effective Global Plastics Treaty, calling for equitable access to green financing and technology for developing nations. Federal Minister for Climate Change and Environmental Coordination Dr. Musadik Malik chaired an interactive briefing with delegations from Bangladesh, Egypt, Tajikistan, Malaysia, and Sudan on the sidelines of the Fifth Session of the Intergovernmental Negotiating Committee on Plastic Pollution (INC-5.2) in Geneva. The session aims to finalise a landmark global agreement to curb plastic pollution. Dr. Malik warned that the world's poorest countries are being left behind in the fight against environmental degradation. \"Those responsible for the highest levels of plastic consumption are often the largest beneficiaries of green financing, while developing nations carry the heaviest burden of its environmental and socio-economic impacts,\" he said. He urged that the treaty must include commitments to technology transfer, capacity building, and financing mechanisms that prioritise the countries most affected by climate change and plastic pollution. \"Without fair access to resources and technology, developing nations cannot meet the environmental goals set by the global community,\" Dr. Malik added. The discussions in Geneva form part of an ongoing UN-led process to develop a legally binding instrument on plastic pollution by the end of 2025. Environmental experts say such an agreement could be a turning point in reducing the estimated 400 million tonnes of plastic waste produced globally each year. By pushing for a united regional stance, Pakistan aims to strengthen the negotiating position of developing countries and ensure that the treaty addresses both environmental and economic fairness.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}