{
  "article_id": "2025-08-15_3ee85947961d02acaf7f7e6edb9dbe84",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/naqvi-and-gregory-logerfo-agree-to-boost-pakistan-us-cooperation-in-security-counterterrorism/",
    "retrieved_at": "2025-08-17T20:12:04.171Z"
  },
  "metadata": {
    "title": "Naqvi and Gregory LoGerfo agree to boost Pakistan–US Cooperation in security, counterterrorism",
    "author": null,
    "date_published": "2025-08-15T23:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 226,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 15 (APP):Federal Interior Minister Mohsin Naqvi held a meeting with US Coordinator for Counterterrorism Gregory LoGerfo at Ministry of Interior in Islamabad. Minister of State for Interior Tallal Chaudhry, Acting US Ambassador Natalie Baker, and Federal Interior Secretary were also present on the occasion. Gregory LoGerfo congratulated Interior Minister Mohsin Naqvi and the people of Pakistan on the country's 79th Independence Day. During the meeting, both sides agreed to further enhance Pakistan-US relations especially in the areas of counterterrorism, border security, and Anti-narcotics. They also agreed to make the exchange of information more effective in the fields of counterterrorism and counter-narcotics. Interior Minister Mohsin Naqvi stated that since President Donald Trump's administration came into power, Pakistan-US relations have improved significantly. He commended President Trump's sincere efforts for global peace and noted that transparency, mutual trust, and cooperation are the hallmarks of the bilateral relationship. He emphasized that this is an excellent opportunity to further strengthen bilateral relations in all areas. Mohsin Naqvi added that counterterrorism dialogue will help in creating a joint strategy. He termed the US decision to designate the banned BLA and banned Majeed Brigade as Foreign terrorist organizations a commendable step, expressing hope that Pakistan-US cooperation will yield positive results in eliminating terrorism. Gregory LoGerfo acknowledged Pakistan's geo-strategic importance. He also expressed condolences over the loss of lives in terrorist attacks.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}