{
  "article_id": "2025-08-15_08aa5023082be8792d01424d4205197e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-orders-single-point-power-supply-for-all-sezs-industrial-estates/",
    "retrieved_at": "2025-08-17T20:12:28.264Z"
  },
  "metadata": {
    "title": "Govt orders single-point power supply for All SEZs, industrial estates",
    "author": null,
    "date_published": "2025-08-15T22:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 210,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 15 (APP):In a major step towards ease of doing business and boosting industrial productivity, the Power Division has ordered immediate implementation of a single-point electricity supply system for all Special Economic Zones (SEZs) and industrial estates across the country. The Ministry of Energy (Power Division) has directed all electricity distribution companies (DISCOs) to swiftly coordinate with the administrations of industrial zones and Special Economic Zones (SEZs) to implement a single-point electricity supply mechanism, in accordance with the recent NEPRA decision. The directive was issued by Federal Minister for Power, Sardar Awais Ahmad Khan Leghari, who instructed all DISCOs to finalize agreements with the concerned zone administrations without delay. Earlier, following Cabinet approval, the Power Division had submitted a formal request to NEPRA on February 25, seeking permission to provide power to these zones through a single-point connection. After detailed consultations, NEPRA granted approval on August 11 and directed that final agreements be reached with the respective zones. This move is aimed at simplifying the billing system, ensuring transparency, and reducing unnecessary interference and potential corruption in the electricity distribution process. The implementation of the single-point supply system is expected to significantly benefit industrial consumers by improving service delivery and enhancing investor confidence in SEZs and industrial estates nationwide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}