{
  "title": "Govt negotiation committee practically inactive & ineffective: Senator Irfan Siddiqui",
  "author": null,
  "content": "ISLAMABAD, Feb 08 (APP):Senator Irfan Siddiqui, the Parliamentary Leader of Pakistan Muslim League (Nawaz) in the Senate and spokesperson for the government’s negotiation committee, stated that the government negotiation committee has become practically inactive and ineffective.\nIn a statement posted on social media platform ‘X’ on Saturday, he said that whether formally dissolved or not, the government negotiation committee is now non-functional and ineffective.\nSenator Siddiqui mentioned that PTI unilaterally withdrew from the negotiation process and has also rejected the Prime Minister’s offer.\nHe added that PTI now intends to move towards violent protests on its home ground. He further stated that if PTI ever feels the need for negotiations again, the situation will be reconsidered.\nThis development highlights the ongoing political tensions and the challenges in fostering dialogue between the government and the opposition. The statement underscores the current impasse and the potential for further political instability if negotiations remain stalled.\nThe government’s negotiation committee, once seen as a crucial mechanism for resolving political disputes, now appears to be sidelined, raising concerns about the future of political dialogue in the country. As PTI shifts its strategy towards more aggressive forms of protest, the political landscape in Pakistan may face increased volatility in the coming days.\nThe situation remains fluid, and all eyes are on how both sides will navigate this critical phase in Pakistan’s political journey.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:30:08.073Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-negotiation-committee-practically-inactive-ineffective-senator-irfan-siddiqui/",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T18:39:00.000Z"
}
