{
  "title": "Dr Mukhtar appreciates PMDC’s initiatives",
  "author": null,
  "content": "ISLAMABAD, Feb 08 (APP):Coordinator to the Prime Minister on National Health Services, Regulations, and Coordination, Dr. Malik Mukhtar Ahmad Bharath has appreciated the reforms of Pakistan Medical and Dental Council (PM&DC) to enhance the standard of medical education.\nDuring visit to PM&DC, Dr. Malik Mukhtar Ahmad Bharath was given an in-depth briefing on the council’s current operations and its future plans for functional improvements.\nPM&DC President Prof. Dr. Rizwan Taj provided a comprehensive overview of the PM&DC ‘s recent strides in streamlining processes most notably, the accelerated issuance of teaching experience certificates.\nDr. Bharath was keen to understand the measures in place to resolve pending cases efficiently.\nProf. Dr. Rizwan Taj explained the rigorous procedures required for issuing teaching experience certificates.\nHe said that each certificate undergoes a meticulous, multi-step verification process including institutional verification in which certificates cannot be issued without clearance and confirmation from the institutions where the doctor has previously worked.\nHe added the case assessment of each application is unique even a single day of work is critically evaluated through detailed calculations and evidence-based verification.\nHe said that applicants submit a range of publications from a minimum of five to over 89 articles that are thoroughly reviewed for authenticity.\nDr. Mukhtar was informed that over the past 11 months, PM&DC has addressed a significant number of inquiries and emails from medical professionals.\nHe was informed that in addition to technological advancements, PM&DC has improved communication strategies by updating its website with dedicated staff contact numbers and streamlined helplines to better serve the community.\nDr. Mukhtar also visited the PM&DC IT department, where he examined the newly enhanced IT innovative initiatives and plans introduced to support PM&DC’s operational efficiency.\nHe was also apprised of the recently launched dedicated online portal designed to expedite the verification process and reduce the processing time for teaching experience certificates.\nDr. Mukhtar Bharath in a decisive move aimed at modernizing and streamlining operations at PMDC, expressed confidence on the ongoing initiatives of council and has issued a series of directives to accelerate the Council’s processes and ensured that the quality of medical education in Pakistan meets international standards.\nDr. Mukhtar after the visit and briefing outlined that PM&DC may alert the concerned institutes to complete the verification process promptly, ensuring a prompt and efficient evaluation of all cases.\nHe directed to take immediate action to dispose of pending applications.\nDr. Mukhtar emphasized the need for swift resolution to clear the backlog and improve service delivery.\nHe added that an emergency digitization of the PM&DC inspection system should be done to enhance transparency, accuracy, and accountability in the council’s operations.\nReaffirming the government’s commitment to quality, Dr. Mukhtar said, “The government is determined to elevate the quality of medical education in Pakistan to meet international standards.”\n“We will ensure effective measures for the improvement of medical education.”\nHe assured that the government will continue to work on new reforms in the health sector, promoting merit and transparency within the PM&DC and beyond.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:30:37.108Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dr-mukhtar-appreciates-pmdcs-initiatives/",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T13:51:00.000Z"
}
