{
  "title": "PPP ready to contest elections in Punjab, KP if PTI dissolves assemblies: Faisal Kundi",
  "link": "https://www.app.com.pk/national/ppp-ready-to-contest-elections-in-punjab-kp-if-pti-dissolves-assemblies-faisal-kundi/",
  "date_published": "2022-12-18T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection Faisal Karim Kundi on Sunday said that Pakistan Peoples Party (PPP) was ready to contest elections in Punjab and Khyber Pakhtunkhwa if Pakistan Tehreek-e-Insaf (PTI) dissolved assemblies in the two provinces.\n“PPP’s leadership, workers, and candidates are ready to contest elections in Punjab and KP as per the wish of PTI chairman”, he said during a news conference held here.\nFaisal Kundi said he would ask all the members of his party and collation parties to fulfill Imran Khan’s wish of conducting elections in the two provinces.\nCriticizing the PTI chairman for delaying the dissolution of assemblies, the SAPM said yesterday Imran Khan had given another date for dissolving assemblies, which was next Friday. “The decision of dissolving assemblies has not been implemented may be due to the unavailability of the architect and masons PTI has hired from different political parties,” he remarked in a satirical way.\nThe SAPM said the people of Pakistan were asking questions about the utilization of Rs 15 billion collected by Imran Khan for the flood-affected people.\n“Imran Khan could not get an FIR registered in his own governed province and protect the gifts of Toshakhana; how can he run a country,” he questioned.\nThe audio leaks of Imran Khan and his wife are also an eye-opener for the masses that how dishonest he is, he added.\nRobbers and thieves would be held accountable, Kundi said while indicating that more than half of the PTI candidates would contest elections from prisons whereas others might be get disqualified over corruption charges.\nThe SAPM said PPP has always respected the constitution and rendered sacrifices for ensuring true democracy prevails in the country.\nAbout the Foreign Minister’s response to India, he said, “The voice of Bilawal Bhutto Zardari is the voice of every Pakistani, Kashmiri, and staunch believer of democratic and human rights values.”\nHe said the way Bilawal Bhutto has shown a mirror to his Indian counterpart by giving befitting response to his allegations. His statement has received overwhelming support not only from people and human rights activists in Pakistan but also from India.\nHe said Bilawal Bhutto has represented Pakistan and its people belonging to all schools of thought as well as Kashmiri masses, however, PTI chairman remained silent at this time.\nFaisal Kundi said that Indian Prime Minister Narendara Modi was involved in the killings of Muslims in Gujrat and is replicating the same in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAbout the flood relief assistance disbursement, Faisal Kundi said that around 98 percent amount out of a total of Rs 70 billion has been disbursed among 2.8 million families while the rest of two to three percent is in process.\nHe said that recently, transgenders have been included in the Benazir Kafalat Programme for which the transgenders have to obtain CNIC from NADRA to be eligible for the said programme.\nHe said the team of Benazir Income Support Program (BISP) is working on the project of ‘dynamic survey’ which would be inaugurated by Prime Minister Shahbaz Sharif and Foreign Minister Bilawal Bhutto.\nTo a question, Faisal Kundi said Pakistan’s stance had been presented on international platforms in a weak manner in the past, however, Bilawal Bhutto has presented Pakistan’s stance in a very effective manner.\nTo another question, he said that PPP would present its stance to the coalition party members about the election.\nThe PTI government has failed in providing protection to the people of Khyber Pakhtunkhwa during their tenure while their police are busy giving protocol to the political personalities.\nHighlighting the poor law and order situation in KP, the SAPM mentioned the killing of four people in Lakki Marwat in a recent incident and attacks on polio workers which reflect the failure of the PTI government in KP.",
  "retrievedAt": "2025-08-11T16:02:06.092Z"
}
