{
  "title": "Bilawal asks UN to resolve issue of unsustainable debt of developing countries",
  "link": "https://www.app.com.pk/national/bilawal-asks-un-to-resolve-issue-of-unsustainable-debt-of-developing-countries/",
  "date_published": "2022-12-17T19:39:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Dec 17 (APP) Minister for Foreign Affairs Bilawal Bhutto Zardari Saturday called on the United Nations to seek solutions to resolve the issue of unsustainable debt and push for allocation of Special Drawing Rights (SDRs) to developing countries.\nSpeaking at the concluding session of G77 ministerial meeting at the United Nations here, he said during the last year the world and especially the developing countries had faced economic challenges because of the economic recession.\nThe war in Ukraine and accompanying restrictions caused a sharp spike in prices of essential commodities, he noted.“We must obtain solutions to the problems of unsustainable debt. We should secure the rechanneling of the unutilised SDRs to the developing countries and push for another round of general allocation of SDRs as proposed by our Secretary General.”\nHe drew attention to the escalating climate disasters affecting the most vulnerable countries such as the epic floods in Pakistan.Bilawal said it had become evident that the existing international system had been unable to respond to the plight of developing countries.\nHe said over a hundred countries faced financial collapse and over a billion people were hungry and destitute. During these difficult times the UN assumed the role and responded to the crises, he noted.\nHe commended the Secretary General United Nations for proposing the sustainable development goals stimulus initiative, initiating the Black Sea grain deal and for calling for the reform of the international financial architecture.\nHe said in the challenging times the group of 77 and China displayed exceptional unity and solidarity and made progress for the implementation of sustainable development goals and agenda 2030.\nThe group of 77 secured consensus on far-reaching resolutions on major economic, financial and environmental issues and at COP 27 against heavy odds “we achieved the establishment of the loss and damage financing arrangements and funds”.The minister said the deliberations of the four roundtables of G77 meeting further crystalized our priority goals and the means by which these could be achieved.These positions needed to be translated into concrete actions, including at the forthcoming SDG summit, at COP 28 and other high level meetings next year, he asserted.\n“We should adopt the UN tax convention as proposed by the Africa Group. We must insist on the development dimension of the global digital compact and we should ensure the early start of the loss and damage fund and its adequate resourcing.”“We must mobilise massive investment in sustainable infrastructure. These objectives should be promoted by the group and its member states at all relevant forums including the international financial institutions and the World Trade Organization.”Bilawal said the group of 77 could establish a mechanism to monitor the implementation and progress of its positions as this would enable it to engage more constructively and systematically during negotiations at various forums.",
  "retrievedAt": "2025-08-11T16:02:02.023Z"
}
