{
  "title": "Pakistan ready to respond with full force if provoked; DG-ISPR warns India",
  "link": "https://www.app.com.pk/national/pakistan-ready-to-respond-with-full-force-if-provoked-dg-ispr-warns-india/",
  "date_published": "2020-06-03T07:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP):Director General Inter Services Public Relations Major General Babar Iftikhar Wednesday said Pakistan Armed forces were prepared to respond India with full force if provoked.\nThe DG-ISPR said India was trying to set a stage for false flag operation against Pakistan by giving false and uproarious statements.\nIn coming few months India can do some adventurism, but Pakistan was ready to surprise India as it did last year, the DG-ISPR mentioned, giving a clear warning that there would be unintended and uncontrollable consequences if India provoked Pakistan.\nDuring an interview to a private TV channel, the DG ISRP warned India “not to play with fire”.\nHe said the Indian army always target civilian population along the Lone of Control, but in response Pakistan Army did not ever target civilian population across the border.\nFor the last few months, the situation at Line of Control (LoC) was not peaceful, however Pakistan Armed forces were giving befitting response to Indian army, and it had shot down Indian quad copters at the LoC.\nHe said Prime Minister Imran Khan and Chief of Army Staff (COAS) General Qamar Javed Bajwa had categorically said that without the settlement of disputes including that of Jammu & Kashmir, the relations between the two countries could not be normalized.\nHe said India was facing embarrassment at global level, and therefore it wanted to divert the world’s attention by trying to stage a false flag operation against Pakistan.\nThe DG-ISPR said the senior Indian military leadership leveled baseless allegations against Pakistan to use them as launching pad, however Pakistan Army invited United Nation’s observer missions, Indian and International media in the area who refuted the Indian claim.\nWe urge India to invite UN observer mission and independent International media to visit the Indian occupied Kashmir (IOK) which would clear the situation to the world, the DG-ISPR concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:14.611Z"
}
