{
  "title": "Sharif family reaping what it had sown: Farrukh Habib",
  "link": "https://www.app.com.pk/national/sharif-family-reaping-what-it-had-sown-farrukh-habib/",
  "date_published": "2020-06-03T04:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP):Parliamentary Secretary for Railways Farrukh Habib on Wednesday said the Sharif family was reaping what it had sown by looting and plundering the national wealth when in power.\nAddressing a joint press conference here with Minister for Information and Broadcasting Senator Shibli Faraz, he said Prime Minister Imran Khan had exposed the mafia, and the money plundered by the corrupt elements would be recovered and spent on the poor people.\nHe said it was ironic that former ‘accidental’ prime minister Shahid Khaqan Abbasi, who was facing liquefied natural gas (LNG) reference and Ahsan Iqbal, who possessed an Iqama (foreign country’s working permit) when he was a federal minister, were giving lectures on morality.\nThe Pakistan Muslim League-Nawaz’s (PML-N) ‘Aristotles’, he said, should reply to the question how Rs 17 billion was deposited in the accounts of Sharif family by their employees Masroor Anwar and Shoaib Qamar, whose personal salaries were mere Rs 18,000. The wealth of the family of PML-N President Shehbaz Sharif had multiplied by 800 times through telegraphic money transfers, he claimed.\nHe reminded Shahid Khaqan that he was rejected by the people of his constituency in Murree and was elected National Assembly member on a seat donated by the Sharifs in Lahore.\nFarrukh Habib said Salman Shehbaz and Ishaq Dar should return to the country to face cases against them.\nReplying to a question, he said the Pakistan Tehreek-e-Insaf government had disbursed cash assistance among the deserving families in a most transparent manner. On the contrary, he recalled, the former rulers had entered the names of undeserving people in the beneficiaries of Benazir Income Support Programme (BISP), which were removed by the present government from the list.\nHe said the PTI government added some 750,000 more families to the already existing data of 450,000 ones and provided them assistance after the outbreak of coronavirus.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:15.620Z"
}
