{
  "title": "Omar Ayub inaugurates Euro-IV & V fuel testing lab at HDIP",
  "link": "https://www.app.com.pk/national/omar-ayub-inaugurates-euro-iv-v-fuel-testing-lab-at-hdip/",
  "date_published": "2020-06-03T03:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 3 (APP):Minister for Petroleum Omar Ayub Khan on Wednesday inaugurated a Euro-IV and V standard fuel testing laboratory here at the Hydrocarbon Development Institute of Pakistan (HDIP), a body responsible to ensure provision of quality petroleum products across the country.\nThe facility has been set up in line with Prime Minister Imran Khan’s directives to ensure availability of high grade fuels conforming the latest vehicles and tackle environmental issues like smog & air pollution.\nFollowing the directives, a strategy was being worked out by the Petroleum Division to start import of the Euro-IV & V fuel besides producing it at local level. Currently, Euro-II & III standard petrol and diesel were available in the country.\nAfter inaugurating the lab, Omar Ayub in a brief media talk said new fuel standards would prove helpful in controlling environmental pollution and improving efficiency of diesel and petrol engines.\n“Adoption of high grade fuel standards and their usage in high-tech vehicles will help save foreign exchange due to their less consumption.”\nHe said the laboratory would analyze new fuel standards, implemented by the government aimed at providing good quality high-grade fuels to motorists.\n“The lab will test the imported as well as well locally produced fuels of the increased standards. It will check that the fuels were matching the approved standards or not,” he added.\nMeanwhile, the Petroleum Division in a news release said that it had earlier accorded approval to undertake a major upgradation plan for the HDIP. “This is in continuation of the Petroleum Division’s initiative to introduce international best practices in all its organisations.”\nThe plan envisaged upgradation of all petroleum testing facilities at Islamabad, Lahore, Karachi, Peshawar, Quetta and Multan. “The plan also includes getting ISO certification of Petroleum testing laboratory at Islamabad. The project will be implemented over a two year period at a cost Rs 303.698 million.”\nThe HDIP, a national petroleum Research & Development (R&D) organization, is performing quality control functions since its inception in 1975.\nEvaluation of local and imported crude oils, review of specifications of POL products were some of the HDIP’s main functions.",
  "retrievedAt": "2025-08-11T19:17:19.129Z"
}
