{
  "title": "Shehbaz Sharif’s mass transit projects providing relief to commuters amid high fuel costs",
  "link": "https://www.app.com.pk/national/shehbaz-sharifs-mass-transit-projects-providing-relief-to-commuters-amid-high-fuel-costs/",
  "date_published": "2023-04-15T09:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP): The mass transit system of Pakistan has witnessed a significant transformation during the one year of the government of Prime Minister Shehbaz Sharif with launch of several projects aimed at facilitation of general public.\nThe Metro Bus Service and the Green Line train services, launched during his tenure, are accommodating the commuters who are already facing the brunt of inflation and high fuel prices.\nWith inauguration of Islamabad Metro Bus Service by PM Shehbaz Sharif in April last year as his first development project, the country’s journey of progress resumed after the four-year rule by Pakistan Tehreek-e-Insaf.\nThe Islamabad Metro Bus Service project, which was due to become operational by 2018, faced a massive delay by the PTI government and was launched within five days after PM Shehbaz Sharif assumed his office.\nShehbaz Sharif during his tenure in Punjab as chief minister had also successfully initiated the mass transit projects in Lahore, Rawalpindi and Multan.\nFor this reason, he is regarded by the general public as the ‘pioneer of mass transit system’ in Pakistan.\nThis public bus system is providing a comfortable travel to commuters with regard to cost-efficiency and reduced time.\nThe Rawalpindi-Islamabad Metrobus is 83.6 km-long bus system operating between the twin cities. It consists of four routes, namely the Red, Orange, Blue, and Green Lines. The Red and Orange Lines have dedicated lanes with proper stations built along them, while the Blue and Green Lines currently run along the Islamabad Expressway and Srinagar Highway respectively, with regular traffic.\nThe Metrobus network’s Red Line stretches 22.5 kilometers between Pak Secretariat, in Islamabad, and Saddar in Rawalpindi. The second route, the Orange Line, stretches 25.6 kilometers between the Peshawar Morr Interchange and the Islamabad International Airport. In July 2022, the Green Line and Blue Lines were added to this Metrobus network.\nThis mass transit system uses e-ticketing and an Intelligent Transportation System, where the Red Line is managed by the Punjab Mass Transit Authority while the rest are being managed by the Capital Development Authority.\nThe commuters are getting facilities with an easy access to the buses coming after every five minutes and the shuttle by every 25 minutes.\nOn the directives of PM Sharif, the establishment of a metro bus station on the motorway for better connectivity is also in progress to enhance the benefit of service to a maximum number of people.\nAs per his vision, Shehbaz Sharif describes the mass transit systems a “way forward” to provide citizens with dignified, inexpensive, and environment-friendly transport service.\nHe has termed the capital’s first four-line interconnected bus service ‘a big relief for commuters’ of the twin cities dealing with high fuel prices.\n“A decent and on-time transportation service on regular basis is a service to common man,” he said, at the launch of the metro bus service in Islamabad last year.\nThe metro bus service is largely accomodating the common man, particularly students and workers plying on the routes.\nThe launch of the Green Line train service between Islamabad and Karachi in January this year is another feather in the cap of Shehbaz Sharif which adds to his list of development projects for the ease of general public.\nThe train, comprising modern coaches imported from China, stops at the stations of Rawalpindi, Chaklala, Lahore, Khanewal, Bahawalpur, Rohri, Hyderabad and Drigh Road, Karachi.\nThe turnaround time of the Green Line is 22 hours, which saves a plenty of time for the travelers.\nThe ticket covers breakfast, lunch, hi-tea, and dinner besides Wifi. Apart from this, a high-quality bedding and utility kits are also provided to the passengers.\nAccording to estimates, the train benefits around 2,200 passengers on daily basis from Islamabad to Karachi.\nThe Green Line project, which was initiated in 2016 during the tenure of then prime minister Nawaz Sharif, was delayed by the PTI government.\nOverall, the mass transit system launched by PM Shehbaz Sharif is providing services to the people in congested areas, ensuring frequent and fast routes.\nUnder his vision, his government plans to expand the network of mass transit system in other parts of the country with a sole aim to serve the masses.\nIn near future, the people of Islamabad will be able to avail the facility of electric buses for an intra-city commute.\nInitially the electric buses will be run on six different public transport routes.\nThe extended mass transit system in the country is expected to build thriving communities, create jobs, ease traffic congestion and promote a cleaner environment. Also, investment in public transportation will spur both local and the national economy.",
  "retrievedAt": "2025-08-11T08:19:03.010Z"
}
