{
  "title": "Celebrations mark 30 years of DAFI scholarship programme in Pakistan",
  "link": "https://www.app.com.pk/national/celebrations-mark-30-years-of-dafi-scholarship-programme-in-pakistan/",
  "date_published": "2022-11-15T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP):United Nations High Commissioner for Refugees (UNHCR), and Inspire Pakistan on Tuesday celebrated 30 years of the DAFI known by its acronym (Albert Einstein German Academic Refugee Initiative) scholarship programme for refugees in Islamabad.\nThe Albert Einstein German Academic Refugee Initiative (DAFI) scholarship programme has transformed the lives of over 2,800 refugee students across Pakistan since 1992, and over 21,500 learners around the world.\nThe German-backed programme provides scholarship opportunities for third level undergraduate students, majoring in fields including medicine, engineering, social and behaviour sciences, business administration, mathematics and computer sciences.\nThe DAFI scholarship programme contributes to the promotion of self-reliance of refugees by equipping them with the necessary skills, knowledge and professional qualifications for future employment. The programme is aimed at the development of highly qualified and skilled human resources that can play a vital role not only in Pakistan but also for the reconstruction of their country of origin.\n“By investing in education, students will contribute to the economy of their host country and support their communities once they return to rebuild their lives,” underscored UNHCR Representative to Pakistan, Noriko Yoshida. “By enabling refugees to fulfil their potential, the scholarship programme has a transformative effect and changes their lives forever.”\nThe scholarships are awarded on a competitive basis with regard to merit, excellence and financial need. The programme grants scholarships to deserving young refugees enrolled in recognised universities, colleges and polytechnics in Pakistan.\nIn 2022, half of the 175 scholarships were awarded to women, compared to a quarter previously. This increase followed intensive outreach efforts to refugee communities and awareness raising on women’s higher-level education opportunities and support available. In addition, a new two-year DAFI Bridge programme for science and technology aimed at women studying at higher secondary level was launched.\n“Education does more than teach academic skills – it provides students with a safe place to grow and learn life skills, such as cooperation, responsibility, and respect,” noted Qaiser M. Siddiqui, CEO of Inspire Pakistan, which is implementing the DAFI programme.\nJoining the celebrations was Ambassador of Germany to Pakistan, H.E. Alfred Grannas, Chief Commissioner, Saleem Khan, Commissionerate of Afghan refugees (CCAR), as well as members of the international community.\nNoting that the funding for the scholarship programme illustrates the commitment of Germany to supporting refugees and host communities, scholars were eager to convey their appreciation to Ambassador Grannas as well as to the Government of Pakistan and third level institutions across the country for the opportunity to continue their studies to third level.\n“DAFI has opened so many doors to me and many others,” concluded Marwah Sadat, a DAFI scholar and host for the event. “Thanks to the financial support of the scholarship programme, I could focus on my studies and achieve my dreams,” noted the bachelor’s graduate in Media Studies from Iqra National University, Peshawar.",
  "retrievedAt": "2025-08-11T15:53:10.701Z"
}
