{
  "title": "Morning physical activity is more beneficial than any other time of the day",
  "link": "https://www.app.com.pk/national/morning-physical-activity-is-more-beneficial-than-any-other-time-of-the-day/",
  "date_published": "2022-11-15T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP):Morning physical activity is associated with the lowest risk of heart disease and stroke, as per a new study, published in the European Journal of Preventive Cardiology. The findings were consistent regardless of total daily activity.\n“It is well established that exercise is good for heart health and our study now indicates that morning activity seems to be most beneficial,” said study author Gali Albalak of Leiden University Medical Centre, the Netherlands.\nThe study used data from the UK Biobank (a large-scale biomedical database and research resource). It included 86,657 adults between the ages of 42 and 78 who were free of cardiovascular disease at the start. The average age was 62, and 58 per cent were women, Medical Daily reported .\nOver the course of six to eight years, 2,911 participants developed coronary artery disease and 796 had a stroke, said the study.\nWhen peak activity times were compared over a 24-hour period, being most active between 8 a.m. and 11 a.m. was associated with the lowest risks of both heart disease and stroke.\nIn a second analysis, the researchers divided participants into four groups based on peak physical activity time – midday, early morning (8 a.m.), late morning (10 a.m.), and evening (7 p.m.).\nAfter adjusting for age and gender, participants who were most active in the early or late morning had 11 per cent and 16 per cent lower risks of incident coronary artery disease, respectively, compared to the reference group, the study added.\n“Our findings add to the evidence on the health benefits of being physically active by suggesting that morning activity and especially late morning, may be the most advantageous,” said Albalak.",
  "retrievedAt": "2025-08-11T15:53:04.895Z"
}
