{
  "title": "ECP directs PEC, Punjab to provide delimitation committees’ details for holding LG polls",
  "link": "https://www.app.com.pk/national/ecp-directs-pec-punjab-to-provide-delimitation-committees-details-for-holding-lg-polls/",
  "date_published": "2022-11-15T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): The Election Commission of Pakistan (ECP) on Tuesday directed the provincial election commissioner (PEC), Punjab to immediately forward the details about the appointment of delimitation committees and delimitation authorities to the commission for holding LG polls in Punjab as soon as possible.\nThe meeting chaired by Chief Election Commissioner (CEC) Sikandar Sultan Raja directed the provincial election commissioner to complete their feedback on the draft rules so that the necessary steps can be taken for immediately holding LG polls in Punjab.\nECP Secretary apprised the commission that the Punjab assembly has already approved the local government Bill 2021 on November 1, 2022.\nThe forum was apprised that the ECP had directed the provincial government on October 25, to provide election rules, number of union councils, other data and maps to the commission within a fortnight period to enable the commission to initiate the gigantic task of delimitation of constituencies in Punjab.\nThe meeting was told that the provincial government has forwarded the draft rules, however other necessary documents, data and maps have not yet been provided to the commission.\nThe ECP took strict notice and expressed its indignation over the delay by Punjab and observed that the commission has already completed the delimitation process twice.\nAnd expenditures incurred on the whole exercise has proved burden over the national exchequer. But the LG elections have not yet been held due to non-serious attitude of provincial government and repeated amendments in relevant laws.\nNow the ECP will have to conduct delimitation of constituencies for third time. The commission decided to summon Punjab minister for local government, chief secretary and provincial secretary local government as soon as possible. The forum said the ECP was bound to conduct the LG polls within a period of 120 days of the end of tenure of the previous local government.",
  "retrievedAt": "2025-08-11T15:53:08.644Z"
}
