{
  "title": "U.S. govt supports more than 6,000 Pakistani Small and Medium Enterprises",
  "link": "https://www.app.com.pk/national/u-s-govt-supports-more-than-6000-pakistani-small-and-medium-enterprises/",
  "date_published": "2022-11-15T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP):The United States (U.S) government, through the United States Agency for International Development (USAID), celebrated the successful conclusion of its six-year-long Small and Medium Enterprise Activity (SMEA) at a ceremony organized here on Tuesday.\nThe event, which coincided with Global Entrepreneurship Week, recognized the achievements of Pakistani entrepreneurs who received funding and support under SMEA to establish and expand their small and medium enterprises (SMEs), said a press release.\nThrough SMEA, the U.S. government supported Pakistani entrepreneurs to overcome challenges, secure private sector funding, and strengthen their businesses.\nEntrepreneurship and innovation help boost employment, productivity, and trade, as well as drive a nation’s economy. Over the past six years, this USAID-funded activity has supported more than 6,000 SMEs and awarded grants to 141 SMEs, generating $158 million in revenue, leveraging $51.5 million in private sector investment, and increasing exports by $74 million.\nOut of the 6,000 SMEs that SMEA supported, 28 per cent were women-owned. SMEA also created almost 48,900 jobs, of which 30 per cent were filled by women.\nSMEA was part of U.S. assistance to Pakistan intended to increase private sector-led inclusive economic growth by improving the business-enabling environment and increasing employment opportunities. Through its various initiatives, SMEA improved the competitiveness of Pakistani SMEs in target sectors including agribusiness, information and communications technology, textiles, hospitality, logistics and packaging, light engineering, and women-led businesses.\nSpeaking at the event, USAID Pakistan Mission Director Reed Aeschliman said, “I am happy to see that the small seeds we planted through USAID SMEA’s grants and business development programs have transformed ideas into profitable realities and innovative solutions for generations to come.\nThe U.S. and Pakistan have been development partners for 75 years. We share a vision for a thriving private sector, improved business practices, strong business-to-business linkages, pro-business policy reforms, skilled human resources, and increased access to capital. SMEA is a direct reflection of this vision. USAID SMEA demonstrated that such measures can go a long way in helping SMEs achieve their full potential.”\nThe U.S. government, through USAID, supports private sector-led economic growth in Pakistan to create jobs, foster entrepreneurship, and increase economic opportunities.\nAs a part of the U.S. government’s long-term commitment to helping Pakistanis secure a more prosperous future, SMEA has successfully improved the environment for private sector-led growth and strengthened the financial and operational performance of businesses.",
  "retrievedAt": "2025-08-11T15:53:06.485Z"
}
