{
  "title": "SC issues notices to Imran Khan, others in ECP contempt case",
  "link": "https://www.app.com.pk/national/sc-issues-notices-to-imran-khan-others-in-ecp-contempt-case/",
  "date_published": "2022-11-15T07:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): The Supreme Court on Tuesday issued notices to Pakistan Tehreek-e-Insaf (PTI) Chairman and former Prime Minister Imran Khan, Asad Umar and Fawad Chaudhry in the contempt of Election Commission case.\nA three-member SC bench comprising Chief Justice Umar Ata Bandial, Justice Ayesha A Malik and Justice Athar Minallah heard the case filed by the Election Commission of Pakistan (ECP) to transfer all its contempt cases against PTI leaders from different high courts to a single one.\nDuring the course of proceedings, the bench remarked that the Election Commission requested to transfer the cases pending in different high courts to one high court. The Election Commission was of the opinion that they should prepare for local and general elections or had to fight cases in different courts, it added.\nThe Chief Justice said that the Election Commission also presented a judicial precedent of merging cases with the order of the Supreme Court. The Election Commission is relying on Article 186A, he added.\nHe asked was there an example of the decision of the Supreme Court to merge the cases of different high courts?\nThe ECP counsel responded that the Supreme Court ordered consolidation of income tax cases pending in various high courts in 1999.\nUpon this, the Chief Justice said that clubbing of cases pending in different high courts must have the same point of law.\nHe asked who were the petitioners in contempt of Election Commission cases in the high courts?\nThe counsel replied that Imran Khan, Fawad Chaudhry and Asad Umar had filed cases against the Election Commission in the different high courts.\nJustice Ayesha A Malik said that the Supreme Court in the PEMRA cases had declared that the high court cases would continue and would not be clubbed.\nJustice Athar Minallah said that the Supreme Court had clubbed all the cases of the high courts in Hajj assistants case.\nThe ECP counsel said that the cases of the same nature would have conflicting judgments in different high courts.\nJustice Ayesha said that the apex court would decide when the conflicting decisions challenged before the Supreme Court.\nThe Chief Justice asked under which constitutional authority did the Supreme Court order clubbing of cases pending in the different high courts?\nThe counsel said that the injunctions of the high courts in the contempt of Election Commission case had also been challenged in the Supreme Court.\nThe court directed that the ECP petitions against the injunction of the high courts should also be fixed with this case.\nSubsequently, hearing of the case was adjourned for two weeks.\nThe ECP in its petition had stated that it had issued contempt notices to PTI chairman Imran Khan as well as other party leaders including Asad Umar, Fawad Chaudhry in the months of August and September. However, these notices were challenged in high courts.\nThe ECP noted that under Section 10 of the Election Act, 2017, it had the authority to initiate contempt proceedings being a constitutional body.\nThe commission further stated that Imran and Fawad had challenged the contempt notices before the Lahore High Court’s Rawalpindi bench while Asad Umar had challenged it before the Sindh High Court. Another one was challenged before the Islamabad High Court.",
  "retrievedAt": "2025-08-11T15:53:12.573Z"
}
