{
  "title": "IAEA-PAEC Regional Training Course inaugurated",
  "author": null,
  "content": "ISLAMABAD, May 26 (APP):A five-day Regional Training Course (RTC) on the Clinical Application of Theranostics, jointly organized by the International Atomic Energy Agency (IAEA) and the Pakistan Atomic Energy Commission (PAEC), commenced in Lahore on Monday.\nThe initiative is part of the ongoing collaboration between IAEA and PAEC to promote the peaceful use of nuclear science and technology, especially in cancer diagnosis and treatment, said a news release.\nThe participants from ten countries, including Bangladesh, China, Indonesia, Malaysia, Mongolia, Nepal, Philippines, Thailand, Vietnam, and Pakistan, are attending the RTC to share experiences and knowledge. Nuclear medicine experts from Brazil, Australia, Germany, and South Africa will provide both theoretical and practical training to the course participants.\nThe training will be beneficial for patients by reducing the suffering associated with cancer, said Dr. Masood Iqbal, Member Science, Pakistan Atomic Energy Commission, while addressing the inaugural session as chief guest.\nHe stated that PAEC operates 20 cancer hospitals across the country, which provide state-of-the-art diagnostic and treatment facilities, serving nearly 80% of the country’s cancer patients. Dr. Masood further added that Atomic Energy Cancer Hospital (AECH) INMOL was the first to introduce theranostics in cancer care, and the facility has since been extended to five other PAEC hospitals in Pakistan. He highlighted that advanced diagnostic and treatment technologies, such as PET-CT, Linear Accelerators, and CyberKnife, are available at several flagship PAEC hospitals. He expressed gratitude to the IAEA for the opportunity to host this regional training course. With reference to PAEC’s contributions to Pakistan’s cancer health sector, he also mentioned that PAEC is producing radioisotopes at at PINSTECH, Islamabad which are used for cancer diagnosis and treatment.\nHe also thanked the international participants for visiting Pakistan and expressed hope that the knowledge gained would be shared in their respective countries.\nHe said the participants would serve as ambassadors of goodwill, carrying back memories and experiences of their stay in Pakistan.\nDr. Arzoo Fatima Saleem, co-director of the course, introduced the contents and learning objectives of the RTC.\nCourse Director, Dr. Irfan Ullah Khan, presented details of Project RAS 6105 and explained the rationale behind this IAEA initiative. He shared that out of the four RTCs to be organized under this project, the second is currently in progress. He also elaborated significant developments in expert mission visits and participation in TC-sponsored international symposia.\nDr. Amira Shami, Director INMOL, welcomed the participants and expressed pride in hosting the training course under the IAEA umbrella. She said, “We are proud to be a partner in this collaboration with IAEA.” Dr. Amira also emphasized that INMOL has been a pioneer in PET and Theranostics not only in Pakistan but also in the region. She appreciated the IAEA’s valuable role in promoting regional collaboration, particularly through its Technical Cooperation Programme, which has greatly contributed to INMOL’s growth. She emphasized the accomplishments of the Atomic Energy Cancer Hospital (AECH) INMOL and the 19 cancer care hospitals operated by PAEC across Pakistan.\nIt is worth highlighting that INMOL has played an exemplary role in the clinical application of Theranostics.\nThe RTC particularly focuses on the use of Gallium-68 (Ga-68), Lutetium-177 (Lu-177), and Actinium-225 (Ac-225) radiotracers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:53:51.295Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iaea-paec-regional-training-course-inaugurated/",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T12:39:00.000Z"
}
