{
  "title": "4.6m students receive training in High-Demand freelancing skills: IT committee told",
  "author": null,
  "content": "ISLAMABAD, May 26 (APP):The Standing Committee on Information Technology and Telecommunication was informed on Monday that a total of 4.6 million students have received training through 19 batches under 15 of the most in-demand freelancing courses.\nThe meeting, chaired by Syed Amin ul Haq, was briefed by Ignite officials, who stated that 28% of the trained individuals were female, while 72% were male.\nIgnite further informed the Committee, according to a survey conducted in October 2024, freelancers and trainees who underwent training under Ignite’s programs collectively generated revenue amounting to USD 1.65 billion.\nAdditionally, Ignite revealed that it has introduced 10 new courses, bringing the total number of offerings to 25, including programs related to Artificial Intelligence (AI).\nThe Committee directed Ignite to submit a district-wise list of student enrollments from Balochistan under these training programs.\nRegarding gender representation, the Committee urged Ignite to increase female participation from the current 28% to at least 50% to ensure greater inclusion and empowerment of women in the national workforce.\nThe Committee also expressed concern over the absence of the CEO of PTCL during the meeting. It was brought to the Committee’s attention that PTCL is planning to sell certain properties, including some high-value assets.\nThe Committee directed PTCL to present the specific clauses in its sales and purchase agreements that authorize the company to proceed with these property sales.\nFurthermore, the Committee instructed that in the next meeting, it must be ensured that the CEO of PTCL appears before the Committee to respond to its queries.\nThe Committee re-appointed the Sub-Committee under the convenership of  Gohar Ali Khan, maintaining the same composition and Terms of Reference.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:53:51.298Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/4-6m-students-receive-training-in-high-demand-freelancing-skills-it-committee-told/",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T12:56:00.000Z"
}
