{
  "title": "PM, Iranian President resolve to enhance cooperation, work for regional peace, security",
  "author": null,
  "content": "TEHRAN, May 26 (APP):Prime Minister Muhammad Shehbaz Sharif and Iranian President Masoud Pezeshkian during wide ranging talks on Monday resolved to enhance cooperation to boost bilateral trade and investment and work together for maintaining peace and security in the region.\nWhile talking to media at Sa’dabad Palace here after the delegation level talks, the Prime Minister said he had a productive and useful meeting with the Iranian President, covering all areas of mutual interest and cooperation.\n“There was total agreement that the two brotherly neigbouring countries must enhance cooperation in diverse fields including trade, investment and economy,” he added.\nThe Prime Minister said Pakistan and Iran had deep rooted cultural and historical relations. “We have decided to transform these relations into a very productive cooperation in various fields of life.”\nHe said, “I also took this opportunity to thank the President for calling me and showing his concern on the evolving situation in the sub-continent a few weeks ago.”\n“I deeply appreciate your sense of concern and brotherly feelings for the people of Pakistan and your ardent desire that this crisis comes to a grinding halt instead of escalating further,” he told the President.\nHe said his government had the opportunity to have extensive discussions with the Iranian foreign minister who visited Pakistan some time back.\nHe said Pakistan came out of the crisis with India as victorious because of the brave actions of our outstanding armed forces strongly supported by the people of Pakistan.\n“We wanted peace. We want peace and we will work for peace in the region through talks on the table and resolve our outstanding issues including Kashmir problem according to the United Nations Security Council resolutions which were\nacknowledged even by the Indian Lok Sabha when Nehru was the prime minister of India.”\n“We are ready to talk for the sake of peace on different issues including water, trade and also counter terrorism if India is serious,” he informed.\nThough he reaffirmed that if India remained aggressive then Pakistan shall defend its sovereignty and territory integrity.\n“If they accept our offer we want to talk for the sake of peace,” he reiterated.\nThe Prime Minister said Pakistan condemned Israeli actions causing untold misery for the people of Gaza, where more than 50,000 Palestinians were murdered by Israel and the bloodbath still continued.\nHe said, “It is high time that the international community uses its influence to bring lasting ceasefire in Palestine. Pakistan stands by its brothers and sisters in Iran to promote peace, progress and prosperity.”\nHe said Pakistan fully supported Iran’s right to have civilian nuclear programme. He assured that Pakistan would work with Iran on all issues of mutual concern.\nWhile welcoming the Prime Minister and his delegation, the Iranian President said Pakistan was an important neighbouring country and both countries enjoyed centuries old historical, cultural and civilizational links.\nHe said Pakistan and Iran shared common stance on important regional and international issues on different platforms including the Organization of Islamic Cooperation (OIC).\nDuring the meeting, the two sides discussed expansion of bilateral relations in different areas including politics, economy and international cooperation, and agreed to continue implementing already signed agreements, he explained.\nThe Iranian President said the two countries should cooperate on making their borders secure from the activities of terrorists and criminal groups.\n“Peace and stability in Pakistan is in the interest of Iran. We believe that sustaining security and maintaining friendly and peaceful relations with neighbouring countries is in the interest of the two countries,” he continued.\nPresident Pezeshkian said Iran welcomed the ceasefire between Pakistan and India, adding settling issues through dialogue was essential for stability in the region.\nHe said, “We believe that for ensuring security and stability in the region, neighbouring countries should hold dialogue and have positive consultations among each other and with the international partners.”\nHe said the two sides discussed issues facing the Islamic world and the top priority was the issue of Palestine.\n“As always we support the cause of Palestine and condemn the atrocities carried out by Israel,” he added.\nEarlier on his arrival, the Iranian President warmly received the Prime Minister and his delegation.\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Chief of Army Staff Field Marshal Syed Asim Munir, Minister for Information and Broadcasting Attaullah Tarar and Special Assistant to Prime Minister Tariq Fatimi accompanied the Prime Minister.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:54:42.553Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-iranian-president-resolve-to-enhance-cooperation-work-for-regional-peace-security/",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T15:52:00.000Z"
}
