{
  "title": "Minister visits FGEHA",
  "author": null,
  "content": "ISLAMABAD, May 26 (APP):Federal Secretary for Housing & Works, Hamid Yaqoob Sheikh, paid a visit to the Federal Government Employees Housing Authority (FGEHA) on Monday.\nHe was warmly received by Director General (DG) Captain (Retd.) Muhammad Zafar Iqbal and senior officers of the Housing Authority.\nThe Director General briefed the Federal Secretary on the ongoing and completed projects of the Housing Authority.\nOn this occasion, all directors of the Housing Authority, including Director Administration, Director Staff,  Director Technical, and all other Directors were present.\nDG Captain (Retd.) Muhammad Zafar Iqbal stated that FGEHA is committed to ensuring the provision of housing to government employees before their retirement. In this regard, FGEHA has launched excellent housing projects, which include the construction of high-rise buildings under the vision of the Prime Minister of Pakistan. This initiative aims to address housing shortages and implement the urban development policy effectively.\nKeeping in view the Prime Minister’s vision, FGEHA has accelerated the pace of development work in various sectors to ensure the provision of modern facilities to allottees in a short time.\nOn this occasion, the Federal Secretary appreciated the efforts of DG FGEHA Captain (Retd.) Muhammad Zafar Iqbal and his senior officers.\nHe emphasized the importance of timely completion of projects so that federal employees can fulfill their dream of owning a home. He praised the Housing Authority for successfully executing development projects in a short span of time.\nThe Federal Secretary assured DG FGEHA and his team of full support and cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:54:17.242Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/minister-visits-fgeha/",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T18:34:00.000Z"
}
