{
  "title": "Pakistan, Azerbaijan reaffirm commitment to further strengthen bilateral ties",
  "link": "https://www.app.com.pk/national/pakistan-azerbaijan-reaffirm-commitment-to-further-strengthen-bilateral-ties/",
  "date_published": "2024-05-30T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): Pakistan and Azerbaijan on Thursday expressed strong commitment to further strengthen bilateral strategic relations and broaden the scope of cooperation in all areas of mutual interest including trade, investment, energy, security and defence, education, climate action and regional connectivity.\nThe commitment was expressed during a meeting between Deputy Prime Minister and Foreign Minister Ishaq Dar and Foreign Minister of Azerbaijan Jeyhun Bayramov here.\nBoth the ministers reviewed the progress on bilateral relations and exchanged views on regional and global developments.\nForeign Minister Bayramov is visiting Pakistan from May 29-30, 2024 on the invitation of the Deputy Prime Minister. In the meeting, they also agreed to enhance parliamentary exchanges, strengthen cultural cooperation and promote people-to-people exchanges including students, academia and businessmen.\nThe two sides agreed to identify new areas of economic cooperation and bolster cooperation in climate action and renewable energy sector besides increasing bilateral investments especially in the energy sector.\nThey also noted the critical importance of Joint working Group on Energy in promoting cooperation in the power  sector. The Deputy Prime Minister and Foreign Minister expressed Pakistan’s full support to Azerbaijan during its presidency of COP29.\nBoth sides high officials also discussed bilateral cooperation at multilateral fora and regional and global developments including the situation in Illegally Indian Occupied Jammu and Kashmir (IIOJK).\nThe deputy prime minister congratulated Foreign Minister Bayramov on Azerbaijan’s principled stance on the Jammu and Kashmir dispute and congratulated Azerbaijan on restoration of its sovereignty over the Karabakh region.\nThe two sides also agreed to work together in the framework in OIC and ECO.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:50:37.444Z"
}
