{
  "title": "Roshan Pakistan programme to end energy crisis: Awais Laghari",
  "link": "https://www.app.com.pk/national/roshan-pakistan-programme-to-end-energy-crisis-awais-laghari/",
  "date_published": "2024-05-30T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): Federal Minister for Energy”Power Division” Awais Ahmad Khan Laghari on Thursday said that the ‘Roshan Pakistan’ programme will eliminate the energy crisis in the country.\nWhile holding a press conference with Minister of State Ali Pervaiz Malik in Islamabad, Federal Energy Minister Awais Laghari said that the electricity demand was 25,820 megawatts across Pakistan on May 29, of which 21,588 megawatts have been produced and supplied from within our system. However, he said 4,232 MW was the load shedding.\nHe said that this load shedding was done only on those feeders, where losses are occurring. “From 20 per cent to 100 per cent where our losses are occurring, 4,232 megawatts of electricity was not provided there” he added.\nAwais Laghari said that where the losses are less than 20%, unfortunately, the power supply to these feeders also remained off for a few hours.\nThe Federal Minister of Energy said that if they start supplying this electricity to these areas, the losses will increase to such an extent that the Pakistani economy will be further destroyed. “Until our distribution companies determine their direction and address these losses with the help of provincial governments, this load shedding will continue” he informed with certainty.\nHe said that more steps are being taken in the energy sector including elimination of load shedding and electricity theft. He said that the Roshan Pakistan programme will end the energy crisis by showing the data on the demand and supply of each feeder.\nHe said that reforms in the energy sector with the help of provincial governments are indispensable. The federal minister further said that they have contacted the provinces and told them to set an example in preventing electricity theft.\nLet me give you an example of my area, the minister stated, “A place in Dera Ghazi Khan has only three hours of electricity in 24 hours” and added, “It is very easy for me to provide full-time electricity there but we preferred principle over politics”.\nHe said that reforms in the energy sector with the help of provincial governments are inevitable, adding, action will be taken in areas where electricity is stolen and those who are involved in this malpractice would be punished.\nAwais Laghari said that he took strict measures to prevent electricity theft in his constituency and the people involved in electricity theft were also arrested in Dera Ghazi Khan. He said that the Khyber Pakhtunkhwa government has assured that they will provide assistance to reduce electricity theft and a proposal is being prepared with them in this regard.\nThe minister said that the complaints related to the overbilling of consumers are being redressed. He said that the DISCOs will share daily electricity demand and supply data which will help in controlling load shedding problems.\nHe said that there are many defects in the distribution sector, adding, there will be no compromise regarding governance in electricity companies.\nNew boards of electricity companies will come in next week, he added.\nAwais Laghari said that there is no shortfall of electricity in the country at present, 7000 megawatts of electricity is being generated from water. He said, “We have plenty of electricity and transmission capacity”.\nTo a question, he said that our weakness was in the arbitration court case against NTDC.\nThe federal minister said that such systems have not been implemented through which information reaches the public, tomorrow or the day after tomorrow, each DISCO will present the details of electricity transmission and demand of load-shedding.\nAwais Laghari said that data used to be presented on Roshan Pakistan, now that data will be restarted under this program.\nHe said the power supply in the areas with losses will increase the power circular debt a lot, the losses in 1978 feeders in LESCO are 10 per cent and load shedding was also done on these feeders yesterday which is not acceptable.\nThe reason for the load shedding is the incompetence of the DISCOs, the CEOs of the DISCOs have been warned that action will be taken against them if the service level is not improved, he said.\nIn response to a question, he said that a high-level committee has been set up to investigate the scams in the purchase of coal, which includes the ministers of finance, petroleum and defence and the committee has started its work in this regard.\nTo another question regarding net metering, he said that net metering policy will continue.\nMinister of State for Power Division Ali Pervaiz Malik said that the Prime Minister has directed them to work hard to provide relief to the people. He said that if load shedding is to be ended, then the government should help.\nThe government will make the electricity generated at a low cost accessible to the people because the leadership of the Muslim League-N is determined to provide facilities to the people. He said that he has held a detailed meeting with the heads of all the distribution companies for improvement in this sector.",
  "retrievedAt": "2025-08-11T02:49:24.884Z"
}
