{
  "title": "Pakistani cricket players to bring World Cup with hard work: Mohsin Naqvi",
  "link": "https://www.app.com.pk/national/pakistani-cricket-players-to-bring-world-cup-with-hard-work-mohsin-naqvi-2/",
  "date_published": "2024-05-30T16:13:00.000Z",
  "source": "APP",
  "content": "LONDON, May 30 (APP): Interior Minister and Chairman Pakistan Cricket Board (PCB), Mohsin Naqvi on Thursday hoped that the World Cup would come to Pakistan with hard work of Pakistani cricket team.\nAddressing a reception hosted by the Pakistan’s High Commissioner in the UK, Dr Mohammad Faisal in honour\nof the Pakistan Men’s Cricket Team and the management at Pakistan House, London, Mohsin Naqvi said that entire cricket team of Pakistan was giving their best to the game. He urged the Pakistan’s fans to keep supporting the team on their upcoming tour to the United States of America.\nThe PCB chairman said that team management was independent in making decisions about players which he added important for delivering good performance.\nMayor of London, Sadiq Khan on the occasion stated that he was very happy to welcome Pakistan Cricket Team at London and wished them best of luck for upcoming matches. He said that Babar Azam was his favourite batsman and hoped the team would win in Babar’s captaincy.\nWelcoming the team, Dr Mohammad Faisal said that Pakistani diaspora in UK was waiting for Pakistani team’s tour to England. He said that team’s presence in United Kingdom was uniting the cricket loving communities.\nThe High Commissioner wished the team best of luck for the upcoming matches.\nPakistan Cricket team players and management thanked the High Commission and Pakistani diaspora in UK for expressing unprecedented support and the warm welcome.\nChief Minister Balochistan, Sarfraz Ahmed Bugti, former Caretaker Prime Minister Anwaar-ul-Haq Kakar, UK’s High Commissioner to Pakistan, Jane Marriott, Pakistani cricket legends and a large number of Pakistani diaspora in London also attended the reception.",
  "retrievedAt": "2025-08-11T02:50:14.744Z"
}
