{
  "title": "PM for mutually beneficial stronger Pakistan-Azerbaijan trade, investment ties",
  "link": "https://www.app.com.pk/national/pm-for-mutually-beneficial-stronger-pakistan-azerbaijan-trade-investment-ties/",
  "date_published": "2024-05-30T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Prime Minister Shehbaz Sharif on Thursday, expressing satisfaction on the positive trajectory of relations between Pakistan and Azerbaijan, stressed the need to further strengthen mutually beneficial bilateral cooperation in trade, investment, energy and security domains.\nHe was talking to Foreign Minister of Azerbaijan Jeyhun Bayramov, who paid a courtesy call on him at the Prime Minister’s House.\nThe prime minister expressed appreciation that both sides had always extended their full support to each other on issues of core interest, and reaffirmed that they would continue to do so at every international forum.\nHe felicitated Foreign Minister Bayramov on Baku’s selection as the host city for COP29 to be held in November this year and said that Pakistan would work closely with Azerbaijan to ensure the successful outcome of that important event.\nFondly recalling his productive and fruitful interactions with President Ilham Aliyev during his visit to Baku in June last year, the prime minister reiterated his invitation to the Azerbaijan’s president to undertake an official visit to Pakistan later this year.\nThe Azeri foreign minister thanked the prime minister for receiving him and briefed him on the discussions held between the two foreign ministers earlier in the day.\nHe also conveyed warm greetings of the Azerbaijan’s leadership to the prime minister and assured him of his country’s strong desire to further solidify its ties with Pakistan.\nForeign Minister Bayramov is visiting Pakistan at the invitation of Deputy Prime Minister and Foreign Minister Senator Muhammad Ishaq Dar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:49:46.847Z"
}
