{
  "title": "NCSW, UN Women launch National Report on the Status of Women",
  "link": "https://www.app.com.pk/national/ncsw-un-women-launch-national-report-on-the-status-of-women/",
  "date_published": "2024-05-30T17:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): The National Commission on the Status of Women (NCSW), in collaboration with UN Women, has officially launched the National Report on the Status of Women (NRSW) for the year 2023.\nThis significant initiative is part of the U.S. Embassy Office of International Narcotics and Law Enforcement (INL)-funded Tahaffuz program.\nFederal Minister for Human Rights, Law and Justice, Senator Azam Nazeer Tarar underscored the importance of the NRSW, terming it a treasure trove for lawmakers and policymakers.\nLauding the efforts of the National Commission on the Status of Women and UN Women, Tarar said, “The government will make good use of the comprehensive Report to plan for a future in which Pakistan’s women and girls stand shoulder to shoulder with the men, helping the country prosper and reach new heights.”\nNCSW Chairperson Nilofar Bakhtiar emphasized that the National Report on the Status of Women (NRSW) stands as a testament to the unwavering efforts of countless individuals and organizations dedicated to enhancing the status of women in Pakistan.\nShe said, “The Report provides an in-depth analysis of the current situation of women in Pakistan and offers practical recommendations for policymakers, civil society organizations, and other stakeholders to promote gender equality and women’s empowerment.\nINL Director Lori Antolinez said, “Women empowerment is not just limited to equality; it is an essential element to accelerate societal development and progress. Launching this report is an important step in the right direction.”\nThe launch ceremony was attended by high-ranking government officials, members of the civil society and dignitaries from the US embassy.\nThe NRSW provides an analytical and statistical profile of women in Pakistan based on the official and most recent data collected nationwide from qualitative and quantitative studies as well as data from national and sub-national sources compiled in the National Gender Data Portal (NGDP) – which was also developed by the NCSW and UN Women under the Tahaffuz project. This first-of-its-kind portal, which is housed at the NCSW, consolidates gender data at a national level using digital tools that triangulate data from various sources.\nBased on this data, the NRSW highlights the environment of the country concerning the status of women and girls, which shapes and influences their lives, including the factors that can improve their well being and empowerment. The findings of the Report will support evidence-based policymaking, by helping to advocate and implement laws, strategies and budgets that can promote and speed up women’s socio-economic and political empowerment and prevent and respond to violence against women and girls.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:50:13.979Z"
}
