{
  "title": "24,829 families of dead beneficiaries receives payments under EECP",
  "link": "https://www.app.com.pk/national/24829-families-of-dead-beneficiaries-receives-payments-under-eecp/",
  "date_published": "2021-01-07T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): Around 24,829 families of eligible dead beneficiaries have withdrawn cash nationwide under the Ehsaas Emergency Cash Program (EECP) since the payments begin in December last year.\nAccording to the Poverty Alleviation and Social Safety Division (PASSD), overall, 169,107 applications were received by Ehsaas till September 30, 2020 out of which 65,954 have been processed; of these 5,024 cases were ineligible.\nOut of the currently approved 60,930 applications, payments are currently being made to 23,464 families and bank accounts of 12,637 families are being opened and analysed this month. Also, SMS messages featuring details of payments to next of kin of dead beneficiaries are being sent accordingly.\nThe scrutiny of 103,153 applications is presently ongoing and once the due diligence is completed, the disbursements will be made to all eligible applicant families till February 28, 2021.\nAccording to Ehsaas policy for the next of kin; for category I of emergency cash recipients that comprised the Ehsaas Kafaalat beneficiaries, the payment to next of kin is being made in order of priority to either an adult unmarried daughter, mother, unmarried adult sister, husband or father. Nevertheless,\npayment to families of beneficiaries who fall in categories II, II, IV and V can be made either to the spouse, eldest adult unmarried daughter or an eldest adult son in the order of priority.\nUnder Ehsaas Emergency Cash, one-time cash grants have been delivered to 14.8 million deserving families with disbursements reaching Rs. 179 billion till October 30, 2020.\nCategory I comprised the known vulnerable, or the 5 million existing Ehsaas Kafaalat beneficiaries. Category II comprised 4 million ‘new poor’, identified on request through 8171 SMS messaging service.\nCategory III comprised more than 3.5 million also, the new poor, who opted in as deserving by raising their need at the district level. Category IV beneficiaries of Ehsaas Emergency Cash comprised 1.263 million individuals that applied through the web-based portal hosted on the Prime Minister’s website. Category V of 2.45 million recipients was created to cater for the spill over eligible lists of Category II and III.\nTo ease out the payment to heirs of dead beneficiaries, Ehsaas had introduced the application process for families of dead beneficiaries to submit applications for facilitation in payments directly to Dr. Sania Nishtar, Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation along with the CNIC details of dead family member, death certificate verified by NADRA and CNIC details of eligible heir directly to Ehsaas offices in Islamabad.\nThe applications closed on September 30, 2020 while the last date of cash disbursements to heirs of dead beneficiaries has been extended till the end of February 2021 as long as the application was submitted till September 30, 2020, in order to facilitate the transparent payments.",
  "retrievedAt": "2025-08-11T20:13:21.097Z"
}
