{
  "title": "PM urges Pakistani film, drama industry to focus on promotion of local culture",
  "link": "https://www.app.com.pk/national/pm-urges-pakistani-film-drama-industry-to-focus-on-promotion-of-local-culture/",
  "date_published": "2021-01-07T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): Prime Minister Imran Khan Thursday urged the country’s film and drama industry to come up with a quality local production to provide the youth with a welcoming Ertugrul-like alternative of substandard and glamorized content.\n“If Pakistani film and drama industry presents quality local production, it will not only progress but also provide the youth with alternative of substandard and glamorized content, which will be welcomed like that in the case of Ertugrul,” he said.\nThe prime minister expressed these views during a meeting here with the founding team of popular Turkish drama serial Ertugrul led by Kemal Tekden.\nMinister for Information and Broadcasting Senator Shibli Faraz, Kashmir Committee Chairman Shehryar Khan Afridi, and the representatives of Turkish and Pakistan film industry were present in the meeting.\nThe meeting discussed in detail the proposed television series based on the role of renowned Sub-continent personality Turk Lala in the Khilafat Movement, to be produced through cooperation between Turkey and Pakistan.\nThe prime minister said Pakistani dramas were very popular in the world until the decade of 1980s.\nHe said the Pakistani film and drama industry were needed to work for the promotion of local culture so that the West-inspired youth could be made aware about their true culture and saved from social evils faced by the new generation of neighbouring countries due to the telecast of Western content.\nThe prime minister further said it was unfortunate that the new generation was not aware of the golden era of Muslims’ rule in the Sub-continent.\nEfforts should be made to the foil the designs of propaganda mongers by producing films and dramas on that golden era, he added.\nChairman of Kashmir Committee Shehryar Khan Afridi apprised the meeting of the important role of Turk Lala in the Khilafat Movement and his importance in Turkey.\nThe meeting also highlighted the importance of creating awareness among the youth about their heroes in history.\nKemal Tekden, while appreciating the prime minister’s decision of telecasting Turkish dramas in Pakistan, said Imran Khan and Turkish President Recep Tayyip Erdogan shared the vision that the creation of awareness among the youth about their history and culture was vital for the development of a country.\nBesides, he told the prime minister that June 30 was celebrated as a national day in Turkey every year in the honour of Turk Lala.\nTelevision series on Turk Lala would not only create awareness among the youth about Khilafat Movement but also add a new chapter in Pak-Turkey relations, he added.\nThe prime minister, while appreciating the project of proposed television series on Turk Lala, assured full cooperation of the government.",
  "retrievedAt": "2025-08-11T20:13:18.980Z"
}
