{
  "title": "Dr Faisal pays homage to frontline health workers in containing COVID-19",
  "link": "https://www.app.com.pk/national/dr-faisal-pays-homage-to-frontline-health-workers-in-containing-covid-19/",
  "date_published": "2021-01-07T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 07 (APP): Special Assistant to the Prime Minister on National Health Services, Regulations and Coordination Dr Faisal Sultan has paid homage to the frontline health workers for putting their lives at risk to ensure medical care to corona patients at hospitals.\n“They fully contributed for creating awareness and controlling the coronavirus with full commitment and perseverance,” Dr Faisal said while addressing the ceremony held here on Thursday to pay homage to frontline health workers.\nHe said that strict preventive measures were adopted to avoid further spread of coronavirus in the country related with the closure of educational institutions besides fully implementation of Standard Operating Procedures (SOPs).\nHe added the government had tried its level best to ensure adopting safety measures to protect citizens in order to contain the disease like imposing ban on public gatherings, marriages halls and restaurants and restriction on use of dining places of restaurants that resulted decrease in number of corona cases.\nHe said that the government had adopted effective strategy to combat COVID-19 for reduction in corona cases in the country. He said that the government had taken strict measures for prompt response to the disease.\nHe added team at National Command and Operation Centre (NCOC) was doing efficient work against the disease. He said that the main focus of the strategy was to control the disease on one hand and maintaining business activities on the other hand.\nHe said that all concerned federal and provincial and public and private institutions were playing remarkable role under NCOC against the disease.\nHe said that all possible measures would be adopted to control COVID-19 to avoid further load on already burdened health system of the country.\nHe said that strategies are made to control corona keeping in view the global information, focusing on data with integration of local data in a scientific way. He added input from concerned stakeholders was also considered to avoid any missing aspect.\nHe said that several local level administrative decisions were made to control the disease.\nHe advised the citizens to continue following the social distancing, use of mask and other precautionary measures to stop increasing local transmission of COVID-19 in the country.",
  "retrievedAt": "2025-08-11T20:13:21.481Z"
}
