{
  "title": "Construction sector strengthening economy, creating employment opportunities: PM",
  "link": "https://www.app.com.pk/national/construction-sector-strengthening-economy-creating-employment-opportunities-pm/",
  "date_published": "2021-01-07T18:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): Prime Minister Imran Khan on Thursday said that construction sector was strengthening economy and creating employment opportunities.\nHe hoped that the provincial governments will benefit from enhanced incentives in construction sector.\nThe Prime Minister was presiding over a weekly meeting of the National Coordination Committee for Housing, Construction and Development.\nChairman Capital Development Authority (CDA) briefed the meeting about construction in Sector E-11 and told that separate rules have been made for the projects of this sector and the pending projects would be completed soon.\nIt was told that in all the new constructions, appropriate space between the parking areas and pedestrian ways would be specially ensured.\nThe meeting was also briefed about the project of new Blue Area.\nChief Secretary Khyber Pakhtunkhwa briefed the meeting about master plans of 11 big cities of the province.\nThe meeting was told that the process of master plans for 8 sites of Tribal Districts was in progress.\nIt was told that Rs. 61 billion out of the total Rs. 242 billion allocated for urban development in Khyber Pakhtunkhwa for fiscal year 2020-21, have been spent till December 2020.\nThe meeting was also briefed about legal reforms for urban development in the province.\nChief Secretary Sindh briefed the meeting about progress regarding construction projects in the province.\nThe Prime Minister while expressing satisfaction over the progress in construction sector, however, stressed for taking special care of environmental protection in urban development and construction projects.\nMaximum efforts should be made not only to protect green areas but to make addition, he added.",
  "retrievedAt": "2025-08-11T20:13:15.469Z"
}
