{
  "title": "Gilani calls for further dialogue to overcome challenges in implementing 18th Amendment",
  "link": "https://www.app.com.pk/national/gilani-calls-for-further-dialogue-to-overcome-challenges-in-implementing-18th-amendment/",
  "date_published": "2024-12-20T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Chairman Senate, Syed Yousaf Raza Gilani, underscored the significance of reviewing the implementation of the 18th Amendment, which aims to decentralize powers and enhance provincial governance.\nHe remarked while addressing the18th Speakers Conference, which brought together provincial speakers and speakers of the legislative assemblies of Azad Jammu & Kashmir and Gilgit-Baltistan to discuss strengthening Parliamentary governance.\nIn his opening remarks the Chairman Senate expressed his gratitude to the Speaker of the National Assembly, Sardar Ayaz Sadiq, for hosting the conference after a decade-long gap.\nHe emphasized the importance of the conference as a platform for fostering dialogue, collaboration, and the advancement of legislative practices.\nSyed Yousaf Raza Gilani highlighted the dual challenge facing legislative bodies: upholding democratic traditions while adapting to an ever-evolving governance landscape.\nThe Chairman Senate also called for further dialogue and cooperation to overcome challenges in implementing the 18th Amendment and strengthening participatory governance.\nDuring the conference, discussions covered key topics such as enhancing the mandate of the Pakistan Institute for Parliamentary Services, promoting regional collaboration, and strengthening oversight mechanisms like the Public Accounts Committees. Syed Yousaf Raza Gilani also emphasized the need for modernization in legislative practices and the establishment of International Parliamentary Partnerships.\nChairman Senate commended the participants for their active engagement and shared commitment to democratic principles. He reiterated the importance of turning the conference’s recommendations into concrete actions to build a more transparent, inclusive, and resilient parliamentary system.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:55:52.855Z"
}
