{
  "title": "SPARC to increase size of GHW on cigarette packing",
  "link": "https://www.app.com.pk/national/sparc-to-increase-size-of-ghw-on-cigarette-packing/",
  "date_published": "2024-12-20T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):The Society for the Protection of the Rights of the Child (SPARC) has called authorities to take immediate action to increase the size of Graphic Health Warnings (GHWs) on cigarette packaging.\nCurrently covering only 60% of the packaging, SPARC emphasized that it must be expanded to at least 80-85% to effectively warn youth about the detrimental effects of smoking and prevent them from falling victim to nicotine addiction.\nAs tobacco use continues to pose a major public health challenge in Pakistan, increasing the size and impact of GHWs is essential to reducing tobacco consumption and protecting the health of future generations.\nAccording to the World Health Organization (WHO), smoking causes approximately 166,000 deaths annually in Pakistan, including 31,000 fatalities resulting from second-hand smoke. In addition to these alarming statistics, smoking contributes to numerous life-threatening diseases, including cancer, heart disease, stroke, lung diseases, diabetes, and chronic obstructive pulmonary disease.\nSPARC highlighted that Pakistan mandated 60% of the surface area on cigarette packs and outers to display pictorial health warnings under SRO (KE) 2016. However, as a signatory to the WHO Framework Convention on Tobacco Control (FCTC), specifically Article 11, Pakistan has committed to increasing this coverage to 85%. Despite this commitment, progress has been slow, and stronger action is urgently required.\nDr. Khalil Ahmad, Program Manager at SPARC, emphasized the importance of advancing graphic health warnings as a critical deterrent to tobacco consumption. “Expanding the size of these warnings to at least 80% of the pack’s surface will enhance their visibility and effectiveness. These warnings are especially crucial for discouraging tobacco use among young people, who are highly vulnerable to the deceptive marketing tactics of the tobacco industry. Almost 1200 children between the age of 6-15 start smoking every day in Pakistan, and we need to take an urgent action to prevent this number from growing further” he stated.\nResearch has shown that larger, more prominent GHWs significantly reduce the appeal of cigarette packaging and effectively communicate the severe health risks associated with smoking. By making health warnings more visible and impactful, the government can take a decisive step toward safeguarding public health and reducing the burden of tobacco-related diseases in the country.\nDr. Khalil further stated, “The current situation demands immediate and bold action. Strengthening graphic health warnings is not just a regulatory obligation but a moral responsibility to protect the lives of our youth and future generations. The relevant authorities must act swiftly to align with international commitments and promote a tobacco-free Pakistan said in a Press Release issued here on Friday.\nSPARC calls on policymakers, public health advocates, and civil society to unite in support of expanding graphic health warnings. The organization believes that this measure will not only discourage tobacco consumption but also promote awareness about the devastating consequences of smoking.\n“It is time to prioritize the health and wellbeing of our people,” Dr. Khalil concluded. “A simple yet impactful step like enhancing GHWs can play a pivotal role in creating a healthier, tobacco-free future for Pakistan.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:56:17.833Z"
}
