{
  "title": "AIOU’s Matric to Ph.D admissions to begin from January 1 across country",
  "link": "https://www.app.com.pk/national/aious-matric-to-ph-d-admissions-to-begin-from-january-1-across-country/",
  "date_published": "2024-12-20T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Allama Iqbal Open University (AIOU) has announced the schedule for admissions for the Spring Semester 2025.\nPreviously, the university conducted admissions in two phases until Autumn Semester 2024. However, the Vice-Chancellor, Professor Dr. Nasir Mahmood has introduced reforms to further improve the admission and examination systems.\nAccording to the new policy, admissions for all programs from Matriculation to PhD will now be conducted in a single phase starting on January 1.\nPrograms open for admission in Spring 2025 include Matriculation, FA, ICom, Associate Degrees in Arts, Commerce, and Education, BEd, BS face-to-face and ODL programs, Postgraduate programs, MS, MPhil, PhD, Diploma programs, and Certificate courses.\nAdmission forms and prospectuses for all programs will be available on the university’s website www.aiou.edu.pk starting January 1.\nTo assist students, Vice-Chancellor Professor Dr. Nasir Mahmood has directed the administrators of the university’s 54 regional offices nationwide to establish Student Facilitation Centers at their respective campuses before the commencement of admissions. These centers will ensure that all aspiring students visiting the campuses receive the necessary support, including free access to computers and the internet for online applications.\nThe Vice-Chancellor has also instructed regional heads to disseminate information extensively in the merged tribal districts (formerly FATA), Gilgit-Baltistan, and Balochistan, emphasizing that the university provides free Matric education to residents of these regions.\nDr. Nasir Mahmood highlighted that enrolling out-of-school children is a national responsibility, and the university is committed to providing fee concessions to support underprivileged children.\nHe has also directed regional heads to reach out to the transgender community, informing them that the university offers free education from Matriculation to PhD.\nAdditionally, the Vice-Chancellor has instructed regional administrators to visit local prisons to convey that the university provides free education to inmates and to encourage them to pursue admission.\nProfessor Dr. Nasir Mahmood aspires for Allama Iqbal Open University to play a pivotal role in achieving the goals of the national educational emergency.\nHe emphasized that no child should be deprived of education merely due to an inability to pay admission fees.\nThe university remains committed to addressing the educational needs of underprivileged children to ensure access to quality education for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:56:18.517Z"
}
