{
  "title": "CJP visits Rahimyar Khan jail",
  "link": "https://www.app.com.pk/national/cjp-visits-rahimyar-khan-jail/",
  "date_published": "2024-12-20T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): Chief Justice of Pakistan, Mr. Justice Yahya Afridi on Friday visited District Prison Rahimyar Khan.\nThis was his third day of his visit to remote areas of the country. During the visit he was accompanied by Mr. Justice Shahbaz Ali Rizvi, Justice of the Lahore High Court, the Registrar of the Supreme Court, the District and Sessions Judge Rahim Yar Khan, and the Inspector General of Prisons.\nThis visit forms part of his commitment to get first glimpse of the prison and inmates conditions. This is part of his determination to introduce substantively reforming the Criminal Justice System to which prison are integral part.\nDuring the inspection of the District Jail, the Chief Justice reviewed the facilities provided to inmates. He visited the female and Juvenile sections, the jail dispensary and bakery and showed satisfaction. He also met the under trial and convicted prisoners.\nHe noted that there are certain prisoners whose cases are moving at slow pace. He desired that the District and Sessions Judge shall examine such cases of abnormal delay and ensure speedy disposal.\nHe emphasized upon the skill development of the inmates so that they contribute towards the society after completing their jail term. He highly appreciated the efforts of certain philanthropist organizations in providing additional facilities of health and education. The Chief Justice also directed the District Judiciary to avail window of Law and Justice Commission in payment of fine of convicted prisoners and financing of legal aid to deserving inmates.\nThe Chief Justice of Pakistan appreciated the efforts of the Jail Superintendent in maintaining the premises of the prison in good condition.\nLater on, the inspector General of Prison Punjab briefed the Chief Justice on the ongoing and planned infrastructure improvement program and provision of facilities to the inmates.\nThe Chief Justice of Pakistan expressed his satisfaction of upgradation efforts and support provided by the government of Punjab. He however directed the IG to move ahead on his planned changes in the prison manual so that its improvement should start emerging.\nHe desired that such improvement initiative should be shared with the Committee which is working on his behalf so that it focuses other areas which need attention. He reiterated his commitment for finalizing recommendations of all provincial prison reforms committees within 03 months, to address weaknesses in the implementation. Upon his briefing, he urged the establishment of a prison complex in Rahim Yar Khan and Lahore.",
  "retrievedAt": "2025-08-10T13:55:30.312Z"
}
