{
  "title": "PM warns against complacency in action against officers involved in human trafficking",
  "link": "https://www.app.com.pk/national/pm-warns-against-complacency-in-action-against-officers-involved-in-human-trafficking/",
  "date_published": "2024-12-20T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): Prime Minister Shehbaz Sharif on Friday directed to initiate of strict punitive action against officers involved in sluggish action against human trafficking post-2023 boat capsizing incident.\nThe prime minister, chairing a high-level meeting on the prevention of human trafficking here, derided human trafficking as a regrettable offence bringing “disgrace to Pakistan worldwide”. He directed the relevant agencies to enhance coordination to prevent human trafficking and ensure the identification of FIA officials involved in facilitating human traffickers and take strict action against them.\nHe also directed to complete the ongoing investigation into human trafficking incidents at the earliest and submit concrete recommendations to overcome the menace.\nDuring the meeting, he was briefed on Greece’s boat accident and steps taken to prevent human trafficking. The prime minister was informed that five Pakistanis who died in the said accident had been identified, while others’ identification was underway.\nPakistan Embassy in Athens is in constant touch with Greek authorities regarding the boat accident, whereas the Pakistan Embassy there can be contacted on helpline +30-6943850188 and Ministry of Foreign Affairs Crisis Management Unit number 0519207887, for information and assistance regarding the boat accident, it added.\nIt was informed that the people from Gujranwala, Gujarat, Sialkot and Mandi Bahauddin districts are the most vulnerable to human traffickers and that legislation is being further improved to prevent human trafficking.\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Senator Ishaq Dar, federal ministers Ahad Khan Cheema, Attaullah Tarar, Rana Ehsan Afzal and senior government officials concerned. Pakistan’s Ambassador to Greece participated in the meeting via video link.",
  "retrievedAt": "2025-08-10T13:55:32.315Z"
}
