{
  "title": "NHA asked for preparing safety plans for highways",
  "link": "https://www.app.com.pk/national/nha-asked-for-preparing-safety-plans-for-highways/",
  "date_published": "2024-12-20T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Minister for Communications, Privatization & Board of Investment Abdul Aleem Khan on Friday directed the National Highway Authority to prepare a regular safety and security plan for all the highways being managed by this organization.\nMoreover, as per this plan at all motorways and GT Roads across the country those who are injured in accidents can be rescued in the shortest possible time to provide them medical facilities immediately.\nThe helicopter service and provision of emergency ambulances on the patron of 1122 in all four provinces so that the injured ones can be provided relief without wasting any time,  he added.\nAleem Khan directed that NHA should identify the establishment of Emergency Services Centers on the highways from Karachi to Peshawar and Baluchistan and in this regard, the agency should prepare plan on an emergency basis and submit it within the next week.\nHe expressed this while chairing a high-level meeting of the National Highway Authority in which the minister issued instructions to further tighten the axle load policy and implement restrictions on motorways and all highways not to express any leniency and to increase penalties by up to 1,000 percent so that a zero-tolerance policy can be adopted against overloading.\nHe said that the National Highway Authority should also make other highways barrier-free on the lines of the Lahore-Sialkot Motorway so that the time of travelers can be saved.\nAleem Khan said that the National Highway Authority should also launch an effective media campaign in print and electronic media to create public awareness regarding barrier-free travel and other reforms of the institution.\nHe said that the lives of all citizens traveling on Motorways and highways are very dear to us for which steps should be taken against all types of vehicles that cause accidents on national highways.  He also directed the Motorway Police to immediately start patrolling in areas deprived of this facility which will make travel safer for citizens.\nIn this high-level meeting, various options were discussed regarding the construction of Hyderabad-Sukkur Motorway while various aspects of the construction of Sialkot-Khariyan Motorway were also discussed.\nThe Federal Secretary for Communications and Chairman National Highway Authority held a detailed briefing to the meeting regarding various departmental matters and ongoing projects across the country by National Highway Authority.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:55:27.769Z"
}
