{
  "title": "CDA chairman for establishing dedicated NADRA desks at  BHUs, Business Facilitation Center",
  "link": "https://www.app.com.pk/national/cda-chairman-for-establishing-dedicated-nadra-desks-at-bhus-business-facilitation-center/",
  "date_published": "2024-12-20T15:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Chairman Capital Development Authority (CDA), Muhammad Ali Randhawa, on Friday proposed establishment of dedicated NADRA service desks at Basic Health Units (BHUs) in Islamabad and Business Facilitation Center, ensuring all services are accessible under one roof.\nThe CDA chairman, in a meeting with Chairman National Database and Registration Authority (NADRA) Lieutenant General Muhammad Munir Afsar focused on strengthening mutual collaboration and enhancing coordination between the two institutions.\nBoth sides agreed to promote cooperation across various areas to improve service delivery to the residents of Islamabad. During the meeting, the two organizations mutually agreed on providing technology-based public welfare services and solution to the residents of Islamabad.\nChairman NADRA emphasized aligning the features of the upcoming Islamabad Super App with the apps and services provided by NADRA.  He also commended CDA’s efforts in delivering better services to the citizens of Islamabad.\nChairman NADRA highlighted NADRA’s various operational services and expressed a desire to expand the scope of facilities for Islamabad’s residents with CDA’s support.\nHe assured full cooperation in extending services such as the issuance of birth and death certificates and other citizen-centric services throughout the city. Chairman CDA emphasized that CDA and NADRA will work jointly to ensure that services are delivered to residents at their doorstep.\nHe reiterated the shared commitment of both organizations to improve the quality of life for the people of Islamabad through innovative and citizen-focused initiatives and services.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:55:27.765Z"
}
