{
  "title": "Poland strengthens bilateral ties with Pakistan, global commitments: Polish Ambassador",
  "link": "https://www.app.com.pk/national/poland-strengthens-bilateral-ties-with-pakistan-global-commitments-polish-ambassador/",
  "date_published": "2024-12-20T08:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): The Polish Ambassador Maciej Pisarski addressed key international and bilateral issues during a comprehensive press briefing by the end of year, highlighting Poland’s economic growth, diplomatic initiatives, and its unwavering commitment to global security.\nThe ambassador celebrated 62 years of friendly relations between Poland and Pakistan, emphasizing shared values such as respect for sovereignty and international law.\nPoland extended congratulations to Pakistan on its election to the UN Security Council (2025-2026) and expressed optimism about Pakistan’s contributions to global peace. Notable milestones include Poland’s support during the Kabul evacuation in 2021 and efforts to assist Pakistani students during the Ukraine crisis.\nHe said that trade between the two nations has seen substantial growth, surging from €456.74 million in 2018 to €861 million in 2023.\nHighlighting initiatives like the GreenEvo economic mission, the ambassador underscored the importance of Polish companies, such as the Polish Oil and Gas Company (Orlen Group), which has invested over $450 million in Pakistan since 1997.\nThe ambassador reiterated Poland’s staunch support for Ukraine amidst Russia’s continued aggression. Poland has allocated over 4.91% of its GDP to military and humanitarian aid for Ukraine and condemned Russia’s use of North Korean troops in the conflict. The ambassador described these actions as colonial warfare, destabilizing both Europe and Asia.\nAddressing the migration crisis along the Polish-Belarussian border, the ambassador called it a manifestation of hybrid warfare aimed at destabilizing the EU. Poland continues to work with EU partners to safeguard its borders and ensure regional security.\nPoland reaffirmed its commitment to aiding Palestine, contributing $12.2 million in 2023-24 for humanitarian efforts. The ambassador emphasized Poland’s support for a two-state solution, envisioning peaceful coexistence between Israel and Palestine.\nThe ambassador highlighted Poland’s impressive economic growth since 1989, with GDP rising by 826.96%. As the fastest-growing economy among upper-middle-income countries, Poland’s per capita GDP (PPP) has nearly tripled, reflecting a better standard of living.\nLooking ahead, Poland’s presidency of the Council of the European Union in 2025 will prioritize security, defense, and countering disinformation. The ambassador outlined plans to enhance EU-NATO cooperation and address migration challenges at their roots.\nIn closing, the ambassador reaffirmed Poland’s dedication to strengthening international partnerships, fostering economic growth, and addressing pressing global challenges.",
  "retrievedAt": "2025-08-10T13:56:18.796Z"
}
