{
  "title": "‘Ravi Urban City’s an environment-friendly megalopolis: S. M. Imran",
  "link": "https://www.app.com.pk/national/ravi-urban-citys-an-environment-friendly-megalopolis-s-m-imran/",
  "date_published": "2021-07-30T07:55:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 30 (APP):Vice Chairman Lahore Development Authority (LDA) Sheikh Muhammad Imran has said that Ravi Urban City is planned to be an environment-friendly cosmopolitan with abundance of forests, botanical gardens, public parks and green areas.\n“Seven million trees will be planted while 30000-kanal land has been dedicated for forestation in the new city to overcome pollution challenges being faced by the old city and its suburbs”, he said while talking to APP on Thursday evening.\nTo a query, S M Imran, who is also spokesperson Ravi Urban Development Authority (RUDA), said as far as plantation and green cover were concerned an Australian company has been approached which specializes in excessive plantation through technology, adding that it plants trees through drones at such a speed that it can complete job of 30-40 men in three hours. This will help in speedy and organized completion of the task of plantation in the Ravi Urban City although work has already been started at the reserved forests land.\n“The city is realization of Prime Minister Imran Khan’s vision to develop an environment-friendly city in line with the international yardsticks”, he responded, adding that green cover and water reservoirs were at the center of this mega-city.\nTo a question, he said it was a misnomer to call the Ravi Urban City a project, adding that it was modern city spanning over an area of 102000 acres. He said Ravi Urban City will be the only second planned city in the country after the federal capital Islamabad which was developed on 80000 acres, adding that the city will rub shoulders with cities like Dubai as far as infrastructure, technology and environment standards are concerned.\nTo another question, he said those who were calling the project ‘unfriendly’ were misguided souls and did not understand the importance of water. He further said there can be no better people-friendly task than preserving water for the future, adding that water has been the reason behind many feuds and it is a yeoman’s task to save water.\nS M Imran said the Ravi Urban City was being developed with a view to revive the rive Ravi, develop a lake, and recharge water for the city of Lahore, adding that the 46-kilometer lake will be the longest waterfront in the world, adding that the 15-kilometer patch of the lake will be completed by the start of 2023.\nThe Vice Chairman LDA said water treatment plants will be built to process the sewage water of Lahore, adding that these water treatment plants will help in purifying water for several other usages and preserving the old city’s water table,besides irrigation as this water will be stores in a lake.\nHe said a Memorandum of Understanding (MoU) has already been signed with a Dutch company which will set up a ‘Waste to Energy’ power plant in the Ravi Urban City, adding that many companies have approached us.\nS. M. Imran has some foreign universities from the United Kingdom, United Arab Emirates have approached for setting up their campuses in the Knowledge Park of the Ravi Urban City, adding that it was not only the developers but all kinds of investments were pouring in.\nAbout the success of the project, he said Prime Minister Imran Khan was a dreamer and he knew how to turn dreams into reality. He said many, from the Deputy Commissioner (DC) Lahore in 1947 to the subsequent political leaders by 2018, had thought of developing a new city along Lahore but no one could undertake the mammoth task, but it was the leadership of PM Imran Khan who decided to preserve water and save environment, adding that green cover was vital to fighting climate change.",
  "retrievedAt": "2025-08-11T21:01:21.528Z"
}
