{
  "title": "TTP leader’s interview with CNN generates strong backlash",
  "link": "https://www.app.com.pk/national/ttp-leaders-interview-with-cnn-generates-strong-backlash/",
  "date_published": "2021-07-30T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, JULY 30 (APP): The interview of the leader of a designated terrorist organisation with an American news channel has generated lots of heat, with questions being asked about the timing of its airing and whether it was aimed at stirring instability in Pakistan, as the US forces withdraw from Afghanistan.\nThe analysts termed CNN’s interview of Noor Wali Mehsud an attempt to legitimize the terrorist organization and place it parallel to the Afghan Taliban, despite the fact that the Tehreek-e-Taliban Pakistan (TTP) was a US-designated terrorist organization, already neutralized by Pakistan, while the US and other countries were holding negotiations with the Afghan Taliban.\nThe TTP which had targeted innocent Pakistanis including women and children in several heinous attacks against Pakistani civilians and armed forces was changing its stance to protect its illicit activities under the cover of Islamization.\nCommand Eleven – an Open Source Intelligence, think tank, specializing in counter-terrorism, insurgency and extremism pointed that the TTP was a defunct terror group that was fighting to regroup under the ISPP banner, as their strength and relevance in Afghanistan has been decimated.\nCalling the @CNN interview with #NoorWaliMehsud a #propaganda piece would give it too much credit.\nThe #TTP is a defunct #terror group that is fighting to regroup under the #ISPP banner, as their strength & relevance in #Afghanistan has been decimated.https://t.co/ZOGchgKK3L\n— CommandEleven®  (@commandeleven) July 26, 2021\nThe TTP interview also revived the memories of the gruesome attack on the Army Public School in Peshawar in which 150 people including 134 school children were massacred.\n“Does CNN give airtime to all UN-designated global terrorists or made an exception in the case of Afghanistan-based most wanted terrorist leader of TTP responsible for deadly attacks against Pakistan including the massacre of our children?” questioned Sana Jamal an Islamabad based journalist.\nTTP leader in @CNN interview: “Our fight is only in Pakistan & we are at war with the Pakistani security forces.”\nUS media now waging a war against Pakistan after failing in Afghanistan. Pakistan @GovtofPakistan @ForeignOfficePk should formally take this up with US.\n— Sana Jamal (@Sana_Jamal) July 26, 2021\nThe people on Twitter described the TTP as a terrorist organization and said any efforts by the media to resuscitate it by portraying it as a legitimate, reformed, and human-rights-focused organization would have devastating consequences for the region.\nThe 27th report of the UN Analytical and Monitoring Team pointed that the TTP has gained strength after a number of militant groups united under its umbrella, which has “resulted in a sharp increase in attacks in the region”, including “more than 100 cross-border attacks [into Pakistan]”.\nThe TTP surfaced in 2007 as an organisation for a number of local militias along Pakistan’s northwestern belt bordering Afghanistan and demanded the imposition of a strict form of Islamic law across the country.\nThe group carried out dozens of large-scale suicide attacks, bombings and other attacks targeting Pakistani civilians and security forces, till 2014, when the Pakistani military launched a massive operation against its headquarters in North Waziristan. Many were killed and the remaining escaped across the border into eastern Afghanistan.\nAccording to ISPR, over 18,000 terrorists have been killed during the war on terrorism in the past two decades.\n“At least 1,100 Al Qaida terrorists were either captured or killed to ensure global peace and security” during the same period,” Major General Babar Iftikhar told media in January.\nHe said intelligence sharing with 70 countries helped hunt down the militants, to ensure regional peace and security. He said the war on terror cost the country almost US$126 billion, while Pakistan lost 83,000 precious lives.\nAfter being dislodged, TTP’s ringleaders took refuge in Afghanistan and carried out attacks on Pakistan, including the one on APS Peshawar.\nHowever in recent months, since the TTP’s reunification, a spike has been witnessed in targeted attacks against security forces and tribal elders in North Waziristan.\nThe Counter-Terrorism Department has successfully foiled several attacks and arrested a number of militants. Interrogation of several TTP members revealed that they were being funded by Indian and Afghan intelligence agencies.\nCTD KPK arrests two militants of TTP from Mardan region– Arms & Ammunition recovered from possession of the militants. Both were wanted for numerous cases of terror attacks & killings pic.twitter.com/DOglNarmdM\n— Pakistan Defence  (@defence_pk) July 28, 2021\nThis fact was also reported by an Indian author – Avinash Paliwal who in his book admitted that the Indian consulates in Afghanistan, along the border with Pakistan, were actively supporting Baloch militant groups, and TTP through funnelling of funds by India’s intelligence agency RAW (Research and Analysis Wing) to TTP through Dubai.\nIndian author – Avinash Paliwal writes in his book that Indian consulates in Afghanistan bordering Pakistan were actively involved in supporting Baloch militant groups and TTP.\nIndia's RAW was funneling funds to TTP through Dubai. https://t.co/BxSBE0RR42 pic.twitter.com/K8ZCSBP1a9\n— Umar (@umaraqti) July 28, 2021\nAccording to a U.N. report, over 6,000 terrorists belonging to TTP & ISKP (Islamic State Khorasan Province)including globally designated terrorist commanders Noor Wali and Khorassani are enjoying Safe havens in Afghanistan.\nTTP, meanwhile, is trying to legitimate itself by aligning its narrative with PTM (Pashtun Tahafuz Movement) as its demands now focus on the rights of Pashtuns and Baloch, in a bid to cover up its terrorist acts. Unfortunately, several innocent Pashtuns have fallen victim to their brutality in the areas it once operated.\nThe alignment of the TTP and PTM comes as both join hands against the writ of the state in the erstwhile FATA and were adopting anti-state and anti-army narratives of libellous activists to gain their sympathies.\nRetd Lt Gen. Shafaat Shah, former Corps Commander Lahore and Ambassador of Pakistan to Jordan said TTP was a banned organisation by the US and here its terrorist leader was giving an interview on CNN?\n“Shows contacts, sponsorships by Afghan Intelligence, RAW & CIA, otherwise CNN team would not have got access to him?”\nTTP is a supposed banned organisation by US & here its terrorist leader is giving interview on CNN ? Shows contacts,sponsorships by Afghan Intelligence,RAW & CIA, otherwise CNN team would not have got access to him?Our in slumber FO should lodge a protest with US(though unlikely) https://t.co/krdAK87Lu5\n— SHAFAAT SHAH (@INFANTRY28) July 26, 2021",
  "retrievedAt": "2025-08-11T21:01:20.304Z"
}
