{
  "title": "Delay in completion of development projects not to be tolerated: Swati",
  "link": "https://www.app.com.pk/national/delay-in-completion-of-development-projects-not-to-be-tolerated-swati/",
  "date_published": "2021-07-30T15:17:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 30 (APP):Railways Minister Muhammad Azam Khan Swati has said that delay in completion of the development projects of the department will not be tolerated.\nChairing several meetings on different issues at the PR headquarters here on Friday, he said that the project director would be held responsible in case of any shortcoming or delay.\nHe said that the project director of any project would not be changed till the completion of the project.\nAppreciating the officers, the minister said that the PR was running only due to the good officers.\nHe said that inefficient people would be replaced with efficient ones so that the railways could move forward on modern lines. He directed the officers to complete all signaling projects within six months.\nThe minister ordered for completing construction work of the flats being constructed for the employees in Narowal in six months.\nHe expressed his satisfaction when he was informed that flats in Lahore and Karachi had already been completed.\nHe said that mafias should be curbed as they created obstacles in development. There was no shortage of human resources in Pakistan Railways; however, things needed to be fixed, the minister said. He ordered for completing the locomotive projects speedily.\nAbout the repair and rehabilitation of coaches, he said that the rehabilitation project should be expedited, adding that additional coaches should also be available at different places.\nChairman Railways Habib-ur-Rehman Gilani, Chief Executive Officer Pakistan Railways Nisar Ahmed Memon, Additional General Manager Infrastructure Asif Matin Zaidi, Additional General Manager Traffic Syed Mazhar Ali Shah Additional General Manager Mechanical Salman Sadiq, Advisor to Federal Minister for Railways Abdul Rashid, Director Public Relations Nazia Jabeen, apart from senior officers also attended the meeting.",
  "retrievedAt": "2025-08-11T21:01:15.009Z"
}
