{
  "title": "Attaullah Tarar condemns KPK CM’s notice to journalist Abdullah Momand",
  "author": null,
  "content": "ISLAMABAD, Sep 19 (APP): Federal Minister for Information and Broadcasting, Attaullah Tarar has expressed deep concern and regret over the notice sent to Dawn News journalist Abdullah Momand by Chief Minister of Khyber Pakhtunkhwa Ali Amin Gandapur.\nThe minister, in a news statement, said serving a Rs. 1 billion notice to Abdullah Momand merely for asking a question is tantamount to an “attack on press freedom, and violation of democratic values, and a deviation from the constitution”.\n“It is the duty of a journalist to ask questions,” he said, adding that serving a notice in response to a question is not only unconstitutional and illegal but also unethical.\n“Such actions are intended to undermine democratic values and silence journalists especially by putting them under pressure,” the minister remarked.\nHe said democratic values demand that questions be answered with reason and clarification, not by harassing and intimidating journalists.\n“Threatening journalists with defamation notices and cybercrime proceedings is unacceptable under any circumstances,” he stressed.\nThe minister described this behavior as an “abuse of state offices and powers”, noting that such actions harm Pakistan’s reputation not only domestically but also internationally.\nHe highlighted that media freedom and the protection of journalists are considered human rights globally, and incidents of this nature damage Pakistan’s positive image.\nTarar called it “extremely regrettable” that every action of the Pakistan Tehreek-e-Insaf (PTI) goes against the country’s interests. He accused the party of habitually imposing restrictions on press freedom, ridiculing institutions, and attempting to defame public representatives.\n“The government stands with the journalist community and will firmly oppose any action that attempts to suppress the media or violate democratic values,” he said.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:59:04.430Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/attaullah-tarar-condemns-kpk-cms-notice-to-journalist-abdullah-momand/",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T17:25:00.000Z"
}
