{
  "title": "Jammed locomotive  wheels, damage piece of railway track main reasons for train accident: Saad Rafique",
  "link": "https://www.app.com.pk/national/jammed-locomotive-wheels-damage-piece-of-railway-track-main-reasons-for-train-accident-saad-rafique/",
  "date_published": "2023-08-08T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP): Railways Minister Khawaja Saad Rafique while strongly refuting news item appeared in section of press and social media on Monday said two jammed wheels of locomotive and damage piece of railway track were main reasons for the railway tragic accident near Nawabshah.\nSpeaking at the National Assembly here, the minister said regretted that fake news was being circulated on both social media and some television networks. No wood was used in joints rather Parmelia fishplate was being used for railway signal system worldwide as the signal system did not work without it, he said.\nHe explained that it was a special type of fishplate which was imported from Germany or Holland. Investigation into the accident was underway and its final report would come in next few days, he said.\nHowever, as per the initial report, out of 12 total wheels of locomotive were jammed when the train started its journey from Karachi which should have been removed.\nBesides, a piece of railway track near the accident site was also damaged, which led to the accident.\nHe said 30 people have lost their lives and dozen sustained injuries in the tragic accident. Maximum casualties were due to capsizing of the bogies rather than derailment, he added.\nThe minister said six railway officials have been suspended and financial compensation worth Rs 1.5 million each would be given to the families of deceased passengers as per railways standard operating procedures (SOPs).\nHe thanked the Sindh government, army, ranger, Rescue 1122 and the local people for their prompt assistance.\nSaad Rafique also called for investment in railways as there was acute shortage of funds and staff. After the last year massive flash flood, they have requested the government for provision of funds but to extreme financial constraints, it could not be provided to the railways.\nHe said ML-1 project has already been late as the past government did nothing in this regard. The project would be signed in October, he added.\nThe minister also completely ruled out chance of any sabotage activity.",
  "retrievedAt": "2025-08-11T09:06:23.003Z"
}
