{
  "title": "Pakistani team achieves position in CERN’s BL4S contest",
  "link": "https://www.app.com.pk/national/pakistani-team-achieves-position-in-cerns-bl4s-contest/",
  "date_published": "2023-08-08T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): Pakistan competed with 379 teams from 63 countries and made a way in European Organization for Nuclear Research (CERN’s) Beamline for Schools program.\nTalking to APP here on Tuesday, the coach of the victorious team Professor Muhammad Akhtar Tarar said that the annual “Beamline for Schools” (BL4S) competition invites high school students worldwide to propose physics-related experimental ideas. He said that out of three winning teams, one hail from the United States and the other is from Netherlands.\nHe said that other two teams would also undertake their experimental projects at CERN alongside the Pakistani team. He highlighted that CERN’s significance as the world’s foremost particle physics laboratory where research into various states of matter, fundamental particles and their interactions is conducted.\nHe said that along with other two teams, Pakistan’s team has been invited to CERN for a fully funded two-week visit during which the teams will execute their proposed experiments. “This achievement marks the first instance of attaining such an honor”, he added.\nGiving the details of team members, Akhtar said that students team members come from the diverse backgrounds representing various institutions. He said that the team comprises Muhammad Salman Tarar (Group Leader), Muhammad Abdullah Masood from Supernova School Islamabad, Muhammad Asadoho and Muhammad Zohaib Abbas from Hasan Abdal Cadet College, Wasif Ahmed from Cedar College Karachi, Muhammad Mansoor Afzal Maitla, Abdul Wahab Akram, and Muhammad Husnain Haider from Islamabad College for Boys, and Muhammad Saad Bilal from Saddique Public School Rawalpindi.\nTalking to APP, Coach Ahsan Hayat shared that Islamabad College for Boys (ICB) established an Inventor Club which has been playing a pivotal role in nurturing and motivating students to participate in global science competitions.\nProfessor Muhammad Akhtar Tarar and Ahsan Hayat extended their gratitude to Dr. Zafar Yasin, Director of CERN Secretariat Pakistan Atomic Energy Commission, administrative authorities, Principal of Islamabad College for Boys, Prof. Dr. Ali Ahmed Kharral, and Vice Principal Admin, Prof. Muhammad Rashid Khan, for their invaluable support and provision of essential resources to the team’s coaches that enabled them to prepare the students for the competition.\nMembers of the winning team expressed their belief in the potential of Pakistani students and encouraged them to seize opportunities. They also expressed hope to be recognized by the Prime Minister for their international contributions upon their return from this remarkable endeavor.\nIt is worth noting that Pakistan stands as an associate member country of CERN, with its secretariat housed within the Pakistan Atomic Energy Commission. Many Pakistani scientists are actively engaged in diverse experiments at CERN.",
  "retrievedAt": "2025-08-11T09:06:40.292Z"
}
