{
  "title": "President stresses youth to benefit from technology advancement",
  "link": "https://www.app.com.pk/national/president-stresses-youth-to-benefit-from-technology-advancement/",
  "date_published": "2023-08-08T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP):President Dr Arif Alvi has stressed the youth to benefit from the technology advancement and offer their services globally to increase technology exports of the country.\n“We have a youth bulge in our country and that youth bulge must be linked intellectually with the rest of the world. If it is not done, we will miss a great opportunity available to our country,” President Alvi said in his video message to a virtual inauguration of the Institute of Cost and Management Accountants (ICMA) Digital Academy.\nICMA launched the Digital Academy in partnership with the London-based The FinTech Group (TFG), According to a press release issued here on Tuesday.\nICMA Digital Academy is incorporated in the UK with a mission to develop job-ready workforce of the future in Pakistan with globally in-demand digital skills.\nPresident of Pakistan Dr. Arif Alvi highlighted the importance of the ICMA Digital Academy’s plans to help the youth bulge in the country offer their services globally. He reminded the audience that young adults are very keen on learning new technologies and on interacting with global customers in a professional manner.\nPresident Alvi described the strategic shift taking place around us in terms of the new jobs of the future and the way many of these services will be rendered in future. Pointing to the increased acceptability of remote work in many of the jobs of the future, the President indicated that this provides a tremendous opportunity to the talented young adults of Pakistan to interact virtually with the users of their services without any geographical limitations. This takes away the need for any visas or immigration to new countries as a pre-condition for offering services globally.\nThe President reminded the country about the speed of change taking place around the world and the need for Pakistan to get on the train faster. In this context, he congratulated ICMA for its timely launch of the ICMA Digital Academy.\nPresident Alvi said that ICMA has been active in developing professionals in management accounting to serve the needs of the country for a very long time. But in tomorrow’s world it will be possible for accountants to expand their reach well beyond Pakistan and start serving the needs of users globally, thereby increasing the country’s digital exports and enhancing economic prosperity.\nThe President expressed his good wishes to the learners who would take courses from ICMA Digital Academy to get them ready for the jobs of the future and to prepare them to offer their services globally without geographical limitations. This will result in an environment where our people will find employment and our country will find increased digital exports to reduce the untenable reliance on industrial & agricultural exports.\nThe panelists in this live webinar included representatives from some of the country’s leading institutions with interest in developing and deploying digital & emerging technologies skills. Among others, these institutions included P@SHA, Pakistan IT Industry Association, Pakistan Stock Exchange, National Institute of Banking & Finance, Pakistan Freelancers Association, Pakistan Software Export Board, and Big 4 accounting firms.\nThere was also representation from the higher education sector and from the leadership teams of ICMA and TFG. International firms focused on EdTech, end-to-end digital enrolment platforms and micro-internships for learners also attended the inauguration ceremony.\nThe ICMA President Shahzad Malik, highlighted the vision of ICMA Digital Academy to empower ICMA members and university students with internationally comparable digital skills, thereby amplifying the country’s potential for digital exports. To contribute to the national digital transformation, he highlighted ICMA Digital Academy’s plans to bolster digital competencies in both the corporate and public sector entities.\nIt is planned that learners will be able to enroll on the digital skills development programmes from early October 2023.",
  "retrievedAt": "2025-08-11T09:06:43.490Z"
}
