{
  "title": "Current circumstances warrant deep Pak-Afghan cooperation against terrorism, extremism: Ashrafi",
  "link": "https://www.app.com.pk/national/current-circumstances-warrant-deep-pak-afghan-cooperation-against-terrorism-extremism-ashrafi/",
  "date_published": "2023-08-08T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): Pakistan Ulema Council (PUC) Chairman Hafiz Muhammad Tahir Mahmood Ashrafi on Tuesday said current circumstances warranted deep Pakistan-Afghan cooperation against the menaces of terrorism and extremism.\nChief of Army Staff General Syed Asim Munir and Head of the Afghan Interim Government Mullah Hibatullah had given clear policy guidelines in that regard at the right time, he said while talking to the media.\nAshrafi, who is also President of International Interfaith Harmony Council and Prime Minister’s Special Representative on Interfaith Harmony and Middle East, said peace in both the countries was interlinked as being in the state of war for the last 42 years their people had only witnessed destruction and bloodshed.\n“Now is the time that not only Pakistan and Afghanistan should cooperate with each other for peace but also other regional countries should play their role in this regard,” he added.\nWith the resolution of the Kashmir dispute, he said, the region would stabilize financially and economically, and prosper as well.\nAnswering a question, Ashrafi said after lapse of 42 years, there was need of a clear-cut policy for peace and that was elaborated by General Asim Munir on Monday. Likewise, the statement of Mullah Hibatullah that the killings and violence in Pakistan were no Jihad, was also a good omen for regional peace, he added.\nHe said no one had the right to carry out terrorist activities and killings in the name of Jihad in Pakistan, which was clearly stated in the Pagham-e-Pakistan and now explicitly elaborated by Mullah Hibatullah in his decree, which should be implemented in letter and spirit by the Afghan authorities.\nAshrafi said Pakistan was an ideological Islamic state, with its Constitution adhering to the teachings of the Holy Quran and Sunnah, gave full protection to the rights of minorities. Ulema and scholars in their Friday sermons on August 11 would fully highlight the teachings of Islam regarding the minorities’ rights, he added.\nHe said the the nation would celebrate the Independence Day with traditional zeal and fervour.",
  "retrievedAt": "2025-08-11T09:06:23.179Z"
}
