{
  "title": "Damascus backs out of Paris talks with Kurds - World - DAWN.COM",
  "author": null,
  "content": "DAMASCUS: A Syrian government official said on Saturday that authorities would not participate in planned talks in Paris on integrating the Kurdish semi-autonomous administration into the Syrian state and demanded future negotiations be held in Damascus.\n\nThe move came a day after the Kurdish administration, which controls swathes of the north and northeast, held a conference involving several Syrian minority communities, the first such event since Islamists overthrew longtime ruler Bashar al-Assad in December.\n\nParticipants included the head of the Kurdish-led Syrian Democratic Forces (SDF) Mazloum Abdi, who on March 10 signed a deal with President Ahmed al-Sharaa to integrate the Kurds’ civil and military institutions into the state.\n\nThe conference’s final statement called for “a democratic constitution that establishes a decentralised state”, guaranteeing the participation of all components of Syrian society. Damascus has previously rejected calls for decentralisation.\n\n“This conference was a blow to current negotiating efforts, and based on this, (the government) will not participate in any meetings scheduled in Paris,” state news agency SANA quoted an unidentified government official as saying.\n\nInternational mediation\n\nThe government “calls on international mediators to move all negotiations to Damascus, as this is the legitimate, national location for dialogue among Syrians”, the official said.\n\nLate last month, Syria, France and the United States said they agreed to convene talks in Paris “as soon as possible” on implementing the March 10 agreement.\n\nRecent sectarian clashes in south Syria’s Druze-majority Sweida province and massacres of the Alawi community on Syria’s coast in March have deepened Kurdish concerns as progress on negotiations with Damascus has largely stalled.\n\nThe event also saw video addresses from an influential spiritual leader of Syria’s Druze community in the country’s south, Hikmat al-Hijri, and from prominent Alawi spiritual leader Ghazal Ghazal.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/01093133d12f8e1.jpg?r=093138",
  "retrievedAt": "2025-08-16T07:23:50.335Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929851/damascus-backs-out-of-paris-talks-with-kurds",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:41.000Z"
}
