{
  "title": "Omar Ayub’s pre-arrest bail plea dismissed - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: An anti-terrorism court on Saturday dismissed pre-arrest bail of national assembly’s former opposition leader Omar Ayub for not appearing in three cases of May 9 riots, while PTI MNA Zartaj Gul and Senator Ejaz Chaudhry approached the Lahore High Court (LHC) against their sentences by the ATCs.\n\nHowever, the registrar office raised an objection to three separate appeals of Ms Gul in as many convictions announced by a Faisalabad ATC.\n\nThe office noted that the appellant had not surrendered herself before the law, therefore, her appeals against the sentences were not maintainable.\n\nHowever, the office fixed the hearing of the appeals as “objection case” before a two-judge bench headed by Chief Justice Aalia Neelum for Aug 11.\n\nZartaj Gul, Senator Ejaz move LHC against ATC convictions\n\nNow, the bench will decide the office objection on the appeals.\n\nThe office also fixed the hearing of Senator Ejaz’s appeal before the same division bench without putting any objection. The senator is already in jail facing trials in multiple cases of May 9 attacks.\n\nMs Gul filed the appeals through Advocate Mian Muhammad Hussain.\n\nThe appeals contend that\n\nMs Gul was not nominated in the FIRs and her name was only added in the supplementary statements. They said she was neither present at the scene nor was her presence proved by the prosecution.\n\nThe appeals further stated that key prosecution witnesses denied any meeting involving Ms Gul. The pleas asked the LHC to set aside the sentences and acquit the appellant.\n\nA Faisalabad ATC had on July 31 awarded 10-year rigorous imprisonment each under Section 109 (punishment for abetment when the act abetted is committed) and Section 120-B (criminal conspiracy) of the PPC.\n\nA Lahore ATC had awarded 10-year rigorous imprisonment to Senator Ejaz Chaudhry and others including Dr Yasmin Rashid, former governor Omar Sarfraz Chee­­ma and former provincial minister Mian Mehmoodur Rashid in a case of violence near Sherpao Bridge.\n\nThe appeal by Senator Ejaz stated that the trial court handed down the sentence beyond facts and in violation of the law. It said the appellant was not even present at the alleged occurrence.\n\nBail dismissed\n\nATC-I Judge Manzer Ali Gill dismissed the pre-arrest bail of Mr Ayub as he failed to appear before the court.\n\nHis lawyer filed an application seeking a one-time exemption from personal appearance, pointing out that a Faisalabad ATC sentenced the petitioner in a May 9 case. He argued that without getting protective bail, the petitioner could not appear in Lahore and approached the Peshawar High Court for the relief.\n\nHowever, Judge Gill dismissed the exemption request, noting that since Mr Ayub had already been convicted, he must surrender before the court.\n\nThe judge observed that a convicted person is not entitled to protective or transit bail and cannot file an appeal before surrendering.\n\nOmar Ayub filed bail petitions in the Jinnah House attack, Askari Tower attack, and Shadman police station arson cases.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/0819571561d2c5e.jpg?r=195758",
  "retrievedAt": "2025-08-16T07:24:19.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929870/omar-ayubs-pre-arrest-bail-plea-dismissed",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:32.000Z"
}
