{
  "title": "PAA rejects rumours of Islamabad airport being closed for 8 days - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan Airports Authority (PAA) on Sunday dismissed “incorrect and misleading” media reports about an eight-day closure of Islamabad International Airport, clarifying the exact date and time of the planned shutdown.\n\nA statement by PAA Spokesperson Saifullah Khan said, “According to the Notams issued, due to air activities ahead of Independence Day on August 14, arrival and departure flights will be suspended for only two hours on specific days and times.”\n\nFrom August 6-9 and August 11-14, the airport will be shut from 11am-1pm PST.\n\nOn August 9 and 11, the airport will also be shut from 8-10pm.\n\n“Apart from these brief interruptions, all flights at the airport will continue as usual,” the statement said, advising passengers to contact their airline for the latest information on their schedule.\n\nThe government has said that this year’s Independence Day would be celebrated under the banner of “Marka-i-Haq” (Battle of Truth) — the period of conflict with India in May — to demonstrate the nation’s resilience, progress and pride.\n\nWhile discussing the activities of the scheduled celebrations, Planning Minister Ahsan Iqbal stressed that every sector and official in charge should ensure that all universities and schools observe the day in the same format. The same was advised for provincial celebrations and celebrations abroad in collaboration with the Overseas Ministry.\n\nDuring the four-day conflict between Pakistan and India, flight disruptions left hundreds of passengers stranded at the country’s major airports, including Lahore, Islamabad, Karachi and Sialkot airports.\n\nThe Ministry of Defence informed the National Assembly on Friday that the PAA lost Rs4.1 billion from April 24 to June 30 due to the closure.\n\nPAA also issued a schedule for temporary runway closure at Lahore’s Allama Iqbal International airport owing to bird activity. The closure will be in effect daily from 5am to 8am, starting July 1 until September 15.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/090808427fef98c.jpg",
  "retrievedAt": "2025-08-16T07:22:35.626Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929959/paa-rejects-rumours-of-islamabad-airport-being-closed-for-8-days",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T08:49:46.000Z"
}
