{
  "title": "Bajaur locals fear operation after peace talks fall through - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: After talks between local militant commanders and the Bajaur Amn Jirga for their return to Afghanistan hit a snag on Saturday, the locals are apprehensive about the resumption of a military offensive, ‘Operation Sarbakaf’, in Lowi Mamund tehsil.\n\nInitially, the anti-terror operation had been postponed after both sides agreed to a ceasefire until the conflict was completely resolved thro­ugh talks.\n\nThe failure of the peace talks has also plunged the local population into fear and a state of uncertainty. Accor­ding to reports, a number of families from 16 areas of Lowi Mamund tehsil left their homes for peaceful areas in the district on Saturday. The reports added that more families from the said areas were expected to leave their homes today.\n\n“The collapse of negotiations between members of the Bajaur Aman Jirga and militant leaders, aimed at convincing them to leave the region peacefully, has left no option but to resume Operation Sarbakaf to neutralise militants in the region, who pose a significant threat to peace and people’s lives,” the sources added.\n\nJirga leader says dialogue with militants for their return hit snag due to ‘some issues’\n\nOn Friday night, Sahibzada Haroon Rashid, head of the 50-strong Bajaur jirga, told reporters that the talks with militants “concluded without desired results owing to the development of a serious deadlock over some key issues necessary to resolve the conflict peacefully”. He was talking to reporters after separate meetings with militants’ leaders and high-ups held on Friday evening.\n\n“We (members of the Bajaur Amn Jirga) have tried our best with great sincerity and commitment to make the talks with militant leaders a success by convincing them to return peacefully to Afghanistan…but unfort­­unately, we couldn’t succeed in our mission due to the development of a serious deadlock on some main issues,” Mr Rashid said while sharing the details of the seventh round of talks. He did not elaborate on the issues that stalled the dialogue.\n\nAccording to the jirga leader, there would be no further negotiations with militant leaders on the issue until the deadlock was resolved. Accompanied by all jirga members, including PTI’s local MPA Dr Hamidur Rehman and former local MNA Gul Zafar Khan, Sahibzada Haroon Rashid appealed to both sides, the security forces and militants, to show tolerance and refrain from fighting, as it was causing suffering among the local people.\n\nHowever, he told reporters that both sides had assured the jirga that civilians and their properties would be spared in the event of any fighting in the region. He said the jirga would remain functional and work with local residents to devise an action plan in case the residents and their properties were affected in any potential conflict between the security forces and terrorists. Mr Rashid said the jirga members would resume their activities in the larger interest of Bajaur and its people after a meeting with the Khyber Pakht­unkhwa chief minister in Peshawar on Saturday. There had been no statement about the meeting by the time this report went to press.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/30104153cd5138a.jpg?r=104413",
  "retrievedAt": "2025-08-16T07:24:33.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929871/bajaur-locals-fear-operation-after-peace-talks-fall-through",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:16.000Z"
}
