{
  "title": "PTI will approach lawyers over ‘rumoured’ 27th Amendment: Asad Qaiser - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI senior leader Asad Qaiser on Sunday addressed rumours of the 27th Constitutional Amendment, stating that the party would approach the legal fraternity regarding the potential legislation.\n\nAfter passing the 26th Constitutional Amendment last year, the government had been planning to table another amendment, colloquially known as the 27th Amendment, aimed at reforming local governments and “addressing issues skipped in previous legislation”.\n\nAddressing a press conference in Islamabad today, the PTI leader and former National Assembly speaker stated that there is “new drama” surrounding the legislation.\n\n“In this case, we will approach the lawyers’ community regarding this legislation,” Qaiser said. “We will begin by meeting with the Islamabad Bar this month.”\n\nReferring to a “schedule of activities” for this month, Qaiser said that the PTI will also arrange an engagement with foreign diplomats and embassies, as well as a seminar.\n\nThe PTI leader also assailed the manner in which the country is being governed, branding it “illegal, unconstitutional and undemocratic”.\n\n“The country is practically under martial law and decisions are being made based on personal preferences,” Qaiser stated. “The country cannot be run under this hybrid system we have right now.\n\n“We have decided that we will use all available forums — parliament, the courts, the public — to take our struggle against injustice and oppression forward.”\n\nQaiser claimed that courts made decisions not based on merit, but due to institutional pressure.\n\n“We believe that the cases of political prisoners, including [PTI founder] Imran Khan, should be judged on merit, not due to pressure from the authorities,” he emphasised. “If the trials are decided on merit and there is live coverage in the media, the nation will see what a drama this is.”\n\nQaiser continued: “Then there’s also a show in the assembly. The way it’s being controlled and the way its system is being run, as well as the way parliamentarians are being humiliated in front of Adiala Jail, is concerning. I have conducted some research into this matter and will bring it up before the National Assembly.\n\n“According to our own rules, it is written that any MNA can inspect prisons. Is it just written down or can it actually be enforced?” he asked.\n\nDetails about the proposed constitutional amendment were divulged by sources following a meeting bet­ween Prime Minister Shehbaz Sharif and PPP Chairperson Bila­wal Bhutto-Zardari in Lahore, atten­ded by key leaders from both parties on October 27 last year.\n\nIn contradicting statements, Law Minister Azam Nazeer Tarar had declared that the government was not considering any such legislation. At the same time, then-adviser to the PM on Law and Justice Barr­ister Aqeel Malik had hinted that the government could not only table “an amendment” in parliament, but would also be able to pass it.\n\nIn June this year, amid speculation in legal circles about the government planning to bring in the 27th Amendment, the Islamabad High Court Bar Association endorsed the amendment while calling for broad-based judicial reforms, including the nationwide rotation of judges.\n\nIn a post on X in July, PTI founder Imran wrote that rather than bringing in the amendment “through a sham parliament, it would be better to openly declare a monarchy, because what exists today is outright dictatorship, forcibly imposed on the country”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/10171239f90f084.jpg",
  "retrievedAt": "2025-08-16T07:22:29.669Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929988/pti-will-approach-lawyers-over-rumoured-27th-amendment-asad-qaiser",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T12:44:19.000Z"
}
