{
  "title": "Trump nominates State Dept spokeswoman Bruce as US deputy representative to UN - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Saturday he was nominating State Department spokesperson Tammy Bruce as the next US deputy representative to the United Nations.\n\nBruce has been the State Department spokesperson since Trump took office in January.\n\nIn a post on social media in which Trump announced her nomination, the president said she did a “fantastic job” as State Department spokesperson. Bruce will need to be confirmed for the role by the US Senate, where Trump’s Republican Party holds a majority.\n\nDuring press briefings, she has defended the Trump administration’s foreign policy decisions ranging from an immigration crackdown and visa revocations to US responses to the Russia-Ukraine war and Israel’s military onslaught on Gaza, including a widely condemned armed private aid operation in the Palestinian territory.\n\nBruce was previously a political contributor and commentator on Fox News for over 20 years.\n\nShe has also authored books like Fear Itself: Exposing the Left’s Mind-Killing Agenda, which criticised liberals and left-leaning viewpoints.\n\nIn a post after Trump’s announcement, Bruce thanked him and suggested that the role was a “few weeks” away. Neither Trump nor Bruce mentioned an exact timeline in their online posts.\n\n“Now I’m blessed that in the next few weeks my commitment to advancing America First leadership and values continues on the global stage in this new post,” Bruce wrote on X.\n\nTrump has picked former White House national security adviser Mike Waltz to be his UN envoy. Waltz’s Senate confirmation for that role, wherein he will be Bruce’s boss, is still due.\n\nWaltz was Trump’s national security adviser until he was ousted on May 1 after he was caught up in a March scandal involving a Signal chat among top Trump national security aides on military strikes in Yemen. Trump then nominated Waltz as his UN ambassador.\n\nAmbassador Dorothy Shea, who had served as the US deputy ambassador to the UN in 2024, is the acting US envoy currently.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/101253098cd0e05.jpg",
  "retrievedAt": "2025-08-16T07:22:43.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929955/trump-nominates-state-dept-spokeswoman-bruce-as-us-deputy-representative-to-un",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T07:53:18.000Z"
}
