{
  "title": "Iraq toughens stance against pro-Iran faction - World - DAWN.COM",
  "author": null,
  "content": "BAGHDAD: The Iraqi government toughened its position towards pro-Iran faction the Hezbollah Brigades on Saturday, announcing some members would be tried over a recent deadly clash and others had been stripped of their commands.\n\nThe decision follows an attack on a government office in south Baghdad late last month that killed three people, including a policeman, and which the authorities blamed on the group.\n\nLike other armed groups trained by Iran during the war against the militant Islamic State group, the Hezbollah Brigades were integrated into the regular security forces as part of the Hashed al-Shaabi (Popular Mobilisation) force. However, the faction has developed a reputation for sometimes acting on its own.\n\nIraq’s Joint Operations Command previously said that more than a dozen suspects were detained over the July 27 attack on an agriculture ministry office, which was prompted by the sacking of the director.\n\nSaturday’s government statement said the suspects were “fighters belonging to Hezbollah Brigades and affiliated to Regiments 45 and 46 of the Hashed al-Shaabi”.\n\nIt charged that the attack on the ministry’s office had been led by the former director.\n\n“In addition to being implicated in several cases of corruption”, the suspected ringleader stood accused of “falsifying official documents, certificates and contracts so that farmland could be confiscated from its legitimate owners”, the statement said.\n\nThe government said it regretted “command and control failings within the Hashed al-Shaabi” and condemned the “presence of armed factions which do not respect military rules and procedures”.\n\nThe authorities announced the “dismissal of the commanders of Regiments 45 and 46” and the prosecution of “everybody implicated” in the case.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2023/03/200840010f87c49.png?r=084106",
  "retrievedAt": "2025-08-16T07:23:51.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929850/iraq-toughens-stance-against-pro-iran-faction",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:41.000Z"
}
