{
  "title": "Saudi crown prince invites Shehbaz to investment conference - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Saudi Crown Prince Mohammed bin Salman has invited Prime Minister Shehbaz Sharif to the Future Inve­stment Initiative Conf­erence to be hosted by Riyadh in October.\n\nAccording to PM Office, Ambassador of the King­dom of Saudi Arabia Naw­af bin Said Al-Malky on Saturday called on Prime Minister Shehbaz and handed over a signed invitation letter from Crown Prince Mohammed bin Salman bin Abdul Aziz Al Saud to participate in the 9th Future Investment Initi­a­tives Forum to be held from Oct 27 to 30.\n\nWhile accepting the gracious invitation exten­ded to him, the prime minister conveyed his warm greetings and respectful regards for the custodian of the two holy mosques on King Salman bin Abdul Aziz Al Saud, as well as to Crown Prince Mohammed bin Salman.\n\nRecent regional developments were also discussed during the warm and cordial meeting.\n\nEarlier, the PM said Pakistan welcomed the historic peace agreement signed between Azer­bai­jan and Armenia at the White House un­der the auspices of US President Trump.\n\n“This landmark development marks the dawn of a new era of peace, stability, and cooperation in the South Caucasus, a region that has endured decades of conflict and human sufferings. We congratulate President Ilham Aliyev and the people of Azerbaijan on this historic agreement that reflects wisdom, foresight and sagacity in charting a course for a peaceful future for their region,” the PM posted on X account.\n\nHe said Pakistan had always stood by the brotherly nation of Azerbaijan, and stood with them at this proud moment of their history.\n\n“We also appreciate the facilitation role of the United States, under President Donald Trump, in bringing the two sides together and securing an agreement that opens new avenues for trade, connectivity, and regional integration. It is our hope that this spirit of dialogue will serve as an example for other regions facing protracted conflicts,” he said.\n\nSeparately, the prime minister in a meeting with the National Party head said progress and prosperity of Balochistan and its people was among the top priorities of the federal government.\n\nDuring an interaction with NP President Dr Abdul Malik Baloch, who called on him, the PM said the government was committed to the provision of opportunities for education and livelihoods to the youth. Dr Baloch thanked the premier for the efforts towards progress and prosperity of the province. Adviser to the PM Dr Touqeer Shah was also present on the occasion.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/6897d13d6ca05.jpg",
  "retrievedAt": "2025-08-16T07:24:33.354Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929874/saudi-crown-prince-invites-shehbaz-to-investment-conference",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:16.000Z"
}
