{
  "title": "Two more die as rain lashes Punjab; Indus in low-level flood - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Two more people died on Saturday, taking the death toll due to monsoon rainfall in Punjab to 166, as another spell of torrential monsoon lashed several cities in Punjab. The deaths were reported in Sialkot and Jhelum, with the former receiving 78 millimetres of rain — the highest in the province.\n\nAccording to the Pakistan Meteorologi-cal Department (PMD), Sialkot City received 78mm of rain, Lahore 43.4mm, Gujranwala 36.8mm, Chakwal 23mm, Attock 13.6mm, Mangla 12.2mm, Gujrat 10.6mm, Narowal 5.0mm, Rawalakot 4.0mm, Islamabad Airport 3.9mm, and Mandi Bahauddin 0.5mm.\n\nThe Met Department said mainly hot and humid weather was expected in most parts of Punjab, but rain-wind/thundershower was expected at isolated places in northeastern Punjab, Potohar, Islamabad, upper Khyber Pakhtunkhwa, Kashmir, and adjoining hilly areas on Sunday.\n\nAccording to provincial figures issued on Aug 8, 164 people have died and 82 have sustained injuries during the ongoing monsoon season that has also killed 121 head of cattle. About 216 houses were also destroyed across the province.\n\nSialkot receives 78mm rainfall, the highest in the province\n\nIn Lahore, the rain started at 1:30pm and continued till 4:30pm. According to the Water and Sanitation Authority (Wasa), 86mm rain was reported at Pani Wala Talab, 85mm at Farrukhabad, 83mm at Lakshmi Chowk, 81mm at Nishtar Town, 60mm at Gulberg, 57mm at Chowk Nakhuda, 45mm at Iqbal Town, 44mm at Johar Town, 43mm at Samanabad and less than 30mm at Gulshan-i-Ravi, Qurtaba Chowk, Jail Road, and Tajpura.\n\nDue to rain, water accumulated in Model Town, Kot Lakhpat, Peco Road, Township, Green Town, Factory Area, Muslim Town, Garden Town and adjacent localities. The water was also accumulated in Nishtar Park Sports Complex, which caused the cancellation of ‘Independence Family Fun Race’, which was planned in the evening. The rain also caused electricity problems in the city as more than 120 feeders in different areas had tripped.\n\nMeanwhile, the Provincial Disaster Management Authority (PDMA) issued a warning about low-level flooding in rivers in the province. According to the latest update, Tarbela Dam is currently 96 per cent full with its water level standing at 1546.00 feet, while Mangla Dam is 63pc full at 1205.25 feet.\n\nOn the Indus River, low-level flooding has been reported at Chashma Barrage, while flows at other key barrages — including Tarbela, Kalabagh, Taunsa, Guddu, Sukkur, and Kotri remain normal. Similarly, the Jhelum, Sutlej, and Kabul Rivers are flowing at expected levels without any immediate threat.\n\nThe Chenab River and its adjoining streams are also stable, with no unusual rise in water levels. However, the Ravi River is experiencing low-level flooding in the Basantar Nullah, though the main river’s flow remains normal.\n\nMeanwhile, the hill torrents in Koh-i-Suleman and Dera Ghazi Khan Division are currently dry, posing no flood risk. With the monsoon season in full swing, the director general of the Punjab PDMA advised citizens to exercise extreme caution, especially near water bodies.\n\nSection 144 has been imposed along rivers, canals, and streams to prevent accidents, and people have been strictly warned against swimming or bathing in these areas. Authorities have assured the public that all necessary measures are in place to handle any emergency, but residents in low-lying areas should stay alert for further updates.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/051042440387215.jpg?r=104253",
  "retrievedAt": "2025-08-16T07:24:13.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929866/two-more-die-as-rain-lashes-punjab-indus-in-low-level-flood",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:32.000Z"
}
