{
  "title": "Iran offers incentives for joint ventures in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Iranian Consul General in Quetta Ali Reza Rajaei and President of the Zahidan Chamber of Commerce and Industry Abdul Hakim Regi have invited Balochistan’s industrialists and business community to launch joint ventures with Iranian investors in Mirjaveh Free Zone.\n\nThey said that the Iranian government will extend all facilities and incentives for starting joint ventures with Iranian entrepreneurs and investors.\n\nThey extended the offer during a meeting with business leaders and representatives of the Quetta Chamber of Commerce and Industry, the Small Chamber of Commerce and Small Industries and the Pak-Iran Chamber of Commerce in Quetta on Saturday.\n\nThe Iranian officials emphasised that achieving the $10 billion bilateral trade target between Pakistan and Iran depends on cooperation. They also congratulated Balochistan’s business community on the resumption of Quetta-Zahedan flight services via Mashhad.\n\nThe Iranian envoy and members of the delegation expressed satisfaction over recent agreements signed between Pakistani and Iranian officials in Islamabad, including plans to expand bilateral trade to $10bn.\n\nThey noted that while official agreements are encouraging, their implementation will not be possible without the cooperation of chambers of commerce and the business community. They stressed that Pakistan, Iran and Afghanistan may have different geographies but share common economic interests and trade barriers must be removed collectively.\n\nThe delegation agreed to the proposal for forming a transport issue resolution committee and encouraged private-sector initiatives to further enhance bilateral trade.\n\nEarlier, Quetta Chamber President Haji Muhammad Ayub Mariani and Vice President Engineer Mir Wais Khan Kakar highlighted the chamber’s long-standing efforts to promote and strengthen brotherly trade ties with neighbouring countries.\n\nThey stressed the need to resolve transport issues and reduce tariffs on imports from each other to boost bilateral trade. They also proposed forming a joint committee — comprising chamber representatives, NLC officials and transport ministry authorities from both countries — to address cross-border goods transport problems. According to them, resolving these issues would create dignified employment opportunities and improve living standards for people in both nations.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/688fe3ad45cd5.jpg",
  "retrievedAt": "2025-08-16T07:24:06.132Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929862/iran-offers-incentives-for-joint-ventures-in-balochistan",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:54:33.000Z"
}
