{
  "title": "NAB gets suspect’s custody in Kohistan corruption case - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: An accountability court here on Saturday granted physical remand of former bank manager Zahoor Ahmad to the National Accountability Bureau, Khyber Pakhtunkhwa, for nine days in a high-profile case involving the alleged embezzlement of Rs36 billion funds in the Upper Kohistan district accounts office.\n\nJudge Mohammad Hamid Mughal directed NAB officials to produce on Aug 18 the former manager, who is accused of receiving and laundering crime proceeds exceeding Rs1.086 through a construction firm which he had allegedly set up in the name of his brother.\n\nHe also allowed four-days physical remand of a senior auditor of the Accountant General’s Office, Radiullah, to the anti-graft body in the same case.\n\nThe auditor was produced before the court on completion of his physical custody.\n\nSenior NAB senior prosecutor Habibullah Baig had sought his further custody, saying investigation from him has yet not been completed.\n\nThe prosecutor submitted an application on behalf of deputy director Waqar Ahmad, who is investigation officer of the case, for getting the physical remand of suspect Zahoor Ahmad.\n\nHe said that on April 8, 2025, the NAB Khyber Pakhtunkhwa had received a “source report about a massive financial corruption” in Upper Kohistan district involving the illegal and misappropriation of over Rs36.63 billion from the contractors’ security deposit head of Account G-10113.\n\nThe prosecutor said that a network of government officials, bank personnel and private contractors were “implicated in a well-planned conspiracy, which exploited systematic vulnerabilities and violated the Accounting Policies and Procedures Manual (APP Manual).”\n\nHe said that suspect Zahoor Ahmad had served as branch manager at various branches of the National Bank of Pakistan, including Dasu branch in Upper Kohistan.\n\nThe prosecutor insisted that the investigation revealed that during his posting at Dasu, suspect Ahmad had actively colluded with co-accused officials of Upper Kohistan district accounts office and communication and works department, private contractors and others to facilitate the clearance of fraudulent treasury cheques and illicit withdrawal of government funds thereby enabling the embezzlement of billions of rupees from the public exchequer and its transfer into private accounts.\n\nHe added that the suspect in connivance with other co-accused registered a firm showing his brother Akhtar Amin as its proprietor in the name of firm AQ Construction and opened its multiple accounts in different commercial banks.\n\nThe prosecutor alleged that the suspect fraudulently received and deposited the illegal treasury cheques drawn from the public exchequer in the bank accounts of that company without executing any corresponding civil work.\n\nHe added that the suspect was summoned repeatedly during inquiry as well as investigation but he deliberately failed to do so and absconded.\n\nNine suspects have so far been arrested in the case. One of the prime suspects, Mohammad Ayub, a private contractor, has also submitted an application to the NAB for a plea bargain under the National Accountability Ordinance, 1999. His application has been under consideration with the bureau.\n\nThe accountability courts have so far confirmed several NAB orders to freeze dozens of moveable and immovable properties, including luxurious residences, commercial plazas and plots, expensive vehicles and cash, including foreign currency.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/2710340360d59e9.jpg?r=103426",
  "retrievedAt": "2025-08-16T07:23:25.013Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929800/nab-gets-suspects-custody-in-kohistan-corruption-case",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T01:55:55.000Z"
}
