{
  "title": "Equities clinch yet another milestone in bullish week - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistani stock market showed impressive growth this week, with the KSE-100 index rising by 3.08 per cent on a week-on-week basis. This upward trend was largely driven by strong buying activity from local mutual funds, as investors turned to equities, which continue to outperform other asset classes.\n\nThe rally in the stock market coincided with a series of significant developments in the economy. Key among these was the widening of Pakistan’s trade deficit, which surged 44pc year-on-year to $2.8bn for July 2025. On the positive side, workers’ remittances reached an all-time high for July, amounting to $3.2bn, up 7pc compared to the same month last year.\n\nThe government raised Rs370bn in a T-Bill auction held this week, with yields increasing by 5-30 basis points across all tenors. This came on the back of Pakistan’s improving fiscal position, with the Ministry of Finance reporting that the fiscal deficit had narrowed to Rs6.2trn, or 5.4pc of GDP, compared to 6.8pc in FY24. This reduction was driven by a solid growth in tax and non-tax revenues, which outpaced the rise in government expenditures.\n\nSector-specific developments were also notable. Cement dispatches surged by 30.1pc in July 2025, driven by strong demand in both the domestic market and from exports. Additionally, petroleum sales rose by 2pc year-on-year, totalling 1.22m tons in July, helped by lower prices of motor spirit (MS) and high-speed diesel (HSD).\n\nIndex soars 3pc amid strong institutional buying and positive earnings outlook\n\nMarket activity was robust, with average daily traded volume increasing by 16.3pc to 653m shares, up from 561m shares in the previous week. The KSE-100 index closed at 145,383 points, up 4,348 points or 3.1pc from the previous week. This marks the highest closing for the index since its inception, reflecting strong investor confidence. A key driver of this optimism was the ongoing earnings season, with local institutions and mutual funds showing strong buying interest.\n\nIn terms of currency performance, the Pakistani rupee appreciated slightly by 0.1pc week-on-week, closing at Rs282.47 against the US dollar. However, the State Bank of Pakistan’s foreign exchange reserves fell by $72m, bringing the total to $14.23bn by August 8, 2025.\n\nLooking ahead, analysts from Arif Habib Ltd (AHL) and AKD Securities Ltd are optimistic about the market’s short-term outlook. The KSE-100 index is expected to maintain its positive trajectory, buoyed by strong earnings in the corporate sector and the ongoing resolution of the circular debt issue. AHL forecasts a continued bullish trend in the market, with the KSE-100 projected to reach 165,215 points by December 2025, supported by favourable developments in the fertiliser, banking, and energy sectors.\n\nThe sector-wise performance this week showed strength in textiles, insurance, and food & personal care, while sectors such as Synthetic & Rayon and Sugar & Allied Industries lagged. The week also saw significant changes in the MSCI Index, with FABL being added to the FM Standard Index and several other stocks seeing changes in their index categorisation.\n\nIn conclusion, despite the widening trade deficit and slight dip in foreign exchange reserves, the outlook for the stock market remains positive, driven by solid domestic corporate earnings, a stabilising macroeconomic environment, and ongoing institutional support.\n\nPublished in Dawn, August 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/071513161f99a9b.jpg?r=152333",
  "retrievedAt": "2025-08-16T07:23:17.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929885/equities-clinch-yet-another-milestone-in-bullish-week",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T02:25:02.000Z"
}
