{
  "title": "Mastung blast derails 6 bogies as Jaffar Express targeted 2nd time in a week - Pakistan - DAWN.COM",
  "author": null,
  "content": "No loss of life was reported after a bomb blast on a railway track in Balochistan’s Mastung district derailed six bogies of the Jaffar Express, an official said on Sunday.\n\nWith a rise in terrorist attacks over the past few years, Balochistan has seen a series of incidents where militants blow up train tracks, targeting the province’s transport infrastructure.\n\nMuhammad Kashif, public relations officer of the Pakistan Railways’ Quetta division, told Dawn.com: “A bomb attached to the railway track exploded loudly, derailing six bogies of the train. Fortunately, there was no loss of life.”\n\nThe incident occurred near the Spezand station in Mastung’s Dasht tehsil, when the train was heading from Quetta to Peshawar City station with 350 passengers on board.\n\n“Security forces and rescue teams rushed to the site as soon as they were alerted about the incident, and began a search operation after cordoning off the area,” Kashif said.\n\n“Four bogies of the Jaffar Express had been placed back on the track, while efforts were underway to restore the other two,” the official noted.\n\nA relief train of the Pakistan Railways brought the 350 passengers back to Quetta, while bogies stuck on the track will be returned to the city as well, according to a later statement from Kashif, who said that all tickets will be refunded.\n\nIn a separate statement, Kashif said the services of the Jaffar Express and Bolan Mail were suspended till August 14.\n\nThe Bolan Mail will resume its operations on August 16 (Saturday), when it will depart from Karachi “in its proper turn” and will arrive in Quetta the next day, he added.\n\nToday’s incident comes just three days after Quetta-bound Jaffar Express narrowly escaped a disaster in Balochistan’s Sibi, where a bomb planted near the track exploded just after the passenger train passed.\n\nIn another near-miss incident on July 24, a powerful explosion ripped through the Quetta-Sibi rail section, damaging a bogie of the Bolan Mail.\n\nA July 28 derailment of the Jaffar Express train in Sindh’s Sukkur was initially attributed to an explosion — even by government-run media — but the Ministry of Railways later said a technical fault was the cause.\n\nIn June, a powerful explosion of a remotely controlled explosive device fitted to rail tracks caused four bogies of the Jaffer Express to derail in Jacobabad. No one was hurt in the incident.\n\nIn April, the 3UP train heading from Karachi to Quetta was stopped at Jacobabad railway station due to security reasons.\n\nTrain services betw­een Quetta and the rest of the country were restored on March 27, after they were suspended due to the unprecedented hijacking of the Pesha­war-bound Jaffar Express earlier that month.\n\nThe train, travelling from Quetta to Peshawar and carrying 440 passengers, was hijacked near Balochistan’s Sibi area on March 11, resulting in the deaths of 21 passengers and four security personnel. “All 33 terrorists” were neutralised during the two-day clearance operation, the military said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:22:21.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929989/mastung-blast-derails-6-bogies-as-jaffar-express-targeted-2nd-time-in-a-week",
  "dateList": "2025-08-10",
  "date_published": "2025-08-10T12:50:13.000Z"
}
