{
  "title": "Citizens of OIC member states with extraordinary scientific contributions can apply for awards",
  "link": "https://www.app.com.pk/national/citizens-of-oic-member-states-with-extraordinary-scientific-contributions-can-apply-for-awards/",
  "date_published": "2023-03-27T11:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): The citizens of OIC member states having extraordinary scientific contributions can apply for the awards announced by the COMSTECH (OIC Standing Committee on Scientific and Technological Cooperation) in various categories, till March 31.\nAccording to an official source, COMSTECH bestows biennial awards to distinguished researchers of OIC member states for their important scientific contributions. The citizens of all 57 OIC states are eligible to apply for the COMSTECH Awards.\nThe COMSTECH lifetime achievement awards in basic sciences are given in the fields of Biology, Chemistry, Physics and Mathematics. This year’s nominations are sought for awards in the fields of Physics and Mathematics. In this category, each award consists of a certificate, a shield of honour, and a cash prize of US$ 8000.\nThe COMSTECH Awards for Excellence in Science and Technology are classified into four categories among which three categories include COMSTECH Young Researcher Award (under 40 years), Best Scientific Book (Authorship) – published by an international publisher during the last two years (2021 and 2022), and Patent – the patent must have been registered during the past five years (2018-2022).\nEach of the above three awards carries a certificate, shield of honour and a cash prize of US $ 4000.\nWhereas, under the fourth category, the Best Research Paper awards are given for the best paper published in an impact factor international journal during the last two years (2021 and 2022) in the fields of Biology, Chemistry, Mathematics, and Physics.\nThe best research paper award in each discipline carries a certificate, a shield of honour, and a cash prize of US$ 2500.",
  "retrievedAt": "2025-08-11T08:08:04.088Z"
}
