{
  "title": "133 new corona cases reported in last 24 hours: NIH",
  "link": "https://www.app.com.pk/national/133-new-corona-cases-reported-in-last-24-hours-nih/",
  "date_published": "2023-03-27T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): Health officials on Monday said that 133 new Coronavirus cases were reported during the last 24 hours across the country.\nAs per the data shared by the National Institute of Health (NIH) on Monday, the case positivity ratio was 2.66 percent while 21 patients were in critical condition.\nNo death was reported from the Coronavirus in the last 24 hours while 5,007 Covid-19 tests were conducted.\nAs many as 559 tests were conducted in Lahore out of which, 41 cases were confirmed with a ratio of 7.69 percent, while 120 tests were conducted in Islamabad out of which seven cases were reported confirmed with a ratio of 5.83 percent. 39 cases were confirmed from 507 tests in Karachi with a ratio of 7.69 percent.\nMeanwhile, Minister for National Health Services, Regulations, and Coordination Abdul Qadir Patel said the government has strengthened the role of Border and Health Services in Pakistan to deal with any sub-variant of Covid-19.\nThe minister said there was a surveillance system at all entry points of the country including airports. There will be rapid tests and screening of passengers at all airports, he added.\nHe added 90 percent of the country’s population already got the Covid-19 vaccine.\n“An efficient system with a proper management team is fully functional in the country to remain vigilant and is ready to make an emergency plan to deal with any sub-variant of Covid-19,” the minister added.\nHe said the Border and Health Services Pakistan was ensuring the implementation of international health regulations.\nHe said that in case of any untoward situation, the health system was fully prepared to deal with any sub-variant of the Omicron variant of Covid-19 including BF.7 in the country.",
  "retrievedAt": "2025-08-11T08:07:47.146Z"
}
