{
  "title": "Govt to announce special incentives for farmers in upcoming budget: Bilawal",
  "link": "https://www.app.com.pk/national/govt-to-announce-special-incentives-for-farmers-in-upcoming-budget-bilawal/",
  "date_published": "2024-05-15T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): Chairman Pakistan People’s Party (PPP) Bilawal Bhutto Zardari on Wednesday demanded the federal government to announce special incentives for farmers in the upcoming budget and provide direct relief to small farmers by subsidizing the agriculture sector.\nSpeaking here in National Assembly, Bilawal Bhutto emphasized the provision of subsidies to small farmers and landlords through the implementation of a “Kisan Card” system.\nHe highlighted that Pakistan’s annual import of agricultural goods exceeds Rs. 10 billion and stressed the importance of facilitating small farmers to minimize this dependency.\nHe demanded the government to engage all stakeholders, including farmers’ organizations, and proposed the declaration of a 10-year emergency along with the implementation of consistent agricultural policies.\nHe emphasized that such measures would significantly contribute to the country’s development.\nHe underscored the necessity for the government to restore the confidence of wheat-growing farmers by announcing support measures. This, he emphasized, is essential to ensure there is no shortage of wheat in the coming year.\nBilawal Bhutto urged the government to take decisive action to resolve the wheat import controversy and hold accountable those responsible during interim set-up in the wheat import scandal. He stressed that the Prime Minister should identify the bureaucrats and former ministers involved in the scandal and take prompt action against them without any further delay.\nHe emphasized that all major parties have consistently recognized agriculture as the backbone of the country in their manifestos.\nBilawal Bhutto pointed out that the funds involved in the scandal were derived from the tax contributions of the people of Pakistan, and those responsible for misusing them should be held accountable.\nHe highlighted that as a result of this scandal, wheat procurement by provinces and the government has decreased, adversely affecting farmers’ ability to obtain fair rates for their produce.\nThis loss to farmers and economy were a result of decisions made by incapable and inefficient individuals, and they must be held accountable.\nBilawal Bhutto emphasized that it is not the fault of the farmers, and the government should step in to assist them. He stressed the importance of recognizing Pakistan as an agricultural country and urged a renewed focus on agriculture as a means to earn and thrive.\nPPP Chairperson shared his views on the Presidential address to both Houses of Parliament on April 18, 2024.\nHe congratulated the assembly on this occasion, noting that it marked the 7th address by a civilian President.\nHe commended the President for focusing on national issues in the speech, avoiding personal or political matters.\nHe emphasized that as the representative of the federation, the President prioritized public concerns, emphasizing unity, reconciliation, and collective progress.\nHe remarked that President Mr. Asif Ali Zardari recognizes that the solution to Pakistan’s problems lies in dialogue among political forces.\nDuring the address, he highlighted that both the federal government and the opposition should work together to address public issues collectively.\nBilawal Bhutto Zardari advised the opposition to provide input in the upcoming budget, particularly during Pakistan’s current financial crisis.\nHe emphasized that despite drawing salaries, it is the responsibility of the opposition to actively participate as members of the House and contribute to the functioning of parliament.\nHe noted that the President delivered a brief speech covering both national and international policy issues, while the Opposition Leader’s opening speech was lengthy.\nHe suggested that it would have been more constructive if the Opposition Leader had used the opportunity to recommend alternatives to government policies and offer counter policies for consideration.\nDuring his address to Parliament, he remarked that the President effectively articulated Pakistan’s policy on Kashmir and Palestine, providing a clear narrative.\nHe criticized the opposition’s behavior, expressing dismay over their protests during the speech, which he believed sent the wrong message to the public and those witnessing the session..\nThe PPP Chairperson also highlighted the progress made in the health and education sectors in Sindh, urging other provinces, including Khyber Pakhtunkhwa, to emulate these efforts.\nHe emphasized that Sindh boasts quality health facilities in Karachi, Hyderabad, and Gambat (Khairpur), where a policy of free treatment is extended to all Pakistanis.\nHe extended an invitation to the KP government to visit these hospitals in Sindh and observe how quality healthcare can be provided to the underprivileged.\nRegarding education, Sindh addressed structural issues and advocated for the introduction of public-private partnerships rather than the privatization of educational institutions.\nHe mentioned various measures taken to enhance the quality of education, such as eliminating ghost teachers, implementing a biometric system, conducting training programs, and enforcing strict appointment criteria.\nHe also appreciated President Asif Ali Zardari and the government for promptly taking notice of and resolving the genuine issues faced by the people of Azad Jammu and Kashmir (AJK) through announcing a comprehensive package.\nPPP Chairman Bilawal Bhutto urged a party of opposition to avoid practicing double standards in the politics.\nBilawal Bhutto termed it as non-serious party and asserted that they refuse to apologize for the May 9 incident.\nHe said that no one should be permitted to commit terrorism, but the opposition leadership committed terrorism on May 9 by disrespecting the monuments of martyrs who sacrificed their lives for the country.\nHe characterized the events of May 9 as an attempted coup in the country, highlighting that when Mohtarma Benazir Bhutto was martyred, no martyr monuments were attacked.\nHe described the opposition members of a party as non-political and non-serious, lacking interest in the country’s politics. He claimed that their leader is crying in jail for release.\nBilawal Bhutto said that PPP is struggling to strengthen democratic institutions for three generations and this struggle for Pakistan would continue.",
  "retrievedAt": "2025-08-11T02:31:16.730Z"
}
