{
  "title": "Health activists proposed 26 percent increase on tobacco products",
  "link": "https://www.app.com.pk/national/health-activists-proposed-26-percent-increase-on-tobacco-products/",
  "date_published": "2024-05-15T10:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP):Society for the Protection of the Rights of the Child (SPARC), held a briefing session with journalists on Wednesday at local hotel in which it was shared that SPARC along with other organizations wrote a letter to Finance Ministry of Pakistan and demanded to increase taxation on cigarettes.\nIt was proposed that tobacco taxation needs to be increased by at least 26% in upcoming federal budget. Pakistan faces a significant challenge with widespread tobacco consumption, with over 31.9 million adults aged 15 years and above identified as current tobacco users, constituting nearly 19.7% of the adult population.\nSmoking-related illnesses claim over 160,000 lives annually, representing a substantial 1.6% of the nation’s GDP each year. However, in the fiscal year 2022-23, cigarette taxes covered only 16% of these expenses, marking a decline from 19.5% in 2019.\nDr Khalil Ahmad, program manager SPARC stated that, the affordability of cigarettes and the devastating toll of smoking on public health are indeed pressing concerns that demand urgent action. When cigarettes are inexpensive, it can encourage more people, especially the youth and those with limited financial means, to start smoking or to continue the habit despite the known health risks. The loss of innocent lives due to smoking-related illnesses is tragic and preventable. It underscores the importance of implementing effective tobacco control measures, including increased taxation on cigarettes, to make them less affordable and discourage consumption.\nFurthermore, comprehensive tobacco control strategies should encompass not only taxation but also measures such as public education campaigns, smoke-free policies and support for smoking cessation programs.\nMalik Imran Ahmad, Country Head Campaign for Tobacco-Free Kids (CTFK) said, that increasing tobacco taxes, as recommended by global health organizations like World Health Organization and the World Bank, can indeed be an effective measure to reduce consumption and generate revenue for healthcare.\nA 26.6% FED increase, as proposed for the fiscal year 2024-25, appears to be a significant step forward. Not only could it help recoup a substantial portion of healthcare costs, but it also has the potential to discourage hundreds of thousands of individuals from smoking.\nAdditionally, the projected revenue increase could be valuable for funding various public health initiatives and strengthening the national economy.\nIt’s concerning to see the extent of tobacco consumption in Pakistan and the associated health and economic burden it brings due to easy affordability of cigarettes. Organizations such as Human Development Foundation, Aurat Foundation and Chromatic Trust alongside SPARC have raised their concerns on this crucial public health issue.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:31:40.054Z"
}
