{
  "title": "Kabul visit - Newspaper - DAWN.COM",
  "author": null,
  "content": "CONSIDERING the generally poor state of Pak-Afghan relations, the recently concluded three-day visit of Pakistan’s special representative on Afghanistan to Kabul, and the subsequent comments made in this regard by the foreign minister, offer a chance for both states to work on improving ties.\n\nWhile commenting on Muhammad Sadiq’s visit, Foreign Minister and Deputy Prime Minister Ishaq Dar was quoted by the Foreign Office as saying that sustained dialogue with Afghanistan was essential.\n\nThe biggest obstacle standing in the way of better relations is the fact that Afghanistan has failed to act against anti-Pakistan terrorists based on its soil, including the banned TTP and Baloch separatists. Moreover, border disputes have severely strained relations, with the Torkham crossing closed for nearly a month. It has reopened temporarily until April 15.\n\nDuring his Kabul trip, Mr Sadiq met with the Afghan Taliban’s foreign and trade ministers, which indicates that the Afghan side may be serious about mending ties. It is a fact that transit and trade are of great importance for landlocked Afghanistan, and prolonged border closures and disputes have a debilitating effect on that country’s economy. Therefore, talks need to continue in order to address all irritants affecting relations.\n\nFor the Pakistani side, security is paramount, while for the Afghans, trade is crucial. Therefore, Islamabad should continue to emphasise that the presence of anti-Pakistan militants on Afghan soil stands in the way of normal commercial ties. The Afghan Taliban need to take action against these forces, or ensure that they are not in a position to harm Pakistan. The Taliban insist there is no militancy problem at their end, but facts suggest otherwise.\n\nIt is hoped that these parleys continue and both sides, particularly Kabul, commit to peace and amity. A nation cannot alter its geography, which is why Pakistan must maintain good relations with Afghanistan. In the recent past, ties have been marked by much bitterness, and both sides have exchanged fire at the border.\n\nThe fact is that Pakistan cannot afford a hostile regime in Afghanistan, as this has severe internal security implications for this country. For their part, the Taliban know that frosty ties with Pakistan will affect their commercial and trade interests, as well as their efforts to gain greater international recognition. Though it may sound transactional, Pakistan can indicate that unrestrained trade ties are contingent upon Kabul’s efforts to ensure no malign actors are able to target Pakistan from Afghan soil.\n\nA lasting agreement is also required to help resolve border disputes, as closures take a heavy humanitarian toll, and affect local businesses on both sides. Better bilateral ties are possible if both sides sustain dialogue, and if there is recognition of each other’s key demands, particularly Pakistan’s concerns about cross-border terrorism.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:27:46.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900412",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:15:51.000Z"
}
